{
  "ticker": "AVB",
  "cik": "0000915912",
  "company_name": "AVALONBAY COMMUNITIES INC",
  "filing_date": "2025-02-27",
  "accession": "0000915912-25-000005",
  "primary_doc": "avb-20241231.htm",
  "item_sections": {
    "item1": "Item 1. \"Business,\" we operate under four core brands: \nAvalon, AVA,\n e\naves by Avalon\n and \nKanso.\n We believe that this branding differentiation allows us to target our product offerings to multiple customer groups and submarkets within our existing geographic footprint.\nWe also have an extensive and ongoing maintenance program to continually maintain and enhance our communities and apartment homes. The aesthetic appeal of our communities, and a service-oriented property management team that is focused on the specific needs of residents, enhances market appeal. We believe our mission of \"Creating a Better Way to Live\" helps us achieve higher rental rates and occupancy levels while minimizing resident turnover and operating expenses.\n25 \nTable of Contents\nOur Current Communities are located in the following geographic markets:\n \nNumber of\ncommunities at\nNumber of\napartment homes at\nPercentage of total\napartment homes at\n \n1/31/2024\n1/31/2025\n1/31/2024\n1/31/2025\n1/31/2024\n1/31/2025\nNew England\n42\n \n39\n \n10,328\n \n9,697\n \n12.4\n \n%\n11.3\n \n%\nMetro NY/NJ\n49\n \n50\n \n14,756\n \n15,089\n \n17.6\n \n%\n17.5\n \n%\nNew York City, NY\n14 \n14 \n5,089 \n5,089 \n6.1 \n%\n5.9 \n%\nNew York Suburban\n13 \n14 \n3,878 \n4,216 \n4.6 \n%\n4.9 \n%\nNew Jersey \n22 \n22 \n5,789 \n5,784 \n6.9 \n%\n6.7 \n%\nMid-Atlantic\n44\n \n44\n \n15,501\n \n15,501\n \n18.5\n \n%\n18.0\n \n%\nWashington Metro\n36 \n35 \n12,784 \n12,347 \n15.3 \n%\n14.3 \n%\nBaltimore, MD\n8 \n9 \n2,717 \n3,154 \n3.2 \n%\n3.7 \n%\nSoutheast Florida\n8\n \n9\n \n2,837\n \n3,091\n \n3.4\n \n%\n3.6\n \n%\nDenver, Colorado\n6\n \n8\n \n1,539\n \n2,192\n \n1.8\n \n%\n2.5\n \n%\nPacific Northwest\n21\n \n21\n \n5,802\n \n6,118\n \n6.9\n \n%\n7.1\n \n%\nNorthern California\n41\n \n41\n \n12,446\n \n12,857\n \n14.9\n \n%\n14.9\n \n%\nSan Jose, CA\n12 \n12 \n4,723 \n4,727 \n5.7 \n%\n5.5 \n%\nOakland-East Bay, CA\n15 \n15 \n4,338 \n4,743 \n5.2 \n%\n5.5 \n%\nSan Francisco, CA\n14 \n14 \n3,385 \n3,387 \n4.0 \n%\n3.9 \n%\nSouthern California\n59\n \n60\n \n17,934\n \n18,366\n \n21.4\n \n%\n21.4\n \n%\nLos Angeles, CA\n39 \n39 \n12,143 \n12,475 \n14.5 \n%\n14.5 \n%\nOrange County, CA\n13 \n13 \n4,024 \n4,024 \n4.8 \n%\n4.7 \n%\nSan Diego, CA\n7 \n8 \n1,767 \n1,867 \n2.1 \n%\n2.2 \n%\nOther Expansion Regions\n9\n \n12\n \n2,512\n \n3,200\n \n3.1\n \n%\n3.7\n \n%\nNorth Carolina\n5 \n6 \n963 \n1,225 \n1.2 \n%\n1.4 \n%\nTexas\n4 \n6 \n1,549 \n1,975 \n1.9 \n%\n2.3 \n%\n279 \n284 \n83,655 \n86,111 \n100.0 \n%\n100.0 \n%\nWe manage and operate substantially all of our Current Communities. During the year ended December 31, 2024, we completed construction of nine communities containing 2,981 apartment homes, acquired six communities containing 1,441 apartment homes and sold eight operating communities containing 1,532 apartment homes.\nOf the Current Communities, as of January 31, 2025, we owned (directly or through wholly-owned subsidiaries):\n•\n275 operating communities, including 268 with a full fee simple or absolute ownership interest, and seven that are on land subject to a land lease. The land leases have various expiration dates from July 2046 to May 2123, and three of the land leases are used to support tax advantaged structures that ultimately allow us to purchase the land upon lease expiration. The Company has purchase options for all land leases expiring prior to 2062.\n•\nA membership interest in five limited liability companies. One of the ventures, the NYTA MF Investors LLC, through subsidiaries owns a fee simple interest in three operating communities and a leasehold interest in two additional operating communities. The other four ventures each hold a fee simple interest in an operating community.\nIn addition to our Current Communities, we also hold, directly or through wholly-owned subsidiaries, a full fee simple ownership interest in our wholly-owned Development Communities.\n26 \nTable of Contents\nAs part of the Archstone Acquisition in 2013 (as defined in Item 1. \"Business\" in the Company's Form 10-K filed with the SEC on February 22, 2019), we acquired, and still own, 14 assets that had previously been contributed by third parties on a tax-deferred basis to an Archstone partnership in which the third parties received ownership interests. To protect the tax-deferred nature of the contribution, the third parties are entitled to cash payments if we trigger tax obligations to the third parties by selling, or failing to maintain sufficient levels of secured financing on, the contributed assets. Our tax protection payment obligations with respect to these assets don’t expire until the death of a third party who contributed ownership interests to the Archstone partnership. After review and investigation of Archstone’s tax and accounting records, we estimate that, had we sold or taken other triggering actions in 2024 with respect to all 14 assets, the aggregate amount of the tax protection payments that would have been triggered would have been approximately $43,815,000. At the present time, we do not intend to take actions that would cause us to be required to make tax protection payments with respect to any of these assets.\nDevelopment Communities\nAs of December 31, 2024, we owned or held a direct interest in 17 Development Communities under construction. We expect these Development Communities, when completed, to add a total of 6,004 apartment homes and 59,000 square feet of commercial space to our portfolio for a total capitalized cost, including land acquisition costs, of approximately $2,253,000,000. We cannot assure you that we will meet our schedule for construction completion or that we will meet our budgeted costs, either individually, or in the aggregate. You should carefully review",
    "item1a": "Item 1A. \"Risk Factors\" in this Form 10-K.\n53 \nTable of Contents\nITEM 7A.    QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nWe are exposed to market risks from our financial instruments primarily from changes in market interest rates. Our financial instruments do not expose us to significant risk from foreign currency exchange rates or commodity or equity prices. We monitor interest rate risk as an integral part of our overall risk management, which recognizes the unpredictability of financial markets and seeks to reduce the potentially adverse effect on our results of operations. Our operating results are affected by changes in interest rates, primarily in short-term SOFR and the SIFMA index as a result of borrowings under our Credit Facility and Commercial Paper Program, outstanding bonds and unsecured notes with variable interest rates. In addition, the fair value of our fixed rate unsecured and secured notes are impacted by changes in market interest rates.\nWe currently use interest rate protection agreements in the form of interest rate cap agreements for our risk management objectives, as well as for compliance with the requirements of certain lenders, and not for trading or speculative purposes. In addition, we may use interest rate swap agreements for our risk management objectives. During the year ended December 31, 2024, in connection with the issuance of our $400,000,000 unsecured notes in May 2024 maturing in 2034, we terminated $250,000,000 of forward interest rate swap agreements designated as cash flow hedges of the interest rate variability on the issuance of unsecured notes, receiving payments of $16,839,000 which will be recognized over the life of the unsecured notes as a reduction in the effective interest rate.\n \nIn addition, we have interest rate caps that serve to effectively limit the amount of interest rate expense we would incur on our outstanding floating rate borrowings. Further discussion of the financial instruments impacted and our exposure is presented below.\nAs of December 31, 2024 and 2023, we had $400,950,000 and $410,150,000, respectively, in variable rate debt outstanding, with no amounts outstanding under our Credit Facility or Commercial Paper Program. If interest rates on the variable rate debt had been 100 basis points higher throughout 2024 and 2023, our annual interest incurred would have increased by approximately $4,102,000 and $5,428,000, respectively, based on balances outstanding during the applicable years.\nBecause the counterparties providing the interest rate cap and swap agreements are major financial institutions which have an A or better credit rating by the Standard & Poor's Ratings Group or equivalent, we do not believe there is exposure at this time to a default by a counterparty provider.\nIn addition, changes in interest rates affect the fair value of our fixed rate debt, computed using quoted market prices for our unsecured notes or a discounted cash flow model for our secured notes, considering our current market yields, which impacts the fair value of our aggregate indebtedness. As of December 31, 2024, we had outstanding debt of $8,134,429,000 with an estimated aggregate fair value of $7,456,236,000 at December 31, 2024. Contractual fixed rate debt represented $7,104,942,000 of the fair value at December 31, 2024. If interest rates had been 100 basis points higher as of December 31, 2024, the fair value of this fixed rate debt would have decreased by approximately $403,558,000.\nITEM 8.    FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe response to this Item 8 is included as a separate section of this Annual Report on Form 10-K. See Item 15.\n54 \nTable of Contents\nITEM 9.    CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.\nITEM 9A.    CONTROLS AND PROCEDURES\n(a)\nEvaluation of Disclosure Controls and Procedures. As required by Rule 13a-15 under the Exchange Act, as of the end of the period covered by this report, the Company carried out an evaluation under the supervision and with the participation of the Company's management, including the Company's Chief Executive Officer and Chief Financial Officer, of the effectiveness of the design and operation of the Company's disclosure controls and procedures. Based upon that evaluation, the Chief Executive Officer and Chief Financial Officer concluded that the Company's disclosure controls and procedures are effective to ensure that information required to be disclosed by the Company in the reports it files or submits under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the SEC's rules and forms. We continue to review and document our disclosure controls and procedures, including our internal controls and procedures for financial reporting, and may from time to time make changes aimed at enhancing their effectiveness and to ensure that our systems evolve with our business.\n(b)\nManagement's Report on Internal Control Over Financial Reporting. Our management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rules 13a-15(f) and 15d-15(f). Under the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting as of December 31, 2024 based on the framework in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission 2013 Framework (COSO). Based on that evaluation, our management concluded that our internal control over financial reporting was effective as of December 31, 2024.\nOur internal control over financial reporting as of December 31, 2024 has been audited by Ernst & Young LLP, an independent registered public accounting firm, as stated in their report which is included elsewhere herein.\n(c)\nThere were no changes to the internal control over financial reporting of the Company identified in connection with the Company’s evaluation referred to above that occurred during the fourth quarter of 2024 that have materially affected, or are reasonably likely to materially affect, the Company’s internal control over financial reporting.\nITEM 9B.    OTHER INFORMATION\nDuring the three months ended December 31, 2024, none of the Company's directors or officers (as defined in Rule 16a-1(f) of the Exchange Act) \nadopted\n, \nterminated\n or modified a Rule 10b5-1 trading arrangement or non-Rule 10b5-1 trading arrangement (as such terms are defined in Item 408 of Regulation S-K).\nITEM 9C.    DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\n55 \nTable of Contents\nPART III\nITEM 10.    DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information required by Item 10 pertaining to directors and executive officers of the Company and the Company's Code of Conduct and insider trading policies and procedures is incorporated herein by reference to the Company's Proxy Statement to be filed with the SEC within 120 days after the end of the year covered by this Form 10-K with respect to the Annual Meeting of Stockholders scheduled to be held on May 21, 2025.\nThe Company has \ninsider trading policies and procedures\n (the \"Insider Trading Policy\") that govern the purchase, sale and other dispositions of its securities by directors, officers, and employees, as well as by the Company itself. We believe these policies and procedures are reasonably designed to promote compliance with insider trading laws, rules and regulations and applicable listing standards. A copy of our Insider Trading Policy is filed as Exhibit 19.1 to this Form 10-K.\nITEM 11.    EXECUTIVE COMPENSATION\nThe information required by Item 11 pertaining to executive compensation is incorporated herein by reference to the Company's Proxy Statement to be filed with the SEC within 120 days after the end of the year covered by this Form 10-K with respect to the Annual Meeting of Stockholders scheduled to be held on May 21, 2025.\nITEM 12.    SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by Item 12 pertaining to security ownership of management and certain beneficial owners of the Company's common stock is incorporated herein by reference to the Company's Proxy Statement to be filed with the SEC within 120 days after the end of the year covered by this Form 10-K with respect to the Annual Meeting of Stockholders scheduled to be held on May 21, 2025, to the extent not set forth below.\nThe Company maintains the Second Amended and Restated 2009 Equity Incentive Plan (the \"Plan\") and the 1996 Non-Qualified Employee Stock Purchase Plan (the \"ESPP\"), pursuant to which common stock or other equity awards may be issued or granted to eligible persons.\nThe following table gives information about equity awards under the Plan and the ESPP as of December 31, 2024:\n \n(a)\n \n(b)\n \n(c)\nPlan category\nNumber of securities to\nbe issued upon exercise\nof outstanding options,\nwarrants and rights\n \nWeighted-average\nexercise price of\noutstanding options,\nwarrants and rights\n \nNumber of securities\nremaining available for\nfuture issuance under\nequity compensation plans\n(excluding securities\nreflected in column (a))\nEquity compensation plans approved by security holders (1)\n854,951 \n(2)\n$\n181.84 \n(3)\n4,957,465 \nEquity compensation plans not approved by security holders (4)\n— \n \nN/A\n \n550,002 \nTotal\n854,951 \n \n$\n181.84 \n(3)\n5,507,467 \n_________________________________\n(1)     Consists of the Plan.\n(2)     Includes 83,843 deferred restricted stock units granted under the Plan, which, subject to vesting requirements, will convert in the future to common stock on a one-for-one basis. Also includes the maximum number of shares that may be issued upon settlement of outstanding Performance Awards awarded to officers and maturing on December 31, 2024, 2025 and 2026. Does not include 182,382 shares of restricted stock that are outstanding and that are already reflected in the Company's outstanding shares.\n(3)     Excludes performance awards and deferred units granted under the Plan, which, subject to vesting requirements, will convert in the future to common stock on a one-for-one basis.\n(4)     Consists of the ESPP.\nThe ESPP, which was adopted by the Board of Directors on October 29, 1996, has not been approved by our shareholders. A further description of the ESPP appears in Note 9, \"Stock-Based Compensation Plans,\" of the Consolidated Financial Statements set forth in Item 8 of this report.\n56 \nTable of Contents\nITEM 13.    CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by Item 13 pertaining to certain relationships and related transactions is incorporated herein by reference to the Company's Proxy Statement to be filed with the SEC within 120 days after the end of the year covered by this Form 10-K with respect to the Annual Meeting of Stockholders to be held on May 21, 2025.\nITEM 14.    PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information required by Item 14 pertaining to the fees paid to and services provided by the Company's principal accountant is incorporated herein by reference to the Company's Proxy Statement to be filed with the SEC within 120 days after the end of the year covered by this Form 10-K with respect to the Annual Meeting of Stockholders to be held on May 21, 2025. Our independent public accounting firm is \nErnst & Young LLP\n, \nTysons, Virginia\n, PCAOB Auditor ID \n42\n.\n57 \nTable of Contents\nPART IV\nITEM 15.    EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n15(a)(1)\n \nFinancial Statements\n \nIndex to Financial Statements\n \nConsolidated Financial Statements and Financial Statement Schedule:\n \nReports of Independent Registered Public Accounting Firm\nF-\n1\nConsolidated Balance Sheets as of December 31, 2024 and 2023\nF-\n4\nConsolidated Statements of Comprehensive Income for the years ended December 31, 2024, 2023 and 2022\nF-\n5\nConsolidated Statements of Equity for the years ended December 31, 2024, 2023 and 2022\nF-\n6\nConsolidated Statements of Cash Flows for the years ended December 31, 2024, 2023 and 2022\nF-\n7\nNotes to Consolidated Financial Statements\nF-\n10\n15(a)(2)\n \nFinancial Statement Schedule\nSchedule III—Real Estate and Accumulated Depreciation\nF-\n39\nAll other schedules for which provision is made in the applicable accounting regulation of the Securities and Exchange Commission are not required under the related instructions or are inapplicable and therefore have been omitted.\n15(a)(3)\n \nExhibits\n \nThe exhibits listed on the accompanying Index to Exhibits are filed as a part of this report.\nITEM 16.    FORM 10-K SUMMARY\nNot Applicable.\n58 \nTable of Contents\nINDEX TO EXHIBITS\nExhibit No.\n \n \n \nDescription\n3(i).1\n \n—\n \nArticles of Amendment and Restatement of Articles of Incorporation of the Company, dated as of June 4, 1998. (Incorporated by reference to Exhibit 3(i).1 to Form 10-K of the Company filed March 1, 2007.)\n3(i).2\n \n—\n \nArticles of Amendment, dated as of October 2, 1998. (Incorporated by reference to Exhibit 3(i).2 to Form 10-K of the Company filed March 1, 2007.)\n3(i).3\n \n—\n \nArticles of Amendment, dated as of May 22, 2013. (Incorporated by reference to Exhibit 3(i).3 to Form 8-K of the Company filed May 22, 2013.)\n3(i).4\n—\nArticles of Amendment, dated as of May 14, 2020. (Incorporated by reference to Exhibit 3(i).4 to Form 8-K of the Company filed May 15, 2020.)\n3(i).5\n—\nComposite restatement of Articles of Amendment and Restatement of Articles of Incorporation of the Company, dated as of June 4, 1998, as amended by the Articles of Amendment, dated as of October 2, 1998, the Articles of Amendment, dated as of May 22, 2013, and the Articles of Amendment, dated as of May 14, 2020. (Incorporated by reference to Exhibit 3(i).5 to Form 10-Q of the Company filed November 3, 2023.)\n3(ii).1\n \n—\n \nAmended and Restated Bylaws of the Company, as adopted by the Board of Directors on October 30, 2023. (Incorporated by reference to Exhibit 3.1 to Form 8-K of the Company filed October 30, 2023.)\n4.1\n \n—\n \nIndenture for Senior Debt Securities, dated as of January 16, 1998, between the Company and State Street Bank and Trust Company, as Trustee. (Incorporated by reference to Exhibit 4.1 to Registration Statement on Form S-3 of the Company (File No. 333-139839), filed January 8, 2007.)\n4.2\n \n—\n \nAmended and Restated Third Supplemental Indenture, dated as of July 10, 2000 between the Company and State Street Bank and Trust Company, as Trustee. (Incorporated by reference to Exhibit 4.4 to Registration Statement on Form S-3 of the Company (File No. 333-139839), filed January 8, 2007.)\n4.3\n \n—\n \nFourth Supplemental Indenture, dated as of September 18, 2006, between the Company and U.S. Bank National Association as Trustee. (Incorporated by reference to Exhibit 4.5 to Registration Statement on Form S-3 of the Company (File No. 333-139839), filed January 8, 2007.)\n4.4\n__\nFifth Supplemental Indenture, dated as of November 21, 2014, between the Company and the Bank of New York Mellon, as Trustee.\n \n(Incorporated by reference to Exhibit 4.1 to Form 8-K of the Company filed November 21, 2014.)\n4.5\n—\nIndenture for Debt Securities, dated as of February 23, 2018, between the Company and The Bank of New York Mellon, as Trustee (Incorporated by reference to Exhibit 4.1 to Form 8-K of the Company filed September 15, 2021.)\n4.6\n—\nFirst Supplemental Indenture, dated as March 26, 2018, between the Company and the Bank of New York Mellon, as Trustee, (Incorporated by reference to Exhibit 4.8 to Form 10-Q of the Company filed May 4, 2018.)\n4.7\n—\nSecond Supplemental Indenture, dated as of May 29, 2018, between the Company and the Bank of New York Mellon, as Trustee, (Incorporated by reference to Exhibit 4.3 to Form 8-K of the Company, filed May 29, 2018.)\n4.8\n—\nIndenture for Debt Securities, dated as of February 23, 2024, between the Company and U.S. Bank Trust Company, National Association.  (Incorporated by reference to Exhibit 4.8 to Form 10-K of the Company filed February 23, 2024.)\n4.9\n—\nFirst Supplemental Indenture, dated as of May 14, 2024, between the Company and U.S. Bank Trust Company, National Association, including the form of 5.350% Senior Notes due 2034 (Incorporated by reference to Exhibit 4.2 to Form 8-K of the Company filed May 14, 2024.)\n4.10\n \n—\n \nDividend Reinvestment and Stock Purchase Plan of the Company. (Incorporated by reference to the prospectus contained in the Registration Statement on Form S-3DPOS of the Company (File No. 333-87063), filed February 23, 2018.)\n4.11\n—\nDescription of the Registrant's Securities Registered Pursuant to Section 12 of the Securities Exchange Act of 1934. (Incorporated by reference to Exhibit 4.10 to Form 10-K of the Company filed February 23, 2024.)\n59 \nTable of Contents\n4.12\n—\nForm of 2.050% Senior Notes due 2032 (Incorporated by reference to Exhibit 4.4 to Form 8-K of the Company filed September 15, 2021.)\n4.13\n—\nForm of 1.900% Senior Notes due 2028 (Incorporated by reference to Exhibit 4.4 to Form 8-K of the Company filed November 18, 2021.)\n4.14\n—\nForm of 5.000% Senior Notes due 2033 (Incorporated by reference to Exhibit 4.4 to Form 8-K of the Company filed December 7, 2022.)\n4.15\n—\nForm of 5.300% Senior Notes due 2033 (Incorporated by reference to Exhibit 4.4 to Form 8-K of the Company filed December 7, 2023.)\n10.1+\n—\nAvalonBay Communities, Inc. Second Amended and Restated 2009 Equity Incentive Plan, as restated to reflect the First Amendment, Second Amendment, Third Amendment and Fourth Amendment thereto. (Incorporated by reference to Exhibit 10.1 to Form 10-K of the Company filed February 24, 2023.)\n \n10.2+\n—\nForm of Stock Grant and Restricted Stock Agreement for use with officers and associates. (Filed herewith.) \n10.3+\n \n—\n \nForm of Incentive Stock Option/Non-Qualified Stock Option Agreement for use with officers and associates. (Filed herewith.)\n10.4+\n \n—\n \n2024 Amended and Restated Directors Deferred Compensation Program. (Incorporated by reference to Exhibit 10.4 to Form 10-K of the Company filed February 23, 2024.)\n10.5+\n \n—\n \nForm of Director Restricted Stock Agreement. (Incorporated by reference to Exhibit 10.5 to Form 8-K of the Company filed February 22, 2018.)\n10.6+\n \n—\n \nForm of Director Restricted Unit Agreement (deferred stock award) (2018). (Incorporated by reference to Exhibit 10.6 of Form 8-K of the Company filed February 22, 2018.)\n10.7+\n—\nForm of Director Restricted Stock Unit Agreement (2024). (Incorporated by reference to Exhibit 10.7 to Form 10-K of the Company filed February 23, 2024.)\n10.8+\n \n—\nForm of Agreement for Grant of Performance-Based Restricted Stock Units with attached Award Terms (subject to changes in the following: weightings; target, threshold and maximum levels of achievement; and metrics used). (Incorporated by reference to Exhibit 10.7 to Form 10-K of the Company filed February 24, 2023.)\n10.9+\n—\nForm of Indemnification Agreement between the Company and its Directors. (Filed herewith.)\n10.10+\n—\nThe Company's Officer Severance Plan, as amended and restated on February 25, 2021. (Incorporated by reference to Exhibit 10.2 to Form 10-Q of the Company filed May 5, 2021.)\n10.11\n \n—\n \nSixth Amended and Restated Revolving Loan Agreement, dated as of September 27, 2022, among the Company, as Borrower, Bank of America, N.A., as administrative agent, an issuing bank and a bank, JPMorgan Chase Bank, N.A., as an issuing bank, a bank and a syndication agent, Wells Fargo Bank, N.A., as an issuing bank, a bank and a syndication agent, the co-documentation agents named therein, JPMorgan Chase Bank, N.A., BofA Securities, Inc., and Wells Fargo Securities, LLC as joint bookrunners and joint lead arrangers, and the other bank parties signatory thereto. (Incorporated by reference to Exhibit 10.1 to Form 8-K of the Company filed September 29, 2022.)\n10.12+\n \n—\n \nAmended and Restated AvalonBay Communities, Inc. Deferred Compensation Plan, effective as of January 1, 2011. (Incorporated by reference to Exhibit 10.1 to Form 10-Q of the Company filed August 6, 2010.)\n10.13+\n \n—\nFirst Amendment to Amended and Restated AvalonBay Communities, Inc. Deferred Compensation Plan, effective as of November 7, 2011. (Incorporated by reference to Exhibit 10.28 to Form 10-K of the Company filed February 24, 2017.)\n60 \nTable of Contents\n10.14+\n—\nSecond Amendment to Amended and Restated AvalonBay Communities, Inc. Deferred Compensation Plan, effective as of November 15, 2012. (Incorporated by reference to Exhibit 10.29 to Form 10-K of the Company filed February 24, 2017.)\n10.15\n—\nArchstone Residual JV, LLC Limited Liability Company Agreement. (Incorporated by reference to Exhibit 10.3 to Form 8-K of the Company filed March 5, 2013.)\n10.16\n—\nArchstone Parallel Residual JV, LLC Limited Liability Company Agreement. (Incorporated by reference to Exhibit 10.4 to Form 8-K of the Company filed March 5, 2013.)\n10.17\n \n—\n \nArchstone Parallel Residual JV 2, LLC Limited Liability Company Agreement. (Incorporated by reference to Exhibit 10.5 to Form 8-K of the Company filed March 5, 2013.)\n10.18\n—\nLegacy Holdings JV, LLC Limited Liability Company Agreement. (Incorporated by reference to Exhibit 10.6 to Form 8-K of the Company filed March 5, 2013.)\n10.19+\n—\nEmployment Agreement between the Company and Benjamin W. Schall, dated as of December 4, 2020 (Incorporated by reference to Exhibit 10.1 to Form 8-K of the Company filed December 10, 2020.)\n10.20+\n—\nForm of Incentive Stock Option/Non-Qualified Stock Option Agreement for use with officers and associates for 2021 Supplemental Awards.  (Incorporated by reference to Exhibit 10.3 to Form 10-Q of the Company filed May \n5, 2021.)\n10.21+\n—\nForm of Agreement for Grant of Performance-Based Restricted Stock Units with attached Award Terms and noted variations for Mr. Naughton's 2022-2024 award (subject to changes in the following for future agreements: \nmetrics used; target, threshold and maximum levels of achievement for each metric; and weightings between the metrics). \n(Incorporated by reference to Exhibit 10.1 to Form 10-Q of the Company filed May 4, 2022.\n)\n19.1\n—\nAvalonBay Communities, Inc. Insider Trading Policy. (Filed herewith.)\n21.1\n \n—\n \nSchedule of Subsidiaries of the Company. (Filed herewith.)\n23.1\n \n—\n \nConsent of Ernst & Young LLP. (Filed herewith.)\n31.1\n \n—\n \nCertification pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (Chief Executive Officer). (Filed herewith.)\n31.2\n \n—\n \nCertification pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (Chief Financial Officer). (Filed herewith.)\n32\n \n—\n \nCertification pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 (Chief Executive Officer and Chief Financial Officer). (Furnished herewith.)\n97\n—\nAvalonBay Communities, Inc. Compensation Recovery Policy. (Incorporated by reference to Exhibit 97 to Form 10-K of the Company filed February 23, 2024.)\n101\n—\nFinancial materials from AvalonBay Communities, Inc.'s Annual Report on Form 10-K for the year ended December 31, 2024 formatted in Inline XBRL (Extensible Business Reporting Language) including: (i) the Consolidated Balance Sheets, (ii) the Consolidated Statements of Comprehensive Income, (iii) the Consolidated Statements of Equity, (iv) the Consolidated Statements of Cash Flows and (v) Notes to the Consolidated Financial Statements. (Filed herewith.)\n104\n—\nCover Page Interactive Data File (embedded within the Inline XBRL document). (Filed herewith.)\n_______________________________________________________________________________\n+    Management contract or compensatory plan or arrangement required to be filed or incorporated by reference as an exhibit to this Form 10-K pursuant to Item 15(a)(3) of Form 10-K.\n61 \nTable of Contents\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\n \n \nAvalonBay Communities, Inc.\nDate: February 27, 2025\n \nBy:\n \n/s/ BENJAMIN W. SCHALL\nBenjamin W. Schall, Director, Chief Executive Officer and President\n (Principal Executive Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nDate: February 27, 2025\nBy:\n/s/ BENJAMIN W. SCHALL\nBenjamin W. Schall, Director, Chief Executive Officer and President\n(Principal Executive Officer)\nDate: February 27, 2025\n \nBy:\n \n/s/ KEVIN P. O’SHEA\nKevin P. O’Shea, Chief Financial Officer\n(Principal Financial Officer)\nDate: February 27, 2025\n \nBy:\n \n/s/ KERI A. SHEA\nSean T. Willson, Senior Vice President - Corporate Controller\n(Principal Accounting Officer)\nDate: February 27, 2025\n \nBy:\n \n/s/ GLYN F. AEPPEL\nGlyn F. Aeppel, Director\nDate: February 27, 2025\nBy:\n/s/ TERRY S. BROWN\nTerry S. Brown, Director\nDate: February 27, 2025\nBy:\n/s/ RONALD L. HAVNER, JR.\nRonald L. Havner, Jr., Director\nDate: February 27, 2025\n \nBy:\n \n/s/ STEPHEN P. HILLS\nStephen P. Hills, Director\nDate: February 27, 2025\nBy:\n/s/ CHRISTOPHER B. HOWARD\nChristopher B. Howard, Director\nDate: February 27, 2025\n \nBy:\n \n/s/ RICHARD J. LIEB\nRichard J. Lieb, Director\nDate: February 27, 2025\nBy:\n/s/ NNENNA LYNCH\nNnenna Lynch, Director\nDate: February 27, 2025\nBy:\n/s/ CHARLES E. MUELLER, JR.\nCharles E. Mueller, Jr., Director\nDate: February 27, 2025\nBy:\n/s/ TIMOTHY J. NAUGHTON\nTimothy J. Naughton, Director (Chairman of the Board of Directors)\nDate: February 27, 2025\n \nBy:\n \n/s/ SUSAN SWANEZY\nSusan Swanezy, Director\n62 \nTable of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of AvalonBay Communities, Inc. \nOpinion on the Financial Statements \nWe have audited the accompanying consolidated balance sheets of AvalonBay Communities, Inc. (the Company) as of December 31, 2024 and 2023, the related consolidated statements of comprehensive income, equity and cash flows for each of the three years in the period ended December 31, 2024, and the related notes and financial statement schedule listed in the Index at Item 15(a)(2) (collectively referred to as the \"consolidated financial statements\"). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with U.S. generally accepted accounting principles. \nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated February 27, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion \nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB. \nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion. \nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosure to which it relates.\nF-1\nTable of Contents\nValuation of Deferred Development Costs and Land Held for Development\nDescription of the Matter\nAs of December 31, 2024, the Company’s deferred development costs and land held for development totaled $43.7 million and $151.9 million, respectively, collectively “Development Rights”. As discussed in Footnote 1 of the consolidated financial statements, the Company capitalizes costs associated with its development activities to the basis of land held when future development is probable, or if the Company has either not yet acquired the land or if the project is subject to a leasehold interest, the costs are capitalized as deferred development costs. Future development is dependent upon various factors, including zoning and regulatory approvals, rental market conditions, construction costs and the availability of capital. \nAuditing the valuation of deferred development costs and land held for development involved a high degree of subjectivity as management’s assessment of the probability that future development will occur was highly judgmental and subject to the various factors affecting future development discussed above. The Company’s assessment of probability of future development included an analysis of the likelihood of factors outside their control that could prevent the development from occurring and factors that could cause the Company to decide not to pursue or complete the development.  \nHow We \nAddressed \nthe Matter \nin Our Audit\nWe obtained an understanding, evaluated the design and tested the operating effectiveness of controls over the Company’s process to assess the valuation of deferred development costs and land held for development. For example, we tested controls over the Company’s pursuit monitoring process and management’s review of the probability assessment related to future development. \nOur procedures included, among others, evaluating the Company’s determination that the future development is probable. We performed procedures to test the accuracy and completeness of the information included in the Company’s qualitative analysis by agreeing data to underlying agreements, communications, minutes of management’s quarterly development meetings, and third-party evidence, where available. We further assessed the likelihood of the Company’s ability to obtain zoning and regulatory approvals for developments by considering, among other things, the Company’s prior experience with other development projects and the current status of the future projects for which pursuit or development rights costs were capitalized or land was held for development. We also met with executives who lead the Company’s development team to further understand the probability of future development.\n/s/  Ernst & Young LLP\nWe have served as the Company’s auditor since 2002.\nTysons, Virginia \nFebruary 27, 2025 \nF-2\nTable of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of AvalonBay Communities, Inc.\nOpinion on Internal Control Over Financial Reporting \nWe have audited AvalonBay Communities, Inc.’s internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, AvalonBay Communities, Inc. (the Company) maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on the COSO criteria. \nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of December 31, 2024 and 2023, the related consolidated statements of comprehensive income, equity and cash flows for each of the three years in the period ended December 31, 2024, and the related notes and financial statement schedule listed in the Index at Item 15(a)(2) and our report dated February 27, 2025 expressed an unqualified opinion thereon. \nBasis for Opinion \nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Report on Internal Control over Financial Reporting in Item 9A. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion. \nDefinition and Limitations of Internal Control Over Financial Reporting \nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements. \nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. \n/s/ Ernst & Young LLP\nTysons, Virginia \nFebruary 27, 2025 \nF-3\nTable of Contents\nAVALONBAY COMMUNITIES, INC.\nCONSOLIDATED BALANCE SHEETS\n(Dollars in thousands, except per share data)\n \nDecember 31, 2024\nDecember 31, 2023\nASSETS\n \n \nReal estate:\n \n \nLand and improvements\n$\n4,888,146\n \n$\n4,720,331\n \nBuildings and improvements\n20,454,276\n \n19,438,195\n \nFurniture, fixtures and equipment\n1,387,506\n \n1,238,330\n \n26,729,928\n \n25,396,856\n \nLess accumulated depreciation\n(\n8,164,411\n)\n(\n7,521,962\n)\nNet operating real estate\n18,565,517\n \n17,874,894\n \nConstruction in progress, including land\n1,042,673\n \n1,268,915\n \nLand held for development\n151,922\n \n199,062\n \nReal estate assets held for sale, net\n6,950\n \n—\n \nTotal real estate, net\n19,767,062\n \n19,342,871\n \nCash and cash equivalents\n108,576\n \n397,890\n \nRestricted cash\n158,500\n \n133,070\n \nUnconsolidated investments\n227,320\n \n220,145\n \nDeferred development costs\n43,675\n \n53,122\n \nPrepaid expenses and other assets\n540,950\n \n396,442\n \nRight of use lease assets\n154,654\n \n134,674\n \nTotal assets\n$\n21,000,737\n \n$\n20,678,214\n \nLIABILITIES AND EQUITY\n \n \nUnsecured notes, net\n$\n7,358,784\n \n$\n7,256,152\n \nVariable rate unsecured credit facility and commercial paper, net\n—\n \n—\n \nMortgage notes payable, net\n718,465\n \n725,670\n \nDividends payable\n244,967\n \n238,072\n \nPayables for construction\n85,954\n \n87,703\n \nAccrued expenses and other liabilities\n356,987\n \n310,868\n \nLease liabilities\n173,282\n \n153,232\n \nAccrued interest payable\n58,377\n \n57,911\n \nResident security deposits\n62,829\n \n63,815\n \nTotal liabilities\n9,059,645\n \n8,893,423\n \nCommitments and contingencies\nRedeemable noncontrolling interests\n—\n \n1,473\nEquity:\n \n \nPreferred stock, $\n0.01\n par value; $\n25\n liquidation preference; \n50,000,000\n shares authorized at December 31, 2024 and December 31, 2023; \nzero\n shares issued and outstanding at December 31, 2024 and December 31, 2023\n—\n \n—\n \nCommon stock, $\n0.01\n par value; \n280,000,000\n shares authorized at December 31, 2024 and December 31, 2023; \n142,254,022\n and \n142,025,456\n shares issued and outstanding at December 31, 2024 and December 31, 2023, respectively\n1,422\n \n1,420\n \nAdditional paid-in capital\n11,314,116\n \n11,287,626\n \nAccumulated earnings less dividends\n591,250\n \n478,156\n \nAccumulated other comprehensive income\n34,304\n \n16,116\n \nTotal equity\n11,941,092\n \n11,783,318\n \nTotal liabilities and equity\n$\n21,000,737\n \n$\n20,678,214\n \nSee accompanying notes to Consolidated Financial Statements.\nF-4\nTable of Contents\nAVALONBAY COMMUNITIES, INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(Dollars in thousands, except per share data)\n \nFor the year ended December 31,\n \n2024\n2023\n2022\nRevenue:\n \n \n \n   Rental and other income \n$\n2,906,676\n \n$\n2,760,187\n \n$\n2,587,113\n \n   Management, development and other fees \n7,081\n \n7,722\n \n6,333\n \n            Total revenue\n2,913,757\n \n2,767,909\n \n2,593,446\n \nExpenses:\n \n \n \n   Operating expenses, excluding property taxes\n745,846\n \n681,338\n \n630,154\n \n   Property taxes\n327,611\n \n306,794\n \n288,960\n \n   Expensed transaction, development and other pursuit costs, net of recoveries\n18,341\n \n33,479\n \n16,565\n \n   Interest expense, net\n226,589\n \n205,992\n \n230,074\n \n   Loss on extinguishment of debt, net\n—\n \n150\n \n1,646\n \n   Depreciation expense\n846,853\n \n816,965\n \n814,978\n \n   General and administrative expense \n77,697\n \n76,534\n \n74,064\n \n   Casualty and impairment loss\n2,935\n \n9,118\n \n—\n \n            Total expenses\n2,245,872\n \n2,130,370\n \n2,056,441\n \nIncome from unconsolidated investments\n50,682\n \n13,454\n \n53,394\n \nGain on sale of communities\n363,300\n \n287,424\n \n555,558\n \nOther real estate activity\n753\n \n174\n \n5,127\n \nIncome before income taxes\n1,082,620\n \n938,591\n \n1,151,084\n \nIncome tax expense\n(\n445\n)\n(\n10,153\n)\n(\n14,646\n)\nNet income\n1,082,175\n \n928,438\n \n1,136,438\n \nNet (income) loss attributable to noncontrolling interests\n(\n181\n)\n387\n \n337\n \nNet income attributable to common stockholders\n$\n1,081,994\n \n$\n928,825\n \n$\n1,136,775\n \nOther comprehensive income:\n \n \n \n   Gain on cash flow hedges   \n18,659\n \n13,332\n \n23,647\n \n   Cash flow hedge (gains) losses reclassified to earnings\n(\n471\n)\n1,360\n \n3,883\n \nComprehensive income\n$\n1,100,182\n \n$\n943,517\n \n$\n1,164,305\n \nEarnings per common share - basic:\n \n \n \n          Net income attributable to common stockholders\n$\n7.61\n \n$\n6.56\n \n$\n8.13\n \nEarnings per common share - diluted:\n \n \n \n          Net income attributable to common stockholders\n$\n7.60\n \n$\n6.56\n \n$\n8.12\n \n \nSee accompanying notes to Consolidated Financial Statements.\nF-5\nTable of Contents\nAVALONBAY COMMUNITIES, INC.\nCONSOLIDATED STATEMENTS OF EQUITY\n(Dollars in thousands)\n \nShares issued\nAdditional\npaid-in\ncapital\nAccumulated\nearnings\nless\ndividends\nAccumulated\nother\ncomprehensive\n(loss) income\n \nPreferred\nstock\nCommon\nstock\nPreferred\nstock\nCommon\nstock\nTotal\nequity\nBalance at December 31, 2021\n— \n139,751,926\n \n$\n— \n$\n1,398\n \n$\n10,716,980\n \n$\n240,821\n \n$\n(\n26,106\n)\n$\n10,933,093\n \nNet income attributable to common stockholders\n— \n— \n— \n— \n— \n1,136,775\n \n— \n1,136,775\n \nGain on cash flow hedges, net\n— \n— \n— \n— \n— \n— \n23,647\n \n23,647\n \nCash flow hedge losses reclassified to earnings\n— \n— \n— \n— \n— \n— \n3,883\n \n3,883\n \nNoncontrolling interest activity\n— \n— \n— \n— \n(\n489\n)\n(\n105\n)\n— \n(\n594\n)\nDividends declared to common stockholders ($\n6.36\n per share)\n— \n— \n— \n— \n— \n(\n890,809\n)\n— \n(\n890,809\n)\nIssuance of common stock, net of withholdings\n— \n164,938\n \n— \n2\n \n4,577\n \n(\n1,461\n)\n— \n3,118\n \nStock-based compensation expense\n— \n— \n— \n— \n44,440\n \n— \n— \n44,440\n \nBalance at December 31, 2022\n— \n139,916,864\n \n— \n1,400\n \n10,765,508\n \n485,221\n \n1,424\n \n11,253,553\n \nNet income attributable to common stockholders\n— \n— \n— \n— \n— \n928,825\n \n— \n928,825\n \nGain on cash flow hedges, net\n— \n— \n— \n— \n— \n— \n13,332\n \n13,332\n \nCash flow hedge losses reclassified to earnings\n— \n— \n— \n— \n— \n— \n1,360\n \n1,360\n \nNoncontrolling interest activity\n— \n— \n— \n— \n— \n(\n1,217\n)\n— \n(\n1,217\n)\nDividends declared to common stockholders ($\n6.60\n per share)\n— \n— \n— \n— \n— \n(\n935,305\n)\n— \n(\n935,305\n)\nIssuance of common stock, net of withholdings\n— \n2,120,392\n \n— \n20\n \n485,029\n \n1,635\n \n— \n486,684\n \nRepurchase of common stock, including repurchase costs\n— \n(\n11,800\n)\n— \n— \n(\n908\n)\n(\n1,003\n)\n— \n(\n1,911\n)\nStock-based compensation expense\n— \n— \n— \n— \n37,997\n \n— \n— \n37,997\n \nBalance at December 31, 2023\n— \n142,025,456\n \n— \n1,420\n \n11,287,626\n \n478,156\n \n16,116\n \n11,783,318\n \nNet income attributable to common stockholders\n— \n— \n— \n— \n— \n1,081,994\n \n— \n1,081,994\n \nGain on cash flow hedges, net\n— \n— \n— \n— \n— \n— \n18,659\n \n18,659\n \nCash flow hedge gains reclassified to earnings\n— \n— \n— \n— \n— \n— \n(\n471\n)\n(\n471\n)\nNoncontrolling interest activity\n— \n— \n— \n— \n(\n77\n)\n—\n \n— \n(\n77\n)\nDividends declared to common stockholders ($\n6.80\n per share)\n— \n— \n— \n— \n— \n(\n969,345\n)\n— \n(\n969,345\n)\nIssuance of common stock, net of withholdings\n— \n228,566\n \n— \n2\n \n(\n9,875\n)\n445\n \n— \n(\n9,428\n)\nStock-based compensation expense\n— \n— \n— \n— \n36,442\n \n— \n— \n36,442\n \nBalance at December 31, 2024\n— \n142,254,022\n \n$\n— \n$\n1,422\n \n$\n11,314,116\n \n$\n591,250\n \n$\n34,304\n \n$\n11,941,092\n \nSee accompanying notes to Consolidated Financial Statements.\nF-6\nTable of Contents\nAVALONBAY COMMUNITIES, INC\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(Dollars in thousands)\n \nFor the year ended December 31,\n \n2024\n2023\n2022\nCash flows from operating activities:\n \n \n \nNet income\n$\n1,082,175\n \n$\n928,438\n \n$\n1,136,438\n \nAdjustments to reconcile net income to net cash provided by operating activities:\n \n \n \nDepreciation expense\n846,853\n \n816,965\n \n814,978\n \nAmortization of deferred financing costs and debt discount\n13,280\n \n12,732\n \n11,218\n \nLoss on extinguishment of debt, net\n—\n \n150\n \n1,646\n \nAmortization of stock-based compensation\n25,373\n \n27,142\n \n33,864\n \nEquity in (income) loss of, and return on, unconsolidated investments and noncontrolling interests, net of eliminations\n(\n21,693\n)\n5,332\n \n5,255\n \nCasualty and impairment loss\n1,415\n \n4,622\n \n—\n \nExpensed transaction, development and other pursuit costs, net of recoveries\n18,341\n \n33,479\n \n5,599\n \nCash flow hedge (gains) losses reclassified to earnings\n(\n471\n)\n1,360\n \n3,883\n \nGain on sale of real estate assets\n(\n364,159\n)\n(\n287,987\n)\n(\n600,958\n)\n(Decrease) increase in prepaid expenses and other assets\n(\n31,158\n)\n5,777\n \n(\n7,167\n)\nIncrease in accrued expenses, other liabilities, accrued interest payable and resident security deposits\n37,922\n \n12,019\n \n17,176\n \nNet cash provided by operating activities\n1,607,878\n \n1,560,029\n \n1,421,932\n \nCash flows from investing activities:\n \n \n \nDevelopment/redevelopment of real estate assets including land acquisitions and deferred development costs\n(\n951,101\n)\n(\n901,847\n)\n(\n921,203\n)\nAcquisition of real estate assets\n(\n464,419\n)\n(\n215,889\n)\n(\n536,838\n)\nCapital expenditures - existing real estate assets\n(\n193,348\n)\n(\n178,312\n)\n(\n160,313\n)\nCapital expenditures - non-real estate assets\n(\n4,678\n)\n(\n18,962\n)\n(\n14,392\n)\n(Decrease) increase in payables for construction\n(\n1,749\n)\n14,901\n \n9,080\n \nProceeds from sale of real estate and for-sale condominiums, net of selling costs\n711,279\n \n467,096\n \n1,051,383\n \nNote receivable lending\n(\n90,088\n)\n(\n82,802\n)\n(\n29,352\n)\nNote receivable payments\n237\n \n253\n \n4,021\n \nDistributions from unconsolidated entities and investment sale proceeds\n11,178\n \n5,468\n \n51,464\n \nUnconsolidated investments\n(\n14,175\n)\n(\n18,861\n)\n(\n14,269\n)\nNet cash used in investing activities\n(\n996,864\n)\n(\n928,955\n)\n(\n560,419\n)\nCash flows from financing activities:\n \n \nIssuance of common stock, net\n10,535\n \n496,706\n \n20,020\n \nRepurchase of common stock, net\n—\n \n(\n1,911\n)\n—\n \nDividends paid\n(\n961,914\n)\n(\n922,657\n)\n(\n889,607\n)\nRepayments of mortgage notes payable, including prepayment penalties\n(\n9,793\n)\n(\n47,000\n)\n(\n43,332\n)\nIssuance of unsecured notes\n398,788\n \n399,756\n \n348,565\n \nRepayment of unsecured notes\n(\n300,000\n)\n(\n750,000\n)\n(\n100,000\n)\nPayment of deferred financing costs\n(\n3,763\n)\n(\n3,964\n)\n(\n14,301\n)\nReceipt for termination of forward interest rate swaps\n16,839\n \n8,331\n \n26,869\n \nPayments related to tax withholding for share-based compensation\n(\n16,883\n)\n(\n10,639\n)\n(\n16,989\n)\nNoncontrolling interests and joint venture transactions\n(\n8,707\n)\n(\n2,981\n)\n(\n2,281\n)\nNet cash used in financing activities\n(\n874,898\n)\n(\n834,359\n)\n(\n671,056\n)\nNet (decrease) increase in cash, cash equivalents and restricted cash\n(\n263,884\n)\n(\n203,285\n)\n190,457\n \nCash, cash equivalents and restricted cash, beginning of year\n530,960\n \n734,245\n \n543,788\n \nCash, cash equivalents and restricted cash, end of year\n$\n267,076\n \n$\n530,960\n \n$\n734,245\n \nCash paid during the year for interest, net of amount capitalized\n$\n213,253\n \n$\n187,523\n \n$\n212,241\n \n \nSee accompanying notes to Consolidated Financial Statements.\nF-7\nTable of Contents\nThe following table provides a reconciliation of cash, cash equivalents and restricted cash reported with the Consolidated Statements of Cash Flows (dollars in thousands):\nDecember 31, 2024\nDecember 31, 2023\nDecember 31, 2022\nCash and cash equivalents\n$\n108,576\n \n$\n397,890\n \n$\n613,189\n \nRestricted cash\n158,500\n \n133,070\n \n121,056\n \nCash, cash equivalents and restricted cash reported in the Consolidated Statements of Cash Flows\n$\n267,076\n \n$\n530,960\n \n$\n734,245\n \nSupplemental disclosures of non-cash investing and financing activities:\nDuring the year ended December 31, 2024:\n•\nAs described in Note 4, \"Equity,\" the Company issued \n250,806\n shares of common stock as part of the Company's stock-based compensation plans, of which \n146,725\n shares related to the conversion of performance awards to shares of common stock, and the remaining \n104,081\n shares valued at $\n18,020,000\n were issued in connection with new stock grants; \n12,290\n shares valued at $\n1,972,000\n were issued in conjunction with the conversion of deferred stock awards; \n3,533\n shares valued at $\n690,000\n were issued through the Company’s dividend reinvestment plan; \n94,288\n shares valued at $\n16,892,000\n were withheld to satisfy employees’ tax withholding and other liabilities; and \n4,408\n restricted shares with an aggregate value of $\n801,000\n were forfeited.\n•\nCommon stock dividends declared but not paid totaled $\n243,479,000\n.\n•\nThe Company recorded (i) an increase to prepaid expenses and other assets of $\n18,659,000\n and a corresponding adjustment to accumulated other comprehensive income; and (ii) reclassified $\n471,000\n of cash flow hedge gains from other comprehensive income to interest expense, net, to record the impact of the Company's derivative and hedging activity.\n•\nThe Company recorded $\n25,719,000\n of lease liabilities and offsetting right of use lease assets related to the execution\nof \none\n new ground lease for a development right. \nDuring the year ended December 31, 2023: \n•\nThe Company issued \n153,162\n shares of common stock as part of the Company's stock based compensation plans, of which \n60,016\n shares related to the conversion of performance awards to shares of common stock, and the remaining \n93,146\n shares valued at $\n16,552,000\n were issued in connection with new stock grants; \n3,454\n shares valued at $\n619,000\n were issued through the Company’s dividend reinvestment plan; \n62,937\n shares valued at $\n10,639,000\n were withheld to satisfy employees’ tax withholding and other liabilities; and \n2,119\n restricted shares with an aggregate value of $\n413,000\n were forfeited.\n•\nCommon stock dividends declared but not paid totaled $\n236,133,000\n.\n•\nThe Company recorded (i) an increase to prepaid expenses and other assets of $\n13,332,000\n and a corresponding adjustment to accumulated other comprehensive income; and (ii) reclassified $\n1,360,000\n of cash flow hedge losses from other comprehensive income to interest expense, net, to record the impact of the Company's derivative and hedging activity.\n•\nThe Company assumed a $\n63,041,000\n fixed rate mortgage loan in conjunction with the acquisition of Avalon West Plano.\nDuring the year ended December 31, 2022: \n•\nThe Company issued \n140,528\n shares of common stock as part of the Company's stock based compensation plans, of which \n54,053\n shares related to the conversion of performance awards to common stock, and the remaining \n86,475\n shares valued at $\n20,056,000\n were issued in connection with new stock grants; \n2,810\n shares valued at $\n593,000\n were issued through the Company’s dividend reinvestment plan; \n72,783\n shares valued at $\n16,989,000\n were withheld to satisfy employees’ tax withholding and other liabilities; and \n3,701\n restricted shares with an aggregate value of $\n791,000\n were forfeited.\n•\nCommon stock dividends declared but not paid totaled $\n224,222,000\n.\nF-8\nTable of Contents\n•\nThe Company recorded an increase of $\n105,000\n in redeemable noncontrolling interest with a corresponding decrease to accumulated earnings less dividends to adjust the redemption value associated with the put options held by joint venture partners and DownREIT partnership units. \n•\nThe Company reclassified $\n3,883,000\n of cash flow hedge losses from other comprehensive income to interest expense, net, to record the impact of the Company's derivative and hedging activity.\nSee accompanying notes to Consolidated Financial Statements.\nF-9\nTable of Contents\nAVALONBAY COMMUNITIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1. \nOrganization, Basis of Presentation and Significant Accounting Policies\nOrganization and Basis of Presentation\nAvalonBay Communities, Inc. (the \"Company,\" which term, unless the context otherwise requires, refers to AvalonBay Communities, Inc. together with its subsidiaries), is a Maryland corporation that has elected to be treated as a real estate investment trust (\"REIT\") for federal income tax purposes under the Internal Revenue Code of 1986, as amended (the \"Code\"). The Company develops, redevelops, acquires, owns and operates multifamily communities in New England, the New York/New Jersey metro area, the Mid-Atlantic, the Pacific Northwest, and Northern and Southern California, as well as in the Company's expansion regions of Raleigh-Durham and Charlotte, North Carolina, Southeast Florida, Dallas and Austin, Texas, and Denver, Colorado. \nAt December 31, 2024, the Company owned or held a direct or indirect ownership interest in \n306\n apartment communities containing \n93,518\n apartment homes in \n12\n states and the District of Columbia, of which \n17\n communities were under construction. The Company also owned or held a direct or indirect ownership interest in land or rights to land on which the Company expects to develop an additional \n28\n communities that, if developed as expected, will contain an estimated \n8,801\n apartment homes (unaudited).\nCapitalized terms used without definition have meanings provided elsewhere in this Form 10-K\n.\nPrinciples of Consolidation\nThe accompanying Consolidated Financial Statements include the accounts of the Company and its wholly-owned subsidiaries, certain joint venture partnerships, and any variable interest entities that qualify for consolidation. All significant intercompany balances and transactions have been eliminated in consolidation.\nThe Company accounts for joint venture entities and subsidiary partnerships in accordance with the consolidation guidance. The Company determines first whether to follow the variable interest entity (\"VIE\") or the voting interest entity (\"VOE\") model for each joint venture entity. The Company then evaluates whether it should consolidate the venture. Under the VIE model, the Company consolidates an investment when it has control to direct the activities of the venture and the obligation to absorb losses or the right to receive benefits that could potentially be significant to the VIE. The Company's maximum exposure for its VIEs is limited to its investments in the respective VIEs and its portion of any loan guarantee. Under the VOE model, the Company consolidates an investment when (i) it controls the investment through ownership of a majority voting interest if the investment is not a limited partnership or (ii) it controls the investment through its ability to remove the other partners in the investment, at its discretion, when the investment is a limited partnership.\nThe Company generally uses the equity method of accounting or net asset value (\"NAV\") for its unconsolidated investments, including when the Company holds a noncontrolling limited partner interest in a joint venture. Any investment in excess of the Company's cost basis at acquisition or formation of an equity method venture, will be recorded as a component of the Company's investment in the joint venture and recognized over the life of the underlying fixed assets of the venture as a reduction to its equity in income from the venture. Investments in which the Company has little or no influence are accounted for using the measurement alternative with the carrying amount of the investment adjusted to fair value when there is an observable transaction indicating a change in fair value.\nF-10\nTable of Contents\nReal Estate\nOperating real estate assets are stated at cost and consist of land and improvements, buildings and improvements, furniture, fixtures and equipment, and other costs incurred during their development, redevelopment and acquisition. Significant expenditures which improve or extend the life of an existing asset and that will benefit the Company for periods greater than a year, are capitalized. Expenditures for maintenance and repairs are charged to expense as incurred. \nProject costs related to the development, construction and redevelopment of real estate projects (including interest and related loan fees, property taxes and other direct costs) are capitalized as a cost of the project. Indirect project costs that relate to several projects are capitalized and allocated to the projects to which they relate. Indirect costs not clearly related to development, construction and redevelopment activity are expensed as incurred. For development, capitalization (i) begins when the Company has determined that development of the future asset is probable, (ii) can be suspended if there is no current development activity underway, but future development is still probable and (iii) ends when the asset, or a portion of an asset, is ready for its intended use, or the Company's intended use changes such that capitalization is no longer appropriate. \nFor land parcels acquired for development improved with operating real estate, the Company generally manages the improvements until all tenant obligations have been satisfied or eliminated through negotiation, and construction of new apartment communities is ready to begin. Revenue from incidental operations received from the current improvements on land parcels in excess of any incremental costs are recorded as a reduction of total capitalized costs of the respective Development Right and not as part of net income. Incidental operating costs in excess of incidental operating income are expensed in the period incurred.\nFor redevelopment efforts, the Company capitalizes costs either (i) in advance of taking homes out of service when significant renovation of the common area has begun until the redevelopment is completed, or (ii) when an apartment home is taken out of service for redevelopment until the redevelopment is completed and the apartment home is available for a new resident. Rental income and operating costs incurred during the initial lease-up or post-redevelopment lease-up period are recognized in earnings. \nThe Company accounts for real estate acquisitions as either an asset acquisition or a business combination. Under either model, the Company identifies and determines the fair value of any assets acquired, liabilities assumed and any noncontrolling interest in the acquiree. The Company generally views acquisitions of operating communities as asset acquisitions, which results in the capitalization of acquisition costs and the allocation of purchase price to the assets acquired and liabilities assumed, based on the relative fair value of the respective assets and liabilities.\nTypical assets acquired and liabilities assumed include land, building, furniture, fixtures and equipment, debt and identified intangible assets and liabilities, consisting of the value of above or below market leases and in-place leases. The Company utilizes various sources to determine fair value, including its own analysis of recently acquired and existing comparable properties in its portfolio and other market data. The purchase price allocation to tangible assets is reflected in real estate assets and depreciated over their estimated useful lives. Any purchase price allocation to intangible assets, other than in-place lease intangibles, is included in prepaid expenses and other assets on the accompanying Consolidated Balance Sheets and amortized over the term of the acquired intangible asset. The Company values land based on a market approach, looking to recent sales of similar properties, adjusting for differences due to location, the state of entitlement as well as the shape and size of the parcel. Improvements to land are valued using a replacement cost approach and consider the structures and amenities included for the communities and is reduced by estimated depreciation. The value for furniture, fixtures and equipment is also determined based on a replacement cost approach, considering costs for both items in the apartment homes as well as common areas and is adjusted for estimated depreciation. The fair value of buildings is estimated using the replacement cost approach, assuming the buildings were vacant at acquisition. The replacement cost approach considers the composition of structures acquired, adjusted for depreciation which considers industry standard information and estimated useful life of the acquired property. The value of the lease-related intangibles considers the estimated cost of leasing the apartment homes as if the acquired building(s) were vacant, as well as the value of the current leases relative to market-rate leases. The in-place lease value is determined using an average total lease-up time, the number of apartment homes and net revenues generated during the lease-up time. Net revenues use market rent considering actual leasing and industry rental rate data. The value of current leases relative to a market-rate lease is based on market comparables. Given the heterogeneous nature of multifamily real estate, the fair values for the land, debt, real estate assets and in-place leases incorporate significant unobservable inputs and therefore are considered to be Level 3 prices within the fair value hierarchy. Consideration for acquisitions is typically in the form of cash unless otherwise disclosed.\nDepreciation is generally calculated on a straight-line basis over the estimated useful lives of the assets, which for buildings and related improvements range from \nseven years\n to \n30\n years and for furniture, fixtures and equipment range from \nthree years\n to \nseven years\n.\nF-11\nTable of Contents\nIncome Taxes\nThe Company elected to be treated as a REIT for federal income tax purposes for its tax year ended December 31, 1994 and has not revoked such election. A REIT is a corporate entity which holds real estate interests and can deduct from its federally taxable income qualifying dividends it pays if it meets a number of organizational and operational requirements, including a requirement that it distribute at least \n90\n% of its adjusted taxable income to stockholders. Therefore, as a REIT, the Company generally will not be subject to corporate level federal income tax on its taxable income if it annually distributes \n100\n% of its taxable income to its stockholders. \nThe states in which the Company operates have similar tax provisions which recognize the Company as a REIT for state income tax purposes. Management believes that all such conditions for the exemption from income taxes on ordinary income have been or will be met for the periods presented. Accordingly, no provision for federal and state income taxes has been made. If the Company fails to qualify as a REIT in any taxable year, it will be subject to federal corporate income taxes at regular corporate rates and may not be able to qualify as a corporate REIT for four subsequent taxable years. Even if the Company qualifies for taxation as a REIT, the Company may be subject to certain state and local taxes on its income and property, and to federal income and excise taxes on its undistributed taxable income and in certain other instances. \nTaxable income from activities performed through taxable REIT subsidiaries (\"TRS\") is subject to federal, state and local income taxes. The Company recognized income tax expense of $\n445,000\n, $\n10,153,000\n and $\n14,646,000\n in 2024, 2023 and 2022, respectively, with amounts in 2023 and 2022 primarily due to dispositions at The Park Loggia. As of December 31, 2024 and 2023, the Company did \nno\nt have any unrecognized tax positions. The Company does not believe that there will be any material changes in its unrecognized tax positions over the next 12 months. The Company is subject to examination by the respective taxing authorities for the tax years 2021 through 2023.\nThe following summarizes the tax components of the Company's common dividends declared for the years ended December 31, 2024, 2023 and 2022 (unaudited):\n2024\n2023\n2022\nOrdinary income\n90\n \n%\n83\n \n%\n82\n \n%\n20\n% capital gain \n4\n \n%\n11\n \n%\n15\n \n%\nUnrecaptured §1250 gain\n6\n \n%\n6\n \n%\n3\n \n%\nTotal\n100\n \n%\n100\n \n%\n100\n \n%\nDeferred Financing Costs\nDeferred financing costs include expenditures necessary to obtain debt financing and are amortized on a straight-line basis, which approximates the effective interest method, over the shorter of the loan term or the related credit enhancement facility, if applicable. Unamortized financing costs are charged to earnings when debt is retired before the maturity date. Accumulated amortization of deferred financing costs for unsecured notes was $\n34,074,000\n and $\n34,494,000\n as of December 31, 2024 and 2023, respectively, and related to mortgage notes payable was $\n2,482,000\n and $\n2,262,000\n as of December 31, 2024 and 2023, respectively. Deferred financing costs, except for costs associated with line-of-credit arrangements, are presented as a direct deduction from the related debt liability. Accumulated amortization of deferred financing costs for the Company's Credit Facility was $\n7,345,000\n and $\n4,081,000\n as of December 31, 2024 and 2023, respectively, and deferred financing costs net of accumulated amortization was included in prepaid expenses and other assets on the accompanying Consolidated Balance Sheets.\nCash, Cash Equivalents and Restricted Cash\nCash and cash equivalents includes all cash and liquid investments with an original maturity of three months or less from the date acquired. Restricted cash includes principal reserve funds that are restricted for the repayment of specified secured financing, amounts the Company has designated for planned 1031 exchange activity and resident security deposits. The majority of the Company's cash, cash equivalents and restricted cash are held at major commercial banks.\nComprehensive Income\nComprehensive income, as reflected on the Consolidated Statements of Comprehensive Income, is defined as all changes in equity during each period except for those resulting from investments by or distributions to shareholders. Accumulated other \nF-12\nTable of Contents\ncomprehensive income (loss), as reflected on the Consolidated Statements of Equity, reflects the effective portion of the cumulative changes in the fair value of derivatives in qualifying cash flow hedge relationships.\nEarnings per Common Share\nBasic earnings per common share is computed by dividing net income attributable to common stockholders by the weighted average number of shares outstanding during the period. All outstanding unvested restricted share awards contain rights to non-forfeitable dividends and participate in undistributed earnings with common stockholders and, accordingly, are considered participating securities that are included in the two-class method of computing basic earnings per common share. Both the unvested restricted shares and other potentially dilutive common shares, and the related impact to earnings, are considered when calculating earnings per common share on a diluted basis. Diluted earnings per common share was computed using the treasury stock method for performance awards, options and participating securities. \nThe Company's earnings per common share are determined as follows (dollars in thousands, except per share data):\n \nFor the year ended December 31,\n \n2024\n2023\n2022\nBasic and diluted shares outstanding\n \n \n \nWeighted average common shares—basic\n142,000,934\n \n141,307,186\n \n139,634,294\n \nWeighted average DownREIT units outstanding\n—\n \n3,503\n \n7,500\n \nEffect of dilutive securities\n457,670\n \n333,099\n \n333,293\n \nWeighted average common shares—diluted\n142,458,604\n \n141,643,788\n \n139,975,087\n \nCalculation of Earnings per Common Share—basic\n \n \n \nNet income attributable to common stockholders\n$\n1,081,994\n \n$\n928,825\n \n$\n1,136,775\n \nNet income allocated to unvested restricted shares\n(\n2,069\n)\n(\n1,663\n)\n(\n2,091\n)\nNet income attributable to common stockholders—basic\n$\n1,079,925\n \n$\n927,162\n \n$\n1,134,684\n \nWeighted average common shares—basic\n142,000,934\n \n141,307,186\n \n139,634,294\n \nEarnings per common share—basic\n$\n7.61\n \n$\n6.56\n \n$\n8.13\n \nCalculation of Earnings per Common Share—diluted\n \n \n \nNet income attributable to common stockholders\n$\n1,081,994\n \n$\n928,825\n \n$\n1,136,775\n \nAdd: noncontrolling interests of DownREIT unitholders in consolidated partnerships, including discontinued operations\n—\n \n25\n \n48\n \nNet income attributable to common stockholders—diluted\n$\n1,081,994\n \n$\n928,850\n \n$\n1,136,823\n \nWeighted average common shares—diluted\n142,458,604\n \n141,643,788\n \n139,975,087\n \nEarnings per common share—diluted\n$\n7.60\n \n$\n6.56\n \n$\n8.12\n \nCertain options to purchase shares of common stock in the amounts of \n9,793\n, \n303,784\n and \n291,881\n were outstanding as of December 31, 2024, 2023 and 2022, respectively, but were not included in the computation of diluted earnings per common share because such options were anti-dilutive for the period.\n \nExpensed Transaction, Development and Other Pursuit Costs\nThe Company capitalizes costs associated with its development activities to the basis of land held when future development is probable, or if the Company has either not yet acquired the land or if the project is subject to a leasehold interest, the costs are capitalized as deferred development costs (\"Development Rights\"). Future development of these Development Rights is dependent upon various factors, including zoning and regulatory approval, rental market conditions, construction costs and the availability of capital. Costs incurred for pursuits for which future development is not yet considered probable are expensed as incurred. In addition, if the Company determines a Development Right is no longer probable, the Company recognizes any necessary expense to write down its basis in the Development Right. The Company expensed costs related to development pursuits not yet considered probable for development and the abandonment of Development Rights, as well as costs incurred in \nF-13\nTable of Contents\npursuing the acquisition or disposition of assets for which such acquisition and disposition activity did not occur, in the amounts of $\n18,341,000\n, $\n33,479,000\n and $\n16,565,000\n during the years ended December 31, 2024, 2023 and 2022, respectively. These costs are included in expensed transaction, development and other pursuit costs, net of recoveries on the accompanying Consolidated Statements of Comprehensive Income. The amount for 2024 includes a write-off of $\n8,947,000\n related to \none\n Development Right in Northern California that the Company determined was no longer probable. The amount for 2023 includes write-offs of $\n27,455,000\n related to \nseven\n Development Rights that the Company determined were no longer probable. The amount for 2022 includes write-offs of $\n10,073,000\n related to \nthree\n Development Rights that the Company determined were no longer probable. These costs can vary greatly, and the costs incurred in any given period may be significantly different in future periods.\nCasualty and Impairment of Long-Lived Assets\nThe Company evaluates its real estate and other long-lived assets for impairment when potential indicators of impairment exist. Such assets are stated at cost, less accumulated depreciation and amortization, unless the carrying amount of the asset is not recoverable. If events or circumstances indicate that the carrying amount of an asset may not be recoverable, the Company assesses its recoverability by comparing the carrying amount of the asset to its estimated undiscounted future cash flows. If the carrying amount exceeds the aggregate undiscounted future cash flows, the Company recognizes an impairment loss to the extent the carrying amount exceeds the estimated fair value of the asset. Based on periodic tests of recoverability of long-lived assets, for the years ended December 31, 2024, 2023 and 2022, the Company did \nno\nt recognize any material impairment losses. During the years ended December 31, 2024 and 2023, the Company recognized a charge of $\n2,935,000\n and $\n9,118,000\n, respectively, for the property and casualty damage to certain of the Company's communities, reported as casualty and impairment loss on the accompanying Consolidated Statements of Comprehensive Income. The charges for the year ended December 31, 2024, related to flooding and water damage at communities in California from extensive rainfall and a fire at a community in New Jersey. The charges for the year ended December 31, 2023, related to damage to certain communities in the Northeast and California regions from severe weather. \nThe Company assesses its portfolio of land held for both development and investment for impairment if the intent of the Company changes with respect to either the development of, or the expected holding period for, the land. For the years ended December 31, 2024, 2023 and 2022, the Company did \nno\nt recognize any impairment charges on its investment in land.\nThe Company evaluates its unconsolidated investments for other than temporary impairment, considering both whether the carrying value of the investment exceeds the fair value, and the Company’s intent and ability to hold the investment to recover its carrying value. The Company also evaluates its proportionate share of any impairment of assets held by unconsolidated investments. The Company did \nno\nt recognize any other than temporary impairment losses during the years ended December 31, 2024, 2023 or 2022.\nAssets Held for Sale and Discontinued Operations\nThe Company presents the assets and liabilities of any communities which have been sold, or otherwise qualify as held for sale, separately in the accompanying Consolidated Balance Sheets. In addition, the results of operations for those assets that meet the definition of discontinued operations are presented as such in the accompanying Consolidated Statements of Comprehensive Income. Real estate assets held for sale are measured at the lower of the carrying amount or the fair value less the cost to sell. Upon the classification of an asset as held for sale, no further depreciation is recorded. Disposals representing a strategic shift in operations (e.g., a disposal of a major geographic area, a major line of business or a major equity method investment) are presented as discontinued operations, and for those assets qualifying for classification as discontinued operations, the specific components of net income presented as discontinued operations include net operating income, depreciation expense and interest expense, net. For periods prior to the asset qualifying for discontinued operations, the Company reclassifies the results of operations to discontinued operations. In addition, the net gain or loss (including any impairment loss) on the eventual disposal of assets held for sale will be presented as discontinued operations when recognized. A change in presentation for held for sale or discontinued operations has no impact on the Company's financial condition or results of operations. The Company combines the operating, investing and financing portions of cash flows attributable to discontinued operations with the respective cash flows from continuing operations on the accompanying Consolidated Statements of Cash Flows. The Company had \none\n real estate asset that qualified as held for sale at December 31, 2024.\nDerivative Instruments and Hedging Activities\nThe Company enters into interest rate swap and interest rate cap agreements (collectively, \"Hedging Derivatives\") for interest rate risk management purposes and in conjunction with certain variable rate secured debt to satisfy lender requirements. The Company does not enter into Hedging Derivatives for trading or other speculative purposes. The Company assesses the \nF-14\nTable of Contents\neffectiveness of qualifying cash flow and fair value hedges, both at inception and on an ongoing basis. The fair values of Hedging Derivatives that are in an asset position are recorded in prepaid expenses and other assets. The fair values of Hedging Derivatives that are in a liability position are included in accrued expenses and other liabilities. Fair value changes for derivatives that are not in qualifying hedge relationships are reported as a component of interest expense, net. For the Hedging Derivatives that qualify as effective cash flow hedges, the Company records the cumulative changes in the Hedging Derivatives' fair value in accumulated other comprehensive income. Amounts recorded in accumulated other comprehensive income will be reclassified into earnings in the periods in which earnings are affected by the hedged cash flow. The effective portion of the change in fair value of the Hedging Derivatives that qualify as effective fair value hedges is reported as an adjustment to the carrying amount of the corresponding hedged item. Receipts or payments associated with the gains and losses on the Company’s cash flow hedges are presented as a component of cash flows from financing activities in the period the hedges are terminated and the payments for the Company’s derivatives that are not qualifying for hedging relationships are presented as a component of cash flows from operating activities. See Note 11, \"Fair Value,\" for further discussion of derivative financial instruments.\nUse of Estimates\nThe preparation of financial statements in conformity with GAAP requires management to make certain estimates and assumptions. These estimates and assumptions affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the dates of the financial statements and the reported amounts of revenue and expenses during the reporting periods. Actual results could differ from those estimates.\nReclassifications\nCertain reclassifications have been made to amounts in prior years' financial statements and notes to the financial statements to conform to current year presentations as a result of changes in held for sale classification, disposition activity and segment classification. In addition, there was a reclassification of software development costs from Furniture, fixtures and equipment to Prepaid expenses and other assets on the Consolidated Balance Sheet during the current year.\nLeases\nThe Company is party to leases as both a lessor and a lessee, primarily as follows:\n•\nlessor of residential and commercial space within its apartment communities; and\n•\nlessee under (i) ground leases for land underlying current operating or development communities and certain commercial and parking facilities and (ii) office leases for its corporate headquarters and regional offices.\nLessee Considerations\nThe Company assesses whether a contract is or contains a lease based on whether the contract conveys the right to control the use of an identified asset, including specified portions of larger assets, for a period of time in exchange for consideration. \nThe Company’s leases include both fixed and variable lease payments that are based on an index or rate such as the consumer price index (CPI) or percentage rents based on total sales. Variable lease payments are generally not included in the lease liability, but recognized as variable lease expense in the period in which they are incurred. \nFor leases that have options to extend the term or terminate the lease early, the Company only factored the impact of such options into the lease term if the option was considered reasonably certain to be exercised. The Company determined the discount rate associated with its ground and office leases on a lease-by-lease basis using the Company’s actual borrowing rates as well as indicative market pricing for longer term rates and taking into consideration the remaining term of the lease agreements. For leases that are 12 months or less, the Company elected the practical expedient to recognize the lease payments on a straight-line basis.\nLessor Considerations\nThe Company's residential and commercial leases at its apartment communities are operating leases. For leases that include rent concessions and/or fixed and determinable rent increases, rental income is recognized on a straight-line basis over the noncancellable term of the lease, which, for residential leases, is generally one year. Some of the Company’s commercial leases have renewal options which the Company will only include in the lease term if, at the commencement of the lease, it is reasonably certain that the lessee will exercise this option.\nF-15\nTable of Contents\nFor the Company’s leases, which are comprised of a lease component and common area maintenance as a non-lease component, the Company determined that (i) the leases are operating leases, (ii) the lease component is the predominant component and (iii) all components of its operating leases share the same timing and pattern of transfer.\nRevenue and Gain Recognition\nThe Company recognizes revenue for the transfer of goods and services to customers for consideration that the Company expects to receive. The majority of the Company’s revenue is derived from residential and commercial rental and other lease income, which are accounted for as discussed above, under \"Leases\". The Company's revenue streams that are not accounted for as residential and commercial rental and other lease income include:\n•\nManagement fees - The Company has investment interests in real estate joint ventures, for which the Company may manage (i) the venture, (ii) the associated operating communities owned by the ventures and/or (iii) the construction, development or redevelopment of those communities. For these activities, the Company receives asset management, property management, development and/or redevelopment fee revenue. The performance obligation is the management of the venture, community or other defined task such as the development or redevelopment of the community. While the individual activities that comprise the performance obligation of the management fees can vary day to day, the nature of the overall performance obligation to provide management service is the same and considered by the Company to be a series of services that have the same pattern of transfer to the customer and the same method to measure progress toward satisfaction of the performance obligation. The Company also provides various third party back-office, financial administrative support services. The Company recognizes revenue for fees as earned.\n•\nNon-lease related revenue - The Company recognizes revenue for items not considered to be components of a lease as earned.\n•\nGains or losses on sales of real estate\n - \nThe Company accounts for the sale of real estate and any related gain recognition in accordance with the accounting guidance applicable to sales of real estate, which establishes standards for recognition of profit on all real estate sales transactions. The Company recognizes the sale, and associated gain or loss from the disposition when the criteria for the sale of an asset have been met, which include when (i) a contract exists and (ii) the buyer obtained control of the nonfinancial asset that was sold.\nThe following table details the Company’s revenue disaggregated by reportable operating segment, further discussed in Note 8, \"Segment Reporting,\" for the years ended December 31, 2024, 2023 and 2022. The segments are classified based on the individual community's status at December 31, 2024 for the years ended December 31, 2024 and 2023, and at December 31, 2023 for the year ended December 31, 2022. Segment information for total revenue excludes real estate assets that were sold from January 1, 2022 through December 31, 2024, or otherwise qualify as held for sale as of December 31, 2024, as described in Note 6, \"Real Estate Disposition Activities.\" (dollars in thousands):\nF-16\nTable of Contents\nSame Store\nOther \nStabilized\nCommunities\nDevelopment/\nRedevelopment\nCommunities\nNon-\nallocated (1)\nTotal\nFor the year ended December 31, 2024\nManagement, development and other fees and other ancillary items\n$\n—\n \n$\n—\n \n$\n—\n \n$\n7,081\n \n$\n7,081\n \nNon-lease related revenue (2)\n10,769\n \n5,571\n \n485\n \n—\n \n16,825\n \nTotal non-lease revenue\n10,769\n \n5,571\n \n485\n \n7,081\n \n23,906\n \nLease income (3)\n2,669,423\n \n112,987\n \n65,399\n \n—\n \n2,847,809\n \nTotal revenue\n$\n2,680,192\n \n$\n118,558\n \n$\n65,884\n \n$\n7,081\n \n$\n2,871,715\n \nFor the year ended December 31, 2023\nManagement, development and other fees and other ancillary items\n$\n—\n \n$\n—\n \n$\n—\n \n$\n7,722\n \n$\n7,722\n \nNon-lease related revenue (2)\n12,752\n \n4,697\n \n128\n \n—\n \n17,577\n \nTotal non-lease revenue\n12,752\n \n4,697\n \n128\n \n7,722\n \n25,299\n \nLease income (3)\n2,578,264\n \n73,628\n \n6,042\n \n—\n \n2,657,934\n \nTotal revenue\n$\n2,591,016\n \n$\n78,325\n \n$\n6,170\n \n$\n7,722\n \n$\n2,683,233\n \nFor the year ended December 31, 2022\nManagement, development and other fees and other ancillary items\n$\n—\n \n$\n—\n \n$\n—\n \n$\n6,333\n \n$\n6,333\n \nNon-lease related revenue (2)\n11,048\n \n2,990\n \n165\n \n—\n \n14,203\n \nTotal non-lease revenue\n11,048\n \n2,990\n \n165\n \n6,333\n \n20,536\n \nLease income (3)\n2,322,395\n \n90,315\n \n29,569\n \n—\n \n2,442,279\n \nTotal revenue\n$\n2,333,443\n \n$\n93,305\n \n$\n29,734\n \n$\n6,333\n \n$\n2,462,815\n \n__________________________________\n(1)\nRepresents third-party property management, developer fees and miscellaneous income and other ancillary items which are not allocated to a reportable segment.\n(2)\nAmounts include revenue streams related to leasing activities that are not considered components of a lease, and revenue streams not related to leasing activities including, but not limited to, application fees, renters insurance fees and vendor revenue sharing.\n(3)\nRepresents residential and commercial rental and other lease income, as discussed above, under \"Leases\".\nDue to the nature and timing of the Company’s identified revenue streams, there were no material amounts of outstanding or unsatisfied performance obligations as of December 31, 2024.\n \nUncollectible Lease Revenue Reserves \nThe Company assesses the collectability of its lease revenue and receivables on an ongoing basis by (i) assessing the probability of receiving all lease amounts due on a lease-by-lease basis, (ii) fully reserving for those leases where collection of substantially all of the remaining lease payments is not probable and (iii) subsequently, will only recognize revenue to the extent cash is received. If the Company determines that collection of the remaining lease payments becomes probable at a future date, the Company will recognize the cumulative revenue that would have been recorded under the original lease agreement.\nF-17\nTable of Contents\nIn addition to the specific reserves recognized, the Company also evaluates its lease receivables for collectability at a portfolio level. The Company recognizes a reserve on a portfolio level when the uncollectible revenue is probable and reasonably estimable. The Company applies this reserve to the Company’s revenue and receivables not addressed as part of the specific reserve. \nThe Company recorded an aggregate offset to income for uncollectible lease revenue, net of amounts received from government rent relief programs, for its residential and commercial portfolios of $\n47,046,000\n, $\n57,906,000\n and $\n49,147,000\n for the years ended December 31, 2024, 2023 and 2022, respectively.\nRecently Issued and Adopted Accounting Standards\nIn November 2023, the Financial Accounting Standards Board (\"FASB\") issued Accounting Standards Update (\"ASU\") 2023-07, Segment Reporting - Improvements to Reportable Segment Disclosures, which requires disclosure of significant segment expenses provided to the chief operating decision maker (\"CODM\"). The Company adopted the guidance as of January 1, 2024, and it did not have a material effect on the Company’s consolidated financial statements (see Note 8, \"Segment Reporting\").\nIn December 2023, the FASB issued ASU 2023-09, Improvements to Income Tax Disclosures, which requires (i) a tabular rate reconciliation of the reported income tax expense (benefit) from continuing operations into specific categories, (ii) separate disclosure for any reconciling items within certain categories above a quantitative threshold, (iii) disclosure of income taxes paid disaggregated by federal, state and material jurisdictions and (iv) disclosure of income tax expense from continuing operations disaggregated by federal and state. The new standard will be effective for annual periods beginning January 1, 2025. The Company is assessing the standard and does not expect the standard to have a material effect on the Company’s consolidated financial statements.\nIn November 2024, the FASB issued ASU 2024-03, Income Statement—Reporting Comprehensive Income—Expense Disaggregation Disclosures, which requires the disaggregation for certain expenses presented on the face of an entity’s income statement in the entity's disclosures. Additionally, it requires the disclosure of selling expenses and descriptions of amounts not separately disaggregated. The new standard will be effective for annual reporting periods beginning after December 15, 2026, and interim reporting periods beginning after December 15, 2027. The Company is assessing the standard and does not expect the standard to have a material effect on the Company’s consolidated financial statements.\nF-18\nTable of Contents\n2. \nInterest Capitalized\nThe Company capitalizes interest during the development and redevelopment of real estate assets. Capitalized interest associated with the Company's development or redevelopment activities totaled $\n43,185,000\n, $\n47,133,000\n and $\n34,854,000\n for the years ended December 31, 2024, 2023 and 2022, respectively.\n3. \nDebt\nThe Company's debt, which consists of unsecured notes, mortgage notes payable, the Credit Facility and the Commercial Paper Program, each as defined below, as of December 31, 2024 and 2023 is summarized below. \nThe following amounts and discussion do not include the mortgage notes related to the communities classified as held for sale, if any, as of December 31, 2024 and 2023, as shown in the accompanying Consolidated Balance Sheets (dollars in thousands) (see Note 6, \"Real Estate Disposition Activities\"). The weighted average interest rates in the following table for secured and unsecured notes include costs of financing such as credit enhancement fees, trustees' fees, the impact of interest rate hedges and mark-to-market adjustments.\n \nDecember 31, 2024\nDecember 31, 2023\nFixed rate unsecured notes\n$\n7,400,000\n \n3.4\n \n%\n$\n7,300,000\n \n3.3\n \n%\nFixed rate mortgage notes payable—conventional and tax-exempt\n333,479\n \n3.9\n \n%\n333,892\n \n3.9\n \n%\nVariable rate mortgage notes payable—conventional and tax-exempt\n400,950\n \n5.2\n \n%\n410,150\n \n5.5\n \n%\nTotal mortgage notes payable and unsecured notes\n8,134,429\n \n3.5\n \n%\n8,044,042\n \n3.5\n \n%\nCredit Facility\n—\n \n—\n \n%\n—\n \n—\n \n%\nCommercial paper\n—\n \n—\n \n%\n—\n \n—\n \n%\nTotal principal outstanding\n8,134,429\n \n3.5\n \n%\n8,044,042\n \n3.5\n \n%\nLess deferred financing costs and debt discount (1)\n(\n57,180\n)\n(\n62,220\n)\nTotal\n$\n8,077,249\n \n$\n7,981,822\n \n_________________________________\n(1) Excludes deferred financing costs and debt discount associated with the Credit Facility and Commercial Paper Program which are included in prepaid expenses and other assets on the accompanying Consolidated Balance Sheets.\nThe Company has a $\n2,250,000,000\n revolving variable rate unsecured credit facility with a syndicate of banks (the \"Credit Facility\") which matures in September 2026. The interest rate that would be applicable to borrowings under the Credit Facility was \n5.30\n% at December 31, 2024 and was composed of (i) the Secured Overnight Financing Rate (\"SOFR\"), applicable to the period of borrowing for a particular draw of funds from the facility (e.g., one month to maturity, three months to maturity, etc.), plus (ii) the current borrowing spread to SOFR of \n0.805\n% per annum, which consisted of a \n0.10\n% SOFR adjustment plus \n0.705\n% per annum, assuming a daily SOFR borrowing rate. The borrowing spread to SOFR can vary from SOFR plus \n0.63\n% to SOFR plus \n1.38\n% based upon the rating of the Company's unsecured senior notes. There is also an annual facility commitment fee of \n0.12\n% of the borrowing capacity under the facility, which can vary from \n0.095\n% to \n0.295\n% based upon the rating of the Company's unsecured senior notes. The Credit Facility contains a sustainability-linked pricing component which provides for interest rate margin and commitment fee reductions or increases by meeting or missing targets related to environmental sustainability, specifically greenhouse gas emission reductions, with the adjustment determined annually. The annual determination under the sustainability-linked pricing component occurred in July 2024, maintaining reductions of approximately \n0.02\n% to the interest rate margin and \n0.005\n% to the commitment fee due to our achievement of sustainability targets.\nThe Company has an unsecured commercial paper note program (the \"Commercial Paper Program\") with the maximum aggregate face or principal amount outstanding at any one time not to exceed $\n500,000,000\n. Under the terms of the Commercial Paper Program, the Company may issue, from time to time, unsecured commercial paper notes with varying maturities of less than one year. The Commercial Paper Program is backstopped by the Company's commitment to maintain available borrowing capacity under the Credit Facility in an amount equal to actual borrowings under the Commercial Paper Program. \nF-19\nTable of Contents\nThe availability on the Company's Credit Facility as of December 31, 2024 and 2023, respectively, was as follows (dollars in thousands):\n \nDecember 31, 2024\nDecember 31, 2023\nCredit Facility commitment\n$\n2,250,000\n \n$\n2,250,000\n \nCredit Facility outstanding\n—\n \n—\n \nCommercial paper outstanding\n—\n \n—\n \nLetters of credit outstanding (1)\n(\n1,714\n)\n(\n1,914\n)\nTotal Credit Facility available\n$\n2,248,286\n \n$\n2,248,086\n \n_____________________________________\n(1) In addition, the Company had $\n45,910\n and $\n58,116\n outstanding in additional letters of credit unrelated to the Credit Facility as of December 31, 2024 and 2023, respectively.\nDuring the year ended December 31, 2024: \n•\nIn May 2024, the Company issued $\n400,000,000\n principal amount of unsecured notes in a public offering under its existing shelf registration statement for proceeds net of underwriting fees of approximately $\n396,188,000\n, before considering the impact of other offering costs. The notes mature in June 2034 and were issued at a \n5.35\n% interest rate, resulting in a \n5.05\n% effective rate including the impact of offering costs and hedging activity.\n•\nIn November 2024, the Company repaid $\n300,000,000\n principal amount of its \n3.50\n% unsecured notes at par at maturity. \nIn the aggregate, secured notes payable mature at various dates from March 2027 through July 2066, and are secured by certain apartment communities (with a net carrying value of $\n1,245,662,000\n, excluding communities classified as held for sale, as of December 31, 2024).\nScheduled payments and maturities of secured notes payable and unsecured notes outstanding at December 31, 2024 were as follows (dollars in thousands):\nYear\nSecured notes \nprincipal payments \nand maturities\nUnsecured notes maturities\nStated interest rate of\nunsecured notes\n2025\n$\n11,365\n \n$\n525,000\n \n3.45\n \n%\n300,000\n \n3.50\n \n%\n2026\n11,811\n \n475,000\n \n2.95\n \n%\n300,000\n \n2.90\n \n%\n2027\n250,159\n \n400,000\n \n3.35\n \n%\n2028\n19,002\n \n450,000\n \n3.20\n \n%\n400,000\n \n1.90\n \n%\n2029\n131,561\n \n450,000\n \n3.30\n \n%\n2030\n9,000\n \n700,000\n \n2.30\n \n%\n2031\n9,600\n \n600,000\n \n2.45\n \n%\n2032\n10,400\n \n700,000\n \n2.05\n \n%\n2033\n11,900\n \n350,000\n \n5.00\n \n%\n400,000\n \n5.30\n \n%\n2034\n12,800\n \n400,000\n \n5.35\n \n%\nThereafter\n256,831\n \n350,000\n \n3.90\n \n%\n300,000\n \n4.15\n \n%\n300,000\n \n4.35\n \n%\n$\n734,429\n \n$\n7,400,000\n \n \nF-20\nTable of Contents\nThe Company's unsecured notes are redeemable at the Company's option, in whole or in part, generally at a redemption price equal to the greater of (i) \n100\n% of their principal amount or (ii) the sum of the present value of the remaining scheduled payments of principal and interest discounted at a rate equal to the yield on U.S. Treasury securities with a comparable maturity plus a spread between \n10\n and \n30\n basis points depending on the specific series of unsecured notes, plus accrued and unpaid interest to the redemption date. \nThe Company is subject to financial covenants contained in the Credit Facility and the indentures under which the unsecured notes were issued. The principal financial covenants include the following:\n•\nlimitations on the amount of total and secured debt in relation to the Company's overall capital structure;\n•\nlimitations on the amount of the Company's unsecured debt relative to the undepreciated basis of real estate assets that are not encumbered by property-specific financing; and\n•\nminimum levels of debt service coverage.\nThe Company was in compliance with these covenants at December 31, 2024.\n4. \nEquity\nAs of December 31, 2024 and 2023, the Company's charter had authorized for issuance a total of \n280,000,000\n shares of common stock and \n50,000,000\n shares of preferred stock.\nDuring the year ended December 31, 2024, the Company:\ni.\nissued \n41,619\n shares of common stock in connection with stock options exercised;\nii.\nissued \n3,533\n shares of common stock through the Company's dividend reinvestment plan;\niii.\nissued \n250,806\n shares of common stock in connection with restricted stock grants and the conversion of performance awards to shares of common stock;\niv.\nissued \n12,290\n shares of common stock in connection with the conversion of deferred stock awards;\nv.\nissued \n19,014\n shares of common stock through the Employee Stock Purchase Plan; \nvi.\nwithheld \n94,288\n shares of common stock to satisfy employees' tax withholding and other liabilities; and\nvii.\ncanceled \n4,408\n shares of restricted common stock upon forfeiture.\nDeferred compensation granted under the Company's Second Amended and Restated 2009 Equity Incentive Plan (the \"Plan\") for the year ended December 31, 2024 does not impact the Company's Consolidated Financial Statements until recognized as compensation cost.\nThe Company has a continuous equity program (the \"CEP\") under which the Company may sell (and/or enter into forward sale agreements for the sale of) up to $\n1,000,000,000\n of its common stock from time to time. Actual sales will depend on a variety of factors to be determined by the Company, including market conditions, the trading price of the Company's common stock and the Company's determinations of the appropriate funding sources. The Company expects that, if entered into, it will physically settle each forward sale agreement on one or more dates specified by the Company on or prior to the maturity date of that particular forward sale agreement, in which case the Company will receive aggregate net cash proceeds at settlement equal to the number of shares underlying the particular forward agreement multiplied by the forward sale price. However, the Company may also elect to cash settle or net share settle a forward sale agreement. In connection with each forward sale agreement, the Company will pay the forward seller, in the form of a reduced initial forward sale price, a commission of up to \n1.5\n% of the sales prices of all borrowed shares of common stock sold. During the year ended December 31, 2024, the Company entered into forward contracts under the CEP to sell \n367,113\n shares of common stock for approximate proceeds, net of fees, of $\n80,687,000\n, based on the gross weighted average price of $\n223.27\n per share, with settlement of the forward contracts expected to occur on one or more dates not later than December 31, 2025. The final proceeds will be determined on the date(s) of settlement and are subject to certain customary adjustments for the Company's dividends and a daily interest factor. During the years ended December 31, 2023 and 2022, the Company had \nno\n sales under this program. In addition, during the year ended December 31, 2022, the Company settled the outstanding forward contracts entered into in December 2021 under this program, selling \n68,577\n shares of common stock for $\n229.34\n per share and net proceeds of $\n15,727,000\n. As of December 31, 2024, the Company had $\n623,997,000\n remaining authorized for issuance under the CEP, after consideration of the forward contracts.\nF-21\nTable of Contents\nIn addition, during the year ended December 31, 2024, the Company completed an underwritten public offering of \n3,680,000\n shares of its common stock at a discount to the closing price of $\n226.52\n per share, net of offering fees, offered in connection with forward contracts entered into with certain financial institutions acting as forward purchasers. Assuming full physical settlement of the forward contracts, which the Company expects to occur no later than December 31, 2025, the Company will receive approximate proceeds, net of offering fees and discounts of $\n808,606,000\n, based on the initial forward price. The final proceeds will be determined on the date(s) of settlement and are subject to certain customary adjustments for the Company's dividends and a daily interest factor. During the year ended December 31, 2023, the Company settled the outstanding forward contracts entered into in April 2022 (the \"Equity Forward\"), issuing \n2,000,000\n shares of common stock, net of offering fees and discounts, for $\n491,912,000\n or $\n245.96\n per share. \nThe Company has a stock repurchase program under which the Company may acquire shares of its common stock in open market or negotiated transactions up to an aggregate purchase price of $\n500,000,000\n (the \"Stock Repurchase Program\"). Purchases of common stock under the Stock Repurchase Program may be exercised at the Company’s discretion with the timing and number of shares repurchased depending on a variety of factors including price, corporate and regulatory requirements and other corporate liquidity requirements and priorities. The Stock Repurchase Program does not have an expiration date and may be suspended or terminated at any time without prior notice. During the years ended December 31, 2024 and 2022, the Company had \nno\n repurchases of shares under this program. During the year ended December 31, 2023, the Company had repurchased \n11,800\n shares of common stock at an average price of $\n161.96\n under this program. As of December 31, 2024, the Company had $\n314,237,000\n remaining authorized for purchase under this program.\n5. \nInvestments\nInvestments in Consolidated Real Estate Entities\n \nDetails regarding communities acquired in 2024, 2023 and 2022, are summarized in the following table (dollars in thousands):\nCommunity name\nLocation\nNumber of communities\nApartment\nhomes\nPurchase price\nCommercial square feet\nAvalon at Pier 121\nLewisville, TX\n1\n \n300\n \n$\n62,100\n \n—\n \nAvalon Perimeter Park\nMorrisville, NC\n1\n \n262\n \n66,500\n \n—\n \nAvalon Cherry Hills \nEnglewood, CO\n1\n \n306\n \n95,000\n \n—\n \nAVA Balboa Park\nSan Diego, CA\n1\n \n100\n \n51,000\n \n1,700\n \nAvalon Townhomes at Bee Cave\nBee Cave, TX\n1\n \n126\n \n49,000\n \n—\n \nAvalon Lowry\nDenver, CO\n1\n \n347\n \n136,500\n \n—\n \nTotal 2024 acquisitions\n6\n \n1,441\n \n$\n460,100\n \n1,700\n \nTotal 2023 acquisitions\n3\n \n1,131\n \n$\n277,200\n \n—\n \nTotal 2022 acquisitions\n4\n \n1,313\n \n$\n536,200\n \n16,000\n \nThe Company accounted for these purchases as asset acquisitions and recorded the acquired assets and assumed liabilities, including identifiable intangibles, at their relative fair values based on the purchase price and acquisition costs incurred. The Company uses third-party pricing or internal models for the value of the land, a valuation model for the value of the building, and an internal model to determine the fair value of the remaining real estate assets and in-place leases. Given the heterogeneous nature of multifamily real estate, the fair values for the land, building, real estate assets and in-place leases incorporated significant unobservable inputs and therefore are considered to be Level 3 prices within the fair value hierarchy.\nStructured Investment Program\nThe Company operates a Structured Investment Program (the \"SIP\"), an investment platform through which the Company provides mezzanine loans or preferred equity to third-party multifamily developers. As of December 31, 2024, the Company had \nseven\n commitments to fund up to $\n191,585,000\n in the aggregate. The Company's investment commitments have a weighted average rate of return of \n11.5\n% and a weighted average initial maturity date of December 2026. At December 31, 2024, the Company had funded $\n186,549,000\n of these commitments. The Company recognized interest income of $\n16,022,000\n and $\n6,189,000\n for the years ended December 31, 2024 and 2023, respectively, from the SIP. The Company recognized \nno\n interest income during the year ended December 31, 2022 from the SIP. Interest income and any change in the expected credit loss are \nF-22\nTable of Contents\nincluded as a component of income from unconsolidated investments, on the accompanying Consolidated Statements of Comprehensive Income. \nThe Company evaluates each SIP commitment to determine the classification as a loan or an investment in a real estate development project. As of December 31, 2024, all of the SIP commitments are classified as loans. The Company includes amounts outstanding under the SIP as a component of prepaid expenses and other assets on the accompanying Consolidated Balance Sheets. The Company evaluates the credit risk for each commitment on an ongoing basis, estimating the reserve for credit losses using relevant available information from internal and external sources. Market-based historical credit loss data provides the basis for the estimation of expected credit losses, with adjustments, if necessary, for differences in current commitment-specific risk characteristics, such as the amount of equity capital provided by a borrower, amount of senior debt secured by the project, nature of the real estate being developed or other factors.\nUnconsolidated Investments\nThe Company accounts for its investments in unconsolidated entities under the equity method of accounting, NAV, or under the measurement alternative, as discussed in Note 1, \"Organization, Basis of Presentation and Significant Accounting Policies,\" under Principles of Consolidation. As of December 31, 2024, the Company had investments in \nfive\n unconsolidated entities with real estate holdings, with ownership interest percentages ranging from \n20.0\n% to \n50.0\n%, coupled with other unconsolidated investments including property technology and environmentally focused companies and investment management funds. The significant accounting policies of the unconsolidated investments are consistent with those of the Company in all material respects. Certain of these investments are subject to various buy‑sell provisions or other rights which are customary in real estate joint venture agreements. The Company and its partners in these entities may initiate these provisions to either sell the Company's interest or acquire the interest from the Company's partner. The Company is responsible for the day-to-day operations of the unconsolidated communities below and is the management agent subject to the terms of management agreements for all communities except for Brandywine Apartments of Maryland, LLC, which is managed by a third party.\nThe following presents the Company's activities in unconsolidated investments for the years ended December 31, 2024, 2023 and 2022:\nArchstone Multifamily Partners AC LP (the \"U.S. Fund\")\n—The Company acquired its interest in the U.S. Fund as part of the Archstone Acquisition in 2013 (as defined in Note 5, \"Investments in Real Estate Entities,\" of the Consolidated Financial Statements in Item 8 in the Company's Form 10-K filed February 22, 2019). The Company was the general partner of the U.S. Fund and had a \n28.6\n% combined general partner and limited partner equity interest. During 2022, the U.S. Fund sold its final \nthree\n communities and the Company's proportionate share of the gains in accordance with GAAP was $\n38,144,000\n. In conjunction with achieving a threshold return under provisions of the U.S. Fund, the Company received incentive distributions for its promoted interest. During the years ended December 31, 2023 and 2022, the Company recognized income of $\n1,519,000\n and $\n4,690,000\n, respectively, for its promoted interest, which is included in income from unconsolidated investments on the accompanying Consolidated Statements of Comprehensive Income. During 2023, the Company completed the dissolution of the U.S. Fund.\nArchstone Multifamily Partners AC JV LP (the \"AC JV\")\n—The Company had a \n20.0\n% equity interest in the AC JV, and acquired its interest as part of the Archstone Acquisition. During 2022, the Company completed the dissolution of the AC JV.\nLegacy JV\n—As part of the Archstone Acquisition the Company entered into a limited liability company agreement with Equity Residential, through which it assumed obligations of Archstone in the form of preferred interests, some of which are governed by tax protection arrangements (the \"Legacy JV\"). The Company has a \n40.0\n% interest in the Legacy JV. During the years ended December 31, 2024, 2023 and 2022, the Legacy JV redeemed certain of the preferred interests and paid accrued dividends, for which the Company contributed $\n1,320,000\n, $\n940,000\n and $\n860,000\n, respectively. At December 31, 2024, the remaining preferred interests had an aggregate liquidation value of $\n32,817,000\n, the Company's \n40.0\n% share of which was included in accrued expenses and other liabilities in the accompanying Consolidated Balance Sheets.\nF-23\nTable of Contents\nNYTA MF Investors LLC (\"NYC Joint Venture\")\n—During 2018, the Company contributed \nfive\n wholly-owned communities containing an aggregate of \n1,301\n apartment homes and \n58,000\n square feet of commercial space, located in New York City, NY, to a newly formed joint venture with the intent to own and operate the communities. The Company retained a \n20.0\n% equity interest in the venture with the partners sharing in returns in accordance with their ownership interests. NYC Joint Venture has outstanding $\n394,734,000\n fixed rate mortgage loans that are payable by the venture. The Company has not guaranteed the debt of NYC Joint Venture, nor does the Company have any obligation to fund this debt should NYC Joint Venture be unable to do so. At December 31, 2024, the Company has an equity investment of $\n53,678,000\n (net of distributions) in the NYC Joint Venture.\nMVP I, LLC—\nDuring 2004, the Company entered into a joint venture agreement with an unrelated third-party to develop Avalon at Mission Bay II, an apartment community located in San Francisco, CA, which completed construction during 2006 and contains \n313\n apartment homes. The Company has a \n25.0\n% equity interest in the venture. MVP I, LLC has an outstanding $\n103,000,000\n fixed rate mortgage loan that is payable by the venture. The Company has not guaranteed the debt of MVP I, LLC, nor does the Company have any obligation to fund this debt should MVP I, LLC be unable to do so. The Company has fully recovered its basis as of December 31, 2024.\nBrandywine Apartments of Maryland, LLC (\"Brandywine\")— \nThe Company acquired its interest in Brandywine as part of the Archstone Acquisition. Brandywine owns a \n305\n apartment home community located in Washington, D.C. Brandywine is comprised of \nfive\n members who hold various interests in the joint venture, with the Company having a \n28.7\n% equity interest in Brandywine. Brandywine had an outstanding $\n18,368,000\n fixed rate mortgage loan that is payable by the venture. The Company has not guaranteed the debt of Brandywine, nor does the Company have any obligation to fund this debt should Brandywine be unable to do so. At December 31, 2024, the Company had an equity investment of $\n13,924,000\n (net of distributions) in Brandywine.\nAvalon Alderwood MF Member, LLC\n—During 2019, the Company entered into a joint venture to develop, own, and operate Avalon Alderwood Place, an apartment community located in Lynnwood, WA, which completed construction during 2022 and contains \n328\n apartment homes. The Company has a \n50.0\n% interest in the venture and, as of December 31, 2024, the Company has a total equity investment of $\n50,926,000\n. The venture is a VIE, though the Company is not the primary beneficiary because it shares control with its venture partner. The Company and its venture partner share decision making authority for all significant aspects of the venture's activities including, but not limited to, changes in the ownership or capital structure, and the operating budget. \nArts District Joint Venture\n—During 2020, the Company entered into a joint venture to develop, own, and operate AVA Arts District, an apartment community located in Los Angeles, CA, which completed construction in the current year and contains \n475\n apartment homes and \n57,000\n square feet of commercial space. As of December 31, 2024, the Company has a \n25.0\n% interest in the venture, and excluding costs incurred in excess of equity in the underlying net assets of the venture, has an equity investment of $\n29,932,000\n. The venture has drawn $\n155,968,000\n of $\n167,147,000\n maximum borrowing capacity of the construction loan as of December 31, 2024. The Company has provided the lender a payment guarantee for \n30\n% of the venture's construction loan maximum borrowing capacity of $\n167,147,000\n. Any amounts payable under the \n30\n% construction loan guarantee by the Company are obligations of the venture partners in proportion to their ownership interest, and in the event the Company is obligated to perform under its construction loan guarantee, its joint venture partner is obligated to reimburse the Company for \n75\n% of amounts paid. The venture is an unconsolidated VIE as the Company is not the primary beneficiary due to shared control and decision making with its venture partner. The Company and its venture partner share decision making authority for all significant aspects of the venture's activities including, but not limited to, changes in the ownership, changes to the development plan or budget, and major operating decisions including annual business plans.\nProperty Technology and Environmental Investments\n—The Company has invested $\n58,122,000\n in various property technology and environmentally focused companies directly and indirectly through investment management funds. The Company’s interest in each individual investment is minor such that the Company does not have influence over operating or financial policies of the investments. In addition, as of December 31, 2024, the Company has $\n62,494,000\n in outstanding equity commitments, with the timing and amount for these commitments to be fulfilled dependent on if, and when, investment opportunities are identified by the respective funds. During the years ended December 31, 2024, 2023 and 2022, the Company recognized realized and unrealized gains of $\n33,137,000\n, $\n4,161,000\n and $\n8,315,000\n, respectively, related to these investments, which was reported as a component of income from unconsolidated investments on the accompanying Consolidated Statements of Comprehensive Income.\nF-24\nTable of Contents\n 6. \nReal Estate Disposition Activities\nDetails regarding the real estate sales, which resulted in a gain in accordance with GAAP of $\n363,300,000\n, excluding for-sale residential condominiums at The Park Loggia, are summarized in the following table (dollars in thousands):\nCommunity name\nLocation\nPeriod of sale\nApartment\nhomes\nGross\nsales price\nNet cash\nproceeds\nCommercial square feet\nAVA Belltown\nSeattle, WA\nQ2 2024\n100\n \n$\n34,000\n \n$\n32,343\n \n1,000\n \nAVA North Hollywood \nLos Angeles, CA\nQ2 2024\n156\n \n62,100\n \n57,215\n \n11,000\n \nAvalon Hackensack at Riverside\nHackensack, NJ\nQ2 2024\n226\n \n85,600\n \n83,878\n \n— \nAVA Theater District\nBoston, MA\nQ3 2024\n398\n \n212,000\n \n209,893\n \n— \nAvalon Darien\nDarien, CT\nQ3 2024\n189\n \n120,000\n \n118,029\n \n— \nAvalon New Canaan\nNew Canaan, CT\nQ4 2024\n104\n \n75,000\n \n74,113\n \n— \nAvalon Berkeley\nBerkeley, CA\nQ4 2024\n94\n \n32,000\n \n31,033\n \n— \nAVA Ballard\nSeattle, WA\nQ4 2024\n265\n \n105,500\n \n100,115\n \n12,000\n \nOther real estate\nmultiple\n2024\nN/A\n—\n \n784\n \n— \nTotal of 2024 asset sales\n \n \n1,532\n \n$\n726,200\n \n$\n707,403\n \n24,000\n \nTotal of 2023 asset sales\n \n \n987\n \n$\n446,000\n \n$\n440,209\n \n27,000\n \nTotal of 2022 asset sales\n \n \n2,062\n \n$\n953,135\n \n$\n934,117\n \n—\n \nAs of December 31, 2024, the Company had \none\n real estate asset that qualified as held for sale. \nThe Park Loggia\nThe Park Loggia, located in New York, NY, contains \n172\n for-sale residential condominiums and \n66,000\n square feet of commercial space. The Company sold \none\n, \nsix\n and \n40\n residential condominiums at The Park Loggia, for gross proceeds of $\n4,166,000\n, $\n25,387,000\n and $\n126,848,000\n resulting in a loss in accordance with GAAP of $\n76,000\n and $\n73,000\n and gain in accordance with GAAP of $\n2,217,000\n during the years ended December 31, 2024, 2023 and 2022, respectively. The Company incurred $\n30,000\n, $\n389,000\n and $\n2,129,000\n during the years ended December 31, 2024, 2023 and 2022, respectively, in marketing, operating and administrative costs. All amounts are included in other real estate activity on the accompanying Consolidated Statements of Comprehensive Income. As of December 31, 2024, there was \none\n residential condominium remaining to be sold. As of December 31, 2024 and 2023, the unsold for-sale residential condominium at The Park Loggia had an aggregate carrying value of $\n2,743,000\n and $\n6,603,000\n, respectively, presented in prepaid expenses and other assets on the accompanying Consolidated Balance Sheets.\n7. \nCommitments and Contingencies\nEmployment Agreements and Arrangements\nThe standard restricted stock, option and performance award agreements used by the Company in its compensation program provide that upon an employee's termination without cause or the employee's Retirement (as defined in the agreement), (i) all outstanding stock options and restricted shares of stock held by the employee will vest, and the employee will have up to 12 months or until the fifth anniversary of the grant date, if later, or until the option expiration date, if earlier, to exercise any options then held and (ii) a pro rata share (based on the portion of the performance period that has been completed) of performance awards that have completed at least one year of their performance period shall vest, with settlement to occur at the end of the performance period in accordance with achievement thereunder. Under the agreements, Retirement generally means a termination of employment and other business relationships, other than for cause, after attainment of age 50, provided certain conditions are met, including that (i) the employee has worked for the Company for at least 10 years, (ii) the employee's age at Retirement plus years of employment with the Company equals at least 70 and (iii) the employee provides at least six months written notice of intent to retire.\nIf a sale event (as defined in the agreement) of the Company occurs, all outstanding multiyear performance awards will vest at their target value and will settle. The Company also has an Officer Severance Program (the “Program”). Under the Program, in the event an officer who is not otherwise covered by a severance arrangement is terminated (other than for cause), or chooses to \nF-25\nTable of Contents\nterminate his or her employment for good reason (as defined in the agreement), in either case in connection with or within 24 months following a sale event (as defined in the agreement) of the Company, such officer will generally receive a cash lump sum payment equal to a multiple of the officer's covered compensation (base salary plus annual cash bonus). The multiple is one time for vice presidents and senior vice presidents, two times for executive vice presidents and three times for the chief executive officer. The officer's restricted stock, options and performance awards would also vest. Costs related to the Program are deferred and recognized over the requisite service period when considered by management to be probable and estimable.\nLegal Contingencies\nThe Company recognizes a loss associated with contingent legal matters when the loss is probable and estimable. \nIn 2022 and early 2023, the Company was named as a defendant in cases brought by private litigants alleging antitrust violations by RealPage, Inc. and owners and/or operators of multifamily housing which utilize revenue management systems provided by RealPage, Inc. The Company engaged with the plaintiffs' counsel to explain why it believed that these cases were without merit as they pertained to the Company. Following these discussions, the plaintiffs filed a notice of voluntary dismissal in July 2023, which resulted in the Company being dismissed without prejudice from these cases. Subsequently, on November 1, 2023, the District of Columbia filed a lawsuit in the Superior Court of the District of Columbia against RealPage, Inc. and \n14\n owners and/or operators of multifamily housing in the District of Columbia, including the Company, alleging that the defendants violated the District of Columbia Antitrust Act by unlawfully agreeing to use RealPage, Inc. revenue management systems and sharing sensitive data. On May 29, 2024, the Superior Court granted the Company’s motion to dismiss with prejudice as it pertains to the Company. The District of Columbia subsequently filed a motion asking the court to reconsider its ruling, and on December 23, 2024, the court ruled in the District’s favor, giving the District leave to amend its original complaint and name AvalonBay as a defendant. See also Note 12, “Subsequent Events.” \nWith the exception of the Maryland Antitrust Litigation, as discussed in Note 12, \"Subsequent Events\", the Company is not currently a defendant of any other cases with allegations similar to those above.\nThe Company is involved in various other claims and/or administrative proceedings that arise in the ordinary course of its business. While no assurances can be given, the Company does not currently believe that any of these other outstanding litigation matters, individually or in the aggregate, will have a material adverse effect on its financial condition or results of operations.\nIn addition, the Company accounts for recoveries from legal matters as a reduction in the legal and related costs incurred associated with the matter, with recoveries in excess of these costs reported as a gain or, where appropriate, a reduction in the net cost basis of a community to which the suit related. During the year ended December 31, 2022, the Company recognized $\n6,000,000\n in legal settlement proceeds related to a construction defect at a community, reported as a component of general and administrative expense on the accompanying Consolidated Statements of Comprehensive Income. There were \nno\n material receipts during the years ended December 31, 2024 and 2023.\nLease Obligations\nThe Company owns \nseven\n apartment communities, \ntwo\n commercial properties and \none\n development right located on land subject to ground leases expiring between July 2046 and May 2123. The Company has purchase options for all ground leases expiring prior to 2062. The ground leases for \nsix\n of the \nseven\n apartment communities, the \ntwo\n commercial properties and the \none\n development right are operating leases, with rental expense recognized on a straight-line basis over the lease term. During the year ended December 31, 2024, the Company entered into a new ground lease, expiring May 2123, for a development right, resulting in minimum lease payments over the term of the lease of $\n155,600,000\n and a lease liability balance of $\n25,675,000\n as of December 31, 2024. In addition, the Company is party to \n13\n leases for its corporate and regional offices with varying terms through 2031, all of which are operating leases. \nAs of December 31, 2024 and 2023, the Company had total operating lease assets of $\n126,572,000\n and $\n106,146,000\n, respectively, and lease obligations of $\n153,333,000\n and $\n133,220,000\n, respectively, reported as components of \nright of use lease assets\n and \nlease liabilities\n, respectively, on the accompanying Consolidated Balance Sheets. The Company incurred costs of $\n16,298,000\n, $\n16,342,000\n and $\n15,667,000\n for the years ended December 31, 2024, 2023 and 2022, respectively, related to operating leases. \nF-26\nTable of Contents\nThe Company has \none\n apartment community located on land subject to a ground lease and \nfour\n leases for portions of parking garages adjacent to apartment communities, that are finance leases. As of December 31, 2024 and 2023, the Company had total finance lease assets of $\n28,082,000\n and $\n28,528,000\n, respectively, and total finance lease obligations of $\n19,949,000\n and $\n20,012,000\n, respectively, reported as components of \nright of use lease assets\n and \nlease liabilities\n on the accompanying Consolidated Balance Sheets.\nThe following table details the weighted average remaining lease term and discount rates for the Company’s ground and office leases:\nWeighted-average remaining lease term - finance leases\n21\n years\nWeighted-average remaining lease term - operating leases\n50\n years\nWeighted-average discount rate - finance leases\n4.63\n \n%\nWeighted-average discount rate - operating leases\n5.15\n \n%\nThe following table details the future minimum payments of the Company's current leases as of December 31, 2024 (dollars in thousands):\nOperating Leases (1)\nFinancing Leases\n2025\n$\n15,344\n \n$\n1,089\n \n2026\n15,752\n1,091\n2027\n15,484\n1,095\n2028\n14,536\n1,096\n2029\n13,577\n1,099\nThereafter\n405,106\n34,663\nTotal\n479,799\n \n40,133\n \nLess discount for time value\n(\n326,466\n)\n(\n20,184\n)\nLease liability\n$\n153,333\n \n$\n19,949\n \n8. \nSegment Reporting\nThe Company's reportable operating segments include Same Store, Other Stabilized and Development/Redevelopment. Annually as of January 1, the Company determines which of its communities fall into each of these categories and generally maintains that classification throughout the year for the purpose of reporting segment operations, unless disposition or redevelopment plans regarding a community change.\n•\nSame Store\n is composed of\n \nconsolidated communities where a comparison of operating results from the prior year to the current year is meaningful as these communities were owned and had stabilized occupancy as of the beginning of the respective prior year. For the year ended December 31, 2024, Same Store communities are consolidated for financial reporting purposes, had stabilized occupancy as of January 1, 2023, are not conducting or are not probable to conduct substantial redevelopment activities and are not held for sale as of December 31, 2024 or probable for disposition to unrelated third parties within the fiscal year. A community is considered to have stabilized occupancy at the earlier of (i) attainment of \n90\n% physical occupancy or (ii) the \none year\n anniversary of completion of development or redevelopment.\nF-27\nTable of Contents\n•\nOther Stabilized \nis composed of completed consolidated communities that the Company owns and that are not Same Store but that had stabilized occupancy, as defined above, as of January 1, 2024, or which were acquired during the years ended December 31, 2024 or 2023. Other Stabilized excludes communities that are conducting or are probable to conduct substantial redevelopment activities within the fiscal year. \n•\nDevelopment/Redevelopment \nis composed of (i) consolidated communities that are either currently under construction, or were under construction during the fiscal year, which may be partially or fully complete and operating, (ii) consolidated communities where substantial redevelopment is in progress or is probable to begin during the fiscal year and (iii) communities that have been complete for less than one year and did not have stabilized occupancy, as defined above, as of January 1, 2024.\nIn addition, the Company owns land for future development and has other corporate assets that are not allocated to an operating segment.\nThe Company's segment disclosures present the measure(s) used by the CODM for assessing each segment's performance. The Company's CODM is comprised of several members of its executive management team, including its Chief Executive Officer and President, Chief Financial Officer, Chief Investment Officer, Chief Operating Officer, and Executive Vice President- Portfolio and Asset Management. The CODM uses net operating income (\"NOI\") as the primary financial measure for Same Store communities and Other Stabilized communities. NOI is defined by the Company as total property revenue less direct property operating expenses (including property taxes), and excluding corporate-level income (including management, development and other fees), property management and other indirect operating expenses, net of corporate income, expensed transaction, development and other pursuit costs, net of recoveries, interest expense, net, loss on extinguishment of debt, net, general and administrative expense, income from unconsolidated investments, depreciation expense, income tax expense (benefit), casualty and impairment loss, gain on sale of communities, other real estate activity, and net operating income from real estate assets sold or held for sale. The CODM evaluates the Company's financial performance on a consolidated residential and commercial basis. The commercial results attributable to the non-apartment components of the Company's mixed-use communities and other nonresidential operations represent \n1.7\n%, \n1.8\n% and \n2.1\n% of total NOI for the years ended December 31, 2024, 2023 and 2022, respectively. Although the Company considers NOI a useful measure of a community's or communities' operating performance, NOI should not be considered an alternative to net income or net cash flow from operating activities, as determined in accordance with GAAP. NOI excludes a number of income and expense categories as detailed in the reconciliation of NOI to net income and consistent with how the Company's CODM evaluates total NOI.\nA reconciliation of NOI to net income for years ended December 31, 2024, 2023 and 2022 is as follows (dollars in thousands):\n \nFor the year ended December 31,\n \n2024\n2023\n2022\nNet income\n$\n1,082,175\n \n$\n928,438\n \n$\n1,136,438\n \nProperty management and other indirect operating expenses, net of corporate income\n162,594\n \n134,312\n \n114,200\n \nExpensed transaction, development and other pursuit costs, net of recoveries\n18,341\n \n33,479\n \n16,565\n \nInterest expense, net\n226,589\n \n205,992\n \n230,074\n \nLoss on extinguishment of debt, net\n—\n \n150\n \n1,646\n \nGeneral and administrative expense\n77,697\n \n76,534\n \n74,064\n \nIncome from unconsolidated investments\n(\n50,682\n)\n(\n13,454\n)\n(\n53,394\n)\nDepreciation expense\n846,853\n \n816,965\n \n814,978\n \nIncome tax expense\n445\n \n10,153\n \n14,646\n \nCasualty and impairment loss\n2,935\n \n9,118\n \n—\n \nGain on sale of communities\n(\n363,300\n)\n(\n287,424\n)\n(\n555,558\n)\nOther real estate activity\n(\n753\n)\n(\n174\n)\n(\n5,127\n)\nNet operating income from real estate assets sold or held for sale\n(\n28,463\n)\n(\n57,646\n)\n(\n87,116\n)\n        Net operating income\n$\n1,974,431\n \n$\n1,856,443\n \n$\n1,701,416\n \nF-28\nTable of Contents\nThe following is a summary of NOI from real estate assets sold or held for sale for the periods presented (dollars in thousands):\nFor the year ended December 31,\n2024\n2023\n2022\nRental income from real estate assets sold or held for sale\n$\n42,042\n \n$\n84,676\n \n$\n130,631\n \nOperating expenses from real estate assets sold or held for sale\n(\n13,579\n)\n(\n27,030\n)\n(\n43,515\n)\nNet operating income from real estate assets sold or held for sale\n$\n28,463\n \n$\n57,646\n \n$\n87,116\n \nThe primary performance measure for communities under development or redevelopment depends on the stage of completion. While under development, management monitors actual construction costs against budgeted costs as well as lease-up pace and rent levels compared to budget.\nThe following table details the Company's segment information as of the dates specified (dollars in thousands). The segments are classified based on the individual community's status at December 31, 2024 for the years ended December 31, 2024 and 2023 and at December 31, 2023, for the year ended December 31, 2022. \nSegment information for the years ended December 31, 2024, 2023 and 2022 has been adjusted to exclude the real estate assets that were sold from January 1, 2022 through December 31, 2024, or otherwise qualify as held for sale as of December 31, 2024, as described in Note 6, \"Real Estate Disposition Activities.\"\nF-29\nTable of Contents\nFor the year ended December 31, 2024\nSame Store\nOther Stabilized\nDevelopment / Redevelopment\nTotal (1) (2)\nTotal Revenue\n$\n2,680,192\n \n$\n118,558\n \n$\n65,884\n \n$\n2,864,634\n \nSame Store Operating Expense\nProperty Taxes\n(\n301,696\n)\n(\n301,696\n)\nPayroll\n(\n152,572\n)\n(\n152,572\n)\nRepairs & Maintenance\n(\n147,183\n)\n(\n147,183\n)\nUtilities\n(\n109,297\n)\n(\n109,297\n)\nOffice Operations\n(\n63,480\n)\n(\n63,480\n)\nInsurance\n(\n39,591\n)\n(\n39,591\n)\nMarketing\n(\n15,202\n)\n(\n15,202\n)\nSame Store Operating Expense\n(\n829,021\n)\n—\n \n—\n \n(\n829,021\n)\nNon-Same Store Operating Expense\n—\n \n(\n38,230\n)\n(\n22,952\n)\n(\n61,182\n)\nTotal Expenses\n(\n829,021\n)\n(\n38,230\n)\n(\n22,952\n)\n(\n890,203\n)\nTotal NOI\n$\n1,851,171\n \n$\n80,328\n \n$\n42,932\n \n$\n1,974,431\n \nGross Real Estate (3) (4)\n$\n23,419,850\n \n$\n1,749,380\n \n$\n2,485,000\n \n$\n27,654,230\n \nFor the year ended December 31, 2023\nSame Store\nOther Stabilized\nDevelopment / Redevelopment\nTotal (1) (2)\nTotal Revenue\n$\n2,591,016\n \n$\n78,325\n \n$\n6,170\n \n$\n2,675,511\n \nSame Store Operating Expense\nProperty Taxes\n(\n287,648\n)\n(\n287,648\n)\nPayroll\n(\n152,645\n)\n(\n152,645\n)\nRepairs & Maintenance\n(\n141,110\n)\n(\n141,110\n)\nUtilities\n(\n93,716\n)\n(\n93,716\n)\nOffice Operations\n(\n63,823\n)\n(\n63,823\n)\nInsurance\n(\n35,919\n)\n(\n35,919\n)\nMarketing\n(\n14,781\n)\n(\n14,781\n)\nSame Store Operating Expense\n(\n789,642\n)\n—\n \n—\n \n(\n789,642\n)\nNon-Same Store Operating Expense\n—\n \n(\n24,585\n)\n(\n4,841\n)\n(\n29,426\n)\nTotal Expenses\n(\n789,642\n)\n(\n24,585\n)\n(\n4,841\n)\n(\n819,068\n)\nTotal NOI\n$\n1,801,374\n \n$\n53,740\n \n$\n1,329\n \n$\n1,856,443\n \nGross Real Estate (3) (4)\n$\n23,182,172\n \n$\n1,269,463\n \n$\n1,600,314\n \n$\n26,051,949\n \nFor the year ended December 31, 2022\nSame Store\nOther Stabilized\nDevelopment / Redevelopment\nTotal (1) (2)\nTotal Revenue\n$\n2,333,443\n \n$\n93,305\n \n$\n29,734\n \n$\n2,456,482\n \nSame Store Operating Expense\nProperty Taxes\n(\n260,505\n)\n(\n260,505\n)\nPayroll\n(\n148,462\n)\n(\n148,462\n)\nRepairs & Maintenance\n(\n126,137\n)\n(\n126,137\n)\nUtilities\n(\n76,227\n)\n(\n76,227\n)\nOffice Operations\n(\n63,188\n)\n(\n63,188\n)\nInsurance\n(\n29,910\n)\n(\n29,910\n)\nMarketing\n(\n13,747\n)\n(\n13,747\n)\nSame Store Operating Expense\n(\n718,176\n)\n—\n \n—\n \n(\n718,176\n)\nNon-Same Store Operating Expense\n—\n \n(\n25,750\n)\n(\n11,047\n)\n(\n36,797\n)\nTotal Expenses\n(\n718,176\n)\n(\n25,750\n)\n(\n11,047\n)\n(\n754,973\n)\nTotal NOI\n$\n1,615,267\n \n$\n67,462\n \n$\n18,687\n \n$\n1,701,416\n \nGross Real Estate (3) (4)\n$\n22,197,772\n \n$\n1,515,963\n \n$\n1,574,649\n \n$\n25,288,384\n \n________________________\nF-30\nTable of Contents\n(1)    Does not include non-allocated revenue and non-allocated gross real estate. Non-allocated revenue represents third-party property management, developer fees and miscellaneous income and other ancillary items which are not allocated to a reportable segment. Non-allocated revenue is $\n7,081\n, \n$\n7,722\n a\nnd $\n6,333\n for the years ended December 31, 2024, 2023 and 2022, respectively. \n(2)     Does not include non-allocated gross real estate including the for-sale residential condominiums at The Park Loggia, as discussed in Note 6, \"Real Estate Disposition Activities,\" and land held for development. Non-allocated gross real estate is $\n118,342\n, $\n70,822\n and $\n122,886\n for the years ended December 31, 2024, 2023 and 2022, respectively. Land held for development gross real estate is $\n151,922\n, $\n199,062\n and $\n179,204\n \nfor the years ended December 31, 2024, 2023 and 2022, respectively.\n(3)     Does not include gross real estate either sold or classified as held for sale subsequent to December 31, 2024, 2023 and 2022 of $\n25,288\n, $\n543,000\n and $\n280,889\n, respectively.\n(4)     Gross real estate for the Company's Same Store includes capitalized additions of approximately $\n236,592\n, $\n188,507\n and $\n209,607\n in 2024, 2023 and 2022, respectively.\n9. \nStock-Based Compensation Plans\nThe Company's Plan includes an authorization to issue shares of the Company's common stock, par value $\n0.01\n per share. At December 31, 2024, the Company had \n4,957,465\n shares remaining available to issue under the Plan, exclusive of shares that may be issued to satisfy currently outstanding awards such as stock options or performance awards. The Plan provides for equity awards to associates, officers, non-employee directors and other key personnel of the Company and its subsidiaries in the form of restricted stock, restricted stock units, stock options that qualify as incentive stock options (\"ISOs\") under Section 422 of the Code, non-qualified stock options, stock appreciation rights and performance awards, among others. The Plan expires in 2027, however before its expiration the Company expects to amend the plan or adopt a new plan to allow for continued grants of equity awards.\nThe Company's share-based compensation framework includes annual restricted stock awards and multi-year performance awards (the \"Performance Awards\"). The annual restricted stock vests over a three-year period at one-third per year. For annual restricted stock awards, in lieu of restricted stock, an officer may elect to receive up to \n100\n% of the award value, in increments of \n25\n%, in the form of stock options, which vests consistent with the restricted stock awards. Annually, the Company grants a target number of performance awards, with the ultimate award determined by the total shareholder return of the Company's common stock and/or operating performance metrics, measured over a performance period of \nthree years\n. Performance units earned at the end of the measurement period are settled in fully vested shares of common stock and a payment of a cash amount representing accrued dividends on earned performance awards. The Company granted supplemental stock options in February 2021, that have a \nten-year\n term and cliff vested on March 1, 2023. The options were granted at an exercise price that equaled the closing stock price on the grant date with recipients having 12 months to exercise the option if terminated without cause and will have until the expiration date to exercise the options if they retire.\nFor Performance Awards, after the first year of the performance period, if an employee's employment terminates on account of death, disability, retirement, or termination without cause, the employee's target grant will be pro-rated based on the employee's service time during the performance period. The final payout is based on actual performance, at which time the units will be converted into shares and a payment of a cash amount for accrued dividends based on actual performance. For other terminating events, performance awards are generally forfeited.\nInformation with respect to stock options granted under the Plan is as follows:\nF-31\nTable of Contents\n \nOptions\nWeighted average\nexercise price\nper option\nOptions Outstanding, December 31, 2021\n299,149\n \n$\n178.71\n \nGranted (1)\n9,793\n \n236.14\n \nExercised\n(\n8,670\n)\n135.78\n \nForfeited\n(\n6,459\n)\n180.32\n \nOptions Outstanding, December 31, 2022\n293,813\n \n$\n181.85\n \nGranted (1)\n15,744\n \n177.83\n \nExercised\n(\n5,773\n)\n163.56\n \nForfeited\n—\n \n—\n \nOptions Outstanding, December 31, 2023\n303,784\n \n$\n181.99\n \nGranted (1)\n13,759\n \n172.11\n \nExercised \n(\n41,619\n)\n179.89\n \nForfeited\n—\n \n—\n \nExpired\n(\n5,062\n)\n180.32\n \nOptions Outstanding, December 31, 2024\n270,862\n \n$\n181.84\n \nOptions Exercisable:\n \n \nDecember 31, 2022\n6,533\n \n$\n165.51\n \nDecember 31, 2023\n279,894\n \n$\n180.97\n \nDecember 31, 2024\n246,877\n \n$\n181.82\n \n__________________________________\n(1)\nAll options are from recipient elections to receive a portion of earned restricted stock awards in the form of stock options.\nThe Company used the Black-Scholes Option Pricing model to determine the grant date fair value of options. \nThe assumptions used are as follows:\n2024\nDividend yield\n4.5\n \n%\nEstimated volatility\n29.7\n \n%\nRisk free rate\n4.31\n \n%\nExpected life of options\n5\n years\nEstimated fair value\n$\n35.32\nThe following summarizes the exercise prices and contractual lives of options outstanding as of December 31, 2024:\nThe Plan\nNumber of Options\nRange—Exercise Price\nWeighted Average\nRemaining Contractual Term\n(in years)\n261,069\n$\n172.00\n-\n$\n181.99\n6.4\n9,793\n$\n236.00\n-\n$\n245.99\n7.1\n270,862\n \n \nOptions outstanding at December 31, 2024 had an intrinsic value of $\n10,486,000\n. Options exercisable had an intrinsic value of $\n9,528,000\n and had a weighted average contractual life of \n6.2\n years. The intrinsic value of options exercised under the Plan during 2024, 2023 and 2022 was $\n1,394,000\n, $\n113,000\n and $\n602,000\n, respectively.\nF-32\nTable of Contents\nInformation with respect to performance awards granted is as follows:\nPerformance awards\nWeighted average grant date fair value per award\nOutstanding at December 31, 2021\n284,522\n \n$\n214.73\n \n  Granted (1)\n72,783\n \n254.75\n \n  Change in awards based on performance (2)\n(\n20,356\n)\n200.92\n \n  Converted to shares of common stock\n(\n54,053\n)\n217.33\n \n  Forfeited\n(\n3,829\n)\n230.36\n \nOutstanding at December 31, 2022\n279,067\n \n$\n225.46\n \n  Granted (3)\n90,215\n \n193.85\n \n  Change in awards based on performance (2)\n(\n31,345\n)\n241.49\n \n  Converted to shares of common stock\n(\n60,016\n)\n238.71\n \n  Forfeited\n(\n2,719\n)\n212.05\n \nOutstanding at December 31, 2023\n275,202\n \n$\n210.52\n \n  Granted (4)\n95,782\n \n185.97\n \n  Change in awards based on performance (2)\n30,375\n \n216.50\n \n  Converted to shares of common stock\n(\n146,725\n)\n201.07\n \n  Forfeited\n(\n4,511\n)\n201.41\n \nOutstanding at December 31, 2024\n250,123\n \n$\n207.55\n \n_________________________________\n(1)     The shares of common stock earned was based on the total shareholder return metrics for the Company’s common stock for \n39,972\n performance awards and financial metrics related to operating performance, net asset value and leverage metrics of the Company for \n32,811\n performance awards. \n(2)    Represents the change in the number of performance awards earned based on performance achievement.\n(3)    The shares of common stock that may be earned is based on the total shareholder return metrics for the Company’s common stock for \n49,611\n performance awards and financial metrics related to operating performance and leverage metrics of the Company for \n40,604\n performance awards.\n(4)    The shares of common stock that may be earned is based on the total shareholder return metrics for the Company’s common stock for \n52,683\n performance awards and financial metrics related to operating performance and leverage metrics of the Company for \n43,099\n performance awards.\nThe Company used a Monte Carlo model to assess the compensation cost associated with the portion of the performance awards granted for which achievement will be determined by using total shareholder return measures. \nThe assumptions used are as follows:\n2024\n2023\n2022\nDividend yield\n3.9\n%\n3.7\n%\n2.7\n%\nEstimated volatility over the life of the plan (1)\n20.5\n% - \n22.8\n%\n22.9\n% - \n26.1\n%\n16.1\n% - \n36.8\n%\nRisk free rate\n3.92\n% - \n4.59\n%\n4.35\n% - \n4.61\n%\n0.72\n% - \n1.68\n%\nEstimated performance award value based on total shareholder return measure\n$\n189.47\n$\n206.97\n$\n271.98\n_________________________________\n(1)     Estimated volatility over the life of the plan is using \n50\n% historical volatility and \n50\n% implied volatility.\nFor the portion of the performance awards granted for which achievement will be determined by using financial metrics, the compensation cost was based on an average grant date value of $\n175.54\n, $\n177.83\n and $\n233.94\n, for the years ended December 31, 2024, 2023 and 2022, respectively, and the Company's estimate of corporate achievement for the financial metrics. \n \nF-33\nTable of Contents\nInformation with respect to restricted stock granted is as follows:\nRestricted stock shares\nWeighted average grant date fair value per share\nRestricted stock shares converted from performance awards\nOutstanding at December 31, 2021\n157,066\n \n$\n192.90\n \n74,627\n \n  Granted\n86,475\n \n231.93\n \n—\n \n  Vested\n(\n78,212\n)\n197.51\n \n(\n48,171\n)\n  Forfeited\n(\n3,615\n)\n218.19\n \n(\n86\n)\nOutstanding at December 31, 2022\n161,714\n \n$\n210.97\n \n26,370\n \n  Granted\n93,146\n \n177.70\n \n—\n \n  Vested\n(\n79,450\n)\n207.93\n \n(\n26,370\n)\n  Forfeited\n(\n2,119\n)\n194.78\n \n—\n \nOutstanding at December 31, 2023\n173,291\n \n$\n194.68\n \n—\n \n  Granted\n104,081\n \n173.14\n \n—\n \n  Vested\n(\n90,582\n)\n194.89\n \n—\n \n  Forfeited\n(\n4,408\n)\n181.73\n \n—\n \nOutstanding at December 31, 2024\n182,382\n \n$\n182.59\n \n—\n \nTotal employee stock-based compensation cost recognized in income was $\n25,390,000\n, $\n27,417,000\n and $\n34,131,000\n for the years ended December 31, 2024, 2023 and 2022, respectively, and total capitalized stock-based compensation cost was $\n11,117,000\n, $\n10,906,000\n and $\n10,431,000\n for the years ended December 31, 2024, 2023 and 2022, respectively. At December 31, 2024, there was a total unrecognized compensation cost of $\n29,021,000\n for unvested restricted stock, stock options and performance awards, which is expected to be recognized over a weighted average period of \n1.7\n years. The Company reverses any previously recognized compensation cost for forfeitures as they occur.\nEmployee Stock Purchase Plan\nIn October 1996, the Company adopted the 1996 Non-Qualified Employee Stock Purchase Plan (as amended, the \"ESPP\"). Initially, \n1,000,000\n shares of common stock were reserved for issuance, and as of December 31, 2024, there are \n550,002\n shares remaining available for issuance under the ESPP. Employees of the Company generally are eligible to participate in the ESPP if, as of the last day of the applicable purchase period, they have been employed by the Company for at least \none calendar month\n. Under the ESPP, eligible employees can acquire shares of the Company's common stock through payroll deductions, subject to maximum purchase limitations, during \ntwo\n purchase periods. The first purchase period begins January 1 and ends June 10, and the second purchase period begins July 1 and ends December 10. The purchase price for common stock under the plan is \n85\n% of the lesser of the fair market value of the Company's common stock on the first or the last day of the applicable purchase period. The offering dates, purchase dates and duration of purchase periods may be changed if the change is announced prior to the beginning of the affected date or purchase period. The Company issued \n19,014\n, \n23,059\n and \n20,837\n shares and recognized compensation expense of $\n859,000\n, $\n911,000\n and $\n564,000\n under the ESPP for the years ended December 31, 2024, 2023 and 2022, respectively. The Company accounts for transactions under the ESPP using the fair value method prescribed by accounting guidance applicable to entities that use employee share purchase plans.\n10. \nRelated Party Arrangements\nUnconsolidated Entities\nThe Company manages unconsolidated real estate entities and provides other real estate related services to third parties, for which it receives asset management, property management, construction, development and redevelopment fee revenue. From these entities, the Company earned fees of $\n7,081,000\n, $\n7,722,000\n and $\n6,333,000\n for the years ended December 31, 2024, 2023 and 2022, respectively. In addition, the Company had outstanding receivables associated with its property and construction management roles of $\n1,680,000\n and $\n7,946,000\n as of December 31, 2024 and 2023, respectively.\nDirector Compensation\nDirectors of the Company who are also employees receive no additional compensation for their services as a director. Following each annual meeting of stockholders, non-employee directors receive (i) a number of shares of restricted stock (or deferred stock units) having a value of $\n190,000\n and (ii) a cash payment of $\n100,000\n, payable in equal quarterly installments of \nF-34\n \nTable of Contents\n$\n25,000\n. The number of shares of restricted stock (or deferred stock units) is calculated based on the closing price on the day of the award. Non-employee directors may elect to receive all or a portion of cash payments in the form of deferred stock units. Additionally, the non-executive Chairman receives an additional annual fee of $\n250,000\n payable in equal quarterly installments of $\n62,500\n, the Lead Independent Director receives in the aggregate an additional annual fee of $\n50,000\n payable in equal quarterly installments of $\n12,500\n, the non-employee director serving as the chairperson of the Audit Committee receives an additional annual fee of $\n30,000\n per year payable in equal quarterly installments of $\n7,500\n, the non-employee director serving as the chairperson of the Compensation Committee receives an additional annual fee of $\n25,000\n per year payable in equal quarterly installments of $\n6,250\n and the Nominating, Governance and Corporate Responsibility and Investment and Finance Committee chairpersons receive an additional annual fee of $\n20,000\n payable in equal quarterly installments of $\n5,000\n.\nThe Company recorded non-employee director compensation expense relating to restricted stock grants and deferred stock units in the amount of $\n2,397,000\n, $\n2,446,000\n and $\n2,228,000\n for the years ended December 31, 2024, 2023 and 2022, respectively, as a component of general and administrative expense. Deferred compensation relating to these restricted stock grants and deferred stock units to non-employee directors was $\n786,000\n, $\n799,000\n and $\n794,000\n on December 31, 2024, 2023 and 2022, respectively, reported as a component of prepaid expenses and other assets on the accompanying Consolidated Balance Sheets.\n \n11. \nFair Value\nFinancial Instruments Carried at Fair Value\nDerivative Financial Instruments\nHedging Derivatives are carried at fair value in the Company's financial statements. The Company minimizes its credit risk on these transactions by dealing with major, creditworthy financial institutions which have an A or better credit rating by the Standard & Poor's Ratings Group or equivalent, and monitors the credit ratings of counterparties and the exposure of the Company to any single entity. The Company believes the likelihood of realizing losses from counterparty nonperformance is remote. The Company determined that the majority of the inputs used to value its derivatives fall within Level 2 of the fair value hierarchy, such as interest rate, term to maturity and volatility. The Hedging Derivatives credit valuation adjustments associated with its derivatives use Level 3 inputs, such as estimates of current credit spreads, which the Company concluded are not significant. As a result, the Company determined that its derivative valuations are classified in Level 2 of the fair value hierarchy.\nThe following table summarizes the consolidated derivative positions at December 31, 2024 (dollars in thousands):\nNon-designated Hedges\nCash Flow Hedges\nInterest Rate Caps\nInterest Rate Swaps\nNotional balance\n$\n391,846\n \n$\n100,000\n \nWeighted average interest rate (1)\n5.2\n \n%\nN/A\nWeighted average capped/swapped interest rate\n6.7\n \n%\n3.2\n \n%\nEarliest maturity date\nFebruary 2026\nJune 2025\nLatest maturity date\nJanuary 2027\nJanuary 2026\n_________________________________\n(1)     For debt hedged by interest rate caps, represents the weighted average interest rate on the hedged debt prior to any impact of the associated interest rate caps.\nThe following derivative activity occurred during the year ended December 31, 2024:\n•\nIn connection with the issuance of the Company's $\n400,000,000\n unsecured notes in May 2024 maturing in 2034, the Company terminated $\n250,000,000\n of forward interest rate swap agreements designated as cash flow hedges of the interest rate variability on the issuance of unsecured notes, receiving payments of $\n16,839,000\n which will be recognized over the life of the unsecured notes as a reduction in the effective interest rate. Of the $\n250,000,000\n forward interest rate swap agreements terminated, $\n50,000,000\n were entered into during the year ended December 31, 2024. The Company has deferred these gains in accumulated other comprehensive income on the accompanying Consolidated Balance Sheets, and is recognizing the impact as a component of interest expense, net, over the term of the respective hedged debt.\nF-35\nTable of Contents\n•\nIn addition to the activity above, the Company entered into and had outstanding $\n100,000,000\n of forward interest rate swap agreements to reduce the impact of variability in interest rates on a portion of the Company's anticipated future debt issuance activity through December 31, 2025. The Company expects to cash settle the swaps and either pay or receive cash for the then current fair value. Assuming the Company issues the debt as expected, the hedging impact from these positions will then be recognized over the life of the issued debt as a yield adjustment.\nThe Company had certain derivatives not designated as hedges during the years ended December 31, 2024, 2023 and 2022, for which fair value changes during each of the respective years were not material.\nCash flow hedge gains reclassified from accumulated other comprehensive income into earnings were $\n471,000\n for the year ended December 31, 2024. Cash flow hedge losses reclassified from accumulated other comprehensive income into earnings were $\n1,360,000\n and $\n3,883,000\n for the years ended December 31, 2023 and 2022, respectively.\nThe Company anticipates reclassifying approximately $\n1,094,000\n of net hedging gains from accumulated other comprehensive income into earnings within the next 12 months as an offset to the hedged item during this period.\nFinancial Instruments Not Carried at Fair Value\nCash, Cash Equivalents and Restricted Cash\nCash, cash equivalent and restricted cash balances are held with various financial institutions within accounts designed to preserve principal. The Company monitors credit ratings of these financial institutions and the concentration of cash, cash equivalents and restricted cash balances with any one financial institution and believes the likelihood of realizing material losses related to cash, cash equivalent and restricted cash balances is remote. Cash, cash equivalents and restricted cash are carried at their face amounts, which reasonably approximate their fair values and are Level 1 within the fair value hierarchy.\nOther Financial Instruments\nRents and other receivables and prepaid expenses, accounts and construction payable and accrued expenses and other liabilities are carried at their face amounts, which reasonably approximate their fair values. The Company determined that its notes receivables approximate fair value, because interest rates, yields and other terms are consistent with interest rates, yields and other terms currently available for similar instruments and are considered to be a Level 2 price within the fair value hierarchy.\nEquity Securities \nThe Company has direct equity investments in property technology and environmentally focused companies. These investments are accounted for using the measurement alternative and are valued at the market price of observable transactions. \nIndebtedness\nThe Company values its fixed rate unsecured notes using quoted market prices, a Level 1 price within the fair value hierarchy. The Company values its mortgage notes payable and any outstanding amounts under the Credit Facility and Commercial Paper Program using a discounted cash flow analysis on the expected cash flows of each instrument. This analysis reflects the contractual terms of the instrument, including the period to maturity, and uses observable market-based inputs, including interest rate curves. The process also considers credit valuation adjustments to appropriately reflect the Company's nonperformance risk. The Company has concluded that the value of its mortgage notes payable and any outstanding amounts under the Credit Facility and Commercial Paper Program are Level 2 prices as the majority of the inputs used to value its positions fall within Level 2 of the fair value hierarchy.\nFinancial Instruments Measured/Disclosed at Fair Value on a Recurring Basis\nThe following tables summarize the classification between the three levels of the fair value hierarchy of the Company's financial instruments measured/disclosed at fair value on a recurring basis (dollars in thousands):\nF-36\nTable of Contents\nDescription\nTotal Fair\nValue\nQuoted Prices\nin Active\nMarkets for\nIdentical Assets\n(Level 1)\nSignificant\nOther\nObservable\nInputs\n(Level 2)\nSignificant\nUnobservable\nInputs\n(Level 3)\n \nDecember 31, 2024\nAssets\nInvestments\nNotes Receivable, net\n$\n223,896\n \n$\n— \n$\n223,896\n \n$\n— \nNon-Designated Hedges\n  Interest Rate Caps\n24\n \n— \n24\n \n— \nInterest Rate Swaps - Assets\n6,821\n \n— \n6,821\n \n— \nTotal Assets\n$\n230,741\n \n$\n—\n \n$\n230,741\n \n$\n—\n \nLiabilities\nIndebtedness\n  Fixed rate unsecured notes\n$\n6,796,066\n \n$\n6,796,066\n \n$\n— \n$\n— \n  Mortgage notes payable and Commercial Paper Program\n660,170\n \n— \n660,170\n \n— \nTotal Liabilities\n$\n7,456,236\n \n$\n6,796,066\n \n$\n660,170\n \n$\n—\n \nDecember 31, 2023\nAssets\nInvestments\nNotes Receivable, net\n$\n118,127\n \n$\n— \n$\n118,127\n \n$\n— \nNon-Designated Hedges\nInterest Rate Caps\n85\n \n— \n85\n \n— \nInterest Rate Swaps - Assets\n5,163\n \n— \n5,163\n \n— \nTotal Assets\n$\n123,375\n \n$\n—\n \n$\n123,375\n \n$\n—\n \nLiabilities\nInterest Rate Swaps - Liabilities\n$\n162\n \n$\n— \n$\n162\n \n$\n— \nIndebtedness\n  Fixed rate unsecured notes\n6,716,631\n \n6,716,631\n \n— \n— \n  Mortgage notes payable and Commercial Paper Program\n644,313\n \n— \n644,313\n \n— \nTotal Liabilities\n$\n7,361,106\n \n$\n6,716,631\n \n$\n644,475\n \n$\n—\n \nF-37\nTable of Contents\n12. \nSubsequent Events\nThe Company has evaluated subsequent events, through the date on which this Form 10-K was filed, the date on which these financial statements were issued, and identified the items below for discussion. In 2025, the Company had the following activity:\n•\nIn January 2025, the Company sold Avalon Wilton on River Road, located in Wilton, CT, containing \n102\n apartment homes for $\n65,100,000\n. This sale marks the Company's exit from the Connecticut market. \n•\nOn January 9, 2025, the District of Columbia filed an amended complaint in the D.C. Antitrust Litigation, which included the Company as a defendant, and the Company has filed a motion to dismiss, which has not been ruled on yet as of this date. While the Company intends to vigorously defend against the D.C. Antitrust Litigation, given the early stage of the lawsuit, the Company is unable to predict the outcome or estimate the amount of loss, if any, that may result from the lawsuit.\n•\nOn January 15, 2025, the Office of the Attorney General of the State of Maryland filed a suit similar to the D.C. Antitrust Litigation in which a number of owners and/or operators of multifamily properties in the State of Maryland, including the Company, have been named. While the Company intends to vigorously defend against the Maryland Antitrust Litigation, given the early stage of the lawsuit, the Company is unable to predict the outcome or estimate the amount of loss, if any, that may result from the lawsuit.\n•\nThe Company entered into agreements to acquire a total of \neight\n apartment communities in the Company’s Texas expansion market. The first agreement is to acquire \ntwo\n apartment communities containing \n857\n apartment homes in Austin, TX for an aggregate cash purchase price of $\n187,000,000\n, with an expected closing on or about March 31, 2025. The second agreement is to acquire, through a newly formed partnership (the “DownREIT”), \nsix\n apartment communities containing a total of \n1,844\n homes in the Dallas-Fort Worth metropolitan area for $\n431,500,000\n, with the consideration composed of a cash payment of between $\n193,000,000\n and $\n220,000,000\n with the balance of the consideration in the form of limited partnership interests, the “DownREIT units”, valued at $\n225\n per unit. The DownREIT units will be entitled to receive quarterly distributions at the same rate as quarterly dividends on a share of the Company’s common stock. Beginning on the one-year anniversary of the closing date, holders of DownREIT units may present some or all of their units for redemption, being entitled to receive a cash amount per unit that is related to the then fair market value of the Company’s common stock, except that in lieu of such cash redemption the Company may elect to acquire units presented for redemption in exchange for an equal number of shares of the Company’s common stock. The acquisition of the \nsix\n properties through the DownREIT is expected to close in the second quarter of 2025.\n \nF-38\nTable of Contents\nAVALONBAY COMMUNITIES, INC.\nREAL ESTATE AND ACCUMULATED DEPRECIATION\nDecember 31, 2024\n(Dollars in thousands)\n2024\n2023\n2024\n \n \nInitial Cost\n \nTotal Cost\n \n \n \n \n \nCommunity\nCity and state\n# of homes\nLand and Improvements\nBuilding /\nConstruction in\nProgress &\nImprovements\nCosts\nSubsequent to\nAcquisition /\nConstruction\nLand and Improvements\nBuilding /\nConstruction in\nProgress &\nImprovements\nTotal\nAccumulated\nDepreciation\nTotal Cost,\nNet of\nAccumulated\nDepreciation\nTotal Cost,\nNet of\nAccumulated\nDepreciation\nEncumbrances\nYear of\nCompletion /\nAcquisition\nSAME STORE\nNEW ENGLAND\nAvalon at Lexington\nLexington, MA\n198\n \n$\n2,124\n \n$\n12,561\n \n$\n17,402\n \n$\n2,124\n \n$\n29,963\n \n$\n32,087\n \n$\n22,690\n \n$\n9,397\n \n$\n9,525\n \n$\n—\n \n1994\neaves Wilmington\nWilmington, MA\n204\n \n2,129\n \n17,563\n \n11,176\n \n2,129\n \n28,739\n \n30,868\n \n21,912\n \n8,956\n \n9,537\n \n—\n \n1999\neaves Quincy\nQuincy, MA\n245\n \n1,743\n \n14,662\n \n18,169\n \n1,743\n \n32,831\n \n34,574\n \n24,267\n \n10,307\n \n11,013\n \n—\n \n1986/1995\neaves Wilmington West\nWilmington, MA\n120\n \n3,318\n \n13,465\n \n5,576\n \n3,318\n \n19,041\n \n22,359\n \n13,728\n \n8,631\n \n9,274\n \n—\n \n2002\nAvalon at The Pinehills\nPlymouth, MA\n192\n \n6,876\n \n30,313\n \n10,858\n \n6,876\n \n41,171\n \n48,047\n \n24,282\n \n23,765\n \n25,089\n \n—\n \n2004\neaves Peabody\nPeabody, MA\n286\n \n4,645\n \n18,919\n \n18,119\n \n4,645\n \n37,038\n \n41,683\n \n23,901\n \n17,782\n \n18,513\n \n—\n \n1962/2004\nAvalon at Bedford Center\nBedford, MA\n139\n \n4,258\n \n20,551\n \n6,130\n \n4,258\n \n26,681\n \n30,939\n \n18,701\n \n12,238\n \n13,597\n \n—\n \n2006\nAvalon at Chestnut Hill\nChestnut Hill, MA\n204\n \n14,572\n \n45,868\n \n19,228\n \n14,572\n \n65,096\n \n79,668\n \n36,561\n \n43,107\n \n42,399\n \n—\n \n2007\nAvalon at Lexington Hills\nLexington, MA\n387\n \n8,691\n \n78,502\n \n20,773\n \n8,691\n \n99,275\n \n107,966\n \n60,505\n \n47,461\n \n49,422\n \n—\n \n2008\nAvalon Acton\nActon, MA\n380\n \n13,124\n \n48,630\n \n13,506\n \n13,124\n \n62,136\n \n75,260\n \n35,767\n \n39,493\n \n42,212\n \n45,000\n \n2008\nAvalon at the Hingham Shipyard\nHingham, MA\n235\n \n12,218\n \n41,516\n \n16,043\n \n12,218\n \n57,559\n \n69,777\n \n34,592\n \n35,185\n \n36,942\n \n—\n \n2009\nAvalon Acton II\nActon, MA\n86\n \n1,723\n \n29,375\n \n2\n \n1,723\n \n29,377\n \n31,100\n \n4,634\n \n26,466\n \n27,592\n \n—\n \n2021\nAvalon Northborough\nNorthborough, MA\n382\n \n8,144\n \n52,178\n \n11,286\n \n8,144\n \n63,464\n \n71,608\n \n33,061\n \n38,547\n \n39,859\n \n—\n \n2009\nAvalon Exeter (1)\nBoston, MA\n187\n \n—\n \n109,978\n \n4,687\n \n—\n \n114,665\n \n114,665\n \n41,502\n \n73,163\n \n76,238\n \n—\n \n2014\nAvalon Natick\nNatick, MA\n407\n \n15,645\n \n64,845\n \n5,693\n \n15,645\n \n70,538\n \n86,183\n \n28,327\n \n57,856\n \n59,989\n \n—\n \n2013\nAvalon at Assembly Row\nSomerville, MA\n195\n \n8,599\n \n52,454\n \n9,215\n \n8,599\n \n61,669\n \n70,268\n \n23,716\n \n46,552\n \n48,360\n \n—\n \n2015\nAVA Somerville\nSomerville, MA\n250\n \n10,944\n \n56,457\n \n8,235\n \n10,944\n \n64,692\n \n75,636\n \n24,885\n \n50,751\n \n52,496\n \n—\n \n2015\nAVA Back Bay\nBoston, MA\n271\n \n9,034\n \n36,536\n \n53,915\n \n9,034\n \n90,451\n \n99,485\n \n56,832\n \n42,653\n \n45,312\n \n—\n \n1968/1998\nAvalon at Prudential Center II\nBoston, MA\n266\n \n8,776\n \n35,479\n \n66,539\n \n8,776\n \n102,018\n \n110,794\n \n58,584\n \n52,210\n \n55,229\n \n—\n \n1968/1998\nAvalon at Prudential Center I\nBoston, MA\n243\n \n8,002\n \n32,349\n \n58,209\n \n8,002\n \n90,558\n \n98,560\n \n51,299\n \n47,261\n \n49,935\n \n—\n \n1968/1998\neaves Burlington\nBurlington, MA\n203\n \n7,714\n \n32,499\n \n10,617\n \n7,714\n \n43,116\n \n50,830\n \n18,593\n \n32,237\n \n33,627\n \n—\n \n1988/2012\nAvalon Burlington\nBurlington, MA\n312\n \n15,600\n \n63,549\n \n20,049\n \n15,600\n \n83,598\n \n99,198\n \n33,874\n \n65,324\n \n65,744\n \n—\n \n1989/2013\nAvalon Marlborough\nMarlborough, MA\n350\n \n15,367\n \n59,723\n \n4,722\n \n15,367\n \n64,445\n \n79,812\n \n21,560\n \n58,252\n \n59,831\n \n—\n \n2015\nAvalon North Station\nBoston, MA\n503\n \n22,796\n \n247,270\n \n1,254\n \n22,796\n \n248,524\n \n271,320\n \n66,675\n \n204,645\n \n212,709\n \n—\n \n2017\nAvalon Framingham\nFramingham, MA\n180\n \n9,315\n \n34,604\n \n797\n \n9,315\n \n35,401\n \n44,716\n \n11,562\n \n33,154\n \n34,220\n \n—\n \n2015\nAvalon Quincy\nQuincy, MA\n395\n \n14,694\n \n79,655\n \n1,613\n \n14,694\n \n81,268\n \n95,962\n \n23,354\n \n72,608\n \n75,117\n \n—\n \n2017\nAvalon Easton\nSouth Easton, MA\n290\n \n3,170\n \n60,785\n \n1,874\n \n3,170\n \n62,659\n \n65,829\n \n17,022\n \n48,807\n \n50,814\n \n—\n \n2017\nAvalon Residences at the Hingham Shipyard\nHingham, MA\n190\n \n8,998\n \n55,366\n \n1,083\n \n8,998\n \n56,449\n \n65,447\n \n13,199\n \n52,248\n \n54,091\n \n—\n \n2019\nAvalon Sudbury\nSudbury, MA\n250\n \n20,280\n \n66,529\n \n1,301\n \n20,280\n \n67,830\n \n88,110\n \n16,367\n \n71,743\n \n73,754\n \n—\n \n2019\nAvalon Saugus\nSaugus, MA\n280\n \n17,808\n \n72,196\n \n1,591\n \n17,808\n \n73,787\n \n91,595\n \n15,891\n \n75,704\n \n78,449\n \n—\n \n2019\nF-39\nTable of Contents\nAVALONBAY COMMUNITIES, INC.\nREAL ESTATE AND ACCUMULATED DEPRECIATION (Continued)\nDecember 31, 2024\n(Dollars in thousands)\n2024\n2023\n2024\n \n \nInitial Cost\n \nTotal Cost\n \n \n \n \n \nCommunity\nCity and state\n# of homes\nLand and Improvements\nBuilding /\nConstruction in\nProgress &\nImprovements\nCosts\nSubsequent to\nAcquisition /\nConstruction\nLand and Improvements\nBuilding /\nConstruction in\nProgress &\nImprovements\nTotal\nAccumulated\nDepreciation\nTotal Cost,\nNet of\nAccumulated\nDepreciation\nTotal Cost,\nNet of\nAccumulated\nDepreciation\nEncumbrances\nYear of\nCompletion /\nAcquisition\nAvalon Norwood\nNorwood, MA\n198\n \n$\n9,478\n \n$\n51,762\n \n$\n328\n \n$\n9,478\n \n$\n52,090\n \n$\n61,568\n \n$\n10,614\n \n$\n50,954\n \n$\n52,943\n \n$\n—\n \n2020\nAvalon Marlborough II\nMarlborough, MA\n123\n \n5,523\n \n36,175\n \n63\n \n5,523\n \n36,238\n \n41,761\n \n6,015\n \n35,746\n \n37,343\n \n—\n \n2020\nAvalon Easton II\nSouth Easton, MA\n44\n \n570\n \n14,090\n \n3\n \n570\n \n14,093\n \n14,663\n \n1,688\n \n12,975\n \n13,506\n \n—\n \n2021\nAvalon Woburn\nWoburn, MA\n350\n \n21,576\n \n97,848\n \n1,094\n \n21,576\n \n98,942\n \n120,518\n \n12,242\n \n108,276\n \n111,969\n \n—\n \n2022\nAVA North Point\nCambridge, MA\n265\n \n31,263\n \n83,829\n \n551\n \n31,263\n \n84,380\n \n115,643\n \n19,307\n \n96,336\n \n99,358\n \n—\n \n2018/2019\nAvalon Bear Hill\nWaltham, MA\n324\n \n27,350\n \n98,537\n \n28,342\n \n27,350\n \n126,879\n \n154,229\n \n55,941\n \n98,288\n \n102,066\n \n—\n \n1999/2013\nTOTAL NEW ENGLAND\n9,134\n \n$\n376,067\n \n$\n1,966,618\n \n$\n450,043\n \n$\n376,067\n \n$\n2,416,661\n \n$\n2,792,728\n \n$\n983,650\n \n$\n1,809,078\n \n$\n1,878,074\n \n$\n45,000\n \nMETRO NY/NJ\nNew York City, NY\nAvalon Riverview (3)\nLong Island City, NY\n372\n \n$\n—\n \n$\n94,061\n \n$\n19,316\n \n$\n—\n \n$\n113,377\n \n$\n113,377\n \n$\n83,944\n \n$\n29,433\n \n$\n30,568\n \n$\n—\n \n2002\nAvalon Riverview North (3)\nLong Island City, NY\n602\n \n—\n \n165,932\n \n20,442\n \n—\n \n186,374\n \n186,374\n \n104,788\n \n81,586\n \n86,853\n \n—\n \n2008\nAVA Fort Greene\nBrooklyn, NY\n631\n \n83,038\n \n216,802\n \n12,951\n \n83,038\n \n229,753\n \n312,791\n \n114,772\n \n198,019\n \n205,038\n \n—\n \n2010\nAVA DoBro\nBrooklyn, NY\n500\n \n76,127\n \n206,762\n \n1,950\n \n76,127\n \n208,712\n \n284,839\n \n63,795\n \n221,044\n \n227,187\n \n—\n \n2017\nAvalon Willoughby Square\nBrooklyn, NY\n326\n \n49,635\n \n134,840\n \n1,323\n \n49,635\n \n136,163\n \n185,798\n \n39,707\n \n146,091\n \n150,409\n \n—\n \n2017\nAvalon Brooklyn Bay\nBrooklyn, NY\n180\n \n9,690\n \n84,361\n \n822\n \n9,690\n \n85,183\n \n94,873\n \n22,599\n \n72,274\n \n74,893\n \n—\n \n2018\nAvalon Midtown West\nNew York, NY\n550\n \n154,730\n \n191,891\n \n41,995\n \n154,730\n \n233,886\n \n388,616\n \n94,992\n \n293,624\n \n301,207\n \n69,800\n \n1998/2013\nAvalon Clinton North\nNew York, NY\n339\n \n84,069\n \n111,729\n \n11,981\n \n84,069\n \n123,710\n \n207,779\n \n52,790\n \n154,989\n \n158,577\n \n126,400\n \n2008/2013\nAvalon Clinton South\nNew York, NY\n288\n \n71,421\n \n94,948\n \n6,383\n \n71,421\n \n101,331\n \n172,752\n \n44,285\n \n128,467\n \n131,292\n \n104,500\n \n2007/2013\nTotal New York City, NY\n3,788\n \n$\n528,710\n \n$\n1,301,326\n \n$\n117,163\n \n$\n528,710\n \n$\n1,418,489\n \n$\n1,947,199\n \n$\n621,672\n \n$\n1,325,527\n \n$\n1,366,024\n \n$\n300,700\n \nNew York - Suburban\nAvalon Commons (2)\nSmithtown, NY\n312\n \n$\n4,679\n \n$\n27,811\n \n$\n18,337\n \n$\n4,679\n \n$\n46,148\n \n$\n50,827\n \n$\n34,630\n \n$\n16,197\n \n$\n14,581\n \n$\n—\n \n1997\nAvalon Melville\nMelville, NY\n494\n \n9,228\n \n50,059\n \n27,347\n \n9,228\n \n77,406\n \n86,634\n \n57,954\n \n28,680\n \n29,818\n \n—\n \n1997\nAvalon White Plains\nWhite Plains, NY\n407\n \n15,391\n \n137,312\n \n4,951\n \n15,391\n \n142,263\n \n157,654\n \n75,367\n \n82,287\n \n85,578\n \n—\n \n2009\nAvalon Rockville Centre I\nRockville Centre, NY\n349\n \n32,212\n \n78,806\n \n7,947\n \n32,212\n \n86,753\n \n118,965\n \n42,051\n \n76,914\n \n80,063\n \n—\n \n2012\nAvalon Garden City\nGarden City, NY\n204\n \n18,205\n \n49,301\n \n2,531\n \n18,205\n \n51,832\n \n70,037\n \n22,187\n \n47,850\n \n49,279\n \n—\n \n2013\nAvalon Huntington Station\nHuntington Station, NY\n303\n \n21,899\n \n58,429\n \n3,442\n \n21,899\n \n61,871\n \n83,770\n \n22,259\n \n61,511\n \n62,972\n \n—\n \n2014\nAvalon Great Neck\nGreat Neck, NY\n191\n \n14,777\n \n65,412\n \n786\n \n14,777\n \n66,198\n \n80,975\n \n18,503\n \n62,472\n \n64,333\n \n—\n \n2017\nAvalon Rockville Centre II\nRockville Centre, NY\n165\n \n7,534\n \n50,981\n \n723\n \n7,534\n \n51,704\n \n59,238\n \n14,112\n \n45,126\n \n46,758\n \n—\n \n2017\nAvalon Somers\nBaldwin Place, NY\n152\n \n5,608\n \n40,591\n \n51\n \n5,608\n \n40,642\n \n46,250\n \n10,951\n \n35,299\n \n36,579\n \n—\n \n2018\nAvalon Yonkers\nYonkers, NY\n590\n \n28,324\n \n173,748\n \n78\n \n28,324\n \n173,826\n \n202,150\n \n29,553\n \n172,597\n \n178,057\n \n—\n \n2021\nAvalon Westbury\nWestbury, NY\n396\n \n69,620\n \n49,350\n \n15,809\n \n69,620\n \n65,159\n \n134,779\n \n34,817\n \n99,962\n \n101,385\n \n—\n \n2006/2013\nTotal New York - Suburban\n3,563\n \n$\n227,477\n \n$\n781,800\n \n$\n82,002\n \n$\n227,477\n \n$\n863,802\n \n$\n1,091,279\n \n$\n362,384\n \n$\n728,895\n \n$\n749,403\n \n$\n—\n \nNew Jersey\nAvalon Cove\nJersey City, NJ\n504\n \n$\n8,760\n \n$\n82,422\n \n$\n36,304\n \n$\n8,760\n \n$\n118,726\n \n$\n127,486\n \n$\n97,240\n \n$\n30,246\n \n$\n33,173\n \n$\n—\n \n1997\nF-40\nTable of Contents\nAVALONBAY COMMUNITIES, INC.\nREAL ESTATE AND ACCUMULATED DEPRECIATION (Continued)\nDecember 31, 2024\n(Dollars in thousands)\n2024\n2023\n2024\n \n \nInitial Cost\n \nTotal Cost\n \n \n \n \n \nCommunity\nCity and state\n# of homes\nLand and Improvements\nBuilding /\nConstruction in\nProgress &\nImprovements\nCosts\nSubsequent to\nAcquisition /\nConstruction\nLand and Improvements\nBuilding /\nConstruction in\nProgress &\nImprovements\nTotal\nAccumulated\nDepreciation\nTotal Cost,\nNet of\nAccumulated\nDepreciation\nTotal Cost,\nNet of\nAccumulated\nDepreciation\nEncumbrances\nYear of\nCompletion /\nAcquisition\neaves West Windsor\nWest Windsor, NJ\n512\n \n$\n5,585\n \n$\n21,752\n \n$\n36,652\n \n$\n5,585\n \n$\n58,404\n \n$\n63,989\n \n$\n40,726\n \n$\n23,263\n \n$\n24,499\n \n$\n—\n \n1988/1993\nAvalon at Edgewater I\nEdgewater, NJ\n168\n \n5,982\n \n24,389\n \n11,491\n \n5,982\n \n35,880\n \n41,862\n \n25,485\n \n16,377\n \n17,384\n \n—\n \n2002\nAvalon at Florham Park\nFlorham Park, NJ\n270\n \n6,647\n \n34,906\n \n18,662\n \n6,647\n \n53,568\n \n60,215\n \n38,036\n \n22,179\n \n23,180\n \n—\n \n2001\nAvalon North Bergen\nNorth Bergen, NJ\n164\n \n8,984\n \n30,994\n \n1,658\n \n8,984\n \n32,652\n \n41,636\n \n14,366\n \n27,270\n \n28,298\n \n—\n \n2012\nAvalon at Wesmont Station I\nWood-Ridge, NJ\n266\n \n14,682\n \n41,610\n \n5,435\n \n14,682\n \n47,045\n \n61,727\n \n20,566\n \n41,161\n \n42,133\n \n—\n \n2012\nAvalon at Wesmont Station II\nWood-Ridge, NJ\n140\n \n6,502\n \n16,851\n \n934\n \n6,502\n \n17,785\n \n24,287\n \n7,378\n \n16,909\n \n17,524\n \n—\n \n2013\nAvalon Bloomingdale\nBloomingdale, NJ\n174\n \n3,006\n \n27,801\n \n1,396\n \n3,006\n \n29,197\n \n32,203\n \n11,273\n \n20,930\n \n21,732\n \n—\n \n2014\nAvalon Wharton\nWharton, NJ\n247\n \n2,273\n \n48,609\n \n1,732\n \n2,273\n \n50,341\n \n52,614\n \n17,783\n \n34,831\n \n36,634\n \n—\n \n2015\nAvalon Bloomfield Station (1)\nBloomfield, NJ\n224\n \n10,701\n \n36,430\n \n2,473\n \n10,701\n \n38,903\n \n49,604\n \n12,888\n \n36,716\n \n37,961\n \n—\n \n2015\nAvalon Roseland\nRoseland, NJ\n136\n \n11,288\n \n34,868\n \n1,252\n \n11,288\n \n36,120\n \n47,408\n \n12,060\n \n35,348\n \n36,281\n \n—\n \n2015\nAvalon Princeton\n Princeton, NJ\n280\n \n26,461\n \n68,003\n \n2,179\n \n26,461\n \n70,182\n \n96,643\n \n20,774\n \n75,869\n \n77,831\n \n—\n \n2017\nAvalon Union\nUnion, NJ\n202\n \n11,695\n \n36,315\n \n1,874\n \n11,695\n \n38,189\n \n49,884\n \n11,903\n \n37,981\n \n38,919\n \n—\n \n2016\nAvalon Hoboken\nHoboken, NJ\n217\n \n37,237\n \n94,990\n \n3,375\n \n37,237\n \n98,365\n \n135,602\n \n35,951\n \n99,651\n \n102,490\n \n—\n \n2008/2016\nAvalon Maplewood\nMaplewood, NJ\n235\n \n15,179\n \n49,425\n \n3,065\n \n15,179\n \n52,490\n \n67,669\n \n14,974\n \n52,695\n \n54,149\n \n—\n \n2018\nAvalon Boonton\nBoonton, NJ\n350\n \n3,595\n \n89,407\n \n2,055\n \n3,595\n \n91,462\n \n95,057\n \n19,510\n \n75,547\n \n78,339\n \n—\n \n2019\nAvalon Teaneck\nTeaneck, NJ\n248\n \n12,588\n \n60,257\n \n139\n \n12,588\n \n60,396\n \n72,984\n \n12,471\n \n60,513\n \n62,773\n \n—\n \n2020\nAvalon Piscataway\nPiscataway, NJ\n360\n \n14,329\n \n75,897\n \n1,473\n \n14,329\n \n77,370\n \n91,699\n \n18,095\n \n73,604\n \n75,411\n \n—\n \n2019\nAvalon Old Bridge\nOld Bridge, NJ\n252\n \n6,895\n \n64,907\n \n693\n \n6,895\n \n65,600\n \n72,495\n \n10,673\n \n61,822\n \n64,494\n \n—\n \n2021\nAvalon at Edgewater II\nEdgewater, NJ\n240\n \n8,605\n \n60,809\n \n329\n \n8,605\n \n61,138\n \n69,743\n \n15,672\n \n54,071\n \n55,853\n \n—\n \n2018\nTotal New Jersey\n5,189\n \n$\n220,994\n \n$\n1,000,642\n \n$\n133,171\n \n$\n220,994\n \n$\n1,133,813\n \n$\n1,354,807\n \n$\n457,824\n \n$\n896,983\n \n$\n929,058\n \n$\n—\n \nTOTAL METRO NY/NJ\n12,540\n \n$\n977,181\n \n$\n3,083,768\n \n$\n332,336\n \n$\n977,181\n \n$\n3,416,104\n \n$\n4,393,285\n \n$\n1,441,880\n \n$\n2,951,405\n \n$\n3,044,485\n \n$\n300,700\n \nMID-ATLANTIC\nWashington Metro/Baltimore, MD\nAvalon at Foxhall (2) \nWashington, D.C.\n308\n \n$\n6,848\n \n$\n27,614\n \n$\n27,641\n \n$\n6,848\n \n$\n55,255\n \n$\n62,103\n \n$\n45,229\n \n$\n16,874\n \n$\n18,123\n \n$\n—\n \n1982/1994\nAvalon at Gallery Place\nWashington, D.C.\n203\n \n8,800\n \n39,658\n \n7,353\n \n8,800\n \n47,011\n \n55,811\n \n33,431\n \n22,380\n \n23,933\n \n—\n \n2003\nAVA H Street\nWashington, D.C.\n138\n \n7,425\n \n25,282\n \n1,530\n \n7,425\n \n26,812\n \n34,237\n \n11,060\n \n23,177\n \n23,334\n \n—\n \n2013\nAvalon The Albemarle\nWashington DC\n234\n \n25,140\n \n55,945\n \n8,135\n \n25,140\n \n64,080\n \n89,220\n \n30,539\n \n58,681\n \n60,875\n \n—\n \n1966/2013\neaves Tunlaw Gardens\nWashington, D.C.\n166\n \n16,430\n \n24,602\n \n1,706\n \n16,430\n \n26,308\n \n42,738\n \n11,950\n \n30,788\n \n31,231\n \n—\n \n1944/2013\nThe Statesman\nWashington, D.C.\n281\n \n38,140\n \n38,732\n \n4,137\n \n38,140\n \n42,869\n \n81,009\n \n20,620\n \n60,389\n \n61,871\n \n—\n \n1961/2013\neaves Glover Park\nWashington, D.C.\n120\n \n9,580\n \n28,082\n \n1,532\n \n9,580\n \n29,614\n \n39,194\n \n13,789\n \n25,405\n \n26,198\n \n—\n \n1953/2013\nAVA Van Ness\nWashington, D.C.\n269\n \n22,890\n \n61,701\n \n23,324\n \n22,890\n \n85,025\n \n107,915\n \n33,784\n \n74,131\n \n76,501\n \n—\n \n1978/2013\nAvalon First and M\nWashington, D.C.\n469\n \n43,700\n \n156,300\n \n4,115\n \n43,700\n \n160,415\n \n204,115\n \n66,823\n \n137,292\n \n142,452\n \n—\n \n2012/2013\nAVA NoMa\nWashington, D.C.\n438\n \n25,246\n \n114,933\n \n2,595\n \n25,246\n \n117,528\n \n142,774\n \n34,236\n \n108,538\n \n111,563\n \n—\n \n2018\neaves Washingtonian Center\nNorth Potomac, MD\n288\n \n4,047\n \n18,553\n \n9,822\n \n4,047\n \n28,375\n \n32,422\n \n23,605\n \n8,817\n \n8,892\n \n—\n \n1996\neaves Columbia Town Center I\nColumbia, MD\n392\n \n8,802\n \n35,536\n \n17,794\n \n8,802\n \n53,330\n \n62,132\n \n33,957\n \n28,175\n \n28,778\n \n—\n \n1986/1993\nAvalon at Grosvenor Station\nNorth Bethesda, MD\n497\n \n29,159\n \n52,993\n \n12,951\n \n29,159\n \n65,944\n \n95,103\n \n44,836\n \n50,267\n \n50,315\n \n—\n \n2004\nF-41\nTable of Contents\nAVALONBAY COMMUNITIES, INC.\nREAL ESTATE AND ACCUMULATED DEPRECIATION (Continued)\nDecember 31, 2024\n(Dollars in thousands)\n2024\n2023\n2024\n \n \nInitial Cost\n \nTotal Cost\n \n \n \n \n \nCommunity\nCity and state\n# of homes\nLand and Improvements\nBuilding /\nConstruction in\nProgress &\nImprovements\nCosts\nSubsequent to\nAcquisition /\nConstruction\nLand and Improvements\nBuilding /\nConstruction in\nProgress &\nImprovements\nTotal\nAccumulated\nDepreciation\nTotal Cost,\nNet of\nAccumulated\nDepreciation\nTotal Cost,\nNet of\nAccumulated\nDepreciation\nEncumbrances\nYear of\nCompletion /\nAcquisition\nAvalon at Traville\nRockville, MD\n520\n \n$\n14,365\n \n$\n55,398\n \n$\n11,930\n \n$\n14,365\n \n$\n67,328\n \n$\n81,693\n \n$\n47,210\n \n$\n34,483\n \n$\n36,097\n \n$\n—\n \n2004\nAVA Wheaton\nWheaton, MD\n319\n \n6,494\n \n69,027\n \n343\n \n6,494\n \n69,370\n \n75,864\n \n19,023\n \n56,841\n \n58,982\n \n—\n \n2018\nKanso Twinbrook\nRockville, MD\n238\n \n9,151\n \n56,955\n \n53\n \n9,151\n \n57,008\n \n66,159\n \n8,546\n \n57,613\n \n59,823\n \n—\n \n2021\nAvalon Hunt Valley\nHunt Valley, MD\n332\n \n10,872\n \n62,974\n \n1,036\n \n10,872\n \n64,010\n \n74,882\n \n18,511\n \n56,371\n \n57,901\n \n—\n \n2017\nAvalon Laurel (2)\nLaurel, MD\n344\n \n10,130\n \n61,685\n \n4,210\n \n10,130\n \n65,895\n \n76,025\n \n18,473\n \n57,552\n \n56,200\n \n—\n \n2017\nAvalon Towson\nTowson, MD\n371\n \n12,906\n \n98,279\n \n32\n \n12,906\n \n98,311\n \n111,217\n \n17,471\n \n93,746\n \n97,691\n \n—\n \n2020\nAvalon Fairway Hills - Meadows\nColumbia, MD\n192\n \n2,323\n \n9,297\n \n9,542\n \n2,323\n \n18,839\n \n21,162\n \n13,275\n \n7,887\n \n7,475\n \n—\n \n1987/1996\nAvalon Fairway Hills - Woods\nColumbia, MD\n336\n \n3,958\n \n15,839\n \n17,016\n \n3,958\n \n32,855\n \n36,813\n \n22,948\n \n13,865\n \n14,722\n \n—\n \n1987/1996\nAvalon Arundel Crossing II\nLinthicum Heights, MD\n310\n \n12,208\n \n72,422\n \n986\n \n12,208\n \n73,408\n \n85,616\n \n20,996\n \n64,620\n \n66,852\n \n—\n \n2018/2018\nAvalon 555 President\nBaltimore, MD\n400\n \n13,168\n \n121,773\n \n84\n \n13,168\n \n121,857\n \n135,025\n \n21,282\n \n113,743\n \n118,797\n \n—\n \n2021\nKanso Silver Spring\nSilver Spring, MD\n151\n \n3,471\n \n42,108\n \n1,856\n \n3,471\n \n43,964\n \n47,435\n \n10,022\n \n37,413\n \n38,923\n \n—\n \n2009/2019\nAvalon Foundry Row\nOwings Mills, MD\n437\n \n11,132\n \n86,261\n \n5\n \n11,132\n \n86,266\n \n97,398\n \n12,118\n \n85,280\n \n88,864\n \n—\n \n2022\nAvalon Arundel Crossing\nLinthicum Heights, MD\n384\n \n9,933\n \n111,114\n \n777\n \n9,933\n \n111,891\n \n121,824\n \n20,862\n \n100,962\n \n105,866\n \n—\n \n2020/2021\nAvalon Russett\nLaurel, MD\n238\n \n10,200\n \n49,834\n \n6,437\n \n10,200\n \n56,271\n \n66,471\n \n25,479\n \n40,992\n \n41,769\n \n32,200\n \n1999/2013\neaves Fair Lakes\nFairfax, VA\n420\n \n6,096\n \n24,400\n \n16,364\n \n6,096\n \n40,764\n \n46,860\n \n33,232\n \n13,628\n \n15,311\n \n—\n \n1989/1996\nAVA Ballston\nArlington, VA\n344\n \n7,291\n \n29,177\n \n28,870\n \n7,291\n \n58,047\n \n65,338\n \n40,322\n \n25,016\n \n25,825\n \n—\n \n1990\neaves Fairfax City\nFairfax, VA\n141\n \n2,152\n \n8,907\n \n6,004\n \n2,152\n \n14,911\n \n17,063\n \n11,577\n \n5,486\n \n5,860\n \n—\n \n1988/1997\nAvalon Tysons Corner (2)\nTysons Corner, VA\n558\n \n13,851\n \n43,397\n \n25,232\n \n13,851\n \n68,629\n \n82,480\n \n48,808\n \n33,672\n \n29,733\n \n—\n \n1996\nAvalon at Arlington Square\nArlington, VA\n842\n \n22,041\n \n90,296\n \n41,915\n \n22,041\n \n132,211\n \n154,252\n \n85,469\n \n68,783\n \n70,724\n \n—\n \n2001\neaves Fairfax Towers\nFalls Church, VA\n415\n \n17,889\n \n74,727\n \n17,382\n \n17,889\n \n92,109\n \n109,998\n \n42,776\n \n67,222\n \n70,003\n \n—\n \n1978/2011\nAvalon Mosaic\nFairfax, VA\n531\n \n33,490\n \n75,801\n \n3,527\n \n33,490\n \n79,328\n \n112,818\n \n29,585\n \n83,233\n \n85,273\n \n—\n \n2014\nAvalon Potomac Yard\nAlexandria, VA\n323\n \n24,225\n \n84,530\n \n2,094\n \n24,225\n \n86,624\n \n110,849\n \n31,065\n \n79,784\n \n82,277\n \n—\n \n2014/2016\nAvalon Clarendon\nArlington, VA\n300\n \n22,573\n \n99,297\n \n8,198\n \n22,573\n \n107,495\n \n130,068\n \n38,282\n \n91,786\n \n94,537\n \n—\n \n2002/2016\nAvalon Dunn Loring\nVienna, VA\n440\n \n29,377\n \n120,884\n \n2,343\n \n29,377\n \n123,227\n \n152,604\n \n39,524\n \n113,080\n \n116,566\n \n—\n \n2012/2017\neaves Tysons Corner (2) \nVienna, VA\n217\n \n16,030\n \n47,572\n \n3,051\n \n16,030\n \n50,623\n \n66,653\n \n24,637\n \n42,016\n \n43,403\n \n—\n \n1980/2013\nAvalon Courthouse Place\nArlington, VA\n564\n \n56,550\n \n185,632\n \n13,819\n \n56,550\n \n199,451\n \n256,001\n \n86,376\n \n169,625\n \n175,646\n \n—\n \n1999/2013\nAvalon Arlington North\nArlington, VA\n228\n \n21,600\n \n59,076\n \n10,173\n \n21,600\n \n69,249\n \n90,849\n \n26,281\n \n64,568\n \n66,737\n \n—\n \n2014\nAvalon Reston Landing\nReston, VA\n400\n \n26,710\n \n86,934\n \n13,433\n \n26,710\n \n100,367\n \n127,077\n \n49,089\n \n77,988\n \n81,597\n \n—\n \n2000/2013\nAvalon Falls Church\nFalls Church, VA\n384\n \n39,544\n \n66,160\n \n5,223\n \n39,544\n \n71,383\n \n110,927\n \n22,513\n \n88,414\n \n86,209\n \n—\n \n2016\nTOTAL MID-ATLANTIC\n14,482\n \n$\n715,937\n \n$\n2,689,687\n \n$\n374,570\n \n$\n715,937\n \n$\n3,064,257\n \n$\n3,780,194\n \n$\n1,289,611\n \n$\n2,490,583\n \n$\n2,563,729\n \n$\n32,200\n \nSOUTHEAST FLORIDA\nAvalon 850 Boca\nBoca Raton, FL\n370\n \n$\n21,430\n \n$\n117,895\n \n$\n2,576\n \n$\n21,430\n \n$\n120,471\n \n$\n141,901\n \n$\n35,345\n \n$\n106,556\n \n$\n110,254\n \n$\n—\n \n2017/2017\nAvalon Doral\nDoral, FL\n350\n \n23,375\n \n93,027\n \n(\n61\n)\n23,375\n \n92,966\n \n116,341\n \n14,060\n \n102,281\n \n105,597\n \n—\n \n2020\nAvalon West Palm Beach\nWest Palm Beach, FL\n290\n \n9,597\n \n94,119\n \n4,461\n \n9,597\n \n98,580\n \n108,177\n \n26,177\n \n82,000\n \n84,017\n \n—\n \n2018/2018\nAvalon Bonterra\nHialeah, FL\n314\n \n16,655\n \n73,977\n \n1,158\n \n16,655\n \n75,135\n \n91,790\n \n20,811\n \n70,979\n \n73,720\n \n—\n \n2018/2019\nAvalon Toscana\nMargate, FL\n240\n \n9,213\n \n51,480\n \n1,229\n \n9,213\n \n52,709\n \n61,922\n \n12,965\n \n48,957\n \n51,019\n \n—\n \n2016/2019\nF-42\nTable of Contents\nAVALONBAY COMMUNITIES, INC.\nREAL ESTATE AND ACCUMULATED DEPRECIATION (Continued)\nDecember 31, 2024\n(Dollars in thousands)\n2024\n2023\n2024\n \n \nInitial Cost\n \nTotal Cost\n \n \n \n \n \nCommunity\nCity and state\n# of homes\nLand and Improvements\nBuilding /\nConstruction in\nProgress &\nImprovements\nCosts\nSubsequent to\nAcquisition /\nConstruction\nLand and Improvements\nBuilding /\nConstruction in\nProgress &\nImprovements\nTotal\nAccumulated\nDepreciation\nTotal Cost,\nNet of\nAccumulated\nDepreciation\nTotal Cost,\nNet of\nAccumulated\nDepreciation\nEncumbrances\nYear of\nCompletion /\nAcquisition\nAvalon Fort Lauderdale\nFort Lauderdale, FL\n243\n \n$\n20,029\n \n$\n126,505\n \n$\n2,880\n \n$\n20,029\n \n$\n129,385\n \n$\n149,414\n \n$\n18,929\n \n$\n130,485\n \n$\n135,558\n \n$\n—\n \n2020/2021\nAvalon Miramar\nMiramar, FL\n380\n \n17,959\n \n116,276\n \n823\n \n17,959\n \n117,099\n \n135,058\n \n19,996\n \n115,062\n \n119,360\n \n—\n \n2018/2021\nAvalon Miramar Park Place\nMiramar, FL\n650\n \n50,919\n \n245,728\n \n1,043\n \n50,919\n \n246,771\n \n297,690\n \n39,457\n \n258,233\n \n267,871\n \n—\n \n2022/2022\nTOTAL SOUTHEAST FLORIDA\n2,837\n \n$\n169,177\n \n$\n919,007\n \n$\n14,109\n \n$\n169,177\n \n$\n933,116\n \n$\n1,102,293\n \n$\n187,740\n \n$\n914,553\n \n$\n947,396\n \n$\n—\n \nDENVER,CO\nAvalon Denver West\nLakewood, CO\n252\n \n$\n8,047\n \n$\n69,373\n \n$\n2,387\n \n$\n8,047\n \n$\n71,760\n \n$\n79,807\n \n$\n21,907\n \n$\n57,900\n \n$\n59,841\n \n$\n—\n \n2016/2017\nAvalon Castle Rock at the Meadows\nCastle Rock, CO\n240\n \n8,527\n \n65,325\n \n1,090\n \n8,527\n \n66,415\n \n74,942\n \n18,397\n \n56,545\n \n58,371\n \n—\n \n2018/2018\nAvalon Red Rocks\nLittleton, CO\n256\n \n4,461\n \n71,477\n \n549\n \n4,461\n \n72,026\n \n76,487\n \n20,219\n \n56,268\n \n58,355\n \n—\n \n2018/2018\nAvalon Southlands\nAurora, CO\n338\n \n5,101\n \n86,653\n \n682\n \n5,101\n \n87,335\n \n92,436\n \n23,768\n \n68,668\n \n71,356\n \n—\n \n2018/2019\nAVA RiNo\nDenver, CO\n246\n \n15,152\n \n71,666\n \n—\n \n15,152\n \n71,666\n \n86,818\n \n8,289\n \n78,529\n \n81,358\n \n—\n \n2022\nAvalon Flatirons\nLafayette, CO\n207\n \n7,390\n \n88,438\n \n418\n \n7,390\n \n88,856\n \n96,246\n \n11,573\n \n84,673\n \n87,889\n \n—\n \n2020/2022\nTOTAL DENVER, CO\n1,539\n \n$\n48,678\n \n$\n452,932\n \n$\n5,126\n \n$\n48,678\n \n$\n458,058\n \n$\n506,736\n \n$\n104,153\n \n$\n402,583\n \n$\n417,170\n \n$\n—\n \nPACIFIC NORTHWEST\nSeattle, WA\nAvalon at Bear Creek\nRedmond, WA\n264\n \n$\n6,786\n \n$\n27,641\n \n$\n10,172\n \n$\n6,786\n \n$\n37,813\n \n$\n44,599\n \n$\n31,304\n \n$\n13,295\n \n$\n14,044\n \n$\n—\n \n1998/1998\nAvalon Bellevue\nBellevue, WA\n201\n \n6,664\n \n24,119\n \n8,132\n \n6,664\n \n32,251\n \n38,915\n \n24,210\n \n14,705\n \n16,079\n \n—\n \n2001\neaves RockMeadow\nBothell, WA\n206\n \n4,777\n \n19,765\n \n7,380\n \n4,777\n \n27,145\n \n31,922\n \n20,657\n \n11,265\n \n11,405\n \n—\n \n2000/2000\nAvalon ParcSquare\nRedmond, WA\n124\n \n3,789\n \n15,139\n \n5,854\n \n3,789\n \n20,993\n \n24,782\n \n16,100\n \n8,682\n \n8,256\n \n—\n \n2000/2000\nAvalon Meydenbauer\nBellevue, WA\n368\n \n12,697\n \n77,450\n \n9,388\n \n12,697\n \n86,838\n \n99,535\n \n48,733\n \n50,802\n \n52,836\n \n—\n \n2008\nAvalon Towers Bellevue (3)\nBellevue, WA\n397\n \n—\n \n123,029\n \n8,844\n \n—\n \n131,873\n \n131,873\n \n63,549\n \n68,324\n \n71,663\n \n—\n \n2011\nAVA Queen Anne\nSeattle, WA\n203\n \n12,081\n \n41,618\n \n2,233\n \n12,081\n \n43,851\n \n55,932\n \n19,797\n \n36,135\n \n37,425\n \n—\n \n2012\nAvalon Alderwood I\nLynnwood, WA\n367\n \n12,294\n \n55,627\n \n1,407\n \n12,294\n \n57,034\n \n69,328\n \n20,395\n \n48,933\n \n50,500\n \n—\n \n2015\nAVA Capitol Hill\nSeattle, WA\n249\n \n20,613\n \n59,986\n \n1,756\n \n20,613\n \n61,742\n \n82,355\n \n20,306\n \n62,049\n \n63,829\n \n—\n \n2016\nAvalon Esterra Park\nRedmond, WA\n482\n \n23,178\n \n112,986\n \n1,974\n \n23,178\n \n114,960\n \n138,138\n \n34,280\n \n103,858\n \n107,376\n \n—\n \n2017\nAvalon Alderwood II\nLynnwood, WA\n124\n \n5,072\n \n21,418\n \n248\n \n5,072\n \n21,666\n \n26,738\n \n6,361\n \n20,377\n \n20,991\n \n—\n \n2016\nAvalon Newcastle Commons I\nNewcastle, WA\n378\n \n9,649\n \n111,600\n \n1,957\n \n9,649\n \n113,557\n \n123,206\n \n30,124\n \n93,082\n \n96,521\n \n—\n \n2017\nAvalon Belltown Towers\nSeattle, WA\n274\n \n24,638\n \n121,064\n \n1,413\n \n24,638\n \n122,477\n \n147,115\n \n26,031\n \n121,084\n \n125,497\n \n—\n \n2019\nAVA Esterra Park\nRedmond, WA\n323\n \n16,405\n \n74,568\n \n113\n \n16,405\n \n74,681\n \n91,086\n \n16,898\n \n74,188\n \n76,695\n \n—\n \n2019\nAvalon Newcastle Commons II\nNewcastle, WA\n293\n \n6,982\n \n99,969\n \n208\n \n6,982\n \n100,177\n \n107,159\n \n14,434\n \n92,725\n \n96,417\n \n—\n \n2021\nAvalon North Creek\nBothell, WA\n316\n \n13,498\n \n69,013\n \n97\n \n13,498\n \n69,110\n \n82,608\n \n14,600\n \n68,008\n \n70,524\n \n—\n \n2020\neaves Redmond Campus\nRedmond, WA\n374\n \n15,665\n \n84,852\n \n29,388\n \n15,665\n \n114,240\n \n129,905\n \n50,811\n \n79,094\n \n82,813\n \n—\n \n1991/2013\nArchstone Redmond Lakeview\nRedmond, WA\n166\n \n10,250\n \n28,163\n \n5,981\n \n10,250\n \n34,144\n \n44,394\n \n17,669\n \n26,725\n \n27,919\n \n—\n \n1987/2013\nTOTAL PACIFIC NORTHWEST\n5,109\n \n$\n205,038\n \n$\n1,168,007\n \n$\n96,545\n \n$\n205,038\n \n$\n1,264,552\n \n$\n1,469,590\n \n$\n476,259\n \n$\n993,331\n \n$\n1,030,790\n \n$\n—\n \nF-43\nTable of Contents\nAVALONBAY COMMUNITIES, INC.\nREAL ESTATE AND ACCUMULATED DEPRECIATION (Continued)\nDecember 31, 2024\n(Dollars in thousands)\n2024\n2023\n2024\n \n \nInitial Cost\n \nTotal Cost\n \n \n \n \n \nCommunity\nCity and state\n# of homes\nLand and Improvements\nBuilding /\nConstruction in\nProgress &\nImprovements\nCosts\nSubsequent to\nAcquisition /\nConstruction\nLand and Improvements\nBuilding /\nConstruction in\nProgress &\nImprovements\nTotal\nAccumulated\nDepreciation\nTotal Cost,\nNet of\nAccumulated\nDepreciation\nTotal Cost,\nNet of\nAccumulated\nDepreciation\nEncumbrances\nYear of\nCompletion /\nAcquisition\nNORTHERN CALIFORNIA\nSan Jose, CA\nAvalon Campbell\nCampbell, CA\n348\n \n$\n11,830\n \n$\n47,825\n \n$\n16,213\n \n$\n11,830\n \n$\n64,038\n \n$\n75,868\n \n$\n50,750\n \n$\n25,118\n \n$\n26,846\n \n$\n—\n \n1995\neaves San Jose\nSan Jose, CA\n442\n \n12,920\n \n53,047\n \n20,867\n \n12,920\n \n73,914\n \n86,834\n \n53,435\n \n33,399\n \n35,666\n \n—\n \n1985/1996\nAvalon on the Alameda\nSan Jose, CA\n307\n \n6,119\n \n50,214\n \n15,090\n \n6,119\n \n65,304\n \n71,423\n \n51,285\n \n20,138\n \n22,240\n \n—\n \n1999\nAvalon Silicon Valley\nSunnyvale, CA\n714\n \n20,713\n \n99,573\n \n41,333\n \n20,713\n \n140,906\n \n161,619\n \n105,580\n \n56,039\n \n59,113\n \n—\n \n1998\nAvalon Mountain View\nMountain View, CA\n248\n \n9,755\n \n39,387\n \n13,452\n \n9,755\n \n52,839\n \n62,594\n \n43,710\n \n18,884\n \n20,758\n \n—\n \n1986\neaves Creekside\nMountain View, CA\n300\n \n6,546\n \n26,263\n \n23,413\n \n6,546\n \n49,676\n \n56,222\n \n37,710\n \n18,512\n \n20,143\n \n—\n \n1962/1997\nAvalon at Cahill Park\nSan Jose, CA\n218\n \n4,765\n \n47,600\n \n5,289\n \n4,765\n \n52,889\n \n57,654\n \n39,583\n \n18,071\n \n19,848\n \n—\n \n2002\nAvalon Towers on the Peninsula\nMountain View, CA\n211\n \n9,560\n \n56,136\n \n16,868\n \n9,560\n \n73,004\n \n82,564\n \n49,363\n \n33,201\n \n34,617\n \n—\n \n2002\nAvalon Morrison Park\nSan Jose, CA\n250\n \n13,837\n \n64,521\n \n2,090\n \n13,837\n \n66,611\n \n80,448\n \n25,221\n \n55,227\n \n57,299\n \n—\n \n2014\nAvalon Willow Glen\nSan Jose, CA\n412\n \n46,060\n \n85,637\n \n5,564\n \n46,060\n \n91,201\n \n137,261\n \n44,832\n \n92,429\n \n95,551\n \n—\n \n2002/2013\neaves West Valley\nSan Jose, CA\n873\n \n90,890\n \n138,555\n \n11,317\n \n90,890\n \n149,872\n \n240,762\n \n71,451\n \n169,311\n \n174,470\n \n—\n \n1970/2013\neaves Mountain View at Middlefield\nMountain View, CA\n404\n \n64,070\n \n73,438\n \n14,821\n \n64,070\n \n88,259\n \n152,329\n \n46,178\n \n106,151\n \n110,005\n \n—\n \n1969/2013\nTotal San Jose, CA\n4,727\n \n$\n297,065\n \n$\n782,196\n \n$\n186,317\n \n$\n297,065\n \n$\n968,513\n \n$\n1,265,578\n \n$\n619,098\n \n$\n646,480\n \n$\n676,556\n \n$\n—\n \nOakland - East Bay, CA\nAvalon Fremont\nFremont, CA\n308\n \n$\n10,746\n \n$\n43,399\n \n$\n31,906\n \n$\n10,746\n \n$\n75,305\n \n$\n86,051\n \n$\n48,992\n \n$\n37,059\n \n$\n39,436\n \n$\n—\n \n1992/1994\neaves Dublin (2)\nDublin, CA\n204\n \n5,276\n \n19,642\n \n27,254\n \n5,276\n \n46,896\n \n52,172\n \n25,551\n \n26,621\n \n14,594\n \n—\n \n1989/1997\neaves Pleasanton\nPleasanton, CA\n456\n \n11,610\n \n46,552\n \n54,062\n \n11,610\n \n100,614\n \n112,224\n \n58,406\n \n53,818\n \n52,044\n \n—\n \n1988/1994\neaves Union City\nUnion City, CA\n208\n \n4,249\n \n16,820\n \n6,001\n \n4,249\n \n22,821\n \n27,070\n \n19,353\n \n7,717\n \n7,903\n \n—\n \n1973/1996\neaves Fremont\nFremont, CA\n237\n \n6,581\n \n26,583\n \n13,352\n \n6,581\n \n39,935\n \n46,516\n \n32,157\n \n14,359\n \n15,628\n \n—\n \n1985/1994\nAvalon Union City\nUnion City, CA\n439\n \n14,732\n \n104,024\n \n7,955\n \n14,732\n \n111,979\n \n126,711\n \n58,088\n \n68,623\n \n71,867\n \n—\n \n2009\nAvalon Walnut Creek (3)\nWalnut Creek, CA\n422\n \n—\n \n148,846\n \n8,215\n \n—\n \n157,061\n \n157,061\n \n77,412\n \n79,649\n \n84,385\n \n4,681\n \n2010\nAvalon Dublin Station\nDublin, CA\n253\n \n7,772\n \n72,142\n \n2,454\n \n7,772\n \n74,596\n \n82,368\n \n27,827\n \n54,541\n \n56,225\n \n—\n \n2014\nAvalon Dublin Station II\nDublin, CA\n252\n \n7,762\n \n76,587\n \n1,596\n \n7,762\n \n78,183\n \n85,945\n \n23,732\n \n62,213\n \n63,881\n \n—\n \n2016\nAvalon Public Market (1)\nEmeryville, CA\n289\n \n27,394\n \n149,011\n \n(\n2,963\n)\n27,394\n \n146,048\n \n173,442\n \n28,117\n \n145,325\n \n150,880\n \n—\n \n2020\nAvalon Walnut Creek II (3)\nWalnut Creek, CA\n200\n \n—\n \n111,073\n \n2,461\n \n—\n \n113,534\n \n113,534\n \n18,774\n \n94,760\n \n98,785\n \n—\n \n2020\neaves Walnut Creek\nWalnut Creek, CA\n510\n \n30,320\n \n86,475\n \n15,494\n \n30,320\n \n101,969\n \n132,289\n \n45,125\n \n87,164\n \n89,379\n \n—\n \n1987/2013\nAvalon Walnut Ridge I\nWalnut Creek, CA\n106\n \n9,860\n \n20,630\n \n5,494\n \n9,860\n \n26,124\n \n35,984\n \n11,443\n \n24,541\n \n25,192\n \n—\n \n2000/2013\nAvalon Walnut Ridge II\nWalnut Creek, CA\n360\n \n27,190\n \n60,209\n \n11,593\n \n27,190\n \n71,802\n \n98,992\n \n32,710\n \n66,282\n \n68,241\n \n—\n \n1989/2013\nTotal Oakland - East Bay, CA\n4,244\n \n$\n163,492\n \n$\n981,993\n \n$\n184,874\n \n$\n163,492\n \n$\n1,166,867\n \n$\n1,330,359\n \n$\n507,687\n \n$\n822,672\n \n$\n838,440\n \n$\n4,681\n \nSan Francisco, CA\nAVA Nob Hill\nSan Francisco, CA\n185\n \n$\n5,403\n \n$\n21,567\n \n$\n12,489\n \n$\n5,403\n \n$\n34,056\n \n$\n39,459\n \n$\n25,989\n \n$\n13,470\n \n$\n13,732\n \n$\n—\n \n1990/1995\neaves Foster City\nFoster City, CA\n290\n \n7,852\n \n31,445\n \n17,454\n \n7,852\n \n48,899\n \n56,751\n \n37,706\n \n19,045\n \n19,576\n \n—\n \n1973/1994\neaves Pacifica\nPacifica, CA\n220\n \n6,125\n \n24,792\n \n6,107\n \n6,125\n \n30,899\n \n37,024\n \n26,665\n \n10,359\n \n11,048\n \n—\n \n1971/1995\nF-44\nTable of Contents\nAVALONBAY COMMUNITIES, INC.\nREAL ESTATE AND ACCUMULATED DEPRECIATION (Continued)\nDecember 31, 2024\n(Dollars in thousands)\n2024\n2023\n2024\n \n \nInitial Cost\n \nTotal Cost\n \n \n \n \n \nCommunity\nCity and state\n# of homes\nLand and Improvements\nBuilding /\nConstruction in\nProgress &\nImprovements\nCosts\nSubsequent to\nAcquisition /\nConstruction\nLand and Improvements\nBuilding /\nConstruction in\nProgress &\nImprovements\nTotal\nAccumulated\nDepreciation\nTotal Cost,\nNet of\nAccumulated\nDepreciation\nTotal Cost,\nNet of\nAccumulated\nDepreciation\nEncumbrances\nYear of\nCompletion /\nAcquisition\nAvalon Sunset Towers\nSan Francisco, CA\n243\n \n$\n3,561\n \n$\n21,313\n \n$\n17,915\n \n$\n3,561\n \n$\n39,228\n \n$\n42,789\n \n$\n29,787\n \n$\n13,002\n \n$\n14,142\n \n$\n—\n \n1961/1996\nAvalon at Mission Bay I\nSan Francisco, CA\n250\n \n14,029\n \n78,452\n \n11,820\n \n14,029\n \n90,272\n \n104,301\n \n66,712\n \n37,589\n \n39,717\n \n—\n \n2003\nAvalon at Mission Bay III\nSan Francisco, CA\n260\n \n28,687\n \n119,156\n \n2,031\n \n28,687\n \n121,187\n \n149,874\n \n63,247\n \n86,627\n \n90,364\n \n—\n \n2009\nAvalon Ocean Avenue\nSan Francisco, CA\n173\n \n5,544\n \n50,906\n \n3,715\n \n5,544\n \n54,621\n \n60,165\n \n23,938\n \n36,227\n \n37,777\n \n—\n \n2012\nAVA 55 Ninth\nSan Francisco, CA\n273\n \n20,267\n \n97,321\n \n1,822\n \n20,267\n \n99,143\n \n119,410\n \n37,257\n \n82,153\n \n85,383\n \n—\n \n2014\nAvalon Hayes Valley\nSan Francisco, CA\n182\n \n12,595\n \n81,228\n \n1,540\n \n12,595\n \n82,768\n \n95,363\n \n28,039\n \n67,324\n \n69,869\n \n—\n \n2015\nAvalon Dogpatch\nSan Francisco, CA\n326\n \n23,523\n \n180,698\n \n835\n \n23,523\n \n181,533\n \n205,056\n \n46,162\n \n158,894\n \n164,414\n \n—\n \n2018\nAvalon San Bruno I\nSan Bruno, CA\n300\n \n40,780\n \n71,352\n \n7,368\n \n40,780\n \n78,720\n \n119,500\n \n37,665\n \n81,835\n \n84,122\n \n55,250\n \n2004/2013\nAvalon San Bruno II\nSan Bruno, CA\n185\n \n23,787\n \n46,609\n \n2,972\n \n23,787\n \n49,581\n \n73,368\n \n21,243\n \n52,125\n \n53,227\n \n—\n \n2007/2013\nAvalon San Bruno III\nSan Bruno, CA\n187\n \n33,303\n \n65,255\n \n2,117\n \n33,303\n \n67,372\n \n100,675\n \n28,791\n \n71,884\n \n73,424\n \n51,000\n \n2010/2013\nTotal San Francisco, CA\n3,074\n \n$\n225,456\n \n$\n890,094\n \n$\n88,185\n \n$\n225,456\n \n$\n978,279\n \n$\n1,203,735\n \n$\n473,201\n \n$\n730,534\n \n$\n756,795\n \n$\n106,250\n \nTOTAL NORTHERN CALIFORNIA\n12,045\n \n$\n686,013\n \n$\n2,654,283\n \n$\n459,376\n \n$\n686,013\n \n$\n3,113,659\n \n$\n3,799,672\n \n$\n1,599,986\n \n$\n2,199,686\n \n$\n2,271,791\n \n$\n110,931\n \nSOUTHERN CALIFORNIA\nLos Angeles, CA\nAVA Burbank\nBurbank, CA\n750\n \n$\n22,483\n \n$\n28,078\n \n$\n59,108\n \n$\n22,483\n \n$\n87,186\n \n$\n109,669\n \n$\n61,596\n \n$\n48,073\n \n$\n47,224\n \n$\n—\n \n1961/1997\nAvalon Woodland Hills\nWoodland Hills, CA\n663\n \n23,828\n \n40,329\n \n89,549\n \n23,828\n \n129,878\n \n153,706\n \n73,009\n \n80,697\n \n82,691\n \n—\n \n1989/1997\neaves Warner Center (2)\nWoodland Hills, CA\n228\n \n7,045\n \n12,974\n \n18,090\n \n7,045\n \n31,064\n \n38,109\n \n23,286\n \n14,823\n \n12,227\n \n—\n \n1979/1998\nAvalon Glendale (3)\nGlendale, CA\n223\n \n—\n \n42,564\n \n4,521\n \n—\n \n47,085\n \n47,085\n \n33,662\n \n13,423\n \n14,636\n \n—\n \n2003\nAvalon Burbank\nBurbank, CA\n401\n \n14,053\n \n56,814\n \n32,377\n \n14,053\n \n89,191\n \n103,244\n \n58,956\n \n44,288\n \n44,329\n \n—\n \n1988/2002\nAvalon Camarillo\nCamarillo, CA\n249\n \n8,446\n \n40,239\n \n5,492\n \n8,446\n \n45,731\n \n54,177\n \n28,653\n \n25,524\n \n26,472\n \n—\n \n2006\nAvalon Wilshire\nLos Angeles, CA\n125\n \n5,459\n \n41,174\n \n7,869\n \n5,459\n \n49,043\n \n54,502\n \n30,231\n \n24,271\n \n26,124\n \n—\n \n2007\nAvalon Encino\nEncino, CA\n132\n \n12,789\n \n49,062\n \n5,168\n \n12,789\n \n54,230\n \n67,019\n \n29,008\n \n38,011\n \n38,842\n \n—\n \n2008\nAvalon Warner Place\nCanoga Park, CA\n210\n \n7,920\n \n44,823\n \n4,087\n \n7,920\n \n48,910\n \n56,830\n \n27,297\n \n29,533\n \n31,232\n \n—\n \n2008\nAVA Little Tokyo\nLos Angeles, CA\n280\n \n14,734\n \n93,977\n \n2,750\n \n14,734\n \n96,727\n \n111,461\n \n34,411\n \n77,050\n \n79,899\n \n—\n \n2015\neaves Phillips Ranch\nPomona, CA\n503\n \n9,796\n \n41,675\n \n17,506\n \n9,796\n \n59,181\n \n68,977\n \n26,694\n \n42,283\n \n41,537\n \n—\n \n1989/2011\neaves San Dimas\nSan Dimas, CA\n102\n \n1,916\n \n7,803\n \n3,224\n \n1,916\n \n11,027\n \n12,943\n \n5,411\n \n7,532\n \n7,460\n \n—\n \n1978/2011\neaves San Dimas Canyon\nSan Dimas, CA\n156\n \n2,953\n \n12,369\n \n2,786\n \n2,953\n \n15,155\n \n18,108\n \n7,403\n \n10,705\n \n10,917\n \n—\n \n1981/2011\nAVA Pasadena\nPasadena, CA\n84\n \n8,400\n \n11,522\n \n6,865\n \n8,400\n \n18,387\n \n26,787\n \n7,750\n \n19,037\n \n19,238\n \n—\n \n1973/2012\neaves Cerritos\nArtesia, CA\n151\n \n8,305\n \n21,195\n \n3,267\n \n8,305\n \n24,462\n \n32,767\n \n10,406\n \n22,361\n \n23,100\n \n—\n \n1973/2012\nAvalon Playa Vista\nLos Angeles, CA\n309\n \n30,900\n \n71,944\n \n10,551\n \n30,900\n \n82,495\n \n113,395\n \n38,120\n \n75,275\n \n77,685\n \n—\n \n2006/2012\nAvalon San Dimas\nSan Dimas, CA\n162\n \n9,141\n \n30,726\n \n3,711\n \n9,141\n \n34,437\n \n43,578\n \n11,859\n \n31,719\n \n30,005\n \n—\n \n2014\nAvalon Glendora\nGlendora, CA\n281\n \n18,311\n \n64,303\n \n1,429\n \n18,311\n \n65,732\n \n84,043\n \n21,457\n \n62,586\n \n64,455\n \n—\n \n2016\nAvalon West Hollywood\nWest Hollywood, CA\n294\n \n35,214\n \n118,926\n \n2,584\n \n35,214\n \n121,510\n \n156,724\n \n33,905\n \n122,819\n \n126,390\n \n—\n \n2017\nAvalon Mission Oaks\nCamarillo, CA\n160\n \n9,600\n \n38,666\n \n2,034\n \n9,600\n \n40,700\n \n50,300\n \n15,829\n \n34,471\n \n35,291\n \n—\n \n2014\nAvalon Chino Hills\nChino Hills, CA\n331\n \n16,617\n \n79,829\n \n1,682\n \n16,617\n \n81,511\n \n98,128\n \n22,663\n \n75,465\n \n77,760\n \n—\n \n2017\nAVA Hollywood at La Pietra Place\nLos Angeles, CA\n695\n \n99,309\n \n272,596\n \n2,499\n \n99,309\n \n275,095\n \n374,404\n \n48,530\n \n325,874\n \n336,203\n \n—\n \n2021\nF-45\nTable of Contents\nAVALONBAY COMMUNITIES, INC.\nREAL ESTATE AND ACCUMULATED DEPRECIATION (Continued)\nDecember 31, 2024\n(Dollars in thousands)\n2024\n2023\n2024\n \n \nInitial Cost\n \nTotal Cost\n \n \n \n \n \nCommunity\nCity and state\n# of homes\nLand and Improvements\nBuilding /\nConstruction in\nProgress &\nImprovements\nCosts\nSubsequent to\nAcquisition /\nConstruction\nLand and Improvements\nBuilding /\nConstruction in\nProgress &\nImprovements\nTotal\nAccumulated\nDepreciation\nTotal Cost,\nNet of\nAccumulated\nDepreciation\nTotal Cost,\nNet of\nAccumulated\nDepreciation\nEncumbrances\nYear of\nCompletion /\nAcquisition\nAvalon Cerritos\nCerritos, CA\n132\n \n$\n8,869\n \n$\n52,025\n \n$\n665\n \n$\n8,869\n \n$\n52,690\n \n$\n61,559\n \n$\n12,448\n \n$\n49,111\n \n$\n50,789\n \n$\n30,250\n \n2017/2019\nAvalon Monrovia\nMonrovia, CA\n154\n \n12,125\n \n56,202\n \n374\n \n12,125\n \n56,576\n \n68,701\n \n7,918\n \n60,783\n \n62,904\n \n—\n \n2021\nAvalon Simi Valley\nSimi Valley, CA\n500\n \n42,020\n \n77,521\n \n10,470\n \n42,020\n \n87,991\n \n130,011\n \n40,302\n \n89,709\n \n92,163\n \n—\n \n2007/2013\nAVA Studio City II\nStudio City, CA\n101\n \n4,626\n \n23,840\n \n7,347\n \n4,626\n \n31,187\n \n35,813\n \n13,486\n \n22,327\n \n23,370\n \n—\n \n1991/2013\nAvalon Studio City\nStudio City, CA\n276\n \n15,756\n \n81,361\n \n17,011\n \n15,756\n \n98,372\n \n114,128\n \n44,667\n \n69,461\n \n72,739\n \n—\n \n2002/2013\nAvalon Calabasas\nCalabasas, CA\n600\n \n42,720\n \n112,911\n \n25,819\n \n42,720\n \n138,730\n \n181,450\n \n74,665\n \n106,785\n \n111,007\n \n—\n \n1988/2013\nAvalon Oak Creek\nAgoura Hills, CA\n338\n \n43,540\n \n83,625\n \n10,657\n \n43,540\n \n94,282\n \n137,822\n \n49,769\n \n88,053\n \n90,522\n \n—\n \n2004/2013\nAvalon Santa Monica on Main\nSanta Monica, CA\n133\n \n32,000\n \n63,612\n \n14,294\n \n32,000\n \n77,906\n \n109,906\n \n32,915\n \n76,991\n \n79,077\n \n—\n \n2007/2013\neaves Old Town Pasadena\nPasadena, CA\n96\n \n9,110\n \n16,316\n \n6,743\n \n9,110\n \n23,059\n \n32,169\n \n10,080\n \n22,089\n \n22,719\n \n—\n \n1972/2013\neaves Thousand Oaks\nThousand Oaks, CA\n158\n \n13,950\n \n21,574\n \n6,198\n \n13,950\n \n27,772\n \n41,722\n \n15,637\n \n26,085\n \n26,892\n \n—\n \n1992/2013\neaves Los Feliz\nLos Angeles, CA\n263\n \n18,940\n \n46,201\n \n12,644\n \n18,940\n \n58,845\n \n77,785\n \n26,613\n \n51,172\n \n52,846\n \n41,400\n \n1989/2013\nAVA Toluca Hills (2)\nLos Angeles, CA\n1,151\n \n86,450\n \n170,276\n \n95,364\n \n86,450\n \n265,640\n \n352,090\n \n102,318\n \n249,772\n \n248,197\n \n—\n \n1973/2013\neaves Woodland Hills\nWoodland Hills, CA\n891\n \n68,940\n \n96,808\n \n24,026\n \n68,940\n \n120,834\n \n189,774\n \n60,028\n \n129,746\n \n131,151\n \n111,500\n \n1971/2013\nAvalon Thousand Oaks Plaza\nThousand Oaks, CA\n148\n \n12,810\n \n24,045\n \n4,194\n \n12,810\n \n28,239\n \n41,049\n \n13,499\n \n27,550\n \n27,450\n \n—\n \n2002/2013\nAvalon Pasadena\nPasadena, CA\n120\n \n10,240\n \n33,038\n \n5,743\n \n10,240\n \n38,781\n \n49,021\n \n16,612\n \n32,409\n \n33,453\n \n—\n \n2004/2013\nAVA Studio City I\nStudio City, CA\n450\n \n17,658\n \n94,249\n \n34,908\n \n17,658\n \n129,157\n \n146,815\n \n54,024\n \n92,791\n \n96,708\n \n—\n \n1987/2013\nTotal Los Angeles, CA\n12,000\n \n$\n806,973\n \n$\n2,275,192\n \n$\n563,606\n \n$\n806,973\n \n$\n2,838,798\n \n$\n3,645,771\n \n$\n1,225,117\n \n$\n2,420,654\n \n$\n2,475,704\n \n$\n183,150\n \nOrange County, CA\nAVA Newport\nCosta Mesa, CA\n145\n \n$\n1,975\n \n$\n3,814\n \n$\n11,792\n \n$\n1,975\n \n$\n15,606\n \n$\n17,581\n \n$\n10,478\n \n$\n7,103\n \n$\n6,696\n \n$\n—\n \n1956/1996\neaves Mission Viejo\nMission Viejo, CA\n166\n \n2,517\n \n9,241\n \n6,979\n \n2,517\n \n16,220\n \n18,737\n \n13,024\n \n5,713\n \n5,748\n \n—\n \n1984/1996\neaves South Coast\nCosta Mesa, CA\n258\n \n4,709\n \n16,063\n \n15,755\n \n4,709\n \n31,818\n \n36,527\n \n24,428\n \n12,099\n \n13,043\n \n—\n \n1973/1996\neaves Santa Margarita\nRancho Santa Margarita, CA\n302\n \n4,607\n \n16,895\n \n15,861\n \n4,607\n \n32,756\n \n37,363\n \n24,362\n \n13,001\n \n13,626\n \n—\n \n1990/1997\neaves Huntington Beach\nHuntington Beach, CA\n304\n \n4,871\n \n19,729\n \n13,791\n \n4,871\n \n33,520\n \n38,391\n \n28,606\n \n9,785\n \n10,354\n \n—\n \n1971/1997\nAvalon Irvine I\nIrvine, CA\n279\n \n9,911\n \n67,504\n \n9,080\n \n9,911\n \n76,584\n \n86,495\n \n39,040\n \n47,455\n \n49,535\n \n—\n \n2010\nAvalon Irvine II\nIrvine, CA\n179\n \n4,358\n \n40,890\n \n1,807\n \n4,358\n \n42,697\n \n47,055\n \n17,651\n \n29,404\n \n30,843\n \n—\n \n2013\neaves Lake Forest\nLake Forest, CA\n225\n \n5,199\n \n21,117\n \n8,662\n \n5,199\n \n29,779\n \n34,978\n \n14,489\n \n20,489\n \n21,201\n \n—\n \n1975/2011\nAvalon Baker Ranch\nLake Forest, CA\n430\n \n31,689\n \n98,004\n \n1,623\n \n31,689\n \n99,627\n \n131,316\n \n33,927\n \n97,389\n \n100,111\n \n—\n \n2015\nAvalon Irvine III\nIrvine, CA\n156\n \n11,607\n \n43,973\n \n719\n \n11,607\n \n44,692\n \n56,299\n \n13,898\n \n42,401\n \n43,554\n \n—\n \n2016\nAvalon Brea Place\nBrea, CA\n653\n \n72,925\n \n220,193\n \n38\n \n72,925\n \n220,231\n \n293,156\n \n25,816\n \n267,340\n \n275,756\n \n—\n \n2022\neaves Seal Beach\nSeal Beach, CA\n549\n \n46,790\n \n104,129\n \n34,702\n \n46,790\n \n138,831\n \n185,621\n \n56,813\n \n128,808\n \n133,471\n \n—\n \n1971/2013\nAvalon Huntington Beach\nHuntington Beach, CA\n378\n \n13,055\n \n105,981\n \n1,430\n \n13,055\n \n107,411\n \n120,466\n \n31,757\n \n88,709\n \n92,157\n \n—\n \n2017\nTotal Orange County, CA\n4,024\n \n$\n214,213\n \n$\n767,533\n \n$\n122,239\n \n$\n214,213\n \n$\n889,772\n \n$\n1,103,985\n \n$\n334,289\n \n$\n769,696\n \n$\n796,095\n \n$\n—\n \nSan Diego, CA\nAVA Pacific Beach\nSan Diego, CA\n564\n \n$\n9,922\n \n$\n40,580\n \n$\n45,027\n \n$\n9,922\n \n$\n85,607\n \n$\n95,529\n \n$\n61,955\n \n$\n33,574\n \n$\n35,778\n \n$\n—\n \n1969/1997\neaves Mission Ridge\nSan Diego, CA\n200\n \n2,710\n \n10,924\n \n16,894\n \n2,710\n \n27,818\n \n30,528\n \n22,093\n \n8,435\n \n8,784\n \n—\n \n1960/1997\nF-46\nTable of Contents\nAVALONBAY COMMUNITIES, INC.\nREAL ESTATE AND ACCUMULATED DEPRECIATION (Continued)\nDecember 31, 2024\n(Dollars in thousands)\n2024\n2023\n2024\n \n \nInitial Cost\n \nTotal Cost\n \n \n \n \n \nCommunity\nCity and state\n# of homes\nLand and Improvements\nBuilding /\nConstruction in\nProgress &\nImprovements\nCosts\nSubsequent to\nAcquisition /\nConstruction\nLand and Improvements\nBuilding /\nConstruction in\nProgress &\nImprovements\nTotal\nAccumulated\nDepreciation\nTotal Cost,\nNet of\nAccumulated\nDepreciation\nTotal Cost,\nNet of\nAccumulated\nDepreciation\nEncumbrances\nYear of\nCompletion /\nAcquisition\neaves San Marcos\nSan Marcos, CA\n184\n \n$\n3,277\n \n$\n13,385\n \n$\n9,605\n \n$\n3,277\n \n$\n22,990\n \n$\n26,267\n \n$\n9,254\n \n$\n17,013\n \n$\n15,757\n \n$\n—\n \n1988/2011\neaves Rancho Penasquitos\nSan Diego, CA\n250\n \n6,692\n \n27,143\n \n13,603\n \n6,692\n \n40,746\n \n47,438\n \n19,603\n \n27,835\n \n29,195\n \n—\n \n1986/2011\nAvalon Vista\nVista, CA\n221\n \n12,689\n \n43,328\n \n1,268\n \n12,689\n \n44,596\n \n57,285\n \n15,502\n \n41,783\n \n43,039\n \n—\n \n2015\neaves La Mesa\nLa Mesa, CA\n168\n \n9,490\n \n29,412\n \n5,020\n \n9,490\n \n34,432\n \n43,922\n \n18,022\n \n25,900\n \n26,452\n \n—\n \n1989/2013\nAvalon La Jolla Colony\nSan Diego, CA\n180\n \n16,760\n \n29,234\n \n11,233\n \n16,760\n \n40,467\n \n57,227\n \n19,117\n \n38,110\n \n39,520\n \n—\n \n1987/2013\nTotal San Diego, CA\n1,767\n \n$\n61,540\n \n$\n194,006\n \n$\n102,650\n \n$\n61,540\n \n$\n296,656\n \n$\n358,196\n \n$\n165,546\n \n$\n192,650\n \n$\n198,525\n \n$\n—\n \nTOTAL SOUTHERN CALIFORNIA\n17,791\n \n$\n1,082,726\n \n$\n3,236,731\n \n$\n788,495\n \n$\n1,082,726\n \n$\n4,025,226\n \n$\n5,107,952\n \n$\n1,724,952\n \n$\n3,383,000\n \n$\n3,470,324\n \n$\n183,150\n \nOTHER EXPANSION REGIONS\nNorth Carolina\nAvalon South End\nCharlotte, NC\n265\n \n$\n13,723\n \n$\n90,017\n \n$\n4,019\n \n$\n13,723\n \n$\n94,036\n \n$\n107,759\n \n$\n15,261\n \n$\n92,498\n \n$\n95,961\n \n$\n—\n \n2020/2021\nAVA South End\nCharlotte, NC\n164\n \n9,367\n \n45,277\n \n2,441\n \n9,367\n \n47,718\n \n57,085\n \n6,801\n \n50,284\n \n51,367\n \n—\n \n2013/2021\nAvalon Hawk (1)\nCharlotte, NC\n71\n \n2,564\n \n44,255\n \n3\n \n2,564\n \n44,258\n \n46,822\n \n5,443\n \n41,379\n \n43,118\n \n—\n \n2021/2021\nAvalon Highland Creek\nCharlotte, NC\n260\n \n4,586\n \n73,014\n \n157\n \n4,586\n \n73,171\n \n77,757\n \n9,086\n \n68,671\n \n71,893\n \n—\n \n2022/2022\nTotal North Carolina\n760\n \n$\n30,240\n \n$\n252,563\n \n$\n6,620\n \n$\n30,240\n \n$\n259,183\n \n$\n289,423\n \n$\n36,591\n \n$\n252,832\n \n$\n262,339\n \n$\n—\n \nTexas\nAvalon Lakeside\nFlower Mound, TX\n425\n \n$\n15,073\n \n$\n102,992\n \n$\n533\n \n$\n15,073\n \n$\n103,525\n \n$\n118,598\n \n$\n19,021\n \n$\n99,577\n \n$\n103,640\n \n$\n—\n \n2015/2021\nAvalon Addison\nAddison, TX\n196\n \n11,174\n \n59,132\n \n615\n \n11,174\n \n59,747\n \n70,921\n \n7,395\n \n63,526\n \n65,262\n \n—\n \n1995/2022\nTotal Texas\n621\n \n$\n26,247\n \n$\n162,124\n \n$\n1,148\n \n$\n26,247\n \n$\n163,272\n \n$\n189,519\n \n$\n26,416\n \n$\n163,103\n \n$\n168,902\n \nTOTAL OTHER EXPANSION REGIONS\n1,381\n \n$\n56,487\n \n$\n414,687\n \n$\n7,768\n \n$\n56,487\n \n$\n422,455\n \n$\n478,942\n \n$\n63,007\n \n$\n415,935\n \n$\n431,241\n \n$\n—\n \nTOTAL SAME STORE\n76,858\n \n$\n4,317,304\n \n$\n16,585,720\n \n$\n2,528,368\n \n$\n4,317,304\n \n$\n19,114,088\n \n$\n23,431,392\n \n$\n7,871,238\n \n$\n15,560,154\n \n$\n16,055,000\n \n$\n671,981\n \nF-47\nTable of Contents\nAVALONBAY COMMUNITIES, INC.\nREAL ESTATE AND ACCUMULATED DEPRECIATION (Continued)\nDecember 31, 2024\n(Dollars in thousands)\n2024\n2023\n2024\n \n \nInitial Cost\n \nTotal Cost\n \n \n \n \n \nCommunity\nCity and state\n# of homes\nLand and Improvements\nBuilding /\nConstruction in\nProgress &\nImprovements\nCosts\nSubsequent to\nAcquisition /\nConstruction\nLand and Improvements\nBuilding /\nConstruction in\nProgress &\nImprovements\nTotal\nAccumulated\nDepreciation\nTotal Cost,\nNet of\nAccumulated\nDepreciation\nTotal Cost,\nNet of\nAccumulated\nDepreciation\nEncumbrances\nYear of\nCompletion /\nAcquisition\nOTHER STABILIZED\nAVA Balboa Park\nSan Diego, CA\n100\n \n$\n10,537\n \n$\n40,644\n \n$\n12\n \n$\n10,537\n \n$\n40,656\n \n$\n51,193\n \n$\n880\n \n$\n50,313\n \n$\n—\n \n2015/2024\nAvalon Cherry Hills\nEnglewood, CO\n306\n \n9,798\n \n85,418\n \n30\n \n9,798\n \n85,448\n \n95,246\n \n3,391\n \n91,855\n \n—\n \n—\n \n2015/2024\nAvalon Lowry\nDenver, CO\n347\n \n15,382\n \n121,429\n \n—\n \n15,382\n \n121,429\n \n136,811\n \n600\n \n136,211\n \n—\n \n2019/2024\nAvalon North Andover\nNorth Andover, MA\n221\n \n13,617\n \n63,000\n \n1\n \n13,617\n \n63,001\n \n76,618\n \n4,733\n \n71,885\n \n73,317\n \n—\n \n2023\nAvalon Brighton\nBoston, MA\n180\n \n11,160\n \n77,866\n \n335\n \n11,160\n \n78,201\n \n89,361\n \n5,214\n \n84,147\n \n86,355\n \n—\n \n2023\nAvalon Mooresville\nMooresville, NC\n203\n \n3,770\n \n48,939\n \n171\n \n3,770\n \n49,110\n \n52,880\n \n3,392\n \n49,488\n \n51,437\n \n—\n \n2017/2023\nAvalon Perimeter Park\nMorrisville, NC\n262\n \n11,533\n \n55,411\n \n26\n \n11,533\n \n55,437\n \n66,970\n \n2,484\n \n64,486\n \n—\n \n—\n \n2018/2024\nAvalon Somerville Station\nSomerville, NJ\n374\n \n16,663\n \n98,452\n \n356\n \n16,663\n \n98,808\n \n115,471\n \n8,702\n \n106,769\n \n109,877\n \n—\n \n2023\nThe Park Loggia Commercial\nNew York, NY\n N/A \n77,393\n \n76,410\n \n10,558\n \n77,393\n \n86,968\n \n164,361\n \n16,194\n \n148,167\n \n151,200\n \n—\n \n2019\nAvalon Harrison\nHarrison, NY\n143\n \n14,380\n \n75,858\n \n565\n \n14,380\n \n76,423\n \n90,803\n \n7,560\n \n83,243\n \n85,632\n \n—\n \n2023\nAvalon Harbor Isle\nIsland Park, NY\n172\n \n18,751\n \n76,479\n \n—\n \n18,751\n \n76,479\n \n95,230\n \n6,763\n \n88,467\n \n87,814\n \n—\n \n2022\nAvalon Frisco at Main\nFrisco, TX\n360\n \n11,919\n \n71,954\n \n802\n \n11,919\n \n72,756\n \n84,675\n \n7,213\n \n77,462\n \n80,364\n \n—\n \n2013/2023\nAvalon West Plano\nCarrollton, TX\n568\n \n14,100\n \n123,693\n \n908\n \n14,100\n \n124,601\n \n138,701\n \n14,001\n \n124,700\n \n132,876\n \n62,448\n \n2016/2023\nAvalon at Pier 121\nLewisville, TX\n300\n \n8,418\n \n54,048\n \n76\n \n8,418\n \n54,124\n \n62,542\n \n3,170\n \n59,372\n \n—\n \n2014/2024\nAvalon Townhomes at Bee Cave\nBee Cave, TX\n126\n \n7,955\n \n41,282\n \n—\n \n7,955\n \n41,282\n \n49,237\n \n489\n \n48,748\n \n—\n \n2022/2024\nAVA Ballston Square\nArlington, VA\n714\n \n71,640\n \n240,201\n \n40,066\n \n71,640\n \n280,267\n \n351,907\n \n114,814\n \n237,093\n \n243,879\n \n—\n \n1992/2013\nAvalon Wilton on River Rd (4)\nWilton, CT\n102\n \n2,116\n \n14,664\n \n8,480\n \n2,116\n \n23,144\n \n25,260\n \n18,309\n \n6,951\n \n7,685\n \n—\n \n1997\nTOTAL OTHER STABILIZED\n4,478\n \n$\n319,132\n \n$\n1,365,748\n \n$\n62,386\n \n$\n319,132\n \n$\n1,428,134\n \n$\n1,747,266\n \n$\n217,909\n \n$\n1,529,357\n \n$\n1,110,436\n \n$\n62,448\n \nTOTAL CURRENT COMMUNITIES (5)\n81,336\n \n$\n4,636,436\n \n$\n17,951,468\n \n$\n2,590,754\n \n$\n4,636,436\n \n$\n20,542,222\n \n$\n25,178,658\n \n$\n8,089,147\n \n$\n17,089,511\n \n$\n17,165,436\n \n$\n734,429\n \nDEVELOPMENT (4)\nAvalon West Dublin\nDublin, CA\n499\n \n$\n39,070\n \n$\n221,025\n \n$\n—\n \n$\n39,070\n \n$\n221,025\n \n$\n260,095\n \n$\n6,236\n \n$\n253,859\n \n$\n239,840\n \n$\n—\n \n2024\nAvalon Pleasanton - Phase 1\nPleasanton, CA\n82\n \n—\n \n20,275\n \n—\n \n—\n \n20,275\n \n20,275\n \n—\n \n20,275\n \n—\n \nN/A\nKanso Hillcrest\nSan Diego, CA\n182\n \n—\n \n15,807\n \n—\n \n—\n \n15,807\n \n15,807\n \n—\n \n15,807\n \nN/A\nAvalon Westminster Promenade\nWestminster, CO\n312\n \n6,282\n \n107,568\n \n—\n \n6,282\n \n107,568\n \n113,850\n \n1,131\n \n112,719\n \n91,833\n \n—\n \n2024\nAvalon Governor's Park\nDenver, CO\n304\n \n10,298\n \n125,111\n \n—\n \n10,298\n \n125,111\n \n135,409\n \n645\n \n134,764\n \n106,898\n \n—\n \n2024\nAvalon Merrick Park\nMiami, FL\n254\n \n23,779\n \n79,155\n \n—\n \n23,779\n \n79,155\n \n102,934\n \n4,829\n \n98,105\n \n93,451\n \n—\n \n2023\nAvalon South Miami\nSouth Miami, FL\n290\n \n—\n \n126,402\n \n—\n \n—\n \n126,402\n \n126,402\n \n—\n \n126,402\n \n43,909\n \n—\n \nN/A\nKanso Milford\nMilford, MA\n162\n \n14,361\n \n47,357\n \n—\n \n14,361\n \n47,357\n \n61,718\n \n1,008\n \n60,710\n \n38,557\n \n—\n \n2024\nAvalon Quincy Adams\nQunicy, MA\n288\n \n—\n \n38,834\n \n—\n \n—\n \n38,834\n \n38,834\n \n—\n \n38,834\n \n—\n \nN/A\nAvalon Annapolis\nAnnapolis, MD\n508\n \n13,195\n \n160,461\n \n—\n \n13,195\n \n160,461\n \n173,656\n \n372\n \n173,284\n \n115,599\n \n—\n \nN/A\nAvalon Hunt Valley West\nHunt Valley, MD\n322\n \n—\n \n79,435\n \n—\n \n—\n \n79,435\n \n79,435\n \n—\n \n79,435\n \n29,616\n \n—\n \nN/A\nAVA Brewers Hill\nBaltimore, MD\n418\n \n—\n \n23,182\n \n—\n \n—\n \n23,182\n \n23,182\n \n—\n \n23,182\n \n—\n \nN/A\nAvalon Durham\nDurham, NC\n336\n \n17,329\n \n99,764\n \n—\n \n17,329\n \n99,764\n \n117,093\n \n1,436\n \n115,657\n \n80,784\n \n—\n \n2024\nF-48\nTable of Contents\nAVALONBAY COMMUNITIES, INC.\nREAL ESTATE AND ACCUMULATED DEPRECIATION (Continued)\nDecember 31, 2024\n(Dollars in thousands)\n2024\n2023\n2024\n \n \nInitial Cost\n \nTotal Cost\n \n \n \n \n \nCommunity\nCity and state\n# of homes\nLand and Improvements\nBuilding /\nConstruction in\nProgress &\nImprovements\nCosts\nSubsequent to\nAcquisition /\nConstruction\nLand and Improvements\nBuilding /\nConstruction in\nProgress &\nImprovements\nTotal\nAccumulated\nDepreciation\nTotal Cost,\nNet of\nAccumulated\nDepreciation\nTotal Cost,\nNet of\nAccumulated\nDepreciation\nEncumbrances\nYear of\nCompletion /\nAcquisition\nAvalon Lake Norman\nMooresville, NC\n345\n \n$\n—\n \n$\n59,909\n \n$\n—\n \n$\n—\n \n$\n59,909\n \n$\n59,909\n \n$\n—\n \n$\n59,909\n \n$\n20,233\n \n$\n—\n \nN/A\nAvalon Carmel\nCharlotte, NC\n360\n \n—\n \n29,299\n \n—\n \n—\n \n29,299\n \n29,299\n \n—\n \n29,299\n \n—\n \nN/A\nAvalon Oakridge I\nDurham, NC\n459\n \n—\n \n25,229\n \n—\n \n—\n \n25,229\n \n25,229\n \n—\n \n25,229\n \n—\n \nN/A\nAvalon W Squared at Princeton Junction\nWest Windsor, NJ\n535\n \n—\n \n118,103\n \n—\n \n—\n \n118,103\n \n118,103\n \n—\n \n118,103\n \n50,414\n \n—\n \nN/A\nAvalon Princeton on Harrison\nPrinceton, NJ\n200\n \n—\n \n68,584\n \n—\n \n—\n \n68,584\n \n68,584\n \n—\n \n68,584\n \n25,615\n \n—\n \nN/A\nAvalon Wayne\nWayne, NJ\n473\n \n—\n \n73,596\n \n—\n \n—\n \n73,596\n \n73,596\n \n—\n \n73,596\n \n23,811\n \n—\n \nN/A\nAvalon Parsippany\nParsippany, NJ\n410\n \n—\n \n61,470\n \n—\n \n—\n \n61,470\n \n61,470\n \n—\n \n61,470\n \n17,012\n \n—\n \nN/A\nAvalon Roseland II\nRoseland, NJ\n533\n \n—\n \n65,048\n \n—\n \n—\n \n65,048\n \n65,048\n \n—\n \n65,048\n \n—\n \nN/A\nAvalon Montville\nPine Brook, NJ\n349\n \n8,463\n \n116,478\n \n22\n \n8,463\n \n116,500\n \n124,963\n \n3,780\n \n121,183\n \n110,858\n \n—\n \n2024\nAvalon Princeton Circle\nPrinceton, NJ\n221\n \n11,705\n \n75,606\n \n55\n \n11,705\n \n75,661\n \n87,366\n \n3,770\n \n83,596\n \n84,482\n \n—\n \n2023\nAvalon Amityville\nAmityville, NY\n338\n \n22,463\n \n113,328\n \n—\n \n22,463\n \n113,328\n \n135,791\n \n4,368\n \n131,423\n \n122,575\n \n—\n \n2024\nAvalon Plano\nPlano, TX\n155\n \n—\n \n14,502\n \n—\n \n—\n \n14,502\n \n14,502\n \n—\n \n14,502\n \n—\n \nN/A\nAvalon Tech Ridge I\nAustin, TX\n444\n \n—\n \n29,142\n \n—\n \n—\n \n29,142\n \n29,142\n \n—\n \n29,142\n \n—\n \nN/A\nAvalon Bothell Commons\nBothell, WA\n467\n \n26,699\n \n205,180\n \n155\n \n26,699\n \n205,335\n \n232,034\n \n6,826\n \n225,208\n \n216,782\n \n—\n \n2024\nAvalon Redmond Campus\nRedmond, WA\n214\n \n7,003\n \n81,183\n \n103\n \n7,003\n \n81,286\n \n88,289\n \n2,443\n \n85,846\n \n81,531\n \n—\n \n2024\nTOTAL DEVELOPMENT\n9,460\n \n$\n200,647\n \n$\n2,281,033\n \n$\n335\n \n$\n200,647\n \n$\n2,281,368\n \n$\n2,482,015\n \n$\n36,844\n \n$\n2,445,171\n \n$\n1,593,800\n \n$\n—\n \nLand Held for Development\nN/A\n$\n151,922\n \n$\n—\n \n$\n—\n \n$\n151,922\n \n$\n—\n \n$\n151,922\n \n$\n—\n \n$\n151,922\n \n$\n199,062\n \n$\n—\n \nCorporate Overhead\nN/A\n53,179\n \n13,305\n \n70,703\n \n53,179\n \n84,008\n \n137,187\n \n56,729\n \n80,458\n \n36,563\n \n7,400,000\n \n2024 Disposed Communities\nN/A\n— \n— \n— \n— \n— \n— \n— \n— \n348,010\n \n— \nTOTAL\n90,796\n \n$\n5,042,184\n \n$\n20,245,806\n \n$\n2,661,792\n \n$\n5,042,184\n \n$\n22,907,598\n \n$\n27,949,782\n \n$\n8,182,720\n \n$\n19,767,062\n \n$\n19,342,871\n \n$\n8,134,429\n \n(6)\n_________________________________\n(1)     Some or all of the land or associated parking structure for this community is subject to a finance lease. \n(2)     This community was under redevelopment for some or all of 2024, with the redevelopment activities not expected to materially impact community operations, and therefore this community is included in the Same Store portfolio and not classified as a Redevelopment Community.\n(3)    Some or all of the land for this community is subject to an operating lease.\n(4)    As of December 31, 2024, this community qualified as held for sale. \n(5)      Current and Development Communities excludes Unconsolidated Communities and Unconsolidated Development Communities.\n(6)    Balance outstanding represents total amount due at maturity, and excludes deferred financing costs and debt discount associated with the unsecured and secured notes of $\n41,216\n and $\n15,964\n, respectively.\nF-49\nTable of Contents\nAVALONBAY COMMUNITIES, INC.\nREAL ESTATE AND ACCUMULATED DEPRECIATION (Continued)\nDecember 31, 2024\n(Dollars in thousands)\nAmounts include real estate assets held for sale.\nThe aggregate cost of total real estate for federal income tax purposes was approximately $\n26,195,803\n at December 31, 2024.\nThe changes in total real estate assets for the years ended December 31, 2024, 2023 and 2022 are as follows:\n \nDecember 31, 2024\nDecember 31, 2023\nDecember 31, 2022\nBalance, beginning of period\n$\n26,864,833\n \n$\n25,871,363\n \n$\n24,927,305\n \nAcquisitions, construction costs and improvements (1)\n1,602,790\n \n1,272,558\n \n1,599,311\n \nDispositions, including casualty losses, and other activity\n(\n517,841\n)\n(\n279,088\n)\n(\n655,253\n)\nBalance, end of period\n$\n27,949,782\n \n$\n26,864,833\n \n$\n25,871,363\n \n \n_________________________________\n(1)     2023 amounts have been adjusted to reflect the reclassification of software development costs from Furniture, fixtures and equipment to Prepaid expenses and other assets on the Consolidated Balance Sheet. \nThe changes in accumulated depreciation for the years ended December 31, 2024, 2023 and 2022, are as follows:\n \nDecember 31, 2024\nDecember 31, 2023\nDecember 31, 2022\nBalance, beginning of period\n$\n7,521,962\n \n$\n6,878,556\n \n$\n6,217,721\n \nDepreciation (1)\n846,853\n \n781,313\n \n814,978\n \nDispositions, including casualty losses\n(\n186,095\n)\n(\n137,907\n)\n(\n154,143\n)\nBalance, end of period\n$\n8,182,720\n \n$\n7,521,962\n \n$\n6,878,556\n \n_________________________________\n(1)     2023 amounts have been adjusted to reflect the reclassification of software development costs from Furniture, fixtures and equipment to Prepaid expenses and other assets on the Consolidated Balance Sheet.\n \nF-50"
  }
}