{
  "ticker": "AVY",
  "cik": "0000008818",
  "company_name": "Avery Dennison Corp",
  "filing_date": "2025-02-26",
  "accession": "0000008818-25-000003",
  "primary_doc": "avy-20241228.htm",
  "item_sections": {
    "item1": "Item 1. BUSINESS\nCompany Background\nAvery Dennison Corporation (“Avery Dennison” or the “Company” and generally referred to as “we” or “us”) was incorporated in Delaware in 1977 as Avery International Corporation, the successor corporation to a California corporation of the same name incorporated in 1946. In 1990, we merged one of our subsidiaries into Dennison Manufacturing Company (“Dennison”), as a result of which Dennison became our wholly-owned subsidiary and in connection with which we changed our name to Avery Dennison Corporation. You can learn more about us by visiting our website at www.averydennison.com. Our website is not intended to function as a hyperlink and the information on our website is not, nor should it be considered, part of this report or incorporated by reference into this report. \nBusiness Overview and Reportable Segments\nWe are a global materials science and digital identification solutions company. We are Making Possible\nTM\n products and solutions that help advance the industries we serve, providing branding and information solutions that optimize labor and supply chain efficiency, reduce waste, advance sustainability, circularity and transparency, and better connect brands and consumers. We design and develop labeling and functional materials, radio-frequency identification (\"RFID\") inlays and tags, software applications that connect the physical and digital, and offerings that enhance branded packaging and carry or display information that improves the customer experience. We serve an array of industries worldwide, including home and personal care, apparel, general retail, e-commerce, logistics, food and grocery, pharmaceuticals and automotive.\nWe believe that our exposure to diverse and growing markets, the size and scale of operations, our innovation capabilities, productivity culture, and brand strength across our businesses are the primary advantages in maintaining and further developing our competitive position.\nOur reportable segments for fiscal year 2024 were Materials Group and Solutions Group. In 2024, our Materials Group and Solutions Group reportable segments comprised approximately 69% and 31%, respectively, of our total net sales. \nIn 2024, international operations constituted a substantial majority of our business, representing approximately 70% of our net sales. As of December 28, 2024, we operated over 200 manufacturing and distribution facilities and had locations in more than 50 countries. \nMaterials Group\nOur Materials Group is a leading global provider to the pressure-sensitive label and graphics industries. Our innovative products include label materials, graphics and reflective materials and functional bonding materials, like tapes. Our label materials enhance brands' shelf appeal, inform shoppers, advance circularity, increase transparency, help reduce waste and improve operational supply chain efficiency. Our graphics portfolio offers highly engineered products ranging from vehicle wraps to architectural films. Our tapes portfolio includes bonding and functional materials for applications in various industry sectors such as automotive, building and construction and electronics. We leverage the group's materials science capabilities and process engineering expertise to develop and manufacture Intelligent Labels at scale and drive their further adoption through our converter channel access. \nOur Materials Group manufactures and sells Fasson\n®\n-, JAC\n®\n-, and Avery Dennison\n®\n-brand pressure-sensitive label materials and performance tapes products, Avery Dennison\n®\n- and Mactac\n®\n-brand graphics, and Avery Dennison\n®\n-brand reflective products. Materials Group’s business tends not to be seasonal, except for certain outdoor graphics and reflective products.\nPressure-sensitive materials consist primarily of papers, plastic films and metal foils, which are coated with internally-developed and purchased adhesives, and then laminated with specially-coated backing papers and films. They are then sold in roll or sheet form with either solid or patterned adhesive coatings in a wide range of face materials, sizes, thicknesses and adhesive properties.\nA pressure-sensitive, or self-adhesive, material is one that adheres to a surface by press-on contact. It generally consists of four layers: a face material, which may be paper, metal foil or plastic film; an adhesive, which may be permanent or removable; a release coating; and a backing material to protect the adhesive from premature contact with other surfaces that can also serve as a carrier for supporting and dispensing individual labels. When the products are ready for use, the release coating and protective backing are removed, exposing the adhesive so that the label or other face material may be pressed or rolled into place. Because they are easy to apply without the need for adhesive activation, self-adhesive materials can provide cost savings compared to other materials that require heat- or moisture-activated adhesives, while also offering aesthetic and other advantages over alternative technologies.\nLabel materials are sold worldwide to label converters for labeling, decorating and specialty applications in the food, home and personal care, beer and beverage, durables, pharmaceutical, wine and spirits and logistics market segments. When used in package decoration applications, the visual appeal of self-adhesive materials can help increase sales of the products on which the materials are applied. Self-adhesive materials are also used to convey variable information through \n2\nTable of Contents\nvarious digital triggers, including bar codes, QR codes and RFID inlays, for applications such as shipping labels and weight and price information for packaged meats and other foods. Self-adhesive materials provide consistent and versatile adhesion and are available in a large selection of materials, which can be made into labels of varying sizes and shapes.\nOur graphics and reflective products include a variety of films and other products that are sold to the architectural, commercial sign, digital printing and other related market segments. We also sell durable cast and reflective films to the construction, automotive and fleet transportation market segments and reflective films for traffic and safety applications. We provide sign shops, commercial printers and designers a broad range of pressure-sensitive materials that allow them to create impactful and informative brand and decorative graphics. We offer a wide array of pressure-sensitive vinyl and specialty materials designed for digital imaging, screen printing and sign cutting applications.\nOur performance tapes products include a variety of Fasson\n®\n-brand and Avery Dennison\n®\n-brand tapes and other pressure-sensitive adhesive-based materials and converted products, mechanical fasteners and performance polymers. Our pressure-sensitive adhesive-based materials are available in roll form and in a wide range of face materials, sizes, thicknesses and adhesive properties. These materials and converted products are used in non-mechanical fastening, bonding and sealing systems for various automotive, electronics, building and construction, general industrial, personal care, and medical applications. The mechanical fasteners are primarily precision-extruded and injection-molded plastic devices used in various automotive, general industrial and retail applications.\nOur larger competitors in label materials include UPM Raflatac, a subsidiary of UPM Corporation; Fedrigoni Self-Adhesives; Lintec Corporation; Flexcon Corporation, Inc.; and an array of smaller regional and local companies. For graphics and reflective products, our largest competitors are 3M Company (“3M”) and the Orafol Group. For performance tapes products, our competitors include 3M; Tesa-SE, a subsidiary of Beiersdorf AG; Nitto Denko Corporation; and numerous regional and specialty suppliers. For fastener products, there are a variety of competitors supplying extruded and injection molded fasteners and fastener attaching equipment. We believe that entry of competitors into the field of pressure-sensitive adhesives and materials is limited by technical knowledge and capital requirements. We believe that our technical expertise, size and scale of operations, broad line of quality products, reliable service, product and process innovation, distribution capabilities and brand strength are the primary advantages in maintaining and further developing our competitive position.\nSolutions Group \nOur Solutions Group is a leading provider of information and branding solutions that cover worldwide marketplace needs ranging from digital identification and data management to branding and embellishment, productivity, pricing and retail media. As a large ultra-high-frequency RFID solutions provider, we empower customers across multiple retail and industry segments, including apparel, logistics, food and grocery and general retail, to connect the physical and digital worlds by enabling a digital identity and life on physical items. Our innovation and data management capabilities, global footprint and market access continuously expand our solutions platform.\nThe branding solutions of the Solutions Group include brand embellishments, graphic tickets, tags, and labels, and sustainable packaging. Solutions Group’s information solutions include item-level RFID solutions; visibility and loss prevention solutions; price ticketing and marking; care, content, and country of origin compliance solutions; brand protection and security solutions; and Vestcom\n®\n-brand shelf-edge productivity and media solutions.\nIn the Solutions Group, our primary competitors include Checkpoint Systems, Inc., a subsidiary of CCL Industries Inc.; R-pac International Corporation; SML Group Limited; Arizon RFID Technology Cayman Co Ltd; and Tageos, a subsidiary of Fedrigoni Group. We believe that our product, process and solution innovation, global distribution network, reliable service, product quality and consistency, and ability to serve customers consistently with comprehensive solutions close to where they manufacture, source and sell are the key advantages in maintaining and further developing our competitive position.\nResearch, Development and Innovation \nAs a global leader in materials science, we innovate to develop and introduce new products and solutions that help customers solve some of the most complex problems in the industries we serve. Our vision is to leverage the strengths of our Materials and Solutions groups to continue to drive growth within these businesses and lead at the intersection of the physical and digital worlds. Our decades of experience creating solutions for customers and our core capabilities in materials science, engineering and process technology enable us to drive continuous innovation throughout our industries. Our innovation efforts focus on anticipating market and customer challenges and opportunities, and applying technology to address them. Our investment in innovation aims to accelerate growth by developing new products and solutions, expand margins through material re-engineering, and enable customer success by leveraging scalable innovation platforms and delivering sustainability initiatives and advanced technologies.\nMany of our new products result from our research and development efforts. These efforts are directed primarily toward developing products, solutions and operating techniques and improving productivity, sustainability and product performance, often in close association with our customers or end users. These efforts provide intellectual property that leverages our research and development relating to materials science, such as adhesives, films, inks and release liners, and process engineering technology, such as coating, laminating and printing technologies in Materials Group. We focus on research projects related to RFID, external embellishments, data and digital solutions and printing technologies in Solutions \n3\nTable of Contents\nGroup, in each case for which we have and license a number of patents. Additionally, our research and development efforts include sustainable innovation and design of products that advance the circular economy, reduce materials and waste, use recycled content, and extend product end-of-life or enable product recycling.\nAcquisitions and Venture Investments\nIn addition to our investments to support organic growth, we have pursued complementary and synergistic acquisitions. In 2023, we acquired Silver Crystal Group (\"Silver Crystal\"), a Canada-based provider of sports apparel customization and application solutions across in-venue, direct-to-business and e-commerce platforms; LG Group, Inc. (\"Lion Brothers\"), a Maryland-based designer and manufacturer of apparel brand embellishments; and Thermopatch, Inc. (\"Thermopatch\"), a New York-based manufacturer specializing in labeling, embellishments and transfers for the sports, industrial laundry, workwear and hospitality industries. The aggregate purchase consideration for these acquisitions was approximately $231 million. During 2024, we also made venture investments in three companies developing technological solutions that we believe have the potential to advance our businesses. For information regarding our acquisitions, see Note 2, “Business Acquisitions,” in the Notes to Consolidated Financial Statements. For information regarding our venture investments, see Note 9, “Fair Value Measurements,” in the Notes to Consolidated Financial Statements.\nPatents, Trademarks and Licenses\nThe loss of individual patents or licenses would not be material to us taken as a whole, nor to our operating segments individually. Our principal trademarks are Avery Dennison, our logo, and Fasson. We believe these trademarks are strong in the market segments in which we operate.\nHuman Capital Resources\nOur Global Workforce\nWith approximately 70% of our 2024 net sales originating outside the U.S. and approximately 40% of our net sales originating in emerging markets (Latin America, Eastern Europe, Middle East/Northern Africa, and most countries in Asia Pacific), our employees are located in more than 50 countries to best serve our customers. Approximately 83% of our employees at year-end 2024 were located outside the U.S. and approximately 66% were located in emerging markets.\nThe charts below show our global employee population by region and operational function. Over 19,000 of our approximately 35,000 employees at year-end 2024, representing approximately 58% of our global workforce, were in Asia Pacific, serving our customers in that region. At that time, approximately 65% of our global workforce worked in the operations of our manufacturing facilities or in positions directly supporting them from other locations.\nWorkforce by Region\nAsia Pacific\n58 \n%\nNorth America\n21 \nEurope\n17 \nLatin America\n4 \nWorkforce by Function\nOperations\n65 \n%\nNon-Operations\n35 \nTalent & Development\nAttracting, developing and retaining highly-skilled talent is critical to our ability to continue delivering sustainable growth. We provide ongoing support and professional development resources to our team members worldwide to ensure that their skills evolve with our business needs, industry trends and human capital management best practices, as well as enable increased productivity, peak performance and career growth. We have robust talent review and succession planning processes that provide individually targeted development opportunities for our team members. We emphasize on-the-job development and coaching, and also provide facilitator-led and direct-access online training, leadership opportunities to execute special projects and, in some cases, cross-functional, cross-regional, or cross-divisional work assignments. In 2024, we introduced an enterprise-wide competency model that provides transparency and clarity around what we expect from our leaders, which will serve as the go-forward foundation of all of our talent practices, from talent selection and retention to individual and career development to succession.\n4\nTable of Contents\nCompensation & Benefits\nOur total rewards philosophy is to offer market-based, competitive wages and benefits in the markets where we compete for talent. All of our employees were paid at least the applicable legal minimum wage, and over 99% of our employees were paid above the applicable legal minimum wage, at year-end 2024. Pay is generally positioned around the market median, with variances based on knowledge, skills, years of experience and in line with our pay for performance philosophy. In addition to base wages, our compensation and benefit programs — which vary by region, country and business unit — include short-term incentives (generally paid in cash), long-term incentives (e.g., cash- or stock-based awards), employee benefit and retirement plans, healthcare and insurance benefits, health savings and flexible spending accounts, paid time off, leave of absence and employee assistance programs. We offer the opportunity for flexible work arrangements for most of our office-based workforce to provide them with greater flexibility to balance their work and personal commitments, while ensuring that we meet the needs of our business. Our information technology infrastructure, information security protocols and digital tools support employee efficiency and effectiveness wherever they work.\nPay equity is an important part of our global pay planning and practices. Each year, we engage an independent third party to evaluate pay equity, making merit-based pay adjustments where appropriate. In 2024, we reviewed pay equity (considering total base, annual incentives and long-term incentives) with respect to gender for 93% of our global employee population, and with respect to gender and race/ethnicity for all U.S. employees. We continue to enhance our manager education, tools and processes to provide fair and equitable pay.\nEmployee Engagement\nBecause we believe that an engaged workforce promotes retention and minimizes employee turnover, we annually conduct a global employee engagement survey. With a focus on continuous improvement, in 2023 we launched our survey using a more advanced platform providing real-time access to results, improved analytics and ability to connect data throughout the employee experience, more meaningful comparisons to external benchmarks, and ongoing pulse survey capability. We deployed this same platform in 2024, enabling year-over-year comparability of results. Our business and functional teams use the anonymized results of our survey to identify and implement actions to address potential opportunities for improvement. While employee engagement is the result of many factors, we believe strong, encouraging and open leadership, as well as a continued effort to foster a collaborative, supportive culture, leads to strong workforce engagement.\nWorkforce Health & Safety\nSafety is one of our highest priorities, and we continually work to ensure our manufacturing facilities, distribution centers and administrative offices focus on safety, so that anyone working in or visiting one of our locations feels and remains safe from injury. Our global Recordable Incident Rate of 0.21 in 2024 was significantly lower than the Occupational Safety and Health Administration manufacturing industry average of 2.8 in 2023 (the most recent available industry average).\nWorkplace Culture\nWe aim to foster an environment where our employees with various skills, experiences and backgrounds can grow and be increasingly productive and innovative, allowing us to benefit from a highly engaged team and attract and retain talent for the benefit of our stakeholders. Our global people-focused strategic pillars include enhancing the experience of our manufacturing employees and making merit and transparency even more foundational to our employee experience. We have a global team that helps advance these priorities in coordination with regional councils and our employee resource groups, which are open to all our team members and provide individuals with shared interests a forum in which to identify ways in which we can improve our employee experience.\nManufacturing and Environmental Matters\nWe use various raw materials – primarily paper, plastic films and resins, as well as specialty chemicals purchased from various commercial and industrial sources – that are subject to price fluctuations. Although shortages can occur from time to time, these raw materials are generally available.\nWe produce a majority of our self-adhesive materials using water-based emulsion and hot-melt adhesive technologies. A portion of our manufacturing process for self-adhesive materials utilizes organic solvents, which, unless controlled, could be emitted into the atmosphere or contaminate soil or groundwater. Emissions from these operations contain small amounts of volatile organic compounds, which are regulated by federal, state, local and foreign governments. We continue to evaluate the use of alternative materials and technologies to minimize these emissions. In connection with the maintenance and acquisition of certain manufacturing equipment, we invest in solvent capture and control units to assist in regulating these emissions.\nWe have developed adhesives and adhesive processing systems that minimize the use of solvents. Emulsion adhesives, hot-melt adhesives, and solventless and emulsion silicone systems have been installed in many of our facilities.\n5\nTable of Contents\nBased on current information, we do not believe that the cost of complying with applicable laws regulating the emission or discharge of materials into the environment, or otherwise relating to the protection of the environment, will have a material effect upon our capital expenditures, consolidated financial position, results of operations or competitive position.\nFor information regarding our potential responsibility for cleanup costs at certain hazardous waste sites, see Note 8, “Contingencies,” in the Notes to Consolidated Financial Statements.\nAvailable Information\nOur Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and amendments to those reports filed with, or furnished to, the Securities and Exchange Commission (“SEC”) pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), are available free of charge on our investor website at www.investors.averydennison.com as soon as reasonably practicable after they are electronically filed with or furnished to the SEC. This website address is not intended to function as a hyperlink and the information located there is not, nor should it be considered, part of this report or incorporated by reference into this report. We also make available on the investors section of our website under \"Governance Documents\" the following documents as currently in effect: (i) Amended and Restated Certificate of Incorporation, as amended; (ii) Amended and Restated Bylaws; (iii) Corporate Governance Guidelines; (iv) Code of Conduct, which applies to our directors, officers and employees; (v) Code of Ethics for our Chief Executive Officer and Senior Financial Officers; (vi) charters of the Audit, Talent and Compensation, Governance and Finance Committees of our Board of Directors; and (vii) Audit Committee Complaint Procedures for Accounting and Auditing Matters. These documents are also available free of charge upon written request to our Corporate Secretary, Avery Dennison Corporation, 8080 Norton Parkway, Mentor, Ohio 44060.\nReports filed with or furnished to the SEC may be viewed at www.sec.gov.\n6\nTable of Contents",
    "item1a": "Item 1A of this report.\nCybersecurity Governance\nOur Board of Directors (our “Board”) considers cybersecurity risk as part of its risk oversight function and has delegated to the \nAudit Committee\n primary responsibility for overseeing our cybersecurity risk management program and engaging with management on cybersecurity and other risks related to our information technology controls and security.\n Our Information Security Officer (“ISO”) reports directly to our Chief Information Officer (“CIO”), a member of our Company Leadership Team and direct report of our Chief Executive Officer (“CEO”). The CIO and ISO together provide updates and discuss our cybersecurity preparedness with the Audit Committee at least semiannually, which its Chair then reports on to our full \nBoard\n. \nManagement updates the Audit Committee, if and as needed, regarding any significant cybersecurity events, as well as events that may have had lesser potential impact.\nOur cybersecurity leadership team (\"CSLT\"), which includes leaders accountable for security operations, incident response, risk and compliance, data security, application security, digital solutions security, vulnerability management and operational technology security, is responsible for assessing and managing our risks from cybersecurity threats. The team has primary responsibility for our overall cybersecurity risk management program and supervises both our internal cybersecurity personnel and our external cybersecurity consultants.\n \nInformation security personnel maintain a variety of technical and managerial security certifications and have broad security experience in manufacturing, finance, software and information technology environments.\nThe CSLT supervises our efforts to prevent, detect, mitigate and remediate cybersecurity risks and incidents through a variety of means, which may include briefings from internal security personnel; threat intelligence and other information obtained from governmental, public or private sources, including external consultants; and reports from cybersecurity systems deployed in our information technology environment.\n18\nTable of Contents",
    "item1b": "Item 1B. UNRESOLVED STAFF COMMENTS\nNone.\n17\nTable of Contents",
    "item1c": "Item 1C. CYBERSECURITY \nCybersecurity Risk Management and Strategy\nOur cybersecurity risk management program, which is designed to protect the confidentiality, integrity and availability of our critical systems and information, includes a comprehensive cybersecurity incident response plan.\nWe design and assess our program based on the ISO 27000 and the National Institute of Standards and Technology (NIST) SP-800 and Cybersecurity Framework. \nWe use these frameworks to help us identify, assess and manage cybersecurity risks relevant to our business and do\n not intend to suggest that we meet any particular technical standards, specifications or requirements.\nOur cybersecurity risk management program complements our overall enterprise risk management program, using similar methodologies and governance processes to identify risks and mitigating strategies.\nOur cybersecurity risk management program includes risk assessments designed to help identify potentially material cybersecurity risks to our critical systems, information, products and services, as well as our broader enterprise information technology environment; an information technology security team principally responsible for managing our cybersecurity risk assessment processes, security controls and response to any cybersecurity events; \nthe use of third party experts and service providers, where appropriate, to assess, test and otherwise assist with protecting our security environment\n; cybersecurity awareness training for our employees and further training for our incident response personnel and senior management; a cybersecurity incident response plan that includes procedures for assessing and coordinating our response to cybersecurity events; and a third-party risk management process for service providers, suppliers and vendors.\nWe have not experienced cybersecurity events that have materially affected our operations, results of operations, or financial condition. However, we face certain ongoing risks from cybersecurity threats that, if realized, would be reasonably likely to materially affect us, including our operations, results of operations, or financial condition.\nRisks and uncertainties related to cybersecurity are discussed in greater detail under “Risks Related to Information Technology” in"
  }
}