{
  "ticker": "AXON",
  "cik": "0001069183",
  "company_name": "AXON ENTERPRISE, INC.",
  "filing_date": "2025-02-28",
  "accession": "0001069183-25-000019",
  "primary_doc": "axon-20241231.htm",
  "item_sections": {
    "item1": "Item 1.    \nBusiness\nOverview\nAxon Enterprise, Inc. (“Axon,” the “Company,” “we” or “us”) is a technology leader in global public safety. In 2022, we announced our moonshot goal to cut gun-related deaths between police and the public in the United States in half by 2033.\nAxon is building the public safety operating system of the future by integrating a suite of hardware devices and cloud software solutions that not only revolutionize modern policing but also cater to federal agencies, corrections, justice and enterprise-level security needs. Axon’s suite includes cloud-hosted digital evidence management solutions, productivity and real-time operations software, body cameras, in-car cameras, TASER energy devices, drone and robotic security, and training solutions.\nOur hardware and software solutions advance our mission to (i) make the bullet obsolete, (ii) reduce social conflict, and (iii) enable a fair and effective justice system. Our products solve some of society's most challenging problems and our mission attracts top talent. We aim to invent and deliver public safety products that progressively make the right things easier and the wrong things harder every day.\nOur research & development (“R&D”) investments support continuous innovation on behalf of our customers. Our financial strategy is to build highly recurring, highly profitable businesses and to drive growth through this purposeful product innovation. \nAxon’s operations comprise two reportable segments:\n1.\nSoftware and Sensors: We develop, manufacture and sell fully integrated hardware and cloud-based software solutions that enable law enforcement to capture, securely store, manage, share and analyze video and other digital evidence. Our software offerings also support productivity and real-time operations. The Software and Sensors segment includes the sale of sensors, including body cameras, in-car cameras, other hardware sensors, warranties on sensors, and other products, as well as recurring cloud-hosted software revenue, related non-recurring professional services revenue, and revenue from certain software, including on-premise licenses.\n2.\nTASER: Axon is the market leader in the development, manufacture and sale of conducted energy devices (\"CEDs\"), which we sell under our brand name, TASER. The TASER segment includes the manufacture and sale of CEDs, batteries, accessories and extended warranties, digital subscription training content, virtual reality (\"VR\") training content, TASER Evidence.com license revenue, and other professional services tied to TASER and VR deployments.\nFor further information about our reportable segments and sales by geographic region, refer to Note 1 of Part II, Item 8 of this Annual Report on Form 10-K.\nAxon employees are distributed across multiple geographies and report to work via a remote-hybrid model, which leverages both in-person collaboration environments as well as cloud-based software tools that enable remote productivity. Our headquarters in Scottsdale, Arizona and our hubs in Seattle, Washington; San Francisco, California; Boston, Massachusetts; Atlanta, Georgia; and Sterling, Virginia house the majority of our in-person employees located in the United States, including members of our executive management team, and sales, marketing, certain engineering, manufacturing, finance and other administrative support functions. We also have subsidiaries and/or offices located in Australia, Belgium, Canada, Finland, France, Germany, Greece, India, Italy, the Netherlands, Spain, the United Kingdom and Vietnam.\nKey Product Category Revenue Drivers: What We Offer\nAxon products are generally cloud-connected, designed to drive better outcomes and customer experiences, and sold via mutually reinforcing integrated subscription plans. Our key revenue drivers belong to three broad product categories:\n•\nSoftware:\n Axon is building a suite of cloud-based, Software-as-a-Service (“SaaS”) solutions that integrate with our sensors and TASER devices to benefit customers and drive annual recurring revenue, which totaled \n4\nTable of Contents\n$1.0 billion\n1\n as of December 31, 2024. We have many SaaS solutions, which can best be trisected into three categories: digital evidence management, productivity and real-time operations solutions. Axon Evidence is the world’s largest cloud-hosted public safety data repository of public safety video data and other types of digital evidence. Our productivity suite, which includes Axon Records and artificial intelligence (\"AI\"), is designed to save officers time spent writing reports and doing paperwork. Our real-time operations capabilities, which include Axon Respond, integrates location data, signal alerts and video feeds to provide a complete picture of evolving situations.\n•\nSensors:\n Axon devices address many needs, including transparency, real-time situational awareness, and accurate capture and integration of evidence with software workflows. Product categories within sensors include Axon Body cameras, Axon Fleet in-car systems, drones and robotics, and other devices that work with our software. Our software solutions also support an open ecosystem of connected devices produced by other vendors.\n•\nTASER:\n We develop smart devices, tools and services that support public safety officers in de-escalating situations, avoiding or minimizing use of force and aiding consumer personal protection. These tools include TASER devices, VR training services and consumer devices. Research has shown that TASER devices are the most effective less-than-lethal force option, with the lowest likelihood of injury to officers and assailants. Since our inception in 1993, TASER devices have been adopted by a majority of U.S. state and local law enforcement and are used daily to help keep communities safe. Global adoption of TASER devices remains early and we are expanding into new geographies. Axon VR solutions make public safety training more accessible, relevant and affordable — with the goal of using new immersive VR technologies to better prepare officers for real-life situations in the field.\nSales and Distribution: Who We Sell To and Where We Deliver\nWe think of our core customers as falling into roughly four categories of funding sources: U.S. state and local governments, the U.S. federal government, international government customers and commercial enterprises. Additionally, the types of customers who find value in our product offerings are expanding beyond law enforcement to include customers such as attorneys, corrections, fire and emergency medical services personnel, commercial enterprise security, frontline enterprise workers, and the U.S. military.\nAxon’s sales force and strong customer relationships represent key strategic advantages. The majority of our revenues are generated via direct sales, including our online store, although we do leverage distribution partners and third-party resellers. \nNo customer represented more than 10% of total net sales\n for the years ended December 31, 2024, 2023 or 2022. As we diversify into new markets, we have been investing in sales personnel and strategic headcount additions to support growth in these markets.\nGovernmental agencies generally have the ability to terminate our contracts, in whole or in part, for reasons including non-appropriation of funds. We continue to monitor developments in federal government funding.\nResources \nManufacturing and Supply Chain\nWe perform light manufacturing, final assembly and final test operations at our facilities in Scottsdale, Arizona and own substantially all of the equipment required to develop, prototype, manufacture and assemble our finished products. We have continued to maintain both our ISO 9001 and our ISO 9001:2015 certifications.\nWe continue to take steps to diversify our supply chain and global manufacturing footprint, which positions us well to manage supply chain disruptions. Material availability has mostly stabilized from prior supply chain challenges while general levels of risk continue to exist in all businesses that manufacture products. Supplier decommitments remain a top \n1\n \nCalculated as monthly recurring license, integration, warranty, and storage revenue for the year ended December 31, 2024. Annual recurring revenue is a forward-looking performance indicator that management believes provides more visibility into the growth of our revenue generated by our highest margin, recurring services. Annual recurring revenue should be viewed independently of revenue and deferred revenue because it is an operating measure and is not intended to be combined with or to replace GAAP revenue or deferred revenue, as they can be impacted by contract start and end dates and renewal rates. Annual recurring revenue is not intended to be a replacement or forecast of revenue or deferred revenue.\n5\nTable of Contents\narea of risk. However, we have put programs in place to mitigate this risk. We proactively manage our supply chain down to third tier suppliers to mitigate and overcome material shortages. These actions align to our strategic model to help meet strong product demand while also preparing us to stagger factory work schedules as needed, which enables us to meet compressed build schedules over short periods of time. We continue to adjust strategic inventory levels in both raw materials and finished goods based on areas of risk to mitigate potential supply disruptions.\nIn light of our broad domestic and international supplier base, we are continuously monitoring our supply chain to manage through potential impacts, identifying alternate shipping and logistic sources, and working with foreign regulators to ensure that our suppliers can provide high quality parts. Despite past supply chain disruptions relating to material shortages and port constraints, we remain focused on actively managing our supply chain by strengthening strategic relationships, securing secondary and alternate sourcing, adjusting build plans, maintaining strategic inventory and utilizing flexible logistics to support growing demand while minimizing customer disruptions. \nEven as we continue to expand our second sourcing of materials across our supply chain, we still obtain some unique components from single source suppliers. However, because we own substantially all of the injection molded component tooling used in their production, we believe we could obtain alternative suppliers in most cases with varying levels of interruption. In addition, we also have programs to hold additional raw materials (such as resins, battery components and critical semiconductors) to mitigate supply interruptions and better manage costs. For additional discussion of sources and availability of raw materials, refer to Note 1 in Part II, Item 8 of this Annual Report on Form 10-K.\nWe offer both limited and extended manufacturer’s warranties on our Axon devices and CEDs. For additional information about our warranties, refer to Note 1 in Part II, Item 8 of this Annual Report on Form 10-K.\nIntellectual Property\nWe protect our intellectual property with U.S. and foreign patents, U.S. and foreign trademark registrations, and U.S. copyright registrations. Our patents and pending patent applications relate to technology used by us in connection with our products. We also rely on international treaties, organizations and laws to protect our intellectual property. As of December 31, 2024, we hold over\n 330 U.S. patents, over 150 U.S. registered trademarks, over 270 international patents and over 460 international registered trademarks, a\ns well as numerous pending patent and trademark applications. \nWe continuously assess whether and where to seek formal protection for particular innovations and technologies based on such factors as the commercial significance to our operations and our competitors’ operations in particular countries and regions, our strategic technology or product directions in different countries, and the degree to which intellectual property laws exist and are meaningfully enforced in different jurisdictions. We have the exclusive rights to many Internet domain names, primarily including “Axon.com,” “Evidence.com” and “TASER.com.” We also vigorously protect our intellectual property, including our patents and trademarks against third-party infringement.\nWe also execute non-disclosure agreements with employees, consultants and key suppliers to help ensure the confidentiality of our trade secrets.\nCompetition\nSensors — Connected Cameras and Digital Evidence Management Software:\n The body camera and in-car video/automatic license plate readers industry is highly competitive. Our competition includes 10-8 Video, 365Labs, Axis Communications AB, Digital Ally Inc., Duress, Getac Technology Corporation, Halo Body Cameras, Hikvision, Hytera, IONODES, i-PRO, LensLock Inc., Motorola Solutions, M-View, Oracle, Patrol Eyes, Pinnacle Response, Pro-Vision, Recoda, Reveal Media, Safe Fleet, Utility Associates, Versaterm Inc., WCCTV, Wolfcom Enterprises, Wrap Technologies Inc. and Zepcam B.V., Applied Concepts Inc., Genetec Inc. and Insight LPR\n.\nThe market for software solutions to improve public safety agency workflows is both highly fragmented and highly competitive. Our cloud-based digital evidence management system, Axon Evidence, competes with both cloud-based platforms and on-premises based systems designed by third parties or developed internally by an agency's technology staff. Our competition includes FileOnQ, FotoWare, Genetec Inc., IBM, i-PRO, Motorola Solutions, NICE, OpenText Corporation, Oracle, QueTel Corporation, Revir Technologies, Utility Associates and Vidizmo, LLC, among others.\nKey competitive factors in this product category include product performance, product features (including live-streaming, GPS tracking and pre-event buffering), battery life, product quality and warranty, total cost of ownership, data \n6\nTable of Contents\nsecurity, data and information workflows, company reputation and financial strength, and customer satisfaction and relationships.\nProductivity and Real-Time Operations Software — Records Management System (“RMS”) and Axon Fusus:\n \nThe RMS vertical area is competitive and highly fragmented. We have identified more than 50 software providers, including 365Labs, Beacon Software Solutions Inc., Caliber Public Safety (parent, Harris Computer Systems), Central Square Technologies (formerly Superion, TriTech and Aptean), CivicEye, Core Technology Corporation, CSI Technology Group, EForce Software, Executive Information Services Inc., Hexagon AB, Kologik, LawSoft Inc., Mark43 Inc, Motorola Solutions, Niche Technology Inc., Saab, SmartCop, SOMA Global, Sopra Steria, Southern Software, Sun Ridge Systems Inc. and Tyler Technologies. In addition, not all law enforcement agencies use software for report writing — some still use paper. We believe our network of camera sensors and digital evidence management platform give us a strategic advantage in these product categories. Our Axon Fusus offering competes both with real-time operations platforms that ingest body camera video feeds, like Genetec's Citigraf, Motorola’s CommandCentral Aware and Utility’s Strax Response, Flock Safety’s FlockOS, Hitachi Vantara’s Visualization Platform, and MIDL Technology, as well as platforms that ingest video feeds exclusively from surveillance cameras, like Hexagon's Connect, Live Earth and Spatialitics's GeoShield, among others.\nDraft One:\n The AI-enabled report narrative drafting space is relatively new but fast growing. We have identified a few providers in this space, including Abel, Blueline AI, GovWorx, Karda Analytics, Mark43’s ReportAI, Policereports.ai, and Truleo.\nVR De-Escalation Training for Law Enforcement, Corrections and Private Security:\n \nOur VR Training platform competes with several other companies in the space who offer simulation scenarios, including simulated training on the use of both lethal and less-than-lethal alternatives. Our competition in this space includes Adaptive VR Ltd., Apex Officer, Hologate GmbH, InVeris Training Solutions Inc., Laser Shot Inc., MILO, OperatorXR, Street Smarts VR, Ti Training Corp, V-Armed, VirTra Inc. and Wrap Technologies, among others.\nKey competitive factors in this product category include scale of content library, integration to additional sensors and devices (e.g. haptic suit, TASER), ease of use, visual fidelity and realism, quality of immersion experience (enhanced by capabilities such as eye tracking and speech recognition) and portability.\nAxon Air:\n Our end-to-end drone management software platform competes with a select set of companies in the space who offer drone programs and flight management software solutions. Our competition in this space includes Auterion Ltd., BRINC Drones’ LiveOps, Flock Safety’s Aerodome, Motorola Solutions’ CAPE, Paladin Drones’ Watchtower and Votix, LLC, among others. Key competitive factors in this product category include integration and compatibility with various drone hardware providers and other technology systems used by first responders (e.g., digital evidence management), drone program management and real-time situational awareness capabilities, intuitiveness of the user interface, the level of training and customer support provided (particularly for the drone-as-first-responder use case), the customization and flexibility allowed by the platform to meet specific operational needs and requirements of different customers (e.g., customizable flight restrictions) and the autonomy capabilities provided by the platform (e.g., creation of autonomous missions).\nOur indoor tactical drone hardware platform, Sky-Hero, competes with a few other companies in the space, including BRINC, Indoor Robotics, XTEND, and FLIR. Key competitive factors in this product category include variety and weight limits of compatible payloads, battery life and associated flight range, maneuverability and size, autonomy and onboard intelligence (including ability to navigate in GPS denied environments), sensor and imaging technology, durability and robustness of the drone, cost and maintenance required, reliability and security of communication and control systems, the simplicity of the drone piloting user interface and the training required to operate the drones. \nDedrone by Axon:\n \nThe counter drone space is fast growing and very fragmented. Within it, Dedrone competes with Advanced Protection Systems, Anduril, ApolloShield, ARTSys360, Aselsan, Belgian Advanced Technology Systems, Big Bang Boom Solutions, Bligther Surveillance Systems, BlueHalo, BSS Holland, CACI, Cerbair, Chess Dynamics, DEFSYS, Department 13, D-Fend, DroneDefence, Droneshield, Dynamite Global Strategies, DZYNE Technologies, EDGE, EdgeSource, Elbit Systems, ELT Group, ESG, Fortem Technologies, FN Herstal, General Atomics, Gradiant, Guardion, Havelsan, Hensoldt, Hertz New Technologies, IEC Infrared Systems, Indra, L3 Harris, Leidos, Leonardo DRS, LiveLink Aerospace, Lockheed Martin, Marduk, MBDA, MC2 Technologies, Meteksan Savunma, Metis, MSI Defense Systems, MyDefence, Northrop Grumman, NSO Group, Openworks, QinetiQ, Raytheon, Regulus, Rheinmetall, SAAB, SAIC, SAMI Advanced Electronics, Securiton, Sensofusion, Sentrycs, Sentry View Systems, Skycope, Skylock, Skysafe, \n7\nTable of Contents\nSNC, Sopra Steria, SRC, Teledyne FLIR, Terma, Thales, TRD Systems, UAVOS, Unifly, Vector Solutions, Vigilant Drone Defense, Vorpal, Whitefox Defense, and Zen Technologies, among others.\nKey competitive factors in this product category include the breadth and accuracy of detection sensors (e.g., pan-tilt-zoom cameras, radar, and acoustic) and multi-sensor fusion approaches, the chosen methodology for radio frequency-based detection (e.g., RF signature matching or RF demodulation), integration of detection platforms with robust mitigation solutions (e.g., jammers, cyber-takeover, kinetic and high-energy), the capacity to improve detection through scale and continuous exposure to diverse drone makes and models in areas of high drone activity (e.g., urban centers, active war zones) and the seamless interoperability with existing security and defense ecosystems\nTASER for Professional Users:\n Our CEDs compete with a variety of less-than-lethal alternatives to firearms, including rubber bullets or rubber baton rounds, such as those made by Combined Systems, Inc.; pepper spray and pepper spray projectiles, such as those made by Byrna Technologies Inc. (dba Fox Labs), SABRE Corporation and Mace Security International, Inc.; traditional stun guns, such as those made by UZI and Jolt; hand-held remote restraint devices involving a tether, such as those made by Wrap Technologies Inc.; laser dazzlers that cause temporary blindness, such as those made by B.E. Meyers & Co., Inc.; stun grenades, such as those made by Combined Systems, Inc.; long-range acoustic devices, such as those made by Genasys Inc.; and police batons and night sticks, such as those made by Monadnock and Armament Systems and Procedures, Inc. TASER devices offer advanced technology, versatility, portability, effectiveness, built-in accountability systems and low injury rates, which enable us to compete effectively against other less-than-lethal alternatives. TASER devices also offer connectivity to our cloud network, which allows law enforcement agencies and other professional users to more effectively manage their less-than-lethal programs and automate use-of-force reporting.\nThe key competitive factors in this product category include a device’s accuracy, effectiveness, reputation, safety, cost, ease of use, and exceptional customer experience. The design maturity of the TASER platform, as well as our development and sale of a multi-shot device, are also key competitive differentiators. We are aware of competitors providing competing CED products primarily outside of the United States.\nTASER for Personal Safety:\n In the private citizen space, TASER devices compete with firearms and other less-than-lethal self-defense options such as stun guns and pepper spray-based products. Leading competitors in the less-than-lethal space include Byrna Technologies, Inc., Mace, PepperBall, SABRE, Salt Supply Co. and Vipertek. The TASER StrikeLight competes in the flashlight category, in which there are dozens, if not hundreds, of competitors, including tactical flashlight providers with and without stun gun capabilities.\nTASER Bolt and TASER Pulse are not stun guns, and have different capabilities, including neuromuscular incapacitation functionality. The broader market for personal safety and home defense is far-reaching, and categories range from threat detection and accountability (e.g., dash and doorbell cameras), to home security (e.g., home alarms, locks and response services) to personal defense (e.g., firearms, stun guns, TASER devices, pepper spray, tactical flashlights and personal alarms), to personal tracking and emergency notification mobile applications.\nThe primary benefit of TASER devices is in less-than-lethal incapacitation. Other competitive factors include a device’s cost, effectiveness, safety, ease of use, and available training options.\nNon-Axon trademarks are property of their respective owners.\nSeasonality\nOur business operations are influenced by municipal budget cycles. Additionally, new product introductions can significantly impact the cadence of net sales, product costs and operating expenses. Municipal law enforcement budgets tend to feature a mix of fiscal years that end in either June, September or December, while U.S. federal budget year end is in September. However, historical seasonal patterns, municipal budgets or historical patterns of product introductions should not be considered reliable indicators of our future net sales or financial performance.\nGovernmental Regulation \nWe are subject to a variety of laws and regulations in the United States and abroad that involve matters central to our business, including laws and regulations related to: privacy and data protection, security, retention and deletion; rights of publicity; content; intellectual property; regulation of certain of our CEDs as firearms; advertising; marketing; distribution; electronic contracts and other communications; competition; consumer protection; telecommunications; product liability; taxation; labor and employment; sustainability; economic or other trade prohibitions or sanctions; securities; and online \n8\nTable of Contents\npayment services. A number of federal and state legislative proposals in the United States could impose new obligations in areas affecting our business. Foreign laws and regulations can impose different obligations or be more restrictive than those in the United States.\nThese U.S. federal and state and foreign laws and regulations, which in some cases can be enforced by private parties in addition to government entities, are constantly evolving and can be subject to significant change. As a result, the application, interpretation, and enforcement of these laws and regulations are often uncertain and may be interpreted and applied inconsistently from country to country and inconsistently with our current policies and practices. See “",
    "item1a": "Item 1A in Part I of this Annual Report on Form 10-K.\n40\nTable of Contents",
    "item1b": "Item 1B.    \nUnresolved Staff Comments\nNone.",
    "item1c": "Item 1C.    \nCybersecurity\nCybersecurity Risk Management and Strategy\nOur business is highly dependent on our information systems, including our ability to operate them effectively and to successfully implement new technologies, methods and processes, as well as adequate controls and cybersecurity incident recovery plans. \nWe rely on our information systems to manage our business, data, communications, supply chain, ordering, pricing, billing, inventory replenishment, accounting functions and other processes. In addition, we must protect the confidentiality and integrity of the data of our business, employees, customers and other third parties. Our business involves the collection, processing, storage and transmission of personally identifiable information and other sensitive and confidential information.\n This data is wide ranging and relates to our employees, customers and third parties, including the subjects of law enforcement. Our compliance obligations include those prescribed under the laws and regulations that dictate whether, how and under what circumstances we can receive, process, hold and/or transfer certain data that is critical to our operations, including data shared between countries or regions in which we operate and data shared among our products and services.\nAs part of our company-wide culture of security, we maintain a formal cybersecurity and information security program that is aligned with the standards set forth by the International Organization for Standardization (“ISO”), the American Institute of Certified Public Accountants in Systems and Organization Controls 2, the Criminal Justice Information Services, the Federal Risk and Authorization Management Program and the National Institute of Standards and Technology. Our Information Security Team maintains the program, which is designed to ensure proper monitoring, prevention, detection, mitigation and remediation of cybersecurity vulnerabilities, including the prompt investigation and management of all reported or discovered security events, including cybersecurity threats and incidents, in our ordinary course of business.\nOur cybersecurity and information security programs are designed to comply with key global financial regulations and cybersecurity laws in the jurisdictions in which we operate. The program includes taking several proactive steps to prepare for attempts to compromise our information systems. To provide for the availability of critical data and systems, maintain regulatory compliance, manage our material cybersecurity risks, and protect against, detect and respond to cybersecurity threats and incidents, we undertake the below listed activities:\n•\nclosely monitor emerging data protection laws and implement changes to our processes designed to comply;\n•\nundertake regular reviews (at least annually) of our consumer facing and internal policies and statements related to cybersecurity;\n•\nproactively inform our customers of substantive changes related to customer data handling;\n•\nconduct annual information security training for all employees;\n•\nrecruit and retain highly skilled cybersecurity professionals, and provide regular training and development opportunities for our cybersecurity and information security employees;\n•\nconduct regular phishing email simulations for all employees and all contractors with access to corporate email systems to enhance awareness and responsiveness to such possible threats;\n38\nTable of Contents\n•\nthrough policy, practice and contract (as applicable), require employees, as well as third parties who provide services on our behalf, to treat customer information and data with care;\n•\nperform due diligence on third-party vendors and, based on our risk assessment, put in place contractual undertakings and oversight to manage and reduce the risks associated with third-party vendors;\n•\nrun tabletop exercises to simulate a response to a cybersecurity incident and use the findings to improve our technologies, methods and processes;\n•\nconduct regular risk assessments of our information systems to identify weaknesses, and develop and implement mitigations to improve our cybersecurity and information security program;\n•\nconduct regular security assessments, vulnerability scans, and penetration tests (including by third-party assessment firms) of products systems and internal systems to discover vulnerabilities and apply appropriate mitigations within standardized timelines;\n•\nmaintain, implement, evaluate and update our cybersecurity technologies to address threats and vulnerabilities; and\n•\ncarry information security risk insurance that provides protection against the potential losses arising from a cybersecurity incident.\nThird-Party Monitoring and External Reviews\nAxon utilizes the assistance of third-party technology and providers to support our objective of protecting our information, information systems and network.\n Services provided by third parties to assess the performance of our cybersecurity risk management systems and procedures and to identify cybersecurity risks to the Company include assessing products and internal systems for vulnerabilities, incident response services such as computer forensics, internal and external audits for security certifications globally and overall security program maturity evaluations. Axon and our service providers have also developed systems and processes that are designed to protect our and our customers’ data, to prevent data loss, and to prevent or detect cybersecurity threats and incidents.\nMaterial findings, notable weaknesses and suggestions are presented to the Enterprise Risk and Compliance Committee of the Company’s \nBoard of Directors\n (the “ERC Committee”) as discussed below.\nCybersecurity Management Team\nOur cybersecurity and information security program, which includes data privacy, is the responsibility of our \nChief Information Security Officer (“CISO”)\n, who oversees our global information security program.\n \nOur current CISO has served in various information technology and information security roles over the past 20 years including roles at Netflix, Salesforce and Facebook, and has served as CISO since February 2024. He also has relevant degrees and certifications, including a Master of Science degree in Information Assurance from Iowa State University. The information security program has been built over the last 10 years under the leadership of experienced Information Security professionals.\nOur CISO attends quarterly meetings of our Disclosure Committee and provides input on disclosures in our Quarterly Reports on Form 10-Q and Annual Reports on Form 10-K, including the relevant risk factors set forth therein. Our CISO, along with the Information Security Team, also leads our Security Incident Response Team, which is responsible for investigating suspected cybersecurity threats and incidents. In the event of a possibly material cybersecurity incident, the Information Security Team also includes the following executive team members: Corporate General Counsel, Chief Legal Officer, Chief Accounting Officer, Chief Operating Officer & Chief Financial Officer and, to the extent practicable or relevant, other senior executives.\nBoard of Directors Oversight\nAs a part of its oversight of the key risks facing Axon, our Board of Directors devotes significant time and attention to data and systems protection, including cybersecurity and information security risk. While the Audit Committee of the Company’s Board of Directors (the “Audit Committee”) reviews any significant legal, compliance or regulatory matters that may have a material impact on our business, financial statements or compliance policies generally, it does so in consultation with our ERC Committee with respect to any such matters that involve cybersecurity, data privacy or information technology. The Chair of our ERC Committee is also a member of our Audit Committee, which facilitates close coordination between the two committees on cybersecurity, data privacy and information technology matters.\nOur ERC Committee oversees our overall approach to enterprise risk management, of which cybersecurity is an important component. The ERC Committee and its Chair, in coordination with the Information Security Team and CISO, regularly review the categories of risk the Company faces, including any cybersecurity risk exposures, as well as the \n39\nTable of Contents\nlikelihood of occurrence, the potential impact of those risks, and the steps management has taken to monitor, mitigate and control such exposures. To facilitate these reviews, the Information Security Team and CISO report at least quarterly to the ERC Committee with respect to cybersecurity risks, including those identified through review of our business, of rising threats in the industry, and of the current state of our cybersecurity and information security program. The ERC Committee makes regular reports to the full Board of Directors regarding updates on cybersecurity and other risks.\nIncident Response and Assessment Policies and Procedures\nAxon has implemented our cybersecurity and information security program and cybersecurity incident response plan to protect our and our customers’ data from, and mitigate the effects of, unintentional disclosure as well as cybersecurity threats and incidents of all severity levels. Our program and response plan outline actions to be taken after identifying a suspected cybersecurity threat or incident and the people responsible for managing those actions. We have also implemented disclosure controls and procedures for determining the materiality of a cybersecurity incident to outline disclosure and communications responsibilities during cybersecurity incidents of all severity levels.\nIn the event of a possibly material cyber incident, the Security Incident Response Team, under the direction of the Corporate General Counsel and/or the Chief Legal Officer, would collect and document information relevant to materiality and make a threshold determination as to whether such cybersecurity incident (including those occurring on the information systems of third parties) is potentially material. The Security Incident Response Team would meet with the Chair of the ERC Committee to review the preliminary findings of the Security Incident Response Team, including the possible factors in determining materiality. If the Security Incident Response Team and the Chair of the ERC Committee determine that the cybersecurity incident warrants further review after consideration of such findings and factors, the Audit Committee would be convened for a meeting (to which all members of the ERC Committee would be invited) to review the cybersecurity incident and the findings of the Security Incident Response Team and the Chair of the ERC Committee. The Audit Committee would then make a materiality determination consistent with SEC guidance and by considering relevant quantitative and qualitative factors, informed by any recommendations of the ERC Committee and/or its Chair.\nAny materiality assessment that results in a determination that a cybersecurity incident is not material would be reported by the Information Security Team, or appropriate members of management, to the ERC Committee at its next scheduled meeting.\nAt this time, we have not identified any risks from known cybersecurity threats, including as a result of prior cybersecurity incidents, that have materially affected us, including our operations, business strategy, results of operations or financial conditions. However, we face certain ongoing risks from cybersecurity threats that, if realized, are reasonably likely to materially affect us, including our operations, business strategy, results of operations or financial condition. For additional details, refer to"
  }
}