{
  "ticker": "AZO",
  "cik": "0000866787",
  "company_name": "AUTOZONE INC",
  "filing_date": "2025-10-27",
  "accession": "0001104659-25-102611",
  "primary_doc": "azo-20250830x10k.htm",
  "item_sections": {
    "item1": "Item 1. Business\nIntroduction\nAutoZone, Inc. (“AutoZone,” the “Company,” “we,” “our” or “us”) is a leading retailer and distributor of automotive replacement parts and accessories in the Americas. We began operations in 1979 and at August 30, 2025, operated 6,627 stores in the United States (“U.S.”), 883 stores in Mexico and 147 stores in Brazil. Each store carries an extensive product line for cars, sport utility vehicles, vans and light duty trucks, including new and remanufactured automotive hard parts, maintenance items, accessories and non-automotive products. At August 30, 2025, in 6,098 of our domestic stores as well as the vast majority of our stores in Mexico and Brazil, we had a commercial sales program that provides prompt delivery of parts and other products and commercial credit to local, regional and national repair garages, dealers, service stations, fleet owners and other accounts. We also sell automotive hard parts, maintenance items, accessories and non-automotive products through www.autozone.com, and our commercial customers can make purchases through www.autozonepro.com. Additionally, we sell the ALLDATA brand of automotive diagnostic, repair, collision and shop management software through www.alldata.com. We also provide product information on our Duralast branded products through www.duralastparts.com. We do not derive revenue from automotive repair or installation services. \nOur websites and the information contained therein or linked thereto are not intended to be incorporated into this report.\nHuman Capital Resources\nWe believe the foundation of our success is our culture, which is deeply rooted in our Pledge and Values: Puts Customers First, Cares About People, Strives for Exceptional Performance, Energizes Others, Embraces Diversity and Helps Teams Succeed. Our Pledge and Values define how our employees (“AutoZoners”) take care of customers and fellow AutoZoners by fostering a strong, unique culture of teamwork and customer service. Each AutoZoner works hard to Live the Pledge, remain committed to our values, share their passion for WOW! Customer Service and Go the Extra Mile every day to continue building and growing AutoZone for our customers. \n​\nWe seek to be the employer of choice as we compete for talent in our retail stores, field supervision, distribution centers, and store support functions. We focus heavily on retention by offering competitive compensation and benefits packages, extensive training and development opportunities.\n​\nAs of August 30, 2025, we employed approximately 130,000 AutoZoners, approximately 60 percent of whom were employed full-time and the remaining 40 percent were employed part-time. Approximately 91 percent of our AutoZoners were employed in stores or in direct field supervision, approximately six percent in distribution centers and approximately three percent in store support and other functions. Included in the above numbers are approximately 19,000 AutoZoners employed in our international operations. We have never experienced any material labor disruption, do not have any collective bargaining agreements in the U.S. and believe that relations with our AutoZoners are good.\n​\nTraining & Development\nWe have a number of different types of jobs and career opportunities. While many of our AutoZoners follow more traditional career paths (e.g., part-time to full-time sales, store manager, district manager, regional manager, vice president), we encourage cross-functional development and support of AutoZoners as they expand their careers into other departments and fields of interest within the Company. Many members of our senior leadership team have held positions in multiple areas of the business. We also invest in advanced leadership training to deepen our bench strength and support succession planning. For additional information, see “Store Personnel Training and Incentives” below. We believe these opportunities are important to attract, motivate and retain high quality AutoZoners.\n4\n\n\nTable of Contents\nRecognition\nThe AutoZone Pledge and Values drive our success and foster a strong, unique culture of teamwork and customer service. We encourage the recognition of AutoZoners for a variety of accomplishments, such as going above and beyond to deliver Trustworthy Advice and WOW! Customer Service, taking initiative to prevent incidents and injuries, making contributions to help detect or report internal or external theft or providing significant service to help others. Whether they work in our stores, distribution centers, support centers or travel to support our customers and business, we believe AutoZoners everywhere should be recognized for their efforts and outstanding performance. We also recognize AutoZoners for their years of service to the organization and our customers.\n​\nHealth and Safety\nWe are committed to providing a safe working and shopping environment for our AutoZoners and customers. Aligned with our values, we strive to continually monitor our working and shopping environment to keep our AutoZoners and customers as safe as possible.\n​\nAdditional information about our human capital resources can be found in our most recent Corporate Responsibility  Report, which is available on our website. Our Corporate Responsibility Report is not, and will not be deemed to be, a part of this Annual Report on Form 10-K or incorporated by reference into this or any of our other filings with \nthe Securities and Exchange Commission (the “SEC”). \n​\n5\n\n\nTable of Contents\nStore Operations\nAt August 30, 2025, our stores were in the following locations:\n​\n​\n​\n​\n    \nStore\n​\n​\nCount\nAlabama\n \n 134\nAlaska\n \n 8\nArizona\n \n 173\nArkansas\n \n 77\nCalifornia\n \n 681\nColorado\n \n 104\nConnecticut\n \n 59\nDelaware\n \n 23\nFlorida\n \n 455\nGeorgia\n \n 229\nHawaii\n \n 13\nIdaho\n \n 36\nIllinois\n \n 251\nIndiana\n \n 172\nIowa\n \n 40\nKansas\n \n 58\nKentucky\n \n 110\nLouisiana\n \n 139\nMaine\n \n 14\nMaryland\n \n 103\nMassachusetts\n \n 91\nMichigan\n \n 225\nMinnesota\n \n 69\nMississippi\n \n 102\nMissouri\n \n 124\nMontana\n \n 15\nNebraska\n \n 27\nNevada\n \n 75\nNew Hampshire\n \n 23\nNew Jersey\n \n 133\nNew Mexico\n \n 67\nNew York\n \n 233\nNorth Carolina\n \n 247\nNorth Dakota\n \n 8\nOhio\n \n 291\nOklahoma\n \n 93\nOregon\n \n 59\nPennsylvania\n \n 255\nPuerto Rico\n \n 67\nRhode Island\n \n 20\nSaint Thomas\n \n 2\nSouth Carolina\n \n 110\nSouth Dakota\n \n 10\nTennessee\n \n 189\nTexas\n \n 736\nUtah\n \n 74\nVermont\n \n 2\nVirginia\n \n 160\nWashington\n \n 102\nWashington, DC\n \n 5\nWest Virginia\n \n 45\nWisconsin\n \n 80\nWyoming\n \n 9\nTotal Domestic stores\n \n 6,627\nMexico\n \n 883\nBrazil\n \n 147\nTotal stores\n \n 7,657\n​\n6\n\n\nTable of Contents\nStore Formats\nSubstantially all stores are based on standard store formats, resulting in generally consistent appearance, merchandising and product mix with approximately 90% to 99% of each store’s square footage used as selling space. Most of our stores carry approximately 20,000 to 25,000 unique SKUs with 40% to 50% of the space dedicated to hard parts inventory. Hub stores carry approximately 40,000 to 50,000 unique SKUs and mega hub stores carry approximately 80,000 to 110,000 unique SKUs with 70% to 85% of their space utilized for hard parts. The hard parts inventory area is generally fronted by counters or pods that run the depth or length of the store, dividing the hard parts area from the remainder of the store. The remaining selling space contains displays of maintenance, accessories and non-automotive items.\nStores are replenished primarily by the nearest distribution center but also typically have same-day access to one of our 367 domestic and 53 international hub stores’ expanded inventory assortment. As a subset of our domestic hub stores, we ended fiscal 2025 with 133 mega hub stores, an increase of 24 since the end of fiscal 2024. Additionally, we have eight mega hub stores in Mexico. Hub and mega hub stores work in concert with other stores to drive customer satisfaction through improved local parts availability and expanded product assortments. \nStore Personnel Training and Incentives\nWe provide on-the-job training as well as formal training programs, including an annual national sales meeting with related cascading meetings at our distribution centers, regional offices and stores; store meetings on specific sales and product topics; standardized computer-based training to support culture, safety, salesmanship, compliance and product and job knowledge; and several specialist, vendor and third-party programs to support learning and development in areas requiring technical expertise and specific job knowledge. All domestic AutoZoners are encouraged to complete our in-house product knowledge program and Parts Expert certification, which is developed in partnership with our key suppliers. Training is supplemented with frequent store visits by management. Additionally, store managers, commercial sales managers and managers at various levels across the organization receive financial incentives through performance-based bonuses. \nStore Support Centers\nAll store support functions are centralized in our store support centers located in Memphis, Tennessee; Monterrey, Mexico; Chihuahua, Mexico; Sao Paulo, Brazil; and Gurugram, India. We believe that this centralization enhances consistent execution of our merchandising and marketing strategies at the store level, while reducing expenses and cost of sales. In addition, we have offices in Shanghai, China and Istanbul, Turkey that provide sourcing or other support functions.\n​\nStore Automation\nAll of our stores have Z-net, our proprietary electronic catalog that enables our AutoZoners to efficiently look up the parts that our customers need and provide complete job solutions, advice and information for customer vehicles. Z-net provides parts information based on year, make, model and engine type of a vehicle and also tracks inventory availability at the store, at other nearby stores and through special order. The Z-net display screens are placed on the hard parts counter or pods, where both the AutoZoner and customer can view the screen.\nOur stores utilize our computerized proprietary Point-of-Sale System, which includes bar code scanning and point-of-sale data collection terminals. Our proprietary Store Management System provides administrative assistance, as well as enhanced merchandising information and improved inventory control. We believe the Point-of-Sale System also enhances customer service, while the Store Management System provides simplified warranty and product return procedures. \nCommercial\nOur commercial sales program operates in a highly fragmented market, and we are a leading distributor of automotive parts and other products to local, regional and national repair garages, dealers, service stations, fleet owners and other accounts in the Americas. As part of our program, we offer prompt delivery to our customers and commercial credit, as well as online ordering through www.autozonepro.com or through the AutoZone Pro mobile application. Through our hub and mega hub stores, we offer a larger assortment than our satellite stores of parts and \n7\n\n\nTable of Contents\nproducts desired by professional technicians. We have dedicated sales teams focused on independent repair shops as well as national, regional and fleet commercial accounts.\nStore Development\nThe following table reflects our store development during the past five fiscal years:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFiscal Year\n​\n    \n2025\n    \n2024\n    \n2023\n    \n2022\n    \n2021\nStores:\n \n  \n \n  \n \n  \n \n  \n \n  \nBeginning\n \n 7,353\n \n 7,140\n \n 6,943\n \n 6,767\n \n 6,549\nNew\n \n 305\n \n 217\n \n 198\n \n 177\n \n 219\nClosed\n \n 1\n \n 4\n \n 1\n \n 1\n \n 1\nNet new\n \n 304\n \n 213\n \n 197\n \n 176\n \n 218\nRelocated\n \n 9\n \n 6\n \n 12\n \n 13\n \n 12\nEnding\n \n 7,657\n \n 7,353\n \n 7,140\n \n 6,943\n \n 6,767\n​\nWe believe expansion opportunities exist in markets we do not currently serve, as well as in markets where we can achieve a larger presence. We undertake substantial research prior to entering new markets. The most important criteria for opening a new store are the projected future profitability and the ability to achieve our required investment hurdle rate. Key factors in selecting new site and market locations for stores include population, demographics, vehicle profile, customer buying trends, commercial businesses, number and strength of competitors’ stores and the cost of real estate. In reviewing the vehicle profile, we also consider the number of vehicles that are seven years old and older, or “our kind of vehicles;” these vehicles are generally no longer under the original manufacturers’ warranties and require more maintenance and repair than newer vehicles. We seek to open new stores in high visibility sites in high traffic locations within or contiguous to existing market areas and attempt to cluster development in markets in a relatively short period of time.\n \nWe believe our stores are “destination stores,” generating their own traffic, therefore we situate most stores on major thoroughfares with easy access and good parking. \nIn addition to continuing to lease or develop our own locations, we evaluate and may make strategic acquisitions.\nMarketing and Merchandising Strategy\nWe are dedicated to providing customers with superior service and trustworthy advice as well as quality automotive parts and products at a great value in our conveniently located, well-designed stores and through our online platforms. Key elements of this strategy are:\nCustomer Service\nCustomer service is the most important element in our marketing and merchandising strategy, which is based upon consumer marketing research. We emphasize that our AutoZoners should always put customers first by providing prompt, courteous service and trustworthy advice. Our electronic parts catalog assists in the selection of parts as well as identifying any associated warranties offered by us or our vendors. In addition to our in-store offerings, we sell our full suite of automotive hard parts, maintenance items, accessories and non-automotive parts through www.autozone.com, for pick-up in store or to be shipped directly to a customer’s home or business, with same day or next day delivery programs in most of our U.S. markets. Additionally, we offer a mobile application that provides customers with store locations, driving directions, operating hours, product availability, the ability to purchase products and other information.\nWe also provide access to specialty tools as one of our free services. Through our Loan-A-Tool program customers can borrow a specialty tool, such as a steering wheel puller, for which a do-it-yourself (“DIY”) customer or a repair shop would have little or no subsequent use beyond a single job. AutoZoners also provide free diagnostic and related services, including check engine and anti-lock braking system light readings through our AutoZone Fix Finder service, testing of starters, alternators and batteries, battery charging and the collection of used oil for recycling.\n8\n\n\nTable of Contents\nMerchandising\nThe following tables show some of the types of products we sell by major category of items:\n​\n​\n​\n​\n​\nFailure\n    \nMaintenance\n     \nAccessories\nA/C Compressors \nBatteries & Accessories \nBearings \nBelts & Hoses \nCalipers \nChassis \nClutches \nCV Axles \nEngines \nFuel Pumps \nFuses \nIgnition \nLighting \nMufflers \nRadiators \nStarters & Alternators \nThermostats \nTire Repair \nWater Pumps\n​\nAntifreeze & Windshield Washer Fluid \nBrake Drums, Rotors, Shoes & Pads \nChemicals, including Brake & Power \n   Steering Fluid, Oil & Fuel Additives \nOil & Transmission Fluid \nOil, Cabin, Air, Fuel & Transmission   \n   Filters \nOxygen Sensors \nPaint & Accessories \nRefrigerant & Accessories \nShock Absorbers & Struts \nSpark Plugs & Wires \nWindshield Wipers\n​\nAir Fresheners \nCell Phone Accessories \nDrinks & Snacks \nFloor Mats & Seat Covers \nInterior & Exterior Accessories \nMirrors \nPerformance Products \nProtectants & Cleaners \nSealants & Adhesives \nSteering Wheel Covers \nTools\nTowing\nVehicle Entertainment Systems \nWash & Wax \n​\n​\n​\nWe believe customer satisfaction is often impacted by our ability to promptly provide specific automotive products as requested. Each store carries the same basic products, but we tailor our hard parts inventory to the makes and models of the vehicles in each store’s trade area and tailor the remaining store’s assortment to the local demographics. Our hub and mega hub stores carry a larger assortment of products that are available to customers of the surrounding local stores. We are continuously updating the products we offer to ensure our inventory matches the products our customers need or desire.\nPricing\nWe want to be the value leader in our industry, by consistently providing quality merchandise at the right price, backed by a satisfactory warranty and outstanding customer service. For many of our products, we offer multiple value choices in a good/better/best assortment, with appropriate price and quality differences from the “good” products to the “better” and “best” products. A key differentiating component versus our competitors is our exclusive line of in-house brands, which includes Duralast and the family of Duralast brands, Econocraft, ProElite, ShopPro, SureBilt, TotalPro, TruGrade and Valucraft. We believe that our overall value compares favorably to that of our competitors.\nBrand Marketing: Marketing and Loyalty\nWe believe that targeted advertising and promotions play important roles in succeeding in today’s environment. We are constantly working to understand our customers’ wants and needs so we can build long-lasting, loyal relationships. We utilize advertising, direct marketing, loyalty programs and promotions primarily to highlight our great value, the availability of high quality parts and develop a relationship with an expanding base of customers. Digital and broadcast media are our primary advertising methods of driving retail traffic, while we leverage a dedicated sales force and our ProVantage loyalty program to drive commercial sales. \nStore Design, Visual Merchandising and Promotional Execution\nWe design and build stores for high visual impact. The typical store utilizes colorful exterior and interior signage, exposed beams and ductwork, finished floors and brightly lit interiors. Batteries, maintenance products, accessories and non-automotive items are attractively displayed for easy browsing by customers. In-store signage and special displays promote products on floor displays, end caps and shelves. We utilize in-store signage, creative product placement and promotions to help educate customers about products that they may need.\n9\n\n\nTable of Contents\n​\nPurchasing and Supply Chain\nMerchandise is selected and purchased for all stores through our store support centers located in Memphis, Tennessee; Monterrey, Mexico; Chihuahua, Mexico; Sao Paulo, Brazil and Gurugram, India. Additionally, we have offices in Shanghai, China and Istanbul, Turkey to support our global sourcing efforts. In fiscal 2025, one class of similar products accounted for approximately 14 percent of our total revenues, and one individual vendor provided 13 percent of our total purchases. No other class of similar products accounted for 10 percent or more of our total revenues, and no other individual vendor provided more than 10 percent of our total purchases. We believe alternative sources of supply exist, at similar costs, for most types of product sold. Most of our merchandise flows through our distribution centers to our stores by our fleet of tractors and trailers or by third-party transportation firms. The distribution centers replenish our stores up to multiple times per week depending on store sales volumes.\nCompetition\nThe sale of automotive parts, accessories and maintenance items is highly competitive. AutoZone competes on the basis of customer service, including the knowledge and expertise of our AutoZoners and our ability to provide prompt delivery to commercial customers; merchandise quality, selection and availability; product warranty; store layouts, location and convenience; price; and the strength of our AutoZone brand name and quality, trademarks and service marks.\nOur competitors include national, regional and local auto parts chains, independently owned parts stores, online automotive parts stores or marketplaces, wholesale distributors, jobbers, repair shops, car washes and auto dealers, in addition to discount and mass merchandise stores, hardware stores, supermarkets, drugstores, convenience stores, home stores and other retailers that sell aftermarket vehicle parts and supplies, chemicals, accessories and tools. \nGovernment Relations\nAs a company with global operations, we are subject to the federal, state, and local laws and regulations, in the jurisdictions in which we operate, many of which are complex, frequently changing and subject to varying interpretations. These laws and regulations relate to, among other things, the marketing and sale of products; proper handling and disposal of hazardous materials, particularly in connection with our used oil, oil filter and battery recycling programs; occupational health and safety; environmental matters; labor and employment; employee wages and benefits; information security and data privacy; real property; financial reporting and disclosure; antitrust and fair competition; international trade and transportation, logistics and delivery operations. \nWhile compliance with the numerous laws and regulations applicable to our business, including environmental regulations, has not had a material adverse effect on capital expenditures, earnings or our competitive position to date, we can make no assurances as to the future costs of compliance. For more information, see the Risk Factors titled \n“Legal and Regulatory Risks” \nand\n “Information Technology, Cybersecurity and Data Privacy Risks”\n in “Part I.",
    "item1a": "Item 1A. Risk Factors\nOur business is subject to a variety of risks and uncertainties. The risks and uncertainties described below could materially and adversely affect our business, financial condition, results of operations, liquidity and stock price. The following information should be read in conjunction with the other information contained in this report and other filings that we make with the SEC. These risks and uncertainties are not the only ones we face. Our business could also be materially affected by additional factors that are presently unknown to us or that we currently believe to be immaterial to our business.\nStrategic and Operational Risks\n​\nThe current global economic and geopolitical landscape has increased uncertainty about key areas of doing business internationally and may have a negative impact on our business.\n​\nDuring fiscal 2025, new global trade tariffs were announced on imports to the United States, including additional tariffs on various countries from which the Company directly or indirectly imports and/or sources merchandise, including Canada, China and Mexico, among others. In response, several countries have imposed or threatened reciprocal tariffs on imports from the U.S. and other measures. Various modifications to the U.S. tariffs have been \n13\n\n\nTable of Contents\nannounced, and further changes are expected to be made in the future, including in response to pending litigation, which may include additional sector-based tariffs or other measures. Additionally, the current administration has directed various federal agencies to further evaluate key aspects of U.S. trade policy and amid ongoing discussion and commentary regarding further potentially significant changes to U.S. trade policies, enforcement priorities, sanctions, treaties and tariffs. As a result of these ongoing developments, significant uncertainty continues with respect to the future economic and political relationship between the U.S. and other countries. The ultimate impact of tariffs and other trade policies on the Company’s business will depend on several factors, including whether additional or incremental U.S. tariffs or other measures are announced, revised, or rescinded, to what extent other countries implement tariffs or other measures in response, the overall magnitude and duration of these measures and our ability to mitigate the impacts of such measures more effectively than our competitors. These developments, or the perception that any of them could occur, may have a material effect on global economic conditions, the stability of global financial markets, or global trade, and may impact the Company’s product cost, pricing, or competitive conditions, disrupt supply chains, impact the broader macroeconomic environment and consumer sentiment or otherwise negatively impact the Company’s business, financial condition and results of operations. \n​\nIf demand for our products slows, then our business may be materially adversely affected.\n​\nDemand for the products we sell may be affected by a number of factors we cannot control, including:\n●\nthe number of older vehicles in service. Vehicles seven years old or older are generally no longer under the original vehicle manufacturers’ warranties and tend to need more maintenance and repair than newer vehicles. \n●\nthe number of miles vehicles are driven. Higher vehicle mileage increases the need for maintenance and repair. Mileage levels may be affected by gas prices, ride sharing, weather conditions, and other factors.\n●\nrising fuel and energy prices. Increases in fuel and energy prices may cause our customers to defer purchases of certain of our products as they use a higher percentage of their income to pay for fuel and other energy costs and may drive their vehicles less, resulting in less wear and tear and lower demand for repairs and maintenance.\n●\nthe economy. In periods of declining economic conditions, including as a result of inflation, high levels of consumer debt, and/or high interest rates, consumers may reduce their discretionary spending by deferring vehicle maintenance or repair. Additionally, such conditions may affect our customers’ ability to obtain credit. During periods of expansionary economic conditions, more of our DIY customers may pay others to repair and maintain their vehicles instead of working on their own vehicles, or they may purchase new vehicles.\n●\nthe weather. Milder weather conditions may lower the failure rates of automotive parts, while extremely hot or cold conditions may enhance demand for our products due to increased failure rates of our customers’ automotive parts. However, extended periods of rain and winter precipitation may adversely impact store traffic, decreasing sales, or may cause our customers to defer maintenance and repair on their vehicles. Additionally, climate changes can create more variability in the short-term or lead to other weather conditions that could impact our business.\n●\ntechnological advances. Advances in automotive technology, such as improved parts design, can result in cars needing maintenance less frequently and parts lasting longer.\n●\nprevalence of electric vehicles. Increased prevalence of electric vehicles, whether due to changes in consumer preferences or regulatory actions incentivizing the purchase of electric vehicles, can result in less frequent parts failures and reduced need for parts.\n●\nthe quality of the vehicles manufactured by the original vehicle manufacturers and the length of the warranties or maintenance offered on new vehicles.\n●\nrestrictions on access to telematics and diagnostic tools and repair information imposed by the original vehicle manufacturers or by governmental regulation. These restrictions may cause vehicle owners to rely on dealers to perform maintenance and repairs.\n​\n​\nThese factors could result in a decline in the demand for our products, which could materially adversely affect our business and overall financial condition.\n14\n\n\nTable of Contents\n​\nIf we are unable to compete successfully against other businesses that sell the products that we sell, we could lose customers and our sales and profits may decline.\n​\nThe sale of automotive parts, accessories and maintenance items is highly competitive. See “Item 1. Business” above for additional information regarding our competitive environment.\n​\nAlthough we believe we compete effectively, our competitors may have greater financial resources allowing them to invest more in their business, greater sourcing capabilities allowing them to sell merchandise at lower prices, larger stores with more merchandise, longer operating histories with deeper customer relationships, more frequent customer visits, more effective advertising and more successful utilization of data analytics, artificial intelligence and other new and emerging technologies. Online and multi-channel retailers often have lower operating costs and focus on delivery services, thereby offering customers faster, guaranteed delivery times and low-price or free shipping. In addition, because our business strategy is based on offering superior levels of customer service to complement the products we offer, our cost structure is higher than some of our competitors, which also puts pressure on our margins.\n​\nWith the increasing use of digital tools, our customers often begin their shopping experience online and are quickly able to compare prices, product assortment, product availability and feedback from other customers before purchasing products. We may be unable to differentiate ourselves or unable to anticipate and adapt to new or enhanced digital experiences offered by other retailers.\n​\nIf we are unable to continue to manage in-stock inventory and costs, provide competitive delivery options, develop successful competitive strategies, including the maintenance of effective promotions, advertising and loyalty programs, develop and execute effective digital and omni-channel strategies or otherwise compete effectively, or if our competitors develop more effective strategies, we could lose customers and our sales and profits may decline.\n​\nWe may not be able to sustain our historic rate of sales growth.\n​\nWe have increased annual revenues in the past five fiscal years from $12.6 billion in fiscal 2020 to $18.9 billion in fiscal 2025, with a compounded annual growth rate of approximately eight percent. Annual revenue growth is driven by increases in same store sales, the opening of new stores and the development of new commercial programs. Same store sales are impacted both by customer demand levels and by the prices we are able to charge for our products, which can also be negatively impacted by economic pressures. See “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” for further discussion of same store sales.\n​\nWe have increased our store count in the past five fiscal years, growing from 6,549 stores at August 29, 2020 to 7,657 stores at August 30, 2025, a compounded annual growth rate of approximately three percent.\n​\nAchieving our store development and expansion goals, domestically and in international markets, will depend upon our ability to identify and obtain suitable sites for new and expanded stores in a timely manner and at acceptable costs, the hiring and training of qualified personnel, effective utilization of our supply chain and hub network, and the integration of new stores into existing operations, among other factors. Furthermore, we open new stores only after evaluating customer buying trends and market demand/needs, all of which could be adversely affected by persistent unemployment, wage cuts, small business failures and microeconomic conditions unique to the automotive industry. There can be no assurance we will be able to achieve our store expansion goals, manage our growth investments effectively, successfully integrate the planned new stores into our operations or operate our new, remodeled and expanded stores profitably.\n \n​\nIf we cannot profitably increase our market share in the commercial auto parts business, our sales growth may be limited.\n​\nAlthough we are a leading distributor of automotive parts and other products in the commercial market, we must effectively compete against national, regional and local auto parts chains, independently owned parts stores, \n15\n\n\nTable of Contents\nwholesalers, jobbers, repair shops, auto dealers, online retailers and others in order to increase our commercial market share. Although we believe we compete effectively in the commercial market on the basis of customer service, merchandise quality, assortment and availability, price, delivery times, product warranty, distribution locations and the strength of our AutoZone brand, trademarks and service marks, some automotive aftermarket participants have been in business for substantially longer periods of time than we have, and as a result have developed long-term customer relationships, an experienced sales organization, considerable market presence and have large available inventories. If we are unable to profitably grow our sales with existing commercial customers, our sales growth may be limited.\n​\nOur business depends upon hiring, training and retaining qualified employees, including members of management and other key personnel.\n​\nWe believe much of our brand value lies in the quality of the approximately 130,000 AutoZoners employed in our stores, distribution centers, store support centers and ALLDATA. Our workforce costs represent our largest operating expense, and our ability to meet our labor needs while controlling labor costs is subject to numerous external factors, including market pressures with respect to prevailing wage rates and unemployment levels. Our business is also subject to employment laws and regulations, including those related to minimum wage, benefits and scheduling requirements, and these laws are subject to change over time. In addition, the implementation of potential regulatory changes relating to overtime exemptions and benefits for certain employees under federal and state laws could result in increased labor costs to our business and negatively impact our operating results.\n \n​\nWe compete with other retail businesses for many of our associates in hourly positions, and these positions have historically had high turnover rates, which can lead to increased training and retention costs, particularly in a competitive labor market. We cannot be assured that we can continue to hire, train and retain qualified employees at current wage rates since we operate in a competitive labor market, and there are currently significant inflationary and other pressures on wages.\n​\nIn the U.S., over the last few years there has been an increase in workers exercising their right to form or join a union, both generally and in the retail industry. Further, the National Labor Relations Board (NLRB) has issued decisions making it easier for employees to organize. Although none of our domestic employees are covered by collective bargaining agreements, there can be no assurance that our domestic employees will not elect to be represented by labor unions in the future. If a significant portion of our work force were to become unionized, our culture and operating model could be challenged by inserting a third party into our current relationships between our leaders and hourly AutoZoners. Further, our labor costs could increase, and our business could be negatively affected by other requirements and expectations that could change our company culture, decrease our flexibility and disrupt our business. Further, our responses to any union organizing efforts could negatively impact how our brand is perceived by customers and AutoZoners and have material adverse effects on our business and financial results. \n​\nIf we are unable to hire, properly train and retain qualified AutoZoners, we could experience higher employment costs, reduced sales, losses of customers and diminution of our brand or company culture, which could adversely affect our earnings. If we do not maintain competitive wages or benefit packages, our customer service could suffer from any resultant declining quality of our workforce, or, alternatively, our earnings could decrease if we increase our wage rates and resultant labor costs. A violation or change in employment and labor laws (including changes in existing employment benefit programs such as health insurance) could have a material adverse effect on our results of operations, financial condition and cash flows.\n​\nOur future success depends on the skills and experience of our management and other key personnel. The unexpected loss of the services of any such persons could materially adversely affect our operations. There can be no assurance that our succession planning, retention or hiring efforts will be successful. Failure to attract and retain qualified personnel in key roles could materially adversely affect our operations.\n​\n16\n\n\nTable of Contents\nInability to acquire and provide quality merchandise at competitive prices could materially adversely affect our sales and results of operations.\n​\nWe are dependent upon our domestic and international vendors continuing to supply us with quality merchandise at competitive prices and payment terms. If our merchandise offerings do not meet our customers’ expectations, or our customers have a negative perception of our merchandise regarding quality, innovation and safety, we could experience lost sales, increased costs and exposure to legal and reputational risk. In those circumstances, it may be difficult and costly for us to rebuild our reputation and regain the confidence of our customers. \n​\nAll of our vendors must comply with applicable product safety laws, and we are dependent on them to ensure that the products we buy comply with all safety and quality standards. Events that give rise to actual, potential or perceived product safety concerns could expose us to government enforcement action or private litigation, result in costly product recalls and other liabilities and lead to reputational harm and loss of customer confidence. To the extent our suppliers are subject to added government regulation of their product design and/or manufacturing processes, the cost of the merchandise we purchase may rise. \n​\nFurthermore, our vendors are impacted by global economic and geopolitical conditions which in turn impact our ability to source merchandise at competitive prices. For example, new or increased tariffs, inflation, rising interest rates and disruption to the global supply chain have negatively impacted costs and inventory availability and may continue to have a negative impact on future results and profitability. Credit market and other macroeconomic conditions could also have a material adverse effect on the ability of our global and domestic suppliers to finance and operate their businesses. \n​\nIf any of our significant vendors experience financial difficulties or business disruptions or are otherwise unable to deliver merchandise to us on a timely basis, or at all, we could have product shortages in our stores that could adversely affect customers’ perceptions of us and cause us to lose customers and sales.\n​\nWe are subject to risks associated with products sourced outside the U.S.\n​\nWe directly imported approximately 13% of our purchases in fiscal 2025, but many of our domestic vendors directly import their products or components of their products. Changes to the price or flow of these goods for any reason, such as increased import duties or tariffs, foreign trade policies, civil unrest or acts of war, currency fluctuations, disruptions in maritime lanes, port labor disputes and other issues, economic conditions and instability in the countries in which foreign suppliers are located, the financial instability of suppliers, suppliers’ failure to meet our standards, issues with labor practices of our suppliers or labor problems they may experience (such as strikes, stoppages or slowdowns, which could also increase labor costs during and following the disruption), the availability and cost of raw materials to suppliers, merchandise quality or safety issues, shipping and transport availability and cost, increases in wage rates and taxes, transport security, trade sanctions, import limitations on certain types of goods or of goods containing certain materials from other countries, inflation and other factors relating to the suppliers and the countries in which they are located or from which they import, often are beyond our control and could adversely affect our operations and profitability. Furthermore, these risks may be amplified if we or our domestic vendors are unable to diversify our or their supply chains or rely too heavily on a single country to source our or our vendors’ products. These and other factors affecting our suppliers’ and our access to products could materially adversely affect our business and financial performance. As we or our domestic vendors increase the importation of merchandise or components from foreign vendors, these risks are likely to increase.\n​\n17\n\n\nTable of Contents\nDisruptions in our supply chain and other factors affecting the distribution of our merchandise could adversely impact our business.\n​\nA disruption to our supply chain or distribution network could adversely affect our ability to receive and distribute inventory in a timely manner, which could result in low inventory availability, lost sales, increased supply chain costs and loss of customer loyalty, among other things. Such disruptions may result from damage or destruction of our distribution centers, our ability to attract and retain qualified drivers, costs associated with maintaining or operating our fleet or macroeconomic conditions impacting the broader logistics or supply chain industry at large. For example, in recent years, ports, rails and domestic long-hauls in the U.S. and elsewhere have been negatively impacted by capacity constraints, congestion and delays, periodic labor disputes, security issues, weather-related events, natural disasters, and other factors beyond our control. Our business and competitive position may be negatively impacted if we are unable to successfully mitigate the impacts of such disruption to our supply chain or if we are unable to manage such disruptions more effectively than our competitors.\n​\nIn addition, we have made, and plan to continue to make, significant investments in our supply chain, such as the construction of multiple new distribution centers which began operations in fiscal 2025 and the execution of various technology initiatives. These investments seek to improve product availability and assortment, fulfill evolving consumer product demands and keep up with our long-term store expansion goals. If we fail to effectively implement future investments, or if our investments in our supply chain initiatives do not provide the anticipated benefits, we could experience sub-optimal inventory levels in our stores or be required to make further investments, which could adversely affect our sales volume and/or our margins.\n​\nOur success in international operations is dependent on our ability to manage the unique challenges presented by international markets.\n​\nThe various risks we face in our U.S. operations generally also exist when conducting operations in and sourcing products and materials from outside of the U.S. There are also challenges inherent in establishing and managing international operations, in addition to the specific costs, risks and difficulties unique to that market. For example, the sale and distribution of parts and products in Mexico and Brazil requires the ability to adapt our merchandising and marketing strategies to account for, among other things, different vehicles in operation in local markets and different consumer behaviors with respect to aftermarket automotive repair. \n​\nOur expansion into international markets may also be adversely affected by local laws and customs, U.S. laws applicable to foreign operations, and political and socio-economic conditions as well as our general ability to compete effectively and provide superior customer service regardless of distance, language and cultural differences.\n​\nRisks inherent in international operations also include potential adverse tax consequences, changes to tariffs, trade policies and trade agreements, compliance with the Foreign Corrupt Practices Act and local anti-bribery and anti-corruption laws, greater difficulty in obtaining and enforcing intellectual property rights, challenges to identify and gain access to local suppliers, and possibly misjudging the response of consumers in foreign countries to our product assortment and marketing strategy.\n​\nIn addition, our operations in international markets are conducted primarily in the local currency of those countries. Since our Consolidated Financial Statements are denominated in U.S. dollars, amounts of assets, liabilities, net sales, and other revenues and expenses denominated in local currencies must be translated into U.S. dollars using exchange rates for the current period. As a result, foreign currency exchange rates and fluctuations in those rates may adversely impact our financial performance.\n​\nBusiness interruptions may negatively impact our operating hours, operability of our computer and other systems, availability of merchandise and otherwise have a material adverse effect on our sales and our business.\n​\nBusiness interruptions including war or acts of terrorism, political or civil unrest, unusual or severe weather conditions such as hurricanes, tornadoes, windstorms, fires, earthquakes and floods, public health crises, disruption \n18\n\n\nTable of Contents\nof critical infrastructure systems, banking systems or utility services and other disasters or the threat of any of them, may negatively impact the hours and operations of our stores, distribution centers, store support centers or sourcing offices; may negatively impact our supply chain and distribution network; and may impede our ability to source quality merchandise domestically and outside of the U.S. on favorable terms.\n​\nIn the event commercial transportation is curtailed or substantially delayed, we may have difficulty transporting merchandise to our distribution centers and stores resulting in lost sales and/or a potential loss of customer loyalty. Transportation issues could also cause us to cancel purchase orders if we are unable to receive merchandise in our distribution centers. \n​\nIt is not possible to predict all events or circumstances which may negatively disrupt our business in a significant manner, and the near-term and long-term impacts of such disruptions on our business, demand for our products and our growth initiatives will vary significantly based on the facts and circumstances of each such disruption. Furthermore, such business interruptions could cause additional negative impacts of which we are not currently aware or magnify other risks associated with our business and operations.\nOur failure to protect our brand and reputation could have an adverse effect on our relationships with our customers, AutoZoners, suppliers, vendors and other stakeholders, thereby negatively impacting sales and profitability.\n​\nWe believe our continued sales growth is driven in significant part by our AutoZone and private label brand names and our positive reputation with customers, AutoZoners, suppliers, vendors and other stakeholders. The value in our brand names and reputation, and their continued effectiveness in driving our sales growth is dependent to a significant degree on our ability to maintain our reputation for safety, high product quality, friendliness, WOW! Customer service, trustworthy advice, integrity and business ethics. Negative incidents can erode trust and confidence quickly, and adverse publicity about us, whether or not based in fact, could damage our brand and reputation, undermine our customers’ confidence in us, reduce demand for our products and services, affect our ability to recruit and retain employees, attract regulatory scrutiny, and impact our relationships with suppliers and vendors. Further, our actual or perceived strategies, initiatives, responses or lack of response relating to social, political, environmental or other issues, whether or not based in fact, could damage our reputation, negatively impact our stock price or result in reduced demand for our merchandise. Customers are also increasingly using social media to provide feedback, criticism and other information about our Company, our products and our services in a manner that is rapidly and broadly disseminated. Our brand and reputation could be negatively impacted if negative sentiment about the Company, whether or not based on fact, is shared and distributed in such a manner.\n​\nFailure to comply with ethical, social, product, labor, environmental and anti-corruption standards could also jeopardize our reputation and potentially lead to various adverse actions by consumer or environmental groups, employees or regulatory bodies. Damage to our reputation or loss of consumer confidence for any of these or other reasons could have a material adverse effect on our results of operations and financial condition, as well as require additional resources to rebuild our reputation.\n​\nInformation Technology, Cybersecurity and Data Privacy Risks\n​\n‌\nWe rely heavily on information technology systems for our key business processes. Any damage to, failure of, or interruption in these systems or our inability to realize the anticipated benefits associated with investments in new or upgraded systems could have a material adverse effect on our business and operating results.\n​\nWe rely extensively on information technology systems, some of which are managed or provided by third-party service providers, to collect, analyze, process, store, manage, transmit and protect key business processes, transactions and data, such as sales data, customer data, employee data, demand forecasting, merchandise ordering, inventory replenishment, supply chain management, payment processing, order fulfillment and more. Delays in the maintenance, updates, upgrading, or patching of these systems, applications or processes could adversely impact their effectiveness and would expose us to security and other risks. Our systems and the third-party systems with which we interact are subject to damage, failure or interruption due to various reasons such as: power or other \n19\n\n\nTable of Contents\ncritical infrastructure outages, facility damage, physical theft, telecommunications failures, malware, security incidents, malicious cyber-attacks, including the use of malicious codes, worms, phishing, spyware, denial of service attacks and ransomware, natural disasters and catastrophic events, inadequate or ineffective redundancy measures; and design or usage errors by AutoZoners, contractors or third-party service providers. Although we seek to effectively maintain and safeguard our systems and our data and we seek to ensure our third-party service providers effectively maintain and safeguard their systems and our data, such efforts are not always successful. As a result, we or our service providers have experienced and are likely to again experience one or more errors, interruptions, delays or cessations of service impacting the integrity, performance or availability of our information technology infrastructure. While such incidents have not been material to date, any future incident could significantly disrupt our operations and key business processes, result in the impairment or loss of critical data, be costly and resource-intensive to remedy; harm our reputation and relationship with customers, AutoZoners, vendors and other stakeholders; and have a material adverse impact on our business and operating results.\n​\nIn addition, our information technology systems, infrastructure and personnel require ongoing substantial investments, such as replacing existing systems, some of which are older, legacy systems that are less flexible and efficient, with successor systems; making changes to existing systems, including the migration of applications to the cloud; maintaining or enhancing legacy systems that are not currently being replaced; or designing or cost-effectively acquiring and implementing new systems with new functionality, including artificial intelligence. These efforts can result in significant potential risks, including failure of the systems to operate as designed, potential loss or corruption of data, cost overruns, or implementation delays or errors, and may result in operational challenges, security control failures, reputational harm, and increased costs that could adversely affect our business operations and results of operations.\n​\nFailure to maintain the security of sensitive personal information or other confidential information in our possession could subject us to litigation or regulatory enforcement action, cause reputational harm and cause us to incur substantial costs or have a material adverse impact on our business and financial condition.\n​\nOur business, like that of most retailers, involves the collection, processing, storage and transmission of large amounts of personal information relating to our customers, suppliers and AutoZoners and confidential business information relating to AutoZone or other parties with which we do business. This information is handled by us as well as third-party service providers and vendors that provide us with various technology, systems, services and other resources that we use in connection with the handling of this information and in furtherance of our business objectives. Furthermore, we accept payments using a variety of methods, including credit, debit, electronic payments and gift cards, which present information security risks, and we may offer new payment options in the future presenting new risks of which we are currently unaware. \n​\nWhile addressing vulnerabilities is a priority for us, the methods used to obtain unauthorized access are constantly evolving and increasing in frequency and sophistication, including through the use of evolving artificial intelligence tools to identify and exploit vulnerabilities. Attempts to gain unauthorized access can be difficult to anticipate or promptly detect. We cannot assure you that the security measures we or our third-party service providers and vendors have in place today will be successful in their efforts to prevent or mitigate the impact of a cyber incident or provide us with sufficient visibility to determine if a cyber incident has occurred, and there can be no assurance that such measures we introduce in the future will be sufficiently effective either. Failure to maintain the security of the personal and other confidential information to which we have access could lead to private litigation, regulatory enforcement actions and reputational harm, all of which would require extensive time and financial resources to resolve and could have a material adverse impact on our business and financial condition. \n​\nWhile we have not experienced a material breach of our information systems or data to date, unauthorized parties have in the past gained access and exfiltrated data, and will continue to attempt to do so as the result of a cyber-attack, misconduct or error by an AutoZoner, job applicant, customer, vendor or third party, system vulnerabilities or compromises, fraud, hacking, phishing attempts, malware, ransomware, other malicious codes or other intentional or unintentional acts. Furthermore, hardware, software or other IT applications that we or a third party develop for our use have contained and may contain exploitable vulnerabilities, bugs or design defects or may involve other problems that could unexpectedly compromise information security.\n20\n\n\nTable of Contents\n​\nThe cost to remediate and respond to a cyber incident involving unauthorized use, access, damage or loss of systems, data or other information could be significant. To the extent any cyber incident involving our or one of our customer’s or third-party service provider’s information systems results in the unauthorized access, loss, damage or misappropriation of information, we may be required by law to notify impacted individuals and face substantial liability due to claims arising from customers, financial institutions, AutoZoners, regulatory authorities, payment card issuers and others. We maintain insurance coverage that may protect us from losses or claims in connection with certain incidents; however, our insurance coverage may not be sufficient to cover significant losses in any particular situation.\n​\nWe are subject to a complex and evolving body of laws and regulations regarding data privacy and may face increased costs as a result of changes in, enforcement of, or the adoption of new laws and regulations. These costs may have a material adverse impact on our business and results of operations\n. \n​\nThe regulatory environment related to information security, data collection, processing and use, and data privacy is becoming increasingly rigorous and complex. Multiple states in the U.S. have passed, and continue to pass, data protection laws. The potential effects of the various laws regulating the collection, retention, transfer, use, notification, consent and other types of processing of personal or protected information are far-reaching and may require significant time, resources and costs to comply, may require changes to our existing practices and processes that are not advantageous to our business, and otherwise limit our ability to use data to provide a more personalized user experience or as otherwise desired. In addition, failure to comply with applicable requirements by us or our business partners or third-party service providers or vendors could subject us to governmental investigations, regulatory enforcement actions, fines, sanctions, lawsuits or reputational damage.\n​\nAdditionally, while we seek to comply with these various laws as they take effect, many of the concepts are novel. There can be no assurance that compliance efforts taken by us in good faith will be sufficient, and we may be the subject of an investigation or enforcement action instituted by a state agency or other regulatory body.\n​\nIndebtedness, Financial and Market Risks\nWe are self-insured for certain costs associated with our operations and an increase in our insurance claims and expenses may have a material negative impact on us.\n​\nWe are self-insured up to certain limits for workers’ compensation, employee group medical, general and product liability, property and vehicle claims. The types and amounts of insurance may vary from time to time based on our decisions with respect to risk retention and regulatory requirements. Our reserves are established using historical trends and, where appropriate, using a third-party actuary to estimate costs to settle reported claims and claims incurred but not yet reported. Estimated costs are subject to a variety of assumptions and other factors including the severity, duration and frequency of claims, legal costs associated with claims, healthcare trends and projected inflation of related factors. Material increases in the number of insurance claims, changes to healthcare costs, accident frequency and severity, legal expenses and other factors could result in an unfavorable difference between actual self-insurance costs and our reserve estimates. As a result, our self-insurance costs could increase, which may adversely affect our business, results of operations, financial condition and cash flows.\n​\nA downgrade in our credit ratings or a general disruption in the credit markets could make it more difficult for us to access funds, refinance our debt, obtain new funding or issue debt securities.\n​\nOur short-term and long-term debt is rated investment grade by the major rating agencies. These investment-grade credit ratings have historically allowed us to take advantage of lower interest rates and other favorable terms on our short-term credit lines, in our senior debt offerings and in the commercial paper markets. To maintain our investment-grade ratings, we are required to meet certain financial performance ratios. A change by the rating agencies in these ratios, an increase in our debt, and/or a decline in our earnings could result in downgrades in our credit ratings. A downgrade in our credit ratings could limit our access to public debt markets, limit the institutions willing to provide credit facilities to us, result in more restrictive financial and other covenants in our public and \n21\n\n\nTable of Contents\nprivate debt and would likely significantly increase our overall borrowing costs and adversely affect our earnings. Additionally, a downgrade in our credit or changes in the financial markets may limit financial institutions’ willingness to participate in our supplier financing arrangements, which may result in vendors seeking to renegotiate their payment terms. Moreover, significant deterioration in the financial condition of large financial institutions could result in a severe loss of liquidity and availability of credit in global credit markets and in more stringent borrowing terms. Conditions and events in the global credit markets could have a material adverse effect on our access to short-term and long-term debt and the terms and cost of that debt.\n​\nLegal and Regulatory Risks\n​\nOur business, results of operations, financial condition and cash flows may be adversely affected by the adoption of new laws, changes to existing laws, increased enforcement activity or other governmental actions.\n​\nWe are subject to numerous federal, state and local laws and regulations, many of which are complex, frequently revised and subject to varying interpretations. These include laws governing employment and labor, wage and hour, environmental matters, proper handling and disposal of hazardous materials and waste, employee benefits, data privacy, cybersecurity, safety, the pricing and sale of goods, import and export compliance, transportation and logistics, consumer protection and advertising, among others. These laws may change over time and may differ substantially across the areas where we operate. There is added uncertainty surrounding potential changes to the regulatory environment in the United States. Although we have implemented policies and procedures to help ensure compliance with these laws, there can be no certainty that our AutoZoners and third parties with whom we do business will not take actions in violation of our policies or applicable laws. If we fail to comply with these laws, rules and regulations, or the manner in which they are interpreted or applied, we may be subject to governmental enforcement action or private litigation resulting in restrictions on our business, monetary penalties, reputational harm and increased costs of regulatory compliance. Any changes in the enforcement or interpretation of existing laws and regulations or the enactment of any new laws and regulations, including tax legislation, could have a material adverse impact on our financial condition and results of operations. We may also be subject to investigations or audits by governmental authorities and regulatory agencies as a result of enforcing existing laws and regulations or changes in enforcement priorities, which can occur in the ordinary course of business or may result from increased scrutiny from a particular agency or toward a particular industry.\n​\nWe may be adversely affected by legal, regulatory or market responses to global climate change.\n​\nClimate change resulting from increased concentrations of carbon dioxide and other greenhouse gases in the atmosphere could present risks to our operations. For example, we have significant operations in California and other states, where serious drought has made water less available and more costly and has increased the risk of wildfires. Changes in climate patterns leading to extreme heat waves or unusual cold weather at some of our locations can lead to increased energy usage and costs, or otherwise adversely impact our facilities and operations and disrupt our supply chains and distribution systems. Growing concern over climate change has led policy makers in some jurisdictions to consider the enactment of legislative and regulatory proposals that would impose extensive mandatory reporting requirements as well as requirements for reductions of greenhouse gas (“GHG”) emissions. Such laws, if enacted, are likely to impact our business in a number of ways. For example, significant changes in fuel economy requirements, new federal or state restrictions on emissions of carbon dioxide or new or changing federal or state incentive programs or other regulations that may be imposed on vehicles and automobile fuels could adversely affect demand for vehicles, annual miles driven or the products we sell. We may not be able to accurately predict, prepare for and effectively respond to new kinds of technological innovations with respect to electric vehicles and other technologies that minimize emissions. Compliance with any new or more stringent laws or regulations, or stricter interpretations of existing laws, could require additional expenditures by us or our suppliers. Our inability to appropriately respond to such changes could materially adversely impact our business, financial condition, results of operations or cash flows.\n​\n22\n\n\nTable of Contents\nWe may be unable to achieve the goals and aspirations set forth in our Corporate Responsibility report, particularly with respect to the reduction of GHG emissions, or otherwise meet the expectations of our stakeholders with respect to corporate responsibility matters.\n​\nGovernmental and societal attention to corporate responsibility matters, including expanding mandatory and voluntary reporting of GHG emissions and other sustainability metrics, and disclosure topics such as climate change, sustainability, natural resources, waste reduction, energy, human capital, and risk oversight could expand the nature, scope, and complexity of matters that we are required to control, assess, and report. We strive to deliver shared value through our business, and our diverse stakeholders expect us to make progress in certain corporate responsibility priority issue areas. A failure or perceived failure to meet these expectations could adversely affect public perception of our business, employee morale or customer or shareholder support.\n​\nWe have announced certain aspirations and goals related to corporate responsibility matters, such as our intention to reduce certain GHG emissions over time. Achievement of these aspirations, plans and goals is subject to numerous risks and uncertainties, many of which are outside of our control. These risks and uncertainties include, but are not limited to: our ability to successfully identify and implement relevant strategies on a timely and cost-effective basis; our ability to achieve the anticipated benefits and cost savings of such strategies and actions; and the availability and cost of existing and future technologies, such as alternative fuel vehicles, off-site renewable energy, and other materials and components. It is possible that we may be unsuccessful in the achievement of our corporate responsibility goals, on a timely basis or at all, or that the costs to achieve those goals become prohibitively expensive. Furthermore, our stakeholders may not be satisfied with our efforts or the speed at which we are progressing towards any such aspirations and goals. A delay, failure or perceived failure or delay to meet our goals and aspirations could adversely affect public perception of our business, cause us to lose shareholder support, and subject us to legal claims and liabilities with respect to such matters. Certain challenges we face in the achievement of our corporate responsibility objectives are also captured within our corporate responsibility reporting, which is not incorporated by reference into and does not form any part of this report.\n​\nOur business, financial condition, results of operations and cash flows may be affected by litigation.\n​\nWe are involved in lawsuits, regulatory investigations, governmental and other legal proceedings arising out of the ordinary course of business. Such matters involve significant expense and divert management’s attention and resources from other matters. The damages sought against us in these proceedings may be material and may adversely affect our business, results of operations, financial condition and cash flows.\n​\nGeneral Risks\n​\nSignificant changes in macroeconomic and geopolitical factors could materially adversely affect our financial condition and results of operations.\n​\nMacroeconomic conditions impact both our customers and our suppliers. Moreover, the U.S. government continues to operate under historically large deficits and debt burden. Continued distress in global credit markets, business failures, civil unrest, inflation, rising interest rates, foreign exchange rate fluctuations, significant geopolitical conflicts, proposed or additional tariffs, continued volatility in energy prices, the impact of a public health crisis or pandemic, constraints on the global supply chain, a sustained government shutdown and other factors continue to affect the global economy. Moreover, rising energy prices could impact our merchandise distribution, commercial delivery, utility and product costs. It is unclear how such factors could impact our business in the short term. Over a longer period of time, these macroeconomic and geopolitical conditions could adversely affect our sales growth, margins and overhead. These could materially adversely affect our financial condition and operations.\n​",
    "item1b": "Item 1B. Unresolved Staff Comments\nNone.\n23\n\n\nTable of Contents",
    "item1c": "Item 1C. Cybersecurity\nRisk Management and Strategy\nProgram \n​\nWe recognize the importance of assessing, identifying, and managing material risks from cybersecurity threats and have \nimplemented\n various processes and safeguards to aid in such efforts. Our program encompasses people, processes, and technologies to safeguard our systems, data, and business from cybersecurity threats. Our program prioritizes threat mitigation and risk management, while focusing on maintaining the integrity and resilience of our systems. \n​\nOur program is informed by industry standards, including the National Institute of Standards and Technology (NIST) Cyber Security Framework (CSF), the American National Standards Institute encryption standards and the Payment Card Industry Data Security Standard, among others. As part of our cybersecurity strategy, we regularly engage \nindependent, outside expertise\n to assess and benchmark our overall program against these industry standards. \n​\nAutoZone, with the assistance of our managed security service provider, continuously monitors our threat intelligence and events within our digital environments. We employ a variety of methods designed to test and improve our controls, including vulnerability scanning, penetration testing, and attack simulation testing. We have an incident response plan which sets forth procedures to investigate, respond to, contain, and remediate incidents with the support of a cross-functional team. The incident response plan also outlines a process for escalating and communicating incidents to members of management.\n​\nDuring the contract review and vendor engagement process, we assess vendors’ adherence to appropriate security practices, requirements, and expectations, including compliance with industry standards and applicable laws and regulations. We also engage a third-party to \nmonitor\n certain service providers so that we may be alerted of important events that would impact such party’s risk profile. We have an Information Security Awareness program which seeks to educate our employees on security risks and best practices through training, internal communications, and security awareness campaigns. We maintain cybersecurity insurance coverage that may protect us from losses in connection with certain cybersecurity incidents.\n​\nCybersecurity Risks\n​\nWhile \nwe have not experienced a material breach\n of our information systems or data to date, unauthorized parties have in the past gained access and exfiltrated data. Any future incident could significantly disrupt our operations and key business processes, result in the impairment, loss, unauthorized access of critical or sensitive data, be costly and resource-intensive to remedy; harm our reputation and relationship with customers, AutoZoners, vendors and other stakeholders; and have a material adverse impact on our business and operating results. See “Information Technology, Cybersecurity and Data Privacy Risks” in Item 1.A., Risk Factors for additional information related to cybersecurity risks.\n \n​\nGovernance\nThe cybersecurity risk management program is integrated into our broader enterprise risk management framework, which allows our senior management team, with oversight from our Board, to develop a more holistic view of our risk exposure and prioritize and manage such risks accordingly.\nAutoZone’s \nChief Information Security Officer\n (\nCISO\n) \nreports directly to our Chief Information Officer and Senior Vice President of Information Technology\n. \nOur CISO has over 25 years’ experience in IT, with over 20 years in dedicated Information Security leadership roles. He has experience across a broad range of industries and holds credentials including the Certified Information Systems Security Professional and the CERT Certificate in Cybersecurity Oversight from the National Association of Corporate Directors.\n​\n24\n\n\nTable of Contents\nThe \nAudit Committee\n is responsible for overseeing the Company’s enterprise risk management program, including cybersecurity risks. \nAt its quarterly committee meetings,\n the Audit Committee reviews and discusses cybersecurity \nmatters directly with our CISO, including relevant cybersecurity risks, changes to AutoZone’s threat landscape, risk mitigation strategies, cybersecurity program assessments and results, and cybersecurity roadmap and progress."
  }
}