{
  "ticker": "BA",
  "cik": "0000012927",
  "company_name": "BOEING CO",
  "filing_date": "2025-02-03",
  "accession": "0000012927-25-000015",
  "primary_doc": "ba-20241231.htm",
  "item_sections": {
    "item1": "Item  16.\nForm 10-K Summary\n136\nSignatures\n137\nTable of Contents\nPART I\nItem 1. Business\nThe Boeing Company, together with its subsidiaries (herein referred to as “Boeing,” the “Company,” “we,” “us,” “our”), is one of the world’s major aerospace firms.\nWe are organized based on the products and services we offer. We operate in three reportable segments:\n•\nCommercial Airplanes (BCA);\n•\nDefense, Space & Security (BDS);\n•\nGlobal Services (BGS).\nCommercial Airplanes Segment\nThis segment develops, produces and markets commercial jet aircraft principally to the commercial airline industry worldwide. We are a leading producer of commercial aircraft and offer a family of commercial jetliners designed to meet a broad spectrum of global passenger and cargo requirements of airlines. This family of commercial jet aircraft in production includes the 737 narrow-body model and the 767, 777 and 787 wide-body models. Development continues on the 777X program and the 737-7 and 737-10 derivatives.\nDefense, Space & Security Segment\nThis segment engages in the research, development, production and modification of manned and unmanned military aircraft and weapons systems for strike, surveillance and mobility, including fighter and trainer aircraft; vertical lift, including rotorcraft and tilt-rotor aircraft; and commercial derivative aircraft, including anti-submarine and tanker aircraft. In addition, this segment engages in the research, development, production and modification of the following products and related services: strategic defense and intelligence systems, including strategic missile and defense systems, command, control, communications, computers, intelligence, surveillance and reconnaissance (C4ISR), cyber and information solutions, and intelligence systems, satellite systems, including government and commercial satellites and space exploration.\nGlobal Services Segment\nThis segment provides services to our commercial and defense customers worldwide. Global Services sustains aerospace platforms and systems with a full spectrum of products and services, including supply chain and logistics management, engineering, maintenance and modifications, upgrades and conversions, spare parts, pilot and maintenance training systems and services, technical and maintenance documents, and data analytics and digital services.\nIntellectual Property\nWe own numerous patents and have licenses for the use of patents owned by others, which relate to our products and their manufacture. In addition to owning a large portfolio of intellectual property, we also license intellectual property to and from third parties. For example, the U.S. government has licenses in our patents that are developed in performance of government contracts, and it may use or authorize others to use the inventions covered by such patents for government purposes. Unpatented research, development and engineering skills, as well as certain trademarks, trade secrets and other intellectual property rights, also make an important contribution to our business. While our intellectual \n1\nTable of Contents\nproperty rights in the aggregate are important to the operation of each of our businesses, we do not believe that our business would be materially affected by the expiration of any particular intellectual property right or termination of any particular intellectual property patent license agreement.\nHuman Capital\nAs of December 31, 2024, Boeing’s total workforce was approximately 172,000 with 15% located outside of the U.S. As of December 31, 2024, our global workforce was comprised of approximately 24% women, and our U.S. workforce was comprised of 39% racial and ethnic minorities and 14% U.S. veterans.\nAs of December 31, 2024, our workforce included approximately 58,000 union members. Our principal collective bargaining agreements and their current status are summarized in the following table:\nUnion\nPercent of our Total Workforce Represented\nStatus of Major Agreements with Union\nThe International Association of Machinists and Aerospace Workers (IAM)\n21%\nWe have two major agreements; one with IAM District 837 (Missouri) expiring in July 2025 and one with IAM District 751 (Washington) expiring in September 2028.\nThe Society of Professional Engineering Employees in Aerospace (SPEEA)\n10%\nWe have two major agreements; one with SPEEA Professional and one with SPEEA Technical, both expiring in October 2026.\nThe United Automobile, Aerospace and Agricultural Implement Workers of America (UAW)\n1%\nWe have one major agreement with UAW District 1069 (Pennsylvania) expiring in April 2027.\nOur prior contract with the International Association of Machinists and Aerospace Workers District 751 (IAM 751) expired on September 12, 2024, and 96% of IAM 751 members voted to initiate a strike. The strike lasted until November 4, 2024, when IAM 751 members voted to ratify a new contract. As a result of the strike, we paused production of our commercial aircraft (other than the 787 production in Charleston) and certain of our BDS products, adversely impacting our business and financial position. During the strike, we implemented hiring freezes and announced plans to reduce our overall workforce. For information on risks related to our human capital, see “Risks Related to Our Business and Operations” in",
    "item1a": "Item 1A. Risk Factors\nAn investment in our securities involves risks and uncertainties, including those described below, which can materially affect our business, financial position, results of operations and cash flows. These risk factors should be carefully reviewed in conjunction with the other information in this report, including “Management's Discussion and Analysis of Financial Condition and Results of Operations” and the consolidated financial statements and related notes. Due to risks and uncertainties, known and unknown, our past financial results may not be a reliable indicator of future performance, and historical trends should not be used to anticipate results or trends in future periods.\nRisks Related to Our Business and Operations\nWe depend heavily on commercial airlines, subjecting us to unique risks.\nMarket conditions have a significant impact on demand for our commercial aircraft and related services.\n The commercial aircraft market is predominantly driven by long-term trends in airline passenger and cargo traffic. The principal factors underlying long-term traffic growth are sustained economic growth and political stability in both developed and emerging markets. Demand for our commercial aircraft is further influenced by additional factors including airline profitability, availability of aircraft financing, trade policies, geopolitics, technological advances, price and other competitive factors, fuel prices, inflationary pressures, terrorism, pandemics, epidemics, sustainability-related preferences, environmental regulations, and reputational factors. Historically, the airline industry has been cyclical and very competitive and has experienced significant profit swings and constant challenges to be more cost competitive. Significant deterioration in the global economic environment, the airline industry generally or the financial stability of one or more of our major customers could result in fewer new orders for aircraft or services, or could cause customers to seek to postpone or cancel contractual orders and/or payments to us, which could result in lower revenues, profitability and cash flows and a reduction in our contractual backlog. In addition, because our commercial aircraft backlog consists of aircraft scheduled for delivery over a period of several years, any of these macroeconomic, industry or customer impacts could affect deliveries over a long period.\nWe enter into firm fixed-price aircraft sales contracts with indexed price escalation clauses, which subjects us to losses if we have cost overruns or if increases in our costs exceed the applicable escalation rate.\n Commercial aircraft sales contracts are typically entered into years before the aircraft are delivered. In order to help account for economic fluctuations between the contract date and delivery date, aircraft pricing generally consists of a fixed amount as modified by price escalation formulas derived from labor, commodity and other price indices. Our revenue estimates are based on current expectations with respect to these escalation formulas, but the actual escalation amounts are outside of our control. Escalation factors can fluctuate significantly from period to period. Changes in escalation amounts can significantly impact revenues and operating margins in our BCA business.\nWe derive a significant portion of our revenues from a limited number of commercial airlines.\n We can make no assurance that any customer will exercise purchase options, fulfill existing purchase commitments or purchase additional products or services from us. In addition, fleet decisions, airline consolidations or financial challenges involving any of our major commercial airline customers could significantly reduce our revenues and limit our opportunity to generate profits from those customers. Airlines also are experiencing increased fuel and other costs, and the global economy has experienced and may continue to experience high inflation.\nOur Commercial Airplanes business depends on our ability to maintain a healthy production system, ensure every airplane in our production system conforms to exacting specifications, \n6\nTable of Contents\nachieve planned production rate targets, successfully develop and certify new aircraft or new derivative aircraft, and meet or exceed stringent performance and reliability standards. \nThe commercial aircraft business is extremely complex, involving extensive coordination and integration with suppliers, highly-skilled labor performed by thousands of employees of ours and other partners, and stringent and evolving regulatory requirements and performance and reliability standards. We have experienced and may continue to experience production quality issues, including in our supply chain.\nFor example, as a result of the Alaska Airlines 737-9 accident in January 2024, the FAA investigated the 737 quality control system, including Spirit, and increased its oversight of our production and quality and safety management systems. The FAA identified multiple instances where we and Spirit failed to comply with manufacturing quality control requirements. As part of our plan to improve safety and quality and to address the issues identified by the FAA, we slowed 737 production rates and delayed planned production rate increases to reduce traveled work in our factory and at our suppliers. These actions significantly impacted our financial position, results of operations and cash flows during the year ended December 31, 2024, and are expected to continue to impact our financial position, results of operations and cash flows as we work to increase production and improve factory performance.\nThe introduction of new aircraft programs and/or derivatives, such as the 777X, 737-7 and 737-10, involves risks associated with meeting development, testing, certification and production schedules. We are following the lead of the FAA as we work through the certification process, and the FAA will ultimately determine the timing of certification and entry into service. There have been delays on each of these development programs and if we experience additional delays in achieving certification, our financial position, results of operations and cash flows would be adversely impacted.\nA number of our customers have contractual remedies, including compensation for late deliveries or rights to reject individual airplane deliveries based on delivery delays. Delays on the 737, 777X and 787 programs have resulted in, and may continue to result in, customers having the right to terminate orders, be compensated for late deliveries and/or substitute orders for other Boeing aircraft.\nWe must minimize disruption caused by production changes, achieve operational stability and implement productivity improvements in order to meet customer demand and maintain our profitability. \nWe have previously announced plans to adjust production rates on several of our commercial aircraft programs. In addition, we continue to seek opportunities to reduce the costs of building our aircraft, including working with our suppliers to reduce supplier costs, identifying and implementing productivity improvements and optimizing how we manage inventory. If production rate changes at any of our commercial aircraft assembly facilities are delayed or create significant disruption to our production system, or if our suppliers cannot timely deliver components that comply with design specifications to us at the cost and rates necessary to achieve our targets, we may be unable to meet delivery schedules and/or the financial performance of one or more of our programs may suffer.\nOperational challenges impacting the production system for one or more of our commercial aircraft programs could result in additional production delays and/or failure to meet customer demand for new aircraft, either of which would negatively impact our revenues and operating margins. \nOur commercial aircraft production system is extremely complex. Operational issues, including delivery and/or certification delays or defects in supplier components, failure to meet internal performance plans, or delays or failures to achieve required regulatory approval, results in additional out-of-sequence work and increased production costs, as well as delayed deliveries to customers, impacts to aircraft performance and/or increased warranty or fleet support costs. We and our suppliers are experiencing supply chain disruptions and constraints, labor instability and inflationary pressures. We continue to monitor the health and stability of the supply chain. These factors have and may continue to reduce overall productivity and adversely impact our financial position, results of operations and cash flows.\n7\nTable of Contents\nIf our commercial aircraft fail to satisfy performance and reliability requirements and/or potentially required sustainability standards, we could face additional costs and/or lower revenues. \nDeveloping and manufacturing commercial aircraft that meet or exceed our performance and reliability standards and/or potentially required sustainability standards, as well as those of customers and regulatory agencies, is costly and technologically challenging. These challenges are particularly significant with newer aircraft programs. Any failure of any Boeing aircraft to satisfy performance or reliability requirements could result in disruption to our operations, higher costs and/or lower revenues.\nChanges in levels of U.S. government defense spending or acquisition priorities, as well as significant delays in U.S. government appropriations, could negatively impact our business, financial position and results of operations.\nWe derive a substantial portion of our revenue from the U.S. government, primarily from defense related programs with the United States Department of Defense (U.S. DoD) and contracts with other government agencies, including NASA. Levels of U.S. defense spending are very difficult to predict and may be impacted by numerous factors such as the evolving nature of the national security threat environment, U.S. national security strategy, U.S. foreign policy, the domestic political environment, macroeconomic conditions and the ability of the U.S. government to enact relevant legislation such as authorization and appropriations bills. The government may also constrain discretionary spending by instituting enforceable spending caps.\nThe timeliness of annual appropriations for U.S. government departments and agencies remains a recurrent risk. Congress may fund government departments and agencies with one or more continuing resolutions, which could delay new programs or competitions and/or negatively impact the execution of certain program activities. A lapse in appropriations for government departments or agencies would result in a full or partial government shutdown, which could impact our operations. In the event of a prolonged shutdown, requirements to furlough employees in the U.S. DoD, the Department of Transportation, including the FAA, or other government agencies could result in payment delays, impair our ability to deliver commercial airplanes or perform work on existing contracts, delays in the certification of new aircraft or otherwise impact our operations, negatively impact future orders, and/or cause other disruptions or delays. There is uncertainty regarding which government functions would shut down or continue operations during a lapse in appropriations, and corresponding uncertainty regarding the extent or magnitude of potential impacts to our operations. For additional information on U.S. government appropriations and budgets, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations – Additional Considerations – U.S. Government Funding” on page 31 of this Form 10-K.\nIn addition, there continues to be uncertainty with respect to future acquisition priorities and program-level appropriations for the U.S. DoD and other government agencies (including NASA), including changes to national security and defense priorities, and tension between modernization investments, sustainment investments, and investments in new technologies or emergent capabilities. Future investment priority changes or budget cuts, including changes associated with the authorizations and appropriations process, could result in reductions, cancellations, and/or delays of existing contracts or programs or future program opportunities. Any of these impacts could have a material effect on our financial position, results of operations and/or cash flows.\nAs a result of the significant ongoing uncertainty with respect to both U.S. defense spending and the evolving nature of the national security threat environment, we also expect the U.S. DoD to continue to emphasize affordability, innovation, cybersecurity and delivery of technical data and software in its procurement processes, including the implementation of cybersecurity compliance requirements on the Defense Industrial Base, for which the supply chain may not be fully prepared. If we and our suppliers are unable to adjust to these changing acquisition priorities and policies, our revenues and market share could be impacted.\n8\nTable of Contents\nOur ability to deliver products and services that satisfy customer requirements is heavily dependent on the performance and financial stability of our subcontractors and suppliers, as well as on the availability of highly skilled labor, raw materials and other components. \nWe rely on other companies, including U.S. and non-U.S. subcontractors and suppliers, to provide and produce raw materials, integrated components and sub-assemblies, and production commodities and to perform some of the services that we provide to our customers. Many of our suppliers are experiencing inflationary pressures, as well as resource constraints and disruptions due to production quality issues, global supply chain constraints, and labor instability. If one or more of our suppliers or subcontractors continue to experience financial difficulties, delivery delays or other performance problems, we may be unable to meet commitments to our customers and our financial position, results of operations and cash flows may continue to be adversely impacted. In addition, if one or more of the raw materials on which we depend (such as aluminum, titanium or composites) becomes unavailable to us or our suppliers, or is available only at very high prices, including as a result of increased tariffs and trade restrictions, or has quality issues or defects, we may be unable to deliver one or more of our products in a timely fashion or at budgeted costs. In some instances, we depend upon a single source of supply. Any service disruption from one of these suppliers, either due to circumstances beyond the supplier’s control, such as geopolitical developments, or as a result of performance problems or financial difficulties, could have a material adverse effect on our ability to meet commitments to our customers or increase our operating costs.\nSome of our and our suppliers’ workforces are represented by labor unions. Work stoppages by our employees have adversely affected and could continue to adversely affect our business, financial condition, results of operations and/or cash flows. Future work stoppages by our or our suppliers’ employees could also adversely impact our business.\nApproximately 58,000 employees, which constitute 34% of our total workforce, were union represented as of December 31, 2024 under collective bargaining agreements with varying durations and expiration dates. As of December 31, 2024, we had 9 unions in the U.S. with 27 independent agreements and 18 employee representative bodies internationally, and we cannot predict how stable our union relationships will be or whether we will be able to meet the unions’ requirements. On September 12, 2024, our contract with IAM 751, which represents over 30,000 Boeing manufacturing employees primarily located in Washington state, expired and 96% of IAM 751 members voted to initiate a strike. On November 4, 2024, members of IAM 751 voted to ratify a new contract, thereby ending the strike. As a result of the strike, production of our commercial aircraft, other than the 787 production in Charleston, and certain of our Defense, Space & Security products halted, adversely impacting our business and financial position. Net cash used by operating activities for the year ended December 31, 2024, was $12.1 billion and we expect further negative operating cash flows to continue in future quarters as we work to ramp up production and deliveries. The new contract with IAM 751 and pay enhancements for certain non-union employees is adversely impacting our financial position, results of operations and cash flows. We may experience additional work stoppages in the future, which could adversely affect our business.\nThe unions may also limit our flexibility in managing our workforce and operations. Union actions at suppliers also affect us. Work stoppages and instability in our union relationships delay the production and/or development of our products, which could strain relationships with customers and result in lower revenues.\nCompetition within our markets and with respect to our products and services may reduce our future contracts and sales.\nThe markets in which we operate are highly competitive and one or more of our competitors may have more extensive or more specialized engineering, manufacturing and marketing capabilities than we do \n9\nTable of Contents\nin some areas. In our BCA business, we face aggressive international competition intent on increasing market share. In our BDS business, we anticipate that the effects of defense industry consolidation, shifting acquisition and budget priorities, and continued cost pressure at our U.S. DoD and non-U.S. customers will intensify competition for many of our BDS products. Our BGS segment faces competition from many of the same strong U.S. and non-U.S. competitors facing BCA and BDS. Furthermore, we are facing increased international competition and cross-border consolidation of competition, and U.S. procurement and compliance requirements that could limit our ability to be cost-competitive in the international market. There can be no assurance that we will be able to compete successfully against our current or future competitors or that the competitive pressures we face will not result in reduced revenues and market share.\nWe derive a significant portion of our revenues from non-U.S. sales and are subject to the risks of doing business in other countries. \nIn 2024, non-U.S. customers, which include foreign military sales (FMS), accounted for approximately 46% of our revenues. We expect that non-U.S. sales will continue to account for a significant portion of our revenues for the foreseeable future. We are subject to risks of doing business internationally, including:\n•\nchanges in regulatory requirements or other executive branch actions, such as Executive Orders;\n•\nchanges in the global trade environment, including potential deterioration in geopolitical or trade relations between countries;\n•\ndisputes with authorities in non-U.S. jurisdictions, including international trade authorities;\n•\ntariffs, duties or penalties attributable to the importation of raw materials, parts, products and services, which could impact sales and/or delivery of products and services outside the U.S. and/or impose costs on us, our suppliers or our customers;\n•\nchanges to U.S. and non-U.S. government policies, including sourcing restrictions, requirements to expend a portion of program funds locally and governmental industrial cooperation or participation requirements;\n•\nfluctuations in international currency exchange rates;\n•\nvolatility in international political and economic environments and changes in non-U.S. national priorities and budgets, which can lead to delays or fluctuations in orders;\n•\nthe complexity and necessity of using non-U.S. representatives and consultants;\n•\nthe uncertainty of the ability of non-U.S. customers to finance purchases, including the availability of financing from the Export-Import Bank of the United States;\n•\nuncertainties and restrictions concerning the availability of funding credit or guarantees;\n•\nimposition of domestic and international taxes, export controls, tariffs, embargoes, sanctions and other trade restrictions;\n•\nthe difficulty of management and operation of an enterprise spread over many countries;\n•\ncompliance with a variety of non-U.S. laws, as well as U.S. laws affecting the activities of U.S. companies abroad; and\n•\nunforeseen developments and conditions, including terrorism, war, epidemics and international tensions and conflicts.\nWhile the impact of these factors is difficult to predict, any one or more of these factors could adversely affect our operations in the future. For example, since 2018, the U.S. and China have imposed tariffs on each other’s imports. Certain aircraft parts and components that Boeing procures are subject to these \n10\nTable of Contents\ntariffs. We are mitigating import costs through Duty Drawback Customs procedures. Overall, the U.S.-China trade relationship remains stalled as economic and national security concerns continue to be a challenge. China is a significant market for commercial aircraft and we have long-standing relationships with our Chinese customers, who represent a key component of our commercial aircraft backlog. If we are unable to deliver aircraft to customers in China consistent with our assumptions and/or obtain additional orders from China in the future, we may experience reduced deliveries and/or lower market share. Impacts from future potential deterioration in geopolitical or trade relations between the U.S. and one or more other countries could have a material adverse impact on our financial position, results of operations and/or cash flows.\nWe use estimates and make assumptions in accounting for contracts and programs. Changes in our estimates and/or assumptions could adversely affect our future financial results.\nContract and program accounting require judgment relative to assessing risks, estimating revenues and costs and making assumptions for schedule and technical issues. Due to the size and nature of many of our contracts and programs, the estimation of total revenues and cost at completion is complicated and subject to many variables. Assumptions have to be made regarding the length of time to complete the contract or program because costs also include expected increases in wages and employee benefits, material prices and allocated fixed costs. Incentives or penalties related to performance on contracts are considered in estimating sales and profit rates and are recorded when there is sufficient information for us to assess anticipated performance. Customer and supplier claims and assertions are also assessed and considered in estimating revenues, costs and profit rates. Estimates of future award fees are also included in revenues and profit rates.\nWith respect to each of our commercial aircraft programs, inventoriable production costs (including overhead), program tooling and other non-recurring costs and routine warranty costs are accumulated and charged as cost of sales by program instead of by individual units or contracts. A program consists of the estimated number of units (accounting quantity) of a product to be produced in a continuing, long-term production effort for delivery under existing and anticipated contracts limited by the ability to make reasonably dependable estimates. To establish the relationship of sales to cost of sales, program accounting requires estimates of (a) the number of units to be produced and sold in a program, (b) the period over which the units can reasonably be expected to be produced and (c) the units’ expected sales prices, production costs, program tooling and other non-recurring costs, and routine warranty costs for the total program. Changes to customer or model mix, production costs and rates, learning curve, changes to price escalation indices, costs of derivative aircraft, supplier performance, customer and supplier negotiations/settlements, supplier claims and/or certification issues can impact these estimates. Estimation of the accounting quantity for a program takes into account several factors including firm orders, letters of intent from prospective customers and market studies. In addition, on development programs such as the 777X, 737-7 and 737-10, we are subject to risks with respect to the timing and conditions of aircraft certification, including potential gaps between when aircraft are certified in various jurisdictions, changes in certification processes and our estimates with respect to the timing of future certifications, which could have an impact on overall program status. Any such change in estimates relating to program accounting may adversely affect future financial performance.\nBecause of the significance of the judgments and estimation processes described above, materially different revenues and profit amounts could be recorded if we used different assumptions, revised our estimates, or if the underlying circumstances were to change. Changes in underlying assumptions, circumstances or estimates may adversely affect future period financial performance. For additional information on our accounting policies for recognizing sales and profits, see our discussion under “Management’s Discussion and Analysis of Financial Condition and Results of Operations – Critical \n11\nTable of Contents\nAccounting Estimates – Accounting for Long-term Contracts/Program Accounting” on pages 49 - 51 and Note 1 to our Consolidated Financial Statements on pages 60 - 70 of this Form 10-K.\nOur pending acquisition of Spirit AeroSystems Holdings, Inc. (Spirit) subjects us to various risks and uncertainties, including risks that we may not complete the acquisition or realize the anticipated benefits in the expected timeframe or at all.\nOn June 30, 2024, we entered into an Agreement and Plan of Merger (Merger Agreement) to acquire Spirit in an all-stock transaction that will include the assumption of Spirit's net debt at closing. Completion of our acquisition of Spirit is subject to a number of conditions set forth in the Merger Agreement. On January 31, 2025, Spirit’s stockholders approved the Merger Agreement and the related transactions. Some of the remaining conditions, such as certain regulatory approvals and the ability of Spirit to enter into definitive agreements relating to the disposition of Spirit operations related to certain Airbus commercial work packages and consummate the related transactions, are beyond our control, which make the completion of our acquisition of Spirit (and the timing thereof) uncertain. In addition, if Spirit or Boeing exercise certain termination rights included in the Merger Agreement, the acquisition will not be consummated. Furthermore, the governmental authorities from which regulatory approvals related to the acquisition are required may impose burdensome or unacceptable conditions on the completion of the acquisition, require changes to the terms of the Merger Agreement, or prevent or delay the consummation of the acquisition. If the acquisition is not completed, our ongoing business may be adversely affected and we will be subject to a number of risks, including expenditure of time and resources, negative reactions from stakeholders, and potential stock price fluctuations. If we are successful in completing the acquisition, we will be subject to other risks, including those related to the assumption of Spirit's net debt and other obligations at closing, which could adversely impact our financial position, results of operations and cash flows. Difficulties in integrating Spirit may result in the failure to realize anticipated benefits of the acquisition (including anticipated synergies and quality improvements) in the expected timeframe or at all, as well as operational challenges, the diversion of management’s attention from other ongoing business concerns, and unforeseen expenses, which may have an adverse impact on our operations and our financial position, results of operations, and cash flows. For additional information on the acquisition, see Note 2 to our Consolidated Financial Statements.\nWe may not realize the anticipated benefits of mergers, acquisitions, joint ventures/strategic alliances or divestitures.\nAs part of our business strategy, we may merge with or acquire businesses and/or form joint ventures and strategic alliances. Whether we realize the anticipated benefits from these acquisitions, including our acquisition of Spirit, and related activities depends, in part, upon our ability to integrate the operations of the acquired business, the performance of the underlying product and service portfolio, and the performance of the management team and other personnel of the acquired operations. Accordingly, our financial results could be adversely affected by unanticipated performance issues, legacy liabilities, cybersecurity issues or vulnerabilities, transaction-related charges, amortization of expenses related to intangibles, charges for impairment of long-term assets, credit guarantees, partner performance and indemnifications. Consolidations of joint ventures could also impact our reported results of operations or financial position. We also may make strategic divestitures from time to time. These transactions may result in continued financial involvement in the divested businesses, such as through guarantees or other financial arrangements, following the transaction. Nonperformance by those divested businesses could affect our future financial results through additional payment obligations, higher costs or asset write-downs.\n12\nTable of Contents\nRisks Related to Our Contracts\nWe conduct a significant portion of our business pursuant to U.S. government contracts, which are subject to unique risks. \nIn 2024, 42% of our revenues were earned pursuant to U.S. government contracts, which include Foreign Military Sales (FMS) through the U.S. government. Business conducted pursuant to such contracts is subject to extensive procurement regulations and other unique risks.\nOur sales to the U.S. government are subject to extensive procurement regulations, and changes to those regulations could increase our costs.\n New procurement regulations or climate or cyber-related contractual disclosures, or changes to existing requirements, could increase our compliance costs or otherwise have a material impact on the operating margins of our BDS and BGS businesses. These requirements may also result in withheld payments and/or reduced future business if we fail to comply. For example, proposals to raise domestic content thresholds for our U.S. government contracts could have negative impacts on our business. Compliance costs attributable to current and potential future procurement regulations such as these could negatively impact our financial position, results of operations and/or cash flows.\nThe U.S. government may modify, curtail or terminate one or more of our contracts.\n The U.S. government contracting party may modify, curtail or terminate its contracts and subcontracts with us, without prior notice and either at its convenience or for default based on performance. In addition, funding pursuant to our U.S. government contracts may be reduced or withheld as part of the U.S. Congressional appropriations process due to changes in U.S. national security strategy and/or priorities, fiscal constraints, including enforceable spending caps, a sequester or a lack of funding available to pay incurred obligations, or for other reasons. Further uncertainty with respect to ongoing programs could result in the U.S. government financing its operations through temporary funding measures such as “Continuing Resolutions” rather than full-year appropriations. Any loss or anticipated loss or reduction of expected funding and/or modification, curtailment or termination of one or more large programs could have a material adverse effect on our financial position, results of operations and/or cash flows.\nWe are subject to U.S. government inquiries and investigations, including periodic audits of costs that we determine are reimbursable under U.S. government contracts.\n U.S. government agencies, including the Defense Contract Audit Agency and the Defense Contract Management Agency, routinely audit government contractors. These agencies review our performance under contracts, cost structure and compliance with applicable laws, regulations and standards, as well as the adequacy of and our compliance with our internal control systems and policies. Any costs found to be misclassified or inaccurately allocated to a specific contract will be deemed non-reimbursable, and to the extent already reimbursed, must be refunded. Any inadequacies in our systems and policies could result in withholds on billed receivables, penalties and reduced future business. Furthermore, if any audit, inquiry or investigation uncovers improper or illegal activities, we could be subject to civil and criminal penalties and administrative sanctions, including termination of contracts, forfeiture of profits, suspension of payments, fines and suspension or debarment from doing business with the U.S. government. We also could suffer reputational harm if allegations of impropriety were made against us, even if such allegations are later determined to be false.\nWe enter into fixed-price contracts, which could subject us to losses if we have cost overruns. \nOur BDS and BGS defense businesses generated approximately 54% and 63% of their 2024 revenues from fixed-price contracts. Fixed-price development contracts subject us to the risk of reduced margins or incurring losses if we are unable to achieve estimated costs and revenues. If our estimated costs exceed our estimated price, we recognize reach-forward losses which can significantly affect our reported results. For example, during the year ended December 31, 2024, BDS recorded $5.0 billion of \n13\nTable of Contents\nadditional losses on its five most significant fixed-price development programs (KC-46A Tanker, T-7A Red Hawk, Commercial Crew, VC-25B Presidential Aircraft, and MQ-25). We continue to experience production disruptions and inefficiencies due to technical challenges, supplier disruption and factory performance. These factors have contributed to significant earnings charges on a number of fixed-price development programs which are expected to adversely affect cash flows in future periods, and may result in future earnings charges and adverse cash flow effects. Higher supplier pricing, the IAM 751 work stoppage, higher labor costs and an inexperienced workforce also contributed to earnings charges and lower earnings in 2024. New programs could also have risk for reach-forward loss upon contract award and during the period of contract performance. The long-term nature of many of our contracts makes the process of estimating costs and revenues on fixed-price contracts inherently risky. Fixed-price contracts often contain price incentives and penalties tied to performance, which can be difficult to estimate and have significant impacts on margins. In addition, some of our contracts have specific provisions relating to cost, schedule and performance.\nEstimating costs to complete fixed-price development contracts is generally subject to more uncertainty than fixed-price production contracts. Many of these development programs have highly complex designs and technical challenges. In addition, technical or quality issues could lead to schedule delays and cost impacts, which could increase our estimated cost to perform the work or reduce our estimated price, either of which could result in a material charge or otherwise adversely affect our financial condition. \nWe enter into cost-type contracts, which also carry risks.\nOur BDS and BGS defense businesses generated approximately 46% and 37% of their 2024 revenues from cost-type contracting arrangements. Some of these are development programs that have complex design and technical challenges. These cost-type programs typically have award or incentive fees that are subject to uncertainty and may be earned over extended periods. In these cases the associated financial risks are primarily reduced award or incentive fees, lower profit rates or program cancellation if cost, schedule or technical performance issues arise. Examples of programs with cost-type contracts include Ground-based Midcourse Defense, Proprietary and Space Launch System programs.\nWe enter into contracts that include in-orbit incentive payments that subject us to risks.\nContracts in the commercial satellite industry and certain government satellite contracts include in-orbit incentive payments. These in-orbit payments may be paid over time after final satellite acceptance or paid in full prior to final satellite acceptance. In both cases, the in-orbit incentive payment is at risk if the satellite does not perform to specifications for up to 15 years after acceptance. The net present value of in-orbit incentive fees we ultimately expect to realize is recognized as revenue in the construction period. If the satellite fails to meet contractual performance criteria, customers will not be obligated to continue making in-orbit payments and/or we may be required to provide refunds to the customer and incur significant charges.\nRisks Related to Technology, Security and Business Disruptions\nManaging a complex, global IT infrastructure exposes us to a variety of risks that could negatively impact our business.\nOur company runs on a complex global technology infrastructure consisting of millions of physical and digital systems dispersed around the world and managed by different parts of the business. This decentralized model exposes us to a variety of risks. For example, integrating and maintaining interoperability across numerous, geographically dispersed systems may result in inefficiencies, increased costs, and operational disruptions. Further, ineffective monitoring or inconsistent policies across systems may result in errors, fraud, or noncompliance with regulatory requirements. Decentralized systems also may increase the risk of unauthorized access, data breaches, or \n14\nTable of Contents\nnoncompliance with data privacy laws and other regulatory requirements governing the handling and control of sensitive data.\nCompromised or unauthorized access of our, our customers’ and/or our suppliers’ systems or data could negatively impact our business.\nWe face various cybersecurity threats, including attempts to gain unauthorized access to our systems and networks, denial-of-service attacks, threats to our information technology infrastructure, ransomware and phishing attacks, and attempts to gain unauthorized access to our company-, customer- and employee-sensitive information. These threats come from a variety of actors some of which are highly organized and sophisticated such as nation-state actors and criminal enterprises. In addition, the techniques used in cyberattacks evolve rapidly, including from emerging technologies, such as advanced forms of automation and artificial intelligence. As cyber threats increase in volume and sophistication, the risk to the security of these systems and networks – and to the confidentiality, integrity, and availability of the data they house – continues to evolve, requiring constant vigilance and concerted, company-wide risk management efforts.\nA cyber-related attack or security breach, whether experienced directly or through our supply chain or third party-service providers, could, among other serious consequences, result in loss of intellectual property; allow unauthorized access to or cause the publication of various categories of sensitive, proprietary or customer data; cause disruption or degradation of our business operations; compromise our products or services; and/or result in reputational harm. There is no guarantee that our controls, policy enforcement mechanisms, monitoring systems or contractual arrangements will be sufficient to prevent or mitigate the risk of cyber-related attack or incident, or allow us to detect, report or respond adequately in a timely manner.\nWe have experienced, and may in the future experience, whether directly or through our supply chain, third-party service providers or other channels, cyber-related incidents. While prior cyber-related attacks and incidents (including those at our wholly-owned subsidiaries Boeing Distribution, Inc. in 2023 and Jeppesen, Inc. in 2022) have not materially affected our business strategy, results of operations or financial condition, there is no guarantee that a future cyber-related attack or incident would not result in significant operational, regulatory, or financial impacts that could materially affect our business strategy, results of operations or financial condition. \nIn addition, we manage information and information technology systems for certain customers and suppliers. Many of these customers and suppliers face similar security threats. If we were unable to protect against the unauthorized access, release or corruption of our customers’ or suppliers’ confidential, classified or personally identifiable information, we could suffer a loss of business, face regulatory actions or face financial or other losses that could materially affect our business strategy, results of operations or financial condition.\nBusiness disruptions could seriously affect our future sales and financial condition or increase our costs and expenses.\nOur business may be impacted by disruptions including threats to physical security or our information technology systems, extreme weather (including effects of climate change) or other acts of nature, and pandemics or other public health crises. Any of these disruptions could affect our internal operations or our suppliers’ operations and delay delivery of products and services to our customers. Any significant production delays, or any destruction, manipulation or improper use of Boeing’s or our suppliers’ data, information systems or networks could impact our sales, increase our expenses and/or have an adverse effect on the reputation of Boeing and of our products and services.\n15\nTable of Contents\nRisks Related to Legal and Regulatory Matters\nThe outcome of litigation and of government inquiries and investigations involving our business is unpredictable, and an adverse decision in any such matter could have a material effect on our financial position and results of operations.\nWe are involved in a number of litigation matters. These matters divert financial and management resources that would otherwise be used to benefit our operations. No assurances can be given that the results of these matters will be favorable to us. An adverse resolution of any of these lawsuits, or future lawsuits, could have a material impact on our financial position and results of operations. In addition, we are subject to extensive regulation under the laws of the United States and its various states, as well as other jurisdictions in which we operate and/or market our products. As a result, we are subject to government inquiries and investigations due, among other things, to our business relationships with the U.S. government, the heavily regulated nature of our industry, accidents involving our products and in the case of environmental proceedings, our current or past ownership of certain property. Any such inquiry or investigation could result in an adverse ruling against us, which could have a material impact on our financial position, results of operations and/or cash flows. For additional information about legal proceedings, investigations and inquiries, see Note 22 to our Consolidated Financial Statements.\nOur operations expose us to the risk of material environmental liabilities.\nWe are subject to various U.S. federal, state, local and non-U.S. laws and regulations related to environmental protection, including the utilization, discharge, treatment, storage, disposal and remediation of pollutants, hazardous substances and wastes. We could incur substantial costs, including cleanup costs, fines and civil or criminal sanctions, as well as third-party claims for property damage or personal injury, if we were to violate or become liable under environmental laws or regulations. In some cases, we are subject to such costs due to environmental impacts attributable to our current or past manufacturing operations or the operations of companies we have acquired. In other cases, we are subject to such costs due to an indemnification agreement between us and a third party relating to such environmental liabilities. In all cases, our current liabilities and ongoing cost assessments are based on current laws and regulations. New laws and regulations, more stringent enforcement of existing laws and regulations, the discovery of previously unknown contamination or the imposition of new remediation requirements could result in additional costs. For additional information relating to environmental contingencies, see Note 14 to our Consolidated Financial Statements.\nWe may be adversely affected by global climate change or by legal, regulatory or market responses to such change. \nIncreasing stakeholder environmental, social and governance (ESG) expectations, physical and transition risks associated with climate change, emerging ESG regulation, contractual requirements, and policy requirements may pose risk to our market outlook, brand and reputation, financial outlook, cost of capital, global supply chain and production continuity, which may impact our ability to achieve long-term business objectives. Changes in environmental and climate change laws or regulations could lead to additional operational restrictions and compliance requirements upon us or our products, require new or additional investments in production systems or product designs, result in additional carbon offset investments or otherwise negatively impact our business and/or competitive position. Increasingly stringent aircraft performance standards and requirements including but not limited to manufacturing and product air pollutant emissions, potential carbon pricing mechanisms, and sustainability disclosure requirements in the U.S. and other jurisdictions may result in increased costs or reputational risks and could limit our ability to manufacture and/or market certain of our products at acceptable costs, or at all. For example, certain jurisdictions including the State of California and the European Union have enacted legislation which require more stringent greenhouse gas emissions and climate risk reporting. Physical impacts of climate change, increasing global chemical restrictions and bans, and water and \n16\nTable of Contents\nwaste requirements may drive increased costs to us and our suppliers and impact our production continuity and data facilities.\nFrom time to time, in alignment with our sustainability priorities, we establish and publicly announce goals and commitments to improve our environmental performance, within our products and/or operations. If we fail to achieve or inadequately report our progress toward achieving such goals and commitments, the resulting negative publicity could adversely affect our reputation and/or our access to capital.\nRisks Related to Financing and Liquidity\nWe may be unable to effectively manage our liquidity, which could adversely affect our business, financial position and results of operations.\nWe depend, in part, on our ability to successfully access the capital and financial markets to fund our operations and contractual commitments. Net cash used by operating activities for the year ended December 31, 2024 was $12.1 billion and we expect negative operating cash flows to continue in future quarters as we work to ramp up commercial airplanes production. As of December 31, 2024, our debt totaled $53.9 billion, of which approximately $13.6 billion of principal payments on outstanding debt are scheduled to become due over the next three years, and our airplane financing commitments totaled $17.1 billion. In addition, we will assume Spirit’s net debt upon the closing of our acquisition of Spirit, which is expected to occur later this year. We also expect to require up to $345 million of cash per year for the payment of dividends on the outstanding shares of our 6.00% Series A Mandatory Convertible Preferred Stock (Mandatory convertible preferred stock), through the mandatory conversion date of October 15, 2027. Dividends accumulate at a rate per annum equal to 6.00% on the liquidation preference thereof, which is $1,000.00 per share, payable when, as and if declared by our Board of Directors. The dividends, if declared, can be paid in cash, or subject to certain limitations, in shares of our common stock, or a combination of both. Any unpaid dividends will continue to accumulate. If dividends have not been declared and paid for six or more dividend periods, whether or not for consecutive dividend periods, the holders of such shares of Mandatory convertible preferred stock, will be entitled at our next annual or special meeting of shareholders to vote for the election of two additional members of our Board of Directors, subject to certain limitations. If we require additional capital to support our operations, pay off existing debt, address impacts to our business related to market developments, fund dividend payments or outstanding financing commitments or meet other business requirements, we may need to refinance or restructure our debt, reduce or delay capital investments, or issue equity, equity-linked or debt securities, and these activities could have terms that are unfavorable or could be dilutive. If we are unable to access the capital or financial markets at competitive rates, on terms acceptable to us or in sufficient amounts, or if we experience an increase in our borrowing costs or otherwise fail to manage our liquidity effectively, our business, financial position and results of operations would be adversely affected.\nWe have in the past experienced and could in the future experience further downgrades in our credit ratings. Any such downgrades, as well as other factors including disruptions or declines in the global capital markets, a decline in our financial performance or outlook, a delay in our ability to ramp up production and deliveries, and changes in demand for our products and services, could increase the cost of borrowing, jeopardize our ability to incur debt on terms acceptable to us, and negatively impact our access to the capital and financial markets and our ability to fund our operations and commitments. We cannot be assured that we will be able to maintain an investment grade rating, and any additional actual or anticipated changes or downgrades in our credit ratings, including any announcement that our ratings are under further review for a downgrade, may impact us in a similar manner and have a negative impact on our liquidity, financial position, and access to the capital or financial markets.\n17\nTable of Contents\nSubstantial pension and other postretirement benefit obligations have a material impact on our earnings, shareholders’ equity and cash flows from operations, and could have significant adverse impacts in future periods.\nMany of our employees have earned benefits under defined benefit pension plans. Potential pension contributions include both mandatory amounts required under the Employee Retirement Income Security Act and discretionary contributions to improve the plans' funded status. The extent of future contributions depends heavily on market factors such as the discount rate and the actual return on plan assets. We estimate future contributions to these plans using assumptions with respect to these and other items. Changes to those assumptions could have a significant effect on future contributions as well as on our annual pension costs and/or result in a significant change to shareholders' equity. For U.S. government contracts, we allocate pension costs to individual contracts based on U.S. Cost Accounting Standards (CAS), which can also affect contract profitability. We also provide other postretirement benefits to certain of our employees, consisting principally of health care coverage for eligible retirees and qualifying dependents. Our estimates of future costs associated with these benefits are also subject to assumptions, including estimates of the level of medical cost increases. For a discussion regarding how our financial statements can be affected by pension and other postretirement plan accounting policies, see “Management's Discussion and Analysis of Financial Condition and Results of Operations – Critical Accounting Estimates – Pension Plans” on page 51 of this Form 10-K. Although under Generally Accepted Accounting Principles in the United States of America (GAAP) the timing of periodic pension and other postretirement benefit expense and plan contributions are not directly related, the key economic factors that affect GAAP expense would also likely affect the amount of cash or stock we would contribute to our plans.\nOur insurance coverage may be inadequate to cover all significant risk exposures.\nWe are exposed to liabilities that are unique to the products and services we provide. We maintain insurance for certain risks and, in some circumstances, we may receive indemnification from the U.S. government. The amount of our insurance coverage may not cover all claims or liabilities, and we may be forced to bear substantial costs. For example, liabilities arising from the use of certain of our products, such as aircraft technologies, space systems, spacecraft, satellites, missile systems, weapons, cybersecurity, border security systems, anti-terrorism technologies and/or air traffic management systems may not be insurable on commercially reasonable terms. While some of these products are shielded from liability within the U.S. under the SAFETY Act provisions of the 2002 Homeland Security Act, no such protection is available outside the U.S., potentially resulting in significant liabilities. The amount of insurance coverage we maintain may be inadequate to cover these or other claims or liabilities. \nA significant portion of our customer financing portfolio is concentrated among certain customers and in certain types of Boeing aircraft, which exposes us to concentration risks.\nA significant portion of our customer financing portfolio, which is comprised of financing receivables and operating lease equipment, is concentrated among certain customers and in distinct geographic regions. Our portfolio is also concentrated by varying degrees across Boeing aircraft product types, most notably 717 aircraft, and among customers that we believe have less than investment-grade credit. If one or more customers holding a significant portion of our portfolio assets experiences financial difficulties or otherwise defaults on or does not renew its leases with us at their expiration, and we are unable to redeploy the aircraft on reasonable terms, our financial position, results of operations and/or cash flows could be materially adversely affected.\n18\nTable of Contents\nThe issuance of common stock upon the closing of the Spirit acquisition and upon conversion of our Mandatory convertible preferred stock, and the possibility of the sale or issuance of our common stock in the future, could cause dilution to the interests of our existing shareholders.\nOn the terms and subject to the conditions set forth in the Merger Agreement, each share of Spirit common stock will be exchanged for a number of shares of our common stock equal to an exchange ratio between 0.18 and 0.25, calculated as $37.25 divided by the volume weighted average share price of our shares over the 15-trading-day period ending on the second trading day prior to the closing (subject to a floor of $149.00 per share and a ceiling of $206.94 per share). In addition, unless earlier converted, each outstanding share of Mandatory convertible preferred stock will automatically convert for settlement on or about October 15, 2027, into between 5.8280 and 6.9940 shares of common stock, subject to customary anti-dilution adjustments. At any time prior to October 15, 2027, a holder of Mandatory convertible preferred stock may convert one share of such stock into a number of shares of common stock equal to the minimum conversion rate of 5.8280, subject to certain anti-dilution and other adjustments. In addition, a substantial number of shares of our common stock is reserved for issuance upon the exercise or settlement of equity awards. Collectively, these issuances or potential future issuances of common stock could be significant and will dilute the interests of our existing shareholders.\nOur common stock ranks junior to the Mandatory convertible preferred stock with respect to dividends and amounts payable in the event of our liquidation, dissolution or winding-up of our affairs.\nOur common stock ranks junior to the Mandatory convertible preferred stock with respect to the payment of dividends and amounts payable in the event of our liquidation, dissolution or winding-up of our affairs. This means that, unless accumulated dividends have been paid or set aside for payment on all the outstanding Mandatory convertible preferred stock through the most recently completed dividend period, no dividends may be declared or paid on our common stock subject to limited exceptions. Likewise, in the event of our voluntary or involuntary liquidation, dissolution or winding-up of our affairs, no distribution of our assets may be made to holders of our common stock until we have paid to holders of the Mandatory convertible preferred stock a liquidation preference equal to $1,000.00 per share plus accumulated and unpaid dividends.",
    "item1b": "Item 1B. Unresolved Staff Comments\nNone.",
    "item1c": "Item 1C. Cybersecurity\nRisk Management and Strategy\nOur cybersecurity strategy prioritizes detection, analysis and response to known, anticipated or unexpected threats; effective management of security risks; and resiliency against incidents. \nOur cybersecurity risk management processes include technical security controls, policy enforcement mechanisms, monitoring systems, employee training, contractual arrangements, tools and related services from third-party providers, and management oversight to assess, identify and manage material risks from cybersecurity threats.\n We implement risk-based controls to protect our information, the information of our customers, suppliers, and other third parties, our information systems, our business operations, and our products and related services. We have adopted security-control principles based on the National Institute of Standards and Technology (NIST) Cybersecurity Framework, other industry-recognized standards, and contractual requirements, as applicable. We also leverage government partnerships, industry and government associations, third-party benchmarking, the results from regular internal and third-party audits, threat intelligence feeds, and other similar resources to inform our cybersecurity processes and allocate resources.\n19\nTable of Contents\nWe maintain security programs that include physical, administrative and technical safeguards, and we maintain plans and procedures whose objective is to help us prevent and timely and effectively respond to cybersecurity threats or incidents. Through our cybersecurity risk management process, we continuously monitor cybersecurity vulnerabilities and potential attack vectors to company systems as well as our aerospace products and services, and we evaluate the potential operational and financial effects of any threat and of cybersecurity countermeasures made to defend against such threats. We continue to integrate our cyber practice into our Enterprise Risk Management program and our Compliance Risk Management program, both of which are overseen by our Board of Directors and provide central, standardized frameworks for identifying and tracking cyber-related business and compliance risks across the Company. Risks from cybersecurity threats to our products and services are also overseen by our Board of Directors. \nIn addition, we periodically engage \nthird-party consultants\n to assist us in assessing, enhancing, implementing, and monitoring our cybersecurity risk management programs and responding to any incidents.\n \nAs part of our cybersecurity risk management process, we conduct “tabletop” exercises during which we simulate cybersecurity incidents to ensure that we are prepared to respond to such an incident and to highlight any areas for potential improvement in our cyber incident preparedness. In addition, all employees are required to complete a mandatory cybersecurity training course on an annual basis and receive monthly phishing simulations to provide “experiential learning” on how to recognize phishing attempts.\nWe have established a cybersecurity supply chain risk management program, which is a cross-functional program that forms part of our Enterprise Risk Management program and is supported by our security, compliance, and supply chain organizations. Through this evolving program, we assess the risks from cybersecurity threats that impact select suppliers and third-party service providers with whom we share personal identifying and confidential information. We continue to evolve our oversight processes to mature how we identify and manage cybersecurity risks associated with the products or services we procure from such suppliers. We generally require our suppliers to adopt security-control principles based on industry-recognized standards.\nWe have experienced, and may in the future experience, whether directly or through our supply chain or other channels, cybersecurity incidents. While prior incidents have not materially affected our business strategy, results of operations or financial condition, and although our processes are designed to help prevent, detect, respond to, and mitigate the impact of such incidents, there is no guarantee that a future cyber incident would not materially affect our business strategy, results of operations or financial condition.\n See “Risks Related to Technology, Security and Business Disruptions” in “Risk Factors” on pages 14 - 15 of this Form 10-K.\n \nGovernance\nOur Board of Directors has overall responsibility for risk oversight, with its committees assisting the Board in performing this function based on their respective areas of expertise. Our Board of Directors has delegated oversight of risks related to cybersecurity to two Board committees, the Audit Committee and the Aerospace Safety Committee, and each committee reports on its activities and findings to the full Board after each meeting. The Audit Committee is charged with reviewing our cybersecurity processes for assessing key strategic, operational, and compliance risks. \nOur Chief Information Digital Officer and Senior Vice President, Information Technology & Data Analytics (CIDO) and our Chief Security Officer (CSO) provide presentations to the Audit Committee on cybersecurity risks at each of its bimonthly meetings. These briefings include assessments of cyber risks, the threat landscape, updates on incidents, and reports on our investments in cybersecurity risk mitigation and governance. In addition, the Audit Committee has designated one of its members with expertise in cyber risk management to meet regularly with management and review our cybersecurity strategy and key initiatives and progress toward our objectives. In the event of a potentially material cybersecurity event, \n20\nTable of Contents\nthe Chair of the Audit Committee is notified and briefed, and meetings of the Audit Committee and/or full Board of Directors would be held, as appropriate. The Aerospace Safety Committee provides oversight of the risks from cybersecurity threats related to our aerospace products and services. The Aerospace Safety Committee receives regular updates and reports from senior management, including the Chief Engineer, the Chief Aerospace Safety Officer, and the Chief Product Security Engineer, who provide briefings on significant cybersecurity threats or incidents that may pose a risk to the safe operation of our aerospace products. Both committees brief the full Board on cybersecurity matters discussed during committee meetings\n, and the \nCIDO provides annual briefings to the Board on information technology and data analytics related matters, including cybersecurity.\nAt the management level, we have established a \nGlobal Security Governance Council\n (the Council) to further strengthen our cybersecurity risk management activities across the Company, including the prevention, detection, mitigation, and remediation of cybersecurity incidents. The Council is responsible for developing and coordinating enterprise cybersecurity policy and strategy, and for providing guidance to key management and oversight bodies.\n \nTrent Cox, Vice President of Product and Business Operations, is serving as our interim CSO. In that role, he chairs the Council and is responsible for overseeing a unified security program that provides cybersecurity, fire and protection operations, physical security, insider threat, and classified security. \nMr. Cox has over 25 years of experience in the aerospace and defense industry, including, prior to joining Boeing in 2024, Chief Information Officer of Raytheon UK, Deputy CIO and Executive Director of Collins Aerospace and Raytheon Intelligence and Space, and Executive Director for Program Execution for the Raytheon Missile Systems businesses. He reports directly to the CIDO and meets regularly with other members of senior management and the Audit Committee. \nThe Council also includes, among other senior executives, our CIDO, Chief Engineer, Chief Information Officer, Chief Aerospace Safety Officer and Chief Product Security Engineer, who each have several decades of business and senior leadership experience managing risks in their respective fields, collectively covering all aspects of cybersecurity, data and analytics, product security engineering, enterprise engineering, safety and the technical integrity of our products and services.\n \nThe Council meets monthly and updates key members of the Company’s Executive Council on progress towards specific cybersecurity objectives. A strong partnership exists between Information Technology, Enterprise Security, Corporate Audit, and Law so that identified issues are addressed in a timely manner and incidents are reported to the appropriate regulatory bodies as required."
  }
}