{
  "ticker": "BALL",
  "cik": "0000009389",
  "company_name": "BALL Corp",
  "filing_date": "2025-02-20",
  "accession": "0001558370-25-001190",
  "primary_doc": "ball-20241231x10k.htm",
  "item_sections": {
    "item1": "Item 16\n.\nForm 10-K Summary\n101\n​\nSignatures\n102\n​\n​\n​\n​\n​\n\n\nTable of Contents\nPART I\n.\n​\nItem 1. Business\n​\nBall Corporation and its consolidated subsidiaries (collectively, Ball, the company, we or our) is one of the world’s leading suppliers of aluminum packaging for the beverage, personal care and household products industries. The company was organized in 1880 and incorporated in the state of Indiana, United States of America (U.S.), in 1922. Our sustainable, aluminum packaging products are produced for a variety of end uses and are manufactured in facilities around the world. In 2024, our total consolidated net sales were $11.80 billion. In the third quarter of 2023, Ball entered into a Stock Purchase Agreement (Agreement) with BAE Systems, Inc. (BAE) and, for the limited purposes set forth therein, BAE Systems plc, to sell all outstanding equity interests in Ball’s aerospace business to BAE. On February 16, 2024, the company completed the divestiture of the aerospace business. See \nNote 4\n \nfor further details.\n​\nOur largest product line is aluminum beverage containers and we also produce extruded aluminum aerosol containers, recloseable aluminum bottles across multiple consumer categories, aluminum slugs and aluminum cups. At December 31, 2024, the assets and liabilities of the aluminum cups operating segment are presented as current assets held for sale and current liabilities held for sale on the consolidated balance sheet. See \nNote 4\n \nfor further details.  \n​\nWe sell our aluminum packaging products globally to large multinational beverage, personal care and household products companies with which we have developed long-term relationships. This is evidenced by our high customer retention and large number of long-term supply contracts. While we have a diversified customer base, we sell a significant portion of our packaging products to major companies and brands, as well as to numerous regional customers. Our significant customers include top consumer packaging and beverage companies.\n​\nWe are headquartered in Westminster, Colorado, and our stock is listed for trading on the New York Stock Exchange under the ticker symbol BALL.\n​\nOur Strategy\n​\nWe exist to unlock the infinite potential of aluminum to advance a world free from waste. By leveraging our competitive advantages of bringing our scale to sustainability, the power of our partnerships and the unmatched talent of our people we will deliver on our promise of We Care…  We Work… We Win… \n​\nWe maintain a clear and disciplined financial strategy focused on executing an efficient operating model to deliver comparable diluted earnings per share growth in excess of 10 percent per annum over the long-term, maximize cash flow, increase Economic Value Added (EVA®) dollars and return value to shareholders. \n​\nThe cash generated by our businesses is used primarily: (1) to finance the company’s operations, (2) to service the company’s debt, (3) to return value to our shareholders via stock buybacks and dividend payments, and (4) to fund organic or inorganic growth investments. From time to time, we have evaluated and expect to continue to evaluate possible transactions that we believe will benefit the company and our shareholders, which may include strategic acquisitions, divestitures of parts of our company or equity investments. At any time, we may be engaged in discussions or negotiations at various stages of development with respect to one or more possible transactions or may have entered into non-binding letters of intent. As part of any such initiatives, we may participate in processes being run by other companies or leading our own activities. The compensation of many of our employees is tied to the company’s performance through our EVA®-based incentive programs.\n​\nSustainability \n​\nAt Ball Corporation, we deliver circular aluminum packaging solutions and exist to unlock the infinite potential of aluminum to advance a world free from waste. \n​\nOur approach to sustainability has evolved over the past 20 years. Today, Ball’s sustainability strategy is driven by high standards around carbon footprint reduction and the circularity of our products. Utilizing strategic partnerships across our value chain, we work to simplify sustainability for our customers by delivering scalable solutions that enable us to win together. This includes aligning our own 2030 Sustainability Goals and strategy to our customers’ climate-related targets, sustainability goals and regulatory requirements. \n​\n4\n\n\nTable of Contents\nWe focus our sustainability efforts on environmental, social and governance impacts. Our vision is to advance sustainability through aluminum packaging. This is exhibited through our commitment to achieve a science-based 55 percent reduction in our greenhouse gas (GHG) footprint by 2030 and net zero carbon emissions prior to 2050. In addition, Ball is committed to hiring, training and retaining a highly qualified and high-performing employee population to work in our manufacturing facilities and offices, and we do so with the intention of having a skilled and engaged workforce.\n​\nOur innovation and manufacturing teams around the world focus on continuously driving operational excellence in support of Ball’s resource efficiency goals. This drives process optimization, including products designed for optimum metal efficiency, real time monitoring to improve energy efficiency and reuse of water, as well as the reduction of waste and spoilage within our manufacturing plants. Our commitment extends beyond our walls and includes purchasing aluminum from Aluminum Stewardship Initiative (ASI) certified sustainable sources and reducing value chain emissions, all in order to facilitate the achievement of Ball and its customers’ sustainability targets.\n​\nToday’s consumers are increasingly choosing brands based on their sustainability credentials. Ball customers understand this growing priority and their unique position in impacting the environment, especially through the packaging materials they use. In addition, with growing packaging design regulations around the world, aluminum cans are well positioned to incur low compliance costs due to circularity credentials, such as favorable recycling rates and recycled content. As of 2023, Ball beverage cans contained 70 percent recycled content on average globally. Aluminum packaging unlocks the full potential of packaging to help customers convey their purpose to consumers, while limiting regulatory exposure. We are committed to moving toward a truly circular economy, where materials can be, and actually are, used again and again.\n​\nAluminum cans, bottles and cups are an attractive option for sustainability-conscious brands with commitments to real world recyclability and increasing their usage of recycled materials in consumer packaging. Aluminum containers are designed to be recycled without losing quality and retain a high economic value, pushing aluminum collection, sorting and recycling rates to the highest of any beverage packaging material. That is why 75 percent of all aluminum ever produced is still in use today. \n​\nAt a global 71 percent recycling rate with low yield losses and high product-to-product recycling loops, aluminum beverage packaging is the leader not only in recycling, but in circularity. Because recycling aluminum saves resources and uses significantly less energy than primary aluminum production, we are innovating and collaborating with our customers, supply chain, industry groups and other public and private partners to establish and financially support initiatives to increase recycling rates around the world. We work together to create effective collection and recycling systems, and educate consumers about the sustainability and circularity benefits of aluminum packaging. \n​\nAt Ball, we believe our people and our culture enable our success and make it possible for us to deliver on our promises to customers, investors, communities and all of our stakeholders. We are working hard to create a culture and environment in which zero injuries become the reality, so everyone working for or within Ball gets home safe and healthy to their families and friends every day. We continue to invest in hiring, training and retaining our employees at every level across the organization to ensure we have the right people with the right skills in the right roles, and are providing them with opportunities to advance their careers. This includes a global Belonging, Inclusion and Diversity (BI&D) strategy, which ensures we have a sustainable workforce, and foster a safe and inclusive work environment where everyone feels they belong and are valued for their differences and contributions. A focus on BI&D among individuals and teams helps to unleash ideas and fuel innovation, driving growth and economic value throughout our global organization.\n​\nA healthy and sustainable business also depends on thriving communities. Ball’s commitment to the communities where we live and operate is an integral part of our corporate culture, as we continue to support organizations, programs and civic initiatives that advance sustainable livelihoods. Community engagement is how our company and our employees enrich the places where we live and work beyond providing jobs, benefits and paying local taxes. Through the Ball Foundation, corporate giving, employee giving and volunteerism, we invest in the future of the communities that sustain us. Each year Ball and its employees donate, volunteer and support non-profit organizations centered on building sustainable communities through recycling, education, and disaster preparedness and relief initiatives.\n​\nThe company’s focus towards sustainability has been recognized by external organizations. For the seventh year in a row, Ball received an A- score in CDP’s climate change program. In addition, Ball earned a MSCI AAA ESG rating, \n5\n\n\nTable of Contents\nreceived a Gold Medal in recognition of overall sustainability achievements through EcoVadis and was recognized as one of America’s Most Responsible Companies by Newsweek.\n​\nHuman Capital and Employees \n​\nBall Corporation’s people are its greatest asset and we are proud to outline the material aspects of our human capital program. At the end of 2024, the company and its subsidiaries employed approximately 16,000 employees, including approximately 5,000 employees in the U.S. Details of collective bargaining agreements are included within",
    "item1a": "Item 1A, Risk Factors – Technological Risks, for additional details on cybersecurity risks that could potentially materially affect the company, including its business strategy, results of operations, financial condition and reputation. \nTo date, we have not identified any cybersecurity incidents that have affected, or are reasonably likely to affect, our business, operations, or financial condition.\n​\nGovernance\n​\nBall’s Chief Information Security Director (CISD) reports to the Senior Vice President and Chief Information Officer (CIO) and leads the company’s cybersecurity team. \nThe CISD is responsible for overseeing cybersecurity\n, including assessing and managing cybersecurity risk, and together with the \nCIO, providing comprehensive briefings to the executive leadership team with respect to the cybersecurity program and emerging or potential cybersecurity risks\n. The cybersecurity team has extensive experience selecting, deploying, and operating cybersecurity technologies, strategies and processes, and couples this knowledge with the use of external experts to protect the company from cyber threats. In the event of a cyber incident, our cross-functional response team will enact our incident response plan, and notify appropriate levels of management, including the executive leadership team, disclosure committee, and Board of Directors, as appropriate.\n​\nOur Board of Directors oversees our company’s cybersecurity and information technology strategies.\n \nAnnually, the CIO briefs the Board of Directors on the company’s cybersecurity posture and the \neffectiveness\n of its risk management strategies\n.\n​\n​",
    "item1b": "Item 1B. Unresolved Staff Comments\n​\nThere were no matters required to be reported under this item.\n​",
    "item1c": "Item 1C. Cybersecurit\ny\n​\nRisk management and strategy\n​\nBall Corporation is committed to maintaining a strong cybersecurity posture. \nWe have a dedicated, globally distributed information security team that is responsible for leading information security strategy, standards and processes, which\n are integrated \ninto our comprehensive enterprise risk management process, including processes related to cybersecurity risks.\n​\nThe company employs a standards-based cybersecurity program aligned to the National Institute of Standards and Technology (NIST) Cybersecurity Framework (CSF), including ongoing assessment and continuous improvement to address the rapidly evolving threat landscape. Ball partners closely with a strong network of external partners, including conducting annual assessments of the cyber risk management program against the NIST CSF.\n​\nOur information security team has established and implemented formal processes and policies to assess, identify, and manage risks arising from cybersecurity threats, including those associated with our internal operations and the use of third-party service providers.\n We continually refine our approach to address evolving cybersecurity regulations, identify potential and emerging security risks, and implement strategies to manage these risks. Ball has developed an incident response plan that includes a cyber incident materiality assessment with appropriate leadership governance. In addition, we have aligned our incident response plan with our enterprise risk and global crisis management processes. \n​\nIn response to the ever-evolving cyber threat landscape, Ball utilizes external experts to support continuous improvement across our cyber program, processes and operations. Our collaboration with these third-parties includes regular audits, \n18\n\n\nTable of Contents\nthreat assessments, and consultation on cyber enhancements. In addition, we also augment and extend our cyber team using a select \nfew trusted third-party\n partners that are integrated as members of our global operations. This provides us with expanded global threat intel and enhances our ability to deliver continuous global cyber operations 24/7.\n​\nWe are aware that there are potential cybersecurity risks associated with third-party service providers. Prior to engaging with third-party providers, Ball conducts thorough security assessments. We monitor for third-party cyber incidents and manage any third-party cyber incidents under our incident response plan and processes. Our oversight of third-party cyber risk aids our ability to lessen and mitigate impacts related to data breaches and other security incidents originating from third-parties.\n​\nBall faces risks from cybersecurity threats that could have a material adverse effect on the company, including its business strategy, results of operations, financial condition and reputation. Refer to"
  }
}