{
  "ticker": "BBY",
  "cik": "0000764478",
  "company_name": "BEST BUY CO INC",
  "filing_date": "2025-03-19",
  "accession": "0000764478-25-000007",
  "primary_doc": "bby-20250201x10k.htm",
  "item_sections": {
    "item1": "Item 16.\nForm 10-K Summary.\n66\n \nSignatures\n.\n67\n \n‎\n \n\n\n3\n\n\nPART I\n \nItem 1. Business.\n \nUnless the context otherwise requires, the terms “we,” “us,” “our” and the “company” in this Annual Report on Form 10-K refer to Best Buy Co., Inc. and, as applicable, its consolidated subsidiaries. Any references to our website addresses do not constitute incorporation by reference of the information contained on the websites.\n \nDescription of Business\n \nWe were incorporated in the state of Minnesota in 1966. \nWe are driven by our purpose to enrich lives through technology and our vision to personalize and humanize technology solutions for every stage of life. \nWe accomplish this by leveraging our unique combination of tech expertise and a human touch to meet our customers’ everyday needs, whether they come to us online, visit our stores or invite us into their homes. We have operations in the U.S. and Canada.\n \nSegments and Geographic Areas\n \nWe have two reportable segments: Domestic and International. The Domestic segment is comprised of our operations in all states, districts and territories of the U.S. and our Best Buy Health business, and includes the brand names Best Buy, Best Buy Ads, Best Buy Business, Best Buy Essentials, Best Buy Health, Current Health, Geek Squad, Imagine That, Insignia, Lively, My Best Buy, My Best Buy Memberships, Pacific Kitchen and Home, TechLiquidators and Yardbird; and the domain names bestbuy.com, currenthealth.com, lively.com, techliquidators.com and yardbird.com. Our International segment is comprised of all operations in Canada under the brand names Best Buy, Best Buy Express, Best Buy Mobile, Geek Squad and TechLiquidators and the domain names bestbuy.ca and techliquidators.ca.\n \nOperations\n \nOur Domestic and International segments are managed by leadership teams responsible for all areas of the business. Both segments operate an omnichannel platform that allows customers to come to us online, visit our stores or invite us into their homes.\n \nDevelopment of merchandise and service offerings, pricing and promotions, procurement and supply chain, online and mobile application operations, marketing and advertising and labor deployment across all channels are centrally managed. In addition, support capabilities (for example, human resources, finance, information technology and real estate management) operate primarily from our corporate headquarters. We also have field operations that support retail, services and in-home teams primarily from our corporate headquarters and regional locations. Our retail stores have procedures for inventory management, asset protection, transaction processing, customer relations, store administration, product sales and services, staff training and merchandise display that are largely standardized. All stores generally operate under standard procedures with a degree of flexibility for store management to address certain local market characteristics. While day-to-day operations of our stores are led by store management, more strategic decisions regarding, for example, store locations, format, category assortment and fulfillment strategy, are led by our corporate teams with input from market or regional leadership.\n \nOur Best Buy Health business has a dedicated leadership team that manages the day-to-day affairs of all aspects of its business, while receiving support from certain Best Buy enterprise capabilities.\n \nMerchandise and Services\n \nOur Domestic and International segments have offerings in six revenue categories. The key components of each revenue category are as follows:\n \n\nComputing and Mobile Phones\n - computing (including desktops, notebooks and peripherals), mobile phones (including related mobile network carrier commissions), networking, tablets (including e-readers) and wearables (including smartwatches);\n\nConsumer Electronics\n - digital imaging, health and fitness products, home theater (including home theater accessories, soundbars and televisions), portable audio (including headphones and portable speakers) and smart home;\n\nAppliances\n - large appliances (including dishwashers, laundry, ovens and refrigerators) and small appliances (including blenders, coffee makers, vacuums and personal care);\n\nEntertainment\n - drones, gaming (including hardware, peripherals and software), movies, toys, virtual reality and other software;\n\nServices\n - delivery, health-related services, installation, memberships, repair, set-up, technical support and warranty-related services; and\n\nOther\n - other product offerings, including baby, food and beverage and outdoor living.\n \nDistribution\n \nCustomers within our Domestic segment who purchase product online have the choice to have product delivered, or pick up product from a Best Buy store (including curbside pick-up for many products at most stores) or an alternative pick-up location. Our ship-from-store capability allows us to offer additional fast and convenient delivery options for customers. Most merchandise is shipped directly from manufacturers to our distribution centers. Distribution is similar for our International segment.\n \n\n\n4\n\n\n \nSuppliers and Inventory\n \nOur Domestic and International segments purchase merchandise from a variety of suppliers. In fiscal 2025, our 20 largest suppliers accounted for approximately 80% of the merchandise we purchased, with five suppliers – Apple, Samsung, HP, Sony and LG – representing approximately 55% of total merchandise purchased. We generally do not have long-term written contracts with our vendors that would require them to continue supplying us with merchandise or that secure any of the key terms of our arrangements.\n \nWe carefully monitor and manage our inventory levels in an effort to match quantities on hand with consumer demand as closely as possible. Key elements to our inventory management process include the following: continuous monitoring of consumer demand and product life cycles, continuous monitoring and adjustment of inventory receipt levels and pricing, agreements with vendors relating to reimbursement for the cost of markdowns or sales incentives, and agreements with vendors relating to return privileges for certain products.\n \nWe also have a global sourcing operation to design, develop, test and contract-manufacture our exclusive brands products.\n \nStore Development\n \nWe had 1,117 stores at the end of fiscal 2025 throughout our Domestic and International segments. Our stores are a vital component of our omnichannel strategy, and we believe they are an important competitive advantage. We also have vendor store-within-a-store concepts to allow closer vendor partnerships and a higher quality customer experience. We continuously look for opportunities to optimize our store space, renegotiate leases and selectively open or close locations to support our operations.\n \nIntellectual Property\n \nWe own or have the right to use valuable intellectual property such as trademarks, service marks and trade names, including, but not limited to, \nBest Buy, Best Buy Ads, Best Buy Essentials, Best Buy Express, Best Buy Health, Best Buy Marketplace, Current Health, Geek Squad, Imagine That, Insignia, Jitterbug, Lively, Magnolia, My Best Buy, My Best Buy Memberships, Pacific Kitchen and Home, Pacific Sales, Rocketfish\n, \nTechLiquidators\n, \nYardbird \nand our \nYellow Tag\n logo.\n \nWe have secured domestic and international trademark and service mark registrations for many of our brands. We have also secured patents for many of our inventions. We believe our intellectual property has significant value and is an important factor in the marketing of our company, our stores, our products and our websites.\n \nSeasonality\n \nOur business, like that of many retailers, is seasonal. A large proportion of our revenue and earnings is generated in the fiscal fourth quarter, which includes the majority of the holiday shopping season.\n \nWorking Capital\n \nWe fund our business operations through a combination of available cash and cash equivalents and cash flows generated from operations. In addition, our revolving credit facility is available for additional working capital needs, for general corporate purposes, investments and growth opportunities. Our working capital needs typically increase in the months leading up to the holiday shopping season as we purchase inventory in advance of expected sales.\n \nCompetition\n \nOur competitors are primarily multi-channel retailers, e-commerce businesses, technology service providers, traditional store-based retailers, vendors and mobile network carriers who offer their products and services directly to customers. We believe our ability to help customers online, in our stores and in their homes, and to connect technology product and solutions with customer needs, provide us key competitive advantages. Some of our competitors have lower cost operating structures and seek to compete for sales primarily on price. We carefully monitor pricing offered by other retailers and service providers, as maintaining price competitiveness is one of our ongoing priorities. In addition, we have price-matching policies that allow customers to request that we match a price offered by certain retail stores and online operators. In order to allow this, we are focused on maintaining efficient operations and leveraging the economies of scale available to us through our global vendor partnerships. We believe our dedicated and knowledgeable people; our integrated online, retail and in-home assets; our broad and curated product assortment; our strong vendor partnerships; our service and support offerings designed to solve customer needs; our unique ability to showcase technology in distinct store formats; and our supply chain are important ways in which we maintain our competitive advantage.\n \nCorporate Responsibility & Sustainability (“CR&S”)\n \nAs we pursue our purpose to enrich lives through technology, we are committed to creating shared long-term value and positively impacting the world, the environment and the communities in which we operate through interactions with our stakeholders, including our customers, employees, vendor partners, community partners and shareholders.\n \nThe Nominating, Corporate Governance and Public Policy Committee of our Board of Directors (“Board”) advises and oversees management regarding the effectiveness and risks of our CR&S strategy, programs and initiatives, including environmental goals and progress, corporate responsibility programs, initiatives and public policy positions and advocacy. \n \n\n\n5\n\n\n \nEnvironmental\n \nWe aspire to drive forward the circular economy, a system that aims to reduce waste and preserve resources. We focus on our highest-impact areas, including our operations, the energy we procure and the products we sell. These efforts contribute to mitigating climate risks, reducing potential risks to our business and generating long-term cost savings.\n \nIn our operations, we strive to reduce the use of natural resources. We believe the following focus areas help to reduce the use of natural resources and our impact on the environment while improving our efficiency and profitability:\n \n\nWe aim to reduce our carbon emissions by minimizing energy usage, advocating for a cleaner grid and sourcing renewable energy\n.\n\nWe monitor our water consumption across our business to identify and manage programs that lessen our dependence on water\n. \n\nTo reduce waste and maximize resource efficiency, we continue our efforts to build a more sustainable supply chain by focusing on certifying our supply chain locations as TRUE zero waste\n.\n \nOur focus on sustainable products centers on helping our customers reduce their impact on the environment through the products we sell. We do this by providing a variety of energy-efficient products for our customers.\n \nWe also support the circular economy by keeping consumer products in use for as long as possible through our repair and trade-in services. We put materials back into the manufacturing process when products reach the end of their lives through our electronics and appliance recycling program. In fiscal 2025, we continued to evolve our industry-leading e-waste recycling program and found additional ways to incentivize recycling.\n \nHuman Rights and Responsible Sourcing\n \nWe are committed to respecting human rights through our alignment with the United Nations Guiding Principles on Business and Human Rights.\n \nFurther, across all the products and services we procure, we seek to mitigate risk and enhance our partnership with suppliers and create value for all stakeholders through our Responsible Sourcing Program. We are active members of the Responsible Business Alliance, as are many of the major brands we sell, which allows us to partner across initiatives and increase our impact. Collectively, we embrace a common Supplier Code of Conduct and audit methodology that creates business value by improving working conditions and environmental practices throughout the supply chain.\n \nSocial Impact\n \nWe are committed to helping teens build brighter futures and increasing access to technology for the tech-reliant careers of the future. We believe our employee volunteer programs, like Geek Squad Academy, help to spark excitement and interest in technology for young learners while engaging our employees’ unique technical expertise. \n \nBest Buy also serves as a fiscal sponsor of the Best Buy Foundation™, whose signature Best Buy Teen Tech Center® program consists of a network of youth-centered community hubs where teens can engage with the latest technology, learn career skills, and interact with safe and supportive mentors. As of February 1, 2025, the Best Buy Foundation™ supported a network of 68 Best Buy Teen Tech Center\n®\n locations across the U.S. and Canada.\n \n \nHuman Capital Management \n \nWe believe in the power of our people. Our culture is built on the belief that engaged and committed employees – supported by opportunities to learn, grow, innovate and explore – can lead to extraordinary outcomes. At the end of fiscal 2025, we employed approximately 85,000 employees in the U.S. and Canada.\n \nInclusion and Belonging\n \nWe believe in an inclusive work environment with a culture of belonging where everyone feels valued, can thrive and has equal opportunities at all levels in the organization. At the core of this environment are our company values, which were founded decades ago and focus, in part, on what it means to unleash the power of our people, as individuals, so everyone can learn, grow and be the best version of themselves. We believe that creating this environment is the right thing to do and has been key to our long-term business success.\n \nOur Executive Leadership Team and Compensation and Human Resources Committee of our Board supports the development of a culture of belonging and engagement through oversight of our human resources policies and programs. The Nominating, Corporate Governance and Public Policy Committee of our Board recommends criteria for the selection of individuals to be considered as candidates for election to the Board.\n \n‎\n \n\n\n6\n\n\n \nTraining and Development\n \nWe continue to invest in our employees and build a culture focused on developing our talent. Prioritizing foundational and leadership skill development helps to meet employees where they are at, which creates a more adaptable and resilient workforce and enhances our competitive advantage. Additionally, we believe by investing in employee training and development we can create a better employee environment and increase productivity, retention and innovation that ultimately improves our overall company performance and brings value to stakeholders. With the continued goal of creating learning opportunities that are tailored to the unique work of each role and a focus on solving the most important problems in our business, we expanded our variety of training experiences in fiscal 2025. This included new learning campaigns, leadership programs and expanded side-by-side trainings to support employee growth alongside their peers and leaders in condensed training formats.\n \nExamples of enhancements in fiscal 2025 include:\n \n\nWe evolved our leadership development offerings to grow and transform Best Buy for its future. These offerings included unique programs such as an enterprise-wide manager development program, a skill development program for our senior store leaders and several emerging talent programs including an officer readiness program.\n\nWe expanded our learning campaigns, reaching thousands of employees for new products to include a closer partnership with our vendors, more exposure for our employees and in-depth training in artificial intelligence to help customers with the products they use.\n\nWe enhanced our portfolio of risk, compliance and safety microlearning courses to enable employees to continuously develop safe, secure and ethical behaviors to protect the company.\n \nEmployee Benefits\n \nOur benefits aim to support employees’ overall well-being: physical, mental, financial and work-life. We believe our ability to deliver on our purpose of enriching our customers’ lives depends on ensuring our employees are living happy and healthy lives — both while at work and outside of work. In fiscal 2025, we introduced the following benefits to our employees\n:\n \n\nA well-being sabbatical for employees with five or more years of service that provides them an opportunity to take four weeks off (once every three years) to focus on their well-being.\n\nAdditional paid time off each year in recognition of tenure for full-time employees with 20 or more years of service, plus additional tiers for part-time employees at three and six years. \n\nFive floating holidays and two fixed company holidays (Thanksgiving and Christmas Day) in place of seven fixed holidays for U.S. employees, to give flexibility for employees to celebrate what is meaningful to them.\n \nAdditionally, in fiscal 2025, we continued our focus on:\n \n\nCaregiver support, including: \no\nAccess to Joshin, a support system for employees and their loved ones with a focus on disabilities and neurodivergence;\no\nPersonalized help in a time of great need through Wellthy, a program that helps with emergency housing, healthcare, substance abuse, complex eldercare issues and other moments of crisis;\no\nPay continuation (paid leave) and caregiver pay so employees can care for themselves and their loved ones;\no\nParental leave for U.S. employees that provides eligible birth parents 100% pay for 10 weeks and eligible non-birth parents 100% pay for four weeks;\n\nUp to $2,500 in financial assistance to employees experiencing personal hardship through the HOPE Fund – Helping Our People in Emergencies – in partnership with the Richard M. Schulze Family Foundation; \n\nMental health support, including our commitment to raise awareness by equipping employees with training to notice issues in themselves or others, and then find help; and \n\nTuition assistance, including the expansion of our partnership schools that give eligible employees the opportunity to earn a degree with no out-of-pocket costs.\n \nThe Compensation and Human Resources Committee of our Board oversees risks related to our human capital management through its regular review of our practices, policies and programs, which includes overall employee wellness and engagement in these areas, employee benefit plan compliance, leadership succession planning and wage, retention and hiring programs.\n \nFor more information on CR&S matters, as well as human capital management, please see Best Buy’s Fiscal 2025 Corporate Responsibility and Sustainability Report expected to be published later this year, at https://corporate.bestbuy.com/reports-and-resources. This website and the report are not part of this Annual Report on Form 10-K and are not incorporated by reference herein.\n \n\n\n7\n\n\n \nAvailable Information\n \nWe are subject to the reporting requirements of the Exchange Act and its rules and regulations. The Exchange Act requires us to file reports, proxy statements and other information with the U.S. Securities and Exchange Commission (“SEC”). We make available, free of charge on our website, our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, proxy statements and amendments to these reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act, as soon as reasonably practicable after we electronically file these documents with, or furnish them to, the SEC. These documents are posted on our website at https://investors.bestbuy.com. The SEC also maintains a website that contains reports, proxy and information statements, and other information regarding issuers, including us, that file electronically with the SEC at https://sec.gov.\n \nWe also make available, free of charge on our website, our Amended and Restated Articles of Incorporation, Amended and Restated By-laws, the Corporate Governance Principles of our Board and our Code of Business Ethics adopted by our Board, as well as the charters of all of our Board's committees: Audit Committee; Compensation and Human Resources Committee; Finance and Investment Policy Committee; and Nominating, Corporate Governance and Public Policy Committee. These documents are posted on our website at https://investors.bestbuy.com.\n \nCopies of any of the above-referenced documents will also be made available, free of charge, upon written request to Best Buy Co., Inc. Investor Relations Department at 7601 Penn Avenue South, Richfield, MN 55423-3645.\n \nWebsite and Social Media Disclosure\n \nWe disclose information to the public concerning Best Buy, Best Buy’s products, content and services and other items through our websites in order to achieve broad, non-exclusionary distribution of information to the public. Some of the information distributed through this channel may be considered material information. Investors and others are encouraged to review the information we make public in the locations below.* This list may be updated from time to time.\n \n\nFor information concerning Best Buy and its products, content and services, please visit: https://bestbuy.com.\n\nFor information provided to the investment community, including news releases, events and presentations, and filings with the SEC, please visit: https://investors.bestbuy.com.\n\nFor the latest information from Best Buy, including press releases, please visit: https://corporate.bestbuy.com/archive/.\n \n* These corporate websites, and the contents thereof, are not incorporated by reference into this Annual Report on Form 10-K nor deemed filed with the SEC.",
    "item1a": "Item 1A, \nRisk Factors,\n of this Annual Report on Form 10-K.\n \nCybersecurity Governance\n \nOur Board, with oversight by the Audit Committee, oversees management’s processes for identifying and mitigating cybersecurity risks.\n \nExecutive management including our Chief Information Security Officer (“CISO”), who reports to our General Counsel & Chief Risk Officer, update the Audit Committee on our cybersecurity posture no less frequently than quarterly and periodically update the full Board.\n \nOur EIP organization, led by our \nCISO, is \nresponsible\n for the design and implementation of our information security program\n. \nOur current CISO has been with the Company for more than nine years—serving as our CISO for nearly eight years—and has extensive cybersecurity experience through leadership and consulting roles. His current leadership team has over 100 years of combined cybersecurity experience.\n \nThese and other EIP team members \nwork closely\n with stakeholders across the company to implement the program’s policies, standards and processes. They also help ensure awareness that securing customer information and honoring our privacy promises are core employee obligations, as highlighted in our Code of Ethics and reinforced through our Valuable Information Protection training program.\n \n\n\n18",
    "item1b": "Item 1B. Unresolved Staff Comments.\n \nNot applicable.",
    "item1c": "Item 1C. Cybersecurity.\n \nWe rely heavily on information technology systems to operate and manage all key aspects of our business. We also process substantial volumes of confidential business information and sensitive consumer and employee personal information, which if impacted by cyber threats, could result in financial and reputational harms and regulatory sanction. We have \ndeveloped\n and implemented, and update on an ongoing basis, a risk-based information security program designed to identify, assess and manage material risks from cybersecurity threats.\n \nCybersecurity Risk Management and Strategy\n \nOur information security program comprises administrative, technical and physical safeguards designed, under a risk-based approach, to reasonably mitigate cybersecurity risks to the confidentiality, integrity or availability of our information systems and information. These include safeguards designed to oversee service-provider relationships in a manner consistent with the risks presented by the engagement and use of the service provider.\n \nThe program deploys multiple layers of controls designed to identify, protect against, detect, respond to and recover from information security and cybersecurity incidents and our Cyber Security Incident Response Team, which is part of our Enterprise Information Protection (“EIP”) organization, plays a core role in detecting, mitigating and remediating cybersecurity incidents. Based on the nature and severity of the incident, our response is to be guided by documented incident response plans. These plans outline steps to be followed, functional areas to be engaged, internal escalations to be pursued (which may include, as appropriate, senior management, executive management and the Board) and stakeholders to be notified.\n \nThird parties\n also play a role in our cybersecurity. We engage third parties for advice and support in the design and implementation of certain program elements and leverage third-party tools to help identify and mitigate cybersecurity risks. Certain specific, defined components of our technology environment are assessed by \nthird-party auditors\n with a view to align with industry standards such as, for example, the Payment Card Industry Data Security Standards.\n \nWe also periodically retain outside expertise to conduct a maturity assessment of our program against industry standards and participants. Our program is informed by industry standards such as, for example, the National Institute of Standards and Technology’s Cybersecurity Framework (“NIST CSF”), but this does not imply that we meet all technical standards, specifications or requirements under the NIST CSF, NIST CSF 2.0 or other sources.\n \nWe have combatted cybersecurity threats in the normal course of business, but prior cybersecurity incidents have not materially affected, and do not appear likely to materially affect, our operations, business strategy, results of operations or financial condition. However, our Enterprise Risk Management program has recognized that we face ongoing risks from cybersecurity threats that, if not successfully prevented or mitigated, could materially \naffect\n us, including our operations, business strategy, results of operations or financial condition.\n For additional information on such risks, see"
  }
}