{
  "ticker": "BDX",
  "cik": "0000010795",
  "company_name": "BECTON DICKINSON & CO",
  "filing_date": "2025-11-25",
  "accession": "0000010795-25-000099",
  "primary_doc": "bdx-20250930.htm",
  "item_sections": {
    "item1": "Item 16. \nForm 10-K Summary\n119\nEXHIBIT INDEX\n120\nSIGNATURES\n126\nTable of Contents\nPART I\nItem  1.    \nBusiness.\nGeneral\nBecton, Dickinson and Company (also referred to herein as \"BD\") was incorporated under the laws of the State of New Jersey in November 1906, as successor to a New York business started in 1897. BD’s executive offices are located at 1 Becton Drive, Franklin Lakes, New Jersey 07417-1880, and its telephone number is (201) 847-6800. All references in this Form 10-K to \"BD\", \"the Company\", \"we\", \"our\" or \"us\" refer to Becton, Dickinson and Company and its domestic and foreign subsidiaries, unless otherwise indicated by the context. \nBD is a global medical technology company engaged in the development, manufacture and sale of a broad range of medical supplies, devices, laboratory equipment and diagnostic products used by healthcare institutions, physicians, life science researchers, clinical laboratories, the pharmaceutical industry and the general public. We provide customer solutions that are focused on improving medication management and patient safety; supporting infection prevention practices; equipping surgical and interventional procedures; improving drug delivery; aiding anesthesiology care; enhancing the diagnosis of infectious diseases and cancers; and advancing cellular research and applications.\nBusiness Segments\nAs of September 30, 2025, BD’s operations consisted of three worldwide business segments: BD Medical, BD Life Sciences and BD Interventional. As further discussed in Note 8 to the consolidated financial statements contained in Item 8. Financial Statements and Supplementary Data, effective October 1, 2025, BD reorganized its organizational units into five distinct, separately-managed segments, based on the nature of BD’s product and service offerings. BD’s new organizational structure is based upon the following five segments: Medical Essentials, Connected Care, BioPharma Systems, Interventional and Life Sciences, which remains a critical part of BD until the separation and combination of our Biosciences and Diagnostic Solutions business with Waters Corporation (“Waters”), as further discussed below, is completed.\nBD Medical\nBD Medical produces a broad array of medical technologies and devices that are used to help improve healthcare delivery in a wide range of settings. The primary customers served by BD Medical are hospitals and clinics; physicians’ office practices; consumers and retail pharmacies; governmental and nonprofit public health agencies; pharmaceutical companies; and healthcare workers. BD Medical consists of the following organizational units:\n1\nTable of Contents\nOrganizational Unit\nPrincipal Product Lines\nMedication Delivery\nSolutions\nPeripheral intravenous (“IV”) catheters (conventional, safety); advanced peripheral catheters (guidewire assisted peripherally inserted venous catheters, midline catheters, port access); central lines (peripherally inserted central catheters); acute dialysis catheters; vascular access technology (ultrasonic imaging);  vascular care (lock solutions, prefilled flush syringes, disinfecting caps); vascular preparation (skin antiseptics, dressings, securement); needle-free IV connectors and extensions sets; closed-system drug transfer devices; hazardous drug detection; conventional and safety hypodermic syringes and needles, anesthesia needles (spinal, epidural) and trays; enteral syringes; and sharps disposal systems.\nMedication Management \nSolutions\nIV medication safety and infusion therapy delivery systems, including infusion pumps, dedicated disposables, and IV fluids; medication compounding workflow systems; automated medication dispensing; automated supply management systems; medication inventory optimization and tracking systems; informatics and analytics solutions for enterprise medication management; and pharmacy automation systems. \nPharmaceutical \nSystems\nPrefillable drug delivery systems - prefillable syringes, safety, shielding and self-injection systems and support services (combination product testing, technical and regulatory) - provided to pharmaceutical companies for use as containers for injectable pharmaceutical products, which are then placed on the market as drug/device combinations. \nAdvanced Patient Monitoring\nAdvanced hemodynamic monitoring systems used to measure a patient's heart function and fluid status in surgical and intensive care settings, including noninvasive tissue oximetry systems; hemodynamic and tissue oximetry monitoring systems; pulmonary artery catheters and arterial pressure monitoring products and blood pressure measurement systems.\nBD Life Sciences\nBD Life Sciences provides products for the safe collection and transport of diagnostics specimens, and instruments and reagent systems to detect a broad range of infectious diseases, healthcare-associated infections and cancers. In addition, BD Life Sciences produces research and clinical tools that facilitate the study of cells, and the components of cells, to gain a better understanding of normal and disease processes. That information is used to aid the discovery and development of new drugs and vaccines, and to improve the diagnosis and management of diseases. The primary customers served by BD Life Sciences are hospitals, laboratories and clinics; blood banks; healthcare workers; physicians’ office practices; academic and government institutions; and pharmaceutical and biotechnology companies. BD Life Sciences consists of the following organizational units:\n2\nTable of Contents\nOrganizational Unit\nPrincipal Product Lines\nDiagnostic Solutions\nAutomated blood culturing and tuberculosis culturing systems; microorganism identification and drug susceptibility systems; microbiology laboratory automation and informatics; dehydrated, liquid and plated media for clinical and industrial microbiology applications; molecular testing systems for infectious diseases and women’s health; and rapid diagnostic assays for testing of respiratory infections at point of care.\nBiosciences\nFluorescence-activated cell sorters and analyzers; antibodies and kits for performing cell analysis; reagents for life science research; solutions for high-throughput single-cell gene and protein expression analysis; and clinical oncology, immunological (HIV) and transplantation diagnostic/monitoring reagents, analyzers and informatics.\nSpecimen Management\nBlood collection systems including safety-engineered wingsets, needles and blood collection tubes, arterial blood gas devices, urine collection kits, molecular research tubes, capillary collection technologies alongside associated products for patient identification,data capture, storage and transportation.\nBD Interventional\nBD Interventional provides vascular, urology, oncology and surgical specialty products that are intended to be used once and then discarded or are either temporarily or permanently implanted. The primary customers served by BD Interventional are hospitals\n, ambulatory surgery centers, individ\nual healthcare professionals, extended care facilities, alternate site facilities, and patients via our Homecare business. BD Interventional consists of the following organizational units:\nOrganizational Unit\nPrincipal Product Lines\nSurgery\nHernia and soft tissue repair, biological grafts, bioresorbable grafts, biosurgery, and other surgical products, BD Surgiphor™ Antimicrobial Irrigation System, and BD ChloraPrep™ surgical infection prevention products.\nPeripheral Intervention\nPercutaneous transluminal angioplasty (“PTA”) balloon catheters, radio frequency ablation catheters, peripheral vascular stents, self-expanding and balloon-expandable stent grafts, vascular grafts, drug coated balloons, ports, biopsy, chronic dialysis, inferior vena catheter filters, endovascular fistula creation devices and drainage products, and atherectomy and thrombectomy systems.\nUrology and Critical Care\nUrine management and measurement devices, indwelling, intermittent and external urine catheters, kidney stone management devices, Targeted Temperature Management, and fecal management devices. \n3\nTable of Contents\nAcquisitions\nEdwards Lifesciences’ Critical Care Product Group\nOn September 3, 2024, BD completed the acquisition of Edwards Lifesciences’ Critical Care product group, which was renamed as BD Advanced Patient Monitoring. The fair value of consideration transferred in connection with the acquisition was $3.914 billion. Since the acquisition date, financial results for Advanced Patient Monitoring’s product offerings are being reported as a separate organizational unit within the Medical segment. BD funded the transaction with cash on hand, using net proceeds raised through debt issuances in the third quarter of fiscal year 2024, as further discussed in Note 16, and borrowings under our commercial paper program. Additional information regarding this acquisition is contained in Note 11 to the consolidated financial statements contained in Item 8. Financial Statements and Supplementary Data, which is incorporated herein by reference.\nDivestitures\nProposed Combination of Biosciences and Diagnostic Solutions Business with Waters Corporation\n On July 13, 2025, BD entered into a definitive agreement to combine its Biosciences and Diagnostic Solutions business with Waters Corporation (“Waters”) in a Reverse Morris Trust (“RMT”) transaction. When the RMT transaction is complete, BD’s Biosciences and Diagnostic Solutions businesses will be spun-off to BD shareholders and simultaneously merged with a wholly owned subsidiary of Waters.  BD’s shareholders are expected to own approximately 39.2% of the combined company, and existing Waters’ shareholders are expected to own approximately 60.8% of the combined company. In connection with the transaction, BD expects to receive a cash distribution of approximately $4 billion prior to completion of the combination, subject to adjustment for cash, working capital, and indebtedness. The transaction is expected to be generally tax-free for U.S. federal income tax purposes to BD and BD’s shareholders and Waters is expected to assume approximately $4 billion of incremental debt. The transaction is expected to close around the end of the first quarter of calendar year 2026, subject to receipt of required regulatory approvals, Waters shareholder approval, compliance with applicable U.S. Securities Exchange Commission (“SEC”) requirements, the receipt of a\nprivate letter ruling from the Internal Revenue Service regarding certain matters germane to the U.S. federal\nincome tax consequences of the transactions and satisfaction of other customary closing conditions.\nSurgical Instrumentation Platform\nIn August 2023, BD completed the sale of the Interventional segment’s Surgical Instrumentation platform pursuant to a definitive agreement that was signed in June 2023. BD recognized a pre-tax gain on the sale of approximately $268 million, which was recorded as a component of \nOther operating expense (income), net\n in fiscal year 2023. The historical financial results for the Surgical Instrumentation platform have not been classified as a discontinued operation. Additional information regarding this divestiture is contained in Note 2 to the consolidated financial statements contained in Item 8. Financial Statements and Supplementary Data, which is incorporated herein by reference.\nSpin-Off of Diabetes Care\nOn April 1, 2022, BD completed the separation and distribution of Embecta Corp. (“Embecta”), formerly BD's Diabetes Care business, into a separate, publicly-traded company. The historical results of the Diabetes Care business (previously included in BD’s Medical segment), as well as interest expense related to indebtedness incurred by Embecta prior to the spin-off date, have been reflected as discontinued operations in our consolidated financial statements for all periods prior to the spin-off date of April 1, 2022. Additional disclosures regarding our spin-off of the Diabetes Care business are provided in Note 2 to the consolidated financial statements contained in Item 8. Financial Statements and Supplementary Data, which is incorporated herein by reference.\n4\nTable of Contents\nInternational Operations\nBD’s products are manufactured and sold worldwide. For reporting purposes, we organize our operations outside the United States as follows: EMEA (which includes Europe, the Middle East and Africa); Greater Asia (which includes countries in Greater China, Japan, South Asia, Southeast Asia, Korea, and Australia and New Zealand); Latin America (which includes Mexico, Central America, the Caribbean and South America); and Canada. BD has manufacturing operations outside the United States in Bosnia and Herzegovina, Brazil, Canada, China, Dominican Republic, France, Germany, Hungary, India, Ireland, Japan, Malaysia, Mexico, the Netherlands, Singapore, Spain, Switzerland, and the United Kingdom. Geographic information with respect to BD’s operations is included under the heading “Geographic Information” in Note 8 to the consolidated financial statements included in Item 8. Financial Statements and Supplementary Data.\nFor the most part, foreign economic conditions and exchange rate fluctuations have caused the profitability related to foreign revenues to fluctuate more than the profitability related to domestic revenues. BD believes its activities in some countries outside the United States involve greater risk than its domestic business due to the factors cited herein. See further discussion of these risks in",
    "item1a": "Item 1A, Risk Factors.”\n \nGovernance\n \nOur cybersecurity risk management program is led by our \nChief Information Security Officer (“CISO”)\n, whose organization is responsible for identifying, assessing and managing risks from cybersecurity threats. \nOur CISO has over 20 years of experience leading information security, data risk management, application/system development and engineering teams at multiple large, global and publicly traded companies—including several Fortune 500 companies. Our CISO holds Certified Information Systems Security Professional (“CISSP”), Certified Information Security Manager (“CISM”), Certified Information Privacy Professional (“CIPP”) and Security+ certifications and contributes to healthcare industry working groups.\n Our CISO reports to our Chief Information Officer (CIO), who has overall responsibility for the cybersecurity risk management program and organization. Our CIO has more than 25 years of experience in information technology, business transformation, cybersecurity and technology solutions, including leadership roles at multiple large, global and publicly traded companies—including several Fortune 500 companies. Our Vice President, Research and Development, Product Security (“VP of Product Security”) also supports our cybersecurity risk management program by leading a team of product security professionals focused on cybersecurity across the product lifecycle—including new product development, in-market products and end-of-life strategies—for our portfolio of software-based products. Our VP of Product Security has nearly 20 years of experience in the medical device industry, including at another publicly traded company managing product security, and has also received training from the SANS Institute.\n \nThe Board and its committees provide oversight of our ERM program, including our cybersecurity risk management program and the protection and resilience of BD products, manufacturing and distribution OT, enterprise IT and BD data. In addition, our management periodically conducts cybersecurity crisis simulations and shares outcomes with the full Board to raise awareness of cybersecurity risks and enhance our incident response preparedness. We also provide Board members the opportunity to take a cybersecurity training course through an external service provider. The Board delegates oversight of our cybersecurity risk management program to the Audit Committee and the Quality and Regulatory Committee (QRC). The Audit Committee regularly reviews our cybersecurity risk management program with respect to manufacturing and distribution OT and enterprise IT, and the QRC reviews our product cybersecurity program. \nOur CISO is supported by and is a member of our Cybersecurity Strategy and Risk Committee (“CSRC”), which is a management-level governance body for oversight of all of our cybersecurity risk.\n Our VP of Product Security is also a member of the CSRC. On a quarterly basis, our CSRC receives information from our CISO regarding our enterprise IT, manufacturing and distribution OT and product security programs, including the Company’s strategy and progress on key initiatives. We also have an executive-level Enterprise Risk Committee (ERC) that oversees our ERM program and aims to create an enterprise-wide culture that promotes open discussion regarding risk and opportunities and integrates effective risk management into our goals and objectives. As part of integrating cybersecurity risk management into our ERM program, our ERC receives updates from our CIO and CISO on BD’s cybersecurity risk management strategy and program on a regular basis.\n31\nTable of Contents\nIn addition to our CSRC and our ERC, we have established processes providing for the escalation of certain cybersecurity incidents and breaches. We maintain a global response plan that sets forth a detailed incident management and reporting protocol designed to respond to cybersecurity incidents and breaches appropriately and efficiently. Our operational team is responsible for communicating the impact and status of certain cybersecurity incidents and breaches to senior management, including the CISO, based on its assessment of the significance of the cybersecurity incident or breach. We also have a committee consisting of senior members of our management, including our CIO and Chief Risk Officer, to evaluate cybersecurity incidents and breaches reported to the committee by our CISO on an ad-hoc basis for potential material impacts on our Company, including its financial condition, results of operations and cash flows, and to have a sub-committee of our disclosure committee assess our public disclosure obligations. The CIO, CISO and other members of the committees are informed about the status, effectiveness and risks associated with our cybersecurity risk management program through their management of and participation in the cybersecurity risk management processes, policies and operations described above. \nOur CIO and CISO provide updates to the Audit Committee, and our VP of Product Security provides updates to the QRC, multiple times per year regarding our cybersecurity risk management program, including the results of third-party assessments, progress toward cybersecurity goals and objectives, product cybersecurity matters, third-party risk management, regulatory compliance and other topics as needed. We also have processes by which certain cybersecurity incidents and breaches are escalated and reported to the Board of Directors or a Board committee, as appropriate, based on our management’s assessment of risk.\n32\nTable of Contents",
    "item1b": "Item 1B.  \nUnresolved Staff Comments.\nNone.\n29\nTable of Contents",
    "item1c": "Item 1C.  \nCybersecurity. \nRisk Management and Strategy\nBD’s cybersecurity risk management program is focused on maintaining the confidentiality, integrity and availability of BD products, manufacturing and distribution operational technology (“OT”), enterprise IT and BD data. \nWe incorporate cybersecurity risk management into our systems and processes through a comprehensive program guided by the National Institute of Standards and Technology (“NIST”) Cybersecurity Framework 2.0.\nOur commitment to cybersecurity includes a total life cycle approach to protecting BD products, manufacturing and distribution OT, enterprise IT and BD data. Using various tools and techniques, we proactively monitor for suspicious activity and perform risk assessments, penetration testing and vulnerability scanning to identify potential threats and vulnerabilities. \nWe also engage independent third parties to conduct cybersecurity assessments and attestations, and we collaborate with government and industry leaders, including industry working groups, to gather and share cybersecurity threat intelligence.\n We provide mandatory quarterly cybersecurity awareness training tailored to associates’ and contractors’ role-based responsibilities, and we send phishing simulation emails monthly to all users with a BD email address and an assigned computing device. Where permitted by law, we also use tools to monitor the sharing of personal, confidential and proprietary information to detect intentional or unintentional exfiltration from BD systems. Our cybersecurity risk management program includes a documented incident response and critical incident management plan to identify, assess and manage the potential impact of cybersecurity threats or vulnerabilities and prioritize risk mitigation and/or remediation measures to safeguard BD products, manufacturing and distribution OT, enterprise IT and BD data, including data of our customers.\nWe strive to align BD Information Security policies and procedures with industry best practices, including the NIST Cybersecurity Framework 2.0, International Organization for Standardization (“ISO”)/International Electrotechnical Commission (IEC) 27001:2022 standards for information security, Underwriters Laboratories (“UL”) 2900-1 Cybersecurity Standard for Medical Devices, and U.S. Food and Drug Administration’s pre-market and post-market guidance for cybersecurity in medical devices as required by law under Section 524B of the Federal Food, Drug, and Cosmetic Act (FD&C Act). The Healthcare Sector Coordinating Council (HSCC) Joint Security Plan (JSP) 2.0 is a recognized industry standard that informs how we manage the security of our products. These policies and procedures establish processes for handling data, assets, systems and other technology resources to help protect BD products, manufacturing and distribution OT, enterprise IT and BD data. In 2022, BD achieved ISO/IEC 27001:2022 certification at the enterprise level, demonstrating that BD’s Information Security Management System (ISMS) conforms to internationally recognized cybersecurity standards. In 2025, BD engaged a third-party auditor to complete its third enterprise-level annual surveillance audit for ISO 27001, which determined that BD continues to meet these rigorous standards.\nWe also incorporate cybersecurity risk management into our Enterprise Risk Management (“ERM”) program. Through our ERM program, we identify, assess and manage a broad range of risks across our businesses, regions and functions, and we align our risk management efforts with our corporate strategy. Our enterprise IT, manufacturing and distribution OT, third-party and product cybersecurity risks are each assessed as part of our ERM program. As part of our cybersecurity risk management program, we engage a range of third-party experts each year, including advisors, consultants and auditors, to evaluate and enhance our program through security attestations and certifications, maturity assessments and security testing. We also engage third parties for staff augmentation to strengthen our cybersecurity program through additional dedicated resources. In addition, we actively engage with intelligence agencies, law enforcement, and advocacy and industry groups.\nWe also identify, assess and manage risks associated with our use of third-party service providers and maintain a third-party risk management program that monitors third-party cybersecurity risk throughout the procurement lifecycle—from planning and sourcing through relationship conclusion. This program includes supplier cybersecurity vetting at onboarding, and cybersecurity risk assessments, remediation, and cyber vulnerability monitoring while in-use, and deeper dive cyber risk assessments and security compliance \n30\nTable of Contents\nmonitoring is in place for our highest-risk suppliers. Our third-party risk management program is assessed for maturity by an independent third party and is aligned with NIST and ISO/IEC frameworks. We remain focused on continuous improvement through intelligence sharing with industry groups.\nThere can be no assurance that such measures will be sufficient to prevent, mitigate or remediate cybersecurity incidents or breaches. Although we have experienced cyberattacks as discussed in “"
  }
}