{
  "ticker": "BEN",
  "cik": "0000038777",
  "company_name": "FRANKLIN RESOURCES INC",
  "filing_date": "2025-11-10",
  "accession": "0000038777-25-000238",
  "primary_doc": "ben-20250930.htm",
  "item_sections": {
    "item1": "Item 1.\n    \nBusiness. \nOVERVIEW \nFranklin Resources, Inc. (“Franklin”) is a holding company with subsidiaries operating under our Franklin Templeton® and/or subsidiary brand names. Franklin’s common stock is traded on the New York Stock Exchange (the “NYSE”) under the ticker symbol “BEN” and is included in the Standard & Poor’s 500 Index. In this Annual Report, Franklin and its subsidiaries are collectively referred to as the “Company,” and words such as “we,” “us,” “our” and similar terms refer to the Company. We have one operating segment, investment management and related services.\nWe offer our services and products under our various distinct brand names, including, but not limited to, Alcentra\n®\n, Apera\n®\n, Benefit Street Partners\n®\n, Brandywine Global Investment Management\n®\n, Canvas\n®\n, Clarion Partners\n®\n, ClearBridge Investments\n®\n, Fiduciary Trust International™, Franklin\n®\n, Franklin Mutual Series\n®\n, K2\n®\n, Legg Mason\n®\n, Lexington Partners\n®\n, O’Shaughnessy\n®\n, Putnam\n®\n, Royce\n®\n, Templeton\n®\n and Western Asset Management Company\n®\n. Unless otherwise indicated, our “funds” means the funds offered under our various brand names, which may include co-branded funds.\n3\nTable of Contents\nWe are a global investment management organization with over $1.6 trillion in assets under management (“AUM”) as of September 30, 2025. Our mission is to help clients achieve better outcomes through investment management expertise, wealth management and technology solutions. Through our specialist investment managers, we offer specialization on a global scale, bringing extensive capabilities in equity, fixed income, alternatives and multi-asset solutions. For over 75 years, we have been committed to providing clients with exceptional investment management services and have developed a globally diversified business, including through strategic acquisitions.\nWe provide our investment management and related services to retail, institutional and high-net-worth investors in jurisdictions worldwide. We deliver our investment capabilities through a variety of products and vehicles and multiple points of access, including directly to investors and through financial intermediaries. Our investment products include our sponsored funds, as well as institutional and high-net-worth separate accounts, retail separately managed account programs, sub-advised products, and other investment vehicles. Our funds include registered funds (including exchange-traded funds, or “ETFs”) and unregistered funds. Related services include applicable fund administration, sales and distribution, and shareholder servicing, which we may perform directly or outsource to third parties. We also provide sub-advisory services to certain investment products sponsored by other companies that may be sold to investors under the brand names of those other companies or on a co-branded basis.\nWe offer our clients the combined experience of our investment professionals with expertise across asset classes and a sharp focus on managing risk. We are committed to delivering strong investment performance for our clients, and to offering a broad range of strategies and drawing on our diverse experiences and perspectives gained through our long history in the investment management business. We know that success demands smart and effective business innovation, solutions and technologies, and we remain focused on investment excellence, innovating to meet evolving client goals, and building strong partnerships by delivering superior client service. We continue to focus on the long-term investment performance of our investment products and on providing high quality service to our clients.\nThe global business and regulatory environments in which we operate remain complex, uncertain and subject to change. We are subject to various laws, rules and regulations globally that impose restrictions, limitations, registration, reporting and disclosure requirements on our business, and add complexity to our global compliance operations. Incorporated herein by reference is certain financial information about our segment and geographic areas contained in Note 18 – Segment and Geographic Information in the notes to consolidated financial statements in Item 8 of Part II of this Annual Report.\nCompany History \nSince 1947, the Company and its predecessors have been engaged in the investment management and related services business. Franklin was incorporated in the State of Delaware in November 1969, and originated our mutual fund business with the initial Franklin family of funds, known for its fixed income funds and growth and value-oriented equity funds. Over the years, we have expanded and developed our business to meet evolving investor needs, in part, by acquiring companies engaged in investment management and related services. We have added, among others: (i) the Templeton global investment firm in 1992, (ii) the Franklin Mutual Series investment firm in 1996, (iii) the Franklin Bissett Canadian investment firm in 2000, (iv) the Fiduciary Trust International investment and trust services firm in 2001, (v) the Benefit Street Partners alternative credit management firm in 2019, (vi) the Athena Capital Advisors investment and wealth management firm in March 2020, (vii) The Pennsylvania Trust Company investment and trust services firm in May 2020, (viii) the Legg Mason global investment firm in July 2020, (ix) the O’Shaughnessy Asset Management quantitative asset management firm in December 2021, (x) the Lexington Partners global alternatives investment firm in April 2022, (xi) the Alcentra alternative credit investment firm in November 2022, (xii) the Putnam global investment firm in January 2024, and (xiii) the Apera asset management firm in October 2025.\nOUR BUSINESS\n \nSTRUCTURE\nThrough our subsidiaries, we are committed to helping investors navigate global markets, as well as continuing to evolve and build on our strengths to meet the needs of our clients. We generally derive our revenues and income from providing investment management and related services to our products and the products we sub-advise. Our investment management fees, which represent a majority of our revenues, depend to a large extent on the level and relative mix of our AUM and the types of services provided, which are subject to change.\n4\nTable of Contents\nOur business is conducted through our subsidiaries, including our specialist investment managers. Our specialist investment managers include subsidiaries registered with the United States (“U.S.”) Securities and Exchange Commission (the “SEC”) as investment advisers under the Investment Advisers Act of 1940 (the “Advisers Act”), as well as subsidiaries registered as investment adviser equivalents in jurisdictions including Australia, Brazil, Canada, China, Commonwealth of The Bahamas, Hong Kong, Ireland, India, Japan, Luxembourg, Malaysia, Mexico, Saudi Arabia, Singapore, Switzerland, South Korea, the United Arab Emirates, the United Kingdom (“U.K.”) and Uzbekistan. \nOur AUM by Asset Class and Product Type\nWe offer a broad product mix under our equity, fixed income, alternative, multi-asset and cash management asset classes. Our equity capabilities include value, deep value, core value, blend, growth and growth at a reasonable price, convertibles, sector, Shariah, smart beta and thematic investments. Our fixed income capabilities include government, municipals, corporate credit, bank loans, securitized, multi-sector, and other investments. Our alternative capabilities include private debt, hedge funds, private equity, real estate and infrastructure investments. Our multi-asset capabilities include income, real return, balanced/hybrid, total return, target date/risk, absolute return, tactical asset allocation and managed volatility investments. \nWe believe, despite market risks, that we have a competitive advantage as a result of the economic and geographic diversity of our products available to our clients. Our U.S. funds include U.S. mutual funds, closed-end funds, ETFs, private funds, sub-advised funds and other products (including products we sub-advise and those sub-advised by third parties). Our non-U.S. funds include a variety of cross-border funds principally domiciled in Luxembourg or Ireland, registered for sale to non-U.S. investors in certain other countries, and international locally domiciled funds and products for the particular local market. Our institutional separate account services are provided to various institutions globally for which we serve as an investment adviser. Our retail separately managed accounts, commonly known as managed accounts or wrap programs, are sponsored by various financial institutions. We also offer and serve as investment adviser to various other products.\nOur fees for providing investment management services are generally based on a percentage of AUM in the accounts that we advise, and vary based on the asset classes of the accounts, the types of services that we provide, and the market for those services.\nAUM by asset class and product type was as follows:\n(in billions)  \nas of September 30, 2025\nU.S. Funds\nNon-U.S. Funds\nInstitutional Separate Accounts\nRetail Separately Managed Accounts\nOther\nTotal\nPercentage\nof Total\nAUM\nEquity\n$\n391.8 \n$\n120.7 \n$\n48.0 \n$\n107.4 \n$\n18.3 \n$\n686.2 \n41\n%\nFixed Income\n159.2 \n62.4 \n162.5 \n31.6 \n23.0 \n438.7 \n26\n%\nAlternative\n152.7 \n88.7 \n21.7 \n0.6 \n0.2 \n263.9 \n16\n%\nMulti-Asset\n101.4 \n14.1 \n4.8 \n24.9 \n48.7 \n193.9 \n12\n%\nCash Management\n46.3 \n31.3 \n0.9 \n— \n— \n78.5 \n5\n%\nTotal\n$\n851.4\n \n$\n317.2\n \n$\n237.9\n \n$\n164.5\n \n$\n90.2\n \n$\n1,661.2\n \n100\n%\nSee “Assets under Management” under Item 7, Management’s Discussion and Analysis of Financial Condition and Results of Operations, of Part II of this Annual Report for additional information about our AUM. Broadly speaking, other than AUM changes due to acquisitions, changes in our AUM depend primarily upon two factors: (i) the increase or decrease in the market value of the securities and instruments held in the portfolio of investments, and (ii) the level and direction of net flows. Changing market conditions, reputational harm and the evolving needs of our clients may cause asset volatility and a shift in our asset mix, which may result in an increase or decrease in our revenues and income. \nOur Investment Management Related Services and Products\nOur specialist investment managers offer diverse perspectives and specialized expertise across asset classes and strategies. Across our business, our specialist investment managers generally focus on a portion of the investment management industry in terms of the types of assets managed and each may differ in the types of products and services offered, the investment styles utilized, and the types and geographic locations of its clients. Each typically markets its products and services under its own brand name, with certain distribution functions provided by our corporate distribution \n5\nTable of Contents\nsubsidiaries where applicable. We have in place revenue sharing arrangements with certain of our specialist investment managers. \nOur specialist investment managers include: Benefit Street Partners, Brandywine Global, Clarion Partners, ClearBridge Investments, Fiduciary Trust International, Franklin Equity Group, Franklin Income Investors, Franklin Mutual Series, Franklin Templeton Fixed Income, Franklin Templeton Investment Solutions, Lexington Partners, O’Shaughnessy Asset Management, Putnam Investments, Royce Investment Partners, Templeton Global Investments, Templeton Global Macro and Western Asset Management.\n \nThrough our specialist investment managers, our investment products are offered globally to retail, institutional and high-net-worth clients, which may include, among others, individual investors, institutional investors, sovereign wealth funds, defined benefit and contribution plans, endowments and charitable foundations, healthcare systems and insurance companies. Our investment products include mutual funds, closed-end funds, collective investment trusts, interval funds, private funds, institutional separate accounts, retail separately managed accounts, and other products. Our products and capabilities are designed to accommodate a variety of investment goals and preferences, from capital appreciation to capital preservation, as well as other investor preferences.\nWe are committed to partnering closely with our clients to understand their challenges and aspirations, and drawing on our investment capabilities and resources to offer and/or design the right investment solutions for them. We distribute and market globally our different capabilities under our brand names through various subsidiaries and multiple points of access, including directly to investors and through financial intermediaries. We primarily engage new institutional business through our relationships with pension, defined contribution and management consultants, direct sales efforts and additional mandates from our existing client relationships, as well as from our responses to requests for proposals. We also market and distribute our products through various subsidiaries to institutional investors with separate accounts.\nOur specialist investment managers provide investment management services pursuant to agreements with each of our investment products and/or clients, including products for which we provide sub-advisory services. Our investment management services include fundamental investment research and valuation analyses, including original economic, political, industry and company research, and analyses of suppliers, customers and competitors. Our management fees vary with the types of services that we provide, and fees may at times be waived or voluntarily reduced by the parties, among other things.\nOur Funds\nOur specialist investment managers manage a fund’s portfolio of securities in accordance with the fund’s stated objectives. To support the funds’ operations, our subsidiaries either provide or arrange for the investment and other management, shareholder servicing and administrative services required by the funds. We outsource various administration, technology, transfer agency and other services for our funds to third-party providers. An investor may purchase shares of a mutual fund directly from us or through a broker-dealer, financial adviser, bank or other similar financial intermediary that provides investment advice to the investor, or an investor may purchase shares of a closed-end fund or ETF on the stock exchange where the fund is traded. Financial intermediaries may earn fees and commissions and receive other compensation with respect to fund shares sold to investors.\nThe applicable board of directors or trustees of our funds and our management personnel periodically review the investment management fee structures for the funds in light of fund performance, the level and range of services provided, industry conditions and other relevant factors. For our U.S. mutual funds, most of our investment management agreements between our subsidiaries and funds must be renewed each year, and must be approved annually by a vote of each fund’s board of directors or trustees as a whole and separately by a majority of the independent fund directors or trustees under the Investment Company Act of 1940 (the “Investment Company Act”), or by a vote of the holders of a majority of the fund’s outstanding voting securities, and such agreements generally may be terminated by either party without penalty after prior written notice. Our non-U.S. mutual funds, private funds, institutional and high-net-worth separate accounts, and the products for which we provide sub-advisory services, are typically subject to various termination rights and/or renewal provisions, which often provide for termination upon relatively short notice with little or no penalty.\nRetail Separately Managed Account Programs \nCertain of our specialist investment managers provide investment management services to retail separately managed account programs sponsored by various financial institutions. These programs typically allow securities brokers or other financial intermediaries to offer their clients the opportunity to choose from a number of investment management services \n6\nTable of Contents\npursuing different investment strategies provided by one or more investment managers, and generally charge an all-inclusive fee that can cover asset management, asset allocation and custodial and administrative services.\nAlternative Products and Strategies\nCertain of our specialist investment managers manage alternative products and investment strategies which provide our clients with alternatives to traditional equity and fixed income products and services. Our alternative products include private credit funds and structured products, business development companies, hedge funds (such as funds of funds and custom advisory solutions), private equity funds, secondary private equity funds, venture capital funds and real estate funds. These products employ various investment strategies and approaches, including loan origination, collateralized loan obligations, high-yield credit, hedge fund advisory, private equity and infrastructure transactions in emerging markets, global macro, consumer loans, direct real estate investments, and custom-tailored investment programs.\nHigh-Net-Worth Investment Management, Trust and Custody Services\nThrough our Fiduciary Trust International related subsidiaries, we provide investment management and related services to, among others, high-net-worth individuals and families, family offices, foundations and institutional clients. Fiduciary Trust International offers investment management and advisory services across different investment styles and asset classes. The majority of these client assets are actively managed by individual portfolio managers, while a significant number of clients also seek multi-manager, multi-asset class solutions. We also may provide separately managed accounts, private funds, and trust, custody and related services, including administration, performance measurement, estate planning and tax planning.\nSales and Distribution \nOur global distribution group is responsible for sales, marketing and business development and maintains a regional distribution model, with regional teams responsible for driving initiatives in collaboration with global teams. Our groups collaborate to meet the needs of our advisors, clients and investors. There are many sales channels across each region, which may include retail, institutional, private wealth, retirement, insurance, and other specialty sales. Our global footprint and breadth of investment capabilities provide the opportunity for us to work with global financial institutions to add value through and beyond investing, including by providing thought leadership and building business relationships and global economic partnerships.\nIn addition, certain of our specialist investment managers have their own sales and marketing teams that distribute their products and services, primarily to institutional investors, both directly and through consultants. Consultants play a large role in institutional investment management by helping clients select and retain investment managers. Institutional investment management clients and their consultants tend to be highly sophisticated and investment performance driven.\nOur sales and distribution capabilities and related efforts are critical components of our business and may be impacted by global distribution trends and changes within the financial services industry. In the U.S., our distribution subsidiaries generally serve as the principal underwriters and distributors of shares of most of our mutual funds. Outside the U.S., certain of our non-U.S. subsidiaries provide sales, distribution and marketing services to our non-U.S. mutual funds. Some of our non-U.S. mutual funds, particularly our Luxembourg and Irish domiciled funds, are distributed globally on a cross-border basis, while others are distributed exclusively in local markets. \nWe earn sales and distribution fees primarily by distributing our mutual funds pursuant to distribution agreements with the funds. Under our distribution agreements with our U.S. mutual funds, we offer and sell the fund shares on a continuous basis and pay certain costs associated with selling, marketing and distributing the fund shares, including the costs of developing and producing sales literature, shareholder reports and prospectuses. Our sales and distribution fees primarily consist of upfront sales commissions and ongoing distribution fees, which generally will change with the overall level of gross sales, the size of individual transactions, and the relative mix of sales between different asset classes and types of investors.\n7\nTable of Contents\nThe majority of our U.S. mutual funds, with the exception of certain money market funds and certain other funds specifically designed for purchase through separately managed account programs, have adopted distribution plans under Rule 12b-1 (the “Rule 12b-1 Plans”) promulgated under the Investment Company Act. The Rule 12b-1 Plans permit the funds to pay us for marketing, marketing support, advertising, printing and sales promotion services relating to the distribution of their shares, subject to the Rule 12b-1 Plans’ limitations on amounts based on daily average AUM. Similar arrangements exist for the distribution of non-U.S. mutual funds. The Rule 12b-1 Plans are established for one-year terms and must be approved annually by a vote of each fund’s board of directors or trustees as a whole and separately by a majority of the independent fund directors or trustees under the Investment Company Act, and such plans are subject to termination at any time by a majority vote of the independent fund directors or trustees or by the fund’s shareholders.\nWe pay the sales and distribution fees earned as revenues to the financial advisers and other intermediaries that sell our funds on our behalf. The distribution agreements with our U.S. mutual funds generally provide for us to pay commission expenses for sales of fund shares to qualifying broker-dealers and other independent financial intermediaries. These financial intermediaries receive various sales commissions and other fees for services in matching investors with funds whose asset classes match such investors’ goals and risk profiles. The intermediaries also may receive fees for their assistance in explaining the operations of the funds, and for reporting and various other distribution services. Other compensation may be offered to the extent not prohibited by federal or state laws or any self-regulatory agency, such as the Financial Industry Regulatory Authority (“FINRA”), applicable to our business. We are heavily dependent upon these third-party distribution and sales channels and business relationships. There is increasing competition for access to these channels, which has caused our distribution costs to rise and could cause further increases in the future as competition continues and service expectations increase.\nSimilar arrangements exist with the distribution of our non-U.S. mutual funds where, generally, our subsidiary that distributes the funds receives maintenance fees from the funds and pays certain fees to financial advisers, banks and other intermediaries. \nShareholder Servicing \nWe perform our shareholder servicing services directly or through third parties. Substantially all shareholder servicing fees are earned from our funds for providing transfer agency services, which include providing shareholder statements, transaction processing, client service and tax reporting. Shareholder servicing fees are determined based on a contractual margin, or a percentage of AUM and either the number of transactions in shareholder accounts or the number of shareholder accounts. We outsource various transfer agency and other services for our funds to third-party providers who serve as a sub-agent or delegate, depending on the jurisdiction. Our fees and expenses are routinely benchmarked against applicable industry standards.\nCOMPETITION \nThe financial services industry is a highly competitive global environment. Competition is based on various factors, including, among others, business reputation, investment performance, product mix and offerings, service quality and innovation, distribution relationships, and fees charged. We face strong competition from numerous investment management companies, securities brokerage and investment banking firms, insurance companies, banks, hedge fund firms and other financial management institutions, which offer a wide range of financial and investment management services and products to the same retail, institutional and high-net-worth investors and accounts that we are seeking to attract. We offer a broad product mix that meets a variety of investment goals and needs for different investors, and we may periodically introduce new products to provide investors with additional investment options. \nWe primarily derive our fund sales through third-party broker-dealers, banks, investment advisers and other financial intermediaries. Because we rely on third-party distribution and sales channels to sell our products, we do not control the ultimate investment recommendations given by them to clients. Such financial intermediaries may recommend competing products.\nDue to our international presence and varied product mix, it is difficult to assess our market position relative to other investment managers on a worldwide basis, but we believe that we are one of the more widely diversified investment managers based in the U.S. We believe that our equity, fixed income, alternative and multi-asset asset mix, coupled with our global presence, will serve our competitive needs well over the long term. We continue to focus on the long-term performance of our investment products, service to clients and extensive marketing activities through our strong broker-dealer and other financial institution distribution network as well as with high-net-worth and institutional clients. \n8\nTable of Contents\nThe establishment of new investment management firms and continuous development of investment products increases the competition that we face. Many of our competitors have long-standing and established relationships with broker-dealers, investment advisers and their clients, and some have affiliated brokerage businesses. Others have focused on, offer and market specific product lines that provide strong competition to certain of our asset classes. In addition, consolidation in the financial services industry has created stronger competitors, some with greater financial resources and broader distribution channels than our own.\nREGULATION \nGeneral\nWe are subject to extensive regulation. Virtually all aspects of our business are subject to various U.S. federal and state, and/or international regulation and supervision. Our regulators have broad authority with respect to the regulation of investment management and other financial services, including among other things, the authority to grant or cancel required licenses or registrations, impose net capital and other financial or operational requirements on us, and other enforcement powers described below. The regulations to which we are subject continue to change and evolve over time. Consequently, there is uncertainty associated with the regulatory environments in which we operate. The rules and regulations applicable to investment management organizations are very detailed and technical. Accordingly, the discussion below is general in nature and does not purport to be complete.\nWith our global operations, certain of our subsidiaries are registered with or licensed by various U.S. and/or non-U.S. regulators, and our funds are subject to various U.S. and/or non-U.S. laws. In particular, we are subject to various securities, compliance, corporate governance, disclosure, privacy, anti-bribery and anti-corruption, anti-money laundering, anti-terrorist financing, and economic, trade and sanctions laws and regulations, both domestically and internationally, as well as to various cross-border rules and regulations, such as the anti-bribery and anti-corruption rules under the Foreign Corrupt Practices Act of 1977 and the data protection rules under the General Data Protection Regulation (“GDPR”) of the European Union (“EU”). We are subject to sanctions programs administered by the Office of Foreign Assets Control of the U.S. Department of Treasury (“USDT”), as well as sanctions programs adopted and administered by non-U.S. jurisdictions where our services and products are offered. Our subsidiaries with custody of client assets or accounts are also subject to the applicable laws and regulations of U.S. states and non-U.S. jurisdictions regarding the reporting and escheatment of unclaimed or abandoned property, and applicable banking, trust company and/or fiduciary related regulations. We also must comply with complex and changing tax regimes in the jurisdictions where we operate our business.\nFailure to comply with applicable U.S. and non-U.S. laws, regulations, rules, codes, notices, directives, guidelines, orders, circulars and/or conditions in the various jurisdictions where we operate could result in a wide range of disciplinary actions against us, our subsidiaries and/or our business. Breaches of applicable laws and rules could result in regulatory enforcement, civil liability, criminal liability and/or the imposition of a range of sanctions or orders against us, including, as applicable, monetary damages, injunctions, disgorgements, fines, penalties, cease and desist orders, censures, reprimands, and the revocation, cancellation, suspension or restriction of licenses, registration status or approvals held by us or our business in a jurisdiction or market. In addition, a public regulatory issue can have a negative impact on our reputation, and as a result have indirect impacts on our business or growth.\nSee Item 7, Management’s Discussion and Analysis of Financial Condition and Results of Operations, of Part II of this Annual Report, for financial information about our business.\nU.S. Regulation\nU.S. Regulatory Framework.\n As a U.S. reporting company, we are subject to U.S. federal securities laws, state securities and corporate laws, state escheatment laws and regulations, and the rules and regulations of certain U.S. regulatory and self-regulatory organizations, such as the SEC and the NYSE. In particular, we are subject to various securities, compliance, corporate governance and disclosure rules adopted by the SEC. We are also subject to various other U.S. federal and state laws, including those affecting corporate governance and disclosure, such as the Securities Act of 1933, the Securities Exchange Act of 1934 (“Exchange Act”), the Dodd-Frank Wall Street Reform and Consumer Protection Act of 2010, the Sarbanes-Oxley Act of 2002 and the USA PATRIOT Act of 2001. As a NYSE-listed company, we are also subject to NYSE listing and disclosure requirements.\n9\nTable of Contents\nAs a global investment management organization, certain of our subsidiaries are also subject to the rules and regulations of various U.S. regulatory and self-regulatory organizations, including the SEC, FINRA, the U.S. Commodity Futures Trading Commission (“CFTC”), the National Futures Association, the U.S. Department of Justice (“DOJ”), the U.S. Department of Labor (“DOL”), and the USDT. Our non-U.S. operations also may be subject to regulation by U.S. regulators, including the SEC, the CFTC and the DOJ.\nCertain of our subsidiaries are registered with the SEC under the Advisers Act and/or with the CFTC, and many of our funds are registered with the SEC under the Investment Company Act. These registrations, licenses and authorizations impose numerous obligations, as well as detailed operational requirements, on such subsidiaries and funds. The Advisers Act imposes numerous obligations on our registered investment adviser subsidiaries, including record keeping, operating and marketing requirements, disclosure obligations and prohibitions against fraudulent activities. The Investment Company Act similarly imposes extensive obligations on the registered investment companies advised by our subsidiaries.\nU.S. Regulatory Reforms.\n Over the years, the U.S. federal corporate governance and securities laws have been augmented substantially and made significantly more complex by various legislation. As we continue to address our legal and regulatory requirements or focus on meeting new or expanded requirements, we may need to expend a substantial amount of additional time, costs and resources. Regulatory reforms may continue to add further complexity to our business and operations and could require us to alter our investment management services and related activities, which could be costly, impede our growth and adversely impact our AUM, revenues and income. Such reforms could significantly increase our reporting, disclosure and compliance obligations. Certain key regulatory reforms in the U.S. that impact or relate to our business, and may cause, or continue to cause, us to incur additional obligations, include:\nAntitrust Rules and Disclosure.\n The Federal Trade Commission (“FTC”) has approved various rule changes under the Hart-Scott-Rodino Antitrust Improvements Act of 1976 (“HSR Act”) that amend certain premerger reporting and notification rules. The HSR Act and its implementing rules require parties to certain mergers and acquisitions to submit premerger notifications to the FTC and DOJ and observe a waiting period before consummating such transactions. The rules significantly expand the premerger information and documentation required to be submitted in connection with an HSR filing, which could substantially increase our required disclosure and notification expenses and delay transactions.\nCybersecurity Disclosure. \nThe SEC’s amended\n \nrules require disclosure regarding cybersecurity risk management, strategy,\n \ngovernance and incident reporting by public companies. The rules\n \nrequire public companies to (i) disclose, on a current basis, any cybersecurity incident it deems to be material\n \nwithin four business days on a Form 8-K; (ii) describe, on an annual basis, the company’s\n \nprocesses, if any, for the assessment, identification and management of material risks from\n \ncybersecurity threats, as well as whether any risks from cybersecurity threats have materially\n \naffected or are reasonably likely to materially affect their business strategy, results of\n \noperations or financial condition; and (iii) describe, on an annual basis, the board’s oversight of\n \nrisks from cybersecurity threats and management’s role in assessing and managing those risks.\n \nThe rules require ongoing evaluation and analysis of our applicable processes and procedures, including regarding cyber incident response plans and procedures, disclosure analysis framework, risk management processes, and board oversight structure. \nSustainability\n. Sustainable investing and related environmental, social and governance (“ESG”) topics continue to be the focus of increased regulatory and legal scrutiny across jurisdictions. In the U.S., the SEC adopted, but subsequently stayed the implementation of, climate disclosure rules to require public issuers to include enhanced disclosure and financial metrics regarding corporate climate-related information in their periodic reports and registration statements. These rules remain stayed and subject to ongoing legal challenges. In addition, state laws and regulations regarding these topics continue to evolve. For example, in October 2023, California enacted a new climate accountability package pursuant to its Climate Corporate Data Accountability Act that requires annual disclosure of certain greenhouse gas emissions and Climate-Related Financial Risk Act that requires biennial disclosure of certain climate-related financial risks and mitigation measures, each beginning in 2026, subject to applicable implementing regulations that the California Air Resources Board is expected to finalize in late 2025 that may impact final scope and compliance timing. Globally, the independent International Sustainability Standards Board and other applicable sustainability disclosure standards continue to impact how national regulators and governance bodies approach these and related topics.\nPrivacy and Data Protection.\n There continues to be an increased regulatory and enforcement focus with respect to the protection of individuals’ privacy and personal data around the world, and the ongoing need to secure and ensure only appropriate collection and use of sensitive customer, personnel, and others’ personal data. A majority of the jurisdictions where we operate are covered, or we expect will be covered, by stringent privacy and data protection laws and regulations. As the regulatory focus on privacy continues to intensify and laws and regulations concerning the management of personal \n10\nTable of Contents\ndata continue to expand, risks related to the handling of privacy obligations and personal data collection across our business will increase. For example, in addition to international data protection and privacy laws and regulations like the EU’s GDPR, we are, and expect to continue to be, subject to and affected by existing, new and evolving country, federal and state laws, regulations and guidance around the world impacting consumer and personnel privacy, including various U.S. state consumer privacy laws that provide for enhanced consumer protections for their residents and impose requirements for the handling, disclosure and deletion of personal information of their residents.\nSystemically Important Financial Institutions.\n The mandate of the Financial Stability Oversight Council (“FSOC”) is to identify and respond to threats to U.S. financial stability. Similarly, the U.S. and other members of the G-20 group of nations have empowered the Financial Stability Board (“FSB”) to identify and respond, in a coordinated manner, to threats to global financial stability. The FSOC may designate certain non-bank financial companies as systemically important financial institutions (“SIFIs”), which are subject to supervision and regulation by the Board of Governors of the Federal Reserve System. The FSB may designate certain non-bank financial companies as global systemically important financial institutions (“G-SIFIs”). To the extent that we or any of our funds are designated as a SIFI or G-SIFI, such designations would add additional supervision, review, monitoring and/or regulation resulting in increased scrutiny and oversight that could impact our business.\nU.S. DOL Reforms. \nThe DOL’s 2024 amended fiduciary rule broadening the definition of who is considered an “investment advice fiduciary” to a retirement investor, and adding significant restrictions and requirements for the use of prohibited transaction exemptions typically relied upon by investment firms such as ours, remains subject to applicable legal challenges. Under the new rule, a financial services provider that provides one-time advice to a retirement investor may become subject to the Employee Retirement Income Security Act (ERISA) fiduciary standard. In addition to the 2024 fiduciary rule, the DOL amended the Qualified Professional Asset Manager (QPAM) exemption as of June 2024, which many investment firms have relied upon when providing services to and engaging in transactions on behalf of applicable retirement plans, individual retirement accounts (IRAs) and/or certain commingled investment vehicles that have retirement plan investors. The QPAM amendment makes material changes and imposes additional conditions and affirmative requirements for the ongoing use of such exemption. On August 7, 2025, President Trump issued an Executive Order to facilitate the ability of participants in 401(k) and other defined contribution plans to obtain exposure to alternative assets, including private equity, real estate, and digital assets.\nPrivate Fund Adviser Reforms.\n In February 2024, the SEC and CFTC jointly adopted amendments to Form PF, which is the confidential reporting form that certain investment advisers to private funds file to provide confidential information to the agencies and the FSOC. The amendments require all private \nfund advisers to report additional information about themselves and the funds they advise, including assets under management, withdrawal and redemption rights, gross and net asset value, inflows and outflows, borrowings and types of creditors, beneficial ownership, and fund performance. Hedge fund advisers are subject to additional reporting requirements with respect to the funds they advise, including information about investment strategies, counterparty exposures, and trading and clearing mechanisms. Large hedge fund advisers that report on qualifying hedge fund assets are required to report more detailed information about investment exposures, borrowing and counterparty exposure, market factor effects, currency exposure, turnover, country and industry exposure, central clearing counterparty reporting, risk metrics, investment performance, portfolio liquidity, and financing and investor liquidity. The compliance date for the amended reporting requirements has been extended, most recently until October 2026. The SEC has indicated that, during the further extension period, it will continue its substantive review of the amendments and Form PF more generally. \nFund Names Rule Reforms.\n In September 2023, the SEC adopted amendments to the fund “Names Rule” impacting regulated investment funds. \nThe Names Rule generally requires a fund to invest at least 80% of the value of its assets in the particular type of investments or industry suggested by the fund's name. The amendments expand the applicability of the Names Rule and impacted funds may need to modify their names or alter their investment strategies to comply with the amendments, potentially impacting their portfolios. \nFunds with names that suggest a focus on investments that have particular characteristics, such as “growth,” “value” or thematic terms such as “ESG,” would be required to adopt a policy to invest at least 80% of the fund’s assets in those investments and would be subject to enhanced disclosure and reporting requirements. The SEC did not clearly define these terms and instead is allowing fund managers the flexibility to create their own reasonable definitions. As extended in April 2025, compliance with the rules is required for larger fund complexes by June 2026.\nDigital Assets.\n Regulatory attention to digital assets—including cryptocurrencies, stablecoins, tokenized securities and other distributed ledger instruments—has continued to intensify across jurisdictions. Current U.S. leadership has \n11\nTable of Contents\nshown greater support for financial technology innovation and activity. In July 2025, the U.S. enacted legislation governing the issuance and regulatory oversight of payment stablecoins. Congress is considering legislation that would allocate primary oversight of most other digital asset activities between the SEC and CFTC. Also in July 2025, the President’s Working Group on Digital Asset Markets issued a report that includes numerous legislative and regulatory recommendations. The SEC, CFTC, and other agencies have begun implementing these recommendations. Internationally, the EU’s Markets in Crypto-Assets Regulation became fully applicable in late 2024, and the United Kingdom, Singapore, Hong Kong and Japan have introduced or strengthened licensing, prudential and consumer-protection rules for crypto-asset service providers. Although the expanding regulatory framework raises legal, compliance and operational challenges for firms, the anticipated clarity and predictability around permissible digital asset activities is broadly positive for the market and its participants.\nU.S. and Global Tax Compliance. \nOur business may be directly or indirectly affected by tax legislation and regulation, or the modification of existing tax laws, by applicable tax and other governmental authorities. The Organization for Economic Co-operation and Development, an intergovernmental organization, has focused on addressing the tax challenges of the digitalization of the economy, which may further impact multinational businesses by allocating a greater share of taxing rights to countries where consumers are located regardless of the current physical presence of a business, and by implementing a global minimum tax. We will continue to monitor developments regarding such matters and any significant impacts on our effective tax rate.\nNon-U.S. Regulation\nOur operations outside the U.S. are subject to the laws and regulations of various non-U.S. jurisdictions and non-U.S. regulatory agencies and bodies. Our international operations are subject to regulatory systems in various jurisdictions, comparable to those covering our operations in the U.S.\nEurope. \nIn Luxembourg, the Commission de Surveillance du Secteur Financier (“CSSF”) regulates our substantial activities in Luxembourg, including our subsidiary Franklin Templeton International Services S.à r.l. (“FTIS Lux”). FTIS Lux is licensed as a management company for both the Undertakings for Collective Investment in Transferable Securities Directive (“UCITS”) and alternative investment funds (“AIFs”) and, as such, it manages our Luxembourg-domiciled UCITS and our EU-domiciled AIFs. FTIS Lux’s license also covers certain investment services, such as discretionary portfolio management, investment advice and reception and transmission of orders in relation to financial instruments. The CSSF’s rules include capital resource, governance and risk management requirements, business conduct rules, remuneration rules and oversight of systems and controls.\nOur international funds include two broad ranges of cross-border UCITS that are domiciled in Luxembourg and Ireland, and thereby subject to regulation by the CSSF and the Central Bank of Ireland. Both UCITS are also registered for public sale in many countries around the world, both in the EU and beyond, and thus are also subject to the laws of, and certain supervision by, the governmental authorities of those countries.\nIn the U.K., the Financial Conduct Authority (the “FCA”) regulates certain of our subsidiaries. Authorization by the FCA is required to conduct any financial services-related business in the U.K. pursuant to the Financial Services and Markets Act 2000. The FCA’s rules under that act govern a firm’s capital resources requirements, senior management arrangements, business conduct, interaction with clients, and systems and controls. In 2024, we updated the applicable product, marketing and other materials of our U.K. funds in line with the FCA’s new Sustainability Disclosure Requirements and we are preparing the first annual disclosure for funds with sustainability characteristics for compliance with the December 2025 deadline. We offer a significant number of EU UCITS to U.K. retail investors which have registered under the U.K.’s new Offshore Funds Regime to continue such offerings. We await a further consultation from the U.K. Treasury as to how such funds may in the future also be covered by the FCA’s Sustainability Disclosure Requirements.\n12\nTable of Contents\nIn addition, the EU Markets in Financial Instruments Directive, as revised and expanded in 2018 (“MiFID II”), regulates the provision of investment services and conduct of investment activities throughout the European Economic Area (“EEA”). As revised, MiFID II sets out detailed requirements, governing the organization and business conduct of investment firms and regulated markets, and includes pre- and post-trade transparency requirements for equity markets and extensive transaction reporting requirements. It also includes an expansion of the types of instruments subject to these requirements, such as bonds, structured products and derivatives, and changes to business conduct requirements, including selling practices, intermediary inducements and client categorization. MiFID II also includes a ban on commission and other payments (“inducements”) to independent advisers and discretionary managers, which has changed the commercial relationships between fund providers and distributors. Arrangements with non-independent advisers have also been affected, as narrower rules around the requirement that any commission reflect an enhancement of the service to customers came into effect, along with a prescriptive list of permissible non-monetary benefits. The interpretation of the inducements rules has also resulted in major changes to how fund managers finance investment research with many firms, including ours, though changes to those rules are due to take effect in 2026 and the impact of such changes remains to be seen.\nThe European Market Infrastructure Regulation sets out rules in relation to the central clearing of specified derivatives. Mutual recognition of central counterparties has been achieved between the EU regulatory authorities and other important jurisdictions including the U.S. In addition, there are rules relating to margin requirements for uncleared over-the-counter derivatives. Future regulatory policy reviews will decide whether these rules are extended to other types of derivative instruments, which could increase operational costs for our business and transactional costs for our clients.\nThe EU’s Alternative Investment Fund Managers Directive (“AIFMD”) regulates managers of, and service providers to, AIFs that are domiciled and offered in the EU and that are not authorized as retail funds under UCITS. The AIFMD also regulates the marketing within the EU of all AIFs, including those domiciled outside the EU. Compliance with the AIFMD’s requirements may restrict AIF marketing and imposes compliance obligations in the form of remuneration policies, capital requirements, reporting requirements, leverage oversight, valuation, stakes in EU companies, the domicile, duties and liability of custodians and liquidity management.\nThe EU regulation on packaged retail investment and insurance products (“PRIIPs”) imposed new pre-contractual disclosure requirements under the form of a Key Information Document (“KID”) for the benefit of retail investors when they are considering the purchase of packaged retail investment products or insurance-based products. \nThe EU’s Sustainable Finance Disclosure Regulation (“SFDR”) imposes mandatory ESG disclosure obligations on asset managers and other financial markets participants. SFDR requires all covered firms to disclose how financial products integrate sustainability risks in the investment process, including whether they consider adverse sustainability impacts, and, for those products promoting sustainable objectives, the provision of sustainability-related information. Related amendments to applicable legislation require that all covered investment managers must consider in their investment process any ESG risks which are likely to have a material impact on the value of the investment and require investment advisers to inquire as to the investor’s desire for ESG-focused products in their portfolio when assessing suitability. The availability of such sustainability disclosures may impact the investment decisions of European investors. The European Commission is currently reviewing SFDR and expected to propose major changes before the end of 2025.\nThe EU’s Corporate Sustainability Due Diligence Directive (“CSDD”) will impose due diligence obligations requiring companies to identify, and to prevent or at least mitigate, adverse impacts on human rights and the environment across their value chain, including by their subsidiaries, supply chain partners and clients. Obligations would be enforced through administrative sanctions and civil liability, with a defense of having exercised reasonable due diligence. The CSDD remains subject to further secondary rulemaking and guidance around implementation. While CSDD does not currently apply to investment funds, the European Commission is required to consider the merits of potentially extending the requirements to funds. As investors in the public markets do not have the contractual relationship with issuers to compel them to provide the information required by CSDD, the imposition of CSDD to funds could prove problematic for the industry. With a fresh political focus on encouraging economic growth and regulatory simplification, a fundamental review of both CSDD and the EU’s Corporate Sustainability Reporting Directive (“CSRD”) began early in 2025 and continues, and the implementation deadlines for both CSDD and CSRD have been pushed back to allow for resolution of that process.\nAustralia. \nIn Australia, our subsidiaries are subject to various Australian federal and state laws and are regulated by the Australian Securities and Investments Commission (“ASIC”). ASIC regulates companies, financial markets and financial services in Australia. ASIC imposes certain conditions on licensed financial services organizations that apply to our subsidiaries, including requirements relating to capital resources, operational capability and controls.\n13\nTable of Contents\nCanada. \nIn Canada, our subsidiaries are subject to provincial and territorial laws and are registered with and regulated by provincial and territorial securities regulatory authorities. The mandate of Canadian securities regulatory authorities is generally to protect investors; to foster fair, efficient and competitive capital markets; to foster capital formation; and to contribute to the stability of the financial system and the reduction of systemic risk. Securities regulatory authorities impose certain requirements on registrants, including a standard of conduct, capital and insurance, record keeping, regulatory financial reporting, conflict of interest management, compliance systems and security holder reporting. In addition, one of our Canadian subsidiaries is a federally licensed trust company subject to regulation and supervision by the Office of the Superintendent of Financial Institutions and another subsidiary is a member of and regulated by the Canadian Investment Regulatory Organization. These regulatory bodies have similar requirements to those of the securities regulatory authorities with a view to ensuring the capital adequacy and sound business practices of the subsidiaries and the appropriate treatment of their clients. \nCayman Islands. \nIn the Cayman Islands, the Cayman Islands Monetary Authority (“CIMA”) is responsible for the regulation and supervision of financial services, the monitoring of compliance with anti-money laundering regulations, and the issuance of statements of principle and guidance. In February 2020, the Cayman Islands enacted the Private Funds Law 2020 (the “Private Funds Law”), which requires private funds that engage in business in or from the Cayman Islands to register with CIMA, unless an exemption applies. The Private Funds Law applies to any Cayman Islands closed-end fund. Open-end funds such as hedge funds continue to be regulated by the Mutual Funds Law in the Cayman Islands. The registration requirements applicable to our private funds domiciled in the Cayman Islands have posed, and may continue to pose, additional compliance costs and burdens on our business.\nHong Kong. \nIn Hong Kong, our applicable subsidiaries are subject to the Securities and Futures Ordinance (“SFO”) and its subsidiary legislation, which governs the securities and futures markets and regulates, among others, offers of investments to the public and provides for the licensing of dealing in securities and asset management activities and intermediaries. This legislation is administered by the Securities and Futures Commission (“SFC”). The SFC is also empowered under the SFO to establish standards for compliance as well as codes and guidelines. Our subsidiaries and employees conducting any of the regulated activities specified in the SFO are required to be licensed with the SFC, and are subject to the rules, codes and guidelines issued by the SFC from time to time.\nIndia. \nThe Securities and Exchange Board of India, Reserve Bank of India, the International Financial Services Centres Authority, the Ministry of Corporate Affairs and the Department of Industrial Policy and Promotion are the major regulatory authorities that are capable of issuing directions of a binding nature to our subsidiaries in India.\nJapan. \nIn Japan, our subsidiaries are subject to the Financial Instruments and Exchange Act and the Act on Investment Trusts and Investment Corporations. These laws are administered and enforced by the Japanese Financial Services Agency, which establishes standards for compliance, including capital adequacy and financial soundness requirements, customer protection requirements, and business conduct rules.\nSingapore. \nIn Singapore, our subsidiaries are subject to, among others, the Securities and Futures Act (“SFA”), the Financial Advisers Act (“FAA”) and the subsidiary legislation promulgated pursuant to these Acts, which are administered by the Monetary Authority of Singapore (“MAS”). Our asset management subsidiaries and their employees conducting regulated activities specified in the SFA and/or the FAA are required to be licensed with the MAS.\nOther Non-U.S. Jurisdictions. \nThere are similar legal and regulatory arrangements in effect in many other non-U.S. jurisdictions where our subsidiaries, branches and representative offices, as well as certain joint ventures or companies in which we own minority stakes, are authorized to conduct business. We are also subject to regulation and supervision by, among others, the Securities Commission of The Bahamas, the Comissão de Valores Mobiliários in Brazil, the China Securities Regulatory Commission and the Financial Supervisory Commission in the People’s Republic of China, the Securities Commission in Malaysia, the Comision Nacional Bancaria y de Valores in Mexico, the Romanian Financial Services Authority, the Saudi Capital Market Authority, the Financial Services Commission and the Financial Supervisory Service in South Korea, the Swiss Federal Banking Commission, the Dubai Financial Services Authority in the United Arab Emirates, the National Agency of Perspective Projects in Uzbekistan, and the State Securities Commission of Vietnam.\n14\nTable of Contents\nINTELLECTUAL PROPERTY \nWe have used, registered, and/or applied to register certain trademarks, service marks and trade names to distinguish our sponsored products and services from those of our competitors in the U.S. and in other countries and jurisdictions, including, but not limited to, Alcentra\n®\n, Apera\n®\n, Benefit Street Partners\n®\n, Brandywine Global Investment Management\n®\n, Canvas\n®\n, Clarion Partners\n®\n, ClearBridge Investments\n®\n, Fiduciary Trust International™, Franklin\n®\n, Franklin Mutual Series\n®\n, K2\n®\n, Legg Mason\n®\n, Lexington Partners\n®\n, O’Shaughnessy\n®\n, Putnam\n®\n, Royce\n®\n, Templeton\n®\n and Western Asset Management Company\n®\n. Our trademarks, service marks and trade names are important to us and, accordingly, we enforce our trademark, service mark and trade name rights. The Franklin Templeton\n®\n brand has been, and continues to be, extremely well received both in our industry and with our clients, reflecting the fact that our brand, like our business, is based in part on trust and confidence. If our brand is harmed, our future business prospects may be adversely affected.\nHUMAN CAPITAL RESOURCES\nAs of September 30, 2025, we employed approximately 9,800 employees and operated offices in over 30 countries. We consider our relations with our employees to be satisfactory. We depend upon our key personnel to manage our business, including our portfolio managers, investment analysts, sales and management personnel and other professionals as well as our executive officers and business unit heads. Competition for experienced personnel is significant and from time to time we may experience a loss of valuable personnel. The retention of our key investment personnel is material to the management of our business.\nAs a global asset manager, we are committed to building and maintaining an inclusive workplace that respects and values all employees, To support our efforts, we have established dedicated resources and a global governance structure. We support our business resource groups, regional executive councils, partnerships, programs and other practices that align with this focus. At an enterprise level, we use employee surveys to understand sentiment and engagement in the organization. We also host live forums for leaders to engage directly with employees to help reinforce our culture of open feedback. Our employees have access to a valuable set of equitable and competitive total rewards, which consists of a mix of monetary and non-monetary rewards designed to recognize their time, talents and results.\nWe have developed strategies and initiatives anchored in our core values to prioritize attracting and retaining top talent, promoting an inclusive workplace, driving good decision-making and igniting innovation, all of which we believe are important to our long-term success.\nAVAILABLE INFORMATION \nThe SEC maintains a website that contains current and periodic reports, proxy and information statements, and other information regarding issuers, including Franklin, that file electronically with the SEC, at www.sec.gov. Additional information about Franklin’s filings can also be obtained through our website at www.franklinresources.com under “Investor Relations.” We make available free of charge on our website Franklin’s Annual Report on Form 10‑K, Quarterly Reports on Form 10‑Q, Current Reports on Form 8-K and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act, as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC. Franklin periodically provides other information for investors on its website, such as press releases, presentations and other information about financial performance. The information on our website is not incorporated by reference into, and is not a part of, this Annual Report.\n15\nTable of Contents",
    "item1a": "Item 1A in Part I of this Annual Report.\n28\nTable of Contents",
    "item1b": "Item 1B.\n    \nUnresolved Staff Comments. \nNone.",
    "item1c": "Item 1C.\n    \nCybersecurity.\nRisk Management and Strategy\n \nWe recognize the importance of assessing, identifying and managing material risks from cybersecurity threats. \nOur cybersecurity program focuses on (i) identification of and protection from cybersecurity risks, (ii) detection and analysis of cybersecurity events, (iii) response to and recovery from cybersecurity incidents, and (iv) education and awareness.\n Under our program, designated personnel are responsible for:\n•\nassessing the severity of a cybersecurity incident and associated threat; \n•\ncontaining the threat; \n•\nremediating the threat, including recovery of data and access to systems; \n•\nanalyzing the reporting obligations associated with the incident; and \n•\nperforming post-incident analysis and program improvements.\nOur cybersecurity team is led by our Chief Security Officer (“CSO”) or the CSO’s delegee partnering with our risk, technology, legal, compliance, privacy, human resources, and other applicable business teams.\nIdentification and Protection.\n Our cybersecurity program has established processes to identify and categorize cybersecurity threats and vulnerabilities as part of our risk identification process, pursuant to which we regularly seek to obtain, monitor, assess and respond to evolving threat and vulnerability information. Information about threats and vulnerabilities generally originates from multiple sources, including, but not limited to, government, information-sharing organizations, industry threat intelligence sources, and third parties. The identification of risks is supported through various security controls and testing to help minimize exposure to reported cybersecurity threats and vulnerabilities. These security controls include, but are not limited to, penetration testing, compromise assessments, vulnerability scanning, and various additional internal and external security audits and assessments. In addition, we maintain a \nthird-party risk management\n program that includes an initial and periodic cybersecurity assessment on critical vendors’ security posture and controls.\n \nDetection and Analysis\n.\n Cybersecurity incidents may be detected through a variety of means, which include, but are not limited to, automated event-detection notifications or similar technologies that are monitored by our security operations team, as well as notifications from employees or third-party providers. Once a cybersecurity incident is identified, including third-party cybersecurity events, our incident response team investigates the incident, determines the nature of the event and assesses the severity of the event, including any operational impact and sensitivity of any compromised data.\nResponse and Recovery\n.\n In the event of a cybersecurity incident, our initial focus is to contain the cybersecurity incident as quickly as possible consistent with our incident response plan. Once a cybersecurity incident is contained, we focus on remediation and recovery activities, which depend on the nature of the cybersecurity incident. We have relationships with third-party providers to assist with cybersecurity containment and remediation efforts, including for example, forensic investigations and incident response management. If a cybersecurity incident materially impacts us, or is expected to materially impact us, we promptly notify senior management, the Franklin Board of Directors (“Board”) and/or Franklin Audit Committee, as appropriate based on the severity of the incident. Our response plan also addresses engagement with appropriate individuals and committees with respect to disclosure determinations related to cybersecurity incidents. We review and, if necessary, update our cyber security incident response plan at least annually.\nEducation and Awareness\n. Our cybersecurity education and awareness program for employees and contractors covers a wide range of cyber topics including, but not limited to, policies and procedures, business/technology roles and responsibilities, threats and vulnerabilities, data privacy, confidentiality and asset protection. Our employees and contractors are required to complete mandatory initial onboarding and annual cybersecurity trainings, supplemented by other periodic cyber-related testing and training.\n \n27\nTable of Contents\nGovernance\nOur Board is responsible for the oversight of our cybersecurity risk management program.\n The Board has delegated to the Franklin Audit Committee oversight responsibility regarding cybersecurity risks.\n \nOur CSO reports directly to our Chief Risk and Transformation Officer, each of whom has extensive experience in information security and risk management.\n \nThe Board and/or Audit Committee receive(s) a report on cybersecurity matters, including threats, events and program enhancements, at least annually.\n We update our cybersecurity policies at a minimum annually and benchmark our program to applicable cybersecurity standards and frameworks.\nWe are not aware of any cybersecurity threats or incidents that have materially impacted us during the fiscal year ended September 30, 2025, or that are reasonably likely to materially affect our business, including our business strategy, results of operations or financial condition.\n We routinely face risks of cybersecurity incidents, whether through attempted or actual: cyber-attacks or cyber intrusions, ransomware and other forms of malware, computer viruses, attachments to emails, individual or brand impersonation, phishing, extortion or other scams. Although we make efforts to maintain the security and integrity of our systems, these systems and the proprietary, confidential and personal information that resides on or is transmitted through them, are subject to the risk of a cybersecurity incident or disruption, and there can be no assurances regarding the effectiveness of our security efforts and measures or those of our third-party providers who have access to, transmit, or store such data. For additional information regarding our cybersecurity risks, see our risk factors under"
  }
}