{
  "ticker": "BF.B",
  "cik": "0000014693",
  "company_name": "BROWN FORMAN CORP",
  "filing_date": "2025-06-13",
  "accession": "0000014693-25-000062",
  "primary_doc": "bfb-20250430.htm",
  "item_sections": {
    "item1": "Item 1. \nBusiness\nOverview\nBrown-Forman Corporation (the “Company,” “Brown-Forman,” “we,” “us,” or “our” below) was incorporated under the laws of the State of Delaware in 1933, successor to a business founded in 1870 as a partnership and later incorporated under the laws of the Commonwealth of Kentucky in 1901. We primarily manufacture, distill, bottle, import, export, market, and sell a wide variety of beverage alcohol products under recognized brands. We employ approximately 5,000 people (excluding individuals who work on a part-time or temporary basis) on six continents, including approximately\n \n2,000 people in the United States (approximately 7% of whom are represented by a union) and\n \n800\n \npeople in Louisville, Kentucky, USA, home of our world headquarters. According to International Wine & Spirit Research (IWSR), we are the largest American-owned spirits and wine company with global reach. We are a “controlled company” under New York Stock Exchange rules because the Brown family owns more than 50% of our voting stock. \nFor a discussion of recent developments, see “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations – Executive Summary.”\nBrands\nBeginning in 1870 with Old Forester Kentucky Straight Bourbon Whisky – our founding brand – and spanning the generations since, we have built a portfolio of more than 40 spirit, ready-to-drink (RTD) cocktail, and wine brands that includes some of the best-known and most loved trademarks in our industry. The most important and iconic brand in our portfolio is Jack Daniel’s Tennessee Whiskey, the #1 selling American whiskey in the world.\n1\n Within the Jack Daniel’s portfolio, our super-premium offerings, Jack Daniel’s Triple Mash Blended Straight Whiskey and Jack Daniel’s 12 Year Old, received World’s Best Awards from the World Whiskey Awards 2025. Our premium bourbons, Woodford Reserve and Old Forester, were recognized by the San Francisco Spirits Competition in 2025, where Woodford Double Double Oaked won Gold, Old Forester 1920 won Double Gold (the highest honor), and Old Forester 1897 Bottled in Bond won Gold.\n4\nPrincipal Brands\nJack Daniel’s Tennessee Whiskey\n \nel Jimador Tequilas\n4\nJack Daniel’s RTD\n2\nel Jimador New Mix RTD\nJack Daniel’s Tennessee Honey\nHerradura Tequilas\n6\nGentleman Jack Rare Tennessee Whiskey\n \nKorbel California Champagnes\n5\nJack Daniel’s Tennessee Apple\nKorbel California Brandy\n5\nJack Daniel’s Tennessee Fire\nOld Forester Whiskey Row Series\nJack Daniel’s Single Barrel Collection\n3\nOld Forester Kentucky Straight Bourbon Whisky\nJack Daniel’s Sinatra Select\nOld Forester Single Barrel Straight Bourbon Whisky\nJack Daniel’s Bonded Tennessee Whiskey\nDiplomático Rums\n6\nJack Daniel’s Winter Jack\nChambord Liqueur\nJack Daniel’s Bonded Tennessee Rye\nGin Mare\n6\nJack Daniel’s Triple Mash Blended Straight Whiskey\nThe Glendronach Single Malt Scotch Whiskies\n6\nJack Daniel’s American Single Malt\nBenriach Single Malt Scotch Whiskies\n6\nJack Daniel’s 12 Year Old\nGlenglassaugh Single Malt Scotch Whiskies\n6\nWoodford Reserve Kentucky Bourbon\nFords Gin\nWoodford Reserve Double Oaked\nSlane Irish Whiskey\nWoodford Reserve Kentucky Rye Whiskey\nWoodford Reserve Double Double Oaked\nWoodford Reserve Batch Proof\n1\nIWSR 2024 Data.\n2\nJack Daniel’s RTD includes Jack Daniel’s & Coca-Cola RTD, Jack Daniel’s & Cola, Jack Daniel’s Double Jack, Jack Daniel’s Country Cocktails, and other malt- and spirit-based Jack Daniel’s RTDs.\n3\nThe Jack Daniel’s Single Barrel Collection includes Jack Daniel’s Single Barrel Select, Jack Daniel’s Single Barrel Barrel Proof, Jack Daniel’s Single Barrel - Barrel Proof Rye, and other Jack Daniel’s Single Barrel special-release expressions.\n4\nel Jimador Tequilas comprise all full-strength expressions of el Jimador.\n5\nKorbel is not an owned brand and we sell Korbel products under contract in the United States and other select markets. On May 9, 2025, the Company announced the end of the sales, marketing, and distribution relationship, effective June 30, 2025.\n6\nComprises all expressions of this brand.\nSee “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations – Results of Operations – Fiscal 2025 Brand Highlights” for brand performance details.\nOur vision in marketing is to be the best brand-builder in the industry. We build our brands by investing in platforms that we believe create enduring connections with our consumers. These platforms cover a wide spectrum of activities, including media advertising (TV, radio, print, outdoor, digital, and social), consumer and trade promotions, sponsorships, and visitors’ center programs at our distilleries. We aim to grow our sales and profits by consistently delivering creative, responsible marketing programs that drive brand recognition, brand trial, brand loyalty, and, ultimately, consumer demand around the world.\n5\nMarkets\nWe sell our products in over 170 countries. The United States, our most important market, accounted for 44% of our net sales in fiscal 2025, and the other 56% were outside of the United States. The table below shows the percentage of total reported net sales for our top markets in our three most recent fiscal years:\nPercentage of Total Reported Net Sales by Geographic Area\nYear ended April 30\n2023\n2024\n2025\nUnited States\n47\n \n%\n45\n \n%\n44\n \n%\nMexico\n6\n \n%\n7\n \n%\n7\n \n%\nGermany\n6\n \n%\n6\n \n%\n6\n \n%\nAustralia\n5\n \n%\n5\n \n%\n5\n \n%\nUnited Kingdom\n5\n \n%\n4\n \n%\n4\n \n%\nOther\n31\n \n%\n32\n \n%\n33\n \n%\nTOTAL\n100\n \n%\n100\n \n%\n100\n \n%\nNote: Totals may differ due to rounding\nFor details about net sales in our top markets, see “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations – Results of Operations – Fiscal 2025 Market Highlights.” For details about our reportable segment and for additional geographic information about net sales and long-lived assets, see Note 20 to the Consolidated Financial Statements in “Item 8. Financial Statements and Supplementary Data.” For details on risks related to our global operations, see “",
    "item1a": "Item 1A. Risk Factors, which should be read in conjunction with the foregoing information.\n25\nCybersecurity Governance\nThe Board of Directors oversees management’s processes for identifying and mitigating risks, including cybersecurity risks, to help align our risk exposure with our strategic objectives. The Board of Directors has delegated oversight of risks related to cybersecurity to the Audit Committee.\n The Audit Committee regularly reports on its activities and findings with respect to risks from cybersecurity threats to the full \nBoard of Directors\n.\nThe Audit Committee oversees our cybersecurity posture to assess key strategic, operational, and compliance risks.\n \nOur CIO and CISO update the Audit Committee quarterly regarding cyber risks, the threat landscape, reports on our security roadmap, risk mitigation and governance, and any cybersecurity incidents.\nThe Company’s Information Technology, Enterprise Security, Internal Audit, as well as the Legal and Privacy teams work closely to identify issues and incidents in a timely manner and report them to senior leadership, the Board of Directors, and regulatory bodies, as appropriate.\n Assessing, identifying, and managing cybersecurity risks are integrated into our overall enterprise risk management (ERM) framework that provides risk quantification, scenario analysis to determine the potential impact on the enterprise, and processes to manage risk within the parameters of the organization’s risk appetite. Additionally, ERM provides support to the decision-making process to enable cybersecurity risk owners to accomplish the desired level of asset protection and alignment consistent with the organization’s strategy. The ERM update is presented annually to the Audit Committee and Board of Directors, including the management of top risks and the review of emerging risks.\n26",
    "item1b": "Item 1B.\n Unresolved Staff Comments\nNone.",
    "item1c": "Item 1C.\n Cybersecurity\nCybersecurity Risk Management Strategy and Processes\nOur \nChief Information Security Officer (CISO)\n leads our Global Information Security team, reports to the Chief Information Officer (CIO), and meets regularly with other members of senior management.\n \nOur CISO holds advanced degrees in Computer Science and Business Administration, in addition to relevant IT and cybersecurity certifications from organizations such as the EC Council, ISACA, and CSA. She has served in various IT roles for over 20 years, including leading the IT Security function.\nOur Global Information Security team is responsible for the information security strategy, policy, security engineering, operations, and cyberthreat detection and response. Our Global Information Security team, which includes a security operations center, seeks to protect the company against reasonably foreseeable cyberthreats and risks. The cybersecurity team members have the qualifications and certifications required for their roles. In addition, they have relevant industry experience in selecting, deploying, and operating cybersecurity technologies, initiatives, and processes globally. In order to stay ahead of potential threats and enhance our overall security posture, we rely on threat intelligence as well as other information obtained from governmental, public, or private sources, including external consultants that we engage.\nWe have made significant investments in people, processes, and technology to protect the confidentiality, integrity, and availability of our IT systems. As part of that effort, we utilize the National Institute of Standards and Technology Cybersecurity Framework as a guide for our security controls. We are continuing to advance towards an architecture based on “Zero-Trust” principles, where we continuously validate the identity and security posture of every user, device, application, or network component trying to leverage our IT resources. We temper this architecture with a business-risk-based approach that ensures we protect our digital assets while aligning our security measures with our overall organizational goals and priorities. In addition, our employees undergo annual security awareness training to improve their understanding of cybersecurity threats, and their ability to identify and escalate potential threats.\nIn the event of an incident, we leverage a multi-layered set of plans that include Endpoint Detection and Response software, Security Information and Event Management tools for detection, a Cybersecurity Incident Response Plan, and a Disaster Recovery Response Plan for recovery. The recovery plans outline the steps to be followed from incident detection to mitigation, recovery, and notification, including notifying designated functional leadership teams, the Disclosure Committee, the General Counsel, other senior leadership, and the Board of Directors, as appropriate. These designated leaders assess various factors, including operational, financial, legal, regulatory, and reputational impacts on the Company to determine the materiality of the incident and the appropriate response.\nWe have established a tiered risk management strategy that helps us to evaluate our ability to protect assets (data and systems) by identifying, assessing, and prioritizing associated risk through, among other tools, \nthe use of a non-affiliated third-party assessor\n, audits by our internal audit team, tabletop exercises, penetration and vulnerability tests, and simulations.\n We report the results of these assessments to the Audit Committee of the Board of Directors.\nWe rely on third-party service providers to deliver our products and services to our customers, including many of our technology initiatives. A cybersecurity incident at a supplier, subcontractor, or joint venture partner could materially adversely impact us. \nWe evaluate third-party providers from a cybersecurity risk perspective, which may include an assessment of that service provider’s cybersecurity posture through a questionnaire, and include security and privacy addenda to our contracts where applicable.\n However, we rely on the third parties we use to implement security programs commensurate with their risk, and we cannot ensure in all circumstances that their efforts will be successful.\nOur systems periodically experience directed attacks intended to lead to interruptions and delays in our service and operations as well as loss, misuse, or theft of personal information (of third parties, employees and their beneficiaries, and customers) and other data. \nThese incidents have not had a material impact on our services, systems, or business.\n However, despite our capabilities, processes, and other security measures we employ, we may not be aware of all vulnerabilities or might not accurately assess the risk of an incident. Additional information on cybersecurity risks we face can be found in"
  }
}