{
  "ticker": "BG",
  "cik": "0001996862",
  "company_name": "Bunge Global SA",
  "filing_date": "2025-02-20",
  "accession": "0001996862-25-000008",
  "primary_doc": "bg-20241231.htm",
  "item_sections": {
    "item1": "Item 1. Business-Information About Our Executive Officers and Key Employees,\" which information is incorporated herein by reference.\nItem 11.    \nExecutive Compensation\nWe will provide information that is responsive to this Item 11 in our definitive proxy statement for our 2025 Annual Meeting under the captions \"Executive Compensation Highlights,\" \"Director Compensation,\" \"Human Resources and Compensation Committee Report,\" and possibly elsewhere therein. That information is incorporated in this Item 11 by reference.\nItem 12.    \nSecurity Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nWe will provide information that is responsive to this Item 12 in our definitive proxy statement for our 2025 Annual Meeting under the caption \"Share Ownership of Directors, Executive Officers and Principal Shareholders\" and possibly elsewhere therein. That information is incorporated in this Item 12 by reference. The information required by this item with respect to our long-term incentive plan information is found in Part II of this Annual Report on Form 10-K under the caption \"Item 5. Market for Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities-Securities Authorized for Issuance Under Equity Compensation Plans,\" which information is incorporated herein by reference.\nItem 13.    \nCertain Relationships and Related Transactions, and Director Independence\nWe will provide information that is responsive to this Item 13 in our definitive proxy statement for our 2025 Annual Meeting under the captions \"Corporate Governance-Board Independence,\" \"Certain Relationships and Related Transactions\" and possibly elsewhere therein. That information is incorporated in this Item 13 by reference.\nItem 14.    \nPrincipal Accounting Fees and Services\nWe will provide information that is responsive to this Item 14 in our definitive proxy statement for our 2025 Annual Meeting under the caption \"Appointment of Independent Auditor for U.S. Securities Law Reporting and Reelection of Statutory Auditor for Swiss Law Purposes\" and possibly elsewhere therein. That information is incorporated in this Item 14 by reference.\n64\nTable of Contents\nPART IV\nItem 15.    \nExhibits, Financial Statement Schedules\na.\n(1) (2) Financial Statements and Financial Statement Schedules\nSee \"Index to Consolidated Financial Statements\" on page F-1 and Financial Statement Schedule II—Valuation and Qualifying Accounts on page E-1 of this Annual Report on Form 10-K.\na.\n(3) Exhibits\nThe exhibits listed in the accompanying index to exhibits are filed or incorporated by reference as part of this Form 10-K.\nCertain of the agreements filed as exhibits to this Form 10-K contain representations and warranties by the parties to the agreements that have been made solely for the benefit of the parties to the agreement, which may have been included in the agreement for the purpose of allocating risk between the parties rather than establishing matters as facts and may have been qualified by disclosures that were made to the parties in connection with the negotiation of these agreements and not necessarily reflected in the agreements. Accordingly, the representations and warranties contained in these agreements may not describe the actual state of affairs of Bunge Global SA or its subsidiaries as of the date that these representations and warranties were made or at any other time. Investors should not rely on these representations and warranties as statements of fact. Additional information about Bunge \nGlobal SA\n and its subsidiaries may be found elsewhere in this Annual Report on Form 10-K and Bunge \nGlobal SA'\ns other public filings, which are available without charge through the SEC's website at www.sec.gov.\nSee \"Index to Exhibits\" set forth below.\nExhibit\nNumber\n \nDescription\n2.1\n+++\nBusiness Combination Agreement, dated as of June 13, 2023, by and among Bunge Limited, Viterra Limited and the Sellers as defined and listed therein (incorporated by reference from Bunge Limited’s Form 8-K filed on June 15, 2023)\n2.2\nAgreement and Plan of Merger, dated as of October 31, 2023, by and among Bunge Limited, Horizon Merger Company Limited and Bunge Global S.A. (incorporated by reference from Bunge Limited’s Form 8-K filed November 1, 2023)\n2.3\n+++\nAmendment, dated April 10, 2024, to the Business Combination Agreement dates as of June 13, 2023, by and among Bunge Limited, Viterra Limited and the Sellers as defined and listed therein (incorporated by reference from the Registrant's Form 10-Q filed April 24, 2024)\n3.1\n \nArticles of Association of Bunge Global SA, as amended, effective December 6, 2024 (incorporated by reference from the Registrant’s Form 8-K filed on December 9, 2024)\n3.2\nOrganizational Regulations, dated as of October 31, 2023 (incorporated by reference from the Registrant’s Form 8-K12G3 filed on November 1, 2023)\n4.1\nThe instruments defining the rights of holders of the long-term debt securities of Bunge and its subsidiaries are omitted pursuant to Item 601(b)(4)(iii) of Regulation S-K. Bunge hereby agrees to furnish copies of these instruments to the Securities and Exchange Commission upon request\n4.2\n*\nDescription of Registrant’s Securities Registered Pursuant to Section 12 of the Securities Exchange Act of 1934 \n10.1\nSixth Amended and Restated Pooling Agreement, dated as of August 31, 2020, among Bunge Funding Inc., Bunge Management Services Inc., as Servicer, and The Bank of New York, as Trustee (incorporated by reference from Bunge Limited's Form 10-K filed February 19, 2021\n)\n10.2\nTwenty-Fifth Amendment to Receivables Transfer Agreement, dated May 21, 2024, among Bunge Securitization B.V., as Seller, Koninklijke Bunge B.V., as Master Servicer and Subordinated Lender, Coöperatieve Rabobank U.A., as Administrative Agent, Committed Purchaser and Purchaser Agent and on behalf of its Conduit Purchaser, Bunge Global SA, as Performance Undertaking Provider, Crédit Agricole Corporate & Investment Bank, as Sustainability Co-ordinator, and the Conduit Purchasers, Committed Purchasers and Purchaser Agents party thereto (incorporated by reference from the Registrant’s Form 10-Q filed on August 1, 2024)\n65\nTable of Contents\nExhibit\nNumber\nDescription\n10.3\nTwenty-Sixth Amendment to Receivables Transfer Agreement, dated September 30, 2024, among Bunge Securitization B.V., as Seller, Koninklijke Bunge B.V., as Master Servicer and Subordinated Lender, Coöperatieve Rabobank U.A., as Administrative Agent, Committed Purchaser and Purchaser Agent and on behalf of its Conduit Purchaser, Bunge Global SA, as Performance Undertaking Provider, Crédit Agricole Corporate & Investment Bank, as Sustainability Co-ordinator, Bunge Agribusiness Iberica, S.L.U., as New Spanish Originator, and the Conduit Purchasers, Committed Purchasers and Purchaser Agents party thereto (incorporated by reference from the Registrant’s Form 10-Q filed on October 30, 2024)\n10.4\nTwenty-Seventh Amendment to Receivables Transfer Agreement, dated December 3, 2024, among Bunge Securitization B.V., as Seller, Koninklijke Bunge B.V., as Master Servicer and Subordinated Lender, Coöperatieve Rabobank U.A., as Administrative Agent, Committed Purchaser and Purchaser Agent and on behalf of its Conduit Purchaser, Bunge Global SA, as Performance Undertaking Provider, Crédit Agricole Corporate & Investment Bank, as Sustainability Co-ordinator, and the Conduit Purchasers, Committed Purchasers and Purchaser Agents party thereto (incorporated by reference from the Registrant’s Form 8-K filed on December 5, 2024)\n10.5\n+++\nEighth Amended and Restated Receivables Transfer Agreement, dated December 18, 2023, among Bunge Securitization B.V., as Seller, Koninklijke Bunge B.V., as Master Servicer and Subordinated Lender, Crédit Agricole Corporate & Investment Bank, as Sustainability Co-ordinator, Coöperatieve Rabobank U.A., as Administrative Agent and Purchaser Agent, Bunge Global SA, as Performance Undertaking Provider, and the persons from time to time party thereto as Conduit Purchasers, Committed Purchasers and Purchaser Agents (incorporated by reference from the Registrant’s Form 8-K filed on December 20, 2023)\n10.6\nUnadjusted Applicable Margin Letter, dated December 18, 2023, among Bunge Securitization B.V., as Seller, Bunge Global SA, as Performance Undertaking Provider, Coöperatieve Rabobank U.A., as Administrative Agent and a Purchaser Agent, and the Purchaser Agents party thereto (incorporated by reference from the Registrant’s Form 8-K filed on December 20, 2023)\n10.7\nAmendment to and Restatement of the Servicing Agreement, dated May 26, 2016, among Bunge Securitization B.V., as Seller, Bunge North America Capital, Inc., as U.S. Intermediate Transferor, Coöperatieve Rabobank U.A., as Italian Intermediate Transferor, Koninklijke Bunge B.V., as Master Servicer, the persons named therein as Sub-Servicers, the persons named therein as Committed Purchasers, and Coöperatieve Rabobank U.A., as Administrative Agent (incorporated by reference from Bunge Limited’s Form 10-K filed on February 28, 2017)\n10.8\nSecond Amendment to the Servicing Agreement, dated June 30, 2016, among Bunge Securitization B.V., as Seller, Bunge North America Capital, Inc., as U.S. Intermediate Transferor, Coöperatieve Rabobank U.A., as Italian Intermediate Transferor, Koninklijke Bunge B.V., as Master Servicer, the persons named therein as Sub-Servicers, the persons named therein as Committed Purchasers, and Coöperatieve Rabobank U.A., as Administrative Agent  (incorporated by reference from Bunge Limited’s Form 10-K filed on February 19, 2021)\n10.9\nThird Amendment to the Servicing Agreement, dated February 19, 2019, among Bunge Securitization B.V., as Seller, Bunge North America Capital, Inc., as U.S. Intermediate Transferor, Coöperatieve Rabobank U.A., as Italian Intermediate Transferor, Koninklijke Bunge B.V., as Master Servicer, the persons named therein as Sub-Servicers, the persons named therein as Committed Purchasers, and Coöperatieve Rabobank U.A., as Administrative Agent (incorporated by reference from Bunge Limited’s Form 10-K filed on February 19, 2021)\n10.10\nAmended and Restated Performance and Indemnity Agreement, dated June 21, 2023, by and among  Bunge Limited and Bunge Global SA, as Performance Undertaking Provider and Coöperatieve Rabobank U.A., as Administrative Agent to the Receivables Transfer Agreement dated June 1, 2011, as amended (incorporated by reference from Bunge Limited’s Form 8-K filed on June 26, 2023)\n10.11\nSubordinated Loan Agreement, dated June 1, 2011, among Koninklijke Bunge B.V. (f/k/a Bunge Finance B.V.), as Subordinated Lender, Bunge Securitization B.V., as Seller, Koninklijke Bunge B.V. (f/k/a Bunge Finance B.V.), as Master Servicer, and Coöperatieve Rabobank U.A. (f/k/a Coöperatieve Centrale Raiffeisen-Boerenleenbank B.A.), as Administrative Agent (incorporated by reference from Bunge Limited’s Form 10-Q filed on August 9, 2011)\n66\nTable of Contents\nExhibit\nNumber\nDescription\n10.12\nFirst Amendment to the Subordinated Loan Agreement, dated August 27, 2019, among Koninklijke Bunge B.V. (f/k/a Bunge Finance B.V.), as Subordinated Lender, Bunge Securitization B.V., as Seller, Koninklijke Bunge B.V. (f/k/a Bunge Finance B.V.) as Master Servicer, and Coöperatieve Rabobank U.A. (f/k/a Coöperatieve Centrale Raiffeisen-Boerenleenbank B.A.), as Administrative Agent  (incorporated by reference from Bunge Limited’s Form 10-K filed on February 19, 2021)\n10.13\n++\nU.S. Receivables Purchase Agreement, dated June 1, 2011, among Bunge North America, Inc., Bunge Oils, Inc., Bunge North America (East), LLC, Bunge Milling, Inc., Bunge North America (OPD West), Inc., each as a Seller, respectively, Bunge Finance B.V., as Seller Agent, and Bunge North America Capital, Inc., as the Buyer (incorporated by reference from Bunge Limited’s Form 10-Q filed on August 9, 2011)\n10.14\n \nFirst Amendment to U.S. Receivables Purchase Agreement, dated June 15, 2012, among Bunge North America, Inc., Bunge Oils, Inc., Bunge North America (East), LLC, Bunge Milling, Inc., Bunge North America (OPD West), Inc., each as a Seller, respectively, Bunge Finance B.V., as Seller Agent, and Bunge North America Capital, Inc., as the Buyer (incorporated by reference from Bunge Limited’s Form 10-Q filed on August 1, 2012)\n10.15\n \nSecond Amendment to the U.S. Receivables Purchase Agreement, dated June 30, 2016, among Bunge North America, Inc., Bunge Oils, Inc., Bunge North America (East), LLC, Bunge Milling, Inc., Bunge North America (OPD West), Inc., each as a Seller, respectively, Koninklijke Bunge B.V., as Seller Agent, Bunge North America Capital, Inc., as the Buyer, and Coöperatieve Rabobank U.A., as Administrative Agent (incorporated by reference from Bunge Limited’s Form 10-K filed on February 28, 2017)\n10.16\n++\nU.S. Intermediate Transfer Agreement, dated June 1, 2011, among Bunge North America Capital, Inc., as the Transferor, Bunge Finance B.V., as the Transferor Agent, and Bunge Securitization B.V., as the Transferee (incorporated by reference from Bunge Limited’s Form 10-Q filed on August 9, 2011)\n10.17\n \nFirst Amendment to U.S. Intermediate Transfer Agreement, dated June 15, 2012, among Bunge North America Capital, Inc., as the Transferor, Bunge Finance B.V., as Transferor Agent, and Bunge Securitization B.V., as the Transferee (incorporated by reference from Bunge Limited’s Form 10-Q filed on August 1, 2012)\n10.18\nFifth Amended and Restated Pre-Export Financing Agreement, dated November 6, 2020, among the Pre-Export Borrowers party thereto, the Pre-Export Lenders party thereto, Sumitomo Mitsui Banking Corporation, as Pre-Export Administrative Agent, and Banco Rabobank International Brasil S.A., as Pre-Export Collateral Agent (incorporated by reference from Bunge Limited’s Form 10-K filed on February 19, 2021)\n10.19\nTenth Amended and Restated Guaranty, dated as of July 16, 2021, by Bunge Limited, as Guarantor, to Coöperatieve Rabobank U.A., New York Branch, in its capacity as Letter of Credit Agent, and the Letter of Credit Banks named therein, JPMorgan Chase Bank, N.A., as Administrative Agent under the Liquidity Agreement, and The Bank of New York Mellon, as Collateral Agent under the Security Agreement and\nTrustee under the Pooling Agreement (incorporated by reference from Bunge Limited’s Form 8-K filed on July 19, 2021)\n10.20\nCredit Agreement, dated as of July 7, 2023, by and among Bunge Limited Finance Corp., as Borrower, CoBank, ACB, as Administrative Agent and Lead Arranger, and the several lenders from time to time parties thereto (incorporated by reference from Bunge Limited’s Form 8-K filed on July 11, 2023)\n10.21\nGuaranty, dated as of July 7, 2023, by Bunge Limited and Bunge Global SA, as Guarantor, to CoBank, ACB, as Administrative Agent under the Credit Agreement incorporated as Exhibit 10.20 hereto (incorporated by reference from Bunge Limited’s Form 8-K filed July 11, 2023)\n10.22\nRevolving Credit Agreement, dated as of March 1, 2024, among Bunge Limited Finance Corp., as Borrower, JPMorgan Chase Bank, N.A., as Administrative Agent, Sumitomo Mitsui Banking Corporation, as Syndication Agent, Banco Bilbao Vizcaya Argentaria, S.A. New York Branch, Bank of America, N.A., Bank of Montreal, BNP Paribas, Citibank, N.A., Coöperatieve Rabobank U.A., New York Branch, Crédit Agricole Corporate and Investment Bank, Deutsche Bank Securities Inc., ING Bank N.V., Mizuho Bank, Ltd. and Wells Fargo Bank, N.A., as Documentation Agents, and the several lenders from time to time parties thereto (incorporated by reference from the Registrant’s Form 8-K filed on March 6, 2024)\n10.23\nGuaranty, dated as of March 1, 2024, by Bunge Global SA to JPMorgan Chase Bank, N.A., in its capacity as Administrative Agent under the Revolving Credit Agreement incorporated as Exhibit 10.22 hereto (incorporated by reference from the Registrant’s Form 8-K filed on March 6, 2024)\n67\nTable of Contents\nExhibit\nNumber\nDescription\n10.24\n+++\nSecond Amendment Agreement to Facility Agreement, dated as of June 21, 2023, by and among Bunge Finance Europe B.V., as Borrower, BNP Paribas, Crédit Agricole Corporate and Investment Bank, ING Bank N.V., Natixis and SMBC Bank International Plc as Arrangers, BNP Paribas, as Sustainability Co-ordinator, Natixis, as Lead Sustainability Co-ordinator, and Crédit Agricole Corporate and Investment Bank, as Agent, and certain lenders party thereto (incorporated by reference from Bunge Limited’s Form 8-K filed on June 26, 2023)\n10.25\nFirst Amended and Restated Guaranty, dated as of June 21, 2023, by Bunge Limited, as Guarantor, to Crédit Agricole Corporate and Investment Bank, as Administrative Agent to the Facility Agreement incorporated as Exhibit 10.24 hereto (incorporated by reference from Bunge Limited’s Form 8-K filed on June 26, 2023)\n10.26\nFirst Amended and Restated Revolving Credit Agreement, dated as of April 12, 2024, by and among Bunge Limited Finance Corp., as Borrower, Coöperatieve Rabobank U.A., New York Branch, as Administrative Agent, Sumitomo Mitsui Banking Corporation, as Syndication Agent, BNP Paribas, Citibank, N.A., Natixis, New York Branch and U.S. Bank National Association, as Co-Documentation Agents, and the several lenders from time to time parties thereto (incorporated by reference from the Registrant’s Form 8-K filed on April 16, 2024)\n10.27\nFirst Amended and Restated Guaranty, dated as of April 12, 2024, by Bunge Global SA, as Guarantor, to Coöperatieve Rabobank U.A., New York Branch, as Administrative Agent under the First Amended and Restated Revolving Credit Agreement incorporated as Exhibit 10.26 hereto (incorporated by reference from the Registrant’s Form 8-K Form 8-K filed on April 16, 2024)\n10.28\nSecond Amendment to Term Loan Agreement, dated as of June 21, 2023, by and among Bunge Limited Finance Corp., as Borrower, Sumitomo Mitsui Banking Corporation, as Administrative Agent, and the several lenders from time to time parties thereto (incorporated by reference from Bunge Limited’s Form 8-K filed on June 26, 2023)\n10.29\nSecond Amended and Restated Guaranty, dated as of June 21, 2023, by Bunge Limited and Bunge Global SA, as Guarantor, to Sumitomo Mitsui Banking Corporation, as Administrative Agent under the Term Loan Agreement incorporated as Exhibit 10.28 hereto (incorporated by reference from Bunge Limited’s Form 8-K filed on June 26, 2023)\n10.30\nFirst Amended and Restated Term Loan Agreement, dated as of June 21, 2023, by and among Bunge Limited Finance Corp., as Borrower, JPMorgan Chase Bank, N.A., as Administrative Agent, Sumitomo Mitsui Banking Corporation, Bank of America, N.A., BNP Paribas, Citibank, N.A., Coöperatieve Rabobank U.A., New York Branch, ING Bank N.V., JPMorgan Chase Bank, N.A., Mizuho Bank, Ltd., PNC Bank, National Association, Royal Bank of Canada, The Toronto-Dominion Bank, New York Branch, Truist Bank, U.S. Bank National Association and Wells Fargo Bank, National Association, as Syndication Agents, and the several lenders from time to time parties thereto (incorporated by reference from Bunge Limited’s Form 8-K filed on June 26, 2023)\n10.31\nFirst Amended and Restated Guaranty, dated as of June 21, 2023, by Bunge Limited and Bunge Global SA, as Guarantor, to JPMorgan Chase Bank, N.A., as Administrative Agent to the First Amended and Restated Term Loan Agreement incorporated as Exhibit 10.30 hereto (incorporated by reference from Bunge Limited’s Form 8-K filed on June 26, 2023)\n10.32\n+++\nFirst Amended and Restated Facility Agreement, dated as of March 1, 2024, by and among Bunge Finance Europe B.V., as Borrower, BNP Paribas, Crédit Agricole Corporate and Investment Bank, ING Bank N.V., Natixis and SMBC Bank International Plc as Arrangers, Natixis and BNP Paribas, as Sustainability Co-ordinators, and Crédit Agricole Corporate and Investment Bank, as Agent, and certain lenders party thereto (incorporated by reference from the Registrant’s Form 8-K filed March 6, 2024)\n10.33\nAccordion Increase Certificate, dated as of March 1, 2024, under the First Amended and Restated Facility Agreement incorporated as Exhibit 10.32 hereto (incorporated by reference from the Registrant’s Form 8-K filed on March 6, 2024)\n10.34\nFirst Amendment and Waiver Agreement, dated as of March 1, 2024, under the First Amended and Restated Facility Agreement incorporated as Exhibit 10.32 hereto (incorporated by reference from the Registrant’s Form 8-K filed March 6, 2024)\n10.35\nFirst Amended and Restated Guaranty, dated as of March 1, 2024, by Bunge Global SA to Crédit Agricole Corporate and Investment Bank, as the facility agent to the First Amended and Restated Facility Agreement incorporated as Exhibit 10.32 hereto (incorporated by reference from the Registrant’s Form 8-K filed March 6, 2024)\n10.36\n+\nBunge 2009 Equity Incentive Plan, as amended and restated (incorporated by reference from the Registrant's Form 8-K12G3 filed November 1, 2023)\n10.37\n+\nForm of Nonqualified Stock Option Award Agreement under the Bunge 2009 Equity Incentive Plan (incorporated by reference from Bunge Limited’s Form 10-K filed March 1, 2011)\n68\nTable of Contents\nExhibit\nNumber\nDescription\n10.38\n+\nBunge 2016 Equity Incentive Plan, as amended and restated (incorporated by reference from the Registrant’s Form 8-K12G3 filed November 1, 2023)\n10.39\n+\nForm of Global Stock Option Agreement under the Bunge 2016 Equity Incentive Plan (incorporated by reference from Bunge Limited’s Form 10-K filed February 28, 2017)\n1\n0.40\n+\nForm of Global Restricted Stock Unit Agreement under the Bunge 2016 Equity Incentive Plan (incorporated by reference from the Registrant’s Form 10-K filed February 22, 2024)\n10.41\n+\nForm of Global Performance Unit Agreement under the Bunge 2016 Equity Incentive Plan (incorporated by reference from the Registrant’s Form 10-K filed February 22, 2024)\n10.42\n+\nBunge 2024 Long-Term Incentive Plan (incorporated by reference from the Registrant’s Form 8-K filed on May 16, 2024)\n10.43\n*+\nForm of Global Restricted Stock Unit Agreement under the Bunge 2024 Long-Term Incentive Plan\n10.44\n*+\nForm of Global Performance Unit Agreement under the Bunge 2024 Long-Term Incentive Plan\n10.45\n+\nBunge 2017 Non-Employee Directors Equity Incentive Plan, as amended and restated (incorporated by reference from the Registrant’s Form 8-K12G3 filed November 1, 2023)\n10.46\n+\nForm of Restricted Stock Unit Award Agreement under the Bunge 2017 Non-Employee Directors Equity Incentive Plan (incorporated by reference from the Registrant’s Form 10-K filed February 22, 2024)\n10.47\n+\nBunge Excess Benefit Plan effective January 1, 2009, and amendments thereto through January 1, 2023 (frozen plan as of December 31, 2022) (incorporated by reference from the Registrant’s Form 10-K filed February 22, 2024)\n10.48\n+\nBunge Excess Contribution Plan (Amended and Restated as of January 1, 2023) (incorporated by reference from the Registrant’s Form 10-K filed February 22, 2024)\n10.49\n+\nBunge Supplemental Excess Contribution Plan effective January 1, 2018, and amendment thereto through January 1, 2020 (incorporated by reference from the Registrant’s Form 10-K filed February 22, 2024)\n10.50\n+\nBunge Employee Deferred Compensation Plan effective January 1, 2008, and amendment thereto through November 1, 2023 (incorporated by reference from the Registrant’s Form 10-K filed February 22, 2024)\n10.51\n+\nBunge Annual Incentive Plan effective January 1, 2023, and amendment thereto through November 1, 2023 (incorporated by reference from the Registrant’s Form 10-K filed February 22, 2024)  \n10.52\n+\nBunge Executive Severance Plan (incorporated by reference from Bunge Limited’s Form 10-Q filed on July 27, 2022)\n10.53\n+\nExecutive Employment Agreement, dated as of December 20, 2023, between Bunge Management Services, Inc. and Gregory A. Heckman (incorporated by reference from the Registrant’s Form 10-K filed February 22, 2024)\n10.54\n+\nExecutive Employment Agreement, dated as of December 20, 2023, between Bunge Management Services, Inc. and John W. Neppl (incorporated by reference from the Registrant’s Form 10-K filed February 22, 2024)\n19.1\n*\nInsider Trading Policy\n21.1\n*\nSubsidiaries of the Registrant\n22.1\n*\nSubsidiary Issuers of Guaranteed Securities\n23.1\n*\nConsent of Deloitte & Touche LLP\n31.1\n*\nCertification of Bunge Global SA's Chief Executive Officer pursuant to Section 302 of the Sarbanes Oxley Act\n31.2\n*\nCertification of Bunge Global SA's Chief Financial Officer pursuant to Section 302 of the Sarbanes Oxley Act\n32.1\n**\nCertification of Bunge Global SA's Chief Executive Officer pursuant to Section 906 of the Sarbanes Oxley Act\n32.2\n**\nCertification of Bunge Global SA's Chief Financial Officer pursuant to Section 906 of the Sarbanes Oxley Act\n97.1\nPolicy Relating to Recovery of Erroneously Awarded Compensation (incorporated by reference from the Registrant’s Form 10-K filed February 22, 2024)\n69\nTable of Contents\nExhibit\nNumber\nDescription\n(101) Interactive Data Files (submitted electronically herewith)\n101 SCH\n*\nXBRL Taxonomy Extension Schema Document\n101 CAL\n*\nXBRL Taxonomy Extension Calculation Linkbase Document\n101 LAB\n*\nXBRL Taxonomy Extension Labels Linkbase Document\n101 PRE\n*\nXBRL Taxonomy Extension Presentation Linkbase Document\n101 DEF\n*\nXBRL Taxonomy Extension Definition Linkbase Document\n101 INS\nXBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n104 \nCover Page Interactive Data File (Formatted as Inline XBRL and contained in Exhibit 101)\nSubsidiary Issuers of Guaranteed Securities\n*\nFiled herewith.\n**\nFurnished herewith.\n+\nDenotes a management contract or compensatory plan or arrangement.\n++\nPortions of this exhibit have been omitted and filed separately with the Securities and Exchange Commission as part of an application for confidential treatment pursuant to Rule 24b-2 of the Securities Exchange Act of 1934, as amended.\n+++\nCertain information contained in this exhibit, marked by [***], has been omitted because it (i) is not material and (ii) is the type of information that the registrant treats as private or confidential.\n70\nTable of Contents\nBUNGE GLOBAL SA\nSchedule II—Valuation and Qualifying Accounts\n(US$ in millions)\nDescription\nBalance at\nbeginning of\nperiod\nCharged to\ncosts and\nexpenses\nCharged to\nother\naccounts\n(b)\nDeductions\nfrom reserves\n \nBalance at\nend of period\nFOR THE YEAR ENDED\nDECEMBER 31, 2022\n \n \n \n \n \n \nAllowances for doubtful accounts\n(a)\n$\n132\n \n66\n \n5\n \n(\n67\n)\n(c)\n$\n136\n \nAllowances for secured advances to suppliers\n(d)\n$\n39\n \n13\n \n3\n \n(\n12\n)\n$\n43\n \nAllowances for recoverable taxes\n$\n44\n \n3\n \n1\n \n(\n12\n)\n$\n36\n \nIncome tax valuation allowances\n$\n297\n \n17\n \n(\n7\n)\n(\n38\n)\n \n$\n269\n \nFOR THE YEAR ENDED\nDECEMBER 31, 2023\n \n \n \n \n \n \nAllowances for doubtful accounts\n(a)\n$\n136\n \n71\n \n3\n \n(\n74\n)\n(c)\n$\n136\n \nAllowances for secured advances to suppliers\n(d)\n$\n43\n \n9\n \n3\n \n(\n16\n)\n$\n39\n \nAllowances for recoverable taxes\n$\n36\n \n14\n \n2\n \n(\n17\n)\n$\n35\n \nIncome tax valuation allowances\n$\n269\n \n391\n \n2\n \n(\n72\n)\n$\n590\n \nFOR THE YEAR ENDED\nDECEMBER 31, 2024\n \n \n \n \n \n \nAllowances for doubtful accounts\n(a)\n$\n136\n \n51\n \n(\n11\n)\n(\n63\n)\n(c)\n$\n113\n \nAllowances for secured advances to suppliers\n(d)\n$\n39\n \n5\n \n(\n8\n)\n(\n4\n)\n$\n32\n \nAllowances for recoverable taxes\n$\n35\n \n6\n \n(\n7\n)\n(\n9\n)\n$\n25\n \nIncome tax valuation allowances\n$\n590\n \n41\n \n(\n16\n)\n(\n20\n)\n$\n595\n \n(a)\nIncludes allowance for doubtful accounts for current and non-current trade accounts receivables.\n(b)\nConsists primarily of foreign currency translation adjustments.\n(c)\nIncludes write-offs of uncollectible accounts and recoveries.\n(d)\nIncludes allowances for secured advances to suppliers for current and non-current secured advances.\nE-1\nTable of Contents\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\n \n \nPage\nConsolidated Financial Statements\n \n \nReport of Independent Registered Public Accounting Firm (PCAOB ID No. \n34\n)\n \nF-\n2\nConsolidated Statements of Income for the Years Ended December 31, 2024, 2023 and 2022\n \nF-\n4\nConsolidated Statements of Comprehensive Income for the Years Ended December 31, 2024, 2023 and 2022\n \nF-\n5\nConsolidated Balance Sheets at December 31, 2024 and 2023\n \nF-\n6\nConsolidated Statements of Cash Flows for the Years Ended December 31, 2024, 2023 and 2022\n \nF-\n7\nConsolidated Statements of Changes in Equity and Redeemable Noncontrolling Interests for the Years Ended December 31, 2024, 2023 and 2022\n \nF-\n8\nNotes to the Consolidated Financial Statements\n \nF-\n11\nF-1\nTable of Contents\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and the Board of Directors of Bunge Global SA    \n                                \nOpinion on the Financial Statements\n        We have audited the accompanying consolidated balance sheets of Bunge Global SA and subsidiaries (the \"Company\") as of December 31, 2024 and 2023, and the related consolidated statements of income, comprehensive income, cash flows, and changes in equity and redeemable noncontrolling interests, for each of the three years in the period ended December 31, 2024, and the related notes and the schedule listed in the Index at Item 15 (collectively referred to as the \"financial statements\"). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with accounting principles generally accepted in the United States of America.\n        We have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of December 31, 2024, based on the criteria established in \nInternal Control-Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated February 20, 2025, expressed an unqualified opinion on the Company's internal control over financial reporting.\n \nBasis for Opinion\n        These financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\n        We conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion. \n \nCritical Audit Matter\n        The critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nReadily Marketable Inventories and Physically Settled Forward Purchase and Sale Contracts - Refer to Notes 1 and 15 to the financial statements \nCritical Audit Matter Description\n        The Company records agricultural commodity inventories, referred to as readily marketable inventories (RMI), and physically settled forward purchase and sale contracts at fair value with changes in fair value recorded in earnings as a component of cost of goods sold. The Company values RMI and physically settled forward purchase and sale contracts primarily using Level 1 inputs, such as public exchange quotes of commodity futures, broker or dealer quotations. A portion of the value, however, is derived using significant unobservable inputs referred to as Level 3 inputs, such as management estimates regarding costs of transportation and other location-related adjustments in Brazil, that involve significant judgment by management.  \nF-2\nTable of Contents\nAuditing the significant unobservable inputs in Brazil used by management to estimate the fair value of RMI and physically settled forward purchase and sale contracts involved judgment. \nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to the significant unobservable inputs in Brazil used by management to estimate the fair value of RMI and physically settled forward purchase and sale contracts included the following, among others:\n•\nWe tested the effectiveness of controls over management’s review of the underlying assumptions used in the Company’s process of estimating the fair value of RMI and physically settled forward purchase and sale contracts, including those over Level 3 inputs.\n•\nWe evaluated the appropriateness and consistency of the Company’s methods and assumptions used to estimate the fair value of RMI and physically settled forward purchase and sale contracts. \n•\nWe evaluated management’s ability to accurately estimate fair value by comparing management’s historical estimates to subsequent transactions, considering changes in market conditions subsequent to year-end.\n•\nWe made selections of RMI and physically settled forward purchase and sale contracts to test Level 3 inputs and performed the following:\n◦\nWe evaluated the reasonableness of the Level 3 inputs by reference to third-party data, information produced by the entity, and inquires of management, as well as evaluated the qualifications of third party brokers. \n◦\nWe searched for contradictory evidence to Level 3 inputs based on third party data, and our knowledge of the commodities market and inquiries of management.\n/s/ \nDeloitte & Touche LLP\nSt. Louis, Missouri\nFebruary 20, 2025\nWe have served as the Company's auditor since 2002.\nF-3\nTable of Contents\nPART I—FINANCIAL INFORMATION\nITEM 1.    FINANCIAL STATEMENTS\nBUNGE GLOBAL SA AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF INCOME \n(U.S. dollars in millions, except per share data)\n \nYear Ended December 31,\n \n2024\n2023\n2022\nNet sales\n$\n53,108\n \n$\n59,540\n \n$\n67,232\n \nCost of goods sold\n(\n49,715\n)\n(\n54,695\n)\n(\n63,550\n)\nGross profit\n3,393\n \n4,845\n \n3,682\n \nSelling, general and administrative expenses\n(\n1,776\n)\n(\n1,715\n)\n(\n1,369\n)\nInterest income\n163\n \n148\n \n71\n \nInterest expense\n(\n471\n)\n(\n516\n)\n(\n403\n)\nForeign exchange (losses) gains — net\n(\n189\n)\n20\n \n(\n11\n)\nOther income (expense) — net\n442\n \n129\n \n(\n9\n)\n(Loss) income from affiliates\n(\n38\n)\n140\n \n105\n \nIncome before income tax\n1,524\n \n3,051\n \n2,066\n \nIncome tax expense\n(\n336\n)\n(\n714\n)\n(\n388\n)\nNet income \n1,188\n \n2,337\n \n1,678\n \nNet (income) attributable to noncontrolling interests and redeemable noncontrolling interests\n(\n51\n)\n(\n94\n)\n(\n68\n)\nNet income attributable to Bunge shareholders (Note 23)\n$\n1,137\n \n$\n2,243\n \n$\n1,610\n \nEarnings per share—basic (Note 23)\n \n \n \nNet income attributable to Bunge shareholders - basic \n$\n8.09\n \n$\n15.07\n \n$\n10.83\n \nEarnings per share—diluted (Note 23)\n \nNet income attributable to Bunge shareholders - diluted \n$\n7.99\n \n$\n14.87\n \n$\n10.51\n \nThe accompanying notes are an integral part of these consolidated financial statements.\nF-4\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME \n(U.S. dollars in millions)\n \nYear Ended December 31,\n \n2024\n2023\n2022\nNet income \n$\n1,188\n \n$\n2,337\n \n$\n1,678\n \nOther comprehensive (loss) income:\n \n \n \nForeign exchange translation adjustment \n(\n929\n)\n341\n \n12\n \nUnrealized gains (losses) on designated hedges, net of tax benefit (expense) of $\n5\n, $(\n3\n), and $(\n2\n)\n127\n \n(\n99\n)\n(\n81\n)\nPension adjustment, net of tax benefit (expense) of $\n4\n, $\n3\n, and $(\n5\n)\n(\n24\n)\n(\n18\n)\n40\n \nReclassification of realized net losses to net income, net of tax (benefit) expense of $(\n2\n), $\n3\n, and $\n12\n146\n \n99\n \n122\n \nTotal other comprehensive (loss) income\n(\n680\n)\n323\n \n93\n \nTotal comprehensive income \n508\n \n2,660\n \n1,771\n \nComprehensive income attributable to noncontrolling interests and redeemable noncontrolling interests         \n(\n19\n)\n(\n100\n)\n(\n46\n)\nComprehensive loss attributable to acquisition of redeemable noncontrolling interest\n—\n \n—\n \n(\n15\n)\nTotal comprehensive income attributable to Bunge\n$\n489\n \n$\n2,560\n \n$\n1,710\n \nThe accompanying notes are an integral part of these consolidated financial statements.\nF-5\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\n(U.S. dollars in millions, except share data)\n \nDecember 31,\n2024\nDecember 31,\n2023\nASSETS\n \n \nCurrent assets:\n \n \nCash and cash equivalents\n$\n3,311\n \n$\n2,602\n \nTrade accounts receivable (less allowances of $\n89\n and $\n104\n) (Note 4)\n2,148\n \n2,592\n \nInventories (Note 5)\n6,491\n \n7,105\n \nOther current assets (Note 6)\n4,008\n \n4,051\n \nTotal current assets\n15,958\n \n16,350\n \nProperty, plant and equipment, net (Note 7)\n5,254\n \n4,541\n \nOperating lease assets (Note 25)\n932\n \n926\n \nGoodwill (Note 8)\n453\n \n489\n \nOther intangible assets, net (Note 9)\n321\n \n398\n \nInvestments in affiliates (Note 11)\n779\n \n1,280\n \nDeferred income taxes (Note 14)\n645\n \n773\n \nOther non-current assets (Note 12)\n557\n \n615\n \nTotal assets\n$\n24,899\n \n$\n25,372\n \nLIABILITIES AND EQUITY\n \n \nCurrent liabilities:\n \n \nShort-term debt (Note 17)\n$\n875\n \n$\n797\n \nCurrent portion of long-term debt (Note 17)\n669\n \n5\n \nTrade accounts payable (includes $\n388\n and $\n823\n carried at fair value)\n2,777\n \n3,664\n \nCurrent operating lease obligations (Note 25)\n286\n \n308\n \nOther current liabilities (Note 13)\n2,828\n \n2,913\n \nTotal current liabilities\n7,435\n \n7,687\n \nLong-term debt (Note 17)\n4,694\n \n4,080\n \nDeferred income taxes (Note 14)\n379\n \n400\n \nNon-current operating lease obligations (Note 25)\n595\n \n566\n \nOther non-current liabilities (Note 21)\n847\n \n824\n \nRedeemable noncontrolling interests\n4\n \n1\n \nEquity\n (Note 22):\n \n \nRegistered shares, par value $\n0.01\n; authorized not issued—\n86,861,666\n shares; conditionally authorized \n32,285,894\n shares; issued and outstanding: 2024 - \n133,964,235\n shares, 2023 - \n145,319,668\n shares\n1\n \n1\n \nAdditional paid-in capital\n5,325\n \n5,900\n \nRetained earnings\n12,838\n \n12,077\n \nAccumulated other comprehensive loss (Note 22)\n(\n6,702\n)\n(\n6,054\n)\nTreasury shares, at cost; 2024—\n21,318,307\n shares and 2023—\n16,109,804\n shares\n(\n1,549\n)\n(\n1,073\n)\nTotal Bunge shareholders' equity\n9,913\n \n10,851\n \nNoncontrolling interests\n1,032\n \n963\n \nTotal equity\n10,945\n \n11,814\n \nTotal liabilities, redeemable noncontrolling interest and equity\n$\n24,899\n \n$\n25,372\n \nThe accompanying notes are an integral part of these consolidated financial statements.\nF-6\nTable of Contents\nBUNGE \nGLOBAL SA\n AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(U.S. dollars in millions)\n \nYear Ended December 31,\n \n2024\n2023\n2022\nOPERATING ACTIVITIES\n \n \n \nNet income\n$\n1,188\n \n$\n2,337\n \n$\n1,678\n \nAdjustments to reconcile net income to cash provided by (used for) operating activities:\n \n \n \nImpairment charges\n41\n \n104\n \n162\n \nForeign exchange loss (gain) on net debt\n174\n \n(\n281\n)\n(\n101\n)\nDepreciation, depletion and amortization\n468\n \n451\n \n408\n \nShare-based compensation expense\n65\n \n69\n \n65\n \nDeferred income tax (benefit) expense\n(\n10\n)\n(\n1\n)\n(\n119\n)\nGain on sale of investments and property, plant and equipment\n(\n205\n)\n(\n4\n)\n(\n6\n)\nResults from affiliates\n19\n \n(\n157\n)\n(\n106\n)\nOther, net\n65\n \n117\n \n97\n \nChanges in operating assets and liabilities, excluding the effects of acquisitions and dispositions:\n \n \n \nTrade accounts receivable\n169\n \n256\n \n(\n206\n)\nInventories\n96\n \n1,518\n \n(\n269\n)\nSecured advances to suppliers\n207\n \n(\n121\n)\n(\n14\n)\nTrade accounts payable and accrued liabilities\n(\n538\n)\n(\n939\n)\n67\n \nAdvances on sales\n51\n \n(\n140\n)\n175\n \nNet unrealized (gains) losses on derivative contracts\n262\n \n(\n366\n)\n(\n31\n)\nMargin deposits\n36\n \n173\n \n(\n242\n)\nRecoverable and income taxes, net\n(\n242\n)\n202\n \n(\n94\n)\nMarketable securities\n(\n36\n)\n23\n \n325\n \nBeneficial interest in securitized trade receivables\n—\n \n—\n \n(\n6,940\n)\nOther, net\n90\n \n67\n \n(\n398\n)\nCash provided by (used for) operating activities\n1,900\n \n3,308\n \n(\n5,549\n)\nINVESTING ACTIVITIES\n \n \n \nPayments made for capital expenditures\n(\n1,376\n)\n(\n1,122\n)\n(\n555\n)\nProceeds from investments\n887\n \n49\n \n326\n \nPayments for investments\n(\n1,285\n)\n(\n69\n)\n(\n321\n)\nSettlements of net investment hedges\n71\n \n(\n64\n)\n(\n135\n)\nProceeds from beneficial interest in securitized trade receivables\n—\n \n87\n \n6,824\n \nProceeds from disposal of business and property, plant and equipment\n8\n \n170\n \n508\n \nPayments for investments in affiliates\n(\n61\n)\n(\n136\n)\n(\n55\n)\nProceeds from sale of investments in affiliates\n728\n \n—\n \n—\n \nOther, net\n(\n86\n)\n76\n \n(\n93\n)\nCash (used for) provided by investing activities\n(\n1,114\n)\n(\n1,009\n)\n6,499\n \nFINANCING ACTIVITIES\n \n \n \nNet change in short-term debt with maturities of three months or less\n137\n \n138\n \n127\n \nProceeds from short-term debt with maturities greater than three months \n1,064\n \n1,247\n \n1,753\n \nRepayments of short-term debt with maturities greater than three months \n(\n1,077\n)\n(\n987\n)\n(\n1,856\n)\nProceeds from long-term debt\n2,045\n \n1,008\n \n300\n \nRepayments of long-term debt\n(\n753\n)\n(\n1,176\n)\n(\n1,029\n)\nDebt issuance costs\n(\n24\n)\n(\n30\n)\n(\n3\n)\nProceeds from the exercise of options for common shares\n11\n \n9\n \n92\n \nRepurchases of registered or common shares\n(\n1,100\n)\n(\n600\n)\n(\n200\n)\nDividends paid to registered, common or preference shareholders\n(\n378\n)\n(\n383\n)\n(\n349\n)\nSale of noncontrolling interest\n—\n \n—\n \n542\n \nAcquisition of redeemable noncontrolling interest and noncontrolling interest\n—\n \n—\n \n(\n102\n)\nSettlement of cross currency swap\n—\n \n(\n79\n)\n—\n \nCapital contributions from (Return of capital to) noncontrolling interest\n53\n \n56\n \n6\n \nOther, net\n(\n68\n)\n(\n59\n)\n(\n50\n)\nCash used for financing activities\n(\n90\n)\n(\n856\n)\n(\n769\n)\nEffect of exchange rate changes on cash and cash equivalents, restricted cash, and cash held for sale\n9\n \n28\n \n66\n \nNet increase in cash and cash equivalents, restricted cash, and cash held for sale\n705\n \n1,471\n \n247\n \nCash and cash equivalents, restricted cash, and cash held for sale - beginning of period\n2,623\n \n1,152\n \n905\n \nCash and cash equivalents, restricted cash, and cash held for sale - end of period\n$\n3,328\n \n$\n2,623\n \n$\n1,152\n \nThe accompanying notes are an integral part of these consolidated financial statements.\nF-7\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CHANGES IN EQUITY AND REDEEMABLE NONCONTROLLING INTERESTS\n(U.S. dollars in millions, except share data)\nRegistered Shares\nTreasury Shares\nRedeemable\nNon-\nControlling\nInterests\nShares\nAmount\nShares\nAmount\nAdditional\nPaid-in\nCapital\nRetained\nEarnings\nAccumulated\nOther\nComprehensive\nLoss\nNon-\nControlling\nInterests\nTotal\nEquity\nBalance, January 1, 2024\n$\n1\n \n145,319,668\n \n$\n1\n \n16,109,804\n \n$\n(\n1,073\n)\n$\n5,900\n \n$\n12,077\n \n$\n(\n6,054\n)\n$\n963\n \n$\n11,814\n \nNet (loss) income \n(\n1\n)\n—\n \n—\n \n—\n \n—\n \n—\n \n1,137\n \n—\n \n52\n \n1,189\n \nOther comprehensive loss\n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n(\n648\n)\n(\n32\n)\n(\n680\n)\nRedemption value adjustment\n2\n \n— \n— \n— \n—\n \n—\n \n(\n2\n)\n—\n \n—\n \n(\n2\n)\nDividends on registered shares, $\n2.72\n per share\n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n(\n373\n)\n—\n \n—\n \n(\n373\n)\nDividends to noncontrolling interests on subsidiary common stock\n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n(\n4\n)\n(\n4\n)\nCapital contribution from noncontrolling interest\n2\n \n—\n \n—\n \n—\n \n—\n \n(\n2\n)\n—\n \n—\n \n53\n \n51\n \nShare-based compensation expense\n—\n \n—\n \n—\n \n—\n \n65\n \n—\n \n—\n \n—\n \n65\n \nCancellation of treasury shares\n—\n \n—\n \n—\n \n(\n6,146,930\n)\n572\n \n(\n572\n)\n—\n \n—\n \n—\n \n—\n \nRepurchase of registered shares\n—\n \n(\n12,150,763\n)\n—\n \n12,150,763\n \n(\n1,100\n)\n—\n \n—\n \n—\n \n—\n \n(\n1,100\n)\nIssuance of registered shares, including stock dividends\n—\n \n795,330\n \n—\n \n(\n795,330\n)\n52\n \n(\n66\n)\n(\n1\n)\n—\n \n—\n \n(\n15\n)\nBalance, December 31, 2024\n$\n4\n \n133,964,235\n \n$\n1\n \n21,318,307\n \n$\n(\n1,549\n)\n$\n5,325\n \n$\n12,838\n \n$\n(\n6,702\n)\n$\n1,032\n \n$\n10,945\n \nF-8\nTable of Contents\nCommon Shares\nRegistered Shares\nTreasury\nShares\nRedeemable\nNon-\nControlling\nInterests\nShares\nAmount\nShares\nAmount\nShares\nAmount\nAdditional\nPaid-in\nCapital\nRetained\nEarnings\nAccumulated\nOther\nComprehensive\nLoss\nNon-\nControlling\nInterests\nTotal\nEquity\nBalance, January 1, 2023\n$\n4\n \n149,907,932\n \n$\n1\n \n—\n \n$\n—\n \n18,835,812\n \n$\n(\n1,320\n)\n$\n6,692\n \n$\n10,222\n \n$\n(\n6,371\n)\n$\n732\n \n$\n9,956\n \nNet (loss) income\n(\n1\n)\n— \n— \n— \n— \n— \n— \n— \n2,243\n \n— \n95\n \n2,338\n \nOther comprehensive income\n—\n \n— \n— \n— \n— \n— \n— \n— \n— \n317\n \n6\n \n323\n \nRedemption value adjustment\n(\n2\n)\n— \n— \n— \n— \n— \n— \n— \n2\n \n— \n— \n2\n \nDividends on common shares, $\n2.6125\n per share\n— \n— \n— \n— \n— \n— \n— \n— \n(\n386\n)\n— \n— \n(\n386\n)\nDividends to noncontrolling interests on subsidiary common stock\n—\n \n— \n— \n— \n— \n— \n— \n— \n— \n— \n(\n17\n)\n(\n17\n)\nCapital contribution from noncontrolling interest\n— \n— \n— \n— \n— \n— \n— \n— \n— \n— \n56\n \n56\n \nAcquisition of noncontrolling interest\n— \n— \n— \n— \n— \n— \n— \n— \n— \n— \n91\n \n91\n \nShare-based compensation expense\n— \n— \n— \n— \n— \n— \n— \n69\n \n— \n— \n— \n69\n \nCancellation of common shares and issuance of registered shares\n— \n(\n145,287,978\n)\n(\n1\n)\n145,287,978\n \n1\n \n— \n— \n— \n— \n— \n— \n— \nCancellation of treasury shares\n— \n— \n— \n— \n— \n(\n8,102,179\n)\n845\n \n(\n845\n)\n— \n— \n— \n— \nRepurchase of common shares\n— \n(\n5,407,861\n)\n— \n— \n— \n5,407,861\n \n(\n600\n)\n— \n— \n— \n— \n(\n600\n)\nIssuance of registered or common shares, including stock dividends\n— \n787,907\n \n— \n31,690\n \n— \n(\n31,690\n)\n2\n \n(\n16\n)\n(\n4\n)\n— \n— \n(\n18\n)\nBalance, December 31, 2023\n$\n1\n \n—\n \n$\n—\n \n145,319,668\n \n$\n1\n \n16,109,804\n \n$\n(\n1,073\n)\n$\n5,900\n \n$\n12,077\n \n$\n(\n6,054\n)\n$\n963\n \n$\n11,814\n \nF-9\nTable of Contents\n \nConvertible\nPreference Shares\nCommon Shares\nTreasury Shares\n \nRedeemable\nNon-\nControlling\nInterests\nShares\nAmount\nShares\nAmount\nShares\nAmount\nAdditional\nPaid-in\nCapital\nRetained\nEarnings\nAccumulated\nOther\nComprehensive\nLoss\nNon-\nControlling\nInterests\nTotal\nEquity\nBalance, January 1, 2022\n$\n381\n \n6,899,683\n \n$\n690\n \n141,057,414\n \n$\n1\n \n16,726,697\n \n$\n(\n1,120\n)\n$\n5,590\n \n$\n8,979\n \n$\n(\n6,471\n)\n$\n156\n \n$\n7,825\n \nNet income\n13\n \n— \n— \n— \n— \n— \n— \n— \n1,610\n \n— \n55\n \n1,665\n \nOther comprehensive income (loss)\n(\n24\n)\n— \n— \n— \n— \n— \n— \n— \n— \n115\n \n2\n \n117\n \nRedemption value adjustment\n1\n \n— \n— \n— \n— \n— \n— \n—\n \n—\n \n— \n— \n—\n \nDividends on common shares,$\n2.40\n per share\n— \n— \n— \n— \n— \n— \n— \n— \n(\n362\n)\n— \n— \n(\n362\n)\nDividends to noncontrolling interests on subsidiary common stock\n—\n \n— \n— \n— \n— \n— \n— \n— \n— \n— \n(\n17\n)\n(\n17\n)\nCapital contribution from noncontrolling interest\n— \n— \n— \n— \n— \n— \n— \n— \n— \n6\n \n6\n \nSale of noncontrolling interest\n— \n— \n— \n— \n— \n— \n247\n \n— \n— \n295\n \n542\n \nAcquisition of redeemable noncontrolling interest\n(\n367\n)\n— \n— \n— \n— \n— \n— \n45\n \n— \n(\n15\n)\n235\n \n265\n \nShare-based compensation expense\n— \n— \n— \n— \n— \n— \n— \n65\n \n— \n— \n— \n65\n \nRepurchase of common shares\n— \n— \n— \n(\n2,109,115\n)\n— \n2,109,115\n \n(\n200\n)\n— \n— \n— \n— \n(\n200\n)\nConversion of preference shares to common shares\n— \n(\n6,899,683\n)\n(\n690\n)\n8,863,331\n \n— \n— \n— \n690\n \n— \n— \n— \n— \nIssuance of common shares, including stock dividends\n— \n— \n— \n2,096,302\n \n— \n— \n— \n55\n \n(\n5\n)\n— \n— \n50\n \nBalance, December 31, 2022\n$\n4\n \n—\n \n$\n—\n \n149,907,932\n \n$\n1\n \n18,835,812\n \n$\n(\n1,320\n)\n$\n6,692\n \n$\n10,222\n \n$\n(\n6,371\n)\n$\n732\n \n$\n9,956\n \nThe accompanying notes are an integral part of these consolidated financial statements.\nF-10\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n1. \nNATURE OF BUSINESS, BASIS OF PRESENTATION, AND SIGNIFICANT ACCOUNTING POLICIES\nDescription of Business\n—On November 1, 2023, Bunge Global SA completed the change of jurisdiction of incorporation of its group holding company from Bermuda to Switzerland (the \"Redomestication\"). The Redomestication, as approved by our shareholders, was effected pursuant to a scheme of arrangement under Bermuda law. \nEach common share of Bunge Limited, par value $\n0.01\n per share, was cancelled in exchange for an equal number of registered shares of Bunge Global SA, par value $\n0.01\n per share (the \"registered shares\"). The registered shares began trading on the New York Stock Exchange (the \"NYSE\") under the symbol \"BG\" on November 1, 2023, which is the same symbol under which the Bunge Limited shares were previously traded. References to the term \"shares\" refer to Bunge Limited common shares prior to the Redomestication and to Bunge Global SA registered shares after the Redomestication, unless otherwise specified. See \nNote 22- Equity \nfor further information. \n \n \nBunge Global SA, together with its consolidated subsidiaries and variable interest entities (\"VIEs\") in which it is considered the primary beneficiary, through which its businesses are conducted (collectively \"Bunge\" or \"the Company\"), is a leading global agribusiness and food company. Bunge operates in \nfour\n reportable segments: Agribusiness, Refined and Specialty Oils, Milling, and Sugar and Bioenergy. \nCorporate and Other, which is not a reportable segment, includes salaries and overhead for corporate functions that are not allocated to the Company’s individual reporting segments because the operating performance of such reporting segments is evaluated by the Company's chief operating decision maker exclusive of these items, as well as certain other activities including Bunge Ventures, the Company's captive insurance program, accounts receivable securitization activities, and certain income tax assets and liabilities.\nAgribusiness\n—Bunge's Agribusiness segment is an integrated, global business involved in the purchase, storage, transport, processing, and sale of agricultural commodities and commodity products. Bunge's agribusiness operations and assets are located in North America, South America, Europe, and Asia-Pacific with merchandising and distribution offices throughout the world.\nBunge's Agribusiness segment also participates in related financial activities, such as offering trade structured finance, which leverages its international trade flows, providing risk management services to customers by assisting them with managing price exposure to agricultural commodities, foreign exchange, and other financial instruments.\nRefined and Specialty Oils \n—Bunge's Refined and Specialty Oils segment produces and sells edible oil products, such as packaged and bulk oils and fats, shortenings, margarines, mayonnaise, and other products derived from the vegetable oil refining process, including renewable diesel feedstocks, and refines and fractionates palm oil, palm kernel oil, coconut oil, and shea butter. Bunge's refined and specialty oils operations are located in North America, South America, Europe, Asia-Pacific, and Africa.\nMilling \n—Bunge's Milling segment primarily comprises wheat and corn milling businesses that purchase wheat and corn directly from farmers and dealers and process them into milled products for food processors, bakeries, brewers, snack food producers, and other customers. Due to the completion of the sale of Bunge's Mexican wheat milling business during the third quarter of 2022, Bunge's wheat milling activities are now primarily located in Brazil. Corn milling activities are primarily located in the United States and Mexico. See \nNote 2- Acquisitions and Dispositions\n for additional information on the completed sale of Bunge's Mexican wheat milling activities.\nSugar and Bioenergy\n—\nBunge's Sugar and Bioenergy segment primarily consists of results from the Company's previously owned \n50\n% ownership interest in  BP Bunge Bioenergia, a joint venture with BP p.l.c. (\"BP\"). On October 1, 2024, Bunge completed the sale of our \n50\n% ownership share in BP Bunge Bioenergia to BP. Prior to the sale, the joint venture operated in the ethanol, biopower, and sugar markets in Brazil. BP Bunge Bioenergia operated on a stand-alone basis with a total of \n11\n mills located across the Southeast, North, and Midwest regions of Brazil. Bunge\n accounted for its interest in the joint venture under the equity method of accounting. See \nNote 2- Acquisitions and Dispositions\n for further details regarding the Company's disposition of BP Bunge Bioenergia.\nArgentina\nBunge has significant operating subsidiaries in Argentina. Argentina has experienced hyperinflation, high fiscal deficit and negative Gross Domestic Product (\"GDP\") growth in recent years. Throughout 2023 and 2022, Argentina’s government has \nF-11\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\npublished multiple Emergency Decrees, certain of which have introduced preferential U.S. dollar to Argentine \npeso\n foreign exchange rates (collectively referred to as the \"Export Programs\"). Preferential exchange rates under the Export Programs were available exclusively during specific periods of time to be used on qualifying Argentine \npeso\n denominated purchases of certain commodities and payment of export duties. The Export Programs were aimed at boosting farmer selling and in turn commodity exports generating an influx of foreign currency. During the periods covered by the Export Programs, qualifying commodity prices in Argentine \npesos\n were directly impacted by the preferential rates. Transactions related to these Export Programs were accounted for at the preferential rate. There were no transactions accounted for utilizing a preferential rate for the year ended December 31, 2024.\nUkraine-Russia War\nOn February 24, 2022, Russia initiated a military invasion of Ukraine (the \"war\"). Bunge’s Ukrainian operations comprise two oilseed crushing facilities, located in Mykolaiv and Dnipropetrovsk, a grain export terminal in Mykolaiv commercial seaport, numerous grain elevators, and an office in Kiev. The Company also operates both a corn milling facility and an oilseed processor in Ukraine via joint ventures. As of December 31, 2024, total assets and total liabilities associated with Bunge’s Ukrainian subsidiaries each comprise less than \n3\n% of Bunge’s consolidated Total assets and Total liabilities, respectively. \nIn the year ended December 31, 2024, the Company recognized insurance recoveries related to the war of $\n58\n million which were recorded in Cost of goods sold in the consolidated statements of income. The recoveries included $\n52\n million attributable to business interruption and $\n6\n million attributable to property damage. No impairments or charges related to the war were recorded during the year ended December 31, 2024. However, the scope, intensity, duration, and outcome of the ongoing war is uncertain, and any continuation or escalation of the war may have a material adverse effect on Bunge, including its Ukrainian operations.\nBasis of Presentation\n—The consolidated financial statements are prepared in conformity with accounting principles generally accepted in the United States of America (\"U.S. GAAP\"). The accounting policies used to prepare these financial statements are the same as those used to prepare the consolidated financial statements in prior years, except as described in these notes or for the adoption of new standards as outlined below.\nPrinciples of Consolidation\n—The accompanying consolidated financial statements include the accounts of Bunge, its subsidiaries and VIEs in which Bunge is considered to be the primary beneficiary and, as a result, include the assets, liabilities, revenues, and expenses of all entities over which Bunge exercises control. Equity investments in which Bunge has the ability to exercise significant influence but does not have a controlling financial interest are accounted for by the equity method of accounting. Investments in which Bunge does not exercise significant influence are accounted for at cost, or fair value if readily determinable. Intercompany accounts and transactions are eliminated. An enterprise is determined to be the primary beneficiary if it has a controlling financial interest, defined as (a) the power to direct the activities of a VIE that most significantly impact the economics of the VIE and (b) the obligation to absorb losses of or the right to receive benefits from the VIE that could potentially be significant to the VIE's operations. Performance of that analysis requires the exercise of judgment. The primary beneficiary analysis must be continually reassessed and requires the exercise of judgement. VIE assessments are revisited upon the occurrence of relevant reconsideration events.  \nNoncontrolling interests in subsidiaries related to Bunge's ownership interests of less than \n100\n% are reported as Noncontrolling interests or Redeemable noncontrolling interests in the consolidated balance sheets. The noncontrolling ownership interests in Bunge's earnings, net of tax, is reported as Net (income) attributable to noncontrolling interests and redeemable noncontrolling interests in the consolidated statements of income.\nReclassifications\n—Effective January 1, 2024, the Company changed its reporting of purchases and sales activity within the readily marketable inventories Level 3 reconciliation to align with the Company's value chain trade flows and intended use, which had no net impact on Level 3 readily marketable inventories period end balances. Prior period activity has been reclassified to conform to current presentation. See \nNote 15- Fair Value Measurements \nfor further details regarding the reclassification.\nFurther, effective January 1, 2023, the Company changed its reporting of cash proceeds from and repayments of short-term debt with maturities of three months or less to be presented on a net basis in its consolidated statements of cash flows. Prior to January 1, 2023, the Company presented cash proceeds from and repayments of short-term debt with maturities of three months or less separately in its consolidated statements of cash flows. Prior period amounts have been reclassified to conform to current presentation.\n \nF-12\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nUse of Estimates\n—The preparation of consolidated financial statements in conformity with U.S. GAAP requires Bunge to make estimates and assumptions that affect the amounts reported in the consolidated financial statements and notes. Actual results could differ from those estimates.\nOffsetting\n—In the normal course of its operations the Company routinely enters into transactions resulting in the recognition of assets and liabilities stemming from unconditional obligations, for example trade receivables and trade payables, or conditional obligations, for example unrealized gains and losses on derivative contracts at fair value, with the same counterparty. The Company generally records all such assets and liabilities on a gross basis, even when they are subject to master netting agreements.\nHowever, the Company also engages in various trade structured finance activities to leverage the value of its global trade flows. These activities include programs under which Bunge generally obtains U.S. dollar and foreign currency denominated letters of credit (\"LCs\") from financial institutions, each based on an underlying commodity trade flow, and time deposits denominated in U.S. dollars and foreign currencies, as well as foreign exchange forward contracts and other programs in which trade related payables are set-off against receivables, when all related assets and liabilities are subject to legally enforceable set-off agreements and the criteria of Accounting Standards Codification (\"ASC\") 210-20, \nOffsetting\n, has been met. Cash inflows are offset by the related cash outflows resulting from placement of the time deposits and repayment of the LCs. All cash flows related to the programs are included in operating activities in the consolidated statements of cash flows.\nTranslation of Foreign Currency Financial Statements\n—Bunge's reporting currency is the U.S. dollar. The functional currency of the majority of Bunge's foreign subsidiaries is their local currency. As such, amounts included in the consolidated statements of income, comprehensive income, cash flows, and changes in equity are translated using average exchange rates during each period. Assets and liabilities are translated at period-end exchange rates and resulting foreign currency translation adjustments are recorded in the consolidated balance sheets as a component of Accumulated other comprehensive loss. However, in accordance with U.S. GAAP, if a foreign entity's economy is determined to be highly inflationary, then the foreign entity's financial statements are remeasured as if the functional currency were the reporting currency.\nForeign Currency Transactions\n—Monetary assets and liabilities denominated in currencies other than the functional currency are remeasured into their respective functional currencies at exchange rates in effect at the balance sheet date. The resulting exchange gain or loss is included in Bunge's consolidated statements of income as Foreign exchange gains (losses) - net unless the remeasurement gain or loss relates to an intercompany transaction that is of a long-term investment nature and for which settlement is neither planned nor anticipated in the foreseeable future, in which case the remeasurement gain or loss is reported as a component of Accumulated other comprehensive loss in Bunge's consolidated balance sheets.\n \nCash, Cash Equivalents, Restricted Cash, and Cash held for sale\n—Cash and cash equivalents include time deposits and readily marketable securities with original maturity dates of three months or less at the time of acquisition.\n \nRestricted cash is included with cash and cash equivalents when reconciling the beginning-of-period and end-of-period total amounts shown on the consolidated statements of cash flows.\n \nThe following table provides a reconciliation of cash, cash equivalents, restricted cash, and cash and cash equivalents in Assets held for sale reported within the consolidated balance sheets to the total of the same such amounts shown in the consolidated statements of cash flows.\nDecember 31,\n(US$ in millions)\n2024\n2023\n2022\nCash and cash equivalents\n$\n3,311\n \n$\n2,602\n \n$\n1,104\n \nRestricted cash included in Other current assets\n17\n \n21\n \n26\n \nCash and cash equivalents in Assets held for sale\n—\n \n—\n \n22\n \nTotal\n$\n3,328\n \n$\n2,623\n \n$\n1,152\n \nTrade Accounts Receivable\n—Trade accounts receivable is stated at historical carrying amounts net of write-offs and allowances for uncollectible accounts. Bunge establishes allowances for uncollectible trade accounts receivable based on lifetime expected credit losses using an aging schedule for each pool of trade accounts receivable. Pools are determined based on risk characteristics such as the type of customer and geography. A default rate is derived using a provision matrix with data based on Bunge's historical receivables information. The default rate is then applied to the pool to determine the allowance for expected credit losses. Given the short-term nature of the Company's trade accounts receivable, the default rate is only adjusted if significant changes in the credit profile of the portfolio are identified (e.g., poor crop years, credit issues at the country level, systematic risk), resulting in historic loss rates that are not representative of forecasted losses. Uncollectible accounts are \nF-13\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nwritten off when a settlement is reached for an amount that is less than the outstanding historical balance or when the Company has determined that collection of the balance is unlikely.\nBunge records and reports accrued interest receivable within the same line item as the related trade accounts receivable. The allowance for expected credit losses is estimated on the amortized cost basis of the trade accounts receivable, including accrued interest receivable. Bunge recognizes credit loss expense when establishing an allowance for accrued interest receivable.\nSecured Advances to Suppliers\n—Secured advances to suppliers are stated at historical carrying amounts net of write-offs and allowances for uncollectible accounts. Secured advances to suppliers are expected to be settled through delivery of non-cash assets and as such, allowances are established when collection is not probable. Bunge establishes an allowance for secured advances to suppliers, generally farmers and resellers of grain, based on historical experience, farming economics and other market conditions, as well as specific supplier collection issues. Uncollectible accounts are written off when a settlement is reached for an amount below the outstanding historical balance or when Bunge has determined that collection is unlikely.\nSecured advances to suppliers bear interest at contractual rates that reflect current market interest rates at the time of the transaction. There are no deferred fees or costs associated with these receivables. As a result, there are no imputed interest amounts to be amortized under the interest method. Interest income is calculated based on the terms of the individual agreements and is recognized on an accrual basis.\nBunge follows accounting guidance on the disclosure of the credit quality of financing receivables and the allowance for credit losses, which requires information to be disclosed at disaggregated levels, defined as portfolio segments and classes. Under this guidance, a class of receivables is considered impaired, based on current information and events, if Bunge determines it probable that all amounts due under the original terms of the receivable will not be collected. Recognition of interest income is suspended once the borrower defaults on the originally scheduled delivery of agricultural commodities as the collection of future income is determined not to be probable. No additional interest income is accrued from the point of default until ultimate recovery, at which time amounts collected are credited first against the receivable and then to any unrecognized interest income.\nInventories\n—Readily marketable inventories (\"RMI\") are agricultural commodity inventories, primarily including soybeans, soybean meal, soybean oil, corn, softseeds and wheat that are readily convertible to cash because of their commodity characteristics, widely available markets, and international pricing mechanisms. All of Bunge's RMI are recorded at fair value. These agricultural commodity inventories have quoted prices in active markets, may be sold without significant further processing, and have predictable and insignificant disposal costs. Changes in the fair values of RMI are recognized in earnings as a component of Cost of goods sold.\nInventories other than RMI are stated at the lower of cost or net realizable value by inventory product class. Cost is determined primarily using the weighted-average cost method.\nFair Value Measurements\n—Bunge determines fair value based on the price that would be received for an asset or paid to transfer a liability (an exit price) in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants on the measurement date. Bunge determines the fair values of its RMI, derivatives, and certain other assets and liabilities based on the fair value hierarchy, which requires an entity to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. Observable inputs are inputs based on market data obtained from sources independent of Bunge that reflect the assumptions market participants would use in pricing the asset or liability. Unobservable inputs are inputs that are developed based on the best information available in circumstances that reflect Bunge's own assumptions based on market data and on assumptions that market participants would use in pricing the asset or liability. The fair value standard describes three levels within its hierarchy that may be used to measure fair value:\nLevel\nDescription\nFinancial Instrument (Assets / Liabilities)\nLevel 1\nQuoted prices (unadjusted) in active markets for identical assets or liabilities. \nExchange traded derivative contracts.\nMarketable securities in active markets.\nF-14\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nLevel 2\nObservable inputs, including adjusted Level 1 quotes, quoted prices for similar assets or liabilities, quoted prices in markets that are less active than traded exchanges and other inputs that are observable or can be corroborated by observable market data for substantially the full term of the assets or liabilities. \nExchange traded derivative contracts (less liquid market).\nReadily marketable inventories. \nOver-the-counter (\"OTC\") commodity purchase and sale contracts. \nOTC derivatives whose value is determined using pricing models with inputs that are generally based on exchange traded prices, adjusted for location specific inputs that are primarily observable in the market or can be derived principally from or corroborated by observable market data.\nMarketable securities in less active markets.\nLevel 3\nUnobservable inputs that are supported by little or no market activity and that are a significant component of the fair value of the assets or liabilities. \nAssets and liabilities whose value is determined using proprietary pricing models, discounted cash flow methodologies or similar techniques.\n \nAssets and liabilities for which the determination of fair value requires significant management judgment or estimation.\nBased on historical experience with Bunge’s suppliers and customers, Bunge’s own credit risk, and knowledge of current market conditions, Bunge does not view nonperformance risk to be a significant input to fair value for the majority of its forward commodity purchase and sale contracts.\nIn many cases, a valuation technique used to measure fair value includes inputs from multiple levels of the fair value hierarchy. The lowest level of input that is a significant component of the fair value measurement determines the placement of the entire fair value measurement in the hierarchy. Bunge’s assessment of the significance of a particular input to the fair value measurement requires judgment and may affect the classification of fair value assets and liabilities within the fair value hierarchy levels.\nBunge’s policy regarding the timing of transfers between levels, including both transfers into and transfers out of Level 3, is to measure and record the transfers at the end of the reporting period.\nThe majority of Bunge's exchange-traded agricultural commodity futures are settled daily, generally through its clearing subsidiary, and therefore such futures are not included in the assets and liabilities that are accounted for at fair value on a recurring basis\n.\nDerivative Instruments and Hedging Activities\n—Bunge enters into derivative instruments to manage its exposure to movements associated with agricultural commodity prices, transportation costs, foreign currency exchange rates, interest rates, and energy costs. Bunge's use of these instruments is generally intended to mitigate exposure to market variables (see \nNote 16- Derivative Instruments and Hedging Activities\n). Additionally, commodity contracts relating to forward sales of commodities primarily in the Company’s Agribusiness segment, including but not limited to soybeans, soybean meal and oil, corn, softseeds and wheat, are accounted for as derivatives at fair value under ASC 815 (see \nRevenue Recognition \nbelow).\nGenerally, derivative instruments are recorded at fair value in Other current assets or Other current liabilities in Bunge's consolidated balance sheets. For derivatives designated as hedges, Bunge assesses at the inception of the hedge whether any such derivatives are highly effective in offsetting changes in the hedged items and, on an ongoing basis, qualitatively or quantitatively tests whether that assertion is still met. The changes in fair values of derivative instruments designated as fair value hedges, along with the gains or losses on the related hedged items are recorded in earnings in the consolidated statements of income in the same caption as the hedged items. The changes in fair values of derivative instruments that are designated as cash flow hedges are recorded in Accumulated other comprehensive loss and are reclassified to earnings when the hedged cash flows affect earnings or when the hedge is no longer considered to be effective. In addition, Bunge may designate certain derivative instruments and non-derivative instruments as net investment hedges to hedge the exposure associated with its equity investments in foreign operations. When using forward derivative contracts as hedging instruments in a net investment hedge, all changes in the fair value of the derivative are recorded as a component of Accumulated other comprehensive loss in the consolidated balance sheets.\nMarketable Securities and Other Short-Term Investments\n—Bunge classifies its marketable debt securities and short-term investments as available-for-sale, held-to-maturity, or held-for-trading. Available-for-sale debt securities are reported at fair value with unrealized gains (losses) included in Accumulated other comprehensive loss. Held-to-maturity debt investments represent financial assets in which Bunge has the intent and ability to hold to maturity and are reported at amortized cost. Debt \nF-15\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\ntrading securities and all equity securities are recorded at fair value and are bought and held principally for selling them in the near term and therefore held for only a short period of time, with all gains (losses) included in Net income. Bunge monitors its held-to-maturity investments for impairment periodically and recognizes an impairment charge when the decline in fair value of an investment is judged to be other than temporary.\nRecoverable Taxes\n—Recoverable taxes include value-added taxes paid upon the acquisition of raw materials and taxable services and other transactional taxes, which can be recovered in cash or as compensation against income taxes or other taxes owed by Bunge, primarily in Brazil and Europe. These recoverable tax payments are included in Other current assets or Other non-current assets based on their expected realization. In cases where Bunge determines that recovery is doubtful, recoverable taxes are reduced by allowances for the estimated unrecoverable amounts.\nProperty, Plant and Equipment, Net\n—Property, plant and equipment, net is stated at cost less accumulated depreciation. Major improvements that extend either the life, capacity, efficiency, or improve the safety of an asset are capitalized, while maintenance and repairs are expensed as incurred. Costs related to legal obligations associated with the future retirement of capitalized assets are capitalized as part of the cost of the related asset. Bunge capitalizes eligible costs to acquire or develop internal-use software that are incurred during the application development stage. Interest costs on borrowings during construction/completion periods of major capital projects are also capitalized.\nDepreciation is computed based on the straight-line method over the estimated useful lives of the assets. \nEstimated useful lives for property, plant and equipment are as follows:\n \nYears\nBuildings\n10\n - \n50\nMachinery and equipment\n3\n - \n25\nFurniture, fixtures and other\n3\n - \n20\nGoodwill\n—Goodwill represents the cost in excess of the fair value of net assets acquired in a business acquisition. Goodwill is not amortized but is tested annually for impairment, or between annual tests if events or circumstances indicate potential impairment. Bunge's annual impairment testing is generally performed during the fourth quarter of its fiscal year.\nGoodwill is tested for impairment at the reporting unit level, which has been determined to be the Company's operating segments or one level below the operating segments in certain instances (see \nNote 8- Goodwill\n).\nOther Intangible Assets\n—Finite-lived intangible assets primarily include trademarks, customer relationships and lists, port facility usage rights, licenses and patents that are amortized on a straight-line basis over their contractual or legal lives, or their estimated useful lives where such lives are not determined by law or contract (see \nNote 9- Other Intangible Assets\n).\nImpairment of Property, Plant and Equipment and Finite-Lived Intangible Assets\n—Bunge reviews its property, plant and equipment and finite-lived intangible assets for impairment whenever events or changes in circumstances indicate that carrying amounts may not be recoverable. Bunge bases its evaluation of recoverability on such indicators as the nature, future economic benefits, and geographic locations of the assets, historical or future profitability measures, and other external market conditions. If these indicators result in the expected non-recoverability of the carrying amount of an asset or asset group, Bunge evaluates potential impairment using undiscounted estimated future cash flows. If such undiscounted future cash flows during the asset's remaining useful life are below the asset's carrying value, a loss is recognized for the shortfall, measured by the present value of the estimated future cash flows or by third-party appraisals. Bunge records impairments related to property, plant and equipment and finite-lived intangible assets used in the processing of its products in Cost of goods sold in its consolidated statements of income. Any impairment of marketing or brand assets is recognized in Selling, general and administrative expenses (\"SG&A\") in the consolidated statements of income (see \nNote 10- Impairments\n).\nProperty, plant and equipment and other finite-lived intangible assets to be sold or otherwise disposed of are reported at the lower of carrying amount or fair value less cost to sell.\nInvestments in Affiliates\n—Bunge has investments in various unconsolidated joint ventures accounted for using the equity method, minus impairment. Bunge reviews its investments annually or when an event or circumstances indicate that a potential decline in value may be other than temporary. Bunge considers various factors in determining whether to recognize an impairment charge, including the length of time the fair value of the investment is expected to be below its carrying value, the financial condition, operating performance and near-term prospects of the affiliate, and Bunge's intent and ability to hold the \nF-16\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\ninvestment for a period of time sufficient to allow for recovery of the fair value (see \nNote 10- Impairments\n and \nNote 11- Investments in Affiliates and Variable Interest Entities\n).\nRevenue Recognition\n—The Company’s revenue comprises sales from commodity contracts that are accounted for under ASC 815, \nDerivatives and Hedging \n(\"ASC 815\"),\n \nand sales of other products and services that are accounted for under ASC 606, \nRevenue from Contracts with Customers\n (\"ASC 606\"). Additional information about the Company’s revenues can be found in \nNote 26- Segment Information\n.\nRevenue from commodity contracts (ASC 815)\n—Revenue from commodity contracts primarily relates to forward sales of commodities including, but not limited to soybeans, soybean meal and oil, softseeds, corn, and wheat accounted for as derivatives at fair value under ASC 815, primarily in the Company’s Agribusiness segment. These forward sales meet the definition of a derivative under ASC 815 as they have an underlying (e.g., the price of soybeans), a notional amount (e.g., metric tons), no initial net investment, and can be net settled since the commodity is readily convertible to cash. Bunge generally does not apply the normal purchase and normal sale exception available under ASC 815 to these contracts. Certain of the Company’s sales in its Refined and Specialty Oils and Milling segments also qualify as derivatives, primarily sales of commodities like bulk soybean and canola oil.\nRevenue from commodity contracts is recognized in Net sales for the contracted amount when the contracts are settled at a point in time by transferring control of the commodity to the customer, similarly to revenue recognized from contracts with customers under ASC 606. From inception through settlement, these forward sales arrangements are recorded at fair value under ASC 815 with unrealized gains and losses recognized in Cost of goods sold and carried on the consolidated balance sheets as current assets (see \nNote 6- Other Current Assets\n) or current liabilities (see \nNote 13- Other Current Liabilities\n), respectively. Further information about the fair value of these contracts is presented in \nNote 15- Fair Value Measurements\n.   \nRevenue from contracts with customers (ASC 606)\n—Revenue from contracts with customers accounted for under ASC 606 is primarily generated in the Company's Refined and Specialty Oils and Milling segments through the sale of refined edible oil-based products such as packaged vegetable oils, shortenings, margarines, and mayonnaise; milled grain products such as wheat flours, bakery mixes, and corn-based products; and fertilizer products. These sales are accounted for under ASC 606 as these sales arrangements do not meet the criteria to be considered derivatives under ASC 815. These revenues are measured based on consideration specified in a contract with a customer and exclude sales taxes, discounts related to promotional programs, and amounts collected on behalf of third parties. The Company recognizes revenue from these contracts at a point in time when it satisfies a performance obligation by transferring control of a product to a customer, generally when significant risks and rewards transfer to the customer. Sales terms provide for transfer of control of a product either at the time and point of shipment or at the time and point of delivery and acceptance of the product being sold. In contracts that do not specify the timing of transfer of legal title or transfer of significant risks and rewards of ownership, judgment is required in determining the timing of transfer of control. In such cases, the Company considers standard business practices and the relevant laws and regulations applicable to the transaction to determine when the significant risks and rewards of ownership are transferred. \nThe transaction price is generally allocated to performance obligations on a relative standalone selling price basis. Standalone selling prices are estimated based on observable data of the Company’s sales of such products and services to similar customers and in similar circumstances on a standalone basis. In assessing whether to allocate variable consideration to a specific part of the contract, the Company considers the nature of the variable payment and whether it relates specifically to its efforts to satisfy a specific part of the contract. Variable consideration is generally known upon satisfaction of the performance obligation.\nTaxes assessed by a governmental authority that are both imposed on and concurrent with a specific revenue producing transaction, which are collected by the Company from a customer, are excluded from revenue. \nShipping and handling costs associated with outbound freight after control over a product has transferred to a customer are accounted for as a fulfillment cost and are included in Cost of goods sold.\nWarranties provided to customers are primarily assurance-type warranties on the fitness of purpose and merchantability of the Company’s goods and services. The Company does not provide service-type warranties to customers.\nPayment is generally due at the time of shipment or delivery, or within a specified time frame after shipment or delivery, which is generally 30-60 days. The Company’s contracts generally provide customers the right to reject any products that do not meet agreed quality specifications. Product returns and refunds are not material.\nF-17\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nAdditionally, the Company recognizes revenue in the Agribusiness segment from ocean freight and port services over time, as the related services are performed. Performance obligations are typically completed within a fiscal quarter and any unearned revenue or accrued revenues are not material.\n \nShare-Based Compensation\n—Bunge maintains equity incentive plans for its employees and non-employee directors (see \nNote 24- Share-based Compensation\n). Bunge accounts for share-based compensation based on the grant date fair value. Share-based compensation expense is recognized on a straight-line basis over the requisite service period.\nIncome Taxes\n—Income tax expenses and benefits are recognized based on the tax laws and regulations in the jurisdictions in which Bunge's subsidiaries operate. The provision for income taxes includes income taxes currently payable and deferred income taxes resulting from temporary differences between the carrying amounts of existing assets and liabilities in Bunge's consolidated financial statements and their respective tax bases. Deferred tax assets are reduced by valuation allowances if current evidence indicates that it is not \"more likely than not\" that the deferred tax asset will be realized. Accrued interest and penalties related to unrecognized tax benefits are recognized in Income tax expense in the consolidated statements of income (see \nNote 14- Income Taxes\n).\nResearch and Development\n—Research and development costs are expensed as incurred.\n Research and development expenses \nwere \n$\n30\n million\n, $\n35\n million,\n and $\n33\n million for the years ended December 31, 2024, 2023, and 2022, respectively.\nGovernmental Assistance\n—Government grants are accounted for by analogy to International Accounting Standard 20, \nAccounting for Government Grants and Disclosure of Government Assistance\n, and are recognized at fair value when there is reasonable assurance that the established conditions will be met and the benefit will be received. Benefits are recognized either as a reduction of taxes payable or a credit in earnings.\nBunge qualifies for business incentives from governmental entities at various localities in which the Company operates. These programs primarily consist of tax incentives and cash grants designed to promote regional social and economic development or to incentivize production of clean energy.\nRegional social and economic development\n—Bunge receives tax credits from foreign state governments on the sale of eligible products. The program is valid through 2032 and contains recapture features if Bunge fails to meet program requirements, including job creation and production levels. For the years ended December 31, 2024, 2023, and 2022, Bunge recorded program tax credits of $\n129\n million, $\n176\n million and $\n205\n million in Net sales in the consolidated statements of income, respectively. At December 31, 2024, and December 31, 2023, Bunge recognized a $\n12\n million and $\n13\n million reduction to Other current liabilities, respectively, in the consolidated balance sheets related to benefits not yet realized.\nClean energy\n—Bunge receives cash grants from a governmental agency from the sale of clean energy. The program is valid through 2032 and contains recapture features if the Company does not follow program production efficiency requirements. For the years ended December 31, 2024, 2023, and 2022, Bunge recorded program related cash grants of $\n23\n million, $\n24\n million and $\n19\n million in \nCost of goods sold\n in the consolidated statements of income, respectively. At December 31, 2024, and 2023, Bunge recognized a $\n4\n million and $\n1\n million increase to Trade accounts receivable, respectively, in the consolidated balance sheets related to benefits not yet realized.\n \nRecently Adopted Accounting Pronouncements\nIn the fourth quarter of 2024, the Company adopted Accounting Standards Update ASU 2023-07, \nSegment Reporting—Improvements to Reportable Segment Disclosures (Topic 280) \n(\"ASU 2023-07\"), which requires incremental disclosures related to reportable segments, including disaggregated expense information and the title and position of the company's chief operating decision maker (\"CODM\"), as identified for purposes of segment determination. ASU 2023-07 is effective for fiscal years beginning after December 15, 2023 and interim periods within fiscal years beginning after December 15, 2024. Entities must adopt the changes to the segment reporting guidance on a retrospective basis. The adoption of this guidance resulted in expanded disclosures in \nNote 26- Segment Information\n.  \nNew Accounting Pronouncements\nIn November 2024, the FASB issued ASU 2024-03, \nIncome Statement—Reporting Comprehensive Income—Expense Disaggregation Disclosures (Subtopic 220-40) \n(\"ASU 2024-03\")\n. \nThe standard is intended to enhance transparency of income statement disclosures, primarily through additional disaggregation of relevant expense captions. ASU 2024-03 is effective for fiscal years beginning after December 15, 2026, and interim reporting periods beginning after December 15, 2027. Entities can \nF-18\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nadopt the change prospectively or retrospectively to any or all prior periods presented in the financial statements. The Company is currently evaluating the impact of the standard on its consolidated financial statements.\nIn March 2024, the SEC adopted final climate-related disclosure rules under SEC Release No. 33-11275, \nThe Enhancement and Standardization of Climate-Related Disclosures for Investors\n. The rules require disclosure of governance, risk management, and strategy related to material climate-related risks as well as disclosure of material greenhouse gas emissions in registration statements and annual reports. In addition, the rules require presentation of certain climate-related disclosures in the annual consolidated financial statements. On April 4, 2024, the SEC voluntarily stayed the effective date of the final rules pending completion of judicial review following certain legal challenges. The rules are effective beginning with annual periods ending December 31, 2025, pending resolution of the stay. Bunge is currently evaluating the impact of the rules on the Company’s disclosures.\nIn December 2023, the FASB issued ASU 2023-09, \nImprovements to Income Tax Disclosures (Topic 740) \n(\"ASU 2023-09\"). ASU 2023-09 requires disaggregated information about a reporting entity’s effective tax rate reconciliation as well as information on income taxes paid. The standard is intended to benefit investors by providing more detailed income tax disclosures that would be useful in making capital allocation decisions. The new requirements apply to all entities subject to income taxes and will be effective for annual periods beginning after December 15, 2024. The guidance will be applied on a prospective basis with the option to apply the standard retrospectively and early adoption is permitted. The Company has begun evaluating disclosure presentation alternatives that will result in expanded disclosure in the Company's \nIncome Taxes\n footnote.\n2. \nACQUISITIONS AND DISPOSITIONS\nAcquisitions\nViterra Limited Business Combination Agreement\nOn June 13, 2023, Bunge entered into a definitive business combination agreement (the \"Business Combination Agreement\") with Viterra Limited (\"Viterra\") and its shareholders including certain affiliates of Glencore PLC, Canada Pension Plan Investment Board, and British Columbia Investment Management Corporation (collectively, the \"Sellers\"), to acquire Viterra in a stock and cash transaction (the \"Acquisition\"). Bunge shareholders approved the Acquisition at the Extraordinary General Meeting held October 5, 2023. The Acquisition of Viterra by Bunge will create an innovative global agribusiness company well positioned to meet the demands of increasingly complex markets and better serve farmers and end-customers.  \nUnder the terms of the Business Combination Agreement, Viterra shareholders are anticipated to receive approximately \n65.6\n million registered shares of Bunge, with an aggregate value of approximately $\n5.1\n billion as of December 31, 2024 and receive approximately $\n2.0\n billion in cash (collectively the \"Transaction Consideration\"), in return for \n100\n% of the outstanding equity of Viterra. The determination of the final value of the Transaction Consideration will depend on the Company's share price at the time of closing. Upon completion of the transaction, the Sellers are expected to own approximately \n30\n% of the combined Bunge company on a fully diluted basis, before giving effect to any share repurchases by Bunge occurring after June 13, 2023. \nIn connection with the execution of the Business Combination Agreement, Bunge secured a total of $\n8.0\n billion in acquisition debt financing (\"Acquisition Financing\"). On September 17, 2024, Bunge completed the sale and issuance of \nthree\n tranches of unsecured senior notes (\"Senior Notes\") for an aggregate principal amount of $\n2.0\n billion. See \nNote 17- Debt \nfor further information. As a result of the Senior Notes issuance, and in accordance with its terms, the Acquisition Financing commitment was reduced by $\n2.0\n billion with $\n6.0\n billion available as of December 31, 2024. Bunge intends to use a portion of the proceeds from the Acquisition Financing and Senior Notes issuance to fund a portion of the cash consideration for Bunge's Acquisition of Viterra and to repay a portion of certain Viterra debt to be assumed in connection with the Acquisition, including, in each case, related fees and expenses, and, with any remaining amounts, for general corporate purposes. \nAlso, in the third quarter of 2024, Bunge's wholly-owned subsidiary, Bunge Limited Finance Corp. (\"BLFC\"), commenced offers (the \"US Exchange Offers\") to exchange all outstanding notes of certain series issued by Viterra Finance B.V. (\"VFBV\") and guaranteed by Viterra and Viterra B.V., for up to $\n1.95\n billion aggregate principal amount of new notes issued by BLFC and guaranteed by Bunge. In addition, in the third quarter of 2024, Viterra commenced a consent solicitation (the \"European Consent Solicitation\") to amend the indenture governing VFBV's outstanding \n500\n million \nEuro\n aggregate principal amount of \n0.375\n% senior unsecured notes due 2025 and outstanding \n700\n million \nEuro\n aggregate principal amount of \n1.000\n% senior unsecured notes due 2028 to, among other things, substitute the issuer and guarantors of such notes with Bunge Finance Europe B.V. (\"BFE\"), a wholly owned finance subsidiary of Bunge, as issuer, and Bunge as guarantor. The US \nF-19\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nExchange Offers and European Consent Solicitation are conditioned, among other things, upon the consummation of the Acquisition. See \nNote 17- Debt \nfor further information.  \nThe Acquisition is subject to the satisfaction of regulatory approvals and other customary closing conditions. The Acquisition is expected to receive the remaining regulatory approvals and close in the next few months. The Business Combination Agreement may be terminated by mutual written consent of the parties and includes certain customary termination rights. If the Business Combination Agreement is terminated in connection with certain circumstances relating to the failure to obtain certain antitrust and competition clearances that are conditions to closing, Bunge would be obligated to pay the Sellers a fee of $\n400\n million in the aggregate.   \nAdditionally, on June 12, 2023, in contemplation of the Business Combination Agreement, Bunge Limited's Board of Directors approved the expansion of an existing share repurchase program resulting in an aggregate purchase authorization of $\n2.0\n billion for the repurchase of Bunge's issued and outstanding shares. On November 13, 2024, Bunge Global SA's Board of Directors authorized the repurchase of an additional $\n500\n million of its issued and outstanding registered shares. During the period June 13, 2023 through December 31, 2024, Bunge repurchased \n17,558,624\n shares for $\n1.7\n billion. Therefore, as of December 31, 2024, an aggregate purchase authorization of $\n800\n million remains outstanding for repurchases under the program. See \nNote 22- Equity\n for further details on share repurchases.\nEspaçogrãos Grain Elevators\nOn November 30, 2023, Bunge entered into purchase and sale agreements with Espaçogrãos to acquire three grain elevators and related assets (\"Silos\") for total cash consideration of approximately $\n71\n million, inclusive of $\n35\n million of advance payments expected prior to the close. Advance payments are refundable under certain conditions, including in the event closing does not occur. The Silos are located in the Brazilian cities of Nova Mutum, Matupa and Alta Floresta. In the second quarter of 2024, Bunge closed on the Nova Mutum Silo and the remaining asset acquisitions are expected to close separately per each agreement in the first half of 2025, subject to certain closing conditions.  \nCJ Latam and Selecta Share Purchase Agreement\nOn October 10, 2023, Bunge entered into a definitive share purchase agreement with CJ CheilJedang Corporation and STIC CJ Global Investment Corporate Partnership Private Equity Fund to acquire \n100\n% of outstanding equity of CJ Latam Participações Ltda. and CJ Selecta S.A. (collectively, \"CJ\") for a total cash consideration of approximately $\n510\n million to be adjusted for net debt, plus an additional sum in consideration for the value of net working capital. Operations of CJ primarily consist of an oilseed processing facility located in Brazil. Bunge expects to finance the transaction through cash from operations and existing financing facilities. The acquisition is expected to close in early 2025, subject to customary closing conditions.\nFuji Oils New Orleans, LLC Port Based Refinery\nOn April 14, 2023, Bunge, through its \n80\n% ownership of Bunge Loders Croklaan joint venture with IOI Corporation Berhad, completed its purchase of Fuji Oils New Orleans, LLC's port-based refinery. The refinery is located in International-Matex Tank Terminals' Avondale Terminal, in Avondale, Louisiana in the United States. Cash consideration for the asset acquisition of $\n181\n million was allocated to Property, plant and equipment, net ($\n220\n million), inclusive of a finance lease right of use asset ($\n52\n million), long-term finance lease obligations ($\n41\n million) included in Long-term debt and Current portion of long-term debt, and other net working capital ($\n2\n million).\nF-20\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nDispositions\nBP Bunge Bioenergia\nOn June 19, 2024, Bunge entered into a definitive share purchase agreement with BP Biofuels Brazil Investment Limited (\"BP\") to sell its \n50\n%\n ownership share in BP Bunge Bioenergia. On October 1, 2024, the transaction closed in accordance with the terms of the share purchase agreement for a total net amount of $\n828\n million in consideration inclusive of certain closing adjustments for the value of net working capital and net debt, among other items. As of December 31, 2024, $\n728\n million in cash consideration had been received and recorded as a cash inflow within Proceeds from investments in affiliates on the consolidated statement of cash flows. Also, per the terms of the agreement, a $\n100\n million deferred payment, received in early 2025 and applied to the consideration of the transaction, has been recorded within Other current assets on the consolidated balance sheet.   \n In connection with the transaction, Bunge has agreed to indemnify BP against future losses associated with certain legal claims as defined in the share purchase agreement\n.\n As a consequence, Bunge recognized a liability of $\n95\n million in accordance with ASC 460, \nGuarantees \nand ASC 450, \nContingencies\n. See \nNote 20- Commitments and Contingencies \nfor more information. \nThe disposal group included Investments in affiliates of $\n385\n million and a $\n142\n million release of Accumulated other comprehensive loss, among other items, reported under the Sugar and Bioenergy segment. The transaction close resulted in a pretax gain on sale of $\n195\n million, which was recorded within \nOther income (expense) - net,\n in the consolidated statement of income for the year ended December 31, 2024.\nPartnership with Repsol - Bunge Iberica SA\n On March 26, 2024, Bunge entered into a definitive stock purchase agreement with Repsol Industrial Transformation, SLU, a wholly owned subsidiary of Repsol SA, whereby Bunge will divest \n40\n% of its Spanish operating subsidiary, Bunge Iberica SA (\"BISA\"), in exchange for approximately $\n300\n million plus up to $\n40\n million in contingent payments, subject to certain purchase price adjustments. BISA operates \nthree\n industrial facilities in the Iberian Peninsula. The transaction is expected to close in early 2025, subject to customary closing conditions. \nRussian Oilseed Processing and Refining Operations Disposition\nOn September 16, 2022, Bunge signed an agreement to sell its remaining Russian operations, primarily comprising an oilseed crushing and refining facility in Voronezh, southwest Russia (referred to as the \"disposal group\"), to Karen Vanetsyan (the \"Buyer\"), in exchange for a cash price approximately equal to the book value of the disposal group's net assets. On January 9, 2023, Bunge and the Buyer agreed to a purchase price adjustment. The purchase price adjustment and cumulative translation adjustment losses, among other items related to the disposal group, resulted in a corresponding impairment loss on sale of $\n103\n million, recognized in Cost of goods sold for the year ended December 31, 2022. On February 3, 2023, the transaction closed in accordance with the terms of the agreement with no material impact to the consolidated statement of income for the year ended December 31, 2023.\nIn connection with the transaction, Bunge agreed to indemnify the Buyer against certain legal claims involving Bunge's Russian subsidiary. Management has assessed the likelihood of any loss related to claims covered by the indemnity as remote, and recognized a liability in accordance with ASC 460, \nGuarantees\n. See \nNote 20- Commitments and Contingencies \nfor more information.\nF-21\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe following table presents the book values of the major classes of assets and liabilities that were included in the disposal group at the closing date. Intercompany balances between the disposal group and other Bunge consolidated entities have been omitted. Assets included in the disposal group comprised $\n12\n million and $\n21\n million, reported under the Agribusiness segment and Refined and Specialty Oils segment, respectively. Liabilities included in the disposal group comprised $\n6\n million and $\n13\n million, reported under the Agribusiness segment and Refined and Specialty Oils segment, respectively.\n(US$ in millions)\nCash and cash equivalents\n$\n19\n \nTrade accounts receivable (less allowances of zero)\n15\n \nInventories\n33\n \nOther current assets\n14\n \nProperty, plant and equipment, net\n24\n \nGoodwill & Other intangible assets, net\n10\n \nOther non-current assets\n8\n \nImpairment reserve\n(\n90\n)\nTotal assets\n$\n33\n \nTrade accounts payable and accrued liabilities\n$\n3\n \nOther  current liabilities\n16\n \nTotal liabilities\n$\n19\n \nMexico Wheat Milling Disposition\nOn October 12, 2021, Bunge entered into an agreement to sell substantially all of its wheat milling business in Mexico in exchange for cash proceeds approximately equal to the book value of property, plant and equipment, net, plus an additional sum in consideration for the value of net working capital to be transferred upon closing. Additionally, cumulative translation adjustments, among other items related to the disposal group, resulted in a corresponding impairment loss on sale of $\n170\n million, recognized in Cost of goods sold for the year ended December 31, 2021. The Company also incurred a $\n30\n million tax expense in connection with the disposal. On September 14, 2022, the transaction closed in accordance with the terms of the agreement.\n \nThe following table presents the book values of the major classes of assets and liabilities that were included in the disposal group, reported under the Milling segment:\n(US$ in millions)\nTrade accounts receivable\n$\n73\n \nInventories\n187\n \nOther current assets\n7\n \nProperty, plant and equipment, net\n164\n \nOperating lease assets\n2\n \nGoodwill & Other intangible assets, net\n86\n \nImpairment reserve\n(\n170\n)\nTotal assets\n$\n349\n \nTrade accounts payable\n$\n13\n \nCurrent operating lease obligations\n1\n \nOther current liabilities\n5\n \nTotal liabilities\n$\n19\n \nF-22\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n3. \nTRADE STRUCTURED FINANCE PROGRAM\nThe Company engages in various trade structured finance activities to leverage the value of its global trade flows. These activities include programs under which Bunge generally obtains U.S. dollar and foreign currency denominated letters of credit (\"LCs\") from financial institutions, each based on an underlying commodity trade flow, and time deposits denominated in U.S. dollars and foreign currencies, as well as foreign exchange forward contracts, in which trade related payables are set-off against receivables, all of which are subject to legally enforceable set-off agreements.\n For the years ended December 31, 2024, 2023, and 2022, net returns from these activities were $\n58\n million, $\n36\n million, and $\n32\n million, respectively, and were included as a reduction of Cost of goods sold in the accompanying consolidated statements of income. As of December 31, 2024, and 2023, time deposits and LCs of $\n6,914\n million and $\n6,880\n million, respectively, were presented net on the consolidated balance sheets as the criteria of ASC 210-20, \nOffsetting\n, had been met. At December 31, 2024, and 2023, time deposits, including those presented on a net basis, carried weighted-average interest rates of \n5.22\n% and \n5.77\n%, respectively. During the years ended December 31, 2024, 2023, and 2022, total net proceeds from discounting of LCs were $\n6,799\n million, $\n6,730\n million, and $\n5,826\n million, respectively. These cash inflows are offset by the related cash outflows resulting from placement of the time deposits and repayment of the LCs. All cash flows related to the programs are included in operating activities in the consolidated statements of cash flows.\nAs part of the trade structured finance activities, LCs may be sold to financial institutions on a discounted basis. Bunge does not service derecognized LCs. The terms of the sale may require the Company to continue to make periodic interest payments to financial institutions based on changes in the Secured Overnight Financing Rate (\"SOFR\") for a period of up to \none year\n. Bunge’s payment obligation to financial institutions as part of the trade structured finance activities, reported in Other current liabilities, including any unrealized gain or loss on changes in SOFR is not significant as of December 31, 2024, and 2023. The notional amounts of LCs subject to continuing variable interest payments that have been derecognized from the Company's consolidated balance sheets as of December 31, 2024, and 2023 are included in \nNote 16- Derivative Instruments and Hedging Activities\n. The net gain or loss included in Cost of goods sold resulting from the fair valuation of such variable interest rate obligations is not significant for the years ended December 31, 2024, 2023, and 2022.\n4. \nTRADE ACCOUNTS RECEIVABLE AND TRADE RECEIVABLES SECURITIZATION PROGRAM\nTrade Accounts Receivable\nChanges to the allowance for expected credit losses related to Trade accounts receivable are as follows:\n Twelve Months Ended December 31, 2024\nRollforward of the Allowance for Credit Losses (US$ in millions)\nShort-term\nLong-term \n(1)\nTotal\nAllowance as of January 1, 2024\n$\n104\n \n$\n32\n \n$\n136\n \nCurrent period provisions \n50\n \n1\n \n51\n \nRecoveries\n(\n48\n)\n(\n2\n)\n(\n50\n)\nWrite-offs charged against the allowance\n(\n11\n)\n(\n2\n)\n(\n13\n)\nForeign exchange translation differences\n(\n6\n)\n(\n5\n)\n(\n11\n)\nAllowance as of December 31, 2024 \n$\n89\n \n$\n24\n \n$\n113\n \n(1)\nLong-term portion of the allowance for credit losses is included in Other non-current assets.\n Twelve Months Ended December 31, 2023\nRollforward of the Allowance for Credit Losses (US$ in millions)\nShort-term\nLong-term \n(1)\nTotal\nAllowance as of January 1, 2023\n$\n90\n \n$\n46\n \n$\n136\n \nCurrent period provisions \n71\n \n—\n \n71\n \nRecoveries\n(\n57\n)\n(\n2\n)\n(\n59\n)\nWrite-offs charged against the allowance\n(\n2\n)\n(\n13\n)\n(\n15\n)\nForeign exchange translation differences\n2\n \n1\n \n3\n \nAllowance as of December 31, 2023 \n$\n104\n \n$\n32\n \n$\n136\n \n(1)\nLong-term portion of the allowance for credit losses is included in Other non-current assets.\nF-23\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nTrade Receivables Securitization Program\nBunge and certain of its subsidiaries participate in a trade receivables securitization program (the \"Program\") with a financial institution, as administrative agent, and certain commercial paper conduit purchasers and committed purchasers (collectively, the \"Purchasers\"). Koninklijke Bunge B.V., a wholly owned subsidiary of Bunge, acts as master servicer, responsible for servicing and collecting the accounts receivable for the Program. The Program is designed to enhance Bunge’s financial flexibility by providing an additional source of liquidity for its operations.\nThe Program provides for funding of up to $\n1.5\n billion and from time to time with the consent of the administrative agent, Bunge may request one or more of the existing committed purchasers or new committed purchasers to increase the total commitments by an amount not to exceed $\n1\n billion pursuant to an accordion provision. The Program will terminate on May 17, 2031; however, each committed purchaser's commitment to purchase trade receivables under the Program will terminate earlier on December 16, 2025, with a feature that permits Bunge to request \n364-day\n extensions. The Program includes sustainability provisions, pursuant to which the applicable margin will be increased or decreased based on Bunge's performance relative to certain sustainability targets, including, but not limited to, science-based targets (\"SBTs\") that define Bunge's climate goals within its operations and a commitment to a deforestation-free supply chain in 2025.\nThe Program’s current pledge structure results from a November 16, 2022 amendment which replaced the existing deferred purchase price (\"DPP\") structure. Under the Program's pledge structure, Bunge Securitization B.V. (\"BSBV\"), a consolidated bankruptcy remote special purpose entity, transfers certain trade receivables to the Purchasers in exchange for a cash payment up to the aggregate size of the Program. Bunge also retains ownership of a population of unsold receivables. BSBV agrees to guaranty the collection of sold receivables and grants a lien to the administrative agent on all unsold receivables. Collections on unsold receivables and guarantee payments are classified as operating activities in Bunge’s consolidated statements of cash flows. \nAt November 16, 2022, the effective date of the amended Program, $\n741\n million of sold receivables were repurchased through a non-cash investing exchange of the DPP. As of December 31, 2024, the Company has collected substantially all of the repurchased receivables.  \nDecember 31,\n(US$ in millions)\n2024\n2023\nReceivables sold which were derecognized from Bunge's balance sheet \n$\n1,148\n \n$\n1,230\n \nReceivables pledged to the administrative agent and included in Trade accounts receivable\n$\n123\n \n$\n343\n \nBunge's risk of loss following the sale of trade receivables is limited to the assets of BSBV, primarily comprised of unsold receivables pledged to the administrative agent.  \nThe table below summarizes the cash flows and discounts of Bunge's trade receivables associated with the Program. Servicing fees under the Program were not significant in any period.\nYears Ended December 31,\n(US$ in millions)\n2024\n2023\n2022\nGross receivables sold\n$\n12,490\n \n$\n11,669\n \n$\n17,248\n \nProceeds received in cash related to transfer of receivables \n(1)\n$\n12,442\n \n$\n11,615\n \n$\n16,340\n \nCash collections from customers on receivables previously sold\n$\n12,572\n \n$\n11,539\n \n$\n17,450\n \nDiscounts related to gross receivables sold included in SG&A\n$\n48\n \n$\n54\n \n$\n23\n \n(1)\nPrior to November 16, 2022, the Company recognized these proceeds net of the DPP, consisting of a receivable from the Purchasers that entitled the Company to certain collections on the receivable. The Company recognized the collection of the DPP in net cash provided by investing activities in the consolidated statements of cash flows. As a result of the November 16, 2022 amendment, Bunge reports collections on newly originated, unsold receivables held by BSBV as operating cash flows in the consolidated statements of cash flows.\n \nNon-cash activity for the Program in the reporting period is represented by the difference between gross receivables sold and cash collections from customers on receivables previously sold\n.\nF-24\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n5. \nINVENTORIES\nInventories by reportable segment and Corporate and Other consist of the following: \nDecember 31,\n(US$ in millions)\n2024\n2023\nAgribusiness\n$\n5,090\n \n$\n5,830\n \nRefined and Specialty Oils\n1,188\n \n1,096\n \nMilling\n209\n \n175\n \nCorporate and Other\n4\n \n4\n \nTotal\n$\n6,491\n \n$\n7,105\n \nRMI by reportable segment consist of the following: \nDecember 31,\n(US$ in millions)\n2024\n2023\nAgribusiness\n(1)\n$\n4,819\n \n$\n5,519\n \nRefined and Specialty Oils\n339\n \n302\n \nMilling\n66\n \n16\n \nTotal\n$\n5,224\n \n$\n5,837\n \n(1)\nThe Company engages in trading and distribution, or merchandising activities. Included in\n RMI is $\n3,612\n million and $\n4,242\n million attributable to merchandising activities at December 31, 2024 and 2023, respectively.\n \n \n6. \nOTHER CURRENT ASSETS\nOther current assets consist of the following:\nDecember 31,\n(US$ in millions)\n2024\n2023\nUnrealized gains on derivative contracts, at fair value\n$\n1,286\n \n$\n1,481\n \nPrepaid commodity purchase contracts \n(1)\n216\n \n320\n \nSecured advances to suppliers, net \n(2)\n239\n \n462\n \nRecoverable taxes, net\n315\n \n378\n \nMargin deposits\n579\n \n618\n \nMarketable securities and other short-term investments \n(3)\n484\n \n105\n \nIncome taxes receivable\n122\n \n54\n \nPrepaid expenses\n164\n \n346\n \nRestricted cash\n17\n \n21\n \nDisposition receivable \n(4)\n100\n \n—\n \nInsurance recovery receivable \n(5)\n52\n \n—\n \nOther\n434\n \n266\n \nTotal\n$\n4,008\n \n$\n4,051\n \n(1)\nPrepaid commodity purchase contracts represent advance payments against contracts for future deliveries of specified quantities of agricultural commodities. The balance includes certain advance payments on contracts with various unconsolidated investees see \nNote 19- Related Party Transactions\n. \n(2)\nBunge provides cash advances to suppliers, primarily Brazilian soybean farmers, to finance a portion of the suppliers' production costs, primarily to secure the origination of soybeans for Bunge's soybean processing facilities in Brazil. \nF-25\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe balance includes certain advance payments on contracts with various unconsolidated investees see \nNote 19- Related Party Transactions\n. Bunge does not bear any of the costs or operational risks associated with growing the related crops. The ability of Bunge's counterparties to repay these amounts is affected by agricultural economic conditions in the relevant geography, which are in turn affected by commodity prices, currency exchange rates, crop input costs, and crop quality and yields. As a result, the advan\nces are largely collateralized by future crops and physical assets of the suppliers, carry a local market interest rate, an\nd settle when the farmers' crops are harvested and sold. \nThe secured advances to suppliers are reported net of allowances of $\n5\n million a\nnd $\n8\n million at December 31, 2024 and 2023, respectively. Bunge periodically evaluates the collectability of its secured advances to suppliers and records allowances if it determines that collection is doubtful. Bunge bases the Company’s determination of the allowance on analyses of the credit quality of individual accounts, also considering the economic and financial condition of the farming industry and other market conditions, as well as the value of any collateral related to amounts owed. Bunge continuously reviews defaulted supplier receivables for impairment on an individual account basis. Bunge considers all accounts in legal collection processes to be defaulted and past due. For such accounts, Bunge determines the allowance for uncollectible amounts based on the fair value of the associated collateral, net of estimated costs to sell. For all renegotiated accounts (current and past due), Bunge considers changes in farm economic conditions and other market conditions, Bunge’s historical experience related to renegotiated accounts, and the fair value of collateral in determining the allowance for doubtful accounts. \n \nInterest earned on secured advances to suppliers \nof $\n25\n million\n, $\n25\n million,\n and $\n22\n million, for the years ended December 31, 2024, 2023, and 2022, respectively, is included in Net sales in the consolidated statements of income.\n(3)\n Marketable securities and other short-term investments—Bunge invests in foreign government securities, corporate debt securities, deposits, equity securities, and other securities. \nThe following is a summary of amounts recorded in the consolidated balance sheets as marketable securities and other short-term investments.\nDecember 31,\n(US$ in millions)\n2024\n2023\nForeign government securities\n$\n229\n \n$\n39\n \nCertificate of deposits/time deposits\n136\n \n—\n \nEquity securities\n21\n \n28\n \nOther\n98\n \n38\n \nTotal marketable securities and other short-term investments\n$\n484\n \n$\n105\n \nAs of December 31, 2024 and 2023, $\n386\n million and $\n67\n million, respectively, of marketable securities and other short-term investments are recorded at fair value. All other investments were recorded at cost, and due to the short-term nature of these investments, their carrying values approximate fair values. For the years ended December 31, 2024,  2023, and 2022, unrealized gains/(losses) of $\n9\n million, \nzero\n, and $(\n140\n) million, respectively, have been recorded and recognized in Other income (expense) - net for investments held at December 31, 2024, 2023, and 2022.\n(4)\n On October 1, 2024, Bunge completed the sale of our \n50\n% ownership share in BP Bunge Bioenergia to BP. In connection with the sale, a disposition receivable of $\n100\n million was recorded at December 31, 2024 and collected in early 2025. See \nNote 2- Acquisitions and Dispositions\n for further information.\n(5)\nIn the year ended December 31, 2024, the Company recognized an insurance recovery related to the Ukraine-Russia war of $\n52\n million attributable to business interruption. See \nNote 1- Nature of Business, Basis of Presentation and Significant Accounting Policies\n for further information.\nF-26\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n7. \nPROPERTY, PLANT AND EQUIPMENT\nProperty, plant and equipment, net consist of the following:\n \nDecember 31,\n(US$ in millions)\n2024\n2023\nLand\n$\n388\n \n$\n399\n \nBuildings\n1,970\n \n1,909\n \nMachinery and equipment\n5,473\n \n5,262\n \nFurniture, fixtures and other\n667\n \n640\n \nConstruction in progress\n1,533\n \n1,017\n \nGross book value\n10,031\n \n9,227\n \nLess: accumulated depreciation and depletion\n(\n4,777\n)\n(\n4,686\n)\nProperty, plant and equipment, net\n$\n5,254\n \n$\n4,541\n \nBunge's paid and accrued capital expenditures amounted to $\n1,400\n million, $\n1,192\n million, and $\n593\n million during the years ended December 31, 2024, 2023, and 2022, respectively. Included in these capitalized expenditures was capitalized interest on construction in progress of $\n40\n million, $\n19\n million, and $\n3\n million for the years ended December 31, 2024, 2023, and 2022, respectively. Depreciation and depletion expense was $\n431\n million, $\n390\n million, and $\n363\n million for the years ended December 31, 2024, 2023, and 2022, respectively.\n8. \nGOODWILL\nBunge generally performs its annual goodwill impairment analysis during the fourth quarter. If events or indicators of impairment occur between annual impairment analyses, the Company performs an impairment analysis at that date. These events or circumstances could inc\nlude a significant change in the business climate, legal factors, operating performance indicators, competition, or the sale or disposition of a significant asset. In testing for a potential impairment of goodwill, the Company: (1) validates changes, if any, to its reporting units with goodwill balances; (2) allocates goodwill to its reporting units to which acquired goodwill relates; (3) determines the carrying value, or \nbook value, of its reporting units; (4) estimates the fair value of each reporting unit using a discounted cash flow model and/or using market multiples; (5) compares the fair value of each reporting unit to its carrying value; and (6) if the estimated fair value of a reporting unit is less than the carrying value, the Company recognizes an impairment charge for such amount, not to exceed the total amount of goodwill allocated to that reporting unit. \n Critical estimates in the determination of fair value under the income approach include, but are not limited to, assumptions about variables such as commodity prices, crop and related throughput and production volumes, profitability, future capital expenditures, other expenses, and discount rates, all of which are subject to a high degree of judgment. Critical estimates in the determination of fair value under the market approach include, but are not limited to, determination of the guideline public companies and selection of the market multiples.\nF-27\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nChanges in the carrying value of goodwill by reportable segment for the years ended December 31, 2024 and 2023 are as follows:\n(US$ in millions)\nAgribusiness\nRefined and Specialty Oils\nMilling\nSugar and\nBioenergy\nTotal\nCost:\nBalance at December 31, 2023\n$\n211\n \n$\n300\n \n$\n89\n \n$\n—\n \n$\n600\n \nAdditions\n2\n \n—\n \n—\n \n—\n \n2\n \nDisposals \n—\n \n—\n \n—\n \n—\n \n—\n \nForeign currency translation\n(\n19\n)\n(\n9\n)\n(\n13\n)\n—\n \n(\n41\n)\nBalance at December 31, 2024\n194\n \n291\n \n76\n \n—\n \n561\n \nAccumulated impairment losses:\nBalance at December 31, 2023\n(\n2\n)\n(\n106\n)\n(\n3\n)\n—\n \n(\n111\n)\nImpairment charge for the period\n—\n \n—\n \n—\n \n—\n \n—\n \nDisposals\n—\n \n—\n \n—\n \n—\n \n—\n \nForeign currency translation\n—\n \n3\n \n—\n \n—\n \n3\n \nBalance at December 31, 2024\n(\n2\n)\n(\n103\n)\n(\n3\n)\n—\n \n(\n108\n)\nNet carrying value at December 31, 2024\n$\n192\n \n$\n188\n \n$\n73\n \n$\n—\n \n$\n453\n \n(US$ in millions)\nAgribusiness\nRefined and Specialty Oils\nMilling\nSugar and\nBioenergy\nTotal\nCost:\nBalance at December 31, 2022\n$\n203\n \n$\n292\n \n$\n85\n \n$\n—\n \n$\n580\n \nDisposals\n—\n \n—\n \n—\n \n—\n \n—\n \nForeign currency translation\n8\n \n8\n \n4\n \n—\n \n20\n \nBalance at December 31, 2023\n211\n \n300\n \n89\n \n—\n \n600\n \nAccumulated impairment losses:\nBalance at December 31, 2022\n(\n2\n)\n(\n105\n)\n(\n3\n)\n—\n \n(\n110\n)\nImpairment charge for the period \n—\n \n—\n \n—\n \n—\n \n—\n \nDisposals \n—\n \n—\n \n—\n \n—\n \n—\n \nForeign currency translation\n—\n \n(\n1\n)\n—\n \n—\n \n(\n1\n)\nBalance at December 31, 2023\n(\n2\n)\n(\n106\n)\n(\n3\n)\n—\n \n(\n111\n)\nNet carrying value at December 31, 2023\n$\n209\n \n$\n194\n \n$\n86\n \n$\n—\n \n$\n489\n \nF-28\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n9. \nOTHER INTANGIBLE ASSETS\nOther intangible assets, net are all finite-lived and consist of the following:\n \nDecember 31,\n(US$ in millions)\n2024\n2023\nGross carrying amount:\nTrademarks/brands\n$\n145\n \n$\n156\n \nLicenses\n82\n \n102\n \nPort rights\n53\n \n68\n \nCustomer relationships\n288\n \n299\n \nPatents\n125\n \n131\n \nOther\n36\n \n37\n \n729\n \n793\n \nAccumulated amortization:\n \n \nTrademarks/brands\n(\n116\n)\n(\n122\n)\nLicenses\n(\n12\n)\n(\n10\n)\nPort rights\n(\n19\n)\n(\n21\n)\nCustomer relationships\n(\n145\n)\n(\n133\n)\nPatents\n(\n93\n)\n(\n86\n)\nOther\n(\n23\n)\n(\n23\n)\n(\n408\n)\n(\n395\n)\nOther intangible assets, net\n$\n321\n \n$\n398\n \nAmortization expense was $\n37\n million, $\n61\n million, and $\n41\n million for the years ended December 31, 2024, 2023 and 2022, respectively. The estimated future amortization expense is as follows: $\n36\n million for 2025; $\n37\n million for 2026; $\n36\n million for 2027; $\n27\n million for 2028; and $\n25\n million for 2029. \nDuring the year ended December 31, 2023, the Company discontinued its use of several trademarks, primarily consisting of trademarks acquired in Bunge's 2018 acquisition of Loders Croklaan. The discontinuation triggered a reassessment of the trademarks' estimated useful lives resulting in accelerated amortization through December 31, 2023. For the year ended December 31, 2023, accelerated amortization expense of $\n21\n million was recorded to SG&A expenses within the Refined and Specialty Oils segment. For the year ended December 31, 2023, Net income attributable to Bunge included $\n12\n million of expense (net of $\n5\n million in tax benefit) and Net income attributable to noncontrolling interests and redeemable noncontrolling interests included $\n3\n million of expense (net of $\n1\n million in tax benefit) related to accelerated amortization.\n \n10. \nIMPAIRMENTS\nFor the year ended December 31, 2024, Bunge recorded an impairment charge of $\n19\n million in (Loss) income from affiliates associated with one of its equity method investments, see \nNote 11- Investments in Affiliates and Variable Interest Entities \nfor further details.  \nFor the year ended December 31, 2023, Bunge recorded a pre-tax fixed asset impairment charge of $\n37\n million in Cost of goods sold associated with a North America facility. The impairment charge was recorded to the Agribusiness segment. Bunge also recorded \ntwo\n impairment charges to Corporate and Other. First, a $\n20\n million impairment charge, in Other Income (expense) - net, related to the full impairment of a long-term investment held in Other non-current assets. Second, Bunge recorded an impairment charge of $\n16\n million in (Loss) income from affiliates associated with one of its equity method investments, see \nNote 11- Investments in Affiliates and Variable Interest Entities \nfor further details.  \nF-29\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nFor the year ended December 31, 2022, Bunge recorded a pre-tax impairment charge of $\n103\n million, in \nCost of goods sold\n, related to the classification of our Russian operations as held-for-sale (see \nNote 2- Acquisitions and Dispositions\n) as well as $\n2\n million related to damaged sustained to the Company's Mykolaiv port facility in Ukraine as a result of the Ukraine-Russia war. The charge was recorded as $\n42\n million charge to the Agribusiness segment, $\n52\n million charge to the Refined and Specialty Oils segment, and the remaining portion of the impairment charge was recorded to Corporate and Other. Bunge also recorded impairment charges of $\n53\n million in (Loss) income from affiliates associated with \ntwo\n of its equity method investments, see \nNote 11- Investments in Affiliates and Variable Interest Entities \nfor further details. The impairment charge was recorded to Corporate and Other.\n 11. \nINVESTMENTS IN AFFILIATES AND VARIABLE INTEREST ENTITIES\nBunge participates in various unconsolidated joint ventures and other investments accounted for using the equity method.  The Company records its interest in the net earnings of its equity method investees, along with the amortization of basis differences, within (Loss) income from affiliates, in the consolidated statements of income. Basis differences represent differences between the cost of the investment and the underlying equity in net assets of the investment and are amortized over the lives of the related assets that gave rise to them. At December 31, 2024, the aggregate of all basis differences was a debit of $\n134\n million, including $\n46\n million of amortizable basis difference. At December 31, 2023, the aggregate of all basis differences was a credit of $\n56\n million, including $\n95\n million of amortizable basis difference. The change from the prior year is primarily attributable to the sale of BP Bunge Bioenergia. At December 31, 2024, the remaining aggregate basis differences are primarily associated with equity method investments in South America. Certain significant equity method investments at December 31, 2024 are described below. Bunge allocates equity in earnings of affiliates to its reporting segments.\nAgribusiness\nAgricola Alvorada S.A. - \nBunge has a \n37\n% ownership interest in an agribusiness company in Brazil that complements its grain origination business.\nAgrofel Grãos e Insumos. - \nBunge has a \n30\n% ownership interest in an agricultural inputs reseller in Brazil that complements its soybean origination business.\nComplejo Agroindustrial Angostura S.A. (\"CAIASA\") - \nBunge has a \n33\n% ownership interest in an oilseed processing facility joint venture with Louis Dreyfus Company B.V. and Aceitera General Deheza S.A. (\"AGD\") in Paraguay.\nCoverCress Inc. - \nBunge has a \n22\n% ownership interest in a company that has developed a novel low carbon-intensity winter oilseed crop called CoverCress™. \nG3 Global Holding GP Inc. - \nBunge has a \n25\n% ownership interest in G3 Global Holding GP Inc., a joint venture with Saudi Agricultural and Livestock Investment Company (\"SALIC\") that operates grain facilities in Canada.\nHosemillas Holdings S.A (\"Hosemillas\") - \nBunge has a \n20\n% ownership interest in a Uruguay holding company with operations and subsidiaries located in South America, including Brazil, Paraguay, Argentina, and Uruguay. Operations primarily focus on the processing and marketing of seeds as well as developing technology for genetic improvements of seeds.\nNavegações Unidas Tapajós S.A. (\"Tapajos\") - \nBunge has a \n50\n% ownership interest in Tapajos, a joint venture with Amaggi Exportaçao E Importaçao to operate inland waterway transportation between the municipalities of Itaituba and Barcarena, Brazil. The Tapajos complex is mainly dedicated to exporting soybeans and grains from Brazil. \nProMaiz S.A. - \nBunge has a \n50\n% ownership interest in a corn wet milling facility joint venture with Aceitera General Deheza S.A. in Argentina for the production of ethanol.\nSinova Inovações Agrícolas S.A. (\"Sinova\") - \nBunge has a \n33\n% ownership interest in a Brazilian distributor of agricultural inputs and originator of grains that complements Bunge's grain origination business. \nTerminais do Graneis do Guaruja (\"TGG\") - \nBunge has a \n57\n% ownership interest in TGG, a joint venture with Amaggi International Ltd. to operate a port terminal in Santos, Brazil, for the reception, storage and shipment of solid bulk cargoes.\nTerminal 6 S.A. and Terminal 6 Industrial S.A. - \nBunge has a joint venture, Terminal 6 S.A., in Argentina with AGD for the operation of a port facility located in the Santa Fe province of Argentina. Bunge is also a party to a second joint venture with AGD, Terminal 6 Industrial S.A., which operates a crushing facility located adjacent to the port facility. Bunge owns \n40\n% and \n50\n%, respectively, of these joint ventures.\nF-30\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nVietnam Agribusiness Holdings Ptd. Ltd (\"VAH\") - \nBunge has a \n50\n% ownership in VAH, with Wilmar International Limited (\"Wilmar\") owning the remaining \n50\n%. VAH owns \n100\n% of the shares of an oilseed processing facility in Vietnam.\nSugar and Bioenergy\nBP Bunge Bioenergia - \nBunge had a \n50\n% ownership interest in BP Bunge Bioenergia, a joint venture with BP. On October 1, 2024, we completed the sale of our \n50\n% interest in BP Bunge Bioenergia to BP. See \nNote 2- Acquisitions and Dispositions\n for further information. \nSummarized financial information, combined, for all of Bunge's equity method investees is as follows:\nDecember 31,\n(US$ in millions)\n2024\n2023\nCurrent assets\n$\n3,007\n \n$\n4,755\n \nNoncurrent assets\n2,509\n \n4,345\n \nTotal assets\n$\n5,516\n \n$\n9,100\n \nCurrent liabilities\n$\n2,674\n \n$\n3,590\n \nNoncurrent liabilities\n1,207\n \n2,344\n \nTotal liabilities\n$\n3,881\n \n$\n5,934\n \nYears ended December 31,\n(US$ in millions)\n2024\n2023\n2022\nNet sales\n$\n11,520\n \n$\n12,529\n \n$\n11,268\n \nGross profit\n715\n \n907\n \n953\n \nNet income (loss)\n(\n39\n)\n283\n \n312\n \nPending Transactions\nTerminal XXXIX De Santos S.A. (“T-39”) - \nOn May 29, 2024, Bunge entered into a share purchase agreement to indirectly acquire a \n25\n% interest of T-39. The acquisition price for Bunge's \n25\n% interest is Brazilian reais (\"R$\") \n300\n million (approximately $\n48\n million). T-39 operations primarily consist of a port facility located in the Port of Santos, Brazil. The transaction is expected to close in early 2025, subject to customary closing conditions. \nImpairments of Equity Method Investments\nDuring the year ended December 31, 2022, the Company recorded total impairments of $\n53\n million associated with its equity method and other equity investments in two start-up manufacturers of novel protein ingredients, Merit Functional Foods Corp. (\"Merit\") and Australian Plant Proteins (\"APP\"). These impairments were determined through management's review of impairment indicators and consideration of the other-than temporary nature of such items. Impairment charges on both the equity method and other equity investments in Merit and APP were recorded to (Loss) income from affiliates within Corporate and Other. \nFurther, during the year ended December 31, 2023, the Company recorded an additional impairment of $\n16\n million associated with APP to (Loss) income from affiliates within Corporate and Other. This impairment was determined through management's review of impairment indicators and consideration of the other-than temporary nature of such items. As a result of the impairments, there is no carrying value associated with the equity method investments in Merit and APP at December 31, 2024.  \nDuring the year ended December 31, 2024, the Company recorded an impairment of $\n19\n million associated with a minority investment in North America. The impairment was determined through management's review of impairment indicators and consideration of the other-than-temporary nature of such items. Impairment charges were recorded to (Loss) income from affiliates within the Agribusiness segment. \nF-31\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nConsolidated Variable Interest Entities\nOn September 19, 2023, Bunge entered into a fixed-priced call option agreement (\"Option\") to acquire the shares of Terminal de Granéis de Santa Catarina (\"TGSC\") with primary assets consisting of a grain port terminal currently under construction in South America strategically located near an existing Bunge facility. The agreement required Bunge to make future installment payments for the Option which were utilized, in part, to fund terminal construction. In November 2024, Bunge exercised the Option and expects to close on the acquisition in early 2025, subject to customary closing conditions.\nTGSC is a VIE, as a result of having insufficient equity at risk. Bunge is the primary beneficiary due to a de facto agent relationship with the equity owner of TGSC and has consolidated the entity since the third quarter of 2023. As all of TGSC’s equity is held by a third-party, Bunge reflects all TGSC earnings and equity as attributable to noncontrolling interests in the consolidated statements of income and consolidated balance sheets, respectively. \nTGSC is not a business as defined by U.S. GAAP. Therefore, the non-cash transaction resulting in initial consolidation of TGSC represented an asset acquisition. Positions recognized in the consolidated balance sheet upon initial consolidation consisted primarily of Other intangible assets, net - license ($\n87\n million); Property, plant and equipment, net - construction-in-process ($\n36\n million); Long-term debt ($\n35\n million); and Noncontrolling interests ($\n91\n million). Bunge did not recognize any gain or loss upon initial consolidation of TGSC and no gain or loss is expected as a result of the Option exercise. Bunge will derecognize Noncontrolling interests with any difference between Noncontrolling interests and the Option exercise price recognized in Additional paid-in capital. TGSC's assets can only be used to settle the entity’s own obligations and TGSC’s creditors have no recourse to Bunge’s assets beyond Bunge’s maximum exposure to loss associated with TGSC at any given time.\nOn May 1, 2022, Bunge completed a transaction with Chevron to create a joint venture, Bunge Chevron Ag Renewables LLC (\"BCAR\"), leveraging Bunge’s expertise in oilseed processing and farmer relationships, and Chevron’s expertise in fuels manufacturing and marketing, to help meet the demand for renewable fuels and to develop lower carbon intensity feedstocks. \nBCAR is a VIE in which Bunge is considered to be the primary beneficiary because it is responsible for the day-to-day operating decisions of BCAR as well as the marketing of the principal products, primarily soybean meal and oil produced and sold by BCAR, among other factors. BCAR's assets can only be used to settle BCAR’s own obligations and BCAR's creditors have no recourse to Bunge’s assets beyond Bunge’s maximum exposure to loss associated with BCAR at any given time. \nThe following table presents the values of the assets and liabilities associated with the above listed VIEs in which Bunge is considered the primary beneficiary to the extent included in Bunge’s consolidated balance sheet as of December 31, 2024 and 2023. All amounts exclude intercompany balances, which have been eliminated upon consolidation.\nF-32\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nFor all other VIEs in which Bunge is considered the primary beneficiary, the entities meet the definition of a business, and the VIE's assets can be used other than for the settlement of the VIE’s obligations. \nAs such, these VIEs have been excluded from the below table.\n(US$ in millions)\nDecember 31,\n2024\nDecember 31,\n2023\nCurrent assets:\nCash and cash equivalents\n$\n534\n \n$\n606\n \nTrade accounts receivable \n2\n \n1\n \nInventories\n54\n \n76\n \nOther current assets\n35\n \n146\n \nTotal current assets\n625\n \n829\n \nProperty, plant and equipment, net\n455\n \n196\n \nOther intangible assets, net\n69\n \n91\n \nTotal assets\n$\n1,149\n \n$\n1,116\n \nCurrent liabilities:\nTrade accounts payable and accrued liabilities\n$\n80\n \n$\n70\n \nOther current liabilities\n34\n \n143\n \nTotal current liabilities\n114\n \n213\n \nLong-term debt\n50\n \n44\n \nOther non-current liabilities\n10\n \n5\n \nTotal liabilities\n$\n174\n \n$\n262\n \nNon-Consolidated Variable Interest Entities \nBunge holds investment interests in various entities, as described above, that are included in Investments in affiliates and Other non-current assets in the consolidated balance sheets. Certain of these investments, which are primarily reported in Bunge's Agribusiness segment and Corporate and Other, have been determined to be variable interest entities for which Bunge has determined it is not the primary beneficiary. Accordingly, these investments are not consolidated by Bunge. Bunge's exposure to loss related to these unconsolidated investments is $\n740\n million and $\n589\n million, respectively, as of December 31, 2024 and 2023. Bunge's exposure to loss primarily comprises Bunge's investments balance, third party guarantees, prepayments, long term loans, and certain future commitments assuming full loss of the investment balance and full payment of the guarantees regardless of the probability of such losses actually being incurred in accordance with US GAAP disclosure rules. See \nNote 20- Commitments and Contingencies\n.\n \nF-33\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n12. \nOTHER NON-CURRENT ASSETS\nOther non-current assets consist of the following:\nDecember 31,\n(US$ in millions)\n2024\n2023\nRecoverable taxes, net \n(1)\n$\n19\n \n$\n25\n \nJudicial deposits \n(1)\n86\n \n120\n \nOther long-term receivables, net \n(2)\n14\n \n16\n \nIncome taxes receivable \n(1)\n125\n \n136\n \nLong-term investments \n(3)\n174\n \n142\n \nAffiliate loans receivable\n8\n \n8\n \nLong-term receivables from farmers in Brazil, net \n(1)\n23\n \n43\n \nUnrealized gains on derivative contracts, at fair value\n—\n \n1\n \nOther\n108\n \n124\n \nTotal\n$\n557\n \n$\n615\n \n(1)\nA significant portion of these non-current assets arise primarily from Bunge's Brazilian operations and their realization could take several years.\n(2)\nNet of allowances as described in \nNote 4- Trade Accounts Receivable and Trade Receivable Securitization Program\n.\n(3)\nAs of December 31, 2024 and 2023, $\n14\n million and $\n12\n million, respectively, of long-term investments were recorded at fair value.\n \nRecoverable taxes, net\n—Recoverable taxes are reported net of allowances of $\n9\n million and $\n13\n million at December 31, 2024 and 2023, respectively.\nJudicial deposits\n—Judicial deposits are funds that Bunge has placed on deposit with the courts in Brazil. These funds are held in judicial escrow related to certain legal proceedings pending resolution and bear interest at the \nSelic\n rate, which is the benchmark rate of the Brazilian central bank.\nIncome taxes receivable\n—Income taxes receivable include overpayments of current income taxes plus accrued interest. These income tax prepayments are expected to be used for the settlement future income tax obligations. Income taxes receivable in Brazil bear interest at the \nSelic\n rate.\nLong-term investments\n—Long-term investments primarily comprise Bunge's noncontrolling equity investments in growth stage agribusiness and food companies held by Bunge Ventures.  \nAffiliate loans receivable\n—Affiliate loans receivable are primarily interest-bearing receivables from unconsolidated affiliates with remaining maturities of greater than \none year\n.\nLong-term receivables from farmers in Brazil, net\n—Bunge provides financing to farmers in Brazil, primarily through secured advances against farmer commitments to deliver agricultural commodities (primarily soybeans) upon harvest of the then-current year's crop, and through credit sales of fertilizer to farmers. The balance includes certain advance payments on contracts with various unconsolidated investees see \nNote 19- Related Party Transactions\n. Certain such long-term receivables from farmers are originally recorded in Other current assets as prepaid commodity purchase contracts or secured advances to suppliers (see \nNote 6- Other Current Assets\n) or Other non-current assets according to their maturity. Advances initially recorded in Other current assets are reclassified to Other non-current assets if collection issues arise and amounts become past due with resolution of such matters expected to take more than one year.\nF-34\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe average recorded investment in long-term receivables from farmers in Brazil for the years ended December 31, 2024 and 2023 was $\n67\n million and $\n88\n million, respectively. \nThe table below summarizes Bunge's recorded investment in long-term receivables from farmers in Brazil and the related allowance amounts.  \n \nDecember 31, 2024\nDecember 31, 2023\n(US$ in millions)\nRecorded\nInvestment\nAllowance\nRecorded\nInvestment\nAllowance\nFor which an allowance has been provided:\n \n \n \n \nLegal collection process \n(1)\n$\n28\n \n$\n26\n \n$\n30\n \n$\n30\n \nRenegotiated amounts \n3\n \n1\n \n2\n \n1\n \nFor which no allowance has been provided:\n \n \n \n \nLegal collection process \n(1)\n6\n \n—\n \n19\n \n— \nRenegotiated amounts \n(2)\n1\n \n—\n \n5\n \n— \nOther long-term receivables \n(3)\n12\n \n—\n \n18\n \n— \nTotal\n$\n50\n \n$\n27\n \n$\n74\n \n$\n31\n \n(1)\nAll amounts in legal process are considered past due upon initiation of legal action.\n(2)\nThese renegotiated amounts are current on repayment terms.\n(3)\nNew advances expected to be realized through farmer commitments to deliver agricultural commodities in crop periods greater than twelve months from the balance sheet date. Such advances are reclassified from Other non-current assets to Other current assets in later periods depending on the expected date of their realization.\nThe table below summarizes the activity in the allowance for doubtful accounts related to long-term receivables from farmers in Brazil.\n \nYear Ended December 31,\n(US$ in millions)\n2024\n2023\nAllowance as of January 1\n$\n31\n \n$\n36\n \nBad debt provisions\n3\n \n2\n \nRecoveries\n(\n1\n)\n(\n5\n)\nWrite-offs\n—\n \n(\n6\n)\nTransfers\n1\n \n1\n \nForeign currency translation\n(\n7\n)\n3\n \nAllowance as of December 31\n$\n27\n \n$\n31\n \n13. \nOTHER CURRENT LIABILITIES\nOther current liabilities consist of the following:\nDecember 31,\n(US$ in millions)\n2024\n2023\nUnrealized losses on derivative contracts at fair value\n$\n1,082\n \n$\n1,038\n \nAccrued liabilities\n840\n \n865\n \nAdvances on sales \n(1)\n501\n \n463\n \nDividends payable \n(2)\n91\n \n96\n \nIncome tax payable\n80\n \n238\n \nOther\n234\n \n213\n \nTotal\n$\n2,828\n \n$\n2,913\n \nF-35\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n(1)\nThe Company records advances on sales when cash payments are received in advance of the Company's performance and recognizes revenue once the related performance obligation is completed. Advances on sales are impacted by the seasonality of Bunge's business, including the timing of harvests in the northern and southern hemispheres, and amounts at each balance sheet date will generally be recognized in earnings within twelve months or less. \n(2)\nSee \nNote 22- Equity\n.\n14. \nINCOME TAXES\nBunge operates globally and is subject to the tax laws and regulations of numerous tax jurisdictions and authorities as well as tax agreements and treaties among these jurisdictions. Bunge's income tax provision is impacted by, among other factors, changes in tax laws, regulations, agreements and treaties, currency exchange rates and Bunge's profitability in each tax jurisdiction.\nBunge has elected to use the U.S. federal income tax rate to reconcile the actual provision for income taxes.\nThe components of Income before income tax are as follows:\n \nYear Ended December 31,\n(US$ in millions)\n2024\n2023\n2022\nUnited States\n$\n442\n \n$\n1,180\n \n$\n1,036\n \nNon-United States\n1,082\n \n1,871\n \n1,030\n \nTotal\n$\n1,524\n \n$\n3,051\n \n$\n2,066\n \nThe components of the Income tax expense are as follows:\n \nYear Ended December 31,\n(US$ in millions)\n2024\n2023\n2022\nCurrent:\n \n \n \nUnited States\n$\n107\n \n$\n218\n \n$\n217\n \nNon-United States\n239\n \n497\n \n290\n \n346\n \n715\n \n507\n \nDeferred:\n \n \n \nUnited States\n18\n \n46\n \n29\n \nNon-United States\n(\n28\n)\n(\n47\n)\n(\n148\n)\n(\n10\n)\n(\n1\n)\n(\n119\n)\nTotal\n$\n336\n \n$\n714\n \n$\n388\n \nF-36\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nReconciliation of Income tax expense if computed at the U.S. federal income tax rate to Bunge's reported Income tax expense is as follows:\n \nYear Ended December 31,\n(US$ in millions)\n2024\n2023\n2022\nIncome before income tax\n$\n1,524\n$\n3,051\n$\n2,066\nIncome tax rate\n21\n%\n21\n%\n21\n%\nIncome tax expense at the U.S. Federal tax rate\n320\n641\n434\nAdjustments to derive effective tax rate:\n \n \n \nForeign earnings taxed at different statutory rates\n(\n10\n)\n142\n(\n75\n)\nValuation allowances\n21\n(\n30\n)\n(\n21\n)\nFiscal incentives\n(1)\n(\n13\n)\n(\n76\n)\n(\n65\n)\nForeign exchange on monetary items\n21\n(\n5\n)\n31\nTax rate changes\n—\n18\n12\nNon-deductible expenses\n62\n40\n51\nUncertain tax positions\n15\n20\n(\n9\n)\nInflation adjustments\n(\n84\n)\n(\n32\n)\n(\n61\n)\nIncremental tax on future distributions\n5\n25\n30\nState taxes\n18\n22\n18\nImpairment of Russian operations\n—\n—\n25\nGain on BP Bunge Bioenergia disposal\n(\n44\n)\n—\n—\nSwiss tax credits, net\n(2)\n—\n \n(\n90\n)\n—\nOther\n25\n \n39\n18\nIncome tax expense\n$\n336\n$\n714\n$\n388\n(1)\nFiscal incentives predominantly relate to investment incentives in Brazil that are exempt from Brazilian income tax.\n(2)\nDuring 2023, Bunge was granted tax credits in Switzerland that expire through 2032, and recorded a net benefit for the amount that Bunge believes is more likely than not to be realized prior to expiration.\nF-37\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe primary components of the deferred tax assets and liabilities and the related valuation allowances are as follows:\n \nDecember 31,\n(US$ in millions)\n2024\n2023\nDeferred income tax assets:\n \n \nNet operating loss carryforwards\n$\n548\n \n$\n655\n \nOperating lease obligations\n124\n \n140\n \nEmployee benefits\n58\n \n47\n \nTax credit carryforwards\n410\n \n454\n \nInterest deduction carryforwards\n119\n \n72\n \nInventories\n—\n \n19\n \nAccrued expenses and other\n140\n \n166\n \nTotal deferred tax assets\n1,399\n \n1,553\n \nLess valuation allowances\n(\n595\n)\n(\n590\n)\nDeferred tax assets, net of valuation allowance\n804\n \n963\n \nDeferred income tax liabilities:\n \n \nProperty, plant and equipment\n317\n \n323\n \nInventories\n1\n \n—\n \nOperating lease assets\n123\n \n143\n \nUndistributed earnings of affiliates\n—\n \n12\n \nInvestments\n18\n \n12\n \nIntangibles\n79\n \n100\n \nTotal deferred tax liabilities\n538\n \n590\n \nNet deferred tax assets \n$\n266\n \n$\n373\n \nAs of December 31, 2024, Bunge has determined it has unremitted earnings that are considered to be indefinitely reinvested of approximately $\n2\n billion, and accordingly, no provision for income taxes has been made. If these earnings were distributed in the form of dividends or otherwise, Bunge would be subject to income taxes in the form of withholding taxes to the recipient for an amount of approximately $\n100\n million.\nAt December 31, 2024, Bunge's pre-tax loss carryforwards totaled $\n1.9\n billion, of which $\n1.7\n billion have no expiration, including loss carryforwards of $\n1.2\n billion in Brazil. While loss carryforwards in Brazil can be carried forward indefinitely, annual utilization is limited to \n30\n% of taxable income calculated on an entity-by-entity basis as Brazil tax law does not allow consolidated tax filings. At December 31, 2023, Bunge's pre-tax loss carryforwards totaled $\n2.3\n billion, of which $\n2.1\n billion have no expiration, including loss carryforwards of $\n1.3\n billion in Brazil. The decrease in pre-tax loss carryforwards from 2023 to 2024 is primarily attributable to cumulative translation adjustments in Brazil and certain other jurisdictions. The remaining tax loss carryforwards expire at various period through the year 2044.\nAt December 31, 2024, Bunge’s tax credit carryforwards totaled $\n410\n million, of which $\n148\n million expire in 2029,  $\n249\n million expire in 2032, while the remainder is split between a portion expiring within a ten year period and a portion that has no expiration. At December 31, 2023, Bunge's tax credit carryforwards totaled $\n454\n million.\nIncome Tax Valuation Allowances\n—Bunge records valuation allowances when current evidence does not suggest that some portion or all of its deferred tax assets will be realized. The ultimate realization of deferred tax assets depends primarily on Bunge's ability to generate sufficient timely future income of the appropriate character in the appropriate taxing jurisdiction.\nAs of December 31, 2024 and 2023, Bunge has recorded valuation allowances of $\n595\n million and $\n590\n million, respectively. The net increase of $\n5\n million is primarily attributable to current year losses and interest limitations, offset by currency movement in certain jurisdictions. \nF-38\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nUnrecognized Tax Benefits\n—ASC 740, \nIncome Taxes \n(\"ASC 740\")  requires applying a \"more likely than not\" threshold to the recognition and de-recognition of tax benefits. Accordingly, Bunge recognizes the amount of tax benefit that has a greater than 50 percent likelihood of being realized upon settlement. At December 31, 2024 and 2023, respectively, Bunge had recorded unrecognized tax benefits of $\n75\n million and $\n68\n million in Other non-current liabilities in the consolidated balance sheets. During 2024, 2023 and 2022, respectively, Bunge recognized  $\n2\n million, less than $\n1\n million and $(\n7\n) million of interest and penalty charges in Income tax expense in the consolidated statements of income. At December 31, 2024 and 2023, respectively, Bunge had recorded accrued interest and penalties of $\n11\n million and $\n10\n million in Other non-current liabilities in the consolidated balance sheets. \nA reconciliation of the beginning and ending amounts of unrecognized tax benefits follows:\n(US$ in millions)\n2024\n2023\n2022\nBalance at January 1,\n$\n121\n \n$\n298\n \n$\n329\n \nAdditions based on tax positions related to the current year\n9\n \n13\n \n20\n \nAdditions based on tax positions related to prior years\n10\n \n12\n \n2\n \nReductions for tax positions of prior years \n(1)\n(\n2\n)\n(\n206\n)\n(\n27\n)\nSettlements with tax authorities\n(\n2\n)\n—\n \n(\n9\n)\nExpiration of statute of limitations\n(\n4\n)\n(\n5\n)\n(\n1\n)\nForeign currency translation\n(\n5\n)\n9\n \n(\n16\n)\nBalance at December 31,\n$\n127\n \n$\n121\n \n$\n298\n \n(1)\nThe year ended December 31, 2023 included a reduction of the tax position in Spain resulting from the conclusion of an appeals process. This decrease had no impact on the consolidated statement of income or the consolidated balance sheet as the position was not previously recognized under ASC 740.\nBunge believes that it is reasonably possible that approximately $\n20\n million of its unrecognized tax benefits may be recognized by the end of 2025 as a result of a lapse of the statute of limitations.  \nBunge, through its subsidiaries, files income tax returns in the United States (federal and various states) and non-United States regions. \nThe table below reflects the tax years for which Bunge is subject to income tax examinations by tax authorities in significant tax regions:\n \nOpen Tax Years\nNorth America\n2015 - 2024\nSouth America\n2017 - 2024\nEurope, Middle East, and Africa\n2017 - 2024\nAsia-Pacific\n2015 - 2024\nAs of December 31, 2024, Bunge's Brazilian subsidiaries have received income tax and penalty assessments through 2018 of approximately R$\n5.3\n billion (approximately $\n856\n million) plus applicable interest on the outstanding amount. Bunge has recorded unrecognized tax benefits related to these assessments of R$\n13\n million (approximately $\n2\n million) as of December 31, 2024.\nManagement, in consultation with external legal advisors, believes that it is more likely than not that Bunge will prevail on the proposed assessments (with the exception of unrecognized tax benefits discussed above) in Brazil and is vigorously defending its position against these assessments.\nBunge made cash income tax payments, net of refunds received, of $\n520\n million, $\n655\n million and $\n570\n million during the years ended December 31, 2024, 2023, and 2022, respectively.\nIn October 2021, the Organization for Economic Co-operations and Development (the \"OECD\") released an outline that described the conceptual agreement among 138 countries on fundamental reforms to international tax rules. The outline provides for two primary \"Pillars\", however, based on Bunge's current understanding of the proposals, only Pillar Two, which provides for a global minimum corporate tax rate of 15%, impacts Bunge. The reforms were contingent upon the independent actions of participating countries to enact law changes. As a result of the enactment of the Pillar Two rules by both the Netherlands and Switzerland, Bunge became subject to the global minimum tax effective January 1, 2024. The impact of the global minimum tax rules in 2024 was immaterial and is expected to be immaterial in 2025 as well.\n \nF-39\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n15. \nFAIR VALUE MEASUREMENTS\nBunge's various financial instruments include certain components of working capital such as Trade accounts receivable and Trade accounts payable. Additionally, Bunge uses short- and long-term debt to fund operating requirements. Trade accounts receivable, Trade accounts payable and Short-term debt are generally stated at their carrying value, which is a reasonable estimate of fair value. See \nNote 3- Trade Structured Finance Program\n for trade structured finance program, \nNote 12- Other Non-Current Assets\n for long-term receivables from farmers in Brazil, net and other long-term investments, \nNote 17- Debt\n for short- and long-term debt, and \nNote 18- Employee Benefit Plans\n for employee benefit plans. Bunge's financial instruments also include derivative instruments and marketable securities, which are stated at fair value.\nFor a definition of fair value and the associated fair value levels, refer to \nNote 1- Nature of Business, Basis of Presentation and Significant Accounting Policies.\n    \nThe following table sets forth, by level, the Company’s assets and liabilities that were accounted for at fair value on a recurring basis.\n \nFair Value Measurements at Reporting Date\n \nDecember 31, 2024\nDecember 31, 2023\n(US$ in millions)\nLevel 1\nLevel 2\nLevel 3\nTotal\nLevel 1\nLevel 2\nLevel 3\nTotal\nAssets:\n \n \n \n \n \n \n \n \nCash equivalents\n$\n86\n \n$\n42\n \n$\n—\n \n$\n128\n \n$\n315\n \n$\n149\n \n$\n—\n \n$\n464\n \nReadily marketable inventories (\nNote 5\n)\n—\n \n4,805\n \n419\n \n5,224\n \n—\n \n5,175\n \n662\n \n5,837\n \nTrade accounts receivable \n(1)\n—\n \n—\n \n—\n \n—\n \n—\n \n1\n \n—\n \n1\n \nUnrealized gain on derivative contracts \n(2)\n:\n \n \n \n \n \n \n \n \nInterest rate\n—\n \n15\n \n—\n \n15\n \n—\n \n12\n \n—\n \n12\n \nForeign exchange\n—\n \n422\n \n—\n \n422\n \n—\n \n253\n \n—\n \n253\n \nCommodities\n82\n \n549\n \n134\n \n765\n \n198\n \n737\n \n88\n \n1,023\n \nFreight\n40\n \n—\n \n—\n \n40\n \n80\n \n—\n \n—\n \n80\n \nEnergy\n42\n \n—\n \n—\n \n42\n \n114\n \n—\n \n—\n \n114\n \nCredit\n—\n \n2\n \n—\n \n2\n \n—\n \n—\n \n—\n \n—\n \nOther\n \n(3)\n325\n \n75\n \n—\n \n400\n \n40\n \n39\n \n—\n \n79\n \nTotal assets\n$\n575\n \n$\n5,910\n \n$\n553\n \n$\n7,038\n \n$\n747\n \n$\n6,366\n \n$\n750\n \n$\n7,863\n \nLiabilities:\n \n \n \n \n \n \n \n \nTrade accounts payable\n \n(1)\n$\n—\n \n$\n326\n \n$\n62\n \n$\n388\n \n$\n—\n \n$\n591\n \n$\n232\n \n$\n823\n \nUnrealized loss on derivative contracts\n \n(4)\n:\n \n \n \n \n \n \n \n \nInterest rate\n—\n \n258\n \n—\n \n258\n \n1\n \n273\n \n—\n \n274\n \nForeign exchange\n—\n \n494\n \n—\n \n494\n \n—\n \n223\n \n—\n \n223\n \nCommodities\n71\n \n309\n \n104\n \n484\n \n166\n \n417\n \n17\n \n600\n \nFreight\n38\n \n—\n \n—\n \n38\n \n68\n \n—\n \n—\n \n68\n \nEnergy\n38\n \n—\n \n—\n \n38\n \n132\n \n1\n \n—\n \n133\n \nCredit\n—\n \n2\n \n—\n \n2\n \n—\n \n—\n \n—\n \n—\n \nTotal liabilities\n$\n147\n \n$\n1,389\n \n$\n166\n \n$\n1,702\n \n$\n367\n \n$\n1,505\n \n$\n249\n \n$\n2,121\n \n(1)\nThese receivables and payables are hybrid financial instruments for which Bunge has elected the fair value option as they are derived from purchases and sales of agricultural commodity products in the normal course of business.\n(2)\nUnrealized gains on derivative contracts are generally included i\nn Other current assets. There were \nzero\n and $\n1\n million included in Other non-current assets at December 31, 2024 and 2023, respectively. \n(3)\nOther includes the fair values of marketable securities and investments in Other current assets and Other non-current assets.\nF-40\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n(4)\nUnrealized losses on derivative contracts are generally included in Other current liabilities. There were \n$\n232\n million\n and $\n260\n million included in Other non-current liabilities at December 31, 2024 and 2023, respectively.\n \nCash equivalents \n—Cash equivalents primarily includes money market funds and commercial paper investments. Bunge analyzes how the prices are derived and determines whether the prices are liquid or less liquid tradable prices. Cash equivalents with liquid prices are valued using prices from publicly available sources and classified as Level 1. Cash equivalents with less liquid prices are valued using third-party quotes or pricing models and classified as Level 2.\n    \nReadily marketable inventories\n—RMI reported at fair value are valued based on commodity futures exchan\nge quotations, broker or dealer quotations, or market transactions in either listed or OTC markets with appropriate adjustments for differences in local markets where the Company's inventories are located. In such cases, the inventory is classified within Level 2. Certain inventories may utilize significant unobservable data related to local market adjustments to determine fair value. In such cases, the inventory is classified as Level 3.\nIf the Company used different methods or factors to determine fair values, amounts reported as unrealized gains and losses on derivative contracts and RMI at fair value in the consolidated balance sheets and consolidated statements of income could differ. Additionally, if market conditions change subsequent to the reporting date, amounts reported in future periods as unrealized gains and losses on derivative contracts and RMI at fair value in the consolidated balance sheets and consolidated statements of income could differ.\nDerivatives\n—The majority of exchange traded futures and options contracts and exchange cleared contracts are valued based on unadjusted quoted prices in active markets and are classified within Level 1. The majority of the Company’s exchange-traded agricultural commodity futures are cash-settled daily and, therefore, are not included in these tables. The Company's forward commodity purchase and sales contracts are classified as derivatives along with other OTC derivative instruments relating primarily to freight, energy, foreign exchange and interest rates and are classified within Level 2 or Level 3, as described below. The Company estimates fair values based on exchange quoted prices, adjusted as appropriate for differences in local markets. These differences are generally valued using inputs from broker or dealer quotations or market transactions in either the listed or OTC markets. In such cases, these derivative contracts are classified within Level 2.\nOTC derivative contracts include swaps, options, and structured transactions that are generally fair valued using quantitative models that require the use of multiple market inputs including quoted prices for similar assets or liabilities in active markets, quoted prices for identical or similar assets or liabilities in markets that are not highly active, other observable inputs relevant to the asset or liability, and market inputs corroborated by correlation or other means. These valuation models include inputs such as interest rates, prices, and indices to generate continuous yield or pricing curves and volatility factors. Where observable inputs are available for substantially the full term of the asset or liability, the instrument is categorized in Level 2. Certain OTC derivatives trade in less active markets with less availability of pricing information and certain structured transactions can require internally developed model inputs that might not be observable in or corroborated by the market.\n Marketable securities and investments\n—Bunge invests in foreign government securities, corporate debt securities, deposits, equity securities, and other securities. Bunge analyzes how the prices are derived and determines whether the prices are liquid or less liquid tradable prices. Marketable securities and investments with liquid prices are valued using prices from publicly available sources and classified as Level 1. Marketable securities and investments with less-liquid prices are valued using third-party quotes or internally developed models and classified as Level 2 or Level 3 as described below. \n    Level 3 Measurements\nThe following relates to assets and liabilities measured at fair value on a recurring basis using Level 3 measurements. An instrument may transfer into or out of Level 3 due to inputs becoming either observable or unobservable. \nLevel 3 Measurements\n—Transfers in and/or out of Level 3 represent existing assets or liabilities that were either previously categorized as a higher level for which the inputs to the model became unobservable or assets and liabilities that were previously classified as Level 3 for which the lowest significant input became observable during the period. Bunge's policy regarding the timing of transfers between levels is to record the transfers at the end of the reporting period. \nLevel 3 Readily marketable inventories and Trade accounts payable\n—The significant unobservable inputs resulting in Level 3 classification for RMI, physically settled forward purchase and sales contracts, and Trade accounts payable relate to certain management estimations regarding costs of transportation and other local market or location-related adjustments, primarily freight related adjustments in the interior of Brazil and the lack of market corroborated information in Canada. In both situations, the Company uses proprietary information such as purchase and sales contracts and contracted prices to value \nF-41\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nfreight, premiums and discounts in its contracts. Movements in the price of these unobservable inputs alone would not be expected to have a material effect on the Company's financial statements as these contracts do not typically exceed one future crop cycle.\nLevel 3 Derivatives\n—Level 3 derivative instrument fair value measurements utilizes both market observable and unobservable inputs. These inputs include commodity prices, price volatility, interest rates, volumes, and locations.\nLevel 3 Others\n—Primarily relates to marketable securities and investments valued using third-party quotes or pricing models with inputs based on similar securities adjusted to reflect management’s best estimate of the specific characteristics of the securities held by the Company. Such inputs represent a significant component of the fair value of the securities held by the Company, resulting in the securities being classified as Level 3.\nThe tables below present reconciliations for assets and liabilities measured at fair value on a recurring basis using significant unobservable inputs (Level 3) during the years ended December 31, 2024 and 2023. These instruments were valued using pricing models that management believes reflect the assumptions that would be used by a marketplace participant.\n \nYear Ended December 31, 2024\n(US$ in millions)\nReadily Marketable Inventories\n(2)\nDerivatives, Net\nTrade\nAccounts\nPayable\nTotal\nBalance, January 1, 2024\n$\n662\n \n$\n71\n \n$\n(\n232\n)\n$\n501\n \nTotal gains and losses (realized/unrealized) included in Cost of goods sold \n(1)\n645\n \n(\n59\n)\n15\n \n601\n \nPurchases\n1,704\n \n—\n \n(\n444\n)\n1,260\n \nSales\n(\n2,341\n)\n—\n \n—\n \n(\n2,341\n)\nSettlements\n—\n \n—\n \n607\n \n607\n \nTransfers into Level 3\n1,507\n \n26\n \n(\n238\n)\n1,295\n \nTransfers out of Level 3\n(\n1,576\n)\n(\n6\n)\n156\n \n(\n1,426\n)\nTranslation adjustment\n(\n182\n)\n(\n2\n)\n74\n \n(\n110\n)\nBalance, December 31, 2024\n$\n419\n \n$\n30\n \n$\n(\n62\n)\n$\n387\n \n(1)\nReadily marketa\nble inventori\nes, derivatives, net, and trade accounts payable include gains/(losses) of $\n591\n million, $(\n42\n) million, and $\n11\n million, respectively, that are attributable to the change in unrealized gains/(losses) relating to Level 3 assets and liabilities still held at December 31, 2024.\n(2)\nEffective January 1, 2024, the Company changed its reporting of purchases and sales activity within the readily marketable inventories Level 3 reconciliation to align with the Company's value chain trade flows and intended use, which had no net impact on Level 3 readily marketable inventories period end balances. Prior period activity has been reclassified to conform to current presentation. \nF-42\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n \nYear Ended December 31, 2023\n(US$ in millions)\nReadily Marketable Inventories\n(2)\nDerivatives, Net\nTrade\nAccounts\nPayable\nOther\n(3)\nTotal\nBalance, January 1, 2023\n$\n412\n \n$\n51\n \n$\n(\n130\n)\n$\n27\n \n$\n360\n \nTotal gains and losses (realized/unrealized) included in Cost of goods sold \n(1)\n988\n \n(\n18\n)\n32\n \n—\n \n1,002\n \nTotal gains and losses (realized/unrealized) included in Other income (expense) - net\n— \n— \n— \n(\n1\n)\n(\n1\n)\nPurchases\n3,668\n \n—\n \n(\n473\n)\n—\n \n3,195\n \nSales\n(\n3,332\n)\n—\n \n—\n \n(\n14\n)\n(\n3,346\n)\nSettlements\n—\n \n—\n \n426\n \n—\n \n426\n \nTransfers into Level 3\n2,065\n \n48\n \n(\n113\n)\n—\n \n2,000\n \nTransfers out of Level 3\n(\n3,192\n)\n(\n10\n)\n50\n \n(\n12\n)\n(\n3,164\n)\nTranslation Adjustment\n53\n \n—\n \n(\n24\n)\n—\n \n29\n \nBalance, December 31, 2023\n$\n662\n \n$\n71\n \n$\n(\n232\n)\n$\n—\n \n$\n501\n \n \n(1)\nReadily marketable inventories, derivatives, net, and trade accounts payable\n, includes gains/(losses) of $\n978\n million, $(\n30\n) million, and $\n32\n million, respectively, that are attributable to the change in unrealized gains/(losses) relating to Level 3 assets and liabilities still held at December 31, 2023.\n(2)\nEffective January 1, 2024, the Company changed its reporting of purchases and sales activity within the readily marketable inventories Level 3 reconciliation to align with the Company's value chain trade flows and intended use, which had no net impact on Level 3 readily marketable inventories period end balances. Prior period activity has been reclassified to conform to current presentation. \n(3)\nComprises the fair values of marketable securities and investments in Other current assets. Certain inputs to the valuation of these securities became observable during the year ended December 31, 2023, resulting in the remaining balance being transferred out of Level 3.\n16. \nDERIVATIVE INSTRUMENTS AND HEDGING ACTIVITIES\nThe Company uses derivative instruments to manage several market risks, such as interest rate, foreign currency rate, and commodity risk. Some of the hedges the Company enters into qualify for hedge accounting (\"Hedge Accounting Derivatives\") and some, while intended as economic hedges, do not qualify or are not designated for hedge accounting (\"Economic Hedge Derivatives\"). As these derivatives impact the financial statements in different ways, they are discussed separately below.\nHedge Accounting Derivatives\n - \nThe Company uses derivatives in qualifying hedge accounting relationships to manage certain of its interest rate, foreign currency, and commodity risks. In executing these hedge strategies, the Company primarily relies on the shortcut and critical terms match methods in designing its hedge accounting strategy, which results in little to no net earnings impact for these hedge relationships. The Company monitors these relationships on a quarterly basis and performs a quantitative analysis to validate the assertion that the hedges are highly effective if there are changes to the hedged item or hedging derivative.\nFair value hedges\n - These derivatives are used to hedge the effect of interest rate and currency exchange rate changes on certain long-term debt. Under fair value hedge accounting, the derivative is measured at fair value and the carrying value of hedged debt is adjusted for the change in value related to the exposure being hedged, with both adjustments offset to earnings. In other words, the earnings effect of an increase in the fair value of the derivative will be substantially offset by the earnings effect of the increase in the carrying value of the hedged debt. The net impact of fair value hedge accounting for interest rate swaps is recognized in Interest expense. For cross currency swaps, the changes in currency risk on the derivative are recognized in Foreign exchange gains (losses) - net, and the changes in interest rate risk are recognized in Interest expense. Changes in basis risk are held in Accumulated other comprehensive loss until realized through the coupon.\nF-43\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nCash flow hedges of currency risk\n - The Company manages currency risk on certain forecasted purchases, sales, and selling, general and administrative expenses with currency forwards. The change in the value of the forward is classified in Accumulated other comprehensive loss until the transaction affects earnings, at which time the change in value of the currency forward is reclassified to Net sales, Cost of goods sold, or Selling, general and administrative expenses. These hedges mature at various times through December 2025. Of the amount currently in Accumulated other comprehensive loss, $\n8\n million of deferred losses is expected to be reclassified to earnings in the next twelve months.\nNet investment hedges\n - The Company hedges the currency risk of certain of its foreign subsidiaries with currency forwards for which the currency risk is remeasured through Accumulated other comprehensive loss. For currency forwards, the forward method is used. The change in the value of the forward is classified in Accumulated other comprehensive loss until the transaction affects earnings by way of either sale or substantial liquidation of the foreign subsidiary.\nThe table below provides information about the balance sheet values of hedged items and the notional amount of derivatives used in hedging strategies. The notional amount of the derivative is the number of units of the underlying (for example, the notional principal amount of the debt in an interest rate swap). \nThe notional amount is used to compute interest or other payment streams to be made under the contract and is a measure of the Company’s level of activity. The Company discloses derivative notional amounts on a gross basis.\n(US$ in millions)\nDecember 31, 2024\nDecember 31, 2023\nUnit of\nMeasure\nHedging instrument type:\nFair value hedges of interest rate risk\nInterest rate swap - notional amount\n$\n4,900\n \n$\n2,900\n \n$ Notional\nCumulative adjustment to long-term debt from active application of hedge accounting\n$\n(\n246\n)\n$\n(\n260\n)\n$ Notional\nCarrying value of hedged debt\n$\n4,600\n \n$\n2,625\n \n$ Notional\nCash flow hedges of currency risk\nForeign currency forward - notional amount\n$\n—\n \n$\n54\n \n$ Notional\nForeign currency option - notional amount\n$\n120\n \n$\n99\n \n$ Notional\nNet investment hedges\nForeign currency forward - notional amount\n$\n550\n \n$\n1,112\n \n$ Notional\nEconomic Hedge Derivatives -\n \nIn addition to using derivatives in qualifying hedge relationships, the Company enters into derivatives to economically hedge its exposure to a variety of market risks it incurs in the normal course of operations.\nInterest rate derivatives are used to hedge exposures to the Company's financial instrument portfolios and debt issuances. The impact of changes in fair value of these instruments is primarily presented in Interest expense.\nCurrency derivatives are used to hedge the balance sheet and commercial exposures that arise from the Company's global operations. The impact of changes in fair value of these instruments is presented in Cost of goods sold when hedging commercial exposures and Foreign exchange gains (losses) - net when hedging monetary exposures.\nAgricultural commodity derivatives are used primarily to manage exposures related to the Company's inventory and forward purchase and sales contracts. Contracts to purchase agricultural commodities generally relate to current or future crop years for delivery periods quoted by regulated commodity exchanges. Contracts for the sale of agricultural commodities generally do not extend beyond one future crop cycle. The impact of changes in fair value of these instruments is presented in Cost of goods sold.\nThe Company uses derivative instruments referred to as forward freight agreements (\"FFA\") and FFA options to hedge portions of its current and anticipated ocean freight costs. The impact of changes in fair value of these instruments is presented in Cost of goods sold.\nThe Company uses energy derivative instruments to manage its exposure to volatility in energy costs. Hedges may be entered into for natural gas, electricity, coal and fuel oil, including bunker fuel. The impact of changes in fair value of these \nF-44\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\ninstruments is presented in Cost of goods sold.\nThe Company may also enter into other derivatives, including credit default swaps, carbon emission derivatives and equity derivatives to manage exposure to credit risk and broader macroeconomic risks, respectively. The impact of changes in fair value of these instruments is presented in Cost of goods sold. \nThe table below summarizes the volume of economic derivatives as of December 31, 2024 and December 31, 2023. For those contracts traded bilaterally through the over-the-counter markets (e.g., forwards, forward rate agreements (\"FRA\"), and swaps), the gross position is provided. For exchange traded (e.g., futures, FFAs, and options) and cleared positions (e.g., energy swaps), the net position is provided.\n \nDecember 31,\nDecember 31,\n \n \n2024\n2023\nUnit of\nMeasure\n(US$ in millions)\nLong\n(Short)\nLong\n(Short)\nInterest rate\n \n \n \n \n   Swaps\n$\n234\n \n$\n(\n1,420\n)\n$\n935\n \n$\n(\n1,465\n)\n$ Notional\n   Futures\n$\n—\n \n$\n(\n69\n)\n$\n—\n \n$\n(\n612\n)\n$ Notional\nForwards\n$\n—\n \n$\n—\n \n$\n416\n \n$\n(\n416\n)\n$ Notional\nOptions\n$\n—\n \n$\n—\n \n$\n—\n \n$\n(\n3\n)\n$ Notional\nCurrency\n   Forwards\n$\n8,439\n \n$\n(\n8,961\n)\n$\n8,808\n \n$\n(\n10,356\n)\n$ Notional\n   Swaps\n$\n3,566\n \n$\n(\n2,105\n)\n$\n1,357\n \n$\n(\n324\n)\n$ Notional\n   Futures\n$\n—\n \n$\n(\n15\n)\n$\n—\n \n$\n(\n2\n)\n$ Notional\n   Options\n$\n107\n \n$\n(\n60\n)\n$\n5\n \n$\n(\n5\n)\nDelta\nAgricultural commodities\n   Forwards\n25,166,668\n \n(\n35,384,917\n)\n25,588,125\n \n(\n34,163,143\n)\nMetric Tons\n   Futures\n—\n \n(\n3,699,452\n)\n—\n \n(\n1,224,688\n)\nMetric Tons\n   Options\n11,835\n \n(\n116,481\n)\n29,420\n \n(\n615,937\n)\nMetric Tons\nOcean freight\n   FFA\n—\n \n(\n7,484\n)\n—\n \n(\n4,965\n)\nHire Days\nNatural gas\nForwards\n—\n \n—\n \n300\n \n—\n \nMMBtus\n   Swaps\n1,114,929\n \n—\n \n778,436\n \n—\n \nMMBtus\n   Futures\n7,058,632\n \n—\n \n12,715,588\n \n—\n \nMMBtus\nOptions\n—\n \n—\n \n—\n \n(\n2,923,438\n)\nMMBtus\nElectricity\nFutures\n123,565\n \n—\n \n—\n \n(\n281,511\n)\nMwh\nEnergy - other\n   Swaps\n339,947\n \n—\n \n202,716\n \n—\n \nMetric Tons\nOptions\n—\n \n—\n \n40,920\n \n—\n \nMetric Tons\nEnergy - CO2\n   Futures\n418,000\n \n—\n \n675,000\n \n—\n \nMetric Tons\nOptions\n—\n \n—\n \n400,000\n \n—\n \nMetric Tons\nOther\nSwaps and futures\n$\n90\n \n$\n(\n90\n)\n$\n100\n \n$\n(\n106\n)\n$ Notional\nF-45\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe Effect of Derivative Instruments and Hedge Accounting on the Consolidated Statements of Income\nThe tables below summarize the net effect of derivative instruments and hedge accounting on the consolidated statements of income for the years ended December 31, 2024, 2023, and 2022.\n \n \nGain (Loss) Recognized in\nIncome on Derivative Instruments\n \n \nYear Ended December 31,\n(US$ in millions)\n2024\n2023\n2022\nIncome statement classification\nType of derivative\nNet sales\nHedge accounting\nForeign currency\n$\n(\n4\n)\n$\n8\n \n$\n7\n \nCost of goods sold\nHedge accounting\nForeign currency\n—\n \n1\n \n5\n \nEconomic hedges\nForeign currency\n(\n332\n)\n437\n \n396\n \nCommodities\n281\n \n462\n \n(\n751\n)\nOther \n(1)\n(\n42\n)\n60\n \n82\n \n     Total Cost of goods sold\n \n$\n(\n93\n)\n$\n960\n \n$\n(\n268\n)\nSelling, general & administrative\nHedge accounting\nForeign currency\n$\n—\n \n$\n1\n \n$\n(\n2\n)\nInterest expense\nHedge accounting\nInterest rate\n$\n(\n118\n)\n$\n(\n134\n)\n$\n(\n33\n)\nEconomic hedges\nInterest rate\n—\n \n6\n \n—\n \n     Total Interest expense\n \n$\n(\n118\n)\n$\n(\n128\n)\n$\n(\n33\n)\nForeign exchange gains (losses) - net\nHedge accounting\nForeign currency\n$\n—\n \n$\n(\n27\n)\n$\n(\n30\n)\nEconomic hedges\nForeign currency\n(\n7\n)\n28\n \n115\n \nTotal Foreign exchange gains (losses) - net\n$\n(\n7\n)\n$\n1\n \n$\n85\n \nOther income (expense) - net\nEconomic hedges\nInterest rate\n$\n—\n \n$\n1\n \n$\n2\n \nOther comprehensive (loss) income \nGains and losses on derivatives used as fair value hedges of foreign currency risk included in other comprehensive income during the period\n$\n—\n \n$\n3\n \n$\n1\n \nGains and losses on derivatives used as cash flow hedges of foreign currency risk included in other comprehensive (loss) income during the period \n$\n(\n22\n)\n$\n(\n3\n)\n$\n57\n \nGains and losses on derivatives used as net investment hedges included in other comprehensive income (loss) during the period\n$\n149\n \n$\n(\n99\n)\n$\n(\n139\n)\nAmounts released from Accumulated other comprehensive loss during the period\nCash flow hedge of foreign currency risk - loss/(gain)\n$\n9\n \n$\n(\n3\n)\n$\n(\n8\n)\n(1)\nOther includes the results from freight, energy, and other derivatives.\nF-46\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n17. \nDEBT \nThe following table summarizes Bunge's short and long-term debt:\n \nDecember 31,\n(US$ in millions)\n2024\n2023\nShort-term debt and Current portion of long-term debt:\n \nRevolving credit facilities\n$\n—\n \n$\n—\n \nCommercial paper program\n(1)\n—\n \n—\n \nOther short-term debt\n875\n \n797\n \nTotal Short-term debt\n875\n \n797\n \nCurrent portion of long-term debt\n669\n \n5\n \nTotal Short-term debt and Current portion of long-term debt\n(3)\n1,544\n \n802\n \nLong-term debt:\n(2)\nTerm loan due 2025 - SOFR plus \n0.90\n%\n(4)\n—\n \n750\n \nTerm loan due 2027 - SOFR plus \n1.125\n%\n250\n \n250\n \nTerm loan due 2028 - SOFR plus \n1.325\n%\n250\n \n249\n \n1.63\n% Senior Notes due 2025\n599\n \n598\n \n3.25\n% Senior Notes due 2026\n699\n \n698\n \n3.75\n% Senior Notes due 2027\n598\n \n597\n \n4.10\n% Senior Notes due 2028\n(5)\n397\n \n—\n \n4.20\n% Senior Notes due 2029\n(5)\n793\n \n—\n \n2.75\n% Senior Notes due 2031\n993\n \n991\n \n4.65\n% Senior Notes due 2034\n(5)\n790\n \n—\n \nCumulative adjustment to long-term debt from application of hedge accounting\n(\n269\n)\n(\n260\n)\nOther long-term debt\n263\n \n212\n \n   Subtotal\n(6)\n5,363\n \n4,085\n \nLess: Current portion of long-term debt\n(\n669\n)\n(\n5\n)\nTotal Long-term debt\n(7)\n4,694\n \n4,080\n \nTotal debt\n$\n6,238\n \n$\n4,882\n \n(1)\nOn April 12, 2024, Bunge increased the aggregate size of its existing commercial paper program by $\n1\n billion to an aggregate of $\n2\n billion.  \n(2)\nVariable interest rates are as of December 31, 2024.\n(3)\nIncludes secured debt of $\n187\n million and $\n200\n million at December 31, 2024 and 2023, respectively.\n(4)\nOn September 30, 2024, Bunge prepaid and terminated its \n3-year\n term loan agreement due in 2025.\n(5)\nSee \nViterra Acquisition Financing \nsection within \nNote 17- Debt \nbelow for further details\n.\n(6)\nThe fair value (Level 2) of long-term debt, including current portion, is $\n5,373\n million and $\n4,125\n million at December 31, 2024, and 2023, respectively. The fair value of Bunge's long-term debt is calculated based on interest rates currently available on comparable maturities to companies with credit standing similar to that of Bunge.\n(7)\nIncludes secured debt of $\n131\n million and $\n100\n million at December 31, 2024 and 2023, respectively.\nPrior to June 21, 2023, Bunge conducted most of its third-party financing activities through a centralized financing structure that included a master trust (the \"Bunge Master Trust\"). On June 21, 2023, Bunge terminated the Bunge Master Trust in accordance with a termination and lien release agreement in order to simplify the legal framework around its capital structure. Post termination of the Bunge Master Trust, Bunge continues to conduct most of its third-party financing activities centrally through 100% owned finance subsidiaries which carry full, unconditional guarantees of the parent company. In connection with the termination of the Bunge Master Trust, Bunge amended its existing credit agreements and related \nF-47\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nguarantees to remove all references and provisions related to the Bunge Master Trust, as well as made amendments to certain credit facilities. \nShort-term Debt\nBunge's short-term borrowings are typically sourced from various banking institutions and the U.S. commercial paper market. Bunge also borrows from time to time in local currencies in various foreign jurisdictions. Interest expense includes facility commitment fees, amortization of deferred financing costs, the impact of designated interest rate hedges, and charges on certain lending transactions. The weighted-average interest rate on short-term borrowings at December 31, 2024 and 2023 was \n6.22\n% and \n8.36\n%, respectively.\nRevolving Credit Facilities\nOn March 1, 2024, Bunge entered into an unsecured $\n3.2\n billion \n5\n-year revolving credit agreement (the \"$\n3.2\n Billion Revolving Credit Agreement\") with a group of lenders, maturing on March 1, 2029. Bunge may from time-to-time request one or more of the existing or new lenders to increase the total participations by an aggregate amount up to $\n1.5\n billion, pursuant to an accordion provision. Current commitments in the aggregate amount of $\n1.95\n billion are available to be drawn. Incremental commitments in the aggregate amount of $\n1.25\n billion are available to be drawn on and after the date Bunge completes its acquisition of Viterra, subject to the satisfaction of certain conditions. Therefore, upon completion of the acquisition of Viterra, the total committed capacity will be an aggregate of $\n3.2\n billion. The $\n3.2\n Billion Revolving Credit Agreement replaced an existing $\n1.95\n billion \n5-year\n revolving credit agreement which was terminated on March 1, 2024. Borrowings bear interest at SOFR plus a SOFR adjustment and applicable margin as defined in the $\n3.2\n Billion Revolving Credit Agreement. Bunge had no borrowings outstanding at December 31, 2024, and 2023, under the $\n3.2\n Billion Revolving Credit Agreement and the predecessor agreement, respectively. \n \nOn March 1, 2024, Bunge exercised the accordion provision set forth in its existing unsecured $\n1.75\n billion \n3\n-year revolving facility agreement (as amended, the \"$\n3.5\n Billion Revolving Facility Agreement\") in an aggregate amount of  additional committed capacity of $\n1.75\n billion which is available to be drawn on and after the date Bunge completes its acquisition of Viterra. Upon completion of the acquisition of Viterra, the total committed capacity will be an aggregate of $\n3.5\n billion. The funding cost is also subject to certain premiums or discounts tied to certain sustainability criteria, including, but not limited to, SBTs that define Bunge’s climate goals within its operations and a commitment to a deforestation-free supply chain in 2025. The $\n3.5\n Billion Revolving Credit Agreement matures on October 6, 2026. Borrowings under the $\n3.5\n Billion Revolving Credit Agreement bear interest at SOFR plus a SOFR adjustment, which will vary from \n0.05\n% to \n0.25\n% based on the tenor of the interest period selected, plus a margin, which will vary from \n0.25\n% to \n0.90\n%, based on the senior long-term unsecured debt rating provided by Moody’s Investors Services Inc. (\"Moody’s\") and S&P Global Ratings (\"S&P\"). Bunge had \nno\n borrowings outstanding at December 31, 2024, and 2023, under the $\n3.5\n Billion Revolving Facility Agreement and the predecessor agreement, respectively. \nFurther, on April 12, 2024, Bunge amended and restated its existing $\n1.1\n billion \n364\n-day revolving credit agreement (the \"$\n1.1\n Billion \n364\n-day Revolving Credit Agreement\") with a group of lenders, to extend the maturity date from June 19, 2024 to April 11, 2025. Bunge may from time-to-time request one or more of the existing or new lenders to increase the total participations under the $\n1.1\n Billion \n364\n-day Revolving Credit Agreement by an aggregate amount up to $\n250\n million,  pursuant to an accordion provision. Borrowings will bear interest at SOFR plus a SOFR adjustment and applicable margin as defined in the $\n1.1\n Billion \n364\n-day Revolving Credit Agreement. Bunge had no borrowings outstanding at December 31, 2024, and 2023, under the $\n1.1\n Billion \n364\n-day Revolving Credit Agreement and the predecessor agreement, respectively. \nBunge had \nno\n borrowings outstanding at December 31, 2024, and 2023, under the unsecured $\n865\n million Revolving Credit Facility (the \"$\n865\n Million 2026 Facility\") with a group of lenders, set to mature on October 29, 2026. Borrowings will bear interest at SOFR plus a credit spread adjustment and applicable margin, as defined in the $\n865\n Million 2026 Facility.\nBorrowings under the committed revolving credit facilities described above typically have an original maturity of three months or less, resulting in net presentation of proceeds and repayments of short-term debt in the consolidated statements of cash flows.\nAt December 31, 2024 and 2023, Bunge had $\n5,665\n million, unused and available committed borrowing capacity comprising committed revolving credit facilities with a number of financial institutions.\nF-48\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nCommercial Paper Program\n On April 12, 2024, Bunge increased the aggregate size of its existing commercial paper program by $\n1\n billion to an aggregate of $\n2\n billion (the \"$\n2\n Billion Commercial Paper Program\"). The $\n2\n Billion Commercial Paper Program has no maturity date. Borrowings under the $\n2\n Billion Commercial Paper Program typically have an original maturity of three months or less, resulting in net presentation of proceeds and repayments of short-term debt in the consolidated statements of cash flows. \nOther Short-term Debt\nIn addition to the committed facilities discussed above, from time to time, Bunge Global SA and/or its financing subsidiaries may enter into uncommitted bilateral short-term credit lines as necessary based on its financing requirements. At December 31, 2024 and 2023, there were no borrowings outstanding under these bilateral short-term credit lines. Loans under such credit lines are non-callable by the respective lenders. In addition, Bunge's operating companies had $\n875\n million and $\n797\n million in short-term borrowings outstanding from local bank lines of credit at December 31, 2024 and 2023, respectively, to support working capital requirements. The original maturity of borrowings under uncommitted bilateral credit lines and local bank lines of credit varies based upon the Company's financing objectives. As a result, proceeds and repayments of such credit lines may be presented on a net basis, or separately, in the consolidated statements of cash flows as dictated by the borrowing's original maturity.\nViterra Acquisition Financing\nAs described in \nNote 2- Acquisitions and Dispositions\n, Bunge secured a total of $\n8.0\n billion in Acquisition Financing in the form of a $\n7.7\n billion financing commitment from a consortium of lenders, arranged by Sumitomo Mitsui Banking Corporation and a $\n300\n million \n5-year\n delayed draw term loan from CoBank and the U.S. farm credit system executed July 7, 2023 that may be drawn upon the closing of the Acquisition. As a result of the Senior Notes issuance discussed further below, the $\n7.7\n billion financing commitment has been reduced to $\n5.7\n billion. The $\n5.7\n billion financing commitment is in the form of a \nthree\n tranche term loan maturing \n364\n-days, \n2-years\n and \n3-years\n from closing of the Acquisition.\nSenior Notes - \nOn September 17, 2024, Bunge completed the sale and issuance of (i) $\n400\n million aggregate principal amount of \n4.100\n% senior notes due 2028, (ii) $\n800\n million aggregate principal amount of \n4.200\n% senior notes due 2029, and (iii) $\n800\n million aggregate principal amount of \n4.650\n% senior notes due 2034. Collectively, the \nthree\n tranches of Senior Notes total an aggregate principal amount of $\n2.0\n billion. The Senior Notes are fully and unconditionally guaranteed by Bunge. The offering was made pursuant to a shelf registration statement on Form S-3 (Registration No. 333-282003) filed by the Company and its 100% owned finance subsidiary, BLFC, with the U.S. Securities and Exchange Commission. The net proceeds of the offering were approximately $\n1.98\n billion after deducting underwriting commissions, the original issue discount, and offering fees and expenses payable by Bunge. The net proceeds from the offering are expected to be used to fund a portion of the cash consideration for Bunge's Acquisition of Viterra and to repay a portion of certain Viterra debt to be assumed in connection with the Acquisition, including, in each case, related fees and expenses, and, with any remaining amounts, for general corporate purposes. The Senior Notes are subject to a special mandatory redemption at a price equal to \n101\n% of the aggregate principal amount, plus accrued and unpaid interest, under certain circumstances, including if the Acquisition of Viterra is not consummated or the Acquisition is not consummated by an agreed upon date per the terms of the Business Combination Agreement.    \nExchange Offers and Consent Solicitations of Viterra Notes - \nOn September 9, 2024, Bunge announced that, in connection with its pending Acquisition of Viterra, Bunge's 's wholly-owned subsidiary, BLFC, commenced US Exchange Offers to exchange all outstanding notes of certain series (the \"Existing USD Viterra Notes\") issued by VFBV and guaranteed by Viterra and Viterra B.V., for up to $\n1.95\n billion aggregate principal amount of new notes issued by BLFC and guaranteed by Bunge. \nConcurrently with the US Exchange Offers, BLFC successfully solicited consents, on behalf of VFBV, and VFBV amended the respective indentures governing the Existing USD Viterra Notes on September 23, 2024 to, among other things, eliminate certain of the covenants, restrictive provisions and events of default, and modify or amend certain other provisions, including unconditionally releasing and discharging the guarantees by each of Viterra and Viterra B.V. \nIn addition, in the third quarter of 2024, Viterra commenced the European Consent Solicitation to amend the indenture governing VFBV's outstanding \n500\n million \nEuro \naggregate principal amount of \n0.375\n% senior unsecured notes due 2025 and outstanding \n700\n million \nEuro\n aggregate principal amount of \n1.000\n% senior unsecured notes due 2028 (collectively, the \"Existing Euro Viterra Notes\") to, among other things, substitute the issuer and guarantors of such notes with BFE, a wholly \nF-49\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nowned finance subsidiary of Bunge, as issuer, and Bunge as guarantor. The resolutions to effect such amendments have been passed by the requisite number of noteholders.  \nThe US Exchange Offers and European Consent Solicitation are conditioned, among other things, upon the consummation of the Acquisition. For this reason, the Existing USD Viterra Notes and Existing Euro Viterra Notes are not recognized on Bunge's condensed consolidated balance sheet, until consummation of the Acquisition. \nLong-term Debt\nCertain property, plant and equipment, and investments in consolidated subsidiaries having a net carrying value of approximately $\n170\n million at December 31, 2024 have been mortgaged or otherwise collateralized against long-term debt, including current portion, of $\n139\n million at December 31, 2024.\nPrincipal Maturities\n—Principal maturities of long-term debt at December 31, 2024 are as follows:\n(US$ in millions)\n2025\n$\n690\n \n2026\n720\n \n2027\n907\n \n2028\n659\n \n2029\n805\n \nThereafter\n1,882\n \nTotal \n(1)\n$\n5,663\n \n(1)\nIncludes components of long-term debt attributable to unamortized debt issuance costs of $\n32\n million and excludes components\n \nof long-term debt attributable to fair value hedge accounting of $\n269\n million. Includes principal maturities of long-term debt attributable to finance leases, see \nNote 25- Leases \nfor a separate breakout of finance lease maturities.\n \nDuring the years ended December 31, 2024, 2023, and 2022, Bunge paid interest, net of interest capitalized, of $\n434\n million, $\n507\n million, and $\n403\n million, respectively.\n18. \nEMPLOYEE BENEFIT PLANS\nCertain of Bunge's United States, Canadian, European, Asian, and Brazilian-based subsidiaries sponsor defined benefit pension plans covering substantially all employees of such subsidiaries. The plans provide benefits primarily based on participant salaries and lengths of service. The funding policies for Bunge's defined benefit pension plans are determined in accordance with statutory funding requirements. The most significant defined benefit plan is in the United States. \nCertain of Bunge's United States and Brazilian-based subsidiaries have benefit plans to provide postretirement healthcare benefits to eligible retired employees of those subsidiaries. The plans require minimum retiree contributions and define the maximum amount the subsidiaries will be obligated to pay under the plans. Bunge's policy is to fund these costs as they become payable.\n Plan amendments and pension liability adjustments\n—On September 19, 2017, Bunge approved changes to certain U.S. defined benefit pension plans. As a result, these plans were closed to new employees hired on or after January 1, 2018 and future benefit accruals for existing participants ceased effective January 1, 2023.\nFuture Plan Settlements\n— \nOn October 2, 2024, the Company, as plan sponsor for one of Bunge's defined benefit U.S. pension plans (the \"U.S. Pension Plan\"), utilized approximately $\n377\n million of plan assets to purchase an equally valued buy-in contract from a third-party insurer. The insurance buy-in contract is a group annuity contract that is expected to provide an income stream to cover a significant majority of the cash flows arising for the plan population with future contracted payments. However, the benefit obligation remains with the plan and the Company. To further clarify, the buy-in is not a settlement. On October 22, 2024, the Company notified plan participants in the U.S. Pension Plan of its intent to offer a lump sum buyout to eligible participants and terminate the plan, which is expected to be completed in the second half of fiscal year 2025. In connection with the plan termination, the buy-in contract allows for the future conversion into a buy-out arrangement where the \nF-50\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\ninsurance company would assume full responsibility for the U.S. Pension Plan obligations, at which time the Company would derecognize the remaining assets and liabilities of the U.S. Pension Plan and realize a settlement gain or loss as a component of net periodic benefit costs. Given the funded status of the U.S. Pension Plan, the Company does not expect the transaction to result in material cash inflows or outflows in the consolidated statements of cash flows. The insurance contract had a fair value of $\n362\n million at December 31, 2024 and was valued on an insurer pricing basis, which approximates fair value.\nPlan Settlements\n—\n \nOn June 30, 2023, the Company approved a one-time lump sum offering to participants in certain of Bunge's defined benefit North American pension plans who had separated from the Company as of December 31, 2022 and whose benefits in the plan had fully vested. The respective payments were substantially completed during September 2023. The payments, which were paid from plan assets as settlement of respective benefit obligations, resulted in a $\n22\n million decrease in benefit obligations and the reclassification of an unamortized gain of less than $\n1\n million from Accumulated other comprehensive loss, which was recorded in Other income (expense) - net on the consolidated statements of income.\nOn February 28, 2022, the Company, together with plan participants and related employee unions, agreed to the transition of one of the Company’s international defined-benefit pension plans to a multi-employer pension plan. Following the transition, the Company accounts for the multi-employer plan similar to a defined contribution plan, resulting in full settlement of the related defined-benefit plan obligations. In connection with the settlement, during the first quarter of 2022, the Company recorded a \n$\n41\n million pretax gain within Other income (expense) - net in its consolidated statements of income, comprising a $\n4\n million settlement of the related defined benefit plan obligations as well as the reclassification of $\n37\n million in unamortized actuarial gains from Accumulated other comprehensive loss. Of this pretax gain, $\n12\n million was attributable to Redeemable non-controlling interests.\nPlan Transfers In and Out\n—\nThere were \nno\n significant transfers into or out of Bunge's employee benefit plans during the years ended December 31, 2024 or 2023.\nCost of Benefit Plans\n—Service cost is recognized in a period determined as the actuarial present value of benefits \nattributed by the pension benefit formula to services rendered by employees during that period. Interest cost is the amount recognized in a period determined as the increase in the projected benefit obligation due to the passage of time. The expected return on plan assets is determined based on the expected long-term rate of return on plan assets and the market-related value of plan assets. Amortization of net loss represents the recognition in net periodic cost over several periods of amounts previously recognized in Other comprehensive (loss) income. Service cost is included in the same income statement line item as other compensation costs arising from services rendered during the period, while the other components of net periodic benefit pension cost are presented separately in Other (expense) income- net.\nThe components of net periodic benefit costs for defined benefit pension plans and postretirement benefit plans are as follows:\n \nPension Benefits\nDecember 31,\nPostretirement Benefits\nDecember 31,\n(US$ in millions)\n2024\n2023\n2022\n2024\n2023\n2022\nService cost\n$\n11\n \n$\n10\n \n$\n29\n \n$\n—\n \n$\n—\n \n$\n—\n \nInterest cost\n38\n \n41\n \n30\n \n3\n \n4\n \n3\n \nExpected return on plan assets\n(\n47\n)\n(\n46\n)\n(\n52\n)\n—\n \n—\n \n—\n \nAmortization of net loss (gain)\n3\n \n3\n \n5\n \n(\n1\n)\n(\n1\n)\n—\n \nCurtailment gain\n—\n \n—\n \n(\n4\n)\n—\n \n—\n \n—\n \nSettlement gain recognized\n—\n \n—\n \n(\n36\n)\n—\n \n—\n \n—\n \nNet periodic benefit costs\n$\n5\n \n$\n8\n \n$\n(\n28\n)\n$\n2\n \n$\n3\n \n$\n3\n \nAssumptions used in Postretirement Be\nnefits Calculations\n—At December 31, 2024, an \n8.5\n%\n annual rate of increase in the per capita cost of c\novered healthcare benefits was assumed for 2024 postretirement benefit plan measurement purposes, decreasing to \n8.1\n% by 2048, a\nnd remaining at th\nat level thereafter. At December 31, 2023, an \n8.8\n% annual rate of increase in the per capita cost of covered healthcare benefits was assumed for 2023 postretirement benefit plan measurement purposes, decreasing to \n8.2\n% by 2048, and remaining at that level thereafter.\nF-51\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe weighted-average actuarial assumptions used in determining the benefit obligation under the defined benefit pension and postretirement benefit plans are as follows:\n \nPension Benefits\nDecember 31,\nPostretirement Benefits\nDecember 31,\n \n2024\n2023\n2024\n2023\nDiscount rate\n4.2\n \n%\n4.8\n \n%\n11.3\n \n%\n9.2\n \n%\nIncrease in future compensation levels\n2.1\n \n%\n2.2\n \n%\nN/A\nN/A\nThe weighted-average actuarial assumptions used in determining the net periodic benefit cost under the defined benefit pension and postretirement benefit plans are as follows:\n \nPension Benefits\nDecember 31,\nPostretirement Benefits\nDecember 31,\n \n2024\n2023\n2022\n2024\n2023\n2022\nDiscount rate\n4.8\n \n%\n5.2\n \n%\n2.5\n \n%\n9.2\n \n%\n9.6\n \n%\n7.5\n \n%\nExpected long-term rate of return on assets\n6.7\n \n%\n6.5\n \n%\n5.0\n \n%\nN/A\nN/A\nN/A\nIncrease in future compensation levels\n2.2\n \n%\n2.4\n \n%\n3.2\n \n%\nN/A\nN/A\nN/A\nThe sponsoring subsidiaries select the expected long-term rate of return on assets in consultation with their investment advisors and actuaries. These rates are intended to reflect the average rates of earnings expected on the funds invested or to be invested to provide required plan benefits. The plans are assumed to continue in effect as long as assets are expected to be invested.\nIn estimating the expected long-term rate of return on assets, appropriate consideration is given to historical performance for the major asset classes held, or anticipated to be held, by the applicable plan trusts and to current forecasts of future rates of return for those asset classes. Cash flows and expenses are taken into consideration to the extent that it would affect the expected returns. As assets are generally held in qualified trusts, anticipated returns are not reduced for taxes. For the U.S. Pension Plan, the anticipated long-term rate of return is equal to the discount rate.\nFor certain of Bunge’s plans, the discount rate is determined by 1) the yield on a hypothetical bond portfolio for which the cash flow effectively settles the year-by-year projected benefit cash flows or 2) matching either the duration or the expected cash flows for the pension plans to a hypothetical yield curve developed on a region-specific basis using a portfolio of available high quality, non-callable, make-whole corporate bonds. For the U.S. Pension Plan, the discount rate is based on the rate at which the liabilities will be effectively settled during 2025.\nF-52\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nPension Benefit Obligations and Funded Status—\nThe following table sets forth in aggregate the changes in the defined benefit pension and postretirement benefit plans' benefit obligations, assets and funded status at December 31, 2024 and 2023. A measurement date of December 31 was used for all plans.\n \nPension Benefits\nDecember 31,\nPostretirement Benefits\nDecember 31,\n(US$ in millions)\n2024\n2023\n2024\n2023\nChange in benefit obligations:\n \n \n \n \nBenefit obligation at the beginning of year\n$\n836\n \n$\n812\n \n$\n35\n \n$\n36\n \nService cost\n11\n \n10\n \n—\n \n—\n \nInterest cost\n38\n \n41\n \n3\n \n4\n \nActuarial loss (gain), net\n24\n \n31\n \n14\n \n(\n4\n)\nEmployee contributions\n4\n \n4\n \n—\n \n—\n \nPlan settlements\n(\n3\n)\n(\n10\n)\n—\n \n—\n \nBenefits paid\n(\n41\n)\n(\n59\n)\n(\n6\n)\n(\n3\n)\nExpenses paid\n(\n3\n)\n(\n5\n)\n—\n \n—\n \nImpact of foreign exchange rates\n(\n17\n)\n12\n \n(\n8\n)\n2\n \nBenefit obligation at the end of year\n$\n849\n \n$\n836\n \n$\n38\n \n$\n35\n \nChange in plan assets:\n \n \n \n \nFair value of plan assets at the beginning of year\n$\n711\n \n$\n706\n \n$\n—\n \n$\n—\n \nActual return on plan assets\n57\n \n51\n \n—\n \n—\n \nEmployer contributions\n22\n \n13\n \n6\n \n3\n \nEmployee contributions\n4\n \n4\n \n—\n \n—\n \nPlan settlements\n(\n3\n)\n(\n10\n)\n—\n \n—\n \nBenefits paid\n(\n41\n)\n(\n59\n)\n(\n6\n)\n(\n3\n)\nExpenses paid\n(\n3\n)\n(\n5\n)\n—\n \n—\n \nImpact of foreign exchange rates\n(\n15\n)\n11\n \n—\n \n—\n \nFair value of plan assets at the end of year\n$\n732\n \n$\n711\n \n$\n—\n \n$\n—\n \nUnfunded status and net amounts recognized:\n \n \n \n \nPlan assets less than benefit obligation\n$\n(\n117\n)\n$\n(\n125\n)\n$\n(\n38\n)\n$\n(\n35\n)\nNet liability recognized in the balance sheet\n$\n(\n117\n)\n$\n(\n125\n)\n$\n(\n38\n)\n$\n(\n35\n)\nAmounts recognized in the balance sheet consist of:\n \n \n \n \nNon-current assets\n$\n25\n \n$\n24\n \n$\n—\n \n$\n—\n \nCurrent liabilities\n(\n8\n)\n(\n9\n)\n(\n4\n)\n(\n5\n)\nNon-current liabilities\n(\n134\n)\n(\n140\n)\n(\n34\n)\n(\n30\n)\nNet liability recognized\n$\n(\n117\n)\n$\n(\n125\n)\n$\n(\n38\n)\n$\n(\n35\n)\nIncluded in Accumulated other comprehensive loss are the following amounts, net of tax and excluding noncontrolling interest, which have not been recognized in net periodic benefit costs:\nPension Benefits\nDecember 31,\nPostretirement Benefits\nDecember 31,\n(US$ in millions)\n2024\n2023\n2024\n2023\nNet actuarial (loss) gain\n$\n(\n139\n)\n$\n(\n129\n)\n$\n(\n4\n)\n$\n6\n \nPrior service credit\n3\n \n3\n \n—\n \n—\n \nTotal accumulated other comprehensive (loss) income\n$\n(\n136\n)\n$\n(\n126\n)\n$\n(\n4\n)\n$\n6\n \nF-53\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nBunge has aggregated certain defined benefit pension plans for which the projected benefit obligations exceeds the fair value of related plan assets with pension plans for which the fair value of plan assets exceeds related projected benefit obligations. \nThe following table provides aggregated information about pension plans with a projected benefit obligation in excess of plan assets:\n \nPension Benefits\nDecember 31,\n(US$ in millions)\n2024\n2023\nProjected benefit obligation\n$\n(\n268\n)\n$\n(\n713\n)\nFair value of plan assets\n$\n126\n \n$\n564\n \n    The accumulated benefit obligation for the defined pension benefit plans \nwas \n$\n831\n million\n a\nnd $\n818\n million at December 31, 2024 and 2023, respectively. \nThe following table summarizes information related to aggregated defined benefit pension plans with an accumulated benefit obligation in excess of plan assets:\n \nPension Benefits\nDecember 31,\n(US$ in millions)\n2024\n2023\nProjected benefit obligation\n$\n(\n268\n)\n$\n(\n713\n)\nAccumulated benefit obligation\n$\n(\n252\n)\n$\n(\n697\n)\nFair value of plan assets\n$\n126\n \n$\n564\n \nPension Benefit Plan Assets\n—The objective of the plans' trust funds is to sufficiently diversify plan assets to maintain a reasonable level of risk without imprudently sacrificing returns. \nFor pension plans in the United States (the \"US plans\"), Bunge has an outside investment advisory firm to implement a liability-driven investment strategy intended to increase the duration of pension plan assets to better match the duration of pension benefit obligations. For \nthe U.S. Pension Plan\n, Bunge updated its investment strategy to prepare for a lump sum buyout as discussed above. The investment strategy of the other US plans is intended to increase the interest rate and credit spread liability hedge ratios and reduce the funded status volatility of the US plans. \nTarget asset allocations are based on a glide path approach, which allocates more plan assets to immunizing assets, such as intermediate and long duration fixed income instruments, which are intended to match the duration and amount of the expected liabilities, and less to growth assets, such as public equities, non-core fixed income instruments and real assets, as the funded status of the plans improve. Target asset allocations are generally \n80\n-\n90\n% to immunizing assets and \n10\n-\n20\n% to growth assets. For pension plans outside of the United States, the plans’ trust funds utilize a target asset allocation of approximately \n30\n% fixed income securities, approximately \n35\n% equities and approximately \n35\n% in real estate and other alternative investment vehicles. \nBunge implements its investment strategy through a combination of passive and actively managed strategies, including, but not limited to mutual funds, collective trust funds, and collective investment trusts. The Company's policy is not to invest plan assets in Bunge \nGlobal SA\n shares. Plan investments are stated at fair value or net asset value (\"NAV\"). For a further definition of fair value and the associated fair value levels, refer to \nNote 1- Nature of Business, Basis of Presentation and Significant Accounting Policies\n.\nF-54\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe fair values of Bunge's defined benefit pension plans' assets at the measurement date, by category, are as follows:\n \nDecember 31, 2024\n(US$ in millions)\nLevel 1\nLevel 2\nLevel 3\nTotal\nCash\n$\n114\n \n$\n—\n \n$\n—\n \n$\n114\n \nInsurance contract \n(1)\n—\n \n—\n \n362\n \n362\n \nMutual funds - equities \n(2)\n70\n \n—\n \n—\n \n70\n \nMutual funds - fixed income \n(3)\n41\n \n21\n \n—\n \n62\n \nOther \n(4)\n2\n \n45\n \n8\n \n55\n \nTotal\n$\n227\n \n$\n66\n \n$\n370\n \n$\n663\n \nCollective pooled funds \n(5)\n$\n—\n \n$\n—\n \n$\n—\n \n$\n69\n \nTotal investments measured at NAV as a practical expedient\n—\n \n—\n \n—\n \n69\n \nTotal\n$\n227\n \n$\n66\n \n$\n370\n \n$\n732\n \n \nDecember 31, 2023\n(US$ in millions)\nLevel 1\nLevel 2\nLevel 3\nTotal\nCash\n$\n45\n \n$\n—\n \n$\n—\n \n$\n45\n \nMutual funds - equities \n(2)\n62\n \n—\n \n—\n \n62\n \nMutual funds - fixed income \n(3)\n41\n \n31\n \n—\n \n72\n \nOther \n(4)\n3\n \n45\n \n6\n \n54\n \nTotal\n$\n151\n \n$\n76\n \n$\n6\n \n$\n233\n \nCollective pooled funds \n(5)\n$\n—\n \n$\n—\n \n$\n—\n \n$\n478\n \nTotal investments measured at NAV as a practical expedient\n—\n \n—\n \n—\n \n478\n \nTotal\n$\n151\n \n$\n76\n \n$\n6\n \n$\n711\n \n(1)\nThis category represents the buy-in contract related to the U.S. Pension Plan and was valued on an insurer pricing basis, which reflects the purchase price adjusted for movements in market indicators.\n(2)\nThis category represents a portfolio of equity investments comprised of equity index funds that invest in U.S. equities and non-U.S. equities. The U.S. equities are comprised of investments focusing on large, mid and small cap companies and non-U.S. equities are comprised of international, emerging markets, and real estate investment trusts.\n(3)\nThis category represents a portfolio of fixed income investments in mutual funds comprised of investment grade U.S. government bonds and notes, foreign government bonds, and corporate bonds from diverse industries.\n(4)\nThis category represents a portfolio consisting of a mixture of hedge funds, investments in certain government and municipal securities, bonds, real estate, and insurance contracts.\n(5)\nCollective pooled funds are typically collective trusts valued at NAV that are calculated by the investment manager or sponsor of the fund and have daily or monthly liquidity. Using the practical expedient in ASC 820,\n Fair Value Measurements\n, these investments are not categorized within the fair value hierarchy, but are included in the table above so that they can be reconciled to the line items presented in the consolidated balance sheets.\nBunge expects to contri\nbute \n$\n14\n million\n and \n$\n4\n million\n to its d\nefined benefit pension and postretirement benefit plans, respectively, in 2025.\nF-55\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe following benefit payments, which reflect future service as appropriate, are expected to be paid in relation to defined benefit pension and postretirement benefit plans:\n(US$ in millions)\nPension\nBenefit Payments\nPostretirement\nBenefit Payments\n2025 \n(1)\n$\n508\n \n$\n4\n \n2026\n20\n \n4\n \n2027\n20\n \n4\n \n2028\n21\n \n4\n \n2029\n21\n \n4\n \nNext five years\n104\n \n22\n \n(1)\nThe expected benefit payments in 2025 include $\n487\n million related to the anticipated settlement of the U.S. Pension Plan as discussed above.\nEmployee Defined Contribution Plans\n—Bunge also makes contributions to qualified defined contribution plans for eligible employees. Contributions to these plans amount\ned to \n$\n48\n million\n, $\n43\n million\n, and $\n28\n million during the years ended December 31, 2024, 2023, and 2022, respectively.\n19. \nRELATED PARTY TRANSACTIONS\nBunge purchases agricultural commodity products from certain of its unconsolidated investees and other related parties. Such related party purchases comprised appro\nximatel\ny \n9\n% or less of total Cost of goods sold for each of the years ended December 31, 2024, 2023, and 2022. Bunge also sells agricultural commodity products to certain of its unconsolidated investees and other related parties. Such related party sales comprised approximately \n2\n% or \nless of total Net sales for each of the years ended December 31, 2024, 2023, and 2022. \nIn addition, Bunge receives services from and provides services to its unconsolidated investees, including tolling, port handling, administrative support, and other services. During the years ended December 31, 2024, 2023, and 2022, such services w\nere not material to t\nhe Company's consolidated results. \nAt December 31, 2024 and 2023, receivables related to the above related party transactions comprised approximatel\ny \n4\n% or less of total Trade accounts receivable, net. At December 31, 2024 and 2023, payables related to the above related party transactions comprised approximately \n3\n% or \nless of total Trade \naccounts payable.\nFurther, as referenced in \nNote 6- Other Current Assets\n and \nNote 12- Other Non-Current Assets\n, Bunge provides certain advance payments for future delivery of specified quantities of agricultural commodities and advances to its unconsolidated inve\nstees. At December 31, 2024 and 2023, advances to unconsolidated investees comprised approximately \n4\n% or less of total Other current assets and \n6\n% or less of total Other non-current assets.\n \nBunge believes all transaction values to be similar to those that would be conducted with third parties at arm's-length.\n20. \nCOMMITMENTS AND CONTINGENCIES\nBunge is party to claims and lawsuits, primarily non-income tax and labor claims in South America, arising in the normal course of business. Bunge is also involved from time to time in various contract, antitrust, environmental litigation and remediation, and other litigation, claims, government investigations and legal proceedings. The ability to predict the ultimate outcome of such matters involves judgments, estimates, and inherent uncertainties. Bunge records liabilities related to legal matters when the exposure item becomes probable and can be reasonably estimated. Bunge management does not expect these matters to have a material adverse effect on Bunge’s financial condition, results of operations, or liquidity. However, these matters are subject to inherent uncertainties and there exists the remote possibility that a liability arising from these matters could have a material adverse impact in the period the uncertainties are resolved should the liability substantially exceed the \nF-56\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\namount of provisions included in the consolidated balance sheets. \nIncluded in Other non-current liabilities at December 31, 2024 and 2023 are the following amounts related to these matters:\nDecember 31,\n(US$ in millions)\n2024\n2023\nNon-income tax claims\n$\n19\n \n$\n19\n \nLabor claims\n50\n \n66\n \nCivil and other claims\n194\n \n114\n \nTotal\n$\n263\n \n$\n199\n \nBrazil indirect taxes - non-income tax claims -\n These tax claims relate to claims against Bunge’s Brazilian subsidiaries, primarily value-added tax claims (ICMS, ISS, IPI and PIS/COFINS) plus applicable interest and penalties on the outstanding amount. \nAs of December 31, 2024, the Brazilian federal and state authorities have concluded examinations of the ICMS and PIS/COFINS tax returns and have issued outstanding claims. The Company continues to evaluate the merits of each of these claims and will recognize them if and when loss is considered probable. The outstanding claims comprise the following: \nDecember 31,\n(US$ in millions)\nYears Examined\n2024\n2023\nICMS\n1990 to Present\n$\n128\n \n$\n212\n \nPIS/COFINS\n2002 to Present\n$\n427\n \n$\n438\n \nLabor claims\n — The labor claims are principally against Bunge’s Brazilian subsidiaries. The labor claims primarily relate to dismissals, severance, health and safety, salary adjustments, and supplementary retirement benefits.\nCivil and other claims\n — The civil and other claims relate to various disputes with third parties, including suppliers, customers and government entities.\nGuarantees\n—Bunge has issued or was a party to the following guarantees at December 31, 2024:\n(US$ in millions)\nRecorded Liability\nMaximum\nPotential\nFuture\nPayments\nUnconsolidated affiliates guarantee \n(1)\n$\n13\n \n$\n149\n \nResidual value guarantee\n (2)\n—\n \n378\n \nOther guarantees\n—\n \n14\n \nTotal\n$\n13\n \n$\n541\n \n(1)\nBunge has issued guarantees to certain financial institutions related to debt of certain of its unconsolidated affiliates. The terms of the guarantees are equal to the terms of the related financings, which have maturity dates through 2034. There are no recourse provisions or collateral that would enable Bunge to recover any amounts paid under these guarantees. In addition, certain Bunge subsidiaries have guaranteed the obligations of certain of their unconsolidated affiliates and in connection therewith have secured their guarantee obligations through a pledge to the financial institutions of certain of their unconsolidated affiliates' shares plus loans receivable from the unconsolidated affiliates in the event that the guaranteed obligations are enforced. Based on the amounts drawn under guaranteed debt facilities of unconsolidated affiliates at December 31, 2024, Bunge's potential liability was $\n131\n million, and it has recorded $\n13\n million of obligations related to these guarantees within Other current liabilities and Other non-current liabilities.\n(2)\nBunge has issued guarantees to certain financial institutions that are party to certain operating lease arrangements for railcars, barges and buildings. These guarantees provide for a minimum residual value to be received by the lessor at the conclusion of the lease term. These leases expire at various dates from 2025 through 2029. At December 31, 2024, \nF-57\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nno\n obligation has been recorded related to these guarantees. Any obligation recorded would be re\ncognized in Current \noperating lease obligations or Non-current operating lease obligations.\nBunge Global SA has provided a guarantee to the Director of the Illinois Department of Agriculture as Trustee for Bunge North America, Inc. (\"BNA\"), an indirect wholly-owned subsidiary, which guarantees all amounts due and owing by BNA to grain producers and/or depositors in the State of Illinois who have delivered commodities to BNA's Illinois facilities. \nIndemnitie\ns—Bunge has issued or was a party to the following indemnities at December 31, 2024:\nOn October 1, 2024, Bunge agreed to indemnify the buyer in relation to the sale of its ownership interest in BP Bunge Bioenergia against future losses associated with certain legal claims as defined in the share purchase agreement. Indemnities for new claims generally expire between \nsix\n and \nten years\n from the transaction closing date and no expiration period for existing claims. As of December 31, 2024, Bunge recorded a $\n95\n million obligation related to existing indemnity claims within Other non-current liabilities and has maximum potential future payments of $\n1,357\n million.\nOn February 3, 2023, Bunge agreed to indemnify the buyer of its Russian operations against certain existing legal claims involving Bunge's former Russian subsidiary. The indemnity expires on February 2, 2030. At both December 31, 2024 and 2023, Bunge has recognized a $\n9\n million obligation related to this indemnity within Other non-current liabilities and has maximum potential future payments of $\n235\n million. \nCommitments\n—At December 31, 2024, Bunge had approximately $\n188\n million of purchase commitments related to inventories, $\n138\n million of freight supply agreements for ocean freight vessels and railroad freight lines not accounted for as leases, $\n77\n million of power supply contracts, $\n243\n million of contractual commitments related to construction in progress, and $\n669\n million of other purchase commitments and obligations, such as take-or-pay contracts, throughput contracts, and debt commitment fees.\nBunge has also entered into standby letters of credit and surety bonds with financial institutions primarily relating to the guarantee of our future performance on certain contracts. Amounts on outstanding standby letter of credit agreements and surety bonds aggregated to $\n1,610\n million and $\n1,858\n million as of December 31, 2024 and 2023, respectively.\n21. \nOTHER NON-CURRENT LIABILITIES\nOther non-current liabilities consist of the following:\nDecember 31,\n(US$ in millions)\n2024\n2023\nLabor, legal and other provisions \n(1)\n$\n281\n \n$\n218\n \nPension, post-retirement, and post-employment obligations \n(2)\n170\n \n170\n \nUncertain income tax positions \n(3)\n75\n \n68\n \nUnrealized losses on derivative contracts, at fair value \n(4)\n232\n \n260\n \nOther\n89\n \n108\n \nTotal\n$\n847\n \n$\n824\n \n(1)\nAs of December 31, 2024, Bunge recorded a $\n95\n million obligation related to certain indemnifications associated with the sale of it \n50\n% ownership interest in BP Bunge Bioenergia. See \nNote 20- Commitments and Contingencies \nfor further information.\n(2)\nSee \nNote 18- Employee Benefit Plans\n. \n(3)\nSee \nNote 14- Income Taxes.\n \n(4)\nSee \nNote 15- Fair Value Measurements.\n \n \nF-58\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n22. \nEQUITY\nRedomestication\n— In connection with the Redomestication noted in \nNote 1- Nature of Business, Basis of Presentation, and Significant Accounting Policies\n, one registered share, par value $\n0.01\n per share, of Bunge Global SA was exchanged for,  each issued and outstanding Bunge Limited common share, par value $\n0.01\n per share. In connection with the non-cash exchange on November 1, 2023, Bunge Global SA acquired \n16,141,494\n treasury shares which, following the Redomestication, have been included in the general treasury share population available for use in satisfying Bunge’s obligations to deliver registered shares. \nTreasury Shares\n— In connection with the Redomestication, \n8,102,179\n shares held in treasury with an acquisition cost of\n \n$\n845\n million were cancelled in a non-cash transaction to comply with the Swiss Code limitation on issuer’s holding of registered share capital. In addition, in the fourth quarter of 2024, Bunge Global SA cancelled \n6,146,930\n shares held in treasury totaling $\n572\n million. \nShare Repurchase Program\n—\n \nOn November 13, 2024, Bunge Global SA's Board approved the expansion of an existing share repurchase program by an additional $\n500\n million bringing total authorizations under the program since inception to $\n2.7\n billion. The program continues to have an indefinite term.\n \nAs of December 31, 2024, a total of \n19,667,739\n shares were repurchased under the program for $\n1.9\n billion with an aggregate purchase authorization of approximately $\n800\n million remaining outstanding for repurchases under the program. During the twelve months ended December 31, 2024, Bunge repurchased \n12,150,763\n shares for $\n1.1\n billion.\nCumulative Convertible Perpetual Preference Shares\n—\n \nEffective March 23, 2022, (the \"Conversion Date\"), in accordance with the terms of the certificate of designation governing the \n4.875\n% Cumulative Convertible Perpetual Preference Shares (\"convertible preference shares\"), all of the Company's issued and outstanding convertible preference shares were automatically converted into \n1.2846\n common shares of the Company, par value $\n0.01\n per share. There were \n6,898,268\n convertible preference shares issued and outstanding prior to the conversion, which resulted in the issuance of \n8,861,515\n new common shares of the Company. Additionally, in the first quarter of 2022, prior to the conversion, \n1,415\n convertible preference shares were voluntarily converted by preference shareholders into \n1,816\n common shares. As a result of this conversion, no convertible preference shares were issued or outstanding as of December 31, 2024, 2023, and 2022, and all rights of the former holders of the convertible preference shares terminated, as of March 23, 2022.  \nDividends on the convertible preference shares ceased to accrue on the Conversion Date. Accordingly, holders of the convertible preference shares were not entitled to receive the $\n1.21875\n per share dividend declared by the Company in respect of the convertible preference shares on February 23, 2022, and payable to holders of record on May 15, 2022. \nDividends on registered shares\n—We paid cash dividends to shareholders as follows:\nYear Ended December 31, \n2024\n2023\n2022\nDividends paid per share\n$\n2.7025\n \n$\n2.575\n \n$\n2.30\n \n \nDividend distributions occurring after the Redomestication are at the discretion of the Board of Directors and the approval of shareholders at a general meeting in accordance with Swiss law. On May 15, 2024, shareholders of Bunge Global SA approved a cash dividend distribution in the amount of $\n2.72\n per share, payable in \nfour\n equal quarterly installments of $\n0.68\n per share beginning in the second quarter of fiscal year 2024 and ending in the first quarter of fiscal year 2025. \nUpon approval of a dividend, the obligation is reflected in Other current liabilities with a corresponding reduction in Retained earnings in the consolidated balance sheet. At December 31, 2024, and 2023, the unpaid portion of the dividends accrued in Other current liabilities on the consolidated balance sheets totaled $\n91\n million and $\n96\n million, respectively, see \nNote 13- Other Current Liabilities\n. \nF-59\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nAccumulated other comprehensive loss\n Attributable to Bunge\n—\nThe following table summarizes the balances of related after-tax components of Accumulated other comprehensive loss attributable to Bunge:\n(US$ in millions)\nForeign Exchange Translation\nAdjustment \n(1)\nDeferred\nGains (Losses)\non Hedging\nActivities\nPension and\nOther\nPostretirement\nLiability\nAdjustments\nAccumulated Other Comprehensive\nLoss\nBalance, January 1, 2022\n$\n(\n6,093\n)\n$\n(\n254\n)\n$\n(\n124\n)\n$\n(\n6,471\n)\nOther comprehensive income (loss) before reclassifications\n26\n \n(\n81\n)\n40\n \n(\n15\n)\nAcquisition of redeemable noncontrolling interest\n(\n15\n)\n—\n \n—\n \n(\n15\n)\nAmount reclassified from Accumulated other comprehensive loss\n(2)\n156\n \n(\n8\n)\n(\n18\n)\n130\n \nNet-current period other comprehensive income (loss)\n167\n \n(\n89\n)\n22\n \n100\n \nBalance, December 31, 2022\n(\n5,926\n)\n(\n343\n)\n(\n102\n)\n(\n6,371\n)\nOther comprehensive income (loss) before reclassifications\n335\n \n(\n99\n)\n(\n18\n)\n218\n \nAmount reclassified from Accumulated other comprehensive loss\n(3)\n102\n \n(\n3\n)\n—\n \n99\n \nNet-current period other comprehensive income (loss)\n437\n \n(\n102\n)\n(\n18\n)\n317\n \nBalance, December 31, 2023\n(\n5,489\n)\n(\n445\n)\n(\n120\n)\n(\n6,054\n)\nOther comprehensive (loss) income before reclassifications\n(\n897\n)\n127\n \n(\n24\n)\n(\n794\n)\nAmount reclassified from Accumulated other comprehensive loss\n(4)\n133\n \n9\n \n4\n \n146\n \nNet-current period other comprehensive (loss) income \n(\n764\n)\n136\n \n(\n20\n)\n(\n648\n)\nBalance, December 31, 2024\n$\n(\n6,253\n)\n$\n(\n309\n)\n$\n(\n140\n)\n$\n(\n6,702\n)\n(1)\nBunge has significant operating subsidiaries in Brazil, Argentina, North America, Europe, and Asia-Pacific. The functional currency of Bunge's subsidiaries is generally the local currency. The assets and liabilities of these subsidiaries are translated into U.S. dollars from the local currency at month-end exchange rates, and the resulting foreign currency translation gains (losses) are recorded in the consolidated balance sheets as a component of Accumulated other comprehensive loss. \n(2)\nOn February 28, 2022, the Company, together with plan participants and related employee unions, agreed to the transition of one of the Company's international defined benefit pension plans to a multi-employer pension plan. Following the transition, the Company accounts for the multi-employer plan similar to a defined contribution plan, resulting in full settlement of the related defined benefit plan obligations. \nIn connection with the settlement, during the twelve months ended December 31, 2022, the Company reclassified $\n27\n million (net of $\n10\n million tax expense) in unamortized actuarial gains from Accumulated other comprehensive loss, of which $\n19\n million was attributable to Bunge (net of $\n7\n million in tax expense), and $\n8\n million was attributable to redeemable non-controlling interest (net of $\n3\n million in tax expense).\nThe year ended December 31, 2022 also included the release of cumulative translation adjustments upon the disposition of substantially all of the wheat milling business in Mexico of $\n158\n million, which had been previously reserved through Cost of goods sold, in the consolidated statements of income in the year ended December 31, 2021 (see \nNote 2- Acquisitions and Dispositions\n). \n(3)\nThe year ended December 31, 2023 included the release of cumulative translation adjustments upon the disposition of all of its Russian operations of $\n103\n million, which had been previously reserved through Cost of goods sold, in the consolidated statements of income in the year ended December 31, 2022 (see \nNote 2- Acquisitions and Dispositions\n).\n(4)\nThe year ended December 31, 2024 included the release of cumulative translation adjustments and deferred results on hedging activities upon the disposition of BP Bunge Bioenergia of $\n133\n million and $\n9\n million, respectively (see \nNote 2- Acquisitions and Dispositions\n).\nF-60\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n23. \nEARNINGS PER SHARE\nShare information provided below, including references to Net income attributable to Bunge shareholders, Weighted-average number of shares outstanding, and Earnings per share have been calculated based on Bunge’s common shares prior to the Redomestication and Bunge’s registered shares after the Redomestication. \nThe following table sets forth the computation of basic and diluted earnings per share:\n \nYear Ended December 31,\n(US$ in millions, except for share data)\n2024\n2023\n2022\nNet income attributable to Bunge shareholders\n$\n1,137\n \n$\n2,243\n \n$\n1,610\n \nWeighted-average number of shares outstanding:\n \n \n \nBasic\n140,539,652\n \n148,804,387\n \n148,712,251\n \nEffect of dilutive shares:\n \n \n \n—stock options and awards \n(1)\n1,683,569\n \n1,983,530\n \n2,455,629\n \n—convertible preference shares \n(2)\n—\n \n—\n \n1,966,874\n \nDiluted\n142,223,221\n \n150,787,917\n \n153,134,754\n \nEarnings per share:\n \n \n \nNet income attributable to Bunge shareholders—basic\n$\n8.09\n \n$\n15.07\n \n$\n10.83\n \nNet income attributable to Bunge shareholders—diluted\n$\n7.99\n \n$\n14.87\n \n$\n10.51\n \n(1)\nThe weighted-average shares outstanding-diluted exclude less than \n1\n million contingently issuable restricted stock units, which were not dilutive and not included in the computation of earnings per share for the years ended December 31, 2024, 2023, and 2022.\n(2)\nEffective March 23, 2022, in accordance with the terms of the certificate of designation governing the convertible preference shares, all of the Company's issued and outstanding convertible preference shares were automatically converted into \n1.2846\n common shares of the Company, par value $\n0.01\n per share. Refer to \nNote 22- Equity\n for further information.\n24. \nSHARE-BASED COMPENSATION\nIn connection with the Redomestication effective as of November 1, 2023, Bunge amended the Bunge Equity Incentive Plan (the \"2016 EIP\"), the Bunge 2009 Equity Incentive Plan, and the 2017 Non-Employee Directors Equity Incentive Plan (the \"2017 NED Plan\" or collectively, referred to as the \"Plans\") to provide for the issuance of registered shares instead of common shares in connection with the awards under the Plans. Additionally, the amendments to the Plans include changes to comply with Swiss law regarding minimum payment for shares, share sourcing, the form of shares, data protection, and forfeiture of restricted shares along with modifying the vesting provision on the 2017 NED Plan for separation. \nOn May 15, 2024, Bunge established the Bunge 2024 Long-Term Incentive Plan (\"2024 LTIP\"), which allows for an additional issue of \n5,000,000\n shares and replaced the 2016 EIP, under which, beginning May 15, 2024, no further awards may be granted.\nFor the years ended December 31, 2024, 2023, and 2022, Bunge recognized approximately $\n65\n million, $\n69\n million, and $\n65\n million, respectively, of total compensation expense related to its stock option and restricted stock unit equity awards. \nF-61\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nDuring the years ended December 31, 2024, 2023, and 2022, Bunge granted equity awards under the 2024 LTIP and the 2016 EIP, both shareholder approved plans. Under the 2024 LTIP and the 2016 EIP, the Compensation Committee of Bunge's Board of Directors may grant equity-based awards to officers, employees, consultants, and independent contractors in the form of stock options, restricted stock units (performance-based or time-based) or other equity-based awards. Shares issued under the 2024 LTIP and the 2016 EIP may result from, in whole or in part, the capital band referenced in Bunge's articles of association, treasury shares, or shares reacquired by the Company in any manner, or a combination thereof. \nStock Option Awards—Options to purchase Bunge registered shares are granted with an exercise price equal to the grant date fair market value of Bunge registered shares, vest over service periods that generally range from \none\n to \nthree years\n and expire \n10\n years from the date of grant. Vesting may be accelerated in certain circumstances as provided in the plans or associated award agreements. Grant date fair value is recognized as compensation expense on a straight-line basis for option grants, and forfeitures are recognized as they occur. Bunge elected to cease awarding stock options to its employees beginning January 1, 2021.\n \nAll awards previously granted have vested and have varying expiration dates through 2030.\nRestricted Stock Units—Restricted stock units (\"RSUs\") give recipients the right to receive Bunge registered shares upon the lapse of related restrictions determined by the Compensation Committee. The Company has two types of RSUs: time-based restricted stock units (\"TBRSUs\") and performance-based restricted stock units (\"PBRSUs\"). Restrictions on TBRSUs are based on continued service by the recipient through the designated term. Restrictions on PBRSUs are based on the achievement of certain performance targets, including earnings per share, return on invested capital, and relative total shareholder return, with the number of PBRSUs earned varying based on the level of achievement against these performance targets. Compensation expense is recognized on a straight-line basis over the vesting period for restricted stock units. RSUs generally vest over periods ranging from \none\n to \nthree years\n. Vesting may be accelerated under certain circumstances as defined in the plans or associated award agreements. RSUs are generally settled in Bunge registered shares upon satisfaction of the applicable vesting terms, and forfeitures are recognized as they occur. In locations where share settlement may be prohibited under local law, RSUs are settled in cash. At the time of settlement, a participant holding a vested restricted stock unit will also be entitled to receive corresponding accrued dividend equivalent share payments.\nUnder the 2017 NED Plan, the Compensation Committee may grant equity-based awards to non-employee directors of Bunge Global SA. Awards may consist of restricted stock, RSUs, deferred RSUs, and non-statutory stock options.\nRSUs granted to non-employee directors generally vest on the first anniversary of the grant date, provided the director continues to serve on the Board until such date, and are settled in Bunge registered shares. At the time of settlement, a participant holding a vested restricted stock unit is also entitled to receive corresponding accrued dividend equivalent share payments.\nThe fair value of each stock option granted under any of the Plans is estimated on the grant date using the Black-Scholes-Merton option pricing model, utilizing inputs such as the expected volatility of Bunge registered shares, historical employee exercise behavior, the expected outstanding option term, and the risk-free interest rate associated with U.S. Treasury zero-coupon bonds. \nA summary of option activity under the Plans for the year ended December 31, 2024 is presented below:\nOptions\nShares\nWeighted-Average\nExercise Price\nWeighted-Average\nRemaining\nContractual\nTerm (Years)\nAggregate\nIntrinsic\nValue (US$ in millions)\nOutstanding at January 1, 2024\n1,706,129\n \n$\n55.01\n \n \n \nExercised\n(\n165,902\n)\n66.91\n \n \n \nForfeited or expired\n(\n1,200\n)\n81.00\n \n \n \nOutstanding at December 31, 2024 \n(1)\n1,539,027\n \n53.71\n \n4.02\n$\n38\n \nExercisable at December 31, 2024\n1,539,027\n \n$\n53.71\n \n4.02\n$\n38\n \n(1)\nIncludes \n15,020\n options to be cash settled.\nThe total intrinsic value of options exercised during the years ended December 31, 2024, 2023, and 2022 was approximately $\n5\n million, $\n5\n million, and $\n44\n million, respectively. \nF-62\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nA summary of restricted stock unit activity under the Plans for the year ended December 31, 2024 is presented below.\nRestricted Stock Units\nShares\nWeighted-Average\nGrant-Date\nFair Value\nTime-based restricted stock units at January 1, 2024\n1,166,604\n \n$\n94.97\n \nTBRSUs Granted\n523,496\n \n95.28\n \nVested/issued \n(1)\n(\n433,739\n)\n81.90\n \nForfeited\n(\n47,134\n)\n98.54\n \nTime-based restricted stock units at December 31, 2024 \n(2) (3)\n1,209,227\n \n$\n99.26\n \nPerformance-based restricted stock units at January 1, 2024\n674,404\n \n$\n103.47\n \nPBRSUs Granted\n260,600\n \n92.78\n \nAdditional PBRSUs granted on achievement of performance targets\n233,190\n \n88.79\n \nVested/issued \n(1)\n(\n495,162\n)\n89.31\n \nForfeited\n(\n29,740\n)\n105.26\n \nPerformance-based restricted stock units at December 31, 2024\n \n(2) \n643,292\n \n$\n105.06\n \nTotal restricted stock units at December 31, 2024\n \n(2) \n1,852,519\n \n$\n101.28\n \n(1)\nDuring the year ended December 31, 2024, Bunge issued a total of \n638,386\n registered shares, net of shares withheld to cover taxes, including related shares representing accrued dividends, with a weighted-average fair value of $\n85.90\n per share upon vesting of TBRSUs and PBRSUs.\n(2)\nIncludes accrued unvested dividends, which are payable in Bunge's registered shares upon vesting of underlying restricted stock units.\n(3)\nIncludes \n14,180\n TBRSUs to be cash settled.\n \nAt December 31, 2024, there was approximately $\n77\n million of total unrecognized compensation cost related to RSUs granted under the Plans, which is expected to be recognized over the next \nthree years\n. The total grant date fair value of RSUs vested during the year ended December 31, 2024 was approximately $\n75\n million.\nRegistered Shares Reserved for Share-Based Awards\n—The 2024 LTIP and 2017 NED Plan provide that \n5,000,000\n and \n320,000\n registered shares, respectively, are to be reserved for grants of stock options, restricted stock units and other awards under the plans. At December 31, 2024, \n4,958,767\n and \n131,642\n  registered shares were available for future grants under the 2024 LTIP Plan and 2017 NED Plan, respectively. No shares are currently available for grant under any other Bunge Global SA equity incentive plan.\n25. \nLEASES\nThe Company routinely leases storage facilities, transportation equipment, land, and office facilities which are typically classified as operating leases. The accounting for some of the Company's leases may require significant judgment when determining whether a contract is or contains a lease, the lease term, and the likelihood of renewal or termination options.  Leases with an initial term of more than 12 months are recognized on the balance sheet as right-of-use assets (Operating lease assets) and lease liabilities for the obligation to make payments under such leases (Current operating lease obligations and Non-current operating lease obligations). As of the lease commencement date, the lease liability is initially measured as the present value of lease payments not yet paid. The lease asset is initially measured equal to the lease liability and adjusted for lease payments made at or before lease commencement (e.g., prepaid rent), lease incentives, and any initial direct costs. Over time, the lease liability is reduced for lease payments made and the lease asset is reduced through expense, classified as either Cost of goods sold or Selling, general and administrative expense depending upon the nature of the lease. Lease assets are subject to review for impairment in a manner consistent with property, plant and equipment. Leases with an initial term of 12 months or \nF-63\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nless (\"short-term leases\") are not recorded on the consolidated balance sheets and the related lease expense is recognized on a straight-line basis over the lease term.\nThe Company’s operating\n leases range in length of term, with a weighted average remaining lease term of \n8.2\n years\n, and a maximum remaining term of \n87\n years for \none water rights lease\n. Renewal options are generally exercisable solely at the Company’s discretion. When a renewal option is reasonably certain to be exercised, such additional terms are considered when calculating the associated operating lease asset and liability. When determining the lease liability at commencement of the lease, the present value of lease payments is generally based on the Company’s incremental borrowing rate determined using a portfolio approach and the Company’s inc\nremental cost of debt, adjusted to arrive at the rate in the applicable country and for the applicable term of the lease, as the rate implicit in the lease is generally not readily determinable. As of December 31, 2024, such weighted average discount rate on operating leases was \n4.7\n%\n. \nCertain of the Company’s freight supply agreements for ocean freight vessels and rail cars\n may include rental payments that are variable in nature. Variable payments on time charter agreements for ocean freight vessels under freight supply agreements are dependent on then current market daily hire rates. Variable payments for certain rail cars can be based on volumes, and in some cases, benchmark interest rates. All such variable payments, other than those that depend on an index or rate, are not included in the calculation of the associated operating lease asset or liability subsequent to the inception date of the associated lease and are recorded as expense in the period in which the adjustment to the variable payment obligation is incurred. Certain of the Company’s lease agreements related to railcars and barges contain residual value guarantees (see \nNote 20- Commitments and Contingencies\n). None of the Company’s lease agreements contain material restrictive covenants.\n    \nThe components of lease expense were as follows:\nYear Ended December 31,\n(US$ in millions)\n2024\n2023\nOperating lease cost\n$\n420\n \n$\n507\n \nShort-term lease cost\n1,054\n \n747\n \nVariable lease cost\n42\n \n47\n \nTotal lease cost\n$\n1,516\n \n$\n1,301\n \n    \nThe table below presents the finance lease-related assets and liabilities recorded on the consolidated balance sheets:\nDecember 31,\n(US$ in millions)\n2024\n \n2023\n       Property, plant and equipment\n$\n151\n \n$\n124\n \n       Less: accumulated depreciation and depletion\n(\n44\n)\n(\n36\n)\nProperty, plant and equipment, net\n$\n107\n \n$\n88\n \n       \nCurrent portion of long-term debt\n$\n7\n \n$\n3\n \n       \nLong-term debt\n80\n \n57\n \nTotal finance lease liabilities\n$\n87\n \n$\n60\n \nSupplemental cash flow information related to leases was as follows:\nYear Ended December 31,\n(US$ in millions)\n2024\n \n2023\nCash paid for amounts included in the measurement of lease liabilities:\n       Operating lease liability principal payments\n$\n421\n \n$\n506\n \nSupplemental non-cash information:\n       Right-of-use assets obtained in exchange for lease obligations \n(1)\n$\n449\n \n$\n403\n \n         (1)\n Comprises both operating and finance lease obligations.\n \nF-64\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n    \nMaturities of operating and finance lease liabilities as of December 31, 2024 were as follows:\n(US$ in millions)\nOperating leases\nFinance  leases\n2025\n$\n315\n \n$\n12\n \n2026\n220\n \n12\n \n2027\n134\n \n9\n \n2028\n93\n \n8\n \n2029\n50\n \n7\n \nThereafter\n265\n \n93\n \nTotal lease payments\n (1)\n1,077\n \n141\n \nLess imputed interest\n(\n196\n)\n(\n54\n)\nPresent value of lease liabilities, as separately presented on the consolidated balance sheet\n$\n881\n \n$\n87\n \n(1)\nMinimum lease payments have not been reduced by minimum sublease income receipts of $\n57\n million due in future periods under non-cancelable subleases as of December 31, 2024. Non-cancelable subleases primarily relate to agreements with third parties for the use of portions of certain facilities with remaining sublease\n terms of up to\n \nfive years\n. \nAdditionally, from time to time, the Company may enter into re-let agreements to sell the right to use ocean freight vessels under time charter agreements when excess capacity is available.\n Sublease income, generally recorded within Net sales, was $\n229\n million and $\n176\n million for the years ended December 31, 2024 and 2023, respectively.\n \n    The Company is expected to have additional operating lease payments, primarily for ocean freight vessels that have not yet commenced, of $\n526\n million. The operating leases are expected to commence between 2025 and 2027, with lease terms ranging between \nthree\n and \n48\n years.\n \n26. \nSEGMENT INFORMATION\nThe Company's operations are organized, managed, and classified into \nfour\n reportable segments - Agribusiness, Refined and Specialty Oils, Milling, and Sugar and Bioenergy, organized based upon their similar economic characteristics, products and services offered, production processes, types and classes of customer, and distribution methods. The Company’s remaining operations are not reportable segments, as defined by the applicable accounting standard, and are classified as Corporate and Other.\n \nThe Agribusiness segment is characterized by both inputs and outputs being agricultural commodities and thus high volume and low margin. The Refined and Specialty Oils segment involves the processing, production, and marketing of products derived from vegetable oils. The Milling segment involves the processing, production, and marketing of products derived primarily from wheat and corn. The Sugar & Bioenergy segment primarily comprises the net earnings from the Company’s \n50\n% interest in BP Bunge Bioenergia, a joint venture with BP. On October 1, 2024, Bunge completed the sale of our \n50\n% interest in BP Bunge Bioenergia to BP. See \nNote 2- Acquisitions and Dispositions \nfor further information\n.\n \nCorporate and Other includes salaries and overhead for corporate functions that are not allocated to the Company’s individual reporting segments because the operating performance of each reporting segment is evaluated by the Company's chief operating decision maker exclusive of these items, as well as certain other activities including Bunge Ventures, the Company's captive insurance activities, accounts receivable securitization activities, and certain income tax assets and liabilities. \nTransfers between the segments are valued at market. The segment revenues generated from these transfers are shown in the following table as \"Inter-segment revenues.\"\nF-65\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nIn the fourth quarter of 2024, Bunge adopted ASU 2023-07. As a result, Bunge expanded its expense disclosures in the following table and included additional qualitative disclosures within this footnote.   \nAs of, and for the year ended, December 31, 2024\n(US$ in millions)\nAgribusiness\nRefined and Specialty Oils\nMilling\nSugar and\nBioenergy\nEliminations\nTotal Reportable Segments\nCorporate & Other\nTotal \nBunge Consolidated\nNet sales to external customers\n$\n38,598\n \n$\n12,771\n \n$\n1,555\n \n$\n130\n \n$\n—\n \n$\n53,054\n \n$\n54\n \n$\n53,108\n \nInter–segment revenues\n7,299\n \n251\n \n85\n \n—\n \n(\n7,635\n)\n—\n \n—\n \n—\n \n  Raw materials cost\n(\n34,978\n)\n(\n10,582\n)\n(\n1,096\n)\n(\n127\n)\n—\n \n(\n46,783\n)\n(\n34\n)\n(\n46,817\n)\n  Industrial expenses- fixed\n(\n941\n)\n(\n542\n)\n(\n171\n)\n—\n \n—\n \n(\n1,654\n)\n(\n22\n)\n(\n1,676\n)\n  Industrial expenses- variable\n(\n522\n)\n(\n226\n)\n(\n38\n)\n—\n \n—\n \n(\n786\n)\n(\n4\n)\n(\n790\n)\n  Depreciation\n(\n243\n)\n(\n134\n)\n(\n32\n)\n—\n \n—\n \n(\n409\n)\n(\n23\n)\n(\n432\n)\nCost of goods sold\n(\n36,684\n)\n(\n11,484\n)\n(\n1,337\n)\n(\n127\n)\n—\n \n(\n49,632\n)\n(\n83\n)\n(\n49,715\n)\nSelling, general and administrative expenses\n(\n603\n)\n(\n416\n)\n(\n97\n)\n(\n2\n)\n—\n \n(\n1,118\n)\n(\n658\n)\n(\n1,776\n)\nForeign exchange (losses) gains – net\n(\n171\n)\n(\n20\n)\n(\n3\n)\n—\n \n—\n \n(\n194\n)\n5\n \n(\n189\n)\nEBIT - Noncontrolling interests\n (1)\n(\n9\n)\n(\n35\n)\n—\n \n—\n \n—\n \n(\n44\n)\n4\n \n(\n40\n)\nOther income (expense) – net\n226\n \n(\n57\n)\n(\n6\n)\n196\n \n—\n \n359\n \n83\n \n442\n \n(Loss) income from affiliates\n(\n56\n)\n—\n \n(\n1\n)\n18\n \n—\n \n(\n39\n)\n1\n \n(\n38\n)\nEBIT \n(2)\n1,301\n \n759\n \n111\n \n215\n \n—\n \n2,386\n \n(\n594\n)\n1,792\n \nTotal depreciation, depletion and amortization\n(\n243\n)\n(\n167\n)\n(\n35\n)\n—\n \n—\n \n(\n445\n)\n(\n23\n)\n(\n468\n)\nTotal assets\n14,961\n \n4,145\n \n914\n \n130\n \n—\n \n20,150\n \n4,749\n \n24,899\n \nCapital expenditures\n763\n340\n44\n—\n \n—\n \n1,147\n \n229\n1,376\n \nF-66\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nAs of, and for the year ended, December 31, 2023\n(US$ in millions)\nAgribusiness\nRefined and Specialty Oils\nMilling\nSugar and\nBioenergy\nEliminations\nTotal Reportable Segments\nCorporate & Other\nTotal \nBunge Consolidated\nNet sales to external customers\n$\n42,764\n \n$\n14,603\n \n$\n1,896\n \n$\n235\n \n$\n— \n$\n59,498\n \n$\n42\n \n$\n59,540\n \nInter–segment revenues\n8,360\n \n176\n \n175\n \n—\n \n(\n8,711\n)\n—\n \n— \n—\n \n  Raw materials cost\n(\n37,695\n)\n(\n12,346\n)\n(\n1,494\n)\n(\n229\n)\n—\n \n(\n51,764\n)\n(\n5\n)\n(\n51,769\n)\n  Industrial expenses- fixed\n(\n950\n)\n(\n511\n)\n(\n161\n)\n—\n \n—\n \n(\n1,622\n)\n(\n29\n)\n(\n1,651\n)\n  Industrial expenses- variable\n(\n581\n)\n(\n254\n)\n(\n43\n)\n—\n \n—\n \n(\n878\n)\n(\n4\n)\n(\n882\n)\n  Depreciation\n(\n217\n)\n(\n123\n)\n(\n31\n)\n—\n \n—\n \n(\n371\n)\n(\n22\n)\n(\n393\n)\nCost of goods sold\n(\n39,443\n)\n(\n13,234\n)\n(\n1,729\n)\n(\n229\n)\n—\n \n(\n54,635\n)\n(\n60\n)\n(\n54,695\n)\nSelling, general and administrative expenses\n(\n592\n)\n(\n425\n)\n(\n95\n)\n(\n1\n)\n—\n \n(\n1,113\n)\n(\n602\n)\n(\n1,715\n)\nForeign exchange gains – net\n—\n \n7\n \n1\n \n—\n \n—\n \n8\n \n12\n \n20\n \nEBIT - Noncontrolling interests\n (1)\n(\n70\n)\n(\n21\n)\n1\n \n—\n \n—\n \n(\n90\n)\n4\n \n(\n86\n)\nOther income (expense) – net\n126\n \n(\n65\n)\n(\n7\n)\n2\n \n—\n \n56\n \n73\n \n129\n \nIncome (loss) from affiliates\n1\n \n—\n \n(\n1\n)\n157\n \n—\n \n157\n \n(\n17\n)\n140\n \nEBIT \n(3)\n2,786\n \n865\n \n66\n \n164\n \n—\n \n3,881\n \n(\n548\n)\n3,333\n \nDepreciation, depletion and amortization\n(\n217\n)\n(\n179\n)\n(\n33\n)\n—\n \n—\n \n(\n429\n)\n(\n22\n)\n(\n451\n)\nTotal assets\n16,000\n \n3,969\n \n984\n \n471\n \n—\n \n21,424\n \n3,948\n \n25,372\n \nCapital expenditures\n551\n429\n45\n—\n \n—\n \n1,025\n \n97\n1,122\n \nAs of, and for the year ended, December 31, 2022\n(US$ in millions)\nAgribusiness\nRefined and Specialty Oils\nMilling\nSugar and\nBioenergy\nEliminations\nTotal Reportable Segments\nCorporate & Other\nTotal \nBunge Consolidated\nNet sales to external customers\n$\n47,700\n \n$\n16,850\n \n$\n2,388\n \n$\n259\n \n$\n— \n$\n67,197\n \n$\n35\n \n$\n67,232\n \nInter–segment revenues\n10,200\n \n306\n \n564\n \n—\n \n(\n11,070\n)\n—\n \n— \n—\n \n  Raw materials cost\n(\n43,715\n)\n(\n14,784\n)\n(\n1,884\n)\n(\n250\n)\n—\n \n(\n60,633\n)\n(\n20\n)\n(\n60,653\n)\n  Industrial expenses- fixed\n(\n844\n)\n(\n531\n)\n(\n166\n)\n—\n \n—\n \n(\n1,541\n)\n(\n21\n)\n(\n1,562\n)\n  Industrial expenses- variable\n(\n649\n)\n(\n266\n)\n(\n48\n)\n—\n \n—\n \n(\n963\n)\n(\n3\n)\n(\n966\n)\n  Depreciation\n(\n202\n)\n(\n111\n)\n(\n30\n)\n—\n \n—\n \n(\n343\n)\n(\n26\n)\n(\n369\n)\nCost of goods sold\n(\n45,410\n)\n(\n15,692\n)\n(\n2,128\n)\n(\n250\n)\n—\n \n(\n63,480\n)\n(\n70\n)\n(\n63,550\n)\nSelling, general and administrative expenses\n(\n532\n)\n(\n357\n)\n(\n102\n)\n(\n1\n)\n—\n \n(\n992\n)\n(\n377\n)\n(\n1,369\n)\nForeign exchange gains (losses) – net\n2\n \n(\n14\n)\n4\n \n2\n \n—\n \n(\n6\n)\n(\n5\n)\n(\n11\n)\nEBIT - Noncontrolling interests\n (1)\n(\n45\n)\n(\n12\n)\n(\n1\n)\n—\n \n—\n \n(\n58\n)\n(\n9\n)\n(\n67\n)\nOther (expense) income – net\n(\n67\n)\n(\n29\n)\n1\n \n2\n \n—\n \n(\n93\n)\n84\n \n(\n9\n)\nIncome (loss) from affiliates\n67\n \n—\n \n—\n \n93\n \n—\n \n160\n \n(\n55\n)\n105\n \nEBIT \n(4)\n1,715\n \n746\n \n162\n \n105\n \n—\n \n2,728\n \n(\n397\n)\n2,331\n \nDepreciation, depletion and amortization\n(\n203\n)\n(\n146\n)\n(\n32\n)\n—\n \n—\n \n(\n381\n)\n(\n27\n)\n(\n408\n)\nTotal assets\n16,486\n \n3,886\n \n1,195\n \n334\n \n—\n \n21,901\n \n2,679\n \n24,580\n \nCapital expenditures\n312\n169\n30\n—\n \n—\n \n511\n \n44\n555\n \nF-67\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n(1)\nIncludes Net (income) attributable to noncontrolling interests and redeemable noncontrolling interests adjusted for noncontrolling interests' share of interest and taxes.\n(2)\n2024 EBIT includes $\n244\n million of acquisition and integration costs, recorded in SG&A, Cost of goods sold and Other income (expense) - net, related to the announced Business Combination Agreement with Viterra; $\n195\n million gain on sale of Bunge's \n50\n% ownership share in BP Bunge Bioenergia, recorded in Other income (expense) - net; $\n19\n million of charges related to the impairment of an equity method investment, recorded in (Loss) income from affiliates; and $\n6\n million in insurance recoveries related to certain previously damaged property as a result of the Ukraine-Russia war, recorded in Cost of goods sold. \n(3)\n2023 EBIT includes a mark-to-market gain of $\n29\n million, recorded in Cost of goods sold, related to inventory recovered from Bunge's Mykolaiv and other facilities in Ukraine; $\n37\n million of fixed asset impairment charges in North America, recorded in Cost of goods sold; $\n17\n million of amortization charges, at Bunge's \n80\n% share, recorded in SG&A, primarily related to the discontinuance of the \nLoders Croklaan\n trademark; $\n114\n million of acquisition and integration costs, recorded in SG&A, related to the announced Business Combination Agreement with Viterra; $\n20\n million impairment charge, recorded in Other income (expense) - net, related to the full impairment of a long-term investment held in Other non-current assets; and a $\n16\n million impairment charge, recorded in (Loss) income from affiliates, related to a minority investment in Australian Plant Proteins, a start-up manufacturer of novel protein ingredients.\n(4)\n2022 EBIT includes $\n80\n million of charges resulting from the Ukraine-Russia war, recorded in Cost of goods sold, primarily related to losses associated with inventories physically located in occupied territories in Ukraine or in difficult to access locations with high costs of recovery; $\n106\n million of charges on the classification of our Russian oilseed processing business as held-for-sale, recorded in Cost of goods sold; a $\n29\n million gain, at Bunge's then-\n70\n% share, related to the settlement of \none\n of the Company’s international defined benefit pension plans, recorded in Other income (expense) - net; and $\n53\n million of charges related to the impairment of \ntwo\n equity investments, recorded in (Loss) income from affiliates.\nThe Company’s CODM is the chief executive officer. Total reportable segment earnings before interest and taxes (\"EBIT\") is the key operating performance measure utilized by the CODM to evaluate reportable segment operating activities and performance. The CODM believes total reportable segment EBIT is a useful measure of operating profitability, since the measure allows for an evaluation of the performance of its reportable segments without regard to its financing methods or capital structure. In addition, EBIT is a financial measure that is widely used by analysts and investors in Bunge’s industries. Further, the CODM uses total reportable segment EBIT to evaluate earnings generated from segment assets in deciding whether to reinvest earnings into a particular segment or into other parts of the entity, such as for acquisitions. EBIT is also used to monitor forecast versus actual results.  \nA reconciliation of Net income attributable to Bunge shareholders to Total reportable segment EBIT follows:\n \nYear Ended December 31,\n(US$ in millions)\n2024\n2023\n2022\nNet income attributable to Bunge shareholders\n$\n1,137\n \n$\n2,243\n \n$\n1,610\n \nInterest income\n(\n163\n)\n(\n148\n)\n(\n71\n)\nInterest expense\n471\n \n516\n \n403\n \nIncome tax expense\n336\n \n714\n \n388\n \nNoncontrolling interests' share of interest and tax\n11\n \n8\n \n1\n \nTotal EBIT\n1,792\n \n3,333\n \n2,331\n \nLess Corporate & Other EBIT\n(\n594\n)\n(\n548\n)\n(\n397\n)\nTotal reportable segment EBIT\n$\n2,386\n \n$\n3,881\n \n$\n2,728\n \nF-68\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nNet sales by product group to external customers were as follows:\n \nYear Ended December 31,\n(US$ in millions)\n2024\n2023\n2022\nAgribusiness Processing Products\n$\n27,981\n \n$\n31,298\n \n$\n32,804\n \nAgribusiness Merchandising Products\n10,617\n \n11,466\n \n14,896\n \nRefined and Specialty Oil Products\n12,771\n \n14,603\n \n16,850\n \nMilling Products\n1,555\n \n1,896\n \n2,388\n \nSugar and Bioenergy Products\n130\n \n235\n \n259\n \nOther Products\n54\n \n42\n \n35\n \nTotal\n$\n53,108\n \n$\n59,540\n \n$\n67,232\n \nGeographic area information for Net sales to external customers, determined based on the location of the subsidiary making the sale, and long-lived assets follows:\n \nYear Ended December 31,\n(US$ in millions)\n2024\n2023\n2022\nNet sales to external customers:\n \n \n \nEurope\n$\n25,356\n \n$\n24,333\n \n$\n26,089\n \nUnited States\n14,187\n \n15,819\n \n16,939\n \nAsia-Pacific\n6,194\n \n10,098\n \n13,829\n \nBrazil\n3,810\n \n4,771\n \n5,487\n \nArgentina\n859\n \n1,386\n \n1,576\n \nCanada\n2,174\n \n2,606\n \n2,431\n \nRest of world\n528\n \n527\n \n881\n \nTotal\n$\n53,108\n \n$\n59,540\n \n$\n67,232\n \n \nYear Ended December 31,\n(US$ in millions)\n2024\n2023\nLong-lived assets: \n(1)\n \n \nEurope\n$\n1,182\n \n$\n1,090\n \nUnited States\n2,361\n \n1,733\n \nAsia-Pacific\n400\n \n386\n \nBrazil\n758\n \n775\n \nArgentina\n195\n \n188\n \nCanada\n356\n \n367\n \nRest of world\n2\n \n2\n \nTotal\n$\n5,254\n \n$\n4,541\n \n(1)\nLong-lived assets comprise Property, plant and equipment, net.\n \nAs further described in \nNote 1- Nature of Business, Basis of Presentation and Significant Accounting Policies\n, the Company’s revenue comprises sales from commodity contracts that are accounted for under ASC 815, \nDerivatives and Hedging \n(ASC 815)\n \nand sales of other products and services that are accounted for under ASC 606, \nRevenue from Contracts \nF-69\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nwith Customers\n (ASC 606). \nThe following tables provide a disaggregation of Net sales to external customers between sales from commodity contracts (ASC 815) and sales from contracts with customers (ASC 606):\nYear Ended December 31, 2024\n(US$ in millions)\nAgribusiness\nRefined and Specialty Oils\nMilling\nSugar and\nBioenergy\nCorporate & Other\nTotal\nSales from commodity contracts (ASC 815)\n$\n36,467\n \n$\n963\n \n$\n2\n \n$\n126\n \n$\n—\n \n$\n37,558\n \nSales from contracts with customers (ASC 606)\n2,131\n \n11,808\n \n1,553\n \n4\n \n54\n \n15,550\n \nNet sales to external customers\n$\n38,598\n \n$\n12,771\n \n$\n1,555\n \n$\n130\n \n$\n54\n \n$\n53,108\n \nYear Ended December 31, 2023\n(US$ in millions)\nAgribusiness\nRefined and Specialty Oils\nMilling\nSugar and\nBioenergy\nCorporate & Other\nTotal\nSales from commodity contracts (ASC 815)\n$\n40,331\n \n$\n997\n \n$\n152\n \n$\n229\n \n$\n—\n \n$\n41,709\n \nSales from contracts with customers (ASC 606)\n2,433\n \n13,606\n \n1,744\n \n6\n \n42\n \n17,831\n \nNet sales to external customers\n$\n42,764\n \n$\n14,603\n \n$\n1,896\n \n$\n235\n \n$\n42\n \n$\n59,540\n \nYear Ended December 31, 2022\n(US$ in millions)\nAgribusiness\nRefined and Specialty Oils\nMilling\nSugar and\nBioenergy\nCorporate & Other\nTotal\nSales from commodity contracts (ASC 815)\n$\n44,553\n \n$\n1,198\n \n$\n154\n \n$\n253\n \n$\n—\n \n$\n46,158\n \nSales from contracts with customers (ASC 606)\n3,147\n \n15,652\n \n2,234\n \n6\n \n35\n \n21,074\n \nNet sales to external customers\n$\n47,700\n \n$\n16,850\n \n$\n2,388\n \n$\n259\n \n$\n35\n \n$\n67,232\n \nF-70\nTable of Contents\nBUNGE GLOBAL SA AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n27. \nQUARTERLY FINANCIAL INFORMATION (UNAUDITED)\n \nQuarter\n(US$ in millions, except per share data)\nFirst\nSecond\nThird\nFourth\nYear\n2024\n \n \n \n \n \nNet sales\n$\n13,417\n \n$\n13,241\n \n$\n12,908\n \n$\n13,542\n \n$\n53,108\n \nGross profit\n876\n \n664\n \n772\n \n1,081\n \n3,393\n \nNet income \n252\n \n73\n \n233\n \n630\n \n1,188\n \nNet income attributable to Bunge shareholders\n244\n \n70\n \n221\n \n602\n \n1,137\n \nEarnings per share—basic\n(1)\n \n \n \n \n \nNet income attributable to Bunge shareholders - basic\n$\n1.70\n \n$\n0.49\n \n$\n1.57\n \n$\n4.41\n \n$\n8.09\n \nEarnings per share—diluted\n(1)\n \n \n \n \n \nNet income attributable to Bunge shareholders - diluted\n$\n1.68\n \n$\n0.48\n \n$\n1.56\n \n$\n4.36\n \n$\n7.99\n \n2023\n \n \n \n \n \nNet sales\n$\n15,328\n \n$\n15,049\n \n$\n14,227\n \n$\n14,936\n \n$\n59,540\n \nGross profit\n1,181\n \n1,365\n \n1,045\n \n1,254\n \n4,845\n \nNet income \n659\n \n629\n \n389\n \n660\n \n2,337\n \nNet income attributable to Bunge shareholders\n632\n \n622\n \n373\n \n616\n \n2,243\n \nEarnings per share—basic\n(1)\n \n \n \n \n \nNet income attributable to Bunge shareholders - basic\n$\n4.21\n \n$\n4.13\n \n$\n2.50\n \n$\n4.24\n \n$\n15.07\n \nEarnings per share—diluted\n(1)\n \n \n \n \n \nNet income attributable to Bunge shareholders - diluted\n$\n4.15\n \n$\n4.09\n \n$\n2.47\n \n$\n4.18\n \n$\n14.87\n \n(1)\nEarnings per share attributable to Bunge shareholders for both basic and diluted is computed independently for each period presented. As a result, the sum of the quarterly earnings per share for the years ended December 31, 2024 and 2023 may not equal the total computed for the year. See \nNote 23- Earnings per Share\n for further details.\nF-71\nTable of Contents\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\n \nBUNGE GLOBAL SA\nDated:\nFebruary 20, 2025\nBy:\n \n/s/ JOHN W. NEPPL\nJohn W. Neppl\n \nExecutive Vice President and Chief Financial Officer\nS-1\nTable of Contents\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nFebruary 20, 2025\nBy:\n/s/ GREGORY A. HECKMAN\nGregory A. Heckman\n \nChief Executive Officer and Director\nFebruary 20, 2025\nBy:\n/s/ JOHN W. NEPPL\nJohn W. Neppl\n \nExecutive Vice President and Chief Financial Officer\nFebruary 20, 2025\nBy:\n/s/ J. MATT SIMMONS, JR.\nJ. Matt Simmons, Jr.\n \nController and Principal Accounting Officer\nFebruary 20, 2025\nBy:\n/s/ ELIANE ALEIXO LUSTOSA DE ANDRADE \nEliane Aleixo Lustosa de Andrade\n \nDirector\nFebruary 20, 2025\nBy:\n/s/ SHEILA BAIR\nSheila Bair\n \nDirector\nFebruary 20, 2025\nBy:\n/s/ CAROL M. BROWNER\nCarol M. Browner\n \nDirector\nFebruary 20, 2025\nBy:\n/s/ BERNARDO HEES\nBernardo Hees\n \nDirector\nFebruary 20, 2025\nBy:\n/s/ MICHAEL KOBORI\nMichael Kobori\n \nDirector\nFebruary 20, 2025\nBy:\n/s/ MONICA MCGURK\nMonica McGurk\n \nDirector\nFebruary 20, 2025\nBy:\n/s/ KENNETH SIMRIL\nKenneth Simril\n \nDirector\nFebruary 20, 2025\nBy:\n/s/ HENRY W. WINSHIP\nHenry W. Winship\n \nDirector\nFebruary 20, 2025\nBy:\n/s/ MARK N. ZENUK\nMark N. Zenuk\n \nDirector and Chair of the Board of Directors\nS-2"
  }
}