{
  "ticker": "BKNG",
  "cik": "0001075531",
  "company_name": "Booking Holdings Inc.",
  "filing_date": "2025-02-20",
  "accession": "0001075531-25-000010",
  "primary_doc": "bkng-20241231.htm",
  "item_sections": {
    "item1": "Item 1A, Risk Factors - \"\nOur business is subject to various competition, consumer protection, and online commerce laws and regulations around the world, and as the size of our business grows, scrutiny of our business by legislators and regulators in these areas may intensify\n\" and Note 16 to our Consolidated Financial Statements. \n29\nOur businesses outside of the U.S. represent a substantial majority of our financial results, but because we report our results in U.S. Dollars, we face exposure to movements in foreign currency exchange rates as the financial results and the financial condition of our businesses outside of the U.S. are translated from local currency (principally Euros and British Pounds Sterling) into U.S. Dollars. See Note 17 to our Consolidated Financial Statements for information related to revenues by geographic area. As a result of movements in foreign currency exchange rates, both the absolute amounts of and percentage changes in our foreign-currency-denominated net assets, gross bookings, revenues, operating expenses, and net income as expressed in U.S. Dollars are affected. Our total revenues increased by approximately 11% in 2024 as compared to 2023, but without the impact of changes in foreign currency exchange rates our total revenues increased year-over-year on a constant-currency basis by approximately 12%. Since our expenses are generally denominated in foreign currencies on a basis similar to our revenues, our operating margins have not been significantly impacted by currency fluctuations. \nWe generally enter into derivative instruments to minimize the impact of foreign currency exchange rate fluctuations, such as foreign currency exchange derivative contracts to hedge our exposure to the impact of movements in foreign currency exchange rates on our transactional balances denominated in currencies other than the functional currency. See Note 6 to our Consolidated Financial Statements for additional information. We designate certain portions of the aggregate principal value of our Euro-denominated debt as a hedge of the foreign currency exposure of the net investment in certain Euro functional currency subsidiaries. Foreign currency transaction gains or losses on the Euro-denominated debt that is not designated as a hedging instrument for accounting purposes are recognized in \"Other income (expense), net\" in the Consolidated Statements of Operations (see Notes 12 and 18 to our Consolidated Financial Statements). Such foreign currency transaction gains or losses are dependent on the amount of net assets of the Euro functional currency subsidiaries, the amount of the Euro-denominated debt that is designated as a hedge, and fluctuations in foreign currency exchange rates. For more information, see Part I,",
    "item1a": "Item 1A, Risk Factors - \"\nOur liquidity, credit ratings, and ongoing access to capital could be materially and negatively affected by global financial conditions and events.\n\" Our financial results and prospects are almost entirely dependent on facilitating the sale of travel-related services. Marketing expenses and personnel expenses are the most significant operating expenses for our business. See our Consolidated Statements of Operations and \"Trends\" and \"Results of Operations\" above for additional information on marketing expenses and personnel expenses, including stock-based compensation expenses. \nWe believe that our existing cash balances, liquid resources, and access to capital markets will be sufficient to fund our operating activities, capital expenditures, and other obligations through at least the next twelve months.\nCash, cash equivalents, and investments\nAt December 31, 2024, we had $16.7 billion in cash, cash equivalents, and investments, of which approximately $9.6 billion is held by our international subsidiaries. Cash, cash equivalents, and long-term investments held by our international subsidiaries are denominated primarily in Euros, U.S. Dollars, and British Pounds Sterling. Our investment policy seeks to preserve capital and maintain sufficient liquidity to meet operational and other needs of the business. See Notes 5 and 6 to our Consolidated Financial Statements for additional information. \nDeferred merchant bookings\nDeferred merchant bookings of $4.0 billion at December 31, 2024 includes cash payments received from travelers in advance of us completing our performance obligations and are comprised principally of amounts estimated to be payable to travel service providers as well as our estimated future revenues for our commission or margin and fees. The amounts are mostly subject to refunds for cancellations.\nDebt\nOur revolving credit facility extends a revolving line of credit up to $2 billion to us. We are in compliance with the maximum leverage ratio covenant under the facility, which is a condition to our ability to borrow.\nIn 2024, we issued senior notes with varying maturities for aggregate cash proceeds of $4.8 billion. The proceeds from the issuance of these senior notes are available for general corporate purposes, including to repurchase shares of our common stock and to redeem or repay outstanding indebtedness. During the year ended December 31, 2024, we paid $1.1 billion on the maturity of the Senior Notes due September 2024.\nAs of November 1, 2024, holders of our convertible senior notes due in May 2025 (\"May 2025 Notes\") are entitled to repayment of the principal amount of the notes in cash, and if they exercise their option to convert, the note holders are entitled to cash payment for the conversion premium, which is the conversion value in excess of the principal amount, settled at maturity. During the year ended December 31, 2024, we paid $198 million in aggregate upon the conversion of the May 2025 Notes at the note holders' option. \nThe total outstanding senior notes at December 31, 2024 had cumulative interest to maturity (based on coupon interest rates) of $4.5 billion, with $546 million payable within the next twelve months. \n See Note 12 to our Consolidated Financial Statements for additional information related to our debt arrangements, including principal amounts, interest rates, and maturity dates.\nShare repurchases and dividends\n See Note 13 to our Consolidated Financial Statements for additional information related to our stock repurchases, authorization limits, and excise taxes. During the year ended December 31, 2024, we repurchased shares of our common stock for an aggregate cost of $6.5 billion, including $345 million to repurchase shares of our common stock withheld to satisfy employee withholding tax obligations related to stock-based compensation. As of December 31, 2024, we recorded an estimated excise tax liability of $56 million for share repurchases in 2024. During the year ended December 31, 2024, we remitted excise taxes of $96 million for our share repurchases in 2023. We expect to complete the share repurchases under the remaining authorization of $7.7 billion of the program authorized by our Board of Directors (\"the Board\") in 2023 by the end of 2026, assuming no major downturn in the travel market. In January 2025, our Board authorized a program to repurchase up to an additional $20 billion of our common stock.\nDuring the year ended December 31, 2024, we paid cash dividends of $1.2 billion. In February 2025, the Board declared a cash dividend of $9.60 per share of common stock, payable on March 31, 2025 to stockholders of record as of the close of business on March 7, 2025.\n39\nCommitments, contingencies, and other\nAt December 31, 2024, we had, in the aggregate, $986 million of non-cancellable purchase obligations individually greater than $10 million, of which $208 million is payable within the next twelve months. Such purchase obligations relate to agreements to purchase goods and services that are enforceable and legally binding, that specify all significant terms, including the quantities to be purchased, price provisions, and the approximate timing of the transaction. \nAt December 31, 2024, we had lease obligations of $756 million, of which $169 million is payable within the next twelve months. See Note 10 to our Consolidated Financial Statements for additional information.\nAt December 31, 2024, we had a remaining transition tax liability of $487 million as a result of the Tax Act, which included $257 million reported as \"Long-term U.S. transition tax liability\" and $230 million included in \"Accrued expenses and other current liabilities\" in the Consolidated Balance Sheet. This liability will be paid over the next two years. Due to a recent U.S. Tax Court decision in Varian Medical Systems, Inc. vs. Commissioner, a portion of our total transition tax liability may be refunded. In accordance with the Tax Act, generally, future repatriation of our international cash will not be subject to a U.S. federal income tax liability as a dividend, but will be subject to U.S. state income taxes and international withholding taxes, which have been accrued by us.\nSee Note 16 to our Consolidated Financial Statements for information related to the $650 million standby letters of credit and bank guarantees issued on our behalf at December 31, 2024.\nSee Note 16 to our Consolidated Financial Statements and Part I, Item IA, Risk Factors - \"\nWe may have exposure to additional tax liabilities\n.\" for information related to certain tax assessments and other tax matters.\nSee Note 16 to our Consolidated Financial Statements and Part I, Item IA, Risk Factors - \n\"Our business is subject to various competition, consumer protection, and online commerce laws and regulations around the world, and as the size of our business grows, scrutiny of our business by legislators and regulators in these areas may intensify\" \nfor information related to certain regulatory matters, and our other contingent liabilities.\nSee \"–Trends\" above for information on the Transformation Program that we announced in November 2024 to implement certain organizational changes, including the estimated annual run rate savings and restructuring costs and accelerated investments required for the program. \n40\nCash Flow Analysis \nYear Ended December 31, 2024 compared to Year Ended December 31, 2023\nSee our Consolidated Statements of Cash Flows for additional information related to our cash flows.\nThe following table summarizes our cash flows for the years ended December 31, 2024 and 2023:\nYear Ended December 31,\n(in millions)\n2024\n2023\nNet cash provided by operating activities\n$\n8,323 \n$\n7,344 \nNet cash provided by investing activities\n129 \n1,486 \nNet cash used in financing activities\n(4,204)\n(8,909)\nNet cash provided by operating activities for the year ended December 31, 2024 resulted from net income of $5.9 billion, a favorable net impact from adjustments for non-cash and other items of $2.1 billion, and a favorable net change in working capital and other assets and liabilities of $367 million. Non-cash and other items were principally associated with the loss related to the conversion option on convertible senior notes, stock-based compensation expense, depreciation and amortization, unrealized foreign currency transaction gains related to Euro-denominated debt, provision for expected credit losses and chargebacks, and operating lease amortization. For the year ended December 31, 2024, deferred merchant bookings and other current liabilities increased by $1.4 billion and accounts receivable increased by $506 million, primarily due to higher business volumes, partially offset by faster accounts receivable collections in 2024. Merchant revenues increased while agency revenues decreased for the year ended December 31, 2024 compared to the year ended December 31, 2023 due to the ongoing shift from agency to merchant revenues at Booking.com.\nNet cash provided by operating activities for the year ended December 31, 2023 resulted from net income of $4.3 billion, a favorable net impact from adjustments for non-cash and other items of $1.3 billion, and a favorable net change in working capital and other assets and liabilities of $1.7 billion. Non-cash and other items were principally associated with stock-based compensation expense, depreciation and amortization, deferred income tax benefit, provision for expected credit losses and chargebacks, unrealized foreign currency transaction losses related to Euro-denominated debt, and operating lease amortization. For the year ended December 31, 2023, deferred merchant bookings and other current liabilities increased by $2.7 billion and accounts receivable increased by $1.3 billion, primarily due to increases in business volumes. \nDuring the year ended December 31, 2023, the Company accrued a loss of $530 million related to a draft decision by the Spanish competition authority and a loss of $276 million related to the Netherlands pension fund matter. The related liabilities are included in \"Accrued expenses and other current liabilities\" in the Consolidated Balance Sheet as of December 31, 2023. See Note 16 to our Consolidated Financial Statements for additional information.\nNet cash provided by investing activities for the year ended December 31, 2024 resulted mainly from proceeds from the maturity of investments of $590 million, partially offset with additions to property and equipment of $429 million. Net cash provided by investing activities for the year ended December 31, 2023 principally resulted from proceeds from the sale and maturity of investments of $1.8 billion, partially offset with additions to property and equipment of $345 million. \nNet cash used in financing activities for the year ended December 31, 2024 resulted mainly from payments for the repurchase of common stock of $6.5 billion, payments on the maturity and conversion of debt of $1.3 billion, and dividends of $1.2 billion, partially offset with proceeds from the issuance of long-term debt of $4.8 billion. Net cash used in financing activities for the year ended December 31, 2023 principally resulted from payments for the repurchase of common stock of $10.4 billion and payment on the maturity of debt of $500 million, partially offset with proceeds from the issuance of long-term debt of $1.9 billion. \nYear Ended December 31, 2023 compared to Year Ended December 31, 2022\n    For a comparison of our cash flow activities for the fiscal years ended December 31, 2023 and 2022, see Cash Flow Analysis in Part II, Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations, of our Annual Report on Form 10-K for the fiscal year ended December 31, 2023, filed with the SEC on February 22, 2024.\nItem 7A.  Quantitative and Qualitative Disclosures About Market Risk\n \nWe have exposure to several types of market risk, including changes in interest rates, foreign currency exchange rates, and equity prices.\nWe manage our exposure to interest rate risk and foreign currency risk through internally established policies and procedures and, when deemed appropriate, through the use of derivative financial instruments. We use foreign currency exchange derivative contracts to manage short-term foreign currency risk.\n41\nThe objective of our policies is to mitigate potential income statement, cash flow, and fair value exposures resulting from possible future adverse fluctuations in rates. We evaluate our exposure to market risk by assessing the anticipated near-term and long-term fluctuations in interest rates and foreign currency exchange rates. This evaluation includes the review of leading market indicators, discussions with financial analysts and investment bankers regarding current and future economic conditions, and the review of market projections as to expected future rates. We utilize this information to determine our own investment strategies as well as to determine if the use of derivative financial instruments is appropriate to mitigate any potential future market exposure that we may face. Our policy does not allow speculation in derivative instruments for profit or, except in certain limited situations, execution of derivative instrument contracts for which there are no underlying exposures. We do not use financial instruments for trading purposes and are not a party to any leveraged derivatives. To the extent that changes in interest rates and foreign currency exchange rates affect general economic conditions, we would also be affected by such changes.\nSee Note 12 to our Consolidated Financial Statements for information about our convertible senior notes due in May 2025 (\"May 2025 Notes\") and other debt. Excluding the effect on the fair value of our convertible senior notes, a hypothetical 100 basis point (1.0%) decrease in interest rates would have resulted in an increase in the estimated fair value of our nonconvertible debt of approximately $930 million and $612 million at December 31, 2024 and 2023, respectively. Our convertible senior notes are more sensitive to the equity market price volatility of our shares than changes in interest rates. The fair value of the convertible senior notes will likely increase as the market price of our shares increases and will likely decrease as the market price of our shares falls. The May 2025 Notes are currently convertible at the option of the holder. As of November 1, 2024, at maturity, the note holders are entitled to repayment of the principal amount of the May 2025 Notes in cash, and if they exercise their option to convert, they are entitled to cash payment for the conversion premium, which is the conversion value in excess of the principal amount. During the year ended December 31, 2024, we paid $198 million in aggregate upon the conversion of the May 2025 Notes at the note holders' option.\nWe face exposure to movements in foreign currency exchange rates as the financial results and the financial condition of our businesses outside of the U.S., which represent a substantial majority of our financial results, are translated from local currencies (principally Euros and British Pounds Sterling) into U.S. Dollars. For example, our total gross bookings increased by 10% in 2024 as compared to 2023, but without the impact of changes in foreign currency exchange rates our total gross bookings increased year-over-year on a constant-currency basis by approximately 11%. Our total revenues increased by 11% in 2024 as compared to 2023, but without the impact of changes in foreign currency exchange rates, our total revenues increased year-over-year on a constant-currency basis by approximately 12%. See Notes 6, 12, and 18 to our Consolidated Financial Statements and Part II, Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations for additional information about foreign currency transaction gains and losses, changes in foreign currency exchange rates, the impact of such changes on the increase in our revenues and operating margins, our use of foreign currency exchange derivatives, and our designation of certain portions of our Euro-denominated debt as a hedge of the foreign currency exposure of the net investment in certain Euro functional currency subsidiaries. We generally enter into foreign currency exchange derivatives to hedge our exposure to the impact of movements in foreign currency exchange rates on our transactional balances denominated in currencies other than the functional currency. We will continue to evaluate the use of derivative instruments in the future. We also designate certain portions of the aggregate principal value of our Euro-denominated debt as a hedge of the foreign currency exposure of the net investment in certain Euro functional currency subsidiaries. Foreign currency transaction gains or losses are dependent on the amount of net assets of the Euro functional currency subsidiaries, the amount of the Euro-denominated debt that is designated as a hedge, and fluctuations in foreign currency exchange rates. \nSee Notes 5 and 6 to our Consolidated Financial Statements for information about our investments in equity securities of publicly-traded companies and private entities. We are exposed to equity price risk as it relates to changes in fair values of these investments. Our investments in private entities are measured at cost less impairment, if any. Such investments are also required to be measured at fair value as of the date of certain observable transactions for the identical or a similar investment of the same issuer. A hypothetical 10% decrease in the fair values at December 31, 2024 and 2023 of our investments in equity securities of publicly-traded companies and private entities would have resulted in a loss, before tax, of approximately $55 million and $45 million, respectively, being recognized in net income.\nItem 8.  Financial Statements and Supplementary Data\n \nThe following Consolidated Financial Statements of the Company and the report of our independent registered public accounting firm are filed as part of this Annual Report on Form 10-K (See Part IV, Item 15, Exhibits and Financial Statement Schedules): Consolidated Balance Sheets at December 31, 2024 and 2023; Consolidated Statements of Operations, Consolidated Statements of Comprehensive Income, Consolidated Statements of Changes in Stockholders' (Deficit) Equity, and Consolidated Statements of Cash Flows for the years ended December 31, 2024, 2023, and 2022; Notes to our Consolidated Financial Statements; and Report of Independent Registered Public Accounting Firm.\nItem 9.  Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\n \nNone.\nItem 9A.  Controls and Procedures\n \n42\nDisclosure Controls and Procedures\n. Under the supervision and with the participation of our management, including our principal executive officer and our principal financial officer, we conducted an evaluation of our disclosure controls and procedures, as defined under Exchange Act Rule 13a-15(e). Based on this evaluation, our principal executive officer and our principal financial officer concluded that our disclosure controls and procedures were effective as of the end of the period covered by this Annual Report on Form 10-K. \nManagement's Report on Internal Control Over Financial Reporting. \nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as defined in Exchange Act Rule 13a-15(f). Under the supervision and with the participation of our management, including our principal executive officer and principal financial officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework in the \nInternal Control - Integrated Framework (2013) \nissued by the Committee of Sponsoring Organizations of the Treadway Commission. \nBased on our evaluation, our management concluded that our internal control over financial reporting was effective as of \nDecember 31, 2024\n. Our independent registered public accounting firm also attested to and reported on the effectiveness of internal control over financial reporting.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions or that the degree of compliance with the policies or procedures may deteriorate.\nChanges in Internal Controls. \nWe continue to monitor changes related to the ongoing implementation of the integration and upgrade of financial systems and processes to determine the impact on internal control over financial reporting (as such term is defined in Exchange Act Rule 13a-15(f)). No change in our internal control over financial reporting occurred during the three months ended December 31, 2024 that materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.\n43\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\n \nTo the Board of Directors and Stockholders of Booking Holdings Inc.\n \nOpinion on Internal Control over Financial Reporting\nWe have audited the internal control over financial reporting of Booking Holdings Inc. and subsidiaries (the \"Company\") as of \nDecember 31, 2024\n, based on criteria established in \nInternal Control - Integrated Framework (2013) \nissued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of \nDecember 31, 2024\n, based on criteria established in\n Internal Control - Integrated Framework (2013) \nissued by COSO.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated financial statements as of and for the year ended \nDecember 31, 2024\n, of the Company and our report dated February 20, 2025, expressed an unqualified opinion on those financial statements. \nBasis for Opinion \nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying \"Management's Report on Internal Control Over Financial Reporting\". Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control over Financial Reporting \nA company's internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company's internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements. \nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. \n/s/\n DELOITTE & TOUCHE LLP \nStamford, Connecticut\nFebruary 20, 2025 \n44\nItem 9B. Other Information\n \nDisclosure pursuant to Section 219 of the Iran Threat Reduction and Syria Human Rights Act of 2012 and 13(r) of the Exchange Act\nAs previously reported in the Quarterly Report on Form 10-Q filed with the SEC on August 1, 2024, the following activities are disclosed as required by Section 219 of the Iran Threat Reduction and Syria Human Rights Act of 2012 and Section 13(r) of the Securities Exchange Act of 1934, as amended. The Company has determined that a limited number of bookings were made through Agoda at accommodations in Iran that were ultimately owned or controlled by the Government of Iran and covered by the travel exemption in applicable U.S. sanctions regulations, as well as one booking at a property that may be owned by a party blocked pursuant to Executive Order No. 13224, for which the travel exemption is not available (the Company has notified, and intends to cooperate with, relevant authorities regarding this booking). The bookings resulted in gross revenues of approximately $1,000 and no net profit. Agoda does not intend to continue these activities or transactions.\nRule 10b5-1 Trading Plans\n \nOn \nDecember 9, 2024\n, \nGlenn D. Fogel\n, \nDirector, Chief Executive Officer, and President\n, \nadopted\n a trading plan intended to satisfy the affirmative defense of Rule 10b5-1(c) to sell a designated percentage of the net number of the shares resulting from the vesting of his Performance Share Units and Restricted Stock Units. The trading plan will be effective on May 15, 2025 and end on \nApril 15, 2026\n.\nOn \nNovember 26, 2024\n, \nPeter J. Millones\n, \nExecutive Vice President and General Counsel\n, \nadopted\n a trading plan intended to satisfy the affirmative defense of Rule 10b5-1(c) for the sale of up to \n6,502\n shares of the Company's common stock with sales starting on May 26, 2026 and ending on \nMay 31, 2027\n.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\n \nNone.\nPART III\n \nItem 10. Directors, Executive Officers and Corporate Governance\n \nInformation required by Part III, Item 10 will be included in our Proxy Statement relating to our 2025 annual meeting of stockholders to be filed with the Securities and Exchange Commission within 120 days after the end of our fiscal year ended December 31, 2024, and is incorporated herein by reference.\nThe Company has \nadopted an insider trading policy\n which governs transactions in our securities by the Company's directors, officers, employees, contractors, and consultants, as well as by the Company itself. The Company believes that its insider trading policy is reasonably designed to promote compliance with insider trading laws, rules and regulations, and listing standards applicable to the Company. A copy of the Company's insider trading policy is filed with this Annual Report on Form 10-K as Exhibit 19.1.\n \nItem 11. Executive Compensation\n \nInformation required by Part III, Item 11 will be included in our Proxy Statement relating to our 2025 annual meeting of stockholders to be filed with the Securities and Exchange Commission within 120 days after the end of our fiscal year ended December 31, 2024, and is incorporated herein by reference.\n \nItem 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\n \nInformation required by Part III, Item 12 will be included in our Proxy Statement relating to our 2025 annual meeting of stockholders to be filed with the Securities and Exchange Commission within 120 days after the end of our fiscal year ended December 31, 2024, and is incorporated herein by reference.\n \nItem 13. Certain Relationships and Related Transactions, and Director Independence\n \nInformation required by Part III, Item 13 will be included in our Proxy Statement relating to our 2025 annual meeting of stockholders to be filed with the Securities and Exchange Commission within 120 days after the end of our fiscal year ended December 31, 2024, and is incorporated herein by reference.\n \nItem 14. Principal Accountant Fees and Services\n \n45\nInformation required by Part III, Item 14 will be included in our Proxy Statement relating to our 2025 annual meeting of stockholders to be filed with the Securities and Exchange Commission within 120 days after the end of our fiscal year ended December 31, 2024, and is incorporated herein by reference.\nPART IV\n \nItem 15. Exhibits and Financial Statement Schedules.\n \n(a)     List of Documents Filed as a Part of this Annual Report on Form 10-K:\n \nThe following Consolidated Financial Statements of the Company and the report of our independent registered public accounting firm are filed as part of this Annual Report on Form 10-K: Consolidated Balance Sheets at December 31, 2024 and 2023; Consolidated Statements of Operations, Consolidated Statements of Comprehensive Income, Consolidated Statements of Changes in Stockholders' (Deficit) Equity, and Consolidated Statements of Cash Flows for the years ended December 31, 2024, 2023, and 2022; Notes to our Consolidated Financial Statements; Report of Independent Registered Public Accounting Firm; and Schedule I - Condensed Financial Information of Parent (Booking Holdings Inc.).\n \nOther financial statement schedules have been omitted because they are not applicable, not material or the required information is shown in the Consolidated Financial Statements or the notes thereto.\n \n(b)    Exhibits\nIn reviewing the agreements included as exhibits to this Annual Report on Form 10-K, please remember they are included to provide you with information regarding their terms and are not intended to provide any other factual or disclosure information about the Company or the other parties to the agreements. Some agreements contain representations and warranties by each of the parties to the applicable agreement. These representations and warranties have been made solely for the benefit of the other parties to the applicable agreement and:\n•\nshould not be treated as categorical statements of fact, but rather as a way of allocating the risk to one of the parties if those statements prove to be inaccurate;\n•\nmay have been qualified by disclosures that were made to the other party in connection with the negotiation of the applicable agreement, which\n \ndisclosures\n \nare\n \nnot necessarily reflected in the agreement;\n•\nmay apply standards of materiality in a way that is different from what may be viewed as material to you or other investors; and\n•\nwere made only as of the date of the applicable agreement or such other date or dates as may be specified in the agreement and are subject to more recent developments.\nAccordingly, these representations and warranties may not describe the actual state of affairs as of the date they were made or at any other time. Additional information about the Company may be found elsewhere in this Annual Report on Form 10‑K and the Company's other public filings, which are available without charge through the SEC's website at http://www.sec.gov.\nExhibit Number\nDescription\n3.1\n(a)\nRestated Certificate of Incorporation of the Company.\n3.2\n(b)\nCertificate of Amendment of the Restated Certificate of Incorporation, dated as of June 4, 2021.\n3.3\n(b)\nAmended and Restated By-Laws of Booking Holdings Inc., dated as of June 4, 2021.\n4.1\nReference is hereby made to Exhibits 3.1, 3.2, and 3.3.\n4.2\n(c)\nSpecimen Certificate for the Company's Common Stock.\n4.3\n(d)\nIndenture, dated as of September 23, 2014, between the Company and Deutsche Bank Trust Company Americas, as Trustee. \n4.4\n(e)\nIndenture, dated as of August 8, 2017, between the Company and U.S. Bank National Association, as trustee.\n4.5\n(f)\nForm of 1.800% Senior Note due 2027.\n4.6\n(g)\nOfficers' Certificate, dated March 3, 2015, for the 1.800% Senior Notes due 2027.\n4.7\n(h)\nForm of 3.650% Senior Note due 2025.\n4.8\n(i)\nOfficers' Certificate, dated March 13, 2015, for the 3.650% Senior Notes due 2025.\n4.9\n(j)\nForm of 3.600% Senior Note due 2026.\n4.10\n(j)\nOfficers' Certificate, dated May 23, 2016, for the 3.600% Senior Notes due 2026.\n4.11\n(k)\nForm of 3.550% Senior Note due 2028.\n4.12\n(k)\nOfficers' Certificate, dated August 15, 2017, with respect to the 3.550% Senior Notes due 2028.\n46\nExhibit Number\nDescription\n4.13\n(z)\nDescription of the Company's Common Stock Registered Pursuant to Section 12 of the Securities Exchange Act of 1934.\n4.14\n(z)\nDescription of the Company's 2.375% Senior Notes due 2024 Registered Pursuant to Section 12 of the Securities Exchange Act of 1934.\n4.15\n(z)\nDescription of the Company's 1.800% Senior Notes due 2027 Registered Pursuant to Section 12 of the Securities Exchange Act of 1934.\n4.16\n(ee)\nDescription of the Company's 0.100% Senior Notes due 2025 Registered Pursuant to Section 12 of the Securities Exchange Act of 1934.\n4.17\n(ee)\nDescription of the Company's 0.500% Senior Notes due 2028 Registered Pursuant to Section 12 of the Securities Exchange Act of 1934.\n4.18\n(x)\nForm of 4.625% Senior Note due 2030.\n4.19\n(x)\nOfficers' Certificate, dated April 13, 2020, with respect to the 4.625% Senior Notes due 2030.\n4.20\n(x)\nForm of 0.750% Convertible Senior Note due 2025.\n4.21\n(x)\nIndenture, dated as of April 14, 2020, between Booking Holdings Inc. and U.S. Bank National Association, as trustee.\n4.22\n(l)\nForm of 0.100% Senior Note due 2025.\n4.23\n(l)\nOfficers' Certificate, dated March 8, 2021, with respect to the 0.100% Senior Notes due 2025.\n4.24\n(l)\nForm of 0.500% Senior Note due 2028.\n4.25\n(l)\nOfficers' Certificate, dated March 8, 2021, with respect to the 0.500% Senior Notes due 2028.\n4.26\n(ff)\nForm of 4.000% Senior Note due 2026.\n4.27\n(ff)\nOfficers' Certificate, dated November 15, 2022, with respect to the 4.000% Senior Notes due 2026.\n4.28\n(ff)\nForm of 4.250% Senior Note due 2029.\n4.29\n(ff)\nOfficers' Certificate, dated November 15, 2022, with respect to the 4.250% Senior Notes due 2029.\n4.30\n(ff)\nForm of 4.500% Senior Note due 2031.\n4.31\n(ff)\nOfficers' Certificate, dated November 15, 2022, with respect to the 4.500% Senior Notes due 2031.\n4.32\n(ff)\nForm of 4.750% Senior Note due 2034.\n4.33\n(ff)\nOfficers' Certificate, dated November 15, 2022, with respect to the 4.750% Senior Notes due 2034.\n4.34\n(ii)\nDescription of the Company's 4.000% Senior Notes due 2026 Registered Pursuant to Section 12 of the Securities Exchange Act of 1934.\n4.35\n(ii)\nDescription of the Company's 4.250% Senior Notes due 2029 Registered Pursuant to Section 12 of the Securities Exchange Act of 1934.\n4.36\n(ii)\nDescription of the Company's 4.500% Senior Notes due 2031 Registered Pursuant to Section 12 of the Securities Exchange Act of 1934.\n4.37\n(ii)\nDescription of the Company's 4.750% Senior Notes due 2034 Registered Pursuant to Section 12 of the Securities Exchange Act of 1934.\n4.38\n(jj)\nForm of 3.625% Senior Note due 2028.\n4.39\n(jj)\nOfficers' Certificate, dated May 12, 2023, with respect to the 3.625% Senior Notes due 2028.\n4.40\n(jj)\nForm of 4.125% Senior Note due 2033.\n4.41\n(jj)\nOfficers' Certificate, dated May 12, 2023, with respect to the 4.125% Senior Notes due 2033.\n4.42\n(jj)\nAgency Agreement, dated as of May 12, 2023, by and between Booking Holdings Inc., as issuer, Elavon Financial Services DAC, UK Branch, as paying agent, and U.S. Bank Trust Company, National Association, as transfer agent, registrar, and trustee.\n4.43\n(rr)\nDescription of the Company's 3.625% Senior Notes due 2028 Registered Pursuant to Section 12 of the Securities Exchange Act of 1934.\n4.44\n(rr)\nDescription of the Company's 4.125% Senior Notes due 2033 Registered Pursuant to Section 12 of the Securities Exchange Act of 1934.\n4.45\n(ss)\nForm of 3.500% Senior Note due 2029.\n4.46\n(ss)\nOfficers' Certificate, dated March 1, 2024, with respect to the 3.500% Senior Notes due 2029.\n4.47\n(ss)\nForm of 3.625% Senior Note due 2032.\n4.48\n(ss)\nOfficers' Certificate, dated March 1, 2024, with respect to the 3.625% Senior Notes due 2032.\n4.49\n(ss)\nForm of 3.750% Senior Note due 2036.\n4.50\n(ss)\nOfficers' Certificate, dated March 1, 2024, with respect to the 3.750% Senior Notes due 2036.\n4.51\n(ss)\nForm of 4.000% Senior Note due 2044.\n4.52\n(ss)\nOfficers' Certificate, dated March 1, 2024, with respect to the 4.000% Senior Notes due 2044.\n47\nExhibit Number\nDescription\n4.53\n(ss)\nAgency Agreement, dated as of March 1, 2024, by and between Booking Holdings Inc., as issuer, Elavon Financial Services DAC, UK Branch, as paying agent, and U.S. Bank Trust Company, National Association, as transfer agent, registrar, and trustee.\n4.54\n(tt)\nForm of 3.250% Senior Notes due 2032.\n4.55\n(tt)\nOfficers' Certificate, dated November 21, 2024, with respect to the 3.250% Senior Notes due 2032.\n4.56\n(tt)\nForm of 3.750% Senior Notes due 2037.\n4.57\n(tt)\nOfficers' Certificate, dated November 21, 2024, with respect to the 3.750% Senior Notes due 2037.\n4.58\n(tt)\nForm of 3.875% Senior Notes due 2045.\n4.59\n(tt)\nOfficers' Certificate, dated November 21, 2024, with respect to the 3.875% Senior Notes due 2045.\n4.60\n(tt)\nAgency Agreement, dated as of November 21, 2024, by and between Booking Holdings Inc., as issuer, and U.S. Bank Trust Company, National Association, as paying agent, transfer agent, registrar, and trustee.\n4.61\nDescription of the Company's 3.500% Senior Notes due 2029 Registered Pursuant to Section 12 of the\nSecurities Exchange Act of 1934.\n4.62\nDescription of the Company's 3.625% Senior Notes due 2032 Registered Pursuant to Section 12 of the\nSecurities Exchange Act of 1934.\n4.63\nDescription of the Company's 3.750% Senior Notes due 2036 Registered Pursuant to Section 12 of the\nSecurities Exchange Act of 1934.\n4.64\nDescription of the Company's 4.000% Senior Notes due 2044 Registered Pursuant to Section 12 of the\nSecurities Exchange Act of 1934.\n4.65\nDescription of the Company's 3.250% Senior Notes due 2032 Registered Pursuant to Section 12 of the\nSecurities Exchange Act of 1934.\n4.66\nDescription of the Company's 3.750% Senior Notes due 2037 Registered Pursuant to Section 12 of the\nSecurities Exchange Act of 1934.\n4.67\nDescription of the Company's 3.875% Senior Notes due 2045 Registered Pursuant to Section 12 of the\nSecurities Exchange Act of 1934.\n10.1\n(b)+\nBooking Holdings Inc. 1999 Omnibus Plan (as amended and restated effective June 3, 2021).\n10.2\n(m)+\nForm of Restricted Stock Unit Agreement for awards under the 1999 Omnibus Plan to non-employee directors.\n10.3\n(aa)+\nForm of Restricted Stock Unit Agreement for awards under the 1999 Omnibus Plan.\n10.4\n(bb)+\nForm of Performance Share Unit Agreement under the Company's 1999 Omnibus Plan.\n10.5\n(n)+\nAmended and Restated KAYAK Software Corporation 2012 Equity Incentive Plan.\n10.6\n(n)+\nOpenTable, Inc. Amended and Restated 2009 Equity Incentive Award Plan.\n10.7\n(o)+\nBuuteeq, Inc. Amended and Restated 2010 Stock Plan.\n10.8\n(p)+\nAmended and Restated Rocket Travel, Inc. 2012 Stock Incentive Plan.\n10.9\n(p)+\nAmended and Restated Annual Bonus Plan.\n10.10\n(q)+\nForm of Non-Competition and Non-Solicitation Agreement.\n10.11\n(r)+\nSecond Amended and Restated Employment Agreement, dated April 21, 2015, by and between the Company and Peter J. Millones.\n10.12\n(s)+\nEmployment Agreement, dated December 15, 2016, by and between the Company and Glenn D. Fogel.\n10.13\n(s)+\nNon-Competition and Non-Solicitation Agreement, dated December 15, 2016, by and between the Company and Glenn D. Fogel. \n10.1\n4\n(s)+\nEmployee Confidentiality and Assignment Agreement, dated December 15, 2016, by and between the Company and Glenn D. Fogel.\n10.15\n(t)+\nEmployment Agreement, dated January 19, 2018, between the Company and David I. Goulden.\n10.16\n(t)+\nNon-Competition and Non-Solicitation Agreement, dated March 1, 2018, between the Company and David I. Goulden.\n10.17\n(t)+\nEmployee Confidentiality and Assignment Agreement, dated January 19, 2018, between the Company and David I. Goulden.\n10.18\n(u)\nCredit Agreement, dated as of August 14, 2019, among the Company, the lenders from time to time party thereto, and JPMorgan Chase Bank, N.A., as Administrative Agent.\n10.19\n(gg)+\nLetter Agreement, dated October 24, 2019, by and between the Company and Glenn D. Fogel.\n48\nExhibit Number\nDescription\n10.20\n(v)+\nForm of Employee Confidentiality and Assignment Agreement.\n10.21\n(w)\nAmendment No. 1, dated as of April 7, 2020, to the Credit Agreement, dated as of August 14, 2019, by and among the Company, the lenders from time to time party thereto, and JPMorgan Chase Bank, N.A., as administrative agent.\n10.22\n(y)\nAmendment No. 2, dated as of October 28, 2020, to the Credit Agreement, dated as of August 14, 2019, by and among the Company, the lenders from time to time party thereto, and JPMorgan Chase Bank, N.A., as administrative agent.\n10.23\n(cc)+\nLetter Amendment to 2018 PSU Award and 2019 PSU Award Agreements with Glenn D. Fogel dated January 28, 2021.\n10.24\n(cc)+\nLetter Amendment to 2018 PSU Award and 2019 PSU Award Agreements with David I. Goulden dated January 28, 2021.\n10.25\n(cc)+\nLetter Amendment to 2018 PSU Award and 2019 PSU Award Agreements with Peter J. Millones dated January 28, 2021.\n10.26\n(dd)+\nLetter Agreement, dated July 31, 2021, by and between the Company and Paulo Pisano.\n10.27\n(ee)\nAmendment No. 3, dated as of December 22, 2021, to the Credit Agreement, dated as of August 14, 2019, by and among the Company, the lenders from time to time party thereto, and JPMorgan Chase Bank, N.A., as administrative agent.\n10.28\n(hh)\nAgreement for the Sale and Purchase of the Booking Campus in Amsterdam, the Netherlands, dated as of December 14, 2022, by and among Booking.com Real Estate Amsterdam B.V., as the Seller, D-IE WIIS Oosterdok Coöperatief U.A., as the Purchaser, and Booking.com Holding B.V., as the Guarantor.\n10.29\n(kk)\nAmendment No. 4, dated as of January 6, 2023, to the Credit Agreement, dated as of August 14, 2019, by and among the Company, the lenders from time to time party thereto, and JPMorgan Chase Bank, N.A., as administrative agent.\n10.30\n(ll)+\nForm of Performance Share Unit Agreement under the Company's 1999 Omnibus Plan.\n10.31\n(ll)+\nForm of Restricted Stock Unit Agreement under the Company's 1999 Omnibus Plan.\n10.32\n(ll)+\nLetter Agreement, dated February 23, 2023, by and between the Company and David I. Goulden.\n10.33\n(mm)*\nCredit Agreement, dated as of May 17, 2023, among the Company, the lenders from time to time party thereto, and JPMorgan Chase Bank, N.A. as Administrative Agent.\n10.34\n(nn)+\nEmployment Agreement, dated December 4, 2019, by and between Booking.com International BV and Paulo Pisano.\n10.35\n(oo)+\nDescription of Termination Pay Policy, effective as of April 5, 2023.\n10.36\n(pp)+\nEmployment Agreement, dated December 1, 2023, by and between the Company and Ewout Steenbergen.\n10.37\n(pp)+\nForm of Restricted Stock Unit Agreement under the Company's 1999 Omnibus Plan.\n10.38\n(pp)+\nNon-Competition and Non-Solicitation Agreement, dated December 1, 2023, by and between the Company and Ewout L. Steenbergen.\n10.39\n(pp)+\nEmployee Confidentiality and Assignment Agreement, dated December 4, 2023, by and between the Company and Ewout L. Steenbergen.\n10.40\n(uu)+\nLetter Agreement Amendment, dated January 18, 2024 by and between the Company and David I. Goulden.\n10.41\n(vv)+\nLetter Agreement Amendment, dated April 4, 2024 by and between the Company and David I. Goulden.\n10.42\n(ww)+\nAdditional Letter Agreement, dated December 18, 2024, by and between the Company and David I. Goulden.\n19.1\nBooking Holdings Inc. Insider Trading Policies and Procedures\n21.1\nList of Subsidiaries.\n23.1\nConsent of Deloitte & Touche LLP.\n24.1\nPower of Attorney (included in the Signature Page).\n31.1\nCertification of Glenn D. Fogel, pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2\nCertification of Ewout L. Steenbergen, pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1\n(qq)*\nCertification of Glenn D. Fogel, pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 (Subsections (a) and (b) of Section 1350, Chapter 63 of Title 18, United States Code).\n32.2\n(qq)*\nCertification of Ewout L. Steenbergen, pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 (Subsections (a) and (b) of Section 1350, Chapter 63 of Title 18, United States Code).\n97.1\n(rr)\nBooking Holdings Inc. Financial Restatement Recovery Policy.\n49\nExhibit Number\nDescription\n101.INS\nXBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the inline XBRL document.\n104\nCover Page Interactive Data File - the cover page from this Annual Report on Form 10-K for the year ended December 31, 2024, formatted in Inline XBRL (included in Exhibit 101).\n____________________________\n+    Indicates a management contract or compensatory plan or arrangement.\n*    Schedules or similar attachments have been omitted pursuant to Item 601(a)(5) of Regulation S-K. The Company hereby undertakes to furnish copies of any of the omitted schedules or similar attachments upon request by the Securities and Exchange Commission.\n(a)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on February 21, 2018 (File No. 1-36691).\n(b)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on June 4, 2021 (File No. 1-36691).\n(c)\nPreviously filed as an exhibit to Amendment No. 2 to Registration Statement on Form S-1 filed on March 18, 1999 (File No. 333-69657).\n(d)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on November 25, 2015 (File No. 1-36691).\n(e)\nPreviously filed as an exhibit to the Registration Statement on Form S-3 filed on August 8, 2017 (File No. 333-219800).\n(f)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on March 2, 2015 (File No. 1-36691).\n(g)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on March 4, 2015 (File No. 1-36691).\n(h)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on March 12, 2015 (File No. 1-36691).\n(i)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on March 13, 2015 (File No. 1-36691).\n(j)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on May 23, 2016 (File No. 1-36691).\n(k)\nPreviously filed as an exhibit to our Current Report on Form 8-K filed on August 15, 2017 (File No. 1-36691).\n(l)\nPreviously filed as an exhibit to our Current Report on Form 8-K filed on March 8, 2021 (File No. 1-36691).\n(m)\nPreviously filed as an exhibit to the Current Report on Form 8‑K filed on March 9, 2011 (File No. 0-25581).\n(n)\nPreviously filed as an exhibit to the Current Report on Form 8‑K filed on March 3, 2017 (File No. 1-36691).\n(o)\nPreviously filed as an exhibit to the Registration Statement on Form S-8 filed on June 13, 2014 (File No. 333-196756).\n(p)\nPreviously filed as an exhibit to the Annual Report on Form 10-K filed for the year ended December 31, 2015 (File No. 1-36691). \n(q)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on March 4, 2013 (File No. 0-25581).\n(r)\nPreviously filed as an exhibit to our Current Report on Form 8-K filed on April 24, 2015 (File No. 1-36691).\n(s)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on December 16, 2016 (File No. 1-36691). \n(t)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on January 22, 2018 (File No. 1-36691).\n(u)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on August 14, 2019 (File No. 1-36691).\n(v)\nPreviously filed as an exhibit to the Quarterly Report on Form 10-Q filed on May 9, 2019 (File No. 1-36691).\n(w)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on April 8, 2020 (File No. 1-36691).\n(x)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on April 14, 2020 (File No. 1-36691).\n(y)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on October 30, 2020 (File No. 1-36691).\n(z)\nPreviously filed as an exhibit to the Annual Report on Form 10-K filed on February 26, 2020 (File No. 1-36691).\n(aa)\nPreviously filed as an exhibit to the Quarterly Report on Form 10-Q filed on May 7, 2020 (File No. 1-36691)\n(bb)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on July 17, 2020 (File No. 1-36691)\n(cc)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on January 29, 2021 (File No. 1-36691)\n(dd)\nPreviously filed as an exhibit to the Quarterly Report on Form 10-Q filed on November 3, 2021 (File No. 1-36691)\n(ee)\nPreviously filed as an exhibit to the Annual Report on Form 10-K filed on February 23, 2022 (File No. 1-36691).\n(ff)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on November 15, 2022 (File No. 1-36691).\n(gg)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on October 25, 2019 (File No. 1-36691).\n(hh)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on December 19, 2022 (File No. 1-36691).\n(ii)\nPreviously filed as an exhibit to the Annual Report on Form 10-K filed on February 23, 2023 (File No. 1-36691).\n(jj)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on May 12, 2023 (File No. 1-36691).\n(kk)\nPreviously filed as an exhibit to the Quarterly Report on Form 10-Q filed on May 4, 2023 (File No. 1-36691).\n50\n(ll)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on February 23, 2023 (File No. 1-36691).\n(mm)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on May 19, 2023 (File No. 1-36691).\n(nn)\nPreviously filed as an exhibit to the Quarterly Report on Form 10-Q filed on August 3, 2023 (File No. 1-36691).\n(oo)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on April 11, 2023 (File No. 1-36691).\n(pp)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on December 13, 2023 (File No. 1-36691).\n(qq)\nThis document is being furnished in accordance with SEC Release Nos. 33‑8212 and 34‑47551.\n(rr)\nPreviously filed as an exhibit to the Annual Report on Form 10-K filed on February 22, 2024 (File No. 1-36691).\n(ss)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on March 1, 2024 (File No. 1-36691).\n(tt)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on November 21, 2024 (File No. 1-36691).\n(uu)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on January 19, 2024 (File No. 1-36691).\n(vv)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on April 5, 2024 (File No. 1-36691).\n(ww)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on December 18, 2024 (File No. 1-36691)\n(xx)\nPreviously filed as an exhibit to the Current Report on Form 8-K filed on April 22, 2024 (File No. 1-36691).\nItem 16. Form 10-K Summary.\nNone.\n51\nSignatures\n \nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\n \n \nBOOKING HOLDINGS INC.\n \n \n \n \nBy:\n/s/ Glenn D. Fogel\n \n \nName:\nGlenn D. Fogel\n \n \nTitle:\nChief Executive Officer and President\n \n \nDate:\nFebruary 20, 2025\n \nPower of Attorney\n \nKNOW ALL PERSONS BY THESE PRESENTS, that each person whose signature appears below constitutes and appoints Glenn D. Fogel, Ewout L. Steenbergen, and Peter J. Millones, and each of them severally, his or her true and lawful attorney-in-fact with power of substitution and resubstitution to sign in his or her name, place and stead, in any and all capacities, to do any and all things and execute any and all instruments that such attorney may deem necessary or advisable under the Securities Exchange Act of 1934 and any rules, regulations and requirements of the Securities and Exchange Commission in connection with this Annual Report on Form 10-K and any and all amendments hereto, as fully and for all intents and purposes as he or she might do or could do in person, and hereby ratifies and confirms all said attorneys-in-fact and agents, each acting alone, and his or her substitute or substitutes, may lawfully do or cause to be done by virtue hereof.\n \n52\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\n \nSignature\nTitle\nDate\n \n \n/s/ Robert J. Mylod Jr.\nDirector, Chair of the Board \nFebruary 20, 2025\nRobert J. Mylod Jr.\n/s/ Glenn D. Fogel\nDirector, Chief Executive Officer and President\nFebruary 20, 2025\nGlenn D. Fogel\n \n \n/s/ Ewout L. Steenbergen\nExecutive Vice President and Chief Financial \nFebruary 20, 2025\nEwout L. Steenbergen\nOfficer (Principal Financial Officer)\n/s/ Susana D'Emic\nChief Accounting Officer and Controller \nFebruary 20, 2025\nSusana D'Emic\n(Principal Accounting Officer)\n/s/ Mirian Graddick-Weir\nDirector\n \nFebruary 20, 2025\nMirian Graddick-Weir\n \n \n \n \n/s/ Kelly Grier\nDirector\nFebruary 20, 2025\nKelly Grier\n/s/ Wei Hopeman\nDirector\nFebruary 20, 2025\nWei Hopeman\n \n/s/ Charles H. Noski\nDirector\n \nFebruary 20, 2025\nCharles H. Noski\n \n \n \n \n \n/s/ Larry Quinlan\nDirector\n \nFebruary 20, 2025\nLarry Quinlan\n \n \n/s/ Nicholas J. Read\nDirector\nFebruary 20, 2025\nNicholas J. Read\n/s/ Thomas E. Rothman\nDirector\nFebruary 20, 2025\nThomas E. Rothman\n/s/ Sumit Singh\nDirector\nFebruary 20, 2025\nSumit Singh\n/s/ Lynn Vojvodich Radakovich\nDirector\nFebruary 20, 2025\nLynn Vojvodich Radakovich\n/s/ Vanessa A. Wittman\nDirector\nFebruary 20, 2025\nVanessa A. Wittman\n    \n53\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\n \n \nPage No.\n \n \nReport of Independent Registered Public Accounting Firm (PCAOB ID: \n34\n)\n55\n \nConsolidated Balance Sheets at December 31, 2024 and 2023\n57\n \nConsolidated Statements of Operations for the years ended December 31, 2024, 2023, and 2022\n58\n \nConsolidated Statements of Comprehensive Income for the years ended December 31, 2024, 2023, and 2022\n59\nConsolidated Statements of Changes in Stockholders' (Deficit) Equity for the years ended December 31, 2024, 2023, and 2022\n60\n \nConsolidated Statements of Cash Flows for the years ended December 31, 2024, 2023, and 2022\n61\n \nNotes to Consolidated Financial Statements\n62\n54\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders of Booking Holdings Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Booking Holdings Inc. and subsidiaries (the \"Company\") as of \nDecember 31, 2024\n and 2023, the related consolidated statements of operations, comprehensive income, changes in stockholders' (deficit) equity, and cash flows for each of the three years in the period ended \nDecember 31, 2024\n, and the related notes and the schedule listed in the Index at Item 15 (collectively referred to as the \"financial statements\"). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of \nDecember 31, 2024\n and 2023, and the results of its operations and its cash flows, for each of the three years in the period ended \nDecember 31, 2024\n, in conformity with accounting principles generally accepted in the United States of America.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of \nDecember 31, 2024\n, based on criteria established in \nInternal Control - Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated February 20, 2025, expressed an unqualified opinion on the Company's internal control over financial reporting. \nBasis for Opinion \nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nRevenues\n \n-\n \nRefer to Notes 2 and 3 to the financial statements\nCritical Audit Matter Description\nSubstantially all of the Company’s revenues are generated by providing online travel reservation services, which principally allow travelers to book travel reservations with travel service providers through the Company’s platforms. Revenues consist of a significant volume of low-dollar transactions utilizing multiple custom systems.\nWe identified revenues as a critical audit matter as the majority of the processes to calculate and record revenue are highly automated, rely on a number of custom systems, and involve interfacing significant volumes of data across multiple systems. Given the complex information technology (IT) environment, this required the involvement of professionals with expertise in IT to identify, test, and evaluate the revenue data flows, the revenue systems and the automated controls.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to the Company's revenue transactions included the following, among others:\n•\nWith the assistance of our IT specialists, we:\n–\nIdentified the systems used to calculate and record revenue transactions.\n–\nTested the general IT controls over each of these systems, including testing of user access controls, change management controls, and IT operations controls.\n–\nPerformed testing of system interface controls and automated controls within the relevant revenue streams.\n55\n•\nWe tested business process controls to reconcile the various systems to the Company's general ledgers.\n•\nWe performed detail transaction testing by agreeing the amounts recognized to source documents and testing the mathematical accuracy of the recorded revenue.\n/s/ \nDELOITTE & TOUCHE LLP\nStamford, Connecticut\nFebruary 20, 2025 \nWe have served as the Company’s auditor since 1997.\n56\nBooking Holdings Inc.\nCONSOLIDATED BALANCE SHEETS\n(In millions, except share and per share data)\n \n \nDecember 31,\n \n2024\n2023\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n16,164\n \n$\n12,107\n \nShort-term investments (Available-for-sale debt securities:\nAmortized cost of $\n580\n at December 31, 2023)\n—\n \n576\n \nAccounts receivable, net (Allowance for expected credit losses of $\n146\n and $\n137\n, respectively)\n3,199\n \n3,253\n \nPrepaid expenses, net\n587\n \n644\n \nOther current assets\n541\n \n454\n \nTotal current assets\n20,491\n \n17,034\n \nProperty and equipment, net\n832\n \n784\n \nOperating lease assets\n559\n \n705\n \nIntangible assets, net\n1,382\n \n1,613\n \nGoodwill\n2,799\n \n2,826\n \nLong-term investments\n536\n \n440\n \nOther assets, net\n1,109\n \n940\n \nTotal assets\n$\n27,708\n \n$\n24,342\n \nLIABILITIES AND STOCKHOLDERS' DEFICIT\nCurrent liabilities:\nAccounts payable\n$\n3,824\n \n$\n3,374\n \nAccrued expenses and other current liabilities\n6,047\n \n4,741\n \nDeferred merchant bookings\n4,031\n \n3,254\n \nShort-term debt\n1,745\n \n1,961\n \nTotal current liabilities\n15,647\n \n13,330\n \nDeferred income taxes\n289\n \n258\n \nOperating lease liabilities\n483\n \n599\n \nLong-term U.S. transition tax liability\n257\n \n515\n \nOther long-term liabilities\n199\n \n161\n \nLong-term debt\n14,853\n \n12,223\n \nTotal liabilities\n31,728\n \n27,086\n \nCommitments and contingencies (see Note 16)\nStockholders' deficit:\nCommon stock, $\n0.008\n par value,\nAuthorized shares: \n1,000,000,000\n \nIssued shares: \n64,276,130\n and \n64,048,000\n, respectively\n—\n \n—\n \nTreasury stock: \n31,329,265\n and \n29,650,351\n shares, respectively\n(\n47,877\n)\n(\n41,426\n)\nAdditional paid-in capital\n7,707\n \n7,175\n \nRetained earnings\n36,525\n \n31,830\n \nAccumulated other comprehensive loss\n(\n375\n)\n(\n323\n)\nTotal stockholders' deficit\n(\n4,020\n)\n(\n2,744\n)\nTotal liabilities and stockholders' deficit\n$\n27,708\n \n$\n24,342\n \nSee Notes to Consolidated Financial Statements.\n57\nBooking Holdings Inc.\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(In millions, except share and per share data)\n \nYear Ended December 31,\n2024\n2023\n2022\nMerchant revenues\n$\n14,142\n \n$\n10,936\n \n$\n7,193\n \nAgency revenues\n8,524\n \n9,414\n \n9,003\n \nAdvertising and other revenues\n1,073\n \n1,015\n \n894\n \nTotal revenues\n23,739\n \n21,365\n \n17,090\n \nOperating expenses:\n \n \nMarketing expenses\n7,278\n \n6,773\n \n5,993\n \nSales and other expenses\n3,120\n \n2,744\n \n1,986\n \nPersonnel, including stock-based compensation of $\n599\n, $\n530\n, and $\n404\n, respectively\n3,354\n \n3,294\n \n2,465\n \nGeneral and administrative\n1,036\n \n1,555\n \n766\n \nInformation technology\n771\n \n655\n \n526\n \nDepreciation and amortization\n591\n \n504\n \n451\n \nTransformation costs\n34\n \n—\n \n—\n \nOther operating expenses\n—\n \n5\n \n(\n199\n)\nTotal operating expenses\n16,184\n \n15,530\n \n11,988\n \nOperating income\n7,555\n \n5,835\n \n5,102\n \nInterest expense\n(\n1,295\n)\n(\n897\n)\n(\n391\n)\nInterest and dividend income\n1,114\n \n1,020\n \n219\n \nOther income (expense), net\n(\n82\n)\n(\n477\n)\n(\n1,007\n)\nIncome before income taxes\n7,292\n \n5,481\n \n3,923\n \nIncome tax expense\n1,410\n \n1,192\n \n865\n \nNet income\n$\n5,882\n \n$\n4,289\n \n$\n3,058\n \nNet income applicable to common stockholders per basic common share\n$\n174.96\n \n$\n118.67\n \n$\n76.70\n \nWeighted-average number of basic common shares outstanding (in 000's)\n33,622\n \n36,140\n \n39,872\n \nNet income applicable to common stockholders per diluted common share\n$\n172.69\n \n$\n117.40\n \n$\n76.35\n \nWeighted-average number of diluted common shares outstanding (in 000's)\n34,064\n \n36,530\n \n40,052\n \n    \nSee Notes to Consolidated Financial Statements.\n58\nBooking Holdings Inc.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(In millions)\nYear Ended December 31,\n2024\n2023\n2022\nNet income\n$\n5,882\n \n$\n4,289\n \n$\n3,058\n \nOther comprehensive loss, net of tax \n(1)\n(\n52\n)\n(\n56\n)\n(\n123\n)\nComprehensive income\n$\n5,830\n \n$\n4,233\n \n$\n2,935\n \n(1)    \nPrimarily consists of foreign currency translation adjustments (see Note 14).\nSee Notes to Consolidated Financial Statements. \n59\nBooking Holdings Inc.\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS' (DEFICIT) EQUITY\nFOR THE YEARS ENDED DECEMBER 31, 2024, 2023, and 2022\n(In millions, except share data)\n \nCommon Stock\nTreasury Stock\nAdditional Paid-in Capital\nRetained Earnings\nAccumulated Other Comprehensive Loss\n Total\n \nShares  \n(in 000's)\nAmount\nShares \n(in 000's)\nAmount\nBalance, December 31, 2021\n63,584\n \n$\n—\n \n(\n22,518\n)\n$\n(\n24,290\n)\n$\n6,159\n \n$\n24,453\n \n$\n(\n144\n)\n$\n6,178\n \nCumulative effect of adoption of accounting standards update\n— \n— \n— \n— \n(\n96\n)\n30\n \n— \n(\n66\n)\nNet income\n— \n— \n— \n— \n— \n3,058\n \n— \n3,058\n \nOther comprehensive loss, net of tax\n— \n— \n— \n— \n— \n— \n(\n123\n)\n(\n123\n)\nExercise of stock options and vesting of restricted stock units and performance share units\n197\n \n— \n— \n— \n7\n \n— \n— \n7\n \nRepurchase of common stock\n— \n— \n(\n3,400\n)\n(\n6,693\n)\n— \n— \n— \n(\n6,693\n)\nStock-based compensation\n— \n— \n— \n— \n421\n \n— \n— \n421\n \nBalance, December 31, 2022\n63,781\n \n$\n—\n \n(\n25,918\n)\n$\n(\n30,983\n)\n$\n6,491\n \n$\n27,541\n \n$\n(\n267\n)\n$\n2,782\n \nNet income\n— \n— \n— \n— \n— \n4,289\n \n— \n4,289\n \nOther comprehensive loss, net of tax\n— \n— \n— \n— \n— \n— \n(\n56\n)\n(\n56\n)\nExercise of stock options and vesting of restricted stock units and performance share units\n267\n \n— \n— \n— \n134\n \n— \n— \n134\n \nRepurchase of common stock\n— \n— \n(\n3,732\n)\n(\n10,443\n)\n— \n— \n— \n(\n10,443\n)\nStock-based compensation\n— \n— \n— \n— \n550\n \n— \n— \n550\n \nBalance, December 31, 2023\n64,048\n \n$\n—\n \n(\n29,650\n)\n$\n(\n41,426\n)\n$\n7,175\n \n$\n31,830\n \n$\n(\n323\n)\n$\n(\n2,744\n)\nNet income\n— \n— \n— \n— \n— \n5,882\n \n— \n5,882\n \nOther comprehensive loss, net of tax\n— \n— \n— \n— \n— \n— \n(\n52\n)\n(\n52\n)\nConversion of debt\n— \n— \n— \n— \n(\n102\n)\n— \n— \n(\n102\n)\nExercise of stock options and vesting of restricted stock units and performance share units\n228\n \n— \n— \n— \n14\n \n— \n— \n14\n \nRepurchase of common stock\n— \n— \n(\n1,679\n)\n(\n6,451\n)\n— \n— \n— \n(\n6,451\n)\nDividends\n— \n— \n— \n— \n— \n(\n1,187\n)\n— \n(\n1,187\n)\nStock-based compensation\n— \n— \n— \n— \n620\n \n— \n— \n620\n \nBalance, December 31, 2024\n64,276\n \n$\n—\n \n(\n31,329\n)\n$\n(\n47,877\n)\n$\n7,707\n \n$\n36,525\n \n$\n(\n375\n)\n$\n(\n4,020\n)\n \nSee Notes to Consolidated Financial Statements.\n60\nBooking Holdings Inc.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(In millions)\n \nYear Ended December 31,\n \n2024\n2023\n2022\nOPERATING ACTIVITIES:\nNet income\n$\n5,882\n \n$\n4,289\n \n$\n3,058\n \nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization\n591\n \n504\n \n451\n \nProvision for expected credit losses and chargebacks\n412\n \n330\n \n232\n \nDeferred income tax expense (benefit)\n98\n \n(\n478\n)\n(\n257\n)\nNet (gains) losses on equity securities\n(\n63\n)\n131\n \n963\n \nStock-based compensation expense\n599\n \n530\n \n404\n \nOperating lease amortization\n160\n \n161\n \n156\n \nUnrealized foreign currency transaction (gains) losses related to Euro-denominated debt\n(\n526\n)\n163\n \n(\n46\n)\nLoss related to the conversion option on convertible senior notes\n796\n \n—\n \n—\n \nGain on sale and leaseback transaction\n—\n \n—\n \n(\n240\n)\nOther\n7\n \n5\n \n38\n \nChanges in assets and liabilities:\n \n \n \nAccounts receivable\n(\n506\n)\n(\n1,330\n)\n(\n1,228\n)\nPrepaid expenses and other current assets\n(\n12\n)\n155\n \n(\n217\n)\nDeferred merchant bookings and other current liabilities\n1,361\n \n2,742\n \n3,718\n \nOther\n(\n476\n)\n142\n \n(\n478\n)\nNet cash provided by operating activities\n8,323\n \n7,344\n \n6,554\n \nINVESTING ACTIVITIES:\nPurchase of investments\n(\n33\n)\n(\n12\n)\n(\n768\n)\nProceeds from sale and maturity of investments\n590\n \n1,840\n \n32\n \nAdditions to property and equipment\n(\n429\n)\n(\n345\n)\n(\n368\n)\nProceeds from sale and leaseback transaction\n—\n \n—\n \n601\n \nOther investing activities\n1\n \n3\n \n(\n15\n)\nNet cash provided by (used in) investing activities\n129\n \n1,486\n \n(\n518\n)\nFINANCING ACTIVITIES:\nProceeds from the issuance of long-term debt\n4,836\n \n1,893\n \n3,621\n \nPayments on maturity and conversion of debt\n(\n1,312\n)\n(\n500\n)\n(\n1,880\n)\nPayments for repurchase of common stock \n(\n6,509\n)\n(\n10,377\n)\n(\n6,621\n)\nDividends paid\n(\n1,174\n)\n—\n \n—\n \nProceeds from exercise of stock options\n14\n \n134\n \n7\n \nOther financing activities\n(\n59\n)\n(\n59\n)\n(\n24\n)\nNet cash used in financing activities\n(\n4,204\n)\n(\n8,909\n)\n(\n4,897\n)\nEffect of exchange rate changes on cash and cash equivalents and restricted cash and cash equivalents\n(\n190\n)\n(\n37\n)\n(\n40\n)\nNet increase (decrease) in cash and cash equivalents and restricted cash and cash equivalents\n4,058\n \n(\n116\n)\n1,099\n \nTotal cash and cash equivalents and restricted cash and cash equivalents, beginning of period \n12,135\n \n12,251\n \n11,152\n \nTotal cash and cash equivalents and restricted cash and cash equivalents, end of period \n$\n16,193\n \n$\n12,135\n \n$\n12,251\n \n    \nSee Notes to Consolidated Financial Statements.\n61\nBooking Holdings Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n \n1.    \nBUSINESS DESCRIPTION\n \nBooking Holdings Inc. (\"Booking Holdings\" or the \"Company\") seeks to make it easier for everyone to experience the world by providing consumers, travel service providers, and restaurants with leading travel and restaurant online reservation and related services. The Company offers its services through five primary consumer-facing brands: Booking.com, Priceline, Agoda, KAYAK, and OpenTable, which allow consumers to: book a broad array of accommodations (including hotels, motels, resorts, homes, apartments, bed and breakfasts, hostels, and other alternative and traditional accommodations properties) and a flight to their destinations; make a car rental reservation or arrange for an airport taxi; make a dinner reservation; or book a vacation package, tour, activity, or cruise. Consumers can also use the Company's meta-search services to easily compare travel reservation information, such as flight, hotel, and rental car reservations from hundreds of online travel platforms at once. In addition, the Company offers other services to consumers, travel service providers and restaurants, such as travel-related insurance products and restaurant management services\n.\n2.    \nSUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\n \nThe Company's Consolidated Financial Statements include the accounts of the Company and its wholly-owned subsidiaries, including acquired businesses from the dates of acquisition. All intercompany accounts and transactions have been eliminated in consolidation.\n \nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America (\"U.S. GAAP\") requires management to make estimates and assumptions that affect the amounts reported in the financial statements and footnotes thereto. Actual results may differ significantly from those estimates. The estimates underlying the Company's Consolidated Financial Statements relate to, among other things, the valuation of goodwill and other long-lived tangible and intangible assets, the valuation of investments in private entities, income taxes, contingencies, stock-based compensation, the allowance for expected credit losses (also referred to as provision for bad debts or provision for uncollectible accounts), chargeback provisions, and the accrual of obligations for consumer incentive programs.\nFair Value \nFair value is the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. \nThere are three levels of inputs to valuation techniques used to measure fair value:\nLevel 1:    Quoted prices in active markets that are accessible by the Company at the measurement date for identical assets and liabilities.\nLevel 2:    Inputs that are observable, either directly or indirectly. Such prices may be based upon quoted prices for identical or comparable securities in active markets or inputs not quoted on active markets, but corroborated by market data.\nLevel 3:    Unobservable inputs are used when little or no market data is available.\n \nCash and Cash Equivalents\nCash and cash equivalents consists primarily of cash and highly liquid investment grade securities with an original maturity of three months or less. See Note 19 for information related to restricted cash and cash equivalents.\nInvestments\nDebt Securities\nThe Company has classified its investments in debt securities as available-for-sale securities. The aggregate unrealized gains and losses on available-for-sale debt securities, net of tax, are included in \"Accumulated other comprehensive loss\" in the Consolidated Balance Sheets. If the amortized cost basis of an available-for-sale security exceeds its fair value and if the Company has the intention to sell the security or it is more likely than not that the Company will be required to sell the security before recovery of the amortized cost basis, an impairment is recognized in the Consolidated Statements of Operations. If the Company does not have the intention to sell the security and it is not more likely than not that the Company will be required to sell the security before recovery of the amortized cost basis and the Company determines that the decline in fair value below the amortized cost basis of an available-for-sale security is entirely or partially due to credit-related factors, the credit loss is measured and recognized as an allowance for expected credit losses along with the related expense in the Consolidated Statements of Operations. The allowance is measured as the amount by which the debt security's amortized cost basis exceeds the Company's best estimate of the present value of cash flows expected to be collected.\n62\nThe Company's investments in marketable debt securities are recognized based on the trade date. The cost of marketable debt securities sold is determined using a first-in and first-out method. The Company's investments in debt securities are assessed for classification in the Consolidated Balance Sheets as short-term or long-term at the individual security level. Classification as short-term or long-term is based on the maturities of the securities, as applicable, and the Company's expectations regarding the timing of sales and redemptions. \nEquity Securities\nEquity securities are reported as \"Long-term investments\" in the Consolidated Balance Sheets and include equity investments with readily determinable fair values and equity investments without readily determinable fair values. Equity investments with readily determinable fair values are reported at estimated fair value with changes in fair value recognized in \"Other income (expense), net\" in the Consolidated Statements of Operations. The Company holds investments in equity securities of private entities, over which the Company does not have the ability to exercise significant influence or control. These investments, which do not have readily determinable fair values, are measured at cost less impairment, if any. Such investments are also required to be measured at fair value as of the date of certain observable transactions for the identical or a similar investment of the same issuer.\nAccounts Receivable from Customers and Allowance for Expected Credit Losses \nAccounts receivable is reported net of expected credit losses. The Company estimates lifetime expected credit losses upon recognition of the financial assets. The Company identifies the relevant risk characteristics of its customers and the related receivables and prepayments, which include the following: size, type (alternative accommodations vs. hotels) or geographic location of the customer, or a combination of these characteristics. Receivables with similar risk characteristics have been grouped into pools. For each pool, the Company considers the historical credit loss experience, current economic conditions, supportable forecasts of future economic conditions, and any recoveries in assessing the lifetime expected credit losses. Other key factors that influence the expected credit loss analysis include customer demographics, payment terms offered in the normal course of business to customers, the nature of competition, and industry-specific factors that could impact the Company's receivables. Additionally, external data and macroeconomic conditions are considered. This is assessed at each balance sheet date based on the Company's specific facts and circumstances.\nProperty and Equipment, Net\nProperty and equipment are stated at cost less accumulated depreciation. Depreciation is computed on a straight-line basis over the estimated useful lives of the assets or, when applicable, the lease term related to leasehold improvements, whichever is shorter.\nWebsite Costs and Internal-use Software\nAcquisition costs and certain direct development costs associated with website and internal-use software are capitalized and include external direct costs of services and payroll costs for employees devoting time to the software projects principally related to platform development, including support systems, software coding, designing system interfaces, and installation and testing of the software. These costs are recorded as property and equipment and are generally amortized beginning when the asset is substantially ready for use. Costs incurred for enhancements that are expected to result in additional features or functionalities are capitalized and amortized over the estimated useful life of the enhancements. Costs incurred during the preliminary project stage, as well as maintenance and training costs, are expensed as incurred.\n \nCloud Computing Arrangements\nThe Company utilizes various third-party computer systems and third-party service providers, including global distribution systems and computerized central reservation systems of the accommodation, rental car, and airline industries in connection with providing some of its services. The Company uses both internally-developed systems and third-party systems to operate its services, including transaction processing, order management, and financial and accounting systems. Implementation costs incurred in a hosting arrangement that is a service contract are capitalized and amortized over the term of the hosting arrangement. The capitalized implementation costs are reported as \"Prepaid expenses, net\" or \"Other assets, net\" in the Company's Consolidated Balance Sheets, as appropriate. The related amortization expenses are reported in \"Information technology\" expenses in the Company's Consolidated Statements of Operations.\n \nLeases\nThe Company determines if an arrangement is a lease, or contains a lease, when a contract is signed. The Company determines if a lease is an operating or finance lease and records a lease asset and a lease liability upon lease commencement, which is the date when the underlying asset is made available for use by the lessor. The Company has operating leases for office space and data centers. For office space and data centers, the Company has elected to combine the fixed payments to lease the asset and any fixed non-lease payments (such as maintenance or utility charges) when determining its lease payments. The Company's finance leases are mainly for computer equipment.\n63\nThe Company uses its incremental borrowing rate as its discount rate to determine the present value of its remaining lease payments to calculate its lease assets and lease liabilities because the rate implicit in the lease is not readily determinable. The incremental borrowing rate approximates the rate the Company would pay to borrow in the currency of the lease payments on a collateralized basis for the weighted-average life of the lease. Operating lease assets also include any prepaid lease payments and lease incentives received prior to lease commencement.\nThe Company recognizes operating lease costs and the amortization of finance lease assets on a straight-line basis over the lease term. The interest component of a finance lease is recognized using the effective interest method over the lease term. Certain of the Company's lease agreements include rent payments which are adjusted periodically based on an index or rate. Any change in payments due to such adjustments are recognized as variable lease expense as they are incurred. Variable lease expense also includes costs for property taxes, insurance, and services provided by the lessor which are charged based on usage or performance (such as maintenance or utility charges).\nMost leases have one or more options to renew beyond their initial term. The exercise of renewal options, mainly for office space and data centers, is at the Company's discretion and are included in the determination of the lease term for accounting purposes if they are reasonably certain to be exercised\n.\nBusiness Combinations, Goodwill, and Intangible Assets\nThe Company accounts for acquired businesses using the acquisition method of accounting. The consideration transferred is allocated to the assets acquired and liabilities assumed based on their respective values at the acquisition date. The excess of the consideration transferred over the net of the amounts allocated to the identifiable assets acquired and liabilities assumed is recognized as goodwill. The Company generally recognizes and measures contract assets and contract liabilities in a business combination at amounts consistent with those recorded by the acquired business.\nGoodwill is assigned to reporting units that are expected to benefit from the synergies of the business combination. Goodwill is not subject to amortization and is tested for impairment on an annual basis and between annual tests if an event occurs or circumstances change that would more likely than not reduce the fair value of a reporting unit below its carrying amount. The Company tests goodwill at a reporting unit level. The fair value of the reporting unit is compared to its carrying value, including goodwill. Fair values are determined using a combination of standard valuation techniques, including an income approach (discounted cash flows) and market approaches (e.g., earnings before interest, taxes, depreciation, and amortization (\"EBITDA\") multiples of comparable publicly traded companies) and based on market participant assumptions. A goodwill impairment loss is measured at the amount by which a reporting unit's carrying amount exceeds its fair value, not to exceed the carrying amount of goodwill. See Note 11 for additional information. \nIntangible assets are carried at cost and amortized on a straight-line basis over their estimated useful lives.\nImpairment of Long-lived Assets\nThe Company reviews long-lived assets, including intangible assets and operating lease assets, whenever events or changes in circumstances indicate that the carrying amount of the asset may not be recoverable. The assessment of possible impairment is based upon the Company's ability to recover the carrying value of the assets from the estimated undiscounted future net cash flows, before interest and taxes, of the related asset group. The amount of impairment loss, if any, is measured as the excess of the carrying value of the asset over the present value of estimated future cash flows, using a discount rate commensurate with the risks involved and based on assumptions representative of market participants.\nForeign Currency Translation\nThe functional currency of the Company's subsidiaries is generally the respective local currency. For operations outside of the U.S., assets and liabilities are translated into U.S. Dollars at the rate of exchange existing at the balance sheet date. Income statement amounts are translated at monthly average exchange rates applicable for the period. Translation gains and losses are included as a component of \"Accumulated other comprehensive loss\" in the Company's Consolidated Balance Sheets. Foreign currency transaction gains and losses are included in \"Other income (expense), net\" in the Company's Consolidated Statements of Operations.\nDerivatives\nAs a result of the Company's operations outside of the U.S., it is exposed to various market risks that may affect its consolidated results of operations, cash flows, and financial position. These market risks include, but are not limited to, fluctuations in foreign currency exchange rates. For the Company's operations outside of the U.S., the primary foreign currency exposures are in Euros and British Pounds Sterling, the currencies in which the Company conducts a significant portion of its business activities. As a result, the Company faces exposure to adverse movements in foreign currency exchange rates as the financial results of its operations outside of the U.S. are translated from local currencies into U.S. Dollars upon consolidation. Additionally, foreign currency exchange rate fluctuations on transactions denominated in currencies other than the functional currency of an entity result in gains and losses that are reflected in net income.\n \n64\nThe Company may enter into derivative instruments to hedge certain net exposures of nonfunctional currency denominated assets and liabilities, even though it does not elect to apply hedge accounting or hedge accounting does not apply. These contracts are generally short-term in duration. Certain of the Company's derivative instruments have master netting arrangements, which reduce credit risk by permitting net settlement of transactions with the same counterparty. The Company is exposed to the risk that counterparties to derivative instruments may fail to meet their contractual obligations. The Company regularly reviews its credit exposure and assesses the creditworthiness of its counterparties. The Company reports the fair value of its derivative assets and liabilities on a gross basis in the Consolidated Balance Sheets in \"Other current assets\" and \"Accrued expenses and other current liabilities,\" respectively. Unless designated as hedges for accounting purposes, gains and losses resulting from changes in the fair value of derivative instruments are recognized in \"Other income (expense), net\" in the Consolidated Statements of Operations in the period that the changes occur and are classified within \"Net cash provided by operating activities\" or \"Net cash used in financing activities,\" as appropriate, in the Consolidated Statements of Cash Flows. See Note 6 for additional information related to these derivative instruments.\nContractual terms of debt arrangements, including embedded features such as conversion options, are evaluated and reassessed at each balance sheet date to determine whether they must be accounted for separately from the debt contract as derivative instruments under ASC 815. Embedded derivatives are measured at fair value, with changes in fair value recognized in the Consolidated Statement of Operations.\nNon-derivative Instrument Designated as Net Investment Hedge\nThe foreign currency transaction gains or losses on the Company's Euro-denominated debt are measured based upon changes in spot rates. The foreign currency transaction gains or losses on the Euro-denominated debt that is designated as a hedging instrument for accounting purposes are recorded in \"Accumulated other comprehensive loss\" in the Consolidated Balance Sheets. The foreign currency transaction gains or losses on the Euro-denominated debt that is not designated as a hedging instrument are recognized in \"Other income (expense), net\" in the Consolidated Statements of Operations. See Notes 12 and 14 for additional information related to the net investment hedge.\n \nRevenue Recognition \nOnline travel reservation services\nSubstantially all of the Company's revenues are generated by providing online travel reservation services, which principally allows travelers to book travel reservations with travel service providers through the Company's platforms. While the Company generally refers to a consumer that books travel reservation services on the Company's platforms as its customer, for accounting purposes, the Company's customers are the travel service providers and, in certain merchant transactions, the travelers. The Company's contracts with travel service providers give them the ability to market their reservation availability without transferring to the Company the responsibility to deliver the travel services. Therefore, the Company's revenues are presented on a net basis in the Consolidated Statements of Operations. These contracts include payment terms and establish the consideration to which the Company is entitled, which includes either a commission or a margin on the travel transaction. Revenue is measured based on the expected consideration specified in the contract with the travel service provider, considering the effects of factors such as discounts and other sales incentives. Estimates for sales incentives are based on historical experience, current trends, and forecasts, as applicable. Local occupancy taxes, general excise taxes, value-added taxes, sales taxes, and other similar taxes (\"travel transaction taxes\"), if any, collected from travelers are reported on a net basis in revenues in the Consolidated Statements of Operations.\nRevenues for online travel reservation services are recognized at a point in time when the Company has completed its post-booking services and the travelers begin using the arranged travel services. These revenues are classified into two categories:\n•\nMerchant revenues are derived from travel-related transactions where the Company facilitates payments from travelers for the services provided, generally at the time of booking. These include transactions where travelers book accommodation, rental car, airline reservations, and other travel related services. Merchant revenues include travel reservation commissions and transaction net revenues (i.e., the amount charged to travelers, including the contra-revenue impact of merchandising, less the amount owed to travel service providers) in connection with the Company's merchant reservation services; revenues from facilitating payments, such as credit card processing rebates and customer processing fees; and ancillary fees, including travel-related insurance revenues. \n•\nAgency revenues are derived from the Company's commissions on travel-related transactions where the Company does not facilitate payments from travelers for the services provided. \n65\nAdvertising and Other Revenues\nAdvertising and other revenues are derived primarily from revenues earned by KAYAK and OpenTable. KAYAK recognizes advertising revenue primarily by sending referrals to online travel companies (\"OTCs\") and travel service providers and from advertising placements on its platforms. Revenue related to referrals is recognized when a consumer clicks on a referral placement or upon completion of the travel. Revenue for advertising placements is recognized based upon when a consumer clicks on an advertisement or when KAYAK displays an advertisement. OpenTable recognizes revenues for restaurant reservation services (fees paid by restaurants when diners are seated through its online reservation service) and subscription fees for restaurant management services on a straight-line basis over the contractual period in accordance with how the service is provided. \nConsumer Incentive Programs \nThe Company provides various consumer incentive programs such as referral bonuses, rebates, credits, and discounts. In addition, the Company offers loyalty programs where participating consumers may be awarded loyalty points on current transactions that can be redeemed in the future. The estimated value of the incentives granted and the loyalty points expected to be redeemed is generally recognized as a reduction of revenue at the time they are granted. \nDeferred Merchant Bookings\nCash payments received from travelers in advance of the Company completing its performance obligations are included in \"Deferred merchant bookings\" in the Company's Consolidated Balance Sheets and are comprised principally of amounts estimated to be payable to travel service providers as well as the Company's estimated future revenue for its commission or margin and fees. The amounts are mostly subject to refunds for cancellations. The Company expects to complete its performance obligations generally within \none year\n from the reservation date. The increase in the Deferred Merchant Booking balance during the year ended December 31, 2024 was principally due to the increase in business volumes.\nMarketing Expenses\nThe Company's advertising expenses are reported in \"Marketing expenses\" in the Consolidated Statements of Operations. Marketing expenses consist of performance marketing expenses and brand marketing expenses. These expenses consist primarily of the costs of: (1) search engine keyword purchases; (2) affiliate programs; (3) referrals from meta-search websites; (4) other performance-based marketing, including social media marketing; and (5) offline and online brand marketing. Performance marketing expenses are expenses generally measured by return on investment or an increase in bookings over a specified time period and are recognized as incurred. Brand marketing expenses are expenses incurred to build brand awareness over a specified time period. These expenses consist primarily of television advertising and online video and display advertising (including the airing of the Company's television advertising online), as well as other marketing expenses such as public relations and sponsorships. Brand marketing expenses are generally recognized as incurred with the exception of advertising production costs, which are deferred and expensed the first time the advertisement is displayed or broadcast.\n \nSales and Other Expenses\nSales and other expenses are generally variable in nature and consist primarily of: (1) credit card and other payment processing fees associated with merchant transactions; (2) fees paid to third parties that provide call center and other customer services; (3) digital services taxes and other similar taxes (4) chargeback provisions and fraud prevention expenses associated with merchant transactions; (5) provisions for expected credit losses, mostly related to accommodation commission receivables; and (6) customer relations costs.\n \nPersonnel Expenses\nPersonnel expenses consist of compensation to the Company's personnel, including salaries, bonuses, and stock-based compensation, payroll taxes, and employee health and other benefits.\nStock-Based Compensation\nStock-based compensation expense related to performance share units, restricted stock units and stock options is recognized based on fair value on a straight-line basis over the respective requisite service periods and forfeitures are accounted for when they occur. The fair value on the grant date of performance share units and restricted stock units is determined based on the number of units granted and the quoted price of the Company's common stock. For performance share units with market conditions, the effect of the market condition is also considered in the determination of fair value on the grant date using Monte Carlo simulations. The fair value of employee stock options is determined using the Black-Scholes model. \nThe Company records stock-based compensation expense for performance-based awards using its estimate of the probable outcome at the end of the performance period (i.e., the estimated performance against the performance targets or performance goals, as applicable). The Company periodically adjusts the cumulative stock-based compensation expense recorded when the probable outcome for these performance-based awards is updated based upon changes in actual and forecasted operating results or expected achievement of performance goals, as applicable. \n \n66\nThe benefits of tax deductions in excess of recognized compensation costs are recognized in the Consolidated Statements of Operations as a discrete item when an option exercise or a vesting and release of shares occurs. Excess tax benefits are presented as operating cash flows and cash payments for employee statutory tax withholding related to vested stock awards are presented as financing cash flows in the Consolidated Statements of Cash Flows.\n \nGeneral and Administrative Expenses\nGeneral and administrative expenses consist primarily of fees for certain outside professionals, occupancy and office expenses, personnel-related expenses such as travel, relocation, recruiting, and training expenses, and certain travel transaction taxes.\nInformation Technology Expenses\nInformation technology expenses consist primarily of: (1) software license and system maintenance fees; (2) cloud computing costs and outsourced data center costs; (3) payments to contractors; and (4) data communications and other expenses associated with operating the Company's services.\n \nRestructuring and Other Exit Costs\nThe Company records employee severance and other termination costs that meet the requirements for recognition in accordance with the relevant guidance of Accounting Standards Codification (\"ASC\") 420, \nExit or Disposal Cost Obligations,\n or ASC 712, \nCompensation - Nonretirement Postemployment Benefits\n, as applicable. For involuntary termination benefits that are not provided under the terms of an ongoing benefit arrangement, the liability for the current fair value of expected future costs associated with a management-approved restructuring plan is recognized in the period in which the plan is communicated to the employees and the plan is not expected to change significantly. For ongoing benefit arrangements, inclusive of statutory requirements, employee termination costs are accrued when the existing situation or set of circumstances indicates that an obligation has been incurred, it is probable the benefits will be paid, and the amount can be reasonably estimated. Termination benefits associated with voluntary leaver schemes are recorded when the employee irrevocably accepts the offer and the amount can be reasonably estimated.\nIncome Taxes \nThe Company accounts for income taxes under the asset and liability method. The Company records the estimated future tax effects of temporary differences between the tax bases of assets and liabilities and amounts reported in the Consolidated Balance Sheets, as well as operating loss and tax credit carryforwards. Deferred taxes are classified as non-current in the Consolidated Balance Sheets. \n \nThe Company records deferred tax assets to the extent it believes these assets will more likely than not be realized. The Company regularly reviews its deferred tax assets for recoverability considering historical profitability, projected future taxable income, the expected timing of the reversals of existing temporary differences, the carryforward periods available for tax reporting purposes, and tax planning strategies. A valuation allowance is provided when it is more likely than not that some portion or all of a deferred tax asset will not be realized. The ultimate realization of deferred tax assets depends on the generation of future taxable income during the period in which related temporary differences become deductible. In determining the future tax consequences of events that have been recognized in the financial statements or tax returns, significant judgments, estimates, and interpretation of statutes are required.\nDeferred taxes are measured using the enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred taxes of a change in tax rates is recognized in income in the period that includes the enactment date of such change.\n \nThe Company recognizes liabilities when it believes that uncertain positions may not be fully sustained upon audit by the tax authorities. Liabilities recognized for uncertain tax positions are based on a two-step approach for recognition and measurement. First, the Company evaluates the tax position for recognition by determining if the weight of available evidence indicates it is more likely than not that the position will be sustained on audit based on its technical merits. Second, the Company measures the tax benefit as the largest amount that is more than 50% likely of being realized upon ultimate settlement. Interest and penalties attributable to uncertain tax positions, if any, are recognized as a component of income tax expense. \nThe Company accounts for taxes on global intangible low-taxed income (\"GILTI\") introduced by the U.S. Tax Cuts and Jobs Act (the \"Tax Act\") as period costs. See Note 15 for further details related to income taxes.\n \nContingencies \nLoss contingencies (other than income tax-related contingencies) arise from actual or possible claims and assessments and pending or threatened litigation that may be brought against the Company by individuals, governments or other entities. Based on the Company's assessment of loss contingencies at each balance sheet date, a loss is recorded in the financial statements if it is probable that an asset has been impaired or a liability has been incurred and the amount of the loss can be reasonably estimated.\n \n67\nReclassification\nCertain amounts from prior periods have been reclassified to conform to the current period presentation. These include the reclassification in the Consolidated Balance Sheet as of December 31, 2023 of certain liabilities aggregating $\n106\n million from \"Accounts payable\" to \"Accrued expenses and other current liabilities\" to better reflect the progress of the underlying transactions in the procure-to-pay process.\nRecent Accounting Pronouncements Adopted\n    \nAccounting for Convertible Instruments and Contracts in an Entity's Own Equity \nOn January 1, 2022, the Company adopted the accounting standards update relating to convertible instruments and contracts in an entity's own equity. Under the updated guidance, upon the initial recognition of convertible debt, the Company presents the entire amount attributable to the debt as a liability. The initial carrying amount of the convertible debt liability is reduced by any direct and incremental issuance costs paid to third parties that are associated with the convertible debt issuance. In calculating diluted earnings per share, the accounting standards update also requires the use of the if-converted method for the Company's convertible debt. See Note 8 for additional information on net income per share calculations.\nThe Company adopted the accounting standards update on a modified retrospective basis applied to the \n0.75\n% convertible senior notes due in May 2025 (see Note 12) resulting in an increase of $\n30\n million to \"Retained earnings\" as of January 1, 2022. The significant corresponding balance sheet changes as of that date were an increase of $\n86\n million to \"Long-term debt\" and decreases of $\n96\n million to \"Additional paid-in capital\" and $\n21\n million to \"Deferred income taxes.\"\nImprovements to Reportable Segment Disclosures\nIn fiscal 2024, the Company adopted the accounting standards update that requires additional reportable segment disclosures, including segment revenues, significant expenses, and segment profit or loss. See Note 17.\nOther Recent Accounting Pronouncements\nExpense Disaggregation Disclosures\nIn November 2024, the Financial Accounting Standards Board (\"FASB\") issued an accounting standards update that requires the Company to disclose additional information about certain expense categories in the notes to financial statements at interim and annual reporting periods. The update is effective for annual financial statements beginning with the fiscal year 2027 and interim financial statements in the fiscal year 2028 onwards. The Company is currently evaluating the impact of the accounting standards update on its Consolidated Financial Statements.\nImprovements to Income Tax Disclosures\nIn December 2023, the FASB issued an accounting standards update related to income taxes that requires additional disclosures on the rate reconciliation and taxes paid. The update requires disclosure of additional categories of information in the tax rate reconciliation table about federal, state and foreign income taxes and more details about certain items that meet a quantitative threshold. Income taxes paid (net of refunds received) are required to be disclosed disaggregated by federal (national), state and foreign taxes and also by jurisdiction based on a quantitative threshold. The update is effective for annual financial statements beginning with the fiscal year 2025. In preparation for the adoption of the update, the Company is currently evaluating the impact to its Consolidated Financial Statements and establishing the related processes and internal controls.\n \n3.    \nREVENUES\nDisaggregation of Revenues\nRevenues by Type of Service \nApproximately \n89\n% of the Company's revenues for the years ended December 31, 2024, 2023, and 2022 relate to online accommodation reservation services. Revenues from all other sources of online travel reservation services and advertising and other revenues each individually represent less than \n10\n% of the Company's total revenues for each year. The majority of the Company's merchant revenues and substantially all of its agency revenues are from Booking.com's accommodation reservations.\nRevenues by Geographic Area \nSee Note 17 for the information related to revenues by geographic area.\n68\nConsumer Incentive \nPrograms\nAt December 31, 2024 and 2023, liabilities of $\n150\n million and $\n149\n million, respectively, were included in \"Accrued expenses and other current liabilities\" in the Consolidated Balance Sheets for incentives granted to consumers, including credits, loyalty programs, and discounts.\n \n4.    \nSTOCK-BASED COMPENSATION \nThe Company's 1999 Omnibus Plan, as amended and restated effective June 3, 2021, (the \"1999 Plan\") is the primary stock compensation plan from which broad-based employee, non-employee director, and consultant equity awards may be made. At December 31, 2024, there were approximately \n828,000\n shares of common stock available for future grants under the 1999 Plan.\n \nStock-based compensation issued under the plans generally consists of restricted stock units, performance share units, and stock options. Performance share units and restricted stock units are payable in shares of the Company's common stock upon vesting. The Company issues shares of its common stock upon the exercise of stock options. The tax benefit related to stock-based compensation was $\n58\n million, $\n52\n million, and $\n40\n million for the years ended December 31, 2024, 2023, and 2022, respectively.\nRestricted Stock Units and Performance Share Units\nThe Company makes broad-based grants of restricted stock units that generally vest during a period of \none\n- to \nthree-years\n, subject to certain exceptions for terminations other than for \"cause,\" for \"good reason,\" or on account of death or disability. The Company grants performance share units to executives and certain other employees, which generally vest at the end of a \nthree-year\n period (with the exception of certain shorter-term performance share units), subject to certain exceptions for terminations other than for \"cause,\" for \"good reason,\" or on account of death or disability. The number of shares that ultimately vest depends on achieving certain performance metrics, performance goals, stock price increase and/or relative total shareholder return, as applicable, by the end of the performance period, assuming there is no accelerated vesting for, among other things, a termination of employment under certain circumstances. \nRestricted stock units and performance share units granted by the Company during the years ended December 31, 2024, 2023, and 2022 had an aggregate grant-date fair value of $\n635\n million, $\n586\n million, and $\n490\n million, respectively. Restricted stock units and performance share units that vested during the years ended December 31, 2024, 2023, and 2022 had an aggregate fair value at vesting of $\n778\n million, $\n459\n million, and $\n400\n million, respectively. At December 31, 2024, there was $\n713\n million of estimated total future stock-based compensation expense related to unvested restricted stock units and performance share units to be recognized over a weighted-average period of \n1.8\n years. \nThe following table summarizes the activity in restricted stock units and performance share units for employees and non-employee directors during the year ended December 31, 2024: \nRestricted Stock Units\nPerformance Share Units\nShares\nWeighted-average Grant-date Fair Value\nShares\nWeighted-average Grant-date Fair Value\nUnvested at December 31, 2023 \n(1)\n291,404\n$\n2,404\n \n233,026\n$\n2,467\n \nGranted \n(2)\n143,377\n$\n3,530\n \n35,301\n$\n3,660\n \nVested\n(\n140,299\n)\n$\n2,335\n \n(\n78,692\n)\n$\n2,450\n \nPerformance shares adjustment \n(3)\n16,113\n$\n3,688\n \nForfeited\n(\n15,759\n)\n$\n2,830\n \n(\n5,594\n)\n$\n2,617\n \nUnvested at December 31, 2024\n278,723\n$\n2,994\n \n200,154\n$\n2,779\n \n \n(1)    Excludes \n4,399\n performance share units awarded during the year ended December 31, 2022 for which the grant date under ASC 718, Compensation - Stock Compensation, was not established as of December 31, 2023. Among other conditions, for the grant date to be established, a mutual understanding is required to be reached between the Company and the employee of the key terms and conditions of the award, including the performance targets. The performance targets for each of the annual performance periods under the award are set at the beginning of the respective year.\n(2)     Includes \n4,399\n performance share units awarded during the year ended December 31, 2022 for which the grant date under ASC 718 was established during the year ended December 31, 2024.\n(3)    Probable outcome for performance-based awards is updated based upon changes in actual and forecasted operating results or expected achievement of performance goals, as applicable, and the impact of modifications, if any.\n69\nStock Options\nThe following table summarizes the activity in stock options during the year ended December 31, 2024:\nEmployee Stock Options \nNumber of Shares\nWeighted-average\n Exercise Price\nAggregate\n Intrinsic Value (in millions)\nWeighted-average Remaining Contractual Term \n(in years)\nBalance, December 31, 2023\n25,523\n \n$\n1,411\n \n$\n55\n \n6.4\nExercised \n(\n9,834\n)\n$\n1,411\n \nBalance, December 31, 2024\n15,689\n \n$\n1,411\n \n$\n56\n \n5.4\nExercisable at December 31, 2024\n15,689\n \n$\n1,411\n \n$\n56\n \n5.4\nThe aggregate intrinsic value of employee stock options exercised during the years ended December 31, 2024 and 2023 was $\n24\n million and $\n124\n million, respectively. No stock options were granted to the executive officers of the Company.\n \n5.    \nINVESTMENTS\nThe following table summarizes the Company's investments by major security type at December 31, 2024 and 2023:\n(in millions)\nCost\nGross\nUnrealized Gains /Upward Adjustments\nGross\nUnrealized Losses /Downward Adjustments\nCarrying Value\nDecember 31, 2024\nLong-term investments:\nEquity securities with readily determinable fair values\n$\n715\n \n$\n—\n \n$\n(\n324\n)\n$\n391\n \nEquity securities of private entities\n111\n \n259\n \n(\n225\n)\n145\n \nTotal long-term investments\n$\n826\n \n$\n259\n \n$\n(\n549\n)\n$\n536\n \nDecember 31, 2023\nShort-term investments:\nDebt securities:\nInternational government securities\n$\n63\n \n$\n—\n \n$\n—\n \n$\n63\n \nU.S. government securities \n(1)\n152\n \n—\n \n(\n1\n)\n151\n \nCorporate debt securities\n365\n \n—\n \n(\n3\n)\n362\n \nTotal short-term investments\n$\n580\n \n$\n—\n \n$\n(\n4\n)\n$\n576\n \nLong-term investments:\nEquity securities with readily determinable fair values\n$\n715\n \n$\n—\n \n$\n(\n404\n)\n$\n311\n \nEquity securities of private entities\n78\n \n259\n \n(\n208\n)\n129\n \nTotal long-term investments\n$\n793\n \n$\n259\n \n$\n(\n612\n)\n$\n440\n \n(1)    Includes investments in U.S. municipal bonds.\n \nThe Company's investment policy seeks to preserve capital and maintain sufficient liquidity to meet operational and other needs of the business. The Company's investments in available-for-sale debt securities at December 31, 2023 had investment grade credit quality ratings and the investments in international government securities principally included debt securities issued by the governments of Germany, France, Norway, Canada, and Sweden.\n70\nEquity securities with readily determinable fair values include the Company's investments in Grab Holdings Limited (\"Grab\") and DiDi Global Inc. (\"DiDi\"), with fair values of $\n200\n million and $\n179\n million, respectively, at December 31, 2024 and $\n143\n million and $\n155\n million, respectively, at December 31, 2023. During the year ended December 31, 2023, the Company sold its entire investment in Meituan for $\n1.7\n billion, resulting in a loss of $\n149\n million included in \"Other income (expense), net\" in the Consolidated Statement of Operations for the year ended December 31, 2023. The cost basis of the Company's investment in Meituan was $\n450\n million. Equity securities with readily determinable fair values are included in \"Long-term investments\" in the Consolidated Balance Sheets. \nNet unrealized gains (losses) related to these investments included in \"Other income (expense), net\" in the Consolidated Statements of Operations for the years ended December 31, 2024, 2023, and 2022 were as follows: \nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nGrab \n$\n57\n \n$\n7\n \n$\n(\n165\n)\nDiDi \n24\n \n30\n \n(\n70\n)\nMeituan \n—\n \n—\n \n(\n526\n)\nThe Company's investments in equity securities of private entities at December 31, 2024 and 2023, includes $\n51\n million originally invested in Yanolja Co., Ltd. (\"Yanolja\"). Certain observable transactions subsequent to the Company's original investment resulted in an adjusted carrying value of $\n306\n million for the investment as of December 31, 2021. The Company evaluated its investment in Yanolja for impairment as of June 30, 2023 and 2022 and recognized impairment charges of $\n24\n million and $\n184\n million during the years ended December 31, 2023 and 2022, respectively (see Note 6). The carrying value of the Company's investment in Yanolja was $\n98\n million as of December 31, 2024 and 2023.\n \n71\n6.    \nFAIR VALUE MEASUREMENTS\n \nFinancial assets and liabilities\n \nmeasured at fair value on a recurring basis at December 31, 2024 and 2023 and nonrecurring basis, as applicable, are categorized below based on the level of inputs to the valuation techniques used to measure fair value (see Note 2):\n(in millions)\nLevel 1\nLevel 2\nLevel 3\nTotal\nDecember 31, 2024\nRecurring fair value measurements\nASSETS:\n \n \n \n \nCash equivalents and restricted cash equivalents:\nMoney market fund investments\n$\n14,806\n \n$\n—\n \n$\n—\n \n$\n14,806\n \nCertificates of deposit\n120\n \n—\n \n—\n \n120\n \nLong-term investments:\nEquity securities\n391\n \n—\n \n—\n \n391\n \nDerivatives:\nForeign currency exchange derivatives\n—\n \n70\n \n—\n \n70\n \nLIABILITIES:\nDerivatives:\nForeign currency exchange derivatives\n$\n—\n \n$\n93\n \n$\n—\n \n$\n93\n \nEmbedded derivative liability\n—\n \n1,300\n \n—\n \n1,300\n \nDecember 31, 2023\nRecurring fair value measurements\nASSETS:\nCash equivalents and restricted cash equivalents:\nMoney market fund investments\n$\n10,871\n \n$\n—\n \n$\n—\n \n$\n10,871\n \nCertificates of deposit\n97\n \n—\n \n—\n \n97\n \nShort-term investments:\nInternational government securities\n—\n \n63\n \n—\n \n63\n \nU.S. government securities\n—\n \n151\n \n—\n \n151\n \nCorporate debt securities\n—\n \n362\n \n—\n \n362\n \nLong-term investments:\nEquity securities\n311\n \n—\n \n—\n \n311\n \nDerivatives:\nForeign currency exchange derivatives\n—\n \n62\n \n—\n \n62\n \nLIABILITIES:\nDerivatives:\nForeign currency exchange derivatives\n$\n—\n \n$\n36\n \n$\n—\n \n$\n36\n \nNonrecurring fair value measurements\nInvestment in equity securities of a private entity \n(1)\n$\n—\n \n$\n—\n \n$\n98\n \n$\n98\n \n(1)    During the year ended December 31, 2023, the investment in Yanolja was written down to its estimated fair value.\n \nInvestments\nSee Note 5 for additional information related to the Company's investments.\nThe Company's investments in debt securities are measured using \"Level 2\" inputs as the Company has access to quoted prices for identical or comparable securities, but does not have visibility into the volume and frequency of trading for these investments. A market approach is used for recurring fair value measurements and the valuation techniques use inputs that are observable, or can be corroborated by observable data, in an active marketplace. \n72\nThe Company's investments measured using Level 3 inputs primarily consist of investments in privately-held entities. Fair values of these securities are estimated using a variety of valuation methodologies, including both the market and income approaches. The Company uses valuation techniques appropriate for the type of investment and the information available about the investee as of the valuation date to determine fair value. Recent financing transactions in the investee are generally considered the best indication of the enterprise value and therefore used as a basis to estimate fair value. However, based on a number of factors, such as the proximity in timing to the valuation date or the volume or other terms of these financing transactions, the Company may also use other valuation techniques to supplement this data, including the income approach. When a financing transaction occurs and represents fair value, the Company also uses the calibration process, as appropriate, when estimating fair value on subsequent measurement dates. Calibration is the process of using observed transactions in the investee company's own instruments to ensure that the valuation techniques that will be employed to value the investee company investment on subsequent measurement dates begin with assumptions that are consistent with the original observed transaction as well as any more recent observed transactions in the instruments issued by the investee company. \nAs of June 30, 2023 and 2022, the Company evaluated its investment in Yanolja for impairment using a combination of the market approach and the income approach in estimating the fair value of the investment as of those dates, and recognized impairment charges. The market approach estimates value using prices and other relevant information generated by market transactions involving comparable companies. The income approach estimates value based on the expectation of future cash flows that a company will generate. These future cash flows are discounted to their present values using a discount rate based on a company's weighted-average cost of capital adjusted to reflect the risks inherent in its cash flows. The key unobservable inputs and ranges used for the June 2023 impairment evaluation, primarily using the income approach, include the weighted average cost of capital (\n10.5\n%-\n14.5\n%) and the terminal EBITDA multiple (\n14\nx-\n16\nx). The key unobservable inputs and ranges used for the June 2022 impairment evaluation include, for the market approach, percentage decrease in the calibrated EBITDA multiple (\n36\n%) and for the income approach, the weighted average cost of capital (\n10\n%-\n14\n%) and the terminal EBITDA multiple (\n14\nx-\n16\nx). Significant changes in any of these inputs in isolation would result in significantly different fair value measurements. A change in the assumption used for EBITDA multiples would result in a directionally similar change in the fair value, and a change in the assumption used for weighted average cost of capital would result in a directionally opposite change in the fair value. \nThe determination of the fair values of investments, where the Company is a minority shareholder and has access to limited information from the investee, reflects numerous assumptions that are subject to various risks and uncertainties, including key assumptions regarding the investee's expected growth rates and operating margin, as well as other key assumptions with respect to matters outside of the Company's control, such as discount rates and market comparables. It requires significant judgments and estimates and actual results could be materially different than those judgments and estimates utilized in the fair value measurement. Future events and changing market conditions may lead the Company to re-evaluate the assumptions reflected in the valuation which may result in a need to recognize additional impairment charges.\nDerivatives\nIn the normal course of business, the Company is exposed to the impact of foreign currency fluctuations. The Company mitigates these risks by following established risk management policies and procedures, including the use of derivatives. The Company enters into foreign currency exchange contracts to hedge its exposure to the impact of movements in foreign currency exchange rates on its transactional balances denominated in currencies other than the functional currency. The Company does not use derivatives for trading or speculative purposes. \nThe Company's derivative instruments are valued using pricing models. Pricing models take into account the contract terms as well as multiple inputs where applicable, such as interest rate yield curves, option volatility, and foreign currency exchange rates. The valuation of derivatives is considered \"Level 2\" fair value measurement. The Company's derivative instruments are typically short-term in nature. The Company reports the fair values of its derivative assets and liabilities on a gross basis in the Consolidated Balance Sheets in \"Other current assets\" and \"Accrued expenses and other current liabilities,\" respectively.\nSee Note 12 for information on the embedded derivative liability related to the convertible senior notes due in May 2025.\nAs of December 31, 2024 and 2023, the Company did not designate any derivatives as hedges for accounting purposes. Gains and losses resulting from changes in the fair values of derivative instruments are recognized in \"Other income (expense), net\" in the Consolidated Statements of Operations in the period that the changes occur and cash flow impacts, if any, are classified within \"Net cash provided by operating activities\" or \"Net cash used in financing activities,\" as appropriate, in the Consolidated Statements of Cash Flows. \nFor the Company's foreign currency exchange derivatives outstanding as of December 31, 2024 and 2023, the notional amounts of the foreign currency purchases were $\n8.2\n billion and $\n4.9\n billion, respectively, and the notional amounts of the foreign currency sales were $\n5.5\n billion and $\n4.2\n billion, respectively. The notional amount of a foreign currency exchange derivative contract is the contracted amount of foreign currency to be exchanged and is not recorded in the balance sheet. \n73\nThe effect of foreign currency exchange derivatives recorded in \"Other income (expense), net\" in the Consolidated Statements of Operations for the years ended December 31, 2024, 2023, and 2022 is as follows:\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nLosses on foreign currency exchange derivatives \n$\n(\n156\n)\n$\n(\n106\n)\n$\n(\n52\n)\nOther Financial Assets and Liabilities\nAt December 31, 2024 and 2023, the Company's cash consisted of bank deposits. Cash equivalents principally include money market fund investments and certificates of deposit and their carrying value generally approximates the fair value as they are readily convertible to known amounts of cash. Other financial assets and liabilities, including restricted cash, accounts payable, accrued expenses, and deferred merchant bookings, are carried at cost which approximates their fair values because of the short-term nature of these items. Accounts receivable and other financial assets measured at amortized cost are carried at cost less an allowance for expected credit losses to present the net amount expected to be collected (see Note 7). See Note 12 for the estimated fair value of the Company's outstanding senior notes, including the estimated fair value of the Company's convertible senior notes.\n7.    \nACCOUNTS RECEIVABLE AND OTHER FINANCIAL ASSETS\n \nAccounts receivable in the Consolidated Balance Sheets at December 31, 2024 and 2023 includes receivables from customers of $\n2.0\n billion and $\n1.9\n billion, respectively, and receivables from payment processors and networks of $\n1.2\n billion and $\n1.3\n billion, respectively. The remaining balance principally relates to receivables from marketing affiliates. The Company's receivables are short-term in nature. The amounts mentioned above are stated on a gross basis, before deducting the allowance for expected credit losses.\nSignificant judgments and assumptions are required to estimate the allowance for expected credit losses and such assumptions may change in future periods, particularly the assumptions related to the business prospects and financial condition of customers and marketing affiliates, including macroeconomic conditions, inflationary pressures, and the Company's ability to collect the receivable or recover prepayments.\nThe following table summarizes the activity of the allowance for expected credit losses on receivables: \n \nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nBalance, beginning of year\n$\n137\n \n$\n117\n \n$\n101\n \nProvision charged to earnings\n222\n \n169\n \n130\n \nWrite-offs and other adjustments\n(\n213\n)\n(\n149\n)\n(\n114\n)\nBalance, end of year\n$\n146\n \n$\n137\n \n$\n117\n \n8.    \nNET INCOME PER SHARE\n \nThe Company computes basic net income per share by dividing net income applicable to common stockholders by the weighted-average number of common shares outstanding during the period. Diluted net income per share is based upon the weighted-average number of common and common equivalent shares outstanding during the period. Only dilutive common equivalent shares that decrease the net income per share are included in the computation of diluted net income per share.\n \nCommon equivalent shares related to stock options, restricted stock units, and performance share units are calculated using the treasury stock method. Performance share units are included in the weighted-average common equivalent shares based on the number of shares that would be issued if the end of the reporting period were the end of the performance period, if the result would be dilutive.\nSee Note 12 for information on the convertible senior notes due in May 2025. For periods prior to the date of the Company's irrevocable election to settle the conversion premium in cash, the Company used the if-converted method to calculate the dilutive effect of the convertible senior notes.\n74\nA reconciliation of the weighted-average number of shares outstanding used in calculating diluted net income per share is as follows: \n \nYear Ended December 31,\n(in thousands)\n2024\n2023\n2022\nWeighted-average number of basic common shares outstanding\n33,622\n \n36,140\n \n39,872\n \nWeighted-average dilutive stock options, restricted stock units, and performance share units\n242\n \n228\n \n151\n \nAssumed conversion of convertible senior notes\n200\n \n162\n \n29\n \nWeighted-average number of diluted common and common equivalent shares outstanding\n34,064\n \n36,530\n \n40,052\n \n9.    \nPROPERTY AND EQUIPMENT, NET\n \nProperty and equipment, net at December 31, 2024 and 2023 consist of the following:\nDecember 31,\nEstimated\nUseful Lives\n(years)\n(in millions)\n2024\n2023\nCapitalized software\n$\n1,249\n \n$\n1,096\n \n1\n to \n7\n years\nComputer equipment\n694\n \n608\n \n2\n to \n5\n years\nLeasehold improvements \n216\n \n228\n \nUp to \n15\n years\nOffice equipment, furniture, and fixtures \n65\n \n71\n \n1\n to \n10\n years\nTotal\n2,224\n \n2,003\n \n \nLess: Accumulated depreciation \n(\n1,392\n)\n(\n1,219\n)\n \nProperty and equipment, net\n$\n832\n \n$\n784\n \n \nDepreciation expense was $\n370\n million, $\n282\n million, and $\n227\n million for the years ended December 31, 2024, 2023, and 2022, respectively. Additions to capitalized software during the years ended December 31, 2024, 2023, and 2022 were $\n212\n million, $\n229\n million, and $\n217\n million, respectively.\n10.    \nLEASES\nThe Company has operating and finance leases for office space, data centers, and computer equipment. \nThe Company recognized the following related to its leases in its Consolidated Balance Sheets:\nClassification in Consolidated Balance Sheets\nDecember 31,\n(in millions)\n2024\n2023\nOperating lease assets\nOperating lease assets\n$\n559\n \n$\n705\n \nOperating lease liabilities:\nCurrent operating lease liabilities\nAccrued expenses and other current liabilities\n$\n122\n \n$\n152\n \nNon-current operating lease liabilities\nOperating lease liabilities\n483\n \n599\n \nTotal operating lease liabilities\n$\n605\n \n$\n751\n \nFinance lease assets\nProperty and equipment, net\n$\n35\n \n$\n70\n \nFinance lease liabilities:\nCurrent finance lease liabilities\nAccrued expenses and other current liabilities\n$\n26\n \n$\n34\n \nNon-current finance lease liabilities\nOther long-term liabilities\n7\n \n34\n \nTotal finance lease liabilities\n$\n33\n \n$\n68\n \n75\nThe Company recognized the following costs related to its leases in its Consolidated Statements of Operations:\nYear Ended December 31,\n(in millions)\nClassification in Consolidated Statements of Operations\n2024\n2023\n2022\nFinance lease cost \nDepreciation and amortization\n$\n37\n \n$\n28\n \n$\n9\n \nOperating lease cost\nGeneral and administrative and Information technology\n174\n \n180\n \n160\n \nVariable lease cost\nGeneral and administrative and Information technology\n78\n \n82\n \n45\n \nOther\n4\n \n(\n4\n)\n(\n5\n)\nTotal lease cost\n$\n293\n \n$\n286\n \n$\n209\n \nAs of December 31, 2024, the future lease payments for operating and finance leases are as follows:\n(in millions)\nOperating Leases\nFinance Leases\n2025\n$\n142\n \n$\n27\n \n2026\n99\n \n7\n \n2027\n80\n \n—\n \n2028\n60\n \n—\n \n2029\n50\n \n—\n \nThereafter\n291\n \n—\n \nTotal future lease payments\n722\n \n34\n \nLess: Imputed interest\n(\n117\n)\n(\n1\n)\nTotal lease liabilities\n$\n605\n \n$\n33\n \nSupplemental cash flow information related to operating and finance leases is as follows:\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows from operating leases\n$\n184\n \n$\n172\n \n$\n175\n \nFinancing cash flows from finance leases\n36\n \n31\n \n9\n \nOperating lease assets obtained in exchange for new operating lease liabilities\n75\n \n200\n \n392\n \nFinance lease assets obtained in exchange for new finance lease liabilities\n2\n \n44\n \n50\n \n\"Operating lease amortization\" presented in the operating activities section of the Consolidated Statements of Cash Flows reflects the portion of the operating lease cost from the amortization of the operating lease assets.\nAt December 31, 2024 and 2023 the weighted-average lease term and discount rate for operating and finance leases are as follows:\nDecember 31,\n(in millions)\n2024\n2023\nOperating leases:\nWeighted-average remaining lease term\n9.2\n years\n8.7\n years\nWeighted-average discount rate\n3.9\n \n%\n4.0\n \n%\nFinance leases:\nWeighted-average remaining lease term\n1.2\n years\n2.1\n years\nWeighted-average discount rate\n3.5\n \n%\n3.1\n \n%\nIn 2022, the Company entered into a sale and leaseback transaction whereby the Company transferred ownership of Booking.com's headquarters building in the Netherlands and related land lease rights to a subsidiary of Deka Immobilien Investment GmbH for an aggregate consideration of approximately $\n601\n million. The Company concurrently entered into an agreement to lease the building from the purchaser for an initial term of \n16.5 years\n, with up to \nfive\n renewal options of \nfive years\n each. The initial annual base rent under the lease was $\n26\n million, which will increase annually based on the consumer price index, subject to a specified ceiling. The lease commenced in December 2022 and has been classified by the Company as an operating lease. The Company recognized a gain of $\n240\n million on the sale and leaseback transaction, which was recorded in \"Other operating expenses\" in the Consolidated Statement of Operations for the year ended December 31, 2022.\n76\n11.    \nGOODWILL AND INTANGIBLE ASSETS\n \nA substantial portion of the Company's intangible assets and goodwill relates to the acquisitions of KAYAK, OpenTable, and Getaroom.\nGoodwill\nThe changes in the balance of goodwill for the years ended December 31, 2024 and 2023 consist of the following: \n Year Ended December 31,\n(in millions)\n2024\n2023\nBalance, beginning of year \n$\n2,826\n \n$\n2,807\n \nForeign currency translation adjustments\n(\n27\n)\n19\n \nBalance, end of year \n(1)\n$\n2,799\n \n$\n2,826\n \n(1)    The balance of goodwill as of December 31, 2024 and 2023 is stated net of cumulative impairment charges of $\n2\n billion.\nAt September 30, 2024, the Company performed its annual goodwill impairment test and concluded that there was \nno\n impairment of goodwill. \nIntangible Assets\nThe Company's intangible assets consist of the following:\n \nDecember 31, 2024\nDecember 31, 2023\n \n(in millions)\nGross Carrying\nAmount\nAccumulated\nAmortization\nNet Carrying\nAmount\nGross Carrying\nAmount\nAccumulated\nAmortization\nNet Carrying\nAmount\nAmortization Period\nTrade names\n$\n1,802\n \n$\n(\n1,000\n)\n$\n802\n \n$\n1,812\n \n$\n(\n911\n)\n$\n901\n \n3\n - \n20\n years\nSupply and distribution agreements\n1,377\n \n(\n830\n)\n547\n \n1,402\n \n(\n759\n)\n643\n \n3\n - \n20\n years\nOther intangible assets\n326\n \n(\n293\n)\n33\n \n330\n \n(\n261\n)\n69\n \nUp to \n20\n years\nTotal intangible assets\n$\n3,505\n \n$\n(\n2,123\n)\n$\n1,382\n \n$\n3,544\n \n$\n(\n1,931\n)\n$\n1,613\n \n \nAmortization expense for intangible assets was $\n221\n million, $\n222\n million, and $\n224\n million for the years ended December 31, 2024, 2023, and 2022, respectively.\nThe estimate\nd future annual amortization expense for the Company's intangible assets at \nDecember 31, 2024 is \nas follows:\n(in millions)\n2025\n$\n213\n \n2026\n179\n \n2027\n168\n \n2028\n168\n \n2029\n159\n \nThereafter\n495\n \n \n12.    \nDEBT\nRevolving Credit Facility\nIn May 2023, the Company entered into a \nfive-year\n unsecured revolving credit facility with a group of lenders. The revolving credit facility extends a revolving line of credit of up to $\n2\n billion to the Company and provides for the issuance of up to $\n80\n million of letters of credit, as well as up to $\n100\n million of borrowings on same-day notice, referred to as swingline loans. Other than the swingline loans, which are available only in U.S. Dollars, the revolving loans and the letters of credit are available in U.S. Dollars, Euros, Pounds Sterling, and any other currency agreed to by the administrative agent and each of the lenders. The revolving credit facility contains a maximum leverage ratio covenant, compliance with which is a condition to the Company's ability to borrow. In May 2024, the Company extended the maturity date of the revolving credit facility from May 2028 to May 2029 pursuant to an extension request under the credit agreement.\n77\nBorrowings under the revolving credit facility will bear interest at a rate determined by reference to benchmark rates plus an applicable spread (ranging from \n0\n% to \n1.375\n%) based on the Company's leverage or credit rating at the time of the borrowing. Undrawn balances available under the revolving credit facility are subject to commitment fees at the applicable rate determined by reference to the Company's leverage or credit rating. At December 31, 2024 and 2023, there were \nno\n borrowings outstanding and $\n26\n million and $\n18\n million, respectively, of letters of credit issued under the revolving credit facility. \nOutstanding\n \nDebt\n \nOutstanding debt consists of the following: \nDecember 31, 2024\nDecember 31, 2023\n(in millions)\nOutstanding\n \nPrincipal \nAmount\nCarrying\n \nValue\n (1)\nOutstanding\n \nPrincipal \nAmount\nCarrying\n \nValue\n (1)\n2.375\n% (€\n1\n Billion) Senior Notes due September 2024 \n(2)\n$\n—\n \n$\n—\n \n$\n1,105\n \n$\n1,104\n \n3.65\n% Senior Notes due March 2025 \n(3)\n500\n \n500\n \n500\n \n499\n \n0.1\n% (€\n950\n Million) Senior Notes due March 2025 \n(3)\n984\n \n984\n \n1,050\n \n1,048\n \n0.75\n% Convertible Senior Notes due May 2025 \n(2)(3)\n784\n \n261\n \n862\n \n857\n \n3.6\n% Senior Notes due June 2026\n1,000\n \n999\n \n1,000\n \n998\n \n4.0\n% (€\n750\n Million) Senior Notes due November 2026\n777\n \n775\n \n828\n \n825\n \n1.8\n% (€\n1\n Billion) Senior Notes due March 2027\n1,035\n \n1,034\n \n1,105\n \n1,103\n \n3.55\n% Senior Notes due March 2028\n500\n \n499\n \n500\n \n499\n \n0.5\n% (€\n750\n Million) Senior Notes due March 2028\n777\n \n774\n \n828\n \n825\n \n3.625\n% (€\n500\n Million) Senior Notes due November 2028\n518\n \n516\n \n552\n \n549\n \n3.5\n% (€\n500\n Million) Senior Notes due March 2029\n518\n \n516\n \n—\n \n—\n \n4.25\n% (€\n750\n Million) Senior Notes due May 2029\n777\n \n772\n \n828\n \n823\n \n4.625\n% Senior Notes due April 2030\n1,500\n \n1,494\n \n1,500\n \n1,492\n \n4.5\n% (€\n1\n Billion) Senior Notes due November 2031\n1,035\n \n1,030\n \n1,105\n \n1,098\n \n3.625\n% (€\n650\n Million) Senior Notes due March 2032\n673\n \n669\n \n—\n \n—\n \n3.25\n% (€\n600\n Million) Senior Notes due November 2032\n621\n \n614\n \n—\n \n—\n \n4.125\n% (€\n1.25\n Billion) Senior Notes due May 2033\n1,294\n \n1,282\n \n1,381\n \n1,367\n \n4.75\n% (€\n1\n Billion) Senior Notes due November 2034\n1,035\n \n1,028\n \n1,105\n \n1,097\n \n3.75\n% (€\n850\n Million) Senior Notes due March 2036\n880\n \n866\n \n—\n \n—\n \n3.75\n% (€\n500\n Million) Senior Notes due November 2037\n518\n \n514\n \n—\n \n—\n \n4.0\n% (€\n750\n Million) Senior Notes due March 2044\n777\n \n762\n \n—\n \n—\n \n3.875\n% (€\n700\n Million) Senior Notes due March 2045\n725\n \n709\n \n—\n \n—\n \nTotal outstanding debt\n$\n17,228\n \n$\n16,598\n \n$\n14,249\n \n$\n14,184\n \nShort-term debt\n2,268\n \n1,745\n \n1,967\n \n1,961\n \nLong-term debt\n$\n14,960\n \n$\n14,853\n \n$\n12,282\n \n$\n12,223\n \n(1)    The carrying values differ from the outstanding principal amounts due to unamortized debt discounts and debt issuance costs of $\n630\n million and $\n65\n million as of December 31, 2024 and 2023, respectively.\n(2)    Included in \"Short-term debt\" in the Consolidated Balance Sheet as of December 31, 2023.\n(3)    Included in \"Short-term debt\" in the Consolidated Balance Sheet as of December 31, 2024.\nFair Value of Debt\nAt December 31, 2024 and 2023, the estimated fair value of the outstanding debt was approximately $\n18.8\n billion and $\n15.2\n billion, respectively, and was considered a \"Level 2\" fair value measurement (see Note 2). The fair values were estimated based upon actual trades at the end of the reporting period or the most recent trade available as well as the Company's stock price at the end of the reporting period. The estimated fair value of the Company's debt in excess of the outstanding principal amount at December 31, 2024 and 2023 primarily relates to the conversion premium, which is the conversion value in excess of the principal amount, on the convertible senior notes due in May 2025. \n78\nConvertible Senior Notes \nIn April 2020, the Company issued $\n863\n million aggregate principal amount of convertible senior notes due in May 2025 with an interest rate of \n0.75\n% (the \"May 2025 Notes\"). The May 2025 Notes are convertible, subject to certain conditions, into the Company's common stock at a current conversion price of $\n1,869.86\n per share. The May 2025 Notes were convertible, at the option of the holder, prior to November 1, 2024, upon the occurrence of specific events, including but not limited to a change in control, or if the closing sales price of the Company's common stock for at least \n20\n trading days in the period of \n30\n consecutive trading days ending on the last trading day of the immediately preceding calendar quarter was more than \n130\n% of the conversion price in effect for the notes on the last trading day of the immediately preceding quarter. In the event that all or substantially all of the Company's common stock is acquired on or prior to the maturity of the May 2025 Notes in a transaction in which the consideration paid to holders of the Company's common stock consists of all or substantially all cash, the Company would be required to make additional payments in the form of shares of common stock to the holders of the May 2025 Notes in an aggregate value ranging from $\n0\n to $\n235\n million depending upon the date of the transaction and the then current stock price of the Company. Starting on November 1, 2024, holders have the right to convert all or any portion of the May 2025 Notes, regardless of the Company's stock price. The May 2025 Notes may not be redeemed by the Company prior to maturity. The holders may require the Company to repurchase the May 2025 Notes for cash in certain circumstances. Interest on the May 2025 Notes is payable on May 1 and November 1 of each year. Prior to November 2024, if the note holders exercised their option to convert, the Company delivered cash to repay the principal amount of the May 2025 Notes and had the option to deliver shares of the Company's common stock or cash, to satisfy the conversion premium. As of November 1, 2024, note holders are entitled to repayment of the principal amount of the May 2025 Notes in cash, and if they exercise their option to convert, the note holders are entitled to cash payment for the conversion premium, settled at maturity. Based on the closing sales prices of the Company's common stock for the prescribed measurement periods, the May 2025 Notes were convertible at the option of the holder starting the second calendar quarter of 2023 until November 1, 2024, when they became convertible regardless of the Company's stock price. The May 2025 Notes are classified as \"Short-term debt\" in the Consolidated Balance Sheets as of December 31, 2024 and 2023. At December 31, 2024 and 2023, the estimated fair value of the May 2025 Notes was $\n2.1\n billion and $\n1.6\n billion, respectively, and was considered a \"Level 2\" fair value measurement (see Note 2). For the years ended December 31, 2023, and 2022, the weighted-average effective interest rate related to the May 2025 Notes was \n1.2\n%. During the year ended December 31, 2024, the Company paid $\n198\n million in aggregate upon the conversion of the May 2025 Notes at the holders' option, to repay the principal amount of $\n78\n million due upon conversion and an additional $\n120\n million conversion premium.\nUpon issuance and subsequent balance sheet-date reassessments through September 30, 2024, the conversion option on the May 2025 Notes qualified for the equity scope exception under ASC 815 Derivatives and Hedging (\"ASC 815\") because the Company had the option to deliver either cash or shares of the Company's common stock to satisfy the conversion premium. Under such exception, the conversion option is not required to be accounted for as a separate instrument. On November 1, 2024, the Company irrevocably elected to settle the conversion premium in cash. Upon that election, the conversion option no longer qualified for the exception and was deemed to be an embedded derivative which required bifurcation from the debt contract. Upon bifurcation of the conversion option, the Company recorded an embedded derivative liability at fair value of $\n1.2\n billion, a debt discount of $\n783\n million reducing the carrying value of the May 2025 Notes to zero, and a loss of $\n428\n million. The debt discount is amortized over the remaining term of the May 2025 Notes using the straight-line method. The fair value of the embedded derivative liability (considered a \"Level 2\" fair value measurement; see Note 2), was $\n1.3\n billion at December 31, 2024 and is included in \"Accrued expenses and other current liabilities\" in the Consolidated Balance Sheet. The unamortized debt discount and debt issuance costs was $\n523\n million at December 31, 2024.\nThe Company recognized the following charges related to the conversion option on the May 2025 Notes in its Consolidated Statement of Operations:\n(in millions)\nClassification in Consolidated Statements of Operations\nYear Ended \nDecember 31, 2024\nChange in fair value of the embedded derivative, including loss on bifurcation\nOther income (expense), net\n$\n517\n \nAmortization of debt discount\nInterest expense\n261\n \nOther\nOther income (expense), net\n18\n \nTotal charges\n$\n796\n \n79\nNonconvertible Senior Notes\nThe following table summarizes the information related to nonconvertible senior notes outstanding at December 31, 2024:\nNonconvertible Senior Notes\nDate of Issuance\nEffective Interest Rate \n(1)\nTiming of Interest Payments\n3.65\n% Senior Notes due March 2025\nMarch 2015\n3.76\n \n%\nSemi-annually in March and September\n0.1\n% Senior Notes due March 2025\nMarch 2021\n0.30\n \n%\nAnnually in March\n3.6\n% Senior Notes due June 2026\nMay 2016\n3.70\n \n%\nSemi-annually in June and December\n4.0\n% Senior Notes due November 2026\nNovember 2022\n4.08\n \n%\nAnnually in November\n1.8\n% Senior Notes due March 2027\nMarch 2015\n1.86\n \n%\nAnnually in March\n3.55\n% Senior Notes due March 2028\nAugust 2017\n3.63\n \n%\nSemi-annually in March and September\n0.5\n% Senior Notes due March 2028\nMarch 2021\n0.63\n \n%\nAnnually in March\n3.625\n% Senior Notes due November 2028\nMay 2023\n3.74\n \n%\nAnnually in November\n3.5\n% Senior Notes due March 2029\nMarch 2024\n3.61\n \n%\nAnnually in March\n4.25\n% Senior Notes due May 2029\nNovember 2022\n4.35\n \n%\nAnnually in May\n4.625\n% Senior Notes due April 2030\nApril 2020\n4.72\n \n%\nSemi-annually in April and October\n4.5\n% Senior Notes due November 2031\nNovember 2022\n4.57\n \n%\nAnnually in November\n3.625\n% Senior Notes due March 2032\nMarch 2024\n3.71\n \n%\nAnnually in March\n3.25\n% Senior Notes due November 2032\nNovember 2024\n3.41\n \n%\nAnnually in November\n4.125\n% Senior Notes due May 2033\nMay 2023\n4.26\n \n%\nAnnually in May\n4.75\n% Senior Notes due November 2034\nNovember 2022\n4.81\n \n%\nAnnually in November\n3.75\n% Senior Notes due March 2036\nMarch 2024\n3.92\n \n%\nAnnually in March\n3.75\n% Senior Notes due November 2037\nNovember 2024\n3.81\n \n%\nAnnually in November\n4.0\n% Senior Notes due March 2044\nMarch 2024\n4.15\n \n%\nAnnually in March\n3.875\n% Senior Notes due March 2045\nNovember 2024\n4.03\n \n%\nAnnually in March\n(1)    Represents the coupon interest rate adjusted for deferred debt issuance costs, premiums or discounts existing at the origination of the debt.\nIn 2024, the Company issued senior notes with varying maturities for aggregate cash proceeds of $\n4.8\n billion. The proceeds from the issuance of the senior notes issued in 2024 are available for general corporate purposes, including to repurchase shares of the Company's common stock and to redeem or repay outstanding indebtedness.\nIn 2024, the Company paid $\n1.1\n billion on the maturity of the Senior Notes due September 2024. In 2023, the Company paid $\n500\n million on the maturity of Senior Notes due March 2023. In 2022, the Company paid $\n778\n million and $\n1.1\n billion on the maturity of Senior Notes due November 2022 and March 2022, respectively. In addition, the Company paid the applicable accrued and unpaid interest relating to these senior notes. \nInterest expense related to nonconvertible senior notes consists primarily of coupon interest expense of $\n527\n million, $\n409\n million, and $\n241\n million for the years ended December 31, 2024, 2023, and 2022, respectively. Debt discount and debt issuance costs for such notes are amortized using the effective interest rate method over the period from the origination date through the stated maturity date. \"Interest expense\" in the Consolidated Statements of Operations also includes interest expense related to the Company's cash management activities (with related income recorded in \"Other income (expense), net\" in the Consolidated Statements of Operations).\nEach of the Company's senior notes are unsecured and rank equally in right of payment with all of the Company's other senior unsecured notes.\nThe Company designates certain portions of the aggregate principal value of the Euro-denominated debt as a hedge of the foreign currency exposure of the net investment in certain Euro functional currency subsidiaries. For the years ended December 31, 2024 and 2023, the carrying value of the portion of Euro-denominated debt, designated as a net investment hedge, ranged from $\n2.3\n billion to $\n5.3\n billion and from $\n3.1\n billion to $\n8.4\n billion, respectively. The foreign currency transaction gains or losses on the Euro-denominated debt that is designated as a hedging instrument for accounting purposes are recorded in \"Accumulated other comprehensive loss\" in the Consolidated Balance Sheets. The foreign currency transaction gains or losses on the Euro-denominated debt that is not designated as a hedging instrument are recognized in \"Other income (expense), net\" in the Consolidated Statements of Operations.\n80\n13.    \nTREASURY STOCK AND DIVIDENDS\n \nAt December 31, 2024 and 2023, the Company had a total remaining authorization of $\n7.7\n billion and $\n13.7\n billion, respectively, related to a program authorized by the Company's Board of Directors (\"the Board\") in 2023 to repurchase up to $\n20\n billion of the Company's common stock. The Company expects to complete the share repurchases under the remaining authorization by the end of 2026, assuming no major downturn in the travel market. In January 2025, the Board authorized a program to repurchase up to an additional $\n20\n billion of the Company's common stock. Additionally, the Board has given the Company the general authorization to repurchase shares of its common stock withheld to satisfy employee withholding tax obligations related to stock-based compensation. \nThe following table summarizes the Company's stock repurchase activities during the years ended December 31, 2024, 2023, and 2022:\nYear Ended December 31,\n(in millions, except for shares, which are reflected in thousands)\n2024\n2023\n2022\nShares\nAmount\nShares\nAmount\nShares\nAmount\nAuthorized stock repurchase programs \n1,581\n \n$\n6,104\n \n3,660\n \n$\n10,249\n \n3,320\n \n$\n6,526\n \nGeneral authorization for shares withheld on stock award vesting\n98\n \n347\n \n72\n \n194\n \n80\n \n167\n \nTotal\n1,679\n$\n6,451\n \n3,732\n$\n10,443\n \n3,400\n \n$\n6,693\n \nStock repurchases of $\n20\n million in December 2024 were settled in January 2025. Stock repurchases of $\n40\n million in December 2023 were settled in January 2024. For the years ended December 31, 2024, 2023, and 2022, the Company remitted employee withholding taxes of $\n345\n million, $\n194\n million, and $\n165\n million, respectively, to the tax authorities, which is different from the aggregate cost of the shares withheld for taxes for each year due to the timing in remitting the taxes. The cash remitted to the tax authorities is included in financing activities in the Consolidated Statements of Cash Flows. \nEffective January 1, 2023, the Inflation Reduction Act of 2022 has mandated a 1% excise tax on share repurchases. Excise tax obligations that result from the Company's share repurchases are accounted for as a cost of the treasury stock transaction. As of December 31, 2024 and 2023, the Company recorded estimated liabilities of $\n56\n million and $\n96\n million, respectively, related to excise taxes on share repurchases, which are included in \"Accrued expenses and other current liabilities\" in the Consolidated Balance Sheets. During the year ended December 31, 2024, the Company remitted excise taxes of $\n96\n million to the tax authorities, which is included in financing activities in the Consolidated Statement of Cash Flows.\nDuring 2024, the Board adopted a dividend policy pursuant to which the Company pays quarterly cash dividends on its common stock. Declaration of dividends will be subject to the Board's consideration of, among other things, the Company's financial performance, cash flows, capital needs, and liquidity. During the year ended December 31, 2024, the Board declared quarterly cash dividends of $\n8.75\n per share of common stock and the Company paid cash dividends of $\n1.2\n billion in total. In February 2025, the Board declared a cash dividend of $\n9.60\n per share of common stock, payable on March 31, 2025 to stockholders of record as of the close of business on March 7, 2025.\n81\n14.    \nCHANGES IN ACCUMULATED OTHER COMPREHENSIVE LOSS BY COMPONENT \n \nThe table below presents the changes in the balances of accumulated other comprehensive loss (\"AOCI\") by component for the years ended December 31, 2024, 2023, and 2022:\n(in millions)\nForeign currency translation adjustments\nNet unrealized gains (losses) on available-for-sale securities\nTotal AOCI, net of tax\nForeign currency translation\nNet investment \nhedges \n(1)\nTotal, net of tax\nBefore tax\nTax\nTotal, net of tax\nBefore tax\nTax \n(2)\nBefore tax\nTax\nBalance, December 31, 2021\n$\n(\n276\n)\n$\n67\n \n$\n91\n \n$\n(\n28\n)\n$\n(\n146\n)\n$\n3\n \n$\n(\n1\n)\n$\n2\n \n$\n(\n144\n)\nOther comprehensive (loss) income (\"OCI\") for the period\n(\n303\n)\n26\n \n219\n \n(\n53\n)\n(\n111\n)\n(\n16\n)\n4\n \n(\n12\n)\n(\n123\n)\nBalance, December 31, 2022\n$\n(\n579\n)\n$\n93\n \n$\n310\n \n$\n(\n81\n)\n$\n(\n257\n)\n$\n(\n13\n)\n$\n3\n \n$\n(\n10\n)\n$\n(\n267\n)\nOCI for the period\n42\n \n1\n \n(\n139\n)\n33\n \n(\n63\n)\n9\n \n(\n2\n)\n7\n \n(\n56\n)\nBalance, December 31, 2023\n$\n(\n537\n)\n$\n94\n \n$\n171\n \n$\n(\n48\n)\n$\n(\n320\n)\n$\n(\n4\n)\n$\n1\n \n$\n(\n3\n)\n$\n(\n323\n)\nOCI for the period\n(\n232\n)\n36\n \n185\n \n(\n44\n)\n(\n55\n)\n4\n \n(\n1\n)\n3\n \n(\n52\n)\nBalance, December 31, 2024\n$\n(\n769\n)\n$\n130\n \n$\n356\n \n$\n(\n92\n)\n$\n(\n375\n)\n$\n—\n \n$\n—\n \n$\n—\n \n$\n(\n375\n)\n(1)    Net investment hedges balance at December 31, 2024 and earlier dates presented above, includes accumulated net losses from fair value adjustments of $\n35\n million ($\n53\n million before tax) associated with previously settled derivatives that were designated as net investment hedges. The remaining balances relate to foreign currency transaction gains (losses) and related tax benefits (expenses) associated with the Company's Euro-denominated debt that is designated as a hedge of the foreign currency exposure of the net investment in certain Euro functional currency subsidiaries (see Notes 2 and 12). \n(2)    The tax benefits relate to foreign currency translation adjustments to the Company's one-time deemed repatriation tax liability recorded at December 31, 2017 and foreign earnings for periods after December 31, 2017 that are subject to U.S. federal and state income tax, resulting from the enactment of the Tax Act.\n \n15.    \nINCOME TAXES \n \nThe composition of pre-tax income (loss) for the years ended December 31, 2024, 2023, and 2022 is as follows:\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nInternational\n$\n8,029\n \n$\n6,119\n \n$\n4,717\n \nU.S. \n(\n737\n)\n(\n638\n)\n(\n794\n)\nTotal\n$\n7,292\n \n$\n5,481\n \n$\n3,923\n \nProvision for Income Taxes\n \nThe composition of income tax expense for the years ended December 31, 2024, 2023, and 2022 is as follows: \nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nCurrent income tax expense (benefit):\nInternational\n$\n1,545\n \n$\n1,371\n \n$\n1,145\n \nU.S. Federal\n(\n235\n)\n291\n \n(\n8\n)\nU.S. State\n2\n \n8\n \n(\n15\n)\nCurrent income tax expense (benefit):\n1,312\n \n1,670\n \n1,122\n \nDeferred income tax expense (benefit):\nInternational\n25\n \n(\n47\n)\n(\n61\n)\nU.S. Federal\n51\n \n(\n411\n)\n(\n172\n)\nU.S. State\n22\n \n(\n20\n)\n(\n24\n)\nDeferred income tax expense (benefit)\n98\n \n(\n478\n)\n(\n257\n)\nIncome tax expense\n$\n1,410\n \n$\n1,192\n \n$\n865\n \n \nIncome tax liabilities of $\n905\n million and $\n1.0\n billion are included in \"Accrued expenses and other current liabilities\" in the Consolidated Balance Sheets at December 31, 2024 and 2023, respectively.\n82\nU.S. Tax Reform\nIn December 2017, the Tax Act was enacted into law in the U.S. The Tax Act made significant changes to U.S. federal tax law, including a one-time deemed repatriation tax on accumulated unremitted international earnings, to be paid over eight years. In 2024, the Company reduced its income tax expense that was recorded during the year ended December 31, 2018 by $\n416\n million relating to its federal one-time deemed repatriation liability. The reduction in expense resulted from a recent U.S. Tax Court decision in Varian Medical Systems, Inc. vs. Commissioner. Under the Tax Act, the Company's future cash generated by the Company's international operations can generally be repatriated without further U.S. federal income tax, but will be subject to U.S. state income taxes and international withholding taxes, which have been accrued by the Company. The Tax Act also introduced in 2018 a tax on 50% of GILTI, which is income determined to be in excess of a specified routine rate of return, and a base erosion and anti-abuse tax (\"BEAT\") aimed at preventing the erosion of the U.S. tax base. The Company has adopted an accounting policy to treat taxes on GILTI as period costs.\nSeveral countries outside the U.S. have adopted rules, effective January 1, 2024, that impose a \n15\n% minimum global tax. This is in response to the framework set forth by the Organisation for Economic Co-operation and Development with respect to its base erosion and profit shifting project. The impact of these rules have been reflected in our 2024 income tax expense. \nDeferred Income Taxes\n \nThe Company utilized $\n309\n million of its U.S. NOLs to reduce its U.S. federal tax liability for the deemed repatriation tax. After utilization of available NOLs, at December 31, 2024, the Company had U.S. federal NOLs of $\n462\n million, the majority of which do not have an expiration date, and U.S. state NOLs of $\n370\n million, which mainly begin to expire in years ending December 31, 2032 and forward. In addition, at December 31, 2024, the Company had $\n796\n million of non-U.S. NOLs, the majority of which do not have an expiration date, and $\n51\n million of U.S. research tax credit and foreign tax credit carryforwards available to reduce future tax liabilities. \nThe utilization of these NOLs and credits is dependent upon the Company's ability to generate sufficient future taxable income and the tax laws in the jurisdictions where the losses were generated. The Company periodically evaluates the likelihood of the realization of deferred tax assets, and reduces the carrying amount of these deferred tax assets by a valuation allowance to the extent it believes a portion will not be realized. The Company considers many factors when assessing the likelihood of future realization of the deferred tax assets, including its recent cumulative earnings experience by taxing jurisdiction, expectations of future income, tax planning strategies, the carryforward periods available for tax reporting purposes and other relevant factors.\n83\nThe tax effects of temporary differences that give rise to significant portions of deferred tax assets and liabilities at December 31, 2024 and 2023 are as follows:\nDecember 31,\n(in millions)\n2024\n2023\nDeferred tax assets:\n \n \nNet operating loss carryforward — U.S.\n$\n117\n \n$\n89\n \nNet operating loss carryforward — International\n156\n \n200\n \nAccrued expenses\n83\n \n70\n \nStock-based compensation\n55\n \n47\n \nUnrealized losses on investments\n67\n \n83\n \nForeign currency translation adjustments\n103\n \n66\n \nTax credits\n45\n \n39\n \nOperating lease liabilities\n22\n \n20\n \nProperty and equipment\n234\n \n195\n \nEmbedded derivative liability\n123\n \n—\n \nOther\n—\n \n16\n \nTotal deferred tax assets\n1,005\n \n825\n \nValuation allowance on deferred tax assets\n(\n111\n)\n(\n114\n)\nDeferred tax assets, net\n894\n \n711\n \nDeferred tax liabilities:\nDebt discount on convertible notes\n(\n123\n)\n—\n \nIntangible assets and other\n(\n110\n)\n(\n140\n)\nEuro-denominated debt\n(\n144\n)\n(\n11\n)\nOperating lease assets\n(\n22\n)\n(\n19\n)\nInstallment sale liability\n(\n118\n)\n(\n118\n)\nOther\n(\n4\n)\n(\n6\n)\nDeferred tax liabilities\n(\n521\n)\n(\n294\n)\nNet deferred tax assets\n (1)\n$\n373\n \n$\n417\n \n(1)    Includes deferred tax assets of $\n662\n million and $\n675\n million at December 31, 2024 and 2023, respectively, included in \"Other assets, net\" in the Consolidated Balance Sheets.\nThe valuation allowance on deferred tax assets at December 31, 2024 includes $\n31\n million related to international operations and $\n80\n million primarily related to certain unrealized losses on equity securities. The valuation allowance on deferred tax assets at December 31, 2023 includes $\n30\n million related to international operations and $\n84\n million primarily related to certain unrealized losses on equity securities. The decrease in the valuation allowance is primarily related to deferred tax assets generated from certain unrealized losses on equity securities.\nThe Company does not intend to indefinitely reinvest its international earnings that were subject to U.S. taxation pursuant to the mandatory deemed repatriation or subject to U.S. taxation as GILTI. \nReconciliation of U.S. Federal Statutory Income Tax Rate to Effective Income Tax Rate \nA significant portion of the Company's taxable earnings is generated in the Netherlands. According to Dutch corporate income tax law, income generated from qualifying innovative activities is taxed at a rate of \n9\n% (\"Innovation Box Tax\") rather than the Dutch statutory rate of \n25.8\n%. A portion of Booking.com's earnings during the years ended December 31, 2024, 2023, and 2022 qualified for Innovation Box Tax treatment, which had a significant beneficial impact on the Company's effective tax rate for those years. \n \n84\nThe effective income tax rate of the Company is different from the amount computed using the expected U.S. statutory federal rate of \n21\n% for the years ended December 31, 2024, 2023, and 2022 as a result of the following items: \nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nIncome tax expense at U.S. federal statutory rate\n$\n1,531\n \n$\n1,151\n \n$\n824\n \nAdjustment due to:\n \n \n \nForeign rate differential\n386\n \n307\n \n264\n \nInnovation Box Tax benefit\n(\n607\n)\n(\n544\n)\n(\n452\n)\nStock-based compensation\n73\n \n59\n \n42\n \nFederal GILTI\n82\n \n24\n \n10\n \nState income tax benefit\n19\n \n(\n9\n)\n(\n31\n)\nValuation allowance\n(\n5\n)\n(\n4\n)\n87\n \nUncertain tax positions\n189\n \n14\n \n72\n \nFines and penalties\n—\n \n144\n \n2\n \nLoss related to the conversion option on convertible senior notes\n167\n \n—\n \n—\n \nTax Act - U.S. transition tax\n(\n416\n)\n1\n \n—\n \nOther\n(\n9\n)\n49\n \n47\n \nIncome tax expense\n$\n1,410\n \n$\n1,192\n \n$\n865\n \n \nUncertain Tax Positions \nThe following is a reconciliation of the total beginning and ending amount of unrecognized tax benefits: \nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nUnrecognized tax benefit — January 1\n$\n67\n \n$\n184\n \n$\n120\n \nGross increases — tax positions in current period\n5\n \n16\n \n3\n \nGross increases — tax positions in prior periods\n193\n \n22\n \n94\n \nGross decreases — tax positions in prior periods\n(\n4\n)\n(\n5\n)\n(\n33\n)\nReduction due to lapse in statute of limitations\n—\n \n(\n3\n)\n—\n \nReduction due to settlements during the current period\n(\n1\n)\n(\n147\n)\n—\n \nUnrecognized tax benefit — December 31\n$\n260\n \n$\n67\n \n$\n184\n \n \nThe increase in unrecognized tax benefits during the year ended December 31, 2024 primarily relates to certain 2018 U.S. federal taxes that are impacted by the recent U.S. Tax Court decision in Varian Medical Systems, Inc. vs. Commissioner. The majority of unrecognized tax benefits are included in \"Other assets, net\" in the Consolidated Balance Sheet as of December 31, 2024. The amount of unrecognized tax benefits, if recognized, that would affect the effective tax rate are $\n236\n million as of December 31, 2024. It is reasonably possible that the balance of gross unrecognized tax benefits could change over the next 12 months. As of December 31, 2024 and 2023, total gross interest and penalties accrued was $\n6\n million and $\n7\n million, respectively. See Note 16 for more information regarding tax contingencies. \nThe Company's major taxing jurisdictions include: the Netherlands, U.S., Singapore, and the United Kingdom (the \"UK\"). The statutes of limitations that remain open related to these major tax jurisdictions are: the Company's Netherlands returns for 2019 and forward, U.S. federal returns for 2018, as well as 2021 and forward, Singapore returns from 2019 and forward, and UK returns for 2021 and forward.\n85\n16.    \nCOMMITMENTS AND CONTINGENCIES\nCompetition and Consumer Protection Reviews \nOnline travel platforms have been the subject of investigations or inquiries by national competition authorities (\"NCAs\") or other governmental authorities regarding competition law matters, consumer protection issues, and other areas. The Company is and has been involved in many such investigations. For example, the Company is involved in investigations related to whether Booking.com's contractual parity arrangements with accommodation providers are anti-competitive because they require partners to provide Booking.com with rates, conditions, and availability at least as favorable as those offered to other OTCs or by the partner itself. To resolve certain of the parity-related investigations, the Company has from time to time made commitments regarding future business practices or activities, such as agreeing to narrow the scope of its parity clauses. Some of these investigations have resulted in fines and the Company could incur additional fines and/or be restricted in certain of its business practices in the future. \nIn 2024, the Comisión Nacional de los Mercados y la Competencia in Spain (the \"CNMC\") imposed a fine of \n413\n million Euros and decided to restrict certain of Booking.com's business practices such as those relating to parity provisions and the ranking criteria that Booking.com can use to determine how to rank hotels in its display to customers. Booking.com does not agree with the rationale stated in the decision and the restrictions imposed, and has filed an appeal. Although the Company disagrees with the rationale stated in the decision, the Company accrued a loss of \n486\n million Euros ($\n530\n million) during the year ended December 31, 2023 (reflecting the initial fine amount in the CNMC's draft decision). As of June 30, 2024, to align with the CNMC's reduced final fine, the Company recorded a decrease of \n72\n million Euros ($\n78\n million) in its accrual. The initial accrual and subsequent decrease are reflected in \"General and administrative\" expenses in the Consolidated Statements of Operations. The related liability is included in \"Accrued expenses and other current liabilities\" in the Consolidated Balance Sheets as of December 31, 2024 and 2023.\nIn September 2017, the Swiss Price Surveillance Office (the \"Swiss PSO\") opened an investigation into the level of commissions of Booking.com in Switzerland. Booking.com anticipates a negative decision ordering a reduction of commission in Switzerland. The exact scope, impact, and timing of its effects will depend on the order. Booking.com does not agree with the rationale underlying this expected negative decision and the restrictions expected to be imposed, and is continuing to engage with the Swiss PSO prior to the order being finalized. If the order were to become final, Booking.com plans to challenge aspects of it. In July 2023, the Polish Office of Competition and Consumer Protection opened an investigation into Booking.com's identification of private and professional hosts and its messaging in relation to obligations owed to consumers, and the investigation is ongoing. In 2024, the Italian Competition Authority (the \"AGCM\") investigated certain Booking.com business practices relating to hotels and other online travel agencies. Booking.com resolved the investigation by making certain commitments to the AGCM regarding its future business practices. If any of the investigations were to find that Booking.com practices violated the respective laws, or as part of a negotiated resolution, Booking.com may face significant fines, restrictions on its business practices, and/or be required to make other commitments.\nThe Company is and has been involved in investigations or inquiries by NCAs or other governmental authorities involving consumer protection matters. The Company has previously made certain voluntary commitments to authorities to resolve investigations or inquiries that have included showing prices inclusive of all mandatory taxes and charges, providing information about the effect of money earned on search result rankings on or before the search results page, adjusting how discounts and statements concerning popularity or availability are shown, and displaying additional customer service details. It is possible new jurisdictions could negotiate with the Company to implement changes to its business. The Company is unable to predict what, if any, effect any future such commitments will have on its business. To the extent that investigations or inquiries result in additional commitments, fines, damages, or other remedies, the Company's business, financial condition, and results of operations could be harmed. \nThe Company is unable to predict how any current or future investigations or litigation may be resolved or the long-term impact of any such resolution on its business. For example, competition and consumer-law-related investigations, legislation, or issues could result in private litigation and the Company is currently involved in such litigation. More immediate results could include, among other things, the imposition of fines, payment of damages, commitments to change certain business practices, or reputational damage, any of which could harm the Company's business, results of operations, brands, or competitive position.\n86\nTax Matters\nBetween December 2018 and August 2021, the Italian tax authorities issued assessments on Booking.com's Italian subsidiary totaling approximately \n251\n million Euros ($\n260\n million) for the tax years 2013 through 2018, asserting that its transfer pricing policies were inadequate. The Company believes Booking.com has been and continues to be in compliance with Italian tax law. In September 2020, the Italian tax authorities approved the opening of a mutual agreement procedure (\"MAP\") between Italy and the Netherlands for the 2013 tax year and the Italian tax authorities subsequently approved the inclusion of the tax years 2014 through 2018 in the MAP. Based on the Company's expectation that the Italian assessments for 2013 through 2018, and any transfer pricing assessments received for subsequent open years, will be settled through the MAP process, and after considering potential resolution amounts, \n33\n million Euros ($\n34\n million) have been reflected in net unrecognized tax benefits, the majority of which is recorded to \"Other assets, net\" in the Consolidated Balance Sheets at December 31, 2024 and 2023. This unrecognized tax benefit is partially offset by a deferred income tax benefit of \n15\n million Euros ($\n16\n million). As of December 31, 2024, the Company made prepayments of \n74\n million Euros ($\n77\n million) to the Italian tax authorities to forestall collection enforcement pending the appeal phase of the case. The payments do not constitute an admission that the Company owes the taxes and will be refunded (with interest) to the Company to the extent that the Company prevails. The payments are included in \"Other assets, net\" in the Consolidated Balance Sheets at December 31, 2024 and 2023.\nIn June 2024, the Guardia di Finanza (\"GdF\") of Rome issued a tax audit report to Booking.com, proposing a tax assessment to the Italian Tax Authorities (\"ITA\") of \n396\n million Euros ($\n410\n million), excluding penalties and interest, for June 2017 through December 2023. The GdF alleged that a 2017 law (the \"STR Law\") obliged Booking.com to withhold and remit 21% of the total transaction value for the income tax liabilities of certain short-term rental partners in Italy for the period under audit. While the Company believes that Booking.com has been and continues to be in compliance with Italian tax laws, in November 2024, the Company entered into a settlement agreement with the ITA without admitting liability and paid \n313\n million Euros ($\n332\n million) to resolve the matter. The settlement is reflected in \"General and administrative\" expenses in the Consolidated Statement of Operations for the year ended December 31, 2024.\nThe Company is also involved in other tax-related audits, investigations, and litigation relating to income taxes, value-added taxes, travel transaction taxes (e.g., hotel occupancy taxes), withholding taxes, and other taxes. \nAny taxes or assessments in excess of the Company's tax provisions, including the resolution of any tax proceedings or litigation, could have a material adverse impact on the Company's results of operations, cash flows, and financial condition. In some cases, assessments may be significantly in excess of the Company's tax provisions, particularly in instances where the Company does not agree with the tax authority's assessment of how the tax laws may apply to the Company's business.\nOther Matters\nBeginning in 2014, Booking.com B.V. received several letters from the Netherlands Pension Fund for the Travel Industry (Reiswerk) (\"BPF\") claiming that it was required to participate in the mandatory pension scheme of the BPF with retroactive effect to 1999, which has a higher contribution rate than the pension scheme in which it is currently participating. BPF instituted legal proceedings and in 2016 the District Court of Amsterdam rejected all of BPF's claims. BPF appealed the decision to the Court of Appeal, and, in May 2019, the Court of Appeal also rejected all of BPF's claims, in each case by ruling that Booking did not meet the definition of a travel intermediary for purposes of the mandatory pension scheme. BPF then appealed to the Netherlands Supreme Court. In April 2021, the Supreme Court overturned the previous decision of the Court of Appeal and held that Booking.com B.V. met the definition of a travel intermediary for the purposes of the mandatory pension scheme. The Supreme Court ruled only on the qualification of Booking.com B.V. as a travel intermediary for the purposes of the mandatory pension scheme and did not rule on the various other defenses brought forward by the Company against BPF's claims. The Supreme Court referred the matter to another Court of Appeal to assess the other defenses brought forward by the Company. In January 2024, that Court of Appeal ruled that Booking.com B.V. is required to participate in the mandatory pension scheme of the BPF with retroactive effect to 1999. The Company has filed an appeal of the decision to the Netherlands Supreme Court. Although the Company disagrees with the decision, it accrued a loss of \n253\n million Euros ($\n276\n million), included in \"Personnel\" expenses in the Consolidated Statement of Operations for the year ended December 31, 2023. During the year ended December 31, 2024, the Company recorded additional estimated expenses of \n72\n million Euros ($\n77\n million) included in \"Personnel\" expenses in the Consolidated Statements of Operations. The related liability is included in \"Accrued expenses and other current liabilities\" in the Consolidated Balance Sheets as of December 31, 2024 and 2023. On a go-forward basis, Booking.com B.V. expects to begin paying pension premiums to the BPF scheme or to increase contributions to the benefit of employees under its existing pension scheme.\nFrom time to time, the Company notifies the competent data protection authority, such as the Dutch data protection authority in accordance with its obligations under the General Data Protection Regulation, of certain data security incidents. Should, for example, the Dutch data protection authority decide these incidents were the result of inadequate technical and organizational security measures or practices, it may impose a fine or require other commitments. \n87\nThe Company has been, is currently, and expects to continue to be, subject to legal proceedings and claims in the ordinary course of business, including claims of alleged infringement of third-party intellectual property rights. Such claims could result in the expenditure of significant financial and managerial resources, divert management's attention, and adversely affect the Company's business, reputation, results of operations, and cash flows.\nThe Company accrues for certain other legal contingencies where it is probable that a loss has been incurred and the amount can be reasonably estimated. Such accrued amounts are not material to the Company's balance sheets and provisions recorded have not been material to the Company's results of operations or cash flows.\nOther Contractual Obligations and Contingencies\nThe Company had $\n650\n million and $\n533\n million of standby letters of credit and bank guarantees issued on behalf of the Company as of December 31, 2024 and 2023, respectively, including those issued under the revolving credit facility. These were obtained primarily for regulatory purposes. See Note 12 for information related to letters of credit issued under the revolving credit facility.\nBooking.com offers partner liability insurance that provides protection to certain accommodation partners (\"home partners\") in instances where a reservation has been made via Booking.com. The partner liability insurance may provide those home partners (both owners and property managers) coverage up to $\n1\n million equivalent per occurrence, subject to limitations and exclusions, against third-party lawsuits claims for bodily injury, or third party personal property damage that occurred during a stay booked through Booking.com. Booking.com retains certain financial risks related to this insurance offering, which is underwritten by third party insurance companies.\n17.    \nSEGMENT REPORTING AND GEOGRAPHIC INFORMATION\nSee Note 1 for a description of the Company's business. The Company's portfolio of brands is organized into \nfour\n operating segments. The Company determined its operating segments based on how its chief operating decision maker (\"CODM\"), who is the Chief Executive Officer and President, manages the business, makes operating decisions, and evaluates operating performance. The operating segments are aggregated into \none\n reportable segment based on the similarity in economic characteristics, other qualitative factors, and the objectives and principles of ASC 280,\n Segment Reporting\n.\nThe CODM reviews revenues and an adjusted measure of earnings before interest, taxes, depreciation, and amortization less additions to property and equipment (\"Adjusted EBITDA less Capex\") for each operating segment. \nThe following table presents information for the Company's reportable segment. Other segment items include operating expenses such as general and administrative and information technology. See Note 2 for additional information on these expenses.\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nTotal revenues\n$\n23,739\n \n$\n21,365\n \n$\n17,090\n \nMarketing expenses\n7,278\n \n6,773\n \n5,993\n \nSales and other expenses\n3,104\n \n2,744\n \n1,986\n \nPersonnel expenses\n3,133\n \n2,818\n \n2,310\n \nOther segment items\n2,045\n \n2,010\n \n1,694\n \nSegment Adjusted EBITDA less Capex\n$\n8,179\n \n$\n7,020\n \n$\n5,107\n \nDecisions to allocate resources to each operating segment are made predominantly through the budgeting and forecasting process. The CODM reviews budget-to-actual variances for revenues and Adjusted EBITDA less Capex to assess performance of the operating segments. The information is also used as a basis for determining compensation for certain employees. Estimates and judgments are made in allocating certain revenues and Adjusted EBITDA less Capex to operating segments due to the integrated nature of the operating segments in the underlying transactions. The allocation process is consistent with the manner in which the CODM assesses the performance of the operating segments. Information on segment assets is not presented as depreciation and amortization is not included in measuring Adjusted EBITDA less Capex.  \n88\nThe following table presents the reconciliation of the Company's segment Adjusted EBITDA less Capex to Income before income taxes:\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nSegment Adjusted EBITDA less Capex\n$\n8,179\n \n$\n7,020\n \n$\n5,107\n \nAdditions to property and equipment\n445\n \n395\n \n435\n \nAccruals related to the Netherlands pension fund matter \n(1)\n—\n \n(\n276\n)\n—\n \n Accruals related to fine imposed by the Spanish Competition authority\n (1)\n78\n \n(\n530\n)\n—\n \nAccruals related to settlements of indirect tax matters\n (1)\n(\n337\n)\n(\n62\n)\n(\n46\n)\nTermination fee related to an acquisition agreement\n (2)\n—\n \n(\n90\n)\n—\n \nDepreciation and amortization\n (3)\n(\n591\n)\n(\n504\n)\n(\n451\n)\nTransformation costs\n (4)\n(\n34\n)\n—\n \n—\n \nLoss on assets classified as held for sale \n(5)\n—\n \n—\n \n(\n36\n)\nGain on sale and leaseback transaction \n(5)\n—\n \n—\n \n240\n \nInterest expense\n (3)\n(\n1,295\n)\n(\n897\n)\n(\n391\n)\nInterest and dividend income\n (3)\n1,114\n \n1,020\n \n219\n \nNet gains (losses) on equity securities\n (6)\n63\n \n(\n131\n)\n(\n963\n)\nForeign currency transaction gains (losses) on the remeasurement of certain Euro-denominated debt and accrued interest and debt-related foreign currency derivative instruments \n(6)\n539\n \n(\n163\n)\n56\n \nLoss related to the conversion option on convertible senior notes \n(7)\n(\n535\n)\n—\n \n—\n \nOther \n(8)\n(\n334\n)\n(\n301\n)\n(\n247\n)\nIncome before income taxes\n$\n7,292\n \n$\n5,481\n \n$\n3,923\n \n(1)    See Note 16 for additional information.\n(2)    See Note 22 for additional information.\n(3)    See Consolidated Statements of Operations.\n(4)    See Note 20 for additional information.\n(5)    See Note 21 for additional information.\n(6)    See Note 18 for additional information.\n(7)    See Note 12 for additional information.\n(8)    Primarily consists of the expenses of corporate headquarters and certain other functional departments.\n \nStock-based compensation included in the determination of segment Adjusted EBITDA less Capex was $\n522\n million, $\n447\n million, and $\n347\n million for the years ended December 31, 2024, 2023, and 2022, respectively.\n89\nGeographic Information\nThe Company's revenues from its businesses outside of the U.S. consists of the results of Booking.com and Agoda in their entirety and the results of the KAYAK and OpenTable businesses located outside of the U.S. This classification is independent of where the consumer resides, where the consumer is physically located while using the Company's services, or the location of the travel service provider or restaurant. For example, a reservation made through Booking.com at a hotel in New York by a consumer in the U.S. is part of the results of the Company's businesses outside of the U.S. \nThe Company's geographic information on revenues for the years ended December 31, 2024, 2023, and 2022 is as follows: \n(in millions)\nU.S.\nOutside of\n the U.S. \n(1)\nTotal\nCompany\nDecember 31, 2024\n$\n2,485\n \n$\n21,254\n \n$\n23,739\n \nDecember 31, 2023\n2,327\n \n19,038\n \n21,365\n \nDecember 31, 2022\n2,205\n \n14,885\n \n17,090\n \n(1)    Includes $\n18.6\n billion, $\n17.0\n billion, and $\n13.4\n billion for the years ended December 31, 2024, 2023, and 2022, respectively, attributed to an entity domiciled in the Netherlands.\n \nThe following table presents information on the Company's property and equipment (excluding capitalized software) and operating lease assets based on location of the assets at December 31, 2024 and 2023:\nU.S.\nOutside of the U.S.\nTotal\nCompany\n(in millions)\nThe Netherlands\nUnited Kingdom\nOther\nDecember 31, 2024\n$\n129\n \n$\n405\n \n$\n168\n \n$\n243\n \n$\n945\n \nDecember 31, 2023\n127\n \n476\n \n209\n \n229\n \n1,041\n \n18.    \nOTHER INCOME (EXPENSE), NET\nThe components of other income (expense), net included the following: \nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nForeign currency transaction gains (losses) \n(1)\n$\n383\n \n$\n(\n348\n)\n$\n(\n43\n)\nNet gains (losses) on equity securities \n(2)\n63\n \n(\n131\n)\n(\n963\n)\nLoss related to the conversion option on convertible senior notes \n(3)\n(\n517\n)\n—\n \n—\n \nOther \n(\n11\n)\n2\n \n(\n1\n)\nOther income (expense), net\n$\n(\n82\n)\n$\n(\n477\n)\n$\n(\n1,007\n)\n(1)    Foreign currency transaction gains (losses) include gains of $\n526\n million, losses of $\n163\n million, and gains of $\n46\n million for the years ended December 31, 2024, 2023, and 2022, respectively, related to Euro-denominated debt and accrued interest that were not designated as net investment hedges (see Note 12). \n(2)    See Note 5 for additional information related to net gains (losses) on equity securities. \n(3)    See Note 12 for additional information.\n19.    \nSUPPLEMENTAL CASH FLOW INFORMATION\nAs of December 31, 2024 and December 31, 2023, cash and cash equivalents reported in the Consolidated Balance Sheets differ from the amounts of total cash and cash equivalents and restricted cash and cash equivalents as shown in the Consolidated Statements of Cash Flows due to restricted cash and cash equivalents, which are included in \"Other current assets\" in the Consolidated Balance Sheets, primarily related to the Company's travel-related insurance business.\nNoncash investing activity related to additions to property and equipment, including stock-based compensation and accrued liabilities, was $\n55\n million, $\n50\n million, and $\n48\n million for the years ended December 31, 2024, 2023, and 2022, respectively. See Note 13 for additional information on noncash financing activity related to the excise tax on share repurchases.\nDuring the years ended December 31, 2024, 2023, and 2022, the Company made income tax payments of $\n1.9\n billion, $\n1.8\n billion, and $\n600\n million, respectively, and interest payments of $\n953\n million, $\n842\n million, and $\n380\n million, respectively.\n90\n20.    \nTRANSFORMATION COSTS\nIn November 2024, the Company announced its intention to implement certain organizational changes that are expected to improve operating expense efficiency, increase organizational agility, free up resources that can be reinvested into further improving its offering to travelers and partners, and better position the Company for the long term (the \"Transformation Program\"). The Company currently expects that restructuring costs and accelerated investments related to the Transformation Program will be incurred in the next \ntwo\n to \nthree years\n and anticipates these costs to primarily relate to expected workforce reductions, technology investments, and professional fees. The details of the Transformation Program are not yet final and remain subject to consultation with works councils, employee representative bodies, and other relevant organizations, legal requirements in multiple jurisdictions, and the Company completing its analysis of overall Transformation Program costs. For the year ended December 31, 2024, the Transformation Program related costs are recorded in \"Transformation costs\" in the Consolidated Statement of Operations and primarily consist of professional fees.\n \n21.    \nOTHER OPERATING EXPENSES\nDuring the year ended December 31, 2022, the Company transferred certain customer service operations of Booking.com to Majorel Group Luxembourg S.A. resulting in a loss of $\n41\n million included in \"\nOther operating expenses\n\" in the Consolidated Statement of Operations for the year ended December 31, 2022. \nSee Note 10 for information on the gain recognized during the year ended December 31, 2022 related to the sale and leaseback transaction for the Booking.com's headquarters building in the Netherlands.\n22.    \nOTHER\nTerminated Acquisition\nIn November 2021, the Company entered into an agreement to acquire global flight booking provider Etraveli Group. The completion of the acquisition was subject to certain closing conditions, including regulatory approvals. In September 2023, the European Commission announced its decision to prohibit the acquisition and consequently a termination fee of \n85\n million Euros ($\n90\n million) was paid by the Company in October 2023 and is recorded in \"General and administrative\" expenses in the Consolidated Statement of Operations for the year ended December 31, 2023.\nBenefit Plans\nThe Company maintains a defined contribution 401(k) savings plan covering certain U.S. employees and participates in certain defined contribution plans outside of the U.S. for which it provides contributions for eligible employees. The Company's contributions to the defined contribution plans during the years ended December 31, 2024, 2023, and 2022 were $\n59\n million, $\n55\n million, and $\n40\n million, respectively. See Note 16 for information on accruals related to the Netherlands pension fund matter.\nAccrued expenses and other current liabilities\nIncluded in \"Accrued expenses and other current liabilities\" in the Consolidated Balance Sheets at December 31, 2024 and 2023 are accrued liabilities of $\n597\n million and $\n587\n million, respectively, related to marketing expenses and $\n611\n million and $\n634\n million, respectively, related to personnel expenses. In addition, \"Accrued expenses and other current liabilities\" in the Consolidated Balance Sheets at December 31, 2024 and 2023 include accruals of $\n336\n million and $\n276\n million, respectively, related to the Netherlands pension fund matter (see Note 16).\n91\nBooking Holdings Inc.\nSchedule I - Condensed Financial Information of Parent (Booking Holdings Inc.)\nCONDENSED BALANCE SHEETS\n(In millions)\n \n \nDecember 31,\n \n2024\n2023\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n4,173\n \n$\n1,752\n \nReceivables from subsidiaries\n296\n \n106\n \nOther current assets\n18\n \n22\n \nTotal current assets\n4,487\n \n1,880\n \nLoans receivable from subsidiaries\n982\n \n1,119\n \nInvestment in subsidiaries\n10,586\n \n10,294\n \nOther assets\n52\n \n29\n \nTotal assets\n$\n16,107\n \n$\n13,322\n \nLIABILITIES AND STOCKHOLDERS' DEFICIT\nCurrent liabilities:\nPayables to subsidiaries\n$\n23\n \n$\n19\n \nAccrued expenses and other current liabilities\n1,674\n \n336\n \nShort-term debt\n1,745\n \n1,961\n \nTotal current liabilities\n3,442\n \n2,316\n \nLoans payable to subsidiaries\n1,533\n \n1,404\n \nOther long-term liabilities\n299\n \n123\n \nLong-term debt\n14,853\n \n12,223\n \nTotal liabilities\n20,127\n \n16,066\n \nCommitments and contingencies \nTotal stockholders' deficit\n(\n4,020\n)\n(\n2,744\n)\nTotal liabilities and stockholders' deficit\n$\n16,107\n \n$\n13,322\n \n    \nSee Notes to Condensed Financial Statements.\n92\nBooking Holdings Inc.\nSchedule I - Condensed Financial Information of Parent (Booking Holdings Inc.)\nCONDENSED STATEMENTS OF OPERATIONS AND COMPREHENSIVE INCOME\n(In millions)\n \nYear Ended December 31,\n2024\n2023\n2022\nRevenues\n$\n—\n \n$\n—\n \n$\n—\n \nOperating expenses\n341\n \n299\n \n225\n \nOperating loss\n(\n341\n)\n(\n299\n)\n(\n225\n)\nInterest expense\n(\n880\n)\n(\n495\n)\n(\n284\n)\nInterest and dividend income\n200\n \n166\n \n58\n \nOther income (expense), net\n4\n \n(\n166\n)\n58\n \nEquity in earnings (losses) of subsidiaries, net of tax\n7,061\n \n5,074\n \n3,442\n \nIncome before income taxes\n6,044\n \n4,280\n \n3,049\n \nIncome tax expense (benefit)\n162\n \n(\n9\n)\n(\n9\n)\nNet income\n$\n5,882\n \n$\n4,289\n \n$\n3,058\n \nOther comprehensive loss, net of tax\n(\n52\n)\n(\n56\n)\n(\n123\n)\nComprehensive income\n$\n5,830\n \n$\n4,233\n \n$\n2,935\n \nSee Notes to Condensed Financial Statements\n93\nBooking Holdings Inc.\nSchedule I - Condensed Financial Information of Parent (Booking Holdings Inc.)\nCONDENSED STATEMENTS OF CASH FLOWS\n(In millions)\n \nYear Ended December 31,\n \n2024\n2023\n2022\nOPERATING ACTIVITIES:\nNet cash provided by operating activities\n$\n6,414\n \n$\n6,464\n \n$\n3,695\n \nINVESTING ACTIVITIES:\nProceeds from internal transfers of subsidiaries\n—\n \n—\n \n174\n \nDividends received\n139\n \n107\n \n3,087\n \nOther investing activities\n(\n37\n)\n(\n128\n)\n(\n102\n)\nNet cash provided by (used in) investing activities\n102\n \n(\n21\n)\n3,159\n \nFINANCING ACTIVITIES:\nProceeds from the issuance of long-term debt\n4,836\n \n1,893\n \n3,621\n \nPayments on maturity and conversion of debt\n(\n1,312\n)\n(\n500\n)\n(\n1,880\n)\nPayments for repurchase of common stock \n(\n6,509\n)\n(\n10,377\n)\n(\n6,621\n)\nDividends paid\n(\n1,174\n)\n—\n \n—\n \nProceeds from exercise of stock options\n14\n \n134\n \n7\n \nOther financing activities\n50\n \n49\n \n47\n \nNet cash used in financing activities\n(\n4,095\n)\n(\n8,801\n)\n(\n4,826\n)\nNet increase (decrease) in cash and cash equivalents\n2,421\n \n(\n2,358\n)\n2,028\n \nTotal cash and cash equivalents, beginning of period\n1,752\n \n4,110\n \n2,082\n \nTotal cash and cash equivalents, end of period\n$\n4,173\n \n$\n1,752\n \n$\n4,110\n \n    \nSee Notes to Condensed Financial Statements.\n94\nBooking Holdings Inc.\nSchedule I - Condensed Financial Information of Parent (Booking Holdings Inc.)\nNOTES TO CONDENSED FINANCIAL STATEMENTS\n1. BASIS OF PRESENTATION\nThese condensed parent company-only financial statements of Booking Holdings Inc. (the \"Parent\"), are prepared on a \"parent company-only\" basis and have been derived from and should be read in conjunction with the consolidated financial statements and related notes of Booking Holdings Inc. and subsidiaries included in Part IV, Item 15 of this Annual Report on Form 10-K (the \"Consolidated Financial Statements\"). Under a parent company-only presentation, investments in the parent's subsidiaries are accounted for under the equity method of accounting. Certain information and footnote disclosures normally included in financial statements prepared in accordance with U.S. GAAP have been condensed or omitted.\n2. DEBT\nSee Note 12 to the Consolidated Financial Statements for additional information on the Parent's revolving credit facility and outstanding debt.\n3. DIVIDENDS FROM SUBSIDIARIES\nCash dividends paid to the Parent by the subsidiaries were $\n7.2\n billion, $\n7.3\n billion, and $\n7.3\n billion for the years ended December 31, 2024 and 2023, and 2022, respectively, and are classified within \"Net cash provided by operating activities\" or \"Net cash provided by (used in) investing activities,\" as appropriate, in the Condensed Statements of Cash Flows.\n4. GUARANTEES\nThe Parent had $\n721\n million and $\n389\n million of guarantees issued on behalf of the Parent's subsidiaries as of December 31, 2024 and 2023, respectively, which are primarily related to arrangements with payment processors and networks.\n95"
  }
}