{
  "ticker": "BKR",
  "cik": "0001701605",
  "company_name": "Baker Hughes Co",
  "filing_date": "2025-02-04",
  "accession": "0001701605-25-000035",
  "primary_doc": "bkr-20241231.htm",
  "item_sections": {
    "item1": "Item 16.\nForm 10-K Summary\n102\nSignatures\n103\nBaker Hughes Company 2024 Form 10-K | i\nPART I\nITEM 1. BUSINESS\nBaker Hughes Company (\"Baker Hughes,\" \"the Company,\" \"we,\" \"us,\" or \"our\") is an energy technology company with a diversified portfolio of technologies and services that span the energy and industrial value chain. Built on a century of experience and conducting business in over 120 countries, our innovative technologies and services are taking energy forward.\nOUR VISION & STRATEGY\nWith our diverse portfolio, leading technology, and unique partnership models, we are positioned to deliver outcome-based solutions across the energy and industrial markets. By integrating health, safety & environment (\"HSE\") into everything we do, we protect our people, our customers, and the environment.\nThe oil and gas macroeconomic environment continues to be complex. While we believe the world will need hydrocarbons for many decades to come - and therefore oil and gas will continue to remain relevant in meeting global energy demand - we also acknowledge the need to transition to new energy sources. Over the last several years, this transition has progressed, with governments and society focused on a long-term goal of net-zero emissions while trying to balance the \"energy trilemma\" - energy security, sustainability, and affordability. There is a growing consensus the energy transition will likely take longer than many expected due to its inherent complexity overcoming technology, economics, politics, and regulatory challenges.\nWe believe the industry is going through a transformation that requires a change in how work gets done to enable sustainable energy development. Our existing and new customers require new partnerships, commercial models and technology solutions to deliver sustainable productivity improvements and leverage economies of scale, with a lower carbon footprint. That is why our strategy is focused on improving our core competitiveness and delivering higher-productivity solutions today, while positioning to lead the energy transition and solving the energy trilemma. Our unique and diversified portfolio is expected to benefit regardless of how quickly the energy transition develops.\nOur strategy is based on three key pillars:\n•\nTransform the core\n: We are transforming our current business to improve margins and cash flow, which we are achieving through portfolio rationalization, cost improvement, and new business models.\n•\nDriving profitable growth:\n We are driving organic and inorganic growth to build our businesses in high potential markets where we have a strong position, including integrated solutions, mature assets solutions, and enhanced digital solutions.\n•\nDelivering results in new energy:\n We are making strategic investments to drive lower carbon emissions in the energy and industrial sectors, including hydrogen; carbon capture, utilization and storage (\"CCUS\"); geothermal; and clean power solutions (\"clean power\" refers to lower carbon intensity, lower lifecycle emissions, and lower quantity of greenhouse gas emissions resulting directly from fuel combustion, relative to conventional power sources derived from fossil fuels).\nWe expect to benefit from our strategy in the following ways:\n•\nScope and scale:\n We have a global presence and a broad, diversified portfolio. Our products, services, and expertise serve the upstream, midstream/liquefied natural gas (\"LNG\") and downstream sectors of the oil and gas industry, as well as broader chemical and industrial segments across a variety of verticals. We deliver through our two operating segments: Oilfield Services & Equipment (\"OFSE\") and Industrial & Energy Technology (\"IET\") as discussed below under \"Products and Services,\" and each are among the top providers for the majority of the product lines in the markets they serve.\n•\nTechnology:\n \nOur culture is built on a heritage of innovation and invention through research and development, with complementary capabilities. Technology remains a differentiator for us and a key enabler to drive the efficiency and productivity gains our customers require, as well as paving the way for longer term sustainable energy development. We also have a range of technologies that support our customers' \nBaker Hughes Company 2024 Form 10-K | 1\nefforts to reduce their carbon footprint. We remain committed to investing in our products and services to maintain our leadership position across our offerings, including $643 million research and development (\"R&D\") spend and being granted more than 1,600 patents worldwide in 2024.\n•\nEnergy transition solutions:\n We are positioned to support our customers' efforts to reduce their carbon footprint with a range of emissions-abatement products and services, which we refer to as \"new energy.\" This includes turnkey solutions for flare reduction, CCUS, hydrogen production, transportation, storage and distribution, geothermal and clean power solutions. Over the past several years, we have made progress in strategic investments and acquisitions in emerging energy technologies to advance CCUS, hydrogen, clean power and e-fuels, as well as established strategic long-term partnerships with companies such as HIF Global, Air Products and NET Power, among others. We also continue to expand our low to zero-carbon solutions capabilities, helping customers to detect, quantify, and reduce emissions more efficiently and accurately, and complementing our existing solutions.\n•\nDigital capabilities:\n We expect to benefit from the emerging demand for more intelligent operations and the adoption of artificial intelligence (\"AI\") based solutions as part of our customers' digital transformation initiatives. In 2024, we launched CarbonEdge\nTM\n, powered by Cordant\nTM\n, an end-to-end digital solution for CCUS operations. We also signed an agreement with Repsol to collaboratively develop and deploy next-generation AI capabilities through our Leucipa™ automated field production solution.\nPRODUCTS AND SERVICES\nOur two operating segments are organized based on the nature of our markets and customers. We sell to our customers through direct and indirect channels. Our primary sales channel is through our direct sales force, which has a strong regional focus with local teams close to the customer, who are able to draw support from centers of excellence in each of our major product lines. Our products and services are sold in highly competitive markets and the competitive environment varies by product line. See discussion below by segment.\nOilfield Services & Equipment\nThe OFSE segment designs and manufactures products and provides related services and integrated solutions for onshore and offshore oilfield operations across the life cycle of an asset, ranging from exploration, appraisal, and development to production, rejuvenation, and decommissioning.\nBeyond its traditional oilfield concentration, OFSE is also expanding its capabilities and technology portfolio to meet the challenges of the energy transition, including focusing on new energy areas, such as geothermal and CCUS, strengthening its digital architecture, and addressing key energy market themes.\nThe OFSE segment is organized into four product lines.\n•\nWell Construction\n focuses on drilling and includes drilling services (directional drilling, logging-while-drilling, surface logging, and remote operations), drill bits (polycrystalline, roller cone, hybrid, and in-bit sensing), and drilling & completion fluids (emulsion-based, water-based, specialty, drill-in, and completion fluids; and waste management).\n•\nCompletions, Intervention, and Measurements\n encompasses completions (wellbore construction, upper and lower completions, unconventional multistage completions, intelligent production systems, workover systems, and fishing and through-tubing services), pressure pumping (cementing, production enhancement, coiled tubing, and tubular running services), and wireline services (openhole logging services, cased-hole logging services, and perforating and drill stem-testing services).\n•\nProduction Solutions\n \nspans artificial lift systems (electrical submersible pumping systems, surface pumping systems, rigless deployment systems, and sensors and gauges) and oilfield & industrial chemicals (upstream, downstream, and Aquaness\nTM\n wholesale chemicals).\n•\nSubsea & Surface Pressure Systems\n \nincludes subsea projects and services (subsea trees, controls, manifolds, wellheads, premium casing connectors, installation and commissioning, repairs and maintenance, well intervention, life-of-field solutions, and plug and abandonment), flexible pipe systems \nBaker Hughes Company 2024 Form 10-K | 2\n(subsea risers, subsea flowlines and jumpers, onshore reinforced thermoplastic pipe, and rehabilitation), and surface pressure control systems (surface trees and wellheads).\nThese product lines are supported by an OFSE digital group, which combines OFSE's domain expertise with a deep understanding of digital technology to improve operational safety, performance, and sustainability. Reservoir analysis proficiencies are rooted in evaluation technologies, a team of reservoir experts, and software. Together, these capabilities provide customers with a greater understanding of the subsurface, enabling smoother, faster drilling and precise wellbore placement that can lead to improved recovery and project execution driving enhanced economics. OFSE also provides integrated well services and solutions to plan and execute projects ranging from well construction and production through well abandonment, in addition to integrated services and solutions for the subsea environment.\nOFSE customers include large integrated major and super-major oil and natural gas companies; U.S. and international independent oil and natural gas companies; national or state-owned oil and natural gas companies; engineering, procurement, and construction contractors; geothermal companies; and other oilfield services companies. OFSE believes that its principal competitive differentiators in the industries and markets it serves are the technology, quality, efficiency, reliability, and availability of its products and services. A continued commitment to service delivery, HSE standards, technical proficiency, and competitive pricing is also a key factor in its success.\nOFSE products and services are sold in highly competitive markets. While OFSE may have contracts that include multiple well projects and that may extend over a multi-year period, its services and products are generally provided on a well-by-well basis. Most contracts cover pricing of the products and services, along with various limitations on liability, but do not necessarily establish an obligation to use OFSE products and services. OFSE competitors include SLB, Halliburton, NOV, Weatherford, and TechnipFMC.\nIndustrial & Energy Technology\nThe IET segment combines a broad array of domain expertise, technologies, software, and services for energy and industrial customers including on- and offshore, LNG, pipeline and gas storage, refining, petrochemical, distributed gas, nuclear, hydrogen, carbon capture, utilization and storage, clean power, geothermal and renewables. It also provides cutting edge technology for consumers of energy and/or organizations who are reliant on infrastructure integrity across a broad variety of verticals including pulp & paper, food & beverage, industrial heating, automotive and aerospace. IET solutions unlock the ability to transform, transfer, and transport energy efficiently, while capturing and cutting emissions.\nThe IET segment is organized into five product lines.\n•    \nGas Technology Equipment\n delivers highly efficient mechanical and electric-drive compression and power generation technology for projects across the natural gas value chain. The product line's portfolio includes:\n•\nDrivers, which include aero-derivative gas turbines, heavy-duty gas turbines, small- to medium-sized industrial gas turbines, steam turbines, hot gas and turboexpanders, and electric motors.\n•\nDriven equipment, which includes synchronous condensers, generators, reciprocating, centrifugal, and integrated compressors, and centrifugal pumps.\n•\nTurnkey solutions, which include power generation and gas compression modules, waste heat/energy/pressure recovery, energy storage, modularized small and large liquefaction plants, CO\n2\n compression, and storage/use solutions.\n•\nGas Technology Services\n provides advanced aftermarket support and uptime availability in critical environments and through every stage of our customers' equipment and plant life cycle. The product line portfolio includes:\n•\nDesigning, manufacturing, maintaining, and upgrading rotating equipment and combining sophisticated hardware technologies with enterprise-class software products.\n•\nAnalytics to connect customers' assets, providing them with the data, safety and security needed to improve operations reliably and efficiently.\nBaker Hughes Company 2024 Form 10-K | 3\n•\nGenuine spare parts, system upgrades, conversion solutions, digital advanced services, and turnkey solutions to refurbish and improve the output from a single machine up to an entire plant.\n•\nIndustrial Products\n includes a broad portfolio of component products and service offerings that enable industrial safety and productivity across diverse industry verticals. The product line's portfolio includes:\n•\nWaygate Technologies, which comprises non-destructive testing technology, software, and services, including industrial radiography, ultrasonic sensors, testing machines and gauges, non-destructive testing film, and remote visual inspection.\n•\nProcess & Pipeline Services, which comprises pre-commissioning and maintenance services to improve throughput and asset integrity for process facilities and pipelines, as well as inline inspection solutions to support pipeline integrity.\n•\nValves and Gears, which comprises flow technology including industrial valves, regulators, control systems, gears and other flow and process control technologies.\n•\nIndustrial Solutions\n \noffers a unique suite of hardware, software, and edge device solutions that enable asset health, performance and process optimization. Industrial Solutions combines several product lines to leverage our critical equipment hardware capability to migrate to full-plant offerings and through Cordant\nTM\n, a full-stack, edge-to-enterprise solution that encompasses our hardware, software and services offerings. The product line's portfolio includes a number of product brands including:\n•\nCordant Solutions technology includes the Bently Nevada® and System 1® product brands, providing rack-based vibrating monitoring equipment and sensors for both power generation and oil and gas operations, as well as industrial applications. The product line also provides integrated asset performance management.\n•\nPrecision Sensors & Instrumentation device technology, including the Panametrics®, Druck®, and Reuter-Stokes® product brands, provides instrumentation and sensor-based technologies to better detect and analyze pressure, flow, gas, moisture, radiation, and related conditions.\n•\nClimate Technology Solutions (\"CTS\")\n includes CCUS, hydrogen, clean power, geothermal and emissions abatement capabilities to enable energy operators, as well as users of energy in the broader industry, to achieve their emission reduction goals. This product line is the primary driver of the Company's new energy orders and is designed to accelerate the decarbonization of both energy and broader industrial verticals such as hard-to-abate industries, like steel and cement.\nIET customers for the Gas Technology Equipment and Gas Technology Services product lines are industrial, upstream, midstream, and downstream, onshore and offshore, and small-to-large scale. Midstream and downstream customers include LNG plants, pipelines, storage facilities, refineries, and a wide range of industrial and engineering, procurement, and construction companies. Products and services for the remaining IET product lines are primarily sold in a diversified arena to a broad range of customers and across multiple verticals, including aerospace, automotive, nuclear, oil and gas, mining, cement, metals, refinery and petrochemical, food and beverage, pulp & paper, and textile.\nIET differentiates itself from competitors with its diverse portfolio, expertise in technology and project management, local presence, and partnerships, to provide fully integrated solutions for a broad array of industry segments.\nIET competes across a wide range of industries, including oil and gas, power generation, aerospace, and light and heavy industrials. IET main competitors include Siemens Energy, Solar (a Caterpillar company), Mitsubishi Heavy Industry, Chart, Sulzer, Flowserve, and Emerson.\nCONTRACTS\nWe conduct our business under various types of contracts in the upstream, midstream, and downstream sectors of the oil and gas industry, including fixed-fee or turnkey contracts, transactional agreements for products and services, and long-term aftermarket service agreements. We also conduct business in a number of industrial \nBaker Hughes Company 2024 Form 10-K | 4\nmarkets and provide critical equipment hardware capability for full plant offerings, asset performance management and process optimization.\nWe benefit from stable relationships with many of our customers based on long-term project contracts and master service agreements. Several of those contracts require us to commit to a fixed price based on the customer's technical specifications with little or no relief available due to changes in circumstances. In some cases, failure to deliver products or perform services within contractual commitments may lead to liquidated damages claims. We seek to mitigate these exposures through close collaboration with our customers.\nWe strive to negotiate the terms of our customer contracts consistent with what we consider to be industry best practices. In connection with oil and gas operations, our customers typically indemnify us for certain claims arising from: the injury or death of their employees and often their contractors; the loss of or damage to their facility and equipment, and often that of their contractors; pollution originating from their equipment or facility; and all liabilities related to the well and subsurface operations, including loss or damage to the well or reservoir, loss of well control, fire, explosion, or any uncontrolled flow of oil or gas. Conversely, we typically indemnify our customers for certain claims arising from: the injury or death of our employees and often that of our subcontractors; the loss of or damage to our equipment; and surface pollution originating from our equipment while under our control. Where the above indemnities do not apply or are not consistent with industry best practices (e.g., in connection with industrial and/or digital sectors), we typically provide a capped indemnity for damages caused to the customer by our negligence and include an overall limitation of liability clause. It is also our general practice to include a limitation of liability for consequential loss, including loss of profits and loss of revenue, in all customer contracts.\nOur indemnity structure may not protect us in every case. Certain U.S. states have enacted oil and natural gas specific anti-indemnity statutes that can void the allocation of liability agreed to in a contract. Applicable law or the negotiated terms of a customer contract may also limit indemnity obligations in the event of gross negligence or willful misconduct, or in the event of breaches of applicable laws or breach of confidentiality and/or intellectual property rights. We sometimes contract with customers that are not the end user of our products. It is our practice to seek to obtain an indemnity from our customer for any end-user claims, but this is not always possible. Similarly, government agencies and other third parties may make claims in respect of which we are not indemnified and for which responsibility is assessed proportionate to fault. We have an established process to review any risk deviations from our standard contracting practices.\nThe Company maintains a commercial general liability insurance policy program that covers against certain operating hazards, including product liability claims and personal injury claims, as well as certain limited environmental pollution claims for damage to a third party or its property arising out of contact with pollution for which the Company is liable; however, clean up and well control costs are not covered by such program. All of the insurance policies purchased by the Company are subject to deductible and/or self-insured retention amounts for which we are responsible for payment, specific terms, conditions, limitations, and exclusions. There can be no assurance that the nature and amount of Company insurance will be sufficient to fully indemnify us against liabilities related to our business.\nORDERS AND REMAINING PERFORMANCE OBLIGATIONS\nRemaining performance obligations (\"RPO\"), a defined term under U.S. generally accepted accounting principles (\"U.S. GAAP\"), are unfilled customer orders for products and product services excluding any purchase order that provides the customer with the ability to cancel or terminate without incurring a substantive penalty, even if the likelihood of cancellation is remote based on historical experience. For product services, an amount is included for the expected life of the contract.\nWe recognized orders of $28.2 billion, $30.5 billion, and $26.8 billion in 2024, 2023, and 2022, respectively. We recognized OFSE orders of $15.2 billion, $16.3 billion, and $14.1 billion, and IET orders of $13.0 billion, $14.2 billion, and $12.7 billion in 2024, 2023, and 2022, respectively. As of December 31, 2024, the remaining performance obligations totaled $33.1 billion. As of December 31, 2024, OFSE remaining performance obligations totaled $3.0 billion, and IET remaining performance obligations totaled $30.1 billion.\nBaker Hughes Company 2024 Form 10-K | 5\nRESEARCH AND DEVELOPMENT\nWe engage in R&D activities across the business directed toward the development of new products, services, technology, and other solutions, as well as bringing about a significant improvement to existing products and services, and the design of specialized products to meet specific customer needs. We also continue to invest and develop a range of technologies that support our customers' efforts to reduce their carbon footprint. For the year ended December 31, 2024, we incurred $643 million of R&D expense.\nIn OFSE, we continue to fund a range of formation evaluation, drilling, completions, and production capabilities and products. In parallel, and in strong collaboration with the IET technology organization, we are investing in strategic themes that fuel our future product and service portfolios. These include themes such as digital, automation, electrification, chemistry and materials, electronics, CCUS, and geothermal.\nSpecifically for OFSE, in our Well Construction product line, we are improving reliability in high-temperature and high shock and vibration environments (harsh-drilling conditions), through a combination of optimized design, automated operations, and integrated solutions that leverage our drilling tools, drill bits, and drilling fluids technologies. In our Completions, Intervention, and Measurements product line, we are investing in intelligent solutions and advanced measurements while creating a leadership position in the well-intervention domain through the integration of our wireline measurement capabilities with the conveyance and intervention capabilities. In our Production Solutions product line, we are leveraging our artificial lift technologies with our chemical solutions to provide an optimized and automated portfolio of production-enhancing solutions. In our Subsea & Surface Pressure Solutions product line, we continue to develop subsea production systems that improve performance and reduce emissions through lighter design, automated operations, and electrification. Our offshore flexible pipe systems optimized for higher pressure temperature and CO2 content continue to deliver greater sustainability and performance.\nIn IET, we continue to invest in and develop foundational technologies which will enable our journey for the energy transition. Such technologies include advanced materials, advanced manufacturing technologies, novel process technologies, and digital technologies such as advanced sensing & diagnostics, data sciences, and artificial intelligence. Within Gas Technology Equipment and Gas Technology Services product lines, we are focusing on our latest generation of gas turbines for energy efficiency and reduced carbon footprint such as our LM9000\nTM\n and Nova LT\nTM\n products, as well as Allam Cycle turboexpander, CCUS, and hydrogen and geothermal technologies. Within Industrial Technology, we are investing in advanced digital solutions designed to improve the efficiency, reliability, and safety of oil and gas, aerospace, energy, and broader industrial production and operations. This includes our Orbit 60 Bently Nevada product for critical asset monitoring in turbine systems, including wind, hydro, and gas turbines. The IET segment is also enhancing its process and safety valve business bringing new digital applications including analytics to our customers. Investments in Industrial Technology also include technologies to measure, monitor, and minimize carbon emissions, new inspection technologies for nondestructive evaluation of materials and structures as well as solutions for industrial asset management.\nINTELLECTUAL PROPERTY\nOur technology, brands and other intellectual property (\"IP\") rights are important elements of our business. We rely on patent, trademark, copyright, and trade secret laws, as well as non-disclosure and employee invention assignment agreements to protect our IP rights. Many patents and patent applications comprise the Baker Hughes portfolio and are owned by us. Other patents and patent applications applicable to our products and services are licensed to us by GE Aerospace (NYSE: GE) and GE Vernova (NYSE: GEV) and, in some cases, third parties. In particular, we have an IP cross-license agreement with GE Aerospace and GE Vernova that allows all parties to have continued rights to commercially utilize certain IP of the other pursuant to the terms of the agreement. The IP cross-license remains in place following General Electric exiting its ownership position in us. We do not consider any individual patent to be material to our business operations.\nWe follow a policy of seeking patent and trademark protection in numerous countries and regions throughout the world for products and methods that we believe appear to have commercial significance. We believe that maintenance, protection and enforcement of our patents, trademarks, and related IP rights is central to the conduct of our business, and pursue protection of our IP rights against infringement, misappropriation, or other violation worldwide as may be necessary to protect our business. Additionally, we consider the quality and timely delivery of our products, the service we provide to our customers, and the technical knowledge and skills of our personnel to \nBaker Hughes Company 2024 Form 10-K | 6\nbe other important components of the portfolio of capabilities and assets supporting our ability to compete. If we are not able to protect our IP or if those rights are invalidated or circumvented, our business may be adversely affected. We may be subject to litigation and infringement claims, which could cause us to incur significant expenses or prevent us from selling our products or services.\nSEASONALITY\nOur operations can be affected by seasonal events, which can temporarily affect the delivery and performance of our products and services, and our customers' budgetary cycles. Examples of seasonal events that can impact our business are set forth below:\n•\nIn OFSE, adverse weather conditions, such as hurricanes in the Gulf of Mexico or extreme heat in the Middle East during the summer months, may impact our operations or our customers' operations, cause supply disruptions and result in a loss of revenue and/or damage to our equipment and facilities, which may or may not be insured. For more information on seasonal and weather conditions, see the \"Operational Risks\" section of Part 1 of",
    "item1a": "Item 1A herein.\nGOVERNANCE\nBoard of Directors\nOversight responsibilities for our cybersecurity and digital security programs and risks lie with the Audit Committee of the Board. The Board is actively engaged in the oversight of our cybersecurity and digital security programs and oversees all operational, financial, strategic, and reputational risks with oversight of specific risks undertaken with the committee structure including risks related to cybersecurity, data security, and technology.\nThe Audit Committee receives reports on the Company's cybersecurity program and developments from our Chief Information Officer (\"CIO\"), who reports to the Chief Executive Officer, and our CISO, who reports to the CIO, at each of our regular meetings, which occu\nr at least four times per \nyear. These reports typically include analyses of recent cybersecurity threats and incidents at the Company and across the industry, as well as a review of our own security controls, assessments and program maturity, and risk mitigation status, as well as a review of our third-party service providers. Our digital technology, legal, and the corporate audit functions also routinely present to the Audit Committee on key cybersecurity topics and, on at least an annual basis, the Board receives reports on the Company's cybersecurity program and developments from the CIO and CISO.\nManagement\nOur programs are focused on building digital trust through sound oversight of cybersecurity and data privacy protections and the responsible use of data and technology. We operate a CFC, and we have a cross-functional approach to addressing cybersecurity-related risks through the functional compliance structures in our digital technology and legal organizations with oversight from the corporate audit and controllership functions. The cybersecurity and legal functions employ full time cybersecurity and privacy roles with expertise in managing cybersecurity and privacy compliance and risks and responding to incidents.\nOur senior executive leadership is actively engaged in the oversight and strategic direction of our cybersecurity and digital data protection programs. The senior executive leadership-level Cybersecurity Steering Committee (\"CSC\") is responsible for assessing cybersecurity risks, providing direction and oversight for risk mitigation action, and assisting the Audit Committee in overseeing the Company’s cybersecurity risks. The CSC also receives monthly reports on the Company's cybersecurity program and developments from our CISO and legal representatives. The CSC is chaired by our CISO. The senior executive leadership members include the CIO, Chief Legal Officer, Chief Financial Officer, Chief Compliance Officer, and Senior Vice President, Enterprise Operational Excellence.\nThe CISO has over 25 years of business experience in information technology and cybersecurity and is a long-standing certified information systems security professional (\"CISSP\") with the International Information System Security Certification Consortium.\nWe have an Incident Response Team (\"IRT\") that consists primarily of representatives from the CFC, legal, corporate communications, finance, and other relevant stakeholders. The IRT follows the guidance as outlined in the IRP to respond to cybersecurity incidents and escalate as necessary to the CSC based on a defined severity matrix. Internal legal and finance stakeholders are responsible for assessing materiality of risks in consultation with the IRT, CSC, the CEO, and external advisors.\nBaker Hughes Company 2024 Form 10-K | 29",
    "item1c": "ITEM 1C. CYBERSECURITY\nRISK MANAGEMENT & STRATEGY\nOverall Process\nWe protect our digital systems and data through a comprehensive cybersecurity management program, which includes a dedicated cybersecurity function, risk assessments, policies and procedures, and technical measures and related services from third party service providers. We have a dedicated Chief Information Security Officer (\"CISO\") with overall responsibility for the cybersecurity program, including threat detection and response, vulnerability management, governance, risk and compliance, security strategy and architecture, security engineering and operations, product and operational technology security. As part of our cybersecurity management program, we operate a CFC to monitor both internal and external cybersecurity threats, conduct initial assessment of severity, coordinate incident response resources, reduce incident response time, and shift toward a proactive cyber-defense model, which includes a dedicated threat intelligence program that leverages custom intelligence \nBaker Hughes Company 2024 Form 10-K | 27\nplatforms as well as industry specific professional associations and ongoing threat hunting. Through our cybersecurity risk management program, we monitor cybersecurity vulnerabilities and potential attack vectors and evaluate the potential operational and financial effects of any threat and countermeasures made to defend against such threats.\nWe have established policies and procedures, including our Incident Response Plan (\"IRP\"), for assessing, identifying, managing, and responding to events that may jeopardize the company digital information or systems, including protocols for assessing potential material impact from cybersecurity threats and incidents, escalating to executive leadership and the Board, engaging external stakeholders, and reporting incidents based on applicable legal requirements. Our IRP provides guidance in the event of a cybersecurity incident, including processes with assigned roles and responsibilities to triage, assess severity, escalate, contain, investigate, and remediate incidents, as well as to comply with applicable legal obligations and mitigate brand and reputational damage. We conduct regular tabletop exercises to test established policies and procedures for responding to cybersecurity threats and incidents. In addition, employees and stakeholders can report cybersecurity threats, cybersecurity and data privacy incidents, or other concerns through external and internal reporting channels.\nEnterprise Risk Management Process Integration\nCybersecurity risk management processes are an integral part of our enterprise risk management, which is overseen by the Audit Committee of the Board. Our processes include periodic program maturity assessments, ongoing information technology risk assessments, and third-party security risks assessments.\nOur cybersecurity risk management efforts have also been integrated into the overall Enterprise Risk Management (\"ERM\") process, which includes assessment of cybersecurity risks that could result in significant operational disruption to the Company, such as production disruption, business downtime, loss of containment or other operation interruptions, as well as risks that could have significant reputational and compliance/regulatory impact. Cybersecurity risks identified and tracked \nthrough our ERM risk register have assigned risk owners at the executive leadership level and risk delegates who are responsible to identify and manage risk mitigation actions. Key risk indicators are updated quarterly by risk delegates and communicated to our executive leadership and the Audit Committee.\nWe leverage recognized cybersecurity frameworks to drive strategic direction and maturity improvement and engage third party security experts for risk assessments, risk mitigation actions, and program enhancements. We also include cybersecurity training as part of our required annual employee training program. In addition, cybersecurity and privacy training and awareness is integrated and continues throughout the year, utilizing various delivery methods such as phishing campaigns, training sessions, and informational articles.\nThird Party Security Experts\nWe engage third party security experts to supplement our internal CFC team as well as for assessments, penetration tests and program enhancements, including vulnerability assessments, security framework maturity assessments and identification of areas for continued focus and improvement. In addition, our third-party experts work with us to conduct tabletop exercises and internal phishing awareness campaigns. We use the findings of these exercises to improve our practices, procedures, and technologies. We also engage third party security experts to support our cybersecurity threat and incident response management and maintain information security risk insurance coverage.\nIdentification of Threats Associated with Third Parties\nBaker Hughes utilizes a third-party risk management (\"TPRM\") program to identify, assess, monitor, and mitigate risks associated with suppliers and vendors, including cybersecurity risks. We conduct initial risk assessments of third-party suppliers and service providers based on various factors to classify each into a risk category. Our TPRM program is designed to apply our most rigorous processes to those suppliers and service providers that are classified into the highest risk category. These processes include due diligence assessments of third-party suppliers and service providers that have access to Baker Hughes networks, confidential information, and information systems in order to assess the risks from cybersecurity threats that could impact our suppliers and third-party service providers. We leverage external partners to assist with the regular assessment of our top priority suppliers and third-party service providers to identify, review and address risks, including deeper reviews of their \nBaker Hughes Company 2024 Form 10-K | 28\ncybersecurity controls. We track the identified deficiencies and include with other cybersecurity metrics based on their severity. We also require that our suppliers and third-party service providers have in place appropriate technical and organizational security measures and security-control principles based on recognized cybersecurity standards.\nIncidents & Risks\nWe have not experienced a material cybersecurity incident and although we are subject to ongoing and evolving cybersecurity threats, we are not aware of any material risks from cybersecurity threats that have materially affected the Company. For more information on our cybersecurity risks, see \"Technology Risks\" identified in the \"Risk Factors\" section of Part 1 of",
    "item1b": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone."
  }
}