{
  "ticker": "BLDR",
  "cik": "0001316835",
  "company_name": "Builders FirstSource, Inc.",
  "filing_date": "2025-02-20",
  "accession": "0000950170-25-023953",
  "primary_doc": "bldr-20241231.htm",
  "item_sections": {
    "item1": "Item 1A.\n Ris\nk Factors\n \n\n\nRisks associated with our business, any investment in our securities, and with achieving the forward-looking statements contained in this report or in our news releases, websites, public filings, investor and analyst conferences or elsewhere, include the risk factors described below. Additional risks and uncertainties not presently known to us or that we currently deem immaterial may also impair our business operations. Any of these risks, whether known or unknown, could cause our actual results to differ materially from expectations and could have a material adverse effect on our business, financial condition or results of operations, and we may not succeed in addressing these challenges and risks. You should read these Risk Factors in conjunction with “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Item 7 and our consolidated financial statements and related notes in Item 8.\n\n\nIndustry Risks\n\n\nThe industry in which we operate is dependent upon the residential homebuilding industry, as well as the U.S. economy, the credit markets and other important factors.\n \n\n\nThe building products industry is highly dependent on new home and multi-family construction as well as repair and remodel, which in turn are dependent upon a number of factors, outside of our control, including interest rates, consumer confidence, employment rates, foreclosure rates, housing inventory levels and occupancy, housing demand and the health of the U.S. economy and mortgage markets. Unfavorable changes in demographics, credit markets, including rising mortgage and other interest rates, consumer confidence, household incomes, inflation, housing affordability, or housing inventory levels and occupancy, or a weakening of the U.S. economy or of any regional or local economy in which we operate could adversely affect consumer spending, result in decreased demand for our products, and adversely affect our business. Production of new homes and multi-family buildings may also decline because of shortages of qualified tradesmen, reliance on inadequately capitalized builders and sub-contractors, shortages of suitable building lots and material, and lack of financing or more expensive financing available to homebuilders. In addition, the building industry is subject to various local, state, and federal statutes, ordinances, and regulations concerning zoning, building design and safety, construction, energy and water conservation and similar matters, including regulations that impose restrictive zoning and density requirements in order to limit the number of homes that can be built within the boundaries of a particular area or in order to maintain certain areas as primarily or exclusively residential. Regulatory restrictions may increase our customers’ operating expenses and limit the availability of suitable building lots for our customers, which could negatively affect our sales and earnings. Because we have substantial fixed costs, relatively modest declines in our customers’ production levels could have a significant adverse effect on our financial condition, operating results and cash flows.\n \n\n\nThe building supply industry is subject to cyclical market pressures.\n \n\n\nPrices of building products are subject to fluctuations arising from changes in supply and demand, national and international economic conditions, including inflation and interest rates, labor costs, competition, market speculation, government regulation, and trade policies, as well as from periodic delays in the delivery of lumber and other products, all of which are outside our control. The prices of wood products directly affect our sales and earnings. In particular, low prices for wood products over a sustained period can adversely affect our financial condition, operating results and cash flows. Our lumber and lumber sheet goods product category represented 26% of total net sales for the year ended December 31, 2024. As such, if lumber or structural panel prices were to significantly decline from current levels, our sales and profits could be negatively affected. We have limited ability to manage the timing and amount of pricing changes for building products. In addition, the supply of building products fluctuates based on available manufacturing capacity. Excess capacity in the industry can result in significant declines in prices for those building products, often within a short period of time. Such price fluctuations can adversely affect our financial condition, operating results and cash flows.\n \n\n\nIn addition, the building products industry is cyclical in nature. An economic downturn in the homebuilding industry could have an adverse effect on our operating results, financial condition or cash flows. We are not able to predict the timing, severity or duration of any future downturns in the housing market.\n \n\n\nOur industry is highly fragmented and competitive, and increased competitive pressure may adversely affect our results.\n \n\n\nThe building products supply industry is highly fragmented and competitive. We face, and will continue to face, significant competition from local, regional and other national building materials chains, as well as from privately-owned single site enterprises and new entrants into the market, due to the low barrier to, and cost of, entry. Any of these competitors may (1) foresee the course of market development more accurately than we do, (2) develop products that are superior to our products, (3) have the ability to produce or supply similar products at a lower cost, (4) develop stronger relationships with local homebuilders or commercial builders or (5) adapt more quickly to new technologies or evolving customer requirements than we do. As a result, we may not be able to compete successfully with them. In addition, home center retailers, which have historically concentrated their sales efforts on retail consumers\n \n\n\n11\n\n\n\n\n \n\n\nand small contractors, have expanded their efforts into the professional homebuilders in recent years, including through the use of enhanced e-commerce offerings and acquisitions, and may continue to intensify these efforts in the future. Furthermore, certain product manufacturers sell and distribute their products directly to production homebuilders or commercial builders, and the volume of such direct sales could increase in the future. Additionally, manufacturers of products distributed by us may elect to sell and distribute directly to homebuilders or commercial builders in the future or enter into exclusive supplier arrangements with other distributors. Consolidation of production homebuilders or commercial builders may result in increased competition for their business. Finally, we may not be able to maintain our operating costs or product prices at a level sufficiently low for us to compete effectively. If we are unable to compete effectively, our financial condition, operating results and cash flows may be adversely affected.\n \n\n\nHomebuyer demand may shift towards smaller homes creating fluctuations in demand for our products.\n\n\nHome affordability can be a key driver in demand for our products and home prices have increased meaningfully over the past several years. Home affordability is influenced by a number of economic factors, such as the level of employment, consumer confidence, consumer income, supply of houses, the availability of financing and interest rates. Changes in the inventory of available homes as well as economic factors relative to home prices may result in homes becoming less affordable. Furthermore, consumer preferences could shift to smaller homes in the future. This could cause homebuyer demand to soften or shift substantially which could have an adverse impact on our financial condition, operating results and cash flows if we are unable to respond to the new market demands effectively.\n\n\nA range of factors may make our quarterly revenues, earnings and cash flows variable.\n\n\nWe have historically experienced, and in the future will continue to experience, variability in revenues, earnings and cash flows on a quarterly basis. The factors expected to contribute to this variability include, among others: (1) the volatility of prices of lumber, wood products and other building products, (2) the cyclical nature of the homebuilding industry, (3) general economic conditions in the markets that we serve, (4) the intense competition in the industry, including expansion and growth strategies by competitors, (5) the production schedules of our customers and suppliers, (6) the effects of the weather and (7) labor costs, labor shortages and available capacity to meet customer demand for our products. These factors, among others, make it difficult to project our operating results and cash flows on a consistent basis, which may affect the price of our stock.\n\n\nOperational and Strategic Risks\n\n\nWe may be unable to successfully implement our growth strategy, which includes increasing sales of our prefabricated components and other value-added products, pursuing strategic acquisitions, opening new facilities, implementing operational excellence, pursuing digitization opportunities and initiatives, and maintaining a balanced debt level.\n\n\nOur long-term strategy depends in part on growing our sales of prefabricated components and other value-added products, increasing our market share, and implementing various initiatives to increase our operational efficiency, improve our margins, optimize our pricing strategies, and streamline the customer experience. If any of these initiatives are not successful, or require extensive investment, our growth may be limited, and we may be unable to achieve or maintain expected levels of growth and profitability.\n \n\n\nOur long-term business plan also provides for continued growth through strategic acquisitions and organic growth through the construction of new facilities or the expansion of existing facilities. Failure to identify and acquire suitable acquisition candidates on appropriate terms could have a material adverse effect on our growth strategy. Moreover, our liquidity position, or the requirements of our debt instruments could prevent us from obtaining the capital required to effect new acquisitions or expand our existing facilities. Our failure to make successful acquisitions or to build or expand needed facilities, including manufacturing facilities, produce saleable product, or meet customer demand in a timely manner could adversely affect our financial condition, operating results, and cash flows. A negative impact on our financial condition, operating results and cash flows, or our decision to invest in strategic acquisitions or new facilities, could adversely affect our ability to maintain a balanced debt level.\n\n\nFurthermore, we have made significant investments, and intend to continue to invest, in technology solutions designed to increase the efficiency of the homebuilding process.  There is no guarantee that such solutions will be effective, will be adopted by our customers, will be able to compete with alternative technology solutions, including from start-up and more well-established technology companies or our competitors, or that we will realize the anticipated benefits from our investments in these solutions.  As a result, we may suffer losses on these investments or lose market share if competing technology solutions are more widely adopted than the technology solutions we are developing.\n\n\nWe have consummated a number of strategic acquisitions as part of our growth strategy and intend to continue to pursue strategic acquisitions in the future as part of our growth strategy.  Strategic acquisitions involve risks and if we are unable to realize the\n \n\n\n12\n\n\n\n\n \n\n\nanticipated benefits of these transactions or identify suitable acquisition candidates in the future, our growth, financial condition and results of operations could be materially and adversely affected.\n\n\nStrategic acquisitions are an important part of our growth strategy and we seek to identify attractive acquisition opportunities that we believe will be accretive and result in increased sales and earnings before interest, taxes, depreciation and amortization  (“EBITDA”), cost savings, synergies and various other benefits. Assessing the viability and realizing the benefits of these transactions is subject to significant uncertainty. Additionally, the evaluation and consummation of strategic transactions is a time-consuming and costly process that can divert resources away from our operations and result in the incurrence of meaningful transaction expenses. Furthermore, multiples for acquisition targets have generally increased over the past few years and we face increased competition from other acquirors for attractive acquisition opportunities.  As a result, we may not be able to consummate acquisitions on favorable terms, if at all.  We may also not be able to obtain necessary approvals, including regulatory or shareholder approvals, to consummate acquisitions. An inability to continue to identify and consummate attractive acquisitions could adversely affect our growth.\n \n\n\nIf we complete an acquisition, we need to successfully integrate the target company’s products, services, associates and systems into our business operations in order to realize the anticipated benefits from an acquisition. Integration can be a complex and time-consuming process, and if the integration is not fully successful or is delayed for a material period of time, we may not achieve the anticipated synergies or benefits of the acquisition. Although we have been successful in the past with the integration of numerous acquisitions, we may not be able to successfully integrate the operations of any future acquired businesses with our own in an efficient and cost-effective manner or without significant disruption to our or the acquired companies’ existing operations. Furthermore, even if a target company is successfully integrated, an acquisition may fail to further our business strategy as anticipated, expose us to increased competition or challenges with respect to our products or services, and expose us to additional liabilities. Any impairment of goodwill or other intangible assets acquired in a strategic transaction may reduce our earnings. Moreover, acquisitions involve significant risks and uncertainties, including uncertainties as to the future financial performance of the acquired business, the achievement of expected synergies, difficulties integrating acquired personnel and corporate cultures into our business, the potential loss of key employees, customers or suppliers, difficulties in integrating different computer and accounting systems, exposure to unforeseen liabilities of acquired companies and the diversion of management attention and resources from existing operations. We may be unable to successfully complete potential acquisitions due to multiple factors, such as issues related to regulatory review of the proposed transactions. We may also be required to incur additional debt or issue additional shares of our common stock in order to consummate acquisitions in the future. Potential new debt may be substantial and may limit our flexibility in using our cash flow from operations. The issuance of new shares of our common stock could dilute the equity value of our existing stockholders. Our failure to fully integrate future acquired businesses effectively or to manage other consequences of our acquisitions, including increased indebtedness, could prevent us from remaining competitive and, ultimately, could adversely affect our financial condition, operating results and cash flows.\n\n\nWe are subject to competitive pricing pressure from our customers.\n \n\n\nProduction homebuilders and multi-family builders historically have exerted and will continue to exert significant pressure on their outside suppliers, including on us, to keep prices low because of their market share and their ability to leverage such market share in the highly fragmented building products supply industry. Given this pricing pressure, we may not be able to pass along price increases for lumber, wood products, other building products, or related labor costs to our customers, which could impact our margins.   In addition, continued consolidation among production homebuilders or multi-family and commercial builders, or changes in such builders’ purchasing policies or payment practices, could result in additional pricing pressure, and our financial condition, operating results and cash flows may be adversely affected.\n \n\n\nFurthermore, in periods of economic downturn these pricing pressures tend to increase. As a result, we may face heightened pricing pressures in the event of an economic downturn, and our financial condition, operating results and cash flows may be adversely affected.\n\n\nThe loss of any of our significant customers or a reduction in the quantity of products they purchase could affect our financial health.\n \n\n\nOur ten largest customers generated 15% of our net sales for the year ended December 31, 2024. We cannot guarantee that we will maintain or improve our relationships with these customers or that we will supply these customers at historical levels. Moreover, in the event of any downturn, some of our homebuilder customers may exit or severely curtail building activity in certain of our markets.\n\n\nIn addition, production homebuilders, multi-family builders and other customers may: (1) seek to purchase some of the products that we currently sell directly from manufacturers, (2) elect to establish their own building products manufacturing and distribution facilities or (3) give advantages to manufacturing or distribution intermediaries in which they have an economic stake. Continued consolidation among production homebuilders could also result in a loss of some of our present customers to our competitors. The loss of one or more of our significant customers or deterioration in our relations with any of them could significantly affect our financial condition, operating results and cash flows. Furthermore, our customers are not required to purchase any minimum quantity of product\n \n\n\n13\n\n\n\n\n \n\n\nfrom us. The contracts into which we have entered with most of our professional customers typically provide that we supply particular products or services for a certain period of time when and if ordered by the customer. Should our customers purchase our products in significantly lower quantities than they have in the past, such decreased purchases could have a material adverse effect on our financial condition, operating results and cash flows.\n\n\nProduct shortages, loss of key suppliers, and our dependence on third-party suppliers and manufacturers could affect our financial health.\n\n\nOur ability to offer a wide variety of products to our customers is dependent upon our ability to obtain adequate product supply from manufacturers and other suppliers. Historically, our products were obtainable from various sources and in sufficient quantities. However, the loss of, or an ongoing substantial decrease in the availability of products from our suppliers or the loss of key supplier arrangements could adversely impact our financial condition, operating results, and cash flows.\n \n\n\nAlthough in many instances we have agreements with our suppliers, these agreements are generally terminable by either party on limited notice. Failure by our suppliers to continue to supply us with products on commercially reasonable terms, or at all, could put pressure on our operating margins or have a material adverse effect on our financial condition, operating results and cash flows. Short-term changes in the cost of these materials, some of which are subject to significant fluctuations, are oftentimes, but not always, passed on to our customers. Our delayed ability to pass on material price increases to our customers could adversely impact our financial condition, operating results and cash flows.\n\n\nFurthermore, the inability of our suppliers to meet our supply needs in a timely manner or our quality standards could cause delays to delivery date requirements of our customers. Such failures could result in the cancellation of orders, customers’ refusal to accept deliveries, a reduction in purchase prices, and ultimately, termination of customer relationships, any of which could have a material adverse effect on our business, financial condition, results of operations and liquidity. In that case, we may be required to seek alternative sources of materials or products. Our inability to identify and secure alternative sources of supply could have a material and adverse effect on our ability to satisfy customer orders. While we have largely been able to manage these supply chain disruptions to date, there is no guarantee that we will be able to do so in the future.\n\n\nFailure to attract and retain our key employees may adversely impact our ability to successfully execute our business strategies.\n \n\n\nOur success depends in part on our ability to attract, hire, train and retain qualified managerial, operational, sales and other personnel. We face significant competition for these types of employees in our industry and from other industries.  We may be unsuccessful in attracting and retaining the personnel we require to conduct and expand our operations successfully. In addition, key personnel may leave us and compete against us. Our success also depends to a significant extent on the continued service of our senior management team. We may be unsuccessful in replacing key managers who either resign or retire. The loss of any member of our senior management team or other experienced senior employees could impair our ability to execute our business plan, cause us to lose customers and reduce our net sales, or lead to employee morale problems and/or the loss of other key employees. In any such event, our financial condition, operating results and cash flows could be adversely affected.\n \n\n\nIn addition, continued competition for non-management employees has resulted in higher labor costs and labor shortages at our facilities.  Consequently, we may continue to face higher operating expenses and may lose revenue opportunities if we lack capacity to meet customer demands due to labor shortages  While only a small percentage of our workforce is unionized, there can be no assurance that additional employees will not conduct union organization campaigns or become union members in the future and a failure to renew existing collective bargaining agreements on favorable terms could lead to further labor shortages and higher labor costs.\n\n\nWe may be adversely affected by any disruption in our respective information technology systems.\n \n\n\nOur operations are dependent upon our information technology systems, which encompass all of our major business functions. Our primary ERP systems are proprietary systems that have been highly customized by our computer programmers. Our centralized financial reporting system currently draws data from our ERP systems. We are also currently implementing a new ERP system and there is no guarantee that such implementation will be successful or that we will not experience disruptions in connection with the new ERP system. We rely upon our information technology systems to run critical accounting and financial information systems, process receivables, manage and replenish inventory, fill and ship customer orders on a timely basis, and coordinate our sales activities across all products and services. A substantial disruption in our information technology systems for any prolonged time period could result in problems and delays in generating critical financial and operational information, processing receivables, receiving inventory and supplies and filling customer orders. These disruptions could adversely affect our operating results as well as our customer service and relationships. Our systems, or those of our significant customers or suppliers, might be damaged or interrupted by natural or man-made events or by computer viruses, physical or electronic break-ins, or similar disruptions affecting the global Internet.\n \n\n\n14\n\n\n\n\n \n\n\nIn addition, we rely on a number of third-party service providers to execute certain business processes and maintain certain information technology systems and infrastructure, and any breach of security or disruption in their systems could impair our ability to operate effectively. Such disruptions, delays, problems, or associated costs relating to our systems or those of our significant customers, suppliers or third-party providers could have a material adverse effect on our financial condition, operating results and cash flows.\n\n\nFurthermore, advances in computer and software capabilities, encryption technology, and other discoveries increase the complexity of our technological environment, including how each interacts with our various software platforms. Such advances could delay or hinder our ability to process transactions or could compromise the integrity of our data, resulting in a material adverse impact on our financial condition and results of operations. The risk of system disruption is increased when significant system changes are undertaken. If we fail to timely integrate and update our information technology systems and processes, including our new ERP system, we may fail to realize the cost savings or operational benefits anticipated to be derived from these initiatives.\n \n\n\nWe are subject to cybersecurity risks and expect to incur increasing costs in an effort to minimize those risks.\n\n\nOur business employs systems that allow for the secure storage and transmission of customers’, vendors’ and employees’ proprietary information. Security breaches could expose us to a risk of loss or misuse of this information, litigation and potential liability. We may not have the resources or technical sophistication to anticipate or prevent rapidly evolving types of cyber-attacks. Any compromise of our security could result in a violation of applicable privacy and other laws, significant legal and financial exposure, damage to our reputation and a loss of confidence in our security measures, which could harm our business. The regulatory environment related to information security and privacy is increasingly rigorous, with new and constantly changing requirements applicable to our business, and compliance with those requirements could result in additional costs. Our computer systems have been, and will likely continue to be, subjected to computer viruses or other malicious codes, unauthorized access attempts and cyber- or phishing-attacks. Additionally, we may be impacted by intrusions or failures of critical infrastructure such as the power grid or communications systems. These events could compromise ours’ and our customers’ and suppliers’ confidential information, impede or interrupt our business operations, and could result in other negative consequences, including remediation costs, loss of revenue, litigation and reputational damage. While we have not experienced any material losses relating to cyber-attacks or other information security breaches to date, we have been the subject of attempted hacking and cyber-attacks and there can be no assurance that we will not suffer such significant losses in the future. As cyber-attacks become more sophisticated, we expect to incur increasing costs to strengthen our systems from outside intrusions. While we have implemented administrative and technical controls and have taken other preventive actions, such as deploying company-wide cybersecurity training and conducting threat simulations to reduce the risk of cyber incidents and protect our information technology, they may be insufficient to prevent physical and electronic break-ins, cyber-attacks or other security breaches to our computer systems.\n\n\nChanges in our customer or product sales mix affect our operating results.\n \n\n\nOur operating results vary according to the amount and type of products we sell to each of our primary customer types: single-family homebuilders, remodeling contractors, and multi-family, commercial and other contractors. Gross margins on sales to single-family, multi-family, commercial and other contractors vary based on a variety of factors, including the purchase volumes of the individual customer, the mix of products sold to that customer, the cost to serve that customer, the size and selling price of the project being constructed and the number of upgrades added to the project before or during its construction.\n \n\n\nWe generate significant business from the large single-family homebuilders; however, our gross margins on sales to them tend to be lower than our gross margins on sales to other market segments. A shift in our sales mix towards the larger homebuilders could negatively impact our gross margins.\n\n\nIn addition, we typically realize higher gross margins on more highly engineered and customized products, or ancillary products that are often purchased based on convenience and are therefore less price sensitive to our customers. For example, sales of lumber and lumber sheet goods tend to generate lower gross margins due to their commodity nature and the relatively low switching costs of sourcing those products from different suppliers. Structural components and millwork, doors and windows often generate higher gross margins relative to other products due to their increased complexity and opportunity for efficiency gains. A shift in our sales mix towards the lumber and lumber sheet goods product category could negatively impact our gross margins.\n\n\nThe implementation of our supply chain and technology initiatives could disrupt our operations, and these initiatives might not provide the anticipated benefits or might fail.\n\n\nWe have made, and we plan to continue to make, significant investments in our supply chain and technology. These initiatives are designed to streamline our operations to allow our employees to continue to provide high quality service to our customers, while simplifying customer interaction and providing our customers with a more interconnected purchasing experience. The cost and\n \n\n\n15\n\n\n\n\n \n\n\npotential problems and interruptions associated with the implementation of these initiatives, including those associated with managing third-party service providers and employing new web-based tools and services, could disrupt or reduce the efficiency of our operations. In the event that we continue to grow, there can be no assurance that we will be able to keep up, expand or adapt our IT infrastructure to meet evolving demand on a timely basis and at a commercially reasonable cost, or at all. In addition, our improved supply chain and new or upgraded technology might not provide the anticipated benefits, it might take longer than expected to realize the anticipated benefits or the initiatives might fail altogether.\n\n\nFurthermore, our customers are continuing to increasingly demand and rely on increased technology in their operations. We anticipate digitization trends in the home-building industry to continue and have made significant investments in technology solutions to further drive digitization of the home-building industry. While we believe such trends present opportunities for our business, we may be unsuccessful in keeping pace with the development of such technologies, which could result in loss of customers.\n \n\n\nWe regularly invest resources to update and improve our internal information technology systems and software platforms. Should our investments not succeed, or if delays or other issues with new or existing internal technology systems and software platforms disrupt our operations, our business could be harmed.\n\n\nWe rely on our network infrastructure, ERP systems, data hosting, public cloud and software-as-a-service providers, and internal technology systems for many of our development, marketing, operational, support, sales, accounting and financial reporting activities. We are continually investing resources to update and improve these systems and environments in order to meet existing needs, as well as the growing and changing requirements of our business and customers. For example, we are in the process of implementing a new ERP system. The new ERP system is intended to transform areas such as manufacturing, supply chain, procurement, warehouse management, delivery, quote to cash, financial reporting, and analytics, and position us to better leverage automation and process efficiency and enable productivity enhancements. An implementation of this scale is a major financial undertaking and has required, and will continue to require, substantial time and attention of management and key employees. Furthermore, we may not realize the anticipated benefits from the implementation of the new ERP system. We anticipate full integration of the new ERP system to take many years. If we experience prolonged delays or unforeseen difficulties in updating and upgrading our systems and architecture, including our new ERP system, we may experience outages and may not be able to deliver certain offerings or develop new offerings and enhancements that we need to remain competitive. Improvements, upgrades and, to a greater extent, system conversions, are often complex, costly and time consuming. In addition, such improvements can be challenging to integrate with our existing technology systems or may uncover problems with our existing technology systems. Unsuccessful implementation of hardware or software updates and improvements could result in outages, disruption in our business operations, loss of revenue or damage to our reputation. Additionally, the effectiveness of our internal control over financial reporting could be adversely affected if the new ERP system is not successfully implemented. Any of these items, along with any failure to effectively manage data governance risks prior to or during ERP implementation, could adversely affect our results of operations, cash flows and financial condition, and the trading price of our common stock.\n\n\nWe occupy most of our facilities under long-term non-cancelable leases. We may be unable to renew leases at the end of their terms. If we close a facility, we are still obligated under the applicable lease.\n \n\n\nMost of our facilities are leased. Many of our leases are non-cancelable, typically have initial expiration terms ranging from five to 15 years and most provide options to renew for specified periods of time. We believe that leases we enter into in the future will likely be for similar terms (five to 15 years), will be non-cancelable and will feature similar renewal options. If we close or idle a facility, we would remain committed to perform our obligations under the applicable lease, which would include, among other things, payment of the base rent, insurance, taxes and other expenses on the leased property for the balance of the lease term. We have closed or idled a number of facilities for which we continue to remain liable. Our obligation to continue making rental payments with respect to leases for closed or idled facilities could have a material adverse effect on our business and results of operations. At the end of a lease term, for those locations where we have no renewal options remaining, we may be unable to renew the lease without additional cost, if at all. If we are unable to renew our facility leases, we may close or, if possible, relocate the facility, which could subject us to additional costs and risks which could have a material adverse effect on our business. Additionally, the revenue and profit generated at a relocated facility may not equal the revenue and profit generated at the former operation.\n\n\nFinancial and Liquidity Risks\n\n\nOur level of indebtedness could adversely affect our ability to raise additional capital to fund our operations, limit our ability to react to changes in the economy or our industry, and prevent us from meeting our obligations under our debt instruments\n.\n \n\n\nAs of December 31, 2024, our debt totaled $3.7 billion, which includes $0.2 billion of finance lease and other finance obligations. We have a $1.8 billion revolving credit facility with a maturity date of January 17, 2028 (“Revolving Facility”), under\n \n\n\n16\n\n\n\n\n \n\n\nwhich we had no outstanding borrowings and $0.1 billion of letters of credit outstanding as of December 31, 2024. In addition, we also have $0.6 billion in obligations under operating leases.\n \n\n\nOur level of indebtedness could have important consequences to us, including:\n \n\n\n•\nmake it more difficult for us to satisfy our obligations with respect to our other indebtedness, resulting in possible defaults on and acceleration of such indebtedness;\n\n\n•\nincreasing our vulnerability to general economic and industry conditions; \n\n\n•\nrequiring a substantial portion of our operating cash flow to be dedicated to the payment of principal and interest on our indebtedness, therefore reducing our liquidity and our ability to use our cash flow to fund our operations, capital expenditures, future business opportunities, share repurchases and retirement of debt; \n\n\n•\nexposing us to the risk of increased interest rates, and corresponding increased interest expense, because borrowings under the Revolving Facility are at variable rates of interest; \n\n\n•\nlimiting our ability to obtain additional financing for working capital, capital expenditures, debt service requirements, acquisitions, and general corporate or other purposes; \n\n\n•\nlimiting our ability to adjust to changing marketplace conditions and placing us at a competitive disadvantage compared to our competitors who may have less debt; and \n\n\n•\nlimiting our attractiveness as an investment opportunity for potential investors.\n\n\nIn addition, our debt instruments contain cross-default provisions that could result in our debt being declared immediately due and payable under a number of debt instruments, even if we default on only one debt instrument. In such event, it is possible that we would not be able to satisfy our obligations under all of such accelerated indebtedness simultaneously.\n \n\n\nOur financial condition and operating performance, including that of our subsidiaries, are also subject to prevailing economic and competitive conditions and to certain financial, business and other factors beyond our control. There are no assurances that we will maintain a level of liquidity sufficient to permit us to pay the principal, premium and interest on our indebtedness.\n \n\n\nIf our cash flows and capital resources are insufficient to fund our debt service obligations, we may be forced to reduce or delay capital expenditures, sell assets, seek additional capital, or restructure or refinance our indebtedness. These alternative measures may not be successful and may not permit us to meet our scheduled debt service obligations. In the absence of such operating results and resources, we could face substantial liquidity problems and might be required to dispose of material assets or operations in an effort to meet our debt service and other obligations.\n \n\n\nWe may have future capital needs and may not be able to obtain additional financing on acceptable terms.\n \n\n\nWe are substantially reliant on cash on hand and borrowing availability under the Revolving Facility, which totaled $1.8 billion at December 31, 2024, to provide working capital and fund our operations. Our working capital requirements are likely to grow as we continue to grow organically and through acquisitions. Our inability to renew, amend or replace our debt instruments when required or when business conditions warrant could have a material adverse effect on our business, financial condition and results of operations.\n \n\n\nEconomic and credit market conditions, the performance of our industry, and our financial performance, as well as other factors, may constrain our financing abilities. Our ability to secure additional financing, if available, and to satisfy our financial obligations under indebtedness outstanding from time to time will depend upon our future operating performance, the availability of credit, economic conditions and financial, business and other factors, many of which are beyond our control. Significant worsening of current housing market conditions or the macroeconomic factors that affect our industry could require us to seek additional capital and have a material adverse effect on our ability to secure such capital on favorable terms, if at all.\n \n\n\nWe may be unable to secure additional financing, financing on favorable terms or our operating cash flow may be insufficient to satisfy our financial obligations under indebtedness outstanding from time to time. The agreements governing our debt instruments, moreover, restrict the amount of permitted indebtedness allowed. In addition, if financing is not available when needed, or is available on unfavorable terms, we may be unable to take advantage of business opportunities, including potential acquisitions, or respond to competitive pressures, any of which could have a material adverse effect on our business, financial condition, and results of operations. If additional funds are raised through the issuance of additional equity or convertible debt securities, our stockholders may experience significant dilution.\n \n\n\n17\n\n\n\n\n \n\n\nWe may incur additional indebtedness.\n \n\n\nWe may incur additional indebtedness in the future, including collateralized debt, subject to the restrictions contained in the agreements governing our debt instruments. If new debt is added to our current debt levels, the related risks that we now face could intensify.\n \n\n\nOur debt instruments contain various covenants that limit our ability to operate our business.\n \n\n\nOur financing arrangements, including the agreements governing our debt instruments, contain various provisions that limit our ability to, among other things:\n \n\n\n•\ntransfer or sell assets, including the equity interests of our restricted subsidiaries, or use asset sale proceeds; \n\n\n•\nincur additional debt; \n\n\n•\npay dividends or distributions on our capital stock or repurchase our capital stock; \n\n\n•\nmake certain restricted payments or investments; \n\n\n•\ncreate liens to secure debt; \n\n\n•\nenter into transactions with affiliates; \n\n\n•\nmerge or consolidate with another company or continue to receive the benefits of these financing arrangements under a “change in control” scenario (as defined in those agreements); and \n\n\n•\nengage in unrelated business activities. \n\n\nThe agreement governing the Revolving Facility contains a financial covenant requiring the satisfaction of a minimum fixed charge ratio of 1.00 to 1.00 if our excess availability falls below the greater of $80.0 million or 10% of the maximum borrowing amount, which was $171.4 million as of December 31, 2024.\n\n\nThese provisions may restrict our ability to expand or fully pursue our business strategies or return capital to our shareholders through share repurchases. Our ability to comply with the agreements governing our debt instruments may be affected by changes in our operating and financial performance, changes in general business and economic conditions, adverse regulatory developments, a change in control or other events beyond our control. The breach of any of these provisions could result in a default under our indebtedness, which could cause those and other obligations to become due and payable. If any of our indebtedness is accelerated, we may not be able to repay it.\n\n\nOur variable rate indebtedness subjects us to interest rate risk, which could cause our indebtedness service obligations to increase significantly.\n\n\nInterest rates may increase in the future. As a result, interest rates on our Revolving Facility could be higher or lower than current levels.  As of December 31, 2024, we had no outstanding debt at variable interest rates.  If interest rates increase, our debt service obligations on the variable rate indebtedness would increase even though the amount borrowed remained the same, and our net income and cash flows, including cash available for servicing our indebtedness, would correspondingly decrease. The Revolving Facility also assesses variable commitment and outstanding letter of credit fees based on quarterly average loan utilization. Further, an increase in interest rates could also trigger a limitation on the deductibility of those interest costs, increasing our tax expense and further decreasing our net income and cash flows. In recent years, the Company has executed several debt transactions designed to optimize our debt structure and extend maturities. The Company is likely to execute similar debt transactions in the future. However, there can be no assurance that we will be successful in anticipating the direction of interest rates or changes in market conditions, which could result in future debt transactions having a material adverse impact on our financial condition, operating results and cash flows.\n\n\nIf the housing market declines, we may be required to take impairment charges relating to our operations or temporarily idle or permanently close under-performing locations.\n \n\n\nIf conditions in the housing industry continue to deteriorate, we may need to take goodwill and/or asset impairment charges relating to certain of our reporting units. Any such non-cash charges would have an adverse effect on our financial results. In addition, in response to industry conditions, we may have to temporarily idle or permanently close certain facilities in under-performing markets. Widespread facility closures could have a significant adverse effect on our financial condition, operating results and cash flows.\n\n\n18\n\n\n\n\n \n\n\nOur inability to effectively deploy our excess capital may negatively affect return on equity and stockholder value.\n\n\nThroughout 2024, we generated significant excess cash flows. Our business plan calls for us to execute a variety of strategies to deploy excess capital including, but not limited to, continued organic balance sheet growth and the consideration of potential acquisition opportunities to further deploy our excess capital when we expect such opportunities to significantly enhance long-term stockholder value. We have also repurchased approximately $7.6 billion of our shares since January 2021 through the date of this filing and intend to continue repurchasing shares pursuant to share repurchase authorization approved by our board of directors in August 2024. Our inability to effectively and timely deploy our excess capital through these strategies may constrain growth in earnings and return on equity and thereby diminish potential growth in stockholder value.\n\n\nLegal and Compliance Risks\n\n\nThe nature of our business exposes us to product liability, product warranty, casualty, construction defect, asbestos, vehicle, workplace safety and injury and other claims and legal proceedings.\n \n\n\nWe are involved in product liability, product warranty, casualty, construction defect, asbestos, vehicle, workplace safety and injury and other claims relating to the products we manufacture and distribute, services we provide or have provided and our operations that, if adversely determined, could adversely affect our financial condition, operating results, and cash flows. We rely on manufacturers and other suppliers to provide us with many of the products we sell and distribute. Because we have no direct control over the quality of such products manufactured or supplied by such third-party suppliers, we are exposed to risks relating to the quality of such products. The Company has a number of known and threatened construction defect legal claims. We are also involved in several asbestos personal injury suits due to the alleged sale of asbestos-containing products by legacy businesses that we acquired.  In addition, we are exposed to potential claims arising from the conduct of our respective employees and subcontractors, and builders and their subcontractors, for which we may be contractually liable. Although we currently maintain what we believe to be suitable and adequate insurance in excess of our self-insured amounts, there can be no assurance that we will be able to maintain such insurance on acceptable terms or that such insurance will provide adequate protection against potential liabilities. We are also subject to workplace safety and injury claims from our employees and contractors. Product liability, product warranty, casualty, construction defect, asbestos, vehicle, workplace safety and injury and other claims can be expensive to defend and can divert the attention of management and other personnel for significant periods, regardless of the ultimate outcome. Claims of this nature could also have a negative impact on customer confidence in our products and our company. In addition, we are involved on an ongoing basis in other types of legal proceedings, such as workers’ compensation proceedings. We cannot assure you that any current or future claims against us will not adversely affect our financial condition, operating results and cash flows.\n\n\nFederal, state, local and other regulations could impose substantial costs and/or restrictions on our operations that would reduce our net income.\n \n\n\nWe are subject to various federal, state, local and other regulations, including, among other things, regulations promulgated by the Department of Transportation and applicable to our fleet of delivery trucks, work safety regulations promulgated by the Department of Labor’s Occupational Safety and Health Administration, employment regulations, including immigration and work-authorization laws and regulations promulgated by the United States Equal Employment Opportunity Commission, tariff regulations on imported products promulgated by the Federal government, accounting standards issued by the Financial Accounting Standards Board (“FASB”) or similar entities, state and local regulations relating to our escrow business, and state and local zoning restrictions and building codes. In addition, changes to global trade policies may adversely impact our business. Significant changes in these or other areas may increase our general and administrative costs and adversely affect our financial condition, operating results and cash flows. Moreover, failure to comply with the regulatory requirements applicable to our business could expose us to substantial penalties that could adversely affect our financial condition, operating results and cash flows and damage our reputation.\n \n\n\nFuture changes to tax laws and regulations could have an adverse impact on our business.\n\n\nWe are primarily subject to income and other taxes in the U.S., and on a very limited basis in certain foreign jurisdictions. We are subject to ongoing tax audits in various jurisdictions. We regularly assess the likely outcome of these audits in order to determine the appropriateness of our tax provision. However, there can be no assurance that we will accurately predict the outcome of these audits, and the amounts ultimately paid upon resolution of audits could be materially different from the amounts previously included in our income tax expense and therefore could have a material impact on our tax provision, net income and cash flows. In addition, our effective tax rate in the future could be adversely affected by changes to our operating structure, changes in the valuation of deferred tax assets and liabilities, changes in tax laws, and the discovery of new information in the course of our tax return preparation. Any future changes in federal and state tax laws and regulations could have an adverse direct impact on our corporate taxes and/or an adverse indirect impact such as making purchasing a home less attractive, which could reduce demand for homes. Adverse impacts\n \n\n\n19\n\n\n\n\n \n\n\nfrom any future changes in federal and state laws and regulations on our business could include an adverse impact on our financial condition, operating results and cash flows.\n\n\nA measure of our success is dependent on maintaining our safety record, and an injury to, or death of, any of our employees, customers, or members of the general public related to our business activities could result in material liabilities and reputational injury.\n \n\n\nOur business activities include an inherent risk of safety incidents that could result in injuries and deaths. The activities we conduct at our facilities present a risk of injury or death to our employees, customers, or visitors, notwithstanding our compliance with safety regulations. We may be unable to avoid material liabilities for an injury or death, and our workers’ compensation and other insurance policies may not be adequate or may not continue to be available on terms acceptable to us, or at all, which could result in material liabilities to us.\n \n\n\nFurther, as a leading supplier and manufacturer of building materials, manufactured components and construction services, we operate a fleet of commercial motor vehicles, including semi-tractor trailer trucks, flatbed trucks, and forklifts. Accordingly, a safety incident involving our commercial fleet could result in material economic damages, as well as injuries and/or death, for our employees and any other parties involved. Although we believe our aggregate insurance limits should be sufficient to cover our historic claims amounts, participants in commercial distribution and transportation activities (i.e., trucking and transportation) have experienced large verdicts, including some instances in which juries have awarded significant amounts.\n\n\nIn addition, our brand’s reputation is an important asset to our business; as a result, anything that damages our brand’s reputation could materially harm our business, results of operations, and financial condition. For example, negative media reports, whether or not accurate, can materially and adversely affect or reputation. Moreover, social media has dramatically increased the rate at which negative publicity can be disseminated before there is any meaningful opportunity to respond to or address an issue to protect our reputation.\n \n\n\nWe are subject to potential exposure to environmental liabilities and are subject to environmental regulation.\n \n\n\nWe are subject to various federal, state and local environmental laws, ordinances and regulations. Although we believe that our facilities are in material compliance with such laws, ordinances, and regulations, as owners and lessees of real property, we can be held liable for the investigation or remediation of contamination on such properties, in some circumstances, without regard to whether we knew of or were responsible for such contamination. No assurance can be provided that remediation may not be required in the future as a result of spills or releases of petroleum products or hazardous substances, the discovery of unknown environmental conditions, more stringent standards regarding existing residual contamination, or changes in legislation, laws, rules or regulations. More burdensome environmental regulatory requirements may increase our general and administrative costs and adversely affect our financial condition, operating results and cash flows.\n \n\n\nGeneral Risks\n\n\nUnstable global economic conditions and geopolitical conflicts may have serious adverse consequences on our business, financial condition, and operations.\n \n\n\nWe are operating in an uncertain economic environment. The global credit and financial markets have experienced extreme volatility and disruptions, including severely diminished liquidity and credit availability, declines in consumer confidence, declines in economic growth, increases in unemployment rates, high rates of inflation, and uncertainty about economic stability and a potential recession. While our management team continually monitors market conditions and economic factors throughout our footprint, we are unable to predict the duration or severity of such conditions or factors. If conditions were to worsen nationally, regionally or locally, then we could see a decrease in housing starts, which would adversely affect our business, financial condition, operating results, and cash flows.\n \n\n\nIn addition, the financial markets and the global economy may also be adversely affected by ongoing geopolitical conflicts, including those in Ukraine and the Middle East. These conflicts have impacted, and may continue to impact, commodity and energy prices, global supply chains and financial markets. In addition, sanctions imposed by the U.S. and other countries in response to the conflict in Ukraine could further adversely impact the financial markets and the global economy, and any economic countermeasures by the affected countries or others could exacerbate market and economic instability. The specific consequences of these geopolitical conflicts on our business are difficult to predict at this time, but in addition to inflationary pressures affecting our operations, any shortages of fuel or significant fuel cost increases could seriously disrupt our ability to distribute products to our customers.\n \n\n\n20\n\n\n\n\n \n\n\nThere can be no assurance that further deterioration in markets and confidence in economic conditions will not occur. Our general business strategy may be adversely affected by any such economic downturn or recession, volatile business environment, hostile third-party action or continued unpredictable and unstable market conditions. The effects of any economic downturn or recession could continue for many years after the downturn or recession is considered to have ended.\n\n\nWe may be adversely affected by any natural or man-made disruptions to our operations and our distribution and manufacturing facilities.\n \n\n\nWe currently maintain a broad network of distribution and manufacturing facilities throughout the U.S. Any widespread disruption to our operations resulting from fire, earthquake, weather-related events (such as tornadoes, hurricanes, flooding and other storms), other natural disasters, an act of terrorism, intrusions or failures of critical infrastructure such as the power grid or communications systems or any other cause could damage multiple facilities and a significant portion of our inventory and could materially impair our ability to distribute our products to customers. Moreover, we could incur significantly higher costs and longer lead times associated with distributing our products to our customers during the time that it retakes for us to reopen or replace a damaged facility. If any of these events were to occur, our financial condition, operating results and cash flows could be materially adversely affected.\n\n\nIn addition, general weather patterns affect our operating results throughout the year, with adverse weather historically reducing construction activity in the first and fourth quarters in the markets in which we primarily operate. Adverse weather events, natural disasters or similar events, including as a result of climate change, could generally reduce or delay construction activity, which could adversely impact our financial condition, operating results and cash flows. Furthermore, if certain markets where we have made significant investments become less desirable for new home building due to the frequency of adverse weather events or climate change, we could incur significant losses at our facilities throughout these markets.\n \n\n\nRisks relating to corporate responsibility and sustainability could adversely affect our reputation and shareholder, employee, customer and third-party relationships and may negatively affect our stock price.\n \n\n\nOur business faces increasing public scrutiny related to corporate responsibility and sustainability activities. We risk damage to our brand and reputation if we fail to act responsibly or meet any commitments that we may set in a number of areas, including with respect to climate change, human capital management, support for our local communities, corporate governance and transparency, or fail to consider such factors in our business operations.\n \n\n\nAdditionally, investors and shareholder advocates are placing an increasing emphasis on how corporations address corporate responsibility and sustainability issues in their business strategy when making investment decisions and when developing their investment theses and proxy recommendations. We may incur meaningful costs with respect to our corporate responsibility and sustainability efforts and if such efforts are negatively perceived, our reputation and stock price may suffer.\n \n\n\n Climate change could adversely affect our business and damage our reputation.\n\n\nConcerns over the long-term impacts of climate change have led and will continue to lead to governmental efforts around the world to mitigate those impacts. Consumers and businesses are also changing their behavior and business preferences as a result of these concerns. New governmental regulations or guidance relating to climate change, as well as changes in consumers’ and businesses’ behaviors and business preferences, may affect whether and on what terms and conditions we will engage in certain activities or offer certain products or services. The governmental and supervisory focus on climate change could also result in our becoming subject to new or heightened regulatory requirements. Any such new or heightened requirements could result in increased regulatory, compliance or other costs. Our business, reputation and ability to attract and retain employees may also be harmed if our response to climate change is perceived to be ineffective or insufficient.\n\n\nThe price of our common stock is volatile and may decline.\n \n\n\nThe market price of our common stock historically has experienced and may continue to experience significant price fluctuations similar to those experienced by the broader stock market in recent years. For example, between January 1, 2024, and December 31, 2024, the closing price of our common stock on the NYSE ranged from $132.60 to $211.12 per share. In addition, the price of our common stock may fluctuate significantly in response to various factors, including:\n \n\n\n•\nactual or anticipated fluctuations in our results of operations;\n\n\n•\nannouncements by us or our competitors of significant business developments, changes in customer relationships, acquisitions, or expansion plans;\n\n\n21\n\n\n\n\n \n\n\n•\nchanges in the prices of products we sell;\n\n\n•\ninvolvement in litigation;\n\n\n•\nour sale or repurchases of common stock or other securities in the future;\n\n\n•\nmarket conditions in our industry;\n\n\n•\nchanges in key personnel;\n\n\n•\nchanges in market valuation or earnings of our competitors;\n\n\n•\nthe trading volume of our common stock;\n\n\n•\nchanges in the estimation of the future size and growth rate of our markets; and\n\n\n•\ngeneral economic and market conditions.     \n\n\nBroad market and industry factors may materially harm the market price of our common stock, regardless of our operating performance. In the past, following periods of volatility in the market price of a company’s securities, securities class action litigation has often been instituted against that company.\n \n\n\nIf we were involved in any similar litigation, we could incur substantial costs and our management’s attention and resources could be diverted, which could adversely affect our financial condition, results of operations and cash flows. As a result, it may be difficult for you to resell your shares of common stock in the future.\n \n\n\nI\ntem 1B.\n Unresolved Staff Comments\n \n\n\nNone.",
    "item1c": "Item 1C.\n Cybersecurity\nRisk Management and Strategy\nThe Company maintains robust and comprehensive processes, procedures and controls to protect and secure its information systems and data infrastructure from cybersecurity threats. The Company’s cybersecurity program is led by its Chief Information Security Officer (“CISO”).  The Company’s cybersecurity program interfaces with other functional areas within the Company, including but not limited to the Company’s business segments and information technology, legal, risk management, human resources and internal audit departments, as well as external third-party partners, to identify and understand potential cybersecurity threats.  The Company regularly assesses and updates its processes, procedures and management techniques in light of ongoing cybersecurity developments.\n \nInternally, the CISO coordinates oversight of reviewing security alerts, identifying and monitoring ongoing and potential cybersecurity threats, evaluating strategic business impacts of cybersecurity threats and developing programs and initiatives to educate the Company’s employees regarding cybersecurity. The CISO also manages the Company’s Security Incident Response Plan (the “Incident Response Plan”), which outlines action steps for the preparation, identification, triage, analysis, containment, eradication, recovery and reflection stages of a cybersecurity incident. The Incident Response Plan serves as the charter for the Company’s Security Incident Response Team (the “Incident Response Team”), which includes a strategic team comprised of executives from various cross-functional management teams, as well as a tactical team comprised of internal technical support roles and external third-party service providers. The Incident Response Plan provides how the Incident Response Team will analyze and, as necessary, escalate cybersecurity incidents both internally and with third-party service providers based on type and severity of the specific incident.\nThe Company also requires cybersecurity training for all active employees, focusing on the appropriate protection and security of confidential company and third-party information. Additionally, the Company provides quarterly cybersecurity awareness training that covers a broad range of security topics, including secure access practice, phishing schemes, remote work and response to suspicious activities. In addition to online training, employees are educated through several methods, including event-triggered awareness campaigns, recognition programs, security presentations, company intranet articles, videos, system-generated communications, email publications and various simulation exercises.\nThe Company has \nengage\nd \na third-party managed detection and response company to monitor the security of its information systems around-the-clock, including intrusion detection, and to provide instantaneous alerting should a cybersecurity event occur. The\n \n\n\n22\n\n\n\n\n \n\n\nCompany \nalso maintains a cybersecurity insurance policy and \nhas engaged a third-party digital forensics and incident response consultant and legal counsel on retainer\n.\nThe Company does not believe that any risks from cybersecurity threats, nor any previous cybersecurity incidents, have materially affected the Company.\n  However, the sophistication of cyber threats continues to increase, and the preventative actions the Company has taken and continues to take to reduce the risk of cyber incidents and protect its systems and information may not successfully protect against all cyber incidents.  For more information on how cybersecurity risk may materially affect the Company’s business strategy, results of operations, or financial condition, please refer to",
    "item1a": "Item 1A. Risk Factors of this annual report on Form 10-K and “Cautionary Statement” contained in Item 1. Business of this annual report on Form 10-K for a discussion of the uncertainties, risks and assumptions associated with these statements.\n \n\n\nOVERVIEW\n \n\n\nWe are a leading supplier and manufacturer of building materials, manufactured components and construction services to professional contractors, sub-contractors and consumers. The Company operates approximately 590 locations in 43 states across the U.S. Given the span and depth of our geographical reach, our locations are organized into three geographical divisions (East, Central, and West), which are also our operating segments. All of our segments have similar customers, products and services, and distribution methods. Due to the similar economic characteristics, categories of products, distribution methods and customers, our operating segments are aggregated into one reportable segment.\n \n\n\nWe offer an integrated solution to our customers by providing manufacturing, supply, and installation of a full range of structural and related building products. Our manufactured products include our factory-built roof and floor trusses, wall panels, vinyl windows, custom millwork and trim, as well as engineered wood that we design, cut, and assemble for each home. We also assemble interior and exterior doors into pre-hung units. Additionally, we supply our customers with a broad offering of professional grade building products not manufactured by us, such as dimensional lumber and lumber sheet goods, various window, door and millwork lines along with other various building products. Our full range of construction-related services includes professional installation, turn-key framing and shell construction, and spans all of our product categories. We also offer digital solutions through our Paradigm subsidiary, including drafting, estimating, quoting, and virtual home design services.\n\n\nWe group our building products into four product categories:\n\n\n•\nManufactured Products.\n Manufactured products consist of wood floor and roof trusses, wall panels, engineered wood and our Ready-Frame\n®\n framing system.\n\n\n•\nWindows, Doors and Millwork. \nWindows and doors are comprised of the manufacturing, assembly, and distribution of windows and the assembly and distribution of interior and exterior door units. Millwork includes interior trim and custom features that we manufacture, such as intricate mouldings, stair parts, and columns.  \n\n\n•\nSpecialty Building Products and Services.\n Specialty building products and services consist of various products, including vinyl, composite and wood siding, exterior trim, metal studs, cement, roofing, insulation, wallboard, ceilings, cabinets, and hardware. This category also includes services such as turn-key framing, shell construction, design assistance and professional installation of products spanning all of our product categories. We also offer software products through our Paradigm subsidiary, including drafting, estimating, quoting, and virtual home design services, which provide digital solutions to retailers, distributors, manufacturers and homebuilders that help them boost sales, reduce costs, and become more competitive.\n\n\n•\nLumber and Lumber Sheet Goods.\n Lumber and lumber sheet goods include dimensional lumber, plywood, and OSB products used in on-site house framing.  \n\n\nOur operating results are dependent on the following trends, strategies, events and uncertainties, some of which are beyond our control:\n \n\n\n•\nHomebuilding Industry and Market Competition. \nOur business is driven primarily by the residential new construction market and the residential repair and remodel market, which are in turn dependent upon a number of factors, including demographic trends, interest rates, consumer confidence, employment rates, housing affordability, household formation, land development costs, the availability of skilled construction labor, rising inflationary pressures, mortgage markets and the health of the economy. Many factors have impacted and may continue to impact our sales and gross margins, including continued consolidation within the building products supply industry, increased competition for homebuilder business, supply chain constraints and cyclical fluctuations in commodity prices. Moreover, our industry remains highly fragmented and competitive, and we will continue to face significant competition from local and regional suppliers. As various current market dynamics, including inflationary pressures, mortgage rates and housing affordability shift, industry forecasters, including the National Association of Home Builders (“NAHB”), expect to see housing demand increase in the near-term. Despite recent tempered market conditions, we believe the housing industry remains underbuilt and that there are several meaningful trends that indicate U.S. housing demand will continue to be strong over the long-term, including the aging of housing stock and normal population growth due to immigration and birthrate exceeding death rate.\n\n\n27\n\n\n\n\n \n\n\n•\nTargeting Large Production Homebuilders.\n The homebuilding industry continues to undergo consolidation, and the larger homebuilders continue to increase their market share. We expect that trend to continue as larger homebuilders have better liquidity and land positions relative to the smaller, less capitalized homebuilders. Our focus is on maintaining relationships and market share with these customers while balancing the competitive pressures we face in servicing large homebuilders with certain profitability expectations. Additionally, we continue to focus on expanding our custom homebuilder base while maintaining acceptable credit standards.\n\n\n•\nMulti-family and Light Commercial Business. \nOur primary focus has been on single-family residential new construction and the repair and remodel end market. However, through recent acquisitions we have expanded our operational footprint in the multi-family market, predominantly five-story and smaller, wood construction, and the light commercial market, growing our value-added components and millwork product offerings in this end market. We will continue to identify opportunities for profitable growth in these areas.\n\n\n•\nRepair and remodel end market\n.  While influenced by housing starts to a lesser degree than the homebuilding market, the repair and remodel market is still dependent upon some of the same factors, including demographic trends, interest rates, consumer confidence, employment rates, the health of the economy and home financing markets. As a result of these pressures, we may experience reduced sales demand, challenges in the supply chain, increased margin pressures and/or increased operating costs in this area of our business. We expect that our ability to remain competitive in this space will depend on our continued ability to provide a high level of customer service coupled with a broad product offering.  \n\n\n•\nUse of Prefabricated Components. \nHomebuilders are increasingly using prefabricated components in order to realize increased efficiency, overcome skilled construction labor shortages and improve quality. Shortening cycle times from start to completion is a key imperative of the homebuilders during periods of strong consumer demand. As the availability of skilled construction labor remains limited, we continue to see the demand for prefabricated components increasing within the residential new construction market.\n\n\n•\nEconomic Conditions.\n Economic changes both nationally and locally in our markets impact our financial performance. The building products supply industry is highly dependent upon new home construction and, to a lesser extent, repair and remodel activities, and is subject to cyclical market changes. Our operations are subject to fluctuations arising from changes in supply and demand, national and local economic conditions, labor costs and availability, competition, government regulation, trade policies (including with respect to tariffs on imported goods), inflation and other factors that affect the homebuilding industry, such as demographic trends, interest rates, housing starts, the high cost of land development, employment levels, consumer confidence, and the availability of credit to homebuilders, contractors, and homeowners. Disruptions and uncertainties as a result of a number of unforeseen environmental, social, economic or other factors, may have a significant impact on our future operating results.\n\n\n•\nHousing Affordability.\n \nThe affordability of housing can be a key driver in demand for our products. Home affordability is influenced by a number of economic factors, such as the level of employment, consumer confidence, consumer income, supply of houses, the availability of financing and interest rates. Changes in the inventory of available homes and other economic factors relative to home prices could result in changes to the affordability of homes. As a result, homebuyer demand may shift toward smaller or larger homes creating fluctuations in demand for our products.\n\n\n•\nCost and/or Availability of Materials. \nPrices of building materials, including wood products, are subject to cyclical market fluctuations, which may adversely impact operating income when prices rapidly rise or fall within a relatively short period of time. We purchase materials which are then sold to customers as well as used as direct production inputs for our manufactured and prefabricated products. Short-term changes in the cost and/or availability of these materials, some of which are subject to significant fluctuations, are often passed on to our customers, but our pricing quotation periods and market competition may limit our ability to pass on such price changes. We may also be limited in our ability to pass on increases on in-bound freight costs on our products. We may also experience challenges sourcing suitable products for our customers and may be forced to provide alternative materials as substitution for contracted orders. Our inability to pass on material price increases to our customers could adversely impact our operating results.\n\n\n•\nControlling Expenses. \nAnother important aspect of our strategy is controlling costs and striving to be a low total-cost building materials supplier in the markets we serve. We closely manage our working capital and operating expenses, and we pay careful attention to our logistics function and its effect on our shipping and handling costs. However, we do have significant fixed costs and declines in our customer demand could have an adverse impact on our operating results. \n\n\n \n\n\n28\n\n\n\n\n \n\n\n•\nCapital Structure. \nWe strive to optimize our capital structure to ensure that our financial needs are met in light of economic conditions, business activities, organic investments, opportunities for growth through acquisition and the overall risk characteristics of our underlying assets. In addition to these factors, we also evaluate our capital structure on the basis of our leverage ratio, our liquidity position, our debt maturity profile, our market capitalization, and market interest rates. As such, we may enter into various debt or equity transactions to appropriately manage and optimize our capital structure and liquidity needs.\n\n\nRECENT DEVELOPMENTS\n \n\n\nBusiness Combinations\n\n\nDuring 2024 we completed a number of acquisitions for a combined $345.4 million purchase price, net of cash acquired, including the acquisitions of (i) Quality Door & Millwork, Inc. (“Quality Door”), (ii) Hanson Truss Components, Inc. (“Hanson Truss”), (iii) RPM Wood Products, Inc. (“RPM”), (iv) Schoeneman Bros. Company (“Schoeneman”), (v) TRSMI, LLC (“TRSMI”), (vi) Western Truss & Components (“Western Truss”), (vii) CRi SoCal (“CRi”), (viii) Wyoming Millwork Co. (“Wyoming Millwork”), (ix) Sunrise Wood Designs, LLC (“Sunrise Wood Designs”), (x) Reno Truss, Inc. (“Reno Truss”), (xi) High Mountain Door and Trim, Inc. (“High Mountain”), (xii) Douglas Lumber, Kitchens and Home Center (“Douglas Lumber”), and (xiii) Kleet Lumber (“Kleet Lumber”).\n\n\nOn January 2, 2025, we completed our previously announced acquisition of Alpine Lumber Company, the largest independently operated supplier of building materials in Colorado and northern New Mexico. Alpine serves the Colorado Front Range, western Colorado and northern New Mexico through its 21 operating locations and provides a broad product range, including prefabricated trusses and wall panels and millwork. On February 3, 2025, we completed the acquisition of O.C. Cluss Lumber, a lumber and building supplies provider in southwestern Pennsylvania, western Maryland and northern West Virginia.\n \n\n\nThese acquisitions further expand our market footprint and provide additional operations in our value-added product categories and are further described in Notes 3 and 16 to the consolidated financial statements included in Item 8 of this annual report on Form 10-K.\n\n\nCompany Shares Repurchases\n\n\nOn February 21, 2024, the Company’s board of directors authorized the repurchase of up to $1.0 billion of the Company’s outstanding shares of common stock, inclusive of the approximately $200 million remaining outstanding in the prior share repurchase plan authorized in April 2023. Share repurchases under this program were completed in May 2024.\n\n\nOn August 5, 2024, the Company’s board of directors authorized a new repurchase plan of up to $1.0 billion of the Company’s outstanding shares of common stock.\n \n\n\nUnder share repurchase programs authorized by the board of directors since August 2021, the Company has repurchased a total of 95.9 million shares of common stock, or 46.5% of the Company’s total shares outstanding, at an average price of $79.56, inclusive of fees and taxes, including 8.9 million shares of common stock at an average price of $170.74, inclusive of fees and taxes, in 2024. As of December 31,2024, the Company had $500.0 million authorization remaining under its current share repurchase program.\n\n\nDebt Transactions\n\n\nOn February 29, 2024, the Company completed a private offering of $1.0 billion in aggregate principal amount of 6.375% senior unsecured notes due 2034 (“6.375% 2034 notes”) at an issue price equal to 100% of par value. The net proceeds from the offering were used to pay related transaction fees and expenses, repay indebtedness outstanding under the Revolving Facility and for general corporate purposes.\n \n\n\nThis transaction is described further in Note 8 to the consolidated financial statements included in Item 8 of this annual report on Form 10-K. From time to time, based on market conditions and other factors and subject to compliance with applicable laws and regulations, the Company may repurchase or call our notes, repay debt, repurchase shares of our common stock or otherwise enter into transactions regarding its capital structure.\n\n\nExecutive Officer Transition\n\n\nOn September 19, 2024, the Company’s board of directors appointed Peter Jackson as the Company’s next President & Chief Executive Officer and member of its board of directors, effective November 6, 2024. Mr. Jackson previously served as Executive Vice President and Chief Financial Officer of the company since January 2021 and as Senior Vice President and Chief Financial Officer since November 2016. Mr. Jackson succeeded Dave Rush, who served as President and Chief Executive Officer since November 2022 and retired after 25 years of dedicated service to the Company, effective November 6, 2024. Mr. Rush will remain on the Company’s\n \n\n\n29\n\n\n\n\n \n\n\nboard of directors and continue as a special advisor to the Company to ensure a smooth transition. Additionally, the Company’s board of directors appointed Pete Beckmann, Senior Vice President, as Chief Financial Officer to succeed Mr. Jackson, effective November 6, 2024. Mr. Beckmann previously served as Senior Vice President, Financial Planning &Analysis of the Company since January 2021 and has been with the Company and legacy companies since 1999, serving in finance roles of increasing responsibility.\n\n\nCURRENT OPERATING CONDITIONS AND OUTLOOK\n \n\n\nAccording to the U.S. Census Bureau, actual U.S. total housing starts for the year ended December 31, 2024, were 1.4 million, a decrease of 3.9% compared to the year ended December 31, 2023. Actual U.S. single-family housing starts for the year ended December 31, 2024, were 1.0 million, an increase of 6.5% compared to the year ended December 31, 2023. A composite of third-party sources, including the NAHB, are forecasting 1.4 million U.S. total housing starts and 1.0 million U.S. single-family housing starts for 2025, which are relatively flat from 2024. In addition, in its September 2024 semi-annual forecast, the HIRI forecasted sales in the professional repair and remodel end market to increase 3.2% in 2025 compared to 2024.\n\n\nWe believe the long-term outlook for the housing industry is positive and that the housing industry remains underbuilt due to growth in the underlying demographics compared to historical new construction levels. However, uncertainty around interest rates and inflation may continue to pressure near-term housing industry demand as homes are less affordable for consumers, investors and builders. We believe we are well-positioned to take advantage of the construction activity in our markets and to increase our market share, which may include strategic acquisitions. We will continue to focus on working capital by closely monitoring the credit exposure of our customers, remaining focused on maintaining the right level of inventory and by working with our vendors to improve payment terms. We strive to achieve the appropriate balance of short-term expense control while maintaining the expertise and capacity to grow the business as market conditions expand.\n \n\n\nRESULTS OF OPERATIONS\n \n\n\nA discussion regarding our financial condition and results of operations for the year ended December 31, 2024, compared to the year ended December 31, 2023, is presented below. A discussion regarding our financial condition and results of operations for the year ended December 31, 2023, compared to the year ended December 31, 2022, can be found under Item 7 of Part II of our annual report on Form 10-K for the fiscal year ended December 31, 2023, filed with the SEC on February 22, 2024.\n \n\n\n \n\n\n2024 Compared with 2023\n \n\n\nThe following table sets forth the percentage relationship to net sales of certain costs, expenses and income items for the years ended December 31:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nNet sales\n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n\n\n\n\nCost of sales\n\n\n \n\n\n \n\n\n67.2\n\n\n%\n\n\n \n\n\n \n\n\n64.8\n\n\n%\n\n\n\n\n\n\nGross margin\n\n\n \n\n\n \n\n\n32.8\n\n\n%\n\n\n \n\n\n \n\n\n35.2\n\n\n%\n\n\n\n\n\n\nSelling, general and administrative expenses\n\n\n \n\n\n \n\n\n23.1\n\n\n%\n\n\n \n\n\n \n\n\n22.4\n\n\n%\n\n\n\n\n\n\nIncome from operations\n\n\n \n\n\n \n\n\n9.7\n\n\n%\n\n\n \n\n\n \n\n\n12.8\n\n\n%\n\n\n\n\n\n\nInterest expense, net\n\n\n \n\n\n \n\n\n1.3\n\n\n%\n\n\n \n\n\n \n\n\n1.1\n\n\n%\n\n\n\n\n\n\nIncome tax expense\n\n\n \n\n\n \n\n\n1.9\n\n\n%\n\n\n \n\n\n \n\n\n2.6\n\n\n%\n\n\n\n\n\n\nNet income\n\n\n \n\n\n \n\n\n6.5\n\n\n%\n\n\n \n\n\n \n\n\n9.1\n\n\n%\n\n\n\n\n\n\n \n\n\nNet Sales. \nNet sales for the year ended December 31, 2024, were $16.4 billion, a 4.1% decrease from net sales of $17.1 billion for 2023. Net sales decreased primarily as a result of a core organic sales decrease of 5.1% due to a continued normalization in the multi-family customer segment and declines in the single-family customer segment as home size and complexity decrease, while commodity price deflation decreased net sales by another 1.8%. These decreases were partially offset by increases in net sales from acquisitions and increased selling days of 2.1% and 0.7%, respectively.\n \n\n\n30\n\n\n\n\n \n\n\nThe following table shows net sales classified by major product category for the years ended December 31:\t\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n($ amounts in millions)\n\n\nNet Sales\n\n\n \n\n\n \n\n\n% of Net Sales\n\n\n \n\n\n \n\n\nNet Sales\n\n\n \n\n\n \n\n\n% of Net Sales\n\n\n \n\n\n \n\n\n% Change\n\n\n \n\n\n\n\n\n\nManufactured products (1)\n\n\n$\n\n\n3,931.6\n\n\n \n\n\n \n\n\n \n\n\n24.0\n\n\n%\n\n\n \n\n\n$\n\n\n4,669.1\n\n\n \n\n\n \n\n\n \n\n\n27.3\n\n\n%\n\n\n \n\n\n \n\n\n(15.8\n\n\n)%\n\n\n\n\n\n\nWindows, doors and millwork (1)\n\n\n \n\n\n4,226.9\n\n\n \n\n\n \n\n\n \n\n\n25.7\n\n\n%\n\n\n \n\n\n \n\n\n4,310.1\n\n\n \n\n\n \n\n\n \n\n\n25.2\n\n\n%\n\n\n \n\n\n \n\n\n(1.9\n\n\n)%\n\n\n\n\n\n\nSpecialty building products and services\n\n\n \n\n\n4,050.1\n\n\n \n\n\n \n\n\n \n\n\n24.7\n\n\n%\n\n\n \n\n\n \n\n\n3,992.1\n\n\n \n\n\n \n\n\n \n\n\n23.4\n\n\n%\n\n\n \n\n\n \n\n\n1.5\n\n\n%\n\n\n\n\n\n\nLumber and lumber sheet goods\n\n\n \n\n\n4,191.9\n\n\n \n\n\n \n\n\n \n\n\n25.6\n\n\n%\n\n\n \n\n\n \n\n\n4,126.0\n\n\n \n\n\n \n\n\n \n\n\n24.1\n\n\n%\n\n\n \n\n\n \n\n\n1.6\n\n\n%\n\n\n\n\n\n\nTotal net sales\n\n\n$\n\n\n16,400.5\n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n \n\n\n$\n\n\n17,097.3\n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n \n\n\n \n\n\n(4.1\n\n\n)%\n\n\n\n\n\n\n \n\n\n (1)\tManufactured products and windows, doors and millwork are collectively referred to as total value-added products.\n\n\n We experienced decreased net sales in our manufactured products categories primarily due to a continued normalization in multi-family and commodity deflation. Our windows, doors, and millwork sales declined primarily due to price normalization. For the comparable period, specialty building products and services and lumber and lumber sheet goods sales remained relatively consistent.\n \n\n\nGross Margin. \nGross margin decreased $0.6 billion to $5.4 billion due to decreased sales. Our gross margin percentage decreased to 32.8% in 2024 from 35.2% in 2023, a 2.4% decrease.\n \nThis decrease was attributable to single-family and multi-family margin normalization.\n\n\nSelling, General and Administrative Expenses. \nSelling, general and administrative expenses decreased $48.2 million, or 1.3%. This decrease in expenses was primarily due to decreased variable compensation costs related to decreased sales and profitability, and reduced intangible amortization expense, partially offset by additional operating expenses from locations acquired within the last twelve months and asset write-offs.\n \n\n\nAs a percentage of net sales, selling, general and administrative expenses increased to 23.1% from 22.4% in 2023. This increase was primarily due to decreased cost leverage on lower net sales during the period.\n \n\n\nInterest Expense, Net. \nInterest expense, net was $207.7 million in 2024, an increase of $15.6 million from 2023. Interest expense increased primarily due to higher debt balances and average interest rates in 2024 compared to 2023, partially offset by interest income received in 2024.\n\n\nIncome Tax Expense. \nWe recorded income tax expense of $309.6 million during the year ended December 31, 2024, compared to income tax expense of $443.6 million during the year ended December 31, 2023, a decrease of $134.0 million, driven by a decrease in income before income taxes in the current period. Our effective tax rate was 22.3% in 2024 which was relatively flat compared to the 22.4% in 2023.\n \n\n\nLIQUIDITY AND CAPITAL RESOURCES\n \n\n\nOur primary capital requirements are to fund working capital needs and operating expenses, meet required interest and principal payments, and to fund capital expenditures and potential future growth opportunities. Our capital resources at December 31, 2024, consist of cash on hand and borrowing availability under our Revolving Facility.\n \n\n\nOur Revolving Facility will be primarily used for working capital, general corporate purposes, and funding capital expenditures and growth opportunities. In addition, we may use the Revolving Facility to assist debt consolidation. Availability under the Revolving Facility is determined by a borrowing base. Our borrowing base consists of trade accounts receivable, inventory, other receivables which include progress billings and credit card receivables, and qualified cash that all meet specific criteria contained within the credit agreement, minus agent specified reserves. Net excess borrowing availability is equal to the maximum borrowing amount minus outstanding borrowings and letters of credit.\n \n\n\n31\n\n\n\n\n \n\n\nThe following table shows our borrowing base and excess availability as of December 31, 2024, and 2023:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDecember 31,\n2024\n\n\n \n\n\n \n\n\nDecember 31,\n2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(in millions)\n\n\n \n\n\n\n\n\n\nAccounts receivable availability\n\n\n \n\n\n$\n\n\n721.9\n\n\n \n\n\n \n\n\n$\n\n\n923.8\n\n\n \n\n\n\n\n\n\nInventory availability\n\n\n \n\n\n \n\n\n891.7\n\n\n \n\n\n \n\n\n \n\n\n920.8\n\n\n \n\n\n\n\n\n\nOther receivables availability\n\n\n \n\n\n \n\n\n51.5\n\n\n \n\n\n \n\n\n \n\n\n65.1\n\n\n \n\n\n\n\n\n\nGross availability\n\n\n \n\n\n \n\n\n1,665.1\n\n\n \n\n\n \n\n\n \n\n\n1,909.7\n\n\n \n\n\n\n\n\n\nLess:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAgent reserves\n\n\n \n\n\n \n\n\n(39.3\n\n\n)\n\n\n \n\n\n \n\n\n(39.8\n\n\n)\n\n\n\n\n\n\nPlus:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCash in qualified accounts\n\n\n \n\n\n \n\n\n88.5\n\n\n \n\n\n \n\n\n \n\n\n13.3\n\n\n \n\n\n\n\n\n\nBorrowing base\n\n\n \n\n\n \n\n\n1,714.3\n\n\n \n\n\n \n\n\n \n\n\n1,883.2\n\n\n \n\n\n\n\n\n\nAggregate revolving commitments\n\n\n \n\n\n \n\n\n1,800.0\n\n\n \n\n\n \n\n\n \n\n\n1,800.0\n\n\n \n\n\n\n\n\n\nMaximum borrowing amount (lesser of borrowing base and \n    aggregate revolving commitments)\n\n\n \n\n\n \n\n\n1,714.3\n\n\n \n\n\n \n\n\n \n\n\n1,800.0\n\n\n \n\n\n\n\n\n\nLess:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nOutstanding borrowings\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(464.0\n\n\n)\n\n\n\n\n\n\nLetters of credit\n\n\n \n\n\n \n\n\n(83.3\n\n\n)\n\n\n \n\n\n \n\n\n(70.3\n\n\n)\n\n\n\n\n\n\nNet excess borrowing availability on revolving facility\n\n\n \n\n\n$\n\n\n1,631.0\n\n\n \n\n\n \n\n\n$\n\n\n1,265.7\n\n\n \n\n\n\n\n\n\n \n\n\nAs of December 31, 2024, we had no outstanding borrowings under our Revolving Facility and our net excess borrowing availability was $1.6 billion after being reduced by outstanding letters of credit of $0.1 billion. Excess availability must equal or exceed a minimum specified amount, currently $171.4 million, or we are required to meet a fixed charge coverage ratio of 1.00 to 1.00. We were not in violation of any covenants or restrictions imposed by any of our debt agreements at December 31, 2024.\n \n\n\nLiquidity\n\n\nOur liquidity at December 31, 2024, was $1.8 billion, which consists of net borrowing availability under the Revolving Facility and cash on hand.\n \n\n\nOur level of indebtedness results in significant interest expense and could have the effect of, among other things, reducing our flexibility to respond to changing business and economic conditions. From time to time, based on market conditions and other factors and subject to compliance with applicable laws and regulations, the Company may repurchase or call our notes, repay debt, or otherwise enter into transactions regarding its capital structure.\n\n\nShould the current industry conditions deteriorate or we pursue additional acquisitions, we may be required to raise additional funds through the sale of capital stock or debt in the public capital markets or in privately negotiated transactions. There can be no assurance that any of these financing options would be available on favorable terms, if at all. Alternatives to help supplement our liquidity position could include, but are not limited to, idling or permanently closing additional facilities, adjusting our headcount in response to current business conditions, attempts to renegotiate leases, managing our working capital and/or divesting of non-core businesses. There are no assurances that these steps would prove successful or materially improve our liquidity position.\n \n\n\nConsolidated Cash Flows\n \n\n\nA discussion regarding our consolidated cash flows for the year ended December 31, 2024, compared to the year ended December 31, 2023, is presented below. A discussion regarding our consolidated cash flows for the year ended December 31, 2023, compared to the year ended December 31, 2022, can be found under Item 7 of Part II of our annual report on Form 10-K filed with the SEC on February 22, 2024.\n \n\n\n2024 Compared with 2023\n\n\nCash provided by operating activities was $1.9 billion in 2024 compared to cash provided by operating activities of $2.3 billion in 2023. The decrease in cash provided by operating activities was largely the result of a decrease in net income in 2024 of $0.5 billion.\n \n\n\n32\n\n\n\n\n \n\n\nFor the year ended December 31, 2024, the Company used $42.4 million more cash to invest compared to the prior year ended December 31, 2023, primarily due to $97.8 million more spent on acquisitions, offset by $63.0 million less as a net investment in property, plant and equipment.\n \n\n\nCash used in financing activities was $1.1 billion in 2024 which consisted primarily of $1.5 billion for repurchases of common stock and $0.5 billion net payments on the Revolving Facility, offset by a net $1.0 billion received for the issuance of the 6.375% 2034 notes. Cash used in financing activities was $1.7 billion for 2023 which consisted primarily of $1.8 billion in repurchases of common stock, partially offset by $0.2 billion in net borrowings on the Revolving Facility.\n \n\n\nThese debt transactions are described in Note 8 to the consolidated financial statements included in Item 8 of this annual report on Form 10-K.\n \n\n\nCapital Expenditures\n \n\n\nCapital expenditures vary depending on prevailing business factors, including current and anticipated market conditions. Historically, capital expenditures have, for the most part, remained at relatively low levels in comparison to the operating cash flows generated during the corresponding periods. We expect our 2025 capital expenditures to be in the range of $350 million to $450 million primarily related to rolling stock, equipment and facility expansion and improvements to support our operations.\n \n\n\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\n \n\n\nCritical accounting policies are those that both are important to the accurate portrayal of a company’s financial condition and results, and require subjective or complex judgments, often as a result of the need to make estimates about the effect of matters that are inherently uncertain.\n \n\n\nIn order to prepare financial statements that conform to generally accepted accounting principles (“GAAP”), we make estimates and assumptions that affect the amounts reported in our financial statements and accompanying notes. Certain estimates are particularly sensitive due to their significance to the financial statements and the possibility that future events may be significantly different from our expectations.\n \n\n\nWe have identified the following accounting policy that requires us to make the most subjective or complex judgments in order to fairly present our consolidated financial position and results of operations.\n \n\n\nGoodwill\n\n\nGoodwill represents the excess of the amount we paid to acquire businesses over the estimated fair value of tangible assets and identifiable intangible assets acquired, less liabilities assumed. At December 31, 2024, our goodwill balance was $3.7 billion, representing 34.8% of our total assets.\n \n\n\n We test goodwill for impairment in the fourth quarter of each year or at any other time when impairment indicators exist. Examples of such indicators that could cause us to test goodwill for impairment between annual tests, include a significant change in the business climate, unexpected competition or a significant deterioration in market share. We may also consider market capitalization relative to our net assets. Housing starts are a significant sales driver for us. If there is a significant decline or an expected decline in housing starts, this could adversely affect our expectations for a reporting unit and the value of that reporting unit.\n \n\n\nThe process of evaluating goodwill for impairment involves the determination of the fair value of our reporting units. Our reporting units are aligned with our three geographical divisions which are also determined to be our operating segments. In evaluating goodwill for impairment, the Company first assesses qualitative factors to determine whether it is more likely than not that the fair value of the reporting unit is less than its carrying amount. If we conclude that it is more likely than not that the fair value of the reporting unit is not less than its carrying amount, then no further testing of the goodwill is required.\n\n\nHowever, if we determine that it is more likely than not that the fair value of the reporting unit is less than its carrying amount, we perform a quantitative goodwill impairment test. This test identifies both the existence of and the amount of goodwill impairment by comparing the fair value of a reporting unit to its carrying amount, including goodwill. If the fair value of a reporting unit exceeds its carrying amount, goodwill is not impaired. If the carrying amount of a reporting unit exceeds its fair value, an impairment loss is recognized in an amount equal to that excess, limited to the amount of goodwill allocated to that reporting unit.\n \n\n\nWe assessed our goodwill balance at December 31, 2024, using a quantitative assessment. In performing the quantitative impairment test at December 31, 2024, we developed the fair value using a discounted cash flow methodology. Inherent in such fair\n \n\n\n33\n\n\n\n\n \n\n\nvalue determinations are significant assumptions relating to future cash flows, expected future revenues, expected future profitability, the discount rate, the terminal value, and our interpretation of current economic indicators and market conditions and their impact on our strategic plans and operations. Due to the uncertainties associated with such estimates, interpretations and assumptions, actual results could differ from projected results, which could result in impairment of goodwill being recorded.\n \n\n\nSignificant information and assumptions utilized in estimating future cash flows for quantitative goodwill impairment analyses include projections of revenue growth utilizing publicly available industry information such as lumber commodity prices and housing start forecasts developed by industry forecasters, including the NAHB. Expected future profitability reflects current headcount levels and cost structure and are flexed in future years based upon historical trends at various revenue levels. Long-term growth was based on terminal value EBITDA multiples to reflect the relevant expected acquisition prices. The discount rate used is intended to reflect the weighted average cost of capital for a potential market participant and includes all risks of ownership and the associated risks of realizing the stream of projected future cash flows. Decreasing the long-term growth EBITDA multiple or increasing the discount rate would not have changed the results of our impairment testing.\n \n\n\nAt December 31, 2024, the fair values of each of our reporting units were substantially in excess of their respective carrying amounts. Factors that could negatively impact the estimated fair value of our reporting units and potentially trigger impairment include, but are not limited to, unexpected competition, lower than expected housing starts, an increase in market participant weighted average cost of capital, increases in material or labor cost, and/or significant declines in our market capitalization. Future impairment of goodwill would have the effect of decreasing our earnings or increasing our losses in such period but would not impact our current outstanding debt obligations or compliance with covenants contained in the related debt agreements. We did not have any goodwill impairments in 2024, 2023 or 2022.\n\n\nRECENTLY ISSUED ACCOUNTING STANDARDS\n \n\n\nInformation regarding recent accounting pronouncements is discussed in Note 2 to the consolidated financial statements included in Item 8 of this annual report on Form 10-K.\n\n\nI\ntem 7A.\n Quantitative and Qualitative Disclosures about Market Risk\n \n\n\nWe may experience changes in interest expense if changes in our debt occur. Changes in market interest rates could also affect our interest expense. Our 5.00% unsecured senior notes due 2030 (“5.00% 2030 notes”), 4.25% senior unsecured notes due 2032 (“4.25% 2032 notes,”), 6.375% senior unsecured notes due 2032 (“6.375% 2032 notes”), and 6.375% 2034 notes bear interest at a fixed rate, and therefore our interest expense related to these notes would not be affected by an increase in market interest rates. Borrowings under the Revolving Facility bear interest at either a base rate or secured overnight financing rate (“SOFR”), plus, in each case, an applicable margin. Therefore, we are exposed to interest rate risk under the Revolving Facility. We did not have any outstanding borrowings on the Revolving Facility as of December 31, 2024. The Revolving Facility also assesses variable commitment and outstanding letter of credit fees based on quarterly average loan utilization.\n \n\n\nWe purchase certain materials, including lumber products, which are then sold to customers as well as used as direct production inputs for our manufactured products that we deliver. Short-term changes in the cost of these materials and the related in-bound freight costs, some of which are subject to significant fluctuations, are sometimes, but not always, passed on to our customers. Delays in our ability to pass on material price increases to our customers can adversely impact our operating results.\n \n\n\n34\n\n\n\n\n \n\n\nItem 8. Financial Statemen\nts and Supplementary Data\n\n\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nReport of Independent Registered Public Accounting Firm – PCAOB ID \n238\n\n\n \n\n\n36\n\n\n\n\n\n\nConsolidated Statements of Operations for the years ended December 31, 2024, 2023 and 2022\n\n\n \n\n\n38\n\n\n\n\n\n\nConsolidated Balance Sheets at December 31, 2024, and 2023\n\n\n \n\n\n39\n\n\n\n\n\n\nConsolidated Statements of Cash Flows for the years ended December 31, 2024, 2023 and 2022\n\n\n \n\n\n40\n\n\n\n\n\n\nConsolidated Statements of Changes in Stockholders’ Equity for the years ended December 31, 2024, 2023 and 2022\n\n\n \n\n\n41\n\n\n\n\n\n\nNotes to Consolidated Financial Statements\n\n\n \n\n\n42\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n35\n\n\n\n\n \n\n\nReport of Independent Registered Public Accounting Firm\n\n\n \n\n\nTo the Board of Directors and Stockholders of Builders FirstSource, Inc.\n\n\n \n\n\nOpinions on the Financial Statements and Internal Control over Financial Reporting\n \nWe have audited the accompanying consolidated balance sheets of Builders FirstSource, Inc. and its subsidiaries (the “Company”) as of December 31, 2024 and 2023, and the related consolidated statements of operations, of changes in stockholders’ equity and of cash flows for each of the three years in the period ended December 31, 2024, including the related notes (collectively referred to as the “consolidated financial statements”). We also have audited the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\n \n \nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024 in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control - Integrated Framework (2013) issued by the COSO.\n \nBasis for Opinions\n \nThe Company's management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in Management's Report on Internal Control over Financial Reporting appearing under Item 9A. Our responsibility is to express opinions on the Company’s consolidated financial statements and on the Company's internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\n \nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\n \n \nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\n\n\n \n\n\nDefinition and Limitations of Internal Control over Financial Reporting\n\n\n \n\n\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\n\n\n \n\n\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n\n\n36\n\n\n\n\n \n\n\n \n\n\nCritical Audit Matters\n\n\n \n\n\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that (i) relates to accounts or disclosures that are material to the consolidated financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\n\n\n \n\n\nRevenue Recognition – Distribution Sales\n \n\n\n \n\n\nAs described in Note 2 to the consolidated financial statements, the Company recognized consolidated net sales of $16.4 billion for the year ended December 31, 2024, a majority of which pertains to distribution sales. Revenue is recognized as performance obligations are satisfied by transferring control of a promised good or service to a customer in an amount that reflects the consideration we expect to be entitled to in exchange for those goods or services. Distribution sales typically consist of the sale of building products the Company manufactures and the resale of purchased building products. The Company recognizes revenue related to distribution sales at a point in time upon delivery of the ordered goods to their customers. Payment terms related to distribution sales are not significant as payment is generally received shortly after the point of sale.\n \n\n\n \n\n\nThe principal consideration for our determination that performing procedures relating to revenue recognition for distribution sales is a critical audit matter is a high degree of auditor effort in performing procedures related to the Company’s distribution sales.\n \n\n\n \n\n\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to the revenue recognition process. These procedures also included, among others (i) testing, on a sample basis, revenue recognized by obtaining and inspecting source documents, such as purchase orders, invoices, proof of delivery, and cash receipts or third party confirmations and (ii) testing, on a sample basis, outstanding accounts receivable balances as of December 31, 2024 by obtaining and inspecting source documents, such as purchase orders, invoices, proof of delivery or services performed, and subsequent cash receipts.\n \n\n\n \n\n\n \n\n\n/s/ \nPricewaterhouseCoopers LLP\n\n\n \n\n\n \n\n\nDallas, Texas\n\n\nFebruary 20, 2025\n\n\n \n\n\nWe have served as the Company’s auditor since 1999\n\n\n \n\n\n \n\n\n \n\n\n37\n\n\n\n\n \n\n\nBUILDERS FIRSTSOURCE, INC. AND SUBSIDIARIES\n \n\n\nCONSOLIDATED STATEMENTS OF OPERATIONS\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYears Ended December 31,\n\n\n \n\n\n\n\n\n\n(in thousands, except per share amounts)\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nNet sales\n\n\n \n\n\n$\n\n\n16,400,492\n\n\n \n\n\n \n\n\n$\n\n\n17,097,330\n\n\n \n\n\n \n\n\n$\n\n\n22,726,418\n\n\n \n\n\n\n\n\n\nCost of sales\n\n\n \n\n\n \n\n\n11,017,448\n\n\n \n\n\n \n\n\n \n\n\n11,084,996\n\n\n \n\n\n \n\n\n \n\n\n14,982,039\n\n\n \n\n\n\n\n\n\nGross margin\n\n\n \n\n\n \n\n\n5,383,044\n\n\n \n\n\n \n\n\n \n\n\n6,012,334\n\n\n \n\n\n \n\n\n \n\n\n7,744,379\n\n\n \n\n\n\n\n\n\nSelling, general and administrative expenses\n\n\n \n\n\n \n\n\n3,787,795\n\n\n \n\n\n \n\n\n \n\n\n3,836,015\n\n\n \n\n\n \n\n\n \n\n\n3,974,173\n\n\n \n\n\n\n\n\n\nIncome from operations\n\n\n \n\n\n \n\n\n1,595,249\n\n\n \n\n\n \n\n\n \n\n\n2,176,319\n\n\n \n\n\n \n\n\n \n\n\n3,770,206\n\n\n \n\n\n\n\n\n\nInterest expense, net\n\n\n \n\n\n \n\n\n207,724\n\n\n \n\n\n \n\n\n \n\n\n192,115\n\n\n \n\n\n \n\n\n \n\n\n198,373\n\n\n \n\n\n\n\n\n\nIncome before income taxes\n\n\n \n\n\n \n\n\n1,387,525\n\n\n \n\n\n \n\n\n \n\n\n1,984,204\n\n\n \n\n\n \n\n\n \n\n\n3,571,833\n\n\n \n\n\n\n\n\n\nIncome tax expense\n\n\n \n\n\n \n\n\n309,627\n\n\n \n\n\n \n\n\n \n\n\n443,649\n\n\n \n\n\n \n\n\n \n\n\n822,464\n\n\n \n\n\n\n\n\n\nNet income\n\n\n \n\n\n$\n\n\n1,077,898\n\n\n \n\n\n \n\n\n$\n\n\n1,540,555\n\n\n \n\n\n \n\n\n$\n\n\n2,749,369\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet income per share:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nBasic\n\n\n \n\n\n$\n\n\n9.13\n\n\n \n\n\n \n\n\n$\n\n\n12.06\n\n\n \n\n\n \n\n\n$\n\n\n16.98\n\n\n \n\n\n\n\n\n\nDiluted\n\n\n \n\n\n$\n\n\n9.06\n\n\n \n\n\n \n\n\n$\n\n\n11.94\n\n\n \n\n\n \n\n\n$\n\n\n16.82\n\n\n \n\n\n\n\n\n\nWeighted average common shares:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nBasic\n\n\n \n\n\n \n\n\n118,038\n\n\n \n\n\n \n\n\n \n\n\n127,777\n\n\n \n\n\n \n\n\n \n\n\n161,960\n\n\n \n\n\n\n\n\n\nDiluted\n\n\n \n\n\n \n\n\n118,980\n\n\n \n\n\n \n\n\n \n\n\n128,998\n\n\n \n\n\n \n\n\n \n\n\n163,481\n\n\n \n\n\n\n\n\n\n \n\n\nThe accompanying notes are an integral part of these consolidated financial statements.\n \n\n\n \n\n\n \n\n\n38\n\n\n\n\n \n\n\nBUILDERS FIRSTSOURCE, INC. AND SUBSIDIARIES\n \n\n\nC\nONSOLIDATED BALANCE SHEETS\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n(in thousands)\n\n\n \n\n\nDecember 31,\n2024\n\n\n \n\n\n \n\n\nDecember 31,\n2023\n\n\n \n\n\n\n\n\n\nASSETS\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCurrent assets:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCash and cash equivalents\n\n\n \n\n\n$\n\n\n153,624\n\n\n \n\n\n \n\n\n$\n\n\n66,156\n\n\n \n\n\n\n\n\n\nAccounts receivable, less allowances of $\n41,233\n and $\n42,488\n, respectively\n\n\n \n\n\n \n\n\n1,163,147\n\n\n \n\n\n \n\n\n \n\n\n1,436,917\n\n\n \n\n\n\n\n\n\nOther receivables\n\n\n \n\n\n \n\n\n344,342\n\n\n \n\n\n \n\n\n \n\n\n290,310\n\n\n \n\n\n\n\n\n\nInventories, net\n\n\n \n\n\n \n\n\n1,212,375\n\n\n \n\n\n \n\n\n \n\n\n1,228,265\n\n\n \n\n\n\n\n\n\nContract assets\n\n\n \n\n\n \n\n\n151,095\n\n\n \n\n\n \n\n\n \n\n\n165,677\n\n\n \n\n\n\n\n\n\nOther current assets\n\n\n \n\n\n \n\n\n116,656\n\n\n \n\n\n \n\n\n \n\n\n113,403\n\n\n \n\n\n\n\n\n\nTotal current assets\n\n\n \n\n\n \n\n\n3,141,239\n\n\n \n\n\n \n\n\n \n\n\n3,300,728\n\n\n \n\n\n\n\n\n\nProperty, plant and equipment, net\n\n\n \n\n\n \n\n\n1,961,731\n\n\n \n\n\n \n\n\n \n\n\n1,803,824\n\n\n \n\n\n\n\n\n\nOperating lease right-of-use assets, net\n\n\n \n\n\n \n\n\n594,301\n\n\n \n\n\n \n\n\n \n\n\n502,184\n\n\n \n\n\n\n\n\n\nGoodwill\n\n\n \n\n\n \n\n\n3,678,504\n\n\n \n\n\n \n\n\n \n\n\n3,556,556\n\n\n \n\n\n\n\n\n\nIntangible assets, net\n\n\n \n\n\n \n\n\n1,103,634\n\n\n \n\n\n \n\n\n \n\n\n1,298,173\n\n\n \n\n\n\n\n\n\nOther assets, net\n\n\n \n\n\n \n\n\n103,677\n\n\n \n\n\n \n\n\n \n\n\n37,987\n\n\n \n\n\n\n\n\n\nTotal assets\n\n\n \n\n\n$\n\n\n10,583,086\n\n\n \n\n\n \n\n\n$\n\n\n10,499,452\n\n\n \n\n\n\n\n\n\nLIABILITIES AND STOCKHOLDERS' EQUITY\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCurrent liabilities:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAccounts payable\n\n\n \n\n\n$\n\n\n868,054\n\n\n \n\n\n \n\n\n$\n\n\n881,384\n\n\n \n\n\n\n\n\n\nAccrued liabilities\n\n\n \n\n\n \n\n\n634,045\n\n\n \n\n\n \n\n\n \n\n\n717,528\n\n\n \n\n\n\n\n\n\nContract liabilities\n\n\n \n\n\n \n\n\n168,208\n\n\n \n\n\n \n\n\n \n\n\n162,659\n\n\n \n\n\n\n\n\n\nCurrent portion of operating lease liabilities\n\n\n \n\n\n \n\n\n103,499\n\n\n \n\n\n \n\n\n \n\n\n98,217\n\n\n \n\n\n\n\n\n\nCurrent maturities of long-term debt\n\n\n \n\n\n \n\n\n3,470\n\n\n \n\n\n \n\n\n \n\n\n3,649\n\n\n \n\n\n\n\n\n\nTotal current liabilities\n\n\n \n\n\n \n\n\n1,777,276\n\n\n \n\n\n \n\n\n \n\n\n1,863,437\n\n\n \n\n\n\n\n\n\nNoncurrent portion of operating lease liabilities\n\n\n \n\n\n \n\n\n525,213\n\n\n \n\n\n \n\n\n \n\n\n434,081\n\n\n \n\n\n\n\n\n\nLong-term debt, net of current maturities, discounts and issuance costs\n\n\n \n\n\n \n\n\n3,700,643\n\n\n \n\n\n \n\n\n \n\n\n3,177,411\n\n\n \n\n\n\n\n\n\nDeferred income taxes\n\n\n \n\n\n \n\n\n148,167\n\n\n \n\n\n \n\n\n \n\n\n167,199\n\n\n \n\n\n\n\n\n\nOther long-term liabilities\n\n\n \n\n\n \n\n\n135,317\n\n\n \n\n\n \n\n\n \n\n\n124,973\n\n\n \n\n\n\n\n\n\nTotal liabilities\n\n\n \n\n\n \n\n\n6,286,616\n\n\n \n\n\n \n\n\n \n\n\n5,767,101\n\n\n \n\n\n\n\n\n\nCommitments\n and contingencies (Note 13)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nStockholders' equity:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPreferred stock, $\n0.01\n par value, \n10,000\n shares authorized; \nzero\n shares issued and outstanding\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nCommon stock, $\n0.01\n par value, \n300,000\n shares authorized; \n113,578\n and \n121,857\n shares issued and outstanding, respectively\n\n\n \n\n\n \n\n\n1,136\n\n\n \n\n\n \n\n\n \n\n\n1,219\n\n\n \n\n\n\n\n\n\nAdditional paid-in capital\n\n\n \n\n\n \n\n\n4,271,269\n\n\n \n\n\n \n\n\n \n\n\n4,270,948\n\n\n \n\n\n\n\n\n\nRetained earnings\n\n\n \n\n\n \n\n\n24,065\n\n\n \n\n\n \n\n\n \n\n\n460,184\n\n\n \n\n\n\n\n\n\nTotal stockholders' equity\n\n\n \n\n\n \n\n\n4,296,470\n\n\n \n\n\n \n\n\n \n\n\n4,732,351\n\n\n \n\n\n\n\n\n\nTotal liabilities and stockholders' equity\n\n\n \n\n\n$\n\n\n10,583,086\n\n\n \n\n\n \n\n\n$\n\n\n10,499,452\n\n\n \n\n\n\n\n\n\n \n\n\nThe accompanying notes are an integral part of these consolidated financial statements.\n \n\n\n \n\n\n \n\n\n39\n\n\n\n\n \n\n\nBUILDERS FIRSTSOURCE, INC. AND SUBSIDIARIES\n \n\n\nC\nONSOLIDATED STATEMENTS OF CASH FLOWS\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n(in thousands)\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nCash flows from operating activities:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet income\n\n\n \n\n\n$\n\n\n1,077,898\n\n\n \n\n\n \n\n\n$\n\n\n1,540,555\n\n\n \n\n\n \n\n\n$\n\n\n2,749,369\n\n\n \n\n\n\n\n\n\nAdjustments to reconcile net income to net cash provided by operating activities:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDepreciation and amortization\n\n\n \n\n\n \n\n\n561,929\n\n\n \n\n\n \n\n\n \n\n\n558,275\n\n\n \n\n\n \n\n\n \n\n\n497,140\n\n\n \n\n\n\n\n\n\nAmortization of debt discount, premium and issuance costs\n\n\n \n\n\n \n\n\n5,591\n\n\n \n\n\n \n\n\n \n\n\n4,685\n\n\n \n\n\n \n\n\n \n\n\n4,837\n\n\n \n\n\n\n\n\n\nLoss on extinguishment of debt\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n728\n\n\n \n\n\n \n\n\n \n\n\n27,387\n\n\n \n\n\n\n\n\n\nDeferred income taxes\n\n\n \n\n\n \n\n\n(\n19,033\n\n\n)\n\n\n \n\n\n \n\n\n(\n102,461\n\n\n)\n\n\n \n\n\n \n\n\n(\n92,461\n\n\n)\n\n\n\n\n\n\nStock-based compensation expense\n\n\n \n\n\n \n\n\n63,111\n\n\n \n\n\n \n\n\n \n\n\n48,522\n\n\n \n\n\n \n\n\n \n\n\n31,337\n\n\n \n\n\n\n\n\n\nCredit loss expense (benefit)\n\n\n \n\n\n \n\n\n10,419\n\n\n \n\n\n \n\n\n \n\n\n(\n11,488\n\n\n)\n\n\n \n\n\n \n\n\n38,921\n\n\n \n\n\n\n\n\n\nNon-cash net loss (gain) on assets\n\n\n \n\n\n \n\n\n16,972\n\n\n \n\n\n \n\n\n \n\n\n(\n7,072\n\n\n)\n\n\n \n\n\n \n\n\n(\n1,965\n\n\n)\n\n\n\n\n\n\nChanges in assets and liabilities, net of assets acquired and liabilities assumed:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nReceivables\n\n\n \n\n\n \n\n\n249,197\n\n\n \n\n\n \n\n\n \n\n\n(\n12,641\n\n\n)\n\n\n \n\n\n \n\n\n381,223\n\n\n \n\n\n\n\n\n\nInventories\n\n\n \n\n\n \n\n\n51,475\n\n\n \n\n\n \n\n\n \n\n\n231,457\n\n\n \n\n\n \n\n\n \n\n\n271,889\n\n\n \n\n\n\n\n\n\nContract assets\n\n\n \n\n\n \n\n\n15,036\n\n\n \n\n\n \n\n\n \n\n\n18,023\n\n\n \n\n\n \n\n\n \n\n\n24,051\n\n\n \n\n\n\n\n\n\nOther current assets\n\n\n \n\n\n \n\n\n(\n2,828\n\n\n)\n\n\n \n\n\n \n\n\n10,941\n\n\n \n\n\n \n\n\n \n\n\n15,173\n\n\n \n\n\n\n\n\n\nOther assets and liabilities\n\n\n \n\n\n \n\n\n(\n54,429\n\n\n)\n\n\n \n\n\n \n\n\n(\n5,311\n\n\n)\n\n\n \n\n\n \n\n\n15,189\n\n\n \n\n\n\n\n\n\nAccounts payable\n\n\n \n\n\n \n\n\n(\n28,600\n\n\n)\n\n\n \n\n\n \n\n\n75,750\n\n\n \n\n\n \n\n\n \n\n\n(\n314,004\n\n\n)\n\n\n\n\n\n\nAccrued liabilities\n\n\n \n\n\n \n\n\n(\n78,350\n\n\n)\n\n\n \n\n\n \n\n\n(\n9,704\n\n\n)\n\n\n \n\n\n \n\n\n(\n15,766\n\n\n)\n\n\n\n\n\n\nContract liabilities\n\n\n \n\n\n \n\n\n4,304\n\n\n \n\n\n \n\n\n \n\n\n(\n33,387\n\n\n)\n\n\n \n\n\n \n\n\n(\n33,089\n\n\n)\n\n\n\n\n\n\nNet cash provided by operating activities\n\n\n \n\n\n \n\n\n1,872,692\n\n\n \n\n\n \n\n\n \n\n\n2,306,872\n\n\n \n\n\n \n\n\n \n\n\n3,599,231\n\n\n \n\n\n\n\n\n\nCash flows from investing activities:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCash used for acquisitions, net of cash acquired\n\n\n \n\n\n \n\n\n(\n336,458\n\n\n)\n\n\n \n\n\n \n\n\n(\n238,673\n\n\n)\n\n\n \n\n\n \n\n\n(\n628,014\n\n\n)\n\n\n\n\n\n\nPurchases of property, plant and equipment\n\n\n \n\n\n \n\n\n(\n380,569\n\n\n)\n\n\n \n\n\n \n\n\n(\n476,335\n\n\n)\n\n\n \n\n\n \n\n\n(\n340,152\n\n\n)\n\n\n\n\n\n\nProceeds from sale of property, plant and equipment\n\n\n \n\n\n \n\n\n13,994\n\n\n \n\n\n \n\n\n \n\n\n46,715\n\n\n \n\n\n \n\n\n \n\n\n10,687\n\n\n \n\n\n\n\n\n\nCash used for equity investments\n\n\n \n\n\n \n\n\n(\n7,686\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nNet cash used in investing activities\n\n\n \n\n\n \n\n\n(\n710,719\n\n\n)\n\n\n \n\n\n \n\n\n(\n668,293\n\n\n)\n\n\n \n\n\n \n\n\n(\n957,479\n\n\n)\n\n\n\n\n\n\nCash flows from financing activities:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nBorrowings under revolving credit facility\n\n\n \n\n\n \n\n\n954,000\n\n\n \n\n\n \n\n\n \n\n\n5,128,000\n\n\n \n\n\n \n\n\n \n\n\n5,881,000\n\n\n \n\n\n\n\n\n\nRepayments under revolving credit facility\n\n\n \n\n\n \n\n\n(\n1,418,000\n\n\n)\n\n\n \n\n\n \n\n\n(\n4,928,000\n\n\n)\n\n\n \n\n\n \n\n\n(\n6,205,000\n\n\n)\n\n\n\n\n\n\nProceeds from long-term debt and other loans\n\n\n \n\n\n \n\n\n1,000,000\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n1,001,500\n\n\n \n\n\n\n\n\n\nRepayments of long-term debt and other loans\n\n\n \n\n\n \n\n\n(\n3,397\n\n\n)\n\n\n \n\n\n \n\n\n(\n4,221\n\n\n)\n\n\n \n\n\n \n\n\n(\n616,222\n\n\n)\n\n\n\n\n\n\nPayments of debt extinguishment costs\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n20,672\n\n\n)\n\n\n\n\n\n\nPayments of loan costs\n\n\n \n\n\n \n\n\n(\n12,829\n\n\n)\n\n\n \n\n\n \n\n\n(\n1,897\n\n\n)\n\n\n \n\n\n \n\n\n(\n16,797\n\n\n)\n\n\n\n\n\n\nPayment of acquisition-related deferred and contingent consideration\n\n\n \n\n\n \n\n\n(\n14,364\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nTax withholdings on and exercises of equity awards\n\n\n \n\n\n \n\n\n(\n62,784\n\n\n)\n\n\n \n\n\n \n\n\n(\n35,233\n\n\n)\n\n\n \n\n\n \n\n\n(\n34,330\n\n\n)\n\n\n\n\n\n\nRepurchase of common stock\n\n\n \n\n\n \n\n\n(\n1,517,131\n\n\n)\n\n\n \n\n\n \n\n\n(\n1,811,517\n\n\n)\n\n\n \n\n\n \n\n\n(\n2,593,389\n\n\n)\n\n\n\n\n\n\nNet cash used in financing activities\n\n\n \n\n\n \n\n\n(\n1,074,505\n\n\n)\n\n\n \n\n\n \n\n\n(\n1,652,868\n\n\n)\n\n\n \n\n\n \n\n\n(\n2,603,910\n\n\n)\n\n\n\n\n\n\nNet change in cash and cash equivalents\n\n\n \n\n\n \n\n\n87,468\n\n\n \n\n\n \n\n\n \n\n\n(\n14,289\n\n\n)\n\n\n \n\n\n \n\n\n37,842\n\n\n \n\n\n\n\n\n\nCash and cash equivalents at beginning of period\n\n\n \n\n\n \n\n\n66,156\n\n\n \n\n\n \n\n\n \n\n\n80,445\n\n\n \n\n\n \n\n\n \n\n\n42,603\n\n\n \n\n\n\n\n\n\nCash and cash equivalents at end of period\n\n\n \n\n\n$\n\n\n153,624\n\n\n \n\n\n \n\n\n$\n\n\n66,156\n\n\n \n\n\n \n\n\n$\n\n\n80,445\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSupplemental disclosures of cash flow information:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCash paid for interest\n\n\n \n\n\n$\n\n\n188,453\n\n\n \n\n\n \n\n\n$\n\n\n186,497\n\n\n \n\n\n \n\n\n$\n\n\n169,390\n\n\n \n\n\n\n\n\n\nCash paid for income taxes\n\n\n \n\n\n \n\n\n373,059\n\n\n \n\n\n \n\n\n \n\n\n578,734\n\n\n \n\n\n \n\n\n \n\n\n936,424\n\n\n \n\n\n\n\n\n\nSupplemental disclosures of non-cash activities:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAccrued purchases of property, plant and equipment\n\n\n \n\n\n$\n\n\n14,491\n\n\n \n\n\n \n\n\n$\n\n\n9,322\n\n\n \n\n\n \n\n\n$\n\n\n10,797\n\n\n \n\n\n\n\n\n\nRight-of-use assets obtained in exchange for operating lease obligations\n\n\n \n\n\n \n\n\n175,418\n\n\n \n\n\n \n\n\n \n\n\n104,512\n\n\n \n\n\n \n\n\n \n\n\n100,843\n\n\n \n\n\n\n\n\n\nAmounts accrued related to repurchases of common stock\n\n\n \n\n\n \n\n\n13,929\n\n\n \n\n\n \n\n\n \n\n\n16,988\n\n\n \n\n\n \n\n\n \n\n\n44,447\n\n\n \n\n\n\n\n\n\nAccrued consideration for acquisitions\n\n\n \n\n\n \n\n\n8,974\n\n\n \n\n\n \n\n\n \n\n\n13,797\n\n\n \n\n\n \n\n\n \n\n\n11,270\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nThe accompanying notes are an integral part of these consolidated financial statements.\n \n\n\n \n\n\n40\n\n\n\n\n \n\n\nBUILDERS FIRSTSOURCE, INC. AND SUBSIDIARIES\n \n\n\nC\nONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS’ EQUITY\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nAdditional\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nCommon Stock\n\n\n \n\n\n \n\n\nPaid-in\n\n\n \n\n\n \n\n\nRetained\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n(in thousands)\n\n\n \n\n\nShares\n\n\n \n\n\n \n\n\nAmount\n\n\n \n\n\n \n\n\nCapital\n\n\n \n\n\n \n\n\nEarnings\n\n\n \n\n\n \n\n\nTotal\n\n\n \n\n\n\n\n\n\nBalance at December 31, 2021\n\n\n \n\n\n \n\n\n179,820\n\n\n \n\n\n \n\n\n$\n\n\n1,798\n\n\n \n\n\n \n\n\n$\n\n\n4,260,670\n\n\n \n\n\n \n\n\n$\n\n\n540,013\n\n\n \n\n\n \n\n\n$\n\n\n4,802,481\n\n\n \n\n\n\n\n\n\nVesting of restricted stock units\n\n\n \n\n\n \n\n\n1,329\n\n\n \n\n\n \n\n\n \n\n\n13\n\n\n \n\n\n \n\n\n \n\n\n(\n13\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nStock-based compensation expense\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n31,337\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n31,337\n\n\n \n\n\n\n\n\n\nRepurchase of common stock (1)\n\n\n \n\n\n \n\n\n(\n41,853\n\n\n)\n\n\n \n\n\n \n\n\n(\n418\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n2,585,872\n\n\n)\n\n\n \n\n\n \n\n\n(\n2,586,290\n\n\n)\n\n\n\n\n\n\nExercise of stock options\n\n\n \n\n\n \n\n\n60\n\n\n \n\n\n \n\n\n \n\n\n1\n\n\n \n\n\n \n\n\n \n\n\n588\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n589\n\n\n \n\n\n\n\n\n\nShares withheld for restricted stock units vested\n\n\n \n\n\n \n\n\n(\n492\n\n\n)\n\n\n \n\n\n \n\n\n(\n5\n\n\n)\n\n\n \n\n\n \n\n\n(\n34,915\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n34,920\n\n\n)\n\n\n\n\n\n\nNet income\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n2,749,369\n\n\n \n\n\n \n\n\n \n\n\n2,749,369\n\n\n \n\n\n\n\n\n\nBalance at December 31, 2022\n\n\n \n\n\n \n\n\n138,864\n\n\n \n\n\n \n\n\n \n\n\n1,389\n\n\n \n\n\n \n\n\n \n\n\n4,257,667\n\n\n \n\n\n \n\n\n \n\n\n703,510\n\n\n \n\n\n \n\n\n \n\n\n4,962,566\n\n\n \n\n\n\n\n\n\nVesting of restricted stock units\n\n\n \n\n\n \n\n\n1,074\n\n\n \n\n\n \n\n\n \n\n\n11\n\n\n \n\n\n \n\n\n \n\n\n(\n11\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nStock-based compensation expense\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n48,522\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n48,522\n\n\n \n\n\n\n\n\n\nRepurchase of common stock (2)\n\n\n \n\n\n \n\n\n(\n17,753\n\n\n)\n\n\n \n\n\n \n\n\n(\n178\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n1,783,881\n\n\n)\n\n\n \n\n\n \n\n\n(\n1,784,059\n\n\n)\n\n\n\n\n\n\nExercise of stock options\n\n\n \n\n\n \n\n\n73\n\n\n \n\n\n \n\n\n \n\n\n1\n\n\n \n\n\n \n\n\n \n\n\n658\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n659\n\n\n \n\n\n\n\n\n\nShares withheld for restricted stock units vested\n\n\n \n\n\n \n\n\n(\n401\n\n\n)\n\n\n \n\n\n \n\n\n(\n4\n\n\n)\n\n\n \n\n\n \n\n\n(\n35,888\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n35,892\n\n\n)\n\n\n\n\n\n\nNet income\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n1,540,555\n\n\n \n\n\n \n\n\n \n\n\n1,540,555\n\n\n \n\n\n\n\n\n\nBalance at December 31, 2023\n\n\n \n\n\n \n\n\n121,857\n\n\n \n\n\n \n\n\n \n\n\n1,219\n\n\n \n\n\n \n\n\n \n\n\n4,270,948\n\n\n \n\n\n \n\n\n \n\n\n460,184\n\n\n \n\n\n \n\n\n \n\n\n4,732,351\n\n\n \n\n\n\n\n\n\nVesting of restricted stock units\n\n\n \n\n\n \n\n\n901\n\n\n \n\n\n \n\n\n \n\n\n9\n\n\n \n\n\n \n\n\n \n\n\n(\n9\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nStock-based compensation expense\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n63,111\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n63,111\n\n\n \n\n\n\n\n\n\nRepurchase of common stock (3)\n\n\n \n\n\n \n\n\n(\n8,868\n\n\n)\n\n\n \n\n\n \n\n\n(\n89\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n1,514,017\n\n\n)\n\n\n \n\n\n \n\n\n(\n1,514,106\n\n\n)\n\n\n\n\n\n\nExercise of stock options\n\n\n \n\n\n \n\n\n32\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n286\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n286\n\n\n \n\n\n\n\n\n\nShares withheld for restricted stock units vested\n\n\n \n\n\n \n\n\n(\n344\n\n\n)\n\n\n \n\n\n \n\n\n(\n3\n\n\n)\n\n\n \n\n\n \n\n\n(\n63,067\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(\n63,070\n\n\n)\n\n\n\n\n\n\nNet income\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n1,077,898\n\n\n \n\n\n \n\n\n \n\n\n1,077,898\n\n\n \n\n\n\n\n\n\nBalance at December 31, 2024\n\n\n \n\n\n \n\n\n113,578\n\n\n \n\n\n \n\n\n$\n\n\n1,136\n\n\n \n\n\n \n\n\n$\n\n\n4,271,269\n\n\n \n\n\n \n\n\n$\n\n\n24,065\n\n\n \n\n\n \n\n\n$\n\n\n4,296,470\n\n\n \n\n\n\n\n\n\n \n\n\n(1)\nDuring the year ended \nDecember 31, 2022, we repurchased and retired \n41.9\n million shares of our common stock at an average price of $\n61.79\n per share, for $\n2.6\n billion, inclusive of fees, pursuant to the repurchase program authorized by our board of directors in February 2022, and further expanded by our board of directors in May 2022 and November 2022. The primary purpose of the repurchase program was to offset dilution from the merger with BMC\n.\n\n\n(2)\nDuring the year ended December 31, 2023, we repurchased and retired \n17.8\n million shares of our common stock at an average price of $\n100.49\n per share, for $\n1.8\n billion, inclusive of fees and taxes, pursuant to the repurchase program authorized by our board of directors in November 2022 and further expanded by our board of directors in April 2023.\n The primary purpose of the repurchase program was to offset dilution from the merger with BMC\n.\n\n\n(3)\nDuring the year ended December 31, 2024, we repurchased and retired \n8.9\n million\n shares of our common stock at an average price of \n$\n170.74\n per share, for \n$\n1.5\n billion\n, inclusive of fees and taxes, pursuant to the repurchase programs authorized by our board of directors in February 2024 and August 2024.\n\n\n \n\n\nThe accompanying notes are an integral part of these consolidated financial statements.\n \n\n\n41\n\n\n\n\n \n\n\n \nBUILDERS FIRSTSOURCE, INC. AND SUBSIDIARIES\n \n\n\nN\nOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n \n\n\n \n\n\n1. \nDescription of the Business\n \nBuilders FirstSource, Inc., a Delaware corporation formed in \n1998\n, is a leading supplier of building materials, manufactured components and construction services to professional contractors, sub-contractors, and consumers. The company operates approximately \n590\n locations in \n43\n states across the U.S.\n \nIn this annual report, references to the “Company,” “we,” “our,” “ours” or “us” refer to Builders FirstSource, Inc. and its consolidated subsidiaries, unless otherwise stated or the context otherwise requires.\n \n\n\n2. \nSummary of Significant Accounting Policies\n \nPrinciples of Consolidation\n \nThe consolidated financial statements present the results of operations, financial position, and cash flows of Builders FirstSource, Inc. and its wholly owned subsidiaries. All intercompany transactions have been eliminated in consolidation.\nAccounting Estimates\n \nThe preparation of financial statements in conformity with Generally Accepted Accounting Principles (“GAAP”) requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosures of contingent assets and liabilities at the date of the financial statements, and the reported amounts of revenues and expenses during the reporting period. Actual results could materially differ from those estimates.\n \nEstimates are used when accounting for items such as revenue, vendor rebates, allowance for returns, discounts and credit losses, employee compensation programs, depreciation and amortization periods, income taxes, inventory values, insurance programs, goodwill, other intangible assets and long-lived assets.\n \nEquity Investments\nThe Company’s equity investments are accounted for using equity method accounting and are recorded as other assets, net in the accompanying Consolidated Balance Sheets and are not considered significant to the Company.\n \nReclassifications\nCertain prior periods’ amounts have been reclassified to conform to the current year presentation, including changing the composition of our product categories, and amounts presented as repurchases of common stock and tax withholdings on and exercises of equity awards. Prior period amounts related to product categories as disclosed in this Note 2 under Revenue Recognition have been reclassified to conform to the current year presentation.\n \nThe prior period amounts related to tax withholdings on equity awards have been reclassified \nfrom repurchases of common stock and combined with exercises of stock options to conform to the present year presentation. Reclassifications had no impact on net income, total assets and liabilities, stockholders’ equity, financing cash flows, or total cash flows as previously reported.\nSegments\nWe offer an integrated solution to our customers providing manufacturing, supply, and installation of a full range of structural and related building products. We provide a wide variety of building products and services directly to homebuilder customers. We manufacture floor trusses, roof trusses, wall panels, millwork, windows, and doors. We also provide a full range of construction services.\n \nGiven the span and depth of our geographical reach, our locations are organized into three geographical divisions (East, Central, and West), which are also our operating segments. Our operating segments are organized on a geographical basis to facilitate a disaggregated management of the Company and to respond to the local needs of the customers in the markets we serve. All of our operating segments have similar customers, products and services, and distribution methods.\n\n\n42\n\n\n\n\n \n\n\nDue to these similarities, along with the similar economic profitability achieved across all our operating segments, we aggregate our three operating segments into one reportable segment in accordance with GAAP. Centralized financial and operational oversight, including resource allocation and assessment of performance, is performed by our principal executive officer (“CEO”), whom we have determined to be our chief operating decision maker (“CODM”).\nBusiness Combinations\nWhen they meet the requirements under ASC 805, Business Combinations, merger and acquisition transactions are accounted for using the acquisition method, and accordingly the results of operations of the acquiree are included in the Company’s consolidated financial statements from the acquisition date. The consideration transferred is allocated to the identifiable assets acquired and liabilities assumed based on estimated fair values at the acquisition date, with any excess recorded as goodwill. Transaction-related costs are expensed in the period the costs are incurred. During the measurement period, which may be up to one year from the acquisition date, the Company may record adjustments to the assets acquired and liabilities assumed with the corresponding adjustment to goodwill.\nRevenue Recognition\n \nWe recognize revenue as performance obligations are satisfied by transferring control of a promised good or service to a customer in an amount that reflects the consideration we expect to be entitled to in exchange for those goods or services. We generally classify our revenues into two types: (i) distribution sales; or (ii) sales related to contracts with service elements.\nDistribution sales typically consist of the sale of building products we manufacture and the resale of purchased building products. We recognize revenue related to distribution sales at a point in time upon delivery of the ordered goods to our customers. Payment terms related to distribution sales are not significant as payment is generally received shortly after the point of sale.\n \nOur contracts with service elements primarily relate to installation and construction services. We evaluate whether multiple contracts should be combined and accounted for as a single contract and whether a single or combined contract should be accounted for as a single performance obligation or multiple performance obligations. If a contract is separated into more than one performance obligation, we allocate the transaction price to each performance obligation generally based on observable standalone selling prices of the underlying goods or services. Revenue related to contracts with service elements is generally recognized over time based on the extent of progress towards completion of the performance obligation because of continuous transfer of control to the customer. We consider costs incurred to be indicative of goods and services delivered to the customer. As such, we use a cost-based input method to recognize revenue on our contracts with service elements as it best depicts the transfer of assets to our customers. Payment terms related to sales for contracts with service elements are specific to each customer and contract. However, they are considered to be short-term in nature as payments are normally received either throughout the life of the contract or shortly after the contract is complete.\n \nContract costs include all direct material and labor, equipment costs and those indirect costs related to contract performance. Provisions for estimated losses on uncompleted contracts are recognized in the period in which such losses are determinable. Prepayments for materials or services are deferred until such materials have been delivered or services have been provided. All sales recognized are net of allowances for discounts and estimated returns, based on historical experience. The Company records sales incentives provided to customers as a reduction of revenue. We present all sales tax on a net basis in our consolidated financial statements.\n \nCosts to obtain contracts are expensed as incurred as our contracts are typically completed in one year or less, and where applicable, we generally would incur these costs whether or not we ultimately obtain the contract. We do not disclose the value of our remaining performance obligations on uncompleted contracts as our contracts generally have a duration of one year or less.\n \nThe timing of revenue recognition, invoicing and cash collection results in accounts receivable, contract assets and contract liabilities. Contract assets include unbilled amounts when the revenue recognized exceeds the amount billed to the customer, and amounts representing a right to payment from previous performance that is conditional on something other than passage of time, such as retainage. Contract liabilities consist of customer advances and deposits, and deferred revenue.\n \n\n\n43\n\n\n\n\n \n\n\nThe following table disaggregates our net sales by product category for the years ended December 31:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(in thousands)\n\n\n \n\n\n\n\n\n\nManufactured products\n\n\n \n\n\n$\n\n\n3,931,647\n\n\n \n\n\n \n\n\n$\n\n\n4,669,088\n\n\n \n\n\n \n\n\n$\n\n\n5,678,570\n\n\n \n\n\n\n\n\n\nWindows, doors and millwork\n\n\n \n\n\n \n\n\n4,226,871\n\n\n \n\n\n \n\n\n \n\n\n4,310,061\n\n\n \n\n\n \n\n\n \n\n\n4,651,250\n\n\n \n\n\n\n\n\n\nSpecialty building products and services\n\n\n \n\n\n \n\n\n4,050,027\n\n\n \n\n\n \n\n\n \n\n\n3,992,132\n\n\n \n\n\n \n\n\n \n\n\n4,311,123\n\n\n \n\n\n\n\n\n\nLumber and lumber sheet goods\n\n\n \n\n\n \n\n\n4,191,947\n\n\n \n\n\n \n\n\n \n\n\n4,126,049\n\n\n \n\n\n \n\n\n \n\n\n8,085,475\n\n\n \n\n\n\n\n\n\nTotal net sales\n\n\n \n\n\n$\n\n\n16,400,492\n\n\n \n\n\n \n\n\n$\n\n\n17,097,330\n\n\n \n\n\n \n\n\n$\n\n\n22,726,418\n\n\n \n\n\n\n\nAs our product alignment continues to be refined, we have reclassified prior periods net sales by product category to conform to the current period presentation. The impact to each of the prior periods’ net sales for each product category was less than 1% for 2023 and 2022\n.\nNet sales from installation and construction services represents less than \n10\n% of the Company’s net sales for each period presented.\n \nThrough December 31, 2024, 2023 and 2022, we recognized as revenue substantially all of the contract liabilities balance at December 31, 2023, 2022 and 2021\n, respectively.\n \nCash and Cash Equivalents and Checks Outstanding\n \nCash and cash equivalents consist of cash on hand and all highly liquid investments with an original maturity date of three months or less. Also included in cash and cash equivalents are proceeds due from credit card transactions that generally settle within two business days. We maintain cash at financial institutions in excess of federally insured limits. Further, we maintain various banking relationships with different financial institutions. Accordingly, when there is a negative net book cash balance resulting from outstanding checks that had not yet been paid by any single financial institution, they are reflected in accounts payable in the accompanying consolidated balance sheets.\nAccounts Receivable\n \nWe extend credit to qualified professional homebuilders and contractors, in many cases on a non-collateralized basis. Accounts receivable potentially expose us to concentrations of credit risk. Because our customers are dispersed among our various markets, our credit risk to any one customer or geographic economy is not significant. Other receivables consist primarily of vendor rebates receivables and income tax receivables.\nOur customer mix is a balance of large national homebuilders, regional homebuilders, local and custom homebuilders and repair and remodeling contractors as well as multi-family builders. For the year ended December 31, 2024\n, our top \n10\n customers accounted for \n15\n%\n \nof our net sales, with our largest customer accounting for \n4\n%\n \nof net sales.\n \nThe allowance for credit losses is based on management’s assessment of the amount which may become uncollectible in the future and is estimated using specific review of problem accounts, overall portfolio quality, current and forecasted economic conditions that may affect the customer’s ability to pay, and historical experience. Accounts receivable are written off when deemed uncollectible.\n \nWe also establish reserves for credit memos and customer returns. The reserve balance was \n$\n14.4\n million\n and \n$\n14.8\n million\n at December 31, 2024, and 2023, respectively. The activity in this reserve was not material for each year presented.\n \nThe following table shows the changes in our allowance for credit losses:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(in thousands)\n\n\n \n\n\n\n\n\n\nBalance at January 1,\n\n\n \n\n\n$\n\n\n27,691\n\n\n \n\n\n \n\n\n$\n\n\n50,383\n\n\n \n\n\n \n\n\n$\n\n\n21,761\n\n\n \n\n\n\n\n\n\nNet additions (reversals) to provision\n\n\n \n\n\n \n\n\n10,419\n\n\n \n\n\n \n\n\n \n\n\n(\n11,488\n\n\n)\n\n\n \n\n\n \n\n\n38,921\n\n\n \n\n\n\n\n\n\nWrite-offs, net of recoveries\n\n\n \n\n\n \n\n\n(\n11,276\n\n\n)\n\n\n \n\n\n \n\n\n(\n11,204\n\n\n)\n\n\n \n\n\n \n\n\n(\n10,299\n\n\n)\n\n\n\n\n\n\nBalance at December 31,\n\n\n \n\n\n$\n\n\n26,834\n\n\n \n\n\n \n\n\n$\n\n\n27,691\n\n\n \n\n\n \n\n\n$\n\n\n50,383\n\n\n \n\n\n\n\n \n\n\n44\n\n\n\n\n \n\n\n \nInventories\n \nInventories consist principally of materials purchased for resale, including lumber and lumber sheet goods, windows, doors and millwork, and other building products, as well as certain manufactured products and are stated at the lower of cost or net realizable value. Cost is determined using the weighted average method, the use of which approximates the first-in, first-out method. We accrue for shrink based on the actual historical shrink results of our most recent physical inventories adjusted, if necessary, for current economic conditions. These estimates are compared with actual results as physical inventory counts are taken and reconciled to the general ledger.\n \nDuring the year, we monitor our inventory levels by market and record provisions for excess inventories based on slower moving inventory. We define potential excess inventory as the amount of inventory on hand in excess of the historical usage, excluding special order items purchased in the last six months. We then apply our judgment as to forecasted demand and other factors, including liquidation value, to determine the required adjustments to net realizable value. Our inventories are generally not susceptible to technological obsolescence.\n \nOur arrangements with vendors provide for rebates of a specified amount of consideration, payable at defined intervals, generally related to a stipulated level of purchases. We account for estimated rebates as a reduction of the prices of the vendor’s inventory until the product is sold, at which time such rebates reduce cost of sales in the accompanying consolidated statements of operations. Throughout the year we estimate the amount of the rebates based upon the expected level of purchases. We continually evaluate and revise these estimates, as necessary, based on actual purchase levels.\n \nWe source products from a large number of suppliers. Materials purchased from our largest single supplier represented \n8\n%\n of our total materials purchased in 2024\n.\n \nShipping and Handling Costs\n \nHandling costs incurred in manufacturing activities are included in cost of sales. All other shipping and handling costs are included in selling, general and administrative expenses in the accompanying consolidated statements of operations and totaled\n \n$\n654.0\n million\n,\n \n$\n656.0\n million\n and\n \n$\n641.8\n million\n in 2024, 2023 and 2022\n, respectively.\n \nIncome Taxes\n \nWe account for income taxes utilizing the asset and liability method described in the \nIncome Taxes\n topic of the FASB Accounting Standards Codification (“Codification”). Deferred income taxes are recorded to reflect consequences on future years of differences between the tax basis of assets and liabilities and their financial reporting amounts at each year-end based on enacted tax laws and statutory tax rates applicable to the periods in which differences are expected to affect taxable earnings. We record a valuation allowance to reduce deferred tax assets if it is more likely than not that some portion or all of the deferred tax assets will not be realized.\n \nWarranty Expense\n \nWe have warranty obligations with respect to most manufactured products; however, the liability for the warranty obligations is not material as a result of third-party inspection and acceptance processes.\n \nDebt Issuance Costs and Debt Discount/Premium\n \nLoan costs are capitalized upon the issuance of long-term debt and amortized over the life of the related debt. Debt issuance costs associated with term debt are presented as a reduction to long-term debt. Debt issuance costs associated with revolving debt arrangements are presented as a component of other assets. Debt issuance costs incurred in connection with revolving debt arrangements are amortized using the straight-line method. Debt issuance costs, discounts and premiums incurred in connection with term debt are amortized over the life of the related debt using the effective interest method. Amortization of debt issuance costs, discounts and premiums are included in interest expense. Upon changes to our debt structure, we evaluate debt issuance costs, discounts and premiums in accordance with the \nDebt\n topic of the Codification. We adjust debt issuance costs, discounts and premiums as necessary based on the results of this evaluation, as discussed in Note 8.\n \n\n\n45\n\n\n\n\n \n\n\nProperty, Plant and Equipment\n \nProperty, plant and equipment are recorded at cost and depreciated using the straight-line method over the estimated useful lives of the assets. The estimated lives of the various classes of assets are as follows:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Buildings and improvements\n\n\n10\n to \n40 years\n\n\n\n\n\n\n Machinery and equipment\n\n\n7\n to \n10 years\n\n\n\n\n\n\n Information technology, furniture and fixtures\n\n\n3\n to \n5 years\n\n\n\n\n\n\n \nLeasehold improvements\n\n\nThe shorter of the estimated useful life or the remaining lease term\n\n\n\n\nMajor additions and improvements are capitalized, while maintenance and repairs that do not extend the useful life of the property are charged to expense as incurred. Gains or losses from dispositions of property, plant and equipment are recorded in the period incurred. We also capitalize certain costs of computer software developed or obtained for internal use, including interest, provided that those costs are not research and development, and certain other criteria are met. Internal use computer software costs are included in information technology, furniture and fixtures, and generally depreciated using the straight-line method over the estimated useful lives of the assets, generally \nthree years\n.\n \nCloud Computing Arrangements\nWe assess cloud computing arrangements to determine whether the contract meets the definition of a service contract or conveys a software license. When cloud computing arrangements meet the definition of a service contract, we capitalize expenditures for implementation, set-up, and other upfront costs incurred. Once the implementation of a cloud computing arrangement is complete and ready for its intended use, the Company amortizes the costs over the expected term of the hosting arrangement using the straight-line method to the same income statement line as the associated cloud operating expenses. As of December 31, 2024 and 2023, we had capitalized costs, net of amortization, of $9.3 million and $1.3 million included in Other current assets, respectively. As of December 31, 2024, we had capitalized costs, net of amortization, of $52.7 million included in Other assets, net. We did not have any non-current amounts recorded related to these agreements as of December 31, 2023. Amortization expense for these costs was $1.3 million and $1.4 million for the years ended December 31, 2024 and 2023, respectively, and is included in Selling, general and administrative expenses within the Consolidated Statements of Operations. We did not have any amortization expense related to these costs during the year ended December 31, 2022\n.\nLeases\n \nWe lease certain land, buildings, rolling stock and other types of equipment for use in our operations. These leases typically have initial terms ranging from \nfive\n to \n15 years\n. Many of our leases contain renewal options which are exercisable at our discretion. These renewal options generally have terms ranging from \none\n to \nfive years\n.\nUnder the \nLeases\n topic of the Codification, lessees are required to recognize the following for all leases, with the exception of short-term leases, at the commencement date: (1) a lease liability, which is a lessee’s obligation to make lease payments arising from a lease, measured on a discounted basis; and (2) a right-of-use asset, which is an asset that represents the lessee’s right to use, or control the use of, a specified asset for the lease term.\nWe determine if an arrangement is a lease at the inception of the arrangement. Lease liabilities are recognized based on the present value of lease payments over the lease term at the arrangement’s commencement date. Right-of-use assets are recognized based on the amount of the measurement of the lease liability adjusted for any\n \nlease payments made to the lessor at or before the commencement date, minus any lease incentives received and any initial direct costs incurred. Renewal options are included in the calculation of our right-of-use assets and lease liabilities when it is determined that they are reasonably certain of exercise based on an analysis of the relevant facts and circumstances. As the implicit rate of return of our lease agreements is usually not readily determinable, we generally use our incremental borrowing rate in determining the present value of lease payments. We determine our incremental borrowing rate based on information available to us at the lease commencement date. Certain of our lease arrangements contain lease and non-lease components. We have elected to account for non-lease components as a part of the related lease components for all of our leases. Leases with an initial term of 12 months or less are not recognized on our balance sheet. We recognize the expense for these leases on a straight-line basis over the lease term.\n \nWe have certain lease agreements that are subject to changes based on the Consumer Price Index or another referenced index. In the event of changes to the relevant index, lease liabilities are not remeasured and incremental costs are treated as variable lease payments and recognized in the period in which the obligation for those payments is incurred.\n \n\n\n46\n\n\n\n\n \n\n\nLong-Lived Assets\n \nWe evaluate our long-lived assets, other than goodwill, for impairment when events or changes in circumstances indicate, in our judgment, that the carrying amount of such assets may not be recoverable. The determination of whether or not impairment exists is based on our estimate of undiscounted future cash flows before interest attributable to the assets as compared to the net carrying amount of the assets. If impairment is indicated, the amount of the impairment recognized is determined by estimating the fair value of the assets based on estimated discounted future cash flows and recording a provision for loss if the carrying amount is greater than estimated fair value. The net carrying amount of assets identified to be disposed of in the future is compared to their estimated fair value, usually the quoted market price obtained from an independent third-party less the cost to sell, to determine if impairment exists. Until the assets are disposed of, an estimate of the fair value is reassessed when related events or circumstances change.\n \nInsurance\n \nWe have established insurance programs to cover certain insurable risks consisting primarily of physical loss to property, business interruptions resulting from such loss, workers’ compensation, employee healthcare, and comprehensive general and auto liability. Third-party insurance coverage is obtained for exposures above predetermined deductibles as well as for those risks required to be insured by law or contract. On a quarterly basis, we engage an external actuarial professional to independently assess and estimate the total liability outstanding. Provisions for losses are developed from these valuations which rely upon our past claims experience, which considers both the frequency and settlement of claims. The legal costs associated with these claims are included in these developed provisions. We discount our worker’s compensation, general liability, and auto liability insurance reserves based upon estimated future payment streams at our risk-free rate. Our total insurance reserve balances were \n$\n206.3\n million\n and \n$\n190.0\n million\n as of December 31, 2024, and 2023, respectively. Of these balances, \n$\n103.4\n million\n and \n$\n100.0\n million\n were recorded as other long-term liabilities as of December 31, 2024, and 2023, respectively. Included in these reserve balances as of December 31, 2024, and 2023, were \n$\n17.1\n million\n and \n$\n13.7\n million\n, respectively, of claims that exceeded stop-loss limits and are expected to be recovered under insurance policies which are also recorded as other receivables and other assets in the accompanying consolidated balance sheets.\nNet Income per Common Share\n \nNet income per common share, or earnings per share (“EPS”), is calculated in accordance with the \nEarnings per Share\n topic of the Codification, which requires the presentation of basic and diluted EPS. Basic EPS is computed using the weighted average number of common shares outstanding during the period. Diluted EPS is computed using the weighted average number of common shares outstanding during the period, plus the dilutive effect of potential common shares.\n \nThe table below presents the calculation of basic and diluted EPS for the years ended December 31:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYears Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(in thousands, except per share amounts)\n\n\n \n\n\n\n\n\n\nNumerator:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet income\n\n\n \n\n\n$\n\n\n1,077,898\n\n\n \n\n\n \n\n\n$\n\n\n1,540,555\n\n\n \n\n\n \n\n\n$\n\n\n2,749,369\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDenominator:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nWeighted average shares outstanding, basic\n\n\n \n\n\n \n\n\n118,038\n\n\n \n\n\n \n\n\n \n\n\n127,777\n\n\n \n\n\n \n\n\n \n\n\n161,960\n\n\n \n\n\n\n\n\n\nDilutive effect of options and RSUs\n\n\n \n\n\n \n\n\n942\n\n\n \n\n\n \n\n\n \n\n\n1,221\n\n\n \n\n\n \n\n\n \n\n\n1,521\n\n\n \n\n\n\n\n\n\nWeighted average shares outstanding, diluted\n\n\n \n\n\n \n\n\n118,980\n\n\n \n\n\n \n\n\n \n\n\n128,998\n\n\n \n\n\n \n\n\n \n\n\n163,481\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet income per share:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nBasic\n\n\n \n\n\n$\n\n\n9.13\n\n\n \n\n\n \n\n\n$\n\n\n12.06\n\n\n \n\n\n \n\n\n$\n\n\n16.98\n\n\n \n\n\n\n\n\n\nDiluted\n\n\n \n\n\n$\n\n\n9.06\n\n\n \n\n\n \n\n\n$\n\n\n11.94\n\n\n \n\n\n \n\n\n$\n\n\n16.82\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAntidilutive and contingent RSUs excluded from diluted EPS\n\n\n \n\n\n \n\n\n147\n\n\n \n\n\n \n\n\n \n\n\n3\n\n\n \n\n\n \n\n\n \n\n\n99\n\n\n \n\n\n\n\n \n \n\n\n47\n\n\n\n\n \n\n\nGoodwill and Other Intangible Assets\n \nIntangibles subject to amortization\n \nWe recognize an acquired intangible asset apart from goodwill whenever the intangible asset arises from contractual or other legal rights, or whenever it can be separated or divided from the acquired entity and sold, transferred, licensed, rented, or exchanged, either individually or in combination with a related contract, asset or liability. Impairment losses are recognized if the carrying amounts of an intangible asset subject to amortization is not recoverable from expected future cash flows and its carrying amount exceeds its estimated fair value.\n \nGoodwill\n \nWe recognize goodwill as the excess cost of an acquired entity over the net amount assigned to assets acquired and liabilities assumed. Goodwill is tested for impairment on an annual basis and between annual tests whenever impairment is indicated. This annual test takes place as of December 31 each year. Impairment losses are recognized whenever the carrying amount of a reporting unit exceeds its fair value.\n \nStock-based Compensation\n \nWe have four stock-based employee compensation plans, which are described more fully in Note 10. We issue new common stock shares upon exercises of stock options and vesting of restricted stock units (“RSU”). We recognize the effect of pre-vesting forfeitures in the period they actually occur.\n \nThe fair value of RSU awards which are subject to or contain market conditions is estimated on the date of grant using the Monte Carlo simulation model with the following weighted average assumptions for the years ended December 31:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nExpected volatility (company)\n\n\n \n\n\n \n\n\n43.8\n\n\n%\n\n\n \n\n\n \n\n\n46.5\n\n\n%\n\n\n \n\n\n \n\n\n53.0\n\n\n%\n\n\n\n\n\n\nExpected volatility (peer group median)\n\n\n \n\n\n \n\n\n30.5\n\n\n%\n\n\n \n\n\n \n\n\n32.1\n\n\n%\n\n\n \n\n\n \n\n\n34.6\n\n\n%\n\n\n\n\n\n\nCorrelation between the company and peer group median\n\n\n \n\n\n \n\n\n0.5\n\n\n \n\n\n \n\n\n \n\n\n0.5\n\n\n \n\n\n \n\n\n \n\n\n0.6\n\n\n \n\n\n\n\n\n\nExpected dividend yield\n\n\n \n\n\n \n\n\n0.0\n\n\n%\n\n\n \n\n\n \n\n\n0.0\n\n\n%\n\n\n \n\n\n \n\n\n0.0\n\n\n%\n\n\n\n\n\n\nRisk-free rate\n\n\n \n\n\n \n\n\n4.5\n\n\n%\n\n\n \n\n\n \n\n\n3.8\n\n\n%\n\n\n \n\n\n \n\n\n1.7\n\n\n%\n\n\n\n\n \nThe expected volatilities and correlation are based on the historical daily returns of our common stock and the common stocks of the constituents of the Company’s peer group over the most recent period equal to the measurement period. The expected dividend yield is based on our history of not paying regular dividends in the past and our current intention to not pay regular dividends in the foreseeable future. The risk-free rate is based on the U.S. Treasury yield curve in effect at the time of grant and has a term equal to the measurement period.\nFair Value\n \nThe \nFair Value Measurements and Disclosures\n topic of the Codification provides a framework for measuring the fair value of assets and liabilities and establishes a fair value hierarchy that requires an entity to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. The fair value hierarchy can be summarized as follows:\n \nLevel 1 — unadjusted quoted prices for identical assets or liabilities in active markets accessible by us\n \nLevel 2 — inputs that are observable in the marketplace other than those inputs classified as Level 1\n \nLevel 3 — inputs that are unobservable in the marketplace and significant to the valuation\n \nIf a financial instrument uses inputs that fall in different levels of the hierarchy, the instrument will be categorized based upon the lowest level of input that is significant to the fair value calculation.\n \n\n\n48\n\n\n\n\n \n\n\nAs of December 31, 2024, and 2023\n, the Company does not have any material financial instruments which are measured at fair value on a recurring basis. We have elected to report the value of our 5.00% 2030 notes, \n4.25\n% 2032 notes, \n6.375\n% 2032 notes, \n6.375\n% 2034 notes, \nand Revolving Facility at amortized cost. The fair values of the 5.00% 2030 notes, \n4.25\n% 2032 notes, \n6.375\n% 2032 notes, and \n6.375\n% 2034 notes\n at December 31, 2024, were \n$\n523.6\n million\n, \n$\n1,149.2\n million\n, \n$\n697.4\n million\n and \n$\n988.8\n million\n respectively, and were determined using Level 2 inputs based on market prices.\n \nComprehensive Income\n \nComprehensive income is defined as the change in equity (net assets) of a business enterprise during a period from transactions and other events and circumstances from non-owner sources. It consists of net income and other gains and losses affecting stockholders’ equity that, under GAAP, are excluded from net income. Comprehensive income is equal to net income for the years ended December 31, 2024, 2023 and 2022\n. \n \nRecently Issued Accounting Pronouncements\n \nIn December 2023, the FASB issued ASU 2023-09, Income Taxes (Topic 740): Improvements to Income Tax Disclosures, which is intended to enhance the transparency and decision usefulness of income tax disclosures. This amendment modifies the rules on income tax disclosures to require entities to disclose: (i) specific categories in the rate reconciliation and additional information for reconciling items that meet a quantitative threshold; (ii) the amount of income taxes paid (net of refunds received) disaggregated by federal, state, and foreign taxes, as well as individual jurisdictions in which income taxes paid is equal to or greater than five percent of total income taxes paid net of refunds; (iii) the income or loss from continuing operations before income tax expense, or benefit, disaggregated between domestic and foreign; and (iv) income tax expense or benefit from continuing operations disaggregated by federal, state and foreign. The guidance is effective for annual periods beginning after December 15, 2024, with early adoption permitted, and should be applied on a prospective basis, though retrospective application is permitted. We are currently evaluating the potential impact of adopting this new guidance on our consolidated financial statements and related disclosures.\nIn November 2024, the FASB issued Accounting Standards Update No. 2024-03, Income Statement - Reporting Comprehensive Income - Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses (“ASU 2024-03”), and in January 2025, the FASB issued Accounting Standards Update No. 2025-01, Income Statement - Reporting Comprehensive Income - Expense Disaggregation Disclosures (Subtopic 220-40): Clarifying the Effective Date (“ASU 2025-01”). ASU 2024-03 requires additional disclosure of the nature of expenses included in the income statement as well as disclosures about specific types of expenses included in the expense captions presented in the income statement. ASU 2024-03, as clarified by ASU 2025-01, is effective for annual reporting periods beginning after December 15, 2026, and interim reporting periods within annual reporting periods beginning after December 15, 2027. The requirements will be applied prospectively with the option for retrospective application and early adoption is permitted. We are currently evaluating the potential impact of adopting this new guidance on our consolidated financial statements and related disclosures.\n\n\n3. \nBusiness Combinations\nDuring 2024 we completed a number of acquisitions for a combined \n$\n345.4\n million\n purchase price, net of cash acquired, including the acquisitions of (i) Quality Door & Millwork, Inc. (“Quality Door”), (ii) Hanson Truss Components, Inc. (“Hanson Truss”), (iii) RPM Wood Products, Inc. (“RPM”), (iv) Schoeneman Bros. Company (“Schoeneman”), (v) TRSMI, LLC (“TRSMI”), (vi) Western Truss & Components (“Western Truss”), (vii) CRi SoCal (“CRi”), (viii) Wyoming Millwork Co. (“Wyoming Millwork”), (ix) Sunrise Wood Designs, LLC (“Sunrise Wood Designs”), (x) Reno Truss, Inc. (“Reno Truss”), (xi) High Mountain Door and Trim, Inc. (“High Mountain”), (xii) Douglas Lumber, Kitchens and Home Center (“Douglas Lumber”), and (xiii) Kleet Lumber (“Kleet Lumber”).\nQuality Door is a millwork distributor, serving Idaho markets in the Boise and Idaho Falls areas. Hanson Truss produces trusses, serving the areas of northern California and western Nevada. RPM provides a diverse product mix of lumber, windows, doors, millwork and trusses in northeastern Florida. Schoeneman manufacturers trusses and provides building materials and products to eastern South Dakota, and western Iowa. TRSMI manufactures and distributes trusses around the Detroit, Michigan area. Western Truss manufactures roof and floor trusses, serving central Arizona. CRi installs windows and doors in the southern California area. Wyoming Millwork serves custom and semi-custom builders with lumber and lumber sheet goods, windows, doors, millwork, trusses and other building products in Delaware. Sunrise Wood Designs is a custom cabinet manufacturer and installer to production and custom builders in North Texas. Reno Truss is a manufacturer and distributor of roof and floor trusses to single-family and multi-family markets in the Nevada area. High Mountain distributes and installs doors, windows and millwork to single-family and multi-family markets in the northern Nevada area. Douglas Lumber provides building materials to Rhode Island, Massachusetts and Connecticut, while Kleet Lumber provides lumber and building materials in the Long Island area.\n\n\n49\n\n\n\n\n \n\n\nDuring 2023\n we completed a number of acquisitions for a combined $\n252.5\n million purchase price, net of cash acquired, including the acquisitions of \n(i) Noltex Truss and its affiliates (“Noltex”), (ii) Builders Millwork and Supply, Inc. (“BMS”) (iii) J.B. Millworks, LLC (“JBM”), (iv) Church and Church, Inc. (“Church’s”), (v) Franks Cash and Carry, Inc. (“FCC”), (vi) Standale Lumber, LLC and Granville Lumber Co., LLC (“Standale”), and (vii) Encore Performance, LLC (“Encore”). These acquisitions further expanded our market footprint and provide additional operations in our value-added product categories and our multi-family customer segment.\n \nEach of these acquisitions were funded with a combination of cash on hand and borrowings under our Revolving Facility. These transactions were accounted for using the acquisition method, and accordingly the results of operations have been included in the Company’s consolidated financial statements from the acquisition date. The purchase price was allocated to the assets acquired and liabilities assumed based on estimated fair values at the acquisition date, with the excess of purchase price over the estimated fair value of the net assets acquired recorded as goodwill.\n \nPro forma financial information for the acquisitions discussed above for 2024 and 2023 are not presented as these acquisitions did not have a material impact on our results of operations, individually or in the aggregate for each respective period.\nThe following table summarizes the aggregate fair values of the assets acquired and liabilities assumed for acquisitions during the years ended \nDecember 31, 2024, and 2023:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nTotal Acquisitions\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(in thousands)\n\n\n \n\n\n\n\n\n\nCash and cash equivalents\n\n\n \n\n\n$\n\n\n9,730\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n\n\n\n\nAccounts receivable\n\n\n \n\n\n \n\n\n39,749\n\n\n \n\n\n \n\n\n \n\n\n25,751\n\n\n \n\n\n\n\n\n\nOther receivables\n\n\n \n\n\n \n\n\n127\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nInventories\n\n\n \n\n\n \n\n\n35,585\n\n\n \n\n\n \n\n\n \n\n\n36,789\n\n\n \n\n\n\n\n\n\nContract assets\n\n\n \n\n\n \n\n\n454\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nOther current assets\n\n\n \n\n\n \n\n\n426\n\n\n \n\n\n \n\n\n \n\n\n70\n\n\n \n\n\n\n\n\n\nProperty, plant and equipment\n\n\n \n\n\n \n\n\n55,385\n\n\n \n\n\n \n\n\n \n\n\n15,053\n\n\n \n\n\n\n\n\n\nOperating lease right-of-use assets\n\n\n \n\n\n \n\n\n19,183\n\n\n \n\n\n \n\n\n \n\n\n20,449\n\n\n \n\n\n\n\n\n\nFinance lease right-of-use assets\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n528\n\n\n \n\n\n\n\n\n\nIntangible assets\n\n\n \n\n\n \n\n\n110,848\n\n\n \n\n\n \n\n\n \n\n\n82,942\n\n\n \n\n\n\n\n\n\nOther assets\n\n\n \n\n\n \n\n\n134\n\n\n \n\n\n \n\n\n \n\n\n138\n\n\n \n\n\n\n\n\n\nTotal assets\n\n\n \n\n\n \n\n\n271,621\n\n\n \n\n\n \n\n\n \n\n\n181,720\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAccounts payable\n\n\n \n\n\n \n\n\n8,842\n\n\n \n\n\n \n\n\n \n\n\n3,122\n\n\n \n\n\n\n\n\n\nAccrued liabilities\n\n\n \n\n\n \n\n\n9,138\n\n\n \n\n\n \n\n\n \n\n\n1,985\n\n\n \n\n\n\n\n\n\nContract liabilities\n\n\n \n\n\n \n\n\n1,244\n\n\n \n\n\n \n\n\n \n\n\n2,868\n\n\n \n\n\n\n\n\n\nOperating lease liabilities\n\n\n \n\n\n \n\n\n19,183\n\n\n \n\n\n \n\n\n \n\n\n20,449\n\n\n \n\n\n\n\n\n\nFinance lease liabilities\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n528\n\n\n \n\n\n\n\n\n\nTotal liabilities\n\n\n \n\n\n \n\n\n38,407\n\n\n \n\n\n \n\n\n \n\n\n28,952\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nGoodwill\n\n\n \n\n\n \n\n\n121,948\n\n\n \n\n\n \n\n\n \n\n\n99,702\n\n\n \n\n\n\n\n\n\nTotal purchase consideration\n\n\n \n\n\n \n\n\n355,162\n\n\n \n\n\n \n\n\n \n\n\n252,470\n\n\n \n\n\n\n\n\n\nAccrued contingent consideration and purchase price adjustments\n\n\n \n\n\n \n\n\n(\n8,974\n\n\n)\n\n\n \n\n\n \n\n\n(\n13,797\n\n\n)\n\n\n\n\n\n\nLess: cash acquired\n\n\n \n\n\n \n\n\n(\n9,730\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nTotal cash consideration\n\n\n \n\n\n$\n\n\n336,458\n\n\n \n\n\n \n\n\n$\n\n\n238,673\n\n\n \n\n\n\n\n \n \n\n\n \n\n\n50\n\n\n\n\n \n\n\n4\n. \nProperty, Plant and Equipment\n \nProperty, plant and equipment consisted of the following at December 31:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(in thousands)\n\n\n \n\n\n\n\n\n\nLand and improvements\n\n\n \n\n\n$\n\n\n401,374\n\n\n \n\n\n \n\n\n$\n\n\n369,574\n\n\n \n\n\n\n\n\n\nBuildings and improvements\n\n\n \n\n\n \n\n\n834,773\n\n\n \n\n\n \n\n\n \n\n\n714,767\n\n\n \n\n\n\n\n\n\nMachinery and equipment\n\n\n \n\n\n \n\n\n1,530,119\n\n\n \n\n\n \n\n\n \n\n\n1,303,312\n\n\n \n\n\n\n\n\n\nInformation technology, furniture and fixtures\n\n\n \n\n\n \n\n\n256,095\n\n\n \n\n\n \n\n\n \n\n\n213,066\n\n\n \n\n\n\n\n\n\nConstruction in progress\n\n\n \n\n\n \n\n\n141,864\n\n\n \n\n\n \n\n\n \n\n\n207,826\n\n\n \n\n\n\n\n\n\nFinance lease right-of-use assets\n\n\n \n\n\n \n\n\n3,479\n\n\n \n\n\n \n\n\n \n\n\n7,268\n\n\n \n\n\n\n\n\n\nProperty, plant and equipment\n\n\n \n\n\n \n\n\n3,167,704\n\n\n \n\n\n \n\n\n \n\n\n2,815,813\n\n\n \n\n\n\n\n\n\nLess: accumulated depreciation\n\n\n \n\n\n \n\n\n1,205,973\n\n\n \n\n\n \n\n\n \n\n\n1,011,989\n\n\n \n\n\n\n\n\n\nProperty, plant and equipment, net\n\n\n \n\n\n$\n\n\n1,961,731\n\n\n \n\n\n \n\n\n$\n\n\n1,803,824\n\n\n \n\n\n\n\n \nDepreciation expense was \n$\n256.5\n million\n, \n$\n222.6\n million\n and \n$\n194.6\n million\n, of which \n$\n78.7\n million\n, \n$\n63.5\n million\n, and \n$\n48.7\n million\n was included in cost of sales, for the years ended December 31, 2024, 2023 and 2022, respectively.\n \nIncluded in property, plant and equipment are certain assets held under other finance obligations. These assets are recorded at the present value of the lease payments and include land, buildings and equipment. Amortization charges associated with assets held under other finance obligations are included in depreciation expense.\nThe following balances held under other finance obligations are included in the accompanying consolidated balance sheet as of December 31:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(in thousands)\n\n\n \n\n\n\n\n\n\nLand and improvements\n\n\n \n\n\n$\n\n\n105,833\n\n\n \n\n\n \n\n\n$\n\n\n106,163\n\n\n \n\n\n\n\n\n\nBuildings and improvements\n\n\n \n\n\n \n\n\n115,020\n\n\n \n\n\n \n\n\n \n\n\n115,970\n\n\n \n\n\n\n\n\n\nAssets held under other finance obligations\n\n\n \n\n\n \n\n\n220,853\n\n\n \n\n\n \n\n\n \n\n\n222,133\n\n\n \n\n\n\n\n\n\nLess: accumulated amortization\n\n\n \n\n\n \n\n\n34,718\n\n\n \n\n\n \n\n\n \n\n\n31,246\n\n\n \n\n\n\n\n\n\nAssets held under other finance obligations, net\n\n\n \n\n\n$\n\n\n186,135\n\n\n \n\n\n \n\n\n$\n\n\n190,887\n\n\n \n\n\n\n\n \n \n\n\n5. \nGoodwill\n \nThe following table sets forth the changes in the carrying amount of goodwill for the years ended December 31, \n2024, and 2023:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n(in thousands)\n\n\n \n\n\n\n\n\n\nBalance as of December 31, 2022 (1)\n\n\n \n\n\n$\n\n\n3,456,854\n\n\n \n\n\n\n\n\n\nAcquisitions\n\n\n \n\n\n \n\n\n99,702\n\n\n \n\n\n\n\n\n\nBalance as of December 31, 2023 (1)\n\n\n \n\n\n$\n\n\n3,556,556\n\n\n \n\n\n\n\n\n\nAcquisitions\n\n\n \n\n\n \n\n\n121,948\n\n\n \n\n\n\n\n\n\nBalance as of December 31, 2024 (1)\n\n\n \n\n\n$\n\n\n3,678,504\n\n\n \n\n\n\n\n(1)\tGoodwill is presented net of accumulated impairment losses of $\n44.6\n million.\nThe change in the carrying amount of goodwill during 2024 is attributable to acquisitions. The amount allocated to goodwill is attributable to the assembled workforces acquired, expected synergies, and expected growth from the new markets which the Company has entered. The goodwill recognized from the TRSMI business combination will not be deductible for tax purposes. The \n$\n121.2\n million\n of goodwill recognized from the other current year acquisitions is expected to be deductible and amortized ratably over a \n15\n-year period for tax purposes.\nWe closely monitor trends in economic factors and their effects on operating results to determine if an impairment trigger was present that would warrant a reassessment of the recoverability of the carrying amount of goodwill prior to the required annual impairment test in accordance with the \nIntangibles – Goodwill and Other\n topic of the Codification.\n \n\n\n51\n\n\n\n\n \n\n\nIn evaluating goodwill for impairment, the Company first assesses qualitative factors to determine whether it is more likely than not that the fair value of the reporting unit is less than its carrying value. If it is concluded that it is more likely than not that the fair value of the reporting unit is not less than its carrying value, then no further testing of the goodwill is required. However, if we determine that it is more likely than not that the fair value of the reporting unit is less than its carrying amount, we perform a quantitative goodwill impairment test. This test identifies both the existence of and the amount of goodwill impairment by comparing the fair value of a reporting unit to its carrying amount, including goodwill. If the fair value of a reporting unit exceeds its carrying amount goodwill is not impaired. If the carrying amount of a reporting unit exceeds its fair value an impairment loss is recognized in an amount equal to that excess, limited to the amount of goodwill allocated to that reporting unit.\n \nThe process of evaluating goodwill for impairment involves the determination of the fair value of our reporting units. Our reporting units are aligned with our three geographic operating segments. Inherent in such fair value determinations are certain judgments and estimates relating to future cash flows, including our interpretation of current economic indicators and market valuations and assumptions about our strategic plans with regard to our operations. Due to the uncertainties associated with such estimates, actual results could differ from such estimates resulting in further impairment of goodwill.\nIn evaluating goodwill for impairment at December 31, 2024\n, we developed the fair value using a discounted cash flow methodology. The discounted cash flow methodology establishes fair value by estimating the present value of the projected future cash flows to be generated from the reporting unit. The discount rate applied to the projected future cash flows to arrive at the present value is intended to reflect all risks of ownership and the associated risks of realizing the stream of projected future cash flows. The discounted cash flow methodology uses our projections of financial performance for a \nfive-year\n period. The significant assumptions used in the discounted cash flow methodology are the discount rate, the terminal value and the expected future revenues and profitability.\n \nWe recorded \nno\n goodwill impairment charges in \n2024, 2023 or 2022\n.\n\n\n6. \nIntangible Assets\n \nThe following table presents intangible assets as of December 31:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nGross \nCarrying Amount\n\n\n \n\n\n \n\n\nAccumulated Amortization\n\n\n \n\n\n \n\n\nGross \nCarrying Amount\n\n\n \n\n\n \n\n\nAccumulated Amortization\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(in thousands)\n\n\n \n\n\n\n\n\n\nCustomer relationships\n\n\n \n\n\n$\n\n\n2,216,578\n\n\n \n\n\n \n\n\n$\n\n\n(\n1,198,125\n\n\n)\n\n\n \n\n\n$\n\n\n2,105,730\n\n\n \n\n\n \n\n\n$\n\n\n(\n912,865\n\n\n)\n\n\n\n\n\n\nTrade names\n\n\n \n\n\n \n\n\n64,500\n\n\n \n\n\n \n\n\n \n\n\n(\n43,483\n\n\n)\n\n\n \n\n\n \n\n\n64,500\n\n\n \n\n\n \n\n\n \n\n\n(\n36,459\n\n\n)\n\n\n\n\n\n\nNon-compete agreements\n\n\n \n\n\n \n\n\n13,050\n\n\n \n\n\n \n\n\n \n\n\n(\n8,599\n\n\n)\n\n\n \n\n\n \n\n\n13,050\n\n\n \n\n\n \n\n\n \n\n\n(\n6,223\n\n\n)\n\n\n\n\n\n\nDeveloped technology\n\n\n \n\n\n \n\n\n95,600\n\n\n \n\n\n \n\n\n \n\n\n(\n35,887\n\n\n)\n\n\n \n\n\n \n\n\n95,600\n\n\n \n\n\n \n\n\n \n\n\n(\n25,160\n\n\n)\n\n\n\n\n\n\nTotal intangible assets\n\n\n \n\n\n$\n\n\n2,389,728\n\n\n \n\n\n \n\n\n$\n\n\n(\n1,286,094\n\n\n)\n\n\n \n\n\n$\n\n\n2,278,880\n\n\n \n\n\n \n\n\n$\n\n\n(\n980,707\n\n\n)\n\n\n\n\n \nDuring the years ended December 31, 2024, 2023 and 2022, we recorded amortization expense in relation to the above-listed intangible assets of \n$\n305.4\n million\n, \n$\n335.7\n million\n and \n$\n302.6\n million\n, respectively. We recorded \nno\n intangible asset impairment charges for those same years.\n \nDuring 2023 we derecognized certain customer relationships, trade names, non-compete agreements and subcontractor relationships assets as they were fully amortized, resulting in a decrease in the gross carrying amount of the intangible assets and the related accumulated amortization.\nIn connection with the current year acquisitions, we recorded customer relationships intangible assets of \n$\n110.8\n million\n. The weighted average useful life of the acquired customer relationships intangible assets is \n2.8\n years. The fair value of acquired customer relationships intangible assets was primarily estimated by applying the multiperiod excess earnings method, which involved the use of significant estimates and assumptions primarily related to forecasted revenue growth rates, gross margin, contributory asset charges, customer attrition rates, and market-participant discount rates. These measures are based on significant Level 3 inputs not observable in the market. Key assumptions developed based on the Company’s historical experience, future projections and comparable market data include future cash flows, long-term growth rates, attrition rates and discount rates.\n\n\n52\n\n\n\n\n \n\n\nThe following table presents the estimated amortization expense for intangible assets for the years ending December 31:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n(in thousands)\n\n\n \n\n\n\n\n\n\n2025\n\n\n \n\n\n$\n\n\n252,871\n\n\n \n\n\n\n\n\n\n2026\n\n\n \n\n\n \n\n\n220,642\n\n\n \n\n\n\n\n\n\n2027\n\n\n \n\n\n \n\n\n164,988\n\n\n \n\n\n\n\n\n\n2028\n\n\n \n\n\n \n\n\n124,052\n\n\n \n\n\n\n\n\n\n2029\n\n\n \n\n\n \n\n\n71,710\n\n\n \n\n\n\n\n\n\nThereafter\n\n\n \n\n\n \n\n\n269,371\n\n\n \n\n\n\n\n\n\nTotal future net intangible amortization expense\n\n\n \n\n\n$\n\n\n1,103,634\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n7. \nAccrued Liabilities\n \nAccrued liabilities consisted of the following:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDecember 31,\n2024\n\n\n \n\n\n \n\n\nDecember 31,\n2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(in thousands)\n\n\n \n\n\n\n\n\n\nAccrued payroll and other employee related expenses\n\n\n \n\n\n$\n\n\n310,073\n\n\n \n\n\n \n\n\n$\n\n\n383,157\n\n\n \n\n\n\n\n\n\nSelf-insurance reserves\n\n\n \n\n\n \n\n\n102,876\n\n\n \n\n\n \n\n\n \n\n\n89,987\n\n\n \n\n\n\n\n\n\nAccrued business and other taxes\n\n\n \n\n\n \n\n\n72,944\n\n\n \n\n\n \n\n\n \n\n\n76,098\n\n\n \n\n\n\n\n\n\nAccrued contingent consideration & purchase price adjustments\n\n\n \n\n\n \n\n\n6,974\n\n\n \n\n\n \n\n\n \n\n\n43,127\n\n\n \n\n\n\n\n\n\nAccrued rebates payable\n\n\n \n\n\n \n\n\n35,404\n\n\n \n\n\n \n\n\n \n\n\n35,921\n\n\n \n\n\n\n\n\n\nAccrued interest\n\n\n \n\n\n \n\n\n55,454\n\n\n \n\n\n \n\n\n \n\n\n34,537\n\n\n \n\n\n\n\n\n\nOther\n\n\n \n\n\n \n\n\n50,320\n\n\n \n\n\n \n\n\n \n\n\n54,701\n\n\n \n\n\n\n\n\n\nTotal accrued liabilities\n\n\n \n\n\n$\n\n\n634,045\n\n\n \n\n\n \n\n\n$\n\n\n717,528\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n8. \nLong-Term Debt\n \nLong-term debt consisted of the following:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDecember 31,\n2024\n\n\n \n\n\n \n\n\nDecember 31,\n2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(in thousands)\n\n\n \n\n\n\n\n\n\nRevolving credit facility (1)\n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n464,000\n\n\n \n\n\n\n\n\n\n4.25\n% 2032 notes\n\n\n \n\n\n \n\n\n1,300,000\n\n\n \n\n\n \n\n\n \n\n\n1,300,000\n\n\n \n\n\n\n\n\n\n6.375\n% 2034 notes\n\n\n \n\n\n \n\n\n1,000,000\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\n6.375\n% 2032 notes\n\n\n \n\n\n \n\n\n700,000\n\n\n \n\n\n \n\n\n \n\n\n700,000\n\n\n \n\n\n\n\n\n\n5.00% 2030 notes\n\n\n \n\n\n \n\n\n550,000\n\n\n \n\n\n \n\n\n \n\n\n550,000\n\n\n \n\n\n\n\n\n\nOther finance obligations\n\n\n \n\n\n \n\n\n190,312\n\n\n \n\n\n \n\n\n \n\n\n193,048\n\n\n \n\n\n\n\n\n\nFinance lease obligations\n\n\n \n\n\n \n\n\n1,078\n\n\n \n\n\n \n\n\n \n\n\n2,297\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n3,741,390\n\n\n \n\n\n \n\n\n \n\n\n3,209,345\n\n\n \n\n\n\n\n\n\nUnamortized debt discount/premium and debt issuance costs\n\n\n \n\n\n \n\n\n(\n37,277\n\n\n)\n\n\n \n\n\n \n\n\n(\n28,285\n\n\n)\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n3,704,113\n\n\n \n\n\n \n\n\n \n\n\n3,181,060\n\n\n \n\n\n\n\n\n\nLess: current maturities of long-term debt\n\n\n \n\n\n \n\n\n3,470\n\n\n \n\n\n \n\n\n \n\n\n3,649\n\n\n \n\n\n\n\n\n\nLong-term debt, net of current maturities, discounts and issuance costs\n\n\n \n\n\n$\n\n\n3,700,643\n\n\n \n\n\n \n\n\n$\n\n\n3,177,411\n\n\n \n\n\n\n\n \n(1)\tThe weighted average interest rate was \n7.1\n%\n as of December 31, 2023\n.\n \n2022 Debt Transactions\nNotes Offering Transactions\nOn January 21, 2022, the Company completed a private offering of an additional $\n300.0\n million in aggregate principal amount of \n4.25\n% 2032 notes at an issue price equal to \n100.50\n% of par value. The net proceeds from the offering were used to repay indebtedness outstanding under the Revolving facility and pay related transaction fees and expenses. The \n4.25\n% 2032 notes issued in January 2022 form part of the same series of notes as the $\n1.0\n billion of \n4.25\n% 2032 notes issued in July 2021.\nThe additional $\n1.5\n million in proceeds received in excess of par value represents a debt premium which has been recorded as an increase to long-term debt. In connection with the offering, we incurred $\n4.4\n million \nof various third-party fees and expenses which\n \n\n\n53\n\n\n\n\n \n\n\nhave \nbeen recorded as a reduction to long-term debt. The debt premium and third-party costs will be amortized over the contractual life of the \n4.25\n% 2032 notes using the effective interest method.\nOn June 15, 2022, the Company completed a private offering of $\n700.0\n million in aggregate principal amount of \n6.375\n% 2032 notes at an issue price equal to \n100\n% of par value. Subsequently, on June 16, 2022, the Company redeemed the remaining $\n612.5\n million of the \n6.75\n% senior secured notes due 2027 (“2027 notes”).\nIn connection with the issuance of the \n6.375\n% 2032 notes, we incurred $\n10.4\n million of various third-party fees and expenses. These costs have been recorded as a reduction to long-term debt and are being amortized over the contractual life of the \n6.375\n% 2032 notes using the effective interest method.\n \nThe Company concluded the redemption of the 2027 notes was a debt extinguishment and recorded a loss on debt extinguishment of $\n27.4\n million in interest expense in the second quarter of 2022. Of this loss, $\n20.7\n million was attributable to the payment of the redemption premium on the extinguished notes and $\n6.7\n million was attributable to the write-off of unamortized debt issuance costs and debt premium.\nRevolving Credit Facility Amendments\nOn February 4, 2022, we amended our revolving credit facility to increase the total commitments by an aggregate amount of $\n400.0\n million, resulting in a total $\n1.8\n billion revolving credit facility. All other material terms of the credit facility remained unchanged from those of the previous agreement. \nEffective with this amendment, the eurodollar rate loans and related interest rate benchmark were changed to term SOFR. The applicable margin ranges for term SOFR loans were amended to be from \n1.35\n% to \n1.60\n% and there are no changes to base rate loan borrowings.\n In connection with this amendment, we incurred $\n2.0\n million of new debt issuance costs which have been recorded as other assets and will be amortized straight-line through December 2026.\n \n2023 Debt Transactions\nRevolving Credit Facility Amendments\nOn January 17, 2023, the Company amended the Revolving Facility to extend the maturity of $\n1,620.0\n million, and $\n180.0\n million commitments of the total $\n1,800.0\n million commitments to \nJanuary 17, 2028\n, and \nDecember 17, 2026\n, respectively. Subsequently, on April 3, 2023, the company further amended the Revolving Facility to extend the maturity of the $\n180.0\n million commitments to \nJanuary 17, 2028\n. These amendments included additional interest pricing tiers for borrowings, which range from \n1.10\n% to \n1.60\n% in the case of loans using SOFR, and \n0.00\n% to \n0.50\n% in the case of base rate loans.\n \nIn connection with these amendments, we expensed $\n0.7\n million of unamortized debt issuance costs related to exiting lenders to interest expense, and we incurred $\n1.9\n million of new debt issuance costs which, together with the previous unamortized debt issuance costs, have been deferred and amortized over the remaining contractual life.\n2024 Debt Transactions\nOn February 29, 2024, the Company completed a \nprivate offering of $\n1.0\n billion in aggregate principal amount of the \n6.375\n% 2034 notes at an issue price equal to \n100\n% of par value. The net proceeds from the offering were used to repay indebtedness outstanding under the Revolving Facility and for general corporate purposes.\n \nIn connection with the issuance of the \n6.375\n% 2034 notes, we incurred $\n12.8\n million of various third-party fees and expenses. \nThese costs have been recorded as a reduction to long-term debt and are being amortized over the contractual life of the \n6.375\n% 2034 notes using the effective interest method.\n \nRevolving Credit Facility\nAs of December 31, 2024, the Revolving Facility provides for a \n$\n1.8\n billion\n revolving credit line to be used for working capital, general corporate purposes and funding capital expenditures and growth opportunities. In addition, we may use the Revolving Facility to facilitate debt repayment and consolidation. The available borrowing capacity, or borrowing base, is derived from a percentage of the Company’s eligible receivables and inventory, as defined by the agreement, subject to certain reserves. As of December 31, 2024\n, we had \nno\n outstanding borrowings under our Revolving Facility and our net excess borrowing availability was \n$\n1.6\n billion\n after being reduced by outstanding letters of credit of \n$\n83.3\n million\n.\n \n\n\n54\n\n\n\n\n \n\n\nAs of December 31, 2024\n, borrowings under the Revolving Facility bear interest, at our option, at either the SOFR or a base rate, plus, in each case, an applicable margin. The applicable margin ranges from \n1.10\n% to \n1.60\n% per annum in the case of term SOFR loans and \n0.00\n% to \n0.50\n% per annum in the case of base rate loans. A commitment fee, currently \n0.20\n% per annum, is charged on the unused amount of the Revolving Facility based on quarterly average loan utilization. Letters of credit under the Revolving Facility are assessed at a rate equal to \n1.25\n% or \n1.50\n%, based on the average excess availability, as well as a fronting fee at a rate of \n0.125\n% per annum. These fees are payable quarterly in arrears at the end of March, June, September, and December.\n \nAll obligations under the Revolving Facility are guaranteed jointly and severally by the Company and all other subsidiaries that guarantee our 5.00% 2030 notes, our \n4.25\n% 2032 notes, our \n6.375\n% 2032 notes and our \n6.375\n% 2034 notes (such subsidiaries, the “Debt Guarantors”). All obligations and the guarantees of those obligations are secured by substantially all of the assets of the Company and the Debt Guarantors, subject to certain exceptions and permitted liens, including, with respect to the Revolving Facility, a first-priority security interest in such assets that constitute Revolving Collateral (as defined below) and a second-priority security interest in such assets that constitute Notes Collateral (as defined below).\n \n“Revolving Collateral” includes substantially all presently owned and after-acquired accounts receivable, inventory, rights of unpaid vendors with respect to inventory, deposit accounts, commodity accounts, securities accounts and lock boxes, investment property, cash and cash equivalents, and general intangibles, books and records, supporting obligations and documents and related letters of credit, commercial tort claims or other claims related to and proceeds of each of the foregoing. “Notes Collateral” includes all collateral that is not ABL Collateral.\nThe Revolving Facility contains restrictive covenants which, among other things, limit the Company’s ability to incur additional indebtedness, incur liens, engage in mergers or other fundamental changes, sell certain assets, pay dividends, make acquisitions or investments, prepay certain indebtedness, change the nature of our business, and engage in certain transactions with affiliates. \nIn addition, the Revolving Facility also contains a financial covenant requiring the satisfaction of a minimum fixed charge ratio of \n1.00\n to 1.00 if our excess availability falls below the greater of $\n80.0\n million or \n10\n% of the maximum borrowing amount, which was \n$171.4 million as of December 31, 2024\n.\nSenior Secured Notes due 2030\nAs of December 31, 2024, we have \n$\n550.0\n million\n outstanding in aggregate principal amount of the 5.00% 2030 notes, which mature on \nMarch 1, 2030\n. Interest accrues on the 5.00% 2030 notes at a rate of \n5.00\n% per annum and is \npayable semi-annually on March 1 and September 1 of each year, commencing on September 1, 2020.\nThe terms of the 5.00% 2030 notes are governed by the indenture, dated February 11, 2020 (the “2030 Indenture”), among the Company, the guarantors named therein and Wilmington Trust, National Association, as trustee. The 5.00% 2030 notes, subject to certain exceptions, are guaranteed, jointly and severally, on a senior unsecured basis, by the Debt Guarantors. Subject to certain exceptions, future subsidiaries that guarantee the Revolving\n F\nacility, the 2032 notes or certain other indebtedness will also guarantee the 5.00% 2030 notes.\nThe 5.00% 2030 notes constitute senior unsecured obligations of the Company and the Debt Guarantors, \npari passu\n in right of payment with all of the existing and future senior indebtedness of the Company, including indebtedness under the Revolving Facility, and the 2032 notes. The 5.00% 2030 notes are also (i) effectively subordinated to all existing and future secured indebtedness of the Company and the Debt Guarantors to the extent of the value of the assets securing such indebtedness, (ii) senior to all of the future subordinated indebtedness of the Company and the Debt Guarantors, and (iii) structurally subordinated to any existing and future indebtedness and other liabilities, including preferred stock, of the Company’s subsidiaries that do not guarantee the 5.00% 2030 notes.\nAt any time prior to March 1, 2025, the Company may redeem the 5.00% 2030 notes in whole or in part at a redemption price equal to \n100\n% of the principal amount of the 5.00% 2030 notes plus the “applicable premium” set forth in the 2030 Indenture. At any time on or after March 1, 2025, the Company may redeem the 5.00% 2030 notes at the redemption prices set forth in the 2030 Indenture, plus accrued and unpaid interest, if any, to the redemption date. If the Company experiences certain change of control events, holders of the 5.00% 2030 notes may require it to repurchase all or part of their 5.00% 2030 notes at \n101\n% of the principal amount thereof, plus accrued and unpaid interest, if any, to the repurchase date.\nSenior Secured Notes due 2032\nAs described above, during 2022, the Company issued $\n300.0\n million of \n4.25\n% 2032 notes, which form part of the same series of notes as the $\n1.0\n billion of \n4.25\n% 2032 notes issued in July 2021, and $\n700.0\n million of \n6.375\n% \n2032 notes (collectively, the “2032\n \n\n\n55\n\n\n\n\n \n\n\nnotes”). \nThe \n4.25\n% 2032 notes mature on \nFebruary 1, 2032\n, with interest accruing at a rate of \n4.25\n% per annum and interest \npayable semi-annually on February 1 and August 1 of each year. The \n6.375\n% 2032 notes mature on \nJune 15, 2032\n, with interest accruing at a rate of \n6.375\n% per annum and interest \npayable semi-annually on June 15 and December 15 of each year\n.\n \nThe terms of the \n4.25\n% 2032 notes and the \n6.375\n% 2032 notes are governed by the indentures, dated as of July 23, 2021, and June 15, 2022 (collectively the “2032 Indentures”), respectively, contain consistent terms and are among the Company, the guarantors named therein and Wilmington Trust, National Association, as trustee.\n \nThe 2032 notes, subject to certain exceptions, are guaranteed, jointly and severally, on a senior unsecured basis, by the Debt Guarantors. Subject to certain exceptions, future subsidiaries that guarantee the Revolving Facility, the 5.00% 2030 notes or certain other indebtedness will also guarantee the 2032 notes.\nThe 2032 notes constitute senior unsecured obligations of the Company and Debt Guarantors,\n pari passu\n in right of payment, with all of the existing and future senior indebtedness of the Company, including indebtedness under the Revolving Facility and the 5.00% 2030 notes, effectively subordinated to all existing and future secured indebtedness of the Company and the Debt Guarantors (including indebtedness under the Revolving Facility and 2032 notes) to the extent of the value of the assets securing such indebtedness, senior to all of the future subordinated indebtedness of the Company and the Debt Guarantors and structurally subordinated to any existing and future indebtedness and other liabilities, including preferred stock, of the Company’s subsidiaries that do not guarantee the 2032 notes.\nThe Company may redeem the 2032 notes within five years from the date of issuance, in whole or in part, at a redemption price equal to \n100\n% of the principal amount of each of the 2032 notes plus the “applicable premium” set forth in the 2032 Indentures. The Company may, within three years of the date of issuance, redeem up to \n40\n% of the aggregate principal amount of each of the 2032 notes with the net cash proceeds of one or more equity offerings at a premium of the principal amount thereof, as described in the 2032 Indentures, plus accrued and unpaid interest, if any, to the redemption date. After the five-year period from original issuance, the Company may redeem each of the 2032 notes at the redemption prices set forth in the 2032 Indentures, plus accrued and unpaid interest, if any, to the redemption date. If the Company experiences certain change of control triggering events, holders of each of the 2032 notes may require it to repurchase all or part of their notes at \n101\n% of the principal amount thereof, plus accrued and unpaid interest, if any, to the repurchase date.\nSenior Secured Notes due 2034\nThe \n6.375\n% 2034 notes mature on \nMarch 1, 2034\n, with interest accruing at a rate of \n6.375\n% per annum and \ninterest payable semi-annually on March 1 and September 1 of each year\n.\n \nThe terms of the \n6.375\n% 2034 Notes are governed by the indenture, dated as of February 29, 2024 (“2034 Indenture”). The 2034 Indenture contains consistent terms and are among the Company, the guarantors named therein and Wilmington Trust, National Association, as trustee.\n \nThe \n6.375\n% 2034 notes, subject to certain exceptions, are guaranteed, jointly and severally, on a senior unsecured basis, by each of the Company’s direct and indirect wholly owned subsidiaries (the “Guarantors”) that guarantee the Revolving Facility, \nthe 5.00% 2030 notes, and the 2032 notes (collectively with the 5.00% 2030 notes, the “Existing notes”).\nThe \n6.375\n% 2034 notes constitute senior unsecured obligations of the Company and Guarantors, \npari passu\n in right of payment, with all of the existing and future senior indebtedness of the Company, including indebtedness under the Revolving Facility and the Existing notes effectively subordinated to all existing and future secured indebtedness of the Company and the Guarantors (including indebtedness under the Revolving Facility) to the extent of the value of the assets securing such indebtedness, senior to all of the future subordinated indebtedness of the Company and the Guarantors and structurally subordinated to any existing and future indebtedness and other liabilities, including preferred stock, of the Company’s subsidiaries that do not guarantee the \n6.375\n% 2034 notes.\nThe Company may redeem the \n6.375\n% 2034 notes within five years from the date of issuance, in whole or in part, at a redemption price equal to \n100\n% of the principal amount of the \n6.375\n% 2034 notes plus the “applicable premium” set forth in the 2034 Indenture. The Company may, within three years of the date of issuance, redeem up to \n40\n% of the aggregate principal amount of the \n6.375\n% 2034 notes with the net cash proceeds of one or more equity offerings at \n106.375\n% of the principal amount thereof plus accrued and unpaid interest, if any, to the redemption date. After the five-year period from original issuance, the Company may redeem the \n6.375\n% 2034 notes at the redemption prices set forth in the 2034 Indenture, plus accrued and unpaid interest, if any, to the redemption date. If the Company experiences certain change of control triggering events, holders of the \n6.375\n% 2034 notes may require it to repurchase all or part of their notes at \n101\n% of the principal amount thereof, plus accrued and unpaid interest, if any, to the repurchase date\n.\n\n\n56\n\n\n\n\n \n\n\nEach of the 2030 Indenture, the 2032 Indenture and the 2034 Indenture contains restrictive covenants that limit the ability of the Company and its restricted subsidiaries to, among other things, incur additional debt or issue preferred stock, create liens, create restrictions on the Company’s subsidiaries’ ability to make payments to the Company, pay dividends and make other distributions in respect of the Company’s and its subsidiaries’ capital stock, make certain investments or certain other restricted payments, guarantee indebtedness, designate unrestricted subsidiaries, sell certain kinds of assets, enter into certain types of transactions with affiliates, and effect mergers and consolidations.\nAs of December 31, 2024, we were not in violation of any covenants or restrictions imposed by any of our debt agreements.\nFuture maturities of long-term debt as of December 31, \n2024, were as follows:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n(in thousands)\n\n\n \n\n\n\n\n\n\n2025\n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n\n\n\n\n2026\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\n2027\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\n2028\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\n2029\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nThereafter\n\n\n \n\n\n \n\n\n3,550,000\n\n\n \n\n\n\n\n\n\nTotal long-term debt\n\n\n \n\n\n$\n\n\n3,550,000\n\n\n \n\n\n\n\n\n\n \n\n\n9. \nLeases and Other Finance Obligations\n \n \nRight-of-use assets and lease liabilities consisted of the following as of December 31:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(in thousands)\n\n\n \n\n\n\n\n\n\nAssets\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nOperating lease right-of-use assets, net\n\n\n \n\n\n$\n\n\n594,301\n\n\n \n\n\n \n\n\n$\n\n\n502,184\n\n\n \n\n\n\n\n\n\nFinance lease right-of-use assets\n, net (included in property, plant and equipment, net)\n\n\n \n\n\n \n\n\n1,318\n\n\n \n\n\n \n\n\n \n\n\n2,714\n\n\n \n\n\n\n\n\n\nTotal right-of-use assets\n\n\n \n\n\n$\n\n\n595,619\n\n\n \n\n\n \n\n\n$\n\n\n504,898\n\n\n \n\n\n\n\n\n\nLiabilities\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCurrent\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCurrent portion of operating lease liabilities\n\n\n \n\n\n$\n\n\n103,499\n\n\n \n\n\n \n\n\n$\n\n\n98,217\n\n\n \n\n\n\n\n\n\nCurrent portion of finance lease liabilities\n (included in current maturities of long-term debt)\n\n\n \n\n\n \n\n\n470\n\n\n \n\n\n \n\n\n \n\n\n1,184\n\n\n \n\n\n\n\n\n\nNoncurrent\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNoncurrent portion of operating lease liabilities\n\n\n \n\n\n \n\n\n525,213\n\n\n \n\n\n \n\n\n \n\n\n434,081\n\n\n \n\n\n\n\n\n\nNoncurrent portion of finance lease liabilities\n (included in long-term debt, net of current maturities)\n\n\n \n\n\n \n\n\n608\n\n\n \n\n\n \n\n\n \n\n\n1,113\n\n\n \n\n\n\n\n\n\nTotal lease liabilities\n\n\n \n\n\n$\n\n\n629,790\n\n\n \n\n\n \n\n\n$\n\n\n534,595\n\n\n \n\n\n\n\n \nTotal lease costs consisted of the following for the years ended December 31:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(in thousands)\n\n\n \n\n\n\n\n\n\nOperating lease costs (1)\n\n\n \n\n\n$\n\n\n143,878\n\n\n \n\n\n \n\n\n$\n\n\n144,243\n\n\n \n\n\n \n\n\n$\n\n\n144,755\n\n\n \n\n\n\n\n\n\nFinance lease costs:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAmortization of finance lease right-of-use assets\n\n\n \n\n\n \n\n\n1,120\n\n\n \n\n\n \n\n\n \n\n\n2,089\n\n\n \n\n\n \n\n\n \n\n\n1,876\n\n\n \n\n\n\n\n\n\nInterest on finance lease liabilities\n\n\n \n\n\n \n\n\n95\n\n\n \n\n\n \n\n\n \n\n\n201\n\n\n \n\n\n \n\n\n \n\n\n179\n\n\n \n\n\n\n\n\n\nVariable lease costs\n\n\n \n\n\n \n\n\n34,781\n\n\n \n\n\n \n\n\n \n\n\n34,408\n\n\n \n\n\n \n\n\n \n\n\n30,590\n\n\n \n\n\n\n\n\n\nTotal lease costs\n\n\n \n\n\n$\n\n\n179,874\n\n\n \n\n\n \n\n\n$\n\n\n180,941\n\n\n \n\n\n \n\n\n$\n\n\n177,400\n\n\n \n\n\n\n\n \n(1)\tIncludes short-term lease costs and sublease income which were not material for all periods presented.\n \n\n\n57\n\n\n\n\n \n\n\nFuture maturities of lease liabilities as of December 31, \n2024, were as follows:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nFinance \nLeases\n\n\n \n\n\n \n\n\nOperating \nLeases\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(in thousands)\n\n\n \n\n\n\n\n\n\n2025\n\n\n \n\n\n$\n\n\n512\n\n\n \n\n\n \n\n\n$\n\n\n136,195\n\n\n \n\n\n\n\n\n\n2026\n\n\n \n\n\n \n\n\n257\n\n\n \n\n\n \n\n\n \n\n\n127,053\n\n\n \n\n\n\n\n\n\n2027\n\n\n \n\n\n \n\n\n210\n\n\n \n\n\n \n\n\n \n\n\n112,578\n\n\n \n\n\n\n\n\n\n2028\n\n\n \n\n\n \n\n\n130\n\n\n \n\n\n \n\n\n \n\n\n100,534\n\n\n \n\n\n\n\n\n\n2029\n\n\n \n\n\n \n\n\n55\n\n\n \n\n\n \n\n\n \n\n\n80,167\n\n\n \n\n\n\n\n\n\nThereafter\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n218,774\n\n\n \n\n\n\n\n\n\nTotal lease payments\n\n\n \n\n\n \n\n\n1,164\n\n\n \n\n\n \n\n\n \n\n\n775,301\n\n\n \n\n\n\n\n\n\nLess: amount representing interest\n\n\n \n\n\n \n\n\n(\n86\n\n\n)\n\n\n \n\n\n \n\n\n(\n146,589\n\n\n)\n\n\n\n\n\n\nPresent value of lease liabilities\n\n\n \n\n\n \n\n\n1,078\n\n\n \n\n\n \n\n\n \n\n\n628,712\n\n\n \n\n\n\n\n\n\nLess: current portion\n\n\n \n\n\n \n\n\n(\n470\n\n\n)\n\n\n \n\n\n \n\n\n(\n103,499\n\n\n)\n\n\n\n\n\n\nLong-term lease liabilities, net of current portion\n\n\n \n\n\n$\n\n\n608\n\n\n \n\n\n \n\n\n$\n\n\n525,213\n\n\n \n\n\n\n\n \nWeighted average lease terms and discount rates as of December 31 were as follows:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nWeighted average remaining lease term (years)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nOperating leases\n\n\n \n\n\n \n\n\n7.0\n\n\n \n\n\n \n\n\n \n\n\n6.6\n\n\n \n\n\n\n\n\n\nFinance leases\n\n\n \n\n\n \n\n\n3.0\n\n\n \n\n\n \n\n\n \n\n\n2.8\n\n\n \n\n\n\n\n\n\nWeighted average discount rate\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nOperating leases\n\n\n \n\n\n \n\n\n6.0\n\n\n%\n\n\n \n\n\n \n\n\n6.0\n\n\n%\n\n\n\n\n\n\nFinance leases\n\n\n \n\n\n \n\n\n5.7\n\n\n%\n\n\n \n\n\n \n\n\n6.1\n\n\n%\n\n\n\n\n \nThe following table presents cash paid for amounts included in the measurement of lease liabilities for the years ended December 31:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(in thousands)\n\n\n \n\n\n\n\n\n\nCash paid for amounts included in the measurement of lease liabilities:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nOperating cash flows from operating leases\n\n\n \n\n\n$\n\n\n132,989\n\n\n \n\n\n \n\n\n$\n\n\n127,562\n\n\n \n\n\n \n\n\n$\n\n\n125,311\n\n\n \n\n\n\n\n\n\nOperating cash flows from finance leases\n\n\n \n\n\n \n\n\n95\n\n\n \n\n\n \n\n\n \n\n\n201\n\n\n \n\n\n \n\n\n \n\n\n179\n\n\n \n\n\n\n\n\n\nFinancing cash flows from finance leases\n\n\n \n\n\n \n\n\n1,182\n\n\n \n\n\n \n\n\n \n\n\n2,214\n\n\n \n\n\n \n\n\n \n\n\n1,844\n\n\n \n\n\n\n\n \nOur lease agreements do not impose any significant restrictions or covenants on us. As of December 31, 2024, we do not have any material leases that have been signed but have not yet commenced and are not reflected on our consolidated balance sheet. Leases with related parties are not significant as of and for the years ended December 31, 2024, 2023 and 2022.\n \nOther Finance Obligations\n \nIn addition to the operating and finance lease arrangements described above, the \nCompany is party to \n115\n individual property lease agreements with a single lessor as of December 31, 2024\n. These lease agreements had initial terms ranging from \nnine\n to \n15 years\n with renewal options in \nfive-year\n increments providing for up to approximately \n30\n-year total lease terms.\n \nA related agreement between the lessor and the Company gives the Company the right to acquire a limited number of the leased facilities at fair market value. These purchase rights represent a form of continuing involvement with these properties, which precluded sale-leaseback accounting. As a result, the Company treats all of the properties that it leases from this lessor as a financing arrangement.\nWe were deemed the owner of certain of our facilities during their construction period based on an evaluation made in accordance with the \nLeases\n topic of the Codification. Effectively, a sale and leaseback of these facilities occurred when construction was completed and the lease term began. These transactions did not qualify for sale-leaseback accounting. As a result, the Company treats the lease of these facilities as a financing arrangement.\nAs of December 31, 2024, other finance obligations consist of \n$\n190.3\n million\n, with cash payments of \n$\n20.6\n million\n for the year ended December 31, 2024. These other finance obligations are included on the consolidated balance sheets as part of long-term debt. The related assets are recorded as components of property, plant, and equipment on the consolidated balance sheets.\n \n\n\n58\n\n\n\n\n \n\n\nFuture maturities for other finance obligations as of December 31, \n2024, were as follows:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n(in thousands)\n\n\n \n\n\n\n\n\n\n2025\n\n\n \n\n\n$\n\n\n16,272\n\n\n \n\n\n\n\n\n\n2026\n\n\n \n\n\n \n\n\n15,939\n\n\n \n\n\n\n\n\n\n2027\n\n\n \n\n\n \n\n\n15,874\n\n\n \n\n\n\n\n\n\n2028\n\n\n \n\n\n \n\n\n15,887\n\n\n \n\n\n\n\n\n\n2029\n\n\n \n\n\n \n\n\n15,907\n\n\n \n\n\n\n\n\n\nThereafter\n\n\n \n\n\n \n\n\n103,127\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n183,006\n\n\n \n\n\n\n\n\n\n \n\n\n10. \nEmployee Stock-Based Compensation\n \n2014 Incentive Plan\n \nUnder our 2014 Incentive Plan (“2014 Plan”), as amended, the Company is authorized to grant awards in the form of incentive stock options, non-qualified stock options, restricted stock shares, restricted stock units, other common stock-based awards and cash-based awards. As of December 31, 2024, the Company had reserved\n \n15.1\n million shares\n of common stock for the grant of awards under the 2014 Plan, subject to adjustment as provided by the 2014 Plan. All shares under the Plan may be made subject to options, stock appreciation rights (“SARs”), or stock-based awards. Stock options and SARs granted under the 2014 Plan may not have a term exceeding \n10\n years from the date of grant. The 2014 Plan also provides that all awards will become fully vested and/or exercisable upon a change in control (as defined in the 2014 Plan) if those awards (i) are not assumed or equitably substituted by the surviving entity or (ii) have been assumed or equitably substituted by the surviving entity, and the grantee’s employment is terminated under certain circumstances. Other specific terms for awards granted under the 2014 Plan shall be determined by our Compensation Committee (or the board of directors if so determined by the board of directors). \nAwards granted under the 2014 Plan generally vest ratably over a \nthree\n to \nfour-year\n period or cliff vest after a period of \nthree\n to \nfour years\n.\n As of December 31, 2024, \n7.6\n million shares were available for issuance under the 2014 Plan. If it is assumed that shares will be issued at the target vesting amount for outstanding RSUs with variable payout provisions, an additional \n0.4\n million shares would be included in the shares available for future issuance under the 2014 Plan.\n \nPrevious Incentive Plans\n \nWe were authorized to issue shares of common stock pursuant to awards granted in various forms under our 1998 Stock Incentive Plan, 2005 Equity Incentive Plan, and 2007 Incentive Plan. \nNo\n further grants will be made under these plans and all remaining awards granted under these plans are fully vested and exercisable.\n \nStock Options\n \nThe following table summarizes our stock option activity:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nWeighted\n\n\n \n\n\n \n\n\nWeighted\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nAverage\n\n\n \n\n\n \n\n\nAverage\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nExercise\n\n\n \n\n\n \n\n\nRemaining\n\n\n \n\n\n \n\n\nAggregate\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nOptions\n\n\n \n\n\n \n\n\nPrice\n\n\n \n\n\n \n\n\nYears\n\n\n \n\n\n \n\n\nIntrinsic Value\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(in thousands)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(in thousands)\n\n\n \n\n\n\n\n\n\nOutstanding at December 31, 2023\n\n\n \n\n\n \n\n\n57\n\n\n \n\n\n \n\n\n$\n\n\n9.88\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nExercised\n\n\n \n\n\n \n\n\n(\n32\n\n\n)\n\n\n \n\n\n \n\n\n8.87\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nForfeited\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nOutstanding at December 31, 2024\n\n\n \n\n\n \n\n\n25\n\n\n \n\n\n \n\n\n \n\n\n11.17\n\n\n \n\n\n \n\n\n \n\n\n1.0\n\n\n \n\n\n \n\n\n$\n\n\n3,303\n\n\n \n\n\n\n\n\n\nExercisable at December 31, 2024\n\n\n \n\n\n$\n\n\n25\n\n\n \n\n\n \n\n\n$\n\n\n11.17\n\n\n \n\n\n \n\n\n \n\n\n1.0\n\n\n \n\n\n \n\n\n$\n\n\n3,303\n\n\n \n\n\n\n\n \nThe outstanding options at December 31, 2024\n, are options granted under the 2014 plan and are exercisable. There were \nno\n outstanding options at December 31, \n2024\n, under the 2007 Plan, the 2005 Plan, and the 1998 Plan. There were \nno\n options granted and \nno\n options vested during the years ended December 31, \n2024, 2023 or 2022. The total intrinsic value of options exercised during the years ended December 31, 2024, 2023 and 2022 were \n$\n5.4\n million, \n$\n9.0\n million and \n$\n3.6\n million, respectively.\n \nRestricted Stock Units\n \nThe total outstanding RSUs at December 31, 2024, include \n1.0\n million\n units granted under the 2014 Plan.\n\n\n59\n\n\n\n\n \n\n\nTime Based Restricted Stock Unit Grants\nThe Company grants RSUs to employees under our 2014 Incentive Plan for which vesting is based solely on continuous employment over the requisite service period. \nThe following table summarizes activity for RSUs subject solely to service conditions for the year ended December 31, \n2024: \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nWeighted\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nAverage Grant\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nShares\n\n\n \n\n\n \n\n\nDate Fair Value\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(in thousands)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNonvested at December 31, 2023\n\n\n \n\n\n \n\n\n1,118\n\n\n \n\n\n \n\n\n$\n\n\n68.35\n\n\n \n\n\n\n\n\n\nGranted\n\n\n \n\n\n \n\n\n280\n\n\n \n\n\n \n\n\n \n\n\n186.61\n\n\n \n\n\n\n\n\n\nVested\n\n\n \n\n\n \n\n\n(\n716\n\n\n)\n\n\n \n\n\n \n\n\n62.46\n\n\n \n\n\n\n\n\n\nForfeited\n\n\n \n\n\n \n\n\n(\n46\n\n\n)\n\n\n \n\n\n \n\n\n105.95\n\n\n \n\n\n\n\n\n\nNonvested at December 31, 2024\n\n\n \n\n\n \n\n\n636\n\n\n \n\n\n \n\n\n$\n\n\n124.37\n\n\n \n\n\n\n\n \nThe weighted average grant date fair value of RSUs for which vesting is subject solely to service conditions granted during the years ended December 31, 2024, 2023 and 2022 was \n$\n186.61\n, \n$\n87.05\n, and \n$\n62.46\n, respectively.\nPerformance, Market and Service Condition Based Restricted Stock Unit Grants\nThe Company grants RSUs to employees under our 2014 Incentive Plan, that generally vest based on the Company’s level of achievement of performance goals relating to return on invested capital over a \nthree-year\n period (“performance condition”) as well as continued employment during the performance period (“service condition”). The total number of shares of common stock that may be earned from the performance condition ranges from \nzero\n to \n200\n% of the RSUs granted. The number of shares earned from the performance condition may be further increased or decreased by \n10\n% based on the Company’s total shareholder return relative to a peer group during the performance period (“market condition”). \nThe following table summarizes activity for these RSUs for the year ended December 31, \n2024:  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nWeighted\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nAverage Grant\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nShares\n\n\n \n\n\n \n\n\nDate Fair Value\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(in thousands)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNonvested at December 31, 2023\n\n\n \n\n\n \n\n\n406\n\n\n \n\n\n \n\n\n$\n\n\n72.22\n\n\n \n\n\n\n\n\n\nGranted\n\n\n \n\n\n \n\n\n86\n\n\n \n\n\n \n\n\n \n\n\n201.97\n\n\n \n\n\n\n\n\n\nPerformance & market achievement adjustment (1)\n\n\n \n\n\n \n\n\n73\n\n\n \n\n\n \n\n\n \n\n\n47.85\n\n\n \n\n\n\n\n\n\nVested\n\n\n \n\n\n \n\n\n(\n185\n\n\n)\n\n\n \n\n\n \n\n\n47.85\n\n\n \n\n\n\n\n\n\nForfeited\n\n\n \n\n\n \n\n\n(\n22\n\n\n)\n\n\n \n\n\n \n\n\n105.81\n\n\n \n\n\n\n\n\n\nNonvested at December 31, 2024\n\n\n \n\n\n \n\n\n358\n\n\n \n\n\n \n\n\n$\n\n\n108.87\n\n\n \n\n\n\n\n \n(1)\tRepresents RSUs granted prior to 2024 for which the performance and market achievement period was completed in 2024, resulting in incremental unit awards granted. These incremental awards are also included in the amount vested in 2024\n.\n \nThe weighted average grant date fair value of RSUs for which vesting is subject to performance, market and service conditions granted during the years ended December 31, 2024, 2023 and 2022 was \n$\n201.97\n, \n$\n88.48\n and \n$\n70.77\n, respectively.\n \nOur results of operations include stock compensation expense of \n$\n63.1\n million, \n$\n48.5\n million\n and \n$\n31.3\n million\n for the years ended December 31, 2024, 2023 and 2022, respectively. We recognized excess tax benefits for stock options exercised and RSUs vested of \n$\n27.6\n million, \n$\n16.3\n million and \n$\n16.2\n million for the years ended December 31, 2024, 2023 and 2022, respectively. The total fair value of RSUs vested during the years ended December 31, 2024, 2023 and 2022\n was \n$\n53.6\n million, \n$\n37.6\n million and \n$\n29.0\n million, respectively.\n \nAs of December 31, 2024, there was \n$\n64.6\n million of total unrecognized compensation cost related to non-vested share-based compensation arrangements granted under the Plans. That cost is expected to be recognized over a weighted-average period of \n1.9\n years.\n \n\n\n60\n\n\n\n\n \n\n\n11. \nIncome Taxes\n \nThe components of income tax expense were as follows for the years ended December 31:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(in thousands)\n\n\n \n\n\n\n\n\n\nCurrent:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nFederal\n\n\n \n\n\n$\n\n\n287,131\n\n\n \n\n\n \n\n\n$\n\n\n468,635\n\n\n \n\n\n \n\n\n$\n\n\n789,465\n\n\n \n\n\n\n\n\n\nState\n\n\n \n\n\n \n\n\n41,528\n\n\n \n\n\n \n\n\n \n\n\n77,475\n\n\n \n\n\n \n\n\n \n\n\n125,460\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n328,659\n\n\n \n\n\n \n\n\n \n\n\n546,110\n\n\n \n\n\n \n\n\n \n\n\n914,925\n\n\n \n\n\n\n\n\n\nDeferred:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nFederal\n\n\n \n\n\n \n\n\n(16,453\n\n\n)\n\n\n \n\n\n \n\n\n(\n82,150\n\n\n)\n\n\n \n\n\n \n\n\n(\n73,016\n\n\n)\n\n\n\n\n\n\nState\n\n\n \n\n\n \n\n\n(2,579\n\n\n)\n\n\n \n\n\n \n\n\n(\n20,311\n\n\n)\n\n\n \n\n\n \n\n\n(\n19,445\n\n\n)\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n(19,032\n\n\n)\n\n\n \n\n\n \n\n\n(\n102,461\n\n\n)\n\n\n \n\n\n \n\n\n(\n92,461\n\n\n)\n\n\n\n\n\n\nIncome tax expense\n\n\n \n\n\n$\n\n\n309,627\n\n\n \n\n\n \n\n\n$\n\n\n443,649\n\n\n \n\n\n \n\n\n$\n\n\n822,464\n\n\n \n\n\n\n\n \nTemporary differences, which give rise to deferred tax assets and liabilities, were as follows as of December 31:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(in thousands)\n\n\n \n\n\n\n\n\n\nDeferred tax assets related to:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nOperating lease liabilities\n\n\n \n\n\n$\n\n\n148,376\n\n\n \n\n\n \n\n\n$\n\n\n125,622\n\n\n \n\n\n\n\n\n\nInsurance reserves\n\n\n \n\n\n \n\n\n37,840\n\n\n \n\n\n \n\n\n \n\n\n34,556\n\n\n \n\n\n\n\n\n\nAccrued expenses\n\n\n \n\n\n \n\n\n17,703\n\n\n \n\n\n \n\n\n \n\n\n36,719\n\n\n \n\n\n\n\n\n\nOperating loss and credit carryforwards\n\n\n \n\n\n \n\n\n12,308\n\n\n \n\n\n \n\n\n \n\n\n13,408\n\n\n \n\n\n\n\n\n\nStock-based compensation expense\n\n\n \n\n\n \n\n\n10,931\n\n\n \n\n\n \n\n\n \n\n\n8,643\n\n\n \n\n\n\n\n\n\nInventories\n\n\n \n\n\n \n\n\n10,435\n\n\n \n\n\n \n\n\n \n\n\n13,132\n\n\n \n\n\n\n\n\n\nAccounts receivable\n\n\n \n\n\n \n\n\n10,006\n\n\n \n\n\n \n\n\n \n\n\n10,338\n\n\n \n\n\n\n\n\n\nOther\n\n\n \n\n\n \n\n\n312\n\n\n \n\n\n \n\n\n \n\n\n7,813\n\n\n \n\n\n\n\n\n\nTotal deferred tax assets\n\n\n \n\n\n \n\n\n247,911\n\n\n \n\n\n \n\n\n \n\n\n250,231\n\n\n \n\n\n\n\n\n\nDeferred tax liabilities related to:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nProperty, plant and equipment\n\n\n \n\n\n \n\n\n(179,862\n\n\n)\n\n\n \n\n\n \n\n\n(\n166,799\n\n\n)\n\n\n\n\n\n\nOperating lease right-of-use assets\n\n\n \n\n\n \n\n\n(140,255\n\n\n)\n\n\n \n\n\n \n\n\n(\n118,515\n\n\n)\n\n\n\n\n\n\nGoodwill and other intangible assets\n\n\n \n\n\n \n\n\n(66,263\n\n\n)\n\n\n \n\n\n \n\n\n(\n121,052\n\n\n)\n\n\n\n\n\n\nPrepaid expenses\n\n\n \n\n\n \n\n\n(9,698\n\n\n)\n\n\n \n\n\n \n\n\n(\n11,064\n\n\n)\n\n\n\n\n\n\nTotal deferred tax liabilities\n\n\n \n\n\n \n\n\n(396,078\n\n\n)\n\n\n \n\n\n \n\n\n(\n417,430\n\n\n)\n\n\n\n\n\n\nNet deferred tax liability\n\n\n \n\n\n$\n\n\n(148,167\n\n\n)\n\n\n \n\n\n$\n\n\n(\n167,199\n\n\n)\n\n\n\n\n \nA reconciliation of the statutory federal income tax rate to our effective rate is provided below for the years ended December 31:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n \n\n\n\n\n\n\nStatutory federal income tax rate\n\n\n \n\n\n \n\n\n21.0\n\n\n%\n\n\n \n\n\n \n\n\n21.0\n\n\n%\n\n\n \n\n\n \n\n\n21.0\n\n\n%\n\n\n \n\n\n\n\n\n\nState income taxes, net of federal income tax\n\n\n \n\n\n \n\n\n2.4\n\n\n \n\n\n \n\n\n \n\n\n2.3\n\n\n \n\n\n \n\n\n \n\n\n2.3\n\n\n \n\n\n \n\n\n\n\n\n\nStock-based compensation windfall benefit\n\n\n \n\n\n \n\n\n(\n2.0\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.8\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.5\n\n\n)\n\n\n \n\n\n\n\n\n\nPermanent difference - 162(m) limitation\n\n\n \n\n\n \n\n\n0.8\n\n\n \n\n\n \n\n\n \n\n\n0.5\n\n\n \n\n\n \n\n\n \n\n\n0.3\n\n\n \n\n\n \n\n\n\n\n\n\nPermanent difference - credits\n\n\n \n\n\n \n\n\n(\n0.5\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.6\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.2\n\n\n)\n\n\n \n\n\n\n\n\n\nPermanent difference - other\n\n\n \n\n\n \n\n\n0.2\n\n\n \n\n\n \n\n\n \n\n\n0.2\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n\n\n\n\nOther\n\n\n \n\n\n \n\n\n0.4\n\n\n \n\n\n \n\n\n \n\n\n(\n0.2\n\n\n)\n\n\n \n\n\n \n\n\n0.1\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n22.3\n\n\n%\n\n\n \n\n\n \n\n\n22.4\n\n\n%\n\n\n \n\n\n \n\n\n23.0\n\n\n%\n\n\n \n\n\n\n\n \n \nWe have $\n34.5\n million of state net operating loss carryforwards and $\n0.7\n million of state tax credit carryforwards expiring at various dates through \n2036\n. We also have $48.6 million of federal net operating loss carryforwards expiring at various dates through \n2034\n. \nWe evaluate our deferred tax assets on a quarterly basis to determine whether a valuation allowance is required. In accordance with the \nIncome Taxes\n topic of the Codification we assess whether it is more likely than not that some or all of our deferred tax assets will not be realized. Significant judgment is required in estimating valuation allowances for deferred tax assets and in making this determination, we consider all available positive and negative evidence and make certain assumptions. The realization of a deferred tax asset ultimately depends on the existence of sufficient taxable income in the applicable carryforward period. Changes in our\n \n\n\n61\n\n\n\n\n \n\n\nestimates of future taxable income and tax planning strategies will affect our estimate of the realization of the tax benefits of these tax carryforwards. As of December 31, 2024, or 2023\n, we carried \nno\n valuation allowances against our net deferred tax assets.\nWe base our estimate of deferred tax assets and liabilities on current tax laws and rates. In certain cases, we also base our estimate on business plan forecasts and other expectations about future outcomes. Changes in existing tax laws or rates could affect our actual tax results, and future business results may affect the amount of our deferred tax liabilities or the valuation of our deferred tax assets over time. Due to uncertainties in the estimation process, particularly with respect to changes in facts and circumstances in future reporting periods, as well as the residential homebuilding industry’s cyclicality and sensitivity to changes in economic conditions, it is possible that actual results could differ from the estimates used in previous analyses.\n \n \nThe balance for uncertain tax positions, excluding penalties and interest, was $\n19.7\n million and $\n19.2\n million as of December 31, \n2024, and 2023\n, respectively, with $0.5 million, $\n2.9\n million and $\n1.8\n million re\ncorded in the Company’s consolidated statements of operations for the years ended December 31, 2024, 2023 and 2022\n. We accrue interest and penalties on our uncertain tax positions as a component of our provision for income taxes. We accrued \nno\n significant interest and penalties in \n2024, 2023 or 2022.\n \nWe are subject to U.S. federal income tax as well as income tax of multiple state jurisdictions and in very limited situations, foreign jurisdictions. Based on completed examinations and the expiration of statutes of limitations, we have concluded all U.S. federal income tax matters for years through 2018\n. We are currently under IRS audit for various aspects of our 2019 and 2020 tax years. We report income-based tax in \n41\n states with various years open to examination.\n \nIn December 2021, the Organization for Economic Co-operation and Development (“OECD”) released Model Global Anti-Base Erosion rules under Pillar Two. These rules provide for the taxation of large multinational corporations at a minimum rate of \n15\n%, calculated on a jurisdictional basis. Countries in which we operate enacted legislation to implement aspects of the Pillar Two rules beginning in 2024, with certain remaining impacts to be effective from January 1, 2025. The items enacted in 2024 did not have a material impact on our consolidated financial statements and we do not expect the items effective in 2025 to have a material impact on our consolidated financial statements.\n\n\n12. \nEmployee Benefit Plans\n \nWe maintain active defined contribution 401(k) plans under which our employees are eligible to participate in the plan subject to certain employment eligibility provisions. Participants can contribute up to \n75\n% of their annual compensation, subject to federally mandated maximums. Participants are immediately vested in their own contributions. We match a certain percentage of the contributions made by participating employees, subject to IRS limitations. Our matching contributions are subject to a pro-rata \nfive-year\n vesting schedule. We recognized expense of \n$\n37.6\n million\n, \n$\n36.5\n million\n and \n$\n36.4\n million\n in 2024, 2023 and 2022, respectively, for contributions to the plan.\n \nThe Company contributes to multiple collectively bargained union retirement plans including multiemployer plans. The Company does not administer the multiemployer plans, and contributions are determined in accordance with the provisions of negotiated labor contracts and subject to the normal risks of participating in these types of plans, including potentially being required to pay that plan an amount to stop participating (“withdrawal liability”). Contributions to the plans for the years ended December 31, 2024, 2023 and 2022\n were not material.\n\n\n13. \nCommitments and Contingencies\n \nAs of December 31, 2024, we had outstanding letters of credit totaling \n$\n83.3\n million\n under our Revolving Facility that principally support our self-insurance programs.\n \nThe Company has a number of known and threatened construction defect legal claims.  While these claims are generally covered under the Company’s existing insurance programs to the extent any loss exceeds the deductible, there is a reasonable possibility of loss that is not able to be estimated at this time because (i) many of the proceedings are in the discovery stage, (ii) the outcome of future litigation is uncertain, and/or (iii) the complex nature of the claims.  Although the Company cannot estimate a reasonable range of loss based on currently available information, the resolution of these matters could have a material adverse effect on the Company's financial position, results of operations or cash flows.\nIn addition, we are involved in various other claims and lawsuits incidental to the conduct of our business in the ordinary course. We carry insurance coverage in such amounts in excess of our self-insured retention as we believe to be reasonable under the circumstances and that may or may not cover any or all of our liabilities in respect of such claims and lawsuits. Although the ultimate disposition of these other proceedings cannot be predicted with certainty, management believes the outcome of any such claims that are pending or threatened, either individually or on a combined basis, will not have a material adverse effect on our consolidated financial position, cash flows or results of operations.  However, there can be no assurances that future adverse judgments and costs would not be material to our results of operations or liquidity for a particular period.\n\n\n62\n\n\n\n\n \n\n\n14. \nRelated Party Transactions\n \nA member of the Company’s board of directors was an executive officer of one of our customers, Ashton Woods USA, L.L.C., during 2022. Total net sales to Ashton Woods USA, L.L.C. were approximately \n1\n% of our total net sales for the year ended December 31, 2022. For the years ended December 31,  \n2024 and 2023\n there are \nno\n related party transactions.\n\n\n15. \nSignificant Segment Expenses\n\n\nThe accounting policies of our reportable segment are consistent with the accounting policies described in Note 2 to these consolidated financial statements. The primary measures reviewed by the CODM, including revenue, gross margin and income before income taxes, are shown in these consolidated financial statements. The CODM uses these measures to assess performance for the reportable segment and to decide how to allocate resources. Gross margin and income before income taxes are driven by the segment’s significant expense items of cost of sales and compensation and benefits, as well as other segment items. Cost of sales is shown in these consolidated financial statements. Compensation and benefits were $2.3 billion, $2.3 billion and $2.5 billion for the years ended December 31, 2024, 2023 and 2022, respectively, and are reported within selling, general, and administrative expenses in these consolidated financial statements. Other segment items are substantially all the remaining selling, general, and administrative expenses reported in these consolidated financial statements. The measure of segment assets is reported on the balance sheet as total consolidated assets.\n\n\n16. \nSubsequent Events\nBusiness Combinations\nOn \nJanuary 2, 2025\n, we completed our previously announced acquisition of Alpine Lumber Company, the largest independently operated supplier of building materials in Colorado and northern New Mexico. Alpine serves the Colorado Front Range, western Colorado and northern New Mexico through its \n21\n operating locations and provides a broad product range, including prefabricated trusses and wall panels and millwork.\n \nOn \nFebruary 3, 2025\n, we completed the acquisition of O.C. Cluss Lumber, a lumber and building supplies provider in southwestern Pennsylvania, western Maryland and northern West Virginia.\nThe accounting for these business combinations has not been completed at the date of this filing given the proximity of the acquisition date.\n\n\n \n\n\n63\n\n\n\n\n \n\n\nI\ntem 9. \n Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\n \n\n\nNone.\n \n\n\nI\ntem 9A.\n Controls and Procedures\n \n\n\nDisclosure Controls Evaluation and Related CEO and CFO Certifications.\n Our management, with the participation of our CEO and principal financial officer (“CFO”) conducted an evaluation of the effectiveness of the design and operation of our disclosure controls and procedures as of the end of the period covered by this annual report.\n \n\n\nCertifications of our CEO and our CFO, which are required in accordance with Rule 13a-14 of the Securities Exchange Act of 1934, as amended (“Exchange Act”), are attached as exhibits to this annual report. This “Controls and Procedures” section includes the information concerning the controls evaluation referred to in the certifications, and it should be read in conjunction with the certifications for a more complete understanding of the topics presented.\n \n\n\nLimitations on the Effectiveness of Controls.\n We do not expect that our disclosure controls and procedures will prevent all errors and all fraud. A system of controls and procedures, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the system are met. Because of the limitations in all such systems, no evaluation can provide absolute assurance that all control issues and instances of fraud, if any, within the Company have been detected. Furthermore, the design of any system of controls and procedures is based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions, regardless of how unlikely. Because of these inherent limitations in a cost-effective system of controls and procedures, misstatements or omissions due to error or fraud may occur and not be detected.\n \n\n\nScope of the Controls Evaluation.\n The evaluation of our disclosure controls and procedures included a review of their objectives and design, the Company’s implementation of the controls and procedures and the effect of the controls and procedures on the information generated for use in this annual report. In the course of the evaluation, we sought to identify whether we had any data errors, control problems or acts of fraud and to confirm that appropriate corrective action, including process improvements, were being undertaken if needed. This type of evaluation is performed on a quarterly basis so that conclusions concerning the effectiveness of our disclosure controls and procedures can be reported in our quarterly reports on Form 10-Q and in our annual report on Form 10-K. Many of the components of our disclosure controls and procedures are also evaluated by our internal audit department, our legal department and by personnel in our finance organization. The overall goals of these various evaluation activities are to monitor our disclosure controls and procedures on an ongoing basis, and to maintain them as dynamic systems that change as conditions warrant.\n \n\n\nConclusions regarding Disclosure Controls.\n Based on the required evaluation of our disclosure controls and procedures, our CEO and CFO have concluded that, as of December 31, 2024, we maintained disclosure controls and procedures that were effective in providing reasonable assurance that information required to be disclosed by us in the reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the SEC’s rules and forms, and that such information is accumulated and communicated to our management, including our CEO and CFO, as appropriate, to allow timely decisions regarding required disclosure.\n \n\n\nManagement’s Report on Internal Control over Financial Reporting.\n Our management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Rule 13a-15(f) of the Exchange Act. Internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with GAAP. Internal control over financial reporting includes policies and procedures that: (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of our assets; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with GAAP, and that our receipts and expenditures are being made only in accordance with authorizations of our management and directors; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on the financial statements.\n\n\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with existing policies or procedures may deteriorate.\n\n\n64\n\n\n\n\n \n\n\nUnder the supervision and with the participation of our management, including our CEO and CFO, we conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework set forth in \nInternal Control — Integrated Framework (2013\n) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on our evaluation under the framework set forth in \nInternal Control — Integrated Framework (2013)\n, our management concluded that our internal control over financial reporting was effective as of December 31, 2024.\n \n\n\nThe effectiveness of the Company’s internal control over financial reporting as of December 31, 2024, has been audited by PricewaterhouseCoopers LLP, an independent registered public accounting firm, as stated in their report which appears herein.\n \n\n\nChanges in Internal Control over Financial Reporting.\n During the period covered by this report there were no changes in our internal control over financial reporting identified in connection with the evaluation described above that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\n\n\nItem 9B. \n Othe\nr Information\n \n\n\n \n\n\nNone\n.\n \n\n\nItem 9C. \n Disclosure Regarding Foreign J\nurisdictions That Prevent Inspections\n \n\n\n \n\n\nNot applicable.\n\n\n \n\n\n65\n\n\n\n\n \n\n\nP\nART III\n \n\n\nI\ntem 10.\n Directors, Executive Officers and Corporate Governance\n \n\n\nThe information required by this item, other than the information regarding the Code of Business Conduct and Ethics and Insider Trading Policy set forth below, appears in our definitive proxy statement for our annual meeting of stockholders to be held May 27, 2025 under the captions “Proposal 1 — Election of Directors,” “Continuing Directors,” “Information Regarding the Board and Its Committees,” “Corporate Governance,” “Delinquent Section 16(a) Reports,” and “Executive Officers of the Registrant,” which information is incorporated herein by reference.\n \n\n\nCode of Business Conduct and Ethics\n \n\n\nBuilders FirstSource, Inc. and its subsidiaries endeavor to do business according to the highest ethical and legal standards, complying with both the letter and spirit of the law. Our board of directors approved a Code of Business Conduct and Ethics that applies to our directors, officers (including our principal executive officer, principal financial officer and principal accounting officer) and employees. Our Code of Business Conduct and Ethics is administered by a compliance committee made up of representatives from our legal, human resources, finance and internal audit departments.\n \n\n\nOur employees are encouraged to report any suspected violations of laws, regulations and the Code of Business Conduct and Ethics, and all unethical business practices. We provide continuously monitored hotlines for anonymous reporting by employees.\n \n\n\nOur board of directors has also approved a Supplemental Code of Ethics for the Chief Executive Officer, President, and Senior Financial Officers of Builders FirstSource, Inc., which is administered by our general counsel.\n \n\n\nBoth of these policies are listed as exhibits to this annual report on Form 10-K and can be found in the “Investors” section of our corporate website at: www.bldr.com.\n \n\n\nStockholders may request a free copy of these policies by contacting the Corporate Secretary, Builders FirstSource, Inc., 6031 Connection Drive, Suite 400, Irving, Texas 75309, United States of America.\n \n\n\nIn addition, within four business days of:\n \n\n\n•\nAny amendment to a provision of our Code of Business Conduct and Ethics or our Supplemental Code of Ethics for Chief Executive Officer, President and Senior Financial Officers of Builders FirstSource, Inc. that applies to our chief executive officer, chief financial officer or chief accounting officer as it relates to one or more of the items set forth in Item 406(b) of Regulation S-K; or \n\n\n•\nThe grant of any waiver, including an implicit waiver, from a provision of one of these policies to one of these officers that relates to one or more of the items set forth in Item 406(b) of Regulation S-K, \n\n\nWe will provide information regarding any such amendment or waiver (including the nature of any waiver, the name of the person to whom the waiver was granted and the date of the waiver) on our website at the Internet address above, and such information will be available on our website for at least a 12-month period. In addition, we will disclose on our website at the Internet address above any amendments and waivers to our Code of Business Conduct and Ethics or our Supplemental Code of Ethics for Chief Executive Officer, President and Senior Financial Officers of Builders FirstSource, Inc. that relate to any element of the definition of “code of ethics” enumerated in Item 406(b) of Regulation S-K under the Securities Exchange Act of 1934, as amended.\n \n\n\nInsider Trading Policy\n \n\n\nWe have an Insider Trading Policy governing the purchase, sale and other dispositions of our securities that applies to all of our personnel, including directors, officers and employees and other covered persons. The Insider Trading Policy is reasonably designed to promote compliance with insider trading laws, rules and regulations, as well as applicable listing standards. A copy of the Insider Trading Policy is filed as Exhibit 19.1 to this report.\n\n\nI\ntem 11.\n Executive Compensation\n \n\n\nThe information required by this item appears in our definitive proxy statement for our annual meeting of stockholders to be held May 27, 2025, under the captions “Executive Compensation and Other Information,” “Director Compensation — Compensation of Directors,” and “Compensation Committee Interlocks and Insider Participation,” which information is incorporated herein by reference.\n \n\n\n66\n\n\n\n\n \n\n\nI\ntem 12. \n Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\n \n\n\nThe information required by this item appears in our definitive proxy statement for our annual meeting of stockholders to be held on May 27, 2025, under the caption “Securities Owned by Directors, Executive Officers, and Certain Beneficial Owners” and “Equity Compensation Plan Information,” which information is incorporated herein by reference.\n \n\n\nI\ntem 13.\n Certain Relationships and Related Transactions, and Director Independence\n \n\n\nThe information required by this item appears in our definitive proxy statement for our annual meeting of stockholders to be held May 27, 2025, under the caption “Election of Directors and Management Information,” “Information Regarding the Board and its Committees,” and “Certain Relationships and Related Party Transactions,” which information is incorporated herein by reference.\n \n\n\nI\ntem 14. \n Principal Accountant Fees and Services\n \n\n\nThe information required by this item appears in our definitive proxy statement for our annual meeting of stockholders to be held May 27, 2025, under the caption “Ratification of Selection of Independent Registered Public Accounting Firm — Fees Paid to PricewaterhouseCoopers LLP,” which information is incorporated herein by reference.\n \n\n\n \n\n\n67\n\n\n\n\n \n\n\nP\nART IV\n \n\n\n \n\n\nItem 15. \n Exhibits and Fina\nncial Statement Schedules\n \n\n\n \n\n\n(a) (1) See the index to consolidated financial statements provided in Item 8 for a list of the financial statements filed as part of this report.\n \n\n\n(2) Financial statement schedules are omitted because they are either not applicable or not material.\n \n\n\n(3) The following documents are filed, furnished or incorporated by reference as exhibits to this report as required by Item 601 of Regulation S-K.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nExhibit\nNumber\n\n\n \n\n\nDescription\n\n\n\n\n\n\n2.1\n\n\n \n\n\nAgreement and Plan of Merger, dated August 26, 2020, by and among Builders FirstSource, Inc., BMC Stock Holdings, Inc., and Boston Merger Sub I Inc. (incorporated by reference to Exhibit 2.1 to the Company’s Current Report on Form 8-K, filed with the Securities and Exchange Commission on August 27, 2020, File Number 0-51357)\n\n\n\n\n\n\n3.1\n\n\n \n\n\nAmended and Restated Certificate of Incorporation of Builders FirstSource, Inc. (incorporated by reference to Exhibit 3.1 to Amendment No. 4 to the Registration Statement of the Company on Form S-1, filed with the Securities and Exchange Commission on June 6, 2005, File Number 333-122788)\n\n\n\n\n\n\n3.2\n\n\n \n\n\nAmendment to Amended and Restated Certificate of Incorporation of Builders FirstSource, Inc. (incorporated by reference to Exhibit 3.1 to the Company’s Current Report on Form 8-K, filed with the Securities and Exchange Commission on January 4, 2021, File Number 0-51357)\n\n\n\n\n\n\n3.3\n\n\n \n\n\nAmended and Restated By-Laws of Builders FirstSource, Inc. (incorporated by reference to Exhibit 3.1 to the Company’s Current Report on Form 8-K, filed with the Securities and Exchange Commission on April 28, 2022, File Number 001-40620)\n\n\n\n\n\n\n4.1\n\n\n \n\n\nIndenture, dated as of February 11, 2020, among the Company, the guarantors named therein and Wilmington Trust, National Association, as trustee (incorporated by reference to Exhibit 4.1 to the Company’s Current Report on Form 8-K, filed with the Securities and Exchange Commission on February 11, 2020, File Number 0-51357)\n\n\n\n\n\n\n4.2\n\n\n \n\n\nIndenture, dated as of July 23, 2021, among Builders FirstSource, Inc., the guarantors named therein and Wilmington Trust, National Association, as trustee (incorporated by reference to Exhibit 4.1 to the Company’s Current Report on Form 8-K, filed with the Securities and Exchange Commission on July 23, 2021, File Number 001-40620)\n\n\n\n\n\n\n4.3\n\n\n \n\n\nSecond Supplemental Indenture, dated as of January 21, 2022, among Builders FirstSource, Inc., the guarantors named therein and Wilmington Trust, National Association, as trustee (form of Note included therein) (incorporated by reference to Exhibit 4.3 to the Company’s Current Report on Form 8-K, filed with the Securities and Exchange Commission on January 21, 2022, File Number 001-40620)\n\n\n\n\n\n\n4.4\n\n\n \n\n\nIndenture, dated as of June 15, 2022, among Builders FirstSource, Inc., the guarantors named therein and Wilmington Trust, National Association, as trustee (incorporated by reference to Exhibit 4.1 to the Company’s Current Report on Form 8-K, filed with the Securities and Exchange Commission on June 16, 2022, File Number 001-40620)\n\n\n\n\n\n\n4.5\n\n\n \n\n\nIndenture, dated as of February 29, 2024, among Builders FirstSource, Inc., the guarantors named therein and Wilmington Trust, National Association, as trustee (incorporated by reference to Exhibit 4.1 to the Company’s Current Report on Form 8-K, filed with the Securities and Exchange Commission on February 29, 2024, File Number 001-40620)\n\n\n\n\n\n\n4.6*\n\n\n \n\n\nDescription of Capital Stock\n\n\n\n\n\n\n10.1+\n\n\n \n\n\nAmended and Restated ABL Credit Agreement, dated as of July 31, 2015, among Builders FirstSource, Inc., SunTrust Bank, as administrative agent and collateral agent, and the lenders and financial institutions party thereto (incorporated by reference to Exhibit 10.2 to the Company’s Current Report on Form 8-K, filed with the Securities Exchange Commission on August 6, 2015, File Number 0-51357)\n\n\n\n\n\n\n10.2\n\n\n \n\n\nAmendment No. 1 to Credit Agreement, dated as of March 22, 2017, among Builders FirstSource, Inc., SunTrust Bank, as administrative agent and collateral agent, and the lenders party thereto (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K, filed with the Securities and Exchange Commission on March 28, 2017, File Number 0-51357)\n\n\n\n\n\n\n68\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n10.3\n\n\n \n\n\nAmendment No. 2 to Credit Agreement, dated as of April 24, 2019, among Builders FirstSource, Inc., Truist Bank (as successor by merger to SunTrust Bank), as administrative agent and collateral agent, and the lenders party thereto (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K, filed with the Securities and Exchange Commission on April 30, 2019, File Number 0-51357)\n\n\n\n\n\n\n10.4\n\n\n \n\n\nAmendment No. 3 to Credit Agreement, dated as of January 29, 2021, among Builders FirstSource, Inc., SunTrust Bank, as administrative agent and collateral agent, and the lenders party thereto (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K, filed with the Securities and Exchange Commission on February 3 2021, File Number 0-51357)\n\n\n\n\n\n\n10.5\n\n\n \n\n\nAmendment No. 4 to Credit Agreement, dated as of December 17, 2021, among the Company, Truist Bank (as successor by merger to SunTrust Bank), as administrative agent and collateral agent, and the lenders party thereto (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K, filed with the Securities and Exchange Commission on December 22, 2021, File Number 001-40620)\n\n\n\n\n\n\n10.6\n\n\n \n\n\nAmendment No. 5 to Credit Agreement, dated as of February 4, 2022, among the Company, Truist Bank (as successor by merger to SunTrust Bank), as administrative agent and collateral agent, and the lenders party thereto (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K, filed with the Securities and Exchange Commission on February 8, 2022, File Number 001-40620)\n\n\n\n\n\n\n10.7\n\n\n \n\n\nAmendment No. 6 to Credit Agreement, dated as of January 17, 2023, among the Company, Truist Bank (as successor by merger to SunTrust Bank), as administrative agent and collateral agent, and the lenders party thereto (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K, filed with the Securities and Exchange Commission on January 23, 2023, File Number 001-40620)\n\n\n\n\n\n\n10.8\n\n\n \n\n\nAmendment No. 7 to Credit Agreement, dated as of April 3, 2023, among the Company, Truist Bank (as successor by merger to SunTrust Bank), as administrative agent and collateral agent, and the lenders party thereto (incorporated by reference to Exhibit 10.2 to the Company’s Quarterly Report on Form 10-Q, filed with the Securities and Exchange Commission on May 3, 2023, File Number 001-40620)\n\n\n\n\n\n\n10.9\n\n\n \n\n\nABL/Bond Intercreditor Agreement, dated as of May 29, 2013, among Builders FirstSource, Inc. and certain of its subsidiaries, as grantors, SunTrust Bank, as ABL agent, and Wilmington Trust, National Association, as notes collateral agent (incorporated by reference to Exhibit 10.2 to the Company’s Current Report on Form 8-K, filed with the Securities Exchange Commission on June 3, 2013, File Number 0-51357)\n\n\n\n\n\n\n10.10\n\n\n \n\n\nAmended and Restated ABL Collateral Agreement, dated as of July 31, 2015, among the Company, certain of its subsidiaries, and SunTrust Bank (incorporated by reference to Exhibit 10.5 to the Company’s Current Report on Form 8-K, filed with the Securities Exchange Commission on August 6, 2015, File Number 0-51357)\n\n\n\n\n\n\n10.10\n\n\n \n\n\nNotes Collateral Agreement, dated as of May 30, 2019, among Builders FirstSource, Inc., certain of its subsidiaries, and Wilmington Trust, National Association, as trustee (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K, filed with the Securities and Exchange Commission on May 31, 2019, File Number 0-51357)\n\n\n\n\n\n\n10.12\n\n\n \n\n\nAmended and Restated ABL Guarantee Agreement, dated as of July 31, 2015, among the Guarantors (as defined therein) and SunTrust Bank (incorporated by reference to Exhibit 10.7 to the Company’s Current Report on Form 8-K, filed with the Securities Exchange Commission on August 6, 2015, File Number 0-51357)\n\n\n\n\n\n\n10.13\n\n\n \n\n\nLease and Master Agreement Guaranty, dated as of July 31, 2015, by the Company in favor of LN Real Estate LLC (incorporated by reference to Exhibit 10.10 to the Company’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2015, filed with the Securities and Exchange Commission on November 9, 2015, File Number 0-51357)\n\n\n\n\n\n\n10.14+\n\n\n \n\n\nBuilders FirstSource, Inc. 2014 Incentive Plan (incorporated herein by reference to Appendix A of the Company’s Definitive Proxy Statement on Schedule 14A, filed with the Securities and Exchange Commission on April 11, 2014, File Number 0-51357)\n\n\n\n\n\n\n10.15+\n\n\n \n\n\nAmendment to the Builders FirstSource, Inc. 2014 Incentive Plan (incorporated by reference to Appendix A of the Company’s Definitive Proxy Statement on Schedule 14A, filed with the Securities and Exchange Commission on April 14, 2016, File Number 0-51357)\n\n\n\n\n\n\n10.16+\n\n\n \n\n\nSecond Amendment to the Builders FirstSource, Inc. 2014 Incentive Plan (incorporated by reference to Exhibit 10.14 to the Company’s Annual Report on Form 10-K for the year ended December 31, 2020, filed with the Securities and Exchange Commission on February 26, 2021, File Number 0-51351)\n\n\n\n\n\n\n69\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n10.17+\n\n\n \n\n\n2019 Form of Builders FirstSource, Inc. 2014 Incentive Plan Restricted Stock Unit Award Certificate (incorporated by reference to Exhibit 10.1 to the Company’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2019, filed with the Securities and Exchange Commission on May 3, 2019, File Number 0-51357)\n\n\n\n\n\n\n10.19\n\n\n \n\n\nBuilders FirstSource, Inc. Director Compensation Policy (incorporated by reference to Exhibit 10.19 to the Company’s Annual Report on Form 10-K for the year ended December 31, 2023, filed with the Securities and Exchange Commission on February 22, 2024, File Number 001-40620)\n\n\n\n\n\n\n10.20+\n\n\n \n\n\nBuilders FirstSource, Inc. Form of Director Indemnification Agreement (incorporated by reference to Exhibit 10.13 to Amendment No. 3 to the Registration Statement of the Company on Form S-1, filed with the Securities and Exchange Commission on May 26, 2005, File Number 333-122788)\n\n\n\n\n\n\n10.21+\n\n\n \n\n\nBuilders FirstSource, Inc. Executive and Key Employee Severance Plan (incorporated by reference to Exhibit 10.34 to the Company’s Annual Report on Form 10-K for the year ended December 31, 2022, filed with the Securities and Exchange Commission on February 28, 2023, File Number 001-40620)\n\n\n\n\n\n\n10.22*+\n\n\n \n\n\nSpecial Advisor Agreement, dated as of November 6, 2024, between Builders FirstSource, Inc. and Dave Rush\n\n\n\n\n\n\n14.1\n\n\n \n\n\nBuilders FirstSource, Inc. Code of Business Conduct and Ethics (incorporated by reference to Exhibit 14.1 to the Company’s Annual Report on Form 10-K for the year ended December 31, 2021, filed with the Securities and Exchange Commission on March 1, 2022, File Number 001-40620)\n\n\n\n\n\n\n14.2\n\n\n \n\n\nBuilders FirstSource, Inc. Supplemental Code of Ethics (incorporated by reference to Exhibit 14.2 to the Company’s Annual Report on Form 10-K for the year ended December 31, 2005, filed with the Securities and Exchange Commission on March 13, 2006, File Number 0-51357)\n\n\n\n\n\n\n19.1*\n\n\n \n\n\nInsider Trading Policy\n\n\n\n\n\n\n21.1*\n\n\n \n\n\nSubsidiaries of the Registrant\n\n\n\n\n\n\n23.1*\n\n\n \n\n\nConsent of PricewaterhouseCoopers LLP, Independent Registered Public Accounting Firm\n\n\n\n\n\n\n24.1*\n\n\n \n\n\nPower of Attorney (included as part of signature page)\n\n\n\n\n\n\n31.1*\n\n\n \n\n\nCertification of Chief Executive Officer pursuant to 17 CFR 240.13a-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002, signed by Peter M. Jackson as Chief Executive Officer\n\n\n\n\n\n\n31.2*\n\n\n \n\n\nCertification of Chief Financial Officer pursuant to 17 CFR 240.13a-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002, signed by Pete Beckmann as Chief Financial Officer\n\n\n\n\n\n\n32.1**\n\n\n \n\n\nCertification of Chief Executive Officer and Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002, signed by Peter M. Jackson as Chief Executive Officer and Pete Beckmann as Chief Financial Officer\n\n\n\n\n\n\n97.1*\n\n\n \n\n\nCompensation Recoupment Policy (incorporated by reference to Exhibit 97.1 to the Company’s Annual Report on Form 10-K for the year ended December 31, 2023, filed with the Securities and Exchange Commission on February 22, 2024, File Number 001-40620)\n\n\n\n\n\n\n101*\n\n\n \n\n\nThe following financial information from Builders FirstSource, Inc.’s Form 10-K filed on February 20, 2025, formatted in Inline eXtensible Business Reporting Language (“Inline XBRL”): (i) Consolidated Statements of Operations and Comprehensive Income for the years ended December 31, 2024, 2023 and 2022, (ii) Consolidated Balance Sheets at December 31, 2024 and 2023, (iii) Consolidated Statements of Cash Flows for the years ended December 31, 2024, 2023 and 2022, (iv) Consolidated Statements of Changes in Stockholders’ Equity for the years ended December 31, 2024, 2023 and 2022, and (v) the Notes to Consolidated Financial Statements.\n\n\n\n\n\n\n104*\n\n\n \n\n\nThe cover page from the Company’s Annual Report on Form 10-K for the year ended December 31, 2024, has been formatted in Inline XBRL.\n\n\n\n\n\n\n \n\n\n* Filed herewith\n \n\n\n** Builders FirstSource, Inc. is furnishing, but not filing, the written statement pursuant to Title 18 United States Code 1350, as added by Section 906 of the Sarbanes-Oxley Act of 2002, of Peter M. Jackson, our Chief Executive Officer, and Pete Beckmann, our Chief Financial Officer.\n \n\n\n+ Indicates a management contract or compensatory plan or arrangement\n \n\n\n(b) A list of exhibits filed, furnished or incorporated by reference with this Form 10-K is provided above under Item 15(a)(3) of this report. \nBuilders FirstSource, Inc. will furnish a copy of any exhibit listed above to any stockholder without charge upon\n \n\n\n70\n\n\n\n\n \n\n\nwritten request to Timothy D. Johnson, Executive Vice President, General Counsel and Corporate Secretary, 6031 Connection Drive, Suite 400, Irving, Texas 75039.\n \n\n\n(c) Not applicable\n \n\n\n \n\n\nItem 16. \nForm\n 10-K Summary\n\n\n \n\n\nNone.\n \n\n\n \n\n\n71\n\n\n\n\n \n\n\nSIGNAT\nURES\n \n\n\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\n \n\n\nFebruary 20, 2025\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nBUILDERS FIRSTSOURCE, INC.\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n/s/ PETER M. JACKSON\n\n\n\n\n\n\n \n\n\nPeter M. Jackson\n\n\n\n\n\n\n \n\n\nChief Executive Officer and Director\n\n\n\n\n\n\n \n\n\nThe undersigned hereby constitute and appoint Timothy D. Johnson and his substitutes our true and lawful attorneys-in-fact with full power to execute in our name and behalf in the capacities indicated below any and all amendments to this report and to file the same, with all exhibits thereto and other documents in connection therewith, with the Securities and Exchange Commission, and hereby ratify and confirm all that such attorney-in-fact or his substitutes shall lawfully do or cause to be done by virtue thereof.\n \n\n\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSignature\n\n\n \n\n\nTitle\n\n\n \n\n\nDate\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ PETER M. JACKSON\n\n\n \n\n\nChief Executive Officer and Director\n\n\n \n\n\nFebruary 20, 2025\n\n\n\n\n\n\nPeter M. Jackson\n\n\n \n\n\n(Principal Executive Officer)\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ PETE R. BECKMANN\n\n\n \n\n\nExecutive Vice President and Chief Financial Officer\n\n\n \n\n\nFebruary 20, 2025\n\n\n\n\n\n\nPete R. Beckmann\n\n\n \n\n\n(Principal Financial Officer)\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ MATTHEW TRESTER\n\n\n \n\n\nVice President and Controller\n \n\n\n \n\n\nFebruary 20, 2025\n\n\n\n\n\n\nMatthew Trester\n\n\n \n\n\n(Principal Accounting Officer)\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ PAUL S. LEVY\n\n\n \n\n\nChairman and Director\n\n\n \n\n\nFebruary 20, 2025\n\n\n\n\n\n\nPaul S. Levy\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ MARK ALEXANDER\n\n\n \n\n\nDirector\n\n\n \n\n\nFebruary 20, 2025\n\n\n\n\n\n\nMark Alexander\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ CORY J. BOYDSTON\n\n\n \n\n\nDirector\n\n\n \n\n\nFebruary 20, 2025\n\n\n\n\n\n\nCory J. Boydston\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ DIRKSON R. CHARLES\n\n\n \n\n\nDirector\n\n\n \n\n\nFebruary 20, 2025\n\n\n\n\n\n\nDirkson R. Charles\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ CLEVELAND A. CHRISTOPHE\n\n\n \n\n\nDirector\n\n\n \n\n\nFebruary 20, 2025\n\n\n\n\n\n\nCleveland A. Christophe\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ WILLIAM B. HAYES\n\n\n \n\n\nDirector\n\n\n \n\n\nFebruary 20, 2025\n\n\n\n\n\n\nWilliam B. Hayes\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ BRETT N. MILGRIM\n\n\n \n\n\nDirector\n\n\n \n\n\nFebruary 20, 2025\n\n\n\n\n\n\nBrett N. Milgrim\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ JAMES O’LEARY\n\n\n \n\n\nDirector\n\n\n \n\n\nFebruary 20, 2025\n\n\n\n\n\n\nJames O’Leary\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ CRAIG A. STEINKE\n\n\n \n\n\nDirector\n\n\n \n\n\nFebruary 20, 2025\n\n\n\n\n\n\nCraig A. Steinke\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ DAVE RUSH\n\n\n \n\n\nDirector\n\n\n \n\n\nFebruary 20, 2025\n\n\n\n\n\n\nDave Rush\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n72"
  }
}