{
  "ticker": "BMY",
  "cik": "0000014272",
  "company_name": "BRISTOL MYERS SQUIBB CO",
  "filing_date": "2025-02-12",
  "accession": "0000014272-25-000039",
  "primary_doc": "bmy-20241231.htm",
  "item_sections": {
    "item1": "Item 1.\nBUSINESS.\nGeneral\nBristol-Myers Squibb Company (\"we\", the \"Company\", or \"BMS\") was incorporated under the laws of the State of Delaware in August 1933 under the name Bristol-Myers Company, as successor to a New York business started in 1887. In 1989, Bristol-Myers Company changed its name to Bristol-Myers Squibb Company as a result of a merger. \nWe operate in one segment engaged in the discovery, development, licensing, manufacturing, marketing, distribution and sale of biopharmaceutical products on a global basis. Our principal strategy is to combine the resources, scale and capability of a pharmaceutical company with the speed and focus on innovation of the biotech industry. Our focus as a biopharmaceutical company is on discovering, developing and delivering transformational medicines for patients facing serious diseases in areas where we believe that we have an opportunity to make a meaningful difference: oncology, hematology, immunology, cardiovascular, neuroscience and other areas where we can also deliver attractive returns for shareholders. Our priorities are to focus on transformational medicines where we have a competitive advantage, drive operational excellence and strategically allocate capital for long-term growth and shareholder returns. For a further discussion of our strategy initiatives, refer to “Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations—Strategy.” In addition, we expect that our acquisitions of Karuna, RayzeBio and Mirati in 2024 will allow us to expand in neuroscience and oncology, and continue to position us as a leading biopharmaceutical company across our core therapeutic areas.\nWe compete with other global research-based biopharmaceutical companies, smaller research companies and generic drug manufacturers. Our products are sold worldwide, primarily to wholesalers, distributors, specialty pharmacies, and to a lesser extent, directly to retailers, hospitals, clinics and government agencies. We have significant manufacturing operations in the U.S., Puerto Rico, Switzerland, Ireland, and the Netherlands.\nThe percentage of revenues by significant region/country were as follows:\n \nYear Ended December 31,\nDollars in millions\n2024\n2023\n2022\nUnited States\n71 \n%\n69 \n%\n68 \n%\nInternational\n (a)\n27 \n%\n29 \n%\n30 \n%\nOther\n (b)\n2 \n%\n2 \n%\n2 \n%\nTotal Revenues\n$\n48,300 \n$\n45,006 \n$\n46,159 \n(a)    Beginning in 2024, Puerto Rico revenues are presented as part of International revenues to align with management's review of the Company's financial results. Prior period amounts have been recast to conform to the current presentation. \n(b)    Other revenues include royalties and alliance-related revenues for products not sold by BMS\n’\ns regional commercial organizations.\nRefer to the Summary of Abbreviated Terms at the end of this 2024 Form 10-K for definitions of capitalized terms used throughout the document.\n1\nAcquisitions, Divestitures, Licensing and Other Arrangements\nAcquisitions, divestitures, licensing and other arrangements allow us to focus our resources on growth opportunities that drive the greatest long-term value. Our significant business development activities in 2024 included acquisitions of Karuna, RayzeBio and Mirati in addition to a global strategic collaboration agreement with SystImmune. For additional information relating to our acquisitions, divestitures, licensing and other arrangements refer to “Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations—Acquisitions, Divestitures, Licensing and Other Arrangements”, “Item 8. Financial Statements and Supplementary Data—Note 3. Alliances”, and “Item 8. Financial Statements and Supplementary Data—Note 4. Acquisitions, Divestitures, Licensing and Other Arrangements”.\nProducts, Intellectual Property and Product Exclusivity\nOur differentiated research platforms support long-term growth across therapeutic areas. Our platforms are comprised of chemically-synthesized or small molecule drugs including protein degraders; drugs produced from biological processes, called “biologics”; ADCs, CAR-T cell therapies, and radiopharmaceutical therapeutics. Small molecule drugs are typically administered orally in the form of a tablet or capsule, although other drug delivery mechanisms are also used. Biologics are typically administered through injections or by intravenous infusion. CAR-T cell therapies are administered by intravenous infusion.\nBelow is a summary of our significant products, including approved indications. For information about our alliance arrangements for certain of the products below, refer to “—Alliances” below and “Item 8. Financial Statements and Supplementary Data—Note 3. Alliances.”\nGrowth Portfolio\nOpdivo\n®\n    \nOpdivo \n(nivolumab) is a biological product and a fully human monoclonal antibody that binds to the PD-1 on T and NKT cells. It has been approved for several anti-cancer indications including bladder, blood, CRC, head and neck, RCC, HCC, lung, melanoma, MPM, stomach and esophageal cancer. The \nOpdivo\n+\nYervoy\n regimen also is approved in multiple markets for the treatment of NSCLC, melanoma, MPM, RCC, CRC and various gastric and esophageal cancers..\nOpdivo Qvantig\nTM    \nOpdivo Qvantig \n(nivolumab and hyaluronidase-nvhy) is a subcutaneously administered PD-1 inhibitor indicated for most previously approved adult, solid tumor \nOpdivo\n indications as monotherapy, monotherapy maintenance following completion of \nOpdivo\n plus \nYervoy\n combination therapy, or in combination with chemotherapy or cabozantinib.\nOrencia\n®\n    \nOrencia \n(abatacept) is a biological product and a fusion protein indicated for adult patients with moderate to severe active RA and PsA. It has indications for (i) reducing signs and symptoms in certain pediatric patients with moderately to severely active polyarticular JIA and (ii) for the treatment of aGVHD, in combination with a calcineurin inhibitor and methotrexate.\nYervoy\n®\n    Yervoy \n(ipilimumab) is a biological product and is a CTLA4 immune checkpoint inhibitor. \nYervoy\n is a monoclonal antibody for the treatment of patients with unresectable or metastatic melanoma. The \nOpdivo\n+\nYervoy\n regimen is approved in multiple markets for the treatment of NSCLC, melanoma, MPM, RCC, CRC and esophageal cancer.\nReblozyl\n®\n    Reblozyl \n(luspatercept-aamt) is a biological product, and is an erythroid maturation agent indicated for the treatment of anemia in (i) adult patients with transfusion dependent and non-transfusion dependent beta thalassemia who require regular red blood cell transfusions, (ii) adult patients with very low- to intermediate-risk MDS who have ring sideroblasts and require red blood cell transfusions, as well as (iii) adult patients without previous erythropoiesis stimulating agent use (ESA-naïve) with very low- to intermediate-risk MDS who may require regular red blood cell transfusions, regardless of RS status. \nOpdualag\n®    \nOpdualag \n(nivolumab and relatlimab-rmbw) is a combination of nivolumab, a PD-1 blocking antibody, and relatlimab, a LAG-3 blocking antibody, indicated for the treatment of adult and pediatric patients 12 years of age or older with unresectable or metastatic melanoma.\n2\nBreyanzi\n®        \nBreyanzi \n(lisocabtagene maraleucel) is a CD19-directed genetically modified autologous CAR-T cell therapy indicated for the treatment of adult patients with relapsed or refractory LBCL after one or more lines of systemic therapy, including DLBCL not otherwise specified, high-grade B-cell lymphoma, primary mediastinal LBCL, grade 3B FL and relapsed or refractory FL after at least two prior lines of systemic therapy, relapsed or refractory CLL or SLL, and relapsed or refractory MCL in patients who have received at least two prior lines of systemic therapy, including a Bruton tyrosine kinase inhibitor and a B-cell lymphoma 2 inhibitor.\nCamzyos\n®    \nCamzyos \n(mavacamten) is a cardiac myosin inhibitor indicated for the treatment of adults with symptomatic oHCM to improve functional capacity and symptoms.\nZeposia\n®\n    Zeposia \n(ozanimod) is an oral immunomodulatory drug used to treat relapsing forms of MS, to include clinically isolated syndrome, relapsing-remitting disease, and active secondary progressive disease, in adults and to treat moderately to severely active UC in adults.\nAbecma\n®\n    \nAbecma\n (idecabtagene vicleucel) is a BCMA genetically modified autologous CAR-T cell therapy indicated for the treatment of adult patients with relapsed or refractory multiple myeloma after four or more prior lines of therapy, including an immunomodulatory agent, a proteasome inhibitor, and an anti-cyclic ADP ribose hydrolase monoclonal antibody.\nSotyktu\n®            \nSotyktu\n (deucravacitinib) is an oral, selective, allosteric tyrosine kinase 2 inhibitor indicated for the treatment of adults with moderate-to-severe plaque psoriasis who are candidates for systemic therapy or phototherapy.\nKrazati\n®            \nKrazati \n(adagrasib) is a highly selective and potent oral small-molecule inhibitor of the KRAS\nG12C \nmutation, indicated for the treatment of adult patients with KRAS\nG12C\n-mutated locally advanced or metastatic NSCLC, as determined by an FDA-approved test, who have received at least one prior systemic therapy and, in combination with cetuximab, for the treatment of adult patients with KRAS\nG12C\n-mutated locally advanced or metastatic CRC, as determined by an FDA-approved test, who have received prior treatment with fluoropyrimidine-, oxaliplatin-, and irinotecan-based chemotherapy. \nAugtyro\n®    \n    Augtyro \n(repotrectinib) is a kinase inhibitor indicated for the treatment of adult patients with locally advanced or metastatic ROS1-positive NSCLC and for the treatment of adult and pediatric patients 12 years of age and older with solid tumors that have NTRK gene fusion, are locally advanced or metastatic or where surgical resection is likely to result in severe morbidity, and have progressed following treatment or have no satisfactory alternative therapy. \nCobenfy\nTM\n        Cobenfy \n(xanomeline and trospium chloride) is a combination M1/M4 muscarinic receptor agonist and muscarinic antagonist indicated for the treatment of schizophrenia in adults.\nLegacy Portfolio\nEliquis\n®    \nEliquis \n(apixaban) is an oral Factor Xa inhibitor indicated for the reduction in risk of stroke/systemic embolism in NVAF and for the treatment of DVT/PE and reduction in risk of recurrence following initial therapy.\nRevlimid\n®\n    Revlimid \n(lenalidomide) is an oral immunomodulatory drug that in combination with dexamethasone is indicated for the treatment of patients with multiple myeloma. \nRevlimid\n as a single agent is also indicated as a maintenance therapy in patients with multiple myeloma following autologous hematopoietic stem cell transplant. \nRevlimid\n has received approvals for several indications in the hematological malignancies including lymphoma and MDS.\nPomalyst\n®\n/Imnovid\n®\n    Pomalyst/Imnovid \n(pomalidomide) is a small molecule that is administered orally and modulates the immune system and other biologically important targets. \nPomalyst/Imnovid\n is indicated for patients with multiple myeloma who have received at least two prior therapies including lenalidomide and a proteasome inhibitor and have demonstrated disease progression on or within 60 days of completion of the last therapy.\nSprycel\n®\n    Sprycel \n(dasatinib) is an oral inhibitor of multiple tyrosine kinase indicated for the first-line treatment of patients with Philadelphia chromosome-positive CML in chronic phase and the treatment of adults with chronic, accelerated, or myeloid or lymphoid blast phase CML with resistance or intolerance to prior therapy, including \nGleevec* \n(imatinib mesylate) and the treatment of children and adolescents aged 1 year to 18 years with chronic phase Philadelphia chromosome-positive CML. \n3\nAbraxane\n®\n    Abraxane \n(paclitaxel albumin-bound particles for injectable suspension) is a solvent-free protein-bound chemotherapy product that combines paclitaxel with albumin using our proprietary \nNab\n®\n technology platform, and is used to treat breast cancer, NSCLC and pancreatic cancer, among others.\nWe own or license a number of patents in the U.S. and foreign countries primarily covering our products. We have also developed many brand names and trademarks for our products. We consider the overall protection of our patents, trademarks, licenses and other intellectual property rights to be of material value and act to protect these rights from infringement.\nIn the pharmaceutical industry, the majority of an innovative product’s commercial value is usually realized during the period in which the product has market exclusivity. A product’s market exclusivity is generally determined by two forms of intellectual property: patent rights held by the innovator company and any regulatory forms of exclusivity to which the innovative drug is entitled.\nPatents are a key determinant of market exclusivity for most branded pharmaceuticals. Patents provide the innovator with the right to exclude others from practicing an invention related to the medicine. Patents may cover, among other things, the active ingredient(s), various uses of a drug product, pharmaceutical formulations, drug delivery mechanisms and processes for (or intermediates useful in) the manufacture of products. Protection for individual products extends for varying periods in accordance with the expiration dates of patents in the various countries. The protection afforded, which may also vary from country to country, depends upon the type of patent, its scope of coverage and the availability of meaningful legal remedies in the country.\nMarket exclusivity is also sometimes provided by regulatory exclusivity, a period of time after the approval of a new drug during which the regulatory agency may not rely upon the innovator’s data to approve a competitor’s generic or biosimilar copy. Regulatory exclusivity can provide a market exclusivity period on a product that expires beyond the patent term.\nWhen these patent rights and other forms of exclusivity expire and generic versions of a medicine are approved and marketed, there are often substantial and rapid declines in the sales of the original innovative product. For further discussion of the impact of generic medicines on our business, refer to “—Competition” below.\nSpecific aspects of the law governing market patent protection and regulatory exclusivity for pharmaceuticals vary from country to country. The following summarizes key exclusivity rules in markets representing significant sales:\nUnited States\nIn the U.S., most of our key products are protected by patents with varying terms depending on the type of patent and the filing date. A significant portion of a product’s patent life, however, is lost during the time it takes an innovator company to develop and obtain regulatory approval of a new drug. As compensation at least in part for the lost patent term due to regulatory review periods, the innovator may, depending on a number of factors, apply to the government to restore lost patent term by extending the expiration date of one patent up to a maximum term of five years, provided that the extension cannot cause the patent to be in effect for more than 14 years from the date of drug approval.\nA company seeking to market an innovative pharmaceutical in the U.S. must submit a complete set of safety and efficacy data to the FDA. If the innovative pharmaceutical is a chemical product, the company files an NDA. If the medicine is a biological product, a BLA is filed. Both types of applications can receive certain periods of regulatory exclusivity as discussed below. An NDA or a BLA for a compound that is designated as an orphan drug can receive seven years of exclusivity for an orphan drug indication. During this period, the FDA generally may not approve another application for the same drug product for the same orphan use. A company may also earn six months of additional exclusivity for a drug where specific clinical studies are conducted at the written request of the FDA to study the use of the medicine to treat pediatric patients, and submission to the FDA is made prior to the loss of basic exclusivity. \nChemical products\nA competitor seeking to launch a generic substitute of a chemical innovative drug in the U.S. must file an ANDA with the FDA. In the ANDA, the generic manufacturer needs to demonstrate only “bioequivalence” between the generic substitute and the approved NDA drug. The ANDA relies upon the safety and efficacy data previously filed by the innovator in its NDA.\n4\nAn innovator company is required to list certain of its patents covering the medicine with the FDA in what is commonly known as the Orange Book. Absent a successful patent challenge, the FDA cannot approve an ANDA until after the innovator’s listed patents expire. However, after the innovator has marketed its product for four years, a generic manufacturer may file an ANDA and allege that one or more of the patents listed in the Orange Book under an innovator’s NDA is invalid, unenforceable, or will not be infringed by the generic product. This allegation is commonly known as a Paragraph IV certification. The innovator then must decide whether to file a patent infringement suit against the generic manufacturer. From time to time, ANDAs including Paragraph IV certifications are filed with respect to certain of our products. We evaluate these ANDAs on a case-by-case basis and, where warranted, file suit against the generic manufacturer to protect our patent rights.\nMedicines can also receive several types of regulatory exclusivity. An innovative chemical pharmaceutical product is entitled to five years of regulatory exclusivity in the U.S., during which the FDA cannot approve generic substitutes. If an innovator’s patent is challenged, a generic manufacturer may file its ANDA after the fourth year of the five-year regulatory exclusivity period. Our marketed chemical products include \nEliquis, Revlimid, Pomalyst, Sprycel, Zeposia, Camzyos, Sotyktu\n, \nAugtyro, Krazati, \nand\n Cobenfy\n.\nBiologic products (includes CAR-T cell therapy products)\nQualified innovative biological products receive 12 years of regulatory exclusivity, meaning that the FDA may not approve a biosimilar version until 12 years after the innovative biological product was first approved by the FDA. Our marketed biologic products include \nOpdivo\n, \nOpdivo Qvantig,\n \nOrencia,\n \nYervoy, Reblozyl, Opdualag, Breyanzi, Abecma \nand\n Abraxane.\nIn the U.S., medicines (chemically synthesized or biologically derived) may also receive an additional six months of market exclusivity (added to certain patent terms and regulatory exclusivities) if certain agreed-upon pediatric studies are completed by the applicant. \nThe increased likelihood of generic and biosimilar challenges to innovators’ intellectual property has increased the risk of loss of innovators’ market exclusivity. First, generic companies have increasingly sought to challenge innovators’ patents covering major pharmaceutical products. Second, statutory and regulatory provisions may limit the ability of an innovator company to prevent generic and biosimilar drugs from being approved and launched while patent litigation is ongoing. As a result of these developments, among others, it is not possible to predict the length of market exclusivity for a particular product with certainty based solely on the expiration of the relevant patent(s) or the current forms of regulatory exclusivity. \nEuropean Union\nPatents on pharmaceutical products are generally enforceable in the EU and, as in the U.S., may be extended for up to five years to compensate for the patent term lost during the regulatory review process, provided that the extension cannot cause the patent to be in effect for more than 15 years from the date of drug approval. Such extensions are granted on a country-by-country basis. The EU provides an additional six months of exclusivity added to the extended patent term if certain pediatric studies are completed by the applicant.\nThe primary route we use to obtain marketing authorization of pharmaceutical products in the EU is through the “centralized procedure.” This procedure is compulsory for certain pharmaceutical products, in particular those using biotechnological processes, and is also available for certain new chemical compounds and products. A company seeking to market an innovative pharmaceutical product through the centralized procedure must file a complete set of safety data and efficacy data as part of an MAA with the EMA. After the EMA evaluates the MAA, it provides a recommendation to the EC and the EC then approves or denies the MAA. \nAfter obtaining marketing authorization approval, a company must obtain pricing and reimbursement for the pharmaceutical product, which is typically subject to member state law. In certain EU countries, this process can take place simultaneously while the product is marketed but in other EU countries, this process must be completed before the company can market the new product. The pricing and reimbursement procedure can take months and sometimes years to complete.\nThroughout the EU, all products for which marketing authorizations have been filed after October and November 2005 are subject to an “8+2+1” regulatory exclusivity regime. Eight years after the innovator has received its first community authorization for a medicinal product, a generic company may file a MAA for that product with the health authorities. If the MAA is approved, the generic company may not commercialize the product until after either 10 or 11 years have elapsed from the initial marketing authorization granted to the innovator. The possible extension to 11 years is available if the innovator, during the first eight years of the marketing authorization, obtains an additional indication that is of significant clinical benefit in comparison with existing treatments. \n5\nIn contrast to the U.S., patents in the EU are not listed with regulatory authorities. Generic versions of pharmaceutical products can be approved after RDP expires, regardless of whether the innovator holds patents covering its drug. Thus, it is possible that an innovator may be seeking to enforce its patents against a generic competitor that is already marketing its product. In general, EU law treats chemically synthesized drugs and biologically derived drugs the same with respect to intellectual property and regulatory exclusivity. \nJapan\nIn Japan, patents on pharmaceutical products are enforceable and may be extended for up to five years to compensate for the patent term lost during the regulatory review process. Medicines of new chemical entities are generally afforded eight years of regulatory exclusivity for approved indications and dosage. This regulatory exclusivity could be extended if certain pediatric studies are completed by the applicant. Generic copies can receive regulatory approval after regulatory exclusivity and patent expirations. \nIn general, Japanese law treats chemically synthesized and biologically derived drugs the same with respect to intellectual property and regulatory exclusivity.\nRest of the World\nIn countries outside of the U.S., the EU and Japan, there are a variety of legal systems with respect to intellectual property and regulatory exclusivity of pharmaceuticals. Most other developed countries utilize systems similar to either the U.S. or the EU. Among developing countries, some have adopted patent laws and/or regulatory exclusivity laws, while others have not. Some developing countries have formally adopted laws in order to comply with WTO commitments, but have not taken steps to implement these laws in a meaningful way. Enforcement of WTO actions is a long process between governments, and there is no assurance of the outcome. Thus, in assessing the likely future market exclusivity of our innovative drugs in developing countries, we take into account not only formal legal rights but political and other factors as well.\nThe following chart shows our key products together with the year in which the earliest basic exclusivity loss (patent rights or regulatory exclusivity) is currently estimated to occur in the U.S., the EU and Japan (the “estimated minimum market exclusivity date”). We also sell our pharmaceutical products in other countries; however, data is not provided on a country-by-country basis because individual country revenues are not significant outside the U.S., the EU and Japan. Generally, the estimated minimum market exclusivity date in the table below pertains to the end of regulatory exclusivity or the COM patent expiration for the respective products and PTR if granted. In situations where there is only regulatory exclusivity without patent protection, a competitor could seek regulatory approval by submitting its own clinical study data to obtain marketing approval prior to the expiration of regulatory exclusivity.\n6\nWe estimate the minimum market exclusivity date for each of our products for the purpose of business planning only. The length of market exclusivity for any of our products is impossible to predict with certainty because of the complex interaction between patent and regulatory forms of exclusivity and the inherent uncertainties regarding patent litigation. There can be no assurance that a particular product will enjoy market exclusivity for the full period of time that appears in the estimate or that the exclusivity will be limited to the estimate.\n \nEstimated Minimum Market Exclusivity Date\nU.S.\nEU\n(p)\nJapan\nAbecma \n(idecabtagene vicleucel)\n2036\n2035\n2037\nAbraxane \n(paclitaxel)\n(a)\n^^\n^^\n^^\nAugtyro \n(repotrectinib)\n(b)\n2035\n++\n++\nBreyanzi \n(lisocabtagene maraleucel)\n(c)\n2033\n2033\n2033\nCamzyos \n(mavacamten)\n(d)\n2034\n2034\n++\nCobenfy \n(xanomeline and trospium chloride) \n(e)\n^^\n++\n++\nEliquis \n(apixaban)\n(f)\n2028\n^^\n2026\nKrazati \n(adagrasib)\n2037\n2038\n++\nOpdivo \n(nivolumab)\n2028\n2030\n2031\nOpdivo Qvantig (nivolumab and hyaluronidase-nvhy)\n(g)\n^^\n++\n++\nOpdualag \n(nivolumab and relatlimab-rmbw)\n(h)\n2034\n2033\n++\nOrencia \n(abatacept)\n(i)\n^^\n^^\n^^\nPomalyst/Imnovid \n(pomalidomide)\n(j)\n^^\n^^\n^^\nReblozyl \n(luspatercept-aamt)\n(k)\n2031\n2030\n++\nRevlimid \n(lenalidomide)\n(l)\n^^\n^^\n^^\nSotyktu \n(deucravacitinib)\n(m)\n2033\n2033\n2033\nSprycel \n(dasatinib)\n(n)\n^^\n^^\n^^\nYervoy \n(ipilimumab)\n2025\n2026\n2025\nZeposia \n(ozanimod)\n(o)\n2029\n2034\n++\n^^    See product footnote for more information.\n++  We do not currently market the product in the country or region indicated.\n(a)  For \nAbraxane\n in the U.S., EU, and Japan, generics have entered the market. \n(b)  For \nAugtyro\n in the U.S., a PTR application is pending and, if granted, the estimated patent expiry will be 2037.\n(c)  For \nBreyanzi\n in the U.S., a PTR application is pending and, if granted, the estimated patent expiry will be 2034.\n(d)  For \nCamzyos\n in the U.S., a PTR application is pending and, if granted, the estimated patent expiry will be 2036. In the EU, SPC applications are pending and, if granted, the estimated patent expiry would be 2038.\n(e)  For \nCobenfy\n in the U.S., we have been granted patents covering the combination of active ingredients in \nCobenfy\n, which expire in 2030. A PTR application is pending and, if granted, the estimated patent expiry will be 2033.\n(f)  For \nEliquis\n, in the U.S., multiple generic companies challenged the two patents listed in the FDA Orange Book. BMS, along with its partner Pfizer, settled with a number of these generic companies and won at the trial and appellate levels against others. Under the terms of previously executed settlement agreements, the generic companies with whom BMS settled are permitted to launch in 2028, subject to additional challenges. In the EU, the apixaban composition of matter patents and related SPCs expire in 2026. Generics have challenged the composition of matter patents and related SPCs in various jurisdictions and trials have taken place, or are scheduled to take place, in certain European countries. While these legal proceedings are pending, generic manufacturers have begun marketing generic versions of \nEliquis\n in certain EU countries and may seek to market generic versions of \nEliquis\n in other EU countries prior to the expiration date of apixaban patents and related SPCs. Refer to “Item 8. Financial Statements and Supplementary Data—Note 20. Legal Proceedings and Contingencies” for more information.\n(g)  For \nOpdivo Qvantig,\n the estimated minimum market exclusivity date of 2028 is based on the expiry of the COM patent for \nOpdivo\n and does not include any potential exclusivity resulting from pending patent applications relating to the \nOpdivo\n \nQvantig\n formulation and its use.\n(h)  For \nOpdualag\n in the U.S., a PTR application is pending and, if granted, the estimated patent expiry will be 2036. In the UK and Germany, SPC and pediatric (“PED”) applications are pending and, if both are granted, the estimated patent expiry will be 2038. In France, Italy and Spain, SPC and PED are granted and the estimated patent expiry is 2038.\n(i)  BMS is not aware of an \nOrencia\n biosimilar on the market in the U.S., EU or Japan. Formulation and additional patents expire in 2026 and beyond.\n(j)  For \nPomalyst\n in the U.S., we currently do not expect generic entry prior to the first quarter of 2026. In Europe, generics have entered the market. In Japan, the estimated minimum market exclusivity date is 2026 based on a method of use patent.\n(k)  For\n Reblozyl\n in the U.S. and Europe, the estimated minimum market exclusivity date is based on regulatory exclusivity. In the U.S., PTR on a method of treatment patent was granted, and the estimated patent expiry is 2033. In the EU, SPC on a method of treatment patent is granted, and the estimated patent expiry is 2034.\n(l)  For \nRevlimid,\n in the U.S., certain generic companies have begun marketing generic lenalidomide products pursuant to volume-limited licenses granted as part of litigation settlements. The licenses will no longer be volume-limited beginning on January 31, 2026. In the EU and Japan, generics have entered the market.\n(m)  For \nSotyktu\n in the U.S., a PTR application is pending and, if granted, the estimated patent expiry will be 2036. In the EU, SPC applications are pending and, if granted, the estimated patent expiry would be 2038. In Japan, a PTR application is also pending and, if granted, the estimated patent expiry will be 2037.\n(n)  For \nSprycel,\n in the U.S., EU and Japan, generics have entered the market.\n(o)  For \nZeposia\n, in the U.S., a PTR application is pending and if granted, the estimated patent expiry will be 2033. Litigation is ongoing with generic companies who have challenged one of the patents listed in the FDA Orange Book. Refer to “Item 8. Financial Statements and Supplementary Data—Note 20. Legal Proceedings and Contingencies” for more information.\n(p)  Estimated minimum market exclusivity dates for EU countries are based on the UK, France, Germany, Italy, and Spain.\n7\nResearch and Development\nR&D is critical to our long-term competitiveness. We concentrate our R&D efforts in the following disease areas with significant unmet medical needs: oncology and hematology with novel modalities in cell therapies, protein degraders, ADCs and radiopharmaceuticals; immunology with a focus on establishing new standards of care in pulmonology, rapidly advancing cell therapy into immunology diseases and transformational programs to control inflammation, reset immune memory and promote homeostasis in dermatology and rheumatology disorders; cardiovascular diseases by leveraging deep expertise across thrombotic diseases, heart failures and cardiomyopathies; and neuroscience with a focus on developing new treatments in neuropsychiatry and neurodegeneration. Our R&D pipeline includes potential medicines in various modalities including small (chemically synthesized) molecules and large (protein) molecules—also known as biologics—and also degraders, T-cell, millamolecules, ADCs, and cell therapies. In addition to discovering and developing new molecular entities, we look for ways to expand the value of existing products through new indications and formulations that can provide additional benefits to patients.\nIn order for a new drug to reach the market, industry practice and government regulations in the U.S., the EU and most foreign countries provide for the determination of a drug’s effectiveness and safety through preclinical tests and controlled clinical evaluation. The clinical development of a potential new drug typically includes Phase I, Phase II and Phase III clinical studies that have been designed specifically to support an application for regulatory approval for a particular indication, assuming the studies are successful.\nPhase I clinical studies involve a small number of healthy volunteers or patients suffering from the indicated disease to test for safety and proper dosing. Phase II clinical studies involve a larger patient population to investigate side effects, efficacy and optimal dosage of the drug candidate. Phase III clinical studies are conducted to confirm Phase II results in a significantly larger patient population over a longer term and to provide reliable and conclusive data regarding the safety and efficacy of a drug candidate. Although regulatory approval is typically based on the results of Phase III clinical studies, there are times when approval can be granted based on data from earlier studies.\nWe consider our registrational studies to be our significant R&D programs. These programs may include both investigational compounds in Phases II and III development for initial indications, or marketed products that are in development for additional indications or formulations. \nDrug development is time consuming, expensive and risky. The R&D process (i.e., target identification to major market approval) typically takes about fifteen years. Drug candidates can fail at any stage of the process, and even late-stage product candidates sometimes fail to receive regulatory approval. According to the KMR Group, based on industry success rates from 2019-2023, approximately 93% of small molecules that enter Phase I development fail to achieve regulatory approval. Small molecules that enter Phase II development have a failure rate of approximately 81% while approximately 33% of Phase III small molecules fail to achieve approval. For biologics, the failure rate is approximately 89% from Phase I development, approximately 72% from Phase II development and approximately 23% from Phase III.\nR&D expenses are comprised of the following main categories: (i) research, which includes costs to support the discovery and development of new molecular entities through pre-clinical studies; (ii) drug development, which includes costs to support clinical development of potential new products, including expansion of indications for existing products through Phase I, Phase II and Phase III clinical studies and (iii) Other, which includes costs to support manufacturing development of pre-approved products, medical support of marketed products, IPRD impairment charges, acquisition-related charges and proportionate allocations of enterprise-wide costs including facilities, information technology, and other appropriate costs. Acquired IPRD include upfront payments, contingent milestone payments in connection with asset acquisitions or in-license arrangements of third-party intellectual property rights, as well as any upfront and contingent milestones payable by BMS to alliance partners prior to regulatory approval. Our R&D expenses were $11.2 billion in 2024, $9.3 billion in 2023 and $9.5 billion in 2022. Acquired IPRD expenses were $13.4 billion in 2024, $913 million in 2023 and $815 million in 2022. Acquired IPRD expenses in 2024 included $12.1 billion related to the acquisition of Karuna, as further described in “Item 8. Financial Statements and Supplementary Data—Note 4. Acquisitions, Divestitures, Licensing and Other Arrangements.\"\nWe manage our R&D programs on a product portfolio basis, investing resources in each stage of R&D from early discovery through late-stage development. We continually evaluate our portfolio of R&D assets to ensure that there is an appropriate balance of early-stage and late-stage programs to support the future growth of the Company.\nOur drug discovery and development work takes place across a network of state-of-the-art facilities worldwide. We have continued our investment in our existing sites and the expansion of our manufacturing capabilities. For example, we opened an R&D facility in Cambridge, Massachusetts in 2023 and Hyderabad, India in 2024, and we are opening an R&D facility in San Diego, California (planned for 2026). In addition, in support of a continued investment in our cell therapy portfolio, we continue expanding our manufacturing capabilities through the construction of new state-of-the-art cell therapy manufacturing facilities in Devens, Massachusetts, which was completed in 2023, as well as in Leiden, Netherlands and Libertyville, Illinois which are currently ongoing. \n8\nWe supplement our internal drug discovery and development programs with acquisitions, alliances and collaborative agreements which help us bring new molecular agents, capabilities and platforms into our pipeline. We have a broad pipeline with over \n40\n unique assets in development. Our pipeline was built by coupling internal research and development programs with a distributed research and development model, which focused on identifying and supporting the development of disruptive and innovative therapies outside the company through a broad network of external partnerships. Management continues to emphasize leadership, innovation, productivity and quality as strategies for success in our R&D activities.\nListed below are our clinical studies and approved indications for our marketed products in the related therapeutic area as of February 6, 2025. Whether any of the listed compounds ultimately becomes a marketed product depends on the results of clinical studies, the competitive landscape of the potential product’s market, reimbursement decisions by payers and the manufacturing processes necessary to produce the potential product on a commercial scale, among other factors. There can be no assurance that we will seek regulatory approval of any of these compounds or that, if such approval is sought, it will be obtained. There is also no assurance that a compound which gets approved will be commercially successful. At this stage of development, we cannot determine all intellectual property issues or all the patent protection that may, or may not, be available for these investigational compounds.\n9\nHEMATOLOGY\n   PHASE I\n   PHASE II\n   PHASE III\n   APPROVED INDICATIONS\nInvestigational Compounds\nBCL6 LDD\n--Lymphoma\nCD33-GSPT1 ADC\n--Acute Myeloid Leukemia\nCK1α Degrader\n--Hematologic Malignancies\nDual Targeting BCMAxGPRC5D CAR T\n--Relapsed/Refractory Multiple Myeloma\nHbF Activating CELMoD\n--Sickle Cell Disease\nAdditional Indications\nBREYANZI\n--Relapsed/Refractory Marginal Zone Lymphoma\nREBLOZYL\nª\n--A-Thalassemia \nInvestigational Compounds\narlo-cel (GPRC5D CAR T)\n--Relapsed/Refractory Multiple Myeloma\ngolcadomide\n--Relapsed/Refractory Follicular Lymphoma\nAdditional Indications\nREBLOZYL\nª\n--1L NTD Myelodysplastic Syndrome Associated Anemia\n--1L TD Myelofibrosis Associated Anemia\nInvestigational Compounds\narlo-cel (GPRC5D CAR T)\n--2-4L Multiple Myeloma\ngolcadomide\n--High Risk 1L Large B-cell Lymphoma\niberdomide\n--2L+ Multiple Myeloma\n--Post-Autologous Stem Cell Therapy Maintenance Newly Diagnosed Multiple Myeloma\nmezigdomide\n \n--2L+ Multiple Myeloma Kd --2L+ Multiple Myeloma Vd\nABECMA\n--3L+ Triple-Class Exposed Relapsed/Refractory Multiple Myeloma\nBREYANZI\n--2L+ Large B-cell Lymphoma\n--3L+ CLL/SLL\n--3L+ FL\n--3L+ MCL\nEMPLICITI\n + \nPOMALYST/IMNOVID\n--Relapsed/Refractory Multiple Myeloma \nEMPLICITI\n + \nREVLIMID\n--Relapsed/Refractory Multiple Myeloma\nIDHIFA\n--\nRelapsed/Refractory Acute Myeloid Leukemia\nINREBIC\n--Myelofibrosis\nONUREG\n--Post-Induction Acute Myeloid Leukemia Continued Treatment/Maintenance\nOPDIVO\nª\n--Relapsed/Refractory Classical Hodgkin Lymphoma\nPOMALYST/IMNOVID\n--Relapsed/Refractory Multiple Myeloma\n--AIDS related Kaposi Sarcoma \n--HIV-negative Kaposi Sarcoma\nREBLOZYL\nª\n--Transfusion-Dependent Beta-Thalassemia Associated Anemia\n--MDS RS or MDS/MPN-RS-T Adult Patients and Previously Treated with ESA --MDS Associated Anemia in ESA naïve patients who may require RBC Transfusion\nREVLIMID\n--Mantle Cell Lymphoma\n--MDS\n--Multiple Myeloma\n--Follicular Lymphoma\n--Marginal Zone Lymphoma\nSPRYCEL\n--1L CML\n--Acute Lymphoblastic Leukemia with Resistance or Intolerance to Prior Therapy\n--Refractory CML\n10\nONCOLOGY\n   PHASE I\n   PHASE II\n   PHASE III\n   APPROVED INDICATIONS\nInvestigational Compounds\nAnti-CCR8\n--Solid Tumors\nBMS-986460\n--Prostate Cancer\nBMS-986463\n--Solid Tumors\nBMS-986482\n--Solid Tumors\nBMS-986484\n--Solid Tumors\nBMS-986488\n--Solid Tumors\nBMS-986490\n--Solid Tumors\nHELIOS CELMoD\n--\nSolid Tumors\niza-bren (EGFRxHER3 ADC)\nª\n--1L NSCLC#\n--Metastatic NSCLC\n--Solid Tumors#\nPRMT5 Inhibitor\n--\nSolid Tumors\nRYZ101\n--Extensive Stage SCLC\n--HR+/HER2- Unresectable Metastatic Breast Cancer\nRYZ801\n--Hepatocellular Carcinoma\nSOS1 Inhibitor\n--Solid Tumors\nAdditional Indications\nKRAZATI\nª\n--\n1L NSCLC PD-L1<50%\nAdditional Indications\nKRAZATI\nª\n--1L NSCLC PD-L1≥50%\n--2L Colorectal Cancer\nOPDIVO\nª\n--Adjuvant Hepatocellular Carcinoma\n--Peri-adjuvant Muscle Invasive Urothelial Carcinoma\nOPDIVO\nª\n + YERVOY\nª\n--1L Hepatocellular Carcinoma \nOPDUALAG\nª\n--Adjuvant Stage III/IV Melanoma\nInvestigational Compounds\nAR LDD\n--Metastatic Castration-Resistant Prostate Cancer\natigotatug (Anti-Fucosyl GM1) + nivolumab\n--1L Extensive Stage SCLC\nnivolumab + relatlimab HD\nª\n--1L NSCLC PD-L1≥1%\nRYZ101\n--2L+ SSTR2+ Gastroenteropancreatic Neuroendocrine Tumors\nsubcutaneous nivolumab + relatlimab + rHuPH20\nª\n--1L Melanoma\nABRAXANE\n--Gastric (Japan Only)\n--Locally Advanced or Metastatic NSCLC\n--Metastatic Breast Cancer\nAUGTYRO\nª\n--\nROS1+ NSCLC\n--NTRK-Positive Locally Advanced or Metastatic Solid Tumors\nKRAZATI\nª\n--\n2L+ KRASG12C-mutated Advanced NSCLC\n--KRASG12C-mutated CRC after prior treatment with fluoropyrimidine-, oxaliplatin-, and irinotecan-based chemotherapy\nOPDIVO\nª\n-\n-\nMetastatic Melanoma\n--1L Metastatic Gastric, Gastroesophageal Junction, and Esophageal Adenocarcinoma\n--1L Metastatic Esophageal\n--1L MIUC cis-eligible\n--Adjuvant Melanoma\n--Adjuvant Urothelial Carcinoma\n--Adjuvant Esophageal/Gastroesophageal\n--Neoadjuvant NSCLC\n--Perioperative NSCLC\n--Previously treated advanced RCC\n--Previously treated Gastric cancer (Japan)\n--Previously treated Metastatic Head & Neck\n--Previously treated Metastatic MSI-High CRC\n--Previously treated Metastatic NSCLC\n--Previously treated Metastatic Urothelial Cancer\n--Previously treated Metastatic Esophageal Cancer\nOPDIVO QVANTIG\n--Indicated for subcutaneous use in most previously approved adult, solid tumor \nOpdivo\n indications \nOPDIVO\nª\n + c\nabozantinib\nª\n-\n-1L Advanced RCC\nOPDIVO\nª\n + YERVOY\nª\n--1L Metastatic Melanoma\n--1L Mesothelioma\n--1L Metastatic NSCLC\n--1L Advanced RCC\n--1L+ MSI-High CRC\n--Previously treated Metastatic MSI-High CRC\n--Previously treated HCC\n--1L Esophageal\nOPDUALAG\n-\n-1L Melanoma\nYERVOY\nª\n-\n-Adjuvant Melanoma\n--Metastatic Melanoma\n11\nIMMUNOLOGY\n   PHASE I\n   PHASE II\n   PHASE III\n   APPROVED INDICATIONS\nInvestigational Compounds\nBMS-986454\n--Autoimmune Disease\nCD19 NEX T\n--Autoimmune Diseases\n--Severe Refractory Systemic Lupus Erythematosus \nIL2-CD25\n--Autoimmune Disease\nPKCθ Inhibitor\nª\n--Autoimmune Disease\nAdditional Indications\nSOTYKTU \n--Discoid Lupus Erythematosus\nInvestigational Compounds\nafimetoran\n--Systemic Lupus Erythematosus\nBMS-986322 (TYK2 Inhibitor)\n--Moderate-to-Severe Psoriasis\nAdditional Indications\nSOTYKTU\n \n--Psoriatic Arthritis\n--Systemic Lupus Erythematosus\n--Sjögren's Syndrome\nInvestigational Compounds\nadmilparant (LPA1 Antagonist)\n--Idiopathic Pulmonary Fibrosis\n--Progressive Pulmonary Fibrosis\nobexelimab\nª\n--IgG4-Related Disease\nORENCIA\n--Moderate-to-Severe JIA Intravenous\n--Moderate-to-Severe JIA Subcutaneous\n--Psoriatic Arthritis\n--Moderate-to-Severe RA Auto injector\n--Moderate-to-Severe RA Intravenous\n--Moderate-to-Severe RA Subcutaneous\n--Prophylaxis of Acute Graft versus Host Disease\nSOTYKTU\n \n--Adults with Moderate-to-Severe Plaque Psoriasis\nZEPOSIA\n--Relapsing forms of Multiple Sclerosis \n--Moderate-to-Severe UC\nCARDIOVASCULAR\n   PHASE II\n   PHASE III\n   APPROVED INDICATIONS\nInvestigational Compounds\nMYK-224\n--Heart Failure with Preserved Ejection Fraction\nAdditional Indications\nCAMZYOS\n--Non-Obstructive Hypertrophic Cardiomyopathy\nInvestigational Compounds\nmilvexian\nª\n--Acute Coronary Syndrome#\n--Atrial Fibrillation#\n--Secondary Stroke Prevention#\nCAMZYOS \n--Symptomatic NHYA Class II-III Obstructive Hypertrophic Cardiomyopathy\nELIQUIS\n--Stroke Risk Reduction in Non-Valvular Atrial Fibrillation\n--Treatment of Venous Thromboembolism and Risk Reduction after Initial Therapy\n--Prophylaxis of Deep Vein Thrombosis after Hip or Knee Replacement Surgery\n12\nNEUROSCIENCE\n   PHASE I\n   PHASE II\n   PHASE III\n   APPROVED INDICATIONS\nInvestigational Compounds\nBMS-986495\nª\n--\nNeurodegenerative Diseases\nCD19 NEX T\n--Multiple Sclerosis\n--Myasthenia Gravis\neIF2B Activator\n--Alzheimer's Disease\nTRPC4/5 Inhibitor\n--Mood and Anxiety Disorders\nInvestigational Compounds\nAnti-MTBR Tau\n--Alzheimer's Disease\nFAAH/MGLL Dual Inhibitor\n--Alzheimer's Disease Agitation\n--Multiple Sclerosis Spasticity\nAdditional Indications\nCOBENFY\n--Adjunctive Schizophrenia\n--Psychosis in Alzheimer's Disease\nCOBENFY\n--Adults with Schizophrenia\nNote: Above pipeline excludes clinical collaborations\nª\n \nDevelopment Partnerships: \nAUGTYRO: \nZai Lab; BMS-986495: Prothena; \nCOBENFY\n: Zai Lab; iza-bren (EGFRxHER3 ADC): SystImmune; \nKRAZATI\n: Zai Lab; milvexian: Johnson & Johnson; obexelimab: Zenas BioPharma; \nOPDIVO\n, \nYERVOY\n, \nOPDUALAG, \nnivolumab + relatlimab HD, Anti-CCR8 + nivolumab: Ono; PKCθ Inhibitor: Exscientia; \nREBLOZYL\n: Merck; rHuPH20: Halozyme\n#\nPartner-run study\nThe following are our registrational study readouts anticipated through 2025/2026:\nOncology\nImmunology\nAsset\nTumor\nTrial\nAsset\nDisease\nTrial\nOpdivo\nAdjuvant HCC\nCheckMate -9DX\nSotyktu\nSLE\nPOETYK SLE-1\nOpdivo\nPeri-adjuvant MIUC\nCA017-078\nSotyktu\nSLE\nPOETYK SLE-2\nOpdualag\nAdjuvant Stage III/IV Melanoma\nRELATIVITY-098\nadmilparant\nIPF\nALOFT-IPF\nOpdualag\n1L Melanoma SC\nRELATIVITY-127\nobexelimab\nIgG4-Related Disease\nINDIGO\nKrazati\n2L CRC\nKRYSTAL-10\nKrazati\n2L+ Mutated NSCLC\nKRYSTAL-12*\nCardiovascular\nRYZ101\n2L+ SSTR2+ GEP-NETs\nACTION-1\nAsset\nDisease\nTrial\nCamzyos\nnHCM\nODYSSEY-HCM\nHematology\nmilvexian\nSSP\nLIBREXIA-STROKE\nAsset\nDisease\nTrial\nmilvexian\nACS\nLIBREXIA-ACS\nBreyanzi\nRelapsed/Refractory MZL\nTRANSCEND\narlo-cel\nRRMM\nQUINTESSENTIAL\nNeuroscience\niberdomide\n2L+ MM\nEXCALIBER\nAsset\nDisease\nTrial\nmezigdomide\n2L+ MM Vd\nSUCCESSOR-1\nCobenfy\nAdjunctive Schizophrenia\nARISE\nmezigdomide\n2L+ MM Kd\n SUCCESSOR-2\nCobenfy\nPsychosis in Alzheimer's Disease\nADEPT-1\nReblozyl\nTD & NTD A-Thalassemia\nCA056-015#\nCobenfy\nPsychosis in Alzheimer's Disease\nADEPT-2\nReblozyl\n1L TD MF Associated Anemia\nINDEPENDENCE\nCobenfy\nPsychosis in Alzheimer's Disease\nADEPT-4\n* Confirmatory Trial\n# Ex-U.S. Study\n13\nAlliances\nWe enter into alliance arrangements with third parties for the development and commercialization of specific products or drug candidates in our therapeutic areas of focus. Alliances may be structured as co-development, co-commercialization, licensing or joint venture arrangements. These arrangements may include upfront payments; option payments to develop or commercialize a specific asset or technology; payments for various developmental, regulatory and sales-based performance milestones; royalties; cost reimbursements; profit sharing; and equity investments. Provisions in our alliance arrangements lessen our investment risk for compounds not leading to revenue generating products but reduce the profitability of marketed products due to profit sharing or royalty payments. We actively pursue such arrangements and view alliances as an important complement to our own discovery, development and commercialization activities.\nOur alliance arrangements contain customary early termination provisions following material breaches, bankruptcy or product safety concerns. Such arrangements also typically provide for termination by BMS without cause. The amount of notice required for early termination generally ranges from immediately upon notice to 180 days after receipt of notice. Termination immediately upon notice is generally available where the other party files a voluntary bankruptcy petition or if a material safety issue arises with a product such that the medical risk/benefit is incompatible with the welfare of patients to continue to develop or commercialize the product. Termination with a notice period is generally available where an involuntary bankruptcy petition has been filed and has not been dismissed, a material breach by a party has occurred and not been cured or where BMS terminates without cause. Sometimes, BMS's right to terminate without cause may only be exercisable after a specified period of time has elapsed after the alliance agreement is signed. Our alliances typically do not otherwise contain provisions that provide the other party the right to terminate the alliance.\nWe typically do not retain any rights to another party's product or intellectual property after an alliance terminates. The loss of rights to one or more products that are marketed and sold by us pursuant to an alliance could be material to our results of operations and the loss of cash flows caused by such loss of rights could be material to our financial condition and liquidity. Alliance agreements may be structured to terminate on specific dates, upon the product's patent expiration date or without an expiry date. Profit sharing payments typically have no expiration date while royalty payments typically cease upon loss of market exclusivity, including patent expiration.\nRefer to “Item 8. Financial Statements and Supplementary Data—Note 3. Alliances” for further information on our most significant alliance agreements as well as other alliance agreements.\nMarketing, Distribution and Customers\nWe promote the appropriate use of our products directly to healthcare professionals and organizations such as doctors, nurse practitioners, physician assistants, pharmacists, technologists, hospitals, PBMs and MCOs. We also provide information about the appropriate use of our products to consumers in the U.S. through direct-to-consumer print, radio, television and digital advertising and promotion. In addition, we sponsor general advertising to educate the public about our innovative medical research and corporate mission. For a discussion of the regulation of promotion and marketing of pharmaceuticals, refer to “—Government Regulation” below.\nThrough our field sales and medical organizations, we explain the risks and benefits of the approved uses of our products to medical professionals. We work to gain access for our products on formularies and reimbursement plans (lists of recommended or approved medicines and other products), including Medicare Part D plans, by providing information about the clinical profiles of our products. Our marketing and sales of prescription pharmaceuticals is limited to the approved uses of the particular product, but we continue to develop scientific data and other information about potential additional uses of our products and provide such information as scientific exchange at scientific congresses or we share information about our products in other appropriate ways, including the development of publications, or in response to unsolicited inquiries from doctors, other medical professionals and MCOs.\nOur operations include several marketing and sales organizations. Each product marketing organization is supported by a sales force, which is responsible for selling one or more products. We also have marketing organizations that focus on certain classes of customers such as managed care entities or certain types of marketing tools, such as digital or consumer communications. Our sales forces focus on communicating information about new approved products or uses, as well as approved uses of established products, and promotion to physicians is increasingly targeted at physician specialists who treat the patients in need of our medicines.\n14\nOur products are sold principally to contracted wholesalers, specialty distributors, specialty pharmacies, and to a lesser extent, retailers, hospitals, clinics and government agencies. \nRevlimid\n and \nPomalyst\n are distributed in the U.S. primarily through contracted pharmacies under the Lenalidomide REMS (\nRevlimid\n) and \nPomalyst\n REMS programs, respectively. These are proprietary, mandatory risk-management distribution programs tailored specifically to provide for the safe and appropriate distribution and use of \nRevlimid\n and \nPomalyst\n. Internationally, \nRevlimid\n and \nImnovid\n are distributed under mandatory risk-management distribution programs tailored to meet local authorities’ specifications to provide for the product’s safe and appropriate distribution and use. \nCamzyos\n is only available through the \nCamzyos\n REMS Program. Product distribution is limited to REMS certified pharmacies, and enrolled pharmacies must only dispense to patients who are authorized to receive \nCamzyos\n. These programs may vary by country and, depending upon the country and the design of the risk-management program, the product may be sold through hospitals or retail pharmacies. Refer to “Item 8. Financial Statements and Supplementary Data—Note 2. Revenue” for gross revenues to the three largest pharmaceutical wholesalers in the U.S. as a percentage of our global gross revenues.\nOur U.S. business has DSAs with substantially all of our direct wholesaler and distributor customers that allow us to monitor U.S. wholesaler and distributor inventory levels and requires those wholesalers and distributors to maintain inventory levels that are no more than one month of their demand. The DSAs, including those with our three largest wholesalers, expire in June 2027 subject to certain termination provisions.\nOur non-U.S. businesses have significantly more direct customers. Information on available direct customer product level inventory and corresponding out-movement information and the reliability of third-party demand information varies widely. We limit our direct customer sales channel inventory reporting to where we can reliably gather and report inventory levels from our customers.\nIn a number of countries outside of the U.S., we contract with distributors to support certain products. The services provided by these distributors vary by market, but may include distribution and logistics; regulatory and pharmacovigilance; and/or sales, advertising or promotion.\nCompetition\nThe markets in which we compete are generally broad-based and highly competitive. We compete with other worldwide research-based drug companies, many smaller research companies with more limited therapeutic focus and generic drug manufacturers. Important competitive factors include product efficacy, safety and ease of use, price and demonstrated cost-effectiveness, marketing effectiveness, product labeling, customer service and R&D of new products and processes. Sales of our products can be impacted by new studies that indicate a competitor’s product is safer or more effective for treating a disease or particular form of disease than one of our products. Our revenues also can be impacted by additional labeling requirements relating to safety or convenience that may be imposed on products by the FDA or by similar regulatory agencies in different countries. If competitors introduce new products and processes with therapeutic or cost advantages, our products can be subject to progressive price reductions, decreased volume of sales or both.\nAdvancements in treating cancer with IO therapies continue to evolve at a rapid pace. Our IO products, particularly \nOpdivo\n, operate in a highly competitive marketplace. In addition to competing for market share with other IO products in approved indications such as lung cancer and melanoma, we face increased competition from existing competing IO products that receive FDA approval for additional indications and for new IO agents that receive FDA approval and enter the market. Furthermore, as therapies combining different IO products or IO products with existing chemotherapy or targeted therapy treatments are investigated for potential expanded approvals, we anticipate that our IO products will continue to experience intense competition.\nAnother competitive challenge we face is from generic pharmaceutical manufacturers. In certain countries, including the U.S. and in the EU, the regulatory approval process exempts generics from costly and time-consuming clinical studies to demonstrate their safety and efficacy, allowing generic manufacturers to rely on the safety and efficacy of the innovator product. As a result, generic pharmaceutical manufacturers typically invest far less in R&D than research-based pharmaceutical companies and therefore can price their products significantly lower than branded products. Accordingly, when a branded product loses its market exclusivity, it normally faces intense price competition from generic forms of the product. Upon the expiration or loss of market exclusivity on a product, we can lose the major portion of that product's revenue in a very short period of time.\nAfter the expiration of exclusivity, the rate of revenue decline of a product varies by country. In general, the decline in the U.S. market is more rapid than in most other developed countries, though we have observed rapid declines in a number of EU countries as well. Also, the declines in developed countries tend to be more rapid than in developing countries. The rate of revenue decline after the expiration of exclusivity has also historically been influenced by product characteristics. For example, drugs that are used in a large patient population (e.g., those prescribed by key primary care physicians) tend to experience more rapid declines than drugs in specialized areas of medicine (e.g., oncology). Drugs that are more complex to manufacture (e.g., sterile injectable products) usually experience a slower decline than those that are simpler to manufacture.\n15\nIn certain countries outside the U.S., patent protection is weak or nonexistent and we are challenged by generic versions shortly after we launch our innovative products. In addition, generic pharmaceutical companies may introduce a generic product before exclusivity has expired, and before the resolution of any related patent litigation. For more information about market exclusivity, refer to “—Products, Intellectual Property and Product Exclusivity.”\nWe believe our long-term competitive position depends upon our success in discovering and developing innovative, cost-effective products that serve unmet medical needs, along with our ability to manufacture products efficiently and to market them effectively in a highly competitive environment.\nPricing, Price Constraints and Market Access\nOur medicines are priced based on a number of factors, including the value of scientific innovation for patients and society in the context of overall health care spend, economic factors impacting health care systems’ ability to provide appropriate and sustainable access and the necessity to sustain our investment in innovation platforms to address unmet medical needs. Central to price is the clinical value that this innovation brings to the market, the current landscape of alternative treatment options and the goals of ensuring appropriate patient access to this innovation and sustaining investment in creative platforms. We continue to explore new pricing approaches to ensure that patients have access to our medicines. Enhancing patient access to medicines is a priority for us. We are focused on: offering creative tiered pricing and patient support programs to optimize access while protecting innovation; advocating for sustainable healthcare policies and infrastructure, leveraging advocacy/payer’s input and utilizing collaborations as appropriate; and improving access to care and supportive services for vulnerable patients through collaborations and demonstration projects. \nAn important factor on which the pricing of our medicines depends is government regulation. We have been subject to increasing international and domestic efforts by various governments to implement or strengthen measures to regulate pharmaceutical market access and product pricing and payment. In the U.S., we are required to provide discounts on purchases of pharmaceutical products under various federal and state healthcare programs. Federal government officials and legislators continue to face intense pressure from the public to manage the perceived high cost of pharmaceuticals and have responded by pursuing legislation, such as the IRA and other rules that claim to potentially further reduce the cost of drugs for the federal government and other stakeholders. For further discussion on the IRA, refer to “Item 1. Business—Government Regulation.” We are also required to comply with state laws that seek additional transparency into the cost of prescription drugs. We are monitoring efforts by states to seek additional rebates and limit state spending on drugs in light of budget pressures. These international, federal and state legislative and regulatory developments could create new constraints on our ability to set prices and/or impact our market access in certain areas. For further discussion on the pricing pressure and its risk, refer to “Item 1. Business—Government Regulation” and “",
    "item1a": "Item 1A—Risk Factors—\nInformation Technology and Cybersecurity Risks\n—We are dependent on information technology and our systems and infrastructure face certain risks, including from cybersecurity incidents and data leakage.”\nGovernance\nThe Company’s cybersecurity and data privacy programs are implemented and overseen by the \nCompany’s Chief Information Security Officer (“CISO”), the Executive Vice President, Chief Digital and Technology Officer, and senior management.\n The CISO reports to the Chief Digital & Technology Officer, who in turn reports to the CEO. Collectively, our CISO and senior management team have extensive experience in information security and information technology risk management, including cybersecurity. Our CISO has led our enterprise-wide cybersecurity risk management, strategy, policy, standards and processes since 2018, and t\nhe information security team responsible for managing and implementing the Company’s cybersecurity and data privacy programs has many years of valuable business experience effectively addressing cybersecurity risks and developing related robust policies and procedures.\nOur \nAudit Committee\n, which consists solely of independent directors, oversees the Company’s overall enterprise risk assessment and risk management policies and guidelines, including risks related to cybersecurity matters.\n Our Audit Committee reviews, discusses with management at least annually and oversees the Company’s information security and data protection programs. In particular, the Audit Committee receives periodic updates from the CISO, internal audit function and other members of management on significant cybersecurity and data privacy threats to our systems and the potential impact on the Company’s business, financial results, operations, and reputation, risk management strategies, including information governance and security policies and programs, program assessments, planned improvements, major legislative and regulatory developments that could materially impact the Company’s cybersecurity and data privacy policies and programs, and status of information security initiatives, including an appropriate threat assessment relating to information technology risks. After each such update, the Chair of the Audit Committee updates the full Board. The Board also receives similar cybersecurity updates directly from the CISO and other members of management at least annually, and as needed from time to time\n.",
    "item1b": "Item 1B.\nUNRESOLVED STAFF COMMENTS.\nNone.",
    "item1c": "Item 1C.\nCYBERSECURITY\nRisk Management and Strategy\nThe Company manages cybersecurity risk as part of our overall enterprise risk management strategy, which is overseen by the Audit Committee and the Board.\n The Company employs robust cybersecurity and data privacy programs that are designed to assess, identify and manage material risks from cybersecurity threats. These programs are independently assessed every three years against the U.S. National Institute of Standards and Technology Cybersecurity Framework (\"NIST\").\nWe are constantly evolving our cyber defenses to minimize impacts from cyber threats by using a multi-pronged approach that helps safeguard our assets and data. We are particularly focused on addressing emerging cybersecurity risks, including human risk, as phishing attacks remain one of the most common causes of data breaches; third-party supply chain risks, as threat actors continue to target supply chains to compromise a greater number of victims; and geopolitical risk, as tensions and conflicts around the world are often accompanied by an increase in sabotage, espionage and cyber attacks. As threat actors frequently target employees to gain access to information and systems, we have a comprehensive global human risk management program that educates our workforce on threats they face as a first line of defense, and includes elements addressing phishing, malware, data handling, device security, cybersecurity education, password security, internet browsing and defenses to physical threats. Our employees are exposed to data-driven cybersecurity awareness campaigns and annual training in order to keep pace with industry standards, evolving challenges and innovative solutions with respect to information security, data privacy, and cybersecurity risks to the organization. In many regions, our employees receive a monthly snapshot of their cyber behaviors and are given a rating for their cyber vigilance. Additionally, we employ a multi-layered approach in our application of cybersecurity technologies to help safeguard our systems, networks, and data from potential cybersecurity threats. For companies that we acquire, our integration plans include, where appropriate, workable timelines for alignment on information security, data privacy, cybersecurity and employee education.\nTo support our preparedness, we have a cybersecurity incident response plan (“CIRP”) that we regularly update as business needs and the security landscapes change. In the event of a cybersecurity incident, our incident response team refers to our CIRP and existing management internal controls and disclosure processes. Pursuant to this process, designated personnel are responsible for assessing the severity of the incident and any associated threats, containing and resolving the incident as quickly as possible, managing any damage to the Company’s systems and networks, minimizing the impact on the Company’s stakeholders, analyzing and executing upon internal reporting obligations, escalating information about the incident to senior management, as appropriate, and performing post-incident analysis and program enhancements, as needed. We perform multiple tabletop exercises across various levels of the Company each year to test our incident response procedures, enhance our resiliency by seeking to ensure business continuity during potential extended digital outages, identify improvement opportunities and increase employee awareness and preparedness. These tabletop exercises focus on various aspects of cybersecurity events, including patient and employee impact, operational resilience and effectiveness and communication coordination.\nWe engage with third parties to separately conduct cyber assessments on a recurring basis and assist with containment and remediation efforts.\n In addition, third-party technology and analytics are utilized to identify potential vulnerabilities. We recognize that third parties that provide services to the Company can be subject to cybersecurity incidents that could impact the Company. To manage third-party risk, we \nmaintain a third-party risk management program\n, which is designed to assess the security controls of our third parties. The assessment methodology is based on risk and relies on the data, access, connectivity, and criticality of the services that the third-party offers.\n As noted, we also conduct tabletop exercises to identify improvement opportunities in our supply chain resilience.\nWe maintain relationships with law enforcement, government agencies, forensic investigators, and legal counsel to inform our cybersecurity and data privacy programs.\n35\nWhile we and our third-party vendors are regularly subject to cybersecurity attacks and incidents, a\ns of December 31, 2024 and through the date of this filing, we are not aware of any material cybersecurity incidents that have impacted the Company in the last three years.\n However, we have been the target of cyber attacks and expect them to continue as cybersecurity threats have been rapidly evolving in sophistication and becoming more prevalent in the industry. We face risks of incidents, whether through cyber attacks or cyber intrusions through the Cloud, the Internet, phishing attempts, ransomware and other forms of malware, computer viruses, email attachments, extortion, and other scams. Although we make efforts to maintain the security and integrity of our information technology systems, these systems and the proprietary, confidential and personal information that resides on or is transmitted through them, are subject to the risk of a cybersecurity incident or disruption, and there can be no assurance that our security efforts and measures, and those of our third-party vendors, will prevent breakdowns or incidents to our or our third-party vendors’ systems that could adversely affect our business. For a discussion of these risks, see “"
  }
}