{
  "ticker": "C",
  "cik": "0000831001",
  "company_name": "Citigroup Inc.",
  "filing_date": "2024-12-31",
  "accession": "0000831001-24-000067",
  "primary_doc": "c-20241231.htm",
  "item_sections": {
    "item1": "OVERVIEWCitigroup’s history dates back to the founding of the City Bank of New York in 1812.Citigroup is a global diversified financial services holding company whose businesses provide consumers, corporations, governments and institutions with a broad, yet focused, range of financial products and services, including consumer banking and credit, corporate and investment banking, securities brokerage, trade and securities services and wealth management. Citi does business in nearly 160 countries and jurisdictions.Citi’s vision is to be the preeminent banking partner for institutions with cross-border needs, a global leader in wealth management and a valued personal bank in the U.S.At December 31, 2024, Citi had approximately 229,000 full-time employees, compared to approximately 239,000 at December 31, 2023. For additional information, see “Human Capital Resources and Management” below.Throughout this report, “Citigroup,” “Citi” and “the Company” refer to Citigroup Inc. and its consolidated subsidiaries. All “Note” references correspond to the Notes to the Consolidated Financial Statements herein, unless otherwise indicated.For a list of certain terms and acronyms used in this Annual Report on Form 10-K and other Citigroup presentations, see “Glossary of Terms and Acronyms” at the end of this report.Additional InformationAdditional information about Citigroup is available on Citi’s website at www.citigroup.com. Citigroup’s annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and proxy statements, as well as other filings with the U.S. Securities and Exchange Commission (SEC) are available free of charge through Citi’s website by clicking on “SEC Filings” under the “Investors” tab. The SEC’s website also contains these filings and other information regarding Citi at www.sec.gov.For a discussion of 2023 versus 2022 results of operations of Services, Markets, Banking, Wealth, U.S. Personal Banking and All Other, see each respective business’s results of operations in Citigroup’s Annual Report on Form 10-K for the year ended December 31, 2023 (Citigroup’s 2023 Annual Report on Form 10-K).Certain reclassifications have been made to the prior periods’ financial statements and disclosures to conform to the current period’s presentation, including certain reclassifications to align with Citi’s organizational simplification and strategy, for all periods presented.Please see “Risk Factors” below for a discussion of material risks and uncertainties that could impact Citigroup’s businesses, results of operations and financial condition.Non-GAAP Financial MeasuresCiti prepares its financial statements in accordance with U.S. generally accepted accounting principles (GAAP) and also presents certain non-GAAP financial measures (non-GAAP measures) that exclude certain items or otherwise include components that differ from the most directly comparable measures calculated in accordance with U.S. GAAP. These non-GAAP financial measures are not intended to be a substitute for GAAP financial measures and may not be defined or calculated the same way as non-GAAP measures with similar names used by other companies.Citi’s non-GAAP financial measures in this Form 10-K include:•Revenues excluding the Argentina currency devaluation and/or divestiture-related impacts•Expenses excluding the Federal Deposit Insurance Corporation (FDIC) special assessment and/or divestiture-related impacts•Services and Treasury and Trade Solutions (TTS) revenues and/or non-interest revenues excluding the impact of the Argentina currency devaluation\n•Banking and Corporate Lending revenues excluding gain (loss) on loan hedges•All Other (managed basis), which excludes divestiture-related impacts•Tangible common equity (TCE), return on tangible common equity (RoTCE) and tangible book value per share (TBVPS)•Non-Markets net interest income\nFor more information on the Argentina currency devaluation and/or the FDIC special assessment, see “Executive Summary” below. Citi believes its results excluding the Argentina currency devaluation and the FDIC special assessment are useful to investors, industry analysts and others in evaluating Citi’s results of operations and comparing its operational performance between periods, by providing a meaningful depiction of the underlying fundamentals of period-to-period operating results, particularly given the outsized impacts of these items, as well as additional comparability to peer companies.\nCiti’s results excluding divestiture-related impacts represent as reported, or GAAP, financial results adjusted for items that are incurred and recognized, which are wholly and necessarily a consequence of actions taken to sell (including through a public offering), dispose of or wind down business activities associated with Citi’s previously announced exit markets within All Other—Legacy Franchises. Citi’s Chief Executive Officer, its chief operating decision maker, regularly reviews financial information for All Other on a managed basis that excludes these divestiture-related impacts. For more information on Citi’s results excluding divestiture- related impacts, see “Executive Summary” and “All Other— Divestiture-Related Impacts (Reconciling Items)” below.\nCiti believes its results excluding divestiture-related impacts are useful to investors, industry analysts and others in evaluating Citi’s results of operations and comparing its operational performance between periods, by providing a meaningful depiction of the underlying fundamentals of\n4period-to-period operating results, particularly given the outsized impacts of the divestiture-related impacts; improved visibility into management decisions and their impacts on operational performance; and additional comparability to peer companies.\nFor more information on Services and TTS revenues and/or non-interest revenues excluding the impact of the Argentina currency devaluation, see “Executive Summary” and “Services” below.\nFor more information on Banking and Corporate Lending revenues excluding gain (loss) on loan hedges, see “Executive Summary” and “Banking” below. Citi believes that Banking and Corporate Lending revenues excluding gain (loss) on loan hedges are useful to investors, industry analysts and others because the gain (loss) on loan hedges are independent of Banking and Corporate Lending’s core operations and not indicative of the performance of the business operations.\nFor more information on TCE, RoTCE and TBVPS, see “Capital Resources—Tangible Common Equity, Book Value Per Share, Tangible Book Value Per Share and Return on Equity” below. TCE, RoTCE and TBVPS are used by management, as well as investors, industry analysts and others, in assessing Citi’s use of equity. Citi believes TCE and RoTCE are useful to investors, industry analysts and others by providing alternative measures of capital strength and performance. Citi believes TBVPS provides additional useful information about the level of tangible assets in relation to Citi’s outstanding shares of common stock.\nFor more information on non-Markets net interest income, see “Market Risk—Non-Markets Net Interest Income” below. Management uses non-Markets net interest income to assess the performance of Citi’s lending, investing (including asset-liability management) and deposit-raising activities, apart from any volatility associated with Markets activities. Citi believes the use of this non-GAAP measure provides investors, industry analysts and others with an alternative measure to analyze the net interest income trends of Citi’s lending, investing and deposit-raising activities, by providing a meaningful depiction of the underlying fundamentals of period-to-period operating results of those activities; improved visibility into management decisions and their impacts on operational performance; and additional comparability to peer companies.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONSEXECUTIVE SUMMARYAs described further throughout this Executive Summary, Citi demonstrated improved overall business performance and continued progress on its strategic priorities in 2024:•Citi and its five reportable operating segments each achieved positive operating leverage for 2024. Citi’s positive operating leverage in 2024 was driven by revenue growth of 3%, with record revenues in Services, Wealth and USPB, and disciplined expense management (down 4%), despite higher volume- and transformation-related expenses and other investments in risk and control initiatives. Excluding the impact of the FDIC special assessment in both 2024 and the prior year, expenses decreased 2%.\n•Citi continued to advance its transformation, including its efforts to improve risk management, modernize technology and infrastructure and improve resiliency across the organization. Simultaneously, as a result of the July 2024 Civil Money Penalty Consent Orders and Consent Order Amendment, Citi recognized the need to accelerate progress in certain areas, particularly with regard to data quality management related to governance and regulatory reporting. (See “Citi’s Multiyear Transformation” below).\n•Citi completed its organizational simplification announced in September 2023, resulting in a simpler management structure that aligns to and facilitates Citi’s strategy, while improving accountability and decision-making and advancing the execution of Citi’s transformation.\n•As part of its strategic refresh, Citi continued to make progress on its remaining divestitures, including exits of its consumer banking operations in Korea and Poland and its overall operations in Russia. Additionally, Citi completed the separation of its Services, Markets, Banking and Wealth businesses in Mexico from its consumer banking and small business and middle-market banking operations in Mexico (Mexico Consumer/SBMM) in December 2024, an important milestone toward the planned initial public offering (IPO) of Citi’s Mexico Consumer/SBMM business. (See “All Other (Managed Basis)” below.)\n•Citi returned $6.7 billion to common shareholders in the form of dividends ($4.2 billion) and share repurchases ($2.5 billion) in 2024. As previously disclosed, on January 13, 2025, Citigroup’s Board of Directors authorized a new, multiyear $20 billion common stock repurchase program, with planned repurchases of $1.5 billion during the first quarter of 2025, subject to market conditions and other factors. After the first quarter of 2025, Citi will continue to assess the level of common share repurchases on a quarter-by-quarter basis given uncertainty regarding regulatory capital requirements, among other factors.\n2024 Results SummaryCitigroupCitigroup reported net income of $12.7 billion, or $5.94 per share. This compared to net income of $9.2 billion, or $4.04 per share in the prior year, which included larger impacts from certain notable items, including an Argentina currency devaluation, an FDIC special assessment, restructuring charges related to Citi’s organizational simplification and an ACL build for transfer risk (see “Cost of Credit” below).\nNet income increased 37% versus the prior year, driven by the higher revenues, lower expenses and a lower effective tax rate, partially offset by higher cost of credit. Citigroup’s effective tax rate was 25% in 2024 versus 27% in the prior year, largely driven by the geographic mix of earnings (see Note 10).\nCitigroup revenues of $81.1 billion in 2024 increased 3% on a reported basis. This increase in revenues largely reflected an increase in non-interest revenue (up 15%), including the benefit of a smaller impact from the Argentina currency devaluation ($(253) million in 2024 versus approximately $(1.9) billion in 2023) as well as strength in underlying fee drivers in each of Citi’s reportable operating segments. The increase in non-interest revenue was partially offset by a decline in net interest income (down 1%). The decrease in net interest income primarily reflected lower revenues in All Other (managed basis), partially offset by higher interest-earning balance growth in U.S. Personal Banking (USPB). Excluding divestiture-related impacts, primarily related to gains on the sales of Citi’s India and Taiwan consumer banking businesses in the prior year, as well as the Argentina currency devaluation, revenues of $81.4 billion in 2024 also increased 3% versus the prior year.\nCitigroup’s end-of-period loans were $694 billion, up 1% versus the prior year, largely driven by loan growth in USPB.\nCitigroup’s end-of-period deposits were approximately $1.3 trillion, down 2% versus the prior year, largely due to a decrease in All Other (managed basis). For additional information about Citi’s deposits by business, including drivers and deposit trends, see each respective business’s results of operations and “Liquidity Risk— Deposits” below.ExpensesCitigroup’s operating expenses of $54.0 billion decreased 4% from the prior year. Excluding the FDIC special assessment ($203 million in 2024 versus approximately $1.7 billion in the prior year), expenses of $53.8 billion decreased 2%, driven by savings related to Citi’s organizational simplification and stranded cost reduction, as well as the lower restructuring charges ($259 million in 2024 versus $781 million in the prior year) and repositioning costs. The decrease was partially offset by higher volume-related expenses, investments in Citi’s transformation and other risk and controls initiatives, as well as the costs of the July 2024 Civil Money Penalty Consent Orders entered into with the Federal Reserve Board (FRB) and the Office of the Comptroller of the Currency (OCC).7Excluding the FDIC special assessment and divestiture-related impacts, expenses of $53.5 billion also decreased 2%.Cost of CreditCiti’s total provisions for credit losses and for benefits and claims was $10.1 billion, compared to $9.2 billion in the prior year. The increase was driven by higher net credit losses in Branded Cards and Retail Services in USPB, reflecting the continued maturation of multiple cards loan vintages originated in recent years. The maturation was delayed by unprecedented levels of government stimulus during the pandemic. In addition, the increase was due to macroeconomic pressures related to the elevated inflationary and interest rate environment impacting both card portfolios, with lower FICO band customers primarily driving the increase. The higher net credit losses were partially offset by a lower net build in the allowance for credit losses (ACL), primarily due to a smaller build related to transfer risk associated with exposures outside the U.S. (approximately $0.2 billion in 2024 versus $1.9 billion in 2023), driven by safety and soundness considerations under U.S. banking law. For additional information on Citi’s ACL, see “Significant Accounting Policies and Significant Estimates—Citi’s Allowance for Credit Losses (ACL)” below.\nNet credit losses of $9.0 billion increased 40% from the prior year. Consumer net credit losses of $8.6 billion increased 39%, largely reflecting the continued rise in net credit loss rates in Branded Cards and Retail Services. Corporate net credit losses increased to $397 million from $250 million in the prior year.\nSubject to evolving macroeconomic conditions, Citi expects to continue to experience an elevated net credit loss rate for full-year 2025 in line with 2024, with higher loss rates in the first half of the year in Branded Cards and Retail Services consistent with seasonal patterns. Citi also expects that its future ACL builds will be driven by both the macroeconomic environment and business volumes, among other factors. For additional information on Citi’s consumer and corporate credit costs, see each respective business’s results of operations and “Credit Risk” below.\nIn January 2025, a series of wildfires affected the Los Angeles metropolitan area and surrounding regions, causing loss of life and the destruction of more than 16,000 structures. While Citi continues to assess the wildfires’ impact on its customers and clients in the affected areas, Citi does not currently expect the wildfires to have a direct material impact to its consumer or corporate credit portfolios or its overall results of operations.\n\nCapital\nCitigroup’s CET1 Capital ratio was 13.6% as of December 31, 2024, compared to 13.4% as of December 31, 2023, based on the Basel III Standardized Approach for determining risk weighted assets (RWA). The increase was primarily driven by net income and a decrease in RWA, partially offset by the payment of common and preferred dividends, as well as common share repurchases and net adverse movements in Accumulated other comprehensive income (AOCI).\nIn 2024, Citi repurchased $2.5 billion of common shares and paid $4.2 billion of common dividends (see “Unregistered\nSales of Equity Securities, Repurchases of Equity Securities and Dividends” below).\nFor additional information on capital-related risks, trends and uncertainties, see “Capital Resources—Regulatory Capital Standards and Developments” and “Risk Factors—Strategic Risks,” “—Operational Risks” and “—Compliance Risks” below.\nCitigroup’s Supplementary Leverage ratio as of\nDecember 31, 2024 was 5.8%, largely unchanged from December 31, 2023, as higher Tier 1 Capital was offset by an increase in Total Leverage Exposure. For additional information on Citi’s capital ratios and related components, see “Capital Resources” below.\n\nServices\nServices net income of $6.5 billion increased 40%, as higher revenue and lower cost of credit were partially offset by higher expenses.\nServices revenues of $19.6 billion increased 9%, largely driven by a 28% increase in non-interest revenue and higher net interest income (up 1%). Excluding the impact of the Argentina currency devaluation ($(178) million in 2024 versus approximately $(1.2) billion in 2023), Services revenues increased 3% and its non-interest revenue increased 5%. The increase in net interest income reflected the benefit of higher deposit and loan volumes, largely offset by a decline in interest rates in Argentina.\nTTS revenues of $14.5 billion increased 6% on a reported basis, driven by a 37% increase in non-interest revenue, partially offset by a 1% decrease in net interest income. Excluding the impact of the Argentina currency devaluation (approximately $(164) million in 2024 and approximately $(1.0) billion in 2023), non-interest revenue increased 3%, driven by an increase in cross-border transaction value, as well as an increase in U.S. dollar clearing and commercial card spend volume. The decrease in TTS net interest income was primarily driven by the decline in interest rates in Argentina.\nSecurities Services revenues of $5.1 billion increased 17%, driven by an 18% increase in non-interest revenue and a 15% increase in net interest income. The growth in non-interest revenue was primarily due to increased fees from higher AUC/AUA balances and continued elevated levels of corporate activity in Issuer Services, as well as the smaller impact from the currency devaluation in Argentina. The increase in net interest income was primarily due to higher spreads and volumes.\nServices expenses of $10.6 billion increased 6%, primarily driven by continued investments in technology and platform modernization, other risk and controls and product innovation, as well as an Argentina-related transaction tax expense and higher legal expenses, partially offset by the impact of productivity savings. Cost of credit decreased to $276 million from $950 million in the prior year, primarily driven by a smaller ACL build for transfer risk associated with exposures outside of the U.S., driven by safety and soundness considerations under U.S. banking law.\nFor additional information on the results of operations of Services in 2024, see “Services” below.\n\n\n8\n\n\nMarkets\nMarkets net income of $4.9 billion increased 27%, driven by higher revenues, partially offset by higher cost of credit.\nMarkets revenues of $19.8 billion increased 6%, driven by a 26% increase in Equity Markets and a 1% increase in Fixed Income Markets. The increase in Equity Markets was primarily driven by growth in cash equities, due to higher client activity and volumes, and equity derivatives on higher volatility, which also included the impact from an episodic gain related to the Visa B exchange. The increase was also driven by an increase in prime services. The increase in Fixed Income Markets was driven by growth in spread products and other fixed income (up 20%), partially offset by lower revenues in rates and currencies (down 6%). The increase in spread products and other fixed income revenues was largely driven by increased client activity due to growth in asset-backed financing, securitization activity and underwriting fees, partially offset by a decline in commodities revenues. The decline in rates and currencies revenues was primarily due to lower volatility and a strong prior-year performance, partially offset by the smaller impact of the Argentina currency devaluation.\nMarkets expenses of $13.2 billion were largely unchanged versus the prior year, as higher legal and volume-related expenses were offset by productivity savings. Cost of credit increased to $463 million from $438 million in the prior year, primarily driven by higher net credit losses for loans in spread products, partially offset by a smaller ACL build on other assets for transfer risk associated with exposures outside the U.S., driven by safety and soundness considerations under U.S. banking law.\nFor additional information on the results of operations of Markets in 2024, see “Markets” below.\n\nBanking\nBanking net income was $1.5 billion, compared to a net loss of $35 million in the prior year, driven by higher revenues, lower expenses and a higher benefit from cost of credit.\nBanking revenues of $6.2 billion increased 32%, including a $180 million loss on loan hedges in 2024 versus a $443 million loss on loan hedges in the prior year. Excluding the losses on loan hedges, Banking revenues of $6.4 billion increased 24%, reflecting higher Investment Banking and Corporate Lending revenues. Investment Banking revenues of $3.6 billion increased 38%, due to a rebound in overall wallet activity and wallet share gains across all products. Corporate Lending revenues increased 23%, including the impact of losses on loan hedges. Excluding the impact of losses on loan hedges, Corporate Lending revenues increased 9%, primarily driven by a smaller impact from the Argentina currency devaluation.\nBanking expenses of $4.5 billion decreased 8%, primarily driven by benefits of prior repositioning and other actions to lower the expense base, partially offset by higher volume-related expenses. Cost of credit was a benefit of $224 million, compared to a benefit of $143 million in the prior year, driven by an ACL release on other assets, primarily due to lower transfer risk associated with exposures outside the U.S., driven by safety and soundness considerations under U.S. banking law.\nFor additional information on the results of operations of Banking in 2024, see “Banking” below.\n\nWealth\nWealth net income of $1.0 billion increased 139%, reflecting higher revenues, lower expenses and a higher benefit from cost of credit.\nWealth revenues of $7.5 billion increased 7%, largely driven by higher non-interest revenue (up 15%), reflecting higher investment fee revenues in Citigold, Wealth at Work and the Private Bank on growth in client investment assets, as well as an increase in net interest income (up 2%). The increase in net interest income was mainly due to higher average deposit spreads and volumes, partially offset by higher mortgage funding costs in the Private Bank and Wealth at Work.\nWealth expenses decreased 2% to $6.4 billion, primarily driven by benefits from prior repositioning and restructuring actions, partially offset by higher volume-related expenses and technology investments focused on risk and controls and platform enhancements. Cost of credit was a net benefit of $126 million, compared to a net benefit of $3 million in the prior year, largely driven by a higher net ACL release due to a change in the ACL associated with the margin lending portfolio.\nFor additional information on the results of operations of Wealth in 2024, see “Wealth” below.\n\nU.S. Personal Banking\nUSPB net income of $1.4 billion decreased 24%, driven by higher cost of credit, partially offset by higher revenues and lower expenses.\nUSPB revenues of $20.4 billion increased 6%, due to higher net interest income (up 5%), driven by strong loan growth, primarily in cards, as well as higher non-interest revenue (up 24%) due to lower partner payments in Retail Services. Branded Cards revenues of $10.7 billion increased 7%, primarily driven by higher net interest income, reflecting interest-earning balance growth (up 9%) from lower payment rates and card spend volume growth. Retail Services revenues of $7.1 billion increased 8%, primarily driven by higher non-interest revenue due to the lower partner payments, as a result of higher net credit losses, as well as higher net interest income on growth in interest-earning balances (up 3%). Retail Banking revenues of $2.6 billion decreased 1%, primarily driven by the impact of the transfers of certain relationships and the associated deposit balances to Wealth, partially offset by higher deposit spreads, as well as mortgage and installment loan growth.\nUSPB expenses of $10 billion decreased 1%, primarily driven by continued productivity savings and lower technology costs, partially offset by higher volume-related expenses. Cost of credit increased to $8.6 billion, compared to $6.7 billion in the prior year. The increase was driven by higher net credit losses (up 45%), primarily reflecting the continued maturation of multiple cards loan vintages originated in recent years, as well as macroeconomic pressures related to the elevated inflationary and interest rate environment impacting both cards portfolios, with lower FICO band customers primarily driving the increase. The higher net\n9\n\n\ncredit losses were partially offset by a lower ACL build for loans.\nFor additional information on the results of operations of USPB in 2024, see “U.S. Personal Banking” below.\n\nAll Other (Managed Basis)\nAll Other (managed basis) net loss was $2.4 billion, compared to a net loss of $2.1 billion in the prior year, driven by lower revenues and lower income tax benefits, partially offset by lower expenses and lower cost of credit.\nAll Other (managed basis) revenues decreased 20%, driven by lower revenues in Corporate/Other and Legacy Franchises. The decline in Corporate/Other was largely driven by net investment securities losses due to the repositioning of the investment securities portfolio and higher funding costs. Legacy Franchises (managed basis) revenues declined 6%, due to lower revenues in Asia Consumer (managed basis) and Legacy Holdings Assets, partially offset by higher revenues in Mexico Consumer/SBMM (managed basis).\nAll Other (managed basis) expenses decreased 19%, primarily driven by the lower FDIC special assessment ($203 million in 2024 versus approximately $1.7 billion in the prior year) and a reduction from the closed exits and wind-downs, as well as the lower restructuring charges ($259 million in 2024 versus $781 million in 2023), partially offset by the civil money penalties imposed by the FRB and OCC in July 2024. Cost of credit was $1.1 billion, compared to $1.3 billion in the prior year, largely driven by a smaller ACL build for transfer risk associated with exposures outside the U.S., driven by safety and soundness considerations under U.S. banking law.\nFor additional information on the results of operations of All Other (managed basis) in 2024, see “All Other—Divestiture-Related Impacts (Reconciling Items)” and “All Other (Managed Basis)” below.\nMacroeconomic and Other Risks and Uncertainties\nVarious macroeconomic, geopolitical and regulatory uncertainties and challenges pose risks to economic conditions in the U.S. and globally, including, among others, any resurgence in inflation; changes to trade, immigration, energy and other policies resulting from the new U.S. administration; changes in interest rate policies; the Russia–Ukraine war; conflicts in the Middle East; and economic conditions and tensions involving China.\nFor example, on February 1, 2025 the new U.S. administration announced the imposition of new tariffs on imports from China, Mexico and Canada, although the tariffs for Mexico and Canada were delayed for 30 days. China responded with tariffs against certain imports from the U.S. Additionally, on February 10, 2025, the U.S. administration announced global 25% tariffs on steel and aluminum imports. The U.S. administration has also announced plans for reciprocal tariffs on all U.S. trading partners. While the resulting impacts are difficult to predict at this time, these and other tariffs, whether imposed by the U.S. or by any other country, may result in disruption of supply chains, increased inflationary pressures and higher interest rates.\nThese and other risks could negatively impact economic growth rates and unemployment levels in the U.S. and other countries and result in volatility and disruptions in financial markets. Such risks could also adversely affect Citi’s customers, clients, businesses, funding costs, cost of credit and overall results of operations and financial condition during 2025. For a further discussion of trends, uncertainties and risks that will or could impact Citi’s businesses, results of operations, capital and other financial condition during 2025, see “Executive Summary” above and “Risk Factors,” each respective business’s results of operations and “Managing Global Risk,” including “Managing Global Risk—Other Risks—Country Risk—Russia” and “—Argentina,” below.\n\n10\n\n\n\n\n\nCITI’S MULTIYEAR TRANSFORMATION\n\nOverview\nAs previously disclosed, Citi’s transformation, including the remediation of its consent orders with the FRB and OCC, is a multiyear endeavor that is not linear. Citi is modernizing and simplifying the Company in order to lead in a dynamic, competitive and digital world. Citi’s transformation is addressing decades of underinvestment in its infrastructure, going beyond remedying regulatory concerns to intentionally transform how the organization operates, and making investments that not only support current needs, but also benefit the Company over the long term.\nTransformation efforts of this scale involve significant complexities and uncertainties, including ongoing regulatory challenges and risks. As discussed in the “Executive Summary” above, on July 10, 2024, the FRB entered into a Civil Money Penalty Consent Order with Citigroup, and the OCC entered into a Civil Money Penalty Consent Order with Citibank (collectively, the 2024 Consent Orders). In addition, the OCC and Citibank entered into an Amendment (the Amendment) to the October 7, 2020 Consent Order. For additional information about the 2024 Consent Orders and the Amendment, see Citi’s July 10, 2024 Form 8-K and “Transformation Focus Areas and Status” and “FRB and OCC Consent Orders Compliance” below.\nCiti may continue to experience significant challenges in progressing the transformation and satisfying the regulators’ expectations in both sufficiency and timing, particularly with regard to data quality management related to governance and regulatory reporting. The regulators may also identify additional risk and control issues that could result in further regulatory actions. For additional information about these regulatory risks, see “Risk Factors—Compliance Risks” below.\nNotwithstanding the 2024 Consent Orders and the Amendment, Citi’s transformation target outcomes remain focused on changing its business and operating models such that they simultaneously (i) strengthen controls, enhance data quality, reduce risk and improve Citi’s regulatory compliance and its culture, and (ii) enhance Citi’s value to customers, clients and shareholders.\n\nTransformation Focus Areas and Status\nOver the last several years, Citi has made key investments to, among other things, consolidate and modernize its infrastructure, simplify and automate manual processes, and enhance technology, data and analytics. In particular, Citi’s transformation-related expenses include costs related to risk and controls, data and finance programs and other 2020 Consent Order programs, as well as spending on certain other regulatory initiatives unrelated to the 2020 Consent Orders, and spending on enterprise-wide technology infrastructure and the Transformation Bonus Program (see below).\nCiti completed significant planning and foundational work for the transformation in 2021 and 2022. In 2023, Citi progressed its transformation efforts into implementation mode and those efforts continued in 2024.\nIn 2024, Citi’s transformation-related expenses increased 1% to approximately $2.9 billion from the prior year, largely driven by increased spending on certain programs, including data, largely offset by a reduction in the payout under the Transformation Bonus Program.\nCiti’s transformation initiatives will continue to entail significant investments during 2025 and beyond. Citi’s transformation initiatives in 2025 will continue to focus on (i) automating regulatory processes and remediating data quality issues, particularly related to regulatory reporting, and (ii) further strengthening stress testing and resolution and recovery capabilities.\n\nProgress\nNotwithstanding Citi’s investments and remediation efforts, as set forth in the FRB’s 2024 Civil Money Penalty Consent Order, the FRB found that, based on examinations conducted by the Federal Reserve Bank of New York, Citigroup had ongoing deficiencies related to its data quality management program and inadequate measures for managing and controlling its data quality risks. In addition, as set forth in the OCC’s 2024 Civil Money Penalty Consent Order and the Amendment, the OCC deemed that Citibank had failed to make sufficient and sustainable progress toward achieving compliance with the OCC’s 2020 Consent Order. As a result, Citi has made changes to its governance and structure of its data program as well as increased the level of investment in the program. For additional information about Citi’s transformation investments, see “Transformation Focus Areas and Status” above.\nDespite the ongoing regulatory challenges and risks, Citi’s transformation progress includes the following:\n\nImproved Risk Management\n\n•Closed the 2013 Consent Order with the FRB related to anti-money laundering and Bank Secrecy Act deficiencies\n•Built greater efficiency and scale in the risk management of Citi’s global spread products business, with 99% of risk computations now occurring on cloud-based infrastructure\n•Approximately 90% of derivative trades now subject to full revaluation each month using automated independent price verification\n•Approximately 76% of all product data onboarded to strategic data redistribution platforms with stronger data quality controls\n•Consolidated four new activity risk management platforms into one modern platform\n•Implemented key technology capabilities for target state wholesale credit analysis, simplifying the process and execution of policy requirements\n•Faster and more frequent stress testing for geopolitical risks, natural disasters and industry-specific events\n\nModernization\n\n•Retired or replaced 714 legacy applications in 2024 with new, modern applications\n•Launched a new regulatory reporting platform with advanced capabilities to improve quality and efficiency\n11\n\n\n•Scaled automated controls in Markets, including transaction monitoring (over 750 million trading records monthly) and Regulation W compliance (approximately 400,000 transactions monthly)\n•Consolidated 20 cash equities platforms into one modern platform\n•Reduced time to book new or amended loans in North America by over 50%\n\nResiliency\n\n•Improved resiliency and reduced downtime by simplifying system restoration to a single click for approximately 26% of critical applications\n•Reduced data center consumption through migration of workload to a private cloud and streamlined and reduced the time involved in the cloud onboarding process from over seven weeks to two weeks\n•Upgraded 100% of Citi’s more than 2,300 ATMs in North America, Singapore, Hong Kong and the UAE to next-generation software for better customer security and monitoring\n\nOrganizational Simplification\nDuring the first quarter of 2024, Citi completed its organizational simplification announced in September 2023. The result is a simpler management structure that aligns to and facilitates Citi’s strategy, while improving accountability and decision-making. Citi’s operating model changes included elimination of the Institutional Clients Group, Personal Banking and Wealth Management and Legacy Franchises operating segments and resulted in the five current reportable operating segments—Services, Markets, Banking, Wealth and U.S. Personal Banking—and a new financial reporting structure. Activities not assigned to the reportable operating segments are reflected in All Other, including Legacy Franchises and Corporate/Other. Citi also exited certain institutional business lines and consolidated its regional structure from four to two regions, consisting of North America and International. Citi’s organizational simplification efforts also assist in advancing the execution of the transformation.\n\nFRB and OCC Consent Orders Compliance\nAs previously disclosed, on July 10, 2024, the FRB entered into a Civil Money Penalty Consent Order with Citigroup in the amount of approximately $61 million, and the OCC entered into a Civil Money Penalty Consent Order with Citibank, a wholly owned subsidiary of Citigroup, in the amount of $75 million. The OCC and Citibank also entered into an Amendment to the October 7, 2020 OCC Consent Order. The Amendment requires Citibank to formalize a process to determine whether sufficient resources are being appropriately allocated toward achieving timely and sustainable compliance with the OCC’s 2020 Consent Order, including any requirements on which Citibank is not making sufficient and sustainable progress (such process, the Resource Review Plan). Copies of the 2024 Consent Orders and the Amendment were included as exhibits to Citi’s July 10, 2024 Form 8-K. For additional information regarding the 2024\nConsent Orders and the Amendment, see the July 10, 2024 Form 8-K.\nAs discussed above, Citi’s transformation efforts include effective implementation of the October 7, 2020 FRB and OCC Consent Orders issued to Citigroup and Citibank, respectively. The 2020 Consent Orders require Citigroup and Citibank to implement extensive targeted action plans and submit quarterly progress reports on a timely and sufficient basis, detailing the results and status of improvements relating principally to various aspects of (i) enterprise-wide risk management, (ii) compliance risk management, (iii) data quality management related to governance, and (iv) internal controls. Citi continues to work constructively with the FRB and OCC and provide additional information regarding its plans and progress to both regulators on an ongoing basis. Citi will continue to reflect their feedback in its project plans and execution efforts. Although there are no restrictions on Citi’s ability to serve its clients, the 2020 OCC Consent Order requires Citibank to obtain prior approval of any significant new acquisition, including any portfolio or business acquisition, excluding ordinary course transactions. For additional information about the requirements under the 2020 Consent Orders, see Citi’s Current Report on Form 8-K filed with the SEC on October 9, 2020.\n\nGovernance\nCiti has built an organization and infrastructure to manage, guide and support its transformation, which spans all businesses and functions to ensure consistency. Additionally, the Citigroup and Citibank Boards of Directors each formed a Transformation Oversight Committee, an ad hoc committee of each Board, to provide oversight of Citi’s efforts to improve its risk and control environment and management’s remediation efforts under the consent orders.\nWhile every member of Citi’s executive management team, or EMT, is involved in the transformation and plays a key, direct role in its implementation, Citi’s CEO has taken a leading role in managing the effort. As part of this effort, Citi’s CEO has assembled a team consisting of long-tenured employees and new hires from across various disciplines and areas of expertise and experience, along with representatives from each of Citi’s businesses and functions, to lead the various transformation programs. Citi is focusing the Company’s most senior talent on this effort and has a detailed, integrated approach to execute on the transformation. Citi’s Transformation Steering Committee, chaired by Citi’s CEO, sets the overall direction for the transformation and communicates progress to the Citigroup Board of Directors, as well as seeks input and feedback from the Board.\nIn 2023, Citi appointed a Chief Operating Officer, who reports to the CEO and is responsible for running Citi’s overall transformation efforts, as well as leading Citi’s efforts to improve operating efficiency and returns along with Citi’s enterprise-wide effort to strengthen its risk and controls and data quality, and modernize infrastructure, while simplifying the Company. In 2024, Citi hired a new Head of Technology and Business Enablement, who reports to the CEO and works closely with Citi’s transformation team to drive improvements to data quality and modernize infrastructure, while driving simplification and automation across Citi.\n12\n\n\nTransformation Bonus Program\nIn 2021, the Compensation, Performance Management and Culture Committee (the Compensation Committee) of Citigroup’s Board of Directors approved a long-term performance-based bonus program to incentivize effective execution in connection with the transformation and remediation of the consent orders and to drive change in Citi’s risk and control environment and culture (the Transformation Bonus Program, or the Program). There are approximately 200 senior employees who were deemed critical to the execution of the transformation and are therefore eligible for the Program.\nPerformance is measured, and the bonus, if any, payable pursuant to the Transformation Bonus Program is paid in three tranches, each representing a separate performance period.\nWell-defined goals and related metrics are established for each of the three tranches, which may reflect qualitative considerations, including regulatory actions. At the end of each year, the Compensation Committee determines the appropriate level of payout given the accomplishments for the performance period relative to the specific goals and related metrics. The maximum portion of the bonus payable for each tranche was 25% for the first tranche, 25% for the second tranche and is 50% for the third tranche.\nFor additional information on the Transformation Bonus Program, including the Compensation Committee’s determination with respect to performance metrics, targets and achievements for the first and second performance measurement periods under the Program, see “Citi’s Multiyear Transformation” in Citi’s Second Quarter of 2024 Form 10-Q and Citi’s 2024 Proxy Statement for Citigroup’s Annual Meeting of Stockholders. For additional information on the Compensation Committee’s determination with respect to performance metrics, targets and achievements for the third performance measurement period under the Program covering calendar year 2024, see Citi’s upcoming 2025 Annual Meeting Proxy Statement to be filed with the SEC in March 2025.\n\n13\nSERVICES\n\nServices includes Treasury and Trade Solutions (TTS) and Securities Services. TTS provides an integrated suite of tailored cash management, payments and trade and working capital solutions to multinational corporations, financial institutions and public sector organizations. Securities Services provides a comprehensive product offering, connecting clients to global markets across the entire investment cycle, including on-the-ground local market expertise, post-trade technologies, customized data solutions and a wide range of securities services solutions that can be tailored to meet clients’ needs.\nServices revenue is generated primarily from spreads and fees associated with these activities. Services earns spread revenue through generating deposits, as well as interest on loans. Revenue generated from these activities is primarily recorded in Net interest income. Fee income is earned for assisting clients with transactional services and clearing. Revenue generated from these activities is recorded in Commissions and fees. Revenue is also generated from assets under custody and administration and is recognized when the associated service is provided by Citi. Revenue generated from these activities is primarily recorded in Administration and other fiduciary fees. For additional information on these various types of revenues, see Note 5. Services revenues also include revenues earned by Citi that are subject to a revenue sharing arrangement with Banking—Corporate Lending for Investment Banking, Markets and Services products sold to Corporate Lending clients.\nAt December 31, 2024, Services had $584 billion in assets and $807 billion in deposits. Securities Services managed $25.4 trillion in assets under custody and administration, of which Citi provided both custody and administrative services to certain clients related to $1.9 trillion of such assets.\n2024 vs. 2023\nNet income of $6.5 billion increased 40%, driven by higher revenues and lower cost of credit, partially offset by higher expenses.\nRevenues increased 9%, driven by higher non-interest revenue in TTS and Securities Services, as well as higher net interest income. Excluding the impact of the Argentina currency devaluation (approximately $(178) million, compared to approximately $(1.2) billion in the prior year), revenues increased 3%.\nNon-interest revenue increased 28%, largely due to the smaller impact from the Argentina currency devaluation. Excluding the impact of the Argentina currency devaluation, non-interest revenue increased 5%, driven by continued strength across underlying fee drivers in TTS and Securities Services. Net interest income increased 1%, as the benefit of higher deposit and loan volumes was largely offset by a decline in interest rates in Argentina. Average deposits increased 1%, primarily driven by growth in Securities Services. Citi continued to increase operating deposits in both TTS and Securities Services.\nTTS revenues increased 6%, primarily driven by a 37% increase in non-interest revenue, partially offset by a 1%\ndecrease in net interest income. The increase in non-interest revenue was largely driven by the smaller impact from the Argentina currency devaluation (approximately $(164) million, compared to approximately $(1.0) billion in the prior year). Excluding the Argentina currency devaluation, non-interest revenue grew 3%, reflecting growth in underlying fee drivers, including cross-border transaction value (up 6%), U.S. dollar clearing volume (up 7%) and commercial card spend volume (up 5%). The decrease in net interest income was primarily driven by the decline in interest rates in Argentina. Average deposits were largely unchanged, as growth in International was offset by a decrease in North America. For additional information about Citi’s exposure in Argentina, see “Managing Global Risk—Other Risk—Country Risk—Argentina” below.\nSecurities Services revenues increased 17%, driven by a 15% increase in net interest income, primarily due to higher spreads and volumes, and an 18% increase in non-interest revenue. The increase in spreads was driven by higher interest rates and deposit mix across currencies. Average deposits increased 6%, driven by growth in both North America and International. The growth in non-interest revenue was primarily driven by increased fees from higher AUC/AUA\n19\n\n\nbalances and continued elevated levels of corporate activity in Issuer Services, as well as the smaller impact from the Argentina currency devaluation. AUC/AUA balances increased 8%, benefiting from higher market valuations, new client onboarding and deepening share of existing client wallet.\nExpenses increased 6%, primarily driven by continued investments in technology and platform modernization, other risk and controls and product innovation, as well as an Argentina-related transaction tax expense and higher legal expenses, partially offset by the impact of productivity savings.\nProvisions were $276 million, compared to $950 million in the prior year, primarily driven by a lower ACL build on other assets.\nThe net ACL build was $228 million, compared to $910 million in the prior year. The lower net ACL build was primarily due to a smaller build for transfer risk associated with exposures outside the U.S., driven by safety and soundness considerations under U.S. banking law.\nFor additional information on Citi’s ACL, see “Significant Accounting Policies and Significant Estimates” below.\nFor additional information on Services’ corporate credit portfolio, see “Managing Global Risk—Credit Risk—Corporate Credit” below.\nFor additional information on trends in Services’ deposits and loans, see “Managing Global Risk—Credit Risk—Loans” and “Managing Global Risk—Liquidity Risk—Deposits” below.\nFor additional information about trends, uncertainties and risks related to Services’ future results, see “Executive Summary” above and “Managing Global Risk—Other Risks—Country Risk—Argentina” and “—Russia” below.\n\n20\n\n\n\nMARKETS\n\nMarkets provides corporate, institutional and public sector clients around the world with a full range of sales and trading services across equities, foreign exchange, rates, spread products and commodities. The range of services includes market-making across asset classes, risk management solutions, financing and prime brokerage.\nAs a market maker, Markets facilitates transactions, including holding product inventory to meet client demand, and earns the differential between the price at which it buys and sells the products. These price differentials and the unrealized gains and losses on the inventory are recorded in Principal transactions. Fee revenue is earned through providing clients with a range of services including but not limited to trading, financing, brokerage, securitization and underwriting. Other primarily includes realized gains and losses on available-for-sale (AFS) debt securities, gains and losses on equity securities not held in trading accounts and other non-recurring gains and losses. Interest income earned on assets held, less interest paid on long- and short-term debt, secured funding transactions and customer deposits, is recorded as Net interest income.\nThe amount and types of Markets revenues are impacted by a variety of interrelated factors, including market liquidity; changes in market variables such as interest rates, foreign exchange rates, equity prices, commodity prices and credit spreads, as well as their implied volatilities; investor confidence; and other macroeconomic conditions. Markets revenues include revenues earned by Citi that are subject to a revenue sharing arrangement with Banking—Corporate Lending for Investment Banking, Markets and Services products sold to Corporate Lending clients.\nAssuming all other market conditions do not change, increases in client activity levels or bid/offer spreads generally result in increases in revenues. However, changes in market conditions can significantly impact client activity levels, bid/offer spreads and the fair value of product inventory. Management of the Markets businesses involves daily monitoring and evaluation of the above factors.\nMarkets’ international presence is supported by trading floors in approximately 80 countries and a proprietary network in 95 countries and jurisdictions.\n2024 vs. 2023\nNet income of $4.9 billion increased 27%, driven by higher revenues, partially offset by higher cost of credit.\nRevenues increased 6%, driven by higher Equity Markets and Fixed Income Markets revenues. Citi expects that revenues in its Markets businesses will reflect the overall market environment during 2025.\nFixed Income Markets revenues increased 1%, driven by spread products and other fixed income, partially offset by lower revenues in rates and currencies. Rates and currencies revenues decreased 6%, largely reflecting lower volatility and a strong prior-year performance, partially offset by the smaller impact of the Argentina currency devaluation. Spread products and other fixed income revenues increased 20%, largely driven by increased client activity due to growth in asset-backed financing, securitization activity and underwriting fees. These increases were partially offset by a decline in commodities revenues on lower overall volatility.\nEquity Markets revenues increased 26%, driven by growth in cash equities due to higher client activity and volumes. The increase in revenues was also due to growth in equity derivative revenues on higher volatility, which also included the impact from an episodic gain related to the Visa B exchange. The increase in revenues was also driven by growth in prime services, as Equity Markets continued to experience an increase in prime balances.\nExpenses were largely unchanged, as higher legal expenses and higher volume-related expenses were offset by productivity savings.\nProvisions were $463 million, compared to $438 million in the prior year, primarily driven by higher net credit losses, partially offset by a lower ACL build on other assets.\nNet credit losses were $168 million, compared to $32 million in the prior year, largely driven by higher losses on loans in spread products.\nThe net ACL build was $295 million, compared to a net build of $406 million in the prior year. The lower net ACL build was primarily due to a smaller build for transfer risk associated with exposures outside the U.S., driven by safety and soundness considerations under U.S. banking law.\nFor additional information on Citi’s ACL, see “Significant Accounting Policies and Significant Estimates” below.\nFor additional information on Markets’ corporate credit portfolio, see “Managing Global Risk—Credit Risk—Corporate Credit” below.\nFor additional information on trends in Markets’ deposits and loans, see “Managing Global Risk—Credit Risk—Loans” and “Managing Global Risk—Liquidity Risk—Deposits” below.\nFor additional information about trends, uncertainties and risks related to Markets’ future results, see “Executive Summary” above and “Managing Global Risk—Other Risks—Country Risk—Argentina” and “—Russia” below.\n22\n\n\n\nBANKING\n\nBanking includes Investment Banking, which supports clients’ capital-raising needs to help strengthen and grow their businesses, including equity and debt capital markets-related strategic financing solutions and loan syndication structuring, as well as advisory services related to mergers and acquisitions, divestitures, restructurings and corporate defense activities; and Corporate Lending, which includes corporate and commercial banking, serving as the conduit for Citi’s full product suite to clients.\nBanking revenues include revenues earned by Citi that are subject to a revenue sharing arrangement for Investment Banking, Markets and Services products sold to Corporate Lending clients.\nAt December 31, 2024, Banking had $143 billion in assets including $82 billion in loans and $0.6 billion in deposits.\n2024 vs. 2023\nNet income was $1.5 billion, compared to a net loss of $35 million in the prior year, driven by higher revenues, lower expenses and a higher benefit from cost of credit.\nRevenues increased 32% (including losses on loan hedges), reflecting higher Investment Banking and Corporate Lending revenues, along with a lower loss on loan hedges ($180 million versus $443 million in the prior year). Excluding the impact of losses on loan hedges, Banking revenues increased 24%.\nInvestment Banking revenues increased 38%, reflecting a 42% increase in investment banking fees, due to a rebound in overall wallet activity and wallet share gains across all products. DCM underwriting fees increased 61%, benefiting from near record debt issuance, particularly in investment grade and higher leveraged finance activity. Advisory fees increased 22%, due to strong announced deal volume from earlier in the year coming to fruition as those transactions closed. Equity underwriting fees increased 38%, due to stronger follow-on and convertibles activity.\nCorporate Lending revenues increased 23%, including the impact of gain (loss) on loan hedges. Excluding the impact of losses on loan hedges, Corporate Lending revenues increased 9%, primarily driven by a smaller impact from the currency devaluation in Argentina.\nExpenses decreased 8%, primarily driven by benefits of prior repositioning actions and other actions to lower the\nexpense base, partially offset by higher volume-related expenses.\nProvisions reflected a benefit of $224 million, compared to a benefit of $143 million in the prior year, primarily driven by an ACL release on other assets.\nThe net ACL release was $373 million, compared to a net release of $312 million in the prior year, primarily due to lower transfer risk associated with exposures outside the U.S., driven by safety and soundness considerations under U.S. banking law. The net ACL releases on loans and unfunded lending commitments in 2024 were primarily driven by improved macroeconomic conditions.\n\n24\n\n\n\nWEALTH\n\nWealth includes the Private Bank, Wealth at Work and Citigold businesses and provides financial services to a range of client segments including affluent, high net worth and ultra-high net worth clients through banking, lending, mortgages, investment, custody and trust product offerings in 20 countries, including the U.S., Mexico and four wealth management centers: Singapore, Hong Kong, the UAE and London. Private Bank provides financial services to ultra-high net worth clients through customized product offerings. Wealth at Work provides financial services to professional industries (including law firms, consulting groups, accounting and asset management) through tailored solutions. Citigold and Citigold Private Client provide financial services to affluent and high net worth clients through elevated product offerings and financial relationships.\nAt December 31, 2024, Wealth had $313 billion in deposits, $587 billion in client investment assets and $148 billion in loans, including $89 billion in mortgage loans, $29 billion in margin loans, $24 billion in personal, small business and other loans and $5 billion in outstanding credit card balances. In addition, Wealth had net new investment asset flows of $42 billion during 2024.\n2024 vs. 2023\nNet income was $1.0 billion, compared to $419 million in the prior year, reflecting higher revenues, lower expenses and a higher benefit from cost of credit.\nRevenues increased 7%, largely driven by an increase in non-interest revenue (up 15%), reflecting higher investment fee revenues on growth in client investment assets, as well as an increase in net interest income (up 2%). The increase in net interest income was mainly due to higher average deposit spreads and volumes, partially offset by higher mortgage funding costs.\nClient balances increased 8%, primarily driven by higher client investment assets (up 18%), reflecting strong net new investment assets generation and higher market valuations.\nAverage deposits increased 2%, reflecting the transfers of relationships and the associated deposits from USPB ($17 billion at the time of transfer over the last 12 months), partially offset by a shift in deposits to higher-yielding investments on Citi’s platform. Average loans decreased 1%, as Wealth continued to optimize capital usage.\nPrivate Bank and Wealth at Work revenues both increased 2%, driven by the improved deposit spreads and the higher investment fee revenues, partially offset by the higher mortgage funding costs.\nCitigold revenues increased 11%, driven by the higher investment fee revenues, as well as higher deposit spreads and volumes, reflecting the transfer of relationships and the associated deposits from USPB.\n\nExpenses decreased 2%, mainly driven by benefits from prior repositioning and restructuring actions, partially offset by higher volume-related expenses and technology investments focused on risk and controls and platform enhancements.\nProvisions were a benefit of $126 million, compared to a benefit of $3 million in the prior year, largely driven by a higher net ACL release. The higher net ACL release was primarily due to a change in the ACL associated with the margin lending portfolio.\nFor additional information on Citi’s ACL, see “Significant Accounting Policies and Significant Estimates” below.\nFor additional information on Wealth’s loan portfolios, see “Managing Global Risk—Credit Risk—Consumer Credit” below.\nFor additional information about trends, uncertainties and risks related to Wealth’s future results, see “Executive Summary” above and “Risk Factors” below.\n\n26\n\n\n\nU.S. PERSONAL BANKING\n\nU.S. Personal Banking (USPB) includes Branded Cards and Retail Services, with proprietary credit card portfolios (Value, Rewards and Cash) and co-branded card portfolios (including Costco and American Airlines) within Branded Cards, and co-brand and private label relationships within Retail Services (including, among others, The Home Depot, Best Buy, Macy’s and Sears). USPB also includes Retail Banking, which provides traditional banking services to retail and small business customers.\nIn December 2024, Citi announced a 10-year extension and expansion of its co-branded credit card partnership with American Airlines. In addition, Citi reached an agreement to acquire the Barclays American Airlines co-branded card portfolio and will begin transitioning cardmembers to the Citi portfolio in 2026. With the acquisition of the Barclays portfolio, Citi will become American Airlines’ exclusive credit card issuing partner in 2026.\nAt December 31, 2024, USPB had 642 retail bank branches concentrated in the six key metropolitan areas of New York, Chicago, Los Angeles, San Francisco, Washington, D.C. and Miami. USPB had $171 billion in outstanding credit card balances, $89 billion in deposits, $46 billion in mortgages and $5 billion in personal and small business loans.\n2024 vs. 2023\nNet income was $1.4 billion, compared to $1.8 billion in the prior year, reflecting higher cost of credit, partially offset by higher revenues and lower expenses.\nRevenues increased 6%, due to higher net interest income (up 5%), driven by strong loan growth, primarily in cards, as well as higher non-interest revenue (up 24%). The increase in non-interest revenue was largely driven by lower partner payments in Retail Services, due to higher net credit losses, and an increase in interchange fees (see Note 5), driven by higher card spend volume in Branded Cards. The increase in non-interest revenue was partially offset by an increase in rewards costs in Branded Cards, driven by the higher card spend volume.\nCards revenues increased 7%. Branded Cards revenues increased 7%, primarily driven by interest-earning balance growth (up 9%), as payment rates continued to moderate, and card spend volume growth. Branded Cards average loans increased 9%, also reflecting the lower card payment rates and higher card spend volume. Branded Cards spend volume increased 4%, driven by higher FICO band customers.\nRetail Services revenues increased 8%, primarily driven by higher non-interest revenue due to the lower partner payments, driven by the higher net credit losses (see “Provisions” below and Note 5), as well as higher net interest income on growth in interest-earning balances. Retail Services average loans increased 3%, largely reflecting lower card payment rates, partially offset by lower card spend volume. Retail Services card spend volume decreased 5%, primarily due to lower in-store foot traffic.\nRetail Banking revenues decreased 1%, driven by the impact of the transfers of certain relationships and the associated deposit balances to Wealth, partially offset by higher deposit spreads, as well as mortgage and installment loan growth. Average mortgage loans increased 15%, primarily driven by lower refinancings due to higher interest rates and higher mortgage originations. Average deposits decreased 17%, largely reflecting the transfer of certain relationships and the associated deposit balances to Wealth ($17 billion at the time of transfer over the last 12 months).\n\n\nExpenses decreased 1%, driven by continued productivity savings and lower technology costs, partially offset by higher volume-related expenses.\nProvisions were $8.6 billion, compared to $6.7 billion in the prior year, largely driven by higher net credit losses, partially offset by a lower ACL build for loans.\nNet credit losses of $7.6 billion increased 45%, primarily reflecting the continued maturation of multiple cards loan vintages originated in recent years. The maturation was delayed by unprecedented levels of government stimulus during the pandemic. In addition, the increase was driven by macroeconomic pressures related to the elevated inflationary and interest rate environment impacting both cards portfolios, with lower FICO band customers primarily driving the increase. Branded Cards net credit losses of $4.0 billion and Retail Services net credit losses of $3.2 billion increased 51% and 39%, respectively.\nThe net ACL build was $1.0 billion, compared to $1.5 billion in the prior year. The net ACL build on loans was primarily driven by the impact of macroeconomic pressures related to the elevated inflationary and interest rate environment, as well as growth in cards balances.\nFor additional information on Citi’s ACL, see “Significant Accounting Policies and Significant Estimates” below.\nFor additional information on USPB’s Branded Cards, Retail Services and Retail Banking loan portfolios, see “Managing Global Risk—Credit Risk—Consumer Credit” below.\nFor additional information about trends, uncertainties and risks related to USPB’s future results, see “Executive Summary” above and “Risk Factors” below.\n\n28\n\n\n\nALL OTHER—Divestiture-Related Impacts (Reconciling Items)\n\nAll Other includes activities not assigned to the reportable operating segments (Services, Markets, Banking, Wealth and USPB), which are reported within Legacy Franchises and Corporate/Other. For additional information about Legacy Franchises and Corporate/Other, see “All Other (Managed Basis)” below.\nAll Other (managed basis) results exclude divestiture-related impacts (see the “Reconciling Items” column in the table below) related to (i) Citi’s divestitures of its Asia consumer banking businesses and (ii) the planned IPO of Mexico Consumer Banking (Mexico Consumer) and Mexico Small Business and Middle-Market Banking (Mexico SBMM), collectively known as Mexico Consumer/SBMM, within Legacy Franchises. Legacy Franchises (managed basis) results also exclude these divestiture-related impacts. Certain of the results of operations of All Other (managed basis) and Legacy Franchises (managed basis) are non-GAAP financial measures (see “Overview—Non-GAAP Financial Measures” above).\nThe table below presents a reconciliation from All Other (U.S. GAAP) to All Other (managed basis). All Other (U.S. GAAP), less Reconciling Items, equals All Other (managed basis). The Reconciling Items are fully reflected on each respective line item in Citi’s Consolidated Statement of Income.\nALL OTHER—Managed Basis\n\nAt December 31, 2024, All Other (managed basis) had $201 billion in assets, primarily related to Mexico Consumer/SBMM and Asia Consumer reported within Legacy Franchises (managed basis), as well as Corporate Treasury investment securities and Citi’s deferred tax assets (DTAs) reported within Corporate/Other.\n\nLegacy Franchises (Managed Basis)\nLegacy Franchises (managed basis) includes:\n\n•Mexico Consumer/SBMM;\n•Asia Consumer Banking (Asia Consumer), representing the consumer banking operations of the remaining three exit countries (Korea, Poland and Russia); and\n•Legacy Holdings Assets, primarily $2.0 billion of legacy consumer mortgage loans in North America, as well as the U.K. retail banking business, both of which Citi continues to wind down.\n\nSince announcing its intention to exit consumer banking across 14 markets in Asia, Europe, the Middle East and Mexico as part of its strategic refresh, Citi has now closed sales in nine of those markets, has a sale process underway in Poland and has continued to make progress on its wind-downs in Korea and Russia. The previously announced wind-down of Citi’s consumer business in China is substantially complete. See Note 2 for additional information on Legacy Franchises’ consumer banking business sales and wind-downs. For additional information about Citi’s continued efforts to reduce its operations and exposures in Russia, see “Risk Factors” and “Managing Global Risk—Other Risks—Country Risk—Russia” below.\nMexico Consumer/SBMM operates primarily through Banamex and provides traditional retail banking and branded card products to consumers and small business customers and traditional middle-market banking products and services to commercial customers, as well as retirement fund administration and insurance products through certain Banamex affiliate entities. As previously disclosed, Citi completed the separation of Mexico Consumer/SBMM from its Services, Markets, Banking and Wealth businesses in Mexico in the fourth quarter of 2024, and intends to pursue an IPO of Mexico Consumer/SBMM, the timing of which will be driven by regulatory approvals and market conditions. Citi will retain its Services, Markets, Banking and Wealth businesses in Mexico.\nAt December 31, 2024, on a combined basis, Legacy Franchises (managed basis) had 1,317 retail branches, $42 billion in deposits, $16 billion in retail banking loans and $8 billion in outstanding credit card balances, while Mexico SBMM had $6 billion in outstanding corporate loans. For additional information on the loans and deposits of Mexico Consumer/SBMM and Asia Consumer, see “Mexico Consumer/SBMM—” and “Asia Consumer—key indicators” in the table below.\n\nCorporate/Other\nCorporate/Other includes certain unallocated costs of global staff functions (including finance, risk, human resources, legal and compliance-related costs), other corporate expenses and unallocated global operations and technology expenses and income taxes, as well as results of Corporate Treasury investment activities and discontinued operations.\n\n2024 vs. 2023\nNet loss was $2.4 billion, compared to a net loss of $2.1 billion in the prior year, driven by lower revenues and lower income tax benefits due to the absence of discrete tax benefits recognized in the prior year, partially offset by lower expenses and lower cost of credit.\nAll Other (managed basis) revenues of $7.5 billion decreased 20%, driven by lower revenues in Corporate/Other and Legacy Franchises (managed basis).\nLegacy Franchises (managed basis) revenues of $6.9 billion decreased 6%, due to lower revenues in Asia Consumer (managed basis) and Legacy Holdings Assets, partially offset by higher revenues in Mexico Consumer/SBMM (managed basis).\nMexico Consumer/SBMM (managed basis) revenues of $6.2 billion increased 8%, primarily due to higher loan balances in retail banking, cards and SBMM, and higher deposits in SBMM.\nAsia Consumer (managed basis) revenues of $819 million decreased 46%, primarily driven by the reduction from the closed exits and wind-downs.\nLegacy Holdings Assets revenues decreased to $(118) million, compared to $110 million in the prior year, primarily due to higher funding costs related to the transfer of the retail banking business in the U.K.\nCorporate/Other revenues decreased to $668 million, compared to $2.1 billion in the prior year, largely driven by the net investment securities losses due to the repositioning of the investment securities portfolio and higher funding costs.\n\nExpenses decreased 19%, primarily driven by lower FDIC expenses ($203 million in 2024 versus approximately $1.7 billion in the prior year) and the reduction from the closed exits and wind-downs, as well as lower restructuring charges ($259 million in 2024 versus $781 million in the prior year), partially offset by the costs of the July 2024 Consent Orders entered into with the FRB and OCC.\nProvisions were $1.1 billion, compared to $1.3 billion in the prior year, largely driven by a smaller ACL build for transfer risk associated with exposures outside the U.S., driven by safety and soundness considerations under U.S. banking law, partially offset by a 7% increase in net credit losses, primarily driven by the ongoing normalization from post-pandemic lows in Mexico Consumer.\nFor additional information on Citi’s ACL, see “Significant Accounting Policies and Significant Estimates” below.\nFor additional information about trends, uncertainties and risks related to All Other’s (managed basis) future results, see “Executive Summary” above and “Risk Factors” and “Managing Global Risk—Other Risks—Country Risk—Russia” below.\n\nScenario Weighting\nCiti’s ACL is estimated using three probability-weighted macroeconomic scenarios—base, upside and downside. The macroeconomic scenario weights are estimated using a statistical model, which, among other factors, takes into consideration key macroeconomic drivers of the ACL, severity of the scenario and other macroeconomic uncertainties and risks. Citi evaluates scenario weights on a quarterly basis.\nCiti’s downside scenario incorporates more adverse macroeconomic assumptions than the base scenario. For example, compared to the base scenario, Citi’s downside scenario reflects a recession, including an elevated average U.S. unemployment rate of 6.8% over the eight-quarter R&S period, with a peak difference of 3.4% in the second quarter of 2026. The downside scenario also reflects a year-over-year U.S. real GDP contraction in 2025 of 1.8%, with a peak quarter-over-quarter difference to the base scenario of 1.3%.\nCiti’s ACL is sensitive to the various macroeconomic scenarios that drive the quantitative component of expected credit losses, due to changes in the length and severity of forecasted economic variables or events in the respective scenarios. Citi’s downside scenario incorporates more adverse macroeconomic assumptions than the weighted scenario assumptions. To demonstrate this sensitivity, if Citi applied\n130\n\n\n100% weight to the downside scenario as of December 31, 2024 to reflect the most severe economic deterioration forecast in the macroeconomic scenarios, there would have been a hypothetical incremental increase in the ACL of approximately $5.3 billion related to lending exposures, except for loans individually evaluated for credit losses and other financial assets carried at amortized cost.\nThis analysis does not incorporate any impacts or changes to the qualitative component of the ACL. These factors could change the outcome of the sensitivity analysis based on historical experience and current conditions at the time of the assessment. Given the uncertainty inherent in macroeconomic forecasting, Citi continues to believe that its ACL estimate based on a three probability-weighted macroeconomic scenario approach combined with the qualitative component remains appropriate as of December 31, 2024.\n\n4Q24 Changes in the ACL\nAs further discussed below, Citi’s ending ACL balance for the fourth quarter of 2024 was $22.2 billion, a slight increase from September 30, 2024. The net build of $0.3 billion in the quarter was primarily driven by growth in cards balances in USPB. Citi believes its analysis of the ACL reflects the forward view of the economic environment as of December 31, 2024. See Note 16 for additional information.\n\nConsumer Allowance for Credit Losses on Loans\nCiti’s consumer ACLL is largely driven by U.S. cards (Branded Cards and Retail Services) in USPB. Citi’s total consumer ACLL build was $0.3 billion in the fourth quarter of 2024, primarily driven by growth in U.S. cards balances. This resulted in a December 31, 2024 ACLL balance of $16.0 billion, or 4.08% of total funded consumer loans.\nFor U.S. cards, the level of reserves relative to total funded loans decreased to 7.93% at December 31, 2024, due to seasonal improvement, compared to 8.15% at September 30, 2024. For the remaining consumer exposures, the level of reserves relative to total funded loans was 1.11% at December 31, 2024, compared to 1.08% at September 30, 2024.\n\nCorporate Allowance for Credit Losses on Loans\nCiti had a corporate ACLL release of less than $0.1 billion in the fourth quarter of 2024, largely driven by a release for specific risks and uncertainties impacting vulnerable industries and regions in Banking and lower transfer risk associated with exposures outside the U.S., driven by safety and soundness considerations under U.S. banking law in Services, partially offset by a build for changes in portfolio composition in Markets. This resulted in a December 31, 2024 ACLL balance of $2.6 billion, or 0.87% of total funded corporate loans.\n\nACLUC\nCiti had an ACLUC release of $0.1 billion in the fourth quarter of 2024, largely driven by a release for specific risks and uncertainties impacting vulnerable industries and regions. The ACLUC reserve balance, included in Other liabilities, was $1.6 billion at December 31, 2024.\n\n\nACL on Other Financial Assets\nCiti had an ACL build of $0.1 billion on other financial assets carried at amortized cost for the fourth quarter of 2024, primarily due to an increase in transfer risk associated with unremittable corporate dividends outside the U.S. being held on behalf of clients, driven by safety and soundness considerations under U.S. banking law. Including FX/Other, the ACL reserve balance of $2.0 billion remained unchanged from September 30, 2024. See Note 16 for additional information.\n\nRegulatory Capital Impact\nCiti elected the modified CECL transition provision for regulatory capital purposes provided by the U.S. banking agencies’ final rule. Accordingly, the Day One regulatory capital effects resulting from the adoption of CECL, as well as the ongoing adjustments for 25% of the change in CECL-based allowances in each quarter between January 1, 2020 and December 31, 2021, started to be phased in on January 1, 2022 and were fully reflected in Citi’s regulatory capital as of January 1, 2025.\n\nSee Notes 1 and 16 for a further description of the ACL and related accounts.\n\nGoodwill\nCiti tests for goodwill impairment annually as of October 1 (the annual test) and conducts interim assessments between annual tests if an event occurs or circumstances change that would more-likely-than-not reduce the fair value of a reporting unit below its carrying amount. These events or circumstances include, among other things, a significant adverse change in the business climate, a decision to sell or dispose of all or a significant portion of a reporting unit or a sustained decrease in Citi’s stock price.\nCitigroup’s activities were conducted through the reportable operating segments: Services, Markets, Banking, Wealth and USPB, with the remaining operations recorded in All Other, which includes activities not assigned to a specific operating segment as well as discontinued operations. Goodwill impairment testing is performed at the level below the operating segment (referred to as a reporting unit).\nCiti performed its annual goodwill impairment test, which resulted in no impairment of any of Citi’s reporting units’ goodwill. No additional triggering events were identified and no goodwill was impaired during 2024. For each of the Company’s reporting units, fair value exceeded carrying value by at least 10%.\nCiti utilizes allocated tangible common equity as a proxy for the carrying value of its reporting units for purposes of goodwill impairment testing. The allocated equity in the reporting units is determined based on the capital the business would require if it were operating as a standalone entity, incorporating sufficient capital to be in compliance with both current and expected regulatory capital requirements, including capital for specifically identified goodwill and intangible assets. The capital allocated to the reporting units is incorporated into the annual budget process, which is approved by Citigroup’s Board of Directors.\n131\n\n\nGoodwill impairment testing involves management judgment, requiring an assessment of whether the carrying value of a reporting unit can be supported by its fair value using widely accepted valuation techniques, such as the market approach (earnings multiples and/or transaction multiples) and/or the income approach (discounted cash flow (DCF) method). In applying these methodologies, Citi utilizes a number of factors, including actual operating results, future business plans, economic projections and market data.\nCiti engaged an independent valuation specialist to assist in Citi’s valuation of all the reporting units, primarily employing both the income and market approach to determine the fair value of the reporting units. The income approach utilized discount rates that Citi believes adequately reflected the risk and uncertainty in the financial markets in the internally generated cash flow projections. The market approach utilizes observable market data from comparable publicly traded companies, such as price-to-earnings or price-to-tangible book value ratios, to estimate a reporting unit’s fair value. Management uses judgment in the selection of comparable companies and includes those with the most similar business activities.\nThe income approach employs a capital asset pricing model in estimating the discount rate. Since none of the Company’s reporting units are publicly traded, individual reporting unit fair value determinations cannot be directly correlated to Citigroup’s common stock price. The sum of the fair values of the reporting units exceeded the overall market capitalization of Citi as of October 1, 2024. However, Citi believes that it is not meaningful to reconcile the sum of the fair values of the Company’s reporting units to its market capitalization due to several factors. The market capitalization of Citigroup reflects the execution risk in a transaction involving Citigroup due to its size. However, the individual reporting units’ fair values are not subject to the same level of execution risk or a business model that is as global. In addition, the market capitalization of Citigroup does not include consideration of the individual reporting unit’s control premium.\nUnanticipated declines in business performance, increases in credit losses, increases in capital requirements and adverse regulatory or legislative changes, as well as deterioration in economic or market conditions, are factors that could result in a material impairment loss to earnings in a future period related to some portion of the associated goodwill. See Notes 1 and 17 for additional information on goodwill, including the changes in the goodwill balance year-over-year and the segments’ goodwill balances as of December 31, 2024.\n\nLitigation Accruals\nSee the discussion in Note 30 for Citi’s policies on establishing accruals for litigation and regulatory contingencies.\n\n\nIncome Taxes\n\nOverview\nCiti is subject to the income tax laws of the U.S., its states and local municipalities and the non-U.S. jurisdictions in which Citi operates. These tax laws are complex and are subject to differing interpretations by the taxpayer and the relevant governmental taxing authorities. Disputes over interpretations of the tax laws may be subject to review and adjudication by the court systems of the various tax jurisdictions or may be settled with the taxing authority upon audit.\nIn establishing a provision for income tax expense, Citi must make judgments and interpretations about the application of these inherently complex tax laws. Citi must also make estimates about when in the future certain items will affect taxable income in the various tax jurisdictions, both domestic and foreign. Deferred taxes are recorded for the future consequences of events that have been recognized in the financial statements or tax returns, based on enacted tax laws and rates. Deferred tax assets (DTAs) are recognized subject to management’s judgment that realization is more-likely-than-not. For example, if it is more-likely-than-not that a carry-forward would expire unused, Citi would set up a valuation allowance against that DTA. Citi has established valuation allowances as described below.\nAs a result of the Tax Cuts and Jobs Act (Tax Reform), beginning in 2018, Citi is taxed on income generated by its U.S. operations at a federal tax rate of 21%. The effect on Citi’s state tax rate is dependent upon how and when the individual states that have not yet addressed the federal tax law changes choose to adopt the various new provisions of the U.S. Internal Revenue Code.\nCiti’s non-U.S. branches and subsidiaries are subject to tax at their local tax rates. Non-U.S. branches also continue to be subject to U.S. taxation. The impact of this on Citi’s earnings depends on the level of branch pretax income, the local branch tax rate, and allocations of overall domestic loss (ODL) and expenses for U.S. tax purposes to branch earnings. Citi expects no residual U.S. tax on such earnings. With respect to non-U.S. subsidiaries, dividends from these subsidiaries will be excluded from U.S. taxation. While the majority of Citi’s non-U.S. subsidiary earnings are classified as global intangible low-taxed income (GILTI), Citi expects no material residual U.S. tax on such earnings based on its non-U.S. subsidiaries’ local tax rates, which exceed, on average, the effective 13.125% GILTI tax rate. Finally, Citi does not expect the base erosion anti-abuse tax (BEAT) to affect its tax provision.\nOn January 4, 2022, final FTC regulations were published in the Federal Register, which eliminate the creditability of foreign taxes paid in certain situations. These include countries that do not align with U.S. tax principles in significant part and for services performed outside the recipient country. In 2023, the IRS announced that the effective date of these regulations was deferred until the IRS gives notice otherwise. The impact on Citi’s effective tax rate is not expected to be material.\n\n132\n\n\nThe Inflation Reduction Act was signed into law on August 16, 2022. The Act includes a new corporate alternative minimum tax (AMT) and a 1% excise tax on share repurchases, both effective January 1, 2023. The corporate AMT is a 15% minimum tax on financial statement income after adjusting for foreign taxes paid. Corporate AMT paid in one year is creditable against regular corporate tax liability in future years. Citi does not expect to pay material amounts of corporate AMT given its profitability and tax profile.\nThe 1% excise tax is a non-deductible tax on the fair market value of stock repurchased in the taxable year, reduced by the fair market value of any stock issued in the same year. See Note 11 for the 2024 impact on earnings per share related to the excise tax.\n\nDeferred Tax Assets and Valuation Allowances (VA)\nAt December 31, 2024, Citi had net DTAs of $29.8 billion. In the fourth quarter of 2024, Citi’s DTAs decreased by $0.2 billion, primarily as a result of the geographic mix of earnings. On a full-year basis, Citi’s DTAs increased by $0.2 billion from $29.6 billion at December 31, 2023.\nOf Citi’s total net DTAs of $29.8 billion as of December 31, 2024, $12.8 billion, primarily related to tax carry-forwards, was deducted in calculating Citi’s regulatory capital. Net DTAs arising from temporary differences are also deducted from regulatory capital if in excess of the 10%/15% limitations (see “Capital Resources” above). For the quarter and year ended December 31, 2024, Citi had $3.0 billion of disallowed temporary difference DTAs (included in the $12.8 billion above). The remaining $17.0 billion of net DTAs as of December 31, 2024 was not deducted in calculating regulatory capital pursuant to Basel III standards and was appropriately risk weighted under those rules.\nCiti’s total VA at December 31, 2024 was $4.3 billion, an increase of $0.7 billion from $3.6 billion at December 31, 2023. The increase was primarily driven by the generation of current-year FTCs in the branch basket. Citi’s VA of $4.3 billion is composed of $3.3 billion on its FTC branch basket carry-forwards, $0.6 billion on its U.S. residual DTA related to its non-U.S. branches, $0.3 billion on local non-U.S. DTAs and $0.1 billion on state net operating loss carry-forwards.\nAs stated above with regard to the impact of non-U.S.\nbranches on Citi’s earnings, the level of branch pretax income, the local branch tax rate and the allocations of ODL and expenses for U.S. tax purposes to the branch basket are the\nmain factors in determining the branch VA. Additional ODL\nwas created in 2024 as a result of reduced taxable income.\nRecognized FTC carry-forwards in the general basket comprised approximately $0.7 billion of Citi’s DTAs as of December 31, 2024, compared to approximately $1.2 billion as of December 31, 2023. The decrease in FTCs year-over-year was primarily due to current-year usage. The FTC carry-forward period represents the most time-sensitive component of Citi’s DTAs.\nCiti had an ODL of approximately $9 billion at December 31, 2024, which allows Citi to elect a percentage between 50% and 100% of future years’ domestic source income to be reclassified as foreign source income. (See Note 10 for a description of the ODL.)\n\nThe majority of Citi’s U.S. federal net operating loss carry-forward and all of its New York State and City net operating loss carry-forwards are subject to a carry-forward period of 20 years. This provides enough time to fully utilize the net DTAs pertaining to these existing net operating loss carry-forwards. This is due to Citi’s forecast of sufficient U.S. taxable income and the continued taxation of Citi’s non-U.S. income by New York State and City.\nAlthough realization is not assured, Citi believes that the realization of its recognized net DTAs of $29.8 billion at December 31, 2024 is more-likely-than-not, based on management’s expectations as to future taxable income in the jurisdictions in which the DTAs arise, as well as available tax planning strategies (as defined in ASC Topic 740, Income Taxes). Citi has concluded that it has the necessary positive evidence to support the realization of its net DTAs after taking its VAs into consideration.\nSee Note 10 for additional information on Citi’s income taxes, including its income tax provision, tax assets and liabilities and a tabular summary of Citi’s net DTAs balance as of December 31, 2024 (including the FTCs and applicable expiration dates of the FTCs). For information on Citi’s ability to use its DTAs, see “Risk Factors—Strategic Risks” above and Note 10.\n\nAccounting Changes\nSee Note 1 for a discussion of changes in accounting standards.\n\n\nDISCLOSURE CONTROLS AND PROCEDURES\n\nCiti’s disclosure controls and procedures are designed to ensure that information required to be disclosed under the Securities Exchange Act of 1934, as amended, is recorded, processed, summarized and reported within the time periods specified in the SEC’s rules and forms, including without limitation that information required to be disclosed by Citi in its SEC filings is accumulated and communicated to management, including the Chief Executive Officer (CEO) and Chief Financial Officer (CFO), as appropriate, to allow for timely decisions regarding required disclosure.\nCiti’s Disclosure Committee assists the CEO and CFO in their responsibilities to design, establish, maintain and evaluate the effectiveness of Citi’s disclosure controls and procedures. The Disclosure Committee is responsible for, among other things, the oversight, maintenance and implementation of the disclosure controls and procedures, subject to the supervision and oversight of the CEO and CFO.\nCiti’s management, with the participation of its CEO and CFO, has evaluated the effectiveness of Citigroup’s disclosure controls and procedures (as defined in Rule 13a-15(e) under the Securities Exchange Act of 1934) as of December 31, 2024. Based on that evaluation, the CEO and CFO have concluded that at that date Citigroup’s disclosure controls and procedures were effective.\n\n133\n\n\n\nMANAGEMENT’S ANNUAL REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\n\nCiti’s management is responsible for establishing and maintaining adequate internal control over financial reporting. Citi’s internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of its financial reporting and the preparation of financial statements for external reporting purposes in accordance with U.S. generally accepted accounting principles. Citi’s internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of Citi’s assets, (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles and that Citi’s receipts and expenditures are made only in accordance with authorizations of Citi’s management and directors, and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of Citi’s assets that could have a material effect on its financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect all misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions or that the degree of compliance with the policies or procedures may deteriorate.\n\n\nCiti’s management assessed the effectiveness of Citigroup’s internal control over financial reporting as of December 31, 2024 based on the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control—Integrated Framework (2013). Based on this assessment, management has concluded that, as of December 31, 2024, Citi’s internal control over financial reporting was effective. In addition, there were no changes in Citi’s internal control over financial reporting during the fiscal quarter ended December 31, 2024 that materially affected, or are reasonably likely to materially affect, Citi’s internal control over financial reporting.\nThe effectiveness of Citi’s internal control over financial reporting as of December 31, 2024 has been audited by KPMG LLP, Citi’s independent registered public accounting firm, as stated in their report below, which expressed an unqualified opinion on the effectiveness of Citi’s internal control over financial reporting as of December 31, 2024.134\nFORWARD-LOOKING STATEMENTS\nCertain statements in this report, including but not limited to statements included within the Management’s Discussion and Analysis of Financial Condition and Results of Operations, are “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. In addition, Citigroup may make forward-looking statements in its other documents filed or furnished with the SEC, and its management may make forward-looking statements orally to analysts, investors, representatives of the media and others.\nGenerally, forward-looking statements are not based on historical facts but instead represent Citigroup’s and its management’s beliefs regarding future events. Such statements may be identified by words such as believe, expect, anticipate, intend, estimate, may increase, may fluctuate, target, outlook, guidance and illustrative, and similar expressions or future or conditional verbs such as will, should, would and could.\nSuch statements are based on management’s current expectations and are subject to risks, uncertainties and changes in circumstances. Actual results of operations and financial conditions, including capital and liquidity, may differ materially from those included in these statements due to a variety of factors, including without limitation (i) the precautionary statements included within the “Executive Summary,” “Citi’s Multiyear Transformation” and each business’s discussion and analysis of its results of operations and (ii) the factors listed and described under “Risk Factors” above.\nAny forward-looking statements made by or on behalf of Citigroup speak only as to the date they are made, and Citi does not undertake to update forward-looking statements to reflect the impact of circumstances or events that arise after the date that the forward-looking statements were made.135",
    "item1a": "RISK FACTORS\n\n    The following discussion presents what management currently believes could be the material risks and uncertainties that could impact Citi’s businesses, results of operations and financial condition. Other risks and uncertainties, including those not currently known to Citi or its management, could also negatively impact Citi’s businesses, results of operations and financial condition. Thus, the following should not be considered a complete discussion of all of the risks and uncertainties that Citi may face. For additional information about risks and uncertainties that could impact Citi, see “Executive Summary,” “Citi’s Multiyear Transformation” and each respective business’s results of operations above and “Managing Global Risk” below. The following risk factors are categorized to improve the readability and usefulness of the risk factor disclosure, and, while the headings and risk factors generally align with Citi’s risk categorization, in certain instances the risk factors may not directly correspond with how Citi categorizes or manages its risks.\n\n    MARKET-RELATED RISKS\n\n    Macroeconomic, Geopolitical and Other Challenges and Uncertainties Could Continue to Have a Negative Impact on Citi.\n    Citi has experienced, and could experience in the future, negative impacts to its businesses, results of operations and financial condition as a result of various macroeconomic, geopolitical and other challenges, uncertainties and volatility. These include, among other things, any resurgence in inflation; government fiscal and monetary actions or expected actions, including changes in interest rate policy, reductions in central bank balance sheets or other monetary policies; and increases in unemployment rates, recessions or weak or slowing economic growth in the U.S., Europe and other regions or countries. These impacts could adversely affect Citi’s consumer and institutional clients, businesses, cost of credit and overall results of operations.\n    For example, inflation could resurge if the FRB were to reduce interest rates prematurely and/or at too accelerated a pace, or if certain policies were further pursued in the U.S., including those related to trade, tariffs and immigration.\n    Interest rates on loans Citi makes are typically based off or set at a spread over a benchmark interest rate and would likely decline or rise as benchmark rates decline or rise, respectively. A decline in interest rates would generally be expected to result in lower overall net interest income for Citi, although Corporate Treasury has various tools to manage Citi’s total interest rate risk position (see “Managing Global Risk— Market Risk—Market Risk of Non-Trading Portfolios” below). In addition, Citi’s net interest income could be adversely affected due to a flattening (a lower spread between shorter-term versus longer-term interest rates) or inversion (shorter-term interest rates exceeding longer-term interest rates) of the interest rate yield curve, as Citi typically pays interest on deposits based on shorter-term interest rates and earns money on loans based on longer-term interest rates. For additional information on Citi’s interest rate risk, see\n    “Managing Global Risk—Market Risk—Banking Book Interest Rate Risk” below.\n    Additional areas of uncertainty include, among others, geopolitical challenges, tensions and conflicts, including those related to the Russia–Ukraine war (see below) and conflicts in the Middle East; potential policies and priorities resulting from the new U.S. administration; economic and geopolitical challenges related to China, including weak economic growth, related policy actions, challenges in the Chinese real estate sector, banking and credit markets, trade restrictions, and tensions or conflicts between China and Taiwan and/or China and the U.S.; high and rising government debt levels in the U.S. and other countries; significant volatility and disruptions in financial markets, including foreign currency volatility and devaluations; natural disasters; and pandemics.\n    For example, the Russia–Ukraine war could have further negative impacts on regional and global energy and other commodities and financial markets and macroeconomic conditions, adversely impacting jurisdictions where Citi operates and its customers, clients or employees. In addition, Citi’s remaining operations in Russia subject Citi to various other risks, including foreign currency volatility, such as appreciations or devaluations; restrictions arising from retaliatory Russian laws and regulations on the conduct of Citi’s remaining businesses, including, without limitation, its provision of certain securities services to customers; sanctions or asset freezes; and other deconsolidation events. For additional information about these Russia-related risks, see the operational processes and systems, cybersecurity and emerging markets risk factors and “Managing Global Risk—Other Risks—Country Risk—Russia” below.\n\n    STRATEGIC RISKS\n\n    Citi’s Ability to Return Capital to Common Shareholders Substantially Depends on Regulatory Capital Requirements, Including the Results of the CCAR Process and Dodd-Frank Act Regulatory Stress Tests, and Other Factors.\n    Citi’s ability to return capital to its common shareholders consistent with its capital planning efforts and targets, whether through its common stock dividend or through share repurchases, substantially depends, among other things, on its regulatory capital requirements, including the annual recalibration of the Stress Capital Buffer (SCB), which is based upon the results of the CCAR process required by the FRB, and recalibration of the GSIB surcharge, as well as the supervisory expectations and assessments regarding individual institutions.\n    The FRB’s annual stress testing requirements are integrated into ongoing regulatory capital requirements. Citi’s SCB equals the maximum projected decline in its CET1 Capital ratio under the supervisory severely adverse scenario over a nine-quarter CCAR measurement period, plus four quarters of planned common stock dividends as a percentage of Citi’s risk-weighted assets, subject to a minimum requirement of 2.5%. The SCB is calculated by the FRB using its proprietary data and modeling of each firm’s results. Accordingly, Citi’s SCB may go up, based on the supervisory stress test results, thus potentially resulting in an increase in Citi’s required regulatory CET1 Capital ratio under the\n    50\n\n    Standardized Approach. In addition, a breach of the SCB and other regulatory capital buffers may result in gradual limitations on capital distributions and discretionary bonus payments to executive officers. For additional information on the SCB, see “Capital Resources—Regulatory Capital Buffers” above.\n    Moreover, changes in regulatory capital rules, requirements or interpretations could materially increase Citi’s required regulatory capital. For example, the U.S. banking regulators proposed a number of changes to the U.S. regulatory capital framework, including, but not limited to, significant revisions to the U.S. Basel III rules. These potential changes, if adopted as originally proposed, would likely impact Citi’s regulatory capital position and materially increase Citi’s regulatory capital requirements, and thus adversely impact the extent to which Citi is able to return capital to shareholders (see “Capital Resources—Regulatory Capital Standards and Developments” above).\n    Citi’s ability to return capital also depends on its results of operations and financial condition, including the capital impact related to its remaining divestitures, such as, among other things, any temporary capital impact from CTA losses, net of hedges (see the incorrect assumptions or estimates and the emerging markets risk factors below); Citi’s effectiveness in planning, managing and calculating its level of regulatory capital and risk-weighted assets under both the Advanced Approaches and the Standardized Approach, as well as the Supplementary Leverage ratio (SLR); its implementation and maintenance of an effective capital planning process and management framework; forecasts of macroeconomic conditions; and deferred tax asset (DTA) utilization (see the ability to utilize DTA risk factor below).\n    All firms subject to CCAR requirements, including Citi, will continue to be subject to a rigorous regulatory evaluation of capital planning practices and other reviews and examinations, including, but not limited to data quality, which is a key regulatory focus, governance, risk management and internal controls. For example, the FRB has stated that it expects capital adequacy practices to continue to evolve and to likely be determined by its yearly cross-firm review of capital plan submissions. Similarly, the FRB has indicated that, as part of its stated goal to continually evolve its annual stress testing requirements, several parameters of the annual stress testing process may continue to be altered, including the number and severity of the stress test scenarios, the FRB modeling of Citi’s balance sheet, pre-provision net revenue and stress losses, and the addition of components deemed important by the FRB. Additionally, Citi’s ability to return capital may be adversely impacted if a regulatory evaluation or examination were to result in negative findings regarding absolute capital levels or other aspects of Citi’s or any of its subsidiaries’ operations, including as a result of the imposition of additional capital buffers, limitations on capital distributions or otherwise. For information on limitations on Citi’s ability to return capital to common shareholders, as well as the CCAR process, supervisory stress test requirements and GSIB surcharge, see “Capital Resources—Overview” and “Capital Resources—Stress Testing Component of Capital Planning” above and the risk management and legal and regulatory proceedings risk factors below.\n    In October 2024, the FRB announced that it will maintain its current framework for calculating allowances on loans in the supervisory stress test through the 2025 stress test cycle, while continuing to evaluate appropriate future enhancements to this framework. The impacts on Citi’s capital adequacy of any potential incorporation by the FRB of CECL into its supervisory stress tests in future stress test cycles, and of other potential regulatory changes in the FRB’s stress testing methodologies, remain unclear. For additional information regarding the CECL methodology, including the transition provisions related to the adverse regulatory capital effects resulting from adoption of the CECL methodology, see “Capital Resources—Current Regulatory Capital Standards—Regulatory Capital Treatment—Modified Transition of the Current Expected Credit Losses Methodology” above and Note 1.\n    Although various uncertainties exist regarding the extent of, and the ultimate impact to Citi from, changes to regulatory capital, results from the FRB’s stress testing and CCAR regimes, and regulatory evaluation or examination findings, these changes could increase the level of capital Citi is required or elects to hold, including as part of Citi’s management buffer, thus potentially adversely impacting the extent to which Citi is able to return capital to shareholders.\n\n    Citi Must Continually Review, Analyze and Successfully Adapt to Ongoing Regulatory and Legislative Uncertainties and Changes in the U.S. and Globally.\n    Citi, its management and its businesses continue to face regulatory and legislative uncertainties and changes, both in the U.S. and globally. While the ongoing regulatory and legislative uncertainties and changes facing Citi are too numerous to list completely, examples include, but are not limited to (i) potential changes to various aspects of the U.S. regulatory capital framework and requirements applicable to Citi, including, among others, significant revisions to the U.S. Basel III rules (see the capital return risk factor and “Capital Resources—Regulatory Capital Standards and Developments” above) and (ii) potential fiscal, monetary, tax, sanctions, human capital and other changes promulgated by the U.S. federal government and other governments (see the macroeconomic and geopolitical risk factor above and the ability to utilize DTAs risk factor below). References to “regulatory” refer to both formal regulation and the views and expectations of Citi’s regulators in their supervisory and enforcement roles, which, as they change over time, can have a major impact. In particular, U.S. regulators have indicated that the level of their expectations is increasing and prompt negative examination findings/ratings and enforcements actions are more likely.\n    Additionally, U.S. and international regulatory and legislative initiatives have not always been undertaken or implemented on a coordinated basis, and areas of divergence have developed and continue to develop with respect to their scope, interpretation, timing, structure or approach, leading to inconsistent or even conflicting requirements, including within a single jurisdiction.\n    Further, ongoing regulatory and legislative uncertainties and changes make Citi’s long-term business, balance sheet and strategic budget planning difficult, subject to change and\n    51\n\n    potentially more costly and may impact its results of operations. U.S. and other regulators globally have implemented and continue to discuss various changes to certain regulatory requirements, which would require ongoing assessment by management as to the impact to Citi, its businesses and business planning. Business planning must necessarily be based on possible or proposed rules or outcomes, which can change significantly upon finalization, or upon implementation or interpretive guidance from numerous regulatory bodies worldwide, and such guidance can change. Regulatory and legislative changes have also significantly increased Citi’s compliance risks and costs (see the implementation and interpretation of regulatory changes risk factor below) and can adversely affect Citi’s competitive position, as well as its businesses, revenues, results of operations and financial condition.\n\n    Citi’s Ability to Achieve Its Objectives from Its Transformation, Simplification and Other Priorities May Not Be as Successful as It Projects or Expects.\n    As part of its multiyear transformation, Citi continues to make significant investments and undertake substantial actions across the Company to improve its risk and controls environment, modernize its data and technology infrastructure and further enhance safety and soundness (see “Executive Summary” and “Citi’s Multiyear Transformation” above and the legal and regulatory proceedings risk factor below).\n    Citi has also been pursuing overall simplification initiatives that have included management and operating model changes and actions to enhance focus on clients and reduce expenses. Citi’s simplification actions also include completing its remaining divestitures, including the planned IPO of Mexico Consumer/SBMM. These simplification initiatives involve various execution challenges, may take longer than expected and may result in higher than expected expenses, CTA and other losses or other negative financial or strategic impacts, which could be material, and litigation and regulatory scrutiny (for information about potential CTA impacts, see the capital return risk factor above and the incorrect assumptions or estimates and emerging markets risk factors below).\n    Additionally, Citi continues to make business-led investments, as part of the execution of its strategic priorities. For example, Citi has been making investments across the Company, including hiring front office employees in key strategic markets and businesses; enhancing product capabilities and platforms to grow key businesses, improve client digital experiences and add scalability; and implementing new capabilities and partnerships. These business-led investments are designed to reduce expenses and grow revenues as well as result in retention and efficiency improvements.\n    Citi’s transformation, as well as its simplification and business investment initiatives, involve significant complexities and uncertainties. In addition, there is inherent risk that these initiatives will not be as productive or effective as Citi expects, or at all. Conversely, failure to adequately invest in and upgrade Citi’s technology and processes or properly implement its enterprise-wide simplification could result in Citi’s inability to meet regulatory expectations, be\n    sufficiently competitive, serve clients effectively and avoid disruptions to its businesses and operational errors (see the operational processes and systems and legal and regulatory proceedings risk factors below).\n    Citi’s ability to achieve its expected returns, including expense savings and revenue growth objectives, and operational improvements from these priorities depends, in part, on factors that it cannot control, including, among others, macroeconomic challenges and uncertainties; customer, client and competitor actions; and ongoing regulatory requirements or changes.\n    Moreover, Citi’s transformation, simplification and other priorities may continue to evolve as its business strategies, the market environment and regulatory expectations change, which could make the initiatives more costly and more challenging to implement, and limit their effectiveness.\n\n    Climate Change Presents Various Financial and Non-Financial Risks to Citi and Its Customers and Clients.\n    Climate change presents both immediate and long-term risks to Citi and its customers and clients, with the risks expected to increase over time. Climate risks can arise from both physical risks (those risks related to the physical effects of climate change) and transition risks (risks related to regulatory, market, technological, stakeholder and legal changes from a transition to a low-carbon economy). Physical and transition risks can manifest themselves differently across Citi’s risk categories in the short, medium and long terms.\n    Physical risks from climate change include acute risks, such as wildfires, hurricanes, floods and droughts, as well as consequences of chronic changes in climate, such as rising sea levels, prolonged droughts and systemic changes to geographies and any resulting population migration. For example, physical risks could have adverse financial, operational and other impacts on Citi, both directly on its business and operations, and indirectly as a result of impacts to Citi’s clients, customers, vendors and other counterparties. These impacts can include destruction, damage or impairment of owned or leased properties and other assets, destruction or deterioration of the value of collateral, such as real estate, disruptions to business operations and supply chains, and reduced availability or increase in the cost of insurance. Physical risks can also impact Citi’s credit risk exposures, for example, in its mortgage and commercial real estate lending businesses.\n    Transition risks may arise from changes in regulations or market preferences toward low-carbon industries or sectors, which in turn could have negative impacts on asset values, results of operations or the reputations of Citi and its customers and clients. For example, Citi’s corporate credit exposures include oil and gas, power and other industries that may experience reduced demand for carbon-intensive products due to the transition to a low-carbon economy. Failure to adequately consider transition risk in developing and executing on its business strategy could lead to a loss of market share, lower revenues and higher credit costs. Transition risks also include potential increased operational, compliance and energy costs driven by government policies to promote decarbonization.\n    52\n\n    Moreover, increasing legislative and regulatory changes and uncertainties regarding climate-related risk management and disclosures may result in increased regulatory, compliance, credit, reputational and other risks and costs for Citi. In addition, Citi could face increased regulatory scrutiny and reputation and litigation risks as a result of its climate risk, sustainability and other environmental and social commitments, disclosures, marketing and positioning. For example, any actual or perceived overstatement of the environmental benefits of Citi’s actions may result in legal or regulatory actions and/or reputational harm.\n    Even as some regulators seek to mandate additional disclosure of climate-related information, Citi’s ability to comply with such requirements and conduct more robust climate-related risk analyses may be hampered by lack of information and reliable data. Data on climate-related risks is limited in availability, often based on estimated or unverified figures, collected and reported on a time-lag, and variable in quality. Modeling capabilities to analyze climate-related risks and interconnections continue to evolve.\n    Additionally, if Citi is unable to achieve its objectives or commitments relating to climate change, its businesses, reputation, attractiveness to certain investors and efforts to recruit and retain employees may suffer. For example, Citi’s approach to supporting client decarbonization in a gradual and orderly way, while promoting energy security, may lead to both continued exposure to carbon-intensive activity and increased reputation risks from stakeholders with divergent points of view. Citi may also face challenges and scrutiny from stakeholders with varied views on climate change that may impact its ability to conduct certain business.\n    For information on Citi’s climate and other sustainability initiatives, see “Net Zero and Sustainability” below. For additional information on Citi’s management of climate risk, see “Managing Global Risk—Strategic Risk—Climate Risk” below.\n\n    Citi’s Ability to Utilize Its DTAs, and Thus Reduce the Negative Impact of the DTAs on Citi’s Regulatory Capital, Will Be Driven by Its Ability to Generate U.S. Taxable Income.\n    At December 31, 2024, Citi’s net DTAs were $29.8 billion, net of a valuation allowance of $4.3 billion, of which $12.8 billion was deducted from Citi’s CET1 Capital under the U.S. Basel III rules. Of this deducted amount, $11.6 billion related to net operating losses, foreign tax credit and general business credit carry-forwards, with $3.0 billion related to temporary differences in excess of the 10%/15% regulatory limitations, reduced by $1.8 billion of deferred tax liabilities, primarily associated with goodwill and certain other intangible assets that were separately deducted from capital.\n    Citi’s overall ability to realize its DTAs will primarily be dependent upon Citi’s ability to generate U.S. taxable income in the relevant reversal periods. Failure to realize any portion of the net DTAs would have a corresponding negative impact on Citi’s net income and financial returns.\n    The accounting treatment for realization of DTAs is complex and requires significant judgment and estimates regarding future taxable earnings in the jurisdictions in which the DTAs arise and available tax planning strategies. Forecasts\n    of future taxable earnings will depend upon various factors, including, among others, macroeconomic conditions. In addition, any future increase in U.S. corporate tax rates could result in an increase in Citi’s DTAs, which may subject more of Citi’s DTAs to exclusion from regulatory capital.\n    Citi has not been and does not expect to be subject to the base erosion anti-abuse tax (BEAT), which, if applicable to Citi in any given year, would have a significantly adverse effect on both Citi’s net income and regulatory capital.\n    The new U.S. administration has discussed potential reductions to the U.S. federal corporate tax rate and changes to the U.S. approach to the Organization for Economic Cooperation and Development (OECD) Pillar 2 framework. It is unclear whether any corporate tax rate reduction would apply to services companies like Citi. If the U.S. federal corporate tax rate applicable to Citi is reduced, Citi may benefit on a prospective net income basis, but the reduction could result in a material decrease in the value of Citi’s DTAs, which would also result in a material reduction to Citi’s net income during the period in which the change is enacted. Citi’s regulatory capital could also be reduced if the decrease in the value of Citi’s DTAs exceeds certain levels.\n    For additional information on Citi’s DTAs, including FTCs, see “Significant Accounting Policies and Significant Estimates—Income Taxes” below and Notes 1 and 10.\n\n    Citi’s Interpretation or Application of the Complex Tax Laws to Which It Is Subject Could Differ from Those of Governmental Authorities, Which Could Result in Litigation or Examinations and the Payment of Additional Taxes, Penalties or Interest.\n    Citi is subject to various income-based tax laws of the U.S. and its states and municipalities, as well as the numerous non-U.S. jurisdictions in which it operates. These tax laws are inherently complex, and Citi must make judgments and interpretations about the application of these laws to its entities, operations and businesses.\n    For example, the OECD Pillar 2 framework contemplates a 15% global minimum tax with respect to earnings in each country. The majority of EU member states have adopted the OECD Pillar 2 rules, and other non-U.S. countries have similarly adopted or are expected to adopt the rules. Under these rules, Citi will be required to pay a “top-up” tax to the extent that Citi’s effective tax rate in any given country is below 15%. Beginning in 2024, countries that adopted the OECD Pillar 2 rules can collect the top-up tax only with respect to earnings of entities in their jurisdiction or subsidiaries of such entities. Beginning in 2025, all countries that have adopted the OECD Pillar 2 rules can collect a share of the top-up tax owed with respect to any member of the Pillar 2 multinational group. While Citi does not currently expect the rules to have a material impact on its earnings, many aspects of the application of the rules and their implementation remain uncertain. Separately, the new U.S. administration has stated its opposition to the application of the global minimum tax to U.S. companies’ U.S. operations, and has indicated it may take retaliatory measures against other countries that seek to collect the minimum tax with respect to the U.S. operations of U.S. companies. Citi is\n    53\n\n    closely monitoring developments relating to the Pillar 2 negotiations to determine their potential impact.\n    Additionally, Citi is subject to litigation or examinations with U.S. and non-U.S. tax authorities regarding non-income-based tax matters. While Citi has appropriately reserved for such matters where there is a probable loss, and has disclosed reasonably possible losses, the outcome of the matters may be different than Citi’s expectations. Citi’s interpretations or application of the tax laws, including with respect to withholding, stamp, service and other non-income taxes, could differ from that of the relevant governmental taxing authority, which could result in the requirement to pay additional taxes, penalties or interest, the reduction of certain tax benefits or the requirement to make adjustments to amounts recorded, which could be material. See Note 30 for additional information on litigation and examinations involving non-U.S. tax authorities.\n\n    A Deterioration in or Failure to Maintain Citi’s Co-Branding or Private Label Credit Card Relationships Could Have a Negative Impact on Citi.\n    Citi has co-branding and private label relationships with various retailers and merchants through its Branded Cards and Retail Services credit card businesses in USPB, whereby in the ordinary course of business Citi issues credit cards to consumers, including customers of the retailers or merchants. The five largest relationships across both businesses in USPB constituted an aggregate of approximately 12% of Citi’s revenues in 2024 (see “U.S. Personal Banking” above). Citi’s co-branding and private label agreements often provide for shared economics between the parties and generally have a fixed term.\n    Competition among credit card issuers, including Citi, for these relationships is significant, and Citi may not be able to maintain such relationships on existing terms or at all. Citi’s co-branding and private label relationships could also be negatively impacted by, among other things, the general economic environment, including the impacts stemming from potential increases in unemployment, inflation or interest rates or lower economic growth rates, as well as a risk of recession; changes in consumer sentiment, spending patterns and credit card usage behaviors; a decline in sales and revenues, partner store closures, any reduction in air and business travel, or other operational difficulties of the retailer or merchant; changes in partner business strategies, including changes in products and services offered; termination or non-renewal of partner agreements, including early termination due to a contractual breach or exercise of other early termination right; or other factors, including bankruptcies, liquidations, restructurings, consolidations or other similar events, whether due to a challenging macroeconomic environment or otherwise.\n    These events, particularly early termination and bankruptcies or liquidations, could negatively impact the results of operations or financial condition of Branded Cards, Retail Services or Citi as a whole, including as a result of loss of revenues, increased expenses, higher cost of credit, impairment of purchased credit card relationships and contract-related intangibles or other losses (see Note 17 for information on Citi’s credit card related intangibles generally).\n    The Application of U.S. Resolution Plan Requirements May Pose a Greater Risk of Loss to Citi’s Debt and Equity Securities Holders, and Citi’s Inability in Its Resolution Plan Submissions to Address Any Shortcomings or Deficiencies or Guidance Could Subject Citi to More Stringent Capital, Leverage or Liquidity Requirements, or Restrictions on Its Growth, Activities or Operations, and Could Eventually Require Citi to Divest Assets or Operations.\n    Title I of the Dodd-Frank Act requires Citi to prepare and submit a plan to the FRB and the FDIC for the orderly resolution of Citigroup (the bank holding company) and its significant legal entities under the U.S. Bankruptcy Code in the event of future material financial distress or failure.\n    Under Citi’s preferred “single point of entry” resolution plan strategy, only Citigroup, the parent holding company, would enter into bankruptcy, while Citigroup’s material legal entities (as defined in the public section of its 2023 resolution plan, which can be found on the FRB’s and FDIC’s websites) would remain operational outside of any resolution or insolvency proceedings. As a result, Citigroup’s losses and any losses incurred by its material legal entity subsidiaries would be imposed first on holders of Citigroup’s equity securities and thereafter on its unsecured creditors, including holders of eligible long-term debt and other debt securities.\n    In addition, a wholly owned, direct subsidiary of Citigroup serves as a resolution funding vehicle (the intermediate holding company, or IHC) to which Citigroup has transferred, and has agreed to transfer on an ongoing basis, certain assets. The obligations of Citigroup and of the IHC, respectively, under the amended and restated secured support agreement, are secured on a senior basis by the assets of Citigroup (other than shares in subsidiaries of the parent company and certain other assets), and the assets of the IHC, as applicable. As a result, claims of the operating material legal entities against the assets of Citigroup with respect to such secured assets are effectively senior to unsecured obligations of Citigroup. Citi’s single point of entry resolution plan strategy and the obligations under the amended and restated secured support agreement may result in the recapitalization of and/or provision of liquidity to Citi’s operating material legal entities, and the commencement of bankruptcy proceedings by Citigroup at an earlier stage of financial stress than might otherwise occur without such mechanisms in place.\n    In line with the FRB’s total loss-absorbing capacity (TLAC) rule, Citigroup’s shareholders and unsecured creditors—including its unsecured long-term debt holders—would bear any losses resulting from Citigroup’s bankruptcy. Accordingly, any value realized by holders of its unsecured long-term debt may not be sufficient to repay the amounts owed to such debt holders in the event of a bankruptcy or other resolution proceeding of Citigroup. For additional information on Citi’s single point of entry resolution plan strategy and the IHC and secured support agreement, see “Managing Global Risk—Liquidity Risk” below.\n    On November 22, 2022, the FRB and FDIC issued feedback on the resolution plans filed on July 1, 2021 by the eight U.S. GSIBs, including Citigroup. The FRB and FDIC jointly identified one shortcoming in Citigroup’s 2021 resolution plan. The shortcoming related to data integrity and\n    54\n\n    data quality management issues, specifically, weaknesses in Citi’s processes and practices for producing certain data that could materially impact its resolution capabilities. On June 20, 2024, the FRB and FDIC issued feedback on the resolution plans filed on July 1, 2023 by the eight U.S. GSIBs, including Citigroup. The FRB and FDIC jointly identified one shortcoming in Citigroup’s 2023 resolution plan regarding Citi’s derivatives unwind capabilities. If a shortcoming is not satisfactorily explained or addressed before, or in, the submission of the next resolution plan, the shortcoming may be found to be a deficiency in the next resolution plan (see discussion below). Citi is required to submit a targeted resolution plan by July 1, 2025. More generally, data continues to be a subject of regulatory focus, and Citi continues to work on enhancing its data availability and quality (see “Citi’s Multiyear Transformation” above and the legal and regulatory proceedings risk factor below).\n    Under Title I, if the FRB and the FDIC jointly determine that Citi’s resolution plan is not “credible” (which, although not defined, is generally understood to mean the regulators do not believe the plan is feasible or would otherwise allow Citi to be resolved in a way that protects systemically important functions without severe systemic disruption), or would not facilitate an orderly resolution of Citi under the U.S. Bankruptcy Code, and Citi fails to resubmit a resolution plan that remedies any identified deficiencies, Citi could be subjected to more stringent capital, leverage or liquidity requirements, or restrictions on its growth, activities or operations. If within two years from the imposition of any such requirements or restrictions Citi has still not remediated any identified deficiencies, then Citi could eventually be required to divest certain assets or operations. Any such restrictions or actions would negatively impact Citi’s reputation, market and investor perception, operations and strategy.\n\n    Citi’s Performance and Its Ability to Effectively Execute Its Transformation, Simplification and Other Priorities Could Be Negatively Impacted if It Is Not Able to Hire and Retain Qualified Employees.\n    Citi’s performance and the performance of its individual businesses largely depend on the talents and efforts of its diverse and highly qualified employees. Specifically, Citi’s continued ability to compete in each of its lines of business, to manage its businesses effectively and to execute its transformation, simplification and other priorities, including, for example, hiring employees to grow businesses or hiring employees to support Citi’s priorities, depends on its ability to hire new employees and to retain and motivate its existing employees. If Citi is unable to continue to hire, retain and motivate highly qualified employees, Citi’s performance, including its competitive position, the execution of its transformation, simplification and other priorities and its results of operations could be negatively impacted.\n    Citi’s ability to attract, retain and motivate employees depends on numerous factors, some of which are outside of Citi’s control. For example, the competition for talent continues to be particularly intense due to various factors, such as changes in worker expectations, concerns and preferences, including demands for remote work options and other job\n    flexibility. Also, the banking industry generally is subject to more comprehensive regulation of employee compensation than other industries, including deferral and clawback requirements for incentive compensation, which can make it unusually challenging for Citi to compete in labor markets against businesses, including, for example, technology companies, that are not subject to such regulation. In addition, Citi recently completed a significant organizational simplification initiative, which included reducing management layers and significant reductions in functional roles that could continue to impact its ability to attract and retain employees.\n    Other factors that could impact Citi’s ability to attract, retain and motivate employees include, among other things, Citi’s presence in a particular market or region, the professional and development opportunities it offers, its reputation and its diversity. For information on Citi’s employee and workforce management, see “Human Capital Resources and Management” below.\n\n    Citi Faces Increased Competitive Challenges, Including from Financial Services and Other Companies and Emerging Technologies.\n    Citi operates in an increasingly evolving and competitive business environment, which includes both financial and non-financial services firms, such as traditional banks, online banks, private credit and financial technology companies and others. These companies compete on the basis of, among other factors, size, reach, quality and type of products and services offered, price, technology and reputation. Certain competitors may be subject to different and, in some cases, less stringent legal, regulatory and supervisory requirements, whether due to size, jurisdiction, entity type or other factors, placing Citi at a competitive disadvantage. Moreover, new or rapidly developing technologies with the potential to have significant economic or social effects (emerging technologies) also pose competitive challenges for Citi.\n    For example, Citi competes with other financial services companies in the U.S. and globally that have grown rapidly over the last several years or have introduced new products and services. Potential mergers and acquisitions involving traditional financial services companies, such as regional banks or credit card issuers, as well as networks and merchant acquirers, may also increase competition and impact Citi’s ability to offer competitive pricing and rewards. Non-traditional financial services firms, such as private credit, financial technology and digital asset companies, are less regulated and supervised and continue to expand their offerings of services traditionally provided by financial institutions.\n    In addition, emerging technologies have the potential to intensify competition and accelerate disruption in the financial services industry. Clients and investors have shown increased interest in these technologies, prompting financial services firms and other market participants to develop related products and services. As blockchain and digital assets continue to evolve, customer demand for enhanced offerings may increase. Failure to strategically embrace the potential of emerging technologies may result in a competitive disadvantage to Citi. The new U.S. administration has stated its support for the growth and use of digital assets and\n    55\n\n    blockchain technology, including a more favorable regulatory approach to crypto assets. Citi may not be able to provide the same or similar products and services for legal or regulatory reasons, which may be exacerbated by rapidly evolving and conflicting regulatory requirements, as well as increased compliance and other risks. Further, the introduction of mobile platforms and emerging technologies, such as artificial intelligence (AI) and digital assets, and changes in the payments space (e.g., instant and 24/7 payments) are accelerating, and, as a result, certain of Citi’s products and services could become less competitive.\n    Increased competition and emerging technologies have required and could require Citi to change or adapt its products and services, as well as invest in and develop related infrastructure, to attract and retain customers or clients or to compete more effectively with competitors, including new market entrants.\n    Simultaneously, as Citi develops new products and services leveraging emerging technologies, new risks may emerge that, if not designed and governed adequately, may result in control gaps and in Citi operating outside of its risk appetite. For example, the use or development of emerging technologies, such as AI or digital assets, without sufficient controls, governance and risk management may result in increased risks across various risk categories (for additional information, see the operational processes and systems risk factor below).\n    As another example, instant and 24/7 payments products could be accompanied by challenges to forecasting and managing liquidity, as well as increased operational and compliance risks. Additionally, the growth of certain competitors has increased market and counterparty credit risks, with such risks particularly heightened in the case of a challenging macroeconomic environment (see the risk factor on credit and concentrations of risk below).\n    Moreover, Citi relies on third parties to support certain of its product and service offerings, which may put Citi at a disadvantage to competitors who may directly offer a broader array of products and services. Also, Citi’s businesses, results of operations and reputation may suffer if any third party is unable to provide adequate support for such product and service offerings, whether due to operational incidents or otherwise (see the operational processes and systems, cybersecurity and emerging markets risk factors below).\n    To the extent that Citi is not able to compete effectively with other financial services companies, including private credit and financial technology companies, and non-financial services firms, or adequately assess the competitive landscape, Citi could be placed at a competitive disadvantage, which could result in loss of customers and market share, and its businesses, results of operations and financial condition could suffer. For additional information on Citi’s competitors, see the co-brand and private label cards and qualified employees risk factors above and “Supervision, Regulation and Other—Competition” below.\n\n\n    OPERATIONAL RISKS\n\n    A Failure or Disruption of Citi’s Operational Processes or Systems Could Negatively Impact Its Reputation, Customers, Clients, Businesses or Results of Operations and Financial Condition.\n    Citi’s global operations rely heavily on its technology systems and infrastructure, including the accurate, complete, timely and secure processing, management, storage and transmission of data, including confidential transactions, and other information, as well as the monitoring of a substantial amount of data and complex transactions in real time. Citi obtains and stores an extensive amount of personal and client-specific information for its consumer and institutional customers and clients, and must accurately record and reflect their account transactions.\n    Citi’s operations must also comply with complex and evolving laws, regulations and heightened regulatory expectations in the jurisdictions in which it operates (see the implementation and interpretation of regulatory changes and legal proceedings risk factors below). With the proliferation of emerging technologies, including AI, and the use of the internet, mobile devices and cloud services to conduct financial transactions, and customers’ and clients’ increasing use of online banking and trading systems and other platforms, large global financial institutions such as Citi have been, and will continue to be, subject to an ever-increasing risk of operational loss, failure or disruption.\n    Citi has been working with AI and machine learning for a period of time and has more recently begun using Generative AI, a type of artificial intelligence that uses generative models to create text and other content. Generative AI tools are available to employees within parts of the Company, and in the future Citi may more broadly use, develop and incorporate Generative AI within its technology platform and services, systems and its businesses and functions. While Citi has policies which govern the use of emerging technologies, ineffective, inadequate or faulty Generative AI development or deployment practices by Citi or third parties could result in unintended consequences, such as AI algorithms that produce inaccurate or incomplete output or output based on biased, incomplete and/or inaccurate datasets, or cause other issues, concerns or deficiencies. Moreover, the use of increasingly sophisticated AI technologies by malicious actors and others has increased the risk of fraud, including identity theft and bypassing of verification controls, and failure to effectively manage such risks could result in misappropriation of funds, unauthorized transactions, exposure of sensitive client or Company information, reputational harm and increased litigation and regulatory risk. In addition, compliance with new or changing laws, regulations or industry standards relating to AI may impose additional operational risks and costs.\n    Although Citi has continued to upgrade its technology, including systems to automate processes and gain efficiencies, operational incidents are unpredictable and can arise from numerous sources, not all of which are fully within Citi’s control. These include, among others, operational or execution failures or deficiencies by third parties and third parties that provide products or services to Citi (e.g., cloud service\n    56\n\n    providers), including such third parties’ downstream service providers, other market participants or those that otherwise have an ongoing partnership or business relationship with Citi; deficiencies in processes or controls; inadequate management of data governance practices, data controls and monitoring mechanisms that may adversely impact internal or external reporting and decision-making; cyber or information security incidents (see the cybersecurity risk factor below); human error, such as manual transaction processing errors (e.g., erroneous payments to lenders or manual errors by traders that cause system and market disruptions or losses), which can be exacerbated by staffing challenges and processing backlogs; fraud or malice on the part of employees or third parties; insufficient (or limited) straight-through processing between legacy or bespoke systems and any failure to design and effectively operate controls that mitigate operational risks associated with those legacy or bespoke systems, leading to potential risk of errors and operating losses; accidental system or technological failure; electrical or telecommunication outages; failures of or cyber incidents involving computer servers or infrastructure, including software updates and cloud services; or other similar losses or damage to Citi’s property or assets (see also the climate change risk factor above). Additionally, Citi’s ability to effectively maintain and upgrade systems and infrastructure can become more challenging as the speed, frequency, volume, interconnectivity and complexity of transactions continue to increase.\n    For example, operational incidents can arise due to failures by third parties with which Citi does business, such as failures by internet, mobile technology and cloud service providers or other vendors to adequately follow procedures or processes, safeguard their systems or prevent system disruptions or cyberattacks. Failure by Citi to develop, implement and operate a third-party risk management program commensurate with the level of risk, complexity and nature of its third-party relationships can also result in operational incidents. In addition, Citi has experienced and could experience further losses associated with manual transaction processing errors, including erroneous payments to lenders or manual errors by Citi traders that cause system and market disruptions and losses for Citi and its clients. Irrespective of the sophistication of the technology utilized by Citi, there will always be some room for human and other errors. In view of the large transactions in which Citi engages, such errors have in the past resulted, and could result, in significant losses. While Citi has change management processes in place to appropriately upgrade its operational processes and systems to ensure that any changes introduced do not adversely impact security and operational continuity, such change management can fail or be ineffective. Furthermore, when Citi introduces new products, systems or processes, new operational risks that may arise from those changes may not be identified, or adequate controls to mitigate the identified risks may not be appropriately implemented or operate as designed.\n    Incidents that impact information security, technology operations or other operational processes may cause disruptions and/or malfunctions within Citi’s businesses (e.g., the temporary loss of availability of Citi’s online banking system or mobile banking platform), as well as the operations of its clients, customers or other third parties. In addition,\n    operational incidents could involve the failure or ineffectiveness of internal processes or controls. Given Citi’s global footprint and the high volume of transactions processed by Citi, certain failures, errors or actions may be repeated or compounded before they are discovered and rectified, which would further increase the consequences and costs. Operational incidents could result in financial losses and other costs as well as misappropriation, corruption or loss of confidential and other information or assets, which could significantly negatively impact Citi’s reputation, customers, clients, businesses or results of operations and financial condition. Cyber-related and other operational incidents can also result in legal and regulatory actions or proceedings, fines and other costs (see the legal and regulatory proceedings risk factor below).\n    Citi will need to continue to increase its operational resilience, ensuring important business services and their impact tolerance time and severity scales are clearly defined. Failure to do so could expose Citi to service disruptions identified through scenario testing, leading to harms to Citi clients, market integrity, financial stability or Citi safety and soundness.\n    For information on Citi’s management of operational risk, see “Managing Global Risk—Operational Risk” below.\n\n    Citi’s and Third Parties’ Computer Systems and Networks Will Continue to Be Susceptible to an Increasing Risk of Continually Evolving, Sophisticated Cybersecurity Incidents That Could Result in the Theft, Loss, Non-Availability, Misuse or Disclosure of Confidential Client or Customer Information, Damage to Citi’s Reputation, Additional Costs to Citi, Regulatory Penalties, Legal Exposure and Financial Losses.\n    Citi’s computer systems, software and networks are subject to ongoing attempted cyberattacks, such as unauthorized access, loss or destruction of data (including confidential client information), account takeovers, disruptions of service, phishing, malware, ransomware, computer viruses or other malicious code and other similar events. These threats can arise from external parties, including cyber criminals, cyber terrorists, hacktivists (individuals or groups using cyberattacks to promote a political or social agenda) and nation-state actors, as well as insiders who knowingly or unknowingly engage in or enable malicious cyber activities. For example, nation-state actors have recently targeted critical U.S. infrastructure with cyberattacks.\n    Citi develops its own software and relies on third-party applications and software, which are susceptible to vulnerability exploitations. Software leveraged in financial services and other industries continues to be impacted by an increasing number of zero-day vulnerabilities, thus increasing inherent cyber risk to Citi.\n    The increasing use of mobile and other digital banking platforms and services, cloud technologies, new and emerging technologies (such as AI) and connectivity solutions to facilitate remote working for Citi’s employees all increase Citi’s exposure to cybersecurity risks. Citi is also susceptible to cyberattacks given, among other things, its size and scale, high-profile brand, global footprint and prominent role in the financial system, as well as the ongoing wind-down of its\n    57\n\n    businesses in Russia (see the emerging markets risk factor and “Managing Global Risk—Other Risks—Country Risk—Russia” below). Additionally, Citi continues to operate in multiple jurisdictions in the midst of geopolitical unrest or uncertainties, including the Russia–Ukraine war and the conflicts in the Middle East, which could expose Citi to heightened risk of insider threat, cyber threats from nation-state actors, hacktivism or other cyber incidents.\n    Citi continues to experience increased exposure to cyberattacks through third parties, in part because financial institutions are becoming increasingly interconnected with central agents, exchanges and clearing houses. Third parties with which Citi does business, as well as retailers and other third parties with which Citi’s customers do business, and any such third parties’ downstream service providers, also pose cybersecurity risks, particularly where activities of customers are beyond Citi’s security and control systems. For example, Citi outsources certain functions, such as processing customer credit card transactions, uploading content on customer-facing websites and developing software for new products and services. These relationships allow for the storage and processing of customer information by third-party hosting of, or access to, Citi websites. This could lead to compromise or the potential to introduce vulnerable or malicious code, resulting in security breaches or business disruptions impacting Citi customers, employees or operations. While many of Citi’s agreements with third parties include indemnification provisions, Citi may not be able to recover sufficiently under these provisions, or at all, to adequately offset any losses and other adverse impacts Citi may incur from third-party cyber incidents.\n    Citi and some of its third-party partners have been subjected to attempted and sometimes successful cyberattacks over the last several years, including (i) denial of service attacks, which attempt to interrupt service to clients and customers; (ii) hacking and malicious software installations intended to gain unauthorized access to information systems or to disrupt those systems and/or impact availability or privacy of confidential data, with objectives including, but not limited to, extortion payments or causing reputational damage; (iii) data breaches due to unauthorized access to customer account or other data; and (iv) malicious software attacks on client systems, in attempts to gain unauthorized access to Citi systems or client data under the guise of normal client transactions.\n    While Citi’s monitoring and protection services have historically generally succeeded in detecting, thwarting and/or responding to attacks targeting its systems before they become significant, certain past incidents resulted in limited losses, as well as increases in expenditures to monitor against the threat of similar future cyber incidents. There can be no assurance that such cyber incidents will not occur again, and they could occur more frequently, via novel tactics, including leveraging of tools made possible by emerging technologies, and on a more significant scale.\n    Despite the significant resources Citi allocates to implement, maintain, monitor and regularly upgrade its systems and networks with measures such as intrusion detection and prevention systems and firewalls to safeguard critical business applications, there is no guarantee that these\n    measures or any other measures can provide sufficient security. Because the techniques used to initiate cyberattacks change frequently or, in some cases, are not recognized until launched or even later, Citi may be unable to implement effective preventive measures or otherwise proactively address these methods. In addition, cyber threats and cyberattack techniques change, develop and evolve rapidly, including from emerging technologies such as AI, cloud computing and quantum computing. Given the frequency and sophistication of cyberattacks, the determination of the severity and potential impact of a cyber incident may not become apparent for a substantial period of time following detection of the incident. Also, while Citi strives to implement measures to reduce the exposure resulting from outsourcing risks, such as performing security control assessments of third-party vendors and limiting third-party access to the least privileged level necessary to perform job functions, these measures cannot prevent all third-party-related cyberattacks or data breaches. In addition, the risk of insider threats may continue to be elevated in the near term due to Citi’s recent overall simplification initiatives, including streamlining its global staff functions.\n    Cyber incidents can result in the disclosure of personal, confidential or proprietary customer, client or employee information; damage to Citi’s reputation with its clients, other counterparties and the market; customer dissatisfaction; and additional costs to Citi, including expenses such as repairing or replacing systems, replacing customer payment cards, credit monitoring or adding new personnel or protection technologies. Cyber incidents can also result in regulatory penalties, loss of revenues, deposit flight, exposure to litigation and regulatory action and other financial losses, including loss of funds to both Citi and its clients and customers, and disruption to Citi’s operational systems (see the operational processes and systems risk factor above).\n    Moreover, the increasing risk of cyber incidents has resulted in increased legislative and regulatory action on cybersecurity, including, among other things, scrutiny of firms’ cybersecurity protection processes and services, laws and regulations to enhance protection of consumers’ personal data and mandated disclosure on cybersecurity matters.\n    While Citi maintains insurance coverage that may, subject to policy terms and conditions including significant self-insured deductibles, cover certain aspects of cyber risks, such insurance coverage may be insufficient to cover all losses and may not take into account reputational harm, the costs of which are impossible to quantify.\n    For additional information about Citi’s management of cybersecurity risk, see “Managing Global Risk—Operational Risk—Cybersecurity Risk” below.\n\n    Changes or Errors in Accounting Assumptions, Judgments or Estimates, or the Application of Certain Accounting Principles, Could Result in Significant Losses or Other Adverse Impacts.\n    U.S. GAAP requires Citi to use certain assumptions, judgments and estimates in preparing its financial statements, including, among other items, the estimate of the ACL; reserves related to litigation, regulatory and tax matters; valuation of DTAs; the fair values of certain assets and liabilities; and the assessment of goodwill and other assets for\n    58\n\n    impairment. These assumptions, judgments and estimates are inherently limited because they involve techniques, which could include the use of historical data and AI, that cannot anticipate or model every economic and financial outcome in the markets in which Citi operates, nor can they anticipate the specific impact and timing of such outcomes. For example, many models used by Citi include assumptions about correlation or lack thereof among prices of various asset classes or other market indicators that may not hold in times of market stress, limited liquidity or other unforeseen circumstances.\n    If Citi’s assumptions, judgments or estimates underlying its financial statements are incorrect or differ from actual or subsequent events, Citi could experience unexpected losses or other adverse impacts, some of which could be significant. Citi could also experience declines in its stock price, be subject to legal and regulatory proceedings and incur fines and other losses. For additional information on the key areas for which assumptions and estimates are used in preparing Citi’s financial statements, see “Significant Accounting Policies and Significant Estimates” below and Notes 1 and 16.\n    For example, the CECL methodology requires that Citi provide reserves for a current estimate of lifetime expected credit losses for its loan portfolios and other financial assets, as applicable, at the time those assets are originated or acquired. This estimate is adjusted each period for changes in expected lifetime credit losses. Citi’s ACL estimate is subject to judgments and depends upon its CECL models and assumptions; forecasted macroeconomic conditions, including, among other things, the U.S. unemployment rate and U.S. inflation-adjusted gross domestic product (real GDP); and the credit indicators, composition and other characteristics of Citi’s loan portfolios and other applicable financial assets. These model assumptions and forecasted macroeconomic conditions will change over time, resulting in variability in Citi’s ACL and, thus, impact its results of operations and financial condition, as well as regulatory capital due to the CECL phase-in (see the capital return risk factor above). For additional information on Citi’s ACL, see “Significant Accounting Policies and Significant Estimates” below and Notes 1 and 16.\n    Moreover, Citi has incurred losses related to its foreign operations that are reported in the CTA components of Accumulated other comprehensive income (loss) (AOCI). In accordance with U.S. GAAP, a sale, substantial liquidation or other deconsolidation event of any foreign operations, such as those related to Citi’s remaining divestitures or legacy businesses, would result in reclassification of any foreign CTA component of AOCI related to that foreign operation, including related hedges and taxes, into Citi’s earnings. For example, Citi could incur a significant loss on sale due to CTA losses related to any such divestitures (see the capital risk factor above and the emerging markets risk factor below). The majority of these losses would be regulatory capital neutral at the completion of the divestiture. For additional information on Citi’s accounting policy for foreign currency translation and its foreign CTA components of AOCI, see Notes 1 and 21.\n\n\n    Changes to Financial Accounting and Reporting Standards or Interpretations Could Have a Material Impact on How Citi Records and Reports Its Financial Condition and Results of Operations.\n    Periodically, the Financial Accounting Standards Board (FASB) issues financial accounting and reporting standards that govern key aspects of Citi’s financial statements or interpretations thereof when those standards become effective, including those areas where Citi is required to make assumptions or estimates. Changes to financial accounting or reporting standards or interpretations, whether promulgated or required by the FASB, the SEC, U.S. banking regulators or others, could present operational challenges and could also require Citi to change certain of the assumptions or estimates it previously used in preparing its financial statements, which could negatively impact how it records and reports its financial condition and results of operations generally and/or with respect to particular businesses. See Note 1 for additional information on Citi’s accounting policies and changes in accounting, including the expected impacts on Citi’s results of operations and financial condition.\n\n    If Citi’s Risk Management and Other Processes, Strategies or Models Are Deficient or Ineffective, Citi May Incur Significant Losses and Its Regulatory Capital and Capital Ratios Could Be Negatively Impacted.\n    Citi utilizes a broad and diversified set of risk management and other processes and strategies, including the use of models in analyzing and monitoring the various risks Citi assumes in conducting its activities. For example, Citi uses models across the Company as part of its comprehensive stress testing initiatives. Citi also relies on data to aggregate, assess and manage various risk exposures. Management of these risks and the reliability of the data are made more challenging within a large, global financial institution, such as Citi, particularly due to complex, diverse and rapidly changing financial markets and conditions in which Citi operates. Unexpected losses can result from untimely, inaccurate or incomplete processes and data. In 2020 Citigroup and Citibank entered into Consent Orders with the FRB and OCC that require Citigroup and Citibank to make improvements in various aspects of enterprise-wide risk management, compliance, data quality management related to governance, and internal controls (see the legal and regulatory proceedings risk factor below).\n    In addition, Citi’s risk management and other processes, strategies and models are inherently limited because they involve techniques, including the use of historical data in many circumstances, assumptions and judgments that cannot anticipate every economic and financial outcome in the markets in which Citi operates, particularly given various macroeconomic, geopolitical and other challenges and uncertainties (see the macroeconomic challenges and uncertainties risk factor above), nor can they anticipate the specifics and timing of such outcomes. For example, many models used by Citi include assumptions about correlation or lack thereof among prices of various asset classes or other market indicators that may not necessarily hold in times of market stress, limited liquidity or other unforeseen\n    59\n\n    circumstances, or identify changes in markets or client behaviors not yet inherent in historical data.\n    Citi could incur significant losses, receive negative regulatory evaluation or examination findings or be subject to additional enforcement actions, and its regulatory capital, capital ratios and ability to return capital could be negatively impacted, if Citi’s risk management and other processes, including its ability to manage and aggregate data in a timely and accurate manner, strategies or models are deficient or ineffective. For additional information, see the capital return risk factor above and the heightened regulatory scrutiny and ongoing interpretation of regulatory changes risk factor below. Such deficiencies or ineffectiveness could also result in inaccurate financial, regulatory or risk reporting.\n    Moreover, Citi’s Basel III regulatory capital models, including its credit, market and operational risk models, currently remain subject to ongoing regulatory review and approval, which may result in refinements, modifications or enhancements (required or otherwise) to these models. Citi is required to notify and obtain preapproval from both the OCC and FRB prior to implementing certain risk-weighted asset treatments, as well as certain model changes, resulting in a more challenging environment within which Citi must operate in managing its risk-weighted assets. Modifications or requirements resulting from these ongoing reviews, as well as any future changes or guidance provided by the U.S. banking regulators regarding the U.S. regulatory capital framework applicable to Citi, including, but not limited to, potential revisions to the U.S. Basel III rules (see the capital return risk factor and “Capital Resources—Regulatory Capital Standards and Developments” above), have resulted, and could continue to result, in significant changes to Citi’s risk-weighted assets. These changes can negatively impact Citi’s capital ratios and its ability to meet its regulatory capital requirements.\n\n    CREDIT RISKS\n\n    Credit Risk and Concentrations of Risk Can Increase the Potential for Citi to Incur Significant Losses.\n    Citi has credit exposures to consumer, corporate and public sector borrowers and other counterparties in the U.S. and various countries and jurisdictions globally, including end-of-period consumer loans of $393 billion and end-of-period corporate loans of $301 billion at December 31, 2024. For additional information on Citi’s corporate and consumer loan portfolios, see “Managing Global Risk—Corporate Credit” and “—Consumer Credit” below. For information on Citi’s credit and country risk, see also each respective business’s results of operations above and “Managing Global Risk—Other Risks—Country Risk” below and Notes 15 and 16.\n    A default by or a significant downgrade in the credit ratings of a borrower or other counterparty, or a decline in the credit quality or value of any underlying collateral, exposes Citi to credit risk. Additionally, despite Citi’s target client strategy, various macroeconomic, geopolitical, market and other factors, among other things, can increase Citi’s credit risk and credit costs, particularly for vulnerable sectors, industries or countries (see the macroeconomic challenges and uncertainties and co-branding and private label credit card risk factors above and the emerging markets risk factor below). For\n    example, a weakening of economic conditions can adversely affect borrowers’ ability to repay their obligations, as well as result in Citi being unable to liquidate the collateral it holds or forced to liquidate the collateral at prices that do not cover the full amount owed to Citi.\n    Citi is also a member of various central clearing counterparties and could incur financial losses as a result of defaults by other clearing members due to the requirements of clearing members to share losses. Additionally, due to the interconnectedness among financial institutions, concerns about the creditworthiness of or defaults by a financial institution could spread to other financial market participants and result in market-wide losses and disruption. For example, the failure of regional banks and other banking stresses in recent years resulted in market volatility across the financial sector.\n    While Citi provides reserves for expected losses for its credit exposures, as applicable, such reserves are subject to judgments and estimates that could be incorrect or differ from actual future events. For additional information, see the incorrect assumptions or estimates risk factor above.\n    Concentrations of risk to clients or counterparties engaged in the same or related industries or doing business in a particular geography, or to a particular product or asset class, especially credit and market risks, can also increase Citi’s risk of significant losses. For example, Citi routinely executes a high volume of securities, trading, derivative and foreign exchange transactions with non-U.S. sovereigns and with counterparties in the financial services industry, including banks, insurance companies, investment banks, governments, central banks and other financial institutions. Moreover, Citi has indemnification obligations in connection with various transactions that expose it to concentrations of risk, including credit risk from hedging or reinsurance arrangements related to those obligations (see Note 28). A rapid deterioration of a large borrower or other counterparty or within a sector or country in which Citi has large exposures or indemnifications or unexpected market dislocations could lead to concerns about the creditworthiness of other borrowers or counterparties in a certain geography and in related or dependent industries, and such conditions could cause Citi to incur significant losses.\n\n    LIQUIDITY RISKS\n\n    Citi’s Businesses, Results of Operations and Financial Condition Could Be Negatively Impacted if It Does Not Effectively Manage Its Liquidity.\n    As a large, global financial institution, adequate liquidity and sources of funding are essential to Citi’s businesses. Citi’s liquidity, sources of funding and costs of funding can be significantly and negatively impacted by factors it cannot control, such as general disruptions in the financial markets; changes in fiscal and monetary policies; regulatory requirements, including changes in regulations; negative investor or counterparty perceptions of Citi’s creditworthiness; deposit outflows or unfavorable changes in deposit mix; unexpected increases in cash or collateral requirements; credit ratings; and the consequent inability to monetize available liquidity resources. In addition, Citi competes with other banks\n    60\n\n    and financial institutions for both institutional and consumer deposits, which represent Citi’s most stable and lowest cost source of long-term funding. The competition for deposits has continued to increase in recent years, including as a result of quantitative tightening by central banks and fixed income alternatives for customer funds.\n    Citi’s costs to obtain and access wholesale funding are directly related to changes in interest and currency exchange rates and its credit spreads. Changes in Citi’s credit spreads are driven by both external market factors and factors specific to Citi, such as negative views by investors of the financial services industry or Citi’s financial prospects, and can be highly volatile. For additional information on Citi’s primary sources of funding, see “Managing Global Risk—Liquidity Risk” below.\n    Citi’s ability to obtain funding may be impaired and its cost of funding could also increase if other market participants are seeking to access the markets at the same time or to a greater extent than expected, or if market appetite for corporate debt securities declines, as is likely to occur in a liquidity stress event or other market crisis. In such circumstances, Citi’s ability to sell assets may also be impaired if other market participants are seeking to sell similar assets at the same time or a liquid market does not exist for such assets. Additionally, unexpected changes in client needs due to idiosyncratic events or market conditions could result in greater than expected drawdowns from off-balance sheet committed facilities. A sudden drop in market liquidity could also cause a temporary or protracted dislocation of capital markets activity. In addition, clearing organizations, central banks, clients and financial institutions with which Citi interacts may exercise the right to require additional collateral during challenging market conditions, which could further impair Citi’s liquidity. If Citi fails to effectively manage its liquidity, its businesses, results of operations and financial condition could be negatively impacted.\n    Limitations on the payments that Citigroup Inc. receives from its subsidiaries could also impact its liquidity. As a holding company, Citigroup Inc. relies on interest, dividends, distributions and other payments from its subsidiaries to fund dividends as well as to satisfy its debt and other obligations. Several of Citi’s U.S. and non-U.S. subsidiaries are or may be subject to capital adequacy or other liquidity, regulatory or contractual restrictions on their ability to provide such payments, including any local regulatory stress test requirements and inter-affiliate arrangements entered into in connection with Citigroup Inc.’s resolution plan. Citigroup Inc.’s broker-dealer and bank subsidiaries are subject to restrictions on their ability to lend or transact with affiliates, as well as restrictions on their ability to use funds deposited with them in brokerage or bank accounts to fund their businesses.\n    A bank holding company is also required by law to act as a source of financial and managerial strength for its subsidiary banks. As a result, the FRB may require Citigroup Inc. to commit resources to its subsidiary banks even if doing so is not otherwise in the interests of Citigroup Inc. or its shareholders or creditors, reducing the amount of funds available to meet its obligations.\n\n\n    A Ratings Downgrade Could Adversely Impact Citi’s Funding and Liquidity.\n    The credit rating agencies, such as Fitch Ratings, Moody’s Ratings and S&P Global Ratings, continuously evaluate Citi and certain of its subsidiaries. Their ratings of Citi and its rated subsidiaries’ long-term debt and short-term obligations are based on firm-specific factors, including the financial strength of Citi and such subsidiaries, as well as factors that are not entirely within the control of Citi and its subsidiaries, such as the agencies’ proprietary rating methodologies and assumptions, potential impact from negative actions on U.S. sovereign ratings and conditions affecting the financial services industry and markets generally.\n    A ratings downgrade could result from, among other factors, delays or missteps in Citi’s transformation efforts, including risk management and internal controls improvements, public statements by Citi’s management or regulators, operational risk charges, control failures, substantial failure to meet cost targets, deterioration in Citi’s funding structure or liquidity, declines in profitability, significant increases in risk appetite or material reductions in regulatory capitalization levels.\n    Citi and its subsidiaries may not be able to maintain their current respective ratings and outlooks. Ratings downgrades could negatively impact Citi and its rated subsidiaries’ ability to access the capital markets and other sources of funds as well as increase credit spreads and the costs of those funds. A ratings downgrade could also have a negative impact on Citi and its rated subsidiaries’ ability to obtain funding and liquidity due to reduced funding capacity and the impact from derivative triggers, which could require Citi and its rated subsidiaries to meet cash obligations and collateral requirements or permit counterparties to terminate certain contracts. In addition, a ratings downgrade could have a negative impact on other funding sources such as secured financing and other margined transactions for which there may be no explicit triggers.\n    Furthermore, a credit ratings downgrade could have impacts that may not be currently known to Citi or are not possible to quantify. Some of Citi’s counterparties and clients could have ratings limitations on their permissible counterparties, of which Citi may or may not be aware. Certain of Citi’s corporate customers and trading counterparties, among other clients, could re-evaluate their business relationships with Citi and limit the trading of certain market instruments, and limit or withdraw deposits placed with Citi in response to ratings downgrades. Changes in customer and counterparty behavior could impact not only Citi’s funding and liquidity but also the results of operations of certain Citi businesses. For additional information on the potential impact of a reduction in Citi’s or Citibank’s credit ratings, see “Managing Global Risk—Liquidity Risk—Potential Impacts of Ratings Downgrades” below.\n\n\n    61\n\n    COMPLIANCE RISKS\n\n    Significantly Heightened Regulatory Expectations and Scrutiny in the U.S. and Globally and Ongoing Interpretation and Implementation of Regulatory and Legislative Requirements and Changes Have Increased Citi’s Compliance, Regulatory and Other Risks and Costs.\n    Large financial institutions, such as Citi, face significantly heightened regulatory and supervisory expectations and scrutiny in the U.S. and globally, including with respect to, among other things, governance, infrastructure, data and risk management practices and controls. These regulatory and supervisory expectations extend to employees and agents and also include, among other things, those related to customer and client protection, market practices, anti-money laundering, increasingly complex sanctions and disclosure regimes and various regulatory reporting requirements.\n    U.S. financial institutions also face increased expectations and scrutiny in the wake of the failures of several regional banks and other banking stresses in 2023. In addition, Citi is continually required to interpret and implement extensive and frequently changing regulatory and legislative requirements in the U.S. and other jurisdictions in which it does business, which may overlap or conflict across jurisdictions, resulting in substantial compliance, regulatory and other risks and costs.\n    A failure to comply with these expectations and requirements, even if inadvertent, or resolve any identified deficiencies in a timely and sufficiently satisfactory manner to regulators, could result in increased regulatory oversight; material restrictions, including, among others, imposition of additional capital buffers and limitations on capital distributions; enforcement proceedings; penalties; and fines (see the capital return risk factor above and legal and regulatory proceedings risk factor below).\n    Moreover, over the past several years, Citi has been required to implement a large number of regulatory, supervisory and legislative changes, including new regulatory, supervisory or legislative requirements or regimes, across its businesses and functions, and these changes continue. The changes themselves may be complex and subject to interpretation, and result in changes to Citi’s businesses. In addition, the changes require continued substantial technology and other investments. In some cases, Citi’s implementation of a regulatory or legislative requirement is occurring simultaneously with changing or conflicting regulatory guidance from multiple jurisdictions (including various U.S. states) and regulators, legal challenges or legislative action to modify or repeal existing rules or enact new rules.\n    Examples of regulatory or legislative changes that have resulted in increased compliance risks and costs include (i) the U.S. regulatory capital framework and requirements, which have continued to evolve (see the capital return risk factor and “Capital Resources” above); (ii) various laws relating to the limitation of cross-border data movement and/or collection and use of customer information, including data localization and protection and privacy laws, which also can conflict with or increase compliance complexity with respect to other laws, including anti-money laundering laws; and (iii) the EU’s Corporate Sustainability Reporting Directive, which may overlap but also diverge from climate-related disclosure\n    requirements expected to come into effect in other jurisdictions.\n\n    Citi Is Subject to Extensive Legal and Regulatory Proceedings, Examinations, Investigations, Consent Orders and Related Compliance Efforts and Other Inquiries That Could Result in Large Monetary Penalties, Supervisory or Enforcement Orders, Business Restrictions, Limitations on Dividends, Changes to Directors and/or Officers and Collateral Consequences Arising from Such Outcomes.\n    Citi’s regulators have broad powers and discretion under their prudential and supervisory authority, and have pursued active inspection and investigatory oversight. At any given time, Citi is a party to a significant number of legal and regulatory proceedings and is subject to numerous governmental and regulatory examinations. Additionally, Citi remains subject to governmental and regulatory investigations, consent orders (see discussion below) and related compliance efforts, and other inquiries. Citi could also be subject to enforcement proceedings and negative regulatory evaluation or examination findings not only because of violations of laws and regulations, but also due to failures, as determined by its regulators, to have adequate policies and procedures, or to remedy deficiencies on a timely basis (see also the capital return and resolution plan risk factors above). Citi could face further scrutiny and consequences from regulators for failing to timely resolve open regulatory issues or having repeat regulatory issues.\n    As previously disclosed, the 2020 FRB Consent Order and the 2020 OCC Consent Order require Citigroup and Citibank, respectively, to implement extensive targeted action plans and submit quarterly progress reports on a timely and sufficient basis detailing the results and status of improvements relating principally to various aspects of enterprise-wide risk management, compliance, data quality management related to governance, and internal controls. These improvements will result in continued significant investments by Citi during 2025 and beyond, as an essential part of Citi’s broader transformation efforts to enhance its risk, controls, data and finance infrastructure and compliance (see the transformation, simplification and other priorities-related risk factor above).\n    Additionally, on July 10, 2024, the FRB entered into a Civil Money Penalty Consent Order with Citigroup, and the OCC entered into a Civil Money Penalty Consent Order with Citibank. The OCC and Citibank also entered into an Amendment to the OCC’s 2020 Consent Order (the Amendment). The FRB found that Citigroup had ongoing deficiencies related to its data quality management program and had inadequate measures for managing and controlling its data quality risks. The OCC found that Citibank had failed to make sufficient and sustainable progress toward achieving compliance with its 2020 Consent Order.\n    The Amendment requires Citibank to formalize a process to determine whether sufficient resources are being appropriately allocated toward achieving timely and sustainable compliance with the OCC’s 2020 Consent Order, including any requirements on which Citibank is not making sufficient and sustainable progress (such process, the Resource Review Plan). There can be no assurance that the Resource\n    62\n\n    Review Plan and other efforts by Citi to address the deficiencies and resolve the OCC and FRB Consent Orders will occur in a manner satisfactory, in both timing and sufficiency, to the FRB and OCC. (For additional information, see “Citi’s Multiyear Transformation” above.)\n    Although there are no restrictions on Citi’s ability to serve its clients, the OCC Consent Order requires Citibank to obtain prior approval of any significant new acquisition, including any portfolio or business acquisition, excluding ordinary course transactions.\n    Moreover, the OCC Consent Order provides that the OCC has the right to assess future civil money penalties or take other supervisory and/or enforcement actions. Such actions by the OCC could include imposing business restrictions, including possible additional limitations on the declaration or payment of dividends by Citibank and changes in directors and/or senior executive officers. More generally, the OCC and/or the FRB could again take enforcement or other actions if the regulatory agency believes that Citi has not met regulatory expectations regarding compliance with the consent orders.\n    The global judicial, regulatory and political environment has generally been challenging for large financial institutions, which have been subject to increased regulatory scrutiny. The complexity of the federal and state regulatory and enforcement regimes in the U.S., coupled with the global scope of Citi’s operations, also means that a single event or issue may give rise to a large number of overlapping investigations and regulatory proceedings, either by multiple federal and state agencies and authorities in the U.S. or by multiple regulators and other governmental entities in foreign jurisdictions, as well as multiple civil litigation claims in multiple jurisdictions. Violations of law by other financial institutions may also result in regulatory scrutiny of Citi. Responding to regulatory inquiries and proceedings can be time consuming and costly, and divert management attention from Citi’s businesses.\n    U.S. and non-U.S. regulators have been increasingly focused on the culture of financial services firms, including Citi, as well as “conduct risk,” a term used to describe the risks associated with behavior by employees and agents, including third parties, that could harm clients, customers, employees or the integrity of the markets, such as improperly creating, selling, marketing or managing products and services or improper incentive compensation programs with respect thereto, failures to safeguard a party’s personal information or failures to identify and manage conflicts of interest.\n    In addition to the greater focus on conduct risk, the general heightened scrutiny and expectations from regulators could lead to investigations and other inquiries, as well as remediation requirements, regulatory restrictions, structural changes, more regulatory or other enforcement proceedings, civil litigation and higher compliance and other risks and costs. For additional information, see the capital return and heightened regulatory scrutiny and ongoing interpretation of regulatory changes risk factors above. Further, while Citi takes numerous steps to prevent and detect conduct by employees and agents that could potentially harm clients, customers, employees or the integrity of the markets, such behavior may not always be deterred or prevented.\n    Moreover, the severity of the remedies sought in legal and regulatory proceedings to which Citi is subject has remained elevated. For example, U.S. and certain non-U.S. governmental entities have increasingly brought criminal actions against, or have sought and obtained criminal guilty pleas or deferred prosecution agreements from, financial institutions and individual employees. These types of actions by U.S. and other governments may, in the future, have significant collateral consequences for Citi, including loss of customers and business, operational loss and the inability to offer certain products or services and/or operate certain businesses. Citi may be required to accept or be subject to similar types of criminal remedies, consent orders, sanctions, substantial fines and penalties, remediation and other financial costs or other requirements in the future, including for matters or practices not yet known to Citi, any of which could materially and negatively affect Citi’s businesses, business practices, financial condition or results of operations, require material changes in Citi’s operations or cause Citi substantial reputational harm.\n    Additionally, many large claims—both private civil and regulatory—asserted against Citi are highly complex, slow to develop and may involve novel or untested legal theories. The outcome of such proceedings is difficult to predict or estimate until late in the proceedings. Although Citi establishes accruals for its legal and regulatory matters according to accounting requirements, Citi’s estimates of, and changes to, these accruals involve significant judgment and may be subject to significant uncertainty, and the amount of loss ultimately incurred in relation to those matters may be substantially higher than the amounts accrued (see the incorrect assumptions or estimates risk factor above). In addition, certain settlements are subject to court approval and may not be approved. Furthermore, regulators may be more likely to pursue investigations or proceedings against financial institutions, such as Citi, that have previously been the subject of other regulatory actions.\n    For further information on Citi’s legal and regulatory proceedings, see Note 30.\n\n    OTHER RISKS\n\n    Citi’s Emerging Markets Presence Subjects It to Various Risks as well as Increased Compliance and Regulatory Risks and Costs.\n    Citi’s presence in the emerging markets subjects it to various risks. During 2024, emerging markets revenues accounted for approximately 28% of Citi’s total revenues (based, beginning in 2024, on the IMF and FFIEC classifications, which resulted in the exclusion of certain countries that Citi previously classified as emerging markets).\n    Emerging market risks include, among others, limitations or unavailability of hedges on foreign investments; foreign currency volatility, including devaluations and strength in the U.S. dollar; central bank interest rate and other monetary policies, including the impact of sustained high interest rates in the U.S.; unemployment, recessions or weak or slowing economic growth; elevated inflation and hyperinflation; foreign exchange controls, including an inability to access indirect foreign exchange mechanisms; macroeconomic,\n    63\n\n    geopolitical and domestic political challenges, uncertainties and volatility, including with respect to China, the Russia–Ukraine war and conflicts in the Middle East; cyberattacks; restrictions arising from retaliatory laws and regulations; sanctions or asset freezes; sovereign debt volatility; fluctuations in commodity prices; the effects of potential policy and other changes resulting from the new U.S. administration, including those related to Mexico; the effects of potential policy and other changes resulting from the new Mexican administration and Congress, including judicial reforms; regulatory changes, including potential conflicts among regulations with other jurisdictions where Citi does business; limitations on foreign investment; sociopolitical instability; civil unrest; crime, corruption and fraud; nationalization or loss of licenses; potential criminal charges; closure of branches or subsidiaries; and confiscation of assets; and these risks can be exacerbated in the event of a deterioration in the relationship between the U.S. and an emerging market country.\n    For example, Citi operates in several countries that have, or have had in the past, strict capital controls, currency controls and/or sanctions, such as Argentina and Russia, that limit its ability to convert local currency into U.S. dollars and/or transfer funds outside of those countries. For instance, Citi may need to record additional translation losses due to currency controls in Argentina (see “Managing Global Risk—Other Risks—Country Risk—Argentina” below). Moreover, Citi may need to record additional reserves for expected losses for its credit exposures based on the transfer risk associated with exposures outside the U.S., driven by safety and soundness considerations under U.S. banking law (see “Managing Global Risk—Other Risks—Country Risk—Argentina” and “—Russia” and “Significant Accounting Policies and Significant Estimates” below).\n    In the event of a loss of control of AO Citibank in Russia, Citi would be required to (i) write off its remaining nominal net investment, (ii) recognize a CTA loss of approximately $1.6 billion through earnings and (iii) recognize a loss of $0.9 billion on intercompany liabilities owed by AO Citibank to other Citi entities outside of Russia. In the sole event of a substantial liquidation, as opposed to a loss of control, Citi would be required to recognize the CTA loss of approximately $1.6 billion through earnings and would evaluate its remaining net investment as circumstances evolve. For additional information about these risks and related potential impacts, see the operational processes and systems and cybersecurity risk factors above and “Managing Global Risk—Other Risks—Country Risk—Russia” below.\n\n    In addition, political turmoil and instability; geopolitical challenges, tensions and conflicts (including those related to China, the Russia–Ukraine war and the conflicts in the Middle East); terrorism; and other instabilities have occurred in various regions and emerging market countries across the globe, which impact Citi’s businesses, results of operations and financial conditions in those countries where Citi operates and have required, and may continue to require, management time and attention and other resources, such as managing the impact of sanctions and their effect on Citi’s operations in certain emerging market countries. For additional information, see the macroeconomic challenges and uncertainties risk factor above.\n    "
  }
}