{
  "ticker": "CAG",
  "cik": "0000023217",
  "company_name": "CONAGRA BRANDS INC.",
  "filing_date": "2025-07-10",
  "accession": "0001558370-25-009180",
  "primary_doc": "tmb-20250525x10k.htm",
  "item_sections": {
    "item1": "ITEM 1A. RISK FACTORS\nOur business is subject to various risks and uncertainties. Any of the risks and uncertainties described below could materially adversely affect our business, financial condition, and results of operations and should be considered in evaluating us. Although the risks are organized by headings and each risk is described separately, many of the risks are interrelated. While we believe we have identified and discussed below the key risk factors affecting our business, there may be additional risks and uncertainties that are not presently known or that are not currently believed to be significant that may adversely affect our business, performance, or financial condition in the future. You should not interpret the disclosure of any risk factor to imply that the risk has not already materialized.\nMarket Risks \nDeterioration of general economic conditions, an economic recession, periods of inflation, or economic uncertainty may affect consumers resulting in reductions in consumer spending and have in the past harmed and could continue to harm our business and results of operations.\n \nOur business and results of operations have in the past been and may continue to be adversely affected by changes in national or global stability and economic conditions, including inflation, rising interest rates; changing international trade, tariff, immigration, \n7\n\n\nTable of Contents\nand tax policies; decreased availability of capital, volatility in financial markets, declining consumer spending rates, declining benefits or increased limitations under government food assistance programs for consumers; rising unemployment; recessions; decreased energy availability and increased energy costs (including fuel surcharges); supply chain challenges; labor shortages; the effects of governmental initiatives to manage economic conditions; geopolitical conflicts (including as discussed in the risk factor below); and the negative impacts caused by pandemics, epidemics, and disease, in humans and animals, such as the avian flu. \nThese economic factors could continue to impact our business and operations in a variety of ways, including as follows: \n●\nconsumers shifting purchases to more generic, lower-priced, or other value offerings, or foregoing certain purchases altogether during economic downturns, which could result in a reduction in sales of higher margin products, or a shift in our product mix to lower margin offerings adversely affecting the results of our operations; \n●\nvolatility in commodity and other input costs could substantially impact our result of operations; \n●\nrising interest rates may adversely impact our results of operations;  \n●\ndecreased demand in the restaurant business, particularly casual and fine dining, may adversely affect our Foodservice operations; \n●\nvolatility in the equity markets or interest rates could substantially impact our pension costs and required pension contributions; and \n●\nit may become more costly or difficult to obtain debt or equity financing to fund operations or investment opportunities, or to refinance our debt in the future, in each case on terms and within a time period acceptable to us\n. \nInflation, increased interest rates, and other economic conditions including potential recession and credit market disruptions, could negatively impact our business.\n \nCustomer and consumer demand for our products may be impacted by heightened inflation, increased or fluctuating tariffs, increased interest rates and other weak economic conditions including recessionary conditions and credit market disruptions and volatility. Continued weak economic conditions may adversely impact consumers causing a decrease in demand for our products from our customers and consumers. Additionally, these economic conditions may adversely impact some of our customers, suppliers and other vendors who are highly leveraged increasing the risk of uncollectible accounts or trade receivables, extended payment terms, and bankruptcy. We have experienced and may continue to experience negative impacts to our business ranging from an inability to collect accounts receivable to supply chain disruptions caused by failures of our counterparties to continue as a going concern due to financial and liquidity issues. \nOur business, financial condition, and results of operations have in the past been and could continue to be adversely affected by disruptions in the global economy caused by geopolitical conflicts.\n \nOur business, financial condition and results of operations have been impacted in the past and may be impacted in the future by disruptions in the global economy. The global economy has been negatively impacted by geopolitical conflicts, and related export controls and economic sanctions, including the continuing military conflict between Russia and Ukraine, conflicts in the Middle East, and rising tensions elsewhere including between China and Taiwan. Although we have no direct operations in Russia, Ukraine, the Middle East, China, or Taiwan, we have experienced, or may experience, shortages in materials from these regions, increased tariffs, sanctions or restrictions relating to these regions, and resulting increased costs or volatility relating to transportation, energy, and raw materials as a result of impacts from conflicts in these regions, and reduced consumer confidence and consumption due in part to the negative impact of these conflicts and tensions on the global economy. Further escalations of geopolitical tensions related to military conflicts, including increased or fluctuating trade barriers or restrictions on global trade, could also result in cyberattacks, supply or distribution disruptions, lower consumer demand, and changes to foreign exchange rates and financial markets, any of which may adversely affect our business and supply chain. In addition, the effects of the ongoing conflicts could heighten many of our known risks described in this",
    "item1a": "Item 1A of Part I, “Risk Factors,” under the heading “Cybersecurity and Information Technology Risks,” which should be read in conjunction with the foregoing information.\n​\nGovernance\n​\nGeneral\n​\nOur management is responsible for identifying, assessing, and managing our exposure to cybersecurity risk. Management identifies and assesses risks through its cross functional ERM committee that is responsible \nfor:\n​\n●\nFacilitating risk conversations with cross-functional leaders and teams\n●\nPartnering with risk owners to develop risk management action plans focused on mitigating the drivers of the enterprise risks\n●\nIdentifying key metrics to objectively assess the risk to the Company applying both a short-term and long-term perspective\n●\nInforming our strategic planning based on risks assessments after consideration of action plans and residual risk\n21\n\n\nTable of Contents\n●\nDeveloping a risk-aware culture throughout the organization\nOur Board of Directors and its Audit / Finance Committee play an active part in overseeing cybersecurity risks relevant to the Company. The Board and its Audit / Finance Committee routinely receive reports from our management and external advisors on critical risk areas.\n​\nManagement\n​\nThe Company maintains a dedicated internal cybersecurity team that is supported by internal and external software, third-party experts, and threat intelligence resources. Members of our cybersecurity team provide cybersecurity reports to our Board, SLT, and cross-functional leaders and teams.  The internal cybersecurity team is responsible for implementing our cybersecurity strategy including policies, standards, architecture, and processes including our processes for identifying cybersecurity risks and threats and recommending mitigating actions to strengthen cybersecurity resilience. In addition, our internal cybersecurity team is responsible for managing detection, mitigation, and remediation of all cybersecurity incidents. \n​\nConagra’s Cybersecurity Team is led by our \nChief Information Security Officer (CISO)\n. \nOur CISO, a certified information security professional, has more than 25 years of cybersecurity leadership experience across multiple industries and holds a Doctor of Science (DSc) degree in Cybersecurity.\n The CISO reports to our Chief Information Officer (CIO), who has been with Conagra for more than 20 years serving in various leadership roles in information technology, finance, and business services. We believe our CIO possesses a firm understanding of the Company’s cybersecurity landscape, risks, and knowledge of the capabilities of our cybersecurity and information systems personnel.    \n​\nAdditionally, members of our internal cybersecurity team have experience in cybersecurity risk management, threat monitoring, threat emulation, penetration testing, cyber incident response management, and data protection. Team members have both individual responsibilities and a team focus, and manage both internal and third-party cybersecurity risk mitigation, covering areas such as network, endpoint device, and e-mail security as well as operations and threat management, monitoring, and response. Our CISO, CIO and CFO are responsible for determining that the Company has appropriate people, process and technology capabilities to identify, mitigate and report on cybersecurity risks to the SLT and Board of Directors. \n​\nOur cybersecurity incident response plan provides that our ERM, strategic crises management coordinator is informed about significant cybersecurity incidents for escalation to our internal Incident Disclosure Committee, SLT, and Board, as appropriate in accordance with our strategic crisis management action plan. Our cybersecurity incident response team is responsible for maintaining our cybersecurity incident response plan, which is periodically tested through our tabletop exercises. We have involved outside experts, our strategic crises management coordinator, members of our SLT, and members of our Incident Disclosure Committee in our tabletop exercises and preparedness drills to strengthen these response plans.\n​\nAdditionally, our Corporate Cybersecurity Steering Committee, chaired by the CISO and whose members include our Senior Vice President, Corporate Controller (our principal accounting officer), as well as other members of the information technology, finance, supply chain, security and facilities, research and development, product, human resources, and legal teams, meets regularly to provide a forum for senior leaders and key stakeholders to strengthen their understanding and strategize on managing cybersecurity challenges at the Company.  \n​\nBoard of Directors and its Audit/Finance Committee\n \n​\nOur Board and its Audit/Finance Committee exercises oversight over our enterprise risk management including our cybersecurity program.\n The Audit/Finance Committee receives updates from our CIO or CISO at each of its regularly scheduled meetings regarding matters related to information technology and cybersecurity including the state of the Company’s cybersecurity programs, emerging cybersecurity developments and threats, and the Company’s strategy to mitigate cybersecurity risks. Additionally, \nour full Board receives reports on our cybersecurity program at least annually which includes a review of our cybersecurity incident response plans\n which are described above.\n​",
    "item1b": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone.",
    "item1c": "ITEM 1C. \nCYBER\nSECURITY\nRisk Management and Strategy\n​\nAssessing, Identifying and Managing Material Risks\n​\nOur cybersecurity program is focused on assessing, identifying, and managing risks arising out of our use of information technology including the risk of cybersecurity incidents and threats. Our program is informed by recognized frameworks (such as the U.S. Department of Commerce’s National Institute of Standards and Technology Cybersecurity Framework) and leverages external and internal expertise, as appropriate. Our program is integrated into our operations and is widely communicated to employees through annual employee and contractor cybersecurity awareness training, regular awareness exercises, and employee outreach activities including cybersecurity tech talks, on-site digital signage, intranet resources, CEO cybersecurity champion recognition at quarterly town hall meetings, and other targeted communications. These awareness measures are coupled with ongoing implementation of technology aimed to reduce vulnerabilities (including external testing and validation) and to monitor and assess threats. Our program includes monitoring on an ongoing basis by automated tools that detect threats and trigger alerts for assessment, investigation, and remediation by our internal cybersecurity team.\n​\nIntegration with Enterprise Risk Management\n​\nThe cybersecurity program is an important part of the Company’s enterprise risk management (ERM), with our Senior Vice President & Chief Information Officer serving on our ERM Committee and our Vice President of ERM serving as the strategic crisis management coordinator under our cybersecurity incident response plan. We have developed processes for managing cybersecurity \n20\n\n\nTable of Contents\nincidents including clear allocation of responsibilities and defined incident classifications, escalation requirements based on materiality, and prioritization parameters. \nOur cybersecurity incident response plan is integrated into our ERM Committee risk mitigation\n action plan process, our Senior Leadership Team (SLT) strategic crisis management action plan process, and our Disclosure Committee protocol for cybersecurity incidents. We also maintain business continuity and disaster recovery plans to prepare for potential information technology disruptions.\n​\nCybersecurity Program Components \n​\nOur cybersecurity program structure consists of our cybersecurity operations center; identity and access management; governance, risk, and compliance; architecture; and operational technology. Aspects of our program include:  \n​\n●\nActivities to assess vulnerabilities including penetration testing, red teaming, tabletop exercises, and phishing and social engineering drills \n●\nEngagement with law enforcement and U.S. government agencies, directly and through memberships in various cybersecurity intelligence and risk sharing organizations to help us stay informed about evolving threats\n●\nUtilization of third-party experts to test, validate, and strengthen our plans, practices, and policies\n●\nTechnology team collaboration sessions to share information across different teams, geographic areas, and areas of responsibilities\n●\nAssessing and managing cybersecurity risks arising out of the use of third-party technology and services, including pre-contract diligence, imposition of contractual obligations, and performance monitoring\nLearnings from these activities are used to inform our training, guide our incident response preparedness and enhance our plans and processes. To further inform our cybersecurity program, we also participate in discussions with third-party service providers who have experienced cybersecurity incidents. \n​\nInvestment in Cybersecurity Program\n​\nThe cybersecurity threat landscape is dynamic and volatile, and requires significant investment on the part of the Company in several key areas including investing in our employees through talent recruitment, retention, training and development, investing in external resources including procuring and deploying the correct tools to monitor, evaluate, and address threats, investing employee resources to maintain effective processes, and investing in strategic relationships to monitor evolving risks including third-party service provider vulnerabilities. While our third-party service providers have experienced cybersecurity incidents and we have experienced threats to our data and systems, to date, \nwe are not aware that we have experienced a breach that had a material impact on our operations or business, however, cybersecurity risks that may materially impact \nthe Company are discussed in more detail in"
  }
}