{
  "ticker": "CARR",
  "cik": "0001783180",
  "company_name": "CARRIER GLOBAL Corp",
  "filing_date": "2025-02-11",
  "accession": "0001783180-25-000008",
  "primary_doc": "carr-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1. BUSINESS\nGeneral \nCarrier Global Corporation (\"we\" or \"our\" or the \"Company\") is a global leader in intelligent climate and energy solutions with a focus on providing differentiated, digitally-enabled lifecycle solutions to our customers. Our portfolio includes industry-leading brands such as Carrier, Viessmann, Toshiba, Automated Logic and Carrier Transicold that offer innovative heating, ventilating and air conditioning (\"HVAC\"), refrigeration and cold chain transportation solutions to help make the world safer and more comfortable. We also provide a broad array of related building services, including audit, design, installation, system integration, repair, maintenance and monitoring.\nThrough our performance-driven culture, we anticipate creating long-term shareowner value by investing strategically to strengthen our product position in homes, buildings and across the cold chain in order to drive profitable growth. We believe our business segments are well positioned to benefit from favorable secular trends, including the mega-trends of urbanization, population growth and demographic shifts, food security and safety, digitalization, global connectivity and energy efficiency. Coupled with our industry-leading brands and track record of innovation, we continue to provide market-leading solutions for our customers.\nIn addition, we continue to invest in product and technology innovation within our offerings as well as invest in new business models including Carrier Energy, our solution to reduce demands on power grids and energy infrastructure by better managing energy consumption and reducing end-customer energy costs. This new business model is also expected to provide a digital connection between the end-customers and Carrier, providing us with opportunities to offer services and aftermarket parts and components over the life of a product.\nFor the year ended December 31, 2024, our net sales were $22.5 billion and our operating profit was $2.6 billion. Our net sales for 2024 were derived from the Americas (52%), Europe, Middle East and Africa (\"EMEA\") (31%) and Asia-Pacific (17%). Our international operations, including U.S. export sales, represented approximately 50% of our net sales for 2024. During the same period, new equipment comprised 75% and parts and service comprised 25% of our net sales.\nSales by Segment *\nNet Sales by Region\nSales by Type\n* Segment sales include inter-company sales.\n4\nTable of Contents\nSeparation from United Technologies Corporation\nOn April 3, 2020 (the \"Distribution Date\"), United Technologies Corporation, (\"UTC\"), since renamed RTX Corporation (\"Raytheon Technologies Corporation\" or \"RTX\") completed the spin-off of Carrier into an independent publicly traded company (the \"Separation\") through a pro rata distribution (the \"Distribution\") on a one-for-one basis of all of the outstanding shares of common stock of Carrier to UTC shareowners who held shares of UTC common stock as of the close of business on March 19, 2020, the record date of the Distribution. In addition, we entered into several agreements with UTC and Otis Worldwide Corporation (\"Otis\") that govern various aspects of the relationship among us, UTC and Otis following the Separation and Distribution. As of December 31, 2024, only certain portions of the Tax Matters Agreement (\"TMA\") remain in effect.\nBusiness Segments\nWe globally manage our business operations through two segments: HVAC and Refrigeration. Each respective segment's major products, services and distribution methods are as follows:\nThe HVAC segment provides products, controls, services and solutions to meet the heating, cooling and ventilation needs of our customers while enhancing building performance, health and energy efficiency. Products and services include air conditioners, heating systems, heat pumps, building automation systems, aftermarket components, repair and maintenance services and rentals as well as modernization and upgrades through the product lifecycle. Our products and services cover a wide range of customers, including in the residential, commercial, education, healthcare, technology, retail, hospitality, data center, and infrastructure markets, among others. Products and solutions are sold directly to building contractors and owners and indirectly through joint ventures, independent sales representatives, distributors, wholesalers, dealers and retail outlets. Our established brands include Carrier, Viessmann, Toshiba, Automated Logic, Bryant, CIAT, Day & Night, Heil, NORESCO and Riello which offer an innovative and complete portfolio of products that provide numerous solutions for our customers. These products, in addition to the markets they serve, provide future service opportunities including replacement components, preventative and on-demand contractual maintenance and repair, digital monitoring and modifications/upgrades. \nThe Refrigeration segment provides products, services and monitoring for reliable transport and preservation of food, medicine and other perishable cargo. Products include trucks, trailers, shipping containers and intermodal applications to meet customer needs for both ground transport and ocean freight, while services include maintenance, repair, and monitoring. Products and services are sold directly to transportation companies and indirectly through joint ventures, independent sales representatives, distributors, wholesalers and dealers. Products and services are sold under established brand names, including Carrier Transicold and Sensitech. We provide customers the flexibility to select solutions from a very broad range of technologies including fossil fuel applications and electric solutions to best adhere to their objectives and preferences as well as regulatory requirements. In addition, our focus on digitalization and innovation is expanding our offering of service and aftermarket solutions, including on-demand and subscription-based monitoring of customer cargo. Through the lifecycle of the product, we also offer modifications and upgrades to the current installed base, improving energy efficiency, noise or other customer requirements.\nPortfolio Transformation\nIn 2023, we began the journey to further simplify our company and accelerate our business strategy. Our actions transformed our business portfolio in an effort to establish us as a pure-play, global leader in intelligent climate and energy solutions. We believe that our greater focus on breakthrough innovation, electrification, energy-efficient solutions, the use of environmentally friendly refrigerants and connected ecosystems will further strengthen our global leadership position in our end-markets and provide responsible solutions for our customers.\nOn April 25, 2023, we announced that we entered into a Share Purchase Agreement (the “Agreement”) to acquire the climate solutions business (the \"VCS Business\") of Viessmann Group GmbH & Co. KG (“Viessmann”), a privately-held company. The VCS Business develops intelligent, integrated and sustainable technologies, including heat pumps, boilers, photovoltaic systems, home battery storage and digital solutions, primarily for residential customers in Europe. The acquisition was completed on January 2, 2024 and reported within our HVAC segment. \n5\nTable of Contents\nOn June 2, 2024, we completed the sale of our Access Solutions business (\"Access Solutions\") to Honeywell International Inc. (\"Honeywell\") for cash proceeds of $5.0 billion. Access Solutions, historically reported in our Fire & Security segment, is a global supplier of physical security and digital access solutions supporting the hospitality, commercial, education and military markets. We recognized a net gain on the sale of $1.8 billion.\nOn July 1, 2024, we completed the sale of our Industrial Fire business (\"Industrial Fire\") for cash proceeds of $1.4 billion. Industrial Fire, historically reported in our Fire & Security segment, is a leading manufacturer of a full spectrum of fire detection and suppression solutions and services in critical high-hazard environments, including oil and gas, power generation, marine and offshore facilities, automotive, data centers and aircraft hangars. We recognized a net gain on the sale of $319 million.\nOn October 1, 2024, we completed the sale of our Commercial Refrigeration business (\"CCR\") for cash proceeds of $679 million. CCR, historically reported in our Refrigeration segment, is a global supplier of turnkey solutions for commercial refrigeration systems and services, with a primary focus on serving food retail customers, cold storage facilities and warehouses. We recognized a net gain on the sale of $292 million. The net proceeds received are subject to working capital and other adjustments provided in the stock purchase agreement.\nOn December 2, 2024, we completed the sale of our Commercial and Residential Fire business (\"CRF Business\") for cash proceeds of $2.9 billion. The CRF Business, historically reported in our Fire & Security segment, is a leading manufacturer of fire detection and alarm solutions for both commercial and residential applications. We recognized a net gain on the sale of $1.4 billion. The net proceeds received are subject to working capital and other adjustments provided in the stock purchase agreement.\nBusiness Strategy\nOur vision is to be a global leader in intelligent climate and energy solutions with a focus on providing differentiated, digitally-enabled lifecycle solutions to our customers. To achieve our vision, our core business strategy is to create innovative, differentiated products and solutions to provide a fully-integrated customer experience in order to be our customer’s preferred provider. We believe our strategy is supported by significant favorable secular trends, our industry-leading brands and track record of innovation. Our business strategy is built around the following pillars to drive long-term growth and deliver shareholder value:\nDifferentiated Products, Channels and Brands\nOur strategy involves driving organic growth by further enhancing our proven track record of innovation, which is focused on designing smarter, more connected and more efficient sustainable systems and solutions. Our strategy also relies on our iconic, industry-leading brands and on strengthening our long-term relationships with channel partners and customers by offering solutions that anticipate customer needs with a focus on technologies related to energy efficiency, emissions, air quality, electrification, refrigerants with lower global warming potential and noise reduction. \nDigitally-Enabled Lifecycle Solutions\nWe are focused on offering a comprehensive and differentiated suite of sustainable technologies and services. We expect that these solutions increase our total available market opportunity, enhance our predictive service and maintenance capabilities, strengthen our customer intimacy and increase aftermarket growth. Beginning with product design, our product offerings are moving towards digitally-enabled solutions that connect us to our customers throughout the product’s full lifecycle and help us grow our aftermarket sales. We plan to meet our customer’s needs by offering a wider-range of aftermarket products and services including replacement components, preventative and on-demand maintenance and repair, digital monitoring and modifications/upgrades. Our digitally-enabled lifecycle solutions include Abound, a cloud-based building platform that unlocks and unites building data to create healthy, sustainable and intelligent solutions for indoor spaces. It gathers data from disparate systems, sensors and sources; identifies opportunities to optimize performance; and works with healthy building solutions to improve occupant experiences. In addition, our Lynx digital platform, developed in collaboration with Amazon Web Services (“AWS”), allows customers to leverage data to enhance visibility, resiliency, agility and efficiency in the cold chain to reduce loss of cargo, lower operations costs and support real-time decisions.\n6\nTable of Contents\nExpand Portfolio with Energy Management Solutions\nAs power grids and transportation infrastructure shift from fossil fuels to renewables, we will continue to position ourselves as a leader in innovative solutions that reduce emissions and energy consumption and promote power grid stability. Our solutions range from residential home energy management to sustainable solutions for commercial and industrial buildings to optimized low noise and low gas emission transport solutions. With the addition of the VCS Business on January 2, 2024, we are well positioned to provide complete energy solutions globally. Our portfolio includes environmentally friendly refrigerants, high temperature heat pumps for use in industrial and commercial applications, natural refrigerant heat pumps for residential buildings and a connected ecosystem for homes including solar PV, batteries and a differentiated digital platform, all supported by extensive service and aftermarket offerings.\nStrategic Capital Allocation\nOur priorities for capital deployment include funding organic growth, acquisitions and capital returns to shareowners through a growing and sustainable dividend and share repurchases. We pursue potential acquisitions to complement existing products and services and to expand the range of technologies and solutions available to our customers. We leverage our global operations, the strength of our iconic, industry-leading brands and our success in creating valuable partnerships to focus on targeted expansion into new locations and channels where we believe that we can drive profitable growth. These drivers are supported by research and development activities with a focus on new product development and new technology innovation. In addition, Carrier Ventures, our global venture capital wholly-owned subsidiary, focuses on investments to accelerate the development of sustainable innovations and disruptive technologies to transform future building and cold chain management. It engages in strategic partnerships with high growth organizations as they invest in the development of technologies to innovate and commercialize the next generation of integrated offerings.\nOther Matters Relating to Our Business as a Whole\nCompetitive Conditions\nEach of our businesses is subject to significant competition from a number of companies throughout the world. Due to the nature of our products and services and the markets we serve, our competition can vary from regional or specialized companies to larger public or private companies.\nThe most significant competitive factors we face are technology differentiation, product performance, service, delivery schedule and price. Brand reputation, service to customers and quality are also important competitive factors for our products and services. While our competitive position varies among our products and services, we are a significant competitor with respect to each of our major product and service offerings. We believe that the loss of any individual contract or customer would not have a material adverse effect on our results.\nRaw Materials and Supplies\nWe rely on suppliers and commodity markets to secure components and raw materials such as copper, aluminum and steel. In addition, we also use semi-conductors and other electronic components in the manufacture of our products. To maximize our buying effectiveness and leverage our scale, we have a central strategic sourcing group that consolidates purchases of certain materials and components across our business segments. We work closely with our suppliers to ensure availability of products and implement other cost savings initiatives. In addition, we continue to invest in our supply chain to improve its resilience with a focus on automation, dual sourcing of critical components and localized manufacturing when feasible.\nIntellectual Property\nWe maintain a broad portfolio of patents, trademarks, copyrights, trade secrets, licenses and franchises related to our business to protect our research and development investments and to maintain our competitive advantages. We hold approximately 12,000 active patents and pending patent applications worldwide. From time to time, we take actions to protect our business by asserting our intellectual property rights against third-party infringement. We believe that we have taken reasonable measures to build and protect this portfolio of intellectual property rights, but we cannot be assured that these rights will not be challenged, found invalid or unenforceable.\n7\nTable of Contents\nOperating System\nWe plan to continue to foster operational, financial and commercial excellence to drive sales and earnings growth. With roots in our legacy manufacturing and business processes, the Carrier operating system — Carrier Excellence — is our continuous improvement framework that is expected to drive operational excellence across our businesses. Our Supplier Excellence program is intended to apply these same operating principles to our supply base and we continue to focus on strategic cost reductions through operational efficiency, digitalization, automation and supply chain productivity.\nJoint Ventures and Strategic Relationships\nOur joint ventures and strategic relationships are an important part of our business. We hold direct ownership interests in approximately 55 joint ventures, the financial results of which are accounted for by the equity method of accounting or the cost basis of accounting, of which 97% of such investments are in our HVAC segment. These relationships engage in distribution, manufacturing and product development activities and are integral to our business operations and growth strategy.\nSeasonality\nDemand for certain of our products and services is seasonal and can be impacted by weather conditions. For instance, sales and services of our HVAC products to residential customers have historically been higher in the second and third quarters of the calendar year, which represent the peak seasons for air conditioning-related sales in North America markets. \nA change in building and remodeling activity also can affect our financial performance. In addition, our financial performance may be influenced by the production and utilization of transport equipment, including truck production cycles in North America and Europe.\nCompliance with the Regulation of our Business and Operations\nWe operate our businesses and sell our products all over the world. As a result, rapid changes in legislation, regulations and government policies affect our operations and business in the countries, regions and localities in which we operate and sell our products. International accords such as the Paris Agreement and the subsequent U.S. climate policies to meet its nationally determined contributions as well as local regulations in the U.S. reducing the use of fossil fuels in buildings all have the potential to impact our products and service offerings. Such changes, which can render our products and technologies non-compliant, involve refrigerants, noise levels, product and fire safety, hydrofluorocarbon emissions, fluorinated gases, hazardous substances and electric and electronic equipment waste. Increased fragmentation of regulatory requirements changes the manner in which we conduct our business and increases our costs because it necessitates the development of country or regional specific variants, monitoring of and compliance with those regulations and additional testing and certifications. In addition, our operations are subject to and affected by environmental regulations promulgated by federal, state and local authorities in the U.S. and by authorities with jurisdiction over our foreign operations. We have made, and will be required to continue to make, capital expenditures to design and upgrade our products to comply with or exceed environmental and other regulations and energy efficiency standards. However, we believe that the costs related to compliance requirements for environmental or other government regulations will not have a material adverse effect on our capital expenditures, financial results or competitive position.\nEnvironmental Goals\nAs a global leader in intelligent climate and energy solutions, we are committed to making the world safer, sustainable and more comfortable. We have set ambitious sustainability goals to be reached by 2030, which include the following:\n•\nInvest over $4 billion to develop intelligent climate and energy solutions that reduce environmental impacts,\n•\nAvoid more than 1 gigaton of customer greenhouse gas emissions,\n•\nAchieve carbon neutral operations,\n•\nReduce energy intensity by 10% across our operations,\n•\nDevelop water stewardship programs across our global operations, prioritizing water-scarce locations, and \n•\nPromote sustainability and positively impact communities and our workforce through education, partnerships, programs and volunteering our time and talent. \n8\nTable of Contents\nHuman Capital Management\nAt Carrier, we strive to connect our people to our purpose, our vision, our strategic priorities, our culture and each other, with the ultimate goal to engage our teams, drive success and create value for our customers and shareowners.\nCulture and People\nOur operating fundamentals - \nThe Carrier Way, Leading People The Carrier Way, \nand\n Carrier Excellence\n – serve as a basis for how we operate our company and drive success, as One Team. \nThe Carrier Way\n outlines our vision, values, and cultural behaviors. \nLeading People The Carrier Way\n sets expectations for people leaders and how we build the best teams. \nCarrier Excellence\n is our continuous improvement operating system, a mindset that focuses the organization on enhancing efficiency, and delivering high-quality outcomes across all facets of our business.\nOur employees collaborate as one team across more than 50 countries. We develop and deploy best-in-class programs and practices, provide enriching career opportunities, listen to employee feedback and always challenge ourselves to do better. As of December 31, 2024, we had approximately 48,000 employees worldwide, of which 35% are located in the Americas, 36% are located in EMEA and 29% are located in Asia Pacific.\nWe are an employer of choice and we focus on our \nBuild Best Teams\n cultural behavior priority through the deployment of our talent ecosystem that connects strategy, embeds talent in our culture and activates it through people programs, processes and leadership. One of our core values in \nThe Carrier Way\n, inclusion, is fundamental to who we are and what we do. We aspire to have an inclusive culture where each and every employee can come to work, every day, feeling like they _belong, and can contribute to their fullest and greatest potential. We continuously evaluate, modify and enhance our recruitment and retention strategies as part of the overall management of our business.\n \nAligned to our fundamentals and talent ecosystem, we promote learning and development through technical and leadership programs, as well as tuition assistance to enhance our employees’ skills and abilities. Our offerings include an online platform, strategic partnerships and on-site technical training centers. We conduct annual leadership development reviews to identify future leaders and foster succession planning. We also renew our talent pipeline with internships and early career rotational programs. Through a strategic approach to human capital, we are creating an environment where employees thrive, belong, and contribute to a more sustainable and resilient world.\nEmployee Well-being, Health and Safety\nCreating an environment where employees thrive includes prioritizing health, safety, and overall well-being. We are committed to maintaining world-class standards.\nOur Environmental, Health and Safety program is focused on eliminating the risk of serious injuries, illness and fatalities to employees, contractors and customers during manufacturing, installation, servicing and other business activities. We apply rigorous standards to ensure that our operations and premises comply with national and local regulations and our incident reporting requirements. For 2024, our total recordable incident rate (\"TRIR\"), based upon the number of employee injuries per 200,000 hours worked, was 0.32 and our lost time incident rate (\"LTIR\") was 0.15.\nOur global well-being programs support employees’ physical, mental and financial health, offering flexible benefits, mental health resources, hybrid-work and financial planning tools. Our total rewards philosophy is designed to align the compensation of our employees with individual and company performance and to provide the appropriate market-competitive incentives to attract, retain and motivate employees to achieve superior results.\n \nWe measure the \nPulse\n of our workforce three times per year through company-wide employee surveys to help us understand how employees feel about working at Carrier and what we can do to improve their experience.\nAs of December 31, 2024, in the U.S., 90% of our approximately 4,000 production and maintenance employees were covered under six collective bargaining agreements with expiration dates ranging from 2025 to 2027. In Europe, approximately 16,200 employees are represented by a European Works Council and, at national and local levels, we inform and consult with 49 local works councils and with unions representing employees at approximately 40 sites. Relations with our labor unions and works councils are generally positive. \n9\nTable of Contents\nCorporate Information\nCarrier was incorporated in Delaware in connection with the Separation on March 15, 2019. Our principal executive offices are located at 13995 Pasteur Boulevard, Palm Beach Gardens, Florida 33418, and our telephone number is (561) 365-2000. We maintain an Internet website at \nwww.corporate.carrier.com\n.",
    "item1a": "ITEM 1A. RISK FACTORS \nRISK FACTOR SUMMARY\nRisks Related to Our Business \n•\nRisks associated with our international operations could adversely affect our competitive position, results of operations, cash flows or financial condition.\n•\nWe are party to joint ventures and other strategic relationships, which may not be successful and may expose us to unique risks and restrictions.\n•\nRisks associated with climate events, government regulations and incentives associated with climate events and mitigation efforts could adversely affect our business.\n•\nDemand for our HVAC products and services is influenced by weather conditions and seasonality.\n•\nOur business and financial performance depend on continued and substantial investments in our information and operational technology infrastructure, which may not yield anticipated benefits and which may be vulnerable to cyber-attacks.\n•\nCybersecurity incidents could disrupt business operations, result in the loss of critical and confidential information, and adversely impact our reputation and results of operations.\n•\nWe engage in acquisitions and divestitures and may encounter difficulties integrating acquired businesses with, or disposing of businesses from, our current operations; therefore, we may not realize the anticipated benefits of these acquisitions and divestitures.\n•\nWe incurred debt obligations, and we may incur additional debt in the future, which could adversely affect our business and profitability and our ability to meet other obligations.\n•\nWe depend on our intellectual property and have access to certain intellectual property and information of our customers and suppliers. Infringement of or the failure to protect that intellectual property could adversely affect our future growth and success.\n•\nWe use a variety of raw materials, supplier-provided parts, and third-party service providers in our business. The ability of suppliers to deliver materials, parts, components and manufacturing equipment to our manufacturing facilities, and our ability to manufacture without disruption, could affect our business performance. Significant shortages, supplier capacity constraints or production disruptions, price increases, duties, tariffs or other government actions could increase our operating costs, disrupt our operations and adversely impact the competitive positions of our products.\n•\nWe design, manufacture and service products that incorporate advanced technologies. The introduction of new products and technologies involves risks, and we may not realize the degree or timing of benefits initially anticipated.\n•\nWe operate in a competitive environment and our profitability and competitive position depend on our ability to accurately estimate the costs and timing of providing our products and services.\n•\nCustomers and others may take disruptive actions.\n•\nLabor matters may impact our business.\n•\nOur defined benefit pension plans are subject to financial market risks that could adversely affect our results.\n•\nWe may not realize expected benefits from our cost reduction and restructuring efforts, and our profitability or our business otherwise might be adversely affected.\n•\nFailure to achieve and maintain a high level of product and service quality could damage our reputation with customers and negatively impact our results.\n•\nWe are subject to litigation, environmental and other legal and compliance risks.\n•\nWe are subject to risks arising from doing business with the U.S. government.\n•\nWe may recognize impairment charges for our goodwill and intangible assets.\n10\nTable of Contents\n•\nFailure to maintain a satisfactory credit rating could adversely affect our liquidity, capital position, borrowing costs and access to the capital markets.\nRisks Related to the Separation from UTC\n•\nAfter the Separation and the Distribution, certain members of management, directors and shareowners own stock in UTC, Carrier and Otis and as a result may face actual or potential conflicts of interest.\n•\nIn connection with the Separation into three independent public companies, each of UTC, Carrier and Otis has agreed to indemnify the other parties for certain liabilities. If we are required to pay UTC and/or Otis under these indemnities, our financial results could be negatively impacted. Also, the UTC or Otis indemnities may not be sufficient to hold us harmless from the full amount of liabilities for which UTC and Otis have been allocated responsibility, and UTC and/or Otis may not be able to satisfy their respective indemnification obligations in the future.\n•\nIn certain circumstances, we could be required to indemnify UTC for material taxes and other related amounts pursuant to indemnification obligations under the TMA.\n•\nPotential liabilities may arise due to fraudulent transfer considerations, which would adversely affect our financial condition and results of operations.\nRisks Related to Our Common Stock\n•\nThe market price and trading volume of our common stock may fluctuate significantly.\n•\nShareowner's percentage of ownership in our common stock may be diluted in the future.\n•\nQuarterly cash dividends may be discontinued or modified, are subject to a number of uncertainties and may affect the price of our common stock.\n•\nOur amended and restated bylaws designate the courts within the State of Delaware as the sole and exclusive forum for certain types of actions and proceedings that may be initiated by our shareowners, which could discourage lawsuits against Carrier and our directors and officers.\n•\nAnti-takeover provisions could enable our Board of Directors to resist a takeover attempt by a third party and limit the power of our shareowners.\nGeneral Risks\n•\nNatural disasters, epidemics or other unexpected events may disrupt our operations, adversely affect our results of operations, cash flows or financial condition, and may not be fully covered by insurance.\n•\nWe may be affected by global economic, capital market and political conditions, and conditions in the energy, construction, transportation and infrastructure industries in particular. Uncertainty in U.S. trade policy, including uncertainty surrounding changes in tariffs, trade agreements or other trade restrictions imposed by the U.S. or other governments, as well as political conditions in and between the United States and foreign countries in which we operate, could significantly and adversely affect our business and financial results.\n•\nOur business success depends on attracting and retaining key personnel and other talent throughout the Company. \n•\nAdditional tax expense or additional tax exposures could affect our future profitability.\n•\nFailure to maintain effective internal controls over financial reporting in accordance with Section 404 of the Sarbanes-Oxley Act could materially and adversely affect us.\n11\nTable of Contents\nRISK FACTORS\nOur business, financial condition, operating results and cash flows can be impacted by the factors set forth subsequently, any one of which could cause our actual results to vary materially from recent results or from our anticipated future results. \nRisks Related to Our Business\nRisks associated with our international operations could adversely affect our competitive position, results of operations, cash flows or financial condition.\nApproximately 50% of our net sales for the year ended December 31, 2024, are derived from international operations, including U.S. export sales. As a result, changes in local and regional economic conditions, including fluctuating exchange rates, may adversely affect demand for our products and the profits generated by our non-U.S. operations because a significant portion of our sales and expenses are denominated in currencies other than U.S. dollars. While we attempt to manage our exchange rate risks, we are not completely insulated from that exposure. Exchange rates can be volatile and a substantial weakening of foreign currencies against the U.S. dollar could reduce our operating margins in various locations outside of the U.S., which would adversely impact the comparability of our results from period to period.\nOur international sales and operations are also subject to the risks associated with changes in local government regulations and policies regarding investments, employment, taxation, incentives, foreign exchange and capital controls and the repatriation of earnings. Moreover, government regulations and policies regarding international trade, such as import quotas, punitive taxes or tariffs or similar trade barriers, whether imposed by individual governments or regional trade blocs, can affect demand for our products and services, impact the competitive position of our products or services or encumber our ability to manufacture or sell or procure products in certain countries. The implementation of more restrictive trade policies, including tariffs, by the U.S. or by other countries, such as China and Mexico, where we sell or produce our products and services or procure materials, including as a result of trade conflict between the U.S. and other countries, could negatively impact our business, results of operations and financial condition. Our international sales and operations are also sensitive to political and economic instability, changes in foreign national priorities and government budgets, and the risks associated with differing legal systems and customs in foreign countries.\nWe expect that sales to emerging markets will continue to account for a significant portion of our sales as developing nations around the world increase their demand for our products. In addition, as part of our globalization strategy, we have invested in certain countries, including Mexico, Brazil, China, India, Saudi Arabia and other countries in the Middle East. Emerging markets can present many risks, including cultural differences (such as employment and business practices), compliance risks, economic and government instability, exchange rate fluctuations and the imposition of foreign exchange and capital controls. While these factors and their impact are difficult to predict, any one or more of them could have a material adverse effect on our competitive position, results of operations, cash flows or financial condition.\nWe are party to joint ventures and other strategic relationships, which may not be successful and may expose us to unique risks and restrictions.\nOur business operations, particularly in our HVAC segment, depend on various strategic relationships, namely, joint ventures and non-wholly owned subsidiaries. We sell our products and services through certain key distributor, joint venture and similar relationships, including the Carrier Enterprise joint ventures with Watsco, Inc., AHI-Carrier FZC, a United Arab Emirates-based joint venture and various joint ventures with members of the Midea Group.\nSome of our strategic relationships engage in manufacturing and/or product development. Loss of a key channel partner, or a significant downturn or deterioration in the business or financial condition of a key channel partner, joint venture or similar relationship, whether related to, among other things, a labor strike, diminished liquidity or credit unavailability, weak demand for products or delays in the launch of new products, could adversely affect our results of operations in a particular period or the value of our equity investment. If we are not successful in maintaining our strategic distribution relationships, our financial condition, results of operations and cash flows may be adversely affected.\nIn addition, our ability to apply our internal controls and governance and compliance policies to our minority-held joint ventures is limited and can expose us to additional financial and reputational risks. We seek to take proactive steps to mitigate these concerns, including through audits and similar reviews.\n12\nTable of Contents\nJoint ventures and strategic relationships inherently involve certain other risks. Whether or not we hold a majority interest or maintain operational control in such arrangements, our partners and similar business associates may, for example: (1) have economic or business interests or objectives that are inconsistent with or contrary to our own; (2) exercise veto or other rights, to the extent available, to block actions that we believe are in our or the joint venture’s best interests; (3) act contrary to our policies or objectives; or (4) be unable or unwilling to fulfill their obligations.\nIn addition, there can be no assurance that any particular joint venture or strategic relationship will continue to be beneficial to us in the long term. For example, some of our joint ventures or other strategic agreements prohibit us from competing in certain geographic markets or product and services channels, and these restrictions may apply to other products and services we develop or businesses we acquire in the future.\nRisks associated with climate events, government regulations and incentives associated with climate events and mitigation efforts could adversely affect our business.\nThe effects of climate events, including increased frequency and intensity of extreme weather conditions and water scarcity, create financial risks to our business. The potential impacts of climate events on our operations are highly uncertain and depend upon the unique geographic and environmental factors present; for example rising sea levels at certain of our facilities, changing storm patterns and intensities and changing temperature levels. The effects of climate events could disrupt our operations by impacting the availability and cost of materials and by increasing insurance and other operating costs. The effects of climate events also may impact our decisions to construct new facilities or maintain existing facilities in the areas most prone to physical risks, which could similarly increase our operating and material costs. We could also face indirect financial risks passed through the supply chain that could result in higher prices for our products and the resources needed to produce them. Potential adverse impacts from climate events may create health and safety issues for employees operating at our facilities and may lead to an inability to maintain standard operating hours.\nThere is a general consensus that greenhouse gas emissions are linked to climate events, and that these emissions must be reduced dramatically to avert its worst effects. Increased public awareness and concern about climate events may continue to: (1) generate more international, regional and/or national requirements to curtail the use of high global warming potential refrigerants (e.g., the Kigali Amendment to the Montreal Protocol and the American Innovation and Manufacturing (\"AIM\") Act of 2020, which are essential to many of our products); (2) increase building energy and cold chain efficiency; (3) cause a shift away from the use of fossil fuels as an energy source, including natural gas prohibitions; and (4) lead to the adoption of additional rules and regulations surrounding public disclosures relating to greenhouse gas emissions, including those adopted in California and the European Union. In some instances, these requirements may render our existing technology, particularly some of our HVAC and refrigeration products, non-compliant or obsolete and we may be required to make increased capital expenditures to meet new regulations and standards, changing interpretations and stricter enforcement of current laws and regulations. Furthermore, our customers and the markets we serve may impose emissions or other environmental standards through regulation, market-based emissions policies or consumer preferences that we may not be able to timely meet due to our required level of capital investment and technology advancement. While we are committed to pursuing sustainable solutions for our products, there can be no assurance that our development efforts will be successful, that our products will be accepted by the market, that proposed regulations or deregulation will not have an adverse effect on our competitive position, or that economic returns will justify our investments in new product development. \nAt the same time, U.S. energy and climate policy may not align with the above trends. Inconsistent international, regional and/or national requirements associated with climate regulations, such as U.S. participation in the Paris Climate Agreement, also create economic and regulatory uncertainty. There is also regulatory and budgetary uncertainty associated with government incentives, which, if discontinued or materially reduced, could adversely impact the demand for energy-efficient buildings and homes and could increase costs of compliance. Further, the retraction of existing and implementation of new U.S. energy and/or climate policy and incentives could significantly and adversely impact our business, strategic direction and growth plans.\n13\nTable of Contents\nWe have set sustainability goals to be achieved by 2030, which include investing over $4 billion to develop intelligent climate and energy solutions that reduce environmental impacts, avoiding more than 1 gigaton of customer greenhouse gas emissions, achieving carbon neutral operations and reducing energy intensity by 10% across our operations. Although we intend to meet these goals, we may be required to expend significant resources to do so, which could increase our operational costs. Further, there can be no assurance of the extent to which any of our goals will be achieved, or that any future expenditures or investments we make in furtherance of achieving such goals will be available, effective, meet investor expectations or any binding or non-binding legal standards regarding sustainability performance. For example, to make substantial progress toward or to meet some of these goals, we may need to purchase or deploy a combination of renewable energy utility contracts, carbon credits or offsets, energy-efficient or low-emission products or operations, or carbon sequestration technologies, and there can be no assurance of the extent to which such contracts, credits, offsets, products, operations or technologies will be available or effective in reducing emissions or energy intensity. As global regulatory reporting obligations continue to emerge and evolve, we strive to align our sustainability disclosures to global reporting requirements, standards, and best practices. To the extent that reporting gaps exist as reporting standards change over time, this could result in increased compliance costs and risks.\nMoreover, we may determine that it is in the best interest of our company and our shareowners to prioritize other business, social, governance or sustainability investments over the achievement of our current goals based on economic, regulatory and social factors, business strategy or pressure from investors, activist groups or other stakeholders. If we are unable to make substantial progress toward or meet these goals, then we could incur adverse publicity and reaction from investors, activist groups or other stakeholders, which could adversely impact the perception of us and our products and services by current and potential customers, as well as investors, which could in turn adversely impact our results of operations. Differing views of environmental, social and governance issues may also increase the risk that our goals or actions taken to meet our goals would be viewed unfavorably by investors, activist groups, current and potential customers, employees and other stakeholders.\nDemand for our HVAC products and services is influenced by weather conditions and seasonality.\nDemand for our HVAC products and services, representing our largest segment by sales, is seasonal and affected by the weather. Cooler than normal summers depress sales of our replacement air conditioning products and services and warmer than normal winters have the same effect on our heating products. Historically, sales to residential HVAC customers tend to be higher in the second and third quarters of the year because, in the U.S. and other northern hemisphere regions, spring and summer are the peak seasons for sales of air conditioning systems and services. In these circumstances, the results of any quarterly period may not be indicative of expected results for a full year, and unusual weather patterns or events could positively or negatively affect our business and impact overall results of operations.\nOur business and financial performance depend on continued and substantial investments in our information and operational technology infrastructure, which may not yield anticipated benefits and which may be vulnerable to cyber-attacks.\nThe efficient operation of our business requires continued and substantial investments in information technology (\"IT\") and operational technology (“OT”, together, “Technology”) infrastructure systems. The failure to design, develop, maintain and implement Technology infrastructure systems in an effective and timely manner or to maintain these systems could divert management’s attention and resources. Our information systems may also become obsolete because of inadequate investments, requiring an unplanned transition to a new platform that could be time consuming, costly, and damaging to our competitive position and could require additional management attention. Repeated or prolonged interruptions of service because of poor execution, inadequate investments or obsolescence could have a significant adverse impact on our reputation and our ability to sell products and services. \n14\nTable of Contents\nCybersecurity incidents could disrupt business operations, result in the loss of critical and confidential information, and adversely impact our reputation and results of operations.\nOur business has been and may again in the future be impacted by disruptions to our or third-party providers’ Technology infrastructure, which have resulted and could in the future result from (among other causes) cyber-attacks, infrastructure failures or compromises to our physical security. Cyber-based risks are evolving and include attacks: (i) on our Technology infrastructure; (ii) targeting the security, integrity and/or availability of hardware and software; (iii) exploiting weaknesses or vulnerabilities in our products, or capturing information installed, stored or transmitted in our products (including after the purchase of those products and when they are installed into, or into environments using, third-party products); and (iv) on facilities or similar infrastructure. Such attacks could disrupt our systems (or those of third parties) and business operations, impact the ability of our products to work as intended or result in the unauthorized access, use, disclosure, modification or destruction of information in violation of applicable law and/or contractual obligations. We continue to make investments and adopt measures to enhance our protection, detection, response and recovery capabilities, and to mitigate potential risks to our technology, products, services, operations and confidential data. However, depending on the nature, sophistication and scope of cyber-attacks, it is possible that potential vulnerabilities could go undetected for an extended period. As a result, we could potentially experience: (i) production downtimes; (ii) operational delays or other detrimental impacts on our operations; (iii) destruction or corruption of our data (or data at or third-party providers); (iv) security breaches; (v) manipulation or improper use of our or third-party systems, networks or products; and (vi) financial losses from remedial actions, loss of business, liability, penalties, fines and/or damage to our reputation, any of which could have a material adverse effect on our competitive position, results of operations, cash flows or financial condition. Due to the evolving nature of such risks, the impact of any potential incident cannot be predicted.\nIn addition, because of the global nature of our business, our internal systems and products must comply with applicable laws, regulations and standards in a number of jurisdictions, and government enforcement actions and violations of data privacy and cybersecurity laws could be costly or interrupt our business operations. Any disruption to our business arising from such issues, or an increase in our costs to cover these issues that is greater than what we have anticipated, could have an adverse effect on our reputation, competitive position, results of operations, cash flows or financial condition.\nThese risks are heightened by the increasingly connected nature of our products and services as we continue to focus on providing digitally-enabled lifecycle solutions to our customers, including due to the use of third-party products to connect these products and services to the internet, which may be subject to additional vulnerabilities beyond our control.\nWe engage in acquisitions and divestitures and may encounter difficulties integrating acquired businesses with, or disposing of businesses from, our current operations; therefore, we may not realize the anticipated benefits of these acquisitions and divestitures.\nWe seek to grow through strategic acquisitions in addition to organic growth. In the past several years, we have acquired consolidated and minority-owned businesses in an effort to complement and expand our business, including the acquisition of the VCS Business, which we completed on January 2, 2024. We expect to continue such pursuits in the future. Our due diligence reviews may not identify all of the issues necessary to accurately estimate the cost and potential loss contingencies of a particular transaction, including potential exposure to regulatory sanctions resulting from an acquisition target’s historical activities. \nIn connection with these acquisitions, we have in the past incurred, and expect to incur in the future, significant costs, including in connection with the integration of such businesses. For example, in connection with the integration of the VCS Business, we incurred transaction fees and costs related to formulating integration plans and achieving cost synergies, and the execution of our integration plans may lead to additional unanticipated costs, including costs related to employee retention, redeployment, relocation or severance fees, as well as costs necessary to maintain employee morale and to attract, motivate or retain management personnel and other key employees. Furthermore, integrating a business, including the VCS Business, may result in material challenges, including the diversion of management’s attention from ongoing business concerns; retaining key management and other employees; retaining or attracting business and operational relationships; managing the expenses and operational challenges of the integration process; consolidating corporate and administrative infrastructures; coordinating geographically separate organizations; loss of customers, distributors, suppliers, and other business partners of the acquired business; unanticipated issues in integrating information technology, communications, internal controls and other systems; as well as potential unknown liabilities and unforeseen expenses related to integration. We ultimately may not realize, and have sometimes not realized, the degree or timing of benefits or cost synergies we anticipate when we first enter into a transaction. \n15\nTable of Contents\nWe also may incur - and have incurred - unanticipated costs or expenses, including asset impairment and other charges and expenses associated with litigation and other liabilities. In addition, in connection with certain acquisitions including the acquisition of the VCS Business, we have disclosed and may from time to time disclose, unaudited pro forma financial information. This pro forma financial information is presented for illustrative purposes only and is not necessarily indicative of what our actual financial position or results of operations would have been had the acquisition been completed on the dates indicated therein. Further, our actual results and financial position may differ materially and adversely from the unaudited pro forma financial information, including due to certain adjustments made by our management, and due to changes between preliminary estimates of the fair value of assets to be acquired and liabilities to be assumed, and the final acquisition accounting. Additionally, accounting requirements relating to business combinations, including the requirement to expense certain acquisition costs as incurred, may cause us to incur greater earnings volatility and generally lower earnings subsequent to periods in which we acquire new businesses. Any of the foregoing could adversely affect our business and results of operations.\nWe also make strategic divestitures from time to time, including the dispositions during 2024 of Access Solutions, Industrial Fire, CCR and the CRF Business. These and other divestitures may result in continued financial exposure to the divested businesses, such as through guarantees, other financial arrangements, continued supply and services arrangements or through the retention of liabilities, such as for environmental and product liability claims. Under these arrangements, nonperformance by those divested businesses or claims against retained liabilities could result in the imposition of obligations that could have a material adverse effect on our results of operations, cash flows or financial condition.\nThe success of future acquisitions, divestitures and joint ventures will depend on the satisfaction of conditions precedent to such transactions, which will depend in part on the ability of the parties to secure any required regulatory approvals in a timely manner, among other things. \nWe incurred debt obligations, and we may incur additional debt in the future, which could adversely affect our business and profitability and our ability to meet other obligations. \nAs of December 31, 2024, we had approximately $12.3 billion in aggregate principal amount of outstanding indebtedness, including debt incurred to close the acquisition of the VCS Business on January 2, 2024. See Note 7 – Borrowings and Lines of Credit in the accompanying Notes to the Consolidated Financial Statements and the section entitled \"Liquidity and Financial Condition\" in this Annual Report for additional information. We may also incur additional indebtedness in the future, including via issuance of commercial paper, under our Revolving Credit Facility.\nOur debt obligations could potentially have important consequences to us and our debt and equity investors, including: (1) requiring a substantial portion of our cash flows from operations to make debt service payments or to refinance our indebtedness as it becomes due, making it more difficult for us to satisfy our other priorities and obligations; (2) increasing the risk of a future credit ratings downgrade of our debt, which could increase future debt costs and limit the future availability of debt financing; (3) increasing our vulnerability to general adverse economic and industry conditions; (4) reducing the cash flows available to fund capital expenditures and other corporate purposes and to grow our business; (5) limiting our flexibility in pursuing strategic opportunities or planning for, or reacting to, changes in our business and the industry; (6) placing us at a competitive disadvantage relative to our competitors that may not be as highly leveraged; and (7) limiting our ability to borrow additional funds as needed or take advantage of business opportunities as they arise, pay cash dividends or repurchase shares.\nOur ability to make scheduled payments of the principal of, to pay interest on or to refinance our indebtedness depends on our future performance, which is subject to economic, financial, competitive, regulatory factors, and other factors beyond our control. Our cash flow from operations in the future may be insufficient to service our indebtedness because of factors beyond our control, including if our actual cash requirements in the future are greater than expected. If we are unable to generate the necessary cash flow, we may be required to adopt one or more alternatives, such as selling assets, restructuring debt or obtaining additional equity capital on terms that may be onerous or highly dilutive. Our ability to refinance our indebtedness will depend on the capital markets and our financial condition at such time. We may not be able to engage in any of these activities or engage in these activities on desirable terms, which could result in a default on our debt obligations. \n16\nTable of Contents\nAs described in Note 7 – Borrowings and Lines of Credit in the accompanying Notes to the Consolidated Financial Statements and \"Liquidity and Financial Condition,\" the agreements governing our indebtedness contain covenants restricting our financial flexibility in a number of ways, including, among other things, restrictions on our ability and the ability of certain of our subsidiaries to incur liens, to make certain fundamental changes and to enter into sale and leaseback transactions. In addition, some of the agreements governing our indebtedness require that we not exceed a maximum consolidated total leverage ratio and contain certain customary events of default, including related to changes of control. As of the date of this report, we were in compliance with the covenants under the agreements governing our outstanding indebtedness. Our ability to comply with such restrictions and covenants, some of which have already been amended as described above, may be affected by events beyond our control. If we breach any of these restrictions or covenants and do not obtain a waiver from the lenders or holders, as applicable, then, subject to the applicable cure periods and conditions, any outstanding indebtedness could be declared immediately due and payable.\nApart from these covenants, neither we nor any of our subsidiaries are restricted from incurring additional unsecured debt or liabilities, and to the extent that we incur additional indebtedness, the foregoing risks could increase. \nWe depend on our intellectual property and have access to certain intellectual property and information of our customers and suppliers. Infringement of or the failure to protect that intellectual property could adversely affect our future growth and success.\nOur intellectual property rights are important to our business and include numerous patents, trademarks, copyrights, trade secrets, proprietary technology, technical data, business processes and other confidential information. Although we consider our intellectual property rights in the aggregate to be valuable, we do not believe that our business is materially dependent on a single intellectual property right or any group of them. We nonetheless rely on a combination of patents, trademarks, copyrights, trade secrets, nondisclosure agreements, customer and supplier agreements, license agreements, Technology security systems, internal controls and compliance systems and other measures to protect our intellectual property. We also rely on nondisclosure agreements, Technology security systems and other measures to protect certain customer and supplier information and intellectual property that we have in our possession or to which we have access. Our efforts to protect such intellectual property and proprietary information may not be sufficient, however. \nWe cannot be sure that our pending patent applications will result in the issuance of patents, that patents issued to or licensed by us in the past or in the future will not be challenged or circumvented by competitors, or that these patents will be found to be valid or sufficiently broad to preclude our competitors from introducing technologies similar to those covered by our patents and patent applications. \nIn addition, we may be the target of competitor or other third-party patent enforcement actions seeking substantial monetary damages or seeking to prevent the sale and marketing of certain of our products. Our competitive position also may be adversely impacted by limitations on our ability to obtain possession, ownership or necessary licenses concerning data important to the development or sale of our products or service offerings, or by limitations on our ability to restrict the use by others of data related to our products or services. Any of these events or factors could subject us to judgments, penalties and significant litigation costs or temporarily or permanently disrupt our sales and marketing of the affected products or services and could have a material adverse effect on our competitive position, results of operations, cash flows or financial condition.\n17\nTable of Contents\nWe use a variety of raw materials, supplier-provided parts, and third-party service providers in our business. The ability of suppliers to deliver materials, parts, components and manufacturing equipment to our manufacturing facilities, and our ability to manufacture without disruption, could affect our business performance. Significant shortages, supplier capacity constraints or production disruptions, price increases, duties, tariffs or other government actions could increase our operating costs, disrupt our operations and adversely impact the competitive positions of our products.\nOur reliance on suppliers and commodity markets to secure components (such as motors and valves) and raw materials (such as copper, aluminum and steel), and on service providers to deliver our products, exposes us to volatility in the prices and availability of these materials and services. We use a wide range of materials and components in the global production of our products, which come from numerous suppliers around the world. Because some key parts may be available only from a single supplier or a limited group of suppliers, we are subject to supply and pricing risk. In addition, certain proprietary component parts used in some of our products are provided by single-source unaffiliated third-party suppliers. We would be unable to obtain these proprietary components for an indeterminate period of time if these single-source suppliers were to cease or interrupt production or otherwise fail to supply these components to us, which could adversely affect our product sales and operating results. Our supply chain could be impacted by climate events through extreme weather, resulting in delivery or production disruptions and increased material costs. In addition, other issues with suppliers (such as capacity constraints, quality issues, consolidations, closings or bankruptcies), price increases, raw material/component shortages, regulatory limitations, or the decreased availability of trucks and other delivery services could also have a material adverse effect on our ability to meet our commitments to customers or increase our operating costs. Periodic disruptions in our supply chains have resulted, and may continue to result, in sufficient inventory not being available in a timely manner or during the appropriate season as well as higher freight and other logistic costs, including increased carrier rates, which could have a material adverse effect on our business.\nWe use various tactical and strategic actions to mitigate our raw material and supply chain risks and challenges, including consolidating commodity purchases, locking in prices of expected purchases of certain raw materials, dual sourcing, increasing regionalization, proactive engagement with suppliers and our workforce and dynamic management of freight costs and availability. However, these efforts may be unsuccessful or could cause us to pay higher prices for a commodity when compared with the market price at the time the commodity is actually purchased or delivered. For example, the availability and prices of raw materials and supplies may be impacted as a result of, among other things, the imposition of tariffs, duties and other potential changes in trade policies. Our suppliers could also be subject to regulations including climate related regulations, compliance with which would increase our costs and the impacts of which are difficult to predict. We believe that our supply management and production practices appropriately balance the foreseeable risks and the costs of alternative practices or other mitigation. Nonetheless, these risks may have a material adverse effect on our competitive position, results of operations, cash flows or financial condition.\nOur operations and those of our suppliers are subject to disruption for a variety of reasons, including epidemics, pandemics, supplier plant shutdowns or slowdowns, transportation delays, work stoppages, labor relations, changes in laws or regulations, governmental regulatory and enforcement actions, intellectual property claims against suppliers, financial issues such as a supplier bankruptcy, Technology failures and hazards such as fire, earthquakes, flooding or other natural disasters. Insurance for certain disruptions may not be available, affordable or adequate. The effects of climate-related matters, including extreme weather events, long-term changes in temperature levels and water availability may exacerbate these risks. Such disruption has in the past and could in the future interrupt our ability to manufacture certain products. Any significant disruption could have a material adverse impact on our competitive position.\n18\nTable of Contents\nWe design, manufacture and service products that incorporate advanced technologies. The introduction of new products and technologies involves risks, and we may not realize the degree or timing of benefits initially anticipated.\nOur future success depends on designing, developing, producing, selling and supporting innovative products that incorporate advanced technologies. The regulations and policies applicable to our products, as well as our customers’ product and service needs, change from time to time. Moreover, regulatory and policy changes, inclusive of those aimed at addressing energy infrastructure and incentives and climate events and its impacts, may render our products and technologies non-compliant or noncompetitive and may subject us to operational, compliance, business and reputational risks. Our ability to realize the anticipated benefits of our technological advancements or product improvements – including those associated with regulatory or policy changes – depends on a variety of factors, including: meeting development, production and regulatory approval schedules; meeting performance plans and expectations; the availability of raw materials and parts; our suppliers’ performance; the hiring, training and deployment of qualified personnel; achieving efficiencies; identifying emerging regulatory, policy and technological trends; validating innovative technologies; the level of customer interest in new technologies and products; and the costs and customer acceptance of our new or improved products.\nOur products and services also may incorporate technologies developed or manufactured by third parties, which, when combined with our technology or products, creates additional risks and uncertainties. As a result, the performance and market acceptance of these third-party products and services could affect the level of customer interest and acceptance of our own products in the marketplace.\nOur research and development efforts, including those that advance environmental sustainability, may not culminate in new technologies or timely products, or may not meet the needs of our customers as effectively as competitive offerings. Our competitors may develop competing technologies that gain market acceptance before or instead of our products. In addition, we may not be successful in anticipating or reacting to changes in the regulatory or policy environments in which our products are sold, and the markets for our products may not develop or grow as we anticipate.\nWe operate in a competitive environment and our profitability and competitive position depend on our ability to accurately estimate the costs and timing of providing our products and services\n.\nIn certain of our businesses, our contracts are typically awarded on a competitive basis. Our bids are based upon, among other factors, the cost to timely provide the products and services. To generate an acceptable return, we must accurately estimate our costs and schedule. If we fail to do so, the profitability of contracts may be adversely affected – including because some of our contracts provide for liquidated damages if we do not perform on time – which could have a material adverse effect on our competitive position, results of operations, cash flows or financial condition.\nCustomers and others may take disruptive actions.\nFrom time to time customers and others may seek to become suppliers of products and services that compete with our own or pursue other strategies to disrupt our business model. For example, an affiliate of a customer in our transport refrigeration business produces refrigeration units for shipping containers that compete with our products, and another one of our transport refrigeration customers produces refrigeration units for truck trailers that compete with our refrigeration units. In addition, our customers or existing or future competitors may seek to introduce non-traditional business models or disruptive technologies and products in the industries in which we participate, resulting in increased competition and new dynamics in these industries.\nLabor matters may impact our business.\nA significant portion of our employees are represented by labor unions or works councils in a number of countries under various collective bargaining agreements with varying durations and expiration dates. See the section entitled \"Other Matters Relating to Our Business as a Whole - Human Capital Management.\" We may not be able to successfully renegotiate each of these agreements before they expire. In addition, existing agreements may not prevent a strike or work stoppage, union and works council campaigns and other labor disputes. We may also be subject to general national or sector-level strikes or work stoppages unrelated to our specific business or collective bargaining agreements, for example, those resulting from geopolitical instability or social unrest. Additionally, a shortage in certain work forces, such as technicians, manufacturing workers or truck drivers, due to external forces such as geopolitical strife or pandemics, may impact our business by affecting the ability to produce, install, sell and deliver our products. Any such work stoppages (or potential work stoppages) or labor shortages could have a material adverse effect on our reputation, productivity, financial condition, cash flows and results of operations.\n19\nTable of Contents\nOur defined benefit pension plans are subject to financial market risks that could adversely affect our results.\nThe performance of the financial markets and interest rates can impact our defined benefit pension plan expenses and funding obligations. Significant decreases in the discount rate or investment losses on plan assets may increase our funding obligations and adversely impact our financial results. See Note 10 – Employee Benefit Plans to the accompanying Notes to the Consolidated Financial Statements in this Annual Report for additional discussion on pension plans and related obligations and contingencies.\nWe may not realize expected benefits from our cost reduction and restructuring efforts, and our profitability or our business otherwise might be adversely affected.\nIn order to operate more efficiently and cost effectively, we have, and we may from time to time, adjust employment levels, optimize our footprint and/or implement other restructuring activities. These activities are complex and may involve or require significant changes to our operations. If we do not successfully manage these activities, expected efficiencies and benefits might be delayed or not realized. Risks associated with these actions and other workforce management issues include: unfavorable political responses and reputational harm; unforeseen delays in the implementation of the restructuring activities; additional costs; adverse effects on employee morale; the failure to meet operational targets due to the loss of employees or work stoppages; and difficulty managing our operations during or after facility consolidations, any of which may impair our ability to achieve anticipated cost reductions, harm our business or reputation, or have a material adverse effect on our competitive position, results of operations, cash flows or financial condition.\nFailure to achieve and maintain a high level of product and service quality could damage our reputation with customers and negatively impact our results.\nProduct and service quality issues could harm customer confidence in our company and our brands. If certain of our product and service offerings do not meet applicable safety standards – which has been the case – or our customers’ expectations regarding safety or quality, we can experience, and have experienced previously, lost sales and increased costs and we can be exposed, and have previously been exposed, to legal, financial and reputational risks. Actual, potential or perceived product safety concerns could expose us to litigation as well as government enforcement actions, which has also occurred in certain instances. In addition, when our products fail to perform as expected, we have been, and may in the future be, exposed to warranty, product liability, personal injury and other claims.\nWe maintain strict quality controls and procedures. However, we cannot be certain that these controls and procedures will reveal defects in our products or their raw materials, which may not become apparent until after the products have been placed in use in the market. Accordingly, there is a risk that products will have defects, which could require a product recall or field corrective action. Product recalls and field corrective actions can be expensive to implement and may damage our reputation, customer relationships and market share. We have conducted product recalls and field corrective actions in the past and may do so again in the future.\nIn many jurisdictions, product liability claims are not limited to any specified amount of recovery. If any such claims or contribution requests or requirements exceed our available insurance or if there is a product recall, there could be an adverse impact on our results of operations. In addition, a recall or claim could require us to review our entire product portfolio to assess whether similar issues are present in other products, which could result in a significant disruption to our business and which could have a further adverse impact on our business, financial condition, results of operations and cash flows. There can be no assurance that we will not experience any material warranty or product liability claims in the future, that we will not incur significant costs to defend such claims or that we will have adequate reserves to cover any recall, repair and replacement costs.\nWe are subject to litigation, environmental and other legal and compliance risks.\nWe are subject to a variety of litigation, legal and compliance risks including, without limitation, claims, lawsuits and/or regulatory enforcement actions relating to breach of contract, cybersecurity and data privacy, employment and labor, environmental and employee health and safety matters, global chemical compliance, intellectual property rights, personal injury, product safety and taxes as well as anti-corruption, competition and securities laws and other laws governing improper business practices. If found responsible in connection with such matters, we could be subject to significant fines, penalties, repayments and other damages (in certain cases, treble damages) and experience reputational harm.\n20\nTable of Contents\nAs a global business, we are subject to complex laws and regulations in the U.S. and other countries in which we operate. Those laws and regulations may be interpreted in different ways. They may also change from time to time, as may related interpretations and other guidance. Changes in laws or regulations could result in higher expenses. Uncertainty relating to laws or regulations may also affect how we operate, structure our investments and enforce our rights.\nGlobal chemical use restrictions related to protection of human health and the environment as well as climate event directives may require additional investments in product designs, resulting in increased manufacturing, production and sourcing costs as well as updates to product safety assessments. These restrictions may also increase our legal obligations regarding remediation of our current and legacy operational sites.\n \nAt times, we are involved in disputes with private parties over environmental issues, including litigation over the allocation of cleanup costs, alleged personal injuries and property damage. Existing and future asbestos-related claims could adversely affect our financial condition, results of operations and cash flows. Personal injury lawsuits may involve individual and putative class actions alleging that contaminants originating from our current or former products or operating facilities caused or contributed to medical conditions. Property damage lawsuits may involve claims relating to environmental damage or diminution of real estate values. Even in litigation where we believe our liability is remote, there is a risk that a negative finding or decision could have a material adverse effect on our competitive position, results of operations, cash flows or financial condition, in particular with respect to environmental claims in regions where we have, or previously had, significant operations or where certain of our products have been manufactured and used.\nWe must comply with U.S. Foreign Corrupt Practices Act (“FCPA”), antitrust, anti-money laundering, and other anti-corruption and anti-collusion laws. Despite meaningful measures to ensure lawful conduct, which include training, audits and internal control policies and procedures, violations or allegations of violations of such laws may occur, and could disrupt our operations, cause reputational harm, involve significant management distraction, subject us to criminal and civil penalties, as well as disgorgement, and result in a material adverse effect on our competitive position, results of operations, cash flows or financial condition. We could be required to make changes or enhancements to our compliance measures that could increase our costs, and we could be subject to other remedial actions. \nWe also must comply with various laws and regulations relating to the import and export of products, services and technology into and from the U.S. and other countries having jurisdiction over our operations. In the U.S., these laws include, amongst others, the Export Administration Regulations administered by the U.S. Department of Commerce and embargoes and sanctions regulations administered by the U.S. Department of the Treasury. Restrictions on the export of our products, services or technologies could have a material adverse effect on our competitive position, results of operations, cash flows or financial condition.\nFor a description of material legal proceedings and regulatory matters, see the section entitled \"Legal Proceedings\" and Note 23 – Commitments and Contingent Liabilities in the accompanying Notes to the Consolidated Financial Statements in this Annual Report.\nWe are subject to risks arising from doing business with the U.S. government.\nAs a supplier and service provider to the U.S. government, including as a subcontractor under prime contracts with the U.S. government, we are subject to certain heightened risks, such as those associated with the government’s rights to audit and conduct investigations and with its rights to terminate contracts for convenience or default. In light of the current U.S. government contracting environment, we are and will continue to be the subject of U.S. government investigations relating to our U.S. government contracts or subcontracts. Such investigations often take years to complete and could result in administrative, civil or criminal liabilities, including repayments, fines, treble and other damages, forfeitures, restitution or penalties, or could lead to suspension or debarment of U.S. government contracting or of export privileges. For instance, if a business unit were charged with wrongdoing in connection with a U.S. government investigation (including fraud or violation of certain environmental or export laws), the U.S. government could suspend us from bidding on or receiving awards of new U.S. government contracts or subcontracts. If convicted or found liable, the U.S. government could fine and debar us from receiving new awards for a period generally not to exceed three years and could void any contracts found to be tainted by fraud. We also could suffer reputational harm if allegations of impropriety were made against us, even if such allegations are later determined to be unsubstantiated. There is also uncertainty in the current U.S. government contracting environment as to the extent of funding that may be available for future projects. \n21\nTable of Contents\nWe may recognize impairment charges for our goodwill and intangible assets.\nAs of December 31, 2024, the net carrying value of our goodwill and intangible assets totaled $14.6 billion and $6.4 billion, respectively. Our intangible assets primarily consist of customer relationships, patents, service portfolios and trademarks. We periodically assess these assets to determine if they are impaired. Significant negative industry or economic trends, disruptions to our business, planned or unexpected significant changes in the use of the assets, and sustained market capitalization declines may result in the impairment of goodwill or intangible assets. Any charges relating to such impairments could have a material adverse impact on our results of operations in the period in which the impairment is recognized.\nFailure to maintain a satisfactory credit rating could adversely affect our liquidity, capital position, borrowing costs and access to the capital markets.\nWe have been issued an investment grade credit rating by each of Moody’s Investors Services, Inc. (\"Moody's\"), Standard & Poor’s (\"S&P\") and Fitch Ratings Inc. (\"Fitch Ratings\"). Nonetheless, any future downgrades could increase our borrowing costs, reduce market capacity for our commercial paper or require the posting of collateral under our derivative contracts. There can be no assurance that we will be able to maintain our credit ratings, and any additional actual or anticipated changes or downgrades, including any announcement that our ratings are under review for a downgrade, may have a negative impact on our liquidity, capital position and access to the capital markets. Additionally, our credit agreements generally provide for an increase in interest rates if the ratings for our debt are downgraded. \nRisks Related to the Separation from UTC\nAfter the Separation and the Distribution, certain members of management, directors and shareowners own stock in UTC, Carrier and Otis, and as a result may face actual or potential conflicts of interest.\nFollowing the Separation and the Distribution, certain members of management and the Board of Directors of each of UTC, Carrier and Otis own common stock in all three companies. This ownership overlap could create, or appear to create, potential conflicts of interest when the management and directors of one company face decisions that could have different implications for themselves and the other two companies. These agreements include a separation and distribution agreement, the TMA, the employee matters agreement, the intellectual property agreement and any commercial agreements between the parties or their affiliates. Potential conflicts of interest may also arise out of any commercial arrangements that we or UTC may enter into in the future. See Note 1 – Description of the Business in the accompanying Notes to the Consolidated Financial Statements in this Annual Report for additional information on these agreements. \nIn connection with the Separation into three independent public companies, each of UTC, Carrier and Otis has agreed to indemnify the other parties for certain liabilities. If we are required to pay UTC and/or Otis under these indemnities, our financial results could be negatively impacted. Also, the UTC or Otis indemnities may not be sufficient to hold us harmless from the full amount of liabilities for which UTC and Otis have been allocated responsibility, and UTC and/or Otis may not be able to satisfy their respective indemnification obligations in the future.\nPursuant to the separation and distribution agreement and certain other agreements among UTC, us and Otis, each party has agreed to indemnify the other parties for certain liabilities as discussed further in Note 1 – Description of the Business in the accompanying Notes to the Consolidated Financial Statements in this Annual Report. Indemnities that we may be required to provide UTC and/or Otis are not subject to any cap, may be significant and could negatively impact our business. Third parties could also seek to hold us responsible for any of the liabilities that UTC and/or Otis has agreed to retain. The indemnities from UTC and Otis for our benefit may not be sufficient to protect us against the full amount of such liabilities, and UTC and/or Otis may not be able to fully satisfy their respective indemnification obligations. Any amounts we are required to pay pursuant to such indemnification obligations and other liabilities could require us to divert cash that would otherwise have been used in furtherance of our operating business.\nMoreover, even if we ultimately succeed in recovering from UTC or Otis, as applicable, we may be temporarily required to bear these losses. Each of these risks could negatively affect our business, results of operations, cash flows and financial condition.\n22\nTable of Contents\nIn certain circumstances, we could be required to indemnify UTC for material taxes and other related amounts pursuant to indemnification obligations under the TMA.\nUnder the TMA, we are generally required to indemnify UTC and Otis for any taxes resulting from the Separation (and any related costs and other damages) to the extent such amounts resulted from: (1) an acquisition of all or a portion of the equity securities or assets of Carrier, whether by merger or otherwise (and regardless of whether we participated in or otherwise facilitated the acquisition), (2) other actions or failures to act by Carrier or (3) certain of Carrier’s representations, covenants or undertakings contained in any of the Separation-related agreements and documents or in any documents relating to the IRS ruling and/or the opinion of counsel being incorrect or violated. Further, under the TMA, we are generally required to indemnify UTC and Otis for a specified portion of any taxes (and any related costs and other damages) (a) arising as a result of the failure of the Distribution and certain related transactions to qualify as a transaction that is generally tax-free (including if the transactions were determined not to qualify for non-recognition of gain or loss under Section 355 and related provisions of the Internal Revenue Code of 1986) or a failure of any internal separation transaction that is intended to qualify as a transaction that is generally tax-free to so qualify, in each case, to the extent such amounts did not result from a disqualifying action by, or acquisition of equity securities of, Carrier, Otis or UTC or (b) arising from an adjustment, pursuant to an audit or other tax proceeding, with respect to any separation transaction that is not intended to qualify as a transaction that is generally tax-free. Any such indemnity obligations could be material. See Note 1 – Description of the Business in the accompanying Notes to the Consolidated Financial Statements in this Annual Report for additional information.\nPotential liabilities may arise due to fraudulent transfer considerations, which would adversely affect our financial condition and results of operations.\nIn connection with the Separation (including the internal reorganization described previously), UTC completed several corporate reorganization transactions involving its subsidiaries which, along with the Distribution, may be subject to various fraudulent conveyance and transfer laws. If, under these laws, a court were to determine that, at the time of the Separation, any entity involved in these reorganization transactions or the Separation: (1) was insolvent, was rendered insolvent by reason of the Separation, or had remaining assets constituting unreasonably small capital, and (2) received less than fair consideration in exchange for the Distribution; or intended to incur, or believed it would incur, debts beyond its ability to pay these debts as they matured, then the court could void the Separation and the Distribution, in whole or in part, as a fraudulent conveyance or transfer. The court could then require our shareowners to return to UTC some or all of the shares of Carrier common stock issued in the Distribution, or require UTC or us, as the case may be, to fund liabilities of the other company for the benefit of creditors. The measure of insolvency will vary depending upon the jurisdiction and the applicable law. Generally, however, an entity would be considered insolvent if the fair value of its assets was less than the amount of its liabilities (including the probable amount of contingent liabilities), or if it incurred debt beyond its ability to repay the debt as it matures. No assurance can be given as to what standard a court would apply to determine insolvency or that a court would determine that we or any of our subsidiaries were solvent at the time of or after giving effect to the Distribution.\nRisks Related to Our Common Stock\nThe market price and trading volume of our common stock may fluctuate significantly.\nThe trading price of our common stock has been and may continue to be volatile and the trading volume in our common stock may fluctuate.\nThe factors that could affect our common stock price include among others: (1) industry or general market conditions, including inflation and increasing cost of goods; (2) domestic and international economic factors unrelated to our performance; (3) our ability to execute our planned strategies; (4) lawsuits, enforcement actions and other claims by third parties or governmental authorities; (5) changes in our customers’ preferences; (6) new regulatory pronouncements and changes in regulatory guidelines; (7) actual or anticipated fluctuations in our quarterly operating results; (8) changes in securities analysts’ estimates of our financial performance or lack of research coverage and reports by industry analysts; (9) action by institutional shareowners or other large shareowners; (10) failure to meet any financial guidance given by us or any change in any financial guidance given by us, or changes by us in our financial guidance practices; (11) announcements by us of significant impairment charges; (12) speculation in the press or investment community; (13) investor perception of us and our industry; (14) changes in market valuations or earnings of similar companies; (15) announcements by us or our competitors of significant contracts, acquisitions, dispositions or strategic partnerships; (16) war or terrorist acts; (17) any future sales of our common stock or other securities; (18) additions or departures of key personnel; (19) failure to achieve any of our sustainability goals; and (20) other risk factors discussed in this \"Risk Factors\" section or in our other filings from time to time with the SEC.\n23\nTable of Contents\nStock markets experience volatility that can be unrelated to the operating performance of particular companies. These broad market fluctuations may adversely affect the market price of our common stock. In the past, following periods of volatility in the market price of a company’s securities, class action litigation has often been instituted against the affected company. Any litigation of this type brought against us could result in substantial costs and a diversion of our management’s attention and resources, which could harm our business, operating results and financial condition.\nShareowner's percentage of ownership in our common stock may be diluted in the future.\nThe percentage ownership of shareowners in our common stock may be diluted because of equity issuances for acquisitions, capital market transactions or otherwise, including any equity awards that we grant to our directors, officers and employees. Our employees have, and will receive from us, stock-based awards that correspond to shares of our common stock. Such awards have had and will have a dilutive effect on our earnings per share, which could adversely affect the market price of our common stock. Additionally, in connection with our acquisition of the VCS Business, we issued 58,608,959 shares of our common stock to Viessmann, with which we entered into an Investor Rights Agreement that provides for, among other things, customary resale, demand and piggyback registration rights. While the Investor Rights Agreement also provides that, for the time periods specified therein, Viessmann and its affiliates are subject to customary standstill, lockup and transfer restrictions, registration of the shares of common stock held by Viessmann will permit those shares to be sold into the public market, once eligible to be disposed of pursuant to the Investor Rights Agreement. See Note 14 – Stock-Based Compensation and Note 18 – Earnings Per Share in the accompanying Notes to the Consolidated Financial Statements in this Annual Report for additional information.\nQuarterly cash dividends may be discontinued or modified, are subject to a number of uncertainties and may affect the price of our common stock.\nQuarterly cash dividends are a component of our capital allocation strategy, which we fund with operating cash flows, borrowings and divestitures. However, we are not required to declare dividends. Dividends may be discontinued, accelerated, suspended or delayed at any time without prior notice. Even if not discontinued, the amount of such dividends may be changed, and the amount, timing and frequency of such dividends may vary from past practice or from our stated expectations. Decisions with respect to dividends are subject to the discretion of our Board of Directors and will be based on a variety of factors. Important factors that could cause us to discontinue, limit, suspend, increase or delay our quarterly cash dividends include market conditions, the price of our common stock, the nature and timing of other investment opportunities, changes in our business strategy, the terms of our financing arrangements, our outlook as to the ability to obtain financing at attractive rates, the impact on our credit ratings and the availability of domestic cash. The reduction or elimination of our cash dividend could adversely affect the market price of our common stock.\nOur amended and restated bylaws designate the courts within the State of Delaware as the sole and exclusive forum for certain types of actions and proceedings that may be initiated by our shareowners, which could discourage lawsuits against Carrier and our directors and officers.\nOur amended and restated bylaws provide that unless our Board of Directors otherwise determines, the state courts within the State of Delaware (or, if no state court located within the State of Delaware has jurisdiction, the federal district court for the District of Delaware) will be the sole and exclusive forum for any derivative action or proceeding brought on behalf of Carrier, any action asserting a claim for or based on a breach of a fiduciary duty owed by any current or former director or officer or other employee of Carrier to Carrier or to Carrier shareowners, including a claim alleging the aiding and abetting of such a breach of fiduciary duty, any action asserting a claim against Carrier or any current or former director or officer or other employee of Carrier arising pursuant to any provision of the Delaware General Corporation Law (“DGCL”) or our amended and restated certificate of incorporation or amended and restated bylaws, any action asserting a claim relating to or involving Carrier governed by the internal affairs doctrine, or any action asserting an “internal corporate claim” as that term is defined in Section 115 of the DGCL.\nTo the fullest extent permitted by law, this exclusive forum provision applies to state and federal law claims, including claims under the federal securities laws, including the Securities Act of 1933, as amended (\"Securities Act\"), and the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), although Carrier shareowners will not be deemed to have waived our compliance with the federal securities laws and the rules and regulations thereunder. The enforceability of similar choice of forum provisions in other companies’ organizational documents has been challenged in legal proceedings, and it is possible that, in connection with claims arising under federal securities laws or otherwise, a court could find the exclusive forum provision contained in the amended and restated bylaws to be inapplicable or unenforceable.\n24\nTable of Contents\nThis exclusive forum provision may limit the ability of our shareowners to bring a claim in a judicial forum that such shareowners find favorable for disputes with Carrier or our directors or officers, which may discourage such lawsuits against Carrier and our directors and officers. Alternatively, if a court were to find this exclusive forum provision inapplicable to, or unenforceable in respect of, one or more of the specified types of actions or proceedings described previously, we may incur additional costs associated with resolving such matters in other jurisdictions, which could negatively affect our business, results of operations and financial condition.\nAnti-takeover provisions could enable our Board of Directors to resist a takeover attempt by a third party and limit the power of our shareowners.\nOur amended and restated certificate of incorporation and amended and restated bylaws contain, and Delaware law contains, provisions that are intended to deter coercive takeover practices and inadequate takeover bids by making such practices or bids unacceptably expensive to the bidder and to encourage prospective acquirers to negotiate with our Board of Directors rather than to attempt a hostile takeover. These provisions include, among others: (1) the ability of our remaining directors to fill vacancies on our Board of Directors (except in an instance where a director is removed by shareowners and the resulting vacancy is filled by shareowners); (2) limitations on shareowners’ ability to call a special shareowner meeting; (3) rules regarding how shareowners may present proposals or nominate directors for election at shareowner meetings; and (4) the right of our Board of Directors to issue preferred stock without shareowner approval.\nIn addition, we are subject to Section 203 of the DGCL, which could have the effect of delaying or preventing a change of control that shareowners may favor. Section 203 provides that, subject to limited exceptions, persons that acquire, or are affiliated with persons that acquire, more than 15% of the outstanding voting stock of a Delaware corporation may not engage in a business combination with that corporation, including by merger, consolidation or acquisitions of additional shares, for a three-year period following the date on which that person or any of its affiliates becomes the holder of more than 15% of the corporation’s outstanding voting stock.\nWe believe these provisions will protect our shareowners from coercive or otherwise unfair takeover tactics by requiring potential acquirers to negotiate with our Board of Directors and by providing our Board of Directors with more time to assess any acquisition proposal. These provisions are not intended to make us immune from takeovers; however, these provisions will apply even if the offer may be considered beneficial by some shareowners and could delay or prevent an acquisition that our Board of Directors determines is not in the best interests of Carrier and our shareowners. These provisions may also prevent or discourage attempts to remove and replace incumbent directors. \nGeneral Risks\nNatural disasters, epidemics or other unexpected events may disrupt our operations, adversely affect our results of operations, cash flows or financial condition and may not be fully covered by insurance. \nThe occurrence of one or more natural disasters, power outages or other unexpected events, including hurricanes, fires, earthquakes, volcanic eruptions, tsunamis, floods and other forms of severe weather, health epidemics, pandemics or other contagious outbreaks, conflicts, wars or terrorist acts, in the U.S. or in other countries in which we or our suppliers or customers operate have in the past and could in the future adversely affect our operations and financial performance. Natural disasters, power outages or other unexpected events could damage or close one or more of our facilities or disrupt our operations temporarily or long-term, such as by causing business interruptions or by affecting the availability and/or cost of materials needed for manufacturing. In some cases, we have one factory that can manufacture a specific product or product line. As a result, damage to or the closure of a certain factory or factories may disrupt or prevent us from manufacturing certain products. Existing insurance arrangements may not cover all of the costs or lost cash flows that may arise from such events. The occurrence of any of these events could also increase our insurance and other operating costs or harm our sales.\n25\nTable of Contents\nWe may be affected by global economic, capital market and political conditions, and conditions in the energy, construction, transportation and infrastructure industries in particular. Uncertainty in U.S. trade policy, including uncertainty surrounding changes in tariffs, trade agreements or other trade restrictions imposed by the U.S. or other governments, as well as political conditions in and between the U.S. and foreign countries in which we operate, could significantly and adversely affect our business and financial results. \nOur business, operating results, cash flows and financial condition have in the past been and in the future may be adversely affected by changes in global economic conditions and geopolitical risks and conditions, including climate and energy policies, regulatory changes, credit market conditions, levels of consumer and business confidence, fluctuations in residential, commercial and industrial construction activity, pandemic health issues, natural disasters, commodity prices, energy costs, interest rate fluctuations, inflation, recession, foreign exchange rates, levels of government spending and deficits, trade policies (including tariffs, boycotts and sanctions), military conflicts, acts of terrorism, government instability, actual or anticipated defaults on sovereign debt and other challenges that could affect the global economy. These economic and political conditions affect our business in a number of ways. For example, because we have a number of factories and suppliers in foreign countries, the imposition of tariffs or additional sanctions or unusually restrictive border crossing rules could adversely affect our supply chain, operations and overall business. \nThere are ongoing threats of war, terrorism or governmental instability in various countries and regions, including those where we do business. In March 2022, we suspended business operations in Russia by ceasing to pursue new business opportunities while continuing to fulfill existing contracts for equipment, service and parts, where possible, in a manner that fully complies with applicable sanctions and trade controls. Our sales, operations and supply chain in Russia and Ukraine are not material to Carrier. However, the military conflict between the two countries and attendant geopolitical environment may continue to negatively impact the global economy and major financial markets, and may result in additional increases in commodity prices and supply-chain disruptions, including shortages of materials, higher costs for fuel and freight and increased transportation delays. Uncertainty related to these global economic, capital market and political conditions and events, and the perception that such conditions and events may occur, could have a material adverse effect on our business, results of operations, cash flows and financial condition. Furthermore, the tightening of credit in the capital markets could adversely affect the ability of our customers, including individual end-customers and businesses, to obtain financing for significant purchases and operations, which could result in a decrease in or cancellation of orders for our products and services. Similarly, tightening credit may adversely affect our supply base and increase the potential for one or more of our suppliers to experience financial distress or bankruptcy. \nOur business and financial performance is also adversely affected by decreases in the general level of economic activity, such as decreases in business and consumer spending and construction (both residential and commercial as well as remodeling). In addition, our financial performance may be influenced by the production and utilization of transport equipment, including truck production cycles in North America and Europe.\nOur business success depends on attracting and retaining key personnel and other talent throughout the Company. \nOur future success and ability to execute our strategic plan depends on our ability to hire, retain and develop a high performance, customer-centric executive management team and its ability to provide consistent leadership and direction. The failure to retain our executive officers and other key personnel could result in significant disruption and have a material adverse effect on our business operations and ability to deliver our growth objectives. \nOur future success also depends on our ability to attract, retain and develop qualified personnel with the requisite technical expertise and understanding of our customers’ needs at all levels of the organization, including skilled labor. The availability of skilled labor needed for the design and production of our products and delivery of services is limited in a number of the locations in which we operate, and the competition for talent is robust. Difficulties attracting and retaining a qualified workforce could adversely impact our operations and overall business.\nThis risk may also be exacerbated as a result of acquisitions undertaken as part of our transformation, which are dependent on the continuity, experience and industry knowledge of management personnel and other key employees to execute our business plans for the acquired businesses. Our success after completion of any acquisition may depend in part upon our ability to attract, motivate and retain key management personnel and other key employees within the acquired business, and current and prospective employees of the acquired business may experience uncertainty about their roles, which may have an adverse effect on the acquired business's ability to attract, motivate or retain management personnel and other key personnel.\n26\nTable of Contents\nAdditional tax expense or additional tax exposures could affect our future profitability.\nWe are subject to income taxes in the U.S. and various international jurisdictions. Changes to tax laws and regulations as well as changes and conflicts in related interpretations or other tax guidance could materially impact our tax receivables and liabilities and our deferred tax assets and deferred tax liabilities. Additionally, in the ordinary course of business, we are subject to examinations by various tax authorities. Tax authorities in various jurisdictions could also launch new examinations and expand existing examinations. The global and diverse nature of our operations means that these risks will continue, and additional examinations, proceedings and contingencies will arise from time to time. Our competitive position, results of operations, cash flows or financial condition may be affected by the outcome of examinations, proceedings and contingencies that cannot be predicted with certainty.\nSee \"Business Overview\" and \"Results of Operations—Income Taxes\" under \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" and Note 3 – Summary of Significant Accounting Policies and Note 17 – Income Taxes in the accompanying Notes to the Consolidated Financial Statements in this Annual Report for further discussion on income taxes and related contingencies.\nFailure to maintain effective internal controls over financial reporting in accordance with Section 404 of the Sarbanes-Oxley Act could materially and adversely affect us.\nAs a public company, we are subject to the reporting requirements of the Exchange Act, Sarbanes-Oxley Act of 2002 (the \"Sarbanes-Oxley Act\") and the Dodd-Frank Wall Street Reform and Consumer Protection Act and are required to prepare our financial statements according to the rules and regulations required by the SEC. In addition, the Exchange Act requires that we file annual, quarterly and current reports. Our failure to prepare and disclose this information in a timely manner or to otherwise comply with applicable law could subject us to penalties under federal securities laws, expose us to lawsuits and restrict our ability to access financing. In addition, the Sarbanes-Oxley Act requires that, among other things, we establish and maintain effective internal controls and procedures for financial reporting and disclosure purposes. Internal control over financial reporting is complex and may change over time due to changes in our business or in applicable accounting rules. We cannot provide assurance that our internal controls over financial reporting will be effective in the future or that a material weakness will not be discovered with respect to a prior period for which we had previously believed that internal controls were effective. If we are not able to maintain or document effective internal controls over financial reporting, our independent registered public accounting firm will not be able to certify as to the effectiveness of our internal controls over financial reporting. \nMatters affecting our internal controls may cause us to be unable to report our financial information on a timely basis, or may cause us to restate previously issued financial information, and thereby subject us to adverse regulatory consequences, including sanctions or investigations by the SEC, or violations of applicable stock exchange listing rules. There could also be a negative reaction in the financial markets due to a loss of investor confidence in our company and the reliability of our financial statements. Confidence in the reliability of our financial statements is also likely to suffer if we or our independent registered public accounting firm report a material weakness in our internal controls over financial reporting. This could have a material and adverse effect on us by, for example, leading to a decline in the share price of our common stock and impairing our ability to raise additional capital.",
    "item1b": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone.",
    "item1c": "ITEM 1C. CYBERSECURITY\nImpact of cybersecurity risks on business strategy, results of operations or financial condition.\nAs discussed under the “Risk Factors” heading in this Annual Report, our business has been and may again in the future be impacted by disruptions to our Technology infrastructure or our third-party providers’ Technology infrastructures from (among other causes) cybersecurity-based risks, including attacks (i) on our Technology infrastructure (ii) targeting the security, integrity and/or availability of hardware and software; (iii) exploiting weaknesses or vulnerabilities in products, or capturing information installed, stored or transmitted in our products (including after the purchase of those products and when they are installed into third-party products); and (iv) on facilities or similar infrastructure. \n27\nTable of Contents\nRisk Management and strategy\nWe mitigate cybersecurity risks (and other material risks) through our enterprise risk management (“ERM”) program, which is a company-wide effort, managed by senior executives and overseen by our Audit Committee and Board of Directors to identify, assess, manage, report and monitor material risks that may affect our ability to achieve our business objectives.\n \nIn connection with the ERM process, cybersecurity risks, including those relating to risks posed by our use of third-party service providers, are assigned to cross-functional management committees responsible for identifying and classifying the cybersecurity risks in accordance with our ERM risk rating methodology, and developing and administering risk mitigation and incident response plans.\n These cross-functional management committees regularly meet to review current and emerging cybersecurity risks and maintain policies and procedures governing the evaluation and classification of such risks. \nCybersecurity risks deemed to be critical are reviewed by a Critical Threat Committee, which is comprised of members of our senior leadership team including our Chief Financial Officer, Chief Legal Officer, Chief Digital Officer, Senior Vice President of Operations, Chief Technology Officer, Chief Product Officer and Controller/Chief Accounting Officer. The Critical Threat Committee reviews the risk and mitigation plan with the applicable cross-functional management team and facilitates notification to the Audit Committee of emerging critical cybersecurity risks. The Audit Committee and the Board of Directors receive regular briefings on cybersecurity risks. See “Governance” below for further discussion of governance of our cybersecurity program.\nIn the event of a cybersecurity incident, we maintain incident response plans to investigate, classify, respond to, and manage cybersecurity incidents that may compromise the availability or integrity of our information systems, network resources, or data. In accordance with the incident response plans, cross-functional management teams assess and assign a threat level to each cybersecurity incident. A cybersecurity incident (or incidents, if aggregated together) assigned a critical threat level is escalated to the Critical Threat Committee for review. \nTo ensure that our employees are equipped to identify and mitigate material cybersecurity incidents and to empower them to help us maintain a secure environment for our operations and data assets, we utilize a multifaceted training approach aimed at fostering a culture of security awareness and responsibility among all employees. These tailored programs are designed and updated to address evolving threats and industry best practices. In addition to annual cybersecurity training for employees and contractors and simulated phishing email campaigns, our cybersecurity teams conduct tabletop exercises with our senior management team. \nOur cybersecurity teams also oversee a security assessment process that is used to screen our third-party service providers for cybersecurity vulnerabilities based on the level of inherent risk they pose to the company or our customers, based on factors including but not limited to the products or services they provide and their ability to access our information systems, network resources, or data.\n \nWe engage and retain outside consultants and legal advisors and we are members of several cybersecurity industry groups to keep us apprised of emerging cybersecurity risks, defense and mitigation strategies and governance best practices. Many of our processes and procedures are independently audited and assessed on a periodic basis against leading international cybersecurity standards and programs. \nCybersecurity threats are constantly evolving, are becoming more frequent and more sophisticated and are made by groups of individuals with a wide range of expertise and motives which increases the difficulty of detecting and successfully defending against them. However, to date, cybersecurity threats have not materially affected us, including our business, strategy, results of operations or financial condition.\n \nGovernance\nOur cybersecurity programs, including the cross-functional management committees described above are the responsibility of our \nChief Information Security Officer\n. \nDay-to-day administration of the cybersecurity programs are led by our Chief Information Security Officer and Chief Product Security Officer who collectively possess significant experience related to cybersecurity issues in both the private and government sectors, and possess certifications including but not limited to Certified Information Systems Security Professional (\"CISSP\") and Certified Information Security Manager (\"CISM\").\n \n28\nTable of Contents\nCybersecurity risk oversight continues to remain a top priority for the \nBoard of Directors\n.\n \nAlthough the Audit Committee maintains primary responsibility for oversight of cybersecurity risks through the ERM program, responsibility related to oversight of cybersecurity risks is also delegated to other committees in alignment with their focus charter responsibilities.\n For example, the Technology and Innovation and Governance Committees assist with the cybersecurity programs through their oversight of our technology, digital, and innovation strategies and product integrity program, respectively.\nThe Critical Threat Committee is also responsible for evaluating the materiality of a cybersecurity incident based on criteria that has been reviewed with the Board of Directors, and for determining whether there are disclosure obligations under applicable securities laws. In the event that the Critical Threat Committee determines that a critical cybersecurity incident (or incidents, if aggregated together) is deemed to be material, the Critical Threat Committee will brief the Board of Directors and oversee the disclosure process. For all critical cybersecurity incidents that are not deemed to be material, the Critical Threat Committee will notify the Chairman of the Board to determine whether the Board of Directors will be notified of the critical incident during the next regularly-scheduled cybersecurity update to the Audit Committee, or sooner as circumstances warrant."
  }
}