{
  "ticker": "CAT",
  "cik": "0000018230",
  "company_name": "CATERPILLAR INC",
  "filing_date": "2025-02-14",
  "accession": "0000018230-25-000008",
  "primary_doc": "cat-20241231.htm",
  "item_sections": {
    "item1": "Item 16.\nForm 10-K Summary\n129\ni\nTable of Contents\nPART I\nItem 1.\nBusiness.\nGeneral\n \nOriginally organized as Caterpillar Tractor Co. in 1925 in the State of California, our company was reorganized as Caterpillar Inc. in 1986 in the State of Delaware.  As used herein, the term “Caterpillar,” “we,” “us,” “our” or “the company” refers to Caterpillar Inc. and its subsidiaries unless designated or identified otherwise.\n \nOverview\n \nWith 2024 sales and revenues of $64.809 billion, Caterpillar is the world’s leading manufacturer of construction and mining equipment, off-highway diesel and natural gas engines, industrial gas turbines and diesel-electric locomotives.  The company principally operates through its three primary segments - Construction Industries, Resource Industries and Energy & Transportation - and also provides financing and related services through its Financial Products segment.  Caterpillar is also a leading U.S. exporter.  Through a global network of independent dealers and direct sales of certain products, Caterpillar builds long-term relationships with customers around the world.\n \nEnterprise Strategy\n \nOur company strategy, rolled out in 2017, reflects our legacy and our continuing commitment to meet the needs of our customers and the communities in which we live and work. United by our Values, Caterpillar employees around the world share a focused view of our business through the Operating & Execution Model, through which we are making strategic choices today to create long-term profitable growth. Since 2017, we focused on three strategic areas: Expanded Offerings, Operational Excellence and Services. In 2022, we updated our strategy to also include Sustainability as a strategic area. For nearly 100 years, our longstanding commitment to sustainability has inspired us to set and achieve meaningful environmental, social and governance goals. It’s also allowed us to develop innovative products, technologies and services to support our customers on their sustainability journey. The addition of sustainability as a strategic area, together with operational excellence, expanded offerings and services, highlights our work to help customers build a better, more sustainable world.\nCurrently, we have five operating segments, of which four are reportable segments and are described below. \n \nCategories of Business Organization\n \n1.\nMachinery, Energy & Transportation\n —  Caterpillar Inc. and its subsidiaries, excluding Financial Products.  Machinery, Energy & Transportation information relates to the design, manufacturing and marketing of our products. \n2.\nFinancial Products \n— Our finance and insurance subsidiaries, primarily Caterpillar Financial Services Corporation (Cat Financial) and Caterpillar Insurance Holdings Inc. (Insurance Services). Financial Products information relates to the financing to customers and dealers for the purchase and lease of Caterpillar and other equipment.\n \nOther information about our operations in 2024, including certain risks associated with our operations, is included in Part II, Item 7 “Management’s Discussion and Analysis of Financial Condition and Results of Operations.”\n \nConstruction Industries\n \nOur Construction Industries segment is primarily responsible for supporting customers using machinery in infrastructure and building construction applications.  The majority of machine sales in this segment are made in the heavy and general construction, rental, quarry and aggregates and mining industries.   \nThe nature of customer demand for construction machinery varies around the world.  Customers in developing economies often prioritize purchase price in making their investment decisions, while customers in developed economies generally weigh productivity and other performance criteria that contribute to lower owning and operating costs over the lifetime of the machine.  To meet customer expectations in developing economies, Caterpillar developed differentiated product offerings that target customers in those regions, including our SEM brand machines.  We believe that these customer-driven product innovations enable us to compete more effectively in developing economies.  The majority of Construction Industries' research and development spending in 2024 focused on the next generation of construction machines.\n1\nTable of Contents\n \nThe competitive environment for construction machinery is characterized by some global competitors and many regional and specialized local competitors.\n \nExamples of global competitors include CASE (part of CNH Industrial N.V.), Deere Construction & Forestry (part of Deere & Company), Doosan Bobcat (Part of Doosan Group), Hitachi Construction Machinery Co., Ltd., Hyundai Construction Equipment Co., Ltd., Hyundai Doosan Infracore Co., Ltd. (both part of Hyundai Heavy Industries Group), J.C. Bamford Excavators Ltd., Kobelco Construction Machinery (part of Kobe Steel, Ltd), Komatsu Ltd., Kubota Farm & Industrial Machinery (part of Kubota Corporation), Sany Heavy Industry Co., Ltd., and Volvo Construction Equipment (part of the Volvo Group).\n \nAs an example of regional and local competitors, our competitors in China also include Guangxi LiuGong Machinery Co., Ltd., Longking Holdings Ltd., Sany Heavy Industry Co, XCMG Construction Machinery Co., Ltd., Shandong Lingong Construction Machinery Co., Ltd. (SDLG, JV with Volvo Construction Equipment) and Shantui Construction Machinery Co., Ltd., (part of Shandong Heavy Industry Group Co.).\n \nEach of these companies has varying product lines that compete with Caterpillar products, and each has varying degrees of regional focus.\n The Construction Industries portfolio includes the following product families as well as related parts and work tools:\n· asphalt pavers\n· motor graders\n· track-type tractors (small, medium)\n· backhoe loaders\n· pipelayers\n· track excavators (mini, small\n· cold planers\n· road reclaimers\n   medium, large)\n· compactors\n· skid steer loaders\n· wheel excavators\n· compact track loaders\n· telehandlers\n· wheel loaders (compact, small,\n· forestry machines\n· track-type loaders\n    medium)\n· material handlers\nResource Industries\n \nThe Resource Industries segment is primarily responsible for supporting customers using machinery in mining, heavy construction and quarry and aggregates.  Caterpillar offers a broad product range and services to deliver comprehensive solutions for our customers. We develop and manufacture high productivity equipment for both surface and underground mining operations around the world, as well as provide hydraulic systems, electronics and software for Caterpillar machines and engines.\n \nOur equipment is used to extract and haul copper, iron ore, coal, oil sands, aggregates, gold and other minerals and ores, as well as a variety of heavy construction applications.\n \nIn addition to equipment, Resource Industries also develops and sells technology products and services to provide customers fleet management systems, equipment management analytics and autonomous machine capabilities.  \nCustomers in most markets place an emphasis on equipment that is highly productive, reliable and provides the lowest total cost of ownership over the life of the equipment.\n \nIn some developing markets, customers often prioritize purchase price in making their investment decisions.  We believe our ability to control the integration and design of key machine components and innovative technologies represents a competitive advantage. Our research and development efforts remain focused on providing customers the lowest total cost of ownership enabled through the highest quality, most productive products and services in the industry.\nThe competitive environment for Resource Industries consists of a few larger global competitors that compete in several of the markets that we serve and a substantial number of smaller companies that compete in a more limited range of products, applications, and regional markets.  Our global surface competitors include Deere Construction & Forestry (part of Deere & Company), Epiroc AB, Hitachi Construction Machinery Co., Ltd., Komatsu Ltd., Liebherr-International AG, Sandvik AB, and Volvo Construction Equipment.  Our global underground competitors include Epiroc AB, Komatsu Ltd., and Sandvik AB.\nThe Resource Industries product portfolio includes the following machines and related parts and services:\n·\n                 \n electric rope shovels\n·\n                 \n large wheel loaders\n·\n                 \n landfill compactors\n·\n                 \n draglines\n·\n                 \n off-highway trucks\n·\n                 \n soil compactors\n·\n                 \n hydraulic shovels\n·\n                 \n wide-body trucks\n·\n               \n  machinery components\n·\n                 \n rotary drills\n·\n                 \n articulated trucks\n·\n                 \n autonomous ready vehicles and solutions\n·\n                 \n hard rock vehicles\n·\n                 \n wheel tractor scrapers\n·\n                 \n select work tools\n·\n                 \n large track-type tractors\n·\n                 \n wheel dozers\n·\n                 \n safety services and mining performance\n·\n                 \n large mining trucks\n·\n                 \n fleet management\n                    \n solutions\n \n2\nTable of Contents\nEnergy & Transportation\n \nOur Energy & Transportation segment supports customers in oil and gas, power generation, marine, rail and industrial applications, including Caterpillar machines. The product and services portfolio includes reciprocating engines, generator sets, integrated systems and solutions, turbines and turbine-related services, electrified powertrain and zero-emission power sources and service solutions development, the remanufacturing of Caterpillar engines and components, remanufacturing services for other companies, diesel-electric locomotives and other rail-related products and services as well as product support of on-highway engines.\nRegulatory emissions standards require us to continue to make investments as new products and new regulations are introduced.  Ongoing compliance with these regulations remains a focus.  Emissions compliance in developing markets is complex due to rapidly evolving and unique requirements where enforcement processes can often vary.  We employ robust product development, manufacturing processes and testing to help us comply with these regulations.  \n \nThe competitive environment for reciprocating engines in marine, oil and gas, industrial and electric power generation systems along with turbines in oil and gas and electric power generation consists of a few larger global competitors that compete in a variety of markets that Caterpillar serves, and a substantial number of smaller companies that compete in a limited-size product range, geographic region and/or application.  Principal global competitors include Cummins Inc., Deutz AG, Rolls-Royce Power Systems AG and Siemens Energy AG.  Other competitors, such as Volvo Penta AB, FPT Industrial SpA (Iveco Group), INNIO Group, GE Vernova Inc., Kawasaki Heavy Industries Ltd., MAN Energy Solutions SE (VW), Weichai Power Co., Ltd., and other emerging market competitors compete in certain markets in which Caterpillar competes. An additional set of competitors, including Aggreko plc, Generac Holdings Inc., Rehlko Energy, Baker Hughes Co., and others, are primarily packagers who source engines and/or other components from domestic and international suppliers and market products regionally and internationally through a variety of distribution channels.  In rail-related businesses, our global competitors include Wabtec Corp, Greenbrier Companies, Inc., Voestalpine AG, Vossloh AG, Alstom SA, and Siemens Mobility A/S.  We also compete with other companies on a more limited range of products, services and/or geographic regions.\nThe Energy & Transportation portfolio includes the following products and related parts:\n•\nReciprocating engine powered generator sets\n•\nReciprocating engines, drivetrain and integrated systems and solutions supplied to the industrial industry as well as Caterpillar machinery\n•\nIntegrated systems and solutions used in the electric power generation industry\n•\nTurbines, centrifugal gas compressors and related services\n•\nReciprocating engines, drivetrain and integrated systems and solutions for the marine and oil and gas industries\n•\nDiesel-electric locomotives and components and other rail-related products and services\nFinancial Products Segment\n \nThe business of our Financial Products Segment is primarily conducted by Cat Financial, Insurance Services and their respective subsidiaries and affiliates.  Cat Financial is a wholly owned finance subsidiary of Caterpillar Inc., and it provides retail and wholesale financing alternatives to customers and dealers around the world for Caterpillar products and services, as well as financing for power generation facilities that, in most cases, incorporate Caterpillar products.  Retail financing is primarily comprised of installment sale contracts and other equipment-related loans, working capital loans, finance leases, operating leases, and revolving charge accounts. Wholesale financing to Caterpillar dealers consists primarily of inventory and rental fleet financing.  In addition, Cat Financial purchases short-term wholesale trade receivables from Caterpillar. The various financing plans offered by Cat Financial are designed to support sales of Caterpillar products and services and generate financing income for Cat Financial.  A significant portion of our activity is conducted in North America, and we have additional offices and subsidiaries in Latin America, Asia/Pacific, Europe and Africa.  \nFor over 40 years, Cat Financial has been providing financing for Caterpillar products, contributing to our knowledge of asset values, industry trends, financing structures and customer needs.\n \nIn certain instances, Cat Financial’s operations are subject to supervision and regulation by state, federal and various foreign governmental authorities, and may be subject to various laws and judicial and administrative decisions imposing various requirements and restrictions which, among other things, (i) regulate credit granting activities and the administration of loans, (ii) establish maximum interest rates, finance charges and other charges, (iii) require disclosures to customers, (iv) govern secured transactions, (v) set collection, foreclosure, repossession and other trade practices and (vi) regulate the use and reporting of information related to a borrower’s credit experience.  Cat Financial’s ability to comply with these and other governmental and legal requirements and restrictions affects its operations.\n3\nTable of Contents\nCat Financial’s retail loans include:\n     \n•\nLoans that allow customers and dealers to use their Caterpillar equipment or other assets as collateral to obtain financing.\n•\nInstallment sale contracts, which are equipment loans that enable customers to purchase equipment with structured payments over time.\nCat Financial's retail leases include:\n \n•\nFinance (non-tax) leases, where the lessee for tax purposes is considered to be the owner of the equipment during the term of the lease, that either require or allow the customer to purchase the equipment for a fixed price at the end of the term.\n•\nTax leases that are classified as either operating or finance leases for financial accounting purposes, depending on the characteristics of the lease.  For tax purposes, we are considered the owner of the equipment.\nCat Financial also purchases short-term receivables from Caterpillar.\n \nCat Financial’s wholesale loans and leases include inventory/rental programs, which provide assistance to dealers by financing their new Caterpillar inventory and rental fleets.\nCat Financial operates in a highly competitive environment, with financing for users of Caterpillar equipment and services available through a variety of sources, principally commercial banks and finance and leasing companies.  Our competitors include Wells Fargo Equipment Finance Inc., Banc of America Leasing & Capital LLC, BNP Paribas Leasing Solutions Limited, Australia and New Zealand Banking Group Limited, Société Générale S.A. and various other banks and finance companies.  In addition, many of the manufacturers that compete with Caterpillar also own financial subsidiaries, such as John Deere Capital Corporation, Komatsu Financial L.P., Volvo Financial Services and Kubota Credit Corporation, which utilize many below-market interest rate programs (funded by the manufacturer) to support machine sales.  Cat Financial works with the broader Caterpillar organization to provide a broad array of financial merchandising programs to compete around the world.\nThe financial results of Cat Financial are largely dependent upon the ability of Caterpillar dealers to sell equipment and customers’ willingness to enter into financing or leasing agreements.  Cat Financial is also affected by, among other things, the availability of funds from its financing sources, its cost of funds relative to its competitors and general economic conditions such as inflation and market interest rates.\n \nCat Financial has a match-funding policy that addresses interest rate risk by aligning the interest rate profile (fixed or floating rate and duration) of its debt portfolio with the interest rate profile of its receivables portfolio within predetermined ranges on an ongoing basis.  In connection with that policy, Cat Financial uses interest rate derivative instruments to modify the debt structure to match assets within the receivables portfolio. This matched funding reduces the volatility of margins between interest-bearing assets and interest-bearing liabilities, regardless of which direction interest rates move.  For more information regarding match funding, please see Note 4 — “Derivative financial instruments and risk management” of Part II, Item 8 \"Financial Statements and Supplementary Data.\"  See also the risk factors associated with our financial products business included in",
    "item1a": "Item 1A. “Risk Factors—Operational Risks— Increased information technology security threats and more sophisticated computer crime pose a risk to our systems, networks, products and services” of this Form 10-K, these threats pose a risk to the security of our systems and networks and the confidentiality, availability and integrity of our data. Cybersecurity attacks could also include attacks targeting customer data or the security, integrity and/or reliability of the hardware and software installed in our products. It is possible that our information technology systems and networks, or those managed or provided by third parties, could have vulnerabilities, which could go unnoticed for a period of time. While various procedures and controls have been and are being utilized to mitigate such risks, there can be no guarantee that the actions and controls we have implemented and are implementing, or which we cause or have caused third-party service providers to implement, will be sufficient to protect and mitigate associated risks to our systems, information or other property.\n \nCybersecurity Governance\nCaterpillar’s board\n has oversight for risk management with a focus on the most significant risks facing the Company, including strategic, operational, financial and legal compliance risks.\n The board’s risk oversight process builds upon management’s risk assessment and mitigation processes, which include an enterprise risk management program of which our cybersecurity processes are an integral component. \n20\nThe board implements its risk oversight function both as a board and through delegation to board committees, which meet regularly and report back to the board.\n The board has delegated the oversight of specific risks to board committees that align with their functional responsibilities. The Audit Committee (the “AC”) assists the board in overseeing the enterprise risk management program and evaluates and monitors risks related to, among other things, the Company’s information security program. The AC assesses cybersecurity and information technology risks and the controls implemented to monitor and mitigate these risks. The Company’s Chief Information Officer & Senior Vice President, Caterpillar IT (the “CIO”) attends all bimonthly AC meetings and provides cybersecurity updates to the AC and board.\n \nOur cybersecurity program is overseen by our CIO, who has been a Caterpillar employee for over twenty-five years. Prior to her current appointment as our CIO in September 2020, she was the Chief Information Officer for the Company’s Financial Products Division.\n Her extensive background in IT includes global leadership for large-scale systems transformations, cybersecurity, cloud and application management, global data center management, worldwide network, servers and storage, database management and end-user services. Our CIO leads a cross-functional cybersecurity team comprised of professionals from our product, cybersecurity, legal and compliance organizations who focus on managing the security of our connected solutions. This team manages the Company’s global IT systems, IT risk management, cybersecurity, global infrastructure and IT transformations.",
    "item1b": "Item 1B.\nUnresolved Staff Comments.\n \nNone.",
    "item1c": "Item 1C. Cybersecurity\nAs required by Item 106 of Regulation S-K, the following sets forth information regarding our cybersecurity strategy, risk management and governance.\n19\nCybersecurity Strategy and Risk Management\nCybersecurity is critical to advancing our overall objectives and enabling our digital efforts. As a global company, we face a wide variety of cybersecurity threats that range from common attacks such as ransomware and denial-of-service, to attacks from more advanced adversaries. Our customers, suppliers, and other partners face similar cybersecurity threats, and a cybersecurity incident impacting these entities could materially adversely affect our operations, performance and results. These cybersecurity threats and related risks make it imperative that we maintain focus on cybersecurity and systemic risks.\nWe maintain a comprehensive cybersecurity program which is integrated within the Company’s enterprise risk management system and encompasses the corporate information technology and operational technology environments as well as customer-facing products.\n  Our cybersecurity program has implemented a governance structure and process to identify, assess, manage, mitigate, respond to and report on cybersecurity risks.  We utilize cybersecurity policies and frameworks based on industry and government standards.  Our cyber risk management program controls are based on recognized best practices and standards, including the National Institute of Standards and Technology (NIST) Cyber Security Framework and the International Organization for Standardization (ISO 27001) Information Security Management System Requirements.  \nWe partner with third parties to support and evaluate our cybersecurity program.  These third-party services span areas including cybersecurity maturity assessments, incident response, penetration testing, consulting on best practices, and others.  We also consume threat intelligence from several paid and non-paid sources.\n \nWe maintain a 24 x 7 operations center which serves as a central location for the reporting of cybersecurity matters, provides monitoring of our global cybersecurity environment, and coordinates the investigation and remediation of alerts.  As cybersecurity events occur, the cybersecurity team focuses on responding to and containing the threat and minimizing impact. In the event of an incident, the cybersecurity team assesses, among other factors, safety impact, supply chain and manufacturing disruption, data and personal information loss, business operations disruption, projected cost and potential for reputational harm, with participation from technical, legal and law enforcement support, as appropriate. \nWe have implemented a cybersecurity awareness program which covers topics such as phishing, social networking safety, password security and mobile device usage. We have mandatory training in the areas of cybersecurity, privacy, and confidential information handling.  We also conduct regular phishing training and simulations for our employees and contractors.  We provide extensive specialized role-based training to technical professionals in cybersecurity, secure application development, and other focus areas.  We also conduct periodic tabletop exercises to validate our preparation for cyber events.\nWe operate a third-party cybersecurity program with the goal of minimizing disruption to the Company’s business and production operations, strengthening supply chain resilience, and supporting the integrity of components and systems used in its products and services.  We rely heavily on our supply chain to deliver our products and services to our customers, and a cybersecurity incident at a supplier, subcontractor or joint venture partner could materially adversely impact us. We assess third-party cybersecurity controls through a cybersecurity third-party risk assessment process. Identified deficiencies are addressed through a risk remediation process.  For select suppliers, we engage third-party cybersecurity monitoring and alerting services, and seek to work directly with those suppliers to address potential deficiencies identified.\nAs of the date of this report, we do not believe that risks from any cybersecurity threats, including as a result of any previous cybersecurity incidents, have materially affected or are reasonably likely to affect us, including our business strategy, results of operations or financial condition.\n That said, as discussed more fully under",
    "item1d": "Item 1D.\nInformation about our Executive Officers.\nName and age\nPresent Caterpillar Inc. position \nand date of initial election\nPrincipal positions held during the\npast five years and/or\nCaterpillar Inc. position most recently held\nD. James Umpleby III (66)\nChairman of the Board (2018) and Chief Executive Officer (2017)\nGroup President (2013-2016)\nAndrew R.J. Bonfield (62)\nChief Financial Officer (2018)\nGroup Chief Financial Officer for a multinational electricity and gas utility company (2010-2018)\nBob De Lange (55)\nGroup President (2017)\nVice President (2015-2016), Worldwide Product Manager, Medium Wheel Loaders, (2013-2014)\nDenise C. Johnson (58)\nGroup President (2016)\nVice President (2012-2016)\nJoseph E. Creed (49)\nChief Operating Officer  (2023)\nGroup President (2021-2023), Vice President, Oil & Gas and Marine Division (2019-2020), Interim Chief Financial Officer (2018), Vice President, Finance Services Division (2017), Group Chief Financial Officer, Energy and Transportation (2013-2016)\nAnthony D. Fassino (54)\nGroup President (2021)\nVice President, Building Construction Products (2018-2020), Director of Worldwide Forestry Products (2016-2018)\nDerek R. Owens (51)\nChief Legal Officer and General Counsel (2023)\nSenior Vice President (2023), Deputy General Counsel (2021-2023), Associate General Counsel, Litigation & Investigations (2019-2021), Assistant United States Attorney, U.S. Attorney's Office of the Department of Justice (2005-2019)\nCheryl H. Johnson (64)\nChief Human Resources Officer (2017)\nExecutive Vice President of Human Resources for a global multi-industry aerospace, defense and industrial manufacturing company (2012-2017)\nWilliam E. Schaupp (53)\nVice President and Chief Accounting Officer (2022)\nFinance Director, Global Finance Services Division (2021-2022), Vice President and Controller and Chief Accounting Officer of PPG Industries, Inc. (2018-2021)\nJason E. Kaiser (47)\nGroup President (2024)\nSenior Vice President, Electric Power Division (2021-2023), General Manager, Electric Power Division (2019-2021), Product Manager, Electric Power Division (2016-2019)\n21\nTable of Contents"
  }
}