{
  "ticker": "CCL",
  "cik": "0000815097",
  "company_name": "CARNIVAL CORP",
  "filing_date": "2025-01-27",
  "accession": "0000815097-25-000007",
  "primary_doc": "ccl-20241130.htm",
  "item_sections": {
    "item1": "Item 1.  \nBusiness\n. \nA.   \nOverview\nI.\nSummary\nCarnival Corporation was incorporated in Panama in 1974 and Carnival plc was incorporated in England and Wales in 2000. Carnival Corporation and Carnival plc operate a dual listed company (“DLC”), whereby the businesses of Carnival Corporation and Carnival plc are combined through a number of contracts and through provisions in Carnival Corporation’s Articles of Incorporation and By-Laws and Carnival plc’s Articles of Association. The two companies operate as if they are a single economic enterprise with a single executive management team and identical Boards of Directors, but each has retained its separate legal identity. Carnival Corporation and Carnival plc are both public companies with separate stock exchange listings and their own shareholders. Together with their consolidated subsidiaries, Carnival Corporation and Carnival plc are referred to collectively in this Form 10-K as “Carnival Corporation & plc,” “company,” “our,” “us” and “we.” We are the largest global cruise company, and among the largest leisure travel companies, with a portfolio of world-class cruise lines - AIDA Cruises, Carnival Cruise Line, Costa Cruises, Cunard, Holland America Line, P&O Cruises (Australia), P&O Cruises (UK), Princess Cruises and Seabourn. \nDuring 2024, we announced that we will sunset the P&O Cruises (Australia) brand and fold its Australia operations into Carnival Cruise Line in March 2025.\nII.\nPurpose & Mission, Vision, Values and Priorities\n \nPurpose & Mission\nTo deliver unforgettable happiness to our guests by providing extraordinary cruise vacations, while honoring the integrity of every ocean we sail, place we visit and life we touch.\nVision\nAs the global leader in the cruise industry, we will lead the way in innovative and sustainable cruising to deliver memorable vacations and build borderless connections. \nCulture Essentials (our Core Values)\n•\nSpeak Up\n - Our voice is our strength. Every one of us, regardless of level or role, speaks up when we have questions, comments, concerns, or new ideas. If we see something wrong or that does not seem right, we say something and trust our voices will be heard without fear of retaliation.\n•\nRespect & Protect\n - The health, safety and well-being of our people and the planet are vital. We choose to take decisive actions to respect and protect every life we touch, the places we sail and the laws that govern us.\n•\nEmpower\n - We and our team members have the time, tools and support we need to do our best work. We are empowered to take personal ownership and accountability to succeed, and we take pride in our work.\n•\nImprove\n - Our business is built on forward motion. We have the courage to dream big, driving innovation and continuous improvement in guest and team member experiences, operations, compliance, sustainability and beyond.\n•\nListen & Learn\n - We listen actively and seek to understand before responding, because the more perspectives we have, the better decisions we make. We value and respect the words and ideas of others, keeping an open mind, and learning from our successes and failures.\n•\nCommunicate\n - We openly share our knowledge, skills and information across brands, functions and the entire company to further our collective success. Together we champion our purpose & mission, vision, values and company priorities. \n5\nPriorities\nEnsure each of our world-class brands owns its space in the vacation market by delivering extraordinary experiences tailored to its guests.\nWe understand vacation expectations and preferences vary widely among our diverse audience of potential guests. To fulfill our purpose & mission, and in the process achieve outstanding guest satisfaction levels, industry-leading demand and improved pricing, each of our brands must carve out a distinct identity for delivering cruise experiences. Our brands must effectively market their uniqueness to existing and potential guests and deliver on their promise across the entire guest journey.\nBecome travel and leisure’s employer of choice.\nWe celebrate our diverse team of over 160,000 team members representing approximately 150 countries and are committed to providing a welcoming and inclusive environment where people from different backgrounds, experiences and walks of life can succeed. We care deeply for our team members and must always cultivate an atmosphere of openness, respect and trust. We know our team members are at the heart of inspiring unforgettable happiness, so we strive to be the world’s number-one choice for hospitality, travel and leisure careers.\nMaintain our commitment to seek excellence in compliance, environmental protection and in looking after the safety, health and well-being of every life we touch.\nAchieving our purpose & mission depends on being good corporate citizens and stewards of the environment. Safeguarding the planet we call home, our guests, the communities we serve, and our Carnival family, and complying with the laws and regulations that govern our business, is vital to our success. \nSet the pace with the industry’s smartest solutions that deliver on our sustainability roadmap to 2030.\nOur earth, ecosystem and environment are vital to our success. Without the incredible communities and scenic spaces we operate in, our purpose & mission of inspiring unforgettable happiness would be impossible. We are determined to lead the way in sustainable cruising by promoting positive climate action, contributing to a circular economy, partnering with the communities we sail to and from and reducing our environmental footprint. To do this, we are investing in technology upgrades and fleet improvements, piloting alternative fuel types and optimizing itineraries.\nStrengthen our balance sheet and deliver long-term shareholder value.\nIn recent years, travel and leisure has endured volatility unlike anything seen in modern history, including unique obstacles that disproportionately affected the cruise industry. With our operations now at full strength and the continued support of our guests, team members, investors and other stakeholders, we are focused on our financial fitness. We are determined to drive revenue, operate effectively and efficiently at scale, generate record levels of cash from operations and invest our capital wisely. We believe this will allow us to responsibly reduce our debt over time, improve our return on invested capital as well as return to investment-grade leverage metrics.\nB.   \nGlobal Cruise Industry\nI.  \nOverview\nCruising offers a broad range of products and services to suit vacationing guests of many ages, backgrounds and interests. Each brand in our portfolio meets the needs of a distinct set of consumer psychographics and vacation needs which allows us to penetrate large addressable customer segments. The mobility of cruise ships enables us to move our vessels between regions in order to meet changing demand across different geographic areas. \nCruise brands can be broadly classified as offering contemporary, premium and luxury cruise experiences. The contemporary experience appeals to a broad segment of the cruise vacation industry, including families with children of all ages, features a variety of activities and entertainment venues and historically includes cruises that last seven days or less. The premium experience emphasizes quality, comfort, style and more destination-focused itineraries. The premium experience generally includes cruises that last from seven to 14 days. The luxury experience is generally characterized by very high standards of accommodation and service, smaller vessel size and exotic itineraries to ports that are inaccessible by larger ships. We have product and service offerings in each of these three broad classifications.\n6\nII.   \nPassenger Capacity by Ocean Going Vessels\nPassenger Capacity as of December 31 (a) (b)\nCalendar Year\nGlobal Cruise \nIndustry (c)\nCarnival \nCorporation & plc\n2021\n636,270 \n253,950 \n2022\n663,970 \n259,060 \n2023\n701,110 \n263,300 \n2024\n733,010 \n269,970 \n2025\n777,700 \n272,380 \n2026\n801,450 \n272,380 \n2027\n823,630 \n277,710 \n(a)\n2025-2027 data is estimated based on announced newbuilds and ship retirements.\n(b)\nIn accordance with cruise industry practice, passenger capacity is calculated based on the assumption of two passengers per cabin even though some cabins can accommodate three or more passengers.\n(c)\nGlobal cruise industry data was obtained from Cruise Industry News.\nIII.  \nCompetition\nWe compete with land-based vacation alternatives throughout the world, such as hotels, resorts (including all-inclusive resorts), theme parks, organized tours, casinos, vacation ownership properties, and other internet-based alternative lodging sites. Based on 2024 Cruise Industry News statistics, as of December 31, 2024, we, along with our principal cruise competitors Royal Caribbean Group, Norwegian Cruise Line Holdings, Ltd. and MSC Cruises, represented approximately 80% of the cruise industry capacity. \n7\nC.   \nOur Global Cruise Business\nI.  \nSegment and Brand Information\nNovember 30, 2024\nPassenger Capacity\nPercentage of Total Capacity\nNumber of Cruise Ships\nNorth America and Australia (“NAA”) Segment\n   Carnival Cruise Line\n89,100\n(a)\n33 \n%\n27\n   Princess Cruises\n50,580\n19 \n%\n16\n   Holland America Line\n22,920\n8 \n%\n11\n   P&O Cruises (Australia)\n7,230\n(a)\n3 \n%\n3\n   Seabourn\n2,640\n1 \n%\n6\n172,490\n64 \n%\n63\nEurope Segment\n   Costa Cruises (“Costa”)\n31,140\n12 \n%\n9\n   AIDA Cruises (“AIDA”)\n32,280\n12 \n%\n11\n   P&O Cruises (UK)\n24,300\n9 \n%\n7\n   Cunard\n9,770\n4 \n%\n4\n97,490\n36 \n%\n31\n269,970\n100 \n%\n94\n(a)\nDuring\n 2024, we announced that we will sunset the P&O Cruises (Australia) brand and fold its Australia operations into Carnival Cruise Line in March 2025.\n \nPacific Encounter\n and \nPacific Adventure \nwill be transferred to Carnival Cruise Line in early 2025 and \nPacific Explorer\n is expected to leave the fleet in February 2025.\nWe also have a Cruise Support segment that includes our portfolio of leading port destinations and exclusive islands as well as other services, all of which are operated for the benefit of our cruise brands.\nIn addition to our cruise operations, we own Holland America Princess Alaska Tours, the leading tour company in Alaska and the Canadian Yukon, which complements our Alaska cruise operations. Our tour company owns and operates hotels, lodges, glass-domed railcars and motorcoaches which comprise our Tour and Other segment. \nII.  \nShips Under Contract for Construction\n \nAs of November 30, 2024, we have a total of six cruise ships expected to be delivered through 2033. Our ship construction contracts are with Fincantieri in Italy and Meyer Werft in Germany. \nExpected Delivery Date\n Passenger Capacity\nLower Berth\n   Carnival Cruise Line \nNewbuild\nApril 2027\n5,330 \nNewbuild\nMarch 2028\n5,330 \nNewbuild\nJuly 2029\n6,160 \nNewbuild\nJuly 2031\n6,160 \nNewbuild\nJune 2033\n6,160 \n   Princess Cruises\nStar Princess \nSeptember 2025\n4,310 \n8\nIII.  \nDescriptions of Cruise Brands\nCarnival Cruise Line is “The World’s Most Popular Cruise Line®” and has provided multi-generational family entertainment at exceptional value to its guests for over 50 years. Carnival Cruise Line creates an environment where guests can be their most playful selves on ships that are designed to inspire the experience of bringing people together, with limitless opportunities for guests to create their own fun.\nDuring 2024, we announced that we will sunset the P&O Cruises (Australia) brand and fold its Australia operations into Carnival Cruise Line in March 2025. \nPacific Encounter\n and \nPacific Adventure \nwill be transferred to Carnival Cruise Line in early 2025 and \nPacific Explorer\n is expected to leave the fleet in February 2025. \n \nPrincess Cruises is The Love Boat®, the brand that introduced the world to the elegance and romance of modern-day cruising and has delivered dream vacations to millions of guests for nearly 60 years in the most sought-after destinations. Princess combines extraordinary large ship amenities with elite service personalization and simplicity to create meaningful connections and unforgettable moments in the most incredible settings across the globe.\nHolland America Line has been exploring the world for over 150 years with expertly crafted itineraries, extraordinary service and genuine connections to destinations. Holland America Line visits over 100 countries around the world and has shared the thrill of Alaska with guests for more than 75 years with its ideal mid-sized ships. Guests enjoy extraordinary entertainment at sea and dining venues featuring exclusive dishes by world-famous chefs.\n \nSeabourn, a leader in ultra-luxury cruising, sails to legendary cities and less-traveled ports. Intimate ships with a yacht-like atmosphere, allow guests to discover the unexpected—about the world and about themselves. Guests enjoy all ocean-front suites and world-class gourmet dining as they wish. Seabourn creates moments of surprise and delight known as “Seabourn Moments” in an environment that fosters building meaningful connections with fellow travelers, crew members and the communities they visit. Seabourn’s fleet includes two purpose-built ultra-luxury expedition ships offering amenities such as submarines, Zodiacs® and kayaks.\n9\nFor over 75 years, Costa has brought wonder to guests’ lives, allowing them to discover unique destinations and experiences both onboard and onshore. Costa's warm hospitality and high-quality onboard services feature a true European touch and Italian passion, setting Costa apart from any other cruise experience.\nAIDA is the most recognized brand in the German cruise market. Its ships visit many beautiful destinations around the world and bring together people of all ages. AIDA inspires guests with excellent service and a variety of extraordinary experiences. The smile on the bow of the ships represents the unique AIDA attitude on life — relaxed, friendly, colorful, cosmopolitan and uncomplicated.\nP&O Cruises (UK) is Britain’s largest cruise line and its heritage can be traced back over 185 years. P&O Cruises (UK) welcomes guests to extraordinary travel experiences designed in a distinctively British way - through a blend of discovery, relaxation and exceptional service catered towards British tastes. P&O Cruises (UK)’s fleet of premium ships deliver authentic travel experiences around the globe, combining style, quality and innovation with a sense of occasion and attention to detail, to create a truly memorable holiday.\nFor nearly 185 years, the iconic Cunard fleet has perfected the timeless art of luxury ocean travel. Cunard’s distinct voyages are meticulously crafted to offer fine dining and bars, unique entertainment, and the famous White Star Service®, comfort and style. A pioneer in transatlantic journeys and World Voyages, its destinations also include Europe, the Caribbean and Alaska.\nIV.  \nTrademarks and Other Intellectual Property\nWe own, use and/or have registered or licensed numerous trademarks, patents and patent pending designs and technology, copyrights and domain names, which have considerable value and some of which are widely recognized throughout the world. These intangible assets enable us to distinguish our cruise products and services, ships and programs from those of our competitors. We own or license the trademarks for the trade names of our cruise brands, each of which we believe is a widely-recognized brand in the cruise industry, as well as our ship names and a wide variety of cruise products and services.\n10\nV.  \nPassengers Carried by Principal Source Geographic Areas\nCarnival Corporation & plc\nPassengers Carried \n(in thousands)\n2024\n2023\n2022\nBrands’ Main Source Markets\nUnited States and Canada\n7,938\n7,410\n5,140\nCarnival Cruise Line, Cunard, Holland America Line, Princess Cruises and Seabourn\nContinental Europe\n2,702\n2,590\n1,610\nAIDA and Costa\nUnited Kingdom \n1,087\n970\n660\nCunard and P&O Cruises (UK)\nAustralia and New Zealand\n1,027\n940\n230\nCarnival Cruise Line, P&O Cruises (Australia) and Princess Cruises\nOther\n754\n550\n90\nTotal\n13,509\n12,460\n7,730\nData for 2022 is not representative of a full year of operations.\nVI.  \nCruise Programs\nCarnival Corporation & plc \nPercentage of Passenger Capacity by Itinerary\n2025\n2024\n2023\nCaribbean\n34 \n%\n34 \n%\n31 \n%\nEurope without Mediterranean\n16 \n17 \n17 \nMediterranean\n14 \n13 \n15 \nAlaska\n6 \n6 \n7 \nAustralia and New Zealand\n6 \n7 \n7 \nOther\n24 \n23 \n24 \n100 \n%\n100 \n%\n100 \n%\nVII.  \nCruise Pricing and Payment Terms\nEach of our cruise brands establishes pricing for the upcoming seasons which are made available primarily through the internet, although published materials and electronic communications are also used. Prices vary depending on a number of factors, including the source market, category of guest accommodation, ship, season, duration and itinerary. We offer a variety of special promotions, including early booking, past guest recognition and travel agent programs. \nOur bookings are generally taken several months in advance of the cruise departure date. Typically, the longer the cruise itinerary, the further in advance the bookings are made. This lead time allows us to manage our prices in relation to guest demand and the number of available cabins through our revenue management capabilities and other initiatives.\nThe cruise ticket price typically includes the following: \n•\n \nAccommodations\n•\n \nMost meals, including snacks at numerous venues \n•\n \nAccess to amenities such as swimming pools, water slides, water parks, whirlpools, a health club, and sun decks \n•\n \nChildcare and supervised youth programs \n•\n \nEntertainment, such as theatrical and comedy shows, live music and nightclubs \n•\n \nVisits to multiple destinations \n11\nWe offer value added packages to induce ticket sales to guests and groups and to encourage the advance purchase of certain onboard items. These packages are bundled with cruise tickets and sold to guests for a single price rather than as a separate package and may include one or more of the following: \n •   Beverage packages\n •   Internet packages\n •   Shore excursions\n •   Photo packages\n •   Air packages \n •   Onboard spending credits\n •   Specialty restaurants\n •   Service charges\nOur brands’ payment terms generally require that a guest pay a deposit to confirm their reservation and then pay the balance due before the departure date.\nVIII.  \nSeasonality\nOur passenger ticket revenues are seasonal. Demand for cruises has been greatest during our third quarter, which includes the Northern Hemisphere summer months. This higher demand during the third quarter results in higher ticket prices and occupancy levels and, accordingly, the largest share of our operating income is typically earned during this period. Our results are also impacted by ships being taken out-of-service for planned maintenance, which we schedule during non-peak seasons. In addition, substantially all of Holland America Princess Alaska Tours’ revenue and operating income is generated from May through September in conjunction with Alaska’s cruise season.\nIX.  \nOnboard and Other Revenues\nOnboard and other activities are provided either directly by us or by independent concessionaires, from which we receive either a percentage of their revenues or a fee. Concession revenues do not have direct expenses because the costs and services incurred for concession revenues are borne by our concessionaires. In 2024, we earned 34% of our cruise revenues from onboard and other revenue goods and services including:\n•\n    Beverage sales\n•\n    Internet and communication services\n•\n    Casino gaming\n•\n    Full-service spas\n•\n    Shore excursions\n•\n    Specialty restaurants\n•\n    Retail sales\n•\n    Art sales\n•\n    Photo sales\n•\n    Laundry and dry-cleaning services\n12\nX.  \nPort Destinations and Exclusive Islands\nWe operate a portfolio of port destinations and exclusive islands enabling us to offer exceptional experiences to 6.5 million guests by creating a wide variety of high-quality destinations that are uniquely tailored to our guests’ preferences. In addition, to secure preferential berth access to third-party ports, we enter into berthing agreements and commitments.\nWe recently announced plans to enhance Half Moon Cay, our highly rated and award-winning exclusive Bahamian destination. The enhancements will lean further into this destination’s natural beauty and pristine appeal, reinforcing its new name – RelaxAway, Half Moon Cay. Featuring a newly constructed pier that is expected to open in the summer of 2026, the destination will allow two ships to dock, including Carnival Cruise Line’s largest ships that will be able to visit for the first time.\n \nDuring 2024, we continued construction on our new exclusive cruise port destination, Celebration Key, which is expected to open in the summer of 2025, with an additional pier opening in the fall of 2026. Celebration Key, located on the south side of Grand Bahama Island, will welcome guests to a stunning beach and further expands our experience offerings with an abundance of features and amenities for our guests. Once the additional pier is completed, Celebration Key will be able to accommodate up to four of our cruise ships simultaneously. Additionally, our investment in Celebration Key will support our efforts to design more energy efficient itineraries based on its location and will be a strategic addition to our current portfolio of six owned or operated ports and destinations:\n•\nPuerta Maya in Cozumel, Mexico\n•\nGrand Turk Cruise Center in Turks & Caicos\n•\nMahogany Bay in Isla Roatan, Honduras\n•\nAmber Cove in the Dominican Republic\n•\nRelaxAway, Half Moon Cay, an exclusive island in The Bahamas\n•\nPrincess Cays, an exclusive island in The Bahamas\nXI.  \nMarketing Activities\nGuest feedback and research support the development of our overall marketing and business strategies to drive demand for cruises and increase the number of first-time cruisers. Our goal has always been to increase consumer awareness for cruise vacations and further grow our share of their vacation spend. We proactively gather and evaluate guest feedback about their cruise experiences for valuable insights on key drivers of guest loyalty and satisfaction, with a focus on continuous improvement. We closely monitor our net promoter scores, which reflect the likelihood that our guests will recommend our brands’ cruise products and services to friends and family, including those new-to-cruise.\nDuring 2024, we increased our marketing and advertising programs, driving even greater demand across our portfolio of world-class cruise lines. Each of our cruise lines is focused on creating further brand differentiation and clarity around its unique value proposition, executing on a range of carefully targeted, results-driven marketing and advertising programs to reach its optimal market segment of new and loyal guests and travel agent partners. Among these programs are increasingly effective digital performance marketing and lead generation approaches that have attracted new guests online by leveraging the reach and impact of digital marketing and social media. We have also invested in new marketing technologies to deliver more engaging and personalized communications, further enhancing their effectiveness. Collectively through these programs, we have cultivated cruising advocates creating word-of-mouth demand and preference for our brands, ships, itineraries and onboard products and services.\nIn addition, substantially all of our cruise brands offer guest loyalty and recognition programs that motivate future purchases from our repeat guests. Each brand strategically leverages its catalog of demand-generating rewards and incentives to bring repeat guests back time and again with finely honed offers, such as special fares, onboard activity discounts, complimentary laundry and internet services, expedited ship embarkation and disembarkation and special onboard activities. \nXII.  \nSales Channels\nWe sell our cruises through travel agents, tour operators, company vacation planners, our websites and onboard future cruise consultants. Our individual cruise brands’ relationships with their travel agent partners are generally independent of each of our other brands. Our travel agents’ relationships are generally not exclusive and travel agents generally receive a base commission, plus the potential of additional commissions, including discounts or complimentary tour conductor cabins, based on the achievement of pre-defined sales terms. \nTravel agent partners are an integral part of our long-term cruise distribution network and are critical to our success. We utilize local sales teams to motivate travel agents to support our products and services with competitive pricing, promotional policies \n13\nand joint marketing and advertising programs. During 2024, no group of travel agencies under common control accounted for 10% or more of our revenues. We also employ a wide variety of educational programs, including websites, seminars and videos, to train agents on our cruise brands and their products and services. In 2024, we held a variety of trainings and educational programs to continue to support and develop our travel agent partners, including ship visits to familiarize our travel agent partners with our products and services.\nAll of our brands have internet booking engines to allow travel agents to book our cruises. Additionally, all of our cruise brands have their own consumer websites that provide access to information about their products and services to users and enable their guests to quickly and easily book cruises and other products and services online. These sites interface with our brands’ social networks, blogs and other social media sites, which allow them to develop greater contact and interaction with their guests before, during and after their cruise. We also employ vacation planners and onboard future cruise consultants who support our sales initiatives by offering our guests one-on-one cruise planning expertise and other services.\nXIII.  \nSuppliers\nTo provide an exceptional cruise experience for our guests, we source significant quantities of goods and services from a global supply base. In addition, we incur significant capital expenditures for materials to support the refurbishment and enhancements of our vessels as well as to build new ships. We approach our spend strategically and look for suppliers who demonstrate the ability to help us leverage our scale in terms of cost, quality, service, innovation and sustainability. Our supply base is diverse and many of our suppliers provide goods and services across our portfolio of brands. We have continued to map our supply chains and evaluate risks, including the categories of products and services sourced and their geographic locations.\nWe strive to build strong relationships with our suppliers based on shared values. Our Business Partner Code of Conduct applies to all of our suppliers and other business partners. It outlines our expectation that our suppliers will respect and follow applicable laws and regulations and promote ethical decisions in all aspects of their business. We have also established a Responsible and Sustainable Sourcing Policy (“RSSP”) that builds on existing policies, such as our Business Partner Code of Conduct, and our human rights and environmental policies. RSSP establishes a framework that helps us monitor compliance with our standards and helps our business partners, including suppliers, meet our requirements for compliance and progress towards industry best practices. It is designed to ensure that our sourcing practices align with our values of social responsibility and environmental stewardship. RSSP addresses labor, environmental, business ethics, management systems and health and safety risks. It also covers sustainability priorities such as sustainable food ingredients, animal welfare and sustainable shore excursions.\nIn recent years, global supply markets and supply chains have been impacted by certain global events and increased inflation, impacting our operations and profitability. While we have experienced stabilization in supply markets and easing of inflation, we continue to apply a number of different strategies to mitigate the impact of these challenges on our operations, including extending our demand planning, placing purchase orders earlier to secure supply, leveraging our enterprise scale through corporate-wide agreements, utilizing short-term or long-term contracts as needed, seeking alternative sources, utilizing substitute products and leveraging our supplier relationships. \nXIV. \nHuman Capital Management and Employees\nOur shipboard and shoreside employees are sourced from approximately 150 countries. In 2024, we had an average of 100,000 employees onboard our ships, excluding employees on leave. Our shoreside operations had an annual average of 12,000 full-time and 3,000 part-time/seasonal employees. Holland America Princess Alaska Tours significantly increases its work force during the late spring and summer months in connection with Alaska’s cruise season.\nWe have entered into agreements with unions covering certain employees on our ships and in our shoreside hotel and transportation operations. The percentages of our shipboard and shoreside employees that are represented by collective bargaining agreements are 52% and 22%, respectively. We consider our employee and union relationships to be strong.\nA team of highly motivated and engaged employees is key to providing extraordinary cruise vacations. To facilitate the recruitment, development and retention of our valuable employees, we strive to make Carnival Corporation & plc a diverse, inclusive and safe workplace, with opportunities for our employees to grow and develop in their careers.\n14\na.\nTalent Development\nWe believe in investing in our team members through the training and development of both shoreside and shipboard team members. We facilitate trainings to ensure that our teams are well-prepared to carry out their individual and collective responsibilities. For our shipboard team members, our goal is to be a leader in delivering high quality professional maritime training, as evidenced by the Arison Maritime Center. The Center is home to the Center for Simulator Maritime Training (“CSMART”). The leading-edge CSMART Academy features the most advanced bridge and engine room simulator technology and equipment available, with the capacity to provide annual professional training for all our bridge, engineering and environmental officers. CSMART participants receive a maritime training experience that fosters advanced knowledge and skills development, critical thinking and problem solving; all in a professional learning environment where our corporate culture is reinforced. CSMART also offers training related to liquefied natural gas (“LNG”) technology as well as an environmental officer training program and additional environmental courses for bridge and engineering officers to further enhance our training on environmental awareness and protection.\nb.\nSuccession Planning\nOur Boards of Directors believe that planning for succession is an important function. Our multi-brand structure enhances our succession planning process. We continually strive to foster the professional development of management and team members. As a result, we have developed a very experienced and strong group of leaders, with their performance subject to ongoing monitoring and evaluation, as potential successors to our senior management, including our Chief Executive Officer (“CEO”).\n    XV.  \nEthics and Compliance\nWe believe a strong ethics and compliance culture is imperative for the success of any company. Our compliance framework includes a Global Ethics and Compliance (“Global E&C”) department, which is led by our Chief Risk and Compliance Officer who leads the effort to promote and monitor a strong ethics and compliance culture throughout the company. The main responsibilities of the Global E&C department are to collaboratively:\n•\nIdentify, assess, monitor, prevent, detect and report on compliance risk\n•\nEnsure compliance accountabilities and responsibilities are clear across the company\n•\nPromote a strong culture of ethics and compliance\n•\nDrive ethics and compliance continuous improvements\nTo further heighten the focus on ethics and compliance, our Boards of Directors have Compliance Committees, which oversee the Global E&C department and maintain regular communications with our Chief Risk and Compliance Officer.\nXVI.  \nInsurance\na.\nGeneral\n \nWe maintain insurance to cover a number of risks associated with owning and operating our vessels and other non-ship related risks. All such insurance policies are subject to coverage limits, exclusions and deductible levels. Insurance premiums are dependent on our own loss experience and the general premium requirements of our insurers. We maintain certain levels of deductibles for substantially all the below-mentioned coverages. We may increase our deductibles to mitigate future premium increases. We do not carry coverage related to loss of earnings or revenues from our ships or other operations.\nb.\nProtection and Indemnity (“P&I”) Coverages\nLiabilities, costs and expenses for illness and injury to crew, guest injury, pollution and other third-party claims in connection with our cruise activities are covered by our P&I clubs, which are mutual indemnity associations owned by ship owners.\nWe are members of three P&I clubs, Gard, Steamship Mutual and UK Club, which are part of a worldwide group of 12 P&I clubs, known as the International Group of P&I Clubs (the “IG”). The IG insures directly, and through broad and established reinsurance markets, a large portion of the world’s shipping fleets. Coverage is subject to the P&I clubs’ rules and the limits of coverage are determined by the IG.\n15\nc.\nHull and Machinery Insurance\nWe maintain insurance on the hull and machinery of each of our ships for reasonable amounts as determined by management. The coverage for hull and machinery is provided by large and well-established international marine insurers. Insurers make it a condition for insurance coverage that a ship be certified as “in class” by a classification society that is a member of the International Association of Classification Societies (“IACS”). All of our ships are routinely inspected and certified to be in class by an IACS member. \nd.\nWar Risk Insurance\nWe use a combination of insurance and self-insurance to cover war risk for legal liability to crew, guests and other third parties as well as loss or damage to our vessels arising from war or war-like actions. Our primary war risk insurance coverage is provided by international marine insurers and our excess war risk insurance is provided by our three P&I clubs. Under the terms of our war risk insurance coverage, which are typical for war risk policies in the marine industry, insurers can give us no less than three days’ notice that the insurance policies will be canceled. However, the policies may be reinstated at different premium rates. \ne.\nOther Insurance\nWe maintain property insurance covering our shoreside assets and casualty insurance covering liabilities to third parties arising from our hotel and transportation business, shore excursion operations and shoreside operations, including our port and related commercial facilities. We also maintain workers’ compensation, director’s and officer’s liability and other insurance coverages. \n XVII. \nTaxation\nA summary of our principal taxes and exemptions in the jurisdictions where our significant operations are located is as follows: \na.\nU.S. Income Tax\nWe are primarily foreign corporations engaged in the business of operating cruise ships in international transportation. We also own and operate, among other businesses, the U.S. hotel and transportation business of Holland America Princess Alaska Tours through U.S. corporations.\nOur North American cruise ship businesses and certain ship-owning subsidiaries are engaged in a trade or business within the U.S. Depending on its itinerary, any particular ship may generate income from sources within the U.S. We believe that our U.S. source income and the income of our ship-owning subsidiaries, to the extent derived from, or incidental to, the international operation of a ship or ships, is exempt from U.S. federal income and branch profit taxes. \nOur domestic U.S. operations, principally the hotel and transportation business of Holland America Princess Alaska Tours, are subject to federal and state income taxation in the U.S.\n1.\nApplication of Section 883 of the Internal Revenue Code\nIn general, under Section 883 of the Internal Revenue Code, certain non-U.S. corporations (such as our North American cruise ship businesses) are not subject to U.S. federal income tax or branch profits tax on U.S. source income derived from, or incidental to, the international operation of a ship or ships. Applicable U.S. Treasury regulations provide in general that a foreign corporation will qualify for the benefits of Section 883 if, in relevant part, (i) the foreign country in which the foreign corporation is organized grants an equivalent exemption to corporations organized in the U.S. in respect of each category of shipping income for which an exemption is being claimed under Section 883 (an “equivalent exemption jurisdiction”) and (ii) the foreign corporation meets a defined publicly-traded corporation stock ownership test (the “publicly-traded test”). Subsidiaries of foreign corporations that are organized in an equivalent exemption jurisdiction and meet the publicly-traded test also benefit from Section 883. We believe that Panama is an equivalent exemption jurisdiction and that Carnival Corporation currently satisfies the publicly-traded test under the regulations. Accordingly, substantially all of Carnival Corporation’s income is exempt from U.S. federal income and branch profit taxes. \nRegulations under Section 883 list certain activities that the Internal Revenue Service (“IRS”) does not consider to be incidental to the international operation of ships and, therefore, the income attributable to such activities, to the extent such income is U.S. source, does not qualify for the Section 883 exemption. Among the activities identified as not incidental are income from the \n16\nsale of air transportation, transfers, shore excursions and pre- and post-cruise land packages to the extent earned from sources within the U.S.\n2.\nExemption Under Applicable Income Tax Treaties\nWe believe that the U.S. source transportation income earned by Carnival plc and its subsidiaries qualifies for exemption from U.S. federal income tax under applicable bilateral U.S. income tax treaties.\n3.\nU.S. State Income Tax\nCarnival Corporation, Carnival plc and certain subsidiaries are subject to various U.S. state income taxes generally imposed on each state’s portion of the U.S. source income subject to U.S. federal income taxes. However, the state of Alaska imposes an income tax on its allocated portion of the total income of our companies doing business in Alaska and certain of their subsidiaries.\nb.\nUK and Australian Income Tax\nCunard, P&O Cruises (UK) and P&O Cruises (Australia) are divisions of Carnival plc and have elected to enter the UK tonnage tax regime under a rolling ten-year term and, accordingly, reapply every year. Companies to which the tonnage tax regime applies pay corporation taxes on profits calculated by reference to the net tonnage of qualifying ships. UK corporation tax is not chargeable under the normal UK tax rules on these brands’ relevant shipping income. Relevant shipping income includes income from the operation of qualifying ships and from shipping related activities.\nFor a company to be eligible for the regime, it must be subject to UK corporation tax and, among other matters, operate qualifying ships that are strategically and commercially managed in the UK. Companies within the UK tonnage tax regime are also subject to a seafarer training requirement.\nOur UK non-shipping activities that do not qualify under the UK tonnage tax regime remain subject to normal UK corporation tax.\nP&O Cruises (Australia) and all of the other cruise ships operated internationally by Carnival plc for the cruise segment of the Australian vacation region are exempt from Australian corporation tax by virtue of the UK/Australian income tax treaty.\nc.\nItalian and German Income Tax\nIn December 2024, the European Commission formally approved the Italian tonnage tax rules for 10 years. In 2025, Costa and AIDA will elect to remain in the Italian tonnage tax regime through 2034. Companies to which the tonnage tax regime applies pay corporation taxes on shipping profits calculated by reference to the net tonnage of qualifying ships.\nOur non-shipping activities that do not qualify under the Italian tonnage tax regime remain subject to normal Italian corporation tax.\nSubstantially all of AIDA’s earnings are exempt from German income taxes by virtue of the Germany/Italy income tax treaty. \nd\n.    \nGlobal Minimum Tax\n \nThe Organization for Economic Co-operation and Development (“OECD”) issued Model Rules for implementation of a 15% minimum tax for multinational enterprises as part of its initiative\n intended to address the tax challenges arising from globalization. Subject to certain requirements, the OECD Model Rules provide an exclusion for international shipping income. \nThe implementation of these rules will affect Carnival plc and its subsidiaries beginning in fiscal 2025 and Carnival Corporation and certain of its subsidiaries beginning in fiscal 2026. We expect Carnival plc and its subsidiaries will be eligible for the international shipping income exclusion based on their current structure. Carnival Corporation and certain of its subsidiaries intend to align into a single tax jurisdiction where the international shipping income for its North American brands is also expected to qualify for this exemption. As a result, we do not believe the application of these rules will have a material impact on our consolidated financial statements.\n17\ne\n.      \nOther\nIn addition to or in place of income taxes, virtually all jurisdictions where our ships call impose taxes, fees and other charges based on guest counts, ship tonnage, passenger capacity or some other measure.\nXVIII.    \nGovernmental Regulations\na.    \nMaritime Regulations\n1.    \nGeneral\nOur ships are regulated by numerous international, national, state and local laws, regulations, treaties and other legal requirements, as well as voluntary agreements, which govern health, environmental, safety and security matters in relation to our guests, crew and ships. These requirements change frequently, depending on the itineraries of our ships and the ports and countries visited. If we violate or fail to comply with any of these laws, regulations, treaties and other requirements, we could be fined or otherwise sanctioned by regulators. We are committed to complying with, or exceeding, all relevant requirements.\nThe primary regulatory bodies that establish maritime laws and requirements applicable to our ships include: \nThe International Maritime Organization (“IMO”):\n All of our ships, and the maritime industry as a whole, are subject to the maritime safety, security and environmental regulations established by the IMO, a specialized agency of the United Nations. The IMO’s principal sets of requirements are mandated through its International Convention for the Safety of Life at Sea (“SOLAS”), its International Convention for the Prevention of Pollution from Ships (“MARPOL”) and its International Convention on Standards of Training, Certification and Watchkeeping for Seafarers (“STCW”).\nFlag States:\n Our ships are registered, or flagged, in The Bahamas, Bermuda, Italy, the Netherlands, Panama and the UK, which are also referred to as Flag States. Our ships are regulated by these Flag States through international conventions that govern, among other things, health, environmental, safety and security matters in relation to our guests, crew and ships. Representatives of each Flag State conduct periodic inspections, surveys and audits to verify compliance with these requirements.\nShip classification societies:\n Class certification is one of the necessary documents required for our ships to be flagged in a specific country, obtain liability insurance and legally operate as passenger cruise ships. Our ships are subject to periodic class surveys, including dry-dock inspections, by ship classification societies to verify that our ships have been maintained in accordance with the rules of the classification societies and that recommended repairs have been satisfactorily completed. Dry-dock frequency is a statutory requirement mandated by SOLAS.\nNational, regional, and other authorities:\n We are subject to the decrees, directives, regulations, and requirements of the European Union (“EU”), the UK, the U.S., other countries, and many other authorities, including ports that our ships visit. \nPort regulatory authorities (Port State Control):\n Our ships are also subject to inspection by the port regulatory authorities, which are also referred to as Port State Control, in the various countries that they visit. Such inspections include verification of compliance with the maritime safety, security, environmental, customs, immigration, health and labor requirements applicable to each port, as well as with regional, national and international requirements. Many countries have joined together to form regional Port State Control authorities. \nOur Boards of Directors have Health, Environment, Safety and Security (“HESS”) Committees, which were comprised of six independent directors as of November 30, 2024. The principal function of the HESS Committees is to assist the boards in fulfilling their responsibility to supervise and monitor our health, environmental, safety, security and sustainability policies, programs and initiatives at sea and ashore and compliance with related legal and regulatory requirements. The HESS Committees and our management team review significant HESS relevant risks or exposures and associated mitigating actions. \nWe are committed to implementing appropriate measures to manage identified risks effectively. We have a Chief Maritime Officer to oversee our global maritime operations, including maritime policy, maritime affairs, maritime standards, training, shipbuilding, asset management, health operations, and research and development. In addition, we have a Chief Risk and Compliance Officer who leads the effort to promote and monitor a strong ethics and compliance culture throughout the company, including all areas of HESS.\n18\nTo help ensure that we are compliant with legal and regulatory requirements and that these areas of our business operate in an efficient and effective manner, we have taken certain actions including, but not limited to: \n•\nProviding regular health, environmental, safety and security support, training, guidance and information to guests, team members and others working on our behalf \n•\nPerforming regular shoreside and shipboard audits and taking appropriate action when deficiencies are identified \n•\nDeveloping, reviewing, and working to improve policies and procedures designed to prevent, detect, respond and correct various regulatory and other violations \n•\nSupporting a comprehensive HESS incident investigation program that is designed to prevent re-occurrence, promote learning, and support continuous improvement\n2.    \nMaritime Safety Regulations\nThe IMO has safety standards as part of SOLAS. To help ensure guest and crew safety, SOLAS establishes requirements for the following:\n•     Vessel design and structural features\n•     Life-saving and other equipment\n•     Construction and materials\n•     Fire protection and detection\n•     Refurbishment standards\n•     Safe management and operation\n•     Radio communications\n•     Musters\nAll of our crew undergo regular safety training that meets or exceeds all international maritime regulations, including SOLAS requirements, which are periodically revised. Additionally, we have implemented and continue to develop policies and procedures that we believe enhance our commitment to the safety of our guests and crew.\nSOLAS requires implementation of the International Safety Management Code (“ISM Code”), which provides an international standard for the safe management and operation of ships and for pollution prevention. The ISM Code is mandatory for passenger vessel operators. Under the ISM Code, vessel operators are required to: \n•\nDevelop and implement a Safety Management System (“SMS”) that includes, among other things, the adoption of safety and environmental protection policies setting forth instructions and procedures for operating vessels safely and describing procedures for responding to emergencies and protecting the environment. In addition, our SMS includes health and security procedures \n•\nObtain a Document of Compliance (“DOC”) for the vessel operator, as well as a Safety Management Certificate (“SMC”) for each vessel they operate. These documents are issued by the vessel’s Flag State and evidence compliance with the ISM Code and the SMS \n•\nVerify or renew DOCs and SMCs periodically in accordance with the ISM Code\nAll our ships are regularly audited by our various national authorities, and we are required to maintain the relevant certificates of compliance with the ISM Code.\n3.    \nMaritime Security Regulations\nOur ships are subject to numerous security requirements. These requirements include the International Ship and Port Facility Security Code, which is part of SOLAS, the U.S. Maritime Transportation Security Act of 2002, which addresses U.S. port and waterway security and the U.S. Cruise Vessel Security and Safety Act of 2010, which applies to all of our ships that embark or disembark passengers in the U.S. These regulations include requirements as to the following:\n•\nImplementation of specific security measures, including onboard installation of a ship security alert system \n•\nAssessment of vessel security \n•\nEfforts to identify and deter security threats \n•\nTraining, drills and exercises \n•\nSecurity plans that may include guest, vehicle and baggage screening procedures, security patrols, establishment of restricted areas, personnel identification procedures, access control measures and installation of surveillance equipment \n•\nEstablishment of procedures and policies for reporting and managing allegations of crimes\n19\n4.    \nMaritime Environmental Regulations\nWe are subject to numerous international, multi-national, national, state and local environmental laws, regulations and treaties that govern air emissions, waste management, and the storage, handling, use and disposal of hazardous substances such as chemicals, solvents and paints.\nAs a means of managing and improving our environmental performance and compliance, we adhere to standards set by the International Organization for Standardization (“ISO”), an international standard-setting body, which produces worldwide industrial and commercial standards. The environmental management system of our company and ships is certified in accordance with ISO 14001, the environmental management standard that was developed to help organizations manage the environmental impacts of their processes, products and services.\ni.   \nInternational Regulations\nThe principal international convention governing marine pollution prevention and response is MARPOL.\na.    \nPreventing and Minimizing Pollution\n \nMARPOL includes six annexes, four of which are applicable to our cruise ships, containing requirements designed to prevent and minimize both accidental and operational pollution by oil, sewage, garbage and air emissions and the provision of facilities at ports and terminals for the reception of sewage and sets forth specific requirements related to vessel operations, equipment, recordkeeping and reporting that are designed to prevent and minimize pollution. All our ships must carry an International Oil Pollution Prevention Certificate, an International Sewage Pollution Prevention Certificate, an International Air Pollution Prevention Certificate and a Garbage Management Plan. Administrative, civil and criminal penalties may be assessed for violations. The ship’s Flag State issues these certificates, which evidence their compliance with the MARPOL regulations regarding prevention of pollution by oil, sewage, garbage and air emissions. Certain jurisdictions have not adopted all of these MARPOL annexes but have established various national, regional or local laws and regulations that apply to these areas.\nMARPOL requires that discharges of machinery space bilge water pass through pollution prevention equipment that separates oil from the water and monitors the discharged water to ensure that the effluent does not exceed 15 parts per million oil content. Our ships have oily water separators with oil content monitors installed and maintain a record of certain engine room operations in an Oil Record Book. In addition, we have voluntarily installed redundant systems on all our ships that monitor processed bilge water a second time prior to discharge to help ensure that it contains no more than 15 parts per million oil content. This system also provides additional controls to prevent improper bilge water discharges. MARPOL also requires that our ships have Shipboard Oil Pollution Emergency Plans.\nFurthermore, MARPOL addresses air emissions from vessels, establishes requirements for the prevention of air pollution from ships to reduce emissions of sulfur oxides (“SOx”), nitrogen oxides (“NOx”), particulate matter and greenhouse gases (“GHG”) emissions. It also contains restrictions on the use of ozone depleting substances (“ODS”) and requires the recording of ODS use, equipment containing ODS and the emission of ODS.\nb.   \nSulfur Emissions\nThe IMO adopted a global 0.5% sulfur cap for marine fuel which began in January 2020. The EU Parliament and Council also adopted 0.5% sulfur content fuel requirement (the “EU Sulfur Directive”). The options to comply with both the global 0.5% sulfur cap and the EU Sulfur Directive include the installation and use of Advanced Air Quality Systems, or the use of low sulfur or alternative fuels.\nMARPOL addresses air emissions from both auxiliary and main propulsion diesel engines on ships and further specifies requirements for Emission Control Areas (“ECAs”) with stricter limitations on sulfur emissions content in these areas, requiring ships to use fuel with a sulfur content of no more than 0.1%, or to use alternative emission reduction methods, such as Advanced Air Quality Systems.\nWe have Advanced Air Quality Systems on most of our ships, which are aiding in partially mitigating the financial impact from the ECAs and global sulfur requirements. We use Advanced Air Quality Systems wherever possible subject to local laws and regulations. Additionally, Advanced Air Quality Systems used with heavy fuel oil (“HFO”) result in as good or better SOx, NOx and particulate emissions compared to \nmarine gasoil (“MGO”)\n.\n20\nc.   \nGreenhouse Gas Emissions\n \nThe IMO has established technical and operational measures for all ships that are intended to improve energy efficiency and reduce GHG emissions from international shipping. The technical measures apply to the design of new vessels and the operational measures apply to all vessels.\nThe IMO mandates a data collection system (“DCS”) for reporting fuel oil consumption. The DCS requires ships of 5,000 gross tons and above to provide fuel consumption data to their respective Flag State at the end of each calendar year. Flag States validate the data and transfer it to a database and the IMO produces a summary annual report. In January 2023, MARPOL changes in support of the IMO’s GHG emission reduction goals went into effect and include an operational measure called the Carbon Intensity Indicator (“CII”), an annual ship-level CO\n2\n intensity emissions performance measure, and a technical measure called the Energy Efficiency Existing Ship Index (“EEXI”), a one-off measure similar to the Energy Efficiency Design Index (“EEDI”) for newbuilds, that confirms for a specific condition that a ship meets a target CO\n2\n emission intensity. The EEXI has not had a material impact and the impact for CII is uncertain as it remains under review and the enforcement mechanism of the regulation is still to be defined. The IMO’s 2023 Strategy on Reduction of GHG Emissions from Ships (“IMO Strategy”) strives to peak GHG emissions from international shipping as soon as possible and to reach net zero GHG emissions on a well-to-wake basis by or around 2050. The IMO Strategy includes checkpoints in 2030 and 2040 that seek reductions in the absolute GHG emissions from international shipping by at least 20% and 70%, respectively, compared to 2008. It also includes a target of a 40% reduction in CO\n2\n emissions intensity by 2030 compared to 2008. The IMO Strategy includes a range of measures planned for implementation in 2027, including fuel standards and market-based measures that could result in changes to itineraries or increased compliance related costs for which the impact is uncertain and may individually and collectively have a material impact on our profitability.\nd.    \nBallast Water\n \nBallast water is water used to stabilize ships at sea and maintain safe operating conditions throughout a voyage. Ballast water can carry a multitude of marine species. The IMO’s Ballast Water Management Convention governs the discharge of ballast water from ships and requires the installation of ballast water management systems for existing ships. The convention also sets forth requirements for ballast water exchange, record keeping, and maintaining an approved Ballast Water Management Plan. The Convention is designed to regulate the treatment of ballast water prior to discharging overboard in order to avoid the transfer of marine species to new environments, as well as establishing other ballast water management practices for monitoring and environmental protection. \nii.    \nU.S. Federal and State Regulations\nThe Oil Pollution Act of 1990 (“OPA 90”) established a comprehensive federal liability regime, as well as prevention and response requirements, relating to discharges of oil in U.S. waters. The major requirements include demonstrating financial responsibility up to the liability limits set by OPA 90 and having oil spill response plans in place. We have Certificates of Financial Responsibility (“COFR”) that demonstrate our ability to meet the liability limits of OPA 90 and covers releases of hazardous materials. It is possible, however, for our liability limits to be broken, which could expose us to unlimited liability. As OPA 90 expressly allows coastal states to impose liabilities and requirements beyond those imposed under federal law, many U.S. states have enacted laws more stringent than OPA 90. Some of these state laws impose unlimited liability for oil spills and contain more stringent financial responsibility and contingency planning requirements. Most coastal states have also enacted environmental regulations that impose strict liability for removal costs and damages resulting from a discharge of oil or a release of a hazardous substance, similar to OPA 90. \nThe Clean Water Act (“CWA”) provides the U.S. Environmental Protection Agency (“EPA”) with the authority to regulate incidental discharges from commercial vessels, including discharges of ballast water, bilge water, gray water, anti-fouling paints and other substances during normal operations within the U.S. three-mile territorial sea and inland waters. Pursuant to the CWA authority, the U.S. National Pollutant Discharge Elimination System was designed to minimize pollution within U.S. territorial waters. For our affected ships, the incidental discharge requirements are set forth in EPA’s Vessel General Permit (“VGP”) for discharges incidental to the normal operations of vessels. The VGP establishes effluent limits for specific discharges incidental to the normal operation of a vessel, many of which apply to our cruise ships. In addition to the requirements associated with these discharges and more stringent vessel-specific requirements, the VGP includes requirements for inspections, monitoring, reporting and record-keeping. \nThe National Invasive Species Act (“NISA”) gives the U.S. Coast Guard (“USCG”) the authority to establish U.S. ballast water management requirements to prevent the spread of invasive species. Pursuant to NISA, the USCG issued ballast water \n21\nregulations which include requirements for ballast water management (including type-approved ballast water management systems), monitoring, record-keeping and reporting.\nIn 2018, the Vessel Incidental Discharge Act (“VIDA”) was signed into law and was intended to clarify and streamline discharge requirements for the incidental discharges covered by the VGP and USCG ballast water regulations. In October 2024, the EPA published the final rule on the VIDA National Standards of Performance. The VIDA requires the USCG to develop corresponding implementation, compliance and enforcement regulations within two years. Until the USCG regulations are final, effective and enforceable, vessels continue to be subject to the existing discharge requirements established in the VGP and the USCG’s ballast water regulations, as well as any other applicable state and local government requirements.\nThe National Marine Sanctuaries Act provides the National Oceanic and Atmospheric Association with the authority to identify, designate and protect marine areas with special national significance. There are currently 17 National Marine Sanctuaries and two Marine National Monuments in force, some of which are transited through by our ships. Each area is governed by site-specific requirements that prohibit most discharges from ships.\nThe state of Alaska requires permitting for certain discharges from cruise ships in designated Alaskan waters. Further, the state of Alaska requires that certain discharges be reported and monitored to verify compliance with standards and repeat violators of the regulations could be prohibited from operating in Alaskan waters. Environmental regimes in Alaska are more stringent than the U.S. federal requirements with regard to discharges from vessels. The state of California also has environmental requirements significantly more stringent than federal requirements for water discharges and air emissions. \niii.   \nEU and EU Member State Regulations\n \nThe EU has adopted a broad range of substantial environmental measures aimed at improving the quality of the environment. To support the implementation and enforcement of European environmental legislation, the EU has adopted directives on environmental liability and enforcement and a recommendation providing for minimum criteria for environmental inspections. \nThe European Commission’s (“EC”) strategy is to reduce emissions from ships. The EC strategy seeks to implement SOx Emission Control Areas set out in MARPOL, as discussed above via their own Sulfur Directive.\nThe EC has also implemented regulations aimed at reducing GHG emissions from maritime shipping through a Monitoring, Reporting and Verification regulation, which involves collecting emissions data from ships over 5,000 gross tons to monitor and report GHG emissions on all voyages to, from and between European Union ports. \nThe EU adopted a series of significant reforms as a part of its Fit for 55 package to meet its 2030 emissions reduction goal. The main instruments for reducing emissions are the Emissions Trading System (“ETS”), FuelEU Maritime regulation and the Energy Taxation Directive (“ETD”) as well as amendments to the alternative fuels infrastructure and renewable energy directives.\nThe ETS regulates emissions through a “cap and trade” principle, where a cap is set on the total amount of certain emissions that can be emitted. The maritime shipping sector is included in the scope of ETS effective January 2024 and requires ships to procure emission allowances covering 40% of their 2024 emissions inside EU waters to be surrendered in 2025, 70% of 2025 emissions to be surrendered in 2026 and 100% of annual emissions thereafter, to be surrendered in the following year. The 2024 cost of the ETS regulations was $46 million.\nThe FuelEU Maritime regulation, which became effective in January 2025, is a long-term framework designed to reduce maritime emissions by increasing the use of sustainable alternative fuels and, for container and passenger ships (including cruise ships), the use of shore power. The regulation requires compliance with the maximum limits of GHG intensity of energy used on board. The stringency of these limits increases over time, and there are financial penalties for non-compliance. The regulation also includes requirements for ships to connect to shore power when at EU ports. We estimate the 2025 impact of complying with the FuelEU Maritime regulation to be approximately $10 to $15 million.\nThe ETD is a framework for the taxation of energy products and sets minimum rates of excise duty to encourage a low carbon economy. Proposed amendments to the ETD will introduce new tax rates based on the energy content and environmental impact rather than volume. If adopted, these amendments will also widen the directive to include maritime fuels, which were previously exempt. To date, there is no timeline for adoption of these amendments. \nNorway has and is considering additional regulations that supersede IMO requirements for certain air emissions from vessels. For example, all ships operating in the Norwegian World Heritage Fjords (“WHF”) must meet IMO Tier III NOx requirements \n22\nby January 1, 2025. Additionally, Norway has proposed that large ships operating in the WHF may not emit any GHG starting in 2032. Norway is also currently considering a carbon tax on fuel bunkered by international shipping in Norway.\nThe exact impact of the Fit for 55 and the Norwegian WHF regulations are uncertain as elements of the proposals have not yet been finalized and enacted and will depend on future deployments. \n5.    \nMaritime Health Regulations\nWe are committed to providing a healthy environment for all of our guests and crew. We collaborate with public health inspection programs throughout the world, such as the Centers for Disease Control and Prevention (“CDC”) in the U.S. and the SHIPSAN Project in the EU, to ensure that development of these programs leads to enhanced health and hygiene onboard our ships. Through our collaborative efforts, we work with the authorities to develop and revise guidelines, review plans and conduct on-site inspections for all newbuilds and significant ship renovations. We work closely with governments and health authorities around the world to ensure that our health and safety protocols comply with the requirements of each location. In addition, we continue to maintain our ships by meeting, and often exceeding, applicable public health guidelines and requirements, complying with inspections, reporting communicable illnesses and conducting regular crew training and guest education programs.\n6.    \nMaritime Labor Regulations\nThe International Labor Organization develops and oversees international labor standards and includes a broad range of requirements, such as the definition of a seafarer, minimum age of seafarers, medical certificates, recruitment practices, training, repatriation, food, recreational facilities, health and welfare, hours of work and rest, accommodations, wages and entitlements. \nThe STCW, as amended, establishes additional minimum standards relating to training, including security training, certification and watchkeeping for our seafarers.\nb.   \nOther Governmental Regulations\nCompliance with GHG regulations and the associated potential cost is complicated by the fact that various countries and regions are following different approaches to climate-related regulations. \nIn most countries where we source the majority of our guests, we are required to establish financial responsibility, such as obtaining a guarantee from stable financial institutions and insurance companies, to satisfy liability in cases of our non-performance of obligations to our guests. The amount of financial responsibility varies by jurisdiction based on the amount mandated by the applicable local legislation, regulatory agency or association.\nIn Australia and most of Europe, we may be obligated to honor our guests’ cruise payments made by them to their travel agents and tour operators regardless of whether we receive these payments.\nIn addition, the UK plans to include domestic shipping under its national ETS beginning in January 2026. To date, they have proposed that the domestic legs and port calls of ships engaged in international voyages will be included, consultations with stakeholders is ongoing.\nWe are, or may in the future become, subject to other laws and regulations which require our compliance, including those addressing antitrust, anti-money laundering, bribery, corruption, data privacy, human rights, securities and sanctions, reporting on sustainability matters, as well as human resources related matters.\n23\n XIX. \nSustainability\nWe strive to be a desirable workplace and a model global corporate citizen. Our efforts to ensure the safety and well-being of our guests and crew, protect the environment, create opportunities for our workforce, build strong stakeholder relationships and support the communities we operate in and visit, reflect our core values and are key to our success. \nIn 2021, we established goals for 2030 which incorporate six focus areas listed below that align with elements of the United Nation’s Sustainable Development Goals and build on the momentum of our successful achievement of our 2020 sustainability goals. Since then, we have achieved several goals ahead of schedule, accelerated the timeline of others and established intermediate goals. During 2024, we conducted a comprehensive review of our 2030 sustainability goals to align with our ongoing vision and progress. This review included revising existing goals, setting new targets, and retiring goals that have already been achieved. The enhancement of our sustainability road map reflects our adaptive approach to addressing evolving environmental and social challenges, both globally and within the cruise industry.\n•\nClimate Action\n•\nCircular Economy\n•\nGood Health and Well-Being \n•\nSustainable Tourism \n•\nBiodiversity and Conservation\n•\nInclusion and Belonging\nWe voluntarily publish Sustainability Reports that address governance, stakeholder engagement, environmental, labor, human rights, society, product responsibility, economic and other sustainability-related issues and performance indicators. These reports are not incorporated in this document and can be viewed at \nwww.carnivalcorp.com\n, \nwww.carnivalplc.com\n and \nwww.carnivalsustainability.com.\n \nFor further information on our 2030 sustainability goals, refer to our Sustainability Report.\n We have developed a four-part strategy to help us achieve our climate action goals as follows:\n•\nFleet optimization: delivering larger, more efficient ships as part of our ongoing newbuild program, some of which may replace existing ships in our fleet\n•\nEnergy efficiency: continuing to improve our existing fleet’s energy efficiency through investment in projects such as service power packages (or power saver packs), air lubrication systems and expanding shore power capabilities to leverage renewable energy sources while in port, where available\n•\nItinerary efficiency: designing more energy-efficient itineraries, focusing on operational execution and investing in port and destination projects in strategic locations\n•\nNew technologies and alternative fuels: investing in a first-of-its-kind lithium-ion battery storage system and assessing carbon capture and storage. We also support alternative fuels including biofuels such as bio-methane and bio-methanol, as well as synthetic or e-fuels such as e-methane and e-methanol, which we are assessing as future low GHG emission fuel options for our ships\nWe are working to further reduce our absolute GHG emissions. \nWe reduced our absolute GHG emissions from ship fuel by approximately 11% as compared to our peak year of 2011 despite capacity growth of nearly 37% over the same period.\n Additionally, we are pursuing our aspiration of net zero emissions by 2050, aligned with the revised IMO Strate\ngy. Achieving this goal will require energy sources and technologies that do not yet exist at scale. While fossil fuels are currently the only scalable and commercially viable option for our industry, we are closely monitoring technology developments and pioneering important sustainability initiatives in the cruise industry. We have leveraged third party studies and partnered with companies and other organizations to help identify and scale new technologies. For example, we implemented maritime scale battery technology and are working with classification societies and other stakeholders to assess lower GHG emission fuel options for cruise ships and assessing carbon capture and storage technologies. We have successfully used biofuel as a replacement for fossil fuel on 6 ships. The certified biofuels used offer environmental benefits compared to using fossil fuels alone through their lifecycle GHG reductions. These biofuels can be used in existing ship engines without modifications to the engine or fuel infrastructure, including on ships already in service. To provide a path to net zero emissions, alternative low GHG emission fuels will be necessary for the maritime industry; however, there are significant supply and cost challenges that must be resolved before viability is reached. Without clarity on low and zero carbon fuel availability, we are not currently able to make absolute emissions reduction commitments along a prescribed timeline. In our view, a commitment to achieve an absolute greenhouse gas emission reduction pathway without a clear understanding of how this will be achieved is not aligned with our approach to goal setting. While we continue to pursue our aspiration of net zero emissions, our defined goals and targets are set based on feasible, achievable, and available pathways.\n24\nWe continue to implement Service Power Packages (or Power Saver Packs), a comprehensive set of technology upgrades, which will be completed over the next several years across a portion of the fleet. These upgrades include the following elements designed to reduce both fuel usage and GHG emissions while also contributing to cost savings:\n•\nComprehensive upgrades to each ship’s hotel HVAC (heating, ventilation, and air conditioning) systems\n•\nLED lighting systems\n•\nRemote monitoring and optimization of energy usage and performance\nService Power Package (or Power Saver Packs) upgrades are the main part of our ongoing energy efficiency investment program and are expected to further improve energy savings and reduce fuel consumption. Upon completion, these upgrades are expected to deliver approximately 5% fuel savings per ship.\nWe have ten Air Lubrication Systems (“ALS”) operating in our fleet as of November 30, 2024 and have additional installations in progress and planned for the future. ALS cushions the flat bottom of a ship’s hull with air bubbles, which reduces the ship’s frictional resistance and the propulsive power required to drive the ship through the water and generate approximately 5% savings in fuel consumption for propulsion and reductions in GHG emissions on ALS equipped ships when operating in a specific speed range.\nWe have ten LNG powered cruise ships in operation as of November 30, 2024, which represent nearly 20% of our fleet capacity and six more that are expected to join the fleet through 2033.\nWhile LNG is a fossil fuel and generates GHG emissions, its direct CO\n2\n emissions are lower than those of conventional fuels. It emits virtually zero sulfur oxides (only the sulfur in the pilot fuel is present), reduces nitrogen oxides by 85% and cuts particulate matter by 95%-100%. The types of engines that we use experience small amounts of methane slip (un-combusted methane passing through the engine). There are varying views on measuring LNG’s environmental impact and our disclosures report our emissions, including methane slip, as part of our total GHG emissions (reported as CO\n2\ne) using the scientifically accepted 100-year global warming potential (“GWP”) time frame and are measured on a tank-to-wake basis.\nWe are part of the Methane Abatement in Maritime Innovation Initiative, partnering with other major maritime players to find solutions for this challenge, including evaluating options to remove unburnt methane from exhaust streams. The latest generation of LNG-fueled engines show significantly reduced methane slip and we are working with the engine manufacturers to update our existing engines to improve their methane slip performance. As a result of these efforts, LNG’s advantage over conventional fuels in terms of reduced GHG emissions is expected to grow.\nA new ship capable of running on LNG also provides flexibility and future optionality. LNG engines are dual-fuel engines, capable of operating on MGO and LNG, including fossil, biofuel and, when available, synthetic versions of those fuels. The type of tank and system arrangements that we have on our LNG-fueled ships also allows for future conversion to other low GHG fuels such as green methanol. LNG ships are also built with larger fuel tanks, with the space necessary to retrofit for other fuels. Given the expected life of a cruise ship, this provides us with more options to continue to fuel our ships regardless of how the alternative fuel markets develop in the future.\nThe combined impact of the factors above makes LNG the best readily available fuel to reduce GHG emissions in the absence of market-ready zero-emission or near-zero-emission fuels.\nWe pioneered the use of Advanced Air Quality Systems on board our ships to aid in the reduction of sulfur and are promoting the use of shore power. Shore power enables our ships to use shoreside electric power, where available, while in port rather than running their engines to power their onboard services, resulting in reduced engine emissions and noise in port.\n We also pioneered the use of shore power in 2001. More than two-thirds of our ships are equipped with this capability, and that number will increase over time as more ports provide shore power. We have continued our work with several local port authorities to utilize cruise ship shore power connections.\nWe have considered our sustainability goals and efforts, as described above, in connection with the preparation of our consolidated financial statements and any estimates used in the preparation of our consolidated financial statements.\nWe have voluntarily reported our GHG footprint via the CDP each year since 2006. The CDP rates companies on the depth and scope of their disclosures and the quality of their reporting. Our submission includes details of our most recently compiled emissions data and reduction efforts, along with the results of an independent, third-party verification of our GHG emissions. We also disclose our holistic water stewardship to use less, reuse more and clean as well as purify used water to return to nature through the CDP water program.\n25\nCarnival Corporation & plc’s GHG emissions inventory management plan follows the guidance in The Greenhouse Gas Protocol and ISO 14064-1:2018 and our environmental management system is certified in accordance with the ISO 14001:2015 Environmental Management System standard.\nD.   \nWebsite Access to Carnival Corporation & plc SEC Reports\nWe use our websites as channels of distribution of company information. Our Form 10-K, joint Quarterly Reports on Form 10-Q, joint Current Reports on Form 8-K, joint Proxy Statement related to our annual shareholders meeting, Section 16 filings and all amendments to those reports are available free of charge at \nwww.carnivalcorp.com\n and \nwww.carnivalplc.com\n and on the SEC’s website at \nwww.sec.gov\n as soon as reasonably practicable after we have electronically filed or furnished these reports with the SEC. In addition, you may automatically receive email alerts and other information when you enroll your email address by visiting the Investor Services section of our websites. The content of any website referred to in this document is not incorporated by reference into this document. \nE.   \nIndustry and Market Data\nThis document includes market share and industry data and forecasts that we obtained from industry publications, other third-party information and internal company surveys. Industry publications, including those from Cruise Industry News, and surveys and forecasts, generally state that the information contained therein has been obtained from sources believed to be reliable. Cruise Industry News is a for profit magazine company that covers all aspects of cruise operations. Their magazines and annual report cover all cruise lines and shipyards and report on all aspects of cruise operations including relevant issues, financial results, ship building, ship reviews, etc. All other references to third party information are publicly available at nominal or no cost. We use the most currently available industry and market data to support statements as to our market positions. Although we believe that the industry publications and third-party sources are reliable, we have not independently verified any of the data. Similarly, while we believe our internal estimates with respect to our industry are reliable, they have not been verified by any independent sources. While we are not aware of any misstatements regarding any industry data presented herein, our estimates, in particular as they relate to market share and our general expectations, involve risks and uncertainties and are subject to change based on various factors, including those discussed under Part I,",
    "item1a": "Item 1A.  \nRisk Factors\n. \nYou should carefully consider the following discussion of material factors, events and uncertainties that make an investment in the company’s securities risky and provide important information for the understanding of the “forward-looking” statements discussed in this Form 10-K and elsewhere. These risk factors should be read in conjunction with other information in this Form 10-K. \nThe events and consequences discussed in these risk factors could have a material adverse effect on the company’s business, financial condition, operating results and stock price. These risk factors do not identify all risks that the company faces; operations could also be affected by factors, events, or uncertainties that are not presently known to the company or that the company currently does not consider to present material risks to its operations. In addition to the risk factors below, additional or unforeseen effects from our substantial debt balance incurred during the pause of our guest cruise operations could give rise to additional risks or amplify many of the risks discussed below. Some of the statements in this item and elsewhere in this document are “forward-looking statements.” For a discussion of those statements and of other factors to consider see the “Cautionary Note Concerning Factors That May Affect Future Results” section. \nThe ordering and lettering of the risk factors set forth below is not intended to reflect any company indication of priority or likelihood. \nOperational Risk Factors\na.\nEvents and conditions around the world, including geopolitical uncertainty, war and other military actions, pandemics, inflation, higher fuel prices, higher interest rates and other general concerns impacting the ability or desire of people to travel could lead to a decline in demand for cruises as well as have significant negative impacts on our financial condition and operations.\nWe have been, and may continue to be, impacted by the public’s concerns regarding the health, safety and security of travel, including pandemics, government travel advisories and travel restrictions, political instability and civil unrest, terrorist attacks, war and military action and other general concerns. The resulting impacts of these events, including a pause of our guest cruise \n26\noperations, supply chain disruptions, increased fuel prices, impact on demand for cruises to neighboring regions and international sanctions and other measures that have been imposed, have significantly adversely affected, and may in the future significantly adversely affect, our business. These factors may also have the effect of heightening many other risks to our business, any of which could materially and adversely affect our business and results of operations. Additionally, we have been, and may continue to be, impacted by heightened regulations around customs and border control, travel bans to and from certain geographical areas, voluntary changes to our itineraries in light of geopolitical events, government policies increasing the difficulty of travel and limitations on issuing international travel visas. We may be impacted by adverse changes in the perceived or actual economic climate, such as inflation, global or regional recessions, higher unemployment and underemployment rates and declines in income levels.\nb. Incidents concerning our ships, guests or the cruise industry may negatively impact the satisfaction of our guests and crew and lead to reputational damage.\nOur operations involve the risk of incidents and media coverage thereof. Such incidents include, but are not limited to, the improper operation or maintenance of ships, motorcoaches and trains; guest and crew illnesses; mechanical failures, fires and collisions; repair delays, groundings and navigational errors; oil spills and other maritime and environmental issues as well as other incidents at sea, while in port or on land, which have in the past and may in the future generate negative publicity or cause voyage disruptions or changes in itineraries, guest and crew discomfort, injury, or death. Although our commitment to the safety and comfort of our guests and crew is paramount to the success of our business, our ships have been involved in outbreaks, accidents and other incidents in the past and we may experience similar or other incidents in the future. Our ability to attract and retain the loyalty of our guests, our ability to hire and the amounts we must pay our crew depend, in part, upon the perception and reputation of our company and our brands and the public’s concerns regarding the health and safety of travel generally, as well as the cruising industry and our ships specifically. In addition, these and any other events which impact the travel industry more generally may negatively impact our guests’ and/or crew’s ability or desire to travel to or from our ships and/or interrupt the supply of critical goods and services. \nc. Changes in and non-compliance with laws and regulations under which we operate, such as those relating to health, environment, safety and security, data privacy and protection, anti-money laundering, anti-corruption, economic sanctions, trade protection, labor and employment, and tax may be costly and lead to litigation, enforcement actions, fines, penalties and reputational damage.\nWe are subject to numerous international, national, state and local laws, regulations, treaties and other legal requirements that govern health, environmental, safety and security matters in relation to our guests, crew and ships. These requirements change regularly, depending on the itineraries of our ships and the ports and countries visited. Implementing these and any subsequent requirements have been, and may in the future continue to be costly and take time to implement across our global cruise operations. In addition, the accelerating pace of regulatory changes may affect our ability to comply in the future. If we violate or fail to comply with any of these laws, regulations, treaties and other requirements we could be, and have previously been, fined, placed on probation or otherwise sanctioned by regulators. In addition, there is increased global focus on climate change, which may lead to additional regulatory requirements. Refer to Operational Risk Factor “d.” below for additional discussion on climate change regulation risks. \nIn the course of doing business, we collect guest, team member, company and other third-party data, including personal and other sensitive data. We are subject to laws and requirements related to the treatment and protection of personal, sensitive and/or other regulated data in the jurisdictions where we operate. Various governments, agencies and regulatory organizations have enacted or are considering new rules and regulations and we expect to continue to incur costs to comply with these rules and regulations.\nOur operations subject us to potential liability under anti-money laundering and anti-corruption laws and regulations. We may also be affected by economic sanctions, trade protection laws, policies and other regulatory requirements affecting trade and investment. \nWe are subject to compliance with tax laws, regulations and treaties in the jurisdictions in which we are incorporated or operate. These tax laws, regulations and treaties are subject to change at any time, which may result in substantially higher tax expense. For example, the implementation of the OECD’s rules \nwill affect Carnival plc and its subsidiaries beginning in fiscal 2025 and Carnival Corporation and certain of its subsidiaries beginning in fiscal 2026. The application of these rules continues to evolve, and its outcome may alter our tax obligations in certain countries in which we operate. Refer to XVII. Taxation for additional discussion on the OECD’s rules. Other changes in domestic and international tax rules and regulations and their application could also alter our tax obligations.\n27\nd. Factors associated with climate change, including evolving and increasing regulations, increasing global concern about climate change and the shift in climate conscious consumerism and stakeholder scrutiny, and increasing frequency and/or severity of adverse weather conditions could have a material impact on our business.\nGrowing concerns regarding climate change have resulted in increased global regulatory focus on GHG and other emissions which have impacted us and may in the future have material impacts on our business. Refer to XVIII. Governmental Regulations for additional discussion of recent developments related to Maritime Regulations, Greenhouse Gas Emissions and EU Regulations. Fossil fuels are currently the only viable option for our industry and it is not clear when alternative fuels or other technologies will be commercially viable at scale. To provide a path to net zero emissions, alternative low GHG emission fuels will be necessary for the maritime industry; however, there are significant supply challenges that must be resolved before viability is reached. Climate change-related regulatory activity and developments that require us to reduce our emissions, which includes both the EU regulations and IMO Strategy (refer to XVIII. Governmental Regulations), have impacted us and may in the future have a material impact on our business and financial results by requiring us to make capital investments in new equipment or technologies, pay for emission allowances, purchase carbon offset credits, or otherwise incur additional costs or take additional actions related to our emissions. Such activity has impacted and may continue to impact us indirectly by increasing our operating costs, including fuel costs. Regulatory developments may also result in the inability to operate ships that do not meet certain standards, the acceleration of the removal of less fuel-efficient ships from our fleet and impact the resale value of our ships in the future. In addition, regulatory developments may restrict or limit our access to certain destinations and/or countries or impact our freedom to operate. Regulatory efforts, both internationally and in the U.S., are evolving, including the international alignment of such efforts, and we cannot determine what final regulations will be enacted, modified, or reversed or what their ultimate impact on our business will be. \nGrowing recognition among consumers globally of the negative effects of climate change and the impact of GHG and other emissions may lead to material changes in consumer preferences. For instance, our guests may choose a vacation option that they perceive as operating in a manner that is more sustainable for the climate, seek alternative methods of travel, or reduce the amount and frequency of their travel. In addition, some environmental focused groups have and may continue to generate negative publicity regarding the environmental impact of the cruise industry and are advocating for more stringent oversight and regulation of our industry, including of ship emissions while the ship is docked and at sea. At the same time, we may also face negative impacts from consumers who do not support climate-related initiatives or concerns. Environmental scrutiny of our operations and the industry from the investment community, other stakeholders, and the media (including social media) have impacted and may continue to impact how we are perceived, which may have a material impact on our operations and financial results. Certain climate-related actions and investments we make today may not lead us to our intended future emissions related goals or may not be favorably perceived in future years based on continuing evolving regulations and perceptions around effective emissions mitigation strategies and technologies.\nOur cruise ships, hotels, land tours, port and related commercial facilities and shore excursions have been and may continue to be impacted by adverse weather patterns or other natural disasters, such as hurricanes, earthquakes, floods, fires, tornadoes, tsunamis, typhoons and volcanic eruptions. Climate change is expected to increase the frequency and intensity of certain adverse weather patterns, possibly making certain destinations less desirable or impacting our business in other ways. We have been forced to, and in the future may be forced to, alter itineraries or cancel a cruise or a series of cruises or tours due to these or other types of disruptions. The physical climate-related risks to our business include increased hurricane/typhoon intensity and frequency, increases in global temperatures and rising sea levels which may adversely impact our shoreside facilities, our investments in ports or the availability or desirability of ports and destinations in which we operate. These effects may also disrupt the supply of critical goods and services to our facilities and ships. Any of these events could have a material impact on our business and profitability. \ne. Inability to meet or achieve our targets, goals, aspirations, initiatives, and our public statements and disclosures regarding them, including those related to sustainability matters, may expose us to risks that may adversely impact our business.\nWe have developed and will continue to establish targets, goals, aspirations, and other objectives, including those related to sustainability matters (“sustainability objectives”). These statements reflect our current plans and do not constitute a guarantee that they will be achieved. Our efforts to research, establish, accomplish, and accurately report on our sustainability objectives expose us to numerous operational, reputational, financial, legal, and other risks, any of which could have a negative impact on our business. Our ability to achieve any of our stated sustainability objectives, particularly with respect to our environmental emissions aspirations, is subject to numerous factors and conditions, many of which are outside of our control. Examples of such factors include the availability and costs of low- or non-GHG emission energy sources and technology that do not yet exist at scale for our industry, evolving regulatory requirements affecting sustainability standards or disclosures, the availability of future financing and the availability of suppliers that can meet our sustainability standards. \nOur business may face increased scrutiny from our guests, our team members, the investment community, governments, regulators, destinations and other stakeholders that we serve related to our sustainability activities, including the sustainability objectives that we adopt, our methodologies and timelines for pursuing them and our ability to document and support the \n28\nachievement of those objectives, as their expectations for such matters continue to evolve. If our sustainability practices do not meet, are adverse to, or are perceived to fall short of, the expectations of our guests, team members, investors or other stakeholders, demand for cruising, our reputation, our ability to attract or retain team members, and our attractiveness as an investment could be negatively impacted. In addition, governments may restrict or limit our access to ports and destinations for which there is high guest demand. Similarly, our pursuit, or our failure or perceived failure to pursue, meet or fulfill our targets, goals, aspirations, and other objectives (including sustainability objectives) within the timelines we announce, or at all, could have the same negative impacts as well as expose us to government enforcement actions and private litigation. \n f. Cybersecurity incidents and data privacy breaches, as well as disruptions and other damages to our principal offices, information technology operations and system networks and failure to keep pace with developments in technology have adversely impacted and may in the future materially adversely impact our business operations, the satisfaction of our guests and crew and may lead to fines, penalties and reputational damage.\nWe have been and may continue to be impacted by cybersecurity incidents and data privacy breaches, which occur from time to time. These malicious attacks can vary in scope and aim to disrupt or compromise our shoreside and shipboard operations by targeting our key operating systems or those of our third-party service providers. Breach or circumvention of our systems or the systems of third parties, including by ransomware or malware, through vulnerabilities in licensed software or hardware, generative artificial intelligence (“AI”) impersonation, targeted and coordinated attacks of our systems or as a result of other attacks, have led to and may continue to lead to disruptions in our business operations; unauthorized access to (or the loss of company access to) competitively sensitive, confidential or other critical data (including sensitive financial, medical or other personal or business information) or systems; loss of customers; financial losses; regulatory investigations, enforcement actions, fines and penalties; litigation; reputational damage; and misuse or corruption of critical data and proprietary information, any of which could be material. Additionally, integrating AI into our operations may increase our cybersecurity and data privacy risks. We also have and may continue to rely on third parties in helping us manage our cybersecurity risk management processes. Any measures that we take and such third parties take to avoid, detect, mitigate or recover from material cybersecurity threats or incidents can be expensive, and may be insufficient, circumvented, or may become ineffective.\nOur physical work locations, including those that house our information technology operations, system networks and various other remote locations may be impacted by actual or threatened natural disasters (for example, hurricanes, earthquakes, floods, fires, tornadoes, tsunamis and typhoons) or other disruptive events. Our maritime and/or shoreside operations, including our ability to manage our inventory of cabins held for sale and set pricing, control costs and serve our guests, depends on the reliability of our information technology operations and system networks, as well as our ability to refine and update to more advanced systems and technologies. In addition, we may be unable to obtain appropriate technology in a timely manner or at all or we may incur significant costs in doing so. A failure to adopt the appropriate technology, or a failure, disruption or obsolescence in the technology that we do adopt, could have adverse effects on our business.\ng. The loss of key team members, our inability to recruit or retain qualified shoreside and shipboard team members and increased labor costs could have an adverse effect on our business and results of operations.\nOur success depends, in large part, on the skills and contributions of our team members, and on our ability to recruit, develop and retain high quality, diverse team members. We may not be successful in recruiting, developing or retaining key or other highly qualified team members. In addition, high-GHG emission industries may become a less attractive employment opportunity. At times we have, and may in the future continue to, experience difficulty in hiring sufficient qualified team members, due to general macroeconomic factors and/or increasingly competitive labor markets.\nIn addition, we hire a significant number of qualified shipboard team members each year and, thus, our ability to adequately recruit, develop and retain these individuals is important to our success. Incidents involving cruise ships, including disease outbreaks on our ships and increasing demand as a result of the industry’s projected growth could negatively impact our ability to recruit, develop and retain sufficient qualified shipboard team members.\nh. Increases in fuel prices, changes in the types of fuel consumed and availability of fuel supply may adversely impact our scheduled itineraries and costs.\nWe have been and may continue to be impacted by economic, market and political conditions around the world, regulatory requirements including climate-induced regulations, supply disruptions and related infrastructure needs, which make it difficult to predict the future price and availability of fuel. The supply and availability of different fuel types in various markets in which we operate have experienced increased volatility and have led to increased fuel prices and reduced profitability. Future increases in the global price of fuel would increase the cost of our cruise ship operations as well as some of our other expenses, such as crew travel, freight and commodity prices. Increases in airfares, such as those resulting from increases in the price of fuel, have in the past and may in the future increase our guests’ overall vacation costs and reduce demand for cruises, as many of our guests depend on airlines to transport them to or from the airports near the ports where our cruises embark and \n29\ndisembark. Refer to Operational Risk Factor “d.” for additional discussion on the impact of climate change and regulation changes on fuel costs. \ni. We rely on suppliers who are integral to the operations of our businesses. These suppliers and service providers may be unable to deliver on their commitments, which could negatively impact our business.\nWe rely on suppliers to deliver key products and services to the operations of our businesses around the world. Any event impacting a supplier’s ability to deliver quality goods and services at the location and time needed could negatively impact our ability to operate our business. Events impacting our supply chain could be caused by factors beyond the control of our suppliers or us, including labor actions, increased demand, problems in production or distribution and/or disruptions in third-party logistics, information technology or transportation systems. In addition, global events in recent years have resulted in widespread global supply chain disruptions to suppliers including critical supply chain shortages, labor shortages, significant material cost inflation and extended lead times for items that are required for our operations. Any such interruptions to our supply chain could increase our costs and could limit the availability of products critical to our operations.\nj. Fluctuations in foreign currency exchange rates may adversely impact our financial results.\nWe earn revenues, pay expenses, purchase and own assets and incur liabilities in currencies other than the U.S. dollar. Additionally, our shipbuilding contracts are typically denominated in euros. Movements in foreign currency exchange rates, which at times have been more volatile, will affect our financial results.\nk. Overcapacity and competition in the cruise and land-based vacation industry may negatively impact our cruise sales, pricing and destination options.\nWe have been and may in the future be impacted by increases in capacity in the cruise and land-based vacation industry, which may result in capacity growth beyond demand, either globally or for a region, or for a particular itinerary. We face competition from other cruise brands on the basis of overall experience, destinations, types and sizes of ships and cabins, travel agent partner preferences and value. In addition, we may fail to sufficiently invest in or upgrade our existing cruise ships and other assets to meet the expectations of current and potential guests. We also compete with land-based vacation alternatives throughout the world on the basis of overall experience, destinations and value. In addition, certain ports and destinations have faced a surge of both cruise and non-cruise tourism and in certain destinations, countermeasures to limit the number of tourists have been proposed or contemplated and/or put into effect, including limits on cruise ships and cruise guests. Potential restrictions in ports and destinations could limit the itinerary and destination options we can offer our guests going forward.\nl. Inability to implement our shipbuilding programs and ship repairs, maintenance and refurbishments may adversely impact our business operations and the satisfaction of our guests.\nThere are a limited number of shipyards with the capability and capacity to build, repair, maintain and/or upgrade our ships, which may limit our ability to meet our capacity growth or ship refurbishment objectives. In addition, we have in the past and may in the future be impacted by unforeseen events, such as work stoppages, supply chain issues, insolvencies, “force majeure” events or other financial difficulties experienced by shipyards, their subcontractors and our suppliers. This may result in less shipyard availability resulting in delays or preventing the delivery of our ships under construction and/or the completion of the repair, maintenance or refurbishment of our existing ships. This may lead to potential delays or cancellations of cruises. Additionally, the prices of various commodities that are used in the construction of ships and for repair, maintenance and refurbishment of existing ships, such as steel, are subject to volatility which may increase our costs.\nFinancial Risk Factors\na. We require a significant amount of cash to service our debt and sustain our operations. Our ability to generate cash depends on many factors, including those beyond our control, and we may not be able to generate cash required to service our debt and sustain our operations.\nOur ability to meet our debt service obligations, refinance our debt or sustain our business needs and operations depends on our future operating and financial performance and our ability to generate cash. This will be affected by our ability to successfully continue to execute on our business strategy, which if unsuccessful, would negatively impact the occupancy levels and pricing of our cruises. Our future performance is also impacted by general macroeconomic, financial, geopolitical, competitive, regulatory and other factors beyond our control such as inflation, higher fuel prices, higher taxes and higher interest rates. If we cannot generate sufficient cash to meet our debt service obligations or fund our other business needs, we may, among other things, need to refinance our debt, obtain additional financing, delay planned capital expenditures or sell assets. We cannot make assurances that we will be able to generate sufficient cash through any of the foregoing. If we are not able to refinance our \n30\ndebt, obtain additional financing or sell assets on commercially reasonable terms or at all, we may not be able to satisfy our obligations with respect to our debt. Refer to Liquidity, Financial Condition and Capital Resources.\nb. \nOur substantial debt could adversely affect our financial health and operating flexibility.\nWe have a substantial amount of debt, significant debt service obligations and related covenant restrictions. Despite our leverage, we may incur more debt, subject to certain restrictions, in the future. Our substantial debt has had and could continue to have important negative consequences for us. Our substantial debt could, among other things:\n•\nrequire us to dedicate a large portion of our cash flow from operations to servicing debt and funding repayments on our debt, thereby reducing the availability of our cash flow to fund working capital, capital expenditures and other general corporate purposes;\n•\nincrease our vulnerability to adverse general economic or industry conditions;\n•\nlimit our flexibility in planning for, or reacting to, changes in our business or the industry in which we operate;\n•\nlimit our ability to pay dividends or distributions on or redeem or repurchase stock and make other restricted payments;\n•\nplace us at a disadvantage compared to others that have less debt;\n•\nmake us more vulnerable to downturns in our business, the economy or the industry in which we operate;\n•\nlimit our ability to raise additional debt or equity capital in the future to satisfy our requirements relating to working capital, capital expenditures, development projects, strategic initiatives or other purposes; \n•\nrestrict us from introducing new technologies or exploiting business opportunities;\n•\nmake it difficult for us to satisfy our obligations with respect to our debt; and \n•\nexpose us to the risk of increased interest rates as certain of our borrowings are (and may be in the future) at a variable rate of interest.\nCertain of our indebtedness accrues interest at variable rates, which subjects us to interest rate volatility with respect to such instruments and could cause our debt service obligations to increase significantly. If we breach the covenants or restrictions in our debt instruments, we could trigger a default under the terms of certain of our debt instruments. If that occurs, we may be required to seek covenant amendments or the relevant creditors could elect to declare the debt, together with accrued and unpaid interest and other fees, if any, immediately due and payable (or cancel any unfunded commitments, if applicable) and proceed against the collateral, if any, securing that debt. Borrowings under our other debt instruments that contain cross-default provisions may also be accelerated or become payable on demand, and our assets may not be sufficient to repay such indebtedness in full.",
    "item1b": "Item 1B.    \nUnresolved Staff Comments\n.\nNone.",
    "item1c": "Item 1C.    \nCybersecurity\n. \nWith an increasingly technology-driven business landscape, cybersecurity is critical to safeguarding our company's shipboard and shoreside assets and maintaining our operational integrity. We have implemented cybersecurity measures that are designed to protect the confidentiality, integrity and availability of our information technology and operational technology systems against the constantly evolving cyber threats.\nRisk Management\nOur processes to identify and manage cybersecurity risks form part of our overall risk management framework which includes an organization wide, multi-layered approach to risk assessment and management. \nOur cybersecurity risk management program is designed to proactively identify, assess and mitigate potential cybersecurity threats.\n It leverages industry-leading cybersecurity frameworks and standards, such as the National Institute of Standards and Technology (“NIST”) Cybersecurity Framework and the ISO/IEC 27001 standard. We conduct regular risk assessments to evaluate the security posture of our systems and processes, including vulnerability assessments, penetration testing, external attack surface mitigations and monitor our network for suspicious activity and potential breaches. \nWe engage third-party advisory firms to conduct assessments of the maturity of our cybersecurity program, including measures to improve our Payment Card Industry Data Security Standard (“PCI DSS”) compliance, as well as to conduct penetration testing of our shoreside and shipboard assets on a periodic basis.\n We continue to invest in our information technology, operational technology and cybersecurity programs to layer in the right mix of risk-based controls to protect against evolving threats.\n \nWe maintain an incident response plan and related policies and protocols which outline procedures for identifying, reporting and responding to cybersecurity incidents. Our incident response plan is regularly updated to address new threats and tested through crisis simulation exercises involving our shipboard and shoreside employees. We also have an incident response team who is trained to handle a wide range of security events and collaborates with external cybersecurity experts when necessary. \n31\nWe have data privacy and security standards across the company that are designed to comply with relevant regulations, including the General Data Protection Regulation (“GDPR”), the California Consumer Privacy Act (“CCPA”) and PCI DSS. We employ encryption, access controls, and other data anonymization techniques to safeguard data throughout its lifecycle.\nWe also have data privacy and cybersecurity focused training for our shoreside and select shipboard team members. We regularly educate our shoreside and shipboard team members about the importance of handling and protecting guest and team member data, including phishing simulation exercises and annual privacy and security training to enhance awareness of how to detect and respond to cybersecurity threats. \nOur cybersecurity diligence extends to third-party vendors and partners. We have operationalized processes that seek to identify and manage cybersecurity risks from our service providers, including those who have access to our guest or team member data or direct access to our network, systems and applications, with the goal of minimizing our exposure to third party risks. In addition, cybersecurity and data privacy considerations factor greatly in the sourcing, selection and oversight of our third-party service providers. We generally require third-party service providers that access or host our data, systems, or applications or could otherwise introduce cybersecurity risk to us, to complete additional risk assessments, comply with our security and privacy requirements, and agree to the timely reporting of cyber security incidents to us.\nAs of November 30, 2024, we are not aware of any risks from cybersecurity threats that have materially affected or are reasonably likely to materially affect our business strategy, results of our operations, or financial condition. Despite our efforts with respect to protecting information technology operations and strengthening our cybersecurity and data privacy positions, we have been, and may continue to be, impacted by breaches in data security and lapses in data privacy, which occur from time to time. In the last three fiscal years, we have not experienced any material cybersecurity incidents and the expenses incurred in connection with cybersecurity incidents were not material.\n For additional information on the risks from cybersecurity threats and the potential related impacts on the company, refer to Operational Risk Factor f.\n \nGovernance\nOur \nChief Information Security Officer (“CISO”)\n leads our worldwide efforts in cybersecurity risk reduction and regulatory compliance. Our CISO oversees risk management across information technology operations, cybersecurity and data privacy.\n \nWith over 20 years of experience across various industries, including Fortune 50 and 100 organizations, our CISO brings a comprehensive background in strategic cybersecurity leadership and risk management.\n This expertise is further supported by an array of certifications (C-CISO, CISSP, CISM, CRISC, CISA, and CIPT), as well as academic credentials, including a Master’s in Information Systems from Harvard University and a Bachelor’s in Business Administration from Florida International University. \nOur CISO regularly updates executive management and actively engages within the cybersecurity community to stay informed on the latest industry developments.\nOur CISO chairs our Cybersecurity Advisory Council (“CAC”), a cross-functional management committee that drives awareness, ownership and alignment across broad governance and risk stakeholder groups for effective cybersecurity risk management. The CAC is sponsored by our Chief Financial Officer and is composed of senior leaders from our brand information security, data privacy, legal, internal audit and information technology teams. The CAC meets at least quarterly and has responsibility for oversight of our cybersecurity strategic direction, risks and threats, priorities, resource allocation, capabilities and planning. The CISO and her team are informed about and monitor the prevention, detection, mitigation and remediation of cybersecurity incidents in accordance with our cyber incident response plan. Additionally, the CISO informs our Disclosure Committee on a quarterly basis, or more frequently if needed, of any cybersecurity risks or incidents or other information system matters that may affect our business strategy, results of operations or financial condition.\nOur Chief Privacy Officer and Data Protection Officers oversee our focus on the proper processing of personal information in alignment with our privacy policy and applicable privacy laws and regulations.\nThe Audit Committees are responsible for oversight of our risk management with respect to information technology operations and cybersecurity while the Compliance Committees oversee risk management in the area of data privacy and the HESS Committees oversee risk management related to our maritime operational technologies. The Audit Committees receive updates from the CISO on our information technology operations, including cybersecurity developments and risks, three times a year, and our \nBoard of Directors\n receive updates from the CISO on an annual basis.\n \n32"
  }
}