{
  "ticker": "CDNS",
  "cik": "0000813672",
  "company_name": "CADENCE DESIGN SYSTEMS INC",
  "filing_date": "2025-02-21",
  "accession": "0000813672-25-000024",
  "primary_doc": "cdns-20241231.htm",
  "item_sections": {
    "item1": "Item 1, “Business,” under the heading “Product Categories.”\nManagement uses certain performance indicators to manage our business, including revenue, certain elements of operating expenses and cash flow from operations, and we describe these items further below under the headings “Results of Operations” and “Liquidity and Capital Resources.”\nRecent Acquisitions\nConsistent with our Intelligent System Design strategy, during the first quarter of fiscal 2024, we completed our acquisition of Invecas, a leading provider of design engineering, embedded software and system-level solutions. We believe the addition of a skilled engineering team with vast experience in delivering end-to-end system solutions with deep expertise in advanced nodes, mixed-signal, verification, embedded software, packaging and turnkey custom silicon production will enhance our ability to pursue attractive opportunities in the markets we serve. Revenue and cost of revenue associated with contracts assumed with our acquisition of Invecas is primarily classified as services revenue and cost of services in our consolidated income statements.\nDuring the second quarter of fiscal 2024, we completed our acquisition of BETA CAE, a system analysis platform provider of multi-domain, engineering simulation solutions. The acquisition of BETA CAE expands our multiphysics system analysis suite with highly complementary products, enabling us to offer a more comprehensive portfolio to customers in the automotive sector and at companies in the aerospace, industrial and healthcare industries. Revenue associated with contracts assumed with our acquisition of BETA CAE is primarily classified as product and maintenance revenue in our System Design and Analysis product category. Cost of revenue associated with these contracts is primarily classified as cost of product and maintenance in our consolidated income statements.\nMacroeconomic and Geopolitical Environment\nBecause we operate globally, our business is subject to the effects of economic downturns or recessions in the regions in which we do business, volatility in foreign currency exchange rates relative to the U.S. dollar, inflation, changing interest rates, expanded trade control laws and regulations, potential imposition of new or higher tariffs and geopolitical conflicts.\nWe have been impacted by the continued expansion of trade control laws and regulations, including certain export control restrictions concerning advanced node IC production in China, the inclusion of additional Chinese technology companies on the Bureau of Industry and Security “Entity List” and regulations governing the sale of certain technologies. Based on our current assessments, we expect the impact of these expanded trade control laws and regulations on our business to be limited. In addition, President Trump has announced the imposition of broad-based tariffs on imports from many countries, including China and Mexico. We are monitoring the imposition of these new or higher tariffs, including any pauses on the tariffs imposed, and will assess their potential impact on our business either directly, such as on our hardware business, or due to downstream effects.\nWe also continuously monitor geopolitical conflicts around the world, including the ongoing conflict between Russia and Ukraine and conflicts in the Middle East, and assess their impact on our business. To date, these conflicts have not materially limited our ability to develop or support our products and have not had a material impact on our results of operations, financial condition, liquidity or cash flows.\n33\nTable of Contents\nWhile our business model provides some resilience against these factors, we will continue to monitor the direct and indirect impacts of these or similar circumstances on our business and financial results. For additional information on the potential impact of macroeconomic conditions on our business, see Part I,",
    "item1a": "Item 1A, “Risk Factors.” For further discussion regarding our income taxes, see Note 8 in the notes to consolidated financial statements.\nLiquidity and Capital Resources\n \nAs of\nChange\n \nDecember 31,\n2024\nDecember 31,\n2023\n2024 vs. 2023\n \n(In millions)\nCash and cash equivalents\n$\n2,644.0 \n$\n1,008.2 \n$\n1,635.8 \nNet working capital\n2,646.0 \n385.4 \n2,260.6 \nCash and Cash Equivalents\nAs of December 31, 2024, our principal sources of liquidity consisted of $2,644.0 million of cash and cash equivalents as compared to $1,008.2 million as of December 31, 2023.\nOur primary sources of cash and cash equivalents during fiscal 2024 were proceeds from debt, cash generated from operations, proceeds from the issuance of common stock resulting from stock purchases under our employee stock purchase plan and stock options exercised during the year and proceeds from the sale and maturity of investments.\nOur primary uses of cash and cash equivalents during fiscal 2024 were payments related to employee salaries and benefits, operating expenses, payments on debt, cash paid for acquired businesses, repurchases of our common stock, purchases of inventory, payments for income taxes, payment of employee taxes on vesting of restricted stock and purchases of property, plant and equipment.\n Approximately 34% of our cash and cash equivalents was held by our foreign subsidiaries as of December 31, 2024. Our cash and cash equivalents held by our foreign subsidiaries may vary from period to period due to the timing of collections and repatriation of foreign earnings. We expect that current cash and cash equivalent balances and cash flows that are generated from operations and financing activities will be sufficient to meet the needs of our domestic and international operating activities and other capital and liquidity requirements, including acquisitions, investments and share repurchases, for at least the next 12 months and thereafter for the foreseeable future.\nNet Working Capital\nNet working capital is comprised of current assets less current liabilities, as shown on our consolidated balance sheets. Our net working capital varies from period to period due to changes in operating assets and liabilities and the timing of investing and financing activities.\nCash Flows from Operating Activities\nCash flows from operating activities during fiscal 2024 and 2023 were as follows:\n \nChange\n \n2024\n2023\n2024 vs. 2023\n \n(In millions)\nCash provided by operating activities\n$\n1,260.6 \n$\n1,349.2 \n$\n(88.6)\nCash flows provided by operating activities include net income, adjusted for certain non-cash items, as well as changes in the balances of certain assets and liabilities. Our cash flows from operating activities are significantly influenced by business levels and the payment terms set forth in our customer agreements. The decrease in cash flows from operating activities during fiscal 2024, as compared to fiscal 2023, was primarily due to the timing of cash receipts from customers and the timing of cash disbursements for operating assets and liabilities.\n41\nTable of Contents\nCash Flows Used for Investing Activities\nCash flows used for investing activities during fiscal 2024 and 2023 were as follows:\n \nChange\n \n2024\n2023\n2024 vs. 2023\n \n(In millions)\nCash used for investing activities\n$\n(837.1)\n$\n(412.2)\n$\n(424.9)\nCash used for investing activities increased during fiscal 2024, as compared to fiscal 2023, primarily due to increased payments for business combinations and purchases of property, plant and equipment, partially offset by a decrease in cash used for investments in equity and debt securities. We expect to continue our investing activities, including purchasing property, plant and equipment, purchasing intangible assets, acquiring other companies and businesses, and making investments.\nCash Flows Provided by (Used for) Financing Activities\nCash flows provided by (used for) financing activities during fiscal 2024 and 2023 were as follows:\n \nChange\n \n2024\n2023\n2024 vs. 2023\n \n(In millions)\nCash provided by (used for) for financing activities\n$\n1,239.2 \n$\n(803.6)\n$\n2,042.8 \nCash from financing activities increased during fiscal 2024, as compared to fiscal 2023, primarily due to an increase in proceeds from debt, increased proceeds from the issuance of common stock resulting from stock purchases under our employee stock purchase plan and stock options exercised during the period, and a decrease in repurchases of common stock. These factors were partially offset by an increase in payments on debt and payments of employee taxes on vesting of restricted stock.\nOther Factors Affecting Liquidity and Capital Resources\nSenior Notes\nIn September 2024, we issued $2.5 billion aggregate principal amount of senior notes, consisting of $500.0 million aggregate principal amount of 4.200% Senior Notes due 2027 (the “2027 Notes”), $1.0 billion aggregate principal amount of 4.300% Senior Notes due 2029 (the “2029 Notes”) and $1.0 billion aggregate principal amount of 4.700% Senior Notes due 2034 (the “2034 Notes” and together with the 2027 Notes and the 2029 Notes, the “New Notes”). Interest on the New Notes is payable semi-annually in arrears in March and September of each year, beginning in March 2025. As of December 31, 2024, we were in compliance with all covenants associated with the New Notes.\nWe used a portion of the net proceeds of the New Notes issued in September 2024 to fully prepay the outstanding principal and accrued interest of our term loan facility due on September 7, 2025 (the “2025 Term Loan”) and our term loan facility due on May 20, 2026 (the “2026 Term Loan”). In October 2024, we also settled the outstanding principal of $350.0 million and accrued interest on the 4.375% Senior Notes that were due October 15, 2024 (the “2024 Notes”) at maturity.\nRevolving Credit Facility\nIn August 2024, we terminated our existing revolving credit facility, dated June 30, 2021, and amended in September 2022, and entered into a five-year senior unsecured revolving credit facility with a group of lenders led by Bank of America, N.A., as administrative agent (the “2024 Credit Facility”). The 2024 Credit Facility provides for borrowings up to $1.25 billion, with the right to request increased capacity up to an additional $500.0 million upon receipt of lender commitments, for total maximum borrowings of $1.75 billion. The 2024 Credit Facility expires on August 14, 2029. Any outstanding loans drawn under the 2024 Credit Facility are due at maturity on August 14, 2029, subject to an option to extend the maturity date. Outstanding borrowings may be repaid at any time prior to maturity. Interest rates associated with the 2024 Credit Facility are variable, so interest expense is impacted by changes in the interest rates, particularly for periods when there are outstanding borrowings under the revolving credit facility. Interest is payable quarterly. As of December 31, 2024, there were no borrowings outstanding under the 2024 Credit Facility, and we were in compliance with all covenants associated with such credit facility.\nFor additional information relating to our debt arrangements, see Note 5 in the notes to consolidated financial statements.\nStock Repurchase Program\nWe are authorized to repurchase shares of our common stock under a publicly announced program that was most recently increased by our Board of Directors in August 2023. The actual timing and amount of repurchases are subject to business and market conditions, corporate and regulatory requirements, stock price, acquisition opportunities and other factors. Our repurchase authorization does not obligate us to acquire a minimum amount of shares, does not have an expiration date and may be modified, suspended or terminated without prior notice. As of December 31, 2024, approximately $0.8 billion of the share repurchase authorization remained available to repurchase shares of our common stock. See Part II, Item 5, “Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities” for additional information on share repurchases.\n42\nTable of Contents\nOther Liquidity Requirements\nA summary of other capital and liquidity requirements as of December 31, 2024, is as follows:\nTotal\nDue in Less\nThan 1 Year\n(In millions)\nOperating lease obligations\n(1)\n$\n173.6 \n$\n46.2 \nPurchase obligations\n78.3 \n58.9 \nContractual interest payments\n748.0 \n111.0 \nIncome tax payable\n40.4 \n40.4 \nOther long-term contractual obligations \n(2)\n94.5 \n— \nTotal\n$\n1,134.8 \n$\n256.5 \n_________________\n(1)\n Includes future payments under leases that had commenced as of December 31, 2024 as well as leases that had been signed but not yet commenced as of December 31, 2024. \n(2)    \nIncluded in other long-term contractual obligations are long-term income tax liabilities of $55.8 million related to unrecognized tax benefits. The remaining portion of other long-term contractual obligations is primarily liabilities associated with defined benefit retirement plans and acquisitions.\nWe expect that current cash and cash equivalent balances, cash flows that are generated from operations and financing activities will be sufficient to meet the needs of our domestic and international operating activities and other capital and liquidity requirements, including acquisitions, investments and share repurchases, for at least the next 12 months and thereafter for the foreseeable future.\nAs of December 31, 2024, we did not have any significant off-balance sheet arrangements that are reasonably likely to have a material current or future effect on our operating results or financial condition.\nCritical Accounting Estimates\nIn preparing our consolidated financial statements, we make assumptions, judgments and estimates that can have a significant impact on our revenue, operating income and net income, as well as on the value of certain assets and liabilities on our consolidated balance sheets. We base our assumptions, judgments and estimates on historical experience and various other factors that we believe to be reasonable under the circumstances. Actual results could differ materially from these estimates under different assumptions or conditions. At least quarterly, we evaluate our assumptions, judgments and estimates, and make changes as deemed necessary.\nWe believe that the assumptions, judgments and estimates involved in revenue recognition, the accounting for income taxes and business combinations have the greatest potential impact on our consolidated financial statements; therefore, we consider these to be our critical accounting estimates. For information on our significant accounting policies, see Note 2 in the notes to consolidated financial statements.\nRevenue Recognition \nOur contracts with customers often include promises to transfer multiple software and/or IP licenses, hardware and services, including professional services, technical support services, and rights to unspecified updates to a customer. These contracts require us to apply judgment in identifying and evaluating any terms and conditions in contracts which may impact revenue recognition. Determining whether licenses and services are distinct performance obligations that should be accounted for separately, or not distinct and thus accounted for together, requires significant judgment. In some arrangements, such as most of our IP license arrangements and the license of certain software, we have concluded that the licenses and associated services are distinct from each other. In other arrangements, like the majority of our time-based software arrangements, the licenses and certain services are not distinct from each other. These time-based software arrangements include multiple software licenses and updates to the licensed software products, as well as technical support, and we have concluded that these promised goods and services are a single, combined performance obligation.\nJudgment is required to determine the stand-alone selling prices (“SSPs”) for each distinct performance obligation. We rarely license or sell products on a standalone basis, so we are required to estimate the SSP for each performance obligation. In instances where the SSP is not directly observable because we do not sell the license, product or service separately, we determine the SSP using information that may include market conditions and other observable inputs. We typically have more than one SSP for individual performance obligations due to the stratification of those items by classes of customers and circumstances. In these instances, we may use information such as the size of the customer and geographic region of the customer in determining the SSP.\n43\nTable of Contents\nRevenue is recognized over time for our combined performance obligations that include software licenses, updates, and technical support as well as for maintenance and professional services that are separate performance obligations. For our professional services, revenue is recognized over time, generally using costs incurred or hours expended to measure progress. Judgment is required in estimating project status and the costs necessary to complete projects. A number of internal and external factors can affect these estimates, including labor rates, utilization and efficiency variances and specification and testing requirement changes. For our other performance obligations recognized over time, revenue is generally recognized using a time-based measure of progress reflecting generally consistent efforts to satisfy those performance obligations throughout the arrangement term.\nIf a group of agreements are so closely related that they are, in effect, part of a single arrangement, such agreements are deemed to be one arrangement for revenue recognition purposes. We exercise significant judgment to evaluate the relevant facts and circumstances in determining whether the separate agreements should be accounted for separately or as, in substance, a single arrangement. Our judgments about whether a group of contracts comprise a single arrangement can affect the allocation of consideration to the distinct performance obligations, which could have an effect on results of operations for the periods involved.\nWe are required to estimate the total consideration expected to be received from contracts with customers. In some circumstances, the consideration expected to be received is variable based on the specific terms of the contract or based on our expectations of the term of the contract. Generally, we have not experienced significant returns or refunds to customers. These estimates require significant judgment and the change in these estimates could have an effect on our results of operations during the periods involved.\nAccounting for Income Taxes\nWe are subject to income taxes in the United States and numerous foreign jurisdictions. Significant judgment is required in evaluating and estimating our provision for these taxes. There are many transactions that occur during the ordinary course of business for which the ultimate tax determination is uncertain. Our provision for income taxes could be adversely affected by our earnings being lower than anticipated in countries where we have lower statutory rates and higher than anticipated in countries where we have higher statutory rates, losses incurred in jurisdictions for which we are not able to realize the related tax benefit, changes in foreign currency exchange rates, entry into new businesses and geographies and changes to our existing businesses, acquisitions and investments, changes in our deferred tax assets and liabilities including changes in our assessment of valuation allowances, changes in the relevant tax laws or interpretations of these tax laws, and developments in current and future tax examinations. \nWe only recognize the tax benefit of an income tax position if we judge that it is more likely than not that the tax position will be sustained, solely on its technical merits, in a tax audit including resolution of any related appeals or litigation processes. To make this judgment, we must interpret complex and sometimes ambiguous tax laws, regulations and administrative practices. If we judge that an income tax position meets this recognition threshold, then we must measure the amount of the tax benefit to be recognized by estimating the largest amount of tax benefit that has a greater than 50% cumulative probability of being realized upon settlement with a taxing authority that has full knowledge of all of the relevant facts. It is inherently difficult and subjective to estimate such amounts, as this requires us to determine the probability of various possible settlement outcomes. We must reevaluate our income tax positions on a quarterly basis to consider factors such as changes in facts or circumstances, changes in tax law, effectively settled issues under audit, the lapse of applicable statute of limitations, and new audit activity. Such a change in recognition or measurement would result in recognition of a tax benefit or an additional charge to the tax provision. For a more detailed description of our unrecognized tax benefits, see Note 8 in the notes to consolidated financial statements.\nBusiness Combinations\nWhen we acquire businesses, we allocate the purchase price to the acquired tangible assets and assumed liabilities, including deferred revenue, liabilities associated with the fair value of contingent consideration and acquired identifiable intangible assets. Any residual purchase price is recorded as goodwill. The allocation of the purchase price requires us to make significant estimates in determining the fair values of these acquired assets and assumed liabilities, especially with respect to intangible assets and goodwill. These estimates are based on information obtained from management of the acquired companies, our assessment of this information, and historical experience. These estimates can include, but are not limited to, the cash flows that an acquired business is expected to generate in the future, the cash flows that specific assets acquired with that business are expected to generate in the future, the appropriate weighted average cost of capital, and the cost savings expected to be derived from acquiring an asset. These estimates are inherently uncertain and unpredictable, and if different estimates were used, the purchase price for the acquisition could be allocated to the acquired assets and assumed liabilities differently from the allocation that we have made to the acquired assets and assumed liabilities. In addition, unanticipated events and circumstances may occur that may affect the accuracy or validity of such estimates, and if such events occur, we may be required to adjust the value allocated to acquired assets or assumed liabilities.\nWe also make significant judgments and estimates when we assign useful lives to the definite-lived intangible assets identified as part of our acquisitions. These estimates are inherently uncertain and if we used different estimates, the useful life over which we amortize intangible assets would be different. In addition, unanticipated events and circumstances may occur that may impact the useful life assigned to our intangible assets, which would impact our amortization of intangible assets expense and our results of operations.\n44\nTable of Contents\nDuring fiscal 2024, we acquired intangible assets of $366.0 million, primarily through our acquisitions of BETA CAE and Invecas. The fair value of the intangible assets acquired was determined using variations of the income approach that utilizes unobservable inputs classified as Level 3 measurements.\nFor existing technology, the fair value was determined by applying the relief-from-royalty method. This method is based on the application of a royalty rate to forecasted revenue to quantify the benefit of owning the intangible asset rather than paying a royalty for use of the asset. To estimate royalty savings over time, we projected revenue from the acquired existing technology over the estimated remaining life of the technology, including the effect of assumed technological obsolescence, before applying an assumed royalty rate. We assumed technological obsolescence at a rate of 10% annually, before applying an assumed royalty rate of 30% and a discount rate of 10%.\nFor agreements and relationships, the fair value was determined by using the multi-period excess earnings method. This method reflects the present value of the projected cash flows that are expected to be generated from existing customers, less charges representing the contribution of other assets to those cash flows. Projected income from existing customer relationships was determined using customer retention rates between 85% and 92%. The present value of operating cash flows from existing customers was determined using discount rates between 10% and 14%.\nWe believe that our estimates and assumptions related to the fair value of our acquired intangible assets are reasonable, but significant judgment is involved.\nNew Accounting Standards\nFor additional information about the adoption of new accounting standards, see Note 2 in the notes to consolidated financial statements.\nItem 7A. Quantitative and Qualitative Disclosures About Market Risk\nForeign Currency Risk\nA material portion of our revenue, expenses and business activities are transacted in the U.S. dollar. In certain foreign countries where we price our products and services in U.S. dollars, a decrease in value of the local currency relative to the U.S. dollar results in an increase in the prices for our products and services compared to those products of our competitors that are priced in local currency. This could result in our prices being uncompetitive in certain markets.\nIn certain countries where we may invoice customers in the local currency, our revenue benefits from a weaker dollar and is adversely affected by a stronger dollar. The opposite impact occurs in countries where we record expenses in local currencies. In those cases, our costs and expenses benefit from a stronger dollar and are adversely affected by a weaker dollar. The fluctuations in our operating expenses outside the United States resulting from volatility in foreign exchange rates are not generally moderated by corresponding fluctuations in revenue from existing contracts.\nWe enter into foreign currency forward exchange contracts to protect against currency exchange risks associated with existing assets and liabilities. A foreign currency forward exchange contract acts as a hedge by increasing in value when underlying assets decrease in value or underlying liabilities increase in value due to changes in foreign exchange rates. Conversely, a foreign currency forward exchange contract decreases in value when underlying assets increase in value or underlying liabilities decrease in value due to changes in foreign exchange rates. These forward contracts are not designated as accounting hedges, so the unrealized gains and losses are recognized in other income (expense), net, in advance of the actual foreign currency cash flows with the fair value of these forward contracts being recorded as accrued liabilities or other current assets.\nWe do not use forward contracts for trading purposes. Our forward contracts generally have maturities of 90 days or less. We enter into foreign currency forward exchange contracts based on estimated future asset and liability exposures, and the effectiveness of our hedging program depends on our ability to estimate these future asset and liability exposures. Recognized gains and losses with respect to our current hedging activities will ultimately depend on how accurately we are able to match the amount of foreign currency forward exchange contracts with actual underlying asset and liability exposures.\nThe following table provides information about our foreign currency forward exchange contracts as of December 31, 2024. The information is provided in U.S. dollar equivalent amounts. The table presents the notional amounts, at contract exchange rates, and the weighted average contractual foreign currency exchange rates expressed as units of the foreign currency per U.S. dollar, which in some cases may not be the market convention for quoting a particular currency. All of these forward contracts mature during February 2025.\n45\nTable of Contents\nNotional\nPrincipal\nWeighted\nAverage\nContract\nRate\n \n(In millions)\n \nForward Contracts:\nBritish pound\n$\n205.3 \n0.79 \nEuropean union euro\n165.1 \n0.94 \nChinese renminbi\n124.3 \n7.25 \nSwiss franc\n106.2 \n0.89 \nJapanese yen\n101.7 \n154.4 \nIsraeli shekel\n74.9 \n3.69 \nSwedish krona\n52.4 \n10.93 \nIndian rupee\n49.1 \n84.99 \nCanadian dollar\n28.2 \n1.4 \nTaiwan dollar\n14.9 \n32.54 \nSouth Korean Won\n3.4 \n1,399.26 \nSingapore dollar\n2.1 \n1.34 \nTotal\n$\n927.6 \nEstimated fair value\n$\n(7.5)\nAs of December 31, 2023, our foreign currency exchange contracts had an aggregate principal amount of $697.9 million, and an estimated fair value of $9.3 million.\nWe have performed sensitivity analyses as of December 31, 2024, and December 31, 2023, using a modeling technique that measures the change in the fair values arising from a hypothetical 10% change in the value of the U.S. dollar relative to applicable foreign currency exchange rates, with all other variables held constant. The foreign currency exchange rates we used in performing the sensitivity analysis were based on market rates in effect at each respective date. The sensitivity analyses indicated that a hypothetical 10% decrease in the value of the U.S. dollar would result in an increase to the fair value of our foreign currency forward exchange contracts of $18.3 million and a decrease of $18.4 million as of December 31, 2024 and December 31, 2023, respectively, while a hypothetical 10% increase in the value of the U.S. dollar would result in a decrease to the fair value of our foreign currency forward exchange contracts of $12.7 million and an increase of $20.4 million as of December 31, 2024 and December 31, 2023, respectively.\nWe actively monitor our foreign currency risks, but our foreign currency hedging activities may not substantially offset the impact of fluctuations in currency exchange rates on our results of operations, cash flows and financial position.\nInterest Rate Risk\nOur exposure to market risk for changes in interest rates relates primarily to our portfolio of cash, cash equivalents, investments in debt securities and any balances outstanding on our 2024 Credit Facility. We are exposed to interest rate fluctuations in many of the world’s leading industrialized countries, but our interest income and expense is most sensitive to fluctuations in the general level of United States interest rates. In this regard, changes in United States interest rates affect the interest earned on our cash and cash equivalents and the costs associated with foreign currency hedges. All highly liquid securities with a maturity of three months or less at the date of purchase are considered to be cash equivalents. The carrying value of our interest-bearing instruments approximated fair value as of December 31, 2024.\nOur investments in debt securities had a fair value of approximately $50.3 million and $49.8 million as of December 31, 2024 and December 31, 2023, respectively, that may decline in value if market interest rates rise. As of December 31, 2024 and December 31, 2023, an increase in the market rates of interest of 1% would result in a decrease in the fair values of our marketable debt securities by approximately $2.0 million and $2.6 million, respectively.\nInterest rates under our 2024 Credit Facility are variable, so interest expense could be adversely affected by increases in interest rates, particularly for periods when we maintain an outstanding balance. As of December 31, 2024, there were no borrowings outstanding under our 2024 Credit Facility. Our 2025 Term Loan and 2026 Term Loan, which had variable interest rates, were prepaid in full in September 2024.\nInterest rates for our 2024 Credit Facility can fluctuate based on changes in market interest rates and in interest rate margins that vary based on the credit ratings of our unsecured debt. Assuming our 2024 Credit Facility was fully drawn and we were to fully exercise our right to increase borrowing capacity under our 2024 Credit Facility, each quarter point change in interest rates would result in a $4.4 million change in annual interest expense on our indebtedness under our 2024 Credit Facility. For an additional description of the 2024 Credit Facility, see Note 5 in the notes to consolidated financial statements.\n46\nTable of Contents\nEquity Price Risk\nEquity Investments\nWe have a portfolio of equity investments that includes marketable equity securities and non-marketable investments. Our equity investments are made primarily in connection with our strategic investment program. Under our strategic investment program, from time to time, we make cash investments in companies with technologies that are potentially strategically important to us. See Note 14 in the notes to consolidated financial statements for an additional description of these investments.\nItem 8. Financial Statements and Supplementary Data\nThe financial statements required by Item 8 are submitted as a separate section of this Annual Report. See Part IV, Item 15, “Exhibits and Financial Statement Schedules.”\nItem 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.\nItem 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nAs required by Rule 13a-15 of the Securities Exchange Act of 1934, as amended (the “Exchange Act”) under the supervision and with the participation of our management, including our Chief Executive Officer (“CEO”) and our Chief Financial Officer (“CFO”), we evaluated the effectiveness of the design and operation of our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act) as of December 31, 2024.\nBased on their evaluation our CEO and CFO have concluded that, as of December 31, 2024, our disclosure controls and procedures were effective to provide reasonable assurance that the information required to be disclosed by us in our reports filed or submitted under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the SEC’s rules and forms and is accumulated and communicated to our management, including the CEO and CFO, as appropriate to allow timely decisions regarding required disclosure.\nChanges in Internal Control Over Financial Reporting\nThere were no changes in our internal control over financial reporting during the fiscal quarter ended December 31, 2024, that materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nInherent Limitations on Effectiveness of Controls\nOur management, including our CEO and CFO, does not expect that our disclosure controls and procedures or our internal control over financial reporting will prevent or detect all errors and all fraud. Internal control over financial reporting, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of internal control are met. Further, the design of internal control must reflect the fact that there are resource constraints, and the benefits of the control must be considered relative to their costs. While our disclosure controls and procedures and internal control over financial reporting are designed to provide reasonable assurance of their effectiveness, because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within Cadence, have been detected.\nManagement’s Annual Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) under the Exchange Act). Our management assessed the effectiveness of our internal control over financial reporting as of December 31, 2024. In making this assessment, our management used the criteria established in \nInternal Control-Integrated Framework (2013) \nissued by the Committee of Sponsoring Organizations of the Treadway Commission (“COSO”). In accordance with guidance issued by the SEC staff, companies are permitted to exclude acquisitions from their assessment of internal control over financial reporting for a period not to exceed one year from the date of the acquisition. Our assessment of the effectiveness of our internal control over financial reporting as of December 31, 2024 excluded BETA CAE, which we acquired on May 30, 2024. The financial results of BETA CAE, a wholly-owned subsidiary, included in our consolidated financial statements since the date of acquisition constituted less than 2% of total consolidated assets and less than 2% of total consolidated revenue as of and for the year ended December 31, 2024.\nOur management has concluded that, as of December 31, 2024, our internal control over financial reporting is effective based on these criteria. Our independent registered public accounting firm, PricewaterhouseCoopers LLP, has issued an attestation report on our internal control over financial reporting, which is included in Part IV, Item 15, “Exhibits and Financial Statement Schedules.” \n47\nTable of Contents\nItem 9B. Other Information\nInsider Trading Arrangements\nDuring the fiscal quarter ended December 31, 2024, our directors and officers (as defined in Rule 16a-1(f) under the Exchange Act) \nadopted\n or \nterminated\n the contracts, instructions or written plans for the purchase or sale of our securities set forth in the table below.\nType of Trading Arrangement\nName and Position\nAction\nAdoption/ Termination\nDate\nRule 10b5-1*\nTotal Shares of Common Stock to be Sold\nExpiration Date\nIta Brennan\n, \nDirector\nAdoption\n12/12/2024\nX\nUp to \n720\n3/16/2026\n* Contract, instruction or written plan intended to satisfy the affirmative defense conditions of Rule 10b5-1(c) under the Exchange Act.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\n48\nTable of Contents\nPART III.\nItem 10. Directors, Executive Officers and Corporate Governance\nWe have an insider trading policy (the “Securities Trading Policy”) governing the purchase, sale and other dispositions of our securities that applies to all of our personnel, including directors, officers, employees, and other covered persons.\n We also follow procedures for our repurchase of our securities. We believe that our Securities Trading Policy and repurchase procedures are reasonably designed to promote compliance with applicable insider trading laws, rules and regulations, and listing standards. A copy of our Securities Trading Policy is filed as Exhibit 19.1 to this Form 10-K.\nThe information required by Item 10 as to directors is incorporated herein by reference from the sections entitled “Proposal 1 - Election of Directors” and, as applicable, “Security Ownership of Certain Beneficial Owners and Management - Delinquent Section 16(a) Reports” in our definitive proxy statement for our 2025 Annual Meeting of Stockholders. Our executive officers are listed at the end of Item 1 of Part I of this Annual Report.\nThe information required by Item 10 as to Cadence’s code of ethics is incorporated herein by reference from the section entitled “Corporate Governance - Code of Business Conduct” in our definitive proxy statement for our 2025 Annual Meeting of Stockholders.\nThe information required by Item 10 as to the director nomination process and our Audit Committee is incorporated by reference from the section entitled “Board of Directors - Committees of the Board” in our definitive proxy statement for our 2025 Annual Meeting of Stockholders. \nItem 11. Executive Compensation\nThe information required by Item 11 is incorporated herein by reference from the sections entitled “Board of Directors - Components of Director Compensation,” “Board of Directors - Director Compensation for Fiscal 2024,” “Compensation Discussion and Analysis,” “Compensation Committee Report,” “Compensation Committee Interlocks and Insider Participation,” “Compensation of Executive Officers,” “Potential Payments Upon Termination or Change In Control” and “Pay Ratio Disclosure” in our definitive proxy statement for our 2025 Annual Meeting of Stockholders.\nItem 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by Item 12 is incorporated herein by reference from the sections entitled “Security Ownership of Certain Beneficial Owners and Management” and “Equity Compensation Plan Information” in our definitive proxy statement for our 2025 Annual Meeting of Stockholders. \nItem 13. Certain Relationships and Related Transactions and Director Independence\nThe information required by Item 13 is incorporated herein by reference from the sections entitled “Certain Transactions” and “Board of Directors - Director Independence” in our definitive proxy statement for our 2025 Annual Meeting of Stockholders.\nItem 14. Principal Accountant Fees and Services\nThe information required by Item 14 is incorporated herein by reference from the section entitled “Fees Billed to Cadence by the Independent Registered Public Accounting Firm During Fiscal 2024 and 2023” in our definitive proxy statement for our 2025 Annual Meeting of Stockholders.\n49\nTable of Contents\nPART IV.\nItem 15. Exhibits and Financial Statement Schedules\nPage\n (a) 1.  Financial Statements\nReport of Independent Registered Public Accounting Firm\n (Auditor Firm ID \n238\n)\n51\nConsolidated Balance Sheets as of December 31, 2024, and December 31, 2023\n53\nConsolidated Income Statements for the three fiscal years ended December 31, 2024\n54\nConsolidated Statements of Comprehensive Income for the three fiscal years ended December 31, 2024\n55\nConsolidated Statements of Stockholders’ Equity for the three fiscal years ended December 31, 2024\n56\nConsolidated Statements of Cash Flows for the three fiscal years ended December 31, 2024\n57\nNotes to Consolidated Financial Statements\n58\n(a) 2.  Financial Statement Schedules\nAll financial statement schedules are omitted because they are not applicable, not required or the required information is shown in the consolidated financial statements or notes thereto.\n(a) 3.  Exhibits\n96\nThe exhibits listed in the accompanying Exhibit Index are filed or incorporated by reference as part of this Annual Report.\nThe exhibits filed or incorporated by reference as part of this Annual Report contain agreements to which Cadence is a party. These agreements are included to provide information regarding their terms and are not intended to provide any other factual or disclosure information about Cadence or the other parties to the agreements. Certain of the agreements contain representations and warranties by each of the parties to the applicable agreement, and any such representations and warranties have been made solely for the benefit of the other parties to the applicable agreement as of specified dates, may apply materiality standards that are different than those applied by investors, and may be subject to important qualifications and limitations that are not necessarily reflected in the agreement. Accordingly, these representations and warranties may not describe the actual state of affairs as of the date they were made or at any other time and should not be relied upon as statements of factual information.\n_____________\n© 2025 Cadence Design Systems, Inc. All rights reserved worldwide. Cadence, the Cadence logo, and the other Cadence marks found at www.cadence.com/go/trademarks are trademarks or registered trademarks of Cadence Design Systems, Inc. All other trademarks are the property of their respective holders.\n50\nTable of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Stockholders of Cadence Design Systems, Inc.\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Cadence Design Systems, Inc. and its subsidiaries (the “Company”) as of December 31, 2024 and 2023, and the related consolidated statements of income, of comprehensive income, of stockholders’ equity and of cash flows for each of the three years in the period ended December 31, 2024, including the related notes (collectively referred to as the “consolidated financial statements”). We also have audited the Company’s internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control - Integrated Framework\n (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024 in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control - Integrated Framework\n (2013) issued by the COSO.\nBasis for Opinions\nThe Company’s management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in Management’s Annual Report on Internal Control Over Financial Reporting appearing under Item 9A. Our responsibility is to express opinions on the Company’s consolidated financial statements and on the Company’s internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nAs described in Management’s Annual Report on Internal Control Over Financial Reporting, management has excluded BETA CAE Systems International AG (“BETA CAE”) from its assessment of internal control over financial reporting as of December 31, 2024, because it was acquired by the Company in a purchase business combination during 2024. We have also excluded BETA CAE from our audit of internal control over financial reporting. BETA CAE is a wholly-owned subsidiary whose total assets and total revenues excluded from management’s assessment and our audit of internal control over financial reporting represent less than 2% of the related consolidated financial statement amounts as of and for the year ended December 31, 2024.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n51\nTable of Contents\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that (i) relates to accounts or disclosures that are material to the consolidated financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nRevenue Recognition – Identifying and Evaluating Terms and Conditions in Contracts\nAs described in Note 2 and Note 3 to the consolidated financial statements, the Company enters into contracts that can include various combinations of licenses, products, and services, some of which are distinct and are accounted for as separate performance obligations. For contracts with multiple performance obligations, management allocates the transaction price of the contract to each performance obligation and recognizes revenue upon transfer of control of promised products or services to customers. Management applies judgment in identifying and evaluating any terms and conditions in contracts which may impact revenue recognition. For the year ended December 31, 2024, the Company’s total revenue was $4.641 billion.\nThe principal considerations for our determination that performing procedures relating to revenue recognition, specifically the identification and evaluation of terms and conditions in contracts, is a critical audit matter are the significant judgment by management in identifying and evaluating terms and conditions in contracts that impact revenue recognition, which in turn led to a high degree of auditor judgment, subjectivity and effort in performing procedures and evaluating whether terms and conditions in contracts were appropriately identified and evaluated by management.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to the revenue recognition process, including controls related to the identification and evaluation of terms and conditions in contracts that impact revenue recognition. These procedures also included, among others (i) testing management’s process of identifying and evaluating the terms and conditions in contracts, including management’s determination of the impact of those terms and conditions on revenue recognition and (ii) testing the completeness and accuracy of management’s identification and evaluation of the terms and conditions in contracts by examining revenue arrangements on a test basis.\n/s/ \nPricewaterhouseCoopers LLP\nSan Jose, California\nFebruary 20, 2025\nWe have served as the Company’s auditor since 2020.\n52\nTable of Contents\nCADENCE DESIGN SYSTEMS, INC.\n CONSOLIDATED BALANCE SHEETS\nDecember 31, 2024 and December 31, 2023\n(In thousands, except par value)\n \nAs of\nDecember 31,\n2024\nDecember 31,\n2023\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n2,644,030\n \n$\n1,008,152\n \nReceivables, net\n680,460\n \n489,224\n \nInventories\n257,711\n \n181,661\n \nPrepaid expenses and other\n433,878\n \n297,180\n \nTotal current assets\n4,016,079\n \n1,976,217\n \nProperty, plant and equipment, net \n458,200\n \n403,213\n \nGoodwill\n2,378,671\n \n1,535,845\n \nAcquired intangibles, net \n594,734\n \n336,843\n \nDeferred taxes\n982,057\n \n880,001\n \nOther assets\n544,741\n \n537,372\n \nTotal assets\n$\n8,974,482\n \n$\n5,669,491\n \nLIABILITIES AND STOCKHOLDERS’ EQUITY\nCurrent liabilities:\nCurrent portion of long-term debt\n$\n—\n \n$\n349,285\n \nAccounts payable and accrued liabilities\n632,692\n \n576,558\n \nCurrent portion of deferred revenue\n737,413\n \n665,024\n \nTotal current liabilities\n1,370,105\n \n1,590,867\n \nLong-term liabilities:\nLong-term portion of deferred revenue\n115,168\n \n98,931\n \nLong-term debt\n2,476,183\n \n299,771\n \nOther long-term liabilities\n339,448\n \n275,651\n \nTotal long-term liabilities\n2,930,799\n \n674,353\n \nCommitments and contingencies (Notes 8, 17 and 18)\nStockholders’ equity:\nPreferred stock – $\n0.01\n par value; authorized \n400\n shares, \nnone\n issued or outstanding\n—\n \n—\n \nCommon stock – $\n0.01\n par value; authorized \n600,000\n shares; issued and outstanding shares: \n273,851\n and \n271,706\n, respectively\n4,181,737\n \n3,166,964\n \nTreasury stock, at cost; \n57,049\n shares and \n57,453\n shares, respectively\n(\n5,309,579\n)\n(\n4,604,323\n)\nRetained earnings\n5,991,868\n \n4,936,384\n \nAccumulated other comprehensive loss\n(\n190,448\n)\n(\n94,754\n)\nTotal stockholders’ equity\n4,673,578\n \n3,404,271\n \nTotal liabilities and stockholders’ equity\n$\n8,974,482\n \n$\n5,669,491\n \nSee notes to consolidated financial statements.\n53\nTable of Contents\nCADENCE DESIGN SYSTEMS, INC.\nCONSOLIDATED INCOME STATEMENTS\nFor the three fiscal years ended December 31, 2024\n(In thousands, except per share amounts)\n \n \n2024\n2023\n2022\nRevenue:\nProduct and maintenance\n$\n4,213,509\n \n$\n3,834,359\n \n$\n3,340,197\n \nServices\n427,755\n \n255,627\n \n221,521\n \nTotal revenue\n4,641,264\n \n4,089,986\n \n3,561,718\n \nCosts and expenses:\nCost of product and maintenance\n436,600\n \n331,760\n \n273,565\n \nCost of services\n210,902\n \n103,281\n \n98,058\n \nMarketing and sales\n757,483\n \n690,319\n \n604,224\n \nResearch and development\n1,549,093\n \n1,441,796\n \n1,251,544\n \nGeneral and administrative\n282,283\n \n242,430\n \n242,116\n \nAmortization of acquired intangibles\n30,375\n \n18,162\n \n18,470\n \nRestructuring\n23,765\n \n11,013\n \n55\n \nTotal costs and expenses\n3,290,501\n \n2,838,761\n \n2,488,032\n \nIncome from operations\n1,350,763\n \n1,251,225\n \n1,073,686\n \nInterest expense\n(\n75,999\n)\n(\n36,185\n)\n(\n22,934\n)\nOther income (expense), net\n121,055\n \n66,886\n \n(\n5,389\n)\nIncome before provision for income taxes\n1,395,819\n \n1,281,926\n \n1,045,363\n \nProvision for income taxes\n340,335\n \n240,782\n \n196,411\n \nNet income\n$\n1,055,484\n \n$\n1,041,144\n \n$\n848,952\n \nNet income per share – basic\n$\n3.89\n \n$\n3.86\n \n$\n3.13\n \nNet income per share – diluted\n$\n3.85\n \n$\n3.82\n \n$\n3.09\n \nWeighted average common shares outstanding – basic\n271,212\n \n269,381\n \n271,198\n \nWeighted average common shares outstanding – diluted\n273,833\n \n272,748\n \n275,011\n \nSee notes to consolidated financial statements.\n54\nTable of Contents\nCADENCE DESIGN SYSTEMS, INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\nFor the three fiscal years ended December 31, 2024\n(In thousands)\n \n \n2024\n2023\n2022\nNet income\n$\n1,055,484\n \n$\n1,041,144\n \n$\n848,952\n \nOther comprehensive income (loss), net of tax effects:\nForeign currency translation adjustments\n(\n87,933\n)\n(\n4,815\n)\n(\n59,310\n)\nChanges in defined benefit plan liabilities\n(\n239\n)\n1,566\n \n984\n \nUnrealized losses on derivatives designated as hedging instruments\n(\n7,038\n)\n—\n \n—\n \nUnrealized gains (losses) on investments\n(\n484\n)\n132\n \n—\n \nTotal other comprehensive loss, net of tax effects\n(\n95,694\n)\n(\n3,117\n)\n(\n58,326\n)\nComprehensive income\n$\n959,790\n \n$\n1,038,027\n \n$\n790,626\n \nSee notes to consolidated financial statements.\n55\nTable of Contents\nCADENCE DESIGN SYSTEMS, INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY \nFor the three fiscal years ended December 31, 2024\n(In thousands)\nCommon Stock\nPar Value\nAccumulated\nand Capital\nOther\nin Excess\nTreasury\nRetained\nComprehensive\nShares\nof Par\nStock\nEarnings\nIncome (Loss)\nTotal\nBalance, January 1, 2022\n276,796\n \n$\n2,467,701\n \n$\n(\n2,740,003\n)\n$\n3,046,288\n \n$\n(\n33,311\n)\n$\n2,740,675\n \nNet income\n— \n— \n— \n848,952\n \n— \n$\n848,952\n \nOther comprehensive loss, net of taxes \n— \n— \n— \n— \n(\n58,326\n)\n$\n(\n58,326\n)\nPurchase of treasury stock \n(\n6,602\n)\n— \n(\n1,020,091\n)\n— \n— \n$\n(\n1,020,091\n)\nEquity forward contract\n— \n(\n12,035\n)\n(\n17,965\n)\n— \n— \n$\n(\n30,000\n)\nIssuance of common stock and reissuance of treasury stock under equity incentive plans, net of forfeitures\n3,079\n \n56,708\n \n48,620\n \n— \n— \n$\n105,328\n \nStock received for payment of employee taxes on vesting of restricted stock\n(\n598\n)\n(\n17,140\n)\n(\n94,724\n)\n— \n— \n$\n(\n111,864\n)\nStock-based compensation expense\n— \n270,439\n \n— \n— \n— \n$\n270,439\n \nBalance, December 31, 2022\n272,675\n \n$\n2,765,673\n \n$\n(\n3,824,163\n)\n$\n3,895,240\n \n$\n(\n91,637\n)\n$\n2,745,113\n \nNet income\n— \n— \n— \n1,041,144\n \n— \n$\n1,041,144\n \nOther comprehensive loss, net of taxes \n— \n— \n— \n— \n(\n3,117\n)\n$\n(\n3,117\n)\nPurchase of treasury stock, including excise tax\n(\n3,145\n)\n— \n(\n641,041\n)\n— \n— \n$\n(\n641,041\n)\nEquity forward contract\n— \n1,688\n \n(\n61,688\n)\n— \n— \n$\n(\n60,000\n)\nIssuance of common stock and reissuance of treasury stock under equity incentive plans, net of forfeitures\n2,704\n \n97,050\n \n35,907\n \n— \n— \n$\n132,957\n \nStock received for payment of employee taxes on vesting of restricted stock\n(\n528\n)\n(\n23,058\n)\n(\n113,338\n)\n— \n— \n$\n(\n136,396\n)\nStock-based compensation expense\n— \n325,611\n \n— \n— \n— \n$\n325,611\n \nBalance, December 31, 2023\n271,706\n \n$\n3,166,964\n \n$\n(\n4,604,323\n)\n$\n4,936,384\n \n$\n(\n94,754\n)\n$\n3,404,271\n \nNet income\n— \n— \n— \n1,055,484\n \n— \n$\n1,055,484\n \nOther comprehensive loss, net of taxes \n— \n— \n— \n— \n(\n95,694\n)\n$\n(\n95,694\n)\nPurchase of treasury stock\n(\n1,930\n)\n— \n(\n550,026\n)\n— \n— \n$\n(\n550,026\n)\nIssuance of common stock and reissuance of treasury stock under equity incentive plans, net of forfeitures\n3,035\n \n154,233\n \n50,004\n \n— \n— \n$\n204,237\n \nIssuance of common stock in a business combination\n1,741\n \n501,824\n \n— \n— \n— \n$\n501,824\n \nStock received for payment of employee taxes on vesting of restricted stock\n(\n701\n)\n(\n32,503\n)\n(\n205,234\n)\n— \n— \n$\n(\n237,737\n)\nStock-based compensation expense\n— \n391,219\n \n— \n— \n— \n$\n391,219\n \nBalance, December 31, 2024\n273,851\n \n$\n4,181,737\n \n$\n(\n5,309,579\n)\n$\n5,991,868\n \n$\n(\n190,448\n)\n$\n4,673,578\n \nSee notes to consolidated financial statements.\n56\nTable of Contents\nCADENCE DESIGN SYSTEMS, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the three fiscal years ended December 31, 2024\n(In thousands)\n \n2024\n2023\n2022\nCash and cash equivalents at beginning of year\n$\n1,008,152\n \n$\n882,325\n \n$\n1,088,940\n \nCash flows from operating activities:\nNet income\n1,055,484\n \n1,041,144\n \n848,952\n \nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization\n196,935\n \n145,292\n \n132,088\n \nAmortization of debt discount and fees\n3,473\n \n1,262\n \n1,134\n \nStock-based compensation\n391,219\n \n325,611\n \n270,439\n \n(Gain) loss on investments, net\n(\n49,593\n)\n(\n34,602\n)\n5,425\n \nDeferred income taxes\n(\n128,737\n)\n(\n36,512\n)\n(\n107,606\n)\nProvisions for losses on receivables\n2,078\n \n3,325\n \n204\n \nROU asset amortization and change in operating lease liabilities\n(\n1,920\n)\n451\n \n3,342\n \nOther non-cash items\n587\n \n1,983\n \n371\n \nChanges in operating assets and liabilities, net of effect of acquired businesses:\nReceivables\n(\n180,287\n)\n(\n11,748\n)\n(\n138,471\n)\nInventories\n(\n82,771\n)\n(\n65,895\n)\n(\n23,073\n)\nPrepaid expenses and other\n(\n81,529\n)\n39,015\n \n(\n38,927\n)\nOther assets\n11,866\n \n(\n45,784\n)\n(\n933\n)\nAccounts payable and accrued liabilities\n33,676\n \n5,415\n \n113,945\n \nDeferred revenue\n66,478\n \n(\n21,583\n)\n131,462\n \nOther long-term liabilities\n23,592\n \n1,802\n \n43,542\n \nNet cash provided by operating activities\n1,260,551\n \n1,349,176\n \n1,241,894\n \nCash flows from investing activities:\nPurchases of investments\n(\n4,982\n)\n(\n176,170\n)\n(\n1,000\n)\nProceeds from the sale and maturity of investments\n47,980\n \n64,775\n \n366\n \nPurchases of property, plant and equipment\n(\n142,542\n)\n(\n102,337\n)\n(\n123,215\n)\nPurchases of intangible assets\n—\n \n(\n166\n)\n(\n1,000\n)\nCash paid in business combinations, net of cash acquired\n(\n737,574\n)\n(\n198,351\n)\n(\n613,785\n)\nNet cash used for investing activities\n(\n837,118\n)\n(\n412,249\n)\n(\n738,634\n)\nCash flows from financing activities:\nProceeds from revolving credit facility\n—\n \n50,000\n \n585,000\n \nPayments on revolving credit facility\n—\n \n(\n150,000\n)\n(\n485,000\n)\nProceeds from the issuance of debt\n3,196,595\n \n—\n \n300,000\n \nPayments of debt\n(\n1,350,000\n)\n—\n \n—\n \nPayments of debt issuance costs\n(\n23,828\n)\n—\n \n(\n425\n)\nProceeds from issuance of common stock\n204,237\n \n132,957\n \n105,331\n \nStock received for payment of employee taxes on vesting of restricted stock\n(\n237,737\n)\n(\n136,396\n)\n(\n111,864\n)\nPayments for repurchases of common stock\n(\n550,026\n)\n(\n700,134\n)\n(\n1,050,091\n)\nNet cash provided by (used for) financing activities\n1,239,241\n \n(\n803,573\n)\n(\n657,049\n)\nEffect of exchange rate changes on cash and cash equivalents\n(\n26,796\n)\n(\n7,527\n)\n(\n52,826\n)\nIncrease (decrease) in cash and cash equivalents\n1,635,878\n \n125,827\n \n(\n206,615\n)\nCash and cash equivalents at end of year\n$\n2,644,030\n \n$\n1,008,152\n \n$\n882,325\n \nSupplemental cash flow information:\nCash paid for interest\n$\n43,219\n \n$\n34,934\n \n$\n21,122\n \nCash paid for income taxes, net\n509,979\n \n253,700\n \n233,235\n \nSee notes to consolidated financial statements.\n57\nTable of Contents\nCADENCE DESIGN SYSTEMS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the three fiscal years ended December 31, 2024\nNOTE 1. \nBUSINESS OVERVIEW\nCadence\n®\n is a global market leader that develops computational, AI-driven software, accelerated hardware, and IP solutions for engineers and scientists to create new and innovative products to life. The world’s most innovative technology companies use Cadence solutions and services to deliver transformational products to multiple industries that drive the global economy. The products these companies develop are some of the most complex systems in the world. Since its inception, Cadence has been at the forefront of technology innovation with its customers, helping them solve their most complex challenges in the semiconductor and electronic systems industries to unlock limitless opportunities.\n \nNOTE 2. \nSUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nPrinciples of Consolidation and Basis of Presentation\nThe consolidated financial statements include the accounts of Cadence and its subsidiaries after elimination of intercompany accounts and transactions. All consolidated subsidiaries are wholly owned by Cadence. Certain prior year information has been reclassified to conform to the current year presentation.\nHistorically, Cadence’s fiscal years were 52- or 53-week periods ending on the Saturday closest to December 31. During fiscal 2022, Cadence’s Board of Directors approved a change in its fiscal year end from the Saturday closest to December 31 of each year to December 31 of each year. The fiscal year change became effective beginning with Cadence’s 2023 fiscal year, which began on January 1, 2023. Fiscal year 2022, which is included in this report for comparative purposes, represents a 52-week period. \nCadence’s first three fiscal quarters end on March 31, June 30, and September 30.\n \nUse of Estimates\nPreparation of the consolidated financial statements in conformity with United States generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenue and expenses during the reporting period. Actual results could differ from those estimates.\nRecently Adopted Accounting Standards\nSegment Reporting \nIn November 2023. the Financial Accounting Standards Board (“FASB”), issued Accounting Standards Update (“ASU”) No. 2023-07, “Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures,” intended to improve reportable segment disclosure requirements, primarily through enhanced annual and interim disclosures about significant segment expenses. Cadence adopted this ASU retrospectively during fiscal 2024. See Note 21 in the notes to the consolidated financial statements for further details.\nNew Accounting Standards Not Yet Adopted\nIncome Taxes\nIn December 2023, the FASB issued ASU No. 2023-09, “Income Taxes (Topic 740): Improvements to Income Tax Disclosures,” which requires disclosure of disaggregated income taxes paid, prescribes standard categories for the components of the effective tax rate reconciliation, and modifies other income tax-related disclosures. This standard is effective for fiscal years beginning after December 15, 2024, and may be applied on a retrospective or prospective basis. Cadence is currently evaluating the impact of adopting this ASU on its consolidated financial statements and disclosure\ns.\nIncome Statement - Expense Disaggregation Disclosure\nIn November 2024, the FASB issued ASU No. 2024-03, “Income Statement—Reporting Comprehensive Income—Expense Disaggregation Disclosures,” which requires additional disclosure of certain costs and expenses in the notes to the financial statements. The updated standard is effective for fiscal years beginning after December 15, 2026 and interim periods beginning after December 15, 2027. Early adoption is permitted and will be applied prospectively with the option for retrospective application. Cadence is currently evaluating the impact of adopting this ASU on its consolidated financial statements and disclosure\ns.\n58\nTable of Contents\nForeign Operations\nCadence transacts business in various foreign currencies. The United States dollar is the functional currency of Cadence’s consolidated entities operating in the United States and certain of its consolidated subsidiaries operating outside the United States. The functional currency for Cadence’s other consolidated entities operating outside of the United States is generally the country’s local currency. \nCadence translates the financial statements of consolidated entities whose functional currency is not the United States dollar into United States dollars. Cadence translates assets and liabilities at the exchange rate in effect as of the financial statement date and translates income statement accounts using an average exchange rate for the period. Cadence includes adjustments from translating assets and liabilities into United States dollars, and the effect of exchange rate changes on intercompany transactions of a long-term investment nature in stockholders’ equity as a component of accumulated other comprehensive income. Cadence reports gains and losses from foreign exchange rate changes related to intercompany receivables and payables that are not of a long-term investment nature, as well as gains and losses from foreign currency transactions of a monetary nature in other income (expense), net, in the consolidated income statements.\n \nConcentrations of Credit Risk\nFinancial instruments, including derivative financial instruments, that may potentially subject Cadence to concentrations of credit risk, consist principally of cash and cash equivalents, accounts receivable, investments and forward contracts. Credit exposure related to Cadence’s foreign currency forward contracts is limited to the realized and unrealized gains on these contracts.\n \nCash and Cash Equivalents\nCadence considers all highly liquid investments with original maturities of three months or less on the date of purchase to be cash equivalents.\nReceivables \nCadence’s receivables, net includes invoiced accounts receivable and the current portion of unbilled receivables. Unbilled receivables represent amounts Cadence has recorded as revenue for which payments from a customer are due over time and Cadence has an unconditional right to the payment. Cadence’s accounts receivable and unbilled receivables were initially recorded at the transaction value. Cadence’s long-term receivables balance includes receivable balances to be invoiced more than one year after each balance sheet date.\n \nAllowances for Doubtful Accounts \nCadence assesses its ability to collect outstanding receivables and provides customer-specific allowances, allowances for credit losses and general allowances for the portion of its receivables that are estimated to be uncollectible. The allowances are based on the current creditworthiness of its customers, historical experience, expected credit losses, changes in customer demand and the overall economic climate in the industries that Cadence serves. Provisions for these allowances are recorded in general and administrative expense in Cadence’s consolidated income statements.\nInventories\nInventories are computed at standard costs which approximate actual costs and are valued at the lower of cost or net realizable value based on the first-in, first-out method. Cadence’s inventories include high technology parts and components for complex accelerated hardware systems. These parts and components are specialized in nature and may be subject to rapid technological obsolescence. While Cadence has programs to manage the required inventories on hand and considers technological obsolescence when estimating required reserves to reduce recorded amounts to market values, it is reasonably possible that such estimates could change in the near term.\n \nCadence’s policy is to reserve for inventory in excess of future demand forecasts or for other known obsolescence or realization issues. Provisions for obsolescence reserves are recorded as a component of cost of product and maintenance in Cadence’s consolidated income statements.\n \nProperty, Plant and Equipment\nProperty, plant and equipment is stated at historical cost. \nDepreciation and amortization are generally provided over the estimated useful lives, using the straight-line method, as follows:\nEquipment and internal-use software\n2\n-\n7\n years\nBuildings\n25\n-\n32\n years\nLeasehold improvements\nShorter of the lease term or the estimated useful life\nBuilding improvements and land improvements\nUp to \n32\n years\nFurniture and fixtures\n3\n-\n5\n years\n59\nTable of Contents\nCadence capitalizes certain costs of software developed for internal use. Capitalization of software developed for internal use begins at the application development phase of the project. Amortization begins when the computer software is substantially complete and ready for its intended use. Amortization is recorded on a straight-line basis over the estimated useful life.\n Capitalized costs were not material during fiscal 2024, 2023 or 2022.\nCadence recorded depreciation and amortization expense of $\n96.9\n million, $\n78.4\n million and $\n69.1\n million during fiscal 2024, 2023 and 2022, respectively, for property, plant and equipment.\nSoftware Development Costs\nSoftware development costs are capitalized beginning when a product’s technological feasibility has been established by completion of a working model of the product and amortization begins when a product is available for general release to customers. The period between the achievement of technological feasibility and the general release of Cadence’s products has typically been of short duration. Costs incurred during fiscal 2024, 2023 and 2022 were not material.\n \nDeferred Sales Commissions\nCadence records an asset for the incremental costs of obtaining a contract with a customer, including direct sales commissions that are earned upon execution of the contract. Cadence uses the portfolio method to recognize the amortization expense related to these capitalized costs related to initial contracts and renewals and such expense is recognized over a period associated with the revenue of the related portfolio, which is generally two to three years for Cadence’s software arrangements and upon delivery for its hardware and IP arrangements. Incremental costs related to initial contracts and renewals are amortized over the period of the arrangement in each case because Cadence pays the same commission rate for both new contracts and renewals. Deferred sales commissions are tested for impairment on an ongoing basis when events or changes in circumstances indicate that the carrying amount may not be recoverable. An impairment is recognized to the extent that the amount of deferred sales commission exceeds the remaining expected gross margin (remaining revenue less remaining direct costs) on the goods and services to which the deferred sales commission relates. Total capitalized costs were $\n51.9\n million and $\n47.6\n million as of December 31, 2024, and December 31, 2023, respectively, and are included in other assets in Cadence’s consolidated balance sheet. Amortization of these assets was $\n47.6\n million, $\n41.4\n million and $\n40.5\n million during fiscal 2024, 2023 and 2022, respectively, and is included in sales and marketing expense in Cadence’s consolidated income statement.\nGoodwill\nCadence conducts a goodwill impairment analysis annually and as necessary if changes in facts and circumstances indicate that the fair value of Cadence’s single reporting unit may be less than its carrying amount. To assess for impairment, Cadence compares the estimated fair value of its single reporting unit to the carrying value of the reporting unit’s net assets, including goodwill. If the fair value of the reporting unit is greater than the carrying value of its net assets, goodwill is not considered to be impaired, and no further analysis is required. If the fair value of the reporting unit is less than the carrying value of its net assets, Cadence would be required to record an impairment charge.\n \nLong-Lived Assets, Including Acquired Intangibles\nCadence’s long-lived assets consist of property, plant and equipment, and acquired intangibles. Acquired intangibles consist of acquired technology, certain contract rights, customer relationships, trademarks and trade names, capitalized software, and in-process research and development. These acquired intangibles are acquired through business combinations or direct purchases. Acquired intangibles with definite lives are amortized on a straight-line basis over the estimated economic life of the underlying products and technologies, which range from \none year\n to \nfifteen years\n. Acquired intangibles with indefinite lives, or in-process technology, consists of projects that had not reached technological feasibility by the date of acquisition. Upon completion of the project, the assets are amortized over their estimated useful lives. If the project is abandoned rather than completed, the asset is written off. In-process technology is tested for impairment annually and as necessary if changes in facts and circumstances indicate that the assets might be impaired.\nCadence reviews its long-lived assets, including acquired intangibles, for impairment whenever events or changes in circumstances indicate that the carrying amount of a long-lived asset or asset group may not be recoverable. Recoverability of an asset or asset group is measured by comparison of its carrying amount to the expected future undiscounted cash flows that the asset or asset group is expected to generate. If it is determined that the carrying amount of an asset group is not recoverable, an impairment loss is recorded in the amount by which the carrying amount of the asset or asset group exceeds its fair value.\nLeases\nLessee Considerations\nCadence has operating leases primarily consisting of facilities with remaining lease terms of approximately \none year\n to \nfourteen years\n. Cadence has options to terminate many of its leases early. The lease term represents the period up to the early termination date unless it is reasonably certain that Cadence will not exercise the early termination option. For certain leases, Cadence has options to extend the lease term for additional periods ranging from \none year\n to \nten years\n. Renewal options are not considered in the remaining lease term unless it is reasonably certain that Cadence will exercise such options. \n60\nTable of Contents\nAt inception of a contract, Cadence determines an arrangement contains a lease if the arrangement conveys the right to use an identified asset and Cadence obtains substantially all of the economic benefits from the asset and has the ability to direct the use of the asset. Leases with an initial term of twelve months or less are not recorded on the balance sheet. For lease agreements entered into or reassessed after the adoption of Topic 842, Cadence combines the lease and non-lease components in determining the lease liabilities and right-of-use (“ROU”) assets. Non-lease components primarily include common-area maintenance and other management fees.\nOperating lease expense is generally recognized evenly over the term of the lease. Payments under Cadence’s lease agreements are primarily fixed; however, certain agreements contain rental payments that are adjusted periodically based on changes in consumer price and other indices. Changes to payments resulting from changes in indices are expensed as incurred and not included in the measurement of lease liabilities and ROU assets. Cadence’s lease agreements do not provide an implicit borrowing rate, therefore an internal incremental borrowing rate is determined based on information available at lease commencement date for purposes of determining the present value of lease payments. The incremental borrowing rate represents a comparable rate to borrow on a collateralized basis over a similar term and in the economic environment where the leased asset is located.\nLessor Considerations \nAlthough most of Cadence’s revenue from its hardware business comes from sales of hardware, Cadence also leases its hardware products to some customers. Cadence determines the existence of a lease when the customer controls the use of the identified hardware for a period of time defined in the lease agreement. \nCadence’s leases range in duration up to \nthree years\n with payments generally collected in equal quarterly installments. Cadence’s leases do not include termination rights or variable pricing and typically do not include purchase rights at the end of the lease. Short-term leases are usually less than two years and are classified as operating leases with revenue recognized and depreciation expensed on a straight-line basis over the term of the lease. Long-term leases are typically for \nthree years\n and are classified as sales-type leases with revenue and cost of sales recognized upon installation.\nCadence’s operating leases and sales-type leases contain both lease and non-lease components. Because the pattern of revenue recognition is the same for both the lease and non-lease components in Cadence’s operating leases, Cadence has elected the practical expedient to not separate lease and related non-lease components and accounts for both components under Topic 842. Cadence allocates value to the lease and non-lease components in its sales-type leases using standalone selling prices (“SSPs”) similar to those used under ASU 2014-09, “Revenue from Contracts with Customers (Topic 606),” the current accounting standard governing revenue recognition. When Cadence leases its hardware in the same arrangement as software or IP, Cadence allocates value to each performance obligation using SSPs.\n \nInvestments in Equity Securities\nCadence’s investments in marketable equity securities are carried at fair value as a component of prepaid expenses and other in the consolidated balance sheets. Cadence records realized and unrealized holding gains or losses as part of other income (expense), net in the consolidated income statements.\nCadence’s non-marketable investments include its investments in privately held companies. These investments are initially recorded at cost and are included in other assets in the consolidated balance sheets. Cadence accounts for these investments using the measurement alternative when the fair value of the investment is not readily determinable, and Cadence does not have the ability to exercise significant influence, or the equity method of accounting when it is determined that Cadence has the ability to exercise significant influence. For investments accounted for using the equity method of accounting, Cadence records its proportionate share of the\n \ninvestee’s income or loss, net of the effects of any basis differences, to other income (expense), net on a one-quarter lag in Cadence’s consolidated income statements.\nCadence reviews its non-marketable investments for impairment on a regular basis by considering investee financial performance and other information received from the investee companies that indicates a decline in value has occurred. For non-marketable equity investments accounted for using the measurement alternative, the carrying amount may also be adjusted based on observable price changes from orderly transactions for identical or similar investments of the same issuer. Adjustments to the carrying amounts of non-marketable investments are recorded in other income (expense), net in the consolidated income statements. There were no material events or circumstances impacting the carrying amount of our non-marketable investments during the periods presented.\n \nInvestments in Debt Securities\nCadence’s investments in debt securities are comprised of investments in mortgage-backed and asset backed-securities and are carried at fair value as a component of prepaid expenses and other in the consolidated balance sheets. Cadence classifies its investment in debt securities as available-for-sale, and gross unrealized gains and losses are recorded as a component of accumulated other comprehensive loss on its consolidated balance sheets.\n61\nTable of Contents\nCadence assesses its portfolio of debt securities for impairment at least quarterly. Cadence records an allowance for credit losses on debt securities when the fair value of a debt security is below its amortized cost, and it is more likely than not that Cadence will either sell the impaired security before recovery of its amortized basis or has the intention to sell the security. Provisions for credit losses on impaired debt securities are recorded as a component of other income (expense), net in the consolidated income statements.\nDerivative Financial Instruments\nCadence enters into foreign currency forward exchange contracts with financial institutions to protect against currency exchange risks associated with existing assets and liabilities. A foreign currency forward exchange contract acts as a hedge by increasing in value when underlying assets decrease in value or underlying liabilities increase in value due to changes in foreign exchange rates. Conversely, a foreign currency forward exchange contract decreases in value when underlying assets increase in value or underlying liabilities decrease in value due to changes in foreign exchange rates. The forward contracts are not designated as accounting hedges and, therefore, the unrealized gains and losses are recognized in other income (expense), net, in advance of the actual foreign currency cash flows. The fair value of these forward contracts is recorded in accrued liabilities or in other current assets. These forward contracts generally have maturities of \n90\n days or less.\n \nNonqualified Deferred Compensation Trust\nExecutive officers, senior management and members of Cadence’s Board of Directors may elect to defer compensation payable to them under Cadence’s Nonqualified Deferred Compensation Plan (“NQDC”). Deferred compensation payments are held in investment accounts and the values of the accounts are adjusted each quarter based on the fair value of the investments held in the NQDC. \nThe selected investments held in the NQDC accounts are carried at fair value, with the unrealized gains and losses recognized in the consolidated income statements as other income (expense), net. These securities are classified in other assets in the consolidated balance sheets because they are not available for Cadence’s use in its operations. \nCadence’s obligation with respect to the NQDC trust is recorded in other long-term liabilities on the consolidated balance sheets. Increases and decreases in the NQDC trust liability are recorded as compensation expense in the consolidated income statements.\nTreasury Stock\nCadence generally issues shares related to its stock-based compensation plans from shares held in treasury. When treasury stock is reissued at an amount higher than its cost, the difference is recorded as a component of capital in excess of par in the consolidated statements of stockholders’ equity. When treasury stock is reissued at an amount lower than its cost, the difference is recorded as a component of capital in excess of par to the extent that gains exist to offset the losses. If there are no accumulated treasury stock gains in capital in excess of par, the losses upon reissuance of treasury stock are recorded as a component of retained earnings in the consolidated statements of stockholders’ equity. There were \nno\n losses recorded as a component of retained earnings by Cadence on the reissuance of treasury stock during fiscal 2024, 2023 or 2022.\nThe Inflation Reduction Act of 2022, which was enacted into law on August 16, 2022, imposed a nondeductible 1% excise tax on the net value of certain stock repurchases made after December 31, 2022. Cadence did not incur any excise tax on the net value of stock repurchases during fiscal 2024. During fiscal 2023, Cadence recorded excise tax of $\n0.9\n million as a component of treasury stock to account for the incremental cost of the shares repurchased.\n \nRevenue Recognition \nRevenue is recognized upon transfer of control of promised products or services to customers in an amount that reflects the consideration to which Cadence expects to be entitled in exchange for promised goods or services. Cadence’s performance obligations are satisfied either over time or at a point in time.\nProduct and maintenance revenue includes Cadence’s licenses of software and IP, sales of emulation hardware and the related maintenance on these licenses and sales.\nServices revenue includes revenue received for performing engineering services (which are generally not related to the functionality of other licensed products), customized IP on a fixed fee basis, and sales from cloud-based solutions that provide customers with software, hardware and services over a period of time.\nCadence enters into contracts that can include various combinations of licenses, products and services, some of which are distinct and are accounted for as separate performance obligations. For contracts with multiple performance obligations, Cadence allocates the transaction price of the contract to each performance obligation, generally on a relative basis using its SSP. Cadence generates revenue from contracts with customers and applies judgment in identifying and evaluating any terms and conditions in contracts which may impact revenue recognition. Revenue is recognized net of any taxes collected from customers that are subsequently remitted to governmental authorities.\n62\nTable of Contents\nSome customers enter into non-cancelable commitments whereby the customer commits to a fixed dollar amount over a specified period of time that can be used to purchase from a list of products or services. These arrangements do not meet the definition of a revenue contract until the customer executes a separate selection form to identify the products and services that they are purchasing. Each separate selection form under the arrangement is treated as an individual contract and accounted for based on the respective performance obligations. Cadence records a customer deposit liability for amounts received from customers prior to the arrangement meeting the definition of a revenue contract.\nSoftware Revenue Recognition\nCadence’s time-based license arrangements grant customers the right to access and use all of the licensed products at the outset of an arrangement and updates are generally made available throughout the entire term of the arrangement, which is generally two to three years. Cadence’s updates provide continued access to evolving technology as customers’ designs migrate to more advanced nodes and as its customers’ technological requirements evolve. In addition, certain time-based license arrangements include remix rights and unspecified additional products that become commercially available during the term of the agreement. Payments are generally received in equal or near equal installments over the term of the agreement.\nMultiple software licenses, related updates, and technical support in these time-based arrangements constitute a single, combined performance obligation and revenue is recognized over the term of the license, commencing upon the later of the effective date of the arrangement or transfer of the software license. Remix rights are not an additional promised good or service in the contract, and where unspecified additional software product rights are part of the contract with the customer, such rights are accounted for as part of the single performance obligation that includes the licenses, updates, and technical support because such rights are provided for the same period of time and have the same time-based pattern of transfer to the customer.\nFor certain software arrangements where the updates are not critical to maintaining the utility of the software, Cadence considers the license, related updates and technical support as separate performance obligations. In these instances, the total consideration is allocated across the separate performance obligations using SSPs and the license revenue is recognized upon the later of the delivery or effective date of the contract and the revenue related to the updates and technical support is recognized over the term of the arrangement.\nHardware Revenue Recognition\nCadence generally has two performance obligations in arrangements involving the sale or lease of hardware products. The first performance obligation is to transfer the hardware product (which includes software integral to the functionality of the hardware product). The second performance obligation is to provide maintenance on hardware and its embedded software, which includes rights to technical support, hardware repairs and software updates that are all provided over the same term and have the same time-based pattern of transfer to the customer. The transaction price allocated to the hardware product is generally recognized as revenue at the time of delivery because the customer obtains control of the product at that point in time. Cadence has concluded that control generally transfers at that point in time because the customer has title to the hardware, physical possession, and a present obligation to pay for the hardware. The transaction price allocated to maintenance is recognized as revenue ratably over the maintenance term. Payments for hardware contracts are generally received upon delivery of the hardware product. Shipping and handling costs are considered fulfillment costs and are included in cost of product and maintenance in Cadence’s consolidated income statements.\nIP Revenue Recognition\nCadence generally licenses IP under nonexclusive license agreements that provide usage rights for specific designs. In addition, for certain of Cadence’s IP license agreements, royalties are collected as customers ship their own products that incorporate Cadence IP. These arrangements generally have two performance obligations—transferring the licensed IP and associated maintenance, which includes rights to technical support, and software updates that are all provided over the maintenance term and have a time-based pattern of transfer to the customer. \nRevenue allocated to the IP license is recognized at a point in time upon the later of the delivery of the IP or the beginning of the license period and revenue allocated to the maintenance is recognized over the maintenance term. Royalties are recognized as revenue in the quarter in which the applicable Cadence customer ships its products that incorporate Cadence IP. Payments for IP contracts are generally received upon delivery of the IP. Cadence customizes certain IP and revenue related to this customization is recognized as services revenue as described below.\nServices Revenue Recognition\nRevenue from service contracts is recognized over time, generally using costs incurred or hours expended to measure progress. Cadence has a history of accurately estimating project status and the costs necessary to complete projects. A number of internal and external factors can affect these estimates, including labor rates, utilization and efficiency variances and specification and testing requirement changes. Payments for services are generally due upon milestones in the contract or upon consumption of the hourly resources.\n63\nTable of Contents\nStock-Based Compensation\nCadence recognizes the cost of awards of equity instruments granted to employees in exchange for their services as stock-based compensation expense. Stock-based compensation expense is measured at the grant date based on the value of the award and is recognized as expense over the requisite service period, which is typically the vesting period. Cadence recognizes stock-based compensation expense on the straight-line method for awards that only contain a service condition and on the graded-vesting method for awards that contain both a service and performance condition. Cadence recognizes the impact of forfeitures on stock-based compensation expense as they occur.\nThe fair value of stock options and purchase rights issued under Cadence’s Employee Stock Purchase Plan (“ESPP”) are calculated using the Black-Scholes option pricing model. The computation of the expected volatility assumption used for new awards is based on a weighting of historical and implied volatilities. When determining the expected term, Cadence reviews historical employee exercise behavior from options having similar vesting periods. The risk-free interest rate for the period within the expected term of the option is based on the yield of United States Treasury notes for the comparable term in effect at the time of grant. The expected dividend yield used in the calculation is zero because Cadence has not historically paid and currently does not expect to pay dividends in the foreseeable future.\nThe fair value of market-based performance stock awards is calculated using a Monte Carlo simulation model and takes into account the same input assumptions as the Black-Scholes model, as well as the possibility that the market conditions may not be satisfied. Cadence recognizes stock-based compensation expense on the graded-vesting method for market-based performance stock awards.\nAdvertising\nCadence expenses the costs of advertising as incurred. Total advertising expense, including marketing programs and events, was $\n23.2\n million, $\n21.7\n million and $\n17.0\n million during fiscal 2024, 2023 and 2022, respectively, and is included in marketing and sales in the consolidated income statements.\nRestructuring\nCadence records personnel-related restructuring charges with termination benefits when the costs are both probable and estimable. Cadence records personnel-related restructuring charges with non-customary termination benefits when the plan has been communicated to the affected employees. Cadence generally begins recording facilities-related restructuring charges in the period in which a formal plan to vacate an affected facility is established. In connection with facilities-related restructuring plans, Cadence has made certain assumptions and estimates related to facilities, particularly the timing of exit and the ability to sublease. Facility closure costs in restructuring charges primarily includes accelerated ROU asset amortization, lease buyout costs and certain contractual costs to maintain facilities during the period after abandonment.\nCadence records estimated provisions for termination benefits and outplacement costs along with other personnel-related restructuring costs, asset impairments related to abandoned assets and other costs associated with the restructuring plan. Cadence regularly evaluates the adequacy of its restructuring liabilities and adjusts the balances based on actual costs incurred or changes in estimates and assumptions. Subsequent adjustments to restructuring accruals are classified as restructuring in the consolidated income statements.\nAccounting for Income Taxes \nCadence accounts for the effect of income taxes in its consolidated financial statements using the asset and liability method. This process involves estimating actual current tax liabilities together with assessing carryforwards and temporary differences resulting from differing treatment of items, such as depreciation, for tax and accounting purposes. These differences result in deferred tax assets and liabilities, measured using enacted tax rates expected to apply to taxable income in the years when those temporary differences are expected to be recovered or settled. Cadence accounts for the United States global intangible low-taxed income as a period expense.\nCadence then records a valuation allowance to reduce the deferred tax assets to the amount that Cadence believes is more likely than not to be realized based on its judgment of all available positive and negative evidence. The weight given to the potential effect of negative and positive evidence is commensurate with the extent to which the strength of the evidence can be objectively verified. This assessment, which is completed on a taxing jurisdiction basis, takes into account a number of types of evidence, including the following:\n•\nthe nature and history of current or cumulative financial reporting income or losses;\n•\nsources of future taxable income;\n•\nthe anticipated reversal or expiration dates of the deferred tax assets; and \n•\ntax planning strategies.\n64\nTable of Contents\nCadence takes a two-step approach to recognizing and measuring the financial statement benefit of uncertain tax positions. The first step is to evaluate the tax position for recognition by determining whether the weight of available evidence indicates that it is more likely than not that the tax position will be sustained on audit, including resolution of any related appeals or litigation processes. The second step is to measure the tax benefit as the largest amount that is more than 50% likely of being realized upon settlement of the audit. Cadence classifies interest and penalties on unrecognized tax benefits as income tax expense or benefit.\nFor additional discussion of income taxes, see Note 8 in the notes to the consolidated financial statements.\nNOTE 3. \nREVENUE\nCadence groups its products and services into categories related to major design activities. \nThe following table shows the percentage of revenue contributed by each of Cadence’s product categories for fiscal 2024, 2023 and 2022:\n \n2024\n2023\n2022\nCore EDA\n71\n \n%\n76\n \n%\n76\n \n%\nIP\n13\n \n%\n12\n \n%\n12\n \n%\nSystem Design and Analysis\n16\n \n%\n12\n \n%\n12\n \n%\nTotal\n100\n \n%\n100\n \n%\n100\n \n%\n_____________\n* \nIncludes immaterial amount of revenue accounted for under leasing arrangements\n.\nCadence generates revenue from contracts with customers and applies judgment in identifying and evaluating any terms and conditions in contracts which may impact revenue recognition. Certain of Cadence’s licensing arrangements allow customers the ability to remix among software products. Cadence also has arrangements with customers that include a combination of products, with the actual product selection and number of licensed users to be determined at a later date. For these arrangements, Cadence estimates the allocation of the revenue to product categories based upon the expected usage of products. Revenue by product category fluctuates from period to period based on demand for products and services, and Cadence’s available resources to deliver them. No single customer accounted for 10% or more of total revenue during fiscal 2024, 2023 or 2022.\nRecurring revenue includes revenue recognized over time from Cadence’s software arrangements, services, royalties, maintenance on IP licenses and hardware, and operating leases of hardware. Recurring revenue also includes revenue recognized at varying points in time over the term of other arrangements with non-cancelable commitments, whereby the customer commits to a fixed dollar amount over a specified period of time that can be used to purchase from a list of products or services. These arrangements do not meet the definition of a revenue contract until the customer executes a separate selection form to identify the products and services that they are purchasing. Each separate selection form under the arrangement is treated as an individual contract and accounted for based on the respective performance obligations.\nThe remainder of Cadence’s revenue is recognized at a point in time and is characterized as up-front revenue. Up-front revenue is primarily generated by sales of hardware, individual IP licenses and certain software licenses. The percentage of Cadence’s recurring and up-front revenue in any single fiscal period is primarily impacted by delivery of hardware and IP products to its customers.\nThe following table shows the percentage of Cadence’s revenue that is classified as recurring or up-front for fiscal 2024, 2023 and 2022:\n \n2024\n2023\n2022\nRevenue recognized over time\n80\n \n%\n81\n \n%\n83\n \n%\nRevenue from arrangements with non-cancelable commitments\n3\n \n%\n3\n \n%\n2\n \n%\nRecurring revenue\n83\n \n%\n84\n \n%\n85\n \n%\nUp-front revenue\n17\n \n%\n16\n \n%\n15\n \n%\nTotal\n100\n \n%\n100\n \n%\n100\n \n%\n65\nTable of Contents\nSignificant Judgments\nCadence’s contracts with customers often include promises to transfer to a customer multiple software and/or IP licenses and services, including professional services, technical support services, and rights to unspecified updates. Determining whether licenses and services are distinct performance obligations that should be accounted for separately, or not distinct and thus accounted for together, requires significant judgment. In some arrangements, such as most of Cadence’s IP license arrangements and the license of certain software, Cadence has concluded that the licenses and the related updates and technical support are distinct from each other. In others, like Cadence’s time-based software arrangements, the licenses and certain services are not distinct from each other. These time-based software arrangements include multiple software licenses and updates to the licensed software products, as well as technical support, and Cadence has concluded that these promised goods and services are a single, combined performance obligation.\nThe accounting for contracts with multiple performance obligations requires the contract’s transaction price to be allocated to each distinct performance obligation based on relative SSP. Judgment is required to determine the SSP for each distinct performance obligation because Cadence rarely licenses or sells products on a standalone basis. In instances where the SSP is not directly observable because Cadence does not sell the license, product or service separately, Cadence determines the SSP using information that maximizes the use of observable inputs and may include market conditions. Cadence typically has more than one SSP for individual performance obligations due to the stratification of those items by classes of customers and circumstances. In these instances, Cadence may use information such as the size of the customer and geographic region of the customer in determining the SSP.\nRevenue is recognized over time for Cadence’s combined performance obligations that include software licenses, updates, technical support and maintenance that are separate performance obligations with the same term. For Cadence’s professional services, revenue is recognized over time, generally using costs incurred or hours expended to measure progress. Judgment is required in estimating project status and the costs necessary to complete projects. A number of internal and external factors can affect these estimates, including labor rates, utilization and efficiency variances and specification and testing requirement changes. For Cadence’s other performance obligations recognized over time, revenue is generally recognized using a time-based measure of progress reflecting generally consistent efforts to satisfy those performance obligations throughout the arrangement term.\nIf a group of agreements are so closely related that they are, in effect, part of a single arrangement, such agreements are deemed to be one arrangement for revenue recognition purposes. Cadence exercises significant judgment to evaluate the relevant facts and circumstances in determining whether the separate agreements should be accounted for separately or as, in substance, a single arrangement. Cadence’s judgments about whether a group of contracts comprise a single arrangement can affect the allocation of consideration to the distinct performance obligations, which could have an effect on results of operations for the periods involved.\nCadence is required to estimate the total consideration expected to be received from contracts with customers. In limited circumstances, the consideration expected to be received is variable based on the specific terms of the contract or based on Cadence’s expectations of the term of the contract. Generally, Cadence has not experienced significant returns or refunds to customers. These estimates require significant judgment and a change in these estimates could have an effect on its results of operations during the periods involved.\nContract Balances\nThe timing of revenue recognition may differ from the timing of invoicing to customers, and these timing differences result in receivables, contract assets, or contract liabilities (deferred revenue) on Cadence’s consolidated balance sheets. For certain software, hardware and IP agreements with payment plans, Cadence records an unbilled receivable related to revenue recognized upon transfer of control because it has an unconditional right to invoice and receive payment in the future related to those transferred products or services. Cadence records a contract asset when revenue is recognized prior to invoicing and Cadence does not have the unconditional right to invoice or retains performance risk with respect to that performance obligation. Cadence records deferred revenue when revenue is recognized subsequent to invoicing. For Cadence’s time-based software agreements, customers are generally invoiced in equal, quarterly amounts, although some customers prefer to be invoiced in single or annual amounts.\nThe contract assets indicated below are included in prepaid expenses and other in the consolidated balance sheets and primarily relate to Cadence’s rights to consideration for work completed but not billed as of the balance sheet date on services and customized IP contracts. The contract assets are transferred to receivables when the rights become unconditional, usually upon completion of a milestone.\n66\nTable of Contents\nCadence’s contract balances as of December 31, 2024, and December 31, 2023, were as follows:\n \nAs of\n \nDecember 31,\n2024\nDecember 31,\n2023\n \n(In thousands)\nContract assets\n$\n29,339\n \n$\n17,554\n \nDeferred revenue\n852,581\n \n763,955\n \nCadence recognized revenue of $\n669.9\n million, $\n689.7\n million and $\n540.7\n million during fiscal 2024, 2023 and 2022, respectively, that was included in the deferred revenue balance at the beginning of each respective fiscal year. All other activity in deferred revenue, with the exception of deferred revenue assumed from acquisitions, is due to the timing of invoices in relation to the timing of revenue as described above.\nPayment terms and conditions vary by contract type, although terms generally include a requirement of payment within 30 to 60 days. In instances where the timing of revenue recognition differs from the timing of invoicing, Cadence has determined that its contracts generally do not include a significant financing component. The primary purpose of invoicing terms is to provide customers with simplified and predictable ways of purchasing Cadence’s products and services, and not to facilitate financing arrangements.\nRemaining Performance Obligations\nRevenue allocated to remaining performance obligations represents the transaction price allocated to the performance obligations that are unsatisfied, or partially unsatisfied, which includes unearned revenue and amounts that will be invoiced and recognized as revenue in future periods. Cadence has elected to exclude the potential future royalty receipts from the remaining performance obligations. Contracted but unsatisfied performance obligations were approximately $\n6.8\n billion as of December 31, 2024, which included $\n0.5\n billion of non-cancelable commitments from customers where actual product selection and quantities of specific products or services are to be determined by customers at a later date. \nCadence estimates its remaining performance obligations at a point in time. Actual amounts and timing of revenue recognition may differ from these estimates largely due to changes in actual installation and delivery dates, as well as contract renewals, modifications and terminations. As of December 31, 2024, Cadence expected to recognize \n54\n% of the contracted but unsatisfied performance obligations, excluding non-cancelable commitments, as revenue over the next \n12\n months, \n42\n% over the next \n13\n to \n36\n months and the remainder thereafter.\nCadence recognized revenue of $\n68.0\n million, $\n55.0\n million and $\n52.8\n million during fiscal 2024, 2023 and 2022, respectively, from performance obligations satisfied in previous periods. These amounts represent royalties earned during the period and exclude contracts with nonrefundable prepaid royalties. Nonrefundable prepaid royalties are recognized upon delivery of the IP because Cadence’s right to the consideration is not contingent upon customers’ future shipments.\nNOTE 4. \nRECEIVABLES, NET\nCadence’s current and long-term receivables balances as of December 31, 2024, and December 31, 2023, were as follows:\n \nAs of\n \nDecember 31,\n2024\nDecember 31,\n2023\n \n(In thousands)\nAccounts receivable\n$\n393,017\n \n$\n299,814\n \nUnbilled accounts receivable\n293,251\n \n193,963\n \nLong-term receivables\n24,179\n \n10,755\n \nTotal receivables\n710,447\n \n504,532\n \nLess allowance for doubtful accounts\n(\n5,808\n)\n(\n4,553\n)\nTotal receivables, net\n$\n704,639\n \n$\n499,979\n \nCadence’s customers are primarily concentrated within the semiconductor and electronics systems industries. As of December 31, 2024, one customer accounted for approximately 11% of Cadence’s total receivables. As of December 31, 2023, no single customer accounted for 10% or more of Cadence’s total receivables.\n67\nTable of Contents\nAllowance for doubtful accounts\nCadence’s provisions for losses on its accounts receivable during fiscal 2024, 2023 and 2022 were as follows:\nBalance at Beginning of Period\nCharged to Costs and Expenses\nUncollectible Accounts Written Off, Net\nBalance at End of Period\nYear ended December 31, 2024\n$\n4,553\n \n$\n2,078\n \n$\n(\n823\n)\n$\n5,808\n \nYear ended December 31, 2023\n2,290\n \n3,325\n \n(\n1,062\n)\n4,553\n \nYear ended December 31, 2022\n$\n3,692\n \n$\n204\n \n$\n(\n1,606\n)\n$\n2,290\n \nNOTE 5. \nDEBT\nCadence’s outstanding debt as of December 31, 2024, and December 31, 2023, was as follows:\n \nDecember 31, 2024\nDecember 31, 2023\n \n(In thousands)\nPrincipal\nUnamortized Discount and Issuance Costs\nCarrying Value\nPrincipal\nUnamortized Discount and Issuance Costs\nCarrying Value\n2024 Notes\n$\n—\n \n$\n—\n \n$\n—\n \n$\n350,000\n \n$\n(\n715\n)\n$\n349,285\n \n2025 Term Loan\n—\n \n—\n \n—\n \n300,000\n \n(\n229\n)\n299,771\n \n2027 Notes\n500,000\n \n(\n3,206\n)\n496,794\n \n—\n \n—\n \n—\n \n2029 Notes\n1,000,000\n \n(\n9,666\n)\n990,334\n \n—\n \n—\n \n—\n \n2034 Notes\n1,000,000\n \n(\n10,945\n)\n989,055\n \n—\n \n—\n \n—\n \nTotal outstanding debt\n$\n2,500,000\n \n$\n(\n23,817\n)\n$\n2,476,183\n \n$\n650,000\n \n$\n(\n944\n)\n$\n649,056\n \nSenior Notes\nIn October 2014, Cadence issued $\n350.0\n million aggregate principal amount of \n4.375\n% Senior Notes that were due October 15, 2024 (the “2024 Notes”). As of December 31, 2023, the carrying value of the 2024 Notes was classified as a current liability on Cadence’s consolidated balance sheet. In October 2024, Cadence settled the outstanding principal of $\n350.0\n million and accrued interest on its 2024 Notes.\nIn September 2024, Cadence issued $\n500.0\n million aggregate principal amount of \n4.200\n% Senior Notes due September 10, 2027 (the “2027 Notes”). Cadence received net proceeds of $\n496.5\n million from the issuance of the 2027 Notes, net of a discount of $\n0.1\n million and issuance costs of $\n3.5\n million. As of December 31, 2024, the fair value of the 2027 Notes was approximately $\n495\n million.\nIn September 2024, Cadence issued $\n1.0\n billion aggregate principal amount of \n4.300\n% Senior Notes due September 10, 2029 (the “2029 Notes”). Cadence received net proceeds of $\n989.8\n million from the issuance of the 2029 Notes, net of a discount of $\n1.4\n million and issuance costs of $\n8.8\n million. As of December 31, 2024, the fair value of the 2029 Notes was approximately $\n980\n million.\nIn September 2024, Cadence issued $\n1.0\n billion aggregate principal amount of \n4.700\n% Senior Notes due September 10, 2034 (the “2034 Notes,” and together with the 2027 Notes and the 2029 Notes, the “New Notes”, and together with the 2024 Notes, the “Senior Notes”). Cadence received net proceeds of $\n988.8\n million from the issuance of the 2034 Notes, net of a discount of $\n1.9\n million and issuance costs of $\n9.3\n million. As of December 31, 2024, the fair value of the 2034 Notes was approximately $\n960\n million.\nCadence may redeem the New Notes, in whole or in part, at any time or from time to time, at redemption prices specified in the governing indenture. In addition, Cadence may be required to repurchase New Notes upon occurrence of a change of control triggering event, as set forth in the governing indenture.\nThe indentures governing Cadence’s New Notes include customary representations, warranties and restrictive covenants, including, but not limited to, restrictions on Cadence’s ability to grant liens on certain assets, enter into certain sale and lease-back transactions, or merge, consolidate or sell assets, and also include customary events of default. As of December 31, 2024, Cadence was in compliance with all covenants associated with the New Notes.\n68\nTable of Contents\nBoth the discount and issuance costs are being amortized to interest expense over the term of the New Notes using the effective interest method. Interest on the New Notes is payable semi-annually in arrears in March and September of each year, beginning March 2025. Cadence’s New Notes are unsecured and rank equal in right of payment to all of Cadence’s existing and future senior indebtedness. \nTerm Loans\nIn September 2022, Cadence entered into a $\n300.0\n million three-year senior non-amortizing term loan facility due on September 7, 2025, as amended, with a group of lenders led by Bank of America, N.A., as administrative agent (the “2025 Term Loan”). Proceeds from the loan were used to finance Cadence’s acquisition of OpenEye Scientific Software, Inc. (“OpenEye”) in fiscal 2022. Debt issuance costs associated with the 2025 Term Loan were not material.\nIn May 2024, Cadence entered into a $\n700.0\n million two-year senior non-amortizing term loan facility due on May 30, 2026, as amended, with a group of lenders led by Bank of America, N.A., as administrative agent (the “2026 Term Loan”). All proceeds from the 2026 Term Loan were used to finance Cadence’s acquisition of BETA CAE Systems International AG (“BETA CAE”). Debt issuance costs associated with the 2026 Term Loan were not material.\nIn September 2024, Cadence used a portion of the net proceeds from the New Notes to fully prepay the outstanding principal and accrued interest of both the 2025 Term Loan and the 2026 Term Loan.\nRevolving Credit Facility\nIn August 2024, Cadence terminated its existing revolving credit facility, dated June 30, 2021, and amended in September 2022, and entered into a five-year senior unsecured revolving credit facility with a group of lenders led by Bank of America, N.A., as administrative agent (the “2024 Credit Facility”). The 2024 Credit Facility provides for borrowings up to $\n1.25\n billion, with the right to request increased capacity up to an additional $\n500.0\n million upon the receipt of lender commitments, for total maximum borrowings of $\n1.75\n billion. The 2024 Credit Facility expires on \nAugust 14, 2029\n. Any outstanding loans drawn under the 2024 Credit Facility are due at maturity on \nAugust 14, 2029\n, subject to an option to extend the maturity date. Outstanding borrowings may be repaid at any time prior to maturity. Cadence paid debt issuance costs of $\n1.3\n million that were recorded to other assets in Cadence’s consolidated balance sheet at the inception of the agreement. The debt issuance costs will be amortized to interest expense over the term of the 2024 Credit Facility. As of December 31, 2024, there were no outstanding borrowings under the 2024 Credit Facility.\nInterest accrues on borrowings under the 2024 Credit Facility at a rate equal to, at Cadence’s option, either (1) secured overnight financing rate (“SOFR”) plus a margin between \n0.625\n% and \n1.125\n% per annum, determined by reference to the credit rating of Cadence’s unsecured debt, plus a SOFR adjustment of \n0.10\n% or (2) the base rate plus a margin between \n0.000\n% and \n0.125\n% per annum, determined by reference to the credit rating of Cadence’s unsecured debt. Interest is payable quarterly. A commitment fee ranging from \n0.050\n% to \n0.125\n% is assessed on the daily average undrawn portion of revolving commitments. Borrowings bear interest at what is estimated to be current market rates of interest. Accordingly, the carrying value of the 2024 Credit Facility approximates fair value.\nThe 2024 Credit Facility contains customary negative covenants that, among other things, restrict Cadence’s ability to incur additional indebtedness, grant liens and make certain asset dispositions. In addition, the 2024 Credit Facility contains financial covenants that require Cadence to maintain a funded debt to EBITDA ratio not greater than \n3.5\n to 1, with a step up to \n4\n to 1 for one year following an acquisition by Cadence of at least $\n250.0\n million that results in a pro forma leverage ratio between \n3.25\n to 1 and \n3.75\n to 1. As of December 31, 2024, Cadence was in compliance with all covenants associated with the 2024 Credit Facility.\nNOTE 6. \nACQUISITIONS \n2024 Acquisitions\nAcquisition of BETA CAE\nOn May 30, 2024, Cadence acquired all of the outstanding equity of BETA CAE, a system analysis platform provider of multi-domain, engineering simulation solutions. The aggregate purchase consideration for Cadence’s acquisition of BETA CAE, net of cash acquired of $\n91.3\n million, was $\n1.14\n billion. The aggregate purchase consideration was comprised of $\n638.2\n million of cash and non-cash consideration of \n1.74\n million shares of Cadence common stock with an aggregate acquisition date fair value of $\n501.8\n million. The addition of BETA CAE’s technologies and talent is expected to accelerate Cadence’s Intelligent System Design™ strategy by expanding its multiphysics system analysis portfolio and enabling entry into the structural analysis space. \nIn connection with its acquisition of BETA CAE, Cadence paid an additional $\n55.8\n million to a third-party escrow agent that will be released to certain former BETA CAE shareholders, subject to continued employment with Cadence, through the second quarter of fiscal 2026. The release of these funds is subject to continuous service and other conditions and is accounted for over the required service period as post-acquisition compensation expense in Cadence’s consolidated income statements.\n69\nTable of Contents\nThe total purchase consideration was allocated to the assets acquired and liabilities assumed with Cadence’s acquisition of BETA CAE based on their respective fair values on the acquisition date as follows:\n \nFair Value\n \n(In thousands)\nCurrent assets\n$\n118,676\n \nGoodwill\n822,129\n \nAcquired intangibles\n345,000\n \nOther long-term assets\n18,198\n \nTotal assets acquired\n1,304,003\n \nCurrent liabilities\n36,465\n \nLong-term liabilities\n36,250\n \nTotal liabilities assumed\n72,715\n \nTotal purchase consideration\n$\n1,231,288\n \nThe recorded goodwill is attributed to intangible assets that do not qualify for separate recognition, including the acquired assembled workforce, and is expected to be deductible for U.S. income tax purposes.\nDefinite-lived intangible assets acquired with Cadence’s acquisition of BETA CAE were as follows:\n \nFair Value\nWeighted Average Amortization Period\n \n(In thousands)\n (in years)\nExisting technology\n$\n140,000\n \n6.0\n years\nAgreements and relationships\n190,000\n \n15.0\n years\nTradenames, trademarks and patents\n15,000\n \n7.0\n years\nTotal acquired intangibles with definite lives\n$\n345,000\n \n11.0\n years\nAcquisition of Invecas, Inc.\nOn January 8, 2024, Cadence acquired all of the outstanding equity of Invecas, Inc. (“Invecas”), a provider of design engineering, embedded software and system-level solutions. The aggregate cash consideration for Cadence’s acquisition of Invecas, net of cash acquired of $\n23.8\n million, was $\n71.2\n million. The acquisition adds a skilled system design engineering team to Cadence, with expertise in providing customers with custom solutions across chip design, product engineering, advanced packaging and embedded software. In connection with the acquisition of Invecas, Cadence paid an additional amount to a third-party escrow agent that will be released to certain former Invecas shareholders, subject to continued employment with Cadence, through the first quarter of fiscal 2028. The release of these funds is subject to continuous service and other conditions and is accounted for over the required service period as post-acquisition compensation expense in Cadence’s consolidated income statements.\nThe total purchase consideration was allocated to the assets acquired and liabilities assumed with Cadence’s acquisition of Invecas based on their respective fair values on the acquisition date as follows:\n \nFair Value\n \n(In thousands)\nCurrent assets\n$\n50,608\n \nGoodwill\n42,209\n \nAcquired intangibles\n15,500\n \nOther long-term assets\n7,414\n \nTotal assets acquired\n115,731\n \nCurrent liabilities\n17,114\n \nLong-term liabilities\n3,647\n \nTotal liabilities assumed\n20,761\n \nTotal purchase consideration\n$\n94,970\n \nThe recorded goodwill is attributed to intangible assets that do not qualify for separate recognition, including the acquired assembled workforce, and will not be deductible for tax purposes.\n70\nTable of Contents\nThe definite-lived intangible assets acquired with Cadence’s acquisition of Invecas include agreements and relationships of $\n15.0\n million and tradenames of $\n0.5\n million. These assets will be amortized over a weighted average life of \n6.8\n years. \nOther 2024 Acquisitions\nDuring the first three quarters of fiscal 2024, Cadence completed two other business combinations for aggregate cash consideration of $\n28.3\n million, net of cash acquired. The total purchase consideration was allocated to assets acquired and liabilities assumed based on their respective estimated fair values on the acquisition dates. Cadence recorded $\n5.5\n million of definite-lived intangible assets with a weighted average amortization period of \n4.9\n years. Cadence also recognized $\n25.2\n million of goodwill, which is primarily attributed to the assembled workforce of the acquired businesses. The goodwill recognized with these acquisitions is not expected to be deductible for tax purposes.\n2023 Acquisitions\nAcquisition of IP Assets from Rambus Inc.\nOn September 6, 2023, Cadence acquired the serializer/deserializer (“SerDes”) and memory interface physical layer (“Memory”) IP business from Rambus Inc. (“Rambus”) for an aggregate cash consideration of $\n108.6\n million. Memory and SerDes IP design and integration continues to be integral to the design of artificial intelligence, data center and hyperscale applications, CPU architectures and networking devices. The addition of the Rambus IP and seasoned team accelerates Cadence’s Intelligent System Design strategy and strengthens Cadence's IP technology portfolio.\nThe total purchase consideration was allocated to the assets acquired and liabilities assumed based on their respective fair values on the acquisition date as follows:\n \nFair Value\n \n(In thousands)\nCurrent assets\n$\n1,460\n \nGoodwill\n80,999\n \nAcquired intangibles\n26,000\n \nOther long-term assets\n2,798\n \nTotal assets acquired\n111,257\n \nCurrent liabilities\n2,531\n \nLong-term liabilities\n142\n \nTotal liabilities assumed\n2,673\n \nTotal purchase consideration\n$\n108,584\n \nThe recorded goodwill is attributed to intangible assets that do not qualify for separate recognition, including the acquired assembled workforce, and will be deductible for tax purposes.\nDefinite-lived intangible assets acquired with Cadence’s acquisition of the SerDes and Memory business from Rambus were as follows:\n \nFair Value\nWeighted Average Amortization Period\n \n(In thousands)\n (in years)\nExisting technology\n$\n16,700\n \n5.0\n years\nAgreements and relationships\n9,300\n \n7.0\n years\nTotal acquired intangibles with definite lives\n$\n26,000\n \n5.7\n years\nAcquisition of Pulsic, Ltd.\nOn May 4, 2023, Cadence acquired all of the outstanding equity of Pulsic, Ltd. (“Pulsic”), a longtime provider of production-proven technology for floor-planning, placement, and routing of custom ICs. The addition of Pulsic’s technologies and experienced team supports Cadence’s Intelligent System Design strategy and strengthens Cadence’s Custom IC Design and Simulation technology portfolio. The aggregate cash consideration for Cadence’s acquisition of Pulsic, net of cash acquired of $\n3.8\n million, was $\n56.1\n million. Subject to service and other conditions, Cadence expects to recognize expense for consideration paid to certain former Pulsic shareholders, subject to continued employment with Cadence, through the second quarter of fiscal 2025.\n71\nTable of Contents\nThe total purchase consideration was allocated to the assets acquired and liabilities assumed with Cadence’s acquisition of Pulsic based on their respective fair values on the acquisition date as follows:\n \nFair Value\n \n(In thousands)\nCurrent assets\n$\n4,369\n \nGoodwill\n47,448\n \nAcquired intangibles\n12,400\n \nOther long-term assets\n89\n \nTotal assets acquired\n64,306\n \nCurrent liabilities\n1,553\n \nLong-term liabilities\n2,885\n \nTotal liabilities assumed\n4,438\n \nTotal purchase consideration\n$\n59,868\n \nThe recorded goodwill is attributed to intangible assets that do not qualify for separate recognition, including the acquired assembled workforce, and is not deductible for tax purposes.\nDefinite-lived intangible assets acquired with Cadence’s acquisition of Pulsic were as follows:\n \nFair Value\nWeighted Average Amortization Period\n \n(In thousands)\n (in years)\nExisting technology\n$\n8,000\n \n6.2\n years\nAgreements and relationships\n4,100\n \n8.0\n years\nTradenames, trademarks and patents\n300\n \n6.0\n years\nTotal acquired intangibles with definite lives\n$\n12,400\n \n6.8\n years\nAcquisition of Intrinsix Corporation\nOn October 2, 2023, Cadence acquired all of the outstanding equity of Intrinsix Corporation (“Intrinsix”) from CEVA, Inc. The acquisition enhances Cadence’s system and IC design services resources with the addition of a team with expertise in advanced nodes, radio frequency, mixed-signal and security algorithms. The acquisition also expands Cadence’s reach in key high-growth vertical sectors, including aerospace and defense. The aggregate cash consideration for Cadence’s acquisition of Intrinsix was $\n34.6\n million, net of cash acquired of $\n0.5\n million. With its acquisition of Intrinsix, Cadence recorded $\n2.6\n million of definite-lived intangible assets, $\n31.6\n million of goodwill and $\n0.9\n million net assets. The weighted average amortization period for the definite-lived intangible assets acquired with Cadence’s acquisition of Intrinsix was \n5.0\n years. The recorded goodwill is attributed to intangible assets that do not qualify for separate recognition, including the acquired assembled workforce, and is not deductible for tax purposes.\n2022 Acquisitions\nAcquisition of OpenEye Scientific Software, Inc.\nOn August 31, 2022, Cadence acquired all of the outstanding equity of OpenEye, a leading provider of computational molecular modeling and simulation software used by pharmaceutical and biotechnology companies for drug discovery. The addition of OpenEye’s technologies and experienced team with its deep scientific expertise is expected to accelerate Cadence’s Intelligent System Design strategy and broadens Cadence’s System Design and Analysis technology portfolio. The acquisition expands Cadence’s total addressable market, bringing Cadence’s computational software expertise to apply proven algorithmic, simulation and solver advances to life sciences. The aggregate cash consideration for Cadence’s acquisition of OpenEye, net of cash acquired of $\n13.2\n million, was $\n461.3\n million. Subject to service and other conditions, Cadence expects to recognize expense for consideration paid to certain former OpenEye shareholders, subject to continued employment with Cadence, through the first quarter of fiscal 2026.\n72\nTable of Contents\nThe total purchase consideration was allocated to the assets acquired and liabilities assumed with Cadence’s acquisition of OpenEye based on their respective estimated fair values on the acquisition date as follows:\n \nFair Value\n \n(In thousands)\nCurrent assets\n$\n24,890\n \nGoodwill\n359,580\n \nAcquired intangibles\n117,400\n \nOther long-term assets\n6,542\n \nTotal assets acquired\n508,412\n \nCurrent liabilities\n15,489\n \nLong-term liabilities\n18,456\n \nTotal liabilities assumed\n33,945\n \nTotal purchase consideration\n$\n474,467\n \nThe recorded goodwill is attributed to intangible assets that do not qualify for separate recognition, including the acquired assembled workforce, and is not deductible for tax purposes.\nDefinite-lived intangible assets acquired with Cadence’s acquisition of OpenEye were as follows:\n \nFair Value\nWeighted Average Amortization Period\n \n(In thousands)\n (in years)\nExisting technology\n$\n53,900\n \n7.0\n years\nAgreements and relationships\n61,400\n \n12.3\n years\nTradenames, trademarks and patents\n2,100\n \n7.0\n years\nTotal acquired intangibles with definite lives\n$\n117,400\n \n9.8\n years\nAcquisition of FFG Holdings Limited\nOn July 14, 2022, Cadence acquired all of the outstanding equity of FFG Holdings Limited (“Future Facilities”), a provider of electronics cooling analysis and energy performance optimization solutions for data center design and operations using physics-based 3D digital twins. The addition of Future Facilities’ technologies and expertise supports Cadence’s Intelligent System Design strategy and broadens its System Design and Analysis technology portfolio with the addition of solutions that enable companies to make informed business decisions about data center design, operations and lifecycle management that reduce their carbon footprint. The aggregate cash consideration for Cadence’s acquisition of Future Facilities, net of cash acquired of $\n2.8\n million, was $\n100.1\n million. Subject to service and other conditions, Cadence expects to recognize expense for consideration paid to certain former Future Facilities shareholders, subject to continued employment with Cadence, subject to service and other conditions, through the third quarter of fiscal 2025.\nThe total purchase consideration was allocated to the assets acquired and liabilities assumed with Cadence’s acquisition of Future Facilities based on their respective estimated fair values on the acquisition date as follows:\n \nFair Value\n \n(In thousands)\nCurrent assets\n$\n7,992\n \nGoodwill\n67,219\n \nAcquired intangibles\n38,100\n \nOther long-term assets\n2,708\n \nTotal assets acquired\n116,019\n \nCurrent liabilities\n4,952\n \nLong-term liabilities\n8,167\n \nTotal liabilities assumed\n13,119\n \nTotal purchase consideration\n$\n102,900\n \nThe recorded goodwill is attributed to intangible assets that do not qualify for separate recognition, including the acquired assembled workforce and expected synergies from combining operations of Future Facilities with Cadence. The goodwill will not be deductible for tax purposes.\n73\nTable of Contents\nDefinite-lived intangible assets acquired with Cadence’s acquisition of Future Facilities were as follows:\nFair Value\nWeighted Average Amortization Period\n \n(In thousands)\n (in years)\nExisting technology\n$\n20,900\n \n6.0\n years\nAgreements and relationships\n15,600\n \n9.0\n years\nTradenames, trademarks and patents\n1,600\n \n8.0\n years\nTotal acquired intangibles with definite lives\n$\n38,100\n \n7.3\n years\nOther 2022 Acquisitions\nDuring fiscal 2022, Cadence completed \nthree\n other business combinations for aggregate cash consideration of $\n53.6\n million, net of cash acquired. The total purchase consideration was allocated to assets acquired based on their respective estimated fair values on the acquisition dates. Cadence recorded $\n23.1\n million of acquired intangible assets, which consisted of $\n13.1\n million of existing technology, $\n3.1\n million of agreements and relationships, $\n0.1\n million of tradenames, trademarks and patents, and $\n6.8\n million of in-process technology. The weighted average amortization period for the definite-lived intangible assets acquired with these business combinations was \n6.9\n years. Cadence also recognized $\n29.5\n million of goodwill, which is primarily attributed to the assembled workforce of the acquired businesses. Of the goodwill recognized with these acquisitions, $\n27.8\n million is expected to be deductible for tax purposes.\nPro Forma Financial Information\nCadence has not presented pro forma financial information for any of the businesses it acquired during fiscal 2024, 2023 and fiscal 2022 because the results of operations for these businesses are not material to Cadence’s consolidated financial statements.\nAcquisition-Related Transaction Costs\nTransaction costs associated with acquisitions, which consist of professional fees and administrative costs, are expensed as incurred and are included in general and administrative expense in Cadence’s consolidated income statement. During fiscal 2024, 2023 and 2022, transaction costs associated with acquisitions were $\n14.6\n million, $\n12.1\n million and $\n10.1\n million, respectively.\n \nNOTE 7. \nGOODWILL AND ACQUIRED INTANGIBLES\nGoodwill\nThe changes in the carrying amount of goodwill during fiscal 2024 and 2023 were as follows:\n \nGross Carrying\nAmount\n \n(In thousands)\nBalance as of December 31, 2022\n$\n1,374,268\n \nGoodwill resulting from acquisitions\n160,083\n \nEffect of foreign currency translation\n1,494\n \nBalance as of December 31, 2023\n1,535,845\n \nGoodwill resulting from acquisitions\n889,585\n \nEffect of foreign currency translation\n(\n46,759\n)\nBalance as of December 31, 2024\n$\n2,378,671\n \nCadence completed its annual goodwill impairment test during the third quarter of fiscal 2024 and determined that the fair value of Cadence’s single reporting unit exceeded the carrying amount of its net assets and that no impairment existed.\n74\nTable of Contents\nAcquired Intangibles, Net\nAcquired intangibles as of December 31, 2024, were as follows, excluding intangibles that were fully amortized as of December 31, 2023:\nGross Carrying\nAmount\nAccumulated\nAmortization\nAcquired\nIntangibles, Net\n \n(In thousands)\nExisting technology\n$\n465,453\n \n$\n(\n199,126\n)\n$\n266,327\n \nAgreements and relationships\n386,365\n \n(\n78,605\n)\n307,760\n \nTradenames, trademarks and patents\n28,113\n \n(\n7,466\n)\n20,647\n \nTotal acquired intangibles\n$\n879,931\n \n$\n(\n285,197\n)\n$\n594,734\n \nDuring fiscal 2024, Cadence completed certain projects previously included in in-process technology and transferred $6.8 million to existing technology.\nAcquired intangibles as of December 31, 2023, were as follows, excluding intangibles that were fully amortized as of December 31, 2022:\nGross Carrying\nAmount\nAccumulated\nAmortization\nAcquired\nIntangibles, Net\n \n(In thousands)\nExisting technology\n$\n325,710\n \n$\n(\n141,659\n)\n$\n184,051\n \nAgreements and relationships\n198,259\n \n(\n61,395\n)\n136,864\n \nTradenames, trademarks and patents\n13,460\n \n(\n4,332\n)\n9,128\n \nTotal acquired intangibles with definite lives\n$\n537,429\n \n$\n(\n207,386\n)\n$\n330,043\n \nIn-process technology\n6,800\n \n— \n6,800\n \nTotal acquired intangibles\n$\n544,229\n \n$\n(\n207,386\n)\n$\n336,843\n \nAmortization expense from existing technology is included in cost of product and maintenance. \nAmortization expense for fiscal 2024, 2023 and 2022, by consolidated income statement caption, was as follows:\n2024\n2023\n2022\n \n(In thousands)\nCost of product and maintenance\n$\n60,074\n \n$\n43,808\n \n$\n41,348\n \nAmortization of acquired intangibles\n30,375\n \n18,162\n \n18,470\n \nTotal amortization of acquired intangibles\n$\n90,449\n \n$\n61,970\n \n$\n59,818\n \nAs of December 31, 2024, the estimated amortization expense for intangible assets with definite lives was as follows for the following five fiscal years and thereafter:\n \n(In thousands)\n2025\n$\n91,486\n \n2026\n86,763\n \n2027\n84,480\n \n2028\n79,023\n \n2029\n64,292\n \nThereafter\n188,690\n \nTotal estimated amortization expense\n$\n594,734\n \n75\nTable of Contents\nNOTE 8. \nINCOME TAXES \nThe United States enacted the Tax Cuts and Jobs Act in December 2017, which required companies to capitalize all of their research and development (“R&D”) costs, including software development costs, incurred in tax years beginning after December 31, 2021. Beginning in fiscal 2022, Cadence began capitalizing and amortizing R&D costs over five years for domestic research and fifteen years for international research rather than expensing these costs as incurred. The mandatory capitalization requirement increased Cadence’s fiscal 2024, 2023 and 2022 effective tax rates, deferred tax assets, and cash tax payments.\nCadence’s income before provision for income taxes included income from the United States and from foreign subsidiaries for fiscal 2024, 2023 and 2022, was as follows:\n2024\n2023\n2022\n(In thousands)\nUnited States\n$\n600,088\n \n$\n533,442\n \n$\n402,083\n \nForeign subsidiaries\n795,731\n \n748,484\n \n643,280\n \nTotal income before provision for income taxes\n$\n1,395,819\n \n$\n1,281,926\n \n$\n1,045,363\n \nCadence’s provision for income taxes was comprised of the following items for fiscal 2024, 2023 and 2022:\n2024\n2023\n2022\n(In thousands)\nCurrent:\nFederal\n$\n281,674\n \n$\n156,495\n \n$\n212,380\n \nState and local\n50,430\n \n15,933\n \n7,280\n \nForeign\n136,968\n \n104,866\n \n84,357\n \nTotal current\n469,072\n \n277,294\n \n304,017\n \nDeferred:\nFederal\n(\n130,490\n)\n(\n87,851\n)\n(\n79,170\n)\nState and local\n(\n5,127\n)\n25,440\n \n(\n50,640\n)\nForeign\n6,880\n \n25,899\n \n22,204\n \nTotal deferred\n(\n128,737\n)\n(\n36,512\n)\n(\n107,606\n)\nTotal provision for income taxes\n$\n340,335\n \n$\n240,782\n \n$\n196,411\n \nDuring fiscal 2024, the State of California enacted legislation that, for a three-year period beginning in fiscal 2024, will limit Cadence's utilization of California research and development tax credits to $5 million annually and provides the ability to receive a refund of credits that would have otherwise been used to reduce the California tax liability. The legislation increased the cash paid for income taxes and long-term receivables for fiscal 2024 by approximately $\n33\n million and $\n21\n million, respectively.\nDuring fiscal 2023, Cadence recognized a tax benefit of approximately $\n24.8\n million due to the recognition of previously unrecognized tax benefits from the expiration of the applicable statute of limitations and a tax benefit of approximately $\n14.0\n million primarily related to a change in R&D expenses that were capitalized in fiscal 2022.\nDuring fiscal 2022, Cadence recognized a tax benefit of approximately $\n68.7\n million due to a release of the valuation allowance on its California research and development tax credit deferred tax assets. In evaluating its ability to realize its deferred tax assets, Cadence considered all available positive and negative evidence, including its past operating results, forecasted earnings, future taxable income, and prudent and feasible tax planning strategies. Cadence expects to utilize these tax credits based on current earnings and future taxable income projections.\n76\nTable of Contents\nThe provision for income taxes differs from the amount estimated by applying the United States statutory federal income tax rates of \n21\n% to income before provision for income taxes for fiscal 2024, 2023, and 2022 as follows:\n2024\n2023\n2022\n(In thousands)\nProvision computed at federal statutory income tax rate\n$\n293,122\n \n$\n269,205\n \n$\n219,526\n \nState and local income tax, net of federal tax effect\n50,130\n \n40,304\n \n29,622\n \nIntercompany transfers of intangible property rights\n7,833\n \n23,826\n \n—\n \nForeign income tax rate differential\n(\n62,798\n)\n(\n54,210\n)\n(\n49,949\n)\nForeign-derived intangible income deduction\n(\n13,344\n)\n(\n14,253\n)\n(\n2,335\n)\nU.S. tax on foreign entities\n144,222\n \n113,011\n \n132,563\n \nStock-based compensation\n(\n6,181\n)\n(\n26,805\n)\n(\n17,023\n)\nChange in deferred tax asset valuation allowance\n11,441\n \n9,077\n \n(\n38,073\n)\nTax credits\n(\n135,344\n)\n(\n130,383\n)\n(\n105,366\n)\nNon-deductible acquisitions-related costs\n11,770\n \n6,709\n \n4,273\n \nWithholding taxes\n20,175\n \n15,300\n \n17,459\n \nTax settlements, foreign\n—\n \n4,034\n \n—\n \nIncrease (decrease) in unrecognized tax benefits\n9,061\n \n(\n19,660\n)\n2,354\n \nOther\n10,248\n \n4,627\n \n3,360\n \nProvision for income taxes\n$\n340,335\n \n$\n240,782\n \n$\n196,411\n \nEffective tax rate\n24\n \n%\n19\n \n%\n19\n \n%\n77\nTable of Contents\nThe components of deferred tax assets and liabilities consisted of the following as of December 31, 2024, and December 31, 2023:\nAs of\nDecember 31,\n2024\nDecember 31,\n2023\n(In thousands)\nDeferred tax assets:\nTax credit carryforwards\n$\n110,031\n \n$\n129,513\n \nReserves and accruals\n103,731\n \n78,993\n \nIntangible assets\n487,947\n \n506,398\n \nCapitalized research and development expense for income tax purposes\n368,085\n \n242,465\n \nOperating loss carryforwards\n9,781\n \n9,598\n \nDeferred income\n79,195\n \n77,066\n \nCapital loss carryforwards\n16,861\n \n16,483\n \nStock-based compensation costs\n34,045\n \n27,409\n \nDepreciation and amortization\n17,228\n \n10,671\n \nInvestments\n20,757\n \n15,949\n \nLease liability\n33,341\n \n33,639\n \nPrepaid expenses\n—\n \n3,253\n \nTotal deferred tax assets\n1,281,002\n \n1,151,437\n \nValuation allowance\n(\n90,603\n)\n(\n79,162\n)\nNet deferred tax assets\n1,190,399\n \n1,072,275\n \nDeferred tax liabilities:\nIntangible assets\n(\n107,251\n)\n(\n83,308\n)\nUndistributed foreign earnings\n(\n76,045\n)\n(\n64,371\n)\nROU assets\n(\n33,341\n)\n(\n33,639\n)\nInvestments\n(\n14,171\n)\n(\n6,318\n)\nOther\n(\n7,869\n)\n(\n13,455\n)\nTotal deferred tax liabilities\n(\n238,677\n)\n(\n201,091\n)\nTotal net deferred tax assets\n$\n951,722\n \n$\n871,184\n \nDuring fiscal 2024, 2023 and 2022 Cadence maintained valuation allowances of $\n90.6\n million, $\n79.2\n million, and $\n70.1\n million, respectively, on certain federal, state and foreign deferred tax assets because the realization of these deferred tax assets requires future income of a specific character or amount that Cadence considered uncertain. The valuation allowance primarily relates to the following:\n•\nTax credits in certain states that are accumulating at a rate greater than Cadence’s capacity to utilize the credits and tax credits in certain states where it is likely the credits will expire unused;\n•\nFederal, state and foreign deferred tax assets related to investments and capital losses that can only be utilized against gains that are capital in nature; and\n•\nForeign tax credits that can only be fully utilized if Cadence has sufficient income of a specific character in the future.\nThe valuation allowance increased by $\n11.4\n million and $\n9.1\n million during fiscal 2024 and fiscal 2023, respectively, and decreased by $\n38.1\n million during fiscal 2022. The valuation allowance activity was primarily related to state research and development tax credits and certain foreign tax credits.\n78\nTable of Contents\n \nAs of December 31, 2024, Cadence’s operating loss carryforwards were as follows:\nAmount\nExpiration Periods\n(In thousands)\nFederal\n$\n61\n \n2033\nCalifornia\n26,872\n \nfrom 2025 through 2043\nOther states (tax effected, net of federal benefit)\n410\n \nfrom 2025 through indefinite\nForeign (tax effected)\n8,077\n \nindefinite\nAs of December 31, 2024, Cadence had tax credit carryforwards of:\nAmount\nExpiration Periods\n(In thousands)\nFederal*\n$\n51,535\n \nfrom 2031 \nCalifornia\n58\n \nindefinite\nOther states \n11,331\n \nfrom 2033 through indefinite\nForeign \n47,107\n \nfrom 2044 through indefinite\n_____________\n *\nCertain of Cadence’s foreign tax credits have yet to be realized and as a result do not yet have an expiration period.\n \nExaminations by Tax Authorities\nTaxing authorities regularly examine Cadence’s income tax returns. \nAs of December 31, 2024, Cadence’s earliest tax years that remain open to examination and the assessment of additional tax include:\nJurisdiction\nEarliest Tax Year Open to Examination\nUnited States – Federal\n2020\nUnited States – California\n2020\nIreland\n2020\nIsrael\n2017\nKorea\n2019\nUnrecognized Tax Benefits\nThe changes in Cadence’s gross amount of unrecognized tax benefits during fiscal 2024, 2023 and 2022 are as follows:\n2024\n2023\n2022\n(In thousands)\nUnrecognized tax benefits at the beginning of the fiscal year\n$\n94,311\n \n$\n126,073\n \n$\n130,530\n \nGross amount of the increase (decrease) in unrecognized tax benefits of tax positions taken during a prior year*\n10,109\n \n(\n1,401\n)\n2,152\n \nGross amount of the increases in unrecognized tax benefits as a result of tax positions taken during the current year\n6,669\n \n2,565\n \n2,660\n \nAmount of decreases in unrecognized tax benefits relating to settlements with taxing authorities, including the utilization of tax attributes\n—\n \n(\n8,000\n)\n—\n \nReductions to unrecognized tax benefits resulting from the lapse of the applicable statute of limitations\n(\n3,173\n)\n(\n24,768\n)\n(\n7,430\n)\nEffect of foreign currency translation\n(\n528\n)\n(\n158\n)\n(\n1,839\n)\nUnrecognized tax benefits at the end of the fiscal year\n$\n107,388\n \n$\n94,311\n \n$\n126,073\n \nTotal amounts of unrecognized tax benefits that, if upon resolution of the uncertain tax positions would reduce Cadence’s effective tax rate\n$\n106,420\n \n$\n93,398\n \n$\n121,415\n \n_____________\n* \nIncludes unrecognized tax benefits of tax positions recorded in connection with acquisitions\n79\nTable of Contents\nCadence is currently under examination or contesting proposed adjustments by various domestic and international taxing authorities. It is reasonably possible that the amount of unrecognized tax positions could decrease by approximately $\n9.4\n million during the next 12 months. The potential decrease could be a combination of settlements with tax authorities and expiration of statute of limitations. The actual amount could vary significantly depending on the ultimate timing and nature of any settlements or examinations in advance of statute of limitation expirations.\nThe total amounts of interest, net of tax, and penalties recognized in the consolidated income statements as provision for income taxes for fiscal 2024, 2023 and 2022 were as follows:\n \n2024\n2023\n2022\n(In thousands)\nInterest\n$\n3,893\n \n$\n2,282\n \n$\n434\n \nPenalties\n143\n \n267\n \n7\n \nThe total amounts of gross accrued interest and penalties recognized in the consolidated balance sheets as of December 31, 2024, and December 31, 2023, were as follows:\nAs of\nDecember 31,\n2024\nDecember 31,\n2023\n(In thousands)\nInterest\n$\n9,010\n \n$\n4,813\n \nPenalties\n1,261\n \n—\n \nNOTE 9. \nSTOCK COMPENSATION PLANS AND STOCK-BASED COMPENSATION\nEquity Incentive Plans\nCadence’s Omnibus Plan provides for the issuance of both incentive and non-qualified options, restricted stock awards, restricted stock units, stock bonuses and the rights to acquire restricted stock to both executive and non-executive employees. During fiscal 2023, Cadence’s stockholders approved an amendment to the Omnibus Plan to increase the number of shares of common stock authorized for issuance by \n6.5\n million. As of December 31, 2024, the total number of shares available for future issuance under the Omnibus Plan was \n14.0\n million. Options granted under the Omnibus Plan have an exercise price not less than the fair market value of the stock on the date of grant. Options and restricted stock generally vest over a period of \nthree years\n to \nfour years\n. Options granted under the Omnibus Plan expire \nseven years\n from the date of grant. Vesting of restricted stock awards granted under the Omnibus Plan may require the attainment of specified performance criteria.\nCadence’s 1995 Directors Stock Incentive Plan (the “Directors Plan”) provides for the issuance of non-qualified options, restricted stock awards and restricted stock units to its non-employee directors. Options granted under the Directors Plan have an exercise price not less than the fair market value of the stock on the date of grant. As of December 31, 2024, the total number of shares available for future issuance under the Directors Plan was \n0.4\n million. Options granted under the Directors Plan expire after \nten years\n, and options, restricted stock awards and restricted stock units vest \none year\n from the date of grant.\nCadence has assumed certain options granted to employees of acquired companies (“Acquired Options”). The Acquired Options were assumed by Cadence outside of its stock option plans, and each option is administered under the terms of the respective original plans of the acquired companies. All of the Acquired Options have been adjusted for the price conversion under the terms of the acquisition agreement between Cadence and the relevant acquired company. If the Acquired Options are canceled, forfeited or expire, they do not become available for future grant. \n80\nTable of Contents\nStock-Based Compensation\nStock-based compensation expense and the related income tax benefit recognized in connection with stock options, restricted stock and the ESPP during fiscal 2024, 2023 and 2022 were as follows:\n2024\n2023\n2022\n(In thousands)\nStock options\n$\n18,610\n \n$\n15,939\n \n$\n14,597\n \nRestricted stock\n338,082\n \n278,567\n \n224,887\n \nESPP\n34,527\n \n31,105\n \n30,955\n \nTotal stock-based compensation expense\n$\n391,219\n \n$\n325,611\n \n$\n270,439\n \nIncome tax benefit\n$\n66,080\n \n$\n50,994\n \n$\n40,612\n \nStock-based compensation expense is reflected in Cadence’s consolidated income statements during fiscal 2024, 2023 and 2022 as follows:\n2024\n2023\n2022\n(In thousands)\nCost of product and maintenance\n$\n6,402\n \n$\n4,500\n \n$\n3,818\n \nCost of services\n8,149\n \n5,728\n \n4,851\n \nMarketing and sales\n77,195\n \n66,304\n \n54,771\n \nResearch and development\n241,730\n \n194,709\n \n158,937\n \nGeneral and administrative\n57,743\n \n54,370\n \n48,062\n \nTotal stock-based compensation expense\n$\n391,219\n \n$\n325,611\n \n$\n270,439\n \nStock Options\nThe exercise price of each stock option granted under Cadence’s employee equity incentive plans is equal to or greater than the closing price of Cadence’s common stock on the date of grant. The fair value of each option grant is estimated on the date of grant using the Black-Scholes option pricing model. \nThe weighted average grant date fair value of options granted, and the weighted average assumptions used in the model for fiscal 2024, 2023 and 2022 were as follows:\n2024\n2023\n2022\nDividend yield\nNone\nNone\nNone\nExpected volatility\n31.9\n \n%\n32.6\n \n%\n36.0\n \n%\nRisk-free interest rate\n4.34\n \n%\n3.62\n \n%\n2.14\n \n%\nExpected term (in years)\n4.8\n5.0\n4.8\nWeighted average fair value of options granted\n$\n103.79\n \n$\n71.83\n \n$\n49.16\n \nA summary of the changes in stock options outstanding under Cadence’s equity incentive plans during fiscal 2024 is presented below:\nWeighted \nAverage\nWeighted \nAverage\nRemaining\nContractual\nTerms\nAggregate\nIntrinsic\nShares\nExercise Price\n(Years)\nValue\n(In thousands)\n(In thousands)\nOptions outstanding as of December 31, 2023\n2,367\n \n$\n107.93\n \nGranted\n212\n \n297.56\n \nExercised\n(\n1,231\n)\n72.19\n \nForfeited\n(\n26\n)\n138.02\n \nOptions outstanding as of December 31, 2024\n1,322\n \n$\n171.08\n \n4.0\n$\n170,973\n \nOptions vested as of December 31, 2024\n852\n \n$\n141.14\n \n3.3\n$\n135,744\n \n81\nTable of Contents\nCadence had total unrecognized compensation expense related to stock option grants of $\n33.3\n million as of December 31, 2024, which will be recognized over the remaining vesting period. The remaining weighted average vesting period of unvested awards is \n2.2\n years.\nThe total intrinsic value of and cash received from options exercised during fiscal 2024, 2023 and 2022 was:\n2024\n2023\n2022\n(In thousands)\nIntrinsic value of options exercised\n$\n266,336\n \n$\n139,125\n \n$\n105,242\n \nCash received from options exercised\n88,903\n \n30,940\n \n16,014\n \nRestricted Stock\nGenerally, restricted stock, which includes restricted stock awards and restricted stock units, vests over \nthree years\n to \nfour years\n and is subject to the employee’s continuing service to Cadence. Stock-based compensation expense is recognized ratably over the vesting term. The vesting of certain restricted stock grants is subject to attainment of specified performance criteria. Each fiscal quarter, Cadence estimates the probability of the achievement of these performance goals and recognizes any related stock-based compensation expense using the graded-vesting method. The amount of stock-based compensation expense recognized in any one period can vary based on the attainment or expected attainment of the various performance goals. If such performance goals are not ultimately met, no compensation expense is recognized and any previously recognized compensation expense is reversed. \nCertain long-term, market-based stock awards granted to executives vest over three to five years and are subject to certain market conditions and the executive’s continuing service to Cadence. Vesting of the market-based awards is contingent upon achieving market conditions of total shareholder return relative to a peer index. Stock-based compensation expense is recognized using the graded-vesting method over the vesting term. If the market-based conditions are not ultimately met, compensation expense previously recognized is not reversed. As of December 31, 2024, Cadence had \n1.6\n million shares of unvested long-term, market-based stock awards outstanding. \nCadence granted market-based awards in fiscal 2023 and fiscal 2022. No market-based awards were granted in fiscal 2024. Compensation expense is calculated using the fair value of the market-based stock awards under Monte Carlo simulation model. \nThe weighted average assumptions used in the model for fiscal 2023 and fiscal 2022 were as follows:\n2023\n2022\nDividend yield\nNone\nNone\nExpected volatility\n33.6\n \n%\n29.1\n \n%\nRisk-free interest rate\n3.64\n \n%\n1.98\n \n%\nExpected term (in years)\n3.8\n5.1\nWeighted average fair value of market-based awards granted\n$\n132.20\n \n$\n51.34\n \nStock-based compensation expense related to performance-based restricted stock grants and market-based restricted stock grants for fiscal 2024, 2023 and 2022 was as follows:\n2024\n2023\n2022\n(In thousands)\nStock-based compensation expense related to performance-based restricted stock\n$\n29,178\n \n$\n22,922\n \n$\n17,753\n \nStock-based compensation expense related to market-based stock awards\n19,934\n \n30,095\n \n25,259\n \n82\nTable of Contents\nA summary of the changes in restricted stock outstanding under Cadence’s equity incentive plans during fiscal 2024 is presented below:\nWeighted \nAverage  Grant Date\nAggregate\nIntrinsic\nShares\nFair Value\nValue\n(In thousands)\n(In thousands)\nUnvested shares as of December 31, 2023\n5,597\n \n$\n129.35\n \nGranted\n1,573\n \n310.81\n \nVested\n(\n2,233\n)\n142.37\n \nForfeited\n(\n380\n)\n115.06\n \nUnvested shares as of December 31, 2024\n4,557\n \n$\n186.79\n \n$\n1,153,219\n \nAs of December 31, 2024, Cadence had total unrecognized compensation expense related to restricted stock grants of $\n653.0\n million, which will be recognized over a weighted average vesting period of \n1.7\n years. \nThe total fair value realized by employees upon vesting of restricted stock during fiscal 2024, 2023 and 2022 was:\n2024\n2023\n2022\n(In thousands)\nFair value of restricted stock realized upon vesting\n$\n649,152\n \n$\n442,556\n \n$\n346,003\n \nEmployee Stock Purchase Plan\nCadence provides an ESPP that enables eligible employees to purchase shares of its common stock. Offering periods under the plan last a duration of \nsix months\n beginning on either February 1 or August 1, with the purchase dates falling on the last day of the six-month offering period. For the offering periods commencing after February 1, 2022, eligible employees may purchase Cadence’s common stock at a price equal to \n85\n% of the lower of the fair market value at the beginning or the end of the applicable offering period, in an amount not to exceed \n15\n% of their annual base earnings plus bonuses and commissions, and subject to a limit in any calendar year of $\n25,000\n. The ESPP may be amended from time to time. During fiscal 2024, Cadence's stockholders approved an amendment to Cadence's Employee Stock Purchase Plan to increase the number of shares of common stock authorized for issuance by \n3.5\n million. As of December 31, 2024, the total number of shares available for future issuance under the ESPP was \n6.2\n million.\nCompensation expense is calculated using the fair value of the employees’ purchase rights under the Black-Scholes option pricing model. \nThe weighted average grant date fair value of purchase rights granted under the ESPP and the weighted average assumptions used in the model for fiscal 2024, 2023 and 2022 were as follows:\n2024\n2023\n2022\nDividend yield\nNone\nNone\nNone\nExpected volatility\n32.1\n \n%\n29.9\n \n%\n37.2\n \n%\nRisk-free interest rate\n5.11\n \n%\n4.50\n \n%\n1.71\n \n%\nExpected term (in years)\n0.5\n0.5\n0.5\nWeighted average fair value of purchase rights granted\n$\n65.50\n \n$\n50.95\n \n$\n43.41\n \nShares of common stock issued under the ESPP for fiscal 2024, 2023 and 2022 were as follows:\n2024\n2023\n2022\n(In thousands, except per share amounts)\nCadence shares purchased under the ESPP\n548\n \n647\n \n703\n \nCash received for the purchase of shares under the ESPP\n$\n115,335\n \n$\n102,017\n \n$\n89,314\n \nWeighted average purchase price per share\n$\n210.31\n \n$\n157.70\n \n$\n127.12\n \n83\nTable of Contents\nReserved for Future Issuance\nAs of December 31, 2024, Cadence had reserved the following shares of authorized but unissued common stock for future issuance:\nShares\n(In thousands)\nEmployee equity incentive plans*\n18,456\n \nEmployee stock purchase plans\n6,232\n \nDirectors stock plans*\n431\n \n    Total\n25,119\n \n_____________\n  *\nIncludes shares reserved for: (i) issuance upon exercise of future option grants, (ii) issuance upon vesting of future restricted stock grants, (iii) outstanding but unexercised options to purchase common stock, or (iv) unvested restricted stock units.\nNOTE 10. \nSTOCK REPURCHASE PROGRAMS\nCadence is authorized to repurchase shares of its common stock under a publicly announced program that was most recently increased by its Board of Directors in August 2023. The actual timing and amount of repurchases are subject to business and market conditions, corporate and regulatory requirements, stock price, acquisition opportunities and other factors.\nDuring fiscal 2024, Cadence repurchased approximately \n1.9\n million shares on the open market for an aggregate purchase price of $\n550.0\n million. As of December 31, 2024, approximately $\n0.8\n billion of the share repurchase authorization remained available to repurchase shares of Cadence common stock.\nDuring fiscal 2023, Cadence repurchased approximately \n2.3\n million shares on the open market for an aggregate purchase price of $\n500.0\n million. In June 2023, Cadence also entered into an accelerated share repurchase (“ASR”) agreement with HSBC Bank USA, National Association (“HSBC”) to repurchase an aggregate of $\n200.0\n million of Cadence common stock. The ASR agreement was accounted for as two separate transactions (1) a repurchase of common stock and (2) an equity-linked contract on Cadence’s own stock. In June 2023, Cadence received an initial share delivery of approximately \n0.6\n million shares, which represented the number of shares at a market price equal to $\n140.0\n million. An equity-linked contract for $\n60.0\n million, representing the remaining shares to be delivered by HSBC under the ASR agreement, was recorded to stockholders' equity as of June 30, 2023. In August 2023, the ASR agreement settled and resulted in a delivery of approximately \n0.3\n million additional shares to Cadence. In total, Cadence received approximately \n0.9\n million shares under the ASR agreement at an average price per share of $\n228.26\n. The shares received were treated as repurchased common stock for purposes of calculating earnings per share.\nDuring fiscal 2022, Cadence repurchased approximately \n6.0\n million shares on the open market for an aggregate purchase price of $\n950.1\n million. In June 2022, Cadence also entered into an ASR agreement with Royal Bank of Canada to repurchase an aggregate of $\n100.0\n million of Cadence common stock. The ASR agreement was accounted for as two separate transactions (1) a repurchase of common stock and (2) an equity-linked contract on Cadence’s own stock. In June 2022, Cadence received an initial share delivery of approximately \n0.5\n million shares, which represented the number of shares at a market price equal to $\n70.0\n million. An equity-linked contract for $\n30.0\n million, representing the remaining shares to be delivered by Royal Bank of Canada under the ASR agreement, was recorded to stockholders’ equity. In September 2022, the ASR agreement settled and resulted in a delivery to Cadence of approximately \n0.1\n million additional shares. In total, approximately \n0.6\n million shares were repurchased under the ASR agreement at an average price per share of $\n167.07\n. The shares received were treated as a repurchase of common stock for purposes of calculating earnings per share.\nThe shares repurchased under Cadence’s repurchase authorizations and the total cost of repurchased shares, including commissions, during fiscal 2024, 2023 and 2022 were as follows:\n2024\n2023*\n2022**\n(In thousands)\nShares repurchased\n1,930\n \n3,145\n \n6,602\n \nTotal cost of repurchased shares\n$\n550,026\n \n$\n700,134\n \n$\n1,050,091\n \n_____________\n*\nIncludes \n276\n thousand shares and $\n60\n million equity forward contract from the June 2023 ASR settled in August 2023, and excludes $\n0.9\n million of excise tax.\n**\nIncludes \n109\n thousand shares and $\n30\n million equity forward contract from the June 2022 ASR settled in September 2022.\n84\nTable of Contents\nNOTE 11. \nRESTRUCTURING AND OTHER CHARGES\nFrom time to time, Cadence has initiated various restructuring plans in an effort to better align its resources with its business strategy. The most recent of these plans was initiated in August 2024 (the “2024 Restructuring Plan”). The charges incurred with the 2024 Restructuring Plan were comprised of severance payments and termination benefits related to headcount reductions and are included in restructuring on Cadence’s consolidated income statements. \nThe following table presents activity for Cadence’s restructuring plans during fiscal 2024, 2023 and 2022:\nSeverance\nand\nBenefits\nExcess\nFacilities\nTotal\n(In thousands)\nBalance, January 1, 2022\n$\n—\n \n$\n43\n \n$\n43\n \nRestructuring\n—\n \n55\n \n55\n \nCash payments\n—\n \n(\n98\n)\n(\n98\n)\nEffect of foreign currency translation\n—\n \n—\n \n—\n \nBalance, December 31, 2022\n$\n—\n \n$\n—\n \n$\n—\n \nRestructuring\n10,935\n \n78\n \n11,013\n \nNon-cash changes\n—\n \n(\n78\n)\n(\n78\n)\nCash payments\n(\n8,211\n)\n—\n \n(\n8,211\n)\nEffect of foreign currency translation\n(\n121\n)\n—\n \n(\n121\n)\nBalance, December 31, 2023\n$\n2,603\n \n$\n—\n \n$\n2,603\n \nRestructuring \n22,735\n \n1,030\n \n23,765\n \nNon-cash changes\n—\n \n(\n1,030\n)\n(\n1,030\n)\nCash payments\n(\n20,464\n)\n—\n \n(\n20,464\n)\nEffect of foreign currency translation\n(\n147\n)\n—\n \n(\n147\n)\nBalance, December 31, 2024\n$\n4,727\n \n$\n—\n \n$\n4,727\n \nAll liabilities for severance and related benefits under the 2024 Restructuring Plan are included in accounts payable and accrued liabilities on Cadence’s consolidated balance sheet as of December 31, 2024. Cadence expects to make cash payments to settle these liabilities through fiscal 2025.\nNOTE 12. \nOTHER INCOME (EXPENSE), NET\nCadence’s other income (expense), net, for fiscal 2024, 2023 and 2022 was as follows:\n \n2024\n2023\n2022\n \n(In thousands)\nInterest income\n$\n62,484\n \n$\n29,637\n \n$\n10,099\n \nGains (losses) on investments\n49,593\n \n34,602\n \n(\n5,425\n)\nGains (losses) on securities in NQDC trust\n11,145\n \n10,851\n \n(\n8,744\n)\nLosses on foreign exchange\n(\n965\n)\n(\n5,490\n)\n(\n459\n)\nOther expense, net\n(\n1,202\n)\n(\n2,714\n)\n(\n860\n)\nTotal other income (expense), net\n$\n121,055\n \n$\n66,886\n \n$\n(\n5,389\n)\nFor additional information relating to Cadence’s investment activity, see Note 14 in the notes to consolidated financial statements.\n85\nTable of Contents\nNOTE 13. \nNET INCOME PER SHARE\nBasic net income per share is computed by dividing net income during the period by the weighted average number of shares of common stock outstanding during that period, less unvested restricted stock awards. Diluted net income per share is impacted by equity instruments considered to be potential common shares, if dilutive, computed using the treasury stock method of accounting.\nThe calculations for basic and diluted net income per share for fiscal 2024, 2023 and 2022 are as follows:\n \n2024\n2023\n2022\n \n(In thousands, except per share amounts)\nNet income\n$\n1,055,484\n \n$\n1,041,144\n \n$\n848,952\n \nWeighted average common shares used to calculate basic net income per share\n271,212\n \n269,381\n \n271,198\n \nStock-based awards\n2,621\n \n3,367\n \n3,813\n \nWeighted average common shares used to calculate diluted net income per share\n273,833\n \n272,748\n \n275,011\n \nNet income per share – basic\n$\n3.89\n \n$\n3.86\n \n$\n3.13\n \nNet income per share – diluted\n$\n3.85\n \n$\n3.82\n \n$\n3.09\n \nThe following table presents shares of Cadence’s common stock outstanding for fiscal 2024, 2023 and 2022 that were excluded from the computation of diluted net income per share because the effect of including these shares in the computation of diluted net income per share would have been anti-dilutive: \n \n2024\n2023\n2022\n \n(In thousands)\nLong-term market-based awards\n—\n \n1,381\n \n1,565\n \nOptions to purchase shares of common stock \n184\n \n345\n \n716\n \nNon-vested shares of restricted stock\n258\n \n232\n \n88\n \nTotal potential common shares excluded\n442\n \n1,958\n \n2,369\n \nNOTE 14. \nINVESTMENTS\nInvestments in Equity Securities\nMarketable Equity Investments\nCadence’s investments in marketable equity securities consist of purchased shares of publicly held companies and are included in prepaid expenses and other in Cadence’s consolidated balance sheets. Changes in the fair value of these investments are recorded to other income (expense), net in Cadence’s consolidated income statements. The carrying value of marketable equity investments was $\n90.4\n million and $\n80.6\n million as of December 31, 2024, and December 31, 2023, respectively.\nNon-Marketable Equity Investments\nCadence’s investments in non-marketable equity securities generally consist of stock or other instruments of privately held entities and are included in other assets on Cadence’s consolidated balance sheets. Cadence holds a \n16\n% interest in a privately held company that is accounted for using the equity method of accounting. The carrying value of this investment was $\n97.5\n million and $\n111.1\n million as of December 31, 2024 and December 31, 2023, respectively. \nCadence records its proportionate share of net income from the investee, offset by amortization of basis differences, to other income, net in Cadence’s consolidated income statements. Cadence recognized losses of $\n2.5\n million, $\n2.7\n million\n \nand $\n3.6\n million during fiscal 2024, 2023 and 2022, respectively.\nCadence also holds other non-marketable investments in privately held companies where Cadence does not have the ability to exercise significant influence and the fair value of the investments is not readily determinable. The carrying value of these investments was $\n26.6\n million and $\n27.2\n million as of December 31, 2024 and December 31, 2023, respectively. Gains and losses on these investments were not material to Cadence’s consolidated financial statements for the periods presented.\n86\nTable of Contents\nThe portion of gains and losses included in Cadence’s consolidated income statements related to equity securities still held at the end of the period were as follows:\n2024\n2023\n2022\n(In thousands)\nNet gains (losses) recognized on equity securities\n$\n49,653\n \n$\n34,651\n \n$\n(\n5,336\n)\nLess: Net gains recognized on equity securities sold\n(\n20,367\n)\n(\n12,283\n)\n—\n \nNet gains (losses) recognized on equity securities still held\n$\n29,286\n \n$\n22,368\n \n$\n(\n5,336\n)\nInvestments in Debt Securities\nThe following is a summary of Cadence’s available-for-sale debt securities recorded within prepaid expenses and other on its consolidated balance sheets:\n \nAs of December 31, 2024\n  \nAmortized Cost\nGross Unrealized Gains\nGross Unrealized Losses\nEstimated\nFair Value\n \n(In thousands)\nAvailable-for-sale debt securities\nMortgage-backed and asset-backed securities\n$\n50,604\n \n$\n230\n \n$\n(\n582\n)\n$\n50,252\n \nTotal available-for-sale securities\n$\n50,604\n \n$\n230\n \n$\n(\n582\n)\n$\n50,252\n \n \nAs of December 31, 2023\n  \nAmortized Cost\nGross Unrealized Gains\nGross Unrealized Losses\nEstimated\nFair Value\n \n(In thousands)\nAvailable-for-sale debt securities\nMortgage-backed and asset-backed securities\n$\n49,653\n \n$\n375\n \n$\n(\n243\n)\n$\n49,785\n \nTotal available-for-sale securities\n$\n49,653\n \n$\n375\n \n$\n(\n243\n)\n$\n49,785\n \nGross unrealized gains and losses are recorded as a component of accumulated other comprehensive loss on Cadence’s consolidated balance sheets. As of December 31, 2024, the fair value of available-for-sale debt securities in a continuous unrealized loss position for greater than 12 months was $\n6.0\n million, and the unrealized losses on these securities were not material.\nAs of December 31, 2024, the fair values of available-for-sale debt securities, by remaining contractual maturity, were as follows:\n \n(In thousands)\nDue within 1 year\n$\n569\n \nDue after 1 year through 5 years\n9,294\n \nDue after 5 years through 10 years\n17,882\n \nDue after 10 years\n22,507\n \nTotal\n$\n50,252\n \nAs of December 31, 2024, Cadence did not intend to sell any of its available-for-sale debt securities in an unrealized loss position, and it was more likely than not that Cadence will hold the securities until maturity or a recovery of the cost basis.\n87\nTable of Contents\nNOTE 15. \nFAIR VALUE\nInputs to valuation techniques are observable or unobservable. Observable inputs reflect market data obtained from independent sources, while unobservable inputs reflect Cadence’s market assumptions. These two types of inputs have created the following fair value hierarchy:\n•\nLevel 1\n – Quoted prices for identical instruments in active markets;\n•\nLevel 2\n – Quoted prices for similar instruments in active markets, quoted prices for identical or similar instruments in markets that are not active, and model-derived valuations in which all significant inputs and significant value drivers are observable in active markets; and\n•\nLevel 3\n – Valuations derived from valuation techniques in which one or more significant inputs or significant value drivers are unobservable.\nThis hierarchy requires Cadence to minimize the use of unobservable inputs and to use observable market data, if available, when determining fair value. Cadence recognizes transfers between levels of the hierarchy based on the fair values of the respective financial instruments at the end of the reporting period in which the transfer occurred.\n There were no transfers between levels of the fair value hierarchy during the fiscal years presented.\n On a quarterly basis, Cadence measures at fair value certain financial assets and liabilities. \nThe fair value of financial assets and liabilities was determined using the following levels of inputs as of December 31, 2024, and December 31, 2023:\n \nFair Value Measurements as of December 31, 2024\n  \nTotal\nLevel 1\nLevel 2\nLevel 3\n \n(In thousands)\nAssets\nCash equivalents:\nMoney market funds\n$\n1,700,084\n \n$\n1,700,084\n \n$\n—\n \n$\n—\n \nMarketable securities:\nMarketable equity securities\n90,374\n \n90,374\n \n—\n \n—\n \nMortgage-backed and asset-backed securities\n50,252\n \n—\n \n50,252\n \n—\n \nSecurities held in NQDC trust\n96,450\n \n96,450\n \n—\n \n—\n \nTotal Assets\n$\n1,937,160\n \n$\n1,886,908\n \n$\n50,252\n \n$\n—\n \n  \nTotal\nLevel 1\nLevel 2\nLevel 3\n \n(In thousands)\nLiabilities\nForeign currency exchange contracts\n7,533\n \n—\n \n7,533\n \n—\n \nTotal Liabilities\n$\n7,533\n \n$\n—\n \n$\n7,533\n \n$\n—\n \n \nFair Value Measurements as of December 31, 2023\n  \nTotal\nLevel 1\nLevel 2\nLevel 3\n \n(In thousands)\nAssets\nCash equivalents:\nMoney market funds\n$\n490,983\n \n$\n490,983\n \n$\n—\n \n$\n—\n \nMarketable securities:\nMarketable equity securities\n80,575\n \n80,575\n \n—\n \n—\n \nMortgage-backed and asset-backed securities\n49,785\n \n—\n \n49,785\n \n—\n \nSecurities held in NQDC trust\n75,671\n \n75,671\n \n—\n \n—\n \nForeign currency exchange contracts\n9,327\n \n—\n \n9,327\n \n—\n \nTotal Assets\n$\n706,341\n \n$\n647,229\n \n$\n59,112\n \n$\n—\n \nAs of December 31, 2023, Cadence did not have any financial liabilities requiring a recurring fair value measurement.\n88\nTable of Contents\nLevel 1 Measurements\nCadence’s cash equivalents held in money market funds, marketable equity securities and the trading securities held in Cadence’s NQDC trust are measured at fair value using Level 1 inputs.\nLevel 2 Measurements\nThe valuation techniques used to determine the fair value of Cadence’s investments in marketable debt securities, foreign currency forward exchange contracts and Senior Notes are classified within Level 2 of the fair value hierarchy. For additional information relating to Cadence’s debt arrangements, see Note 5 in the notes to consolidated financial statements.\nLevel 3 Measurements\nDuring fiscal 2024, Cadence acquired intangible assets of $\n366.0\n million, primarily through its acquisitions of BETA CAE and Invecas. The fair value of the intangible assets acquired was determined using variations of the income approach that utilizes unobservable inputs classified as Level 3 measurements.\nFor existing technology, the fair value was determined by applying the relief-from-royalty method. This method is based on the application of a royalty rate to forecasted revenue to quantify the benefit of owning the intangible asset rather than paying a royalty for use of the asset. To estimate royalty savings over time, Cadence projected revenue from the acquired existing technology over the estimated remaining life of the technology, including the effect of assumed technological obsolescence, before applying an assumed royalty rate. Cadence assumed technological obsolescence at a rate of \n10\n% annually, before applying an assumed royalty rate of \n30\n% and a discount rate of \n10\n%.\nFor agreements and relationships, the fair value was determined by using the multi-period excess earnings method. This method reflects the present value of the projected cash flows that are expected to be generated from existing customers, less charges representing the contribution of other assets to those cash flows. Projected income from existing customer relationships was determined using customer retention rates between \n85\n% and \n92\n%. The present value of operating cash flows from existing customers was determined using discount rates between \n10\n% and \n14\n%.\nDuring fiscal 2023, Cadence acquired intangible assets of $\n41.0\n million. The fair value of the intangible assets acquired was determined using variations of the income approach that utilizes unobservable inputs classified as Level 3 measurements.\nFor existing technology, the fair value was determined by applying the relief-from-royalty method. This method is based on the application of a royalty rate to forecasted revenue to quantify the benefit of owning the intangible asset rather than paying a royalty for use of the asset. To estimate royalty savings over time, Cadence projected revenue from the acquired existing technology over the estimated remaining life of the technology, including the effect of assumed technological obsolescence, before applying an assumed royalty rate. Cadence assumed technological obsolescence at rates between \n10\n% and \n13\n% annually, before applying an assumed royalty rate between \n25\n% and \n30\n%.\nFor agreements and relationships, the fair value was determined by using the multi-period excess earnings method. This method reflects the present value of the projected cash flows that are expected to be generated from existing customers, less charges representing the contribution of other assets to those cash flows. Projected income from existing customer relationships was determined using customer retention rates between \n70\n% and \n90\n%. The present value of operating cash flows from existing customers was determined using discount rates between \n12\n% and \n15\n%.\nCadence believes that its estimates and assumptions related to the fair value of its acquired intangible assets and assumed liabilities are reasonable, but significant judgment is involved.\n89\nTable of Contents\nNOTE 16. \nBALANCE SHEET COMPONENTS \nA summary of certain balance sheet components as of December 31, 2024, and December 31, 2023, is as follows:\nAs of\nDecember 31,\n2024\nDecember 31,\n2023\n(In thousands)\nInventories:\nRaw materials\n$\n243,244\n \n$\n162,754\n \nWork-in-process\n1,216\n \n—\n \nFinished goods\n13,251\n \n18,907\n \nInventories\n$\n257,711\n \n$\n181,661\n \nPrepaid expenses and other:\nShort-term investments\n140,625\n \n130,359\n \nOther prepaid expenses and other assets\n293,253\n \n166,821\n \nPrepaid expenses and other\n$\n433,878\n \n$\n297,180\n \nProperty, plant and equipment:\nEquipment and internal-use software\n$\n875,399\n \n$\n781,683\n \nBuildings\n137,781\n \n131,882\n \nLand\n57,687\n \n56,641\n \nLeasehold, building and land improvements\n245,669\n \n211,854\n \nFurniture and fixtures\n43,517\n \n39,998\n \nIn-process capital assets\n14,879\n \n17,937\n \nTotal cost\n1,374,932\n \n1,239,995\n \nLess: Accumulated depreciation and amortization\n(\n916,732\n)\n(\n836,782\n)\nProperty, plant and equipment, net\n$\n458,200\n \n$\n403,213\n \nOther assets:\nNon-marketable investments\n$\n124,086\n \n$\n138,321\n \nROU lease assets\n146,190\n \n150,797\n \nOther long-term assets\n274,465\n \n248,254\n \nOther assets\n$\n544,741\n \n$\n537,372\n \nAccounts payable and accrued liabilities:\nTrade accounts payable\n$\n5,555\n \n$\n91,194\n \nPayroll and payroll-related accruals\n335,232\n \n294,108\n \nOther accrued operating liabilities\n291,905\n \n191,256\n \nAccounts payable and accrued liabilities\n$\n632,692\n \n$\n576,558\n \nOther long-term liabilities:\nOperating lease liabilities\n$\n108,893\n \n$\n115,358\n \nOther accrued liabilities\n230,555\n \n160,293\n \nOther long-term liabilities\n$\n339,448\n \n$\n275,651\n \n90\nTable of Contents\nNOTE 17. \nLEASES\nOperating lease expense, which includes immaterial amounts of short-term leases, variable lease costs and sublease income, was as follows during fiscal 2024, 2023 and 2022:\n2024\n2023\n2022\n(In thousands)\nOperating lease expense\n$\n61,827\n \n$\n56,805\n \n$\n49,165\n \nAdditional activity related to Cadence’s leases during fiscal 2024, 2023 and 2022 was as follows:\n2024\n2023\n2022\n(In thousands)\nCash paid for amounts included in the measurement of operating lease liabilities\n$\n49,978\n \n$\n46,069\n \n$\n34,334\n \nROU assets obtained in exchange for operating lease obligations\n42,614\n \n32,597\n \n83,758\n \nROU lease assets and lease liabilities for Cadence’s operating leases were recorded in the consolidated balance sheets as follows:\nAs of\nDecember 31,\n2024\nDecember 31,\n2023\n(In thousands)\nOther assets\n$\n146,190\n \n$\n150,797\n \nAccounts payable and accrued liabilities\n41,554\n \n41,619\n \nOther long-term liabilities\n108,893\n \n115,358\n \nTotal lease liabilities\n$\n150,447\n \n$\n156,977\n \nWeighted average remaining lease term (in years)\n5.3\n5.7\nWeighted average discount rate\n4\n \n%\n4\n \n%\nFuture lease payments included in the measurement of lease liabilities on the consolidated balance sheet as of December 31, 2024, for the following five fiscal years and thereafter were as follows:\nOperating\n Leases\n(In thousands)\n2025\n$\n45,456\n \n2026\n36,750\n \n2027\n23,178\n \n2028\n19,048\n \n2029\n15,136\n \nThereafter\n29,783\n \nTotal future lease payments\n169,351\n \nLess imputed interest\n(\n18,904\n)\nTotal lease liability balance\n$\n150,447\n \nAs of December 31, 2024, Cadence had additional operating lease obligations of approximately $\n4.2\n million for facility leases that will commence in 2025.\n \n91\nTable of Contents\nNOTE 18. \nCOMMITMENTS AND CONTINGENCIES\nPurchase Obligations\nCadence had purchase obligations of $\n78.3\n million as of December 31, 2024, that were associated with agreements or commitments for purchases of goods or services. Cadence expects to settle these obligations in the following five fiscal years and thereafter as follows:\nPurchase\nObligations\n(In thousands)\n2025\n$\n58,893\n \n2026\n16,084\n \n2027\n1,951\n \n2028\n1,204\n \n2029\n130\n \nThereafter\n—\n \nTotal\n78,262\n \nLegal Proceedings\nFrom time to time, Cadence is involved in various disputes and litigation that arise in the ordinary course of business. These include disputes and legal proceedings related to IP, indemnification obligations, mergers and acquisitions, licensing, contracts, customers, products, distribution and other commercial arrangements and employee relations matters. Cadence is also subject from time to time to inquiries, investigations and regulatory proceedings involving governments and regulatory agencies in the jurisdictions in which Cadence operates, including the ongoing investigations by the Bureau of Industry and Security (“BIS”) of the U.S. Department of Commerce and the U.S. Department of Justice (“DOJ”) regarding certain historical sales by Cadence to customers in China. \nAt least quarterly, Cadence reviews the status of each significant matter and assesses its potential financial exposure. If the potential loss from any claim or legal proceeding is considered probable and the amount or the range of loss can be estimated, Cadence accrues a liability for the estimated loss. Legal proceedings are subject to uncertainties, and the outcomes are difficult to predict. Because of such uncertainties, accruals are based on Cadence’s judgments using the best information available at the time. As additional information becomes available, Cadence reassesses the potential liability related to pending claims and legal proceedings and may revise estimates.\nAs previously disclosed, Cadence has been responding to subpoenas received from BIS in February 2021 and DOJ in November 2023 regarding sales and business activity in China. In December 2024, Cadence began discussions with BIS and DOJ regarding their preliminary findings and a potential resolution. Although Cadence believes it has defenses to the potential claims, Cadence recorded an estimated probable liability as of December 31, 2024 that is immaterial to Cadence's consolidated financial statements. Actual losses could differ materially.\nTax Proceedings\nIn December 2022, Cadence received a tax audit assessment, primarily related to value-added taxes, of approximately $\n49\n million from the Korea taxing authorities for years 2017-2019. Cadence was required to pay these assessed taxes, prior to being allowed to contest or litigate the assessment in administrative and judicial proceedings. The assessment was paid by Cadence in January 2023 and was recorded as a component of other assets in the consolidated balance sheets. During August 2024, the Tax Tribunal cancelled the entire tax audit assessment, and during the fourth quarter of fiscal 2024, Cadence received a refund of the payment previously made to the Korea taxing authorities plus interest.\n \nOther Contingencies\nCadence provides its customers with a warranty on sales of hardware products, generally for a 90-day period. Cadence did not incur any significant costs related to warranty obligations during fiscal 2024, 2023 or 2022.\nCadence’s product license and services agreements typically include a limited indemnification provision for claims from third parties relating to Cadence’s IP. If the potential loss from any indemnification claim is considered probable and the amount or the range of loss can be estimated, Cadence accrues a liability for the estimated loss. \n Cadence did not incur any material losses from indemnification claims during fiscal 2024, 2023 or 2022.\n92\nTable of Contents\nNOTE 19. \nEMPLOYEE AND DIRECTOR BENEFIT PLANS\nCadence maintains various defined contribution plans for its eligible U.S. and non-U.S. employees. For employees in the United States, Cadence maintains a 401(k) savings plan to provide retirement benefits through tax-deferred salary deductions and may make discretionary contributions, as determined by the Board of Directors, which cannot exceed a specified percentage of the annual aggregate salaries of those employees eligible to participate. \nCadence’s total contributions made to these plans during fiscal 2024, 2023 and 2022 were as follows:\n2024\n2023\n2022\n(In thousands)\nContributions to defined contribution plans\n$\n45,164\n \n$\n39,651\n \n$\n35,464\n \nExecutive Officers and Directors may also elect to defer compensation payable to them under Cadence’s NQDC. Deferred compensation payments are held in investment accounts and the values of the accounts are adjusted each quarter based on the fair value of the investments held in the NQDC. These investments are classified in other assets in the consolidated balance sheets and gains and losses are recognized as other income (expense), net in the consolidated income statements.\nCertain of Cadence’s international subsidiaries sponsor defined benefit retirement plans. The unfunded projected benefit obligation for Cadence’s defined benefit retirement plans is recorded in other long-term liabilities in the consolidated balance sheets.\nNOTE 20. \nACCUMULATED OTHER COMPREHENSIVE LOSS\nCadence’s accumulated other comprehensive loss is comprised of the aggregate impact of foreign currency translation gains and losses, changes in defined benefit plan liabilities and unrealized gains and losses on investments and is presented in Cadence’s consolidated statements of comprehensive income.\nAccumulated other comprehensive loss was comprised of the following as of December 31, 2024, and December 31, 2023:\nAs of\nDecember 31,\n2024\nDecember 31,\n2023\n \n(In thousands)\nForeign currency translation loss\n$\n(\n178,611\n)\n$\n(\n90,678\n)\nChanges in defined benefit plan liabilities\n(\n4,447\n)\n(\n4,208\n)\nUnrealized losses on derivatives designated as hedging instruments\n(\n7,038\n)\n—\n \nUnrealized gains (losses) on available-for-sale debt securities\n(\n352\n)\n132\n \nTotal accumulated other comprehensive loss\n$\n(\n190,448\n)\n$\n(\n94,754\n)\nDuring the third quarter of fiscal 2024, in anticipation of issuing the New Notes, Cadence entered into a series of treasury lock agreements which fixed benchmark U.S. Treasury rates for an aggregate notional amount of $\n850\n million to hedge the impact of changes in the benchmark interest rate on future interest payments. Upon issuance of the New Notes in September 2024, Cadence settled the treasury lock agreements and incurred a loss of $\n9.7\n million, which will be amortized to interest expense using the effective interest method over the term of the 2034 Notes.\nFor fiscal 2024, 2023 and 2022, there were no significant amounts related to foreign currency translation loss or changes in defined benefit plan liabilities reclassified to net income from accumulated other comprehensive loss.\n \nNOTE 21. \nSEGMENT REPORTING\nSegment reporting is based on the “management approach,” following the method that management organizes the company’s reportable segments for which separate financial information is made available to, and evaluated regularly by, the chief operating decision maker in allocating resources and in assessing performance. Cadence operates as \none\n operating segment. Cadence’s chief operating decision maker (“CODM”) is its CEO. The CODM makes decisions on resource allocation and assesses performance of the business based on Cadence’s consolidated results, including net income.\n93\nTable of Contents\nFor additional information on Cadence’s revenue, including the nature and timing of revenue from contracts with customers, see Note 3 in the notes to consolidated financial statements. \nThe following table presents revenue, significant expenses and net income for fiscal 2024, 2023 and 2022:\n \n2024\n2023\n2022\n \n(In thousands)\nRevenue\n4,641,264\n \n4,089,986\n \n3,561,718\n \nCosts and Expenses:\nSalary, benefits and other employee-related costs\n1,936,542\n \n1,754,223\n \n1,574,910\n \nStock based compensation\n391,219\n \n325,611\n \n270,439\n \nManufacturing costs\n330,903\n \n232,012\n \n173,160\n \nFacilities and other infrastructure costs\n174,102\n \n156,977\n \n139,150\n \nDepreciation and amortization\n196,935\n \n145,292\n \n132,088\n \nProfessional Services\n153,439\n \n117,752\n \n117,442\n \nRestructuring\n23,765\n \n11,013\n \n55\n \nOther segment items \n(1)\n25,025\n \n58,632\n \n96,276\n \nInterest income\n(\n62,484\n)\n(\n29,637\n)\n(\n10,099\n)\nInterest expense\n75,999\n \n36,185\n \n22,934\n \nProvision for income taxes\n340,335\n \n240,782\n \n196,411\n \nNet income\n$\n1,055,484\n \n$\n1,041,144\n \n$\n848,952\n \n_____________\n (1) \nOther segment items includes direct costs for advertising, marketing events, travel, entertainment, bad debt and other operating expense categories that are not considered significant individually. It also includes non-operating expenses such as gains and losses on investments, foreign currency and other non-operating expenses that are not considered significant individually.\nOutside the United States, Cadence markets and supports its products and services primarily through its subsidiaries. Revenue is attributed to geography based upon the country in which the product is used, or services are delivered. Long-lived assets are attributed to geography based on the country where the assets are located.\nThe following table presents a summary of revenue by geography for fiscal 2024, 2023 and 2022:\n \n2024\n2023\n2022\n \n(In thousands)\nAmericas:\nUnited States\n$\n2,159,703\n \n$\n1,694,529\n \n$\n1,577,881\n \nOther Americas\n93,101\n \n65,259\n \n53,123\n \nTotal Americas\n2,252,804\n \n1,759,788\n \n1,631,004\n \nAsia:\nChina\n573,096\n \n679,538\n \n521,509\n \nOther Asia\n855,919\n \n766,409\n \n629,533\n \nTotal Asia\n1,429,015\n \n1,445,947\n \n1,151,042\n \nEurope, Middle East and Africa\n699,241\n \n655,078\n \n582,350\n \nJapan\n260,204\n \n229,173\n \n197,322\n \nTotal\n$\n4,641,264\n \n$\n4,089,986\n \n$\n3,561,718\n \n94\nTable of Contents\nThe following table presents a summary of long-lived assets by geography as of December 31, 2024, December 31, 2023, and December 31, 2022: \n \nAs of\n \nDecember 31,\n2024\nDecember 31,\n2023\nDecember 31,\n2022\n \n(In thousands)\nAmericas:\nUnited States\n$\n412,339\n \n$\n383,807\n \n$\n347,822\n \nOther Americas\n7,437\n \n10,219\n \n7,548\n \nTotal Americas\n419,776\n \n394,026\n \n355,370\n \nAsia:\nChina\n22,929\n \n29,598\n \n51,667\n \nOther Asia\n83,951\n \n71,365\n \n73,329\n \nTotal Asia\n106,880\n \n100,963\n \n124,996\n \nEurope, Middle East and Africa\n73,551\n \n56,449\n \n56,959\n \nJapan\n4,183\n \n2,572\n \n4,505\n \nTotal\n$\n604,390\n \n$\n554,010\n \n$\n541,830\n \n95\nTable of Contents\nEXHIBIT INDEX\n \nIncorporated by Reference\nExhibit\nExhibit\nFiling\nProvided\nNumber\nExhibit Title\nForm\nFile No.\nNo.\nDate\nHerewith\n2.\n1\nS\nhare Purchase Agreement related to BETA CAE Systems Inter\nnational AG and BETA CAE Systems SA, dated March 2, 2024.\n10-Q\n000-15867\n2.1\n4/24/2024\n3.\n1\nThe Registrant’s Restated Certificate of Incorporation, as filed with the Secretary of State of the State of Delaware on \nMay 3, 2024\n.\n8-K\n000-15867\n3.1\n5/6/2024\n3.\n2\nThe Registrant’s Amended and Restated Bylaws, effective as of November 2, 2023.\n8-K\n000-15867\n3.1\n11/3/2023\n4.1\nSpecimen Certificate of the Registrant’s Common Stock.\nS-4\n033-43400\n4.01\n10/17/1991\n4.\n2\nBase Indenture, dated \nSeptember\n 10, 2024\n, \nby and \nbetween the Registrant and \nU.S. Bank Trust Company, National Association\n, as trustee.\n8-K\n000-15867\n4.1\n9/10/2024\n4.\n3\nFirst Supplemental Indenture, dated \nSeptember 10, 2024\n,\n by and\n between the Registrant and \nU.S. Bank Trust Company, National Association\n, as trustee (including the Form of\n 4.200%\n Senior Notes due 2027, \nthe Form of 4.300% Senior Notes due 2029 and the Form of 4.700% Senior Notes due \n2034\n).\n8-K\n000-15867\n4.2\n9/10/2024\n4.\n4\nDescription of the Registrant’s Securities Registered Pursuant to Section 12 of the Securities Exchange Act of 1934.\nX\n10.\n1*\nThe Registrant’s 1995 Directors Stock Incentive Plan.\n10-Q\n001-15867\n10.01\n7/26/2012\n10.\n2*\nForm of Stock Option Agreement, as currently in effect under the Registrant’s 1995 Directors Stock Incentive Plan.\n10-K\n000-15867\n10.76\n2/21/2013\n10.\n3*\nForm of Incentive Stock Award Agreement, as currently in effect under the Registrant’s 1995 Directors Stock Incentive Plan.\n10-K\n000-15867\n10.77\n2/21/2013\n10.\n4*\nThe Registrant’s Omnibus Equity Incentive Plan, as amended and restated.\nS-8\n333-275140\n99.01\n10/23/2023\n10.\n5*\nForm of Incentive Stock Award Agreement for Non-Executive Employees and Consultants, as currently in effect under the Registrant’s Omnibus Equity Incentive Plan.\n10-Q\n000-15867\n10.2\n7/24/2024\n10.\n6*\nForm of Restricted Stock Unit Agreement for Non-Executive Employees and Consultants, as currently in effect under the Registrant’s Omnibus Equity Incentive Plan.\n10-Q\n000-15867\n10.3\n7/24/2024\n10.\n7*\nForm of Stock Option Agreement for Non-Executive Employees and Consultants, as currently in effect under the Registrant’s Omnibus Equity Incentive Plan.\nS-8\n333-195771\n99.04\n5/7/2014\n10.\n8*\nForm of Incentive Stock Award Agreement for Executives, as currently in effect under the Registrant’s Omnibus Equity Incentive Plan.\nS-8\n333-195771\n99.05\n5/7/2014\n10.\n9*\nForm of Restricted Stock Unit Agreement for Executives, as currently in effect under the Registrant’s Omnibus Equity Incentive Plan.\nS-8\n333-195771\n99.06\n5/7/2014\n10.10*\nForm of Stock Option Agreement for Executives, as currently in effect under the Registrant’s Omnibus Equity Incentive Plan.\nS-8\n333-195771\n99.07\n5/7/2014\n10.11*\nnusemi inc. 2015 Equity Incentive Plan.\nS-8\n333-226294\n99.01\n7/23/2018\n10.12*\nThe Registrant’s Amended and Restated Employee Stock Purchase Plan.\nS-8\n333-282884\n99.1\n10/30/2024\n96\nTable of Contents\n10.13*\nThe Registrant’s 2009 Deferred Compensation Plan, as amended and restated on February 5, 2019.\n10-K\n000-15867\n10.26\n2/24/2020\n10.14*\nThe Registrant’s Senior Executive Bonus Plan.\n8-K\n000-15867\n10.01\n2/8/2019\n10.15*\nThe Registrant’s Executive Severance Plan.\n8-K\n001-15867\n10.01\n5/11/2016\n10.16*\nThe Registrant’s Director Medical and Prescription Benefits Coverage Reimbursement Plan.\n10-Q\n001-10606\n10.02\n4/29/2011\n10.17*\nForm of Indemnity Agreement between the Registrant and its directors and executive officers, as amended and restated.\n10-Q\n000-15867\n10.01\n7/25/2016\n1\n0.18*\nTransition and Release \nAgreement, dated Ma\ny 2, 2024, be\ntween the Registrant and Neil Zaman.\n10-Q\n000-15867\n10.4\n4/24/2024\n10.19*\nAmended and Restated Employment Agreement, effective as of December 15, 2021, between the Registrant and Anirudh Devgan.\n8-K/A\n000-15867\n10.01\n12/17/2021\n10.20\nCredit Agreement, dated as of June 30, 2021, by and among the Registrant, Bank of America, N.A., and other lenders party thereto. \n8-K\n000-15867\n10.01\n7/1/2021\n10.2\n1\nFirst Amendment to Credit Agreement, dated September 7, 2022, by and among the Registrant, Bank of America, N.A. and other lenders party thereto\n.\n8-K\n000-15867\n10.02\n9/8/2022\n10.22\nCredit Agreement, dated August 14, 2024, by and among the Registrant, Bank of America, N.A., as a lender and administrative agent, the other lenders and issuing banks party thereto and BofA Securities, Inc., JPMorgan Chase Bank, N.A. and HSBC Bank USA, National Association, as joint lead arrangers and joint bookrunners.\n8-K\n000-15867\n10.1\n8/15/2024\n10.23\nLoan Agreement, dated September 7, 2022, by and among the Registrant, Bank of America, N.A., and other lenders party thereto.\n8-K\n000-15867\n10.01\n9/8/2022\n10.24\nFirst Amendment to Loan Agreement, dated August 14, 2024, with respect to that certain Loan Agreement, dated September 7, 2022, by and among the Registrant, Bank of America, N.A. and the other lenders party thereto.\n8-K\n000-15867\n10.2\n8/15/2024\n10.25\nLoan Agreement, dated May 30, 2024, by and among the Registrant, Bank of America, N.A., and the other lenders party thereto. \n8-K\n000-15867\n10.1\n6/3/2024\n10.26\nFirst Amendment to Loan Agreement, dated August 14, 2024, with respect to that certain Loan Agreement, dated May 30, 2024, by and among the Registrant, Bank of America, N.A. and the other lenders party thereto.\n8-K\n000-15867\n10.3\n8/15/2024\n19.\n1\nThe Registrant's Securities Trading Policy\n.\nX\n21.\n1\nSubsidiaries of the Registrant.\nX\n23.\n1\nConsent of PricewaterhouseCoopers LLP, Independent Registered Public Accounting Firm.\nX\n24.\n1\nPower of Attorney (incorporated by reference to the signature page to this Annual Report on Form 10-K). \n31.\n1\nCertification of the Registrant’s Chief Executive Officer, Anirudh Devgan, pursuant to Rule 13a-14 of the Securities Exchange Act of 1934.\nX\n31.\n2\nCertification of the Registrant’s Chief Financial Officer, John M. Wall, pursuant to Rule 13a-14 of the Securities Exchange Act of 1934.\nX\n97\nTable of Contents\n32.\n1†\nCertification of the Registrant’s Chief Executive Officer, Anirudh Devgan, pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nX\n32.\n2†\nCertification of the Registrant’s Chief Financial Officer, John M. Wall, pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nX\n97.\n1\nThe Registrant's Policy for Recovery of Erroneously Awarded Compensation\n.\n10-K\n000-15867\n97.01\n2/14/2024\n101.INS\nInline XBRL Instance Document.\nX\n101.SCH\nInline XBRL Taxonomy Extension Schema Document.\nX\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\nX\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document.\nX\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document.\nX\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\nX\n104\nCover Page Interactive Data File - The cover page from this Annual Report on Form 10-K is formatted in iXBRL.\n*  Indicates management contract or compensatory plan or arrangement covering executive officers or directors of the Registrant.\n†  In accordance with Item 601(b)(32)(ii) of Regulation S-K, the certifications furnished in Exhibits 32.01 and 32.02 hereto will not be deemed \"filed\" for purposes of Section 18 of the Exchange Act or incorporated by reference into any filings under the Securities Act or the Exchange Act (except to the extent that the registrant specifically incorporates it by reference). \nItem 16. Form 10-K Summary\nNone.\n98\nTable of Contents\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\n                        \nCADENCE DESIGN SYSTEMS, INC.\n/s/ Anirudh Devgan\nAnirudh Devgan\nPresident and Chief Executive Officer\nDated: \nFebruary 20, 2025\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\n/s/ Anirudh Devgan\nDATE: \nFebruary 20, 2025\nAnirudh Devgan\nPresident and Chief Executive Officer\n(Principal Executive Officer)\n/s/ John M. Wall\nDATE: \nFebruary 20, 2025\nJohn M. Wall\nSenior Vice President and Chief Financial Officer\n(Principal Financial and Accounting Officer)\n99\nTable of Contents\nPOWER OF ATTORNEY\nKNOW ALL PERSONS BY THESE PRESENTS, that each person whose signature appears below constitutes and appoints Anirudh Devgan, John M. Wall and Karna Nisewaner, and each of them, as his or her true and lawful attorneys-in-fact and agents, with full power of substitution and resubstitution, for him or her and in his or her name, place and stead, in any and all capacities, to sign any and all amendments (including post-effective amendments) to this Report on Form 10-K, and to file the same, with all exhibits thereto, and other documents in connection therewith, with the Securities and Exchange Commission, granting unto said attorneys-in-fact and agents, and each of them, full power and authority to do and perform each and every act and thing requisite and necessary to be done in connection therewith, as fully to all intents and purposes as he or she might or could do in person, hereby ratifying and confirming all that said attorneys-in-fact and agents, or any of them, or their, his or her substitute or substitutes, may lawfully do or cause to be done by virtue hereof.\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated: \n/s/\nMary Louise Krakauer\nFebruary 20, 2025\nMary Louise Krakauer, Chair\n/s/\nMark W. Adams\nFebruary 20, 2025\nMark W. Adams, Director\n/s/\nIta Brennan\nFebruary 20, 2025\nIta Brennan, Director\n/s/\nLewis Chew\nFebruary 20, 2025\nLewis Chew, Director\n/s/\nAnirudh Devgan\nFebruary 20, 2025\nAnirudh Devgan, Director \n/s/\nMoshe Gavrielov\nFebruary 20, 2025\nMoshe Gavrielov, Director\n/s/\nJulia Liuson\nFebruary 20, 2025\nJulia Liuson, Director\n/s/\nDr. James D. Plummer\nFebruary 20, 2025\nDr. James D. Plummer, Director\n/s/\nDr. Alberto Sangiovanni-Vincentelli\nFebruary 20, 2025\nDr. Alberto Sangiovanni-Vincentelli, Director\n/s/\nYoung K. Sohn\nFebruary 20, 2025\nYoung K. Sohn, Director\n100"
  }
}