{
  "ticker": "CDW",
  "cik": "0001402057",
  "company_name": "CDW Corp",
  "filing_date": "2025-02-21",
  "accession": "0001402057-25-000018",
  "primary_doc": "cdw-20241231.htm",
  "item_sections": {
    "item1": "Item 1. Business\nOur Company\nCDW Corporation (together with its subsidiaries, the “Company,” “CDW” or “we”), a Fortune 500 company and member of the S&P 500 Index, is a leading multi-brand provider of information technology (“IT”) solutions to business, government, education and healthcare customers in the United States (“US”), the United Kingdom (“UK”) and Canada. Our broad array of offerings ranges from discrete hardware and software products to integrated IT solutions and services that include on-premise and cloud capabilities across hybrid infrastructure, digital experience and security.\nWe are vendor, technology and consumption model unbiased, offering a broad selection of products and multi-branded IT solutions. Our solutions are delivered in physical, virtual and cloud-based environments through approximately 10,900 customer-facing coworkers, including sellers, highly-skilled specialists and engineers. We are a leading sales channel partner for many original equipment manufacturers (“OEMs”), software publishers, cloud providers (collectively, our “vendor partners”) and wholesale distributors, whose products we sell or include in the solutions we offer. We provide our vendor partners with a cost-effective way to reach customers and deliver a consistent brand experience through our established end-market coverage, technical expertise and extensive customer access.\nWe simplify the complexities of technology solutions across design, selection, procurement, integration and management for our customers. Our goal is to have our customers, regardless of their size, view us as a trusted adviser and extension of their IT workforce. Our multi-brand offering approach across our vendor partners enables us to provide the solutions and services that best address each customer’s specific requirements to enable their desired business outcomes.\nWe have capabilities to provide integrated IT solutions in approximately 150 countries for customers with primary locations in the US, UK and Canada, which are large and growing markets. These are highly fragmented markets served by thousands of IT resellers and solutions providers. We believe that demand for IT will outpace general economic growth in the markets we serve, fueled by new technologies, including hybrid and cloud computing and artificial intelligence, as well as growing end-user demand for security, efficiency and productivity.\nValue Proposition \nWe are positioned in the middle of the IT ecosystem where we procure products from OEMs, software publishers, cloud providers and wholesale distributors and provide added value to our customers by helping them navigate through complex options and implement the best solution for their business. In this role, we believe we provide unique value to both our vendor partners and our customers.\nOur value proposition to our customers\nOur value proposition to our vendor partners\n●\nBroad selection of products and multi-branded IT solutions\n●\nAccess to over 250,000 customers \n●\nValue-added services with integration capabilities\n●\nLarge and established customer channels\n●\nHighly-skilled specialists and engineers\n●\nStrong distribution and implementation capabilities\n●\nSolutions across IT lifecycle\n●\nCustomer relationships driving insight into technology roadmaps\nCustomers\nWe provide integrated IT solutions to over 250,000 business, government, education and healthcare customers throughout the US, UK and Canada.\nWe serve our customers through sales teams focused on customer end-markets that are supported by highly-skilled specialists and engineers. Our market segmentation allows us to customize our offerings and to provide enhanced expertise in designing and implementing IT solutions that meet our customer’s specific needs.\nWe have three reportable segments: Corporate, Small Business and Public. Our Corporate segment primarily serves US private sector business customers with more than 250 employees. Our Small Business segment primarily serves US private sector business customers with up to 250 employees. Our Public segment is comprised of government agencies and education and healthcare institutions in the US. We also have two other operating segments: CDW UK and CDW Canada, each of which do not meet the reportable segment quantitative thresholds and, accordingly, are included in an all other category (“Other”).\n4\nTable of Contents\nIn our US business, which represents approximately 90% of our Net sales, we currently have five dedicated customer channels: corporate, small business, government, education and healthcare, each of which generated $1.5 billion or greater in Net sales in 2024. Net sales to customers in the UK and Canada combined generated $2.5 billion in 2024. We believe this diversity of customer end-markets provides us with multiple avenues for growth and has been a key factor in our ability to weather economic and technology cycles and gain market share.\nPartners\nWe offer more than 100,000 products and services from more than 1,000 vendor partners, including well-established companies such as Adobe, APC, Apple, Amazon Web Services, Broadcom Inc., Cisco, Dell Technologies, Google, Hewlett Packard Enterprise, HP Inc., IBM, Intel, Lenovo, Microsoft, NetApp, Nutanix, Palo Alto Networks, Pure Storage and Samsung, as well as from emerging technology companies. This broad portfolio of vendor partners and technologies enables us to offer customers significant options and meet customer demand for the products and solutions that best meet their needs. We believe our value proposition to vendor partners enables us to evolve our offering as new technologies emerge and new companies seek us as a channel partner.\nIn 2024, we generated $2.0 billion of Net sales from each of our three largest vendor partners. We have received the highest level of certification from major vendor partners such as Broadcom Inc., Cisco, Dell Technologies, Hewlett Packard Enterprise, IBM, Lenovo, Microsoft, NetApp, Nutanix, Palo Alto Networks and Samsung which reflects the extensive product and solution knowledge and capabilities that we bring to our customers. These certifications also provide us with access to favorable pricing, tools and resources, including vendor incentive programs, which we use to provide additional value to our customers. Our vendor partners also regularly recognize us with top awards and select us to develop and grow new customer solutions.\nProduct Procurement\nWe may purchase all or only some of the products our vendor partners offer for resale to our customers or for inclusion in the solutions we offer. Each vendor partner agreement provides for specific terms and conditions, which may include one or more of the following: product return privileges, price protection policies, purchase discounts and vendor incentive programs, such as purchase or sales rebates and cooperative advertising reimbursements. We also purchase software from major software publishers and cloud providers for resale to our customers or for inclusion in the solutions we offer. Our agreements allow us to resell cloud based solutions, software or other licensed products to the end-user customer.\nIn addition to purchasing products directly from our vendor partners, we purchase products from wholesale distributors for resale to our customers or for inclusion in the solutions we offer. These wholesale distributors provide logistics management and supply-chain services for us, as well as for our vendor partners.\nInventory Management\nWe operate two distribution centers in North America and one distribution center in the UK, which combined provide more than 1 million square feet in size. Leveraging our distribution and logistics capabilities, we handle and ship approximately 26 million units annually on an aggregate basis from our distribution centers.\nWe also have drop-shipment arrangements with many of our OEMs and wholesale distributors, which permit us to offer products to our customers without having to take physical delivery at our distribution centers. These arrangements represented approximately 54% of total North America Net sales in 2024.\nWe believe that the location of our distribution centers allows us to efficiently ship products to our customers and provide timely access to our principal distributors. We believe that our logistics and configuration capabilities delivered by our highly-skilled and certified team enable us to customize technology for our customers to meet their unique needs.\nWe believe competitive sources of supply are available in substantially all of the product categories that we offer.\nCompetition\nThe market for technology products, solutions and services is highly competitive and subject to economic conditions and rapid technological changes. This competitive environment includes the ability to tailor solutions to customer needs, the quality and breadth of product and service offerings, knowledge and expertise of sales force, customer service, price, product availability, speed of delivery and credit availability. We face competition from resellers, manufacturers who sell directly to customers, large service providers and system integrators, cloud providers, e-commerce companies, and office supply retailers, among others. Smaller, local or regional value-added resellers typically focus on a single solution suite or portfolio of solutions from one or two vendor partners.\n5\nTable of Contents\nWe believe we are well positioned to compete within this marketplace due to our competitive advantages. We expect the competitive landscape to continue to evolve as new technologies and consumption models emerge, such as cloud-based and other “as a service” solutions, hyper-converged infrastructure, embedded software solutions and solutions that incorporate artificial intelligence. While innovation can help our business as it creates new offerings for us to sell, it can also disrupt our business model and create new and stronger competitors. For additional information on the risks associated with competition, see “",
    "item1a": "Item 1A. Risk Factors.”\n \nThe Audit Committee is primarily responsible for overseeing our enterprise risk management process on behalf of the Board of Directors, including cybersecurity risks.\n \nThe \nCTO and CISO\n regularly provide reporting on cybersecurity matters to both senior management and the Audit Committee and at least annually to the Board of Directors.\n This reporting includes updates on our information security strategy, key cyber risks and threats, our progress towards protecting the Company from such risks and threats, assessments of our cybersecurity program and emerging trends.\n Depending on the criticality of a cybersecurity incident, certain matters are required to be reported promptly to the Board of Directors, as appropriate, in accordance with our incident response plan.",
    "item1b": "Item 1B. Unresolved Staff Comments\nNone.",
    "item1c": "Item 1C. Cybersecurity\nWe have a dedicated team of information security professionals who leads our enterprise-wide cyber security strategy, risk management, cyber defense, software security, security monitoring and other related functions. \nThis team is overseen by our \nChief Information Security Officer (“CISO”)\n, who reports to our Chief Technology Officer (“CTO”). \nThe CISO has extensive \n21\nTable of Contents\nbackground in that role at an enterprise level and has over 20 years of experience in the field of cybersecurity.\n \nAdditionally, the processes overseen by our global information security team are integrated with our enterprise risk management program, including routine reporting on cyber risk through the different levels of the enterprise risk management governance structure and alignment on risk management frameworks and processes.\n \nOur corporate information security management program is ISO 27001 certified, and we undergo routine audits by an independent, certified accreditation body to maintain this certification. Our program is designed to guide our practices which are based on relevant industry frameworks and laws. This program consists of policies, practices and procedures designed to manage material risks from cybersecurity threats, including training requirements, threat monitoring and detection and threat containment and risk assessments. Additionally, \nwe leverage third-party firms to conduct routine external and internal penetration testing to emulate the common tactics and techniques of cyber threat actors and have processes to address identified vulnerabilities, although it may take time to mitigate or manage such vulnerabilities.\n \nWe also have policies and procedures to oversee and identify the cybersecurity risks associated with our use of third-party service providers for both internal use and external use.\n These policies and procedures include onboarding risk assessments prior to engagement and, as appropriate based on identified risk, may include cybersecurity-related contractual terms and periodic risk assessments throughout the life cycle of the third-party relationship. Lastly, we maintain cybersecurity insurance coverage that we believe is appropriate for the size and complexity of our business to cover certain costs related to cybersecurity incidents. We refine our cybersecurity program by staying informed on security threats, leveraging third-party cybersecurity firms and investing in enhancements to our preventive and defensive capabilities.\nIn addition to our policies and procedures to manage and identify cybersecurity risks, we have an incident response plan designed to analyze, contain, remediate and communicate cybersecurity matters to help ensure a timely and robust response to actual or attempted incidents. \nAs of the date of this report, we are not aware of any risks from cybersecurity threats that have materially affected or are reasonably likely to materially affect the Company, including our business strategy, results of operations or financial condition.\n However, we cannot provide assurance that these threats will not result in such an impact in the future. For more information regarding risks relating to information technology and cybersecurity, see “"
  }
}