{
  "ticker": "CHD",
  "cik": "0000313927",
  "company_name": "CHURCH & DWIGHT CO INC /DE/",
  "filing_date": "2025-02-13",
  "accession": "0000950170-25-019801",
  "primary_doc": "chd-20241231.htm",
  "item_sections": {
    "item1": "Item 1A of this Annual Report.  We continue to manage all aspects of our business including, but not limited to, monitoring the financial health of our customers, suppliers and other third-party relationships, implementing gross margin enhancement strategies and developing new opportunities for growth.  We do not anticipate that current economic conditions will adversely affect our ability to comply with the financial covenant in the Credit Agreement because we currently are, and anticipate that we will continue to be, in compliance with the maximum leverage ratio requirement under the Credit Agreement.\n \n\n\n \n\n\nOn October 28, 2021, the Board authorized a new share repurchase program, under which we may repurchase up to $1,000.0 in shares of Common Stock (the “2021 Share Repurchase Program”).  The 2021 Share Repurchase Program does not have an expiration.  The 2021 Share Repurchase Program did not modify our evergreen share repurchase program, authorized by the Board on January 29, 2014, under which we may repurchase, from time to time, Common Stock to reduce or eliminate dilution associated with issuances of Common Stock under its incentive plans.\n\n\n \n\n\nAs a result of our stock repurchases, there remains $658.9 of share repurchase availability under the 2021 Share Repurchase Program as of December 31, 2024.\n\n\n \n\n\nOn January 29, 2025, the Board declared a 4% increase in the regular quarterly dividend from $0.28375 to $0.295 per share, equivalent to an annual dividend of $1.18 per share payable to stockholders of record as of February 14, 2025.  The increase raises the annual dividend payout from $277.0 to approximately $287.0 on an annualized basis.\n \n\n\nWe anticipate that our cash from operations, together with our current borrowing capacity, will be sufficient to fund our share repurchase programs to the extent implemented by management, pay debt and interest as it comes due, pay dividends at the latest approved rate, and meet our capital expenditure program costs, which are expected to be approximately $130.0 in 2025 including manufacturing capacity investments for Therabreath and Sterimar and an ERP project.  Cash, together with our current borrowing capacity, may be used for acquisitions that would complement our existing product lines or geographic markets.\n \n\n\n48\n\n\n\n\nCHURCH & DWIGHT CO., INC AND SUBSIDIARIES\n(Dollars in millions, except share and per share data)\n \n\n\nCash Flow Analysis\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nYear Ended\n\n\n \n\n\n\n\n\n\n \n\n\nDecember 31,\n\n\n \n\n\n \n\n\nDecember 31,\n\n\n \n\n\n \n\n\nDecember 31,\n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nNet cash provided by operating activities\n\n\n$\n\n\n1,156.2\n\n\n \n\n\n \n\n\n$\n\n\n1,030.6\n\n\n \n\n\n \n\n\n$\n\n\n885.2\n\n\n \n\n\n\n\n\n\nNet cash used in investing activities\n\n\n$\n\n\n(183.3\n\n\n)\n\n\n \n\n\n$\n\n\n(234.3\n\n\n)\n\n\n \n\n\n$\n\n\n(728.6\n\n\n)\n\n\n\n\n\n\nNet cash used in financing activities\n\n\n$\n\n\n(343.4\n\n\n)\n\n\n \n\n\n$\n\n\n(725.6\n\n\n)\n\n\n \n\n\n$\n\n\n(120.9\n\n\n)\n\n\n\n\n\n\n \n\n\n2024 compared to 2023\n\n\nNet Cash Provided by Operating Activities\n – Our primary source of liquidity is our cash flow provided by operating activities, which is dependent on the level of net income and changes in working capital.  Our net cash provided by operating activities in 2024 increased by $125.6 to $1,156.2 as compared to $1,030.6 in 2023 primarily due to an increase in cash earnings (net income adjusted for non-cash items).  We measure working capital effectiveness based on our cash conversion cycle.  The following table presents our cash conversion cycle information for the years ended December 31, 2024 and 2023:\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nAs of\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nDecember 31, 2024\n\n\n \n\n\n \n\n\nDecember 31, 2023\n\n\n \n\n\n \n\n\nChange\n\n\n \n\n\n\n\n\n\nDays of sales outstanding in accounts receivable (\"DSO\")\n\n\n \n\n\n34\n\n\n \n\n\n \n\n\n \n\n\n29\n\n\n \n\n\n \n\n\n \n\n\n5\n\n\n \n\n\n\n\n\n\nDays of inventory outstanding (\"DIO\")\n\n\n \n\n\n67\n\n\n \n\n\n \n\n\n \n\n\n70\n\n\n \n\n\n \n\n\n \n\n\n(3\n\n\n)\n\n\n\n\n\n\nDays of accounts payable outstanding (\"DPO\")\n\n\n \n\n\n73\n\n\n \n\n\n \n\n\n \n\n\n72\n\n\n \n\n\n \n\n\n \n\n\n(1\n\n\n)\n\n\n\n\n\n\nCash conversion cycle\n\n\n \n\n\n28\n\n\n \n\n\n \n\n\n \n\n\n27\n\n\n \n\n\n \n\n\n \n\n\n1\n\n\n \n\n\n\n\n\n\nOur cash conversion cycle (defined as the sum of DSO plus DIO less DPO) at December 31, 2024, which is calculated using a two period average method, increased one day from the prior year.  The change in cash conversion cycle is due to an increase in DSO primarily from a reduction in our accounts receivable factoring program in response to higher interest rates, partially offset with a decrease in DIO mainly from a reduction in inventory related to our discretionary brands and an increase in DPO primarily from agreeing to extended payment terms with some vendors.  We continue to focus on reducing our working capital requirements.\n\n\n \n\n\nNet Cash Used in Investing Activities\n – Net cash used in investing activities during 2024 was $183.3, primarily reflecting property, plant and equipment additions of $179.8 and $19.9 for the Graphico Acquisition, partially offset by $14.0 of proceeds from the sale of assets (including the ArmaKleen joint venture).  Net cash used in investing activities during 2023 was $234.3, primarily reflecting property, plant and equipment additions of $223.5.\n\n\n \n\n\nNet Cash Used in Financing Activities\n – Net cash used in financing activities during the twelve months of 2024 was $343.4 reflecting $208.2 of net debt payments and $277.0 of cash dividend payments, partially offset by $142.9 of proceeds from stock option exercises.  Net cash used in financing activities during the twelve months of 2023 was $725.6, reflecting $300.1 of treasury stock purchases, $266.5 of cash dividend payments and $270.6 of net debt repayments, partially offset by $111.7 of proceeds from stock option exercises.\n\n\n \n\n\n49\n\n\n\n\nCHURCH & DWIGHT CO., INC AND SUBSIDIARIES\n(Dollars in millions, except share and per share data)\n \n\n\nOTHER ITEMS\n \n\n\nMarket risk\n \n\n\nConcentration of Risk\n\n\nA group of four customers accounted for approximately 43% and 44% of consolidated net sales in 2024 and 2023, respectively.  A group of four customers accounted for approximately 42% of consolidated net sales in 2022, of which a single customer (Walmart Inc. and its affiliates) accounted for approximately 23%, 23% and 24% in 2024, 2023 and 2022, respectively.\n \n\n\nInterest Rate Risk\n\n\nWe had outstanding total debt at December 31, 2024, of $2,204.6, net of debt issuance costs, all of which has a fixed weighted average interest rate of 4.1%.  From time to time the Company will enter into interest rate lock agreements to hedge the risk of changes in the interest payments attributable to changes in the interest rate associated with anticipated issuances of debt.\n \n\n\nOther Market Risks\n\n\nWe are also subject to market risks relating to our diesel and other commodity costs, fluctuations in foreign currency exchange rates, and changes in the market price of our Common Stock.  Refer to Note 3 to the Consolidated Financial Statements included in this Annual Report for a discussion of these market risks and the derivatives used to manage the risks associated with changing diesel fuel and other commodity prices, foreign exchange rates and the price of our Common Stock.\n\n\n \n\n\nI\nTEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\n\n\nThis information appears under the heading “Market Risk” in the “Management’s Discussion and Analysis” section.  Refer to page 50 of this Annual Report.\n\n\n50\n\n\n\n\n \n\n\nI\nTEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\n \n\n\nMANAGEMENT’S REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\n\n\nManagement of Church & Dwight Co., Inc. (the “Company”) is responsible for establishing and maintaining adequate internal control over financial reporting.  Internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles.  A company’s internal control over financial reporting includes those policies and procedures that pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\n \n\n\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements.  Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n \n\n\nManagement evaluated the Company’s internal control over financial reporting as of December 31, 2024.  In making this assessment, management used the framework established in \nInternal Control-Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).  As a result of this assessment and based on the criteria in the COSO framework, management has concluded that as of December 31, 2024, the Company’s internal control over financial reporting was effective.\n\n\nThe Company’s independent registered public accounting firm, Deloitte & Touche LLP, has audited the Company’s internal control over financial reporting.  Their opinions on the effectiveness of the Company’s internal control over financial reporting and on the Company’s consolidated financial statements and financial statement schedule appear on pages 52 and 54 of this Annual Report on Form 10-K.\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n/s/ Matthew T. Farrell\n\n\n \n\n\n/s/ Richard A. Dierker\n\n\n\n\n\n\nMatthew T. Farrell\n\n\n \n\n\nRichard A. Dierker\n\n\n\n\n\n\nPresident and Chief Executive Officer\n\n\n \n\n\nExecutive Vice President\n \n\n\n\n\n\n\n \n\n\n \n\n\nand Chief Financial Officer\n\n\n\n\n\n\n \n\n\n \n\n\n(Principal Financial Officer)\n\n\n\n\n\n\nFebruary 13, 2025\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n51\n\n\n\n\n \n\n\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\n\n\n \n\n\nTo the Board of Directors and Stockholders of\n\n\nChurch & Dwight Co., Inc.\n \n\n\nEwing, New Jersey\n\n\n \n\n\nOpinion on the Financial Statements\n \n\n\nWe have audited the accompanying consolidated balance sheets of Church & Dwight Co., Inc. and subsidiaries (the \"Company\") as of December 31, 2024 and 2023, the related consolidated statements of income, comprehensive income, stockholders' equity, and cash flows, for each of the three years in the period ended December 31, 2024, and the related notes and the schedule listed in the Index at Item 15 (collectively referred to as the “financial statements\").  In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with the accounting principles generally accepted in the United States of America.\n \n\n\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control — Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated February 13, 2025,expressed an unqualified opinion on the Company's internal control over financial reporting.\n \n\n\nBasis for Opinion\n \n\n\nThese financial statements are the responsibility of the Company's management.  Our responsibility is to express an opinion on the Company's financial statements based on our audits.  We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\n \n\n\nWe conducted our audits in accordance with the standards of the PCAOB.  Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud.  Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks.  Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements.  Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\n\n\nCritical Audit Matter\n\n\nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments.  The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\n\n\nTrade Names and Other Intangibles, Net –Vitamins and Waterpik — Refer to Notes 1 and 7 to the Consolidated Financial Statements\n\n\nCritical Audit Matter Description\n\n\nThe Company owns trade names that are considered to have indefinite lives.  These trade names are required to be measured periodically for impairment.\n \n\n\nDuring the third quarter of 2024, the Company continued to experience a decline in market share and deterioration in the financial performance of its Vitamins, Minerals and Supplements (“VMS”) business, which includes the VITAFUSION and L’IL CRITTERS trade name, primarily due to competition from new category entrants, including private label.  The continued decline in profitability caused management to reassess its long-term strategy and financial outlook of the business.  The revised financial outlook reflected lower estimates of future sales growth and cash flow, which resulted in a triggering event.  The triggering event required the Company\n \n\n\n52\n\n\n\n\n \n\n\nto evaluate its ability to recover the carrying value of the trade name by comparing the carrying value of the trade name to its fair value.  The valuation resulted in a full impairment of the $281.3 million VITAFUSION and L’IL CRITTERS trade name as of September 30, 2024.\n \n\n\nAdditionally, the Company’s global WATERPIK business has continued to experience a decline in customer demand for many of its products, primarily due to lower consumer spending for discretionary products and a growing number of water flosser consumers switching to more value-branded products.  As a result, the business has experienced declining sales and profits resulting in a reduction in expected future cash flows, eroding a substantial portion of the excess between the fair and carrying value of the trade name.  The carrying value of the WATERPIK trade name is $644.7 million and the fair value represented 135% of the carrying value as of October 1, 2024.\n \n\n\nManagement estimates the fair value of these trade names based on an “excess earnings” discounted cash flow method.  The determination of fair value requires management to make significant estimates and assumptions related to future performance, such as revenue growth rates, as well as the selection of appropriate valuation assumptions, such as discount rates.  Changes in these assumptions could have a significant impact on the fair value of the trade names, leading to an impairment or a change in an identified impairment.\n \n\n\nGiven the significant judgments made by management to estimate the trade names’ fair value, performing audit procedures to evaluate the reasonableness of management’s estimates and assumptions related to the revenue growth rates and the selection of the discount rates involved a high degree of auditor judgment and an increased extent of effort, including the need to involve our fair value specialists.\n\n\nHow the Critical Audit Matter Was Addressed in the Audit\n\n\nOur audit procedures related to the determination of revenue growth rates and the selection of discount rates for the trade names included the following, among others:\n \n\n\n•\nWe tested the effectiveness of controls over the account balance, including those over the revenue growth rates and the selection of the discount rates. \n\n\n•\nWe evaluated management’s ability to accurately forecast revenue growth by comparing actual performance to management’s historical forecasts.\n\n\n•\nWe evaluated the reasonableness of management’s forecasted revenue growth by comparing the forecasts to: \n\n\n-   Historical performance.\n\n\n-   Internal communications to management and the Board of Directors.\n\n\n-   Forecasted information included in analyst and industry reports for the Company and certain of its peer companies.\n \n\n\n•\nWith the assistance of our fair value specialists, we evaluated the reasonableness of the discount rates by:\n\n\n-   Testing the source information underlying the determination of the discount rates and the mathematical accuracy of the calculation.\n\n\n-   Developing a range of independent estimates and comparing those to the discount rates selected by management.\n \n\n\n \n\n\n/s/ \nDELOITTE & TOUCHE LLP\n \n\n\n \n\n\nMorristown, NJ\n\n\nFebruary 13, 2025\n\n\n \n\n\nWe have served as the Company's auditor since 1968.\n\n\n \n\n\n53\n\n\n\n\n \n\n\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\n\n\nTo the Board of Directors and Stockholders of\n\n\nChurch & Dwight Co., Inc.\n\n\nEwing, New Jersey\n\n\n \n\n\nOpinion on Internal Control over Financial Reporting\n \nWe have audited the internal control over financial reporting of Church & Dwight Co., Inc. and subsidiaries (the \"Company\") as of December 31, 2024, based on criteria established in Internal Control — Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).  In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control — Integrated Framework (2013) issued by COSO.\n \n \nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated financial statements as of and for the year ended December 31, 2024, of the Company and our report dated February 13, 2025, expressed an unqualified opinion on those consolidated financial statements.\n \n \nBasis for Opinion\n \n \nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Report on Internal Control over Financial Reporting.  Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit.  We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\n \n \nWe conducted our audit in accordance with the standards of the PCAOB.  Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.  Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances.  We believe that our audit provides a reasonable basis for our opinion.\n \n\n\n \n\n\nDefinition and Limitations of Internal Control over Financial Reporting\n \n\n\n \n\n\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles.  A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\n \n\n\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements.   Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n \n\n\n \n\n\n/s/ DELOITTE & TOUCHE LLP\n \n\n\n \n\n\nMorristown, NJ\n\n\nFebruary 13, 2025\n\n\n \n\n\n54\n\n\n\n\n \n\n\n \n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\n \n\n\nCONSOL\nIDATED STATEMENTS OF INCOME\n \n\n\n (In millions, except per share data)\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nNet Sales\n\n\n \n\n\n$\n\n\n6,107.1\n\n\n \n\n\n \n\n\n$\n\n\n5,867.9\n\n\n \n\n\n \n\n\n$\n\n\n5,375.6\n\n\n \n\n\n\n\n\n\nCost of sales\n\n\n \n\n\n \n\n\n3,317.0\n\n\n \n\n\n \n\n\n \n\n\n3,279.4\n\n\n \n\n\n \n\n\n \n\n\n3,125.6\n\n\n \n\n\n\n\n\n\nGross Profit\n\n\n \n\n\n \n\n\n2,790.1\n\n\n \n\n\n \n\n\n \n\n\n2,588.5\n\n\n \n\n\n \n\n\n \n\n\n2,250.0\n\n\n \n\n\n\n\n\n\nMarketing expenses\n\n\n \n\n\n \n\n\n698.1\n\n\n \n\n\n \n\n\n \n\n\n641.3\n\n\n \n\n\n \n\n\n \n\n\n535.2\n\n\n \n\n\n\n\n\n\nSelling, general and administrative expenses\n\n\n \n\n\n \n\n\n927.8\n\n\n \n\n\n \n\n\n \n\n\n889.8\n\n\n \n\n\n \n\n\n \n\n\n706.0\n\n\n \n\n\n\n\n\n\nVMS Trade name and other asset impairments\n\n\n \n\n\n \n\n\n357.1\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n\n\n\n\nFlawless Trade name and other asset impairments\n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n411.0\n\n\n \n\n\n\n\n\n\nIncome from Operations\n\n\n \n\n\n \n\n\n807.1\n\n\n \n\n\n \n\n\n \n\n\n1,057.4\n\n\n \n\n\n \n\n\n \n\n\n597.8\n\n\n \n\n\n\n\n\n\nEquity in earnings of affiliates\n\n\n \n\n\n \n\n\n9.1\n\n\n \n\n\n \n\n\n \n\n\n8.7\n\n\n \n\n\n \n\n\n \n\n\n12.3\n\n\n \n\n\n\n\n\n\nInterest income\n\n\n \n\n\n \n\n\n26.3\n\n\n \n\n\n \n\n\n \n\n\n13.0\n\n\n \n\n\n \n\n\n \n\n\n3.8\n\n\n \n\n\n\n\n\n\nInterest expense\n\n\n \n\n\n \n\n\n(\n95.0\n\n\n)\n\n\n \n\n\n \n\n\n(\n110.9\n\n\n)\n\n\n \n\n\n \n\n\n(\n89.6\n\n\n)\n\n\n\n\n\n\nOther income (expense), net\n\n\n \n\n\n \n\n\n8.8\n\n\n \n\n\n \n\n\n \n\n\n(\n0.8\n\n\n)\n\n\n \n\n\n \n\n\n(\n1.0\n\n\n)\n\n\n\n\n\n\nIncome before Income Taxes\n\n\n \n\n\n \n\n\n756.3\n\n\n \n\n\n \n\n\n \n\n\n967.4\n\n\n \n\n\n \n\n\n \n\n\n523.3\n\n\n \n\n\n\n\n\n\nIncome taxes\n\n\n \n\n\n \n\n\n171.0\n\n\n \n\n\n \n\n\n \n\n\n211.8\n\n\n \n\n\n \n\n\n \n\n\n109.4\n\n\n \n\n\n\n\n\n\nNet Income\n\n\n \n\n\n$\n\n\n585.3\n\n\n \n\n\n \n\n\n$\n\n\n755.6\n\n\n \n\n\n \n\n\n$\n\n\n413.9\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nWeighted average shares outstanding - Basic\n\n\n \n\n\n \n\n\n244.4\n\n\n \n\n\n \n\n\n \n\n\n244.9\n\n\n \n\n\n \n\n\n \n\n\n242.9\n\n\n \n\n\n\n\n\n\nWeighted average shares outstanding - Diluted\n\n\n \n\n\n \n\n\n246.9\n\n\n \n\n\n \n\n\n \n\n\n247.6\n\n\n \n\n\n \n\n\n \n\n\n246.3\n\n\n \n\n\n\n\n\n\nNet income per share - Basic\n\n\n \n\n\n$\n\n\n2.39\n\n\n \n\n\n \n\n\n$\n\n\n3.09\n\n\n \n\n\n \n\n\n$\n\n\n1.70\n\n\n \n\n\n\n\n\n\nNet income per share - Diluted\n\n\n \n\n\n$\n\n\n2.37\n\n\n \n\n\n \n\n\n$\n\n\n3.05\n\n\n \n\n\n \n\n\n$\n\n\n1.68\n\n\n \n\n\n\n\n\n\nCash dividends per share\n\n\n \n\n\n$\n\n\n1.13\n\n\n \n\n\n \n\n\n$\n\n\n1.09\n\n\n \n\n\n \n\n\n$\n\n\n1.05\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\nCONSOLIDATED STATEMEN\nTS OF COMPREHENSIVE INCOME\n \n\n\n (In millions)\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nNet Income\n\n\n \n\n\n$\n\n\n585.3\n\n\n \n\n\n \n\n\n$\n\n\n755.6\n\n\n \n\n\n \n\n\n$\n\n\n413.9\n\n\n \n\n\n\n\n\n\nOther comprehensive income, net of tax:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nForeign exchange translation adjustments\n\n\n \n\n\n \n\n\n(\n15.4\n\n\n)\n\n\n \n\n\n \n\n\n8.6\n\n\n \n\n\n \n\n\n \n\n\n(\n16.2\n\n\n)\n\n\n\n\n\n\nDefined benefit plan gain (loss)\n\n\n \n\n\n \n\n\n(\n0.2\n\n\n)\n\n\n \n\n\n \n\n\n2.9\n\n\n \n\n\n \n\n\n \n\n\n2.3\n\n\n \n\n\n\n\n\n\nIncome (loss) from derivative agreements\n\n\n \n\n\n \n\n\n11.9\n\n\n \n\n\n \n\n\n \n\n\n(\n9.4\n\n\n)\n\n\n \n\n\n \n\n\n52.8\n\n\n \n\n\n\n\n\n\nOther comprehensive income (loss)\n\n\n \n\n\n \n\n\n(\n3.7\n\n\n)\n\n\n \n\n\n \n\n\n2.1\n\n\n \n\n\n \n\n\n \n\n\n38.9\n\n\n \n\n\n\n\n\n\nComprehensive income\n\n\n \n\n\n$\n\n\n581.6\n\n\n \n\n\n \n\n\n$\n\n\n757.7\n\n\n \n\n\n \n\n\n$\n\n\n452.8\n\n\n \n\n\n\n\n\n\nSee Notes to Consolidated Financial Statements.\n \n\n\n \n\n\n \n\n\n \n\n\n55\n\n\n\n\n \n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\n \n\n\nC\nONSOLIDATED BALANCE SHEETS\n \n\n\n (In millions, except share and per share data)\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDecember 31,\n\n\n \n\n\n \n\n\nDecember 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nAssets\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCurrent Assets\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCash and cash equivalents\n\n\n \n\n\n$\n\n\n964.1\n\n\n \n\n\n \n\n\n$\n\n\n344.5\n\n\n \n\n\n\n\n\n\nAccounts receivable, less allowances of $\n5.1\n and $\n7.3\n\n\n \n\n\n \n\n\n600.8\n\n\n \n\n\n \n\n\n \n\n\n526.9\n\n\n \n\n\n\n\n\n\nInventories\n\n\n \n\n\n \n\n\n613.3\n\n\n \n\n\n \n\n\n \n\n\n613.3\n\n\n \n\n\n\n\n\n\nOther current assets\n\n\n \n\n\n \n\n\n62.4\n\n\n \n\n\n \n\n\n \n\n\n45.0\n\n\n \n\n\n\n\n\n\nTotal Current Assets\n\n\n \n\n\n \n\n\n2,240.6\n\n\n \n\n\n \n\n\n \n\n\n1,529.7\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nProperty, Plant and Equipment, Net\n\n\n \n\n\n \n\n\n931.7\n\n\n \n\n\n \n\n\n \n\n\n927.7\n\n\n \n\n\n\n\n\n\nEquity Investment in Affiliates\n\n\n \n\n\n \n\n\n11.1\n\n\n \n\n\n \n\n\n \n\n\n12.0\n\n\n \n\n\n\n\n\n\nTrade Names and Other Intangibles, Net\n\n\n \n\n\n \n\n\n2,888.5\n\n\n \n\n\n \n\n\n \n\n\n3,302.3\n\n\n \n\n\n\n\n\n\nGoodwill\n\n\n \n\n\n \n\n\n2,433.2\n\n\n \n\n\n \n\n\n \n\n\n2,431.5\n\n\n \n\n\n\n\n\n\nOther Assets\n\n\n \n\n\n \n\n\n378.0\n\n\n \n\n\n \n\n\n \n\n\n366.0\n\n\n \n\n\n\n\n\n\nTotal Assets\n\n\n \n\n\n$\n\n\n8,883.1\n\n\n \n\n\n \n\n\n$\n\n\n8,569.2\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nLiabilities and Stockholders' Equity\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCurrent Liabilities\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nShort-term borrowings\n\n\n \n\n\n$\n\n\n0.0\n\n\n \n\n\n \n\n\n$\n\n\n3.9\n\n\n \n\n\n\n\n\n\nCurrent portion of long-term debt\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n199.9\n\n\n \n\n\n\n\n\n\nAccounts payable\n\n\n \n\n\n \n\n\n705.1\n\n\n \n\n\n \n\n\n \n\n\n630.6\n\n\n \n\n\n\n\n\n\nAccrued expenses and other liabilities\n\n\n \n\n\n \n\n\n605.5\n\n\n \n\n\n \n\n\n \n\n\n580.4\n\n\n \n\n\n\n\n\n\nIncome taxes payable\n\n\n \n\n\n \n\n\n5.3\n\n\n \n\n\n \n\n\n \n\n\n7.2\n\n\n \n\n\n\n\n\n\nTotal Current Liabilities\n\n\n \n\n\n \n\n\n1,315.9\n\n\n \n\n\n \n\n\n \n\n\n1,422.0\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nLong-term Debt\n\n\n \n\n\n \n\n\n2,204.6\n\n\n \n\n\n \n\n\n \n\n\n2,202.2\n\n\n \n\n\n\n\n\n\nDeferred Income Taxes\n\n\n \n\n\n \n\n\n669.2\n\n\n \n\n\n \n\n\n \n\n\n743.1\n\n\n \n\n\n\n\n\n\nDeferred and Other Long-term Liabilities\n\n\n \n\n\n \n\n\n324.6\n\n\n \n\n\n \n\n\n \n\n\n313.7\n\n\n \n\n\n\n\n\n\nBusiness Acquisition Liabilities\n\n\n \n\n\n \n\n\n8.0\n\n\n \n\n\n \n\n\n \n\n\n32.8\n\n\n \n\n\n\n\n\n\nTotal Liabilities\n\n\n \n\n\n \n\n\n4,522.3\n\n\n \n\n\n \n\n\n \n\n\n4,713.8\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCommitments and Contingencies\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nStockholders' Equity\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPreferred Stock, $\n1.00\n par value, Authorized \n2,500,000\n shares; \nnone\n issued\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n\n\n\n\nCommon Stock, $\n1.00\n par value, Authorized \n600,000,000\n shares; \n293,709,982\n shares issued as of December 31, 2024 and 2023\n\n\n \n\n\n \n\n\n293.7\n\n\n \n\n\n \n\n\n \n\n\n293.7\n\n\n \n\n\n\n\n\n\nAdditional paid-in capital\n\n\n \n\n\n \n\n\n563.1\n\n\n \n\n\n \n\n\n \n\n\n454.8\n\n\n \n\n\n\n\n\n\nRetained earnings\n\n\n \n\n\n \n\n\n6,319.7\n\n\n \n\n\n \n\n\n \n\n\n6,012.3\n\n\n \n\n\n\n\n\n\nAccumulated other comprehensive loss\n\n\n \n\n\n \n\n\n(\n30.9\n\n\n)\n\n\n \n\n\n \n\n\n(\n27.2\n\n\n)\n\n\n\n\n\n\nCommon stock in treasury, at cost: \n47,830,141\n shares as of December 31, 2024 and \n50,557,219\n shares as of December 31, 2023\n\n\n \n\n\n \n\n\n(\n2,784.8\n\n\n)\n\n\n \n\n\n \n\n\n(\n2,878.2\n\n\n)\n\n\n\n\n\n\nTotal Stockholders' Equity\n\n\n \n\n\n \n\n\n4,360.8\n\n\n \n\n\n \n\n\n \n\n\n3,855.4\n\n\n \n\n\n\n\n\n\nTotal Liabilities and Stockholders’ Equity\n\n\n \n\n\n$\n\n\n8,883.1\n\n\n \n\n\n \n\n\n$\n\n\n8,569.2\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nSee Notes to Consolidated Financial Statements.\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n56\n\n\n\n\n \n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\n \n\n\nC\nONSOLIDATED STATEMENTS OF CASH FLOW\n \n\n\n (In millions)\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nCash Flow From Operating Activities\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet Income\n\n\n \n\n\n$\n\n\n585.3\n\n\n \n\n\n \n\n\n$\n\n\n755.6\n\n\n \n\n\n \n\n\n$\n\n\n413.9\n\n\n \n\n\n\n\n\n\nAdjustments to reconcile net income to net cash provided by operating activities:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDepreciation expense\n\n\n \n\n\n \n\n\n83.2\n\n\n \n\n\n \n\n\n \n\n\n72.8\n\n\n \n\n\n \n\n\n \n\n\n67.0\n\n\n \n\n\n\n\n\n\nAmortization expense\n\n\n \n\n\n \n\n\n155.9\n\n\n \n\n\n \n\n\n \n\n\n152.4\n\n\n \n\n\n \n\n\n \n\n\n152.0\n\n\n \n\n\n\n\n\n\nDeferred income taxes\n\n\n \n\n\n \n\n\n(\n82.0\n\n\n)\n\n\n \n\n\n \n\n\n(\n13.8\n\n\n)\n\n\n \n\n\n \n\n\n(\n117.7\n\n\n)\n\n\n\n\n\n\nVMS Trade name and other asset impairments\n\n\n \n\n\n \n\n\n357.1\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n\n\n\n\nFlawless Trade name and other asset impairments\n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n411.0\n\n\n \n\n\n\n\n\n\nEquity in net earnings of affiliates\n\n\n \n\n\n \n\n\n(\n9.1\n\n\n)\n\n\n \n\n\n \n\n\n(\n8.7\n\n\n)\n\n\n \n\n\n \n\n\n(\n12.3\n\n\n)\n\n\n\n\n\n\nDistributions from unconsolidated affiliates\n\n\n \n\n\n \n\n\n8.9\n\n\n \n\n\n \n\n\n \n\n\n9.5\n\n\n \n\n\n \n\n\n \n\n\n8.7\n\n\n \n\n\n\n\n\n\nNon-cash compensation expense\n\n\n \n\n\n \n\n\n59.2\n\n\n \n\n\n \n\n\n \n\n\n63.6\n\n\n \n\n\n \n\n\n \n\n\n32.3\n\n\n \n\n\n\n\n\n\nAsset impairment charge and other asset write-offs\n\n\n \n\n\n \n\n\n12.1\n\n\n \n\n\n \n\n\n \n\n\n8.9\n\n\n \n\n\n \n\n\n \n\n\n2.4\n\n\n \n\n\n\n\n\n\nOther\n\n\n \n\n\n \n\n\n(\n6.2\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.4\n\n\n)\n\n\n \n\n\n \n\n\n(\n3.2\n\n\n)\n\n\n\n\n\n\nChange in assets and liabilities:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAccounts receivable\n\n\n \n\n\n \n\n\n(\n81.5\n\n\n)\n\n\n \n\n\n \n\n\n(\n97.4\n\n\n)\n\n\n \n\n\n \n\n\n(\n5.3\n\n\n)\n\n\n\n\n\n\nInventories\n\n\n \n\n\n \n\n\n2.0\n\n\n \n\n\n \n\n\n \n\n\n38.5\n\n\n \n\n\n \n\n\n \n\n\n(\n92.8\n\n\n)\n\n\n\n\n\n\nOther current assets\n\n\n \n\n\n \n\n\n(\n0.5\n\n\n)\n\n\n \n\n\n \n\n\n10.4\n\n\n \n\n\n \n\n\n \n\n\n2.5\n\n\n \n\n\n\n\n\n\nAccounts payable\n\n\n \n\n\n \n\n\n98.6\n\n\n \n\n\n \n\n\n \n\n\n(\n58.1\n\n\n)\n\n\n \n\n\n \n\n\n6.9\n\n\n \n\n\n\n\n\n\nAccrued expenses\n\n\n \n\n\n \n\n\n(\n1.1\n\n\n)\n\n\n \n\n\n \n\n\n113.3\n\n\n \n\n\n \n\n\n \n\n\n33.0\n\n\n \n\n\n\n\n\n\nIncome taxes payable\n\n\n \n\n\n \n\n\n(\n7.1\n\n\n)\n\n\n \n\n\n \n\n\n(\n1.8\n\n\n)\n\n\n \n\n\n \n\n\n14.4\n\n\n \n\n\n\n\n\n\nOther operating assets and liabilities, net\n\n\n \n\n\n \n\n\n(\n18.6\n\n\n)\n\n\n \n\n\n \n\n\n(\n14.2\n\n\n)\n\n\n \n\n\n \n\n\n(\n27.6\n\n\n)\n\n\n\n\n\n\nNet Cash Provided By Operating Activities\n\n\n \n\n\n \n\n\n1,156.2\n\n\n \n\n\n \n\n\n \n\n\n1,030.6\n\n\n \n\n\n \n\n\n \n\n\n885.2\n\n\n \n\n\n\n\n\n\nCash Flow From Investing Activities\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAdditions to property, plant and equipment\n\n\n \n\n\n \n\n\n(\n179.8\n\n\n)\n\n\n \n\n\n \n\n\n(\n223.5\n\n\n)\n\n\n \n\n\n \n\n\n(\n178.8\n\n\n)\n\n\n\n\n\n\nAcquisitions\n\n\n \n\n\n \n\n\n(\n19.9\n\n\n)\n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n546.8\n\n\n)\n\n\n\n\n\n\nProceeds from Sale of Passport\n\n\n \n\n\n \n\n\n6.6\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n\n\n\n\nOther\n\n\n \n\n\n \n\n\n9.8\n\n\n \n\n\n \n\n\n \n\n\n(\n10.8\n\n\n)\n\n\n \n\n\n \n\n\n(\n3.0\n\n\n)\n\n\n\n\n\n\nNet Cash Used In Investing Activities\n\n\n \n\n\n \n\n\n(\n183.3\n\n\n)\n\n\n \n\n\n \n\n\n(\n234.3\n\n\n)\n\n\n \n\n\n \n\n\n(\n728.6\n\n\n)\n\n\n\n\n\n\nCash Flow From Financing Activities\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nLong-term debt borrowings\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n998.8\n\n\n \n\n\n\n\n\n\nLong-term debt (repayments)\n\n\n \n\n\n \n\n\n(\n204.6\n\n\n)\n\n\n \n\n\n \n\n\n(\n200.0\n\n\n)\n\n\n \n\n\n \n\n\n(\n700.0\n\n\n)\n\n\n\n\n\n\nShort-term debt (repayments), net of borrowings\n\n\n \n\n\n \n\n\n(\n3.6\n\n\n)\n\n\n \n\n\n \n\n\n(\n70.6\n\n\n)\n\n\n \n\n\n \n\n\n(\n178.9\n\n\n)\n\n\n\n\n\n\nProceeds from stock options exercised\n\n\n \n\n\n \n\n\n142.9\n\n\n \n\n\n \n\n\n \n\n\n111.7\n\n\n \n\n\n \n\n\n \n\n\n26.2\n\n\n \n\n\n\n\n\n\nPayment of cash dividends\n\n\n \n\n\n \n\n\n(\n277.0\n\n\n)\n\n\n \n\n\n \n\n\n(\n266.5\n\n\n)\n\n\n \n\n\n \n\n\n(\n255.0\n\n\n)\n\n\n\n\n\n\nPurchase of treasury stock\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n300.1\n\n\n)\n\n\n \n\n\n0.0\n\n\n \n\n\n\n\n\n\nDeferred financing and other\n\n\n \n\n\n \n\n\n(\n1.1\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.1\n\n\n)\n\n\n \n\n\n \n\n\n(\n12.0\n\n\n)\n\n\n\n\n\n\nNet Cash Used In Financing Activities\n\n\n \n\n\n \n\n\n(\n343.4\n\n\n)\n\n\n \n\n\n \n\n\n(\n725.6\n\n\n)\n\n\n \n\n\n \n\n\n(\n120.9\n\n\n)\n\n\n\n\n\n\nEffect of exchange rate changes on cash and cash equivalents\n\n\n \n\n\n \n\n\n(\n9.9\n\n\n)\n\n\n \n\n\n \n\n\n3.5\n\n\n \n\n\n \n\n\n \n\n\n(\n6.0\n\n\n)\n\n\n\n\n\n\nNet Change In Cash and Cash Equivalents\n\n\n \n\n\n \n\n\n619.6\n\n\n \n\n\n \n\n\n \n\n\n74.2\n\n\n \n\n\n \n\n\n \n\n\n29.7\n\n\n \n\n\n\n\n\n\nCash and Cash Equivalents at Beginning of Period\n\n\n \n\n\n \n\n\n344.5\n\n\n \n\n\n \n\n\n \n\n\n270.3\n\n\n \n\n\n \n\n\n \n\n\n240.6\n\n\n \n\n\n\n\n\n\nCash and Cash Equivalents at End of Period\n\n\n \n\n\n$\n\n\n964.1\n\n\n \n\n\n \n\n\n$\n\n\n344.5\n\n\n \n\n\n \n\n\n$\n\n\n270.3\n\n\n \n\n\n\n\n\n\n \n\n\nSee Notes to Consolidated Financial Statements\n.\n\n\n57\n\n\n\n\n \n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\n \n\n\nCONSOLIDATED STATEMENTS OF CASH FLOW-CONTINUED\n \n\n\n (In millions)\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nCash paid during the year for:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nInterest (net of amounts capitalized)\n\n\n \n\n\n$\n\n\n94.4\n\n\n \n\n\n \n\n\n$\n\n\n111.9\n\n\n \n\n\n \n\n\n$\n\n\n86.0\n\n\n \n\n\n\n\n\n\nIncome taxes\n\n\n \n\n\n$\n\n\n259.6\n\n\n \n\n\n \n\n\n$\n\n\n228.2\n\n\n \n\n\n \n\n\n$\n\n\n213.1\n\n\n \n\n\n\n\n\n\nSupplemental disclosure of non-cash investing activities:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nProperty, plant and equipment expenditures included in Accounts Payable\n\n\n \n\n\n$\n\n\n10.6\n\n\n \n\n\n \n\n\n$\n\n\n30.7\n\n\n \n\n\n \n\n\n$\n\n\n13.7\n\n\n \n\n\n\n\n\n\nSee Notes to Consolidated Financial Statements.\n \n\n\n \n\n\n58\n\n\n\n\n \n\n\n \n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\n\n\nCONSO\nLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY\n \n\n\nYears Ended December 31, 2024, 2023 and 2022\n \n\n\n(In millions)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nNumber of Shares\n\n\n \n\n\n \n\n\nAmounts\n\n\n\n\n\n\n \n\n\nCommon\nStock\n\n\n \n\n\n \n\n\nTreasury\nStock\n\n\n \n\n\n \n\n\nCommon\nStock\n\n\n \n\n\n \n\n\nAdditional\nPaid-In\nCapital\n\n\n \n\n\n \n\n\nRetained\nEarnings\n\n\n \n\n\n \n\n\nAccumulated\nOther\nComprehensive\nIncome (Loss)\n\n\n \n\n\n \n\n\nTreasury\nStock\n\n\n \n\n\n \n\n\nTotal\nChurch &\nDwight Co., Inc.\nStockholders'\nEquity\n\n\n \n\n\n \n\n\n\n\n\n\nDecember 31, 2021\n\n\n \n\n\n292.8\n\n\n \n\n\n \n\n\n \n\n\n(\n50.3\n\n\n)\n\n\n \n\n\n$\n\n\n292.8\n\n\n \n\n\n \n\n\n$\n\n\n310.3\n\n\n \n\n\n \n\n\n$\n\n\n5,366.0\n\n\n \n\n\n \n\n\n$\n\n\n(\n68.2\n\n\n)\n\n\n \n\n\n$\n\n\n(\n2,667.7\n\n\n)\n\n\n \n\n\n$\n\n\n3,233.2\n\n\n \n\n\n \n\n\n\n\n\n\nNet income\n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n413.9\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n413.9\n\n\n \n\n\n \n\n\n\n\n\n\nOther comprehensive income (loss)\n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n38.9\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n38.9\n\n\n \n\n\n \n\n\n\n\n\n\nCash dividends\n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n255.0\n\n\n)\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n255.0\n\n\n)\n\n\n \n\n\n\n\n\n\nStock purchases\n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n0.2\n\n\n)\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n20.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n20.0\n\n\n)\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n\n\n\n\nStock based compensation \n   expense and stock option plan \n   transactions\n\n\n \n\n\n0.9\n\n\n \n\n\n \n\n\n \n\n\n0.7\n\n\n \n\n\n \n\n\n \n\n\n0.9\n\n\n \n\n\n \n\n\n \n\n\n35.9\n\n\n \n\n\n \n\n\n \n\n\n(\n0.3\n\n\n)\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n22.4\n\n\n \n\n\n \n\n\n \n\n\n58.9\n\n\n \n\n\n \n\n\n\n\n\n\nDecember 31, 2022\n\n\n \n\n\n293.7\n\n\n \n\n\n \n\n\n \n\n\n(\n49.8\n\n\n)\n\n\n \n\n\n$\n\n\n293.7\n\n\n \n\n\n \n\n\n$\n\n\n366.2\n\n\n \n\n\n \n\n\n$\n\n\n5,524.6\n\n\n \n\n\n \n\n\n$\n\n\n(\n29.3\n\n\n)\n\n\n \n\n\n$\n\n\n(\n2,665.3\n\n\n)\n\n\n \n\n\n$\n\n\n3,489.9\n\n\n \n\n\n \n\n\n\n\n\n\nNet income\n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n755.6\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n755.6\n\n\n \n\n\n \n\n\n\n\n\n\nOther comprehensive income (loss)\n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n2.1\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n2.1\n\n\n \n\n\n \n\n\n\n\n\n\nCash dividends\n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n266.5\n\n\n)\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n266.5\n\n\n)\n\n\n \n\n\n\n\n\n\nStock purchases\n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n3.3\n\n\n)\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n300.1\n\n\n)\n\n\n \n\n\n \n\n\n(\n300.1\n\n\n)\n\n\n \n\n\n\n\n\n\nStock based compensation \n   expense and stock option plan \n   transactions\n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n2.5\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n88.6\n\n\n \n\n\n \n\n\n \n\n\n(\n1.4\n\n\n)\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n87.2\n\n\n \n\n\n \n\n\n \n\n\n174.4\n\n\n \n\n\n \n\n\n\n\n\n\nDecember 31, 2023\n\n\n \n\n\n293.7\n\n\n \n\n\n \n\n\n \n\n\n(\n50.6\n\n\n)\n\n\n \n\n\n$\n\n\n293.7\n\n\n \n\n\n \n\n\n$\n\n\n454.8\n\n\n \n\n\n \n\n\n$\n\n\n6,012.3\n\n\n \n\n\n \n\n\n$\n\n\n(\n27.2\n\n\n)\n\n\n \n\n\n$\n\n\n(\n2,878.2\n\n\n)\n\n\n \n\n\n$\n\n\n3,855.4\n\n\n \n\n\n \n\n\n\n\n\n\nNet income\n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n585.3\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n585.3\n\n\n \n\n\n \n\n\n\n\n\n\nOther comprehensive income (loss)\n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n3.7\n\n\n)\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n3.7\n\n\n)\n\n\n \n\n\n\n\n\n\nCash dividends\n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n277.0\n\n\n)\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n277.0\n\n\n)\n\n\n \n\n\n\n\n\n\nStock based compensation \n   expense and stock option plan \n   transactions\n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n2.8\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n108.3\n\n\n \n\n\n \n\n\n \n\n\n(\n0.9\n\n\n)\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n93.4\n\n\n \n\n\n \n\n\n \n\n\n200.8\n\n\n \n\n\n \n\n\n\n\n\n\nDecember 31, 2024\n\n\n \n\n\n293.7\n\n\n \n\n\n \n\n\n \n\n\n(\n47.8\n\n\n)\n\n\n \n\n\n$\n\n\n293.7\n\n\n \n\n\n \n\n\n$\n\n\n563.1\n\n\n \n\n\n \n\n\n$\n\n\n6,319.7\n\n\n \n\n\n \n\n\n$\n\n\n(\n30.9\n\n\n)\n\n\n \n\n\n$\n\n\n(\n2,784.8\n\n\n)\n\n\n \n\n\n$\n\n\n4,360.8\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nSee Notes to Consolidated Financial Statements.\n\n\n \n\n\n59\n\n\n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n \n(In millions, except share and per share data)\n \n\n\n \n\n\n1.\nSignificant Accounting Policies\nBusiness\nThe Company, founded in 1846, develops, manufactures and markets a broad range of household, personal care and specialty products focused on animal productivity, chemicals and cleaners.  The Company sells its consumer products under a variety of brands through a broad distribution platform that includes supermarkets, mass merchandisers, wholesale clubs, drugstores, convenience stores, home stores, dollar, pet and other specialty stores and websites and other e-commerce channels, all of which sell the products to consumers.  The Company also sells specialty products to industrial customers, livestock producers and through distributors.\n \nBasis of Presentation\n \nThe accompanying Consolidated Financial Statements are presented in accordance with accounting principles generally accepted in the U.S. (“US GAAP”) and include the accounts of the Company and its majority‑owned subsidiaries.  Material subsequent events are evaluated and disclosed through the report issuance date.  For equity investments in which the Company does not control or have the ability to exert significant influence over the investee, which generally is when the Company has less than a 20% ownership interest, the investments are accounted for under the cost method.  In circumstances where the Company has greater than a 20% ownershi\np interest and has the ability to exercise significant influence over, but does not control, the investee, the investment is accounted for under the equity method.  As a result, the Company accounts for its \n50\n% interest in its Armand Products Company (“Armand”) joint venture and its \n50\n% interest in The ArmaKleen Company (“ArmaKleen”) joint venture under the equity method.  The Company's \n50\n% interest in ArmaKleen was sold to our joint venture partner in October of 2024.  Armand and ArmaKleen are specialty chemical businesses.  The Company’s equity in earnings of Armand and ArmaKleen are included in the Corporate segment, as described in Note 16.\n \nUse of Estimates\nThe preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent gains and losses at the date of the financial statements and reported amounts of revenue and expenses during the reporting period.  Management makes estimates regarding inventory valuation, promotional and sales returns reserves, the carrying amount of goodwill and other intangible assets, the realization of deferred tax assets, tax reserves, business acquisition liabilities, liabilities related to other postretirement benefit obligations and other matters that affect the reported amounts and other disclosures in the financial statements.  These estimates are based on judgment and available information.  Actual results could differ materially from those estimates, and it is possible that changes in such estimates could occur in the near term.\n \nRevenue Recognition\nRevenue is recognized when control of a promised good is transferred to a customer in an amount that reflects the consideration that the Company expects to be entitled to in exchange for that good.  This usually occurs when finished goods are delivered to the Company’s customers or when finished goods are picked up by a customer or a customer’s carrier.\na.\nNature of Goods and Services\nThe Company primarily ships finished goods to its customers and operates in \nthree\n segments: Consumer Domestic, Consumer International and Specialty Products Division (“SPD”).  The segments are based on differences in the nature of products and management organizational structures.  The Consumer Domestic and Consumer International segments market a variety of personal care, household and over-the-counter products, including but not limited to baking soda, cat litter, laundry detergent, condoms, stain removers, hair removal, gummy dietary supplements, dry shampoo, oral care, cold remedy, acne treatment, water flossers and showerheads.  The SPD segment focuses on sales to businesses and participates in \nthree\n product areas: Animal Nutrition, Specialty Chemicals and Commercial & Professional.  The Company’s products are distinct and separately identifiable on customer contracts or invoices, with each product sale representing a separate performance obligation.\nThe Company sells consumer products under a variety of brands through a broad distribution platform that includes supermarkets, mass merchandisers, wholesale clubs, drugstores, convenience stores, home stores, dollar, pet and other specialty stores and websites and other e-commerce channels, all of which sell its products to consumers. The Company sells its specialty products to industrial customers, livestock producers and through distributors.\nRefer to Note 17 for disaggregated revenue information with respect to each of the Company’s segments.\n \n\n\n60\n\n\n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\n(In millions, except share and per share data)\n \n \n\n\n \nb.\nWhen Performance Obligations are Satisfied\nFor performance obligations related to the shipping and invoicing of products, control transfers at the point in time upon which finished goods are delivered to the Company’s customers or when finished goods are picked up by a customer or a customer’s carrier. Once a product has been delivered or picked up by the customer, the customer is able to direct the use of, and obtain substantially all of the remaining benefits from, the asset. The Company considers control to have transferred upon delivery or customer receipt because the Company has an enforceable right to payment at that time, the customer has legal title to the asset, the Company has transferred physical possession of the asset, and the customer has significant risk and rewards of ownership of the asset.\nc.\nVariable Consideration\nThe Company conducts extensive promotional activities, primarily through the use of off-list discounts, slotting, coupons, cooperative advertising, periodic price reduction arrangements, and end-aisle and other in-store displays.  The costs of such activities are netted against sales and are recorded when the related sale takes place.  The reserves for sales returns and consumer and trade promotion liabilities are established based on the Company’s best estimate of the amounts necessary to settle future and existing obligations for products sold as of the balance sheet date.  The Company uses historical trend experience and coupon redemption inputs in arriving at coupon reserve requirements, and uses forecasted appropriations, customer and sales organization inputs, and historical trend analysis in determining the reserves for other promotional activities and sales returns.\n \nd.\nPractical Expedients\nThe Company expenses incremental direct costs of obtaining a contract (broker commissions) when the related sale takes place. These costs are recorded in SG&A expenses in the accompanying consolidated statements of income.\nThe Company accounts for shipping and handling costs as fulfillment activities which are therefore recognized upon shipment of the goods.\nThe Company has applied the portfolio approach to all open contracts as they have similar characteristics and can reasonably expect that the effects on the financial statements of applying this guidance to the portfolio of contracts would not differ materially from applying this guidance to the individual contracts within the portfolio.\n \nThe Company excludes from its revenue any amounts collected from customers for sales (and similar) taxes.\n \n \nSales of Accounts Receivable\nThe Company entered into a factoring agreement with a financial institution to sell certain customer receivables at discounted rates in 2015.  Transactions under this agreement are accounted for as sales of accounts receivable and are removed from the Consolidated Balance Sheet at the time of the sales transaction.  The level of customers associated with the Company’\ns factoring program and the sales performance by those customers has driven the amount factored each year.  The total amount factored in each year was $\n105.9\n, $\n144.2\n, and $\n211.2\n during the years ended December 31, 2024, 2023 and 2022, respectively.\n \nCost of Sales, Marketing and Selling, General and Administrative Expenses\nCost of sales include costs related to the manufacture and distribution of the Company’s products, including raw material, inbound freight, import duties and tariffs, direct labor (including employee compensation benefits) and indirect plant costs such as plant supervision, receiving, inspection, maintenance labor and materials, depreciation, taxes and insurance, purchasing, production planning, operations management, logistics, freight to customers, warehousing costs, internal transfer freight costs and plant impairment charges.\nMarketing expenses include costs for advertising (excluding the costs of cooperative advertising programs, which are reflected in net sales), costs for coupon insertion (mainly the cost of printing and distribution), consumer promotion costs (such as on-shelf advertisements and floor ads), public relations, package design expense and market research costs.\nSelling, general and administrative (“SG&A”) expenses include, among others, costs related to functions such as sales, corporate management, research and development, marketing administration, information technology, finance and legal.  Such costs include salary compensation related costs (such as benefits, incentive compensation and profit sharing), stock based award costs, depreciation, travel and entertainment related expenses, professional and other consulting fees and amortization of intangible assets.\nForeign Currency Translation\n\n\n61\n\n\n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\n(In millions, except share and per share data)\n \n \n\n\nUnrealized gains and losses related to currency translation are recorded in Accumulated Other Comprehensive Income (Loss).  Gains and losses on foreign currency transactions are recorded in the Consolidated Statements of Income.\nCash Equivalents\nCash equivalents consist of highly liquid short-term investments and term bank deposits, which mature within three months of their original maturity date.\nInventories\nInventories are valued at the lower of cost or market (net realizable value, which reflects any costs to sell or dispose).  The Company identifies any slow moving, obsolete or excess inventory to determine whether an adjustment is required to establish a new carrying value.  The determination of whether inventory items are slow moving, obsolete or in excess of needs requires estimates and assumptions about the future demand for the Company’s products, technological changes, and new product introductions.  Estimates as to the future demand used in the valuation of inventory involve judgments regarding the ongoing success of the Company’s products.  The Company evaluates its inventory levels and expected usage on a periodic basis and records adjustments as required.  \nAdjustments to reflect inventory at net realizable value were $\n45.2\n at December 31, 2024, and $\n52.5\n at December 31, 2023.\n \nProperty, Plant and Equipment\nProperty, Plant and Equipment (“PP&E”) are stated at cost.  Depreciation is recorded using the straight-line method over the estimated useful lives of the respective assets.  Estimated useful lives for building and improvements, machinery and equipment, and office equipment range from \n9\n-\n40\n, \n3\n-\n20\n and \n3\n-\n10\n years, respectively.  Routine repairs and maintenance are expensed when incurred.  Leasehold improvements are depreciated over a period no longer than the respective lease term, except where a lease renewal has been determined to be reasonably assured and failure to renew the lease results in a significant penalty to the Company.\nPP&E is reviewed annually and whenever events or changes in circumstances indicate that possible impairment exists.  The Company’s impairment review is based on an undiscounted cash flow analysis at the lowest level at which cash flows of the long-lived assets are largely independent of other groups of Company assets and liabilities.  The analysis requires management judgment with respect to changes in technology, the continued success of product lines, and future volume, revenue and expense growth rates.  The Company conducts annual reviews to identify idle and underutilized equipment, and reviews business plans for possible impairment.  An indication of impairment occurs when the carrying value of the asset exceeds the future undiscounted cash flows.  When an impairment is indicated, the estimated future cash flows are then discounted to determine the estimated fair value of the asset and an impairment charge is recorded for the difference between the carrying value and the net present value of estimated future cash flows. \n \nSoftware\nThe Company capitalizes certain costs of developing computer software.  Amortization is recorded using the straight‑line method over the estimated useful life of the software, which is estimated to be no longer than \n10\n years.\nFair Value of Financial Instruments\n \nCertain financial instruments are required to be recorded at fair value.  The estimated fair values of such financial instruments (including investment securities and other derivatives) have been determined using market information and generally accepted valuation methodologies.  Changes in assumptions or estimation methods could affect the fair value estimates.  Other financial instruments, including cash equivalents and short-term debt, are recorded at cost, which approximates fair value.  Additional information regarding the Company’s risk management activities, including derivative instruments and hedging activities, are separately disclosed.  See Notes 2 and 3. \n \nGoodwill and Other Intangible Assets\nThe Company has intangible assets of substantial value on its consolidated balance sheet.  Intangible assets are generally related to intangible assets with a useful life, indefinite-lived trade names and goodwill.  The Company determines whether an intangible asset (other than goodwill) has a useful life based on multiple factors, including how long the Company intends to generate cash flows from the asset.\nCarrying \nvalues of goodwill and indefinite-lived trade names are reviewed periodically for possible impairment.  The Company’s impairment analysis is based on a discounted cash flow approach that requires significant judgment with respect to unit volume, revenue and expense growth rates, and the selection of an appropriate discount rate and royalty rate.  Management uses estimates based on expected trends in making these assumptions.  With respect to goodwill, impairment occurs when the carrying value of the reporting unit exceeds the discounted present value of cash flows for that reporting unit.  For trade names and other intangible assets, an impairment charge is recorded for the difference between the carrying value and the net present value of estimated future cash flows, which represents the estimated fair\n \n\n\n62\n\n\n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\n(In millions, except share and per share data)\n \n \n\n\nvalue \nof the asset.  Judgment is required in assessing whether assets may have become impaired between annual valuations.  Indicators such as unexpected adverse economic factors, unanticipated technological change, distribution losses, or competitive activities and acts by governments and courts may indicate that an asset has become impaired.  Intangible assets with finite lives are amortized over their estimated useful lives, which range from \n3\n-\n20\n years, using the straight-line method, and reviewed for impairment when changes in market circumstances occur.\n \nResearch and Development\n \nThe Company incurred research and development expenses in the amount o\nf $\n139.7\n, $\n122.4\n and $\n110.0\n in 2024, 2023 and 2022, respectively.  These expenses are included in SG&A expenses and are expensed as incurred.\nEarnings Per Share (“EPS”)\n \nBasic EPS is calculated based on income available to holders of the Company’s common stock (“Common Stock”) and the weighted-average number of shares outstanding during the reported period.  Diluted EPS includes dilution from potential Common Stock issuable pursuant to the exercise of outstanding stock options.  \nThe following table sets forth a reconciliation of the weighted-average number of shares of Common Stock outstanding to the weighted-average number of shares outstanding on a diluted basis:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nWeighted average common shares outstanding -  basic\n\n\n \n\n\n244.4\n\n\n \n\n\n \n\n\n \n\n\n244.9\n\n\n \n\n\n \n\n\n \n\n\n242.9\n\n\n \n\n\n\n\n\n\nDilutive effect of stock options\n\n\n \n\n\n2.5\n\n\n \n\n\n \n\n\n \n\n\n2.7\n\n\n \n\n\n \n\n\n \n\n\n3.4\n\n\n \n\n\n\n\n\n\nWeighted average common shares outstanding - diluted\n\n\n \n\n\n246.9\n\n\n \n\n\n \n\n\n \n\n\n247.6\n\n\n \n\n\n \n\n\n \n\n\n246.3\n\n\n \n\n\n\n\n\n\nAntidilutive stock options outstanding\n\n\n \n\n\n1.1\n\n\n \n\n\n \n\n\n \n\n\n2.6\n\n\n \n\n\n \n\n\n \n\n\n3.0\n\n\n \n\n\n\n\nEmployee and Director Stock Based Compensation\nThe fair value of stock-based compensation is determined at the grant date and the related expense is generally recognized over the required employee service period in which the share-based compensation vests.  For employees and Directors that meet retirement eligibility requirements, the expense related to stock-based compensation is recognized on the date of grant as there is no service period required to vest in the awards.  \nThe following table presents the pre-tax expense associated with the fair value of stock awards included in SG&A expenses and in cost of sales: \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nFor the Year Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nCost of sales\n\n\n$\n\n\n3.9\n\n\n \n\n\n \n\n\n$\n\n\n3.4\n\n\n \n\n\n \n\n\n$\n\n\n2.5\n\n\n \n\n\n\n\n\n\nSelling, general and administrative expenses\n\n\n \n\n\n56.2\n\n\n \n\n\n \n\n\n \n\n\n61.5\n\n\n \n\n\n \n\n\n \n\n\n30.1\n\n\n \n\n\n\n\n\n\nTotal\n\n\n$\n\n\n60.1\n\n\n \n\n\n \n\n\n$\n\n\n64.9\n\n\n \n\n\n \n\n\n$\n\n\n32.6\n\n\n \n\n\n\n\n \nIncome Taxes\nIncome taxes are accounted for under the asset and liability method.  Deferred tax assets and liabilities are recognized to reflect the future tax consequences attributable to the differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases and operating loss and tax credit carryforwards.  Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which the differences are expected to be recovered or settled.  Management provides a valuation allowance against deferred tax assets for amounts which are not considered “more likely than not” to be realized.  The Company records liabilities for potential assessments in various tax jurisdictions in accordance with GAAP.  The liabilities relate to tax return positions that, although supportable by the Company, may be challenged by the tax authorities and do not meet the minimum recognition threshold required under applicable accounting guidance for the related tax benefit to be recognized in the income statement.  The Company adjusts this liability as a result of changes in tax legislation, interpretations of laws by courts, rulings by tax authorities, changes in estimates and the expiration of the statute of limitations.  Many of the judgments involved in adjusting the liability involve assumptions and estimates that are highly uncertain and subject to change.  In this regard, settlement of any issue with, or an adverse determination in litigation against, a taxing authority could require the use of cash and result in an increase in the Company’s annual effective tax rate.  Conversely, favorable resolution of an issue with a taxing authority would be recognized as a reduction to the Company’s annual effective tax rate. \n \nRecently Adopted Accounting Pronouncements\n\n\n63\n\n\n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\n(In millions, except share and per share data)\n \n \n\n\nIn September 2022, the Financial Accounting Standards Board (the \"FASB\") issued Accounting Standards Update (“ASU”) 2022-04, Liabilities-Supplier Finance Programs (Topic 405-50): Disclosure of Supplier Finance Program Obligations, intended to add certain qualitative and quantitative disclosure requirements for a buyer in a supplier finance program. The amendments require a buyer that uses supplier finance programs to make annual disclosures about the program’s key terms, the balance sheet presentation of related amounts, the confirmed amount outstanding at the end of the period, and associated rollforward information. Only the amount outstanding at the end of the period must be disclosed in interim periods. The amendments are effective for all entities for fiscal years beginning after December 15, 2022 on a retrospective basis, including interim periods within those fiscal years, except for the requirement to disclose rollforward information, which is effective prospectively for fiscal years beginning after December 15, 2023. The Company has adopted the standard which resulted in additional disclosures. Refer to Note 9.\n \nIn November 2023, the FASB issued ASU 2023-07, Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures intended to improve reportable segment disclosure requirements, primarily through enhanced disclosures about significant expenses. The amendments require public entities to disclose significant segment expenses that are regularly provided to the chief operating decision maker and included within segment profit and loss. The standard was effective for fiscal years beginning after December 15, 2023, and interim periods within fiscal years beginning after December 15, 2024, with early adoption permitted, and will be applied retrospectively to all prior periods presented in the financial statements.  The Company has adopted the standard which resulted in additional disclosures. Refer to Note 17.\n \nRecent Accounting Pronouncements Not Yet Adopted\nIn December 2023, the FASB issued ASU 2023-09, Income Taxes (Topic 740): Improvements to Income Tax Disclosure which includes amendments that further expand income tax disclosures, by requiring the disaggregation of information in the rate reconciliation table, and income taxes paid by jurisdiction. The amendments are effective for fiscal years beginning after December 15, 2024, with early adoption permitted, and are to be applied either prospectively or retrospectively. The Company is currently evaluating the impact of adoption on the Company’s related disclosures.\nIn November 2024, the FASB issued ASU 2024-03, Income Statement - Reporting Comprehensive Income - Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses.  The ASU requires a public business entity to provide disaggregated disclosures of certain categories of expenses on an annual and interim basis including purchases of inventory, employee compensation, depreciation, and intangible asset amortization for each income statement line item that contains those expenses.  The standard is effective for annual reporting periods beginning after December 15, 2026, and interim periods beginning after December 15, 2027, with prospective or retrospective application permitted.  The Company is currently evaluating the impact of adoption on the Company’s related disclosures.\n \n\n\nThere have been no other accounting pronouncements issued but not yet adopted by the Company which are expected to have a material impact on the Company’s consolidated financial position, results of operations or cash flows.\n \n\n\n \n\n\n2.\nFair Value Measurements \nFair Value Hierarchy\n \nAccounting guidance on fair value measurements and disclosures establishes a hierarchy that prioritizes the inputs used to measure fair value (generally, assumptions that market participants would use in pricing an asset or liability) based on the quality and reliability of the information provided by the inputs, as follows:\n \nLevel 1: Quoted market prices in active markets for identical assets or liabilities.\n \nLevel 2: Observable market-based inputs or unobservable inputs that are corroborated by market data.\n \nLevel 3: Unobservable inputs that are not corroborated by market data.\n \n\n\n64\n\n\n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\n(In millions, except share and per share data)\n \n \n\n\nFair Values of Other Financial Instruments\n \nThe following table presents the carrying amounts and estimated fair values of the Company’s other financial instruments at December 31, 2024 and 2023:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\nDecember 31, 2024\n\n\n \n\n\n \n\n\nDecember 31, 2023\n\n\n \n\n\n\n\n\n\n \n\n\nInput\n\n\n \n\n\nCarrying\n\n\n \n\n\n \n\n\nFair\n\n\n \n\n\n \n\n\nCarrying\n\n\n \n\n\n \n\n\nFair\n\n\n \n\n\n\n\n\n\n \n\n\nLevel\n\n\n \n\n\nAmount\n\n\n \n\n\n \n\n\nValue\n\n\n \n\n\n \n\n\nAmount\n\n\n \n\n\n \n\n\nValue\n\n\n \n\n\n\n\n\n\nFinancial Assets:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCash equivalents\n\n\nLevel 1\n\n\n \n\n\n$\n\n\n793.3\n\n\n \n\n\n \n\n\n$\n\n\n793.3\n\n\n \n\n\n \n\n\n$\n\n\n217.7\n\n\n \n\n\n \n\n\n$\n\n\n217.7\n\n\n \n\n\n\n\n\n\nFinancial Liabilities:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nShort-term borrowings\n\n\nLevel 2\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n3.9\n\n\n \n\n\n \n\n\n \n\n\n3.9\n\n\n \n\n\n\n\n\n\nTerm loan due December 22, 2024\n\n\nLevel 2\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n200.0\n\n\n \n\n\n \n\n\n \n\n\n200.0\n\n\n \n\n\n\n\n\n\n3.15\n% Senior notes due August 1, 2027\n\n\nLevel 2\n\n\n \n\n\n \n\n\n424.9\n\n\n \n\n\n \n\n\n \n\n\n411.1\n\n\n \n\n\n \n\n\n \n\n\n424.8\n\n\n \n\n\n \n\n\n \n\n\n406.9\n\n\n \n\n\n\n\n\n\n2.3\n% Senior notes due December 15, 2031\n\n\nLevel 2\n\n\n \n\n\n \n\n\n399.4\n\n\n \n\n\n \n\n\n \n\n\n338.9\n\n\n \n\n\n \n\n\n \n\n\n399.3\n\n\n \n\n\n \n\n\n \n\n\n338.6\n\n\n \n\n\n\n\n\n\n5.6\n% Senior notes due November 15, 2032\n\n\nLevel 2\n\n\n \n\n\n \n\n\n499.2\n\n\n \n\n\n \n\n\n \n\n\n515.3\n\n\n \n\n\n \n\n\n \n\n\n499.2\n\n\n \n\n\n \n\n\n \n\n\n535.6\n\n\n \n\n\n\n\n\n\n3.95\n% Senior notes due August 1, 2047\n\n\nLevel 2\n\n\n \n\n\n \n\n\n397.8\n\n\n \n\n\n \n\n\n \n\n\n307.7\n\n\n \n\n\n \n\n\n \n\n\n397.7\n\n\n \n\n\n \n\n\n \n\n\n333.7\n\n\n \n\n\n\n\n\n\n5.0\n% Senior notes due June 15, 2052\n\n\nLevel 2\n\n\n \n\n\n \n\n\n499.9\n\n\n \n\n\n \n\n\n \n\n\n451.9\n\n\n \n\n\n \n\n\n \n\n\n499.8\n\n\n \n\n\n \n\n\n \n\n\n498.1\n\n\n \n\n\n\n\nThe Company recognizes transfers between input levels as of the actual date of the event.  There were no transfers between input levels during the twelve months ended December 31, 2024.\n \n \nThe following methods and assumptions were used to estimate the fair value of each class of financial instruments reflected in the Consolidated Balance Sheets:\n \nCash Equivalents:\n Cash equivalents consist of highly liquid short-term investments and term bank deposits, which mature within three months.  The estimated fair value of the Company’s cash equivalents approximates their carrying value.\n \nShort-Term Borrowings: \nThe carrying amounts of the Company’s unsecured lines of credit and commercial paper issuances approximates fair value because of their short maturities and variable interest rates.\n \nSenior Notes: \nThe Company determines the fair value of its senior notes based on their quoted market value or broker quotes, when possible.  In the absence of observable market quotes, the notes are valued using non-binding market consensus prices that the Company seeks to corroborate with observable market data.\n\n\nOther\n:  The carrying amounts of Accounts Receivable, Accounts Payable, and Accrued and Other Liabilities approximated estimated fair values as of December 31, 2024 and 2023.\n \n\n\n \n\n\n \n\n\n3.\nDerivative Instruments and Risk Management \nChanges in interest rates, foreign exchange rates, the price of the Company's Common Stock and commodity prices expose the Company to market risk.  The Company manages these risks by the use of derivative instruments, such as cash flow and fair value hedges, diesel and commodity hedge contracts, equity derivatives and foreign exchange forward contracts.  The Company does not use derivatives for trading or speculative purposes.\nThe Company formally designates and documents qualifying instruments as hedges of underlying exposures when it enters into derivative arrangements.  Changes in the fair value of derivatives designated as hedges and qualifying for hedge accounting are recorded in other comprehensive income and reclassified into earnings during the period in which the hedged exposure affects earnings.  The Company reviews the effectiveness of its hedging instruments on a quarterly basis.  If the Company determines that a derivative instrument is no longer effective in offsetting changes in fair values or cash flows, it recognizes the hedge ineffectiveness in current period earnings and discontinues hedge accounting with respect to the derivative instrument.  Changes in the fair value of derivatives not designated as hedges or those not qualifying for hedge accounting are recognized in current period earnings.  Upon termination of cash flow hedges, the Company reclassifies gains and losses from accumulated other comprehensive income based on the timing of the underlying cash flows, unless the termination results from the failure of the intended transaction to occur in the expected timeframe.  Such untimely transactions require immediate recognition in earnings of gains and losses previously recorded in other comprehensive income.\nDuring 2024 and 2023, the Company used derivative instruments to mitigate risk, some of which were designated as hedging instruments.  The tables following the discussion of the derivative instruments below summarize the fair value of the Company’s derivative\n \n\n\n65\n\n\n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\n(In millions, except share and per share data)\n \n \n\n\ninstruments and the effect of derivative instruments on the Company’s consolidated Statements of Income and on other comprehensive income.\nDerivatives Designated as Hedging Instruments\n \nDiesel Fuel Hedges\nThe Company uses independent freight carriers to deliver its products.  The carriers charge the Company a basic rate per mile for diesel fuel.  The Company has entered into hedge agreements with counterparties to mitigate the volatility of diesel fuel prices, and not to speculate in the future price of diesel fuel.  Under the hedge agreements, the Company agreed to pay a fixed price per gallon of diesel fuel determined at the time the agreements were executed and to receive a floating rate payment that is determined on a monthly basis based on the average price of the Department of Energy’s Diesel Fuel Index during the applicable month and is d\nesigned to offset any increase or decrease in fuel costs that the Company pays to it common carriers.  The agreements covered approximately \n42.0\n%\n of the Company’s 2024 diesel fuel requirements.  These diesel fuel hedge agreements qualified for hedge accounting.  Therefore, changes in the fair value of such agreements are recorded under Accumulated Other Comprehensive Income (Loss) on the Consolidated Balance Sheet.\n \nForeign Currency\nThe Company is subject to exposure from fluctuations in foreign currency exchange rates, primarily U.S. Dollar/Euro, U.S. Dollar/ Pound, U.S. Dollar/Canadian Dollar, U.S. Dollar/Mexican Peso, U.S Dollar/Chinese Yuan, U.S. Dollar/Australian Dollar and U.S. Dollar/Japanese Yen.\n \nThe Company enters into forward exchange contracts to reduce the impact of foreign exchange rate fluctuations related to anticipated but not yet committed sales or purchases denominated in U.S. Dollar, Canadian Dollar, Pound, Euro, Mexican Peso, Chinese Yuan, Japanese Yen, and Australian Dollar.  The Company entered into forward exchange contracts to hedge itself from the risk that, due to fluctuations in currency exchange rates, it would be adversely affected by net cash outflows.  The face value of the unexpired contracts as o\nf December 31, 2024 totaled $\n317.0\n in U.S. Dollars, of which\n \n$\n317.0\n qualifies as foreign currency cash flow hedges and, therefore, changes in the fair value of the contracts are recorded in Accumulated Other Comprehensive Income (Loss) and reclassified to earnings when the hedged transaction affected earnings.\n \nInterest Rate Lock Agreements\nFrom time to time the Company will enter into interest rate lock agreements to hedge the risk of changes in the interest payments attributable to changes in the interest rates associated with anticipated issuances of debt.  The interest rate lock agreements outstanding at December 31, 2021 were settled in the second quarter of 2022 for a loss of $\n4.2\n.  The Company entered into additional interest rate lock agreements in the third quarter of 2022 which were settled in the fourth quarter of 2022 for a gain of $\n21.9\n.  These agreements were used to hedge the interest rate risk associated with the first ten years of semi-annual interest payments associated w\nith the Senior Notes due in 2052 and 2032, respectively, and will each be amortized over a \nten-year\n period to interest expense.  There were \nno\n interest rate lock agreements outstanding as of December 31, 2024 or 2023.  The net gain on the settlement of these interest rate lock agreements was included in Accumulated Other Comprehensive Income (\"AOCI\").\n \nCommodity Hedges\nThe Company is subject to exposure due to changes in prices of commodities used in production.  To limit the effects of fluctuations in the future market price paid and related volatility in cash flows, the Company enters into commodity forward swap contracts.  These hedges are designated as cash flow hedges for accounting purposes and, therefore, changes in the fair value of the contracts are recorded in AOCI and reclassified to earnings when the hedged transaction affected earnings.  The fair value of these commodity hedge agreements is reflected in the Consolidated Balance Sheet within Other Current Assets, Accounts Payable, and Accrued and Other Liabilities.\n \n \nDerivatives not Designated as Hedging Instruments\n \nEquity Derivatives\nThe Company has entered into equity derivative contracts covering its Common Stock in order to minimize its liability under its Executive Deferred Compensation Plan resulting from changes in the quoted fair values of its Common Stock to participants who have investments under the Plan in a notional Common Stock fund.  The contracts are settled in cash.  Since the equity derivatives contracts do not qualify for hedge accounting,\n \nthe Company is required to mark such contracts to market throughout the contract term and record changes in fair value in the consolidated Statements of Income.\n\n\n66\n\n\n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\n(In millions, except share and per share data)\n \n \n\n\nThe notional amount of a derivative instrument is the nominal or face amount used to calculate payments made on that instrument.  Notional amounts are presented in the following table:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nNotional\n\n\n \n\n\nNotional\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nAmount\n\n\n \n\n\nAmount\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nDecember 31, 2024\n\n\n \n\n\nDecember 31, 2023\n\n\n \n\n\n\n\n\n\nDerivatives designated as hedging instruments\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nForeign exchange contracts\n\n\n \n\n\n$\n\n\n317.0\n\n\n \n\n\n$\n\n\n228.9\n\n\n \n\n\n\n\n\n\nDiesel fuel contracts\n\n\n \n\n\n0.8\n gallons\n\n\n \n\n\n2.3\n gallons\n\n\n \n\n\n\n\n\n\nCommodities contracts\n\n\n \n\n\n0.0\n pounds\n\n\n \n\n\n59.0\n pounds\n\n\n \n\n\n\n\n\n\nDerivatives not designated as hedging instruments\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nEquity derivatives\n\n\n \n\n\n$\n\n\n24.6\n\n\n \n\n\n$\n\n\n23.2\n\n\n \n\n\n\n\n\n\nExcluding the interest rate lock agreements disclosed above, the fair values and amount of gain (loss) recognized in income and other comprehensive income associated with the derivative instruments disclosed above did not have a material impact on the Company’s consolidated financial statements for the periods ended December 31, 2024, 2023, and 2022. \n \n\n\n67\n\n\n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n(In millions, except share and per share data)\n \n\n\n4.\nInventories \nInventories consist of the following:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nDecember 31,\n\n\n \n\n\n \n\n\nDecember 31,\n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nRaw materials and supplies\n\n\n$\n\n\n140.4\n\n\n \n\n\n \n\n\n$\n\n\n137.5\n\n\n \n\n\n\n\n\n\nWork in process\n\n\n \n\n\n45.4\n\n\n \n\n\n \n\n\n \n\n\n40.2\n\n\n \n\n\n\n\n\n\nFinished goods\n\n\n \n\n\n427.5\n\n\n \n\n\n \n\n\n \n\n\n435.6\n\n\n \n\n\n\n\n\n\nTotal\n\n\n$\n\n\n613.3\n\n\n \n\n\n \n\n\n$\n\n\n613.3\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n5.\nProperty, Plant and Equipment, Net (“PP&E”) \nPP&E consists of the following:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nDecember 31,\n\n\n \n\n\n \n\n\nDecember 31,\n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nLand\n\n\n$\n\n\n29.2\n\n\n \n\n\n \n\n\n$\n\n\n28.3\n\n\n \n\n\n\n\n\n\nBuildings and improvements\n\n\n \n\n\n348.2\n\n\n \n\n\n \n\n\n \n\n\n317.8\n\n\n \n\n\n\n\n\n\nMachinery and equipment\n\n\n \n\n\n1,000.4\n\n\n \n\n\n \n\n\n \n\n\n895.1\n\n\n \n\n\n\n\n\n\nSoftware\n\n\n \n\n\n129.6\n\n\n \n\n\n \n\n\n \n\n\n122.6\n\n\n \n\n\n\n\n\n\nOffice equipment and other assets\n\n\n \n\n\n129.3\n\n\n \n\n\n \n\n\n \n\n\n105.2\n\n\n \n\n\n\n\n\n\nConstruction in progress\n(1)\n\n\n \n\n\n215.1\n\n\n \n\n\n \n\n\n \n\n\n348.4\n\n\n \n\n\n\n\n\n\nGross PP&E\n\n\n \n\n\n1,851.8\n\n\n \n\n\n \n\n\n \n\n\n1,817.4\n\n\n \n\n\n\n\n\n\nLess accumulated depreciation\n\n\n \n\n\n920.1\n\n\n \n\n\n \n\n\n \n\n\n889.7\n\n\n \n\n\n\n\n\n\nNet PP&E\n\n\n$\n\n\n931.7\n\n\n \n\n\n \n\n\n$\n\n\n927.7\n\n\n \n\n\n\n\n \n \n(1)\nIn connection with the Vitamins, Minerals and Supplements (\"VMS\") impairment review completed in the third quarter of 2024, the Company recorded an impairment charge of $\n60.0\n in SG&A of Construction in progress assets.  The charge was recorded in the Consumer Domestic segment.  Refer to Note 7 for additional details.\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nFor the Year Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nDepreciation expense on PP&E\n\n\n$\n\n\n83.2\n\n\n \n\n\n \n\n\n$\n\n\n72.8\n\n\n \n\n\n \n\n\n$\n\n\n67.0\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n68\n\n\n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n(In millions, except share and per share data)\n \n\n\n6.\nAcquisitions \n \nOn June 3, 2024, the Company acquired substantially all of the issued and outstanding shares of capital stock of Graphico, Inc. (\"Graphico\"), a Japan-based distributor focused on consumer goods primarily in the Japanese market (the “Graphico Acquisition”).  The Company paid $\n19.9\n, net of cash acquired, at closing.  The Company acquired the remaining minority shares for approximately $\n2.0\n in July 2024. Graphico’s annual net sales for the year ended December 31, 2023 were approximately $\n38.0\n. The Graphico Acquisition was financed with cash on hand, is expected to contribute to greater expansion of our business in the Asia-Pacific (APAC) region, and is managed in the Consumer International segment.\n \nThe \npreliminary fair values of the net assets at acquisition are set forth as follows:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAccounts receivable\n\n\n$\n\n\n3.5\n\n\n \n\n\n\n\n\n\nInventory\n\n\n \n\n\n11.3\n\n\n \n\n\n\n\n\n\nOther current assets\n\n\n \n\n\n1.5\n\n\n \n\n\n\n\n\n\nOther long-term assets\n\n\n \n\n\n5.8\n\n\n \n\n\n\n\n\n\nCustomer relationship intangible asset\n\n\n \n\n\n8.4\n\n\n \n\n\n\n\n\n\nGoodwill\n\n\n \n\n\n2.8\n\n\n \n\n\n\n\n\n\nAccounts payable, accrued and other liabilities\n\n\n \n\n\n(\n6.9\n\n\n)\n\n\n\n\n\n\nLong-term debt\n\n\n \n\n\n(\n4.4\n\n\n)\n\n\n\n\n\n\nDeferred income taxes\n\n\n \n\n\n(\n2.1\n\n\n)\n\n\n\n\n\n\nCash purchase price (net of cash acquired)\n\n\n$\n\n\n19.9\n\n\n \n\n\n\n\nThe customer relationship intangible asset was valued using a discounted cash flow model and has a useful life of \n15 years\n. The goodwill is a result of expected synergies from combined operations of the acquired business and the Company. Pro forma results are not presented because the impact of the acquisition is not material to the Company’s consolidated financial results. The goodwill and other intangible assets associated with the Graphico Acquisition are not deductible for U.S. tax purposes.\n \nOn October 13, 2022, the Company acquired all of the issued and outstanding shares of capital stock of Hero Cosmetics, Inc. (\"Hero\"), the developer of the HERO® brand which includes the MIGHTY PATCH® acne treatment products (the “Hero Acquisition”).   The Company paid $\n546.8\n, net of cash acquired, at closing, and deferred an additional cash payment of $\n8.0\n for five years to satisfy certain indemnification obligations, if necessary. The Company also issued $\n61.5\n of restricted stock which will be recognized as compensation expense as the vesting requirements for individuals who received the restricted stock, and will continue to be employed by the Company, are satisfied at various dates over a three-year period from the date of the acquisition.  Hero’s annual net sales for the year ended December 31, 2022 were approximately $\n179.0\n. The Hero Acquisition was financed with cash on hand and commercial paper borrowings and is managed in the Consumer Domestic segment. In the first quarter of 2023, the Company made a net cash payment of $\n3.5\n primarily associated with final working capital adjustments.\n \n \nThe fair values of the net assets at acquisition are set forth as follows:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAccounts receivable\n\n\n$\n\n\n19.5\n\n\n \n\n\n\n\n\n\nInventory\n\n\n \n\n\n25.4\n\n\n \n\n\n\n\n\n\nOther current assets\n\n\n \n\n\n1.2\n\n\n \n\n\n\n\n\n\nProperty, plant and equipment\n\n\n \n\n\n0.4\n\n\n \n\n\n\n\n\n\nTrade name\n\n\n \n\n\n400\n.0\n\n\n \n\n\n\n\n\n\nOther intangible assets\n\n\n \n\n\n71.9\n\n\n \n\n\n\n\n\n\nGoodwill\n\n\n \n\n\n156.1\n\n\n \n\n\n\n\n\n\nAccounts payable and accrued expenses\n\n\n \n\n\n(\n1.1\n\n\n)\n\n\n\n\n\n\nDeferred and Other Long-term Liabilities\n\n\n \n\n\n(\n1.4\n\n\n)\n\n\n\n\n\n\nDeferred income taxes\n\n\n \n\n\n(\n117.2\n\n\n)\n\n\n\n\n\n\nBusiness acquisition liabilities - long-term\n\n\n \n\n\n(\n8.0\n\n\n)\n\n\n\n\n\n\nCash purchase price (net of cash acquired)\n\n\n$\n\n\n546.8\n\n\n \n\n\n\n\n \nThe trade name and other intangible assets were valued using a discounted cash flow model. The trade name and other intangible assets recognized from the Hero Acquisition have useful lives which range from \n10\n - \n20\n years. \nThe goodwill is a result of expected synergies from\n \n\n\n69\n\n\n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n(In millions, except share and per share data)\n \n\n\ncombined \noperations of the acquired business and the Company. Pro forma results are not presented because the impact of the acquisition is not material to the Company’s consolidated financial results. The goodwill and other intangible assets associated with the Hero Acquisition are not deductible for U.S. tax purposes.\n\n\n \n\n\n7.\nGoodwill and Other Intangibles, Net \n \nThe Company has intangible assets of substantial value on its consolidated balance sheet.  These intangible assets are generally related to intangible assets with a useful life, indefinite-lived trade names and goodwill.  The Company determines whether an intangible asset (other than goodwill) has a useful life based on multiple factors, including how long the Company intends to generate cash flows from the asset. These intangible assets are more fully explained in the following sections.\n \n \nIntangible Assets With a Useful Life\n \nThe following table provides information related to the carrying value of amortizable intangible assets:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nDecember 31, 2024\n\n\n \n\n\n \n\n\n \n\n\n \n\n\nDecember 31, 2023\n\n\n \n\n\n\n\n\n\n \n\n\nGross\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nAmortization\n\n\n \n\n\nGross\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nCarrying\n\n\n \n\n\n \n\n\nAccumulated\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nPeriod\n\n\n \n\n\nCarrying\n\n\n \n\n\n \n\n\nAccumulated\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nAmount\n\n\n \n\n\n \n\n\nAmortization\n\n\n \n\n\n \n\n\nImpairments\n(1)\n\n\n \n\n\n \n\n\nNet\n\n\n \n\n\n \n\n\n(Years)\n\n\n \n\n\nAmount\n\n\n \n\n\n \n\n\nAmortization\n\n\n \n\n\n \n\n\nImpairments\n\n\n \n\n\n \n\n\nNet\n\n\n \n\n\n\n\n\n\nAmortizable intangible assets:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nTrade names\n\n\n$\n\n\n1,383.4\n\n\n \n\n\n \n\n\n$\n\n\n(\n479.6\n\n\n)\n\n\n \n\n\n$\n\n\n0.0\n\n\n \n\n\n \n\n\n$\n\n\n903.8\n\n\n \n\n\n \n\n\n3\n-\n20\n\n\n \n\n\n$\n\n\n1,385.5\n\n\n \n\n\n \n\n\n$\n\n\n(\n403.5\n\n\n)\n\n\n \n\n\n$\n\n\n0.0\n\n\n \n\n\n \n\n\n$\n\n\n982.0\n\n\n \n\n\n\n\n\n\nCustomer Relationships\n\n\n \n\n\n644.9\n\n\n \n\n\n \n\n\n \n\n\n(\n402.1\n\n\n)\n\n\n \n\n\n \n\n\n(\n15.8\n\n\n)\n\n\n \n\n\n \n\n\n227.0\n\n\n \n\n\n \n\n\n15\n-\n20\n\n\n \n\n\n \n\n\n644.9\n\n\n \n\n\n \n\n\n \n\n\n(\n373.3\n\n\n)\n\n\n \n\n\n \n\n\n(\n3.5\n\n\n)\n\n\n \n\n\n \n\n\n268.1\n\n\n \n\n\n\n\n\n\nPatents/Formulas\n\n\n \n\n\n205.5\n\n\n \n\n\n \n\n\n \n\n\n(\n127.2\n\n\n)\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n78.3\n\n\n \n\n\n \n\n\n4\n-\n20\n\n\n \n\n\n \n\n\n208.3\n\n\n \n\n\n \n\n\n \n\n\n(\n116.1\n\n\n)\n\n\n \n\n\n \n\n\n(\n1.9\n\n\n)\n\n\n \n\n\n \n\n\n90.3\n\n\n \n\n\n\n\n\n\nTotal\n\n\n$\n\n\n2,233.8\n\n\n \n\n\n \n\n\n$\n\n\n(\n1,008.9\n\n\n)\n\n\n \n\n\n$\n\n\n(\n15.8\n\n\n)\n\n\n \n\n\n$\n\n\n1,209.1\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n2,238.7\n\n\n \n\n\n \n\n\n$\n\n\n(\n892.9\n\n\n)\n\n\n \n\n\n$\n\n\n(\n5.4\n\n\n)\n\n\n \n\n\n$\n\n\n1,340.4\n\n\n \n\n\n\n\n(1)    \nThe $15.8 impairment charge relates to the VMS customer relationship intangible asset.\n \n \nIntangible amortization expense amounted to $\n121.5\n for 2024, $\n124.3\n for 2023 and $\n122.4\n for 2022, respectively.  The Company estimates that intangible amortization expense will be approximately $\n116.0\n in 2025 and approximately $\n97.0\n declining to $\n84.0\n annually over the next five years.\nIn the fourth quarter of 2022, the Company determined that a review of our ability to recover the carrying values of the global FINISHING TOUCH FLAWLESS intangible assets was necessary based on the discontinuance of certain products at a major retailer. The FINISHING TOUCH FLAWLESS assets consist of the definite-lived trade name, customer relationships and technology assets recorded at acquisition. The Company evaluated our ability to recover the intangible assets by comparing the carrying amount to the future undiscounted cash flows and determined that the cash flows would not be sufficient to recover the carrying value of the assets.  After determining the estimated fair value of the assets, which included a reduction in cash flows due to the loss of distribution mentioned above along with an expected continued decline in discretionary consumption and higher interest rates, a non-cash impairment charge of $\n411.0\n was recorded in the fourth quarter of 2022.  The impairment charge is included in SG&A with $\n349.3\n recorded in the Consumer Domestic segment and $\n61.7\n recorded in the Consumer International segment.  The impairment charge was applied as a full impairment of the customer relationship and technology assets and a partial impairment of the trade name.  The remaining net book value of the trade name as of December 31, 2024 is $\n15.4\n and will be amortized over a remaining useful life of\n one year\n.  The estimated fair value of the intangible assets was determined using the income approach with Level 3 inputs.  The Level 3 inputs include the discount rate of \n8.5\n% applied to management’s estimates of future cash flows based on projections of revenue, gross margin, marketing expense and tax rates considering the loss of product distribution and the reduction in customer demand that FINISHING TOUCH FLAWLESS had been experiencing through December 31, 2022.\n \n \n \nIndefinite-Lived Intangible Assets\nThe following table presents the carrying value of indefinite-lived intangible assets:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nDecember 31,\n\n\n \n\n\n \n\n\nDecember 31,\n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nGross Carrying Value Trade Names\n\n\n$\n\n\n1,960.7\n\n\n \n\n\n \n\n\n$\n\n\n1,961.9\n\n\n \n\n\n\n\n\n\nVMS impairment\n\n\n \n\n\n281.3\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n\n\n\n\nNet Carrying Value Trade Names\n\n\n$\n\n\n1,679.4\n\n\n \n\n\n \n\n\n$\n\n\n1,961.9\n\n\n \n\n\n\n\nThe Company’s indefinite-lived intangible impairment review is completed in the fourth quarter of each year.\n \n\n\n70\n\n\n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n(In millions, except share and per share data)\n \n\n\nFair value of indefinite-lived trade names was estimated based on a “relief from royalty” or “excess earnings” discounted cash flow method, which contains numerous variables that are subject to change as business conditions change, and therefore could impact fair values in the future.  The key assumptions used in determining fair value are sales growth, profitability margins, tax rates, discount rates and royalty rates. The Company determined that the fair value of all indefinite-lived trade names for each of the years in the three-year period ended December 31, 2024 exceeded their respective carrying values based upon the forecasted cash flows and profitability, with the exception of the Vitamins, Minerals and Supplements (\"VMS\") business described below.\n During the third quarter of 2024, the Company continued to experience a decline in market share and a deterioration in the financial performance of its VMS business, which includes the VITAFUSION and L'IL CRITTERS trade name, primarily due to significant product competition coming from new category entrants, including private label.  The continued decline in profitability caused management to reassess its long-term strategy and financial outlook of the business.  The revised financial outlook reflects lower estimates of future sales growth and cash flows which resulted in a triggering event in the third quarter.  The triggering event required the Company to review the carrying value of assets supporting the business.  The assets supporting the VMS business include the VITAFUSION and L'IL CRITTERS indefinite-lived trade name, a definite-lived customer relationship intangible asset and PP&E specific to the VMS business.\nThe Company used an excess earnings discounted cash flow model to determine the fair value of the trade name.  The assumptions used in the model require significant judgement in determining the expected future cash flows.  The key assumptions utilized in the Company's impairment analysis included, but were not limited, net sales growth rates between -15.2% and 2.1%, EBITA margins in the low single digits, and a discount rate of \n8.25\n%.  Estimates are based on market conditions and management’s current expectation of the success of growth and profitability initiatives.  The valuation resulted in a full impairment of the $\n281.3\n trade name.  The remaining carry value of the trade name at December 31, 2024 is $\n0.0\n.\n \nThe Company also evaluated its ability to recover the carrying value of long-lived assets supporting the VMS business by comparing the carrying amount of those assets to the future undiscounted cash flows over the estimated life of the identified primary asset.  The result of this evaluation was that the cash flows would not be sufficient to recover the carrying value of the assets requiring the Company to compare the carrying value of those assets to their fair value.  The Company used an excess earnings discounted cash flow model to determine the estimated fair value of the long-lived assets.  The key assumptions utilized in the Company's impairment analysis were the same as those used to estimate the fair value of the trade name.  The valuation resulted in a fair value of the long-lived assets that is below their carry value requiring a pre-tax impairment charge of $\n75.8\n.  The impairment charge was allocated $\n60.0\n to the PP&E of the VMS business and $\n15.8\n to the remaining customer relationship intangible asset.  The remaining carrying values of the PP&E and the customer relationship intangible asset specific to the VMS business at December 31, 2024 are \n$\n140.7\n \nand $\n0.0\n, respectively.\n \nA summary of the VMS intangible and fixed asset impairment charges are as follows:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nDecember 31,\n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nTrade Name\n\n\n$\n\n\n281.3\n\n\n \n\n\n\n\n\n\nCustomer Relationship Intangible Asset\n\n\n \n\n\n15.8\n\n\n \n\n\n\n\n\n\nPP&E\n\n\n \n\n\n60.0\n\n\n \n\n\n\n\n\n\nTotal VMS impairment charges\n\n\n$\n\n\n357.1\n\n\n \n\n\n\n\n \nThe Company’s global WATERPIK business has continued to experience a significant decline in customer demand for many of its products, primarily due to lower consumer spending for discretionary products from inflation and a growing number of water flosser consumers switching to more value-branded products.  As a result, the WATERPIK business has experienced declining sales and profits resulting in a reduction in expected future cash flows which have eroded a substantial portion of the excess between the fair and carrying value of the trade name. This indefinite-lived intangible asset may be susceptible to impairment and a continued decline in fair value could trigger a future impairment charge of the WATERPIK trade name. The carrying value of the WATERPIK trade name was $\n644.7\n and fair value represented \n135\n% of the carrying value as of October 1, 2024 (the date of the Company's last annual impairment test). \nThe fair value represented \n109\n% of the carrying value as of October 1, 2023.  The increase in fair value is mainly attributable to a favorable tariff ruling on certain Waterpik products imported from China.  \nThe key assumptions used in the projections from the Company’s October 1, 2024 impairment analysis include a discount rate of \n8.1\n%, revenue growth rates between 2% and 7% and EBITA margins between 25% and 29%. These assumptions were based on current market conditions \nas of the date of the impairment analysis, recent trends and management’s expectation of the success of initiatives to lower costs and to develop lower-cost water flosser alternatives.  While management has implemented strategies to address the risk, significant changes in operating plans or adverse changes in the future could reduce the underlying cash flows used to estimate fair value.\n \n\n\n71\n\n\n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n(In millions, except share and per share data)\n \n\n\n \nGoodwill\nThe changes in the carrying amount of goodwill for the years ended December 31, 2024 and 2023 are as follows:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nConsumer\n\n\n \n\n\n \n\n\nConsumer\n\n\n \n\n\n \n\n\nSpecialty\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nDomestic\n\n\n \n\n\n \n\n\nInternational\n\n\n \n\n\n \n\n\nProducts\n\n\n \n\n\n \n\n\nTotal\n\n\n \n\n\n\n\n\n\nBalance at December 31, 2022\n\n\n$\n\n\n2,056.4\n\n\n \n\n\n \n\n\n$\n\n\n234.4\n\n\n \n\n\n \n\n\n$\n\n\n136.0\n\n\n \n\n\n \n\n\n$\n\n\n2,426.8\n\n\n \n\n\n\n\n\n\nHero Acquisition adjustments\n\n\n \n\n\n4.7\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n4.7\n\n\n \n\n\n\n\n\n\nBalance at December 31, 2023\n\n\n$\n\n\n2,061.1\n\n\n \n\n\n \n\n\n$\n\n\n234.4\n\n\n \n\n\n \n\n\n$\n\n\n136.0\n\n\n \n\n\n \n\n\n$\n\n\n2,431.5\n\n\n \n\n\n\n\n\n\nGraphico acquired goodwill\n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n2.8\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n2.8\n\n\n \n\n\n\n\n\n\nPassport divestiture\n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n1.1\n\n\n)\n\n\n \n\n\n \n\n\n(\n1.1\n\n\n)\n\n\n\n\n\n\nBalance at December 31, 2024\n\n\n$\n\n\n2,061.1\n\n\n \n\n\n \n\n\n$\n\n\n237.2\n\n\n \n\n\n \n\n\n$\n\n\n134.9\n\n\n \n\n\n \n\n\n$\n\n\n2,433.2\n\n\n \n\n\n\n\n \nThe result of the Company’s annual goodwill impairment test, performed in the beginning of the second quarter of 2024, determined that the estimated fair value substantially exceeded the carrying values of all reporting units.  The determination of fair value contains numerous variables that are subject to change as business conditions change and therefore could impact fair value in the future.\n \n\n\n \n\n\n72\n\n\n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n(In millions, except share and per share data)\n \n\n\n8.\nLeases\n \nThe Company leases certain manufacturing facilities, warehouses, office space, railcars and equipment. Leases with an initial term of twelve months or less are not recorded on the consolidated balance sheet.  All recorded leases are classified as operating leases and lease expense is recognized on a straight-line basis over the lease term. For leases beginning in 2019, lease components (base rental costs) are accounted for separately from the nonlease components (e.g., common-area maintenance costs).  For leases that do not provide an implicit rate, the Company uses its estimated secured incremental borrowing rate based on the information available at commencement date in determining the present value of lease payments.\n \n \nA summary of the Company’s lease information is as follows:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDecember 31,\n\n\n \n\n\n \n\n\nDecember 31,\n\n\n \n\n\n\n\n\n\n \n\n\nClassification\n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nAssets\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRight of use assets\n\n\nOther Assets\n\n\n$\n\n\n182.3\n\n\n \n\n\n \n\n\n$\n\n\n186.0\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nLiabilities\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCurrent lease liabilities\n\n\nAccrued and Other Liabilities\n\n\n$\n\n\n32.4\n\n\n \n\n\n \n\n\n$\n\n\n24.7\n\n\n \n\n\n\n\n\n\nLong-term lease liabilities\n\n\nDeferred and Other Long-term Liabilities\n\n\n \n\n\n168.5\n\n\n \n\n\n \n\n\n \n\n\n174.9\n\n\n \n\n\n\n\n\n\nTotal lease liabilities\n\n\n \n\n\n$\n\n\n200.9\n\n\n \n\n\n \n\n\n$\n\n\n199.6\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nOther information\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nWeighted-average remaining lease term (years)\n\n\n \n\n\n \n\n\n7.4\n\n\n \n\n\n \n\n\n \n\n\n8.1\n\n\n \n\n\n\n\n\n\nWeighted-average discount rate\n\n\n \n\n\n \n\n\n4.6\n\n\n%\n\n\n \n\n\n \n\n\n4.5\n\n\n%\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nTwelve Months\n\n\n \n\n\n \n\n\n \n\n\nTwelve Months\n\n\n \n\n\n \n\n\nTwelve Months\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nEnded\n\n\n \n\n\n \n\n\n \n\n\nEnded\n\n\n \n\n\n \n\n\nEnded\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nDecember 31, 2024\n\n\n \n\n\n \n\n\n \n\n\nDecember 31, 2023\n\n\n \n\n\n \n\n\nDecember 31, 2022\n\n\n \n\n\n \n\n\n\n\n\n\nStatement of Income\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nLease cost\n(1)\n\n\n \n\n\n$\n\n\n40.2\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n31.7\n\n\n \n\n\n \n\n\n$\n\n\n31.0\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nTwelve Months\n\n\n \n\n\n \n\n\n \n\n\nTwelve Months\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nEnded\n\n\n \n\n\n \n\n\n \n\n\nEnded\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nDecember 31, 2024\n\n\n \n\n\n \n\n\n \n\n\nDecember 31, 2023\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nOther information\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nLeased assets obtained in exchange for new lease liabilities\n(2)\n\n\n \n\n\n$\n\n\n28.0\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n47.2\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCash paid for amounts included in the measurement of lease liabilities\n\n\n \n\n\n$\n\n\n35.3\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n30.9\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n(1)\nLease expense is included in cost of sales or SG&A expenses based on the nature of the leased item.  Short-term lease expense is excluded from this amount and is not material.  The Company also has certain variable leases which are not material.  The noncash component of lease expense for the twelve months ended December 31, 2024, 2023 and 2022 wa\ns $\n30.9\n, \n$\n24.3\n and $\n24.0\n, respectively, is included in the amortization caption in the consolidated statement of cash flows.\n \n(2)\nLeased assets obtained in exchange for new lease liabilities in 2024 consisted of $\n16.8\n of real estate lease additions and $\n11.2\n of equipment lease additions, net of modifications.  These additions included expanded space at one of the Company's leased manufacturing facilities.  This resulted in an increase to the Company’s right of use assets and corresponding lease liabilities of approximately $\n15.4\n recorded in the first quarter of 2024.  \nLeased assets obtained in exchange for new lease liabilities in 2023 consisted of $\n40.9\n of real estate lease additions and $\n6.3\n of equipment lease additions, net of modifications. These additions included $\n36.9\n for an agreement between the Company and a third-party warehouse provider for warehouse space\n.  \n \n \n \n \n \n \n \n \n\n\n73\n\n\n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n(In millions, except share and per share data)\n \n\n\nThe Company’s minimum annual rentals including reasonably assured renewal options under lease agreements are as follows:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nOperating\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nLeases\n\n\n \n\n\n\n\n\n\n2025\n\n\n \n\n\n$\n\n\n40.9\n\n\n \n\n\n\n\n\n\n2026\n\n\n \n\n\n \n\n\n32.6\n\n\n \n\n\n\n\n\n\n2027\n\n\n \n\n\n \n\n\n29.5\n\n\n \n\n\n\n\n\n\n2028\n\n\n \n\n\n \n\n\n26.0\n\n\n \n\n\n\n\n\n\n2029\n\n\n \n\n\n \n\n\n25.6\n\n\n \n\n\n\n\n\n\n2030 and thereafter\n\n\n \n\n\n \n\n\n84.7\n\n\n \n\n\n\n\n\n\nTotal future minimum lease commitments\n\n\n \n\n\n \n\n\n239.3\n\n\n \n\n\n\n\n\n\nLess: Imputed interest\n\n\n \n\n\n \n\n\n(\n38.4\n\n\n)\n\n\n\n\n\n\nPresent value of lease liabilities\n\n\n \n\n\n$\n\n\n200.9\n\n\n \n\n\n\n\n\n\n \n\n\n9.\nAccounts Payable, Accrued and Other Liabilities \nAccounts payable, accrued and other liabilities consist of the following:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nDecember 31,\n\n\n \n\n\n \n\n\nDecember 31,\n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nAccounts payable\n\n\n$\n\n\n705.1\n\n\n \n\n\n \n\n\n$\n\n\n630.6\n\n\n \n\n\n\n\n\n\nAccrued marketing and promotion costs\n\n\n \n\n\n259.6\n\n\n \n\n\n \n\n\n \n\n\n276.7\n\n\n \n\n\n\n\n\n\nAccrued wages and related benefit costs\n\n\n \n\n\n151.4\n\n\n \n\n\n \n\n\n \n\n\n152.3\n\n\n \n\n\n\n\n\n\nOther accrued current liabilities\n\n\n \n\n\n194.5\n\n\n \n\n\n \n\n\n \n\n\n151.4\n\n\n \n\n\n\n\n\n\nTotal\n\n\n$\n\n\n1,310.6\n\n\n \n\n\n \n\n\n$\n\n\n1,211.0\n\n\n \n\n\n\n\n \n In 2015, the Company initiated a Supply Chain Finance program (“SCF Program”). Under the SCF Program, qualifying suppliers may elect to sell their receivables from the Company for early payment. Participating suppliers negotiate their receivables sales arrangements directly with a third party. The Company is not party to those agreements and do not have an economic interest in the suppliers' decisions to sell their receivables and has not been required to pledge any assets as security nor to provide any guarantee to third-party finance providers or intermediaries. The SCF Program may allow suppliers to obtain more favorable terms than they could secure on their own. The terms of the Company's payment obligations are not impacted by a supplier’s participation in the SCF Program.  The Company's payment terms with suppliers are consistent between suppliers that elect to participate in the SCF Program and those that do not participate. As a result, the program does not have an impact to the Company's average days outstanding.\nThe obligations outstanding related to the SCF program amount to $\n98.5\n and $\n82.0\n as of December 31, 2024 and 2023, respectively, and were recorded within Accounts Payable in the consolidated balance sheets.  Payments included in operating activities within the Company's Consolidated Statements of Cash Flows amounted to \n$\n388.7\n and $\n387.1\n in the years ended December 31, 2024 and 2023, respectively.\n \n\n\n74\n\n\n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n(In millions, except share and per share data)\n \n\n\n10.\nShort-Term Borrowings and Long-Term Debt \nShort-term borrowings and long-term debt consist of the following:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nDecember 31,\n\n\n \n\n\n \n\n\nDecember 31,\n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nShort-term borrowings\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nVarious debt due to international banks\n\n\n$\n\n\n0.0\n\n\n \n\n\n \n\n\n$\n\n\n3.9\n\n\n \n\n\n\n\n\n\nTotal short-term borrowings\n\n\n$\n\n\n0.0\n\n\n \n\n\n \n\n\n$\n\n\n3.9\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nLong-term debt\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nTerm loan due December 22, 2024\n\n\n$\n\n\n0.0\n\n\n \n\n\n \n\n\n$\n\n\n200.0\n\n\n \n\n\n\n\n\n\n3.15\n% Senior notes due \nAugust 1, 2027\n\n\n \n\n\n425.0\n\n\n \n\n\n \n\n\n \n\n\n425.0\n\n\n \n\n\n\n\n\n\nLess: Discount\n\n\n \n\n\n(\n0.1\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.2\n\n\n)\n\n\n\n\n\n\n2.3\n% Senior notes due \nDecember 15, 2031\n\n\n \n\n\n400.0\n\n\n \n\n\n \n\n\n \n\n\n400.0\n\n\n \n\n\n\n\n\n\nLess: Discount\n\n\n \n\n\n(\n0.6\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.7\n\n\n)\n\n\n\n\n\n\n5.6\n% Senior notes due \nNovember 15, 2032\n\n\n \n\n\n500.0\n\n\n \n\n\n \n\n\n \n\n\n500.0\n\n\n \n\n\n\n\n\n\nLess: Discount\n\n\n \n\n\n(\n0.8\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.8\n\n\n)\n\n\n\n\n\n\n3.95\n% Senior notes due \nAugust 1, 2047\n\n\n \n\n\n400.0\n\n\n \n\n\n \n\n\n \n\n\n400.0\n\n\n \n\n\n\n\n\n\nLess: Discount\n\n\n \n\n\n(\n2.2\n\n\n)\n\n\n \n\n\n \n\n\n(\n2.3\n\n\n)\n\n\n\n\n\n\n5.0\n% Senior notes due \nJune 15, 2052\n\n\n \n\n\n500.0\n\n\n \n\n\n \n\n\n \n\n\n500.0\n\n\n \n\n\n\n\n\n\nLess: Discount\n\n\n \n\n\n(\n0.1\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.2\n\n\n)\n\n\n\n\n\n\nDebt issuance costs, net\n\n\n \n\n\n(\n16.6\n\n\n)\n\n\n \n\n\n \n\n\n(\n18.7\n\n\n)\n\n\n\n\n\n\nTotal long-term debt\n\n\n \n\n\n2,204.6\n\n\n \n\n\n \n\n\n \n\n\n2,402.1\n\n\n \n\n\n\n\n\n\nLess: Current maturities\n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n199.9\n\n\n)\n\n\n\n\n\n\nNet long-term debt\n\n\n$\n\n\n2,204.6\n\n\n \n\n\n \n\n\n$\n\n\n2,202.2\n\n\n \n\n\n\n\n \nCommercial Paper\nUnder the Company’s commercial paper program, the Company may issue commercial paper notes up to an aggregate principal amount outstanding at any given time of $\n1,500.0\n.\n \nThe maturities of the notes will vary but may not exceed \n397 \ndays.  The interest rates on the notes will vary based on market conditions and the ratings assigned to the notes by the rating agencies designated in the agreement at the time of issuance.  Subject to market conditions, the Company intends to utilize the commercial paper program as its primary short-term borrowing facility.  If, for any reason, the Company is unable to access the commercial paper market, the Company's Revolving Credit Facility would be utilized to meet the Company’s short-term liquidity needs.  The Company did \nnot\n have any commercial paper outstanding as of December 31, 2024 or 2023. As of December 31, 2024, the Company had approximately $\n1,494.0\n available through the Revolving Credit Facility and commercial paper program.\n \n \nDecember 22, 2024 Term Loan\nOn December 22, 2021, the Company entered into a $\n400.0\n unsecured term loan facility (as amended on June 16, 2022, the “Term Loan Facility”) with various banks.  The loan under the Term Loan Facility (the \"Term Loan\") was fully drawn at closing.  The Term Loan was due on \nDecember 22, 2024\n, but was prepaid in full by the end of the first quarter of 2024.  The interest rate was the Secured Overnight Financing Rate (“SOFR”) plus a spread and an applicable margin based on the Company’s credit rating, which can range from \n60\n basis points to \n125\n bps.  The proceeds of the Loan were used to partially fund the TheraBreath Acquisition, with the remaining proceeds used for the repayment of commercial paper.  In 2023, the Company repaid $\n200.0\n of the Term Lo\nan with cash on hand and commercial paper borrowings.  In the first quarter of 2024, the Company repaid the remaining $\n200.0\n of the Term Loan with cash on hand.\nThe Term Loan Facility also contains customary events of default, including failure to make certain payments under the Term Loan Facility when due, breach of covenants, materially incorrect representations and warranties, default on other material indebtedness, events of bankruptcy, material adverse judgments, certain events relating to pension plans, the failure of any of the loan documents to remain in full force and effect and the occurrence of any change in control with respect to the Company.\n \n \n\n\n75\n\n\n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n(In millions, except share and per share data)\n \n\n\n3.15% Senior Notes due August 1, 2027\nOn July 25, 2017, the Company issued $\n425.0\n aggregate principal amount of \n3.15\n% Senior Notes due 2027 (the “2027 Notes”).  The 2027 Notes bear interest at \n3.15\n%.  Interest on the 2027 Notes is payable semi-annually, on each February 1 and August 1.  The 2027 Notes will mature on \nAugust 1, 2027 \nunless earlier retired or redeemed.\n \n \n2.3% Senior Notes due December 15, 2031\nThe Company financed the TheraBreath Acquisition with a portion of the proceeds from an underwritten public offering of $\n400.0\n aggregate principal amount Senior Notes due 2031 (the “2031 Notes”).  The 2031 Notes bear interest at \n2.30\n%.  Interest on the 2031 Notes is payable semi-annually, on each June 15 and December 15.  The 2031 Notes will mature on \nDecember 15, 2031\n, unless earlier retired or redeemed.\n \n5.6% Senior Notes due November 15, 2032\nOn October 31, 2022, the Company issued $\n500.0\n aggregate principal amount of \n5.60\n% Senior Notes due 2032 (the “2032 Notes”).  The proceeds from the sale of the 2032 Notes were used to repay commercial paper borrowings incurred to finance the Company’s acquisition of Hero Cosmetics, Inc. The 2032 Notes will mature on \nNovember 15, 2032\n, unless earlier retired or redeemed.\n3.95% Senior Notes due August 1, 2047\n \nOn July 25, 2017, the Company issued $\n400.0\n aggregate principal amount of \n3.95\n% Senior Notes due August 1, 2047 (the “2047 Notes”) to partially finance the Waterpik Acquisition and repay a portion of the Company’s outstanding commercial paper borrowings.  The 2047 Notes bear interest at \n3.95\n%.  Interest on the 2047 Notes is payable semi-annually, on each February 1 and August 1.  The 2047 Notes will mature on August 1, 2047, unless earlier retired or redeemed.\n \n5.0% Senior Notes due June 15, 2052\nOn June 2, 2022, the Company issued $\n500.0\n aggregate principal amount of \n5.00\n% Senior Notes due 2052 (the “2052 Notes”).   In July 2022 a portion of the proceeds from the sale of the Notes were used to repay all of the Company's outstanding $\n300.0\n \n2.45\n% Senior Notes due August 1, 2022.  The remaining proceeds were used to pay a portion of the Company's $\n400.0\n outstanding \n2.875\n% Senior Notes due October 1, 2022.  The 2052 Notes will mature on \nJune 15, 2052\n, unless earlier retired.\n \n \nRevolving Credit Facility\nOn June 16, 2022, the Company entered into a $\n1,500\n Credit Agreement providing for a revolving credit facility (the “Revolving Credit Facility”).  The Revolving Credit Facility matures on \nJune 16, 2027\n, unless extended. Prior to the maturity date, the Company may request a one-year extension of the facility (not to exceed a total of two years beyond the initial maturity date).  We have the ability to increase our borrowing up to an additional $\n750.0\n, subject to lender commitments and certain conditions as described in the Credit Agreement.  Borrowings under the Credit Agreement are available for general corporate purposes and are used to support our $\n1,500.0\n commercial paper program.\n \n \nThe Revolving Credit Facility also contains customary events of default, including failure to make certain payments under the Term Loan Facility when due beyond the grace period, event of default on other material indebtedness, breach of covenants, materially incorrect representations and warranties, events of bankruptcy, material adverse judgments, certain events relating to pension plans, the failure of any of the loan documents to remain in full force and effect and the occurrence of any change in control with respect to the Company.\n\n\n \n\n\n \n\n\n11.\nIncome Taxes  \nThe components of income before taxes are as follows:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nDomestic\n\n\n \n\n\n$\n\n\n666.5\n\n\n \n\n\n \n\n\n$\n\n\n872.4\n\n\n \n\n\n \n\n\n$\n\n\n447.1\n\n\n \n\n\n\n\n\n\nForeign\n\n\n \n\n\n \n\n\n89.8\n\n\n \n\n\n \n\n\n \n\n\n95.0\n\n\n \n\n\n \n\n\n \n\n\n76.2\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n756.3\n\n\n \n\n\n \n\n\n$\n\n\n967.4\n\n\n \n\n\n \n\n\n$\n\n\n523.3\n\n\n \n\n\n\n\n \n\n\n76\n\n\n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n(In millions, except share and per share data)\n \n\n\n \nThe following table summarizes the provision for U.S. federal, state and foreign income taxes:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nCurrent:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nU.S. federal\n\n\n \n\n\n$\n\n\n180.9\n\n\n \n\n\n \n\n\n$\n\n\n159.1\n\n\n \n\n\n \n\n\n$\n\n\n162.0\n\n\n \n\n\n\n\n\n\nState\n\n\n \n\n\n \n\n\n45.2\n\n\n \n\n\n \n\n\n \n\n\n40.9\n\n\n \n\n\n \n\n\n \n\n\n44.8\n\n\n \n\n\n\n\n\n\nForeign\n\n\n \n\n\n \n\n\n26.9\n\n\n \n\n\n \n\n\n \n\n\n25.6\n\n\n \n\n\n \n\n\n \n\n\n20.3\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n253.0\n\n\n \n\n\n \n\n\n \n\n\n225.6\n\n\n \n\n\n \n\n\n \n\n\n227.1\n\n\n \n\n\n\n\n\n\nDeferred:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nU.S. federal\n\n\n \n\n\n \n\n\n(\n64.5\n\n\n)\n\n\n \n\n\n \n\n\n(\n11.3\n\n\n)\n\n\n \n\n\n \n\n\n(\n78.8\n\n\n)\n\n\n\n\n\n\nState\n\n\n \n\n\n \n\n\n(\n15.7\n\n\n)\n\n\n \n\n\n \n\n\n(\n2.8\n\n\n)\n\n\n \n\n\n \n\n\n(\n38.3\n\n\n)\n\n\n\n\n\n\nForeign\n\n\n \n\n\n \n\n\n(\n1.8\n\n\n)\n\n\n \n\n\n \n\n\n0.3\n\n\n \n\n\n \n\n\n \n\n\n(\n0.6\n\n\n)\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n(\n82.0\n\n\n)\n\n\n \n\n\n \n\n\n(\n13.8\n\n\n)\n\n\n \n\n\n \n\n\n(\n117.7\n\n\n)\n\n\n\n\n\n\nTotal provision\n\n\n \n\n\n$\n\n\n171.0\n\n\n \n\n\n \n\n\n$\n\n\n211.8\n\n\n \n\n\n \n\n\n$\n\n\n109.4\n\n\n \n\n\n\n\n \nDeferred tax assets (liabilities) consist of the following at December 31, 2024 and 2023:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nDeferred tax assets:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAccounts receivable\n\n\n \n\n\n$\n\n\n7.4\n\n\n \n\n\n \n\n\n$\n\n\n10.1\n\n\n \n\n\n\n\n\n\nDeferred compensation\n\n\n \n\n\n \n\n\n51.7\n\n\n \n\n\n \n\n\n \n\n\n50.7\n\n\n \n\n\n\n\n\n\nPension, postretirement and postemployment benefits\n\n\n \n\n\n \n\n\n2.9\n\n\n \n\n\n \n\n\n \n\n\n4.8\n\n\n \n\n\n\n\n\n\nInventory reserve\n\n\n \n\n\n \n\n\n8.6\n\n\n \n\n\n \n\n\n \n\n\n9.0\n\n\n \n\n\n\n\n\n\nSec 174 R&D Capitalization\n\n\n \n\n\n \n\n\n59.4\n\n\n \n\n\n \n\n\n \n\n\n41.9\n\n\n \n\n\n\n\n\n\nTax credit carryforwards/other tax attributes\n\n\n \n\n\n \n\n\n5.1\n\n\n \n\n\n \n\n\n \n\n\n2.6\n\n\n \n\n\n\n\n\n\nInternational operating loss carryforwards\n\n\n \n\n\n \n\n\n8.4\n\n\n \n\n\n \n\n\n \n\n\n9.0\n\n\n \n\n\n\n\n\n\nOther\n\n\n \n\n\n \n\n\n8.8\n\n\n \n\n\n \n\n\n \n\n\n9.9\n\n\n \n\n\n\n\n\n\nTotal gross deferred tax assets\n\n\n \n\n\n \n\n\n152.3\n\n\n \n\n\n \n\n\n \n\n\n138.0\n\n\n \n\n\n\n\n\n\nValuation allowances\n\n\n \n\n\n \n\n\n(\n14.3\n\n\n)\n\n\n \n\n\n \n\n\n(\n9.8\n\n\n)\n\n\n\n\n\n\nTotal deferred tax assets\n\n\n \n\n\n \n\n\n138.0\n\n\n \n\n\n \n\n\n \n\n\n128.2\n\n\n \n\n\n\n\n\n\nDeferred tax liabilities:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nGoodwill\n\n\n \n\n\n \n\n\n(\n298.7\n\n\n)\n\n\n \n\n\n \n\n\n(\n285.7\n\n\n)\n\n\n\n\n\n\nTrade names and other intangibles\n\n\n \n\n\n \n\n\n(\n415.0\n\n\n)\n\n\n \n\n\n \n\n\n(\n496.3\n\n\n)\n\n\n\n\n\n\nProperty, plant and equipment\n\n\n \n\n\n \n\n\n(\n85.2\n\n\n)\n\n\n \n\n\n \n\n\n(\n81.1\n\n\n)\n\n\n\n\n\n\nInterest rate swaps\n\n\n \n\n\n \n\n\n(\n3.7\n\n\n)\n\n\n \n\n\n \n\n\n(\n4.1\n\n\n)\n\n\n\n\n\n\nTotal deferred tax liabilities\n\n\n \n\n\n \n\n\n(\n802.6\n\n\n)\n\n\n \n\n\n \n\n\n(\n867.2\n\n\n)\n\n\n\n\n\n\nNet deferred tax liability\n\n\n \n\n\n$\n\n\n(\n664.6\n\n\n)\n\n\n \n\n\n$\n\n\n(\n739.0\n\n\n)\n\n\n\n\n\n\nLong term net deferred tax asset\n\n\n \n\n\n \n\n\n4.6\n\n\n \n\n\n \n\n\n \n\n\n4.1\n\n\n \n\n\n\n\n\n\nLong term net deferred tax liability\n\n\n \n\n\n \n\n\n(\n669.2\n\n\n)\n\n\n \n\n\n \n\n\n(\n743.1\n\n\n)\n\n\n\n\n\n\nNet deferred tax liability\n\n\n \n\n\n$\n\n\n(\n664.6\n\n\n)\n\n\n \n\n\n$\n\n\n(\n739.0\n\n\n)\n\n\n\n\n \n\n\n77\n\n\n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n(In millions, except share and per share data)\n \n\n\n \nThe difference between tax expense and the tax that would result from the application of the federal statutory rate is as follows:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nStatutory rate\n\n\n \n\n\n \n\n\n21\n\n\n%\n\n\n \n\n\n \n\n\n21\n\n\n%\n\n\n \n\n\n \n\n\n21\n\n\n%\n\n\n\n\n\n\nTax that would result from use of the federal statutory rate\n\n\n \n\n\n$\n\n\n158.8\n\n\n \n\n\n \n\n\n$\n\n\n203.1\n\n\n \n\n\n \n\n\n$\n\n\n109.9\n\n\n \n\n\n\n\n\n\nState and local income tax, net of federal effect\n\n\n \n\n\n \n\n\n23.3\n\n\n \n\n\n \n\n\n \n\n\n30.1\n\n\n \n\n\n \n\n\n \n\n\n5.2\n\n\n \n\n\n\n\n\n\nVarying tax rates of foreign affiliates\n\n\n \n\n\n \n\n\n6.9\n\n\n \n\n\n \n\n\n \n\n\n6.8\n\n\n \n\n\n \n\n\n \n\n\n2.9\n\n\n \n\n\n\n\n\n\nValuation Allowances\n\n\n \n\n\n \n\n\n2.1\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n4.1\n\n\n)\n\n\n\n\n\n\nStock Options Exercised\n\n\n \n\n\n \n\n\n(\n23.0\n\n\n)\n\n\n \n\n\n \n\n\n(\n21.8\n\n\n)\n\n\n \n\n\n \n\n\n(\n5.2\n\n\n)\n\n\n\n\n\n\nReserve for Uncertain Tax Position\n\n\n \n\n\n \n\n\n0.3\n\n\n \n\n\n \n\n\n \n\n\n(\n0.3\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.9\n\n\n)\n\n\n\n\n\n\nOther\n\n\n \n\n\n \n\n\n2.6\n\n\n \n\n\n \n\n\n \n\n\n(\n6.1\n\n\n)\n\n\n \n\n\n \n\n\n1.6\n\n\n \n\n\n\n\n\n\nRecorded tax expense\n\n\n \n\n\n$\n\n\n171.0\n\n\n \n\n\n \n\n\n$\n\n\n211.8\n\n\n \n\n\n \n\n\n$\n\n\n109.4\n\n\n \n\n\n\n\n\n\nEffective tax rate\n\n\n \n\n\n \n\n\n22.6\n\n\n%\n\n\n \n\n\n \n\n\n21.9\n\n\n%\n\n\n \n\n\n \n\n\n20.9\n\n\n%\n\n\n\n\n \nAt December 31, 2024 and 2023, respectively, certain foreign subsidiaries of the Company had net operating loss carryforwards of approximately $\n8.3\n and $\n9.0\n, which are not subject to expiration.  The Company believes that it is more likely than not that the benefit from these net operating loss carryforwards will not be realized.  In recognition of this risk, the Company has provided a valuation allowance of $\n8.3\n and $\n9.0\n at December 31, 2024 and 2023, respectively, on the deferred tax asset relating to these net operating loss carryforwards.\n \n \nThe Company also believes that it is more likely than not that the benefit from certain additional deferred tax assets of a foreign subsidiary will not be realized.  In recognition of this risk, the Company maintains a valuation allowance of $\n0.7\n and $\n0.8\n at December 31, 2024 and 2023, respectively, on these deferred tax assets.\n \nThe Company has foreign tax credit carryforwards of approximately $\n5.2\n and $\n2.1\n as of December 31, 2024 and 2023, respectively. The Company believes that it is more likely than not that the benefit from the foreign tax credit carryforwards as of December 31, 2024 will not be realized. In recognition of this risk, the Company has provided a valuation allowance of $\n5.2\n and $\n0.0\n at December 31, 2024 and 2023, respectively, on the deferred tax asset relating to these foreign tax credit carryforwards. The Company does not have any undistributed earnings of foreign subsidiaries that are considered to be indefinitely reinvested outside of the U.S.\nThe Company has recorded liabilities in connection with uncertain tax positions, which, although supportable by the Company, may be challenged by tax authorities.\n \nA reconciliation of the beginning and ending amount of unrecognized tax benefits is as follows:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nUnrecognized tax benefits at January 1\n\n\n \n\n\n$\n\n\n5.1\n\n\n \n\n\n \n\n\n$\n\n\n5.8\n\n\n \n\n\n \n\n\n$\n\n\n4.7\n\n\n \n\n\n\n\n\n\nGross increases - tax positions in current period\n\n\n \n\n\n \n\n\n0.9\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n2.4\n\n\n \n\n\n\n\n\n\nGross increases - tax positions in prior period\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n\n\n\n\nGross decreases - tax positions in prior period\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n0.1\n\n\n)\n\n\n\n\n\n\nDecreases due to settlements and payments\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n\n\n\n\nLapse of statute of limitations\n\n\n \n\n\n \n\n\n(\n0.6\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.7\n\n\n)\n\n\n \n\n\n \n\n\n(\n1.2\n\n\n)\n\n\n\n\n\n\nUnrecognized tax benefits at December 31\n\n\n \n\n\n$\n\n\n5.4\n\n\n \n\n\n \n\n\n$\n\n\n5.1\n\n\n \n\n\n \n\n\n$\n\n\n5.8\n\n\n \n\n\n\n\nIncluded in the balance of unrecognized tax benefits at December 31, 2024, 2023 and 2022 are $\n4.5\n, \n$\n4.2\n and $\n4.8\n, respectively, of tax benefits that, if recognized, would affect the effective tax rate. Also included in the balance of unrecognized tax benefits at December 31, 2024, 2023 and 2022 are $\n0.9\n, $\n0.9\n and $\n1.0\n, respectively, of tax benefits that, if recognized, would result in adjustments to deferred taxes.\nThe Company is subject to U.S. federal income tax as well as income tax in multiple state and international jurisdictions.  The Company’s U.S. federal income tax returns are closed for tax years through 2020. The Company is currently under audit by several state taxing authorities for the years 2017 through 2022.  It is reasonably possible that a decrease of approximately $\n0.3\n in the unrecognized tax benefits may occur within the next twelve months related to the settlement of these audits or the lapse of applicable statutes of limitations.\nThe \nCompany’s policy for recording interest associated with income tax examinations is to record interest as a component of Income before Income Taxes. During the twelve months ended December 31, 2024, 2023, and 2022, the Company recognized interest expense\n \n\n\n78\n\n\n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n(In millions, except share and per share data)\n \n\n\nassociated \nwith uncertain tax positions of approximately $\n0.4\n, $\n0.3\n and $\n0.1\n, respectively.  As of December 31, 2024, 2023, and 2022, the Company had accrued interest expense related to unrecognized tax benefits of $\n1.3\n, $\n0.9\n and $\n0.7\n, respectively.\n \nOn August 16, 2022, President Biden signed into law the Inflation Reduction Act of 2022 (the “Act”), which contains provisions effective January 1, 2023, including a \n15\n% corporate minimum tax and a \n1\n% excise tax on stock buybacks. The law did not have any material impacts on the Company's consolidated financial position, results of operations or cash flows during the year ended December 31, 2024.\n \n\n\n \n\n\n12.\nStock Based Compensation Plans and Other Benefit Plans\nIn the first quarter of 2023, the Company updated its Long-Term Incentive Program (“LTIP”) to provide employees with an award of stock options and initial grants of restricted stock units (“RSUs”), and made an initial grant of performance share units (\"PSUs\") to members of the Company's Executive Leadership Team (\"ELT\").  In connection with this update, the awards are now granted in the first quarter of each year.  Prior to 2023, the awards were granted in the second quarter.  The Company recognizes the grant-date fair value for each of these awards, less estimated forfeitures, as compensation expense ratably over the vesting period.  For employees and Directors that meet retirement eligibility requirements, the expense related to share-based compensation is recognized on the date of grant as there is no future service period required to vest in the awards.\n \nStock Options\nThe Company has non-qualified options outstanding under the LTIP.  Stock options outstanding are issued at market value on the date of grant, vest on the third anniversary of the date of grant and must be exercised within \n10\n years of the date of grant.\n \nHowever, upon a participant’s termination of employment (other than termination for cause, death, disability or retirement), a participant will generally have 30 days (90 days for grants made after May 13, 2022) to exercise any vested stock options, subject to specified conditions.  If, upon termination of a participant’s employment (other than a termination for cause), a participant is at least \n55\n years old, has at least \nfive years\n of service, and the sum of the participant’s age and years of service is at least 65, the participant may exercise any vested stock options granted between 2007 through 2017 within a period of \nthree years\n from the date of termination or, if earlier, the date such stock options otherwise would have expired, subject to specified conditions.  Starting with stock options granted in 2018, a terminated employee who meets the above conditions may exercise any stock options until the date such stock options otherwise would have expired, subject to specified conditions.  Issuances of Common Stock to satisfy employee stock option exercises currently are made from treasury stock.\nStock option transactions for the year ended December 31, 2024 were as follows:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nWeighted\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\nWeighted\n\n\n \n\n\n \n\n\nAverage\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\nAverage\n\n\n \n\n\n \n\n\nRemaining\n\n\n \n\n\n \n\n\nAggregate\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\nExercise\n\n\n \n\n\n \n\n\nContractual\n\n\n \n\n\n \n\n\nIntrinsic\n\n\n \n\n\n\n\n\n\n \n\n\nOptions\n\n\n \n\n\n \n\n\nPrice\n\n\n \n\n\n \n\n\nTerm\n\n\n \n\n\n \n\n\nValue\n\n\n \n\n\n\n\n\n\nOutstanding as of December 31, 2023\n\n\n \n\n\n10.2\n\n\n \n\n\n \n\n\n$\n\n\n68.77\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nGranted\n\n\n \n\n\n1.1\n\n\n \n\n\n \n\n\n \n\n\n100.47\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nExercised\n\n\n \n\n\n(\n2.7\n\n\n)\n\n\n \n\n\n \n\n\n53.51\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCancelled\n\n\n \n\n\n(\n0.2\n\n\n)\n\n\n \n\n\n \n\n\n86.72\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nOutstanding as of December 31, 2024\n\n\n \n\n\n8.4\n\n\n \n\n\n \n\n\n$\n\n\n77.10\n\n\n \n\n\n \n\n\n \n\n\n6.0\n\n\n \n\n\n \n\n\n$\n\n\n232.9\n\n\n \n\n\n\n\n\n\nExercisable as of December 31, 2024\n\n\n \n\n\n5.0\n\n\n \n\n\n \n\n\n$\n\n\n68.95\n\n\n \n\n\n \n\n\n \n\n\n4.6\n\n\n \n\n\n \n\n\n$\n\n\n180.6\n\n\n \n\n\n\n\n \n\n\n79\n\n\n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n(In millions, except share and per share data)\n \n\n\nThe following table summarizes information relating to options outstanding and exercisable as of December 31, 2024:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nOptions Outstanding\n\n\n \n\n\n \n\n\nOptions Exercisable\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nWeighted\n\n\n \n\n\n \n\n\nWeighted\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nWeighted\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nOutstanding\n\n\n \n\n\n \n\n\nAverage\n\n\n \n\n\n \n\n\nAverage\n\n\n \n\n\n \n\n\nExercisable\n\n\n \n\n\n \n\n\nAverage\n\n\n \n\n\n\n\n\n\nRange of\n\n\n \n\n\nas of\n\n\n \n\n\n \n\n\nRemaining\n\n\n \n\n\n \n\n\nExercise\n\n\n \n\n\n \n\n\nas of\n\n\n \n\n\n \n\n\nExercise\n\n\n \n\n\n\n\n\n\nExercise Prices\n\n\n \n\n\n12/31/2024\n\n\n \n\n\n \n\n\nContractual\n \nLife\n\n\n \n\n\n \n\n\nPrice\n\n\n \n\n\n \n\n\n12/31/2024\n\n\n \n\n\n \n\n\nPrice\n\n\n \n\n\n\n\n\n\n$\n40.01\n - $\n50.00\n\n\n \n\n\n \n\n\n0.5\n\n\n \n\n\n \n\n\n \n\n\n1.3\n\n\n \n\n\n \n\n\n$\n\n\n46.72\n\n\n \n\n\n \n\n\n \n\n\n0.5\n\n\n \n\n\n \n\n\n$\n\n\n46.72\n\n\n \n\n\n\n\n\n\n$\n50.01\n - $\n60.00\n\n\n \n\n\n \n\n\n1.2\n\n\n \n\n\n \n\n\n \n\n\n3.2\n\n\n \n\n\n \n\n\n$\n\n\n51.31\n\n\n \n\n\n \n\n\n \n\n\n1.2\n\n\n \n\n\n \n\n\n$\n\n\n51.31\n\n\n \n\n\n\n\n\n\n$\n60.01\n - $\n70.00\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n$\n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n$\n\n\n0.0\n\n\n \n\n\n\n\n\n\n$\n70.01\n - $\n80.00\n\n\n \n\n\n \n\n\n2.2\n\n\n \n\n\n \n\n\n \n\n\n5.0\n\n\n \n\n\n \n\n\n$\n\n\n75.31\n\n\n \n\n\n \n\n\n \n\n\n2.2\n\n\n \n\n\n \n\n\n$\n\n\n75.31\n\n\n \n\n\n\n\n\n\n$\n80.01\n - $\n90.00\n\n\n \n\n\n \n\n\n3.4\n\n\n \n\n\n \n\n\n \n\n\n7.3\n\n\n \n\n\n \n\n\n$\n\n\n84.32\n\n\n \n\n\n \n\n\n \n\n\n1.1\n\n\n \n\n\n \n\n\n$\n\n\n84.59\n\n\n \n\n\n\n\n\n\n$\n90.01\n - $\n100.00\n\n\n \n\n\n \n\n\n0.1\n\n\n \n\n\n \n\n\n \n\n\n7.2\n\n\n \n\n\n \n\n\n$\n\n\n94.28\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n$\n\n\n0.0\n\n\n \n\n\n\n\n\n\n$\n100.01\n - $\n110.00\n\n\n \n\n\n \n\n\n1.0\n\n\n \n\n\n \n\n\n \n\n\n9.1\n\n\n \n\n\n \n\n\n$\n\n\n100.50\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n$\n\n\n0.0\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n8.4\n\n\n \n\n\n \n\n\n \n\n\n6.0\n\n\n \n\n\n \n\n\n$\n\n\n77.10\n\n\n \n\n\n \n\n\n \n\n\n5.0\n\n\n \n\n\n \n\n\n$\n\n\n68.95\n\n\n \n\n\n\n\nThe table above represents the Company’s estimate of stock options fully vested and expected to vest.  Expected forfeitures are not material and, therefore, are not reflected in the table above.\nThe following table provides information regarding the intrinsic value of stock options exercised and stock compensation expense related to stock option awards:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nIntrinsic Value of Stock Options Exercised\n\n\n$\n\n\n134.0\n\n\n \n\n\n \n\n\n$\n\n\n125.5\n\n\n \n\n\n \n\n\n$\n\n\n32.1\n\n\n \n\n\n\n\n\n\nStock Compensation Expense Related to Stock Option Awards\n\n\n$\n\n\n28.7\n\n\n \n\n\n \n\n\n$\n\n\n26.3\n\n\n \n\n\n \n\n\n$\n\n\n25.7\n\n\n \n\n\n\n\n\n\nIssued Stock Options\n\n\n \n\n\n1.1\n\n\n \n\n\n \n\n\n \n\n\n1.0\n\n\n \n\n\n \n\n\n \n\n\n1.6\n\n\n \n\n\n\n\n\n\nWeighted Average Fair Value of Stock Options issued (per share)\n\n\n$\n\n\n29.90\n\n\n \n\n\n \n\n\n$\n\n\n24.06\n\n\n \n\n\n \n\n\n$\n\n\n21.50\n\n\n \n\n\n\n\n\n\nFair Value of Stock Options Issued\n\n\n$\n\n\n31.5\n\n\n \n\n\n \n\n\n$\n\n\n24.9\n\n\n \n\n\n \n\n\n$\n\n\n33.6\n\n\n \n\n\n\n\n \nThe following table provides a summary of the assumptions used in the valuation of issued stock options:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nRisk-free interest rate\n\n\n \n\n\n4.2\n\n\n%\n\n\n \n\n\n \n\n\n4.0\n\n\n%\n\n\n \n\n\n \n\n\n2.9\n\n\n%\n\n\n\n\n\n\nExpected life in years\n\n\n \n\n\n7.2\n\n\n \n\n\n \n\n\n \n\n\n7.3\n\n\n \n\n\n \n\n\n \n\n\n7.1\n\n\n \n\n\n\n\n\n\nExpected volatility\n\n\n \n\n\n22.3\n\n\n%\n\n\n \n\n\n \n\n\n22.4\n\n\n%\n\n\n \n\n\n \n\n\n21.7\n\n\n%\n\n\n\n\n\n\nDividend yield\n\n\n \n\n\n1.1\n\n\n%\n\n\n \n\n\n \n\n\n1.3\n\n\n%\n\n\n \n\n\n \n\n\n1.2\n\n\n%\n\n\n\n\n \nThe fair value of stock options is based upon the Black Scholes option pricing model.  The Company determined the stock options’ lives based on historical exercise behavior and their expected volatility and dividend yield based on the historical changes in stock price and dividend payments.  The risk-free interest rate is based on the yield of an applicable term Treasury instrument.\nAs of December 31, 2024, there was a fair value of $\n18.3\n related to unamortized stock option compensation expense, which is expected to be recognized over the next \nthree years\n.  The Company’s Consolidated Statements of Cash Flow reflect an add back related to stock option awards of $\n28.7\n, $\n26.3\n and $\n25.7\n in 2024, 2023 and 2022, respectively, for non-cash compensation expense.\n \n \nRestricted Stock Units\n \nThe Company granted employees \n121,050\n RSUs with a total fair value of $\n12.4\n at a weighted average grant date fair value of $\n102.40\n per RSU during the year ended December 31, 2024.  The Company granted employees \n120,080\n RSUs with a total fair value of $\n10.4\n at a weighted average grant date fair value of $\n86.20\n per RSU during the year ended December 31, 2023. The annual RSU grants vest one-third on each of the first, second and third anniversaries of the grant date, subject to the recipient’s continued employment with the Company from the grant date through the applicable vesting date, and are settled with shares of the Company’s Common Stock within 60 days following the applicable vesting date.\n \nAdditionally, in connection with the Hero Acquisition (see Note 6), \n854,882\n shares of restricted stock were issued to certain individuals in October 2022 with a total fair value of $\n61.5\n. This restricted stock is recognized as compensation expense ratably over the vesting period if those individuals continue to be employed by the Company. The vesting requirements are satisfied at various dates over a \nthree-year\n period\n \n\n\n80\n\n\n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n(In millions, except share and per share data)\n \n\n\nfrom the date of the acquisition.  \n427,438\n shares have vested as of December 31, 2024.  The restricted stock expense associated with the Hero Acquisition for the twelve months ended December 31, 2024, 2023 and 2022 was $\n20.3\n, \n$\n29.2\n \nand $\n6.0\n, respectively, and is included in the Non-cash compensation expense caption in the consolidated statement of cash flows.\n \nIn January 2021, the Company issued cash-settled stock units under the Omnibus Equity Plan to all employees at the level of vice president and below.  These restricted stock units are scheduled to vest and be settled on the third anniversary of the date of grant, subject to continued employment through such date.\n \nAs a result of the issued cash-settled stock units, the Company recorded stock compensation expense of $\n0.9\n, $\n1.3\n and $\n0.3\n in 2024, 2023 and 2022, respectively.  The liability was approximately $\n4.4\n and $\n3.5\n as of December 31, 2024 and 2023, respectively.\n \n \nPerformance Stock Units\n \n \n \nIn the first quarter of 2024 and 2023, the Company granted PSUs to members of the Executive Leadership Team, including the CEO, with an aggregate award of\n \n19,960\n and \n19,650\n PSUs, respectively.  The PSUs were valued at a weighted average grant date fair value per PSU equal to $\n122.24\n in 2024 and $\n110.95\n in 2023 using a Monte Carlo model. The performance target is based on the Company's total shareholder return (\"TSR\") relative to a Company selected peer group.  The PSUs vest on the later of (i) the third anniversary of the grant date, and (ii) the date that the Board's Compensation & Human Capital Committee certifies the achievement of the applicable performance goals, in each case, subject to the recipient’s continued employment with the Company from the grant date through the vesting date. The number of shares that may be issued ranges from \n0\n% to \n200\n% based on relative TSR during the three-year performance period.\n \n \nDiscounted Employee Stock Purchase Plan\n \n \n \nThe Company’s discounted Employee Stock Purchase Plan (“ESPP”) was adopted in February 2023 by the Company’s Board of Directors and became effective in April 2023 upon approval by the Company’s stockholders. There are \n750,000\n shares of Common Stock reserved for issuance under the ESPP. The ESPP, which is intended to be an “employee stock purchase plan” under Section 423 of the Internal Revenue Code, permits eligible employees to purchase Common Stock through after-tax payroll deductions.  Currently, the purchase price equals \n85\n% of the fair market value of our Common Stock on the last trading day of the applicable quarterly purchase period. The maximum value of Common Stock that an eligible employee may purchase each calendar year is the lesser of 10% of an eligible employee’s annual pay and $\n25,000\n. There are four purchase periods in each calendar year under the ESPP, which begin on the first business day of each calendar quarter and end on the last business day of each calendar quarter. The first purchase period commenced in January 2025.\nDeferred Compensation Plans\nThe Company maintains a non-qualified deferred compensation plan under which certain members of management are eligible to defer a maximum of \n85\n% of their regular compensation (i.e., salary) and, in general, up to \n85\n% of their incentive bonus.  As of January 1, 2024, the limit was decreased from 85% to a maximum of \n70\n% for both regular compensation and incentive bonus.  The amounts deferred under this plan are credited with earnings or losses based upon changes in values of notional investments selected by the plan participant.  The investment options available include notional investments in various stock, bond and money market funds as well as the Company’s Common Stock.  Each plan participant is fully vested in the amounts the participant defers.  The plan permits the Company to make profit sharing contributions that cannot otherwise be contributed to the qualified savings and profit-sharing plan due to limitations established by the Internal Revenue Service.  These contributions vest under the same vesting schedule applicable to the qualified plan.\nThe liability to plan participants for contributions designated for notional investment in Common Stock is based on the quoted fair value of the Common Stock plus any dividends credited.  The Company uses cash-settled hedging instruments to minimize the cost related to the volatility of Common Stock.  At December 31, 2024 and 2023, the amount of the Company’s liability under the deferred compensation plan is included in Current and Deferred and Other Long-term Liabilities and was $\n135.8\n \nand $\n118.2\n, respectively and the funded balances recorded in Other Assets amounted to $\n127.2\n and $\n112.9\n, respectively.\n  The amounts charged to earnings, including the effect of the hedges, totaled expense of \n$\n2.0\n, $\n3.7\n and $\n1.2\n in 2024, 2023 and 2022, respectively.\nNon-employee mem\nbers of the Company’s Board are eligible to defer up to \n100\n% of their directors’ compensation into a similar plan; however, the only option for investment is Common Stock.  Members of the Board are fully vested in their account balance.  As of December 31, 2024, there were approximately \n88,000\n \ns\nhares of Common Stock from shares held as Treasury Stock in a rabbi trust to protect the interest of the directors’ deferred compensation plan participants in the event of a change of control.\n\n\n \n\n\n81\n\n\n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n(In millions, except share and per share data)\n \n\n\n13.\nShare Repurchases \n \nOn \nOctober 28, 2021, the Board authorized a new share repurchase program, under which the Company may repurchase up to $\n1,000.0\n in shares\n of Common Stock (the “2021 Share Repurchase Program”).  The 2021 Share Repurchase Program does not have an expiration.  The 2021 Share Repurchase Program did not modify the Company’s evergreen share repurchase program, authorized by the Board on January 29, 2014, under which the Company may repurchase, from time to time, Common Stock to reduce or eliminate dilution associated with issuances of Common Stock under its incentive plans.\nIn November 2023, the Company executed an agreement to purchase \n3.3\n million shares for $\n300.1\n, inclusive of fees, of which $\n229.3\n was purchased under the evergreen share repurchase program and $\n70.8\n was purchased under the 2021 Share Repurchase Program.\n\n\nAs a result of the Company’s stock repurchases, there remains $\n658.9\n of share repurchase availability under the 2021 Share Repurchase Program as of December 31, 2024.\n \n \n\n\n \n\n\n14.\nAccumulated Other Comprehensive Income (Loss)\nComprehensive income is defined as net income and other changes in stockholders’ equity from transactions and other events from sources other than stockholders.\nThe components of changes in accumulated other comprehensive income (“AOCI”) are as follows:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nAccumulated\n\n\n \n\n\n\n\n\n\n \n\n\nForeign\n\n\n \n\n\n \n\n\nDefined\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nOther\n\n\n \n\n\n\n\n\n\n \n\n\nCurrency\n\n\n \n\n\n \n\n\nBenefit\n\n\n \n\n\n \n\n\nDerivative\n\n\n \n\n\n \n\n\nComprehensive\n\n\n \n\n\n\n\n\n\n \n\n\nAdjustments\n\n\n \n\n\n \n\n\nPlans\n\n\n \n\n\n \n\n\nAgreements\n\n\n \n\n\n \n\n\nIncome (Loss)\n\n\n \n\n\n\n\n\n\nBalance December 31, 2021\n\n\n$\n\n\n(\n30.2\n\n\n)\n\n\n \n\n\n$\n\n\n(\n0.6\n\n\n)\n\n\n \n\n\n$\n\n\n(\n37.4\n\n\n)\n\n\n \n\n\n$\n\n\n(\n68.2\n\n\n)\n\n\n\n\n\n\nOther comprehensive income before reclassifications\n\n\n \n\n\n(\n16.2\n\n\n)\n\n\n \n\n\n \n\n\n3.1\n\n\n \n\n\n \n\n\n \n\n\n72.6\n\n\n \n\n\n \n\n\n \n\n\n59.5\n\n\n \n\n\n\n\n\n\nAmounts reclassified to consolidated statement of\n   income\n(a)\n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n2.5\n\n\n)\n\n\n \n\n\n \n\n\n(\n2.5\n\n\n)\n\n\n\n\n\n\nTax benefit (expense)\n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n0.8\n\n\n)\n\n\n \n\n\n \n\n\n(\n17.3\n\n\n)\n\n\n \n\n\n \n\n\n(\n18.1\n\n\n)\n\n\n\n\n\n\nOther comprehensive income (loss)\n\n\n \n\n\n(\n16.2\n\n\n)\n\n\n \n\n\n \n\n\n2.3\n\n\n \n\n\n \n\n\n \n\n\n52.8\n\n\n \n\n\n \n\n\n \n\n\n38.9\n\n\n \n\n\n\n\n\n\nBalance December 31, 2022\n\n\n$\n\n\n(\n46.4\n\n\n)\n\n\n \n\n\n$\n\n\n1.7\n\n\n \n\n\n \n\n\n$\n\n\n15.4\n\n\n \n\n\n \n\n\n$\n\n\n(\n29.3\n\n\n)\n\n\n\n\n\n\nOther comprehensive income (loss) before reclassifications\n\n\n \n\n\n8.6\n\n\n \n\n\n \n\n\n \n\n\n3.9\n\n\n \n\n\n \n\n\n \n\n\n(\n4.9\n\n\n)\n\n\n \n\n\n \n\n\n7.6\n\n\n \n\n\n\n\n\n\nAmounts reclassified to consolidated statement of\n   income\n(a)\n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n7.3\n\n\n)\n\n\n \n\n\n \n\n\n(\n7.3\n\n\n)\n\n\n\n\n\n\nTax benefit (expense)\n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n1.0\n\n\n)\n\n\n \n\n\n \n\n\n2.8\n\n\n \n\n\n \n\n\n \n\n\n1.8\n\n\n \n\n\n\n\n\n\nOther comprehensive income (loss)\n\n\n \n\n\n8.6\n\n\n \n\n\n \n\n\n \n\n\n2.9\n\n\n \n\n\n \n\n\n \n\n\n(\n9.4\n\n\n)\n\n\n \n\n\n \n\n\n2.1\n\n\n \n\n\n\n\n\n\nBalance December 31, 2023\n\n\n$\n\n\n(\n37.8\n\n\n)\n\n\n \n\n\n$\n\n\n4.6\n\n\n \n\n\n \n\n\n$\n\n\n6.0\n\n\n \n\n\n \n\n\n$\n\n\n(\n27.2\n\n\n)\n\n\n\n\n\n\nOther comprehensive income (loss) before reclassifications\n\n\n \n\n\n(\n15.4\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.2\n\n\n)\n\n\n \n\n\n \n\n\n20.8\n\n\n \n\n\n \n\n\n \n\n\n5.2\n\n\n \n\n\n\n\n\n\nAmounts reclassified to consolidated statement of\n   income\n(a)\n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n4.0\n\n\n)\n\n\n \n\n\n \n\n\n(\n4.0\n\n\n)\n\n\n\n\n\n\nTax benefit (expense)\n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n4.9\n\n\n)\n\n\n \n\n\n \n\n\n(\n4.9\n\n\n)\n\n\n\n\n\n\nOther comprehensive income (loss)\n\n\n \n\n\n(\n15.4\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.2\n\n\n)\n\n\n \n\n\n \n\n\n11.9\n\n\n \n\n\n \n\n\n \n\n\n(\n3.7\n\n\n)\n\n\n\n\n\n\nBalance December 31, 2024\n\n\n$\n\n\n(\n53.2\n\n\n)\n\n\n \n\n\n$\n\n\n4.4\n\n\n \n\n\n \n\n\n$\n\n\n17.9\n\n\n \n\n\n \n\n\n$\n\n\n(\n30.9\n\n\n)\n\n\n\n\n\n\n(a)\nAmounts reclassified to cost of sales, selling, general and administrative expenses, or interest expense.\n \n\n\n \n\n\n15.\nCommitments, Contingencies and Guarantees \nCommitments\n \n \na. The Company has a partnership with a supplier of raw materials that mines and processes sodium-based mineral deposits.  The Company purchases the majority of its sodium-based raw material requirements from the partnership.  The partnership agreement terminates upon two years’ written notice by either partner.  Under the partnership agreement, the Company has an annual commitment to purchase\n \n\n\n82\n\n\n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n(In millions, except share and per share data)\n \n\n\n240,000\n tons of sodium-based raw materials at the prevailing market price.  The Company is not engaged in any other material transactions with the partnership or the partner supplier.\n \nb. As of December 31, 2024, the Company had commitments of approximately $\n425.3\n.  These commitments include the purchase of raw materials, packaging supplies and services from its vendors at market prices to enable the Company to respond quickly to changes in customer orders or requirements, as well as costs associated with licensing and promotion agreements.\n \nc. As of December 31, 2024, the Company had various guarantees and letters of credit totaling \n$\n7.6\n.\n \n \nd. \nIn connection with the December 1, 2020 acquisition of the ZICAM® brand (the \"Zicam Acquisition\"), the Company deferred an additional cash payment of $\n20.0\n related to certain indemnifications provided by the seller.  The additional amount, to the extent not used in satisfaction of such indemnity obligations, is payable \nfive years\n from the closing.\nIn connection with the December 24, 2021 TheraBreath Acquisition, the Company deferred payment of a $\n14.0\n portion of the purchase price related to certain indemnity obligations provided by the seller.  The deferred amount is payable in installments between \ntwo\n and \nfour years\n from the closing, with the first installment payment of $\n2.0\n \npaid in January 2024, an additional $\n2.0\n paid in January 2025, and the remaining $\n10.0\n, to the extent not used or withheld in satisfaction of such indemnity obligations, to be paid in the first quarter and fourth quarter of 2025.\nIn connection with the October 13, 2022 Hero Acquisition, the \nCompany deferred an additional cash payment of $\n8.0\n to satisfy certain indemnification obligations. The additional amount, \nto the extent not used in satisfaction of such indemnity obligations, \nis payable \nfive years\n from the closing\n.\n \ne. In addition, in conjunction with the Company’s acquisition and divestiture activities, the Company entered into select guarantees and indemnifications of performance with respect to the fulfillment of the Company’s commitments under applicable purchase and sale agreements.  The arrangements generally indemnify the buyer or seller for damages associated with breach of contract, inaccuracies in representations and warranties surviving the closing date and satisfaction of liabilities and commitments retained under the applicable contract.  Representations and warranties that survive the closing date generally survive for periods up to five years or the expiration of the applicable statutes of limitations.  Potential losses under the indemnifications are generally limited to a portion of the original transaction price, or to other lesser specific dollar amounts for select provisions.  With respect to sale transactions, the Company also routinely enters into non-competition agreements for varying periods of time.  Guarantees and indemnifications with respect to acquisition and divestiture activities, if triggered, could have a materially adverse impact on the Company’s financial condition, results of operations and cash flows.\n \nLegal proceedings\n \n\n\nf.\n \nIn addition to the matters described above, from time to time in the ordinary course of its business the Company is the subject of, or party to, various pending or threatened legal, regulatory or governmental actions or other proceedings, including, without limitation, those relating to, intellectual property, commercial transactions, product liability, purported consumer class actions, employment matters, antitrust, environmental, health, safety and other compliance related matters.  Such proceedings are generally subject to considerable uncertainty and their outcomes, and any related damages, may not be reasonably predictable or estimable.   Any such proceedings could result in a material adverse outcome negatively impacting the Company’s business, financial condition, results of operations or cash flows. \n \n\n\n \n\n\n \n\n\n16.\nRelated Party Transactions \nThe following summarizes the balances and transactions between the Company and each of Armand and ArmaKleen, in which the Company held a \n50\n% ownership interest.\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nArmand\n\n\n \n\n\n \n\n\nArmaKleen\n(2)\n\n\n \n\n\n\n\n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nPurchases by Company\n\n\n$\n\n\n13.7\n\n\n \n\n\n \n\n\n$\n\n\n14.9\n\n\n \n\n\n \n\n\n$\n\n\n13.7\n\n\n \n\n\n \n\n\n$\n\n\n0.0\n\n\n \n\n\n \n\n\n$\n\n\n0.0\n\n\n \n\n\n \n\n\n$\n\n\n0.0\n\n\n \n\n\n\n\n\n\nSales by Company\n\n\n$\n\n\n0.0\n\n\n \n\n\n \n\n\n$\n\n\n0.0\n\n\n \n\n\n \n\n\n$\n\n\n0.0\n\n\n \n\n\n \n\n\n$\n\n\n0.9\n\n\n \n\n\n \n\n\n$\n\n\n1.4\n\n\n \n\n\n \n\n\n$\n\n\n0.9\n\n\n \n\n\n\n\n\n\nOutstanding Accounts Receivable\n\n\n$\n\n\n0.9\n\n\n \n\n\n \n\n\n$\n\n\n1.6\n\n\n \n\n\n \n\n\n$\n\n\n0.9\n\n\n \n\n\n \n\n\n$\n\n\n0.0\n\n\n \n\n\n \n\n\n$\n\n\n1.4\n\n\n \n\n\n \n\n\n$\n\n\n1.1\n\n\n \n\n\n\n\n\n\nOutstanding Accounts Payable\n\n\n$\n\n\n1.0\n\n\n \n\n\n \n\n\n$\n\n\n0.8\n\n\n \n\n\n \n\n\n$\n\n\n1.0\n\n\n \n\n\n \n\n\n$\n\n\n0.0\n\n\n \n\n\n \n\n\n$\n\n\n0.0\n\n\n \n\n\n \n\n\n$\n\n\n0.0\n\n\n \n\n\n\n\n\n\nAdministration & Management Oversight Services\n(1)\n\n\n$\n\n\n2.3\n\n\n \n\n\n \n\n\n$\n\n\n2.3\n\n\n \n\n\n \n\n\n$\n\n\n2.2\n\n\n \n\n\n \n\n\n$\n\n\n1.6\n\n\n \n\n\n \n\n\n$\n\n\n2.1\n\n\n \n\n\n \n\n\n$\n\n\n2.0\n\n\n \n\n\n\n\n \n\n\n83\n\n\n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n(In millions, except share and per share data)\n \n\n\n(1)\nBilled by Company and recorded as a reduction of SG&A expenses.\n(2)\nIn October 2024, the Company sold its 50% interest in ArmaKleen to our joint venture partner.\n \n\n\n \n\n\n17.\nSegments \nSegment Information\n \nThe Company operates \nthree\n reportable segments: Consumer Domestic, Consumer International and Specialty Products Division.  These segments are determined based on differences in the nature of products and organizational and ownership structures.  The Company also has a Corporate segment.\n \nSegment revenues are derived from the sale of the following products:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSegment\n\n\n \n\n\n \n\n\nProducts / Other\n\n\n \n\n\n\n\n\n\nConsumer Domestic\n\n\n \n\n\nHousehold and personal care products\n\n\n\n\n\n\nConsumer International\n\n\n \n\n\nPrimarily personal care products\n\n\n\n\n\n\nSPD\n\n\n \n\n\nSpecialty Products\n \n\n\n\n\n\n\nCorporate\n\n\n \n\n\nEquity in earnings of affiliates\n\n\n\n\nAs of December 31, 2024, the Company holds a \n50\n% ownership interest in Armand. The Company's \n50\n% interest in ArmaKleen was sold \nto our joint venture partner in October of 2024.  The transaction is not material to the Company’s results of operations or cash flows.  \nThe Company’s equity in earnings of Armand and ArmaKleen, totaling $\n9.1\n, $\n8.7\n, and $\n12.3\n for the three years ending December 31, 2024, 2023 and 2022, respectively, are included in the Corporate segment.\n \nOur reportable segments comprise the structure used by our Chief Executive Officer, who has been determined to be the Chief Operating Decision Maker (\"CODM\") to make key operating decisions and assess performance.  The CODM considers Operating Income for evaluating performance of each segment and making decisions about allocating capital and other resources to each segment. Asset information and capital expenditures are not regularly provided to the CODM.\n \n \n\n\n84\n\n\n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n(In millions, except share and per share data)\n \n\n\nThe following tables present \nfinancial information relating to the Company’s segments for each of the three years in the period ended December 31, 2024:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31, 2024\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nConsumer Domestic\n\n\n \n\n\n \n\n\nConsumer International\n\n\n \n\n\n \n\n\nSPD\n\n\n \n\n\n \n\n\nCorporate\n(1)\n\n\n \n\n\n \n\n\nTotal Consolidated\n\n\n \n\n\n\n\n\n\nNet Sales\n\n\n \n\n\n$\n\n\n4,732.3\n\n\n \n\n\n \n\n\n$\n\n\n1,071.5\n\n\n \n\n\n \n\n\n$\n\n\n303.3\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n$\n\n\n6,107.1\n\n\n \n\n\n\n\n\n\nCost of sales\n\n\n \n\n\n \n\n\n2,450.1\n\n\n \n\n\n \n\n\n \n\n\n605.5\n\n\n \n\n\n \n\n\n \n\n\n193.5\n\n\n \n\n\n \n\n\n \n\n\n67.9\n\n\n \n\n\n \n\n\n \n\n\n3,317.0\n\n\n \n\n\n\n\n\n\nGross Profit\n\n\n \n\n\n \n\n\n2,282.2\n\n\n \n\n\n \n\n\n \n\n\n466.0\n\n\n \n\n\n \n\n\n \n\n\n109.8\n\n\n \n\n\n \n\n\n \n\n\n(\n67.9\n\n\n)\n\n\n \n\n\n \n\n\n2,790.1\n\n\n \n\n\n\n\n\n\nMarketing expenses\n\n\n \n\n\n \n\n\n538.5\n\n\n \n\n\n \n\n\n \n\n\n156.9\n\n\n \n\n\n \n\n\n \n\n\n2.7\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n698.1\n\n\n \n\n\n\n\n\n\nResearch and Development\n(2)\n\n\n \n\n\n \n\n\n123.7\n\n\n \n\n\n \n\n\n \n\n\n12.7\n\n\n \n\n\n \n\n\n \n\n\n3.3\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n139.7\n\n\n \n\n\n\n\n\n\nSelling, general and administrative expenses\n\n\n \n\n\n \n\n\n607.7\n\n\n \n\n\n \n\n\n \n\n\n183.6\n\n\n \n\n\n \n\n\n \n\n\n64.7\n\n\n \n\n\n \n\n\n \n\n\n(\n67.9\n\n\n)\n\n\n \n\n\n \n\n\n788.1\n\n\n \n\n\n\n\n\n\nVMS Trade name and other asset impairments\n\n\n \n\n\n \n\n\n327.4\n\n\n \n\n\n \n\n\n \n\n\n29.7\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n357.1\n\n\n \n\n\n\n\n\n\nIncome from Operations\n\n\n \n\n\n \n\n\n684.9\n\n\n \n\n\n \n\n\n \n\n\n83.1\n\n\n \n\n\n \n\n\n \n\n\n39.1\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n807.1\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31, 2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nConsumer Domestic\n\n\n \n\n\n \n\n\nConsumer International\n\n\n \n\n\n \n\n\nSPD\n\n\n \n\n\n \n\n\nCorporate\n(1)\n\n\n \n\n\n \n\n\nTotal Consolidated\n\n\n \n\n\n\n\n\n\nNet Sales\n\n\n \n\n\n$\n\n\n4,571.2\n\n\n \n\n\n \n\n\n$\n\n\n975.7\n\n\n \n\n\n \n\n\n$\n\n\n321.0\n\n\n \n\n\n \n\n\n$\n\n\n-\n\n\n \n\n\n \n\n\n$\n\n\n5,867.9\n\n\n \n\n\n\n\n\n\nCost of sales\n\n\n \n\n\n \n\n\n2,434.0\n\n\n \n\n\n \n\n\n \n\n\n568.7\n\n\n \n\n\n \n\n\n \n\n\n216.3\n\n\n \n\n\n \n\n\n \n\n\n60.4\n\n\n \n\n\n \n\n\n \n\n\n3,279.4\n\n\n \n\n\n\n\n\n\nGross Profit\n\n\n \n\n\n \n\n\n2,137.2\n\n\n \n\n\n \n\n\n \n\n\n407.0\n\n\n \n\n\n \n\n\n \n\n\n104.7\n\n\n \n\n\n \n\n\n \n\n\n(\n60.4\n\n\n)\n\n\n \n\n\n \n\n\n2,588.5\n\n\n \n\n\n\n\n\n\nMarketing expenses\n\n\n \n\n\n \n\n\n509.5\n\n\n \n\n\n \n\n\n \n\n\n127.7\n\n\n \n\n\n \n\n\n \n\n\n4.1\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n641.3\n\n\n \n\n\n\n\n\n\nResearch and Development\n(2)\n\n\n \n\n\n \n\n\n107.1\n\n\n \n\n\n \n\n\n \n\n\n11.1\n\n\n \n\n\n \n\n\n \n\n\n4.2\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n122.4\n\n\n \n\n\n\n\n\n\nSelling, general and administrative expenses\n\n\n \n\n\n \n\n\n590.9\n\n\n \n\n\n \n\n\n \n\n\n164.0\n\n\n \n\n\n \n\n\n \n\n\n72.9\n\n\n \n\n\n \n\n\n \n\n\n(\n60.4\n\n\n)\n\n\n \n\n\n \n\n\n767.4\n\n\n \n\n\n\n\n\n\nIncome from Operations\n\n\n \n\n\n \n\n\n929.7\n\n\n \n\n\n \n\n\n \n\n\n104.2\n\n\n \n\n\n \n\n\n \n\n\n23.5\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n1,057.4\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31, 2022\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nConsumer Domestic\n\n\n \n\n\n \n\n\nConsumer International\n\n\n \n\n\n \n\n\nSPD\n\n\n \n\n\n \n\n\nCorporate\n(1)\n\n\n \n\n\n \n\n\nTotal Consolidated\n\n\n \n\n\n\n\n\n\nNet Sales\n\n\n \n\n\n$\n\n\n4,131.0\n\n\n \n\n\n \n\n\n$\n\n\n896.1\n\n\n \n\n\n \n\n\n$\n\n\n348.5\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n$\n\n\n5,375.6\n\n\n \n\n\n\n\n\n\nCost of sales\n\n\n \n\n\n \n\n\n2,336.9\n\n\n \n\n\n \n\n\n \n\n\n523.7\n\n\n \n\n\n \n\n\n \n\n\n230.7\n\n\n \n\n\n \n\n\n \n\n\n34.3\n\n\n \n\n\n \n\n\n \n\n\n3,125.6\n\n\n \n\n\n\n\n\n\nGross Profit\n\n\n \n\n\n \n\n\n1,794.1\n\n\n \n\n\n \n\n\n \n\n\n372.4\n\n\n \n\n\n \n\n\n \n\n\n117.8\n\n\n \n\n\n \n\n\n \n\n\n(\n34.3\n\n\n)\n\n\n \n\n\n \n\n\n2,250.0\n\n\n \n\n\n\n\n\n\nMarketing expenses\n\n\n \n\n\n \n\n\n412.9\n\n\n \n\n\n \n\n\n \n\n\n117.7\n\n\n \n\n\n \n\n\n \n\n\n4.6\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n535.2\n\n\n \n\n\n\n\n\n\nResearch and Development\n(2)\n\n\n \n\n\n \n\n\n96.2\n\n\n \n\n\n \n\n\n \n\n\n10.0\n\n\n \n\n\n \n\n\n \n\n\n3.8\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n110.0\n\n\n \n\n\n\n\n\n\nSelling, general and administrative expenses\n\n\n \n\n\n \n\n\n436.6\n\n\n \n\n\n \n\n\n \n\n\n136.8\n\n\n \n\n\n \n\n\n \n\n\n56.9\n\n\n \n\n\n \n\n\n \n\n\n(\n34.3\n\n\n)\n\n\n \n\n\n \n\n\n596.0\n\n\n \n\n\n\n\n\n\nFlawless Trade name and other asset impairments\n\n\n \n\n\n \n\n\n349.3\n\n\n \n\n\n \n\n\n \n\n\n61.7\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n411.0\n\n\n \n\n\n\n\n\n\nIncome from Operations\n\n\n \n\n\n \n\n\n499.1\n\n\n \n\n\n \n\n\n \n\n\n46.2\n\n\n \n\n\n \n\n\n \n\n\n52.5\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n597.8\n\n\n \n\n\n\n\n \n(1)\nC\norporate reflects the administrative costs of the production planning and logistics functions which are elements of Cost of Sales in the Company’s Consolidated Statements of Income but are allocated to the operating segments in Selling, General and Administrative expenses to determine operating segment income before income taxes.  The increase in 2023 compared to 2022 is primarily due to higher incentive compensation costs\n.\n(2)\nAll costs for Research & Development administration, global compliance, technology support, packaging and sustainability are reported in the Consumer Domestic segment.\n \nOther segment expenses for \neach of the three years in the period ended December 31, 2024 include the following:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nConsumer Domestic\n\n\n \n\n\n \n\n\nConsumer International\n\n\n \n\n\n \n\n\nSPD\n\n\n \n\n\n \n\n\nCorporate\n\n\n \n\n\n \n\n\nTotal Consolidated\n\n\n \n\n\n\n\n\n\nDepreciation & Amortization\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n2024\n\n\n \n\n\n$\n\n\n198.7\n\n\n \n\n\n \n\n\n$\n\n\n29.1\n\n\n \n\n\n \n\n\n$\n\n\n10.2\n\n\n \n\n\n \n\n\n$\n\n\n1.1\n\n\n \n\n\n \n\n\n$\n\n\n239.1\n\n\n \n\n\n\n\n\n\n2023\n\n\n \n\n\n \n\n\n182.7\n\n\n \n\n\n \n\n\n \n\n\n27.7\n\n\n \n\n\n \n\n\n \n\n\n13.6\n\n\n \n\n\n \n\n\n \n\n\n1.2\n\n\n \n\n\n \n\n\n \n\n\n225.2\n\n\n \n\n\n\n\n\n\n2022\n\n\n \n\n\n \n\n\n172.1\n\n\n \n\n\n \n\n\n \n\n\n30.1\n\n\n \n\n\n \n\n\n \n\n\n13.8\n\n\n \n\n\n \n\n\n \n\n\n3.0\n\n\n \n\n\n \n\n\n \n\n\n219.0\n\n\n \n\n\n\n\nOther than the differences noted in the footnote above, the accounting policies followed by each of the segments, including intersegment transactions, are substantially consistent with the accounting policies described in Note 1.\n\n\n85\n\n\n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n(In millions, except share and per share data)\n \n\n\nProduct line revenues from external customers for each of the three years ended December 31, 2024, 2023 and 2022 were as follows:\n \n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nHousehold Products\n\n\n \n\n\n$\n\n\n2,584.3\n\n\n \n\n\n \n\n\n$\n\n\n2,484.1\n\n\n \n\n\n \n\n\n$\n\n\n2,272.0\n\n\n \n\n\n\n\n\n\nPersonal Care Products\n\n\n \n\n\n \n\n\n2,148.0\n\n\n \n\n\n \n\n\n \n\n\n2,087.1\n\n\n \n\n\n \n\n\n \n\n\n1,859.0\n\n\n \n\n\n\n\n\n\nTotal Consumer Domestic\n\n\n \n\n\n \n\n\n4,732.3\n\n\n \n\n\n \n\n\n \n\n\n4,571.2\n\n\n \n\n\n \n\n\n \n\n\n4,131.0\n\n\n \n\n\n\n\n\n\nTotal Consumer International\n\n\n \n\n\n \n\n\n1,071.5\n\n\n \n\n\n \n\n\n \n\n\n975.7\n\n\n \n\n\n \n\n\n \n\n\n896.1\n\n\n \n\n\n\n\n\n\nTotal SPD\n\n\n \n\n\n \n\n\n303.3\n\n\n \n\n\n \n\n\n \n\n\n321.0\n\n\n \n\n\n \n\n\n \n\n\n348.5\n\n\n \n\n\n\n\n\n\nTotal Consolidated Net Sales\n\n\n \n\n\n$\n\n\n6,107.1\n\n\n \n\n\n \n\n\n$\n\n\n5,867.9\n\n\n \n\n\n \n\n\n$\n\n\n5,375.6\n\n\n \n\n\n\n\n \nHousehold Products include laundry, deodorizing, and cleaning products. Personal Care Products include condoms, pregnancy kits, oral care products, skin care products, hair care products and gummy dietary supplements.\nGeographic Information\nApproximately \n82\n%, \n83\n% and \n83\n% of the net sales reported in the accompanying consolidated financial statements in 2024, 2023 and 2022, respectively, were to customers in the U.S.  Approximately \n96\n%, \n96\n% and \n97\n% of long-lived assets were located in the U.S. at December 31, 2024, 2023 and 2022, respectively.  Other than the U.S., no one country accounts for more than\n \n5\n% of consolidated net sales and \n5\n% of total assets.\nCustomers\nA group of four customers accounted for approximately \n43\n% and \n44\n% of consolidated net sales in 2024 and 2023, respectively.  A group of four customers accounted for approximately \n42\n% of consolidated net sales in 2022, of which a single customer (\nWalmart Inc. and its affiliates\n) accounted for approximately \n23\n%, \n23\n%\n and \n24\n% in 2024, 2023 and 2022, respectively.\n\n\n \n\n\n86\n\n\n\n\n \n\n\nI\nTEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\n\n\nNot applicable.\n \n\n\n \n\n\n \n\n\nI\nTEM 9A. CONTROLS AND PROCEDURES\n\n\na)\nEvaluation of Disclosure Controls and Procedures\n\n\nThe Company’s management, with the participation of the Company’s Chief Executive Officer and Chief Financial Officer, evaluated the effectiveness of the Company’s disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the “Exchange Act”)) at the end of the period covered by this Annual Report.  Based on that evaluation, the Chief Executive Officer and Chief Financial Officer concluded that the Company’s disclosure controls and procedures as of the end of the period covered by this Annual Report are effective to provide reasonable assurance that the information required to be disclosed by the Company in reports filed under the Exchange Act are (i) recorded, processed, summarized and reported within the time periods specified in the Commission’s  rules and forms, and (ii) accumulated and communicated to the Company’s management, including the Chief Executive Officer and Chief Financial Officer, as appropriate to allow timely decisions regarding the disclosure.\n\n\nb)\nManagement’s Report on Internal Control Over Financial Reporting\n\n\nThe Company’s management’s report on internal control over financial reporting is set forth in Item 8 of this Annual Report and is incorporated by reference herein.  The Company’s independent registered public accounting firm has issued an audit report on the effectiveness of the Company’s internal control over financial reporting, which is set forth in Item 8 of this Annual Report.\n\n\nc)\nChange in Internal Control over Financial Reporting\n\n\nNo change in the Company’s internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) occurred during the Company’s most recent fiscal quarter that has materially affected, or is reasonably likely to materially affect, the Company’s internal control over financial reporting.\n\n\n \n\n\n \n\n\nI\nTEM 9B. OTHER INFORMATION\n(c)  During the quarter ended December 31, 2024, no director or officer (as defined in Rule 16a-1(f) under the Exchange Act) of the Company \nadopted\n or \nterminated\n any Rule 10b5-1 trading arrangements or non-Rule 10b5-1 trading arrangements (in each case, as defined in Item 408(a) of Regulation S-K).\n\n\n \n\n\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\n\n\nNot applicable.\n\n\n \n\n\n \n\n\n87\n\n\n\n\n \n\n\n \n\n\nP\nART III\n\n\n \n\n\n \n\n\nI\nTEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\n\n\nInformation required by this item is incorporated by reference to the information under the captions “Election of Directors,” “Information about the Company’s Executive Officers,” “Corporate Governance and Other Board Matters – Code of Conduct,” “Corporate Governance  and Other Board Matters– Board of Directors Meetings and Committees – Audit Committee,” and \"Corporate Governance and Other Board Matters – Insider Trading Policies and Procedures\" in the Company’s definitive proxy statement, which will be filed with the Commission not later than 120 days after the close of the fiscal year covered by this Annual Report.\n\n\n \n\n\n \n\n\nI\nTEM 11. EXECUTIVE COMPENSATION\n\n\nInformation required by this item is incorporated by reference to the information under the captions “Compensation Discussion and Analysis,” “2024 Summary Compensation Table,” “2024 Grants of Plan Based Awards,” “2024 Outstanding Equity Awards at Fiscal Year-End,” “2024 Option Exercises and Stock Vested,” “2024 Nonqualified Deferred Compensation,” “Potential Payments Upon Termination or Change in Control” and “Compensation & Human Capital Committee Report” in the Company’s definitive proxy statement, which will be filed with the Commission not later than 120 days after the close of the fiscal year covered by this Annual Report.\n\n\n \n\n\n \n\n\nI\nTEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\n\n\nInformation required by this item is incorporated by reference to the information under the captions “Equity Compensation Plan Information as of December 31, 2024” and “Securities Ownership of Certain Beneficial Owners and Management” in the Company’s definitive proxy statement, which will be filed with the Commission not later than 120 days after the close of the fiscal year covered by this Annual Report.\n\n\n \n\n\n \n\n\nI\nTEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\n \n\n\nInformation required by this item is incorporated by reference to the information under the caption “Corporate Governance and other Board Matters – Board of Directors Independence” in the Company’s definitive proxy statement, which will be filed with the Commission not later than 120 days after the close of the fiscal year covered by this Annual Report.\n\n\n \n\n\n \n\n\nI\nTEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\n\n\nInformation required by this item in relation to our principal accountant, Deloitte & Touche LLP (PCAOB ID No. \n34\n) is incorporated by reference to the information under the caption “Fees Paid to Independent Registered Public Accounting Firm” in the Company’s definitive proxy statement, which will be filed with the Commission not later than 120 days after the close of the fiscal year covered by this Annual Report.\n\n\n \n\n\n88\n\n\n\n\n \n\n\nP\nART IV\n\n\nI\nTEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES\n \n\n\n(a)  1.  \nFinancial Statements and Schedule\n\n\nThe following Consolidated Financial Statements are included in Item 8 of this Form 10-K:\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nConsolidated Statements of Income for each of the three years in the period ended December 31, 2024\n\n\n55\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\nConsolidated Balance Sheets as of December 31, 2024 and 2023\n\n\n56\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\nConsolidated Statements of Cash Flow for each of the three years in the period ended December 31, 2024\n\n\n57\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\nConsolidated Statements of Stockholders’ Equity for each of the three years in the period ended December 31, 2024\n\n\n59\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\nNotes to Consolidated Financial Statements\n\n\n60\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\nSchedule II ‑ Valuation and Qualifying Accounts for each of the three years in the period ended December 31, 2024\n\n\n96\n\n\n\n\n\n\n \n\n\n(a)  3.  \nExhibits\n\n\nUnless otherwise noted, the file number for all the Company’s filings with the Securities and Exchange Commission referenced below is 1-10585.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n(3.1)\n\n\nAmended and Restated Certificate of Incorporation of the Company, incorporated by reference to Exhibit 3.1 to the Company’s quarterly report on Form 10-Q for the quarter ended June 30, 2020.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(3.2)\n\n\nAmendment to the Company’s Amended and Restated Certificate of Incorporation, incorporated by reference to Exhibit 3.1 to the Company’s current report on Form 8-K filed on April 30, 2021.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(3.3)\n\n\nAmendment to the Company’s Amended and Restated Certificate of Incorporation, incorporated by reference to Exhibit 3.1 to the Company’s current report on Form 8-K filed on May 6, 2024.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(3.4)\n\n\nBy-laws of the Company, amended and restated as of April 27, 2023, incorporated by reference to Exhibit 3.1 to the Company’s current report on Form 8-K filed on April 28, 2023.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(4.1)\n\n\nIndenture, dated as of December 15, 2010, between Church & Dwight Co., Inc. and The Bank of New York Mellon Trust Company, N.A., as trustee, relating to the 2.875% Notes due 2022, incorporated by reference to Exhibit 4.1 to the Company’s current report on Form 8-K filed on December 15, 2010.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(4.2)\n\n\nSecond Supplemental Indenture, dated as of September 26, 2012, between Church & Dwight Co., Inc. and The Bank of New York Mellon Trust Company, N.A., as trustee, relating to the 2.875% Notes due 2022, incorporated by reference to Exhibit 4.2 to the Company’s current report on Form 8-K filed on September 26, 2012.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(4.3)\n\n\nIndenture, dated as of December 9, 2014, between Church & Dwight Co., Inc. and Wells Fargo Bank, National Association, as trustee, incorporated by reference to Exhibit 4.1 to the Company’s current report on Form 8-K filed on December 9, 2014.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(4.4)\n\n\nSecond Supplemental Indenture, dated as of July 25, 2017, between Church & Dwight Co., Inc. and Wells Fargo Bank, National Association, as trustee, relating to the Notes, incorporated by reference to Exhibit 4.2 of the Company’s current report on Form 8-K filed on July 25, 2017.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(4.5)\n\n\nIndenture, dated as of December 10, 2021, between Church and Dwight Co., Inc. and Deutsche Bank Trust Company Americas, as trustee, relating to the Notes, incorporated by reference to Exhibit 4.1 to the\n \nCompany’s current report on Form 8-K filed on December 10, 2021.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(4.6)\n\n\nFirst Supplemental Indenture, dated as of December 10, 2021, between Church & Dwight Co., Inc. and Deutsche Bank Trust Company Americas, as trustee, relating to the Notes, incorporated by reference to Exhibit 4.2 to the Company’s current report on Form 8-K filed on December 10, 2021.\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(4.7)\n\n\nSecond Supplemental Indenture, dated as of June 2, 2022, between Church & Dwight Co., Inc. and Deutsche Bank Trust Company Americas, as trustee, incorporated by reference to Exhibit 4.2 to the Company’s current report on Form 8-K filed on June 2, 2022.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(4.8)\n\n\nThird Supplemental Indenture, dated as of November 2, 2022, between Church & Dwight Co., Inc. and Deutsche Bank Trust Company Americas, as trustee, incorporated by reference to Exhibit 4.2 to the Company’s current report on Form 8-K filed on November 2, 2022.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n89\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n(4.9)\n\n\nDescription of Registrant’s Securities, incorporated by reference to Exhibit 4.5 to the Company’s annual report on Form 10-K for the year ended December 31, 2019.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(10.1)\n\n\nCredit Agreement dated June 16, 2022, among Church & Dwight Co., Inc., the initial lenders named therein, Bank of America, N.A., as lead administrative agent, swing line lender, and L/C issuer, Wells Fargo Bank, National Association, as co-administrative agent and syndication agent, and Truist Bank, as syndication agent incorporated by reference to Exhibit 10.1 of the Company’s Current Report on Form 8-K filed on June 21, 2022.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(10.2)\n\n\nTerm Credit Agreement dated December 22, 2021, by and among Church & Dwight Co., Inc. the lenders party thereto, and Bank of America, N.A., as administrative agent, incorporated by reference to Exhibit 10.2 to the Company’s annual report on Form 10-K for the year ended December 31, 2022.\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(10.3)\n\n\nFirst Amendment to Credit Agreement dated June 16, 2022, among Church & Dwight Co., Inc., the lenders named therein, and Bank of America, N.A., as administrative agent incorporated by reference to Exhibit 10.2 of the Company’s Current Report on Form 8-K filed on June 21, 2022.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(10.4)\n\n\nForm of Commercial Paper Dealer Agreement, dated February 23, 2017, by and between Church & Dwight Co., Inc. and Dealer, incorporated by reference to Exhibit 10.2 to the Company’s annual report on Form 10-K for the year ended December 31, 2016.\n \n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(10.5)\n\n\nForm of Amended and Restated Commercial Paper Dealer Agreement, dated February 23, 2017, by and between Church & Dwight Co., Inc. and Dealer, incorporated by reference to Exhibit 10.3 to the Company’s annual report on Form 10-K for the year ended December 31, 2016.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(10.6)\n\n\nStock Purchase Agreement, dated as of July 17, 2017, among Church & Dwight Co., Inc., PIK Holdings, Inc., the Representative and the stockholders party thereto, incorporated by reference to Exhibit 2.1 of the Company’s current report on Form 8-K filed on July 17, 2017.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n*\n\n\n(10.7)\n\n\nChurch & Dwight Co., Inc. Executive Deferred Compensation Plan, effective as of June 1, 1997, incorporated by reference to Exhibit 10(f) to the Company’s annual report on Form 10-K for the year ended December 31, 1997.\n \n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n\n\n\n(10.8)\n\n\nAmendment to the Church & Dwight Co., Inc. Executive Deferred Compensation Plan, effective January 1, 2007, incorporated by reference to Exhibit 10.4.1 to the Company’s annual report on Form 10-K for the year ended December 31, 2011.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n\n\n\n(10.9)\n\n\nAmendment to the Church & Dwight Co., Inc. Executive Deferred Compensation Plan, effective February 1, 2012, incorporated by reference to Exhibit 10.4.2 to the Company’s annual report on Form 10-K for the year ended December 31, 2011.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n*\n\n\n(10.10)\n\n\nAmendment to the Church & Dwight Co., Inc. Executive Deferred Compensation Plan II, dated July  25, 2023, incorporated by reference to Exhibit 10.3 to the Company’s quarterly report on Form 10-Q for the quarter ended September 30, 2023.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n*\n\n\n(10.11)\n\n\nAmendment to the Church & Dwight Co., Inc. Executive Deferred Compensation Plan II, dated January 10, 2024 incorporated by reference to Exhibit 10.11 to the Company’s annual report on Form 10-K for the year ended December 31, 2023.\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n\n\n\n(10.12)\n\n\nChurch & Dwight Co., Inc. Executive Deferred Compensation Plan II, amended and restated as of January 1, 2012, incorporated by reference to Exhibit 10.5 to the Company’s annual report on Form 10-K for the year ended December 31, 2011.\n \n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n\n\n\n(10.13)\n\n\nDeferred Compensation Plan for Directors effective as of May 1, 2008, incorporated by reference to Exhibit 10.5 to the Company’s quarterly report on Form 10-Q for the quarter ended March 28, 2008.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n*\n\n\n(10.14)\n\n\nAmended and Restated Compensation Plan for Directors, effective January 1, 2015, incorporated by reference to Exhibit 10.7 to the Company’s annual report on Form 10-K for the year ended December 31, 2015.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n\n\n\n(10.15)\n\n\nAmended and Restated Compensation Plan for Directors, dated November 1, 2017, incorporated by reference to Exhibit 10.9.2 to the Company’s annual report on Form 10-K for the year ended December 31, 2017.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n\n\n\n(10.16)\n\n\nAmended and Restated Compensation Plan for Directors, dated February 1, 2023, incorporated by reference to Exhibit 10.14 to the Company’s annual report on Form 10-K for the year ended December 31, 2022.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n*\n\n\n(10.17)\n\n\nAmended and Restated Compensation Plan for Directors, dated November 1, 2023, incorporated by reference to Exhibit 10.1 to the Company’s quarterly report on Form 10-Q for the quarter ended September 30, 2023.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n\n\n\n(10.18)\n\n\nThe Church & Dwight Co., Inc. Stock Award Plan as amended, incorporated by reference to Exhibit 10 to the Company’s quarterly report on Form 10-Q for the quarter ended June 29, 2007.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n90\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n*\n\n\n(10.19)\n\n\nThe Stock Option Plan for Directors, effective as of January 1, 1991, incorporated by reference to Exhibit 10(j) to the Company’s annual report on Form 10-K for the year ended December 31, 2005.\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n\n\n\n(10.20)\n\n\nC\nhurch & Dwight Co., Inc., Amended and Restated Omnibus Equity Compensation Plan, incorporated by reference to Exhibit A to the Company’s proxy statement for its 2013 Annual Meeting of Stockholders, filed on March 21, 2013.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n*\n\n\n(10.21)\n\n\nFirst Amendment to Church & Dwight Co., Inc. Amended and Restated Omnibus Equity Compensation Plan, incorporated by reference to Exhibit 10.1 to the Company’s quarterly report on Form 10-Q for the quarter ended September 30, 2019.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n\n\n\n(10.22)\n\n\nForm of Award Agreement for CEO and EVPs Under the Church & Dwight Co., Inc., Amended and Restated Omnibus Equity Compensation Plan, incorporated by reference to Exhibit 10.2 to the Company’s quarterly report on Form 10-Q for the quarter ended September 30, 2019.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n*\n\n\n(10.23)\n\n\nForm of Award Agreement for CEO and EVPs Under the Church & Dwight Co., Inc., Amended and Restated Omnibus Equity Compensation Plan incorporated by reference to Exhibit 10.13.1 to the Company’s annual report on Form 10-K for the year ended December 31, 2021.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n*\n\n\n(10.24)\n\n\nForm of Award Agreement for Employees Under the Church & Dwight Co., Inc., Amended and Restated Omnibus Equity Compensation Plan, incorporated by reference to Exhibit 10.12.2 to the Company’s annual report on Form 10-K for the year ended December 31, 2018.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n\n\n\n(10.25)\n\n\nForm of Award Agreement for Employees Under the Church & Dwight Co., Inc., Amended and Restated Omnibus Equity Compensation Plan incorporated by reference to Exhibit 10.14.1 to the Company’s annual report on Form 10-K for the year ended December 31, 2021.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n\n\n\n(10.26)\n\n\nForm of Award Agreement for Directors Under the Church & Dwight Co., Inc., Amended and Restated Omnibus Equity Compensation Plan, incorporated by reference to Exhibit 10.12.1 to the Company’s annual report on Form 10-K for the year ended December 31, 2018.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n*\n\n\n(10.27)\n\n\nChurch & Dwight Co., Inc. Amended and Restated Omnibus Equity Compensation Plan, incorporated by reference to Appendix A to the Company’s proxy statement for its 2022 Annual Meeting of Stockholders, filed on March 18, 2022.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n\n\n\n(10.28)\n\n\nForm of Non-Qualified Stock Option Grant Agreement, incorporated by reference to Exhibit 10.1 to the Company’s current report on Form 8-K filed on June 3, 2022.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n\n\n\n(10.29)\n\n\nForm of Non-Qualified Stock Option Grant Agreement, incorporated by reference to Exhibit 10.3 to the Company’s quarterly report on Form 10-Q filed on May 2, 2024.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n\n\n\n(10.30)\n\n\nForm of Restricted Stock Unit Grant Agreement, incorporated by reference to Exhibit 10.1 to the Company’s current report on Form 8-K filed on February 6, 2023.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n\n\n\n(10.31)\n\n\nForm of Restricted Stock Unit Grant Agreement, incorporated by reference to Exhibit 10.1 to the Company’s quarterly report on Form 10-Q filed on May 2, 2024\n.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n\n\n\n(10.32)\n\n\nForm of Performance Stock Unit Grant Agreement, incorporated by reference to Exhibit 10.2 to the Company’s current report on Form 8-K filed on February 6, 2023.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n\n\n\n(10.33)\n\n\nForm of Performance Stock Unit Grant Agreement, incorporated by reference to Exhibit 10.2 to the Company’s  quarterly report on Form 10-Q filed on May 2, 2024.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n\n\n\n(10.34)\n\n\nForm of Non-Qualified Stock Option Grant Agreement, for Directors, incorporated by reference to Exhibit 10.28 to the Company’s annual report on Form 10-K for the year ended December 31, 2022.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n\n\n\n(10.35)\n\n\nForm of Restricted Stock Unit Grant Agreement, for Directors, incorporated by reference to Exhibit 10.29 to the Company’s annual report on Form 10-K for the year ended December 31, 2022.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n\n\n\n(10.36)\n\n\nChurch & Dwight Co., Inc. Third Amended and Restated Annual Incentive Plan, incorporated by reference to Exhibit 10.1 to the Company’s current report on Form 8-K filed on December 6, 2018.\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n*\n\n\n(10.37)\n\n\nChurch & Dwight Co., Inc.  Fourth Amended and Restated Annual Incentive Plan, dated October 31, 2023, incorporated by reference to Exhibit 10.2 to the Company’s quarterly report on Form 10-Q for the quarter ended October 31, 2023\n.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n*\n\n\n(10.38)\n\n\nChurch & Dwight Co., Inc Employee Stock Purchase Plan, as approved by the Company’s stockholders on April 27, 2023, and amended and restated as of November 22, 2024.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n\n\n\n(10.39)\n\n\nEmployment Agreement, dated October 31, 2011, by and between the Company and Patrick de Maynadier, incorporated by reference to Exhibit 10.18 to the Company’s annual report on Form 10-K for the year ended December 31, 2011.\n\n\n\n\n\n\n91\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n\n\n\n(10.40)\n\n\nEmployment Agreement, dated August 23, 2006, by and between the Company and Matthew T. Farrell, incorporated by reference to Exhibit 10.1 to the Company’s quarterly report on Form 10-Q for the quarter ended September 29, 2006.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n\n\n\n(10.41)\n\n\nAmended and Restated Change in Control and Severance Agreement, entered into by and between the Company and Matthew T. Farrell, incorporated by reference to Exhibit 10.1 to the Company’s current report on Form 8-K filed on February 2, 2016.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n\n\n\n(10.42)\n\n\nForm of Amended and Restated Change in Control and Severance Agreement entered into by and between the Company and each of the senior executive officers (other than Matthew T. Farrell), incorporated by reference to Exhibit 10.2 to the Company’s current report on Form 8-K filed on February 2, 2016.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(10.43)\n\n\nLease Agreement (Build to Suit), dated July 20, 2011, between Church & Dwight Co., Inc. and CD 95 L.L.C., incorporated by reference to Exhibit 10.1 to the Company’s quarterly report on Form 10-Q for the quarter ended September 30, 2011.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n(10.44)\n\n\nOffer Letter, dated October 11, 2024, between Church & Dwight Co., Inc. and Carlos Ruiz Rabago.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n \n\n\n(19)\n\n\nPolicy on Trading in Church & Dwight Co., Inc. Securities by Directors, Officers and Other Employees\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n \n\n\n(21)\n\n\nList of the Company’s subsidiaries.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n \n\n\n(23)\n\n\nConsent of Independent Registered Public Accounting Firm.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n \n\n\n(31.1)\n\n\nCertification of the Chief Executive Officer of the Company pursuant to Rule 13a-14(a) under the Securities Exchange Act.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n \n\n\n(31.2)\n\n\nCertification of the Chief Financial Officer of the Company pursuant to Rule 13a-14(a) under the Securities Exchange Act.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n \n\n\n(32.1)\n\n\nCertification of the Chief Executive Officer of the Company pursuant to Rule 13a-14(b) under the Exchange Act and 18 U.S.C. Section 1350.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n \n\n\n(32.2)\n\n\nCertification of the Chief Financial Officer of the Company pursuant to Rule 13a-14(b) under the Exchange Act and 18 U.S.C.  Section 1350.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(97.1)\n\n\nPolicy Relating to Recovery of Erroneously Awarded Compensation incorporated by reference to Exhibit 97.1 to the Company’s annual report on Form 10-K for the year ended December 31, 2023.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(101.INS)\n\n\nInline XBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(101.SCH)\n\n\nInline XBRL Taxonomy Extension Schema With Embedded Linkbase Documents.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(104)\n\n\nCover Page Interactive Data File (formatted as inline XBRL and contained in Exhibit 101)\n\n\n\n\n\n\n___________\n\n\n•\nIndicates documents filed or furnished herewith.\n\n\n* Constitutes management contract or compensatory plan or arrangement required to be filed as an exhibit to this Annual Report.\n\n\n \n\n\n92\n\n\n\n\n \n\n\nITEM 16. FORM 10-K SUMMARY\n\n\n     None.\n\n\n \n\n\n \n\n\n93\n\n\n\n\n \n\n\n \n\n\nSIGNATURES\n\n\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this Annual Report to be signed on its behalf by the undersigned, thereunto duly authorized, on February 13, 2025.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\nCHURCH & DWIGHT CO., INC.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nBy:\n\n\n \n\n\n/s/ Matthew T. Farrell\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\nMATTHEW T. FARRELL\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\nPRESIDENT AND CHIEF EXECUTIVE OFFICER\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n94\n\n\n\n\n \n\n\nPursuant to the requirements of the Securities Exchange Act of 1934, this Annual Report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ Matthew T. Farrell\n \n\n\n \n\n\nChairman, President and Chief Executive Officer, Director\n\n\n \n\n\nFebruary 13, 2025\n\n\n\n\n\n\n Matthew T. Farrell\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ Bradlen S. Cashaw\n\n\n \n\n\nDirector\n\n\n \n\n\nFebruary 13, 2025\n\n\n\n\n\n\nBradlen S. Cashaw\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ Bradley C. Irwin\n\n\n \n\n\nDirector\n\n\n \n\n\nFebruary 13, 2025\n\n\n\n\n\n\nBradley C. Irwin\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/  Penry W. Price\n\n\n \n\n\nDirector\n\n\n \n\n\nFebruary 13, 2025\n\n\n\n\n\n\nPenry W. Price\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ Susan G. Saideman\n\n\n \n\n\nDirector\n\n\n \n\n\nFebruary 13, 2025\n\n\n\n\n\n\nSusan G. Saideman\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ Ravichandra K. Saligram\n\n\n \n\n\nDirector\n\n\n \n\n\nFebruary 13, 2025\n\n\n\n\n\n\nRavichandra K. Saligram\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ Robert K. Shearer\n\n\n \n\n\nDirector\n\n\n \n\n\nFebruary 13, 2025\n\n\n\n\n\n\nRobert K. Shearer\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ Michael R. Smith\n \n\n\n \n\n\nDirector\n\n\n \n\n\nFebruary 13, 2025\n\n\n\n\n\n\nMichael R. Smith\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ Janet S. Vergis\n\n\n \n\n\nDirector\n\n\n \n\n\nFebruary 13, 2025\n\n\n\n\n\n\nJanet S. Vergis\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ Arthur B. Winkleblack\n\n\n \n\n\nDirector\n\n\n \n\n\nFebruary 13, 2025\n\n\n\n\n\n\nArthur B. Winkleblack\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ Laurie J. Yoler\n\n\n \n\n\nDirector\n\n\n \n\n\nFebruary 13, 2025\n\n\n\n\n\n\nLaurie J. Yoler\n \n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ Richard A. Dierker\n\n\n \n\n\nExecutive Vice President\n \n\n\n \n\n\nFebruary 13, 2025\n\n\n\n\n\n\nRichard A. Dierker\n\n\n \n\n\nand Chief Financial Officer\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(Principal Financial Officer)\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ Joseph J. Longo\n\n\n \n\n\nVice President and Controller\n\n\n \n\n\nFebruary 13, 2025\n\n\n\n\n\n\nJoseph J. Longo\n\n\n \n\n\n(Principal Accounting Officer)\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n95\n\n\n\n\n \n \n\n\nCHURCH & DWIGHT CO., INC. AND SUBSIDIARIES\n\n\n \n\n\nSCHEDULE II - Valuation and Qualifying Accounts\nFor each of the three years in the period ended December 31, 2024\n(Dollars in millions)\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nAdditions\n\n\n \n\n\n \n\n\nDeductions\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\nBeginning\n\n\n \n\n\n \n\n\nCharged to\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nAmounts\n\n\n \n\n\n \n\n\nForeign\n\n\n \n\n\n \n\n\nEnding\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\nBalance\n\n\n \n\n\n \n\n\nExpenses\n\n\n \n\n\n \n\n\nAcquired\n\n\n \n\n\n \n\n\nWritten Off\n\n\n \n\n\n \n\n\nExchange\n\n\n \n\n\n \n\n\nBalance\n\n\n \n\n\n\n\n\n\nAllowance for Doubtful Accounts\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n$\n\n\n7.3\n\n\n \n\n\n \n\n\n$\n\n\n0.1\n\n\n \n\n\n \n\n\n$\n\n\n0.0\n\n\n \n\n\n \n\n\n$\n\n\n(\n2.2\n\n\n)\n\n\n \n\n\n$\n\n\n(\n0.1\n\n\n)\n\n\n \n\n\n$\n\n\n5.1\n\n\n \n\n\n\n\n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n \n\n\n3.5\n\n\n \n\n\n \n\n\n \n\n\n4.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n0.2\n\n\n)\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n7.3\n\n\n \n\n\n\n\n\n\n \n\n\n2022\n\n\n \n\n\n \n\n\n \n\n\n5.5\n\n\n \n\n\n \n\n\n \n\n\n0.4\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n2.4\n\n\n)\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n3.5\n\n\n \n\n\n\n\n\n\nAllowance for Cash Discounts\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n$\n\n\n8.9\n\n\n \n\n\n \n\n\n$\n\n\n120.1\n\n\n \n\n\n \n\n\n$\n\n\n0.0\n\n\n \n\n\n \n\n\n$\n\n\n(\n119.7\n\n\n)\n\n\n \n\n\n$\n\n\n(\n0.1\n\n\n)\n\n\n \n\n\n$\n\n\n9.2\n\n\n \n\n\n\n\n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n \n\n\n6.6\n\n\n \n\n\n \n\n\n \n\n\n115.1\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n112.7\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.1\n\n\n)\n\n\n \n\n\n \n\n\n8.9\n\n\n \n\n\n\n\n\n\n \n\n\n2022\n\n\n \n\n\n \n\n\n \n\n\n5.9\n\n\n \n\n\n \n\n\n \n\n\n106.0\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n105.2\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.1\n\n\n)\n\n\n \n\n\n \n\n\n6.6\n\n\n \n\n\n\n\n\n\nSales Returns and Allowances\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n$\n\n\n35.0\n\n\n \n\n\n \n\n\n$\n\n\n107.4\n\n\n \n\n\n \n\n\n$\n\n\n0.0\n\n\n \n\n\n \n\n\n$\n\n\n(\n116.4\n\n\n)\n\n\n \n\n\n$\n\n\n(\n0.1\n\n\n)\n\n\n \n\n\n$\n\n\n25.9\n\n\n \n\n\n\n\n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n \n\n\n34.8\n\n\n \n\n\n \n\n\n \n\n\n128.9\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n128.7\n\n\n)\n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n35.0\n\n\n \n\n\n\n\n\n\n \n\n\n2022\n\n\n \n\n\n \n\n\n \n\n\n32.4\n\n\n \n\n\n \n\n\n \n\n\n128.5\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n126.0\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.1\n\n\n)\n\n\n \n\n\n \n\n\n34.8\n\n\n \n\n\n\n\n\n\nInventory Reserves\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n$\n\n\n52.5\n\n\n \n\n\n \n\n\n$\n\n\n26.1\n\n\n \n\n\n \n\n\n$\n\n\n0.0\n\n\n \n\n\n \n\n\n$\n\n\n(\n32.6\n\n\n)\n\n\n \n\n\n$\n\n\n(\n0.8\n\n\n)\n\n\n \n\n\n$\n\n\n45.2\n\n\n \n\n\n\n\n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n \n\n\n46.0\n\n\n \n\n\n \n\n\n \n\n\n40.5\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n34.5\n\n\n)\n\n\n \n\n\n \n\n\n0.5\n\n\n \n\n\n \n\n\n \n\n\n52.5\n\n\n \n\n\n\n\n\n\n \n\n\n2022\n\n\n \n\n\n \n\n\n \n\n\n36.2\n\n\n \n\n\n \n\n\n \n\n\n48.1\n\n\n \n\n\n \n\n\n \n\n\n0.0\n\n\n \n\n\n \n\n\n \n\n\n(\n37.7\n\n\n)\n\n\n \n\n\n \n\n\n(\n0.6\n\n\n)\n\n\n \n\n\n \n\n\n46.0\n\n\n \n\n\n\n\n\n\n \n\n\n96"
  }
}