{
  "ticker": "CHRW",
  "cik": "0001043277",
  "company_name": "C. H. ROBINSON WORLDWIDE, INC.",
  "filing_date": "2025-02-14",
  "accession": "0001043277-25-000012",
  "primary_doc": "chrw-20241231.htm",
  "item_sections": {
    "item1": "Item 16.\nForm 10-K Summary\n75\nSignatures\n76\n2\nTable of Contents\nPART I\nITEM 1. BUSINESS\n \nOverview\nC.H. Robinson Worldwide, Inc. (“C.H. Robinson,” “the company,” “we,” “us,” or “our”) is one of the largest global logistics providers in the world, with consolidated total revenues of $17.7 billion in 2024. We deliver logistics like no one else. Companies around the world look to us to reimagine supply chains, advance freight technology and solve logistics challenges\n—\nfrom the simple to the complex. We are grounded in our\n \npromise to deliver exceptional customer success, using our expertise, scale and tailored solutions to help customers navigate increasingly complex global supply chains.\nOperating throughout North America, Europe, Asia, Oceania, South America, and the Middle East, we help ensure the seamless delivery of goods across industries and continents. Our global suite of multimodal logistics services brings together the expertise of our people with custom technology differentiated by one of the largest datasets on shipments, routings, and carriers in the world. \nThe Robinson Operating Model is the foundation of our strategy, execution, and accountability throughout the organization. Rooted in Lean principles, it has elevated our team and leaders to focus on accelerated opportunity identification and operational effectiveness in delivering value to our customers. Leveraging our rich datasets supported by the framework of the Robinson Operating Model, our culture has embraced a disciplined approach to continuous improvement and speed of decision making.\nAs one of the world’s largest logistics platforms, our proprietary technology connects \n83,000 \ncustomers and \n450,000 \ncarriers. We work closely with a global network of transportation companies, including contracted motor carriers, railroads, and ocean and air carriers. We utilize those relationships to efficiently and cost-effectively arrange the transport of our customers’ freight. In 2024, our customers trusted us to manage approximately \n37 million\n shipments and \n$23 billion\n in freight. As an integral part of our transportation services, we also provide a wide range of value-added logistics services, such as freight consolidation, drop trailer, cross-border logistics, customs brokerage and trade compliance, supply chain consulting and design, and fully managed third-party logistics (“3PL”) and fourth-party logistics (“4PL”) solutions.\nO\nur global team of supply chain experts, differentiated technology, and integrated product portfolio across ocean, air, rail, and truck shipping bring unique value to the marketplace. Our global perspective across all links in the supply chain are critical in supporting shippers through market volatility and global supply chain disruptions. We are also a key driver of digital transformation in our industry. Our innovations with artificial intelligence (“\nAI\n”), machine learning, and data science benefit our customers and help power our growth strategy. We are expanding the use of generative AI in our industry, creating proprietary technology to perform work that defied automation for decades. Our customers get better service, faster speed-to-market and more cost savings, while our people are freed from repetitive, mundane tasks so they can focus on more strategic work. Our enhancements to our dynamic costing and pricing models are key contributors to expanding our operating margins and growing volume and market share.\nIn addition to transportation and logistics services, we also provide sourcing services under the trade name Robinson Fresh\n®\n (“Robinson Fresh”). Our sourcing services consist primarily of the buying, selling, and/or marketing of fresh fruits, vegetables, and other value-added perishable items. The foundation for much of our logistics expertise can be traced to this original business, founded in 1905, which gives us significant experience in handling produce and temperature controlled commodities. We supply fresh produce through a network of independent produce growers and suppliers. Our customers include grocery retailers, restaurants, foodservice distributors, and produce wholesalers. In many cases, we also arrange the logistics and transportation of the products we sell and provide related supply chain services, such as replenishment, category management, and managed procurement services. We have developed proprietary brands of produce and have exclusive licensing agreements to distribute fresh and value-added produce under recognized consumer brand names. The produce for these brands is sourced through a preferred grower network and packed to order through contract packing agreements. We have instituted quality assurance and monitoring procedures with each of these preferred growers.\nSegment information. \nWe have two reportable segments, North American Surface Transportation (“NAST”) and Global Forwarding, with our remaining operating segments reported as All Other and Corporate. The All Other and Corporate segment includes Robinson Fresh, Managed Solutions, Other Surface Transportation outside of North America, and other miscellaneous revenues and unallocated corporate expenses. See additional disclosure in Note 8, \nSegment Reporting\n, to our consolidated financial statements. \nNAST provides transportation and logistics services across North America through a network of offices in the United States, Canada, and Mexico. The primary services provided by NAST include truckload and less than truckload (“LTL”) transportation brokerage services.\n3\nTable of Contents\nGlobal Forwarding provides transportation and logistics services through an international network of offices in North America, Europe, Asia, Oceania, South America, and the Middle East and also contracts with independent agents worldwide. The primary services provided by Global Forwarding include ocean freight services, air freight services, and customs brokerage. \nRobinson Fresh provides sourcing services that primarily include the buying, selling, and/or marketing of fresh fruits, vegetables, and other value-added perishable items. Robinson Fresh sources products from around the world. \nIn November 2024, we launched C.H. Robinson Managed Solutions™ to address a growing gap in the marketplace for shippers wanting seamless access to 4PL services, 3PL, managed transportation and Transportation Management Services (“TMS”) technology from one provider. Consulting services, logistics optimization, and day-to-day logistics management services formerly offered through our TMC division are now offered through Managed Solutions.\nOther Surface Transportation revenues are primarily earned by our Europe Surface Transportation operating segment. Europe Surface Transportation provides transportation and logistics services, including truckload and LTL transportation services, across Europe. The sale of our Europe Surface Transportation business was announced in July 2024 and closed in February 2025.\nSales\nTransportation and Logistics Services\nC.H. Robinson provides freight transportation and related logistics and supply chain services. Our services range from commitments on a specific shipment to much more comprehensive and integrated relationships. We execute these services by investing in and retaining talented employees, developing innovative proprietary systems and processes, and utilizing a network of contracted transportation providers, including, but not limited to, contracted motor carriers, railroads, and ocean and air carriers. We make a profit that is driven by the value we provide our customers and the resulting difference between what we charge to our customers for the totality of services provided to them and what we pay to the transportation providers to transport the freight. \nWe provide the following transportation and logistics services:\n•\nTruckload: Through our contracts with motor carriers, we have access to dry vans, temperature controlled vans, flatbeds, and bulk capacity. Through the use of our proprietary Navisphere platform\n®\n, we connect our customers with contracted motor carriers that specialize in their transportation lanes and product types, and we help contracted motor carriers optimize the usage of their equipment. \n•\nLTL: LTL transportation involves the shipment of single or multiple pallets of freight. We primarily focus on shipments of a single pallet or larger, although we handle any size shipment. Through our contracts with motor carriers and the use of Navisphere, we consolidate freight and freight information to provide our customers with a single source of information on their freight. In many instances, we consolidate partial shipments for several customers into full truckloads.\n•\nOcean: As a licensed Non-Vessel Operating Common Carrier (“NVOCC”) and freight forwarder, we consolidate shipments, determine routing, select ocean carriers, contract for ocean shipments, and/or provide for local pickup and delivery of shipments.\n•\nAir: As a certified Indirect Air Carrier (“IAC”) and freight forwarder, we organize air shipments and provide door-to-door service.\n•\nCustoms: Our customs brokers are licensed and regulated by U.S. Customs and Border Protection and other authoritative governmental agencies to assist importers and exporters in meeting regulatory and operational requirements governing imports and exports. \n•\nOther Logistics Services: We provide intermodal transportation service, which is the shipment of freight in containers or trailers by a combination of truck and rail. In addition, we provide fee-based Managed Solutions, warehousing services, and other services.\nCustomers communicate their freight needs, typically on an order-by-order basis, to the C.H. Robinson team responsible for their account, either directly or through highly automated connections established between Navisphere and the customers’ transportation management system. The C.H. Robinson team then ensures all necessary information regarding each shipment is available in Navisphere. We utilize the information from Navisphere and other available sources to select the best contracted carrier based on factors such as their service score, equipment availability, freight rates, and other relevant factors. \n4\nTable of Contents\nOnce the contracted carrier is selected, we receive the contracted carrier’s commitment to provide the transportation. During the time when a shipment is executed, we connect frequently, either electronically or manually, with the contracted carrier to track the status of the shipment to meet the unique needs of our customers. \nFor most of our transportation and logistics services, we are a service provider. By accepting the customer’s order, we accept certain responsibilities for transportation of the shipment from origin to destination. The carrier’s contract is with us, not the customer, and we are responsible for prompt payment of freight charges. In cases where we have agreed to pay for claims for damage to freight while in transit, we pursue reimbursement from the contracted carrier for the claims. In our Managed Solutions business, we are often acting as the shipper’s agent. In those cases, the carrier’s contract is typically with the customer, and we collect a fee for our services.\nAs a result of our logistics capabilities, our technology, our global suite of services, and integrated modes of transportation, some of our customers have us handle all, or a substantial portion, of their freight transportation needs. Our employees price our services to provide a profit to us for the totality of services performed for the customer. Our services to the customer may be priced on a spot market, or transactional basis, or prearranged contractual rates. Most of our contractual rate commitments are for one year or less and allow for renegotiation. As is typical in the transportation industry, most of these contracts do not include specific volume commitments. When we enter into prearranged rate agreements for truckload services with our customers, we usually have fuel surcharge agreements that allow for fuel to primarily act as a pass-through cost, in addition to the underlying linehaul portion of the rate.\nWe purchase most of our truckload services from our contracted truckload carriers on a spot market, or transactional basis, even when we are working with the customer on a contractual basis. In some cases, we may get advance commitments from one or more contracted motor carriers to transport contracted shipments for the length of our customer contract or to provide transportation services within dense transportation lanes. In those cases, where we have prearranged rates with contracted motor carriers, there is typically a calculated fuel surcharge based on a mutually agreed-upon formula.\nWhile providing day-to-day transportation services, our employees often identify opportunities for additional logistics services as they become more familiar with our customers’ daily operations and the nuances of our customers’ supply chains. We offer a wide range of logistics services on a global basis that reduce or eliminate supply chain inefficiencies. We analyze customers’ transportation rate structures, modes of shipping, and carrier selection. We identify opportunities to consolidate shipments for cost savings. We suggest ways to improve operating and shipping procedures and manage claims. We help customers minimize storage through transloading, crossdocking, drop trailer and other flow-through operations. Many of these services are provided in connection with providing the freight transportation, based on the nature of the customer relationship. Our breadth of value-added services also includes supply chain consulting and design, emissions analytics, customs brokerage and compliance, project logistics, warehousing, and cargo insurance—for which we are usually paid separately. \nWe have broadened our relationship with many of our customers by emphasizing integrated logistics solutions, resulting in our management of a greater portion of their supply chains. We often serve our customers through specially created teams and through multiple locations. Our transportation and logistics services are provided to numerous international customers through our worldwide network. \nTransportation services accounted for approximately 95 percent of adjusted gross profits in 2024 and 2023 and 97 percent of adjusted gross profits in 2022. Adjusted gross profits is a non-GAAP financial measure calculated as total revenues less the total of purchased transportation and related services and the cost of purchased products sourced for resale. For additional information, see Item 7 of Part II, \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n. \nThe table below shows our adjusted gross profits by transportation mode, for the years ended December 31 (in thousands):\n2024\n2023\n2022\n2021\n2020\nTruckload\n$\n1,072,691 \n$\n1,039,079 \n$\n1,561,310 \n$\n1,280,629 \n$\n1,071,873 \nLTL\n572,169 \n550,373 \n632,116 \n523,365 \n457,290 \nOcean\n519,970 \n420,883 \n729,839 \n711,223 \n350,094 \nAir\n135,901 \n123,470 \n198,166 \n225,286 \n151,443 \nCustoms\n107,480 \n97,096 \n107,691 \n100,539 \n87,095 \nOther Logistics Services\n225,599 \n255,735 \n251,547 \n210,958 \n195,159 \nTotal\n$\n2,633,810 \n$\n2,486,636 \n$\n3,480,669 \n$\n3,052,000 \n$\n2,312,954 \n5\nTable of Contents\nSourcing\nSince we were founded in 1905, we have been in the business of sourcing fresh produce. Much of our logistics expertise can be traced to our significant experience in handling produce and other perishable commodities. Because of its perishable nature, produce must be rapidly packaged, carefully transported within tight timetables, usually in temperature controlled equipment, and quickly distributed to replenish high-turnover inventories maintained by our customers. In many instances, we consolidate an individual customer’s produce orders into truckload quantities at the point of origin and arrange for transportation of the truckloads, often to multiple destinations. Our sourcing customer base includes grocery retailers, restaurants, foodservice distributors, and produce wholesalers.\nOur sourcing services include inventory forecasting and replenishment, brand management, and category development services. We have various national and regional branded produce programs, including both proprietary brands and nationally licensed brands. These programs contain a wide variety of high quality, fresh bulk, and value-added fruits and vegetables. These brands have expanded our market presence and relationships with many of our retail customers. We have also instituted quality assurance and monitoring programs as part of our branded and preferred grower programs. Sourcing accounted for approximately five percent of our adjusted gross profits in 2024 and 2023 and three percent of our adjusted gross profits in 2022.\n \nCustomer Relationships\nWe work to establish long-term relationships with our customers and to increase the amount of business done with each customer by providing them with a full range of logistics services and people on whom they can rely. During 2024, we served 83,000 customers worldwide, ranging from Fortune 100 companies to small businesses in a wide variety of industries. During 2024, our largest customer accounted for approximately two percent of our consolidated total revenues. \nWe seek additional business from existing customers and pursue new customers based on our knowledge of the marketplace, our unique information advantage, and the range of logistics services we can provide. We believe our account management disciplines, expertise, tailored solutions, and technology enable our employees to better serve our customers by combining a broad knowledge of logistics and market conditions with a deep, data-driven, understanding of the specific supply chain issues facing individual customers and specific industries. \nMarkets and Resources\nCompetition\n \nThe transportation services industry is highly competitive and fragmented. We compete against traditional and non-traditional logistics companies, including transportation providers that own equipment, third-party freight brokers, technology matching services, internet freight brokers, carriers offering logistics services, on-demand transportation service providers, NVOCCs, IACs, and freight forwarders. We also buy from and sell transportation services to companies that compete with us.\nIn our sourcing business, we compete with produce brokers, produce growers, produce marketing companies, produce wholesalers, and foodservice buying groups. We also buy from and sell produce to companies that compete with us.\n6\nTable of Contents\nWe often compete with respect to price, scope of services, or a combination thereof, but believe that our most significant competitive advantages are:\n•\nPeople and relationships: Our knowledgeable, dedicated, and empowered people act as an extension of our customers’ teams to innovate and execute their supply chain strategies. Our large number of unique, strong relationships provide global connections and valuable market knowledge;\n•\nGlobal suite of services: A wide and integrated selection of services and products provide our customers with consistent capacity and service levels; \n•\nScale: Our customers leverage our significant capacity, broad procurement options, global data insights, and substantial shipment volumes for better efficiency, service, and marketplace advantages; \n•\nData, products, and technology: The combination of our expertise, scale and tailored solutions gives our technology an edge. We have one of the largest datasets of shipments, routings, and carriers in the world. Generative AI is especially powerful in our hands, helping us unlock the value in our vast amount of unstructured data and create new proprietary technology that leads the industry forward. We use our data and data analysts to drive smarter solutions and products for our customers. Our proprietary Navisphere platform provides agility, flexibility, global visibility, easy integration, broad connectivity, and advanced security;\n•\nNetwork: Our combination of global capability, regional and local expertise, and scale gives our customers a strategic advantage in supply chain execution; \n•\nProcess: Proven processes and tailored solutions combine strategy with practical experience for customized action plans that succeed in the real world; and\n•\nStability: Our customers and our contract carriers rely on us to support critical elements of their business. Our financial strength, discipline, and consistent track record of success are a key foundation of our ability to sustainably meet their needs.\nProprietary Information Technology and Intellectual Property \nOur technology brings the value of artificial intelligence, machine learning, data science, and analytics to our customers in order to help solve their most complex logistics challenges and drive the industry forward. With a\npproximately 900 data scientists, engineers, and developers, we continue to make smart, talent-focused investments globally in this critical area and continue to build the next generation of tools and processes that change how supply chains function.\nOur operations primarily use Navisphere, our global, multimodal transportation management system. It is essential for serving our customers and contract carriers and for managing our business. Most of our global network operates on Navisphere, using it to match customer needs with supplier capabilities, to collaborate, and to access centralized support resources to complete all facets of a transaction. In 2024, we managed approximately 37 million shipments for 83,000 customers utilizing the more than 450,000 contract carriers on our platform. \nNavisphere and our other technology help our employees service customer orders, select the optimal mode of transportation, build and consolidate shipments, identify appropriate carriers, and manage exceptions, all based on customer-specific service parameters. Our data estate and scale provide our organization with the business intelligence to support decision-making in all areas of our business.\nNavisphere gives customers one place to purchase, manage, and track their freight transportation around the world. It allows them to communicate worldwide with parties in their supply chain across languages, currencies, and continents. Navisphere also offers sophisticated business analytics, artificial intelligence, and data-driven tools to improve supply chain performance and meet increasing customer demands, including the following:\n•\nOur advanced visibility tools allow our customers to see their freight across all modes and services globally in a single view. Details of shipment contents, shipment status, disruptions to shipments, and resulting adjustments to estimated time of arrival using artifi\ncial intelligence are provided for the customer to manage their supply chain exceptions. Collaboration, intelligent notifications, and performance scorecards allow customers to manage their supply chain and identify inefficiencies.\n•\nNavisphere Insight™ uses data science to turn customers’ raw freight data into valuable insights, surfacing trends in transportation performance and spend that can be used for decision-making in real time or over time. Analysis is provided down to the shipment and order level.\n7\nTable of Contents\n•\nNavisphere Optimizer™ helps customers minimize the travel time, distance, and total miles of their freight, while maximizing their trailer utilization and savings. It is used during the transportation planning process and dynamically selects the right route with the right mode and right carrier on the right day.\nNavisphere is also integrated into 38 third-party transportation management systems and/or enterprise resource planning systems, allowing our dynamic pricing engine to directly deliver real-time quotes to customers when they have freight to be picked up or delivered. This eliminates the need for our customers to shop around and provides them an automated solution.\nEnhancements to our dynamic costing and pricing models allow us to react to market signals more quickly and accurately. Through a combination of more inputs, an upgraded algorithm, and greater configurability, these proprietary data science models serve to optimize our purchasing of shipping capacity and the price we offer our customers.\nWe continue to drive digital transformation in our industry. Using generative AI and large language models, we have created proprietary technology that automates steps across the lifecycle of a shipment: from giving customers a price quote, to accepting a load, to setting appointments for pickup and delivery, to checking on the load in transit. Transactions are performed in seconds, giving customers greater efficiency, speed-to-market, and cost savings while improving employee productivity, as measured by shipments per person per day.\nSome of the other industry-first tools we’ve launched include:\n•\nProcure IQ\n®\n, which uses algorithms built by our data scientists and the largest freight shipment dataset in the industry to show shippers the optimal way to purchase transportation in each of their shipping lanes;\n•\nEmissions IQ\n®\n, which gives shippers instant visibility into their carbon emissions and surfaces opportunities for reduction; and\n•\nMarket Rate IQ™, which reveals the patterns in a shipper’s spot freight that they could change to increase savings. \nNavisphere Carrier™ (\n“\nNavisphere Carrier”) provides contracted motor carriers access to the functionality necessary to efficiently manage their relationships with C.H. Robinson. Contracted motor carriers can search and book available freight, provide online status updates, keep track of receivables, and upload scanned documentation. Many of our contracted motor carriers’ favorite features of Navisphere Carrier are also available through our Navisphere Carrier mobile application for Android\n®\n and iOS\n®\n mobile operating systems. \nFreightquote\n®\n by C.H. Robinson (“Freightquote”) is a web-based, mobile-responsive offering designed to streamline the shipping process for small business customers, allowing the booking of freight without any shipping knowledge or expertise. Freightquote’s small business customers can go online with their smart phone, tablet, or computer to book their LTL or truckload freight, track shipments, get proactive notifications, and pay for transportation services with a credit card.\nWe rely on a combination of cybersecurity, trademarks, copyrights, trade secrets, and nondisclosure and non-competition agreements to establish and protect our intellectual property and proprietary technology. Additionally, we have numerous registered trademarks, trade names, and logos in the United States and internationally. Our reliance on our intellectual property and proprietary technology subjects us to certain risks that, if realized, would negatively impact our operating results. For a description of such risks and their potential effect on our business, see",
    "item1a": "ITEM 1A. RISK FACTORS \nThe following are material factors that could affect our financial performance and could cause actual results for future periods to differ materially from our anticipated results or other expectations, including those expressed in any forward-looking statements made in this Annual Report on Form 10-K. We may also refer to this disclosure to identify factors that may cause actual results to differ from those expressed in other forward-looking statements, including those made in oral presentations such as telephone conferences and webcasts open to the public.\nBusiness environment and competition risk factors\nEconomic recessions could have a significant, adverse impact on our business. \nThe transportation industry historically has experienced cyclical fluctuations in financial results due to economic recessions, downturns in business cycles of our customers, interest rate fluctuations, currency fluctuations, and other economic factors beyond our control. Deterioration in the economic environment subjects our business to various risks, which may have a material and adverse impact on our operating results and cause us to not reach our long-term growth goals:\n•\nDecrease in volumes: A reduction in overall freight volumes in the marketplace may reduce our opportunities for growth. A significant portion of our freight is comprised of transactional or spot market opportunities. The market may be impacted by supply chain disruptions or overall economic conditions. In addition, if a downturn in our customers’ business cycles causes a reduction in the volumes of freight shipped by those customers, particularly in the retail, food, beverage, automotive, industrial, manufacturing, housing, chemicals, or technology industries, our operating results could be adversely affected. \n•\nCredit risk and working capital: Some of our customers may face economic difficulties and may not be able to pay us, and some may go out of business. In addition, some customers may not pay us as quickly as they have in the past, which may cause our working capital needs to increase.\n•\nTransportation provider failures: A significant number of our contracted transportation providers may go out of business, and we may be unable to secure sufficient equipment or other transportation services to meet our commitments to our customers.\n•\nExpense management: We may not be able to appropriately adjust our expenses to changing market demands. In order to maintain high variability in our business model, it is necessary to adjust staffing levels to changing market demands. In periods of rapid change, it may be more difficult to match our staffing levels to our business needs. In addition, we have other expenses that are fixed for a period of time, and we may not be able to adequately adjust them in a period of rapid change in market demand.\nHigher carrier prices may result in decreased adjusted gross profit margin and increases in working capital.\n Carriers can be expected to charge higher prices if market conditions warrant or to cover higher operating expenses. Our adjusted gross profits and income from operations may decrease if we are unable to increase our pricing to our customers. Increased demand for over the road transportation services and changes in regulations may reduce available capacity and increase motor carrier pricing. In some instances where we have entered into contract freight rates with customers, in the event market conditions change and those contracted rates are below market rates, we may be required to provide transportation services at a loss. As our volumes increase or we increase freight rates charged to our customers, the resulting increase in revenues may increase our working capital needs due to our business model, which generally has a higher length of days sales outstanding than days payables outstanding.\nChanging fuel costs and interruptions of fuel supplies may have an impact on our adjusted gross profit margin.\n In our truckload transportation business, fluctuating fuel prices may result in a decreased adjusted gross profit margin. While our different pricing arrangements with customers and contracted motor carriers make it very difficult to measure the precise impact, we believe fuel costs essentially act as a pass-through cost to our truckload business. In times of fluctuating fuel prices, our adjusted gross profit margin may also fluctuate. Adjusted gross profit margin is a non-GAAP financial measure calculated as adjusted gross profits divided by total revenues. For additional information, see Item 7 of Part II, \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations.\n15\nTable of Contents\nOur dependence on third parties to provide equipment and services may impact the delivery and quality of our transportation and logistics services.\n We do not employ the people directly involved in delivering our customers’ freight. We depend on independent third parties to provide truck, rail, ocean, and air services and to report certain events to us, including but not limited to, shipment status information and freight claims. These independent third parties may not fulfill their obligations to us, or our relationship with these parties may change, which may prevent us from meeting our commitments to our customers. Our reliance on these third parties also could cause delays in reporting certain events, including recognizing claims. In addition, if we are unable to secure sufficient equipment or other transportation services from third parties to meet our commitments to our customers, our operating results could be materially and adversely affected, and our customers could switch to our competitors temporarily or permanently. Many of these risks are beyond our control, including:\n•\nequipment and driver shortages in the transportation industry, particularly among contracted motor carriers;\n•\nchanges in regulations impacting transportation;\n•\ndisruption in the supply or cost of fuel;\n•\nreduction or deterioration in rail service; \n•\ngeopolitical factors that may limit the availability of certain carriers;\n•\nthe introduction of alternative means of transporting freight; and \n•\nunanticipated changes in freight markets.\nWe face substantial industry competition.\n Competition in the transportation services industry is intense and broad-based. We compete against traditional and non-traditional logistics companies, including transportation providers that own equipment, third-party freight brokers, technology matching services, internet freight brokers, carriers offering logistics services, and on-demand transportation service providers. We also compete against carriers’ internal sales forces. In addition, customers can bring in-house some of the services we provide to them. We often buy and sell transportation services from and to many of our competitors. Increased competition could reduce our market opportunity and create downward pressure on freight rates, and continued rate pressure may adversely affect our adjusted gross profits and income from operations. In some instances where we have entered into contract freight rates with customers, in the event market conditions change and those contracted rates are below market rates, we may be required to provide transportation services at a loss.\nOur earnings may be affected by seasonal changes or significant disruptions in the transportation industry. \nResults of operations for our industry generally show a seasonal pattern as customers reduce shipments during and after the winter holiday season. We believe this historical pattern has been the result of, or influenced by, numerous factors, including national holidays, weather patterns, consumer demand, economic conditions, and other similar and subtle forces. Although seasonal changes in the transportation industry have not had a significant impact on our cash flow or results of operations, we expect this trend to continue, and we cannot guarantee it will not adversely impact us in the future. The transportation industry may also be significantly impacted by disruptions such as port congestion and the availability of transportation equipment, as well as factors such as labor shortages, fuel prices, shifts in consumer demand toward more locally sourced products, and regulatory changes. These disruptions may impact the growth rates within the global logistics industry and our ability to provide transportation services for our customers, each of which may adversely impact our results of operations and operating cash flows. \nWe may be unable to identify or complete suitable acquisitions and investments.\n We may acquire or make investments in complementary businesses, products, services, or technologies. We cannot guarantee we will be able to identify suitable acquisitions or investment candidates. Even if we identify suitable candidates, we cannot guarantee we will make acquisitions or investments on commercially acceptable terms, if at all. The timing and number of acquisitions we pursue may also cause volatility in our financial results. In addition, we may incur debt or be required to issue equity securities to pay for future acquisitions or investments. The issuance of any equity securities could be dilutive to our stockholders.\nOur sourcing business is dependent upon the supply and price of fresh produce.\n The supply and price of fresh produce is affected by weather and growing conditions, including but not limited to, flood, drought, freeze, insects, disease, and other conditions over which we have no control. Commodity prices can be affected by shortages or overproduction and are often highly volatile. If we are unable to secure fresh produce to meet our commitments to our customers, our operating results could be materially and adversely affected, and our customers could switch to our competitors temporarily or permanently. To assure access to certain commodities, we occasionally make monetary advances to growers to finance their operations. Repayment of these advances is dependent upon the growers’ ability to grow and harvest marketable crops.\n16\nTable of Contents\nCompany risk factors\nWe rely on technology to operate our business, with the majority of our operating systems developed internally and supplemented by third-party technology, which may subject us to cybersecurity events and disruptions.\n Our continued success depends on the effective operation and adaptation of these systems to meet the evolving needs of our customers and users. The automation of existing processes and the use of third-party technology and cloud network capacity may increase our exposure to cybersecurity risks and system availability reliance. We depend on our technology staff and third-party vendors to implement changes and maintain our systems efficiently. Failure to maintain, protect, and enhance our operating systems could result in a competitive disadvantage and loss of customers.\nWe process and maintain confidential, proprietary, personal, and sensitive information, including financial and business data. Our information technology systems, devices, storage, and applications, as well as those maintained by third-party providers, are vulnerable to damage, disruptions, and shutdowns due to cyberattacks, ransomware, malware, phishing, denial of service attacks, and other unauthorized access attempts. These incidents have occurred in the past and may happen again, potentially causing material service outages, inappropriate access, or other significant business interruptions. The frequency and sophistication of cyberattacks have increased globally, making it challenging to anticipate and prevent such events or mitigate their effects. Additionally, we may not immediately detect these incidents.\nGiven the interconnected nature of the supply chain and our significant industry presence, we may be an attractive target for cyberattacks. Many aspects of our operations depend on third-party networks and systems, which are also susceptible to cyber risks. While we have dedicated resources for security, privacy, and incident response, our processes may not be adequate to prevent or limit harm or to remediate incidents promptly. \nA failure to prevent a cyberattack that impacts the performance, reliability, security, and availability of our systems could result in service interruptions, operational difficulties, inability to retain or attract customers, loss of revenues or market share, expose us to legal claims and government actions, liability to customers, reputational damage, and increased service and maintenance costs. Addressing these issues could be costly, and our insurance coverage may not be sufficient to cover all liabilities. These impacts could adversely affect our financial condition, results of operations, and growth prospects.\nOur international operations subject us to operational, financial, and data privacy risks.\n We provide services within and between foreign countries on an increasing basis. Our business outside of the United States is subject to various risks, including:\n•\nchanges in tariffs, trade restrictions, trade agreements, and taxations;\n•\ndifficulties in managing or overseeing foreign operations and agents;\n•\nlimitations on the repatriation of funds because of foreign exchange controls;\n•\ndifferent liability standards; \n•\nintellectual property laws of countries that do not protect our rights in our intellectual property, including but not limited to, our proprietary information systems, to the same extent as the laws of the United States;\n•\nissues related to non-compliance with laws, rules, and regulations in the countries in which we operate including the U.S. Foreign Corrupt Practices Act and similar regulations. Failure to comply could result in reputational harm, substantial penalties, and operational restrictions; and\n•\nglobal laws and regulations regarding the collection, use, processing, and transfer of personal information may impact our services by imposing restrictions on processing, increase legal claim liability, and increase regulatory scrutiny and fines. These requirements continue to evolve and vary by region and regime, which increases the risk of noncompliance and impacts operations, including additional expenses and resources necessary to manage compliant operations.\nThe occurrence or consequences of any of these factors may restrict our ability to operate in the affected region and/or decrease the profitability of our operations in that region.\n17\nTable of Contents\nAs we continue to expand our business internationally, we expose the company to increased risk of loss from foreign currency fluctuations, as well as longer accounts receivable payment cycles. Foreign currency fluctuations could result in currency exchange gains or losses or could affect the book value of our assets and liabilities. Furthermore, we may experience unanticipated changes to our income tax liabilities resulting from changes in geographical income mix and changing international tax legislation. We have limited control over these risks, and if we do not correctly anticipate changes in international economic and political conditions, we may not alter our business practices in time to avoid adverse effects.\nOur ability to appropriately staff and retain employees is important to our business model.\n Our continued success depends upon our ability to attract and retain motivated logistics professionals. In order to maintain high variability in our business model, it is necessary to adjust staffing levels to changing market demands. In periods of rapid change, it may be more difficult to match our staffing level to our business needs. We cannot guarantee we will be able to continue to hire and retain a sufficient number of qualified personnel. In addition, macroeconomic factors impacting the labor market may result in higher costs to hire and retain qualified personnel. Because of our comprehensive employee training program, our employees are attractive targets for new and existing competitors. Continued success depends in large part on our ability to develop successful employees into managers.\nWe use, and may continue to expand our use of, machine learning and artificial intelligence (“AI”) technologies to deliver our services and operate our business.\n If we fail to successfully integrate AI into our platform and business processes, or if we fail to keep pace with rapidly evolving AI technological developments, including attracting and retaining talented AI developers and programmers and cybersecurity personnel, we may face a competitive disadvantage. At the same time, the use or offering of AI technologies may result in new or expanded risks and liabilities, including enhanced government or regulatory scrutiny, litigation, privacy and compliance issues, ethical concerns, confidentiality, reputational harm, and security risks. It is not possible to predict all of the risks related to the use of AI and changes in laws, rules, directives, and regulations governing the use of AI may adversely affect our ability to develop and use AI or subject us to legal liability. The cost of complying with laws and regulations governing AI could be significant and would increase our operating expenses, which could adversely affect our business, financial condition, and results of operations. Further, market demand and acceptance of AI technologies are uncertain, and we may be unsuccessful in efforts to further incorporate AI into our processes.\nWe derive a significant portion of our total revenues and adjusted gross profits from our largest customers.\n During 2024, our top 100 customers based on total revenue comprised approximately 34 percent of our consolidated total revenues and our top 100 customers based on adjusted gross profits comprised approximately 27 percent of our consolidated adjusted gross profits. Our largest customer comprised approximately two percent of our consolidated total revenues. The sudden loss of major customers could materially and adversely affect our operating results.\nWe may be subject to the negative impacts of climate change, which could adversely impact our business and financial results. \nThe potential impacts of climate change may subject us to various risks, including:\n•\nphysical risks such as extreme weather conditions or other types of weather events, which could disrupt our operations;\n•\ncompliance costs and transition risks such as increased regulation on us and on our contracted transportation providers; and\n•\nreputational and strategic risks due to shifts in customer demands such as customers requiring more fuel-efficient transportation, autonomous transportation modes, or increased transparency to carbon emissions in their supply chains.\nSuch impacts may disrupt our operations by adversely affecting our ability to procure services that meet regulatory or customer requirements and may negatively affect our results of operations, cash flows, and financial condition.\nWe may have difficulties integrating acquired companies or efficiently managing divestitures.\n For acquisitions, success depends upon efficiently integrating the acquired business into our existing operations. If we complete a large acquisition or multiple acquisitions within a short period of time, we may experience heightened difficulties integrating the acquired companies. We are required to integrate these businesses into our internal control environment, which may present challenges that are different than those presented by organic growth and that may be difficult to manage. If we are unable to successfully integrate and grow these acquisitions and to realize contemplated revenue synergies and cost savings, our business, prospects, results of operations, financial position, and cash flows could be materially and adversely affected. \n18\nTable of Contents\nDivestiture activity poses risks, and success depends upon efficiently managing the transition process. Failure to do so includes potential risks including disruption to our core operations, failure to deliver the anticipated value for shareholders, diverting management’s attention from other strategic initiatives, negative impacts on our customer and carrier relationships, and the loss of key employees. The inability to successfully manage these risks may result in higher operating expenses, lost revenues, or other negative effects on earnings and our financial results.\nOur growth and profitability may not continue, or we may not achieve our long-term growth targets, which may result in a decrease in our stock price.\n There can be no assurance that our long-term growth targets will be achieved or that we will be able to effectively adapt our management, administrative, and operational systems to respond to any future growth. Future changes in and expansion of our business, or changes in economic or political conditions, could adversely affect our operating margins. Slower or less profitable growth or losses could adversely affect our stock price.\nOur indebtedness could adversely impact our financial condition and results of operations. \nSignificant adverse economic and industry conditions could negatively affect our ability to pay principal and interest on our debt and limit our ability to fund working capital, capital expenditures, possible acquisitions, dividends, share repurchases, or other investments. If we are unable to generate sufficient cash flows to satisfy our debt obligations or refinance these debt obligations with commercially acceptable terms, it may adversely impact our financial position and results of operations. We may be unable to comply with the various restrictions and covenants under our indebtedness, which may result in default and our outstanding indebtedness may become immediately due and payable and adversely impact our financial position. \nWe may be adversely impacted by changing interest rates.\n We are exposed to changes in interest rates, primarily on our short-term debt that carries floating interest rates. Interest rates are highly sensitive to many factors, including governmental monetary policies, economic conditions, and other factors beyond our control. A significant increase in interest rates could adversely impact our financial position and results of operations. \nGovernmental, regulatory, and legal risk factors\nChanges to income tax regulations in the United States and other jurisdictions where we operate may increase our tax liability. \nWe are subject to income taxes in the United States and other jurisdictions where we operate. Changes to income tax laws and regulations in any of the jurisdictions where we operate could adversely affect our overall tax liability. The Organization for Economic Cooperation and Development (“OECD”) reached agreement among various countries to implement a minimum 15 percent tax rate on certain multinational enterprises, commonly referred to as Pillar Two. Subsequently, multiple sets of administrative guidance have been issued. Many non-U.S. tax jurisdictions have either enacted legislation to adopt certain components of the Pillar Two Model Rules beginning in 2024, including the European Union Member States, with the adoption of additional components in later years, or announced their plans to enact legislation in future years. We are subject to these rules in certain jurisdictions in which we operate, and any expected tax impacts have been included in our results. As rules for more jurisdictions will become effective in 2025, we are continuing to evaluate the impact of these proposed and enacted legislative changes as new guidance becomes available. Some of these legislative changes could impact our effective tax rate and tax liabilities. Given the numerous proposed tax law changes and the uncertainty regarding such proposed legislative changes, the impact of Pillar Two could adversely impact our effective tax rate, financial position, and results of operations.\nWe are subject to claims arising from our transportation operations.\n We use the services of thousands of third-party transportation companies in connection with our transportation operations. From time to time, the drivers employed and engaged by the motor carriers with which we contract are involved in accidents, which may result in serious personal injuries. The resulting types and/or amounts of damages may be excluded by or exceed the amount of insurance coverage maintained by the contracted motor carrier. We contractually require all motor carriers we work with to carry at least $750,000 in automobile liability insurance. We also require all contracted motor carriers to maintain workers compensation and other insurance coverage as required by law. Most contracted motor carriers have insurance exceeding these minimum requirements, as well as cargo insurance in varying policy amounts. Railroads, which are generally self-insured, provide limited common carrier cargo loss or damage liability protection, generally up to $250,000 per shipment. Although these drivers are not our employees and all of these drivers are employees, owner-operators, or independent contractors working for the contracted motor carriers, from time to time, claims may be asserted against us for their actions or for our actions in retaining them. Claims against us may exceed the amount of our insurance coverage or may not be covered by insurance at all. A material increase in the frequency or severity of accidents, liability claims, workers’ compensation claims, or unfavorable resolutions of claims could materially and adversely affect our operating results. In addition, significant increases in insurance costs or the inability to purchase insurance as a result of these claims could reduce our profitability. Our involvement in the transportation of certain goods, including but not limited to, hazardous materials, could also increase our exposure in the event one of our contracted motor carriers is involved in an accident resulting in injuries or contamination.\n19\nTable of Contents\nIn North America, as a property freight broker, we are not legally liable for loss or damage to our customers’ cargo. In our customer contracts, we may agree to assume cargo liability up to a stated maximum. We typically do not assume cargo liability to our customers above minimum industry standards in our international freight forwarding, ocean transportation, or air freight businesses on international or domestic air shipments. Although we are not legally liable for loss or damage to our customers’ cargo, from time to time, claims may be asserted against us for cargo losses. We maintain a broad cargo liability insurance policy to help protect us against catastrophic losses that may not be recovered from the responsible contracted carrier. We also carry various liability insurance policies, including automobile and general liability, with a $125 million umbrella with up to a $10 million retention, an additional $10 million corridor retention, and a $6.5 million retention in various layers throughout the umbrella.\nBuying and reselling fresh produce exposes us to possible product liability.\n Agricultural chemicals used on fresh produce are subject to various approvals, and the commodities themselves are subject to regulations on cleanliness and contamination. Product recalls in the produce industry have been caused by concern about particular chemicals and alleged contamination, often leading to lawsuits brought by consumers of allegedly affected produce. We may face claims for a variety of damages arising from the sale of produce, which may include potentially uninsured consequential damages. While we are insured for up to $125 million for product liability claims subject to a $500,000 per incident deductible, settlement of class action claims is often costly, and we cannot guarantee our coverage will be adequate or that it will continue to be available. If we have to recall produce, we may be required to bear the cost of repurchasing, transporting, and destroying any allegedly contaminated product, as well as associated consequential damages. We carry product recall and contamination insurance coverage of $30 million. A loss for which we are not adequately insured could materially affect our financial results. The coverage we currently have in place may not apply to a particular loss, or it may not be sufficient to cover all liabilities to which we may be subject. This policy has a retention of $3.5 million per incident. Any recall or allegation of contamination could affect our reputation, particularly of our proprietary and/or licensed branded produce programs, which could materially and adversely affect our operating results. Loss due to spoilage (including the need for disposal) is also a routine part of the sourcing business.\nAny material litigation related to the above types of claims or claims arising from our transportation operations may require significant time from management and could cause us to incur substantial legal and related costs, which may include damages that could have a material adverse impact on our financial results.\nOur business depends upon compliance with numerous government regulations. \nOur operations may be regulated and licensed by various federal, state, and local transportation agencies in the United States and similar governmental agencies in foreign countries in which we operate. \nWe are subject to licensing and regulation as a property freight broker and are licensed by the DOT to arrange for the transportation of property by motor vehicle. The DOT prescribes qualifications for acting in this capacity, including certain surety bonding requirements. For purposes of our Global Forwarding services, we are also subject to regulation by the FMC as an ocean freight forwarder and NVOCC, and we maintain separate bonds and licenses for each. We operate as a U.S. Department of Homeland Security certified IAC, providing air freight services, subject to commercial standards set forth by the IATA and federal regulations issued by the TSA. We provide customs brokerage services as a customs broker under a license issued by CBP, and we maintain CTPAT certification with CBP. Some customs entries fall within the jurisdiction of other authoritative governmental agencies (e.g., Food and Drug Administration, Fish and Wildlife Service, etc.). We also have and maintain other licenses as required by law.\nWe source fresh produce under a license issued by the USDA as required by PACA. We are also subject to various regulations and requirements promulgated by other international, domestic, state, and local agencies and port authorities. Our failure to comply with the laws and regulations applicable to entities holding these licenses could materially and adversely affect our results of operations or financial condition.\nLegislative or regulatory changes can affect the economics of the transportation industry by requiring changes in operating practices or influencing the demand for, and the cost of providing, transportation services. As part of our logistics services, we operate owned or leased warehouse facilities. Our operations at these facilities include both warehousing and distribution services, and we are subject to various federal, state, and international environmental, work safety, and hazardous materials regulations. We may experience an increase in operating costs, such as security costs, as a result of governmental regulations that have been or will be adopted in response to terrorist activities and potential terrorist activities. No assurances can be given that we will be able to pass these increased costs on to our customers in the form of rate increases or surcharges, and our operations and profitability may be materially and adversely affected as a result. \nUnited States Department of Homeland Security regulations applicable to our customers that import goods into the United States and our contracted ocean carriers can impact our ability to provide and/or receive services with and from these parties. \n20\nTable of Contents\nEnforcement measures related to violations of these regulations can slow and/or prevent the delivery of shipments, which may negatively impact our operations.\nWe cannot predict the impact future regulations may have on our business. Our failure to maintain required permits or licenses, or to comply with applicable regulations, could result in substantial fines or revocation of our operating permits and licenses.\nOur contracted transportation providers are subject to increasingly stringent laws protecting the environment, including transitional risks relating to climate change, which could directly or indirectly have a material adverse effect on our business. \nFuture and existing environmental regulatory requirements, including evolving transportation technology, in the United States and abroad could adversely affect operations and increase operating expenses, which in turn could increase our purchased transportation costs. We may also incur expenses as a result of regulators requiring additional climate-related disclosures regarding our contracted transportation providers that may be labor-intensive to report on. Until the timing, scope, and extent of such possible regulation becomes finalized, we cannot predict its effect on our company, but if we are unable to pass such costs along to our customers, our business could be materially and adversely affected. Even without any new legislation or regulation, increased public concern regarding greenhouse gas emissions by transportation carriers could harm the reputations of companies operating in the transportation and logistics industries and shift consumer demand toward more locally-sourced products and away from our services. \nGeneral risk factors\nWe may be subject to negative impacts of changes in political and governmental conditions.\n Our operations may be subject to the influences of significant political, governmental, and similar changes and our ability to respond to them, including:\n•\nchanges in political conditions and in governmental policies;\n•\nchanges in and compliance with international and domestic laws and regulations; and\n•\nwars, civil unrest, acts of terrorism, and other conflicts such as the current conflict in the Red Sea, which is impacting the global freight market.\nWe may be subject to negative impacts of catastrophic events.\n A disruption or failure of our systems or operations in the event of a major earthquake, weather event, cyber attack, heightened security measures, actual or threatened terrorist attack, strike, civil unrest, pandemic, or other catastrophic event could cause delays in providing services or performing other critical functions. We are particularly vulnerable to these risks given the broad and global scope of our operations. A catastrophic event that results in the destruction or disruption of any of our critical business or information systems could harm our ability to conduct normal business operations and adversely impact our operating results.",
    "item1b": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone.",
    "item1c": "ITEM 1C. CYBERSECURITY\nCybersecurity Risk Management and Strategy\nOur global reach and the ever-evolving threat landscape makes data security and privacy a critical priority for us. Our Chief Information Security Officer and their global cybersecurity team reports to our Chief Technology Officer and together, they are responsible for our network security, cybersecurity risk management processes, and business continuity. This team partners with leaders from all our global regions to align our cybersecurity risk management processes and strategic goals with our business priorities and ultimately mitigate cybersecurity risk at C.H. Robinson. \nOur global cybersecurity team has experience and expertise with potential cybersecurity threats and supporting mitigation of the potential cybersecurity threats facing our organization and vulnerabilities facing our technology infrastructure. \nOur Director of Cybersecurity and Technology Risk Management has over a decade of experience leading cyber security oversight, and others on our global cybersecurity team have cybersecurity experience or certifications, such as the Certified Information Systems Security Professional, CompTIA, Offensive Security Certified Professional, Certificate of Cloud Security Knowledge, Global Information Assurance Certification, Certified Incident Handler certifications.\n We view cybersecurity as a shared responsibility, and we periodically perform simulations and tabletop exercises at a management level and incorporate external resources and advisors as needed. All employees are required to complete cybersecurity trainings at least once a year and have access to more frequent cybersecurity trainings. We also require employees in certain roles to complete additional role-based, specialized \n21\nTable of Contents\ncybersecurity trainings. Program performance is reported to and monitored by senior leadership and the Audit Committee on a quarterly basis.\nThe Company maintains an Enterprise Risk Management (“ERM”) program, which includes processes for key risk identification, mitigation efforts, and day-to-day management of risks, including cybersecurity risks. The ERM program is administered by our Internal Audit department and involves our global cybersecurity team, which possesses significant knowledge and expertise in the area of cybersecurity risks.\n \nOur global cybersecurity team helps ensure the cybersecurity risks identified from the ERM program are incorporated into our overall cybersecurity program.\n Programs to address key cybersecurity risks have been put into place including layered coverage with focus areas and practices designed to address network and endpoint security, application security, and security operations. We also employ automated detection and event correlation techniques and alerting as well as integrate cyber threat intelligence into our processes. Our security operations center serves as the front line of these alerts and investigates and remediates threats as necessary. We also perform regular vulnerability assessments and penetration tests. Although it is difficult to determine the potential impacts from a cybersecurity incident, we may experience negative impacts such as reputational harm, inability to retain existing customers or attract new customers, exposure to legal claims and government action, among others. \nPrevious attacks on our operating systems have not had a material financial impact on our operations, but we cannot guarantee future attacks will have little to no impact on our business.\n Furthermore, given the interconnected nature of the supply chain and our significant presence in the industry, we believe we may be an attractive target for such attacks. The impact of a cybersecurity incident may have a material adverse impact on our financial condition, results of operations, availability of our systems, and growth prospects, which makes cybersecurity risk management of critical importance to our organization.\nAlthough we have internally developed the majority of our line of business applications, we also rely on technology provided by third parties. We have processes in place to oversee and identify risks from cybersecurity threats associated with the use of third-party technology including third-party risk management, process and partner intake risk assessments, and dedicated procurement functions. These processes help mitigate the risks associated with utilizing external technology platforms and help prevent disruptions to our business operations.\n \nWe also involve external cybersecurity experts to assess our cybersecurity program, risk management, and relevant internal controls.\n In addition to our cybersecurity programs and policies, the Company also purchases a cybersecurity risk insurance policy to limit its exposure to cybersecurity incidents.\nWe have processes and programs in place to meet our global compliance obligations and work with our employees and teams across the globe to ensure security and data protection principles are integrated into the way we do business every day. We utilize a set of controls that integrate guidance from the EU’s General Data Protection Regulations and align with the U.S. National Institute of Standards and Technology’s (“NIST”) framework. We undergo a regular independent assessment of our operational and strategic maturity across NIST controls and summary performance is shared with senior leadership including our board of directors. In addition, we submit to independent assessments by external parties, including System and Organizational Controls (“SOC”) 2 Type 2 audits, covering customer-facing and line-of-business applications to ensure all safeguards function as they should. These functions are also supported by internal compliance teams that perform additional layers of testing prior to SOC 2 Type 2 procedures.\nOur Technology Continuity program follows industry standards for disaster recovery practices, including close alignment with ISO 27031:2011 and the Disaster Recovery Institute International’s Professional Practices. Our program includes multiple components that act as an additional line of defense—among them are regular functional recovery and tabletop exercises; cybersecurity exercises; protected backups for critical data; recovery time objectives; and recovery point objectives, including achievability metrics, application criticality tiering, program audit and maintenance, awareness and training, business impact analysis, and risk evaluation and controls.\nCybersecurity Governance\nThe \nBoard of Directors\n is tasked with oversight of the Company’s cybersecurity, information governance, and privacy programs. \nThe \nAudit Committee\n oversees our ERM program and receives semi-annual ERM updates, which include cyber-related risk items.\n In addition, our Audit Committee receives quarterly reports on cybersecurity from our \nChief Technology Officer and our Director of Cybersecurity and Technology Risk Management\n. Our Director of Cybersecurity and Technology Risk Management and their global cybersecurity team has experience and expertise with potential cybersecurity threats and supporting mitigation of the potential cybersecurity threats facing our organization and vulnerabilities facing our technology infrastructure.\nWe have also established a cross-functional project team of subject matter experts from across the organization to quickly analyze, mitigate, and remediate potential cybersecurity incidents or vulnerabilities and comply with cybersecurity related \n22\nTable of Contents\nreporting requirements. The details of any such cybersecurity incidents or threats are included in the quarterly reports to the Audit Committee."
  }
}