{
  "ticker": "CHTR",
  "cik": "0001091667",
  "company_name": "CHARTER COMMUNICATIONS, INC. /MO/",
  "filing_date": "2025-01-31",
  "accession": "0001091667-25-000034",
  "primary_doc": "chtr-20241231.htm",
  "item_sections": {
    "item1": "Item 1. Business – Our Network Technology.”  We believe that our properties are generally in good operating condition and are suitable for our business operations. \nItem 3.  \nLegal Proceedings.\n \nThe legal proceedings information set forth in Note 19 to the accompanying consolidated financial statements contained in “Part II. Item 8. Financial Statements and Supplementary Data” in this Annual Report on Form 10-K is incorporated herein by reference.  Within this section, we use a threshold of $1 million in disclosing environmental proceedings involving a governmental authority, if any.\nItem 4.  \nMine Safety Disclosures.\nNot applicable.\n32\nPART II\nItem 5.  \nMarket for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\n \nCharter’s Class A common stock is listed on the NASDAQ Global Select Market under the symbol “CHTR.”  As of December 31, 2024, there were approximately 8,700 holders of record of Charter’s Class A common stock and one holder of Charter's Class B common stock.  Charter has not paid cash dividends on its common stock and does not intend to do so in the foreseeable future.  During 2024, there were no unregistered sales of securities of the registrant.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nThe following information is provided as of December 31, 2024 with respect to Charter's equity compensation plans.\nPlan Category\nNumber of Securities to be Issued Upon Exercise of Outstanding Options, Warrants and Rights\nWeighted Average Exercise Price of Outstanding Warrants and Rights\nNumber of Securities Remaining Available for Future Issuance Under Equity Compensation Plans\nEquity compensation plans approved by security holders\n16,324,594 \n(1)\n$\n395.53 \n10,201,512 \n(1)\nEquity compensation plans not approved by security holders\n— \n$\n— \n— \nTOTAL\n16,324,594 \n(1)\n10,201,512 \n(1)\n \n(1)\n    This total does not include 13,353 shares issued pursuant to restricted stock grants made under Charter's 2019 Stock Incentive Plan, which are subject to vesting based on continued service. \nFor information regarding securities issued under Charter's equity compensation plans, see Note 15 to our accompanying consolidated financial statements contained in “Part II. Item 8. Financial Statements and Supplementary Data.” \nPerformance Graph\nThe performance graph required by Item 5 will be included in Charter’s 2025 Proxy Statement (the “Proxy Statement”) under the heading “Compensation Discussion and Analysis” or in an amendment to this Annual Report on Form 10-K and is incorporated herein by reference.\nPurchases of Equity Securities by the Issuer\nThe following table presents Charter’s purchases of equity securities completed during the fourth quarter of 2024 (dollars in millions, except per share data).\nPeriod\nTotal Number of Shares Purchased \n(1)\nAverage Price Paid per Share\nTotal Number of Shares Purchased as Part of Publicly Announced Plans or Programs \n(2)\nApproximate Dollar Value of Shares that May Yet Be Purchased Under the Plans or Programs \n(2)\nOctober 1 - 31, 2024\n13,294\n$\n331.00 \n10,400 \n$742\nNovember 1 - 30, 2024\n95,354\n$\n386.87 \n16,078 \n$870\nDecember 1 - 31, 2024\n275,703\n$\n391.09 \n256,069 \n$961\n(1)\nIncludes 2,894, 79,276 and 19,634 shares withheld from employees for the payment of taxes and exercise costs upon the exercise of stock options or vesting of other equity awards for the months of October, November and December 2024, respectively.\n(2)\nDuring the three months ended December 31, 2024, Charter purchased approximately 0.3 million shares of its Class A common stock for approximately $109 million from Liberty Broadband at an average price per share of $384.85.  Charter Holdings purchased approximately 9 thousand Charter Holdings common units from A/N at an average price per unit of \n33\n$346.05, or $4 million during the three months ended December 31, 2024.  As of December 31, 2024, Charter had remaining board authority to purchase an additional $961 million of Charter’s Class A common stock and/or Charter Holdings common units, excluding purchases from Liberty Broadband.  In addition to open market purchases including pursuant to Rule 10b5-1 plans adopted from time to time, Charter may also buy shares of Charter Class A common stock, from time to time, pursuant to private transactions outside of its Rule 10b5-1 plan and any such repurchases may also trigger the repurchases from A/N pursuant to and to the extent provided in the A/N Letter Agreement or Liberty pursuant to the Existing LBB Letter Agreement, as amended.  See \"Part II. Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations — Liquidity and Capital Resources.\"\nItem 6.  \n[Reserved]\n \nNot applicable.  \n Item 7.  \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations.\n \nReference is made to “Part I.",
    "item1a": "Item 1A. Risk Factors — The agreements and instruments governing our debt contain restrictions and limitations that could significantly affect our ability to operate our business, as well as significantly affect our liquidity.”\nRecently Issued Accounting Standards\n \nSee Note 21 to the accompanying consolidated financial statements contained in “Part II. Item 8. Financial Statements and Supplementary Data” for a discussion of recently issued accounting standards.\nItem 7A.\n \n    \nQuantitative and Qualitative Disclosures About Market Risk.\n \nCross-currency derivative instruments are used to manage foreign exchange risk on the Sterling Notes by effectively converting £1.275 billion aggregate principal amount of fixed-rate British pound sterling denominated debt, including annual interest payments and the payment of principal at maturity, to fixed-rate U.S. dollar denominated debt. The fair value of our cross-currency derivatives included in other long-term liabilities on our consolidated balance sheets was $504 million and $440 million as of December 31, 2024 and 2023, respectively.  For more information, see Note 12 to the accompanying consolidated financial statements contained in “Part II. Item 8. Financial Statements and Supplementary Data.”\nAs of December 31, 2024 and 2023, the weighted average interest rate on the credit facility debt was approximately 6.3% and 7.0%, respectively, and the weighted average interest rate on the senior notes was approximately 5.0% and 5.0%, respectively, resulting in a blended weighted average interest rate of 5.2% and 5.3%, respectively.  The interest rate on approximately 89% and 86% of the total principal amount of our debt was fixed as of December 31, 2024 and 2023, respectively. \n48\nThe table set forth below summarizes the fair values and contract terms of financial instruments subject to interest rate risk maintained by us as of December 31, 2024 (dollars in millions): \n2025\n2026\n2027\n2028\n2029\nThereafter\nTotal\nFair Value \nDebt:\nFixed Rate\n$\n1,800 \n$\n1,850 \n$\n3,250 \n$\n4,750 \n$\n7,000 \n$\n64,795 \n$\n83,445 \n$\n72,777 \nAverage Interest Rate\n4.91 \n%\n5.89 \n%\n5.13 \n%\n4.53 \n%\n5.13 \n%\n5.05 \n%\n5.05 \n%\nVariable Rate\n$\n305 \n$\n305 \n$\n304 \n$\n642 \n$\n279 \n$\n8,499 \n$\n10,334 \n$\n10,079 \nAverage Interest Rate\n5.47 \n%\n5.36 \n%\n5.37 \n%\n5.41 \n%\n5.39 \n%\n5.79 \n%\n5.72 \n%\nInterest rates on variable-rate debt are estimated using the average implied forward SOFR for the year of maturity based on the yield curve in effect at December 31, 2024 including applicable bank spread. \nItem 8.  \nFinancial Statements and Supplementary Data.\n \nOur consolidated financial statements, the related notes thereto, and the reports of independent registered public accounting firm are included in this annual report beginning on page F-1. \nItem 9.  \nChanges in and Disagreements with Accountants on Accounting and Financial Disclosure.\n \nNone.\nItem 9A.  \nControls and Procedures.\nConclusion Regarding the Effectiveness of Disclosure Controls and Procedures\nAs of the end of the period covered by this report, under the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, we have evaluated the effectiveness of the design and operation of disclosure controls and procedures with respect to the information generated for use in this annual report.  The evaluation was based upon reports and certifications provided by a number of executives.  Based on, and as of the date of that evaluation, our Chief Executive Officer and Chief Financial Officer concluded that the disclosure controls and procedures were effective to provide reasonable assurances that information required to be disclosed in the reports we file or submit under the Securities Exchange Act of 1934 is recorded, processed, summarized and reported within the time periods specified in the SEC’s rules and forms. \nIn designing and evaluating the disclosure controls and procedures, our management recognized that any controls and procedures, no matter how well designed and operated, can provide only reasonable, not absolute, assurance of achieving the desired control objectives, and management necessarily was required to apply its judgment in evaluating the cost-benefit relationship of possible controls and procedures.  Based upon the above evaluation, we believe that our controls provide such reasonable assurances.\nIn October 2024, we completed the implementation of a Human Capital Management platform which improved the efficiency of certain personnel and related transactional processes.  As a result of the implementation of the Human Capital Management platform, we designed, implemented and are operating new information technology general controls, and revised and updated certain process-level controls.\nExcept as described above in the preceding paragraph, during the quarter ended December 31, 2024, there was no change in our internal control over financial reporting that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.\nManagement’s Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) under the Exchange Act) for the company.  Our internal control system was designed to provide reasonable assurance to our management and Board of Directors regarding the preparation and fair presentation of published financial statements. \n49\nManagement has assessed the effectiveness of our internal control over financial reporting as of December 31, 2024.  In making this assessment, we used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (“COSO”) in \nInternal Control — Integrated Framework \n(2013)\n.  \nBased on management’s assessment utilizing these criteria we believe that, as of December 31, 2024, our internal control over financial reporting was effective\n.\nOur independent auditors, KPMG LLP, have audited our internal control over financial reporting as stated in their report as follows.\n50\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and Board of Directors\nCharter Communications, Inc.:\nOpinion on Internal Control Over Financial Reporting\nWe have audited Charter Communications, Inc. and subsidiaries' (the Company) internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control – Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control – Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of December 31, 2024 and December 31, 2023, the related consolidated statements of operations, changes in shareholders’ equity, and cash flows for each of the years in the three-year period ended December 31, 2024, and the related notes (collectively, the consolidated financial statements), and our report dated January 30, 2025 expressed an unqualified opinion on those consolidated financial statements.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management's Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audit also included performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n(signed) KPMG LLP\nSt. Louis, Missouri\nJanuary 30, 2025\n51\nItem 9B.  \nOther Information\n.\nOn \nNovember 21, 2024\n, \nRichard DiGeronimo\n, \nPresident, Product and Technology\n, \nadopted\n a trading plan intended to satisfy the affirmative defense of Rule 10b5-1(c) to sell up to \n57,531\n shares of Charter Class A common stock between February 19, 2025 and January 30, 2026, subject to certain conditions.\n \nOn January 29, 2025, Charter entered into an employment agreement (the “Fischer Employment Agreement”) with Jessica Fischer, our Chief Financial Officer.\nThe Fischer Employment Agreement, which is effective as of February 5, 2025, has a term ending February 5, 2027 (or upon an earlier termination of employment) and provides that Ms. Fischer will continue to serve as Chief Financial Officer. The Fischer Employment Agreement provides that Ms. Fischer will receive an annual base salary of at least $925,000 and a target annual cash bonus opportunity of 175% of her annual base salary. \nMs. Fischer will also continue to participate in Charter’s employee benefit plans and receive perquisites as generally provided to other senior executives of Charter. In addition, consistent with Ms. Fischer’s prior employment agreement, Charter will continue to reimburse Ms. Fischer for all reasonable and necessary expenses incurred in connection with the performance of her duties. \nIf the employment of Ms. Fischer is terminated involuntarily by us without cause or by her for good reason, she would be entitled to (a) a cash severance payment equal to two times the sum of her annual base salary and target annual bonus opportunity for the year in which the termination occurs, (b) a cash payment equal to the cost of COBRA coverage for 24 months, and (c) outplacement services for up to 12 months. \nThe termination benefits described above are subject to Ms. Fischer’s execution of a release of claims in favor of Charter and its affiliates. In addition, Ms. Fischer has agreed to comply with covenants concerning non-disclosure of confidential information, assignment of intellectual property and non-disparagement of Charter and, for two years following termination, covenants concerning non-competition and non-solicitation of customers of Charter and its affiliates and, for one year following termination, covenants concerning non-solicitation of employees of Charter and its affiliates.\nA copy of the Fischer Employment Agreement is filed herewith as Exhibit 10.72(b). The foregoing description of the Fischer Employment Agreement does not purport to be complete and is qualified in its entirety by reference to the full text of that document.\nItem 9C.\n  Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNot applicable.\n52\nPART III\nItem 10.\n  Directors, Executive Officers and Corporate Governance. \nThe information required by Item 10 will be included in the Proxy Statement under the headings “Proposal No. 1: Election of Directors,” “Delinquent Section 16(a) Reports,” “Code of Ethics” and “Insider Trading Arrangements and Policies” or in an amendment to this Annual Report on Form 10-K and is incorporated herein by reference.\nItem 11.  \nExecutive Compensation. \n  \nThe information required by Item 11 will be included in the Proxy Statement under the headings “Compensation Discussion and Analysis,” “Proposal No. 1: Election of Directors – 2024 Director Compensation,” “Compensation Committee Interlocks and Insider Participation” and “Report of the Compensation and Benefits Committee” or in an amendment to this Annual Report on Form 10-K and is incorporated herein by reference.  Information contained in the Proxy Statement or an amendment to this Annual Report on Form 10-K under the caption “Report of the Compensation and Benefits Committee” is furnished and not deemed filed with the SEC.\nItem 12.  \nSecurity Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters. \n  \nThe information required by Item 12 will be included in the Proxy Statement under the heading “Certain Beneficial Owners of Charter Class A Common Stock” or in an amendment to this Annual Report on Form 10-K and is incorporated herein by reference.\nItem 13. \n Certain Relationships and Related Transactions, and Director Independence. \n  \nThe information required by Item 13 will be included in the Proxy Statement under the headings “Certain Relationships and Related Transactions” and “Proposal No. 1: Election of Directors” or in an amendment to this Annual Report on Form 10-K and is incorporated herein by reference.\nItem 14.  \nPrincipal Accountant Fees and Services\n. \n  \nThe information required by Item 14 will be included in the Proxy Statement under the heading “Accounting Matters” or in an amendment to this Annual Report on Form 10-K and is incorporated herein by reference.\n53\nPART IV\nItem 15.  \nExhibits and Financial Statement Schedules.\n(a)    The following documents are filed as part of this annual report:\n(1)    Financial Statements.\nA listing of the financial statements, notes and reports of independent public accountants required by \"Part II. Item 8. Financial Statements and Supplementary Data\" begins on page F-1 of this annual report.\n(2)    Financial Statement Schedules.\nNo financial statement schedules are required to be filed by Items 8 and 15(c) because they are not required or are not applicable, or the required information is set forth in the applicable financial statements or notes thereto.\n(3)    The index to the exhibits begins on page E-1 of this annual report.\nItem 16.  \nForm 10-K Summary.\nNone.\n54\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, Charter Communications, Inc. has duly caused this annual report to be signed on its behalf by the undersigned, thereunto duly authorized. \nCHARTER COMMUNICATIONS, INC.,\nRegistrant\nBy:\n/s/ Christopher L. Winfrey\nChristopher L. Winfrey\nPresident and Chief Executive Officer\nDate: January 31, 2025\nS-1\nPOWER OF ATTORNEY\nKNOW ALL MEN BY THESE PRESENTS, that each person whose signature appears below constitutes and appoints Jamal H. Haughton and Kevin D. Howard, and each of them (with full power to each of them to act alone), his or her true and lawful attorney-in-fact and agent, with full power of substitution and resubstitution, for him or her and in his or her name, place and stead, in any and all capacities, to sign on his or her behalf individually and in each capacity stated below any and all amendments (including post-effective amendments) to this annual report, and to file the same, with all exhibits thereto and other documents in connection therewith, with the Securities and Exchange Commission, granting unto said attorneys-in-fact and agents, and each of them, full power and authority to do and perform each and every act and thing requisite and necessary to be done in and about the premises, as fully to all intents and purposes as he or she might or could do in person, hereby ratifying and confirming all that said attorneys-in-fact and agents and either of them, or their substitutes, may lawfully do or cause to be done by virtue hereof.\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of Charter Communications, Inc. and in the capacities and on the dates indicated.\n \nSignature\nTitle\nDate\n/s/ Christopher L. Winfrey\nPresident and Chief Executive Officer, Director\nJanuary 31, 2025\nChristopher L. Winfrey\n(Principal Executive Officer)\n/s/ Jessica M. Fischer\nChief Financial Officer (Principal Financial Officer)\nJanuary 31, 2025\nJessica M. Fischer\n/s/ Kevin D. Howard\nExecutive Vice President, Chief Accounting Officer\nJanuary 31, 2025\nKevin D. Howard\nand Controller (Principal Accounting Officer)\n/s/ Eric L. Zinterhofer\nNon-Executive Chairman of the Board (Director)\nJanuary 31, 2025\nEric L. Zinterhofer\n/s/ W. Lance Conn\nDirector\nJanuary 31, 2025\nW. Lance Conn\n/s/ Kim C. Goodman\nDirector\nJanuary 31, 2025\nKim C. Goodman\n/s/ Gregory Maffei\nDirector\nJanuary 31, 2025\nGregory Maffei\n/s/ John D. Markley, Jr.\nDirector\nJanuary 31, 2025\nJohn D. Markley, Jr.\n/s/ David C. Merritt\nDirector\nJanuary 31, 2025\nDavid C. Merritt\n/s/ James E. Meyer\nDirector\nJanuary 31, 2025\nJames E. Meyer\n/s/ Steve Miron\nDirector\nJanuary 31, 2025\nSteve Miron\n/s/ Balan Nair\nDirector\nJanuary 31, 2025\nBalan Nair\n/s/ Michael Newhouse\nDirector\nJanuary 31, 2025\nMichael Newhouse\n/s/ Mauricio Ramos\nDirector\nJanuary 31, 2025\nMauricio Ramos\n/s/ Carolyn J. Slaski\nDirector\nJanuary 31, 2025\nCarolyn J. Slaski\nS-2\nExhibit Index\nExhibits are listed by numbers corresponding to the Exhibit Table of Item 601 in Regulation S-K.\n \nExhibit\nDescription\n2.1\nAgreement and Plan of Mergers, dated as of May 23, 2015, among Time Warner Cable Inc., Charter Communications, Inc., CCH I, LLC, Nina Corporation I, Inc., Nina Company II, LLC and Nina Company III, LLC (incorporated by reference to Exhibit 2.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on May 29, 2015 (File No. 001-33664)).\n2.2\nContribution Agreement, dated March 31, 2015, by and among Advance/Newhouse Partnership, A/NPC Holdings LLC, Charter Communications, Inc., CCH I, LLC, and Charter Communications Holding Company, LLC (incorporated by reference to Exhibit 2.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on April 1, 2015 (File No. 001-33664)).\n2.3\nAgreement and Plan of Merger, dated as of November 12, 2024, by and among Charter Communications, Inc., Liberty Broadband Corporation, Fusion Merger Sub 1, LLC and Fusion Merger Sub 2, Inc. (incorporated by reference to Exhibit 2.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on November 13, 2024 (File No. 001-33664)).\n3.1\nAmended and Restated Certificate of Incorporation of Charter Communications, Inc. dated as of May 18, 2016, as amended by Certificate of Amendment to Amended and Restated Certificate of Incorporation of Charter Communications, Inc., dated as of April 23, 2024  (incorporated by reference to Exhibit 3.1 to the Quarterly Report on Form 10-Q filed by Charter Communications, Inc. on July 26, 2024 (File No. 001-33664)).\n3.2\nAmended and Restated By-laws of Charter Communications, Inc. as of October 24, 2023 (incorporated by reference to Exhibit 3.1 to the Quarterly Report on Form 10-Q filed by Charter Communications, Inc. on October 27, 2023 (File No. 001-33664)).\n4.1(a)\nSecond Amended and Restated Stockholders Agreement, dated May 23, 2015, by and among Charter Communications, Inc., CCH I, LLC, Liberty Broadband Corporation and Advance/Newhouse Partnership (incorporated by reference to Annex C to the Registration Statement on Form S-4 filed by CCH I, LLC on June 26, 2015 (File No. 333-205240)).\n4.1(b)\nAmendment No. 1 to the Second Amended and Restated Stockholders Agreement and the Letter Agreement, dated as of November 12, 2024, by and among Charter Communications, Inc., Advance/Newhouse Partnership and Liberty Broadband Corporation (incorporated by reference to Exhibit 10.3 to the Current Report on Form 8-K filed by Charter Communications, Inc. on November 13, 2024 (File No. 001-33664)).\n4.2\nCharter Communications, Inc. Retirement Accumulation Plan (incorporated by reference to Exhibit 4.3 to the Registration Statement on Form S-8 filed by Charter Communications, Inc. on March 28, 2024 (File No. 001-33664)).\n4.3\nIndenture dated as of November 5, 2014, by and among CCO Holdings, LLC, CCO Holdings Capital Corp. and CCOH Safari, LLC, as Issuers, Charter Communications, Inc., as Parent Guarantor, and The Bank of New York Mellon Trust Company, N.A., as Trustee (incorporated by reference to Exhibit 4.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on November 10, 2014 (File No. 001-33664)).\n4.4\nIndenture, dated as of July 23, 2015, among Charter Communications Operating, LLC, Charter Communications Operating Capital Corp. and CCO Safari II, LLC, as issuers, and The Bank of New York Mellon Trust Company, N.A., as trustee and collateral agent (incorporated by reference to Exhibit 4.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on July 27, 2015 (File No. 001-33664)).\n4.5\nFirst Supplemental Indenture, dated as of July 23, 2015, among CCO Safari II, LLC, as escrow issuer, CCH II, LLC, as limited guarantor, and The Bank of New York Mellon Trust Company, N.A., as trustee and collateral agent (incorporated by reference to Exhibit 4.2 to the Current Report on Form 8-K filed by Charter Communications, Inc. on July 27, 2015 (File No. 001-33664)).\n4.6\nForm of 4.908% Senior Secured Notes due 2025 (incorporated by reference to Exhibit 4.5 to the Current Report on Form 8-K filed by Charter Communications, Inc. on July 27, 2015 (File No. 001-33664)).\n4.7\nForm of 6.384% Senior Secured Notes due 2035 (incorporated by reference to Exhibit 4.6 to the Current Report on Form 8-K filed by Charter Communications, Inc. on July 27, 2015 (File No. 001-33664)).\n4.8\nForm of 6.484% Senior Secured Notes due 2045 (incorporated by reference to Exhibit 4.7 to the Current Report on Form 8-K filed by Charter Communications, Inc. on July 27, 2015 (File No. 001-33664)).\n4.9\nForm of 6.834% Senior Secured Notes due 2055 (incorporated by reference to Exhibit 4.8 to the Current Report on Form 8-K filed by Charter Communications, Inc. on July 27, 2015 (File No. 001-33664)).\n4.10\nIndenture, dated as of November 20, 2015, among CCO Holdings, LLC, CCO Holdings Capital Corp. and CCOH Safari, LLC, as issuers, and The Bank of New York Mellon Trust Company, N.A., as trustee (incorporated by reference to Exhibit 4.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on November 25, 2015 (File No. 001-33664)).\nE-1\n4.11\nSeventh Supplemental Indenture, dated as of April 21, 2016, among CCO Holdings, LLC, CCO Holdings Capital Corp., Charter Communications, Inc., as guarantor, and The Bank of New York Mellon Trust Company, N.A., as trustee (incorporated by reference to Exhibit 4.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on April 27, 2016 (File No. 001-33664)).\n4.12\nForm of 5.500% Senior Notes due 2026 (incorporated herein by reference to Exhibit 4.2 to the Current Report on Form 8-K of Charter Communications, Inc. filed April 27, 2016).\n4.13\nSecond Supplemental Indenture, dated as of May 18, 2016, by and among Charter Communications Operating, LLC, Charter Communications Operating Capital Corp., CCO Safari II, LLC and The Bank of New York Mellon Trust Company, N.A., as trustee and collateral agent (incorporated by reference to Exhibit 4.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on May 24, 2016 (File No. 001-33664)).\n4.14\nThird Supplemental Indenture, dated as of May 18, 2016, by and among CCO Holdings, LLC, the subsidiary guarantors party thereto and The Bank of New York Mellon Trust Company, N.A., as trustee and collateral agent (incorporated by reference to Exhibit 4.2 to the Current Report on Form 8-K filed by Charter Communications, Inc. on May 24, 2016 (File No. 001-33664)).\n4.15\nSecond Supplemental Indenture, dated as of May 18, 2016, by and among CCO Holdings, LLC, CCO Holdings Capital Corp., CCOH Safari, LLC and The Bank of New York Mellon Trust Company, N.A., as trustee (incorporated by reference to Exhibit 4.3 to the Current Report on Form 8-K filed by Charter Communications, Inc. on May 24, 2016 (File No. 001-33664)).\n4.16\nFourth Supplemental Indenture, dated as of November 1, 2016, among Charter Communications Operating, LLC, Charter Communications Operating Capital Corp., as issuers, CCO Holdings, LLC, as parent guarantor, the subsidiary guarantors party thereto and The Bank of New York Mellon Trust Company, N.A., as trustee and collateral agent (incorporated by reference to Exhibit 4.5 to Registration Statement on Form S-4 filed by CCO Holdings, LLC on October 6, 2017 (File No. 333-220863)).\n4.17\nThird Supplemental Indenture, dated as of February 6, 2017, among CCO Holdings, LLC, CCO Holdings Capital Corp., and The Bank of New York Mellon Trust Company, N.A., as trustee (incorporated herein by reference to Exhibit 4.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on February 6, 2017 (File No. 001-33664)).\n4.18\nForm of 5.125% Senior Notes due 2027 (incorporated herein by reference to Exhibit 4.2 to the Current Report on Form 8-K filed by Charter Communications, Inc. on February 6, 2017 (File No. 001-33664))\n4.19\nFifth Supplemental Indenture, dated as of April 20, 2017, among Charter Communications Operating, LLC, Charter Communications Operating Capital Corp., the guarantors party thereto and The Bank of New York Mellon Trust Company, N.A., as trustee and collateral agent (incorporated by reference to Exhibit 4.3 to the Current Report on Form 8-K filed by Charter Communications, Inc. on April 26, 2017 (File No. 001-33664)).\n4.20\nForm of 5.375% Senior Secured Notes due 2047 (incorporated by reference to Exhibit 4.4 to the Current Report on Form 8-K filed by Charter Communications, Inc. on April 26, 2017 (File No. 001-33664))\n4.21\nSixth Supplemental Indenture, dated as of July 6, 2017, among Charter Communications Operating, LLC, Charter Communications Operating Capital Corp., the guarantors party thereto and The Bank of New York Mellon Trust Company, N.A., as trustee and collateral agent (incorporated by reference to Exhibit 4.3 to the \nCurrent Report\n on Form 8-K filed by Charter Communications, Inc. on July 12, 2017 (File No. 001-33664)).\n4.22\nForm of 3.750% Senior Secured Notes due 2028 (incorporated by reference to Exhibit 4.4 to the Current Report on Form 8-K filed by Charter Communications, Inc. on July 12, 2017 (File No. 001-33664)).\n4.23\nFourth Supplemental Indenture, dated as of August 8, 2017, among CCO Holdings, LLC, CCO Holdings Capital Corp. and The Bank of New York Mellon Trust Company, N.A., as trustee (incorporated by reference to Exhibit 4.1 to the \nCurrent Report\n on Form 8-K filed by Charter Communications, Inc. on August 14, 2017 (File No. 001-33664)).\n4.24\nForm of 5.000% Senior Notes due 2028 (incorporated by reference to Exhibit 4.2 to the Current Report on Form 8-K filed by Charter Communications, Inc. on August 14, 2017 (File No. 001-33664)).\n4.25\nSeventh Supplemental Indenture, dated as of September 18, 2017, among Charter Communications Operating, LLC, Charter Communications Operating Capital Corp., the guarantors party thereto and The Bank of New York Mellon Trust Company, N.A., as trustee and collateral agent (incorporated by reference to Exhibit 4.3 to the \nCurrent Report\n on Form 8-K filed by Charter Communications, Inc. on September 21, 2017 (File No. 001-33664)).\n4.26\nForm of 4.200% Senior Secured Notes due 2028 (incorporated by reference to Exhibit 4.4 to the Current Report on Form 8-K filed by Charter Communications, Inc. on September 21, 2017 (File No. 001-33664)).\n4.27\nEighth Supplemental Indenture, dated as of December 21, 2017, among Charter Communications Operating, LLC, Charter Communications Operating Capital Corp., CCO Holdings, LLC, the subsidiary guarantor parties thereto and The Bank of New York Mellon Trust Company, N.A., as trustee (incorporated by reference to Exhibit 4.5 to Form S-3 filed by Charter Communications, Inc. on December 22, 2017 (File No. 333-222241)).\nE-2\n4.28\nNinth Supplemental Indenture, dated as of April 17, 2018, among Charter Communications Operating, LLC, Charter Communications Operating Capital Corp., as issuers, CCO Holdings, LLC, the subsidiary guarantors party thereto and The Bank of New York Mellon Trust Company, N.A., as trustee and collateral agent (incorporated by reference to Exhibit 4.2 to the \nCurrent Report\n on Form 8-K filed by Charter Communications, Inc. on April 20, 2018 (File No. 001-33664)).\n4.29\nForm of 5.375% Senior Secured Notes due 2038 (incorporated by reference to Exhibit 4.3 to the Current Report on Form 8-K filed by Charter Communications, Inc. on April 20, 2018 (File No. 001-33664)).\n4.30\nForm of 5.750% Senior Secured Notes due 2048 (incorporated by reference to Exhibit 4.4 to the Current Report on Form 8-K filed by Charter Communications, Inc. on April 20, 2018 (File No. 001-33664)).\n4.31\nEleventh Supplemental Indenture dated as of July 27, 2018 among Charter Communications Operating, LLC, Charter Communications Operating Capital Corp., CCO Holdings, LLC, the subsidiary guarantors party thereto and The Bank of New York Mellon Trust Company, N.A., as trustee and collateral agent (incorporated by reference to Exhibit 4.7 to Form S-3 filed by Charter Communications, Inc. on October 30, 2023 (File No. 333-275214-116)).\n4.32\nTwelfth Supplemental Indenture, dated as of January 17, 2019, among Charter Communications Operating, LLC, Charter Communications Operating Capital Corp., as issuers, CCO Holdings, LLC, the subsidiary guarantors party thereto and The Bank of New York Mellon Trust Company, N.A., as trustee and collateral agent (incorporated by reference to Exhibit 4.4 to the \nCurrent Report\n on Form 8-K filed by Charter Communications, Inc. on January 24, 2019 (File No. 001-33664)).\n4.33\nForm of 5.050% Senior Secured Notes due 2029 (incorporated by reference to Exhibit 4.5 to the Current Report on Form 8-K filed by Charter Communications, Inc. on January 24, 2019 (File No. 001-33664)).\n4.34\nIndenture, dated as of May 23, 2019, among CCO Holdings, LLC, CCO Holdings Capital Corp. and The Bank of New York Mellon Trust Company, N.A., as trustee (incorporated by reference to Exhibit 4.1 to the \nCurrent Report\n on Form 8-K filed by Charter Communications, Inc. on May 30, 2019 (File No. 001-33664)).\n4.35\nFirst Supplemental Indenture, dated as of May 23, 2019, among CCO Holdings, LLC, CCO Holdings Capital Corp. and The Bank of New York Mellon Trust Company, N.A., as trustee (incorporated by reference to Exhibit 4.2 to the \nCurrent Report\n on Form 8-K filed by Charter Communications, Inc. on May 30, 2019 (File No. 001-33664)).\n4.36\nForm of 5.375% Senior Notes due 2029 (incorporated by reference to Exhibit 4.3 to the \nCurrent Report\n on Form 8-K filed by Charter Communications, Inc. on May 30, 2019 (File No. 001-33664)).\n4.37\nThirteenth Supplemental Indenture dated as of June 21, 2019 among Charter Communications Operating, LLC, Charter Communications Operating Capital Corp., as issuers, CCO Holdings, LLC, the subsidiary guarantors party thereto and The Bank of New York Mellon Trust Company, N.A., as trustee and collateral agent (incorporated by reference to Exhibit 4.8 to Form S-3 filed by Charter Communications, Inc. on October 30, 2023 (File No. 333-275214-116)).\n4.38\nFourteenth Supplemental Indenture, dated as of July 10, 2019, among Charter Communications Operating, LLC, Charter Communications Operating Capital Corp., as issuers, CCO Holdings, LLC, the subsidiary guarantors party thereto and The Bank of New York Mellon Trust Company, N.A., as trustee and collateral agent (incorporated by reference to Exhibit 4.5 to the \nCurrent Report\n on Form 8-K filed by Charter Communications, Inc. on July 10, 2019 (File No. 001-33664)).\n4.39\nForm of 5.125% Senior Secured Notes due 2049 (incorporated by reference to Exhibit 4.6 to the \nCurrent Report\n on Form 8-K filed by Charter Communications, Inc. on July 10, 2019 (File No. 001-33664)).\n4.40\nSecond Supplemental Indenture, dated as of October 1, 2019, among CCO Holdings, LLC, CCO Holdings Capital Corp. and The Bank of New York Mellon Trust Company, N.A., as trustee (incorporated by reference to Exhibit 4.2 to the Current Report on Form 8-K filed by Charter Communications, Inc. on October 7, 2019).\n4.41\nForm of 4.750% Senior Notes due 2030 (incorporated by reference to Exhibit 4.3 to the Current Report on Form 8-K filed by Charter Communications, Inc. on October 7, 2019 (File No. 001-33664)).\n4.42\nFifteenth Supplemental Indenture, dated as of October 24, 2019, among Charter Communications Operating, LLC, Charter Communications Operating Capital Corp., as issuers, CCO Holdings, LLC, the subsidiary guarantors party thereto and The Bank of New York Mellon Trust Company, N.A., as trustee and collateral agent (incorporated by reference to Exhibit 4.5 to the Current Report on Form 8-K filed by Charter Communications, Inc. on October 30, 2019 (File No. 001-33664)).\n4.43\nForm of 4.800% Senior Secured Notes due 2050 (incorporated by reference to Exhibit 4.6 to the Current Report on Form 8-K filed by Charter Communications, Inc. on October 30, 2019 (File No. 001-33664)).\n4.44\nThird Supplemental Indenture, dated as of February 18, 2020, among CCO Holdings, LLC, CCO Holdings Capital Corp. and The Bank of New York Mellon Trust Company, N.A., as trustee (incorporated by reference to Exhibit 4.2 to the Current Report on Form 8-K filed by Charter Communications, Inc. on February 21, 2020 (File No. 001-33664)).\n4.45\nForm of 4.500% Senior Notes due 2030 (incorporated by reference to Exhibit 4.3 to the Current Report on Form 8-K filed by Charter Communications, Inc. on February 21, 2020 (File No. 001-33664)).\nE-3\n4.46\nFourth Supplemental Indenture, dated as of March 18, 2020, among CCO Holdings, LLC, CCO Holdings Capital Corp. and The Bank of New York Mellon Trust Company, N.A., as trustee (incorporated by reference to Exhibit 4.4 to the Current Report on Form 8-K filed by Charter Communications, Inc. on March 23, 2020 (File No. 001-33664)).\n4.47\nForm of 4.500% Senior Notes due 2032 (incorporated by reference to Exhibit 4.5 to the Current Report on Form 8-K filed by Charter Communications, Inc. on March 23, 2020 (File No. 001-33664)).\n4.48\nSixteenth Supplemental Indenture, dated as of April 17, 2020, among Charter Communications Operating, LLC, Charter Communications Operating Capital Corp., as issuers, CCO Holdings, LLC, the subsidiary guarantors party thereto and The Bank of New York Mellon Trust Company, N.A., as trustee and collateral agent (incorporated by reference to Exhibit 4.2 to the Current Report on Form 8-K filed by Charter Communications, Inc. on April 17, 2020 (File No. 001-33664)).\n4.49\nForm of 2.800% Senior Secured Notes due 2031 (incorporated by reference to Exhibit 4.3 to the Current Report on Form 8-K filed by Charter Communications, Inc. on April 17, 2020 (File No. 001-33664)).\n4.50\nForm of 3.700% Senior Secured Notes due 2051 (incorporated by reference to Exhibit 4.4 to the Current Report on Form 8-K filed by Charter Communications, Inc. on April 17, 2020 (File No. 001-33664)).\n4.51\nFifth Supplemental Indenture, dated as of July 9, 2020, among CCO Holdings, LLC, CCO Holdings Capital Corp. and The Bank of New York Mellon Trust Company, N.A., as trustee (incorporated by reference to Exhibit 4.2 to the Current Report on Form 8-K filed by Charter Communications, Inc. on July 13, 2020 (File No. 001-33664)).\n4.52\nForm of 4.250% Senior Notes due 2031 (incorporated by reference to Exhibit 4.3 to the Current Report on Form 8-K filed by Charter Communications, Inc. on July 13, 2020 (File No. 001-33664)).\n4.53\nSeventeenth Supplemental Indenture dated as of November 19, 2020 among Charter Communications Operating, LLC, Charter Communications Operating Capital Corp., CCO Holdings, LLC, the subsidiary guarantors party thereto and The Bank of New York Mellon Trust Company, N.A., as trustee and collateral agent (incorporated by reference to Exhibit 4.9 to Form S-3 filed by Charter Communications, Inc. on October 30, 2023 (File No. 333-275214-116)).\n4.54\nEighteenth Supplemental Indenture, dated as of December 4, 2020, among Charter Communications Operating, LLC, Charter Communications Operating Capital Corp., as issuers, CCO Holdings, LLC, the subsidiary guarantors party thereto and The Bank of New York Mellon Trust Company, N.A., as trustee and collateral agent (incorporated by reference to Exhibit 4.3 to the Current Report on Form 8-K filed by Charter Communications, Inc. on December 4, 2020 (File No. 001-33664)).\n4.55\nForm of 2.300% Senior Secured Notes due 2032 (incorporated by reference to Exhibit 4.5 to the Current Report on Form 8-K filed by Charter Communications, Inc. on December 4, 2020 (File No. 001-33664)).\n4.56\nForm of 3.850% Senior Secured Notes due 2061 (incorporated by reference to Exhibit 4.6 to the Current Report on Form 8-K filed by Charter Communications, Inc. on December 4, 2020 (File No. 001-33664)).\n4.57\nNineteenth Supplemental Indenture, dated as of March 4, 2021, among Charter Communications Operating, LLC, Charter Communications Operating Capital Corp., as issuers, CCO Holdings, LLC, the subsidiary guarantors party thereto and The Bank of New York Mellon Trust Company, N.A., as trustee and collateral agent (incorporated by reference to Exhibit 4.3 to the Current Report on Form 8-K filed by Charter Communications, Inc. on March 4, 2021 (File No. 001-33664)).\n4.58\nForm of 3.500% Senior Secured Notes due 2041 (incorporated by reference to Exhibit 4.4 to the Current Report on Form 8-K filed by Charter Communications, Inc. on March 4, 2021 (File No. 001-33664)).\n4.59\nForm of 3.900% Senior Secured Notes due 2052 (incorporated by reference to Exhibit 4.5 to the Current Report on Form 8-K filed by Charter Communications, Inc. on March 4, 2021 (File No. 001-33664)).\n4.60\nSixth Supplemental Indenture, dated as of April 22, 2021, among CCO Holdings, LLC, CCO Holdings Capital Corp. and The Bank of New York Mellon Trust Company, N.A., as trustee (incorporated by reference to Exhibit 4.2 to the Current Report on Form 8-K filed by Charter Communications, Inc. on April 27, 2021 (File No. 001-33664)).\n4.61\nForm of 4.500% Senior Notes due 2033 (incorporated by reference to Exhibit 4.3 to the Current Report on Form 8-K filed by Charter Communications, Inc. on April 27, 2021 (File No. 001-33664)).\n4.62\nTwentieth Supplemental Indenture, dated as of June 2, 2021, among Charter Communications Operating, LLC, Charter Communications Operating Capital Corp., as issuers, CCO Holdings, LLC, the subsidiary guarantors party thereto and The Bank of New York Mellon Trust Company, N.A., as trustee and collateral agent (incorporated by reference to Exhibit 4.6 to the Current Report on Form 8-K filed by Charter Communications, Inc. on June 2, 2021, 2021 (File No. 001-33664)).\n4.63\nForm of 4.400% Senior Notes due 2061 (incorporated by reference to Exhibit 4.8 to the Current Report on Form 8-K filed by Charter Communications, Inc. on June 2, 2021, 2021 (File No. 001-33664)).\nE-4\n4.64\nSeventh Supplemental Indenture, dated as of August 16, 2021, among CCO Holdings, LLC, CCO Holdings Capital Corp. and The Bank of New York Mellon Trust Company, N.A., as trustee (incorporated by reference to Exhibit 4.2 to the Current Report on Form 8-K filed by Charter Communications, Inc. on August 18, 2021 (File No. 001-33664)).\n4.65\nForm of 4.250% Senior Notes due 2034 (incorporated by reference to Exhibit 4.3 to the Current Report on Form 8-K filed by Charter Communications, Inc. on August 18, 2021 (File No. 001-33664)).\n4.66\nTwenty-First Supplemental Indenture, dated as of October 12, 2021, among Charter Communications Operating, LLC, Charter Communications Operating Capital Corp., as issuers, CCO Holdings, LLC, the subsidiary guarantors party thereto and The Bank of New York Mellon Trust Company, N.A., as trustee and collateral agent (incorporated by reference to Exhibit 4.2 to the Current Report on Form 8-K filed by Charter Communications, Inc. on October 12, 2021 (File No. 001-33664)).\n4.67\nForm of 2.250% Senior Secured Notes due 2029 (incorporated by reference to Exhibit 4.3 to the Current Report on Form 8-K filed by Charter Communications, Inc. on October 12, 2021 (File No. 001-33664)).\n4.68\nForm of 3.500% Senior Secured Notes due 2042 (incorporated by reference to Exhibit 4.4 to the Current Report on Form 8-K filed by Charter Communications, Inc. on October 12, 2021 (File No. 001-33664)).\n4.69\nForm of 3.950% Senior Secured Notes due 2062 (incorporated by reference to Exhibit 4.5 to the Current Report on Form 8-K filed by Charter Communications, Inc. on October 12, 2021 (File No. 001-33664)).\n4.70\nEighth Supplemental Indenture, dated as of January 19, 2022, among CCO Holdings, LLC, CCO Holdings Capital Corp. and The Bank of New York Mellon Trust Company, N.A., as trustee. (incorporated by reference to Exhibit 4.2 to the Current Report on Form 8-K filed by Charter Communications, Inc. on January 25, 2022 (File No. 001-33664)).\n4.71\nForm of 4.750% Senior Notes due 2032 (incorporated by reference to Exhibit 4.3 to the Current Report on Form 8-K filed by Charter Communications, Inc. on January 25, 2022 (File No. 001-33664)).\n4.72\nTwenty-Second Supplemental Indenture, dated as of March 15, 2022, among Charter Communications Operating, LLC, Charter Communications Operating Capital Corp., as issuers, CCO Holdings, LLC, the subsidiary guarantors party thereto and The Bank of New York Mellon Trust Company, N.A., as trustee and collateral agent. (incorporated by reference to Exhibit 4.2 to the Current Report on Form 8-K filed by Charter Communications, Inc. on March 15, 2022 (File No. 001-33664)).\n4.73\nForm of 4.400% Senior Notes due 2033 (incorporated by reference to Exhibit 4.3 to the Current Report on Form 8-K filed by Charter Communications, Inc. on March 15, 2022 (File No. 001-33664)).\n4.74\nForm of 5.250% Senior Notes due 2053 (incorporated by reference to Exhibit 4.4 to the Current Report on Form 8-K filed by Charter Communications, Inc. on March 15, 2022 (File No. 001-33664)).\n4.75\nForm of 5.500% Senior Notes due 2063 (incorporated by reference to Exhibit 4.5 to the Current Report on Form 8-K filed by Charter Communications, Inc. on March 15, 2022 (File No. 001-33664)).\n4.76\nNinth Supplemental Indenture, dated as of August 9, 2022, among CCO Holdings, LLC, CCO Holdings Capital Corp. and The Bank of New York Mellon Trust Company, N.A., as trustee (incorporated by reference to Exhibit 4.2 to the Current Report on Form 8-K filed by Charter Communications, Inc. on August 15, 2022 (File No. 001-33664)).\n4.77\nForm of 6.375% Senior Notes due 2029 (incorporated by reference to Exhibit 4.3 to the Current Report on Form 8-K filed by Charter Communications, Inc. on August 15, 2022 (File No. 001-33664)).\n4.78\nTenth Supplemental Indenture, dated as of February 13, 2023, among CCO Holdings, LLC, CCO Holdings Capital Corp. and The Bank of New York Mellon Trust Company, N.A., as trustee (incorporated by reference to Exhibit 4.2 to the Current Report on Form 8-K filed by Charter Communications, Inc. on February 16, 2023 (File No. 001-33664)).\n4.79\nForm of 7.375% Senior Notes due 2031 (incorporated by reference to Exhibit 4.2 to the Current Report on Form 8-K filed by Charter Communications, Inc. on February 16, 2023 (File No. 001-33664)).\n4.80\nTwenty-Third Supplemental Indenture, dated as of November 7, 2023, among Charter Communications Operating, LLC, Charter Communications Operating Capital Corp., as issuers, CCO Holdings, LLC, the subsidiary guarantors party thereto and The Bank of New York Mellon Trust Company, N.A., as trustee and collateral agent (incorporated by reference to Exhibit 4.82 to the Annual Report on Form 10-K filed by Charter Communications, Inc. on February 2, 2024 (File No. 001-33664)).\n4.81\nTwenty-Fourth Supplemental Indenture, dated as of November 10, 2023, among Charter Communications Operating, LLC, Charter Communications Operating Capital Corp., as issuers, CCO Holdings, LLC, the subsidiary guarantors party thereto and The Bank of New York Mellon Trust Company, N.A., as trustee and collateral agent. (incorporated by reference to Exhibit 4.2 to the Current Report on Form 8-K filed by Charter Communications, Inc. on November 13, 2023 (File No. 001-33664)).\n4.82\nForm of 6.150% Senior Notes due 2026 (incorporated by reference to Exhibit 4.3 to the Current Report on Form 8-K filed by Charter Communications, Inc. on November 13, 2023 (File No. 001-33664)).\n4.83\nForm of 6.650% Senior Notes due 2034 (incorporated by reference to Exhibit 4.4 to the Current Report on Form 8-K filed by Charter Communications, Inc. on November 13, 2023 (File No. 001-33664)).\nE-5\n4.84\nTwenty-Fifth Supplemental Indenture, dated as of May 14, 2024, among Charter Communications Operating, LLC, Charter Communications Operating Capital Corp., as issuers, CCO Holdings, LLC, the subsidiary guarantors party thereto and The Bank of New York Mellon Trust Company, N.A., as trustee and collateral agent. (incorporated by reference to Exhibit 4.2 to the Current Report on Form 8-K filed by Charter Communications, Inc. on May 14, 2024 (File No. 001-33664)).\n4.85\nForm of 6.100% Senior Notes due 2029 (incorporated by reference to Exhibit 4.3 to the Current Report on Form 8-K filed by Charter Communications, Inc. on May 14, 2024 (File No. 001-33664)).\n4.86\nForm of 6.550% Senior Notes due 2034 (incorporated by reference to Exhibit 4.4 to the Current Report on Form 8-K filed by Charter Communications, Inc. on May 14, 2024 (File No. 001-33664)).\n4.87\nIndenture, dated as of April 30, 1992 (the “TWCE Indenture”), as amended by the First Supplemental Indenture, dated as of June 30, 1992, among Time Warner Entertainment Company, L.P. (“TWE”), Time Warner Companies, Inc. (“TWCI”), certain of TWCI’s subsidiaries that are parties thereto and The Bank of New York, as Trustee (incorporated herein by reference to Exhibits 10(g) and 10(h) to TWCI’s Current Report on Form 8-K dated June 26, 1992 and filed with the SEC on July 15, 1992 (File No. 1-8637)).  (P)\n4.88\nSecond Supplemental Indenture to the TWCE Indenture, dated as of December 9, 1992, among TWE, TWCI, certain of TWCI’s subsidiaries that are parties thereto and The Bank of New York, as Trustee (incorporated herein by reference to Exhibit 4.2 to Amendment No. 1 to TWE’s Registration Statement on Form S-4 dated and filed with the SEC on October 25, 1993 (Registration No. 33-67688) (the “TWE October 25, 1993 Registration Statement”)).  (P)\n4.89\nThird Supplemental Indenture to the TWCE Indenture, dated as of October 12, 1993, among TWE, TWCI, certain of TWCI’s subsidiaries that are parties thereto and The Bank of New York, as Trustee (incorporated herein by reference to Exhibit 4.3 to the TWE October 25, 1993 Registration Statement).  (P)\n4.90\nFourth Supplemental Indenture to the TWCE Indenture, dated as of March 29, 1994, among TWE, TWCI, certain of TWCI’s subsidiaries that are parties thereto and The Bank of New York, as Trustee (incorporated herein by reference to Exhibit 4.4 to TWE’s Annual Report on Form 10-K for the year ended December 31, 1993 and filed with the SEC on March 30, 1994 (File No. 1-12878)).  (P)\n4.91\nFifth Supplemental Indenture to the TWCE Indenture, dated as of December 28, 1994, among TWE, TWCI, certain of TWCI’s subsidiaries that are parties thereto and The Bank of New York, as Trustee (incorporated herein by reference to Exhibit 4.5 to TWE’s Annual Report on Form 10-K for the year ended December 31, 1994 and filed with the SEC on March 30, 1995 (File No. 1-12878)).  (P)\n4.92\nSixth Supplemental Indenture to the TWCE Indenture, dated as of September 29, 1997, among TWE, TWCI, certain of TWCI’s subsidiaries that are parties thereto and The Bank of New York, as Trustee (incorporated herein by reference to Exhibit 4.7 to Historic TW Inc.’s (“Historic TW”) Annual Report on Form 10-K for the year ended December 31, 1997 and filed with the SEC on March 25, 1998 (File No. 1-12259) (the “Time Warner 1997 Form 10-K”)).\n4.93\nSeventh Supplemental Indenture to the TWCE Indenture, dated as of December 29, 1997, among TWE, TWCI, certain of TWCI’s subsidiaries that are parties thereto and The Bank of New York, as Trustee (incorporated herein by reference to Exhibit 4.8 to the Time Warner 1997 Form 10-K).\n4.94\nEighth Supplemental Indenture to the TWCE Indenture, dated as of December 9, 2003, among Historic TW, TWE, Warner Communications Inc. (“WCI”), American Television and Communications Corporation (“ATC”), TWC and The Bank of New York, as Trustee (incorporated herein by reference to Exhibit 4.10 to Time Warner Inc.’s (“Time Warner”) Annual Report on Form 10-K for the year ended December 31, 2003 (File No. 1-15062)).\n4.95\nNinth Supplemental Indenture to the TWCE Indenture, dated as of November 1, 2004, among Historic TW, TWE, Time Warner NY Cable Inc., WCI, ATC, TWC and The Bank of New York, as Trustee (incorporated herein by reference to Exhibit 4.1 to Time Warner’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2004 (File No. 1-15062)).\n4.96\nTenth Supplemental Indenture to the TWCE Indenture, dated as of October 18, 2006, among Historic TW, TWE, TW NY Cable Holding Inc. (“TW NY”), Time Warner NY Cable LLC (“TW NY Cable”), TWC, WCI, ATC and The Bank of New York, as Trustee (incorporated herein by reference to Exhibit 4.1 to Time Warner’s Current Report on Form 8-K dated and filed October 18, 2006 (File No. 1-15062)).\n4.97\nEleventh Supplemental Indenture to the TWCE Indenture, dated as of November 2, 2006, among TWE, TW NY, TWC and The Bank of New York, as Trustee (incorporated herein by reference to Exhibit 99.1 to Time Warner’s \nCurrent Report\n on Form 8-K dated and filed November 2, 2006 (File No. 1-15062)).\n4.98\nTwelfth Supplemental Indenture to the TWCE Indenture, dated as of September 30, 2012, among Time Warner Cable Enterprises LLC (“TWCE”), TWC, TW NY, Time Warner Cable Internet Holdings II LLC (“TWC Internet Holdings II”) and The Bank of New York Mellon, as trustee, supplementing the Indenture dated April 30, 1992, as amended (incorporated herein by reference to Exhibit 4.2 to TWC’s \nCurrent Report\n on Form 8-K dated September 30, 2012 and filed with the SEC on October 1, 2012 (File No. 1-33335) (the “TWC September 30, 2012 Form 8-K”)).\nE-6\n4.99\nThirteenth Supplemental Indenture, dated as of May 18, 2016, by and among Time Warner Cable Enterprises LLC, the guarantors party thereto and The Bank of New York Mellon (formerly known as The Bank of New York), as trustee (incorporated by reference to Exhibit 4.4 to the \nCurrent Report\n on Form 8-K filed by Charter Communications, Inc. on May 24, 2016 (File No. 001-33664)).\n4.100\nIndenture, dated as of April 9, 2007 (the “TWC Indenture”), among TWC, TW NY, TWE and The Bank of New York, as trustee (incorporated herein by reference to Exhibit 4.1 to TWC’s \nCurrent Report\n \non Form 8-K dated April 4, 2007 and filed with the SEC on April 9, 2007 (File No. 1-33335) (the “TWC April 4, 2007 Form 8-K”)).\n4.101\nFirst Supplemental Indenture to the TWC Indenture, dated as of April 9, 2007, among TWC, TW NY, TWE and The Bank of New York, as trustee (incorporated herein by reference to Exhibit 4.2 to the TWC April 4, 2007 Form 8-K).\n4.102\nSecond Supplemental Indenture to the TWC Indenture, dated as of September 30, 2012, among TWC, TW NY, TWCE, TWC Internet Holdings II and The Bank of New York Mellon, as trustee, supplementing the Indenture dated April 9, 2007, as amended (incorporated herein by reference to Exhibit 4.1 to the TWC September 30, 2012 Form 8-K).\n4.103\nThird Supplemental Indenture, dated as of May 18, 2016, by and among Time Warner Cable Inc., TWC NewCo LLC and The Bank of New York Mellon (formerly known as The Bank of New York), as trustee (incorporated by reference to Exhibit 4.5 to the Current Report on Form 8-K filed by Charter Communications, Inc. on May 24, 2016 (File No. 001-33664)).\n4.104\nFourth Supplemental Indenture, dated as of May 18, 2016, by and among TWC NewCo LLC, the guarantors party thereto and The Bank of New York Mellon (formerly known as The Bank of New York), as trustee (incorporated by reference to Exhibit 4.6 to the \nCurrent Report\n on Form 8-K filed by Charter Communications, Inc. on May 24, 2016 (File No. 001-33664)).\n4.105\nForm of TWC 6.55% Exchange Debentures due 2037 (included as Exhibit C to the First Supplemental Indenture incorporated herein by reference to Exhibit 4.2 to the TWC April 4, 2007 Form 8-K).\n4.106\nForm of TWC 7.30% Debentures due 2038 (incorporated herein by reference to Exhibit 4.3 to the TWC June 16, 2008 Form 8-K).\n4.107\nForm of TWC 6.75% Debentures due 2039 (incorporated herein by reference to Exhibit 4.1 to TWC’s \nCurrent Report\n on Form 8-K dated June 24, 2009 and filed with the SEC on June 29, 2009 (File No. 1-33335)).\n4.108\nForm of TWC 5.875% Debentures due 2040 (incorporated herein by reference to Exhibit 4.2 to the TWC November 9, 2010 Form 8-K).\n4.109\nForm of TWC 5.75% Note due 2031 (incorporated herein by reference to Exhibit 4.1 to TWC’s \nCurrent Report\n on Form 8-K dated and filed with the SEC on May 26, 2011 (File No. 1-33335)).\n4.110\nForm of TWC 5.5% Debenture due 2041 (incorporated herein by reference to Exhibit 4.2 to the TWC Current Report on Form 8-K dated September 7, 2011 and filed with the SEC on September 12, 2011 (File No. 1-33335)).\n4.111\nForm of TWC 4.5% Debenture due 2042 (incorporated herein by reference to Exhibit 4.1 to TWC’s \nCurrent Report\n on Form 8-K dated August 7, 2012 and filed with the SEC on August 10, 2012 (File No. 1-33335)).\n4.112\nForm of TWC 5.25% Note due 2042 (incorporated herein by reference to Exhibit 4.1 to TWC’s \nCurrent Report\n on Form 8-K dated and filed with the SEC on June 27, 2012 (File No. 1-33335)).\n4.113\nDescription of Securities (incorporated herein by reference to Exhibit 4.104 to the Annual Report on Form 10-K filed by Charter Communications, Inc. on January 27, 2023 (File No. 001-33664)).\n10.1\nExchange and Registration Rights Agreement, dated July 23, 2015 relating to the 3.579% Senior Secured Notes due 2020, 4.464% Senior Secured Notes due 2022, 4.908% Senior Secured Notes due 2025, 6.384% Senior Secured Notes due 2035, 6.484% Senior Secured Notes due 2045 and 6.834% Senior Secured Notes due 2055, between CCO Safari II, LLC and Goldman, Sachs & Co., Credit Suisse Securities (USA) LLC, Merrill Lynch, Pierce, Fenner & Smith Incorporated, Deutsche Bank Securities Inc. and UBS Securities LLC, as representatives of the several Purchasers (as defined therein) (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on July 27, 2015 (File No. 001-33664)).\n10.2\nExchange and Registration Rights Agreement, dated April 21, 2016, relating to the 5.500% Senior Notes due 2026, among CCO Holdings, LLC, CCO Holdings Capital Corp., Charter Communications, Inc., as guarantor, and Merrill Lynch, Pierce, Fenner & Smith Incorporated, Citigroup Global Markets Inc., Credit Suisse Securities (USA) LLC, Deutsche Bank Securities Inc., Goldman, Sachs & Co., UBS Securities LLC and Wells Fargo Securities, LLC, as representatives of the several Purchasers (as defined therein) (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on April 27, 2016 (File No. 001-33664)).\nE-7\n10.3\nExchange and Registration Rights Agreement, dated February 6, 2017, relating to the 5.125% Senior Notes due 2027, among CCO Holdings, LLC, CCO Holdings Capital Corp., and Merrill Lynch, Pierce, Fenner & Smith Incorporated, Citigroup Global Markets Inc., Credit Suisse Securities (USA) LLC, Deutsche Bank Securities Inc., Goldman, Sachs & Co., UBS Securities LLC, and Wells Fargo Securities, LLC, as representatives of the several Purchasers (as defined therein) (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on February 6, 2017 (File No. 001-33664)).\n10.4\nExchange and Registration Rights Agreement, dated March 29, 2017, relating to the 5.125% Senior Notes due 2027, among CCO Holdings, LLC, CCO Holdings Capital Corp., and Deutsche Bank Securities Inc., Merrill Lynch, Pierce, Fenner & Smith Incorporated, Citigroup Global Markets Inc., Credit Suisse Securities (USA) LLC, Goldman, Sachs & Co., UBS Securities LLC, and Wells Fargo Securities, LLC, as representatives of the several Purchasers (as defined therein) (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on March 31, 2017 (File No. 001-33664)).\n10.5\nExchange and Registration Rights Agreement, dated April 20, 2017, relating to the 5.125% Senior Notes due 2027, among CCO Holdings, LLC, CCO Holdings Capital Corp. and Citigroup Global Markets Inc., as a representative of the several Purchasers (as defined therein) (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on April 26, 2017 (File No. 001-33664)).\n10.6\nExchange and Registration Rights Agreement, dated April 20, 2017, relating to the 5.375% Senior Notes due 2047, among Charter Communications Operating, LLC, Charter Communications Operating Capital Corp., the guarantors party thereto and Citigroup Global Markets Inc., as representative of the several Purchasers (as defined therein) (incorporated by reference to Exhibit 10.2 to the \nCurrent Report\n on Form 8-K filed by Charter Communications, Inc. on April 26, 2017 (File No. 001-33664)).\n10.7\nExchange and Registration Rights Agreement, dated July 6, 2017, relating to the 3.750% Senior Notes due 2028, among Charter Communications Operating, LLC, Charter Communications Operating Capital Corp., the guarantors party thereto and Merrill Lynch, Pierce, Fenner & Smith Incorporated, as representative of the several Purchasers (as defined therein) (incorporated by reference to Exhibit 10.1 to the \nCurrent Report\n on Form 8-K filed by Charter Communications, Inc. on July 12, 2017 (File No. 001-33664)).\n10.8\nExchange and Registration Rights Agreement, dated July 6, 2017, relating to the 5.375% Senior Notes due 2047, among Charter Communications Operating, LLC, Charter Communications Operating Capital Corp., the guarantors party thereto and Merrill Lynch, Pierce, Fenner & Smith Incorporated, as representative of the several Purchasers (as defined therein) (incorporated by reference to Exhibit 10.2 to the \nCurrent Report\n on Form 8-K filed by Charter Communications, Inc. on July 12, 2017 (File No. 001-33664)).\n10.9\nExchange and Registration Rights Agreement, dated August 8, 2017, relating to the 5.000% Senior Notes due 2028, among CCO Holdings, LLC, CCO Holdings Capital Corp. and Merrill Lynch, Pierce, Fenner & Smith Incorporated, as representative of the several Purchasers (as defined therein) (incorporated by reference to Exhibit 10.1 to the \nCurrent Report\n on Form 8-K filed by Charter Communications, Inc. on August 14, 2017 (File No. 001-33664)).\n10.10\nExchange and Registration Rights Agreement, dated September 18, 2017, relating to the 4.200% Senior Secured Notes due 2028, among Charter Communications Operating, LLC, Charter Communications Operating Capital Corp., the guarantors party thereto and Merrill Lynch, Pierce, Fenner & Smith Incorporated and Citigroup Global Markets Inc., as representatives of the several Purchasers (as defined therein) (incorporated by reference to Exhibit 10.1 to the \nCurrent Report\n on Form 8-K filed by Charter Communications, Inc. on September 21, 2017 (File No. 001-33664)).\n10.11\nExchange and Registration Rights Agreement, dated September 18, 2017, relating to the 5.375% Senior Secured Notes due 2047, among Charter Communications Operating, LLC, Charter Communications Operating Capital Corp., the guarantors party thereto and Merrill Lynch, Pierce, Fenner & Smith Incorporated and Citigroup Global Markets Inc., as representatives of the several Purchasers (as defined therein) (incorporated by reference to Exhibit 10.2 to the \nCurrent Report\n on Form 8-K filed by Charter Communications, Inc. on September 21, 2017 (File No. 001-33664)).\n10.12\nExchange and Registration Rights Agreement, dated October 17, 2017, relating to the 5.000% Senior Notes due 2028, among CCO Holdings, LLC, CCO Holdings Capital Corp. and Merrill Lynch, Pierce, Fenner & Smith Incorporated, as representative of the several Purchasers (as defined therein) (incorporated by reference to Exhibit 10.1 to the \nCurrent Report\n on Form 8-K filed by Charter Communications, Inc. on October 20, 2017 (File No. 001-33664)).\n10.13\nExchange and Registration Rights Agreement, dated May 23, 2019, relating to the 5.375% Senior Notes due 2029, among CCO Holdings, LLC, CCO Holdings Capital Corp. and Deutsche Bank Securities Inc., as representative of the several Purchasers (as defined therein) (incorporated by reference to Exhibit 10.1 to the \nCurrent Report\n on Form 8-K filed by Charter Communications, Inc. on May 30, 2019 (File No. 001-33664)).\n10.14\nExchange and Registration Rights Agreement, dated July 10, 2019, relating to the 5.375% Senior Notes due 2029, among CCO Holdings, LLC, CCO Holdings Capital Corp. and Deutsche Bank Securities Inc., as representative of the several Purchasers (as defined therein) (incorporated by reference to Exhibit 10.1 to the \nCurrent Report\n on Form 8-K filed by Charter Communications, Inc. on July 10, 2019 (File No. 001-33664)).\nE-8\n10.15\nExchange and Registration Rights Agreement, dated October 1, 2019, relating to the 4.750% Senior Notes due 2030, among CCO Holdings, LLC, CCO Holdings Capital Corp. and BofA Securities, Inc., as representative of the several Purchasers (as defined therein) (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on October 7, 2019 (File No. 001-33664)).\n10.16\nExchange and Registration Rights Agreement, dated October 24, 2019, relating to the 4.750% Senior Notes due 2030, among CCO Holdings, LLC, CCO Holdings Capital Corp. and BofA Securities, Inc., as representative of the several Purchasers (as defined therein) (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on October 30, 2019 (File No. 001-33664)).\n10.17\nExchange and Registration Rights Agreement, dated December 16, 2019, relating to the 4.750% Senior Notes due 2030, among CCO Holdings, LLC, CCO Holdings Capital Corp. and Citigroup Global Markets, Inc., as representative of the several Purchasers (as defined therein) (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on December 16, 2019 (File No. 001-33664)).\n10.18\nExchange and Registration Rights Agreement, dated February 18, 2020, relating to the 4.500% Senior Notes due 2030, among CCO Holdings, LLC, CCO Holdings Capital Corp. and Deutsche Bank Securities, Inc., as representative of the several Purchasers (as defined therein) (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on February 21, 2020 (File No. 001-33664)).\n10.19\n2030 Exchange and Registration Rights Agreement, dated March 18, 2020, relating to the 4.500% Senior Notes due 2030, among CCO Holdings, LLC, CCO Holdings Capital Corp. and Deutsche Bank Securities, Inc., as representative of the several Purchasers (as defined therein) (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on March 23, 2020 (File No. 001-33664)).\n10.20\n2032 Exchange and Registration Rights Agreement, dated March 18, 2020, relating to the 4.500% Senior Notes due 2032, among CCO Holdings, LLC, CCO Holdings Capital Corp. and Deutsche Bank Securities, Inc., as representative of the several Purchasers (as defined therein) (incorporated by reference to Exhibit 10.2 to the Current Report on Form 8-K filed by Charter Communications, Inc. on March 23, 2020 (File No. 001-33664)).\n10.21\nExchange and Registration Rights Agreement, dated July 9, 2020, relating to the 4.250% Senior Notes due 2031, among CCO Holdings, LLC, CCO Holdings Capital Corp. and Morgan Stanley & Co. LLC, as representative of the several Purchasers (as defined therein) (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on July 13, 2020 (File No. 001-33664)).\n10.22\nExchange and Registration Rights Agreement, dated July 24, 2020, relating to the 4.250% Senior Notes due 2031, among CCO Holdings, LLC, CCO Holdings Capital Corp. and Morgan Stanley & Co. LLC, as representative of the several Purchasers (as defined therein) (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on July 28, 2020) (File No. 001-33664)).\n10.23\nExchange and Registration Rights Agreement, dated October 12, 2020, relating to the 4.500% Senior Notes due 2032, among CCO Holdings, LLC, CCO Holdings Capital Corp. and Deutsche Bank Securities Inc., as representative of the several Purchasers (as defined therein) (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on October 16, 2020 (File No. 001-33664)).\n10.24\nExchange and Registration Rights Agreement, dated April 22, 2021, relating to the 4.500% Senior Notes due 2033, among CCO Holdings, LLC, CCO Holdings Capital Corp. and Deutsche Bank Securities Inc., as representative of the several Purchasers (as defined therein) (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on April 27, 2021 (File No. 001-33664)).\n10.25\nExchange and Registration Rights Agreement, dated June 2, 2021, relating to the 4.500% Senior Notes due 2033, among CCO Holdings, LLC, CCO Holdings Capital Corp. and Deutsche Bank Securities Inc., as representative of the several Purchasers (as defined therein) (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on June 2, 2021, 2021 (File No. 001-33664)).\n10.26\nExchange and Registration Rights Agreement, dated August 16, 2021, relating to the 4.250% Senior Notes due 2034, among CCO Holdings, LLC, CCO Holdings Capital Corp. and Morgan Stanley & Co. LLC, as representative of the several Purchasers (as defined therein) (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on August 18, 2021 (File No. 001-33664)).\n10.27\nExchange and Registration Rights Agreement, dated January 19, 2022, relating to the 4.750% Senior Notes due 2032, among CCO Holdings, LLC, CCO Holdings Capital Corp. and Deutsche Bank Securities Inc., as representative of the several Purchasers (as defined therein). (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on January 25, 2022 (File No. 001-33664)).\n10.28\nExchange and Registration Rights Agreement, dated August 9, 2022, relating to the 6.375% Senior Notes due 2029, among CCO Holdings, LLC, CCO Holdings Capital Corp. and Morgan Stanley & Co. LLC, as representative of the several Purchasers (as defined therein). (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on August 15, 2022 (File No. 001-33664)).\nE-9\n10.29\nExchange and Registration Rights Agreement, dated February 13, 2023, relating to the 7.375% Senior Notes due 2031, among CCO Holdings, LLC, CCO Holdings Capital Corp. and Morgan Stanley & Co. LLC, as representative of the several Purchasers (as defined therein) (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on February 16, 2023 (File No. 001-33664)).\n10.30(a)\nRestatement Agreement dated as of May 18, 2016, by and among Charter Communications Operating, LLC, CCO Holdings, LLC, the subsidiary guarantors party thereto, Bank of America, N.A., as administrative agent and the lenders party thereto (incorporated by reference to Exhibit 10.5 to the \nCurrent Report\n on Form 8-K of Charter Communications, Inc. filed on May 24, 2016 (File No. 001-33664)).\n10.30(b)\nAmendment No. 1 dated as of December 23, 2016, to the Amended and Restated Credit Agreement dated as of March 18, 1999, as amended and restated on May 18, 2016, by and among Chart Communications Operating, LLC, CCO Holdings, LLC, the Lenders Party thereto and Bank of America, N.A., as Administrative Agent (incorporated by reference to Exhibit 10.1 to the \nCurrent Report\n on Form 8-K of Charter Communications, Inc. filed on December 30, 2016 (File No. 001-33664)).\n10.30(c)\nRestatement Agreement dated as of December 21, 2017 to the Amended and Restated Credit Agreement dated as of March 18, 1999, as amended and restated on May 18, 2016, as amended by Amendment No. 1, dated as of December 23, 2016 and as further amended by that certain Incremental Activation Notice No. 1, dated as of January 19, 2017, by and among Charter Communications Operating, LLC, CCO Holdings, LLC, the Lenders Party thereto and Bank of America, N.A., as Administrative Agent (incorporated by reference to Exhibit 10.1 to the \nCurrent Report\n on Form 8-K of Charter Communications, Inc. filed on December 28, 2017 (File No. 001-33664)).\n10.30(d)\nAmendment No. 1, dated as of January 24, 2019, to (i) the Amended and Restated Credit Agreement, dated as of March 18, 1999, as amended and restated on December 21, 2017, by and among Charter Communications Operating, LLC, CCO Holdings, LLC, certain subsidiaries of Charter Communications Operating, LLC, the lenders party thereto and Bank of America, N.A., as Administrative Agent and (ii) the Guarantee and Collateral Agreement, dated as of March 18, 1999, as amended and restated as of March 31, 2010, as further amended and restated on May 18, 2016, by and among Charter Communications Operating, LLC, CCO Holdings, LLC, certain subsidiaries of Charter Communications Operating, LLC and Bank of America, N.A., as Administrative Agent (incorporated by reference to Exhibit 10.1 to the \nCurrent Report\n \non Form 8-K filed by Charter Communications, Inc. on January 30, 2019 (File No. 001-33664)).\n10.30(e)\nRestatement Agreement, dated as of April 26 2019, to the Amended and Restated Credit Agreement, dated as of March 18, 1999, as amended and restated on December 21, 2017 and as amended by Amendment No. 1 as of January 24, 2019, by and among Charter Communications Operating, LLC, CCO Holdings, LLC, certain subsidiaries of Charter Communications Operating, LLC, the lenders party thereto and Bank of America, N.A., as Administrative Agent  (incorporated by reference to Exhibit 10.4 to the Quarterly Report on Form 10-Q of Charter Communications, Inc. filed April 30, 2019 (File No. 001-33664)).\n10.30(f)\nAmendment No. 1, dated as of October 24, 2019, to the Amended and Restated Credit Agreement, dated as of March 18, 1999, as amended and restated on April 26, 2019, by and among Charter Communications Operating, LLC, CCO Holdings, LLC, certain subsidiaries of Charter Communications Operating, LLC, the lenders party thereto and Bank of America, N.A., as administrative agent (incorporated by reference to Exhibit 10.2 to the Current Report on Form 8-K filed by Charter Communications, Inc. on October 30, 2019 (File No. 001-33664)).\n10.30(g)\nAmendment No. 2, dated as of May 26, 2022, to (i) the Amended and Restated Credit Agreement, dated as of March 18, 1999, as amended and restated on April 26, 2019 and as amended by Amendment No. 1 on October 24, 2019, by and among Charter Communications Operating, LLC, CCO Holdings, LLC, certain subsidiaries of Charter Communications Operating, LLC, the lenders party thereto and Bank of America, N.A., as administrative agent and (ii) the Amended and Restated Guarantee and Collateral Agreement, dated as of March 18, 1999, as amended and restated as of March 6, 2007, as amended and restated as of March 31, 2010, as amended and restated as of May 18, 2016 and as further amended as of January 24, 2019, by Charter Communications Operating, LLC, CCO Holdings, LLC, certain subsidiaries of Charter Communications Operating, LLC and the Bank of America, N.A., as administrative agent (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on June 2, 2022 (File No. 001-33664)).\n10.30(h)\nAmendment No. 3, dated as of February 10, 2023, to the Amended and Restated Credit Agreement, dated as of March 18, 1999, as amended and restated on April 26, 2019, as amended by Amendment No. 1 on October 24, 2019 and as further amended by Amendment No. 2 on May 26, 2022, by and among Charter Communications Operating, LLC, CCO Holdings, LLC, certain of Charter Communications Operating, LLC’s subsidiaries, the lenders party thereto and Bank of America, N.A., as administrative agent (incorporated by reference to Exhibit 10.2 to the Current Report on Form 8-K filed by Charter Communications, Inc. on February 16, 2023 (File No. 001-33664)).\nE-10\n10.30(i)\nAmendment No. 4, dated as of March 23, 2023, to the Amended and Restated Credit Agreement, dated as of March 18, 1999, as amended and restated on April 26, 2019, as amended by Amendment No. 1 on October 24, 2019 and as further amended by Amendment No. 2 on May 26, 2022 and as further amended by Amendment No. 3 on February 10, 2023, by and among Charter Communications Operating, LLC, CCO Holdings, LLC, certain of Charter Communications Operating, LLC’s subsidiaries, the lenders party thereto and Bank of America, N.A., as administrative agent (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on March 29, 2023 (File No. 001-33664)).\n10.30(j)\nAmendment No. 5, dated as of December 7, 2023, to the Amended and Restated Credit Agreement. dated as of March 18, 1999, as amended and restated on April 26, 2019, as amended by Amendment No. 1 on October 24, 2019 and as further amended by Amendment No. 2 on May 26, 2022 and as further amended by Amendment No. 3 on February 10, 2023 and as further amended by Amendment No. 4 on March 23, 2023, by and among Charter Communications Operating, LLC, CCO Holdings, LLC, certain of Charter Communications Operating, LLC’s subsidiaries, the lenders party thereto and Bank of America, N.A., as administrative agent (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on December 13, 2023 (File No. 001-33664)).\n10.30(k)\nAmendment No. 6, dated as of December 3, 2024, to the Amended and Restated Credit Agreement, dated as of March 18, 1999, as amended and restated on April 26, 2019, as amended by Amendment No. 1 on October 24, 2019 and as further amended by Amendment No. 2 on May 26, 2022 and as further amended by Amendment No. 3 on February 10, 2023, as further amended by Amendment No. 4 on March 23, 2023, and as further amended by Amendment No. 5 on December 7, 2023, by and among Charter Communications Operating, LLC, CCO Holdings, LLC, certain of Charter Communications Operating, LLC’s subsidiaries, the lenders party thereto and Bank of America, N.A., as administrative agent (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on December 9, 2024 (File No. 001-33664)).\n10.31\nJoinder Agreement to Registration Rights Agreement, dated as of May 18, 2016, by and among CCO Safari II, LLC, CCH II, LLC, Charter Communications Operating, LLC, Charter Communications Operating Capital Corp., CCO Holdings, LLC and the other guarantors party thereto (incorporated herein by reference to Exhibit 10.1 to the \nCurrent Report\n on Form 8-K of Charter Communications, Inc. filed May 24, 2016).\n10.32\nJoinder Agreement to Registration Rights Agreement, dated as of May 18, 2016, by CCO Holdings, LLC and CCO Holdings Capital Corp (incorporated herein by reference to Exhibit 10.2 to the \nCurrent Report\n on Form 8-K of Charter Communications, Inc. filed May 24, 2016).\n10.33\nEscrow Assumption Agreement, dated as of May 18, 2016, by and among CCO Safari III, LLC, Charter Communications Operating, LLC, Bank of America, N.A., as escrow administrative agent and Bank of America, N.A., as administrative agent (incorporated herein by reference to Exhibit 10.3 to the \nCurrent Report\n on Form 8-K of Charter Communications, Inc. filed May 24, 2016).\n10.34\nIncremental Activation Notice, dated as of May 18, 2016, by and among Charter Communications Operating, LLC, CCO Holdings, LLC, the subsidiary guarantors party thereto, Bank of America, N.A., as administrative agent and the lenders party thereto (incorporated by reference to Exhibit 10.4 to the \nCurrent Report\n on Form 8-K of Charter Communications, Inc. filed on May 24, 2016 (File No. 001-33664)).\n10.35\nCollateral Agreement, dated as of May 18, 2016, by Charter Communications Operating, LLC, Charter Communications Operating Capital Corp. and the other grantors party thereto in favor of The Bank of New York Mellon Trust Company, N.A., as collateral agent (incorporated by reference to Exhibit 10.6 to the Current Report on Form 8-K of Charter Communications, Inc. filed on May 24, 2016 (File No. 001-33664)).\n10.36\nFirst Lien Intercreditor Agreement, dated as of May 18, 2016, by and among Charter Communications Operating, LLC, the other grantors party thereto, Bank of America, N.A., as credit agreement collateral agent for the credit agreement secured parties, The Bank of New York Mellon Trust Company, N.A., as notes collateral agent for the indenture secured parties, and each additional agent from time to time party thereto (incorporated by reference to Exhibit 10.7 to the \nCurrent Report\n on Form 8-K of Charter Communications, Inc. filed on May 24, 2016 (File No. 001-33664)).\n10.37\nAmended and Restated Limited Liability Company Agreement of Charter Communications Holdings, LLC, dated as of May 18, 2016, by and among Charter Holdings, Charter, CCH II, LLC, Advance/Newhouse Partnership and the other party or parties thereto (incorporated by reference to Exhibit 10.1 to the \nCurrent Report\n on Form 8-K of Charter Communications, Inc. filed on May 19, 2016 (File No. 001-33664)).\n10.38\nExchange Agreement, dated as of May 18, 2016, by and among Charter Holdings, Charter, Advance/Newhouse Partnership and the other party or parties thereto (incorporated by reference to Exhibit 10.2 to the \nCurrent Report\n on Form 8-K of Charter Communications, Inc. filed on May 19, 2016 (File No. 001-33664)).\n10.39\nRegistration Rights Agreement, dated as of May 18, 2016, by and among Charter, Advance/Newhouse Partnership and Liberty Broadband (incorporated by reference to Exhibit 10.3 to the \nCurrent Report\n on Form 8-K of Charter Communications, Inc. filed on May 19, 2016 (File No. 001-33664)).\n10.40\nTax Receivables Agreement, dated as of May 18, 2016, by and among Charter, Advance/Newhouse Partnership and the other party or parties thereto (incorporated by reference to Exhibit 10.4 to the \nCurrent Report\n on Form 8-K of Charter Communications, Inc. filed on May 19, 2016 (File No. 001-33664)).\nE-11\n10.41\nWireless Operational Cooperation Agreement dated as of May 5, 2017 between Charter Communications, Inc. and Comcast Corporation (incorporated by reference to Exhibit 10.1 to the \nCurrent Report\n on Form 8-K filed by Charter Communications, Inc. on May 8, 2017 (File No. 001-33664)).\n10.42+\nCharter Communications, Inc. Executive Bonus Plan (incorporated by reference to Exhibit 10.1 to the Quarterly Report on Form 10-Q of Charter Communications, Inc. filed on May 8, 2012 (File No. 001-33664)).\n10.43+\nForm of First Amended and Restated Indemnification Agreement (incorporated by reference to Exhibit 10.3 to the Quarterly Report on Form 10-Q of Charter Communications, Inc. filed on August 6, 2013 (File No. 001-33664)).\n10.44+\nCharter Communications, Inc. 2016 Executive Incentive Performance Plan (incorporated by reference to Appendix A to the Proxy Statement for the Charter Communications, Inc. 2016 Annual Meeting of Stockholders filed March 17, 2016 (File No. 001-33664)).\n10.45+\nCharter Communications, Inc. Amended and Restated 2009 Stock Incentive Plan (incorporated by reference to Exhibit 10.6 to the Current Report on Form 8-K of Charter Communications, Inc. filed on May 19, 2016 (File No. 001-33664)).\n10.46+\nAmendment to the Charter Communications, Inc. Amended and Restated 2009 Stock Incentive Plan, dated as of October 25, 2016 (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K of Charter Communications, Inc. filed on October 28, 2016 (File No. 001-33664)).\n10.47+\nCharter Communications, Inc.’s Amended and Restated Supplemental Deferred Compensation Plan, dated as of September 1, 2011 (incorporated by reference to Exhibit 10.1 to the \nCurrent Report\n on Form 8-K filed by Charter Communications, Inc. on September 2, 2011 (File No. 001-33664)).\n10.48+\nForm of Non-Qualified Time Vesting Stock Option Agreement dated April 26, 2011 (incorporated by reference to Exhibit 10.3 to the Quarterly Report on Form 10-Q filed by Charter Communications, Inc. on August 2, 2011 (File No. 001-33664)).\n10.49+\nForm of Non-Qualified Price Vesting Stock Option Agreement dated April 26, 2011 (incorporated by reference to Exhibit 10.2 to the \nQuarterly Report\n on Form 10-Q filed by Charter Communications, Inc. on August 2, 2011 (File No. 001-33664)).\n10.50+\nForm of Notice of LTIP Award Agreement Changes (RSU Awards) (incorporated by reference to Exhibit 10.3 to the \nCurrent Report\n on Form 8-K filed by Charter Communications, Inc. on January 22, 2014 (File No. 001-33664)).\n10.51+\nForm of Notice of LTIP Award Agreement Changes (Time-Vesting Option Awards) (incorporated by reference to Exhibit 10.4 to the \nCurrent Report\n on Form 8-K filed by Charter Communications, Inc. on January 22, 2014 (File No. 001-33664)).\n10.52+\nForm of Notice of LTIP Award Agreement Changes (Restricted Stock Awards) (incorporated by reference to Exhibit 10.5 to the \nCurrent Report\n on Form 8-K filed by Charter Communications, Inc. on January 22, 2014 (File No. 001-33664)).\n10.53+\nForm of Notice of LTIP Award Agreement Changes (Performance-Vesting Option Awards) (incorporated by reference to Exhibit 10.6 to the \nCurrent Report\n \non Form 8-K filed by Charter Communications, Inc. on January 22, 2014 (File No. 001-33664)).\n10.54+\nForm of Stock Option Agreement dated January 15, 2014 (incorporated by reference to Exhibit 10.1 to the \nCurrent Report\n on Form 8-K filed by Charter Communications, Inc. on January 22, 2014 (File No. 001-33664)).\n10.55+\nForm of Restricted Stock Unit Agreement dated January 15, 2014 (incorporated by reference to Exhibit 10.2 to the \nCurrent Report\n on Form 8-K filed by Charter Communications, Inc. on January 22, 2014 (File No. 001-33664)).\n10.56+\nForm of Amendment to Nonqualified Stock Option Agreements Granted Under the Charter Communications, Inc. Amended and Restated 2009 Stock Incentive Plan, dated as of October 25, 2016 (incorporated by reference to Exhibit 10.2 to the Current Report on Form 8-K of Charter Communications, Inc. filed on October 28, 2016 (File No. 001-33664)).\n10.57+\nForm of Performance-Vesting Stock Option Agreement granted to certain executive officers in 2016 under the Charter Communications, Inc. Amended and Restated 2009 Stock Incentive Plan (incorporated by reference to Exhibit 10.102 to the Annual Report on Form 10-K of Charter Communications, Inc. filed on February 16, 2017 (File No. 001-33664)).\n10.58+\nForm of Performance-Vesting Restricted Stock Unit Agreement granted to certain executive officers in 2016 under the Charter Communications, Inc. Amended and Restated 2009 Stock Incentive Plan (incorporated by reference to Exhibit 10.103 to the Annual Report on Form 10-K of Charter Communications, Inc. filed on February 16, 2017 (File No. 001-33664)).\n10.59+\nCharter Communications, Inc. 2019 Stock Incentive Plan (incorporated by reference to Annex A to the Proxy Statement for the Charter Communications, Inc. 2019 Annual Meeting of Stockholders filed March 14, 2019 (File No. 001-33664)).\nE-12\n10.60+\nAmendment to the Charter Communications, Inc. 2019 Stock Incentive Plan, dated as of January 28, 2020 \n(incorporated by reference to Exhibit 10.152 to the Annual Report on Form 10-K of Charter Communications, Inc. filed on January 31, 2020 (File No. 001-33664))\n.\n10.61+\nSecond Amendment to the Charter Communications, Inc. 2019 Stock Incentive Plan (incorporated by reference to Appendix B to the Definitive Proxy Statement for the Charter Communications, Inc. 2024 Annual Meeting of Stockholders filed on March 14, 2024 (File No. 001-33664)).\n10.62+\nForm of Nonqualified Stock Option Agreement under the Charter Communications, Inc. 2019 Stock Incentive Plan (incorporated by reference to Exhibit 10.2 to the Quarterly Report on Form 10-Q of Charter Communications, Inc. filed July 26, 2019 (File No. 001-33664)).\n10.63+\nForm of Restricted Stock Unit Agreement under the Charter Communications, Inc. 2019 Stock Incentive Plan (incorporated by reference to Exhibit 10.3 to the \nQuarterly Report\n on Form 10-Q of Charter Communications, Inc. filed July 26, 2019 (File No. 001-33664)).\n10.64+\nForm of Restricted Stock Agreement under the Charter Communications, Inc. 2019 Stock Incentive Plan (incorporated by reference to Exhibit 10.4 to the \nQuarterly Report\n \non Form 10-Q of Charter Communications, Inc. filed July 26, 2019 (File No. 001-33664)).\n10.65+\nForm of Performance-Vesting Stock Option Agreement (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on February 24, 2023 (File No. 001-33664)).\n10.66+\nForm of Performance-Vesting Restricted Stock Unit Agreement (incorporated by reference to Exhibit 10.2 to the Current Report on Form 8-K filed by Charter Communications, Inc. on February 24, 2023(File No. 001-33664)).\n10.67+\nTime Warner Cable Inc. 2006 Stock Incentive Plan (incorporated herein by reference to Exhibit 10.45 to TWC’s \nCurrent Report\n on Form 8-K dated February 13, 2007 and filed with the SEC on February 13, 2007).\n10.68+\nTime Warner Cable Inc. 2006 Stock Incentive Plan, as amended, effective March 12, 2009 (incorporated herein by reference to Exhibit 10.1 to TWC’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2009).\n10.69+\nTime Warner Cable Inc. 2011 Stock Incentive Plan (incorporated herein by reference to Annex A to TWC’s Definitive Proxy Statement dated April 6, 2011 and filed with the SEC on April 6, 2011).\n10.70(a)+\nAmended and Restated Employment Agreement, dated as of September 20, 2022, by and between Charter Communications, Inc. and Christopher L. Winfrey (incorporated by reference to Exhibit 10.2 to the Current Report on Form 8-K filed by Charter Communications, Inc. on September 21, 2022 (File No. 001-33664)).\n10.70(b)+\nAmendment to Amended and Restated Employment Agreement dated as of February 22, 2023 by and between Charter Communications Inc. and Christopher L. Winfrey (incorporated by reference to Exhibit 10.3 to the Current Report on Form 8-K filed by Charter Communications, Inc. on February 24, 2023 (File No. 001-33664)).\n10.71(a)+\nEmployment Agreement, dated as of September 20, 2022, by and between Charter Communications, Inc. and Richard J. DiGeronimo (incorporated by reference to Exhibit 10.3 to the Current Report on Form 8-K filed by Charter Communications, Inc. on September 21, 2022 (File No. 001-33664)).\n10.71(b)+\nAmendment to Employment Agreement dated as of February 22, 2023 by and between Charter Communications Inc. and Richard J. DiGeronimo (incorporated by reference to Exhibit 10.4 to the Current Report on Form 8-K filed by Charter Communications, Inc. on February 24, 2023 (File No. 001-33664)).\n10.72(a)+\nEmployment Agreement, dated as of January 26, 2023, by and between Charter Communications, Inc. and Jessica Fischer (incorporated by reference to Exhibit 10.71(b) to the Annual Report on Form 10-K of Charter Communications, Inc. filed on January 27, 2023 (File No. 001-33664)).\n10.72(b)+*\nEmployment Agreement, dated as of January \n29\n, 2025, by and between Charter Communications, Inc. and Jessica Fischer.\n10.73+*\nEmployment Agreement, dated as of October 6, 2023, by and between Charter Communications, Inc. and Jamal Haughton.\n10.74+*\nEmployment Agreement, dated as of \nDecember 21\n, 202\n3\n, by and between Charter Communications, Inc. and Adam Ray.\n10.75+\nEmployment Agreement, dated as of July 23, 2024, by and between Charter Communications, Inc. and Kevin D. Howard (incorporated by reference to Exhibit 10.4 to the Quarterly Report on Form 10-Q filed by Charter Communications, Inc. on July 26, 2024 (File No. 001-33664)).\n10.76\nLetter Agreement, dated as of December 23, 2016, between Charter Communications, Inc. and Advance/Newhouse Partnership (incorporated by reference to Exhibit 99.1 to the Current Report on Form 8-K of Charter Communications, Inc. filed on December 28, 2016 (File No. 001-33664)).\n10.77\nAmendment to Letter Agreement, dated as of December 21, 2017, between Charter Communications, Inc. and Advance/Newhouse Partnership (incorporated by reference to Exhibit 99.1 to the Current Report on Form 8-K of Charter Communications, Inc. filed on December 22, 2017 (File No. 001-33664)).\nE-13\n10.78(a)\nLetter Agreement, dated as of February 23, 2021, between Charter Communications, Inc. and Liberty Broadband Corporation (incorporated by reference to Exhibit 99.1 to the Current Report on Form 8-K of Charter Communications, Inc. filed on February 24, 2021 (File No. 001-33664)).\n10.78(b)\nAmendment No. 1 to the Second Amended and Restated Stockholders Agreement and the Letter Agreement, dated as of November 12, 2024, by and among Charter Communications, Inc., Advance/Newhouse Partnership and Liberty Broadband Corporation (incorporated by reference to Exhibit 10.3 to the Current Report on Form 8-K filed by Charter Communications, Inc. on November 13, 2024 (File No. 001-33664)).\n10.79\nVoting Agreement, dated as of November 12, 2024, by and among Charter Communications, Inc., Liberty Broadband Corporation, The John C. Malone 1995 Revocable Trust, The Leslie A. Malone 1995 Revocable Trust, The Malone Family Land Preservation Foundation and the John C. Malone June 2003 Charitable Unitrust (incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K filed by Charter Communications, Inc. on November 13, 2024 (File No. 001-33664)).\n10.80\nVoting Agreement, dated as of November 12, 2024, by and among Charter Communications, Inc., Liberty Broadband Corporation, Gregory B. Maffei, Maven GRAT 1, LLC, Maven 2017-1 GRAT, LLC and the Maffei Foundation (incorporated by reference to Exhibit 10.2 to the Current Report on Form 8-K filed by Charter Communications, Inc. on November 13, 2024 (File No. 001-33664)).\n10.81\nAssumption and Joinder Agreement to Tax Sharing Agreement, made and entered into as of November 12, 2024, by and among Charter Communications, Inc., Liberty Broadband Corporation, Grizzly Merger Sub 1, LLC and Qurate Retail, Inc. (incorporated by reference to Exhibit 10.4 to the Current Report on Form 8-K filed by Charter Communications, Inc. on November 13, 2024 (File No. 001-33664)).\n10.82\nTax Sharing Agreement, dated as of March 9, 2018, by and between GCI Liberty, Inc. and Liberty Interactive Corporation (incorporated by reference to Exhibit 10.1 to GCI Liberty, Inc.’s Current Report on Form 8-K filed on March 14, 2018 (File No. 001-38385)).\n10.83\nAssumption and Joinder Agreement to Indemnification Agreement, made and entered into as of November 12, 2024, by and among Charter Communications, Inc., Liberty Broadband Corporation, Grizzly Merger Sub 1, LLC, Qurate Retail, Inc., Liberty Interactive LLC and LV Bridge, LLC (incorporated by reference to Exhibit 10.6 to the Current Report on Form 8-K filed by Charter Communications, Inc. on November 13, 2024 (File No. 001-33664)).\n10.84\nIndemnification Agreement, dated as of March 9, 2018, by and among GCI Liberty, Inc., Liberty Interactive Corporation, Liberty Interactive LLC and LV Bridge, LLC (incorporated by reference to Exhibit 10.2 to GCI Liberty, Inc.’s Current Report on Form 8-K filed on March 14, 2018 (File No. 001-38385)).\n19.1*\nCharter Communications, Inc. Securities Trading Policy, effective as of October 2024.\n21.1*\nSubsidiaries of Charter Communications, Inc.\n23.1*\nConsent of KPMG LLP.\n31.1*\nCertificate of Chief Executive Officer pursuant to Rule 13a-14(a)/Rule 15d-14(a) under the Securities Exchange Act of 1934.\n31.2*\nCertificate of Chief Financial Officer pursuant to Rule 13a-14(a)/Rule 15d-14(a) under the Securities Exchange Act of 1934.\n32.1*\nCertification pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 (Chief Executive Officer).\n32.2*\nCertification pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 (Chief Financial Officer).\n97.1\nCharter Communications, Inc. Compensation Recovery Policy, effective as of October 1, 2023 (incorporated by reference to Exhibit 97.1 to the Annual Report on Form 10-K of Charter Communications, Inc. filed on February 2, 2024 (File No. 001-33664)).\n101\nThe following financial information from Charter Communications, Inc.’s Annual Report on Form 10-K for the year ended December 31, 2024, filed with the Securities and Exchange Commission on January 31, 2025, formatted in iXBRL (inline eXtensible Business Reporting Language) includes: (i) the Consolidated Balance Sheets; (ii) the Consolidated Statements of Operations; (iii) the Consolidated Statements of Changes in Shareholders' Equity; (iv) the Consolidated Statements of Cash Flows; and (vi) the Notes to the Consolidated Financial Statements.\n104\nCover page, formatted in iXBRL and contained in Exhibit 101.\n_____________\n*    Filed herewith\n+\n    Management compensatory plan or arrangement\nE-14\nINDEX TO FINANCIAL STATEMENTS\nPage\nAudited Financial Statements\nReport of Independent Registered Public Accounting Firm\nF-\n2\nAuditor Name:  \nKPMG LLP\nAuditor Location:  \nSt. Louis, MO\nAuditor Firm ID:  \n185\nConsolidated Balance Sheets as of December 31, 2024 and 2023\nF-\n4\nConsolidated Statements of Operations for the Years Ended December 31, 2024, 2023 and 2022\nF-\n5\nConsolidated Statements of Changes in Shareholders’ Equity for the Years Ended December 31, 2024, 2023 and 2022\nF-\n6\nConsolidated Statements of Cash Flows for the Years Ended December 31, 2024, 2023 and 2022\nF-\n7\nNotes to Consolidated Financial Statements\nF-\n8\nF-1\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and Board of Directors\nCharter Communications, Inc.:\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Charter Communications, Inc. and subsidiaries (the Company) as of December 31, 2024 and December 31, 2023, the related consolidated statements of operations, changes in shareholders’ equity, and cash flows for each of the years in the three-year period ended December 31, 2024, and the related notes (collectively, the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and December 31, 2023, and the results of its operations and its cash flows for each of the years in the three-year period ended December 31, 2024, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control – Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission, and our report dated January 30, 2025 expressed an unqualified opinion on the effectiveness of the Company’s internal control over financial reporting.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on these consolidated financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of a critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nTesting of residential and SMB revenue\nAs discussed in Note 13 to the consolidated financial statements, the Company recorded residential and small and medium-sized business (SMB) revenue of $47.4 billion for the year ended December 31, 2024.  This revenue is derived primarily from monthly subscription charges from its Internet, video, and voice services. Revenue is recognized as the services are provided to a customer on a monthly basis.  The processing and recording of revenue are reliant upon multiple information technology (IT) systems.\nWe identified the evaluation of the sufficiency of audit evidence over residential and SMB revenue as a critical audit matter. Subjective auditor judgment was required in evaluating the sufficiency of audit evidence over residential and SMB revenue due to the volume of data and the number of accounting systems. Specifically, obtaining an understanding of the systems and processes used in the Company’s recognition of residential and SMB revenue and evaluating the related internal controls required significant audit effort, including specialized skills and knowledge related to IT.\nF-2\nThe following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of certain internal controls over the Company’s residential and SMB revenue processes. This included manual and automated controls over the IT systems used for the processing and recording of residential and SMB revenue. We involved IT professionals with specialized skills and knowledge, who assisted in testing certain IT applications that are used by the Company in its recognition of residential and SMB revenue. We performed a software-assisted data analysis to test the relationships among certain revenue transactions during the year. We evaluated the sufficiency of audit evidence obtained by assessing the results of procedures performed, including the appropriateness of the nature and extent of such evidence.\n(signed) KPMG LLP\nWe have served as the Company’s auditor since 2002.\nSt. Louis, Missouri\nJanuary 30, 2025\nF-3\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\n \nCONSOLIDATED BALANCE SHEETS \n(dollars in millions, except share data)\nDecember 31,\n2024\n2023\nASSETS\nCURRENT ASSETS:\nCash and cash equivalents\n$\n459\n \n$\n709\n \nAccounts receivable, less allowance for doubtful accounts of $\n204\n and $\n268\n, respectively\n3,097\n \n2,965\n \nPrepaid expenses and other current assets\n677\n \n458\n \nTotal current assets\n4,233\n \n4,132\n \nINVESTMENT IN CABLE PROPERTIES:\nProperty, plant and equipment, net of accumulated depreciation of $\n39,409\n and $\n37,751\n, respectively\n42,913\n \n39,520\n \nCustomer relationships, net\n975\n \n1,745\n \nFranchises\n67,462\n \n67,396\n \nGoodwill\n29,674\n \n29,668\n \nTotal investment in cable properties, net\n141,024\n \n138,329\n \nOTHER NONCURRENT ASSETS\n4,763\n \n4,732\n \nTotal assets\n$\n150,020\n \n$\n147,193\n \nLIABILITIES AND SHAREHOLDERS’ EQUITY \nCURRENT LIABILITIES:\nAccounts payable, accrued and other current liabilities\n$\n11,687\n \n$\n11,214\n \nCurrent portion of long-term debt\n1,799\n \n2,000\n \nTotal current liabilities\n13,486\n \n13,214\n \nLONG-TERM DEBT\n92,134\n \n95,777\n \nEQUIPMENT INSTALLMENT PLAN FINANCING FACILITY\n1,072\n \n—\n \nDEFERRED INCOME TAXES\n18,845\n \n18,954\n \nOTHER LONG-TERM LIABILITIES\n4,776\n \n4,530\n \nSHAREHOLDERS’ EQUITY:\nClass A common stock; $\n0.001\n par value; \n900\n million shares authorized;\n141,946,426\n and \n145,225,458\n shares issued and outstanding, respectively\n—\n \n—\n \nClass B common stock; $\n0.001\n par value; \n1,000\n shares authorized;\n1\n share issued and outstanding\n—\n \n—\n \nPreferred stock; $\n0.001\n par value; \n250\n million shares authorized;\nno\n shares issued and outstanding\n—\n \n—\n \nAdditional paid-in capital\n23,337\n \n23,346\n \nAccumulated deficit\n(\n7,750\n)\n(\n12,260\n)\nTotal Charter shareholders’ equity\n15,587\n \n11,086\n \nNoncontrolling interests\n4,120\n \n3,632\n \nTotal shareholders’ equity\n19,707\n \n14,718\n \nTotal liabilities and shareholders’ equity \n$\n150,020\n \n$\n147,193\n \nThe accompanying notes are an integral part of these consolidated financial statements.\nF-4\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\n \nCONSOLIDATED STATEMENTS OF OPERATIONS \n(dollars in millions, except per share and share data)\nYear Ended December 31,\n2024\n2023\n2022\nREVENUES\n$\n55,085\n \n$\n54,607\n \n$\n54,022\n \nCOSTS AND EXPENSES:\nOperating costs and expenses (exclusive of items shown separately below)\n33,167\n \n33,405\n \n32,876\n \nDepreciation and amortization\n8,673\n \n8,696\n \n8,903\n \nOther operating (income) expense, net\n127\n \n(\n53\n)\n281\n \n41,967\n \n42,048\n \n42,060\n \nIncome from operations\n13,118\n \n12,559\n \n11,962\n \nOTHER INCOME (EXPENSE):\nInterest expense, net\n(\n5,229\n)\n(\n5,188\n)\n(\n4,556\n)\nOther income (expense), net\n(\n387\n)\n(\n517\n)\n56\n \n(\n5,616\n)\n(\n5,705\n)\n(\n4,500\n)\nIncome before income taxes\n7,502\n \n6,854\n \n7,462\n \nIncome tax expense\n(\n1,649\n)\n(\n1,593\n)\n(\n1,613\n)\nConsolidated net income \n5,853\n \n5,261\n \n5,849\n \nLess: Net income attributable to noncontrolling interests\n(\n770\n)\n(\n704\n)\n(\n794\n)\nNet income attributable to Charter shareholders\n$\n5,083\n \n$\n4,557\n \n$\n5,055\n \nEARNINGS PER COMMON SHARE ATTRIBUTABLE TO CHARTER SHAREHOLDERS:\nBasic\n$\n35.53\n \n$\n30.54\n \n$\n31.30\n \nDiluted\n$\n34.97\n \n$\n29.99\n \n$\n30.74\n \nWeighted average common shares outstanding, basic\n143,061,337\n \n149,208,188\n \n161,501,355\n \nWeighted average common shares outstanding, diluted\n145,363,771\n \n151,966,313\n \n164,433,596\n \n \nThe accompanying notes are an integral part of these consolidated financial statements.\nF-5\n   CHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\n \nCONSOLIDATED STATEMENTS OF CHANGES IN SHAREHOLDERS’ EQUITY\n(dollars in millions)\nClass A Common Stock\nClass B Common Stock\nAdditional Paid-in Capital\nAccumulated Deficit\nTotal Charter Shareholders’ Equity \nNoncontrolling Interests\nTotal Shareholders’ Equity\nBALANCE, December 31, 2021\n$\n—\n \n$\n—\n \n$\n26,725\n \n$\n(\n12,675\n)\n$\n14,050\n \n$\n4,106\n \n$\n18,156\n \nConsolidated net income\n— \n— \n— \n5,055\n \n5,055\n \n794\n \n5,849\n \nStock compensation expense\n— \n— \n470\n \n— \n470\n \n— \n470\n \nExercise of stock options\n— \n— \n5\n \n— \n5\n \n— \n5\n \nPurchases and retirement of treasury stock\n— \n— \n(\n3,076\n)\n(\n7,201\n)\n(\n10,277\n)\n— \n(\n10,277\n)\nPurchase of noncontrolling interest, net of tax\n— \n— \n(\n681\n)\n— \n(\n681\n)\n(\n700\n)\n(\n1,381\n)\nChange in noncontrolling interest ownership, net of tax\n— \n— \n497\n \n— \n497\n \n(\n659\n)\n(\n162\n)\nDistributions to noncontrolling interest\n— \n— \n— \n— \n— \n(\n111\n)\n(\n111\n)\nBALANCE, December 31, 2022\n—\n \n—\n \n23,940\n \n(\n14,821\n)\n9,119\n \n3,430\n \n12,549\n \nConsolidated net income\n— \n— \n— \n4,557\n \n4,557\n \n704\n \n5,261\n \nStock compensation expense\n— \n— \n692\n \n— \n692\n \n— \n692\n \nExercise of stock options\n— \n— \n22\n \n— \n22\n \n— \n22\n \nPurchases and retirement of treasury stock, including excise tax\n— \n— \n(\n1,246\n)\n(\n1,996\n)\n(\n3,242\n)\n— \n(\n3,242\n)\nPurchase of noncontrolling interest, net of tax\n— \n— \n(\n140\n)\n— \n(\n140\n)\n(\n240\n)\n(\n380\n)\nChange in noncontrolling interest ownership, net of tax\n— \n— \n78\n \n— \n78\n \n(\n104\n)\n(\n26\n)\nDistributions to noncontrolling interest\n— \n— \n— \n— \n— \n(\n158\n)\n(\n158\n)\nBALANCE, December 31, 2023\n—\n \n—\n \n23,346\n \n(\n12,260\n)\n11,086\n \n3,632\n \n14,718\n \nConsolidated net income\n— \n— \n— \n5,083\n \n5,083\n \n770\n \n5,853\n \nStock compensation expense\n— \n— \n651\n \n— \n651\n \n— \n651\n \nExercise of stock options\n— \n— \n32\n \n— \n32\n \n— \n32\n \nPurchases and retirement of treasury stock, including excise tax\n— \n— \n(\n644\n)\n(\n573\n)\n(\n1,217\n)\n— \n(\n1,217\n)\nPurchase of noncontrolling interest, net of tax\n— \n— \n(\n38\n)\n— \n(\n38\n)\n(\n138\n)\n(\n176\n)\nChange in noncontrolling interest ownership, net of tax\n— \n— \n(\n10\n)\n— \n(\n10\n)\n13\n \n3\n \nDistributions to noncontrolling interest\n— \n— \n— \n— \n— \n(\n157\n)\n(\n157\n)\nBALANCE, December 31, 2024\n$\n—\n \n$\n—\n \n$\n23,337\n \n$\n(\n7,750\n)\n$\n15,587\n \n$\n4,120\n \n$\n19,707\n \nThe accompanying notes are an integral part of these consolidated financial statements.\nF-6\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\n \nCONSOLIDATED STATEMENTS OF CASH FLOWS \n(dollars in millions)\n \nYear Ended December 31, \n2024\n2023\n2022\nCASH FLOWS FROM OPERATING ACTIVITIES:\nConsolidated net income \n$\n5,853\n \n$\n5,261\n \n$\n5,849\n \nAdjustments to reconcile consolidated net income to net cash flows from operating activities:\nDepreciation and amortization\n8,673\n \n8,696\n \n8,903\n \nStock compensation expense\n651\n \n692\n \n470\n \nNoncash interest, net\n34\n \n20\n \n(\n17\n)\nDeferred income taxes\n(\n87\n)\n(\n80\n)\n87\n \nOther, net\n354\n \n291\n \n29\n \nChanges in operating assets and liabilities, net of effects from acquisitions and dispositions:\nAccounts receivable\n(\n129\n)\n(\n44\n)\n(\n342\n)\nPrepaid expenses and other assets\n(\n609\n)\n(\n572\n)\n(\n202\n)\nAccounts payable, accrued liabilities and other\n(\n310\n)\n169\n \n148\n \nNet cash flows from operating activities\n14,430\n \n14,433\n \n14,925\n \nCASH FLOWS FROM INVESTING ACTIVITIES:\nPurchases of property, plant and equipment\n(\n11,269\n)\n(\n11,115\n)\n(\n9,376\n)\nChange in accrued expenses related to capital expenditures\n1,096\n \n172\n \n553\n \nOther, net\n(\n481\n)\n(\n184\n)\n(\n291\n)\nNet cash flows from investing activities\n(\n10,654\n)\n(\n11,127\n)\n(\n9,114\n)\nCASH FLOWS FROM FINANCING ACTIVITIES:\nBorrowings of long-term debt\n25,893\n \n22,062\n \n25,643\n \nBorrowings of equipment installment plan financing facility\n1,074\n \n—\n \n—\n \nRepayments of long-term debt\n(\n29,660\n)\n(\n21,938\n)\n(\n19,311\n)\nPayments for debt issuance costs\n(\n56\n)\n(\n32\n)\n(\n71\n)\nPurchase of treasury stock\n(\n1,213\n)\n(\n3,215\n)\n(\n10,277\n)\nProceeds from exercise of stock options\n32\n \n22\n \n5\n \nPurchase of noncontrolling interest\n(\n189\n)\n(\n427\n)\n(\n1,602\n)\nDistributions to noncontrolling interest\n(\n157\n)\n(\n158\n)\n(\n111\n)\nOther, net\n297\n \n444\n \n(\n43\n)\nNet cash flows from financing activities\n(\n3,979\n)\n(\n3,242\n)\n(\n5,767\n)\nNET INCREASE (DECREASE) IN CASH, CASH EQUIVALENTS AND RESTRICTED CASH\n(\n203\n)\n64\n \n44\n \nCASH, CASH EQUIVALENTS AND RESTRICTED CASH, beginning of period\n709\n \n645\n \n601\n \nCASH AND CASH EQUIVALENTS AND RESTRICTED CASH, end of period\n$\n506\n \n$\n709\n \n$\n645\n \nCASH PAID FOR INTEREST\n$\n5,334\n \n$\n5,020\n \n$\n4,509\n \nCASH PAID FOR TAXES\n$\n1,581\n \n$\n1,470\n \n$\n1,321\n \nAs of December 31, 2024, cash, cash equivalents and restricted cash includes $\n47\n million of restricted cash included in prepaid expenses and other current assets in the consolidated balance sheets.\nThe accompanying notes are an integral part of these consolidated financial statements.\nF-7\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\n1.    \nOrganization and Basis of Presentation \nOrganization \nCharter Communications, Inc. (together with its controlled subsidiaries, “Charter,” or the “Company”) is a leading broadband connectivity company and cable operator.  Over an advanced communications network, the Company offers a full range of state-of-the-art residential and business services including Spectrum Internet\n®\n, TV, Mobile and Voice.  For small and medium-sized companies, Spectrum Business\n®\n delivers the same suite of broadband products and services coupled with special features and applications to enhance productivity, while for larger businesses and government entities, Spectrum Enterprise\n®\n provides highly customized, fiber-based solutions. Spectrum Reach\n®\n delivers tailored advertising and production for the modern media landscape. The Company also distributes award-winning news coverage and sports programming to its customers through Spectrum Networks.   \nCharter is a holding company whose principal asset is a controlling equity interest in Charter Communications Holdings, LLC (“Charter Holdings”), an indirect owner of Charter Communications Operating, LLC (“Charter Operating”) under which substantially all of the operations reside. \nBasis of Presentation\nThe accompanying consolidated financial statements have been prepared in accordance with U.S. generally accepted accounting principles (“GAAP”) and the rules and regulations of the Securities and Exchange Commission (the “SEC”).\n \nThe preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period.  Areas involving significant judgments and estimates include capitalization of labor and overhead costs, pension benefits and income taxes.  Actual results could differ from those estimates. Certain prior period amounts have been reclassified to conform with the 2024 presentation.\nComprehensive income equaled net income attributable to Charter shareholders for the years ended December 31, 2024, 2023 and 2022.\n2.    \nSummary of Significant Accounting Policies\nInformation on other accounting policies and methods that the Company uses in the preparation of its consolidated financial statements are included, where applicable, in their respective footnotes.  Below is a discussion of accounting policies and methods used in the Company's consolidated financial statements that are not presented within other footnotes.\nConsolidation \nThe accompanying consolidated financial statements include the accounts of Charter and all entities in which Charter has a controlling interest, including variable interest entities (“VIEs”) where Charter is the primary beneficiary.  The Company consolidates based upon evaluation of the Company’s power, through voting rights or similar rights, to direct the activities of another entity that most significantly impact the entity’s economic performance; its obligation to absorb the expected losses of the entity; and its right to receive the expected residual returns of the entity.  Charter controls and consolidates Charter Holdings.  The noncontrolling interest on the Company’s balance sheet primarily represents Advance/Newhouse Partnership's (“A/N”) minority equity interests in Charter Holdings.  See Note 11.  All significant intercompany accounts and transactions among consolidated entities have been eliminated in consolidation.\nCash and Cash Equivalents\n \nThe Company considers all highly liquid investments with original maturities of three months or less to be cash equivalents.  These investments are carried at cost, which approximates market value.\n    \nF-8\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\nValuation of Long-Lived Assets\n \nThe Company evaluates the recoverability of long-lived assets (e.g., property, plant and equipment and finite-lived intangible assets) to be held and used when events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable.  Such events or changes in circumstances could include such factors as impairment of the Company’s indefinite life assets, changes in technological advances, fluctuations in the fair value of such assets, adverse changes in relationships with local franchise authorities, adverse changes in market conditions or a deterioration of current or expected future operating results.  If a review indicates that the carrying value of such asset is not recoverable from estimated undiscounted cash flows, the carrying value of such asset is reduced to its estimated fair value.  While the Company believes that its estimates of future cash flows are reasonable, different assumptions regarding such cash flows could materially affect its evaluations of asset recoverability.  \nNo\n impairments of long-lived assets held for use were recorded in 2024, 2023 and 2022.\nFair Value Measurements\nAccounting guidance\n \nestablishes a three-level hierarchy for disclosure of fair value measurements, based on the transparency of inputs to the valuation of an asset or liability as of the measurement date, as follows:\n•\nLevel 1 – inputs to the valuation methodology are quoted prices (unadjusted) for identical assets or liabilities in active markets.\n•\nLevel 2 – inputs to the valuation methodology include quoted prices for similar assets and liabilities in active markets, and inputs that are observable for the asset or liability, either directly or indirectly, for substantially the full term of the financial instrument.\n•\nLevel 3 – inputs to the valuation methodology are unobservable and significant to the fair value measurement.\nThe Company estimates the fair value of its financial instruments using available market information or other appropriate valuation methodologies.  Considerable judgment, however, is required in interpreting market data to develop the estimates of fair value.  Accordingly, the estimates presented in the accompanying consolidated financial statements are not necessarily indicative of the amounts the Company would realize in a current market exchange. \nThe Company’s nonfinancial assets such as equity method investments, franchises, property, plant, and equipment, and other intangible assets are not measured at fair value on a recurring basis; however, they are subject to fair value adjustments in certain circumstances, such as when there is evidence that an impairment may exist.  When such impairments are recorded, fair values are generally classified within Level 3 of the valuation hierarchy. \nThe carrying amounts of cash and cash equivalents, receivables, payables and other current assets and liabilities approximate fair value because of the short maturity of those instruments.\nGovernment Assistance\nThe Company's government assistance primarily consists of federal subsidies from the Rural Development Opportunity Fund (“RDOF”) and state broadband grants primarily funded by the American Rescue Plan Act of 2021 (“ARPA”).  The Company was awarded approximately $\n1.1\n billion in federal subsidies in phase I of the RDOF auction to be received monthly over ten years to deploy and operate broadband services to unserved communities to more than one million estimated passings.  For accounting purposes, RDOF subsidies are recorded as other revenues since the primary conditions for the receipt of the subsidies are the build out and operation of the broadband network over the ten years.  During the years ended December 31, 2024, 2023 and 2022, \nother revenues\n included approximately $\n108\n million, $\n116\n million and $\n107\n million of RDOF subsidy revenue, respectively.  \nThe Company has also been awarded broadband grants to construct broadband infrastructure to unserved and underserved communities by various state and local governments.  As of December 31, 2024, the Company has been publicly awarded approximately $\n1.3\n billion in state grants, of which approximately $\n1.1\n billion of these state grants have been formalized into executed agreements.  State grants are either a fixed subsidy or variable with a subsidy cap conditioned upon construction.  Cash is paid either upon project completion, milestone completion, or in some instances a portion of grant is paid in advance.  Prefunded grants are subject to recapture if buildouts are not completed.  For accounting purposes state broadband grants are \nF-9\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\ngenerally recorded as a reduction to property, plant and equipment using a percentage of completion, since the primary conditions for these grants are to build out the broadband network.  During the years ended December 31, 2024, 2023 and 2022, the amount of state broadband grants recorded in the consolidated financial statements was not material.\n \nAdvertising Costs\n \nAdvertising costs associated with marketing the Company’s products and services are generally expensed as costs are incurred.\n3.    \nProperty, Plant and Equipment\nAdditions to property, plant and equipment are recorded at cost, including all material, labor and certain indirect costs associated with the construction of cable transmission and distribution facilities.  While the Company’s capitalization is based on specific activities, once capitalized, costs are tracked on a composite basis by fixed asset category at the cable system level and not on a specific asset basis.  For assets that are sold or retired, the estimated historical cost and related accumulated depreciation is removed.  Costs associated with the placement of the customer drop to the dwelling and the placement of outlets within a dwelling along with the costs associated with the deployment of new customer premise equipment necessary to provide video, Internet or voice services are capitalized.  Costs capitalized include materials, direct labor and overhead costs.  The Company capitalizes direct labor and overhead using standards developed from actual costs and applicable operational data. The Company calculates standards annually (or more frequently if circumstances dictate) for items such as the labor rates, overhead rates, and the actual amount of time required to perform a capitalizable activity.  Overhead costs are associated with the activities of the Company’s personnel and consist of compensation and other indirect costs associated with support functions.  Indirect costs primarily include employee benefits and payroll taxes, and vehicle and occupancy costs.  The costs of disconnecting service and removing customer premise equipment from a dwelling and the costs to reconnect a customer drop or to redeploy previously installed customer premise equipment are charged to operating expense as incurred.  Costs for repairs and maintenance are charged to operating expense as incurred, while plant and equipment replacement, including replacement of certain components, betterments, including replacement of cable drops and outlets, are capitalized. \nDepreciation is recorded using the straight-line composite method over management’s estimate of the useful lives of the related assets as follows: \nCable distribution systems\n6\n-\n22\n years\nCustomer premise equipment and installations\n3\n-\n8\n years\nVehicles and equipment\n6\n-\n21\n years\nBuildings and improvements\n8\n-\n40\n years\nFurniture, fixtures and equipment\n2\n-\n10\n years\nThe Company periodically evaluates the estimated useful lives used to depreciate its assets and the estimated amount of assets that will be abandoned or have minimal use in the future.  A significant change in assumptions about the extent or timing of future asset retirements, or in the Company’s use of new technology and upgrade programs, could materially affect future depreciation expense.  Depreciation expense for the years ended December 31, 2024, 2023 and 2022 was $\n7.8\n billion, $\n7.6\n billion, and $\n7.6\n billion, respectively. \nF-10\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\nProperty, plant and equipment consists of the following as of December 31, 2024 and 2023: \nDecember 31,\n2024\n2023\nCable distribution systems\n$\n49,211\n \n$\n44,561\n \nCustomer premise equipment and installations\n17,270\n \n17,043\n \nVehicles and equipment\n2,251\n \n2,172\n \nBuildings and improvements\n5,966\n \n5,910\n \nFurniture, fixtures and equipment\n7,624\n \n7,585\n \n82,322\n \n77,271\n \nLess: accumulated depreciation\n(\n39,409\n)\n(\n37,751\n)\n$\n42,913\n \n$\n39,520\n \nCertain of the Company’s franchise agreements and leases contain provisions requiring the Company to restore facilities or remove equipment in the event that the franchise or lease agreement is not renewed.  The Company expects to continually renew its franchise agreements and therefore cannot reasonably estimate any liabilities associated with such agreements. A remote possibility exists that franchise agreements could be terminated unexpectedly, which could result in the Company incurring significant expense in complying with restoration or removal provisions. The Company does not have any significant liabilities related to asset retirements recorded in its consolidated financial statements.\n4.    \nFranchises, Goodwill and Other Intangible Assets\nFranchise rights represent the value attributed to agreements or authorizations with local and state authorities that allow access to homes in cable service areas.  For valuation purposes, they are defined as the future economic benefits of the right to solicit and service potential customers (customer marketing rights), and the right to deploy and market new services to potential customers (service marketing rights).  \nManagement estimates the fair value of franchise rights at the date of acquisition and determines if the franchise has a finite life or an indefinite life.  The Company has concluded that all of its franchises qualify for indefinite life treatment given that there are no legal, regulatory, contractual, competitive, economic or other factors which limit the period over which these rights will contribute to the Company's cash flows. The Company reassesses this determination periodically or whenever events or substantive changes in circumstances occur. \nAll franchises are tested for impairment annually or more frequently as warranted by events or changes in circumstances.  Franchise assets are aggregated into essentially inseparable units of accounting to conduct valuations.  The franchise units of accounting are geographical clustering of cable systems representing the highest and best use groupings if sold to market participants.  The Company assesses qualitative factors to determine whether the existence of events or circumstances leads to a determination that it is more likely than not that an indefinite lived intangible asset has been impaired.  If, after this optional qualitative assessment, the Company determines that it is not more likely than not that an indefinite lived intangible asset has been impaired, then no further quantitative testing is necessary.  In completing the qualitative impairment testing, the Company evaluates a multitude of factors that affect the fair value of its franchise assets. Examples of such factors include environmental and competitive changes within the Company's operating footprint, actual and projected operating performance, the consistency of its operating margins, equity and debt market trends, including changes in its market capitalization, and changes in its regulatory and political landscape, among other factors.  The Company performed a qualitative assessment in 2024.  After consideration of the qualitative factors in 2024, the Company concluded that it is more likely than not that the fair value of the franchise assets in each unit of accounting exceeds the carrying value of such assets and therefore did not perform a quantitative analysis at the assessment date.  Periodically, the Company may elect to perform a quantitative analysis for impairment testing. If the Company elects or is required to perform a quantitative analysis to test its franchise assets for impairment, the estimated fair value of franchises is determined utilizing an income approach model based on the present value of the estimated discrete future cash flows attributable to each of the intangible assets identified assuming a discount rate.  \nF-11\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\nThe Company has determined that it has one reporting unit for purposes of the assessment of goodwill impairment.  Goodwill is tested for impairment as of November 30 of each year\n,\n or more frequently as warranted by events or changes in circumstances.  Accounting guidance also permits an optional qualitative assessment for goodwill to determine whether it is more likely than not that the carrying value of a reporting unit exceeds its fair value.  If, after this qualitative assessment, the Company determines that it is not more likely than not that the fair value of a reporting unit is less than its carrying amount then no further quantitative testing would be necessary.  A quantitative assessment is performed if the qualitative assessment results in a more likely than not determination or if a qualitative assessment is not performed. The quantitative assessment considers whether the carrying amount of a reporting unit exceeds its fair value, in which case an impairment charge is recorded to the extent the reporting unit’s carrying value exceeds its fair value.  As with the Company’s franchise impairment testing, in 2024 the Company elected to perform a qualitative goodwill impairment assessment, which incorporated consideration of the same qualitative factors relevant to the Company's franchise impairment testing.  As a result of that assessment, the Company concluded that goodwill is not impaired.\nCustomer relationships are recorded at fair value as of the date acquired less accumulated amortization.  Customer relationships are amortized on an accelerated sum of years’ digits method over useful lives of \n10\n-\n15\n years based on the period over which current customers are expected to generate cash flows.  The Company periodically evaluates the remaining useful lives of its customer relationships to determine whether events or circumstances warrant revision to the remaining periods of amortization.  Customer relationships are evaluated for impairment upon the occurrence of events or changes in circumstances indicating that the carrying amount of an asset may not be recoverable.  Customer relationships are deemed impaired when the carrying value exceeds the projected undiscounted future cash flows associated with the customer relationships. No impairment of customer relationships was recorded in the years ended December 31, 2024, 2023 or 2022.\nThe Company owns approximately $\n464\n million of Citizens Broadband Radio Service (\"CBRS\") priority access licenses.  The wireless spectrum licenses are considered indefinite life intangible assets recorded in other noncurrent assets on the Company's consolidated balance sheets and payments (including deposits) are presented as an investing cash outflow on the Company’s statements of cash flows.  The Company elected to perform a qualitative impairment assessment in 2024 and concluded that its CBRS priority access licenses are not impaired.\nAs of December 31, 2024 and 2023, indefinite-lived and finite-lived intangible assets are presented in the following table: \nDecember 31,\n2024\n2023\nGross Carrying Amount\nAccumulated Amortization\nNet Carrying Amount\nGross Carrying Amount\nAccumulated Amortization\nNet Carrying Amount\nIndefinite-lived intangible assets:\nFranchises\n$\n67,462\n \n$\n— \n$\n67,462\n \n$\n67,396\n \n$\n— \n$\n67,396\n \nGoodwill\n29,674\n \n— \n29,674\n \n29,668\n \n— \n29,668\n \nWireless spectrum licenses\n464\n \n— \n464\n \n464\n \n— \n464\n \nTrademarks\n159\n \n— \n159\n \n159\n \n— \n159\n \n$\n97,759\n \n$\n— \n$\n97,759\n \n$\n97,687\n \n$\n— \n$\n97,687\n \nFinite-lived intangible assets:\nCustomer relationships\n$\n18,294\n \n$\n(\n17,319\n)\n$\n975\n \n$\n18,268\n \n$\n(\n16,523\n)\n$\n1,745\n \nOther intangible assets\n453\n \n(\n320\n)\n133\n \n450\n \n(\n278\n)\n172\n \n$\n18,747\n \n$\n(\n17,639\n)\n$\n1,108\n \n$\n18,718\n \n$\n(\n16,801\n)\n$\n1,917\n \nAmortization expense related to customer relationships and other intangible assets for the years ended December 31, 2024, 2023 and 2022 was $\n838\n million, $\n1.1\n billion and $\n1.3\n billion, respectively. \nF-12\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\nThe Company expects amortization expense on its finite-lived intangible assets will be as follows.  \n2025\n$\n592\n \n2026\n334\n \n2027\n102\n \n2028\n20\n \n2029\n18\n \nThereafter\n42\n \n$\n1,108\n \nActual amortization expense in future periods could differ from these estimates as a result of new intangible asset acquisitions or divestitures, changes in useful lives, impairments, adoption of new accounting standards and other relevant factors.\n \n5.    \nInvestments\nInvestments are accounted for under the equity method of accounting or as equity securities, all of which are recorded in other noncurrent assets in the consolidated balance sheets as of December 31, 2024 and 2023.  The Company applies the equity method to investments when it has the ability to exercise significant influence over the operating and financial policies of the investee.  The Company’s share of the investee’s earnings (losses) is included in other expense, net in the consolidated statements of operations.  The Company monitors its investments for indicators that a decrease in investment value has occurred that is other-than-temporary. If it has been determined that an investment has sustained an other-than-temporary decline in value, the investment is written down to fair value with a charge to earnings.  Investments acquired are measured at fair value utilizing the acquisition method of accounting. The difference between the fair value and the amount of underlying equity in net assets for most equity method investments is due to unrecognized intangible assets at the investee.  These amounts are amortized as a component of equity earnings (losses), recorded within other income (expense), net over the estimated useful life of the asset.\nInvestments consisted of the following as of December 31, 2024 and 2023:\nDecember 31,\n2024\n2023\nEquity method investments\n$\n376\n \n$\n684\n \nOther investments\n142\n \n149\n \nTotal investments\n$\n518\n \n$\n833\n \nEquity method investments primarily includes the Company's 50/50 joint venture with Comcast Corporation (\"Comcast\") in Xumo Services, LLC (\"Xumo\"), a next generation streaming platform.\nThe Company's equity method investments balances reflected in the table above includes differences between the acquisition date fair value of certain investments acquired and the underlying equity in the net assets of the investee, referred to as a basis difference.  This basis difference is amortized as a component of equity earnings.  The remaining unamortized basis difference was $\n240\n million and $\n340\n million as of December 31, 2024 and 2023, respectively.\nFor the years ended December 31, 2024, 2023 and 2022, net losses from investments were $\n331\n million, $\n343\n million and $\n100\n million, respectively, which were recorded in other income (expense), net in the consolidated statements of operations.  Losses on equity investments, net for years ended December 31, 2024 and 2023 are primarily related to our joint venture in Xumo.\n \nF-13\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\n6.    \nAccounts Payable, Accrued and Other Current Liabilities\nAccounts payable, accrued and other current liabilities\n consist of the following as of December 31, 2024 and 2023: \nDecember 31,\n2024\n2023\nAccounts payable – trade\n$\n880\n \n$\n931\n \nDeferred revenue\n456\n \n509\n \nAccrued and other current liabilities:\nProgramming costs\n1,576\n \n1,736\n \nLabor\n1,365\n \n1,283\n \nCapital expenditures\n2,906\n \n1,944\n \nInterest\n1,208\n \n1,328\n \nTaxes and regulatory fees\n649\n \n681\n \nShort-term borrowings\n758\n \n425\n \nOther\n1,889\n \n2,377\n \n$\n11,687\n \n$\n11,214\n \nIn 2024, the Company began its supply chain finance (“SCF”) program whereby the Company has agreements with third parties that allow its participating vendors to finance payment obligations from the Company with designated third-party financial institutions who act as its paying agent.  The Company has generally extended its payment terms with vendors.  A participating vendor may request a participating financial institution to finance one or more of the Company's payment obligations to such vendor prior to the scheduled due date thereof at a discounted price. The Company is not required to provide collateral to the financial institutions.\nThe Company's obligations to participating vendors, including amounts due and scheduled payment dates, are not impacted by the vendors’ decisions to finance amounts due under these financing arrangements. Cash outflows to the financial institutions are classified as cash flows from operating and investing activities.\nA rollforward of the Company's outstanding payment obligations to participating vendors under its SCF program is summarized as follows for the year ended December 31, 2024 and are included in accounts payable - trade and accrued capital expenditures in the table above: \nBalance, beginning of period\n$\n—\n \nObligations confirmed during the year\n1,454\n \nObligations paid during the year\n(\n878\n)\nBalance, end of period\n$\n576\n \nUnder a deferred payment program, the Company has agreements with third parties specifically for its mobile handset purchases.  Under the deferred payment program, the third parties pay the Company’s mobile handset invoices when due, and the Company pays the third parties at a later date, the invoice amount plus interest.  Cash outflows to the financial institutions are classified as cash flows from financing activities.  \nF-14\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\nA rollforward of the Company's outstanding payment obligations to participating vendors under its deferred payment program is summarized as follows for the year ended December 31, 2024 and are included in short-term borrowings in the table above: \nBalance, beginning of period\n$\n425\n \nObligations confirmed during the year\n1,795\n \nObligations paid during the year\n(\n1,462\n)\nBalance, end of period\n$\n758\n \n7.    \nLeases\nThe primary leased asset classes of the Company include real estate, dark fiber, colocation facilities and other equipment.  The lease agreements include both lease and non-lease components, which the Company accounts for separately depending on the election made for each leased asset class. For real estate and dark fiber leased asset classes, the Company accounts for lease and non-lease components as a single lease component and includes all fixed payments in the measurement of lease liabilities and lease assets.  For colocation facilities leased asset class, the Company accounts for lease and non-lease components separately including only the fixed lease payment component in the measurement of lease liabilities and lease assets.    \nLease assets and lease liabilities are initially recognized based on the present value of the future lease payments over the expected lease term. As for most leases the implicit rate is not readily determinable, the Company uses a discount rate in determining the present value of future payments based on the yield-to-maturity of the Company’s secured publicly traded United States dollars denominated debt instruments interpolating the duration of the debt to the term of the executed lease.  \nThe Company’s leases have base rent periods and some with optional renewal periods.  Leases with base rent periods of less than 12 months are not recorded on the balance sheet.  For purposes of measurement of lease liabilities, the expected lease terms may include renewal options when it is reasonably certain that the Company will exercise such options.\nOperating lease expenses were $\n516\n million, $\n506\n million and $\n482\n million for the years ended December 31, 2024, 2023 and 2022, respectively, inclusive of both short-term lease costs and variable lease costs that were not included in the measurement of operating lease liabilities.  \nCash paid for amounts included in the measurement of operating lease liabilities, recorded as operating cash flows in the statements of cash flows, were $\n378\n million, $\n369\n million and $\n345\n million for the years ended December 31, 2024, 2023 and 2022, respectively. \n \nOperating lease right-of-use assets obtained in exchange for operating lease obligations were $\n274\n million, $\n335\n million and $\n221\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\nSupplemental balance sheet information related to leases is as follows.\nDecember 31,\n2024\n2023\nOperating lease right-of-use assets:\nIncluded within \nother noncurrent assets\n$\n1,244\n \n$\n1,270\n \nOperating lease liabilities:\nCurrent portion included within \naccounts payable, accrued and other current liabilities\n$\n278\n \n$\n290\n \nLong-term portion included within \nother long-term liabilities\n1,135\n \n1,128\n \n$\n1,413\n \n$\n1,418\n \nWeighted average remaining lease term for operating leases\n5.6\n years\n5.4\n years\nWeighted average discount rate for operating leases\n5.1\n \n%\n4.5\n \n%\nF-15\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\nMaturities of operating lease liabilities as of December 31, 2024 are as follows.\n2025\n$\n371\n \n2026\n323\n \n2027\n282\n \n2028\n230\n \n2029\n175\n \nThereafter\n293\n \nUndiscounted lease cash flow commitments\n1,674\n \nReconciling impact from discounting\n(\n261\n)\nLease liabilities on consolidated balance sheet as of December 31, 2024\n$\n1,413\n \n8.    \nTotal Debt\nA summary of our debt as of December 31, 2024 and 2023 is as follows: \nDecember 31, 2024\nDecember 31, 2023\nPrincipal Amount\nCarrying Value\nFair Value\nWeighted Average Interest Rate\nPrincipal Amount\nCarrying Value\nFair Value\nWeighted Average Interest Rate\nSenior unsecured notes\n$\n27,250\n \n$\n27,182\n \n$\n24,881\n \n4.9\n \n%\n$\n27,250\n \n$\n27,168\n \n$\n24,750\n \n4.9\n \n%\nSenior secured notes and debentures\n(a)\n56,195\n \n56,475\n \n47,896\n \n5.1\n \n%\n57,925\n \n58,250\n \n50,742\n \n5.1\n \n%\nCredit facilities\n(b)\n10,334\n \n10,276\n \n10,079\n \n6.3\n \n%\n12,413\n \n12,359\n \n12,237\n \n7.0\n \n%\nTotal debt\n$\n93,779\n \n$\n93,933\n \n$\n82,856\n \n5.2\n \n%\n$\n97,588\n \n$\n97,777\n \n$\n87,729\n \n5.3\n \n%\n(a)\nIncludes the Company's £\n625\n million aggregate principal amount of fixed-rate British pound sterling denominated notes (the “Sterling Notes”) (remeasured at $\n782\n million and $\n797\n million as of December 31, 2024 and 2023, respectively, using the exchange rate at the respective dates) and the Company's £\n650\n million aggregate principal amount of Sterling Notes (remeasured at $\n813\n million and $\n828\n million as of December 31, 2024 and 2023, respectively, using the exchange rate at the respective dates).\n(b)\nThe Company had availability under the Charter Operating credit facilities of approximately $\n6.3\n billion as of December 31, 2024.\n \nThe estimated fair value of the Company’s senior unsecured and secured notes and debentures as of December 31, 2024 and 2023 is based on quoted market prices in active markets and is classified within Level 1 of the valuation hierarchy, while the estimated fair value of the Company’s credit facilities is based on quoted market prices in inactive markets and is classified within Level 2.\nIn May 2024, Charter Operating and Charter Communications Operating Capital Corp. jointly issued $\n1.5\n billion of \n6.100\n% senior secured notes due June 2029 at a price of \n99.944\n% of the aggregate principal amount and $\n1.5\n billion of \n6.550\n% senior secured notes due June 2034 at a price of \n99.755\n% of the aggregate principal amount.  The net proceeds were used to fund a concurrent tender offer to repurchase $\n2.7\n billion in aggregate principal amount of Charter Operating's \n4.908\n% senior secured notes due July 2025, to prepay Charter Operating's outstanding Term B-1 Loan and to pay related fees and expenses.  The transactions resulted in a gain on extinguishment of debt of approximately $\n9\n million for the year ended December 31, 2024 recorded in other income (expense), net in the consolidated statements of operations.\nIn December 2024, Charter Operating entered into an amendment to its credit agreement to (i) establish a new Revolving Loan C (including by converting a portion of the existing Revolving Loan B commitments to Revolving Loan C commitments), (ii) convert a portion of the Term A-5 Loan to Term A-7 Loan and repay any remaining Term A-5 Loan that was not converted to Term A-7 Loan, and (iii) convert or replace a portion of the Term B-2 Loan with a new tranche of Term B-5 Loan and repay any remaining Term B-2 Loan that was not converted to Term B-5 Loan, among other amendments.  The transactions resulted \nF-16\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\nin a loss on extinguishment of debt of approximately $\n8\n million for the year ended December 31, 2024 recorded in other income (expense), net in the consolidated statements of operations. \nDuring the years ended December 31, 2023 and 2022, the Company repurchased $\n1.5\n billion and $\n3.0\n billion, respectively, of various series of senior notes.  Each of the transactions resulted in a loss on extinguishment of debt of approximately $\n3\n million for the years ended December 31, 2023 and 2022 recorded in other income (expense), net in the consolidated statements of operations.\nCCO Holdings Notes\nThe CCO Holdings notes are senior debt obligations of CCO Holdings and CCO Holdings Capital Corp. and rank equally with all other current and future unsecured, unsubordinated obligations of CCO Holdings and CCO Holdings Capital Corp.  They are structurally subordinated to all obligations of subsidiaries of CCO Holdings.  \nCCO Holdings may redeem some or all of the CCO Holdings notes at any time at a premium.  The optional redemption price declines to \n100\n% of the respective series’ principal amount, plus accrued and unpaid interest, if any, on or after varying dates in 2025 through 2031. \nIn addition, at any time prior to varying dates in 2025 through 2026, CCO Holdings may redeem up to \n40\n% of the aggregate principal amount of certain notes at a premium plus accrued and unpaid interest to the redemption date, with the net cash proceeds of one or more equity offerings (as defined in the indenture); provided that certain conditions are met.  In the event of specified change of control events, CCO Holdings must offer to purchase the outstanding CCO Holdings notes from the holders at a purchase price equal to \n101\n% of the total principal amount of the notes, plus any accrued and unpaid interest.\nThe indentures governing the CCO Holdings notes contain certain covenants that restrict the ability of CCO Holdings, CCO Holdings Capital Corp. and all of their restricted subsidiaries to: \n•\nincur additional debt;\n•\npay dividends on equity or repurchase equity;\n•\nmake investments;\n•\nsell all or substantially all of their assets or merge with or into other companies;\n•\nsell assets;\n•\nin the case of restricted subsidiaries, create or permit to exist dividend or payment restrictions with respect to CCO Holdings, guarantee their parent companies debt, or issue specified equity interests; \n•\nengage in certain transactions with affiliates; and\n•\ngrant liens (with respect to only CCO Holdings).\nThe above limitations in certain circumstances regarding incurrence of debt, payment of dividends and making investments contained in the indentures of CCO Holdings permit CCO Holdings and its restricted subsidiaries to perform the above, so long as, after giving pro forma effect to the above, the leverage ratio would be below a specified level for the issuer.  The maximum total leverage ratio under the indentures is \n6.0\n to \n1.0\n.  The leverage ratio was \n3.9\n as of December 31, 2024. \nCharter Operating Notes\nThe Charter Operating notes are guaranteed by CCO Holdings and substantially all of the subsidiaries of Charter Operating.  In addition, the Charter Operating notes are secured by a perfected first priority security interest in substantially all of the assets of Charter Operating and substantially all of its subsidiaries to the extent such liens can be perfected under the Uniform Commercial Code by the filing of a financing statement and the liens rank equally with the liens on the collateral securing obligations under the Charter Operating credit facilities.  Charter Operating may redeem some or all of the Charter Operating notes, prior to their respective par call dates, at any time at a premium.\nThe Charter Operating notes are subject to the terms and conditions of the indentures governing the Charter Operating notes.  The Charter Operating notes indentures contain customary representations and warranties and affirmative covenants with customary negative covenants, including restrictions on the ability of Charter Operating or any of its material subsidiaries to \nF-17\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\nincur liens securing indebtedness for borrowed money and on the ability of Charter Operating to consolidate, merge or convey or transfer substantially all of their assets.  The Charter Operating indentures also contain customary events of default.\nCharter Operating Credit Facilities\nThe Charter Operating credit facilities have an outstanding principal amount of $\n10.3\n billion at December 31, 2024 as follows: \n•\nTerm A-6 Loan with a remaining principal amount of approximately $\n437\n million, which is repayable in quarterly installments and aggregating $\n25\n million in each loan year, with the remaining balance due at final maturity on August 31, 2028.  Pricing on Term A-6 Loan is SOFR plus \n1.50\n%;\n•\nTerm A-7 Loan with a remaining principal amount of approximately $\n4.5\n billion, which is repayable in quarterly installments and aggregating $\n227\n million in each loan year, with the remaining balance due at final maturity on March 15, 2030.  Pricing on Term A-7 Loan is SOFR plus \n1.25\n%;\n•\nTerm B-3 Loan with a remaining principal amount of approximately $\n737\n million, which is repayable in equal quarterly installments and aggregating $\n8\n million in each loan year, with the remaining balance due at final maturity on March 31, 2030.  Pricing on Term B-3 Loan is SOFR plus \n2.25\n%;\n•\nTerm B-4 Loan with a remaining principal amount of approximately $\n2.0\n billion, which is repayable in equal quarterly installments and aggregating $\n20\n million in each loan year, with the remaining balance due at final maturity on December 7, 2030.  Pricing on Term B-4 Loan is SOFR plus \n2.00\n%;\n•\nTerm B-5 Loan with a remaining principal amount of approximately $\n2.5\n billion, which is repayable in equal quarterly installments and aggregating $\n25\n million in each loan year, with the remaining balance due at final maturity on December 15, 2031.  Pricing on Term B-5 Loan is SOFR plus \n2.25\n%;\n•\na Revolving Loan B allowing for borrowings of up to approximately $\n960\n million maturing on August 31, 2027; and  \n•\na Revolving Loan C with an outstanding balance of $\n140\n million and allowing for borrowings of up to $\n5.5\n billion maturing on March 15, 2030.  \nPricing on the revolving loans is SOFR plus \n1.25\n% with a commitment fee based on Charter's corporate family rating and not to exceed \n0.20\n%.  As of December 31, 2024, $\n35\n million of the revolving loans were utilized to collateralize a like principal amount of letters of credit out of $\n425\n million of letters of credit issued on the Company’s behalf.  Amounts outstanding under the Charter Operating credit facilities bear interest, at Charter Operating’s election, at a base rate, SOFR, as defined, plus an applicable margin. SOFR was \n4.3\n% and \n5.4\n% as of December 31, 2024 and 2023, respectively.  \nThe Charter Operating credit facilities also allow us to enter into incremental term loans in the future, with amortization as set forth in the notices establishing such term loans.  Although the Charter Operating credit facilities allow for the incurrence of a certain amount of incremental term loans subject to pro forma compliance with its financial maintenance covenants, no assurance can be given that the Company could obtain additional incremental term loans in the future if Charter Operating sought to do so or what amount of incremental term loans would be allowable at any given time under the terms of the Charter Operating credit facilities.\nThe obligations of Charter Operating under the Charter Operating credit facilities are guaranteed by CCO Holdings and substantially all of the subsidiaries of Charter Operating.  The obligations are also secured by (i) a lien on substantially all of the assets of Charter Operating and substantially all of its subsidiaries, to the extent such lien can be perfected under the Uniform Commercial Code by the filing of a financing statement, and (ii) a pledge of the equity interests directly or indirectly owned by Charter Operating in substantially all of its subsidiaries, as well as intercompany obligations owing to it and the guarantor subsidiaries by any of their affiliates.\nThe Charter Operating credit facilities contain representations and warranties, and customary affirmative and negative covenants, including restrictions on the ability of Charter Operating or any of its subsidiaries to incur liens securing indebtedness for borrowed money and on the ability of Charter Operating to consolidate, merge or convey or transfer substantially all of its assets.  The financial covenants measure performance against standards set for leverage to be tested as of the end of each quarter.  The Charter Operating credit facilities also contain customary events of default and the right to cure with respect to any defaults or events of default.\nAt December 31, 2024, Charter Operating had a consolidated leverage ratio of approximately \n2.7\n and a consolidated first lien leverage ratio of \n2.7\n.  Both ratios are in compliance with the ratios required by the Charter Operating credit facilities of \n5.0\n to \nF-18\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\n1.0\n consolidated leverage ratio and \n4.0\n to \n1.0\n consolidated first lien leverage ratio.  A failure by Charter Operating to maintain the financial covenants would result in an event of default under the Charter Operating credit facilities and the debt of CCO Holdings.  \nTime Warner Cable, LLC Notes and Debentures\nThe Time Warner Cable, LLC (\"TWC, LLC\") senior notes and debentures are guaranteed by CCO Holdings, Charter Operating and substantially all of the subsidiaries of Charter Operating (other than TWC, LLC) and rank equally with the liens on the collateral securing obligations under the Charter Operating notes and credit facilities.  Interest on each series of TWC, LLC senior notes and debentures is payable semi-annually (with the exception of the Sterling Notes, which is payable annually) in arrears. \nThe TWC, LLC indentures contain customary covenants relating to restrictions on the ability of TWC, LLC or any of its  material subsidiaries to incur liens securing indebtedness for borrowed money and on the ability of TWC, LLC and Time Warner Cable Enterprises LLC (\"TWCE\") to consolidate, merge or convey or transfer substantially all of their assets. The TWC, LLC indentures also contain customary events of default.\nThe TWC, LLC senior notes and debentures may be redeemed in whole or in part at any time at TWC, LLC’s option at a redemption price equal to the greater of (i) all of the applicable principal amount being redeemed and (ii) the sum of the present values of the remaining scheduled payments on the applicable TWC, LLC senior notes and debentures discounted to the redemption date on a semi-annual basis (with the exception of the Sterling Notes, which are on an annual basis), at a comparable government bond rate plus a designated number of basis points as further described in the indenture and the applicable note or debenture, plus, in each case, accrued but unpaid interest to, but not including, the redemption date.\nThe Company may offer to redeem all, but not less than all, of the Sterling Notes in the event of certain changes in the tax laws of the U.S. (or any taxing authority in the U.S.). This redemption would be at a redemption price equal to \n100\n% of the principal amount, together with accrued and unpaid interest on the Sterling Notes to, but not including, the redemption date.\nTWCE Debentures\nThe TWCE senior debentures are guaranteed by CCO Holdings, Charter Operating, and substantially all of the subsidiaries of Charter Operating (other than TWCE) and rank equally with the liens on the collateral securing obligations under the Charter Operating notes and credit facilities.  Interest on each series of TWCE senior debentures is payable semi-annually in arrears. The TWCE senior debentures are not redeemable before maturity.\nThe TWCE indentures contain customary covenants relating to restrictions on the ability of TWC, LLC, TWCE or any of its subsidiaries to incur liens securing indebtedness for borrowed money and on the ability of TWC, LLC and TWCE to consolidate, merge or convey or transfer substantially all of their assets. The TWCE indentures also contain customary events of default. \nLimitations on Distributions\nDistributions by the Company’s subsidiaries to a parent company for payment of principal on parent company notes are restricted under the CCO Holdings indentures discussed above, unless there is no default under the applicable indenture, and unless CCO Holdings’ leverage ratio test is met at the time of such distribution.  As of December 31, 2024, there was no default under any of these indentures and CCO Holdings met its applicable leverage ratio tests based on December 31, 2024 financial results. There can be no assurance that CCO Holdings will satisfy these tests at the time of the contemplated distribution.\nIn addition to the limitation on distributions under the various indentures, distributions by the Company’s subsidiaries may be limited by applicable law, including the Delaware Limited Liability Company Act, under which the Company’s subsidiaries may make distributions if they have “surplus” as defined in the act.\nF-19\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\nLiquidity and Future Principal and Interest Payments\nThe Company continues to have significant amounts of debt, and its business requires significant cash to fund principal and interest payments on its debt, capital expenditures and ongoing operations.  As set forth below, the Company has significant future principal and interest payments.  The Company continues to monitor the capital markets, and it expects to undertake refinancing transactions and utilize free cash flow and cash on hand to further extend or reduce the maturities of its principal obligations.  The timing and terms of any refinancing transactions will be subject to market conditions.  \nInterest payments on variable debt are estimated using amounts outstanding at December 31, 2024 and the average implied forward SOFR rates applicable for the quarter during the interest rate reset based on the yield curve in effect at December 31, 2024.  Actual interest payments will differ based on actual SOFR rates and actual amounts outstanding for applicable periods.  \nBased upon outstanding indebtedness as of December 31, 2024, the amortization of term loans, and the maturity dates for all senior and subordinated notes, total future principal and interest payments on the total borrowings under all debt agreements are as follows.   \nPrincipal\nInterest\n2025\n$\n2,105\n \n$\n4,844\n \n2026\n2,155\n \n4,704\n \n2027\n3,554\n \n4,517\n \n2028\n5,392\n \n4,302\n \n2029\n7,279\n \n4,036\n \nThereafter \n73,294\n \n38,534\n \n$\n93,779\n \n$\n60,937\n \n9.    \nEquipment Installment Plan Financing Facility\nIn June 2024, a bankruptcy remote special purpose vehicle and consolidated subsidiary of the Company, CCO EIP Financing, LLC, (the “SPV Borrower”) entered into a senior secured revolving credit facility to finance the purchase of equipment installment plan receivables (“EIP Receivables”) with a number of financial institutions (the “EIP Financing Facility”). \nThe revolving credit facility under the EIP Financing Facility bears interest on the outstanding borrowings based on lenders’ cost of funds plus an applicable margin and was \n5.78\n% as of December 31, 2024.  The EIP Financing Facility has a final maturity date of June 20, 2028, comprised of a one-year revolving loan period, subject to annual renewal, and if not renewed, cash flows on EIP Receivables are applied to amortize the loan which may occur over a period of up to three years. SPV Borrower may borrow up to $\n1.25\n billion under the EIP Financing Facility.  As of December 31, 2024, the carrying value of the EIP Financing Facility was $\n1.1\n billion and is included in the Company’s consolidated balance sheets. \nThe SPV Borrower’s sole business consists of the purchase or acceptance through capital contributions of the EIP Receivables from Spectrum Mobile Equipment, LLC, (the sole direct parent entity of SPV Borrower that originates the EIP Receivables) and the subsequent retransfer of or granting of a security interest in such EIP Receivables to the administrative agent under the EIP Financing Facility.  The SPV Borrower is a separate legal entity with its own separate creditors who will be entitled, upon its liquidation, to be satisfied out of the SPV Borrower’s assets prior to any assets or value in the SPV Borrower becoming available to the SPV Borrower’s equity holders, and the assets of the SPV Borrower are not available to pay creditors of any other affiliate of the Company. \nThe EIP Financing Facility is accounted for on a consolidated basis as a secured borrowing. As of December 31, 2024, pledged EIP Receivables with an unpaid principal balance of $\n1.6\n billion, included in accounts receivable, net and other noncurrent assets, and restricted cash of $\n47\n million, included in prepaid expenses and other current assets, are held by the SPV Borrower and reflected in the Company’s consolidated balance sheets. Receipts from mobile customers related to the underlying EIP Receivables are reflected as cash flows from operating activities and borrowings and repayments under the EIP Financing Facility are reflected as cash flows from financing activities in the Company’s consolidated statements of cash flows.\nF-20\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\n10.    \nCommon Stock\nCharter’s Class A common stock and Class B common stock are identical except with respect to certain voting, transfer and conversion rights.  Holders of Class A common stock are entitled to one vote per share. Charter’s Class B common stock represents the share issued to A/N.  One share of Charter’s Class B common stock has a number of votes reflecting the voting power of the Charter Holdings common units held by A/N as of the applicable record date on an as-exchanged basis, and is generally intended to reflect A/N’s economic interests in Charter Holdings.\nThe following table summarizes our shares outstanding for the three years ended December 31, 2024:\nClass A Common Stock\nClass B Common Stock\nBALANCE, December 31, 2021\n172,741,236\n \n1\n \nExercise of stock options\n552,442\n \n—\n \nRestricted stock issuances, net of cancellations\n6,845\n \n—\n \nRestricted stock unit vesting\n591,647\n \n—\n \nPurchase of treasury stock \n(\n21,240,774\n)\n—\n \nBALANCE, December 31, 2022\n152,651,396\n \n1\n \nExercise of stock options\n563,297\n \n—\n \nRestricted stock issuances, net of cancellations\n10,609\n \n—\n \nRestricted stock unit vesting\n358,290\n \n—\n \nPurchase of treasury stock \n(\n8,358,134\n)\n—\n \nBALANCE, December 31, 2023\n145,225,458\n \n1\n \nExercise of stock options\n373,278\n \n—\n \nRestricted stock issuances, net of cancellations\n13,353\n \n—\n \nRestricted stock unit vesting\n368,906\n \n—\n \nPurchase of treasury stock\n(\n4,034,569\n)\n—\n \nBALANCE, December 31, 2024\n141,946,426\n \n1\n \nShare Repurchases\nThe following represents the Company's purchase of Charter Class A common stock and the effect on the consolidated statements of cash flows during the years ended December 31, 2024, 2023 and 2022.  \nYear Ended December 31,\n2024\n2023\n2022\nShares\n$\nShares\n$\nShares\n$\nShare buybacks\n3,709,465\n \n$\n1,157\n \n7,879,962\n \n$\n3,127\n \n20,628,464\n \n$\n10,095\n \nIncome tax withholding\n157,480\n \n56\n \n220,281\n \n88\n \n310,391\n \n182\n \nExercise cost\n167,624\n \n— \n257,891\n \n— \n301,919\n \n— \n4,034,569\n \n$\n1,213\n \n8,358,134\n \n$\n3,215\n \n21,240,774\n \n$\n10,277\n \nF-21\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\nShare buybacks above include shares of Charter Class A common stock purchased from Liberty Broadband Corporation (“Liberty Broadband”) pursuant to the Existing LBB Letter Agreement, as amended by the Stockholders and Letter Agreement Amendment, as follows (see Note 18).\nYear Ended December 31,\n2024\n2023\n2022\nNumber of shares purchased\n980,558\n \n950,721\n \n6,168,174\n \nAmount of shares purchased\n$\n335\n \n$\n394\n \n$\n3,034\n \nAs of December 31, 2024, Charter had remaining board authority to purchase an additional $\n961\n million of Charter’s Class A common stock and/or Charter Holdings common units, excluding purchases from Liberty Broadband.  The Company also withholds shares of its Class A common stock in payment of income tax withholding owed by employees upon vesting of equity awards as well as exercise costs owed by employees upon exercise of stock options.  \nAt the end of each fiscal year, Charter’s board of directors approves the retirement of the then currently outstanding treasury stock and those shares were retired as of December 31, 2024 and 2023.  The Company accounts for treasury stock using the cost method and includes treasury stock as a component of total shareholders’ equity.  Upon retirement, these treasury shares are allocated between additional paid-in capital and accumulated deficit based on the cost of original issue included in additional paid-in capital.\n11.    \nNoncontrolling Interests\nNoncontrolling interests represents consolidated subsidiaries of which the Company owns less than \n100\n%.  The Company is a holding company whose principal asset is a controlling equity interest in Charter Holdings, the indirect owner of the Company’s cable systems.  Noncontrolling interests on the Company’s balance sheet primarily includes A/N’s equity interests in Charter Holdings, which is comprised of a common ownership interest. \nAs of December 31, 2024, A/N held \n16.5\n million Charter Holdings common units which are exchangeable at any time into either Charter Class A common stock on a one-for-one basis, or, at Charter’s option, cash, based on the then current market price of Charter Class A common stock. Net income of Charter Holdings attributable to A/N’s common noncontrolling interest for financial reporting purposes is based on the weighted average effective common ownership interest of approximately \n10\n% to \n11\n% and was $\n767\n million, $\n702\n million and $\n792\n million for the years ended December 31, 2024, 2023 and 2022, respectively.  Charter Holdings is required to make quarterly cash tax distributions (with annual true-ups) on a pro rata basis to its partners based on the partner with the highest proportionate cash tax requirement.  To the extent such tax distributions would exceed Charter’s cash tax requirements, it may waive its entitlement to tax distributions and, instead, issue a non-pro rata \"advance\" to A/N, which will accrue interest at the interest rate applicable to Charter Operating’s revolving credit facility and will reduce A/N’s exchange value into cash or Charter Class A common stock.  Charter Holdings distributed $\n155\n million, $\n156\n million and $\n110\n million to A/N as a pro rata tax distribution on its common units during the years ended December 31, 2024,  2023 and 2022, respectively.  \nThe following table represents Charter Holdings' purchase of Charter Holdings common units from A/N pursuant to the A/N Letter Agreement (see Note 18) and the effect on total shareholders' equity during the years ended December 31, 2024, 2023 and 2022.\nYear Ended December 31,\n2024\n2023\n2022\nNumber of units purchased\n589,319\n \n1,079,322\n \n3,171,681\n \nAmount of units purchased\n$\n189\n \n$\n427\n \n$\n1,602\n \nDecrease in noncontrolling interest based on carrying value\n$\n(\n138\n)\n$\n(\n240\n)\n$\n(\n700\n)\nDecrease in additional paid-in-capital, net of tax\n$\n(\n38\n)\n$\n(\n140\n)\n$\n(\n681\n)\nF-22\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\nTotal shareholders' equity was also adjusted during the years ended December 31, 2024, 2023 and 2022 due to changes in Charter Holdings' ownership as follows. \nYear Ended December 31,\n2024\n2023\n2022\nIncrease (decrease) in noncontrolling interest \n$\n13\n \n$\n(\n104\n)\n$\n(\n659\n)\nIncrease (decrease) in additional paid-in-capital, net of tax\n$\n(\n10\n)\n$\n78\n \n$\n497\n \n12.     \nAccounting for Derivative Instruments and Hedging Activities\nCross-currency derivative instruments are used to manage foreign exchange risk on the Sterling Notes by effectively converting £\n1.275\n billion aggregate principal amount of fixed-rate British pound sterling denominated debt, including annual interest payments and the payment of principal at maturity, to fixed-rate U.S. dollar denominated debt. The cross-currency swaps have maturities of June 2031 and July 2042. \nThe Company’s derivative instruments are not designated as hedges and are marked to fair value each period, with the impact recorded as a gain or loss on financial instruments in the consolidated statements of operations in other income (expense), net.  While these derivative instruments are not designated as hedges for accounting purposes, management continues to believe such instruments are closely correlated with the respective debt, thus managing associated risk.\n  The fair value of the Company's cross-currency derivatives, which are classified within Level 2 of the valuation hierarchy, was $\n504\n million and $\n440\n million and is included in other long-term liabilities on its consolidated balance sheets as of December 31, 2024 and 2023, respectively.   \nThe effect of financial instruments are recorded in other income (expense), net in the consolidated statements of operations and consisted of the following.\n \nYear Ended December 31,\n2024\n2023\n2022\nChange in fair value of cross-currency derivative instruments \n$\n(\n64\n)\n$\n130\n \n$\n(\n280\n)\nForeign currency remeasurement of Sterling Notes to U.S. dollars\n30\n \n(\n85\n)\n185\n \nGain (loss) on financial instruments, net\n$\n(\n34\n)\n$\n45\n \n$\n(\n95\n)\nF-23\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\n13.    \nRevenues\nThe Company’s revenues by product line are as follows:\nYear Ended December 31,\n2024\n2023\n2022\nInternet\n$\n23,360\n \n$\n23,032\n \n$\n22,222\n \nVideo\n15,126\n \n16,351\n \n17,460\n \nMobile service\n3,083\n \n2,243\n \n1,698\n \nVoice\n1,437\n \n1,510\n \n1,559\n \nResidential revenue\n43,006\n \n43,136\n \n42,939\n \nSmall and medium business\n4,371\n \n4,353\n \n4,350\n \nEnterprise\n2,883\n \n2,770\n \n2,677\n \nCommercial revenue\n7,254\n \n7,123\n \n7,027\n \nAdvertising sales\n1,780\n \n1,551\n \n1,882\n \nOther\n3,045\n \n2,797\n \n2,174\n \n$\n55,085\n \n$\n54,607\n \n$\n54,022\n \nResidential Services\nResidential customers are offered Internet, video, mobile and voice services primarily on a subscription basis.  Mobile services are sold under unlimited data plans or by-the-gig data usage plans.  The Company often provides multiple services to a customer.  The transaction price for a bundle of services may be less than the sum of the standalone selling prices of each individual service.  The Company allocates the bundle discount among the services to which the discount relates based on the relative standalone selling prices of those services. Generally, directly observable standalone selling prices are used for the revenue allocation.  Customers are invoiced for subscription services in advance of the service period.  Each subscription service provided is accounted for as a distinct performance obligation and revenue is recognized ratably over the monthly service period as the subscription services are delivered. Residential customers may generally cancel their subscriptions at the end of their monthly service period without penalty.  Each optional service purchased is generally accounted for as a distinct performance obligation when purchased and revenue is recognized when the service is provided.  Performance obligations relating to services provided by third-party content providers where the Company does not control the delivery of the services are presented net of costs paid because the Company is acting as an agent in such situations.  \nFor customer premise equipment (\"CPE\") where such CPE would qualify as a lease, the Company combines the operating lease with the subscription service revenue as a single performance obligation as the subscription service is the predominant component.  Installation fees are deferred over the period the fee remains material to the customer, which the Company has estimated to be approximately six months.  Sales commission costs are expensed as incurred as the amortization period is less than one year.  Right-of-entry costs represent upfront costs incurred related to agreements entered into with multiple dwelling units (“MDUs”) including landlords, real estate companies or owners to gain access to a building in order to market and service customers who reside in the building.  Right-of-entry costs are deferred as contract fulfillment costs and recognized over the term of the contracts.\nCustomers can purchase mobile equipment, including devices and accessory products, and have the option to pay for devices under interest-free monthly installment plans.  The Company does not impute interest on equipment installment plans sold through its direct channel as the inherent financing component is not considered significant based on the commercial objective of the plans, interest rates prevailing in the marketplace and credit risks of the Company's customers.  The sale of equipment is a separate performance obligation, therefore, revenue is recognized from the sale of equipment upon delivery and acceptance by the customer. \nFees imposed on the Company by various governmental authorities are passed through on a monthly basis to the Company’s customers and are periodically remitted to authorities. Fees of $\n941\n million, $\n993\n million and $\n1.1\n billion for the years ended December 31, 2024, 2023 and 2022, respectively, are reported in revenues on a gross basis with a corresponding operating \nF-24\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\nexpense because the Company is acting as a principal.  Certain taxes, such as sales taxes imposed on the Company’s customers, collected and remitted to state and local authorities are recorded on a net basis because the Company is acting as an agent in such situations.  \nCommercial Services\nSmall and medium business (\"SMB\") customers are offered Internet, video, mobile and voice services similar to those provided to residential customers. SMB customers may generally cancel their subscriptions at the end of their monthly service period without penalty.  Each subscription service provided is accounted for as a distinct performance obligation and revenue is recognized ratably over the monthly service period as the subscription services are delivered. \nServices to enterprise clients include more tailored communications products and managed service solutions to larger businesses, as well as high-capacity last-mile data connectivity services to mobile and wireline carriers on a wholesale basis. Services are primarily offered on a subscription basis with a contractually specified and non-cancelable service period, which is generally one to seven years with a weighted average term of approximately three years. Each subscription service provided is accounted for as a distinct performance obligation and revenue is recognized ratably over the contract period as the subscription services are delivered.  Enterprise subscription services are billed as monthly recurring charges to customers and related installation services, if applicable, are billed upon completion of the customer installation.  Installation services are not accounted for as distinct performance obligations, but rather a component of the connectivity services, and therefore upfront installation fees are deferred and recognized as revenue over the related contract period.  Enterprise sales commission costs are deferred and recognized using a portfolio approach over a weighted-average contract period.  \nAdvertising Services\nThe Company offers local, regional and national businesses the opportunity to advertise in individual and multiple service areas on cable television networks and digital outlets. Placement of advertising is accounted for as a distinct performance obligation and revenue is recognized at the point in time when the advertising is distributed.  In some service areas, the Company has formed advertising interconnects or entered into representation agreements with other video distributors, under which the Company sells advertising on behalf of those distributors. In other service areas, the Company has entered into representation agreements under which another operator in the area will sell advertising on the Company’s behalf. For representation arrangements in which the Company controls the sale of advertising and acts as the principal to the transaction, the Company recognizes revenue earned from the advertising customer on a gross basis and the amount remitted to the distributor as an operating expense. For other representation arrangements in which the Company does not control the sale of advertising and acts as an agent to the transaction, the Company recognizes revenue net of any fee remitted to the distributor.\nOther balances that are not separately presented on the consolidated balance sheets that relate to the recognition of revenue and collection of the related cash, as well as the deferred costs associated with our contracts with customers consist of the following for the periods presented:\nDecember 31,\n2024\n2023\nAccounts receivable, net:\nEquipment installment plan receivables, net\n$\n967\n \n$\n673\n \nOther noncurrent assets:\nEquipment installment plan receivables, net\n$\n980\n \n$\n687\n \nContract acquisition and fulfillment costs\n$\n701\n \n$\n616\n \nAccounts payables, accrued and other current liabilities:\nCustomer prepayments and upfront deferred installation fees\n$\n456\n \n$\n509\n \nF-25\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\nActivity in the allowance for doubtful accounts is summarized as follows for the years presented: \nYear Ended December 31,\n2024\n2023\n2022\nBalance, beginning of period\n$\n268\n \n$\n219\n \n$\n157\n \nCharged to expense\n762\n \n743\n \n758\n \nUncollected balances written off, net of recoveries\n(\n826\n)\n(\n694\n)\n(\n696\n)\nBalance, end of period\n$\n204\n \n$\n268\n \n$\n219\n \n14.     \nSegment Reporting\nThe Company’s operations are managed and reported to its Chief Executive Officer (“CEO”), the Company’s chief operating decision maker (\"CODM\"), on a consolidated basis.  The Company provides broadband connectivity services with all of its services delivered to customers over an advanced communications network.  The CODM assesses performance and allocates resources based on the Company’s consolidated statements of operations, as the converged network requires the CODM to manage and evaluate the results of the business in a consolidated manner to drive efficiencies and develop uniform strategies. Accordingly, key components and processes of the Company’s operations are managed centrally, including contracting for programming, capital and new technology development and deployment, plant engineering, customer service, marketing, legal and government affairs. Segment asset information is not used by the CODM to allocate resources.  Under this organizational and reporting structure, the Company has \none\n reportable segment.\nAs a single reportable segment entity, the Company’s segment performance measure is net income attributable to Charter shareholders. See Note 13 for a description of the Company's disaggregated revenues by product line.  Significant segment expenses are presented in the Company’s consolidated statements of operations.  \nAdditional disaggregated significant segment expenses on a functional basis, that are not separately presented on the Company’s consolidated statements of operations, are presented below.  \nOperating Costs and Expenses\nYear Ended December 31,\n2024\n2023\n2022\nProgramming\n$\n9,653\n \n$\n10,638\n \n$\n11,620\n \nOther costs of revenue\n6,351\n \n5,587\n \n4,804\n \nField and technology operations\n5,083\n \n5,113\n \n4,793\n \nCustomer operations\n3,221\n \n3,302\n \n3,294\n \nSales and marketing\n3,714\n \n3,653\n \n3,585\n \nStock compensation expense (see Note 15)\n651\n \n692\n \n470\n \nOther\n4,494\n \n4,420\n \n4,310\n \n$\n33,167\n \n$\n33,405\n \n$\n32,876\n \nProgramming costs consist primarily of costs paid to programmers for basic, premium, video on demand and pay-per-view programming. Other costs of revenue include costs directly related to providing Internet, video, mobile and voice services including mobile device costs, payments to franchise and regulatory authorities, payments for sports, local and news content produced by the Company and direct costs associated with selling advertising. Also included in other costs of revenue are content acquisition costs for the Los Angeles Lakers’ basketball games and Los Angeles Dodgers’ baseball games, which are recorded as games are exhibited over the contract period. Field and technology operations costs include indirect costs incurred to manage the Company's inside and outside cable network, including labor for the non-capitalizable portion of customer installations and service and repairs. Customer operations costs include call center labor costs for customer care, billing costs, bad debt expense, and collections. Sales and marketing costs represent the costs of selling and marketing our Internet, video, mobile and voice services to current and potential non-bulk residential and SMB customers, including labor cost. Other expense \nF-26\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\nincludes corporate overhead costs, as well as indirect costs associated with Spectrum Enterprise, Spectrum Reach, Spectrum Networks and Spectrum Community Solutions, including related sales and marketing and bad debt expenses.\nOther Operating (Income) Expense, Net\nYear Ended December 31,\n2024\n2023\n2022\nSpecial charges, net\n$\n139\n \n$\n198\n \n$\n273\n \n(Gain) loss on disposal of assets, net\n(\n12\n)\n(\n251\n)\n8\n \n$\n127\n \n$\n(\n53\n)\n$\n281\n \nSpecial charges, net primarily includes severance costs and net amounts of litigation settlements.  For the year ended December 31, 2022, special charges, net also includes an impairment on non-strategic assets and is offset by a gain related to the settlement of a multiemployer pension plan.  (Gain) loss on disposal of assets, net includes a $\n262\n million gain on sale of towers during the year ended December 31, 2023.\nOther Income (Expense), Net \nYear Ended December 31,\n2024\n2023\n2022\nGain (loss) on extinguishment of debt (see Note 8)\n$\n1\n \n$\n(\n3\n)\n$\n(\n3\n)\nGain (loss) on financial instruments, net (see Note 12)\n(\n34\n)\n45\n \n(\n95\n)\nOther pension benefits (costs), net (see Note 20)\n(\n23\n)\n(\n216\n)\n254\n \nLoss on equity investments, net (see Note 5)\n(\n331\n)\n(\n343\n)\n(\n100\n)\n$\n(\n387\n)\n$\n(\n517\n)\n$\n56\n \n15.\n \n    \nStock Compensation Plans\nCharter’s stock incentive plan provides for grants of nonqualified stock options, incentive stock options, stock appreciation rights, dividend equivalent rights, performance units and performance shares, share awards, phantom stock, restricted stock units and restricted stock.  Directors, officers and other employees of the Company and its subsidiaries, as well as others performing consulting services for the Company, are eligible for grants under the stock incentive plan.  The stock incentive plan allows for the issuance of up to \n23\n million shares of Charter Class A common stock (or units convertible into Charter Class A common stock).\nRestricted stock, restricted stock units, stock options as well as equity awards with market conditions are measured at the grant date fair value and amortized to stock compensation expense over the requisite service period.  The fair value of stock options is estimated on the date of grant using the Black-Scholes option-pricing model and the fair value of equity awards with market conditions is estimated on the date of grant using Monte Carlo simulations.  The grant date weighted average assumptions used during the years ended December 31, 2024, 2023 and 2022 were: risk-free interest rate of \n3.9\n%, \n3.7\n% and \n1.7\n%, respectively; expected lives of \n5.0\n years, \n4.8\n years and \n5.7\n years, respectively; and expected volatility of \n33\n%, \n31\n% and \n28\n%, respectively.  The Company’s volatility assumptions represent management’s best estimate and were based on a review of historical and implied volatility.  Expected lives were estimated using historical exercise data.  The valuations assume no dividends are paid.  The Company has elected an accounting policy to assume zero forfeitures for stock awards grants and account for forfeitures when they occur.\nStock options and restricted stock units generally cliff vest \nthree years\n from the date of grant.  Certain stock options and restricted stock units vest based on achievement of stock price hurdles.  Stock options generally expire \nten years\n from the grant date and restricted stock units have no voting rights.  Restricted stock generally vests \none year\n from the date of grant.  \nAs of December 31, 2024, total unrecognized compensation remaining to be recognized in future periods totaled $\n276\n million for stock options, $\n1\n million for restricted stock and $\n396\n million for restricted stock units and the weighted average period \nF-27\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\nover which they are expected to be recognized is \n2\n years for stock options, \n4\n months for restricted stock and \n2\n years for restricted stock units.\nA summary of the activity for Charter’s stock options for the years ended December 31, 2024, 2023 and 2022, is as follows (shares in thousands, except per share data):  \nYear Ended December 31,\n2024\n2023\n2022\nShares\nWeighted Average Exercise Price\nAggregate Intrinsic Value\nShares\nWeighted Average Exercise Price\nAggregate Intrinsic Value\nShares\nWeighted Average Exercise Price\nAggregate Intrinsic Value\nOutstanding, beginning of period\n12,658\n \n$\n398.51\n \n9,180\n \n$\n396.89\n \n8,433\n \n$\n362.26\n \nGranted\n1,381\n \n$\n360.82\n \n4,278\n \n$\n384.50\n \n1,469\n \n$\n577.64\n \nExercised\n(\n373\n)\n$\n256.94\n \n$\n39\n \n(\n563\n)\n$\n228.69\n \n$\n102\n \n(\n552\n)\n$\n295.51\n \n$\n133\n \nCanceled\n(\n292\n)\n$\n446.11\n \n(\n237\n)\n$\n486.77\n \n(\n170\n)\n$\n570.44\n \nOutstanding, end of period\n13,374\n \n$\n397.54\n \n$\n387\n \n12,658\n \n$\n398.51\n \n9,180\n \n$\n396.89\n \nWeighted average remaining contractual life\n6\nyears\n5\nyears\n6\nyears\nOptions exercisable, end of period\n6,766\n \n$\n378.31\n \n$\n385\n \n6,051\n \n$\n325.80\n \n5,320\n \n$\n266.78\n \nOptions expected to vest, end of period\n6,608\n \n$\n417.23\n \n$\n2\n \nWeighted average fair value of options granted\n$\n129.30\n \n$\n126.13\n \n$\n172.24\n \nA summary of the activity for Charter’s restricted stock for the years ended December 31, 2024, 2023 and 2022, is as follows (shares in thousands, except per share data): \nYear Ended December 31,\n2024\n2023\n2022\nShares\nWeighted Average Grant Price\nShares\nWeighted Average Grant Price\nShares\nWeighted Average Grant Price\nOutstanding, beginning of period\n11\n \n$\n331.45\n \n7\n \n$\n494.72\n \n5\n \n$\n654.33\n \nGranted\n13\n \n$\n268.55\n \n11\n \n$\n331.45\n \n7\n \n$\n494.72\n \nVested\n(\n11\n)\n$\n331.45\n \n(\n7\n)\n$\n494.72\n \n(\n5\n)\n$\n654.33\n \nCanceled\n—\n \n$\n—\n \n—\n \n$\n—\n \n—\n \n$\n—\n \nOutstanding, end of period\n13\n \n$\n268.55\n \n11\n \n$\n331.45\n \n7\n \n$\n494.72\n \nF-28\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\nA summary of the activity for Charter’s restricted stock units for the years ended December 31, 2024, 2023 and 2022, is as follows (shares in thousands, except per share data): \nYear Ended December 31, \n2024\n2023\n2022\nShares\nWeighted Average Grant Price\nShares\nWeighted Average Grant Price\nShares\nWeighted Average Grant Price\nOutstanding, beginning of period\n2,371\n \n$\n432.11\n \n1,266\n \n$\n545.00\n \n1,294\n \n$\n449.03\n \nGranted\n1,123\n \n$\n359.24\n \n1,561\n \n$\n359.07\n \n638\n \n$\n522.45\n \nVested\n(\n369\n)\n$\n595.28\n \n(\n358\n)\n$\n510.22\n \n(\n592\n)\n$\n307.67\n \nCanceled\n(\n174\n)\n$\n390.31\n \n(\n98\n)\n$\n440.14\n \n(\n74\n)\n$\n569.11\n \nOutstanding, end of period\n2,951\n \n$\n386.44\n \n2,371\n \n$\n432.11\n \n1,266\n \n$\n545.00\n \n16.    \nIncome Taxes \nThe Company recognizes deferred tax assets and liabilities for temporary differences between the financial reporting basis and the tax basis of the Company’s assets and liabilities and expected benefits of utilizing loss carryforwards.  Valuation allowances are established when management determines that it is more likely than not that some portion or the entire deferred tax asset will not be realized.  In evaluating the need for a valuation allowance, management takes into account various factors, including the expected level of future taxable income, available tax planning strategies and reversals of existing taxable temporary differences. The impact on deferred taxes of changes in tax rates and tax law, if any, applied to the years during which temporary differences are expected to be settled, are reflected in the consolidated financial statements in the period of enactment.  In determining the Company’s tax provision for financial reporting purposes, the Company establishes a reserve for uncertain tax positions unless such positions are determined to be “more likely than not” of being sustained upon examination, based on their technical merits. There is considerable judgment involved in making such a determination.  The Company recognizes interest and penalties accrued on uncertain income tax positions as part of the income tax provision.\n \nSubstantially all of the Company’s operations are held through Charter Holdings and its direct and indirect subsidiaries. Charter Holdings and the majority of its subsidiaries are generally limited liability companies that are not subject to income tax. However, certain of these limited liability companies are subject to state income tax. In addition, the subsidiaries that are corporations are subject to income tax. Generally, the taxable income, gains, losses, deductions and credits of Charter Holdings are passed through to its members, Charter and A/N. Charter is responsible for its share of taxable income or loss of Charter Holdings allocated to it in accordance with the Charter Holdings Limited Liability Company Agreement (“LLC Agreement”) and partnership tax rules and regulations. As a result, Charter's primary deferred tax component recorded in the consolidated balance sheets relates to its excess financial reporting outside basis, excluding amounts attributable to nondeductible goodwill, over Charter's tax basis in the investment in Charter Holdings.\nCharter Holdings, the indirect owner of the Company’s cable systems, generally allocates its taxable income, gains, losses, deductions and credits proportionately according to the members’ respective ownership interests, except for special allocations required under Section 704(c) of the Internal Revenue Code and the Treasury Regulations (“Section 704(c)”).  Pursuant to Section 704(c) and the LLC Agreement, each item of income, gain, loss and deduction with respect to any property contributed to the capital of the partnership shall, solely for tax purposes, be allocated among the members so as to take into account any variation between the adjusted basis of such property to the partnership for U.S. federal income tax purposes and its initial gross asset value using the “traditional method” as described in the Treasury Regulations.\nF-29\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\nIncome Tax Expense\nFor the years ended December 31, 2024, 2023, and 2022, the Company recorded income tax expense as shown below.  The tax provision in future periods will vary based on current and future temporary differences, as well as future operating results.\nYear Ended December 31,\n2024\n2023\n2022\nCurrent expense:\nFederal income taxes\n$\n(\n1,379\n)\n$\n(\n1,304\n)\n$\n(\n1,178\n)\nState income taxes\n(\n357\n)\n(\n369\n)\n(\n348\n)\nCurrent income tax expense\n(\n1,736\n)\n(\n1,673\n)\n(\n1,526\n)\nDeferred benefit (expense):\nFederal income taxes\n69\n \n208\n \n(\n55\n)\nState income taxes\n18\n \n(\n128\n)\n(\n32\n)\nDeferred income tax benefit (expense)\n87\n \n80\n \n(\n87\n)\nIncome tax expense\n$\n(\n1,649\n)\n$\n(\n1,593\n)\n$\n(\n1,613\n)\nThe Company’s effective tax rate differs from that derived by applying the applicable federal income tax rate of \n21\n% for the years ended December 31, 2024, 2023 and 2022 as follows: \nYear Ended December 31,\n2024\n2023\n2022\nStatutory federal income taxes\n$\n(\n1,575\n)\n$\n(\n1,439\n)\n$\n(\n1,567\n)\nStatutory state income taxes, net\n(\n157\n)\n(\n174\n)\n(\n257\n)\nChange in uncertain tax positions\n(\n177\n)\n(\n158\n)\n(\n163\n)\nNondeductible expenses\n(\n34\n)\n(\n34\n)\n(\n42\n)\nNet income attributable to noncontrolling interest\n191\n \n173\n \n195\n \nExcess stock compensation\n(\n21\n)\n1\n \n59\n \nFederal tax credits\n56\n \n75\n \n76\n \nTax rate changes\n33\n \n(\n129\n)\n47\n \nOther\n35\n \n92\n \n39\n \nIncome tax expense\n$\n(\n1,649\n)\n$\n(\n1,593\n)\n$\n(\n1,613\n)\nF-30\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\nDeferred Tax Assets (Liabilities)\nThe tax effects of these temporary differences that give rise to significant portions of the deferred tax assets and deferred tax liabilities at December 31, 2024 and 2023 are presented below.\n \nDecember 31,\n2024\n2023\nDeferred tax assets:\nCarryforwards\n$\n642\n \n$\n582\n \nAccrued and other\n535\n \n560\n \nTotal gross deferred tax assets\n1,177\n \n1,142\n \nLess: valuation allowance\n(\n15\n)\n(\n25\n)\nDeferred tax assets\n1,162\n \n1,117\n \nDeferred tax liabilities:\nInvestment in partnership\n(\n19,999\n)\n(\n20,061\n)\nAccrued and other\n(\n8\n)\n(\n10\n)\nDeferred tax liabilities\n(\n20,007\n)\n(\n20,071\n)\nNet deferred tax liabilities\n$\n(\n18,845\n)\n$\n(\n18,954\n)\nThe deferred tax liabilities on the investment in partnership above includes approximately $\n88\n million and $\n55\n million net deferred tax liabilities relating to certain indirect subsidiaries that file separate state income tax returns at December 31, 2024 and 2023, respectively.  \nCarryforwards\nCharter has federal tax net operating loss carryforwards that expire in 2035 resulting from the operations of Charter Communications Holdings Company, LLC (“Charter Holdco”) and its subsidiaries and from loss carryforwards received as a result of the merger with Time Warner Cable Inc. (“TWC”).  In addition, Charter has state tax net operating loss carryforwards that generally expire in the years 2025 through 2042.  Charter's federal tax loss carryforwards are subject to Section 382 and other restrictions.  Also included in carryforwards is Charter's Section 163(j) interest limitation, which is based on interest expense that is not deductible in the current year due to taxable income limitations.  The limited interest has an indefinite carryforward period and will become deductible when Charter generates taxable income sufficient to overcome the limitation.\nTax Receivable Agreement\nUnder the LLC Agreement, A/N has the right to exchange at any time some or all of its common units in Charter Holdings for Charter’s Class A common stock or cash, at Charter’s option. Pursuant to a Tax Receivable Agreement (\"TRA\") between Charter and A/N, Charter must pay to A/N \n50\n% of the tax benefit when realized by Charter from the step-up in tax basis resulting from any future exchange or sale of the common units.  Charter did not record a liability for this obligation as of the acquisition date since the tax benefit is dependent on uncertain future events that are outside of Charter’s control, such as the timing of a conversion or exchange. A future exchange or sale is not based on a fixed and determinable date and the exchange or sale is not certain to occur. If all of A/N's partnership units were to be exchanged or sold in the future, the undiscounted value of the obligation is currently estimated to be in the range of \nzero\n to $\n3.5\n billion depending on measurement of the tax step-up in the future and Charter’s ability to realize the tax benefit in the periods following the exchange or sale.  Factors impacting these calculations include, but are not limited to, the fair value of the equity at the time of the exchange and the effective tax rates when the benefits are realized.\nUncertain Tax Positions\nThe net amount of the unrecognized tax benefits recorded as of December 31, 2024 that could impact the effective tax rate is $\n604\n million.  These uncertain tax positions, if ever recognized in the financial statements, would be recorded in the \nF-31\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\nconsolidated statements of operations as part of the income tax provision.  \nA reconciliation of the beginning and ending amount of unrecognized tax benefits, exclusive of interest and penalties, is as follows: \nBALANCE, December 31, 2022\n$\n515\n \nActivity on prior year tax positions\n13\n \nAdditions on current year tax positions\n154\n \nReductions on settlements with taxing authorities and expirations\n(\n35\n)\nBALANCE, December 31, 2023\n647\n \nActivity on prior year tax positions\n1\n \nAdditions on current year tax positions\n131\n \nReductions on settlements with taxing authorities and expirations \n(\n36\n)\nBALANCE, December 31, 2024\n$\n743\n \nCharter is currently under examination by the Internal Revenue Service (\"IRS\") for income tax purposes for 2016, 2019, 2020 and 2021. Charter's 2022 and 2023 tax years remain open for examination and assessment. Charter’s 2017 and 2018 tax years remain open solely for purposes of loss and credit carryforwards.  Charter’s short period return dated May 17, 2016 (prior to the merger with TWC and acquisition of Bright House Networks, LLC) and prior years remain open solely for purposes of examination of Charter’s loss and credit carryforwards. The IRS is currently examining Charter Holdings’ income tax returns for 2016, 2019, 2020 and 2021.  Charter Holdings’ 2022 and 2023 tax years remain open for examination and assessment, while 2017 and 2018 remain open solely for purposes of credit carryforwards.  The IRS is currently examining TWC’s income tax returns for 2011, 2012 and 2015.  The 2013 and 2014 years were settled. The Company does not anticipate that these examinations will have a material impact on its consolidated financial position or results of operations. In addition, the Company is also subject to ongoing examinations of our tax returns by state and local tax authorities for various periods.  Activity related to these state and local examinations did not have a material impact on the Company's consolidated financial position or results of operations during the year ended December 31, 2024, nor does the Company anticipate a material impact in the future.\nF-32\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\n17.    \nEarnings Per Share\nBasic earnings per common share is computed by dividing net income attributable to Charter shareholders by the weighted average number of shares of common stock outstanding during the period. Diluted earnings per common share considers the impact of potentially dilutive securities using the treasury stock and if-converted methods and is based on the weighted average number of shares used for the basic earnings per share calculation, adjusted for the dilutive effect of stock options, restricted stock, restricted stock units, equity awards with market conditions and Charter Holdings common units.  Charter Holdings common units of \n17\n million, \n18\n million and \n20\n million for the years ended December 31, 2024, 2023 and 2022, respectively, were not included in the computation of diluted earnings per share as their effect would have been antidilutive.  \nThe following is the computation of diluted earnings per common share for the years presented.\nYear Ended December 31,\n2024\n2023\n2022\nNumerator:\nNet income attributable to Charter shareholders\n$\n5,083\n \n$\n4,557\n \n$\n5,055\n \nDenominator:\nWeighted average common shares outstanding, basic\n143,061,337\n \n149,208,188\n \n161,501,355\n \nEffect of dilutive securities:\nAssumed exercise or issuance of shares relating to stock plans\n2,302,434\n \n2,758,125\n \n2,932,241\n \nWeighted average common shares outstanding, diluted\n145,363,771\n \n151,966,313\n \n164,433,596\n \nBasic earnings per common share attributable to Charter shareholders\n$\n35.53\n \n$\n30.54\n \n$\n31.30\n \nDiluted earnings per common share attributable to Charter shareholders\n$\n34.97\n \n$\n29.99\n \n$\n30.74\n \n18.    \nRelated Party Transactions\nThe following sets forth certain transactions in which the Company and a director, executive officer, or other related party of the Company are involved or, in the case of the management arrangements, subsidiaries that are debt issuers that pay certain of their parent companies for services.\nCharter is a party to management arrangements with its subsidiary, Spectrum Management Holding Company, LLC (\"Spectrum Management\"), and certain of their subsidiaries.  Under these agreements, Charter, Spectrum Management and Charter Holdco provide management services for the cable systems owned or operated by their subsidiaries.  Costs associated with providing these services are charged directly to the Company’s operating subsidiaries.  All other costs incurred on behalf of Charter’s operating subsidiaries are considered a part of the management fee.  These costs are recorded as a component of operating costs and expenses, in the accompanying consolidated financial statements.  The management fee charged to the Company’s operating subsidiaries approximated the expenses incurred by Spectrum Management, Charter Holdco and Charter on behalf of the Company’s operating subsidiaries in 2024, 2023 and 2022.  \nLiberty Broadband and A/N\nUnder the terms of the Second Amended and Restated Stockholders Agreement among Charter, Liberty Broadband and A/N, dated as of May 23, 2015 (the “Existing Stockholders Agreement”), as amended by Amendment No. 1 to the Second Amended and Restated Stockholders Agreement and the Letter Agreement, dated as of November 12, 2024 (the “Stockholders and Letter Agreement Amendment”), the number of Charter’s directors is fixed at 13. Two designees selected by A/N are members of the board of directors of Charter and three designees selected by Liberty Broadband are members of Charter's Board of Directors. The remaining eight directors are not designated by either A/N or Liberty Broadband.  Each of A/N and Liberty Broadband is entitled to nominate at least one director to each of the committees of Charter’s Board of Directors, subject to applicable stock exchange listing rules and certain specified voting or equity ownership thresholds for each of A/N and Liberty Broadband, and provided that the Nominating and Corporate Governance Committee and the Compensation and Benefit Committee each have at least a majority of directors independent from A/N, Liberty Broadband and Charter (referred to as the “unaffiliated directors”). Each of the Nominating and Corporate Governance Committee and the Compensation and Benefits Committee is \nF-33\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\ncurrently comprised of three unaffiliated directors and one designee of each of A/N and Liberty Broadband. A/N and Liberty Broadband also have certain other committee designation and governance rights.  A description of the terms of the Stockholders and Letter Agreement Amendment is set forth below under “Stockholders and Letter Agreement Amendment.”\nIn December 2016, Charter and A/N entered into a letter agreement, as amended in December 2017 (the “A/N Letter Agreement”) that requires A/N to sell to Charter or to Charter Holdings, on a monthly basis, a number of shares of Charter Class A common stock or Charter Holdings common units that represents a pro rata participation by A/N and its affiliates in any repurchases of shares of Charter Class A common stock from persons other than A/N effected by Charter during the immediately preceding calendar month, at a purchase price equal to the average price paid by Charter for the shares repurchased from persons other than A/N during such immediately preceding calendar month. A/N and Charter both have the right to terminate or suspend the pro rata repurchase arrangement on a prospective basis. Pursuant to the TRA between Charter and A/N, Charter must pay to A/N \n50\n% of the tax benefit when realized by Charter from the step-up in tax basis resulting from any future exchange or sale of the common units.  See Note 16 for more information. \nIn February 2021, Charter and Liberty Broadband entered into a letter agreement (the “Existing LBB Letter Agreement”), as amended by the Stockholders and Letter Agreement Amendment. The Existing LBB Letter Agreement implemented Liberty Broadband’s obligations under the Existing Stockholders Agreement to participate in share repurchases by Charter.  Under the Existing LBB Letter Agreement, Liberty Broadband sold to Charter, generally on a monthly basis, a number of shares of Charter Class A common stock representing an amount sufficient for Liberty Broadband’s ownership of Charter to be reduced such that it did not exceed the ownership cap then applicable to Liberty Broadband under the Existing Stockholders Agreement at a purchase price per share equal to the volume weighted average price per share paid by Charter for shares repurchased during such immediately preceding calendar month other than (i) purchases from A/N, (ii) purchases in privately negotiated transactions or (iii) purchases for the withholding of shares of Charter Class A common stock pursuant to equity compensation programs of Charter.  The Existing LBB Letter Agreement was amended on November 12, 2024 pursuant to the Stockholders and Letter Agreement Amendment as described below under “Stockholders and Letter Agreement Amendment.”  \nGregory Maffei, a director of Charter and former President and CEO and director and holder of a \n3.7\n% voting interest in Liberty Broadband, is Chairman of the board of directors of Qurate Retail, Inc. (\"Qurate\") and Dr. John Malone, Chairman of the board of directors of Liberty Broadband and holder of a \n48.5\n% voting interest in Liberty Broadband, also serves on the Qurate board of directors.  As reported in SEC filings of Qurate, Mr. Maffei and Dr. Malone, Mr. Maffei has ownership of an approximate \n18.5\n% voting interest in Qurate and Dr. Malone has ownership of an approximate \n6.5\n% voting interest in Qurate.  Qurate wholly owns HSN, Inc. (“HSN”) and QVC, Inc. (“QVC”).  The Company has programming relationships with HSN and QVC.  For the years ended December 31, 2024, 2023 and 2022, the Company recorded revenue in aggregate of approximately $\n48\n million, $\n47\n million and $\n43\n million, respectively, from HSN and QVC as part of channel carriage fees and revenue sharing arrangements for home shopping sales made to customers in the Company’s footprint.  \nLiberty Broadband Combination\nOn November 12, 2024, Charter, Liberty Broadband, Fusion Merger Sub 1, LLC, a wholly owned subsidiary of Charter, and Fusion Merger Sub 2, Inc., a wholly owned subsidiary of Fusion Merger Sub 1, LLC, entered into an Agreement and Plan of Merger (as it may be amended or supplemented from time to time, the “merger agreement”), pursuant to which, subject to the terms and conditions set forth therein, Charter will acquire Liberty Broadband through the merger of Fusion Merger Sub 2, Inc. with and into Liberty Broadband (the “merger”), with Liberty Broadband surviving the merger and becoming an indirect wholly owned subsidiary of Charter.  Immediately following the merger, Liberty Broadband, as the surviving corporation of the merger, will merge with and into Fusion Merger Sub 1, LLC (the “upstream merger” and together with the merger, the “combination”), with Fusion Merger Sub 1, LLC surviving the upstream merger as a wholly owned subsidiary of Charter. \nAt the effective time of the merger (the “effective time”):\n•\neach share of (i) Liberty Broadband Series A common stock, par value $\n0.01\n per share (“Liberty Broadband Series A common stock”), (ii) Liberty Broadband Series B common stock, par value $\n0.01\n per share (“Liberty Broadband Series B common stock”), and (iii) Liberty Broadband Series C common stock, par value $\n0.01\n per share (“Liberty Broadband Series C common stock” and together with the Liberty Broadband Series A common stock and the Liberty Broadband Series B common stock, the “Liberty Broadband common stock”), in each case, issued and outstanding immediately prior to the effective time (other than certain excluded shares as set forth in the merger agreement) will be converted into the \nF-34\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\nright to receive \n0.236\n of a validly issued, fully paid and nonassessable share of Charter Class A common stock, par value $\n0.001\n per share (“Charter Class A common stock”); and\n•\neach share of Liberty Broadband Series A cumulative redeemable preferred stock, par value $\n0.01\n per share (“Liberty Broadband preferred stock”), issued and outstanding immediately prior to the effective time (other than excluded treasury shares as set forth in the merger agreement) will be converted into the right to receive one share of newly issued Charter Series A cumulative redeemable preferred stock, par value $\n0.001\n per share (“Charter preferred stock”). The Charter preferred stock will have substantially identical terms to the Liberty Broadband preferred stock, including a mandatory redemption date of March 8, 2039.  \nAs of December 31, 2024, Liberty Broadband’s principal assets currently consist of approximately \n45.3\n million shares of Charter Class A common stock and its subsidiary GCI, LLC, which is comprised of one operating entity, GCI Holdings, LLC (“GCI”), Alaska’s largest communications provider.  Pursuant to the merger agreement, Liberty Broadband has agreed to spin off GCI by way of a distribution to the stockholders of Liberty Broadband prior to the closing of the Merger Transaction.  The GCI distribution is expected to be taxable to Liberty Broadband and its stockholders, with Charter bearing the corporate level tax liability upon completion of the combination.  However, to the extent such corporate level tax liability exceeds $\n420\n million, Charter will be entitled under a tax receivables agreement to the portion of the tax benefits realized by GCI corresponding to such excess.  The companies currently expect the transaction to close on June 30, 2027, unless otherwise agreed, subject to the completion of the GCI spin-off and other customary closing conditions. \nFor additional information, see the definitive joint proxy statement/prospectus with respect to the combination, filed by Charter on January 22, 2025, including the sections entitled “The Combination” and “The Merger Agreement” included therein.\nVoting Agreements\nIn connection with the transactions contemplated by the merger agreement, on November 12, 2024, Dr. Malone’s affiliated holders of shares of Liberty Broadband common stock and Liberty Broadband preferred stock (collectively, the “Malone Group) entered into a voting agreement with Charter and Liberty Broadband, pursuant to which, subject to certain conditions, the Malone Group has committed to vote its shares of Liberty Broadband common stock and Liberty Broadband preferred stock representing approximately \n48.5\n% of the total voting power of the issued and outstanding shares of Liberty Broadband common stock and Liberty Broadband preferred stock, in the aggregate, in favor of the adoption of the merger agreement and the approval of the transactions contemplated thereby.\nIn addition, on November 12, 2024, Gregory B. Maffei and certain related holders of shares of Liberty Broadband common stock and Liberty Broadband preferred stock (collectively, the “Maffei Group”) entered into a voting agreement with Charter and Liberty Broadband, pursuant to which, subject to certain conditions, the Maffei Group has committed to vote its shares of Liberty Broadband common stock and Liberty Broadband preferred stock representing approximately \n3.7\n% of the total voting power of the issued and outstanding shares of Liberty Broadband common stock and Liberty Broadband preferred stock, in the aggregate, in favor of the adoption of the merger agreement and the approval of the transactions contemplated thereby.\nFor additional information, see the definitive joint proxy statement/prospectus with respect to the combination, filed by Charter on January 22, 2025, including the sections entitled “The Combination,” “The Merger Agreement,” “Other Agreements Related to the Combination - Malone Voting Agreement” and “Other Agreements Related to the Combination - Maffei Voting Agreement” included therein.\nStockholders and Letter Agreement Amendment\nSimultaneously with the entry into the merger agreement, Charter, Liberty Broadband and A/N entered into the Stockholders and Letter Agreement Amendment to amend (i) the Existing Stockholders Agreement and (ii) the Existing LBB Letter Agreement.  The Stockholders and Letter Agreement Amendment sets forth, among other things, the terms of Liberty Broadband’s participation in Charter’s share repurchases during the period between the execution of the merger agreement and the effective time of the merger agreement. Pursuant to the Stockholders and Letter Agreement Amendment, each month during the pendency of the proposed transaction, Charter will repurchase shares of Charter Class A common stock from Liberty Broadband in an amount equal to the greater of (i) $\n100\n million and (ii) the Liberty Broadband minimum liquidity threshold as set forth in the Stockholders and Letter Agreement Amendment, provided that if any repurchase would reduce Liberty \nF-35\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\nBroadband’s equity interest in Charter below \n25.25\n% after giving effect to such repurchase or if all or a portion of such repurchase is not permitted under applicable law, then Charter shall instead loan to Liberty Broadband an amount equal to the lesser of (x) the repurchase amount that cannot be repurchased and (y) the Liberty Broadband minimum liquidity threshold as set forth in the Stockholders and Letter Agreement Amendment less the repurchase amount that is repurchased, with such loan on the terms set forth in the Stockholders and Letter Agreement Amendment.  From and after the date Liberty Broadband’s exchangeable debentures are no longer outstanding, the amount of monthly repurchases will be the lesser of (i) $\n100\n million and (ii) an amount equal to the sum of (x) the amount needed in the reasonable judgment of Charter to maintain unrestricted cash balance of Liberty Broadband and its subsidiaries (other than GCI, GCI Spinco and their respective subsidiaries) or $50 million plus (y) the aggregate outstanding principal amount of the Liberty Broadband margin loan.  The purchase price payable by Charter to Liberty Broadband in connection with such monthly repurchases will equal (i) the average price paid by Charter for shares of Charter Class A common stock repurchased during the immediately preceding calendar month (excluding shares repurchased from A/N and certain other excluded repurchases) or (ii) if Charter has not engaged in any repurchases of shares of Charter Class A common stock during the immediately preceding calendar month (other than any repurchases from A/N and certain other excluded repurchases), a purchase price based on a Bloomberg volume-weighted average price methodology proposed by Charter and reasonably acceptable to Liberty Broadband. Liberty Broadband will apply the proceeds from any such repurchases or borrowings from Charter to repay certain of its outstanding indebtedness in accordance with the Stockholders and Letter Agreement Amendment. The Stockholders and Letter Agreement Amendment provides that Liberty Broadband will be exempt from the standstill restrictions and the ownership cap under the Existing Stockholders Agreement to the extent its ownership in Charter exceeds such ownership cap solely as a result of the repurchase provisions in the Stockholders and Letter Agreement Amendment.\nFor additional information, see the definitive joint proxy statement/prospectus with respect to the combination, filed by Charter on January 22, 2025, including the sections entitled “The Combination,” “The Merger Agreement” and “Other Agreements Related to the Combination - Stockholders and Letter Agreement Amendment” included therein.\nOther Agreements\nSimultaneously with the entry into the merger agreement, certain additional related agreements were entered into by Charter and Liberty Broadband, including:\n•\nAn Assumption and Joinder Agreement to Tax Sharing Agreement, by and among Charter, Liberty Broadband, Grizzly Merger Sub 1, LLC (successor to GCI Liberty, Inc.) (“Grizzly Merger Sub”) and Qurate, pursuant to which Charter agrees to assume, effective at the Effective Time, Liberty Broadband’s rights and obligations under the Tax Sharing Agreement, dated as of March 9, 2018, by and between Qurate and Grizzly Merger Sub; and\n•\nAn Assumption and Joinder Agreement to Indemnification Agreement, by and among Charter, Liberty Broadband, Grizzly Merger Sub, LV Bridge, LLC, Qurate and Liberty Interactive LLC, pursuant to which Charter agrees to assume, effective at the Effective Time, Liberty Broadband’s rights and obligations under the Indemnification Agreement, dated as of March 9, 2018, by and among Grizzly Merger Sub, Qurate, Liberty Interactive LLC and LV Bridge, LLC.\nFor additional information, see the definitive joint proxy statement/prospectus with respect to the combination, filed by Charter on January 22, 2025, including the sections entitled “The Combination,” “The Merger Agreement” and “Other Agreements Related to the Combination - Additional Transaction Agreements” included therein.\nEquity Investments\nThe Company has agreements with certain equity investees (see Note 5) pursuant to which the Company has made or received payments for the receipt of goods or services. The Company recorded payments to equity investees totaling $\n189\n million, $\n180\n million and $\n213\n million during the years ended December 31, 2024, 2023 and 2022, respectively.\n \nF-36\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\n19.    \nCommitments and Contingencies\nCommitments\nThe following table summarizes the Company’s payment obligations as of December 31, 2024 for its contractual obligations which consists of guaranteed minimum commitments, including rights negotiated directly with content owners for distribution on company-owned channels or networks, commitments related to our role as an advertising and distribution sales agent for third party-owned channels or networks, commitments to our customer premise equipment and device vendors, contractual obligations related to third-party network augmentation and guaranteed minimum commitments under the Company’s programming contracts.  \n2025\n$\n1,995\n \n2026\n1,344\n \n2027\n1,121\n \n2028\n728\n \n2029\n655\n \nThereafter \n4,945\n \n$\n10,788\n \nThe following items are not included in the contractual obligation table due to various factors discussed below.  However, the Company incurs these costs as part of its operations:\n•\nThe Company rents utility poles used in its operations.  Generally, pole rentals are cancelable on short notice, but the Company anticipates that such rentals will recur.  Rent expense incurred for pole rental attachments for the years ended December 31, 2024, 2023 and 2022 was $\n243\n million, $\n230\n million and $\n207\n million, respectively.  \n•\nThe Company pays franchise fees under multi-year franchise agreements based on a percentage of revenues generated from video service per year.  The Company also pays other franchise related costs, such as public education grants, under multi-year agreements.  Franchise fees and other franchise-related costs included in the accompanying statement of operations were $\n604\n million, $\n664\n million and $\n730\n million for the years ended December 31, 2024, 2023 and 2022 respectively.\n•\nThe Company has $\n425\n million in letters of credit, of which $\n35\n million are issued under the Charter Operating credit facility, primarily to its various casualty carriers as collateral for reimbursement of workers' compensation, auto liability and general liability claims, as well as $\n416\n million of surety bonds.  \nLegal Proceedings\nThe California Attorney General and the Alameda County, California District Attorney are investigating whether certain of Charter’s waste disposal policies, procedures and practices are in violation of the California Business and Professions Code and the California Health and Safety Code. That investigation was commenced in January 2014. A similar investigation involving TWC was initiated in February 2012.  Charter is cooperating with these investigations.  While the Company is unable to predict the outcome of these investigations, it does not expect that the outcome will have a material effect on its operations, financial condition, or cash flows. \nThe Company is a defendant or co-defendant in several lawsuits involving alleged infringement of various intellectual property relating to various aspects of its businesses. Other industry participants are also defendants in certain of these cases or related cases. In the event that a court ultimately determines that the Company infringes on any intellectual property, the Company may be subject to substantial damages and/or an injunction that could require the Company or its vendors to modify certain products and services the Company offers to its subscribers, as well as negotiate royalty or license agreements with respect to the intellectual property at issue. While the Company believes the lawsuits are without merit and intends to defend the actions vigorously, no assurance can be given that any adverse outcome would not be material to the Company’s operations, consolidated financial condition, results of operations, or liquidity. The Company cannot predict the outcome of any such claims nor can it reasonably estimate a range of possible loss.\nThe Company is party to other lawsuits, claims and regulatory inquiries or investigations that arise in the ordinary course of conducting its business or in connection with the Company’s participation in government funding programs. The ultimate \nF-37\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\noutcome of these other legal matters pending against the Company cannot be predicted, and although such lawsuits and claims are not expected individually to have a material adverse effect on the Company’s operations, consolidated financial condition, results of operations or liquidity, such lawsuits could have, in the aggregate, a material adverse effect on the Company’s operations, consolidated financial condition, results of operations or liquidity. Whether or not the Company ultimately prevails in any particular lawsuit or claim, litigation can be time consuming and costly and injure the Company’s reputation.\n20.    \nEmployee Benefit Plans\nPension Plans\nThe Company sponsors qualified and unqualified defined benefit pension plans that provide pension benefits to a majority of employees who were employed by TWC before the merger with TWC.  Pension benefits are based on formulas that reflect the employees’ years of service and compensation during their employment period.  Actuarial gains or losses are changes in the amount of either the benefit obligation or the fair value of plan assets resulting from experience different from that assumed or from changes in assumptions.  The Company has elected to follow a mark-to-market pension accounting policy for recording the actuarial gains or losses annually during the fourth quarter, or earlier if a remeasurement event occurs during an interim period.\nIn June 2023, the Company purchased a buy-in group annuity contract (“GAC”) from a highly rated insurer and in October 2023, the Company announced plans to fully terminate the qualified pension plan. The benefit obligation for the qualified pension plan is determined on a plan termination basis for which it is assumed that a portion of eligible active and deferred vested participants will elect lump sum payments.  Pension obligations will be distributed through a combination of lump sum payments to eligible participants who elect such payments and through the GAC.\nChanges in the projected benefit obligation, fair value of plan assets and funded status of the pension plans from January 1 through December 31 are presented below:\n \n2024\n2023\nProjected benefit obligation at beginning of year\n$\n2,426\n \n$\n2,243\n \nInterest cost\n108\n \n117\n \nActuarial (gain) loss\n(\n141\n)\n222\n \nSettlement\n(\n127\n)\n(\n97\n)\nBenefits paid\n(\n60\n)\n(\n59\n)\nProjected benefit obligation at end of year\n \n$\n2,206\n \n$\n2,426\n \nAccumulated benefit obligation at end of year \n$\n2,206\n \n$\n2,426\n \nFair value of plan assets at beginning of year\n$\n2,553\n \n$\n2,583\n \nActual return on plan assets\n(\n56\n)\n124\n \nEmployer contributions\n3\n \n2\n \nSettlement\n(\n127\n)\n(\n97\n)\nBenefits paid\n(\n60\n)\n(\n59\n)\nFair value of plan assets at end of year \n$\n2,313\n \n$\n2,553\n \nFunded status\n$\n107\n \n$\n127\n \nF-38\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\nThe components of net periodic benefit (cost) for the years ended December 31, 2024, 2023 and 2022 consisted of the following:\nYear Ended December 31,\n2024\n2023\n2022\nInterest cost\n$\n(\n108\n)\n$\n(\n117\n)\n$\n(\n103\n)\nExpected return on plan assets\n113\n \n124\n \n156\n \nRemeasurement gain (loss)\n(\n28\n)\n(\n223\n)\n201\n \nNet periodic pension benefit (cost)\n$\n(\n23\n)\n$\n(\n216\n)\n$\n254\n \nThe remeasurement loss recorded during the year ended December 31, 2024 was primarily driven by losses to record pension assets to fair value.  The remeasurement loss recorded during the year ended December 31, 2023 primarily reflects the measurement of the projected benefit obligations under a plan termination basis. The remeasurement gain recorded during the year ended December 31, 2022 was primarily driven by changes in the discount rate as well as gains or losses to record pension assets to fair value.\nThe discount rates used to determine benefit obligations as of December 31, 2024 and 2023 were \n5.08\n% and \n4.65\n%, respectively.  The Company utilized the 417(e) Applicable Mortality Table for lump sums for the portion of the benefit obligation not covered by the GAC as of December 31, 2024 and the Pri-2012/MP 2020 mortality table published by the Society of Actuaries to measure the benefit obligations as of December 31, 2022.  \nWeighted average assumptions used to determine net periodic benefit costs consisted of the following:\nYear ended December 31,\n2024\n2023\n2022\nExpected long-term rate of return on plan assets\n5.00\n \n%\n5.00\n \n%\n5.00\n \n%\nDiscount rate \n4.65\n \n%\n5.46\n \n%\n3.01\n \n%\nIn developing the expected long-term rate of return on plan assets, the Company considered the pension portfolio’s composition, past average rate of earnings and the Company’s future asset allocation targets.  The weighted average expected long-term rate of return on plan assets and discount rate used to determine net periodic pension benefit (cost) for the year ended December 31, 2025 are expected to be \n5.00\n% and \n5.08\n%, respectively.  The Company determined the discount rates used to determine benefit obligations and net periodic pension benefit (cost) based on the yield of a large population of high-quality corporate bonds with cash flows sufficient in timing and amount to settle projected future defined benefit payments.\nPension Plan Assets \nThe assets of the qualified pension plan are held in a master trust in which the qualified pension plan is the only participating plan (the “Master Trust”). The investment policy for the qualified pension plan is to manage the assets of the Master Trust with the objective to provide for pension liabilities to be met, seeking to maintain retirement income security for the participants of the plan and their beneficiaries. The investment portfolio is a mix of a GAC and pooled funds invested in fixed income securities, equity securities and certain alternative investments with the objective of matching plan liability performance, diversifying risk and achieving a target investment return.  Pension assets are managed in a balanced portfolio comprised of two major components: a return-seeking portion and a liability-matching portion. \nAs a result of the Company’s decision to terminate the qualified pension plan, the Company’s investment strategy has transitioned to liquidating and winding down the portfolio’s remaining return-seeking investments in a timely and orderly manner, while managing the liability-matching investments to hedge the interest rate risk of the liability for which the Company is still responsible (i.e., the liability not assumed by the GAC).\nF-39\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\nThe following tables set forth the investment assets of the qualified pension plan by level within the fair value hierarchy as of December 31, 2024 and 2023:\nDecember 31, 2024\nDecember 31, 2023\nFair Value\nLevel 2\nLevel 3\nFair Value\nLevel 2\nLevel 3\nCollective trust funds\n(a)\n$\n806\n \n$\n806\n \n$\n—\n \n$\n745\n \n$\n745\n \n$\n—\n \nGroup annuity contract\n(b)\n1,363\n \n—\n \n1,363\n \n1,464\n \n—\n \n1,464\n \nTotal investment assets\n2,169\n \n$\n806\n \n$\n1,363\n \n2,209\n \n$\n745\n \n$\n1,464\n \nAccrued investment income and other receivables\n2\n \n4\n \nAccrued liabilities\n—\n \n(\n2\n)\nInvestments measured at net asset value\n(c)\n142\n \n342\n \nFair value of plan assets\n$\n2,313\n \n$\n2,553\n \n(a)\nCollective trust funds consist of bond funds with corporate and U.S. treasury debt securities,\n \nequity funds with global equity index, infrastructure and real estate securities and short-term investment strategies comprised of instruments issued or fully guaranteed by the U.S. government and/or its agencies and multi-strategy funds, which are valued using the net assets provided by the administrator of the fund.  The value of each fund is based on the readily determinable fair value of the underlying assets owned by the fund, less liabilities, and then divided by the number of units outstanding. \n(b)\nIn June 2023, the Company purchased a buy-in GAC which was initially recorded at the $\n1.4\n billion purchase price and subsequently adjusted to fair value using changes to market conditions impacting the cash flow assumptions that were priced into the original contract.\n(c)\nAs a practical expedient, certain investment classes which hold securities that are not readily available for redemption and are measured at fair value using the net asset value (\"NAV\") per share (or its equivalent) have not been classified in the fair value hierarchy.  The primary investment classes include alternative, fixed income and real estate funds.  Certain investments report NAV per share on a month or quarter lag.  There are no material unfunded commitments with respect to these investment classes.\nThe following table represents a rollforward of the GAC, which consist of Level 3 assets, as of December 31, 2024:\nYear Ended December 31,\n2024\n2023\nBalance, beginning of period\n$\n1,464\n \n$\n—\n \nPurchases\n—\n \n1,430\n \nUnrealized gain (loss)\n(\n101\n)\n34\n \nBalance, end of period\n$\n1,363\n \n$\n1,464\n \nPension Plan Contributions\nThe Company made no cash contributions to the qualified pension plan during the years ended December 31, 2024, 2023 and 2022; however, the Company may make discretionary cash contributions to the qualified pension plan in the future. Such contributions will be dependent on a variety of factors, including current and expected interest rates, asset performance, the funded status of the qualified pension plan and management’s judgment. For the nonqualified unfunded pension plan, the Company will continue to make contributions during 2025 to the extent benefits are paid.\nBenefit payments for the pension plans are expected to be $\n209\n million in 2025, $\n185\n million in 2026, $\n176\n million in 2027, $\n168\n million in 2028, $\n163\n million in 2029 and $\n741\n million in 2030 to 2034.\nF-40\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\nDefined Contribution Benefit Plans\nThe Company’s employees may participate in the Charter Communications, Inc. 401(k) Savings Plan (the “401(k) Plan”).  Employees that qualify for participation can contribute up to \n50\n% of their salary, on a pre-tax basis, subject to a maximum contribution limit as determined by the IRS.  The Company’s matching contribution is discretionary and is equal to \n100\n% of the amount of the salary reduction the participant elects to defer (up to \n6\n% of the participant’s eligible compensation), excluding any catch-up contributions and is paid by the Company on a per pay period basis. \nFor employees who are not eligible to participate in the Company’s long-term incentive plan and who are not covered by a collective bargaining agreement, the Company offers a contribution to the Retirement Accumulation Plan (\"RAP\"), equal to \n3\n% of eligible pay.  The Company made contributions to the 401(k) plan and RAP totaling $\n574\n million, $\n566\n million and $\n506\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\n21.    \nRecently Issued Accounting Standards\nAccounting Standards Update \n(\n“ASU”) No. 2023-07, Improvements to Reportable Segment Disclosures (“ASU 2023-07”)\nIn November 2023, the FASB issued ASU 2023-07, that improves disclosures about a public entity’s reportable segments and addresses requests from investors and other allocators of capital for additional, more detailed information about a reportable segment’s expenses.  The standard requires public entities to disclose, on an annual and interim basis, significant segment expenses that are regularly provided to the chief operating decision maker.  Additionally, public entities with a single reportable segment must provide all the disclosures required by ASU 2023-07, as well as all existing segment disclosures in accordance with Accounting Standards Codification 280. ASU 2023-07 is effective for annual periods beginning after December 15, 2023 (year ending December 31, 2024 for the Company). The Company adopted ASU 2023-07 for the year ended December 31, 2024 (see Note 14).\nASU No. 2023-09, Improvements to Income Tax Disclosures (“ASU 2023-09”)\nIn December 2023, the FASB issued ASU 2023-09, that addresses requests for improved income tax disclosures from investors, lenders, creditors, and other allocators of capital that use the financial statements to make capital allocation decisions.  The standard requires enhanced disclosures primarily related to existing rate reconciliation and income taxes paid information to help investors better assess how a company’s operations and related tax risks and tax planning and operational opportunities affect the company’s tax rate and prospects for future cash flows.  ASU 2023-09 improves the transparency of income tax disclosures by requiring (1) consistent categories and greater disaggregation of information in the rate reconciliation and (2) income taxes paid disaggregated by jurisdiction. It also includes certain other amendments to improve the effectiveness of income tax disclosures.  ASU 2023-09 is effective for annual periods beginning after December 15, 2024 (year ending December 31, 2025 for the Company). Early adoption is permitted.  The Company expects the adoption of the standard to result in additional disaggregation in the income tax footnote disclosures.\nASU No. 2024-03, Disaggregation of Income Statement Expenses - DISE (“ASU 2024-03”)\nIn November 2024, the FASB issued ASU 2024-03, that requires new financial statement disclosures in tabular format, disaggregating information about prescribed categories underlying any relevant income statement expense caption.  Qualitative disclosures about any remaining amounts in relevant expense line items must be provided. Separate disclosures of total selling expenses and an entity’s definition of those expenses are also required.  ASU 2024-03 is effective for annual periods beginning after December 15, 2026 (year ending December 31, 2027 for the Company). Early adoption is permitted.  The Company expects the adoption of the standard to result in additional disaggregation of expense captions within its footnote disclosures.\n \nF-41\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\n22.\n \n    \nParent Company Only Financial Statements \nAs the result of limitations on, and prohibitions of, distributions, substantially all of the net assets of the consolidated subsidiaries are restricted from distribution to Charter, the parent company.  \nThe following condensed parent-only financial statements of Charter account for the investment in Charter Holdco under the equity method of accounting.  Comprehensive income equaled net income for the years ended December 31, 2024, 2023 and 2022.  The financial statements should be read in conjunction with the consolidated financial statements of the Company and notes thereto. \nCharter Communications, Inc. (Parent Company Only)\nCondensed Balance Sheets\nDecember 31,\n2024\n2023\nASSETS\nReceivables from related party\n$\n10\n \n$\n32\n \nPrepaid expenses and other current assets\n19\n \n20\n \nInvestment in subsidiaries\n35,494\n \n30,801\n \nOther noncurrent assets\n21\n \n7\n \nTotal assets\n$\n35,544\n \n$\n30,860\n \nLIABILITIES AND SHAREHOLDER'S EQUITY \nCurrent liabilities\n$\n397\n \n$\n235\n \nDeferred income taxes\n18,749\n \n18,883\n \nLoans payable - related party\n50\n \n12\n \nOther long-term liabilities\n761\n \n644\n \nShareholder's equity\n15,587\n \n11,086\n \nTotal liabilities and shareholder's equity\n$\n35,544\n \n$\n30,860\n \nF-42\nCHARTER COMMUNICATIONS, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDecember 31, 2024, 2023 AND 2022\n(dollars in millions, except share or per share data or where indicated)\nCharter Communications, Inc. (Parent Company Only)\nCondensed Statements of Operations\nYear Ended December 31,\n2024\n2023\n2022\nREVENUES\n$\n3\n \n$\n1\n \n$\n4\n \nCOSTS AND EXPENSES:\nOperating costs and expenses \n3\n \n1\n \n4\n \nOther operating income, net\n—\n \n(\n60\n)\n—\n \n3\n \n(\n59\n)\n4\n \nIncome from operations\n—\n \n60\n \n—\n \nOTHER INCOME (EXPENSE):\nInterest income (expense), net\n(\n4\n)\n(\n4\n)\n2\n \nEquity in income of subsidiaries\n6,640\n \n6,021\n \n6,587\n \n6,636\n \n6,017\n \n6,589\n \nIncome before income taxes\n6,636\n \n6,077\n \n6,589\n \nIncome tax expense\n(\n1,553\n)\n(\n1,520\n)\n(\n1,534\n)\nNet income\n$\n5,083\n \n$\n4,557\n \n$\n5,055\n \nCharter Communications, Inc. (Parent Company Only)\nCondensed Statements of Cash Flows\nYear Ended December 31,\n2024\n2023\n2022\nNET CASH FLOWS FROM OPERATING ACTIVITIES\n$\n(\n1,389\n)\n$\n(\n1,364\n)\n$\n(\n1,247\n)\nCASH FLOWS FROM INVESTING ACTIVITIES:\nContribution to subsidiaries\n(\n425\n)\n(\n152\n)\n(\n33\n)\nDistributions from subsidiaries\n2,960\n \n4,711\n \n11,246\n \nNet cash flows from investing activities\n2,535\n \n4,559\n \n11,213\n \nCASH FLOWS FROM FINANCING ACTIVITIES:\nProceeds from exercise of stock options\n32\n \n22\n \n5\n \nPurchase of treasury stock\n(\n1,213\n)\n(\n3,215\n)\n(\n10,277\n)\nNet cash flows from related party loans\n35\n \n(\n2\n)\n306\n \nNet cash flows from financing activities\n(\n1,146\n)\n(\n3,195\n)\n(\n9,966\n)\nNET INCREASE IN CASH AND CASH EQUIVALENTS\n—\n \n—\n \n—\n \nCASH AND CASH EQUIVALENTS, beginning of period\n—\n \n—\n \n—\n \nCASH AND CASH EQUIVALENTS, end of period\n$\n—\n \n$\n—\n \n$\n—\n \nF-43"
  }
}