{
  "ticker": "CL",
  "cik": "0000021665",
  "company_name": "COLGATE PALMOLIVE CO",
  "filing_date": "2025-02-13",
  "accession": "0000021665-25-000008",
  "primary_doc": "cl-20241231.htm",
  "item_sections": {
    "item1": "Item 1A “Risk Factors” of this Annual Report on Form 10-K.\nBusiness Strategy\nTo achieve our business and financial objectives, we are focused on delivering consistent compounded earnings per share growth through driving organic sales growth, operational efficiencies and leveraging the strength of our balance sheet. We believe increased household penetration and improved brand health are the keys to consistent organic sales growth and aim to achieve these through science-led, core and premium innovation, pursuing higher-growth adjacent categories and segments and expanding in faster-growing channels and markets. We aim to deliver margin expansion and cash flow growth through operating leverage and efficiency. We continue to prioritize our investments in high growth segments within our Oral Care, Personal Care and Pet Nutrition businesses. We also seek to lead in the development of human capital and to maximize the impact of our Sustainability & Social Impact Strategy. We are building and scaling our capabilities in areas such as innovation, digital, data, analytics and artificial intelligence, enabling us to be more responsive in today’s rapidly changing world. We continue to invest behind our brands, including through advertising, and to develop initiatives to build strong relationships with consumers, retailers and dental, veterinary and skin health professionals. We continue to believe that growth opportunities are greater in those areas of the world in which economic development and rising consumer incomes expand the size and number of markets for our products.\nThe investments needed to drive growth are supported through continuous, Company-wide initiatives to lower costs and increase effective asset utilization. Through these initiatives, which are referred to as our funding-the-growth initiatives, we seek to become even more effective and efficient throughout our businesses. These initiatives are designed to reduce costs associated with direct materials, indirect expenses, distribution and logistics and advertising and promotional materials, among other things, and encompass a wide range of projects, examples of which include raw material substitution, reduction of packaging materials, consolidating suppliers to leverage volumes and increasing manufacturing efficiency through SKU reductions and formulation simplification. \nSignificant Items Impacting Comparability\nDuring the quarter ended June 30, 2023, we reassessed with our legal and tax advisers certain tax deductions taken in prior years by one of our subsidiaries and concluded that it was more likely than not that the deductions would not be sustained by the courts in that jurisdiction. The value of the tax deductions was not material to us in any year in which they were taken. The cumulative effect of the change in tax position of $148 was reflected as a discrete item in the quarter ended June 30, 2023 income tax expense, partially offset by the reversal of certain prior years’ withholding tax reserves of $22 that were no longer required (hereinafter referred to as the “foreign tax matter”). The tax liability was paid in the quarter ended September 30, 2023. See Note 10, Income Taxes, to the Consolidated Financial Statements for additional information.\nDuring the quarter ended March 31, 2023, we recorded a charge of $267 as a result of a decision of the United States Court of Appeals for the Second Circuit (the “Second Circuit”) affirming a grant of summary judgment to the plaintiffs in a \n27\n(Dollars in Millions Except Per Share Amounts)\nlawsuit under the Employee Retirement Income Security Act (“ERISA”) seeking the recalculation of benefits and other relief associated with a 2005 residual annuity amendment to the Colgate-Palmolive Company Employees’ Retirement Income Plan (the “Retirement Plan”). The decision resulted in an increase in the obligations of the Retirement Plan, which based on the current funded status of the Retirement Plan and depending on further developments in the litigation, may require a cash contribution by the Company in 2025. In June 2023, we filed a petition for certiorari to the United States Supreme Court requesting permission for an appeal to that court, which was denied in October 2023. Also, in June 2023, the plaintiffs filed a motion to enter a revised final judgment in the United States District Court for the Southern District of New York (the “District Court”) to address certain unresolved calculation issues, which we opposed. In March 2024, the District Court granted the plaintiffs’ motion and found for the plaintiffs on those calculation issues. We have appealed that decision to the Second Circuit. See Note 12, Commitments and Contingencies to the Consolidated Financial Statements for additional information.\nDuring the quarter ended March 31, 2023, we announced a voluntary recall of select Fabuloso multi-purpose cleaner products sold in the United States and Canada. The costs associated with the voluntary recall had a $25 impact on our Operating profit in the quarter ended March 31, 2023. \nOn January 27, 2022, the Board approved a targeted productivity program (the “2022 Global Productivity Initiative”). All initiatives under the program have been implemented and the program concluded on December 31, 2024. The 2022 Global Productivity Initiative resulted in the reallocation of resources towards our strategic priorities and faster growth businesses, efficiencies in our operations and the streamlining of our supply chain to reduce structural costs. Total pretax charges from the implementation of the 2022 Global Productivity Initiative were $228 ($186 aftertax). Total annualized pretax savings from the 2022 Global Productivity Initiative were approximately $125 ($100 aftertax). See “Restructuring and Related Implementation Charges” below and Note 3, Restructuring and Related Implementation Charges to the Consolidated Financial Statements for additional information.\nIn the years ended December 31, 2024 and 2023, we incurred pretax costs of $85 (aftertax costs of $73) and $32 (aftertax costs of $25), respectively, resulting from the 2022 Global Productivity Initiative.\nOutlook\nLooking forward, we expect global macroeconomic, political and market conditions to remain challenging, including as a result of inflation, high interest rates, foreign currency volatility and developments in trade relations following the imposition of new and/or additional tariffs by the United States and other countries. We have taken and are taking additional pricing to try to offset the increases in raw and packaging material costs we have seen in recent years. This has negatively impacted consumer demand for our products. Additionally, inflation has impacted the broader economy with consumers around the world facing widespread rising prices as well as high interest rates resulting from measures to address inflation. \nRecent developments in trade relations and the imposition of new and/or additional tariffs by the United States and other countries, including following the United States’ February 2025 executive orders imposing tariffs on imports from Canada, Mexico and China, may contribute to inflationary pressures and, as a result, may impact consumer demand for our products. We are following the dynamic situation closely and evaluating the impact of such tariffs and any retaliatory actions taken by other countries on our business, results of operations, cash flows and financial condition. While we have made and will make efforts to mitigate the impact of these and any additional tariffs imposed by the United States and/or other countries, they could impact the cost and/or price of our products, the cost and availability of raw and packaging materials and commodities and/or consumer demand for our products due to, among other things, the impact of such tariffs on the global economy, inflationary pressures or geopolitical relations. \nSuch inflation and developments in trade relations as well as high interest rates may negatively impact consumer consumption or discretionary spending and/or change their purchasing patterns by foregoing purchasing certain of our products or by switching to “private label” or to our lower-priced product offerings. Although we continue to devote significant resources to support our brands and market our products at multiple price points, these changes could reduce demand for and sales volumes of our products or result in a shift in our product mix from higher margin to lower margin product offerings. In light of this challenging environment, we expect continued volatility across all of our categories and it is therefore difficult to predict category growth rates in the near term.\n28\n(Dollars in Millions Except Per Share Amounts)\nGiven that approximately two-thirds of our Net sales originate in markets outside the U.S., we have experienced and will likely continue to experience volatile foreign currency fluctuations, particularly in Argentina and Türkiye, which are considered hyper-inflationary economies. Effective January 1, 2025, we designated Nigeria as a hyper-inflationary economy. Consequently, the functional currency for our Nigerian subsidiary will be the U.S. dollar and the impact of all future Nigerian currency fluctuations will be recorded in income. However, this designation is not expected to have a material impact on the Company's Consolidated Financial Statements. As discussed above, we continue to experience higher raw and packaging material costs, including the impact of transactional foreign exchange. While we have taken, and will continue to take, measures to mitigate the effect of these conditions, such as our funding-the-growth and revenue growth management initiatives, in the current environment it may become increasingly difficult to implement certain of these mitigation strategies. Should these conditions persist, they could adversely affect our future results.\nWhile the global marketplace in which we operate has always been highly competitive, we continue to experience heightened competitive activity in certain markets from strong local competitors (including private label competitors), from other large multinational companies, some of which have greater resources than we do, and from new entrants into the market in many of our categories. Such activities have included more aggressive product claims and marketing challenges, as well as increased promotional spending and geographic expansion. \nWe have been negatively affected by changes in the policies and practices of our trade customers in key markets, such as inventory destocking, fulfillment requirements, technology-aided category pricing pressures, limitations on access to shelf space, delisting of our products and sustainability, supply chain and packaging standards or initiatives. In addition, the retail landscape in many of our markets continues to evolve as a result of the continued growth of eCommerce, changing consumer preferences (as consumers increasingly shop online, including to compare prices and product availability) and the increased presence of alternative retail channels, such as subscription services and direct-to-consumer businesses. We are building and scaling our capabilities in areas such as innovation, digital, data, analytics and artificial intelligence and investing behind higher growth businesses. The substantial growth in eCommerce and the emergence of alternative retail channels have created and may continue to create pricing pressures and/or adversely affect our relationships with our key retailers.\nWe continue to closely monitor the impact of geopolitical events and tensions, such as the war in Ukraine, the conflict in the Middle East, tensions between China and Taiwan and the developments in trade relations, and the challenging market conditions discussed above, on our business and the related uncertainties and risks. While we have taken, and will continue to take, measures to mitigate the effects of these events and conditions, we cannot estimate with certainty the full extent of their impact on our business, results of operations, cash flows and/or financial condition. For more information about factors that could impact our business, see “Risk Factors” in Part I,",
    "item1a": "Item 1A “Risk Factors.”\nITEM 7A.    QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nSee “Managing Foreign Currency, Interest Rate, Commodity Price and Credit Risk Exposure” in Part II, Item 7.\n59\nITEM 8.    FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nSee “Index to Financial Statements.”\nITEM 9.    CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.\nITEM 9A.    CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nThe Company’s management, under the supervision and with the participation of the Company’s Chairman of the Board, President and Chief Executive Officer and Chief Financial Officer, carried out an evaluation of the effectiveness of the design and operation of the Company’s disclosure controls and procedures as of December 31, 2024 (the \n“\nEvaluation\n”\n). Based upon the Evaluation, the Company’s Chairman of the Board, President and Chief Executive Officer and Chief Financial Officer concluded that the Company’s disclosure controls and procedures (as defined in Rule 13a-15(e) of the Securities Exchange Act of 1934) are effective.\nManagement’s Annual Report on Internal Control Over Financial Reporting\nThe Company’s management is responsible for establishing and maintaining adequate internal control over financial reporting, as defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act of 1934. Management, under the supervision and with the participation of the Company’s Chairman of the Board, President and Chief Executive Officer and Chief Financial Officer, conducted an evaluation of the Company’s internal control over financial reporting based upon the framework in Internal Control – Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission and concluded that it was effective as of December 31, 2024. \nThe Company’s independent registered public accounting firm, PricewaterhouseCoopers LLP, has audited the effectiveness of the Company’s internal control over financial reporting as of December 31, 2024, and has expressed an unqualified opinion in their report, which appears under \n“\nIndex to Financial Statements – Report of Independent Registered Public Accounting Firm.\n”\nChanges in Internal Control Over Financial Reporting\nThe Company is in the process of upgrading its enterprise IT system to SAP S/4 HANA. This change has not had and is not expected to have a material impact on the Company’s internal controls over financial reporting. \nExcept as noted above, there were no changes in the Company’s internal control over financial reporting that occurred during the Company’s most recent fiscal quarter that have materially affected, or are reasonably likely to materially affect, the Company’s internal control over financial reporting. \nITEM 9B.    OTHER INFORMATION\n(b)\n \nTrading Plans\n       During the three months ended December 31, 2024, no director or officer of the Company \nadopted\n, modified or \nterminated\n a “Rule 10b5-1 trading arrangement” or “non-Rule 10b5-1 trading arrangement,” as each term is defined in Item 408(a) of Regulation S-K.\nITEM 9C.     Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\n60\nPART III\nITEM 10.    DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nSee “Information about our Executive Officers” in Part I, Item 1 of this report.\nAdditional information required by this Item 10 will be included under the headings “Governance – the Board of Directors,” “Governance – Board Structure and Responsibilities – Committees of the Board of Directors – Audit Committee” and “Executive Compensation – Compensation Discussion and Analysis – Compensation Governance Features – Insider Trading Policy and Prohibition on Hedging and Pledging of Company Stock” in the Company’s Proxy Statement for its 2025 Annual Meeting of Stockholders to be filed with the SEC within 120 days of the year ended December 31, 2024 (the “2025 Proxy Statement”) and is incorporated herein by reference.\nInformation on beneficial ownership reporting compliance will be included under the heading “Stock Ownership – Delinquent Section 16(a) Reports,” if applicable, in the 2025 Proxy Statement and is incorporated herein by reference.\nThe Company’s Code of Conduct promotes the highest ethical standards in all of the Company’s business dealings. The Code of Conduct satisfies the SEC’s requirements for a Code of Ethics for senior financial officers and applies to all Company employees, including the Chairman of the Board, President and Chief Executive Officer, the Chief Financial Officer and the Executive Vice President, Controller, and the Company’s directors. The Code of Conduct is available on the Company’s website at \nwww.colgatepalmolive.com\n. Any amendment to the Code of Conduct will promptly be posted on the Company’s website. It is the Company’s policy not to grant waivers of the Code of Conduct. In the extremely unlikely event that the Company grants an executive officer a waiver from a provision of the Code of Conduct, the Company will promptly disclose such information by posting it on its website or by using other appropriate means in accordance with SEC rules.\nITEM 11.    EXECUTIVE COMPENSATION\nInformation required by this Item 11 will be included under the headings “Executive Compensation,” “Governance – Compensation of Directors” and “Governance – Compensation Committee Interlocks and Insider Participation” in the 2025 Proxy Statement and is incorporated herein by reference.\n61\nITEM 12.    SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\n(a)\nInformation regarding security ownership of certain beneficial owners and management will be included under the heading “Stock Ownership” in the 2025 Proxy Statement and is incorporated herein by reference.\n(b)\nThe Registrant does not know of any arrangements that may at a subsequent date result in a change in control of the Registrant.\n(c)\nEquity compensation plan information as of December 31, 2024:\n \n(a)\n \n(b)\n \n(c)\n \nPlan Category\nNumber of securities to be issued upon exercise of outstanding options, warrants and rights\n(in thousands)\n \nWeighted-average exercise price of outstanding options, warrants and rights\n \nNumber of securities remaining available for future issuance under equity compensation plans (excluding securities reflected in column (a))\n(in thousands)\n \nEquity compensation plans approved by security holders\n15,798 \n(1)\n$\n79.00 \n(2)\n26,572 \n(3)\nEquity compensation plans not approved by security holders\nNot applicable\n \nNot applicable\n \nNot applicable\n \nTotal\n15,798 \n \n$\n79.00 \n \n26,572 \n \n(1)\nConsists of 12,774 options outstanding, 1,987 restricted stock units awarded but not yet vested and 1,037 performance-based restricted stock units outstanding under the Company’s 2019 Incentive Compensation Plan, as more fully described in Note 7, Capital Stock and Stock-Based Compensation Plans to the Consolidated Financial Statements.\n(2)\nIncludes the weighted-average exercise price of stock options outstanding of $78, restricted stock units of $88 and performance-based restricted stock units of $74.\n(3)\nAmount includes all of the securities available for future issuances in the form of options, restricted stock units and performance-based awards under the Company’s 2019 Incentive Compensation Plan.\nITEM 13.    CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nInformation required by this Item 13 will be included under the headings “Governance – Certain Relationships and Related Transactions” and “Governance – Director Independence” in the 2025 Proxy Statement and is incorporated herein by reference.\nITEM 14.    PRINCIPAL ACCOUNTANT FEES AND SERVICES\nInformation required by this Item 14 will be included under the heading “Proposal 2 – Ratification of Selection of Independent Registered Public Accounting Firm” in the 2025 Proxy Statement and is incorporated herein by reference.\n62\nPART IV\nITEM 15.    EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a)\nFinancial Statements and Financial Statement Schedules\n    See “Index to Financial Statements.”\n \n(b)\nExhibits:\n63\nExhibit No.\nDescription\n \n \n3-A\n \nRestated Certificate of Incorporation, as amended. (Registrant hereby incorporates by reference Exhibit 3-A to its Quarterly Report on Form 10-Q for the quarter ended June 30, 2008, File No. 1-644.)\n \n3-B\n \nColgate-Palmolive Company By-laws, Amended and Restated as of January 12, 2023. (Registrant hereby incorporates by reference Exhibit 3.01 to its Current Report on Form 8-K filed on January 12, 2023, File No. 1-644.)\n \n4\na)\nDescription of Securities of the Registrant**\nb)\nIndenture, dated as of November 15, 1992, between the Company and The Bank of New York Mellon (formerly known as The Bank of New York) as Trustee. (Registrant hereby incorporates by reference Exhibit 4.1 to its Registration Statement on Form S-3 and Post-Effective Amendment No. 1 filed on June 26, 1992, Registration No. 33-48840.)\n(1)\n \n  \n  \n  \n \nc)\nColgate-Palmolive Company Employee Stock Ownership Trust Agreement dated as of June 1, 1989, as amended. (Registrant hereby incorporates by reference Exhibit 4-B (b) to its Quarterly Report on Form 10-Q for the quarter ended June 30, 2000, File No. 1-644.)\n  \n  \n  \n10-A\na)\nColgate-Palmolive 2019 Incentive Compensation Plan. (Registrant hereby incorporates by reference Annex C to its 2019 Notice of Annual Meeting and Proxy Statement, File No. 1-644.)*\nb)\nForm of Nonqualified Option Award Agreement used in connection with grants under the Colgate-Palmolive Company 2019 Incentive Compensation Plan. (Registrant hereby incorporates by reference Exhibit 10-B to its Quarterly Report on Form 10-Q for the quarter ended September 30, 2024, File No. 1-644.)*\nc)\nForm of Restricted Stock Unit Award Agreement used in connection with grants under the Colgate-Palmolive Company 2019 Incentive Compensation Plan. (Registrant hereby incorporates by reference Exhibit 10-C to its Quarterly Report on Form 10-Q for the quarter ended September 30, 2024, File No. 1-644.)*\nd)\nForm of Performance Stock Unit Award Agreement for the 2022-2024 Performance Cycle (Registrant hereby incorporates by reference Exhibit 10-B to its Quarterly Report on Form 10-Q for the quarter ended March 31, 2022, File No. 1-644.)*\ne)\nForm of Performance Stock Unit Award Agreement for the 2023-2025 Performance Cycle (Registrant hereby incorporates by reference Exhibit 10-A to its Quarterly Report on Form 10-Q for the quarter ended March 31, 2023, File No. 1-644.)*\nf)\nForm of Performance Stock Unit Award Agreement for the 2024-2026 Performance Cycle (Registrant hereby incorporates by reference Exhibit 10-A to its Quarterly Report on Form 10-Q for the quarter ended March 31, 2024, File No. 1-644)\n*\n10-B\na)\nColgate-Palmolive Company Executive Incentive Compensation Plan Trust, as amended. (Registrant hereby incorporates by reference Exhibit 10-B (b) to its Annual Report on Form 10-K for the year ended December 31, 1987, File No. 1-644.)*\n  \n  \n  \n \nb)\nAmendment, dated as of October 29, 2007, to the Colgate-Palmolive Company Executive Incentive Compensation Plan Trust. (Registrant hereby incorporates by reference Exhibit 10-A (b) to its Quarterly Report on Form 10-Q for the quarter ended September 30, 2007, File No. 1-644.)*\n  \n  \n  \n10-C\nColgate-Palmolive Company Supplemental Salaried Employees’ Retirement Plan, amended and restated, effective as of January 1, 2021. (Registrant hereby incorporates by reference Exhibit 10-D to its Annual Report on Form 10-K for the year ended December 31, 2021, File No. 1-644.)*\n10-D\na)\nColgate-Palmolive Company Executive Severance Plan, as amended and restated through September 13, 2023. (Registrant hereby incorporates by reference Exhibit 10-A to its Current Report on Form 8-K filed on September 15, 2023, File No. 1-644.)*\n \nb)\nColgate-Palmolive Company Executive Severance Plan Trust. (Registrant hereby incorporates by reference Exhibit 10-E (b) to its Annual Report on Form 10-K for the year ended December 31, 1987, File No. 1-644.)*\n64\nc)\nColgate-Palmolive Company Executive Officer Cash Severance Policy. (Registrant hereby incorporates by reference Exhibit 10.1 to its Current Report on Form 8-K filed on April 11, 2022, File No 1-644.)*\n  \n  \n  \n10-E\n \nColgate-Palmolive Company Pension Plan for Outside Directors, as amended and restated. (Registrant hereby incorporates by reference Exhibit 10-D to its Annual Report on Form 10-K for the year ended December 31, 1999, File No. 1-644.)*\n \n \n  \n10-F\na)\nColgate-Palmolive Company Restated and Amended Deferred Compensation Plan for Non-Employee Directors, as amended. (Registrant hereby incorporates by reference Exhibit 10-H to its Annual Report on Form 10-K for the year ended December 31, 1997, File No. 1-644.)*\n \nb)\nAmendment, effective as of January 1, 2005, to the Colgate-Palmolive Company Restated and Amended Deferred Compensation Plan for Non-Employee Directors. (Registrant hereby incorporates by reference Exhibit 10-F to its Quarterly Report on Form 10-Q for the quarter ended September 30, 2007, File No. 1-644.)*\n10-G\n \nColgate-Palmolive Company Deferred Compensation Plan, amended and restated, effective as of October 28, 2021. (Registrant hereby incorporates by reference Exhibit 10-B to its Quarterly Report on Form 10-Q for the quarter ended September 30, 2021, File No. 1-644.)*\n10-H\nAmended and Restated Five Year Credit Agreement, dated as of November 4, 2022, by and among Colgate-Palmolive Company, as Borrower, Citibank, N.A., as Administrative Agent and Arranger, and the Lenders party thereto. (Registrant hereby incorporates by reference Exhibit 10-I to its Annual Report on Form 10-K for the year ended December 31, 2022, File No. 1-644\n.\n) \n10-I\nColgate-Palmolive Company Supplemental Savings and Investment Plan, amended and restated, effective as of January 1, 2022. (Registrant hereby incorporates by reference Exhibit 10-J to its Annual Report on Form 10-K for the year ended December 31, 2022, File No. 1-644.)*\n10-J\nForm of Indemnification Agreement between Colgate-Palmolive Company and its directors, executive officers and certain key employees. (Registrant hereby incorporates by reference Exhibit 10-K to its Annual Report on Form 10-K for the year ended December 31, 2017, File No. 1-644.)\n19\nColgate-Palmolive Company Insider Trading Policy.**\n21\n \nSubsidiaries of the Registrant.**\n \n \n  \n23\n \nConsent of Independent Registered Public Accounting Firm.**\n \n \n  \n24\n \nPowers of Attorney.**\n \n \n \n31-A\n \nCertificate of the Chairman of the Board, President and Chief Executive Officer of Colgate-Palmolive Company pursuant to Rule 13a-14(a) under the Securities Exchange Act of 1934.**\n31-B\n \nCertificate of the Chief Financial Officer of Colgate-Palmolive Company pursuant to Rule 13a-14(a) under the Securities Exchange Act of 1934.**\n \n \n  \n32\n \nCertificate of the Chairman of the Board, President and Chief Executive Officer and the Chief Financial Officer of Colgate-Palmolive Company pursuant to Rule 13a-14(b) under the Securities Exchange Act of 1934 and 18 U.S.C. § 1350.***\n97\nColgate-Palmolive Company Dodd-Frank Clawback Policy for the Recovery of Erroneously Awarded Compensation.**\n \n \n \n101\n \nThe following materials from Colgate-Palmolive Company’s Annual Report on Form 10-K for the year ended December 31, 2024, formatted in Inline eXtensible Business Reporting Language (Inline XBRL): (i) the Consolidated Statements of Income, (ii) the Consolidated Statements of Comprehensive Income, (iii) the Consolidated Balance Sheets, (iv) the Consolidated Statements of Changes in Shareholders’ Equity, (v) the Consolidated Statements of Cash Flows, and (vi) Notes to Consolidated Financial Statements.**\n104\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).**\n65\n*    Indicates a management contract or compensatory plan or arrangement.\n**    Filed herewith.\n*** Furnished herewith.\n(1)    \nRegistrant hereby undertakes to furnish the Commission, upon request, with a copy of any instrument with respect to long-term debt where the total amount of securities authorized thereunder does not exceed 10% of the total assets of the Registrant and its subsidiaries on a consolidated basis.\nThe exhibits indicated above that are not included with the Form 10-K are available upon request and payment of a reasonable fee approximating the registrant’s cost of providing and mailing the exhibits. Inquiries should be directed to:\nColgate-Palmolive Company\nOffice of the Secretary (10-K Exhibits)\n300 Park Avenue\nNew York, NY 10022-7499\n66\nITEM 16.    FORM 10-K SUMMARY\nNone.\n67\n COLGATE-PALMOLIVE COMPANY\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\n  \nColgate-Palmolive Company\n            (Registrant)\n  \n  \n  \nDate: February 13, 2025\nBy\n/s/ Noel Wallace\n  \n \nNoel Wallace \nChairman of the Board, President and\nChief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below on February 13, 2025, by the following persons on behalf of the registrant and in the capacities indicated.\n     \n(a)           Principal Executive Officer\n \n(d)           Directors:\n/s/ Noel Wallace\n \n/s/ Noel Wallace\nNoel Wallace \nChairman of the Board, President and\nChief Executive Officer\n \nNoel Wallace\n(b)           Principal Financial Officer\n \nJohn P. Bilbrey, John T. Cahill, Steven A. Cahillane,\nLisa M. Edwards, C. Martin Harris, \nMartina Hund-Mejean, Kimberly A. Nelson,\nBrian O. Newman, Lorrie M. Norrington*\n \n \n \n/s/ Stanley J. Sutula III\n \n*By: /s/ Jennifer M. Daniels\nStanley J. Sutula III\nChief Financial Officer\n \nJennifer M. Daniels\nAs Attorney-in-Fact\n \n \n \n(c)           Principal Accounting Officer\n \n  \n \n \n/s/ Gregory O. Malcolm\n \nGregory O. Malcolm\nExecutive Vice President, Controller\n \n68\nIndex to Financial Statements\n  \nPage\nConsolidated Financial Statements\n \n  \n \nReport of Independent Registered Public Accounting Firm (PCAOB ID \n238\n)\n70\n  \n \nConsolidated Statements of Income for the years ended December 31, 2024, 2023 and 2022\n72\nConsolidated Statements of Comprehensive Income for the years ended December 31, 2024, 2023 and 2022\n73\n  \nConsolidated Balance Sheets as of December 31, 2024 and 2023\n74\n  \n \nConsolidated Statements of Changes in Shareholders’ Equity for the years ended December 31, 2024, 2023 and 2022\n75\n \n \nConsolidated Statements of Cash Flows for the years ended December 31, 2024, 2023 and 2022\n76\n  \n \nNotes to Consolidated Financial Statements\n77\n  \n \nMarket Information\n121\n  \n \nAll other financial statements and schedules not listed have been omitted since the required information is included in the financial statements or the notes thereto or is not applicable or required.\n69\n \nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Shareholders of Colgate-Palmolive Company\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Colgate-Palmolive Company and its subsidiaries (the \"Company\") as of December 31, 2024 and 2023, and the related consolidated statements of income, of comprehensive income, of changes in shareholders' equity and of cash flows for each of the three years in the period ended December 31, 2024, including the related notes (collectively referred to as the \"consolidated financial statements\"). We also have audited the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024 in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control - Integrated Framework (2013) issued by the COSO.\nBasis for Opinions\nThe Company's management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in Management’s Annual Report on Internal Control over Financial Reporting appearing under Item 9A. Our responsibility is to express opinions on the Company’s consolidated financial statements and on the Company's internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\n70\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that (i) relates to accounts or disclosures that are material to the consolidated financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nGoodwill Impairment Assessment for a Certain Reporting Unit within the North America Oral, Personal and Home Care Segment Prior to the Reporting Structure Realignment\nAs described in Notes 2, 4 and 13 to the consolidated financial statements, goodwill within the North America Oral, Personal and Home Care segment was $1,108 million as of December 31, 2024, of which a portion relates to a certain reporting unit. Goodwill is subject to an impairment test at least annually or when events or changes in circumstances indicate that an asset may be impaired. In connection with management changes, the Company realigned the reporting structure of its skin health business effective July 1, 2024, and in conjunction with this reporting structure realignment, management completed a goodwill impairment assessment. As disclosed by management, determining the fair value of the Company’s reporting units for goodwill requires significant estimates and judgments by management. When a quantitative analysis is performed, management uses the income approach, which requires several estimates, including future cash flows consistent with management’s strategic plans, sales growth rates and discount rates. \nThe principal considerations for our determination that performing procedures relating to the goodwill impairment assessment for a certain reporting unit within the North America Oral, Personal and Home Care segment prior to the reporting structure realignment is a critical audit matter are (i) the significant judgment by management when developing the fair value estimate of a certain reporting unit within the North America Oral, Personal and Home Care segment prior to the reporting structure realignment; (ii) a high degree of auditor judgment, subjectivity, and effort in performing procedures and evaluating management’s significant assumptions related to the sales growth rates and the discount rate; and (iii) the audit effort involved the use of professionals with specialized skill and knowledge. \nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to management’s goodwill impairment assessment, including controls over the valuation of a certain reporting unit within the North America Oral, Personal and Home Care segment prior to the reporting structure realignment. These procedures also included, among others (i) testing management’s process for developing the fair value estimate of a certain reporting unit within the North America Oral, Personal and Home Care segment prior to the reporting structure realignment; (ii) evaluating the appropriateness of the income approach used by management; (iii) testing the completeness and accuracy of underlying data used in the income approach; and (iv) evaluating the reasonableness of the significant assumptions used by management related to the sales growth rates and the discount rate. Evaluating management’s assumptions related to the sales growth rates involved evaluating whether the assumptions used by management were reasonable considering (i) the current and past performance of a certain business within the North America Oral, Personal and Home Care segment; (ii) the consistency with external market and industry data; and (iii) whether the assumptions were consistent with evidence obtained in other areas of the audit. Professionals with specialized skill and knowledge were used to assist in evaluating (i) the appropriateness of the income approach and (ii) the reasonableness of the discount rate assumption.\n/s/ \nPricewaterhouseCoopers LLP\nNew York, New York\nFebruary 13, 2025\nWe have served as the Company\n’\ns auditor since 2002.\n71\nCOLGATE-PALMOLIVE COMPANY\nConsolidated Statements of Income\nFor the years ended December 31,\n(Dollars in Millions Except Per Share Amounts)\n2024\n2023\n2022\nNet sales\n$\n20,101\n \n$\n19,457\n \n$\n17,967\n \nCost of sales\n7,940\n \n8,131\n \n7,719\n \nGross profit\n12,161\n \n11,326\n \n10,248\n \nSelling, general and administrative expenses\n7,729\n \n7,151\n \n6,565\n \nOther (income) expense, net\n164\n \n191\n \n69\n \nGoodwill and intangible assets impairment charges\n—\n \n—\n \n721\n \nOperating profit\n4,268\n \n3,984\n \n2,893\n \nNon-service related postretirement costs\n87\n \n360\n \n80\n \nInterest expense\n292\n \n287\n \n167\n \nInterest income\n67\n \n55\n \n14\n \nIncome before income taxes\n3,956\n \n3,392\n \n2,660\n \nProvision for income taxes\n907\n \n937\n \n693\n \nNet income including noncontrolling interests\n3,049\n \n2,455\n \n1,967\n \nLess: Net income attributable to noncontrolling interests\n160\n \n155\n \n182\n \nNet income attributable to Colgate-Palmolive Company\n$\n2,889\n \n$\n2,300\n \n$\n1,785\n \nEarnings per common share, basic\n$\n3.53\n \n$\n2.78\n \n$\n2.13\n \nEarnings per common share, diluted\n$\n3.51\n \n$\n2.77\n \n$\n2.13\n \nSee Notes to Consolidated Financial Statements.\n72\n COLGATE-PALMOLIVE COMPANY\nConsolidated Statements of Comprehensive Income\nFor the years ended December 31,\n \n(Dollars in Millions)\n2024\n2023\n2022\nNet income including noncontrolling interests\n$\n3,049\n \n$\n2,455\n \n$\n1,967\n \nOther comprehensive income (loss), net of tax:\n     Cumulative translation adjustments\n(\n343\n)\n98\n \n(\n146\n)\n     Retirement plan and other retiree benefit adjustments\n43\n \n(\n16\n)\n413\n \n     Gains (losses) on cash flow hedges\n8\n \n(\n7\n)\n60\n \nTotal Other comprehensive income (loss), net of tax\n(\n292\n)\n75\n \n327\n \nTotal Comprehensive income including noncontrolling interests\n2,757\n \n2,530\n \n2,294\n \nLess: Net income attributable to noncontrolling interests\n160\n \n155\n \n182\n \nLess: Cumulative translation adjustments attributable to noncontrolling interests\n(\n8\n)\n(\n42\n)\n(\n4\n)\nTotal Comprehensive income attributable to noncontrolling interests\n152\n \n113\n \n178\n \nTotal Comprehensive income attributable to Colgate-Palmolive Company\n$\n2,605\n \n$\n2,417\n \n$\n2,116\n \nSee Notes to Consolidated Financial Statements.\n73\nCOLGATE-PALMOLIVE COMPANY\n \nConsolidated Balance Sheets\nAs of December 31,\n (Dollars in Millions Except Share and Per Share Amounts)\n2024\n2023\nAssets\n \nCurrent Assets\n \n \nCash and cash equivalents\n$\n1,096\n \n$\n966\n \nReceivables (net of allowances of $\n85\n and $\n80\n, respectively)\n1,521\n \n1,586\n \nInventories\n1,987\n \n1,934\n \nOther current assets\n713\n \n793\n \nTotal current assets\n5,317\n \n5,279\n \nProperty, plant and equipment, net\n4,422\n \n4,582\n \nGoodwill\n3,272\n \n3,410\n \nOther intangible assets, net\n1,756\n \n1,887\n \nDeferred income taxes\n195\n \n214\n \nOther assets\n1,084\n \n1,021\n \nTotal assets\n$\n16,046\n \n$\n16,393\n \nLiabilities and Shareholders’ Equity\n \n \nCurrent Liabilities\n \n \nDebt payable within one-year\n$\n660\n \n$\n330\n \nAccounts payable\n1,805\n \n1,698\n \nAccrued income taxes\n403\n \n336\n \nOther accruals\n2,891\n \n2,377\n \nTotal current liabilities\n5,759\n \n4,741\n \nLong-term debt\n7,289\n \n8,219\n \nDeferred income taxes\n343\n \n361\n \nOther liabilities\n2,111\n \n2,115\n \nTotal liabilities\n15,502\n \n15,436\n \nCommitments and contingent liabilities\n—\n \n—\n \nShareholders’ Equity\n \n \nCommon stock, $\n1\n par value (\n2,000,000,000\n shares authorized, \n1,465,706,360\n shares issued)\n1,466\n \n1,466\n \nAdditional paid-in capital\n4,181\n \n3,808\n \nRetained earnings\n26,145\n \n25,289\n \nAccumulated other comprehensive income (loss)\n(\n4,222\n)\n(\n3,937\n)\nTreasury stock, at cost\n(\n27,358\n)\n(\n26,017\n)\nTotal Colgate-Palmolive Company shareholders’ equity\n212\n \n609\n \nNoncontrolling interests\n332\n \n348\n \nTotal equity\n544\n \n957\n \nTotal liabilities and equity\n$\n16,046\n \n$\n16,393\n \nSee Notes to Consolidated Financial Statements.\n74\nCOLGATE-PALMOLIVE COMPANY\nConsolidated Statements of Changes in Shareholders’ Equity\n(Dollars in Millions)\n \nColgate-Palmolive Company Shareholders’ Equity\n \n \nCommon Stock\nAdditional Paid-In Capital\nUnearned Compensation\nTreasury Stock\nRetained Earnings\nAccumulated Other Comprehensive Income (Loss)\nNoncontrolling Interests\nBalance, January 1, 2022\n$\n1,466\n \n$\n3,269\n \n$\n(\n1\n)\n$\n(\n24,089\n)\n$\n24,350\n \n$\n(\n4,386\n)\n$\n362\n \nNet income\n— \n— \n— \n— \n1,785\n \n— \n182\n \nOther comprehensive income (loss), net of tax\n— \n— \n— \n— \n— \n331\n \n(\n4\n)\nDividends ($\n1.86\n)/per share*\n— \n— \n— \n— \n(\n1,562\n)\n— \n(\n135\n)\nStock-based compensation expense\n— \n125\n \n— \n— \n— \n— \n—\n \nShares issued for stock options\n— \n190\n \n— \n226\n \n— \n— \n— \nShares issued for restricted stock awards\n— \n(\n40\n)\n— \n40\n \n— \n— \n— \nTreasury stock acquired\n— \n— \n— \n(\n1,308\n)\n— \n— \n— \nOther\n— \n2\n \n— \n3\n \n— \n— \n— \nBalance, December 31, 2022\n$\n1,466\n \n$\n3,546\n \n$\n(\n1\n)\n$\n(\n25,128\n)\n$\n24,573\n \n$\n(\n4,055\n)\n$\n405\n \nNet income\n— \n— \n— \n— \n2,300\n \n— \n155\n \nOther comprehensive income (loss), net of tax\n— \n— \n— \n— \n— \n117\n \n(\n42\n)\nDividends ($\n1.91\n)/per share*\n— \n— \n— \n— \n(\n1,584\n)\n— \n(\n170\n)\nStock-based compensation expense\n— \n122\n— \n— \n— \n— \n— \nShares issued for stock options\n— \n170\n \n— \n212\n \n— \n— \n— \nShares issued for restricted stock awards\n— \n(\n34\n)\n— \n34\n \n— \n— \n— \nTreasury stock acquired\n— \n— \n— \n(\n1,128\n)\n— \n— \n— \nOther\n— \n4\n \n1\n \n(\n7\n)\n— \n1\n \n— \nBalance, December 31, 2023\n$\n1,466\n \n$\n3,808\n \n$\n—\n \n$\n(\n26,017\n)\n$\n25,289\n \n$\n(\n3,937\n)\n$\n348\n \nNet income\n— \n— \n— \n— \n2,889\n \n— \n160\n \nOther comprehensive income (loss), net of tax\n— \n— \n— \n— \n— \n(\n284\n)\n(\n8\n)\nDividends ($\n2.48\n)/per share*\n— \n— \n— \n— \n(\n2,034\n)\n— \n(\n168\n)\nStock-based compensation expense\n— \n135\n \n— \n— \n— \n— \n— \nShares issued for stock options\n— \n284\n \n— \n354\n \n— \n— \n— \nShares issued for restricted stock awards\n— \n(\n52\n)\n— \n52\n \n— \n— \n— \nTreasury stock acquired\n— \n— \n— \n(\n1,739\n)\n— \n— \n— \nOther\n— \n6\n \n— \n(\n8\n)\n1\n \n(\n1\n)\n— \nBalance, December 31, 2024\n$\n1,466\n \n$\n4,181\n \n$\n—\n \n$\n(\n27,358\n)\n$\n26,145\n \n$\n(\n4,222\n)\n$\n332\n \n* \nFive\n dividends were declared in 2024. \nFour\n dividends were declared in 2023 and 2022.\nSee Notes to Consolidated Financial Statements.\n75\nCOLGATE-PALMOLIVE COMPANY\nConsolidated Statements of Cash Flows \nFor the years ended December 31,\n(Dollars in Millions)\n \n2024\n2023\n2022\nOperating Activities\n \n \nNet income including noncontrolling interests\n$\n3,049\n \n$\n2,455\n \n$\n1,967\n \nAdjustments to reconcile net income including noncontrolling interests to net cash provided by operations:\n \n \nDepreciation and amortization\n605\n \n567\n \n545\n \nERISA litigation matter\n—\n \n267\n \n—\n \nRestructuring and termination benefits, net of cash\n51\n \n(\n23\n)\n49\n \nStock-based compensation expense\n135\n \n122\n \n125\n \nGain on the sale of land\n—\n \n—\n \n(\n47\n)\nGoodwill and intangible assets impairment charges\n—\n \n—\n \n721\n \nDeferred income taxes\n(\n77\n)\n(\n98\n)\n(\n78\n)\nCash effects of changes in:\n \nReceivables\n(\n56\n)\n(\n37\n)\n(\n227\n)\nInventories\n(\n100\n)\n194\n \n(\n333\n)\nAccounts payable and other accruals\n516\n \n309\n \n(\n115\n)\nOther non-current assets and liabilities\n(\n16\n)\n(\n11\n)\n(\n51\n)\nNet cash provided by operations\n4,107\n \n3,745\n \n2,556\n \nInvesting Activities\n \n \nCapital expenditures\n(\n561\n)\n(\n705\n)\n(\n696\n)\nPurchases of marketable securities and investments\n(\n574\n)\n(\n506\n)\n(\n470\n)\nProceeds from sale of marketable securities and investments\n564\n \n502\n \n322\n \nPayment for acquisitions, net of cash acquired\n—\n \n—\n \n(\n809\n)\nProceeds from the sale of land\n—\n \n—\n \n47\n \nOther investing activities\n37\n \n(\n33\n)\n5\n \nNet cash used in investing activities\n(\n534\n)\n(\n742\n)\n(\n1,601\n)\nFinancing Activities\n \n \nShort-term borrowing (repayment) less than 90 days, net\n93\n \n(\n906\n)\n540\n \nPrincipal payments on debt\n(\n503\n)\n(\n903\n)\n(\n406\n)\nProceeds from issuance of debt\n2\n \n1,495\n \n1,513\n \nDividends paid\n(\n1,789\n)\n(\n1,749\n)\n(\n1,691\n)\nPurchases of treasury shares\n(\n1,739\n)\n(\n1,128\n)\n(\n1,308\n)\nProceeds from exercise of stock options\n638\n \n380\n \n418\n \nOther financing activities\n(\n91\n)\n18\n \n(\n18\n)\nNet cash used in financing activities\n(\n3,389\n)\n(\n2,793\n)\n(\n952\n)\nEffect of exchange rate changes on Cash and cash equivalents\n(\n54\n)\n(\n19\n)\n(\n60\n)\nNet increase (decrease) in Cash and cash equivalents\n130\n \n191\n \n(\n57\n)\nCash and cash equivalents at beginning of year\n966\n \n775\n \n832\n \nCash and cash equivalents at end of year\n$\n1,096\n \n$\n966\n \n$\n775\n \nSupplemental Cash Flow Information\n \n \nIncome taxes paid\n$\n933\n \n$\n937\n \n$\n945\n \nInterest paid\n$\n302\n \n$\n280\n \n$\n151\n \nSee Notes to Consolidated Financial Statements.\n76\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements \n(Dollars in Millions Except Share and Per Share Amounts)\n \n1.    \nNature of Operations\n    \nThe Company manufactures and markets a wide variety of products in the U.S. and around the world in \ntwo\n product segments: Oral, Personal and Home Care; and Pet Nutrition. Oral, Personal and Home Care products include toothpaste, toothbrushes, mouthwash, bar and liquid hand soaps, shower gels, shampoos, conditioners, deodorants and antiperspirants, skin health products, dishwashing detergents, fabric conditioners, household cleaners and other similar items. These products are sold primarily to a variety of retailers, wholesalers, distributors, dentists and, in some geographies, skin health professionals. Pet Nutrition products include specialty pet nutrition products manufactured and marketed by Hill’s Pet Nutrition. The principal customers for Pet Nutrition products are authorized pet supply retailers, veterinarians and eCommerce retailers. Some of our products are also sold direct-to-consumer. Principal global and regional trademarks include Colgate, Palmolive, Darlie, elmex, hello, meridol, Sorriso, Tom’s of Maine, EltaMD, Filorga, Irish Spring, Lady Speed Stick, PCA SKIN, Protex, Sanex, Softsoap, Speed Stick, Ajax, Axion, Fabuloso, Murphy, Soupline and Suavitel, as well as Hill’s Science Diet and Hill’s Prescription Diet.\nThe Company’s principal classes of products accounted for the following percentages of worldwide Net sales for the past three years:\n  \n2024\n2023\n2022\nOral Care\n43\n \n%\n42\n \n%\n43\n \n%\nPersonal Care\n18\n \n%\n19\n \n%\n19\n \n%\nHome Care\n17\n \n%\n17\n \n%\n17\n \n%\nPet Nutrition\n22\n \n%\n22\n \n%\n21\n \n%\nTotal\n100\n \n%\n100\n \n%\n100\n \n%\n77\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\n2.    \nSummary of Significant Accounting Policies\nPrinciples of Consolidation\nThe Consolidated Financial Statements include the accounts of Colgate-Palmolive Company and its majority-owned or controlled subsidiaries. Intercompany transactions and balances have been eliminated. The Company’s investments in consumer products companies with interests ranging between \n20\n% and \n50\n%, where the Company has significant influence over the investee, are accounted for using the equity method. Net income (loss) from such investments is recorded in Other (income) expense, net in the Consolidated Statements of Income. As of December 31, 2024 and 2023, equity method investments included in Other assets in the Consolidated Balance Sheets were $\n81\n and $\n83\n, respectively. Unrelated third parties hold the remaining ownership interests in these investments. Investments with less than a \n20\n% interest are recorded at cost and periodically adjusted based on observable price changes or quoted market prices in active markets, if applicable.\n \nUse of Estimates\nThe preparation of financial statements in accordance with accounting principles generally accepted in the United States of America requires management to use judgment and make estimates that affect the reported amounts of assets and liabilities and disclosure of contingent gains and losses at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. The level of uncertainty in estimates and assumptions increases with the length of time until the underlying transactions are completed. As such, the most significant uncertainty in the Company’s assumptions and estimates involved in preparing the financial statements includes pension and other retiree benefit cost assumptions, stock-based compensation, asset impairments, uncertain tax positions, tax valuation allowances and legal and other contingency reserves. Additionally, the Company uses available market information and other valuation methodologies in assessing the fair value of financial instruments and retirement plan assets. Judgment is required in interpreting market data to develop the estimates of fair value and, accordingly, changes in assumptions or the estimation methodologies may affect the fair value estimates. Actual results could ultimately differ from those estimates.\nRevenue Recognition\nThe Company’s revenue contracts represent a single performance obligation to sell its products to trade customers. Sales are recorded at the time control of the products is transferred to trade customers, in an amount that reflects the consideration the Company expects to be entitled to in exchange for the products. Control is the ability of trade customers to “direct the use of” and “obtain the benefit from” our products. In evaluating the timing of the transfer of control of products to trade customers, the Company considers several control indicators, including significant risks and rewards of products, the Company’s right to payment and the legal title of the products. Based on the assessment of control indicators, sales are generally recognized when products are delivered to trade customers.\nNet sales reflect the transaction prices for contracts, which include units shipped at selling list prices reduced by variable consideration. Variable consideration includes expected sales returns and the cost of current and continuing promotional programs. Current promotional programs primarily include product listing allowances and co-operative advertising arrangements. Continuing promotional programs are predominantly consumer coupons and volume-based sales incentive arrangements. The cost of promotional programs is estimated using the expected value method considering all reasonably available information, including the Company’s historical experience and its current expectations, and is reflected in the transaction price when sales are recorded. Adjustments to the cost of promotional programs in subsequent periods are generally not material, as the Company’s promotional programs are typically of short duration, thereby reducing the uncertainty inherent in such estimates. \nSales returns are generally accepted at the Company’s discretion and are not material to the Company’s Consolidated Financial Statements. The Company’s contracts with trade customers do not have significant financing components or non-cash consideration and the Company does not have unbilled revenue or significant amounts of prepayments from customers. The Company records Net sales excluding taxes collected on its sales to its trade customers. Shipping and handling activities are accounted for as contract fulfillment costs and classified as Selling, general and administrative expenses.\n78\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\nShipping and Handling Costs\nShipping and handling costs (also referred to as logistics costs) are classified as Selling, general and administrative expenses and were $\n1,777\n, $\n1,771\n and $\n1,874\n for the years ended December 31, 2024, 2023 and 2022, respectively.\nMarketing Costs\nThe Company markets its products through advertising and other promotional activities. Advertising costs are included in Selling, general and administrative expenses and are expensed as incurred. Certain consumer and trade promotional programs, such as consumer coupons, are recorded as a reduction of sales.\nCash and Cash Equivalents\nThe Company considers all highly liquid investments with original maturities of three months or less at the time of purchase to be cash equivalents.\nInventories\nThe cost of approximately \n75\n% of inventories is determined using the FIFO method, which is stated at the lower of cost or net realizable value. The cost of the remaining inventories, in the U.S. and Mexico, is determined using the LIFO method, which is stated at the lower of cost or market. Inventories in excess of one year of forecasted sales are classified in the Consolidated Balance Sheets as non-current “Other assets.”\nProperty, Plant and Equipment\nLand, buildings and machinery and equipment are stated at cost. Depreciation is provided, primarily using the straight-line method, over the estimated useful lives ranging from \n3\n to \n15\n years for machinery and equipment and up to \n40\n years for buildings. Depreciation attributable to manufacturing operations is included in Cost of sales. The remaining component of depreciation is included in Selling, general and administrative expenses.\nGoodwill and Other Intangibles\nGoodwill and indefinite-life intangible assets, such as the Company’s global brands, are subject to impairment tests at least annually or when events or changes in circumstances indicate that an asset may be impaired. In assessing impairment, the Company performs either a quantitative or a qualitative analysis. \nDetermining the fair value of the Company’s reporting units for goodwill and the fair value of its intangible assets requires significant estimates and judgments by management. When a quantitative analysis is performed, the Company generally uses the income approach, which requires several estimates, including future cash flows consistent with management’s strategic plans, sales growth rates and the selection of royalty rates and discount rates. The Company generally engages a third-party valuation firm to assist in determining the fair value of intangible assets acquired in business combinations. \nAs a result of a reporting structure realignment, the Company reallocated the goodwill of a certain reporting unit from the Europe segment to the North America segment. Before and after the reporting structure realignment, the Company completed an assessment indicating no goodwill impairment was required. Refer to Note 13, Segment Information for additional information.\nOther intangible assets with finite lives, such as local brands and trademarks, customer relationships and non-compete agreements, are amortized over their estimated useful lives, generally ranging from \n5\n to \n40\n years. Amortization expense related to intangible assets is included in Other (income) expense, net, which is included in Operating profit.\n79\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\nIncome Taxes\nThe provision for income taxes is determined using the asset and liability method. Under this method, deferred tax assets and liabilities are recognized based upon the differences between the financial statement and tax bases of assets and liabilities using enacted tax rates that will be in effect at the time such differences are expected to reverse. Deferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion or all of the deferred tax assets will not be realized. \nThe Company uses a comprehensive model to recognize, measure, present and disclose in its financial statements uncertain tax positions that the Company has taken or expects to take on an income tax return. The Company recognizes interest expense and penalties related to unrecognized tax benefits within Provision for income taxes.\nFinancial Instruments\nDerivative instruments are recorded as assets and liabilities at estimated fair value based on available market information. The Company’s derivative instruments that qualify for hedge accounting are designated as either fair value hedges, cash flow hedges or net investment hedges. For fair value hedges, changes in the fair value of the derivative, as well as the offsetting changes in the fair value of the hedged item, are recognized in earnings each period. For cash flow hedges, changes in the fair value of the derivative are recorded in Other comprehensive income (loss) and are recognized in earnings when the offsetting effect of the hedged item is also recognized in earnings. For hedges of the net investment in foreign subsidiaries, changes in the fair value of the derivative are recorded in Other comprehensive income (loss) to offset the change in the value of the net investment being hedged. Cash flows related to hedges are classified in the same category as the cash flows from the hedged item in the Consolidated Statements of Cash Flows.\nThe Company may also enter into certain foreign currency and interest rate instruments that economically hedge certain of its risks but do not qualify for hedge accounting. Changes in fair value of these derivative instruments, based on quoted market prices, are recognized in earnings each period. The Company’s derivative instruments and other financial instruments are more fully described in Note 6, Fair Value Measurements and Financial Instruments along with the related fair value measurement considerations.\nStock-Based Compensation\nThe Company recognizes the cost of employee services received in exchange for awards of equity instruments, such as stock options and restricted stock units (both performance-based and time-vested), based on the fair value of those awards at the date of grant over the requisite service period. The Company uses the Black-Scholes-Merton (\n“\nBlack-Scholes\n”\n) option pricing model to estimate the fair value of stock option awards. In addition to performance conditions, performance-based restricted stock units also include a total shareholder return modifier. Because the total shareholder return modifier is considered a market condition, the Company uses a Monte-Carlo simulation model to determine the fair value of performance-based restricted stock units. The fair value of time-vested restricted stock units is determined based on the closing market price of the Company’s stock at the date of grant. Stock-based compensation plans, related expenses and assumptions used in the Black-Scholes option pricing model are more fully described in Note 7, Capital Stock and Stock-Based Compensation Plans.\nCurrency Translation\nThe assets and liabilities of foreign subsidiaries, other than those operating in highly inflationary environments, are translated into U.S. dollars at year-end exchange rates with resulting translation gains and losses accumulated in a separate component of shareholders’ equity. Income and expense items are translated into U.S. dollars at average rates of exchange prevailing during the year.\nFor subsidiaries operating in highly inflationary environments, local currency-denominated non-monetary assets, including inventories, goodwill and property, plant and equipment, are remeasured at their historical exchange rates, while local currency-denominated monetary assets and liabilities are remeasured at year-end exchange rates. Remeasurement adjustments for these operations are included in Net income attributable to Colgate-Palmolive Company.\n \n80\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\nRecent Accounting Pronouncements and Disclosure Rules\nIn November 2024, the Financial Accounting Standards Board (the “FASB”) issued Accounting Standards Update (“ASU”) No. 2024-04, “Debt—Debt with Conversion and Other Options (Subtopic 470-20): Induced Conversions of Convertible Debt Instruments.” This ASU clarifies the requirements for determining whether certain settlements of convertible debt instruments should be accounted for as induced conversions. This guidance is effective for the Company for fiscal years beginning after December 15, 2025 and is not expected to have an impact on the Company’s Consolidated Financial Statements.\nIn November 2024, the FASB issued ASU No. 2024-03, “Income Statement—Reporting Comprehensive Income—Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses.” This ASU requires additional disclosures related to the disaggregation of income statement expense categories. This guidance is effective for the Company for fiscal years beginning after December 15, 2026, and interim periods within fiscal years beginning after December 15, 2027. Other than the new disclosure requirements, this guidance will not have an impact on the Company’s Consolidated Financial Statements. \nIn March 2024, the SEC finalized rules intended to enhance and standardize climate-related disclosures in registrants’ registration statements and Annual Reports on Form 10-K. The new rules would require climate-related disclosures, including as they relate to governance, strategy, risk management, targets and goals and greenhouse gas emissions. In addition, the rules would require certain climate-related disclosures as it relates to severe weather events and other natural conditions and carbon offsets and renewable energy credits. In April 2024, the SEC voluntarily stayed the rules due to pending judicial review. Other than the new disclosure requirements, this guidance will not have an impact on the Company’s Consolidated Financial Statements. \nIn December 2023, the FASB issued ASU No. 2023-09, “Income Taxes (Topic 740): Improvements to Income Tax Disclosures.” This ASU improves the transparency of income tax disclosure by requiring consistent categories and greater disaggregation of information in the rate reconciliation, and income taxes paid disaggregated by jurisdiction. This guidance is effective for the Company for fiscal years beginning after December 15, 2024. Other than the new disclosure requirements, this guidance will not have an impact on the Company’s Consolidated Financial Statements. \nIn December 2023, the FASB issued ASU No. 2023-08, “Intangibles—Goodwill and Other—Crypto Assets (Subtopic 350-60): Accounting for and Disclosure of Crypto Assets.” This ASU improves the accounting for certain crypto assets by requiring companies to measure them at fair value for each reporting period with changes in fair value recognized in net income. This guidance is effective for the Company for fiscal years beginning after December 15, 2024 and is not expected to have an impact on the Company’s Consolidated Financial Statements.\nIn November 2023, the FASB issued ASU No. 2023-07, “Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures.” This ASU modified the disclosure and presentation requirements primarily through enhanced disclosures of significant segment expenses and other segment items. The Company adopted this guidance in 2024. See Note 13, Segment Information for additional information.\nIn October 2023, the FASB issued ASU No. 2023-06, “Disclosure Improvements—Codification Amendments in Response to the SEC’s Disclosure Update and Simplification Initiative.” This ASU modified the disclosure and presentation requirements of a variety of codification topics by aligning them with the SEC’s regulations. This guidance is effective for the Company no later than June 30, 2027. Other than the new disclosure requirements, this guidance will not have an impact on the Company’s Consolidated Financial Statements. \nIn August 2023, the FASB issued ASU No. 2023-05, “Business Combinations—Joint Venture Formations (Subtopic 805-60): Recognition and Initial Measurement.” This ASU requires a joint venture to initially measure all contributions received upon its formation at fair value. This guidance is applicable to joint ventures with a formation date on or after January 1, 2025 and is not expected to have a material impact on the Company’s Consolidated Financial Statements.\n81\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\nIn March 2023, the FASB issued ASU No. 2023-01, “Leases (Topic 842): Common Control Arrangements.” This ASU clarified the accounting for leasehold improvements for leases under common control. The guidance was effective for the Company beginning on January 1, 2024 and did not have a material impact on the Company’s Consolidated Financial Statements. \nIn September 2022, the FASB issued ASU No. 2022-04, “Liabilities—Supplier Finance Programs (Subtopic 405-50): Disclosure of Supplier Finance Program Obligations.” This ASU requires a buyer that uses supplier finance programs to make annual disclosures about the programs’ key terms, the balance sheet presentation of related amounts, the confirmed amount outstanding at the end of the period and associated roll-forward information. The Company adopted the guidance  beginning on January 1, 2023, and with respect to the roll-forward information disclosure, beginning on January 1, 2024.\n See Note 15, Supplier Finance Programs for additional information.\nReclassifications\nCertain prior year amounts have been reclassified to conform to the current year presentation.\n \n82\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\n3.    \nRestructuring and Related Implementation Charges \n \nOn January 27, 2022, the Board approved a targeted productivity program (the “2022 Global Productivity Initiative”). All initiatives have been implemented and the program concluded on December 31, 2024. The 2022 Global Productivity Initiative resulted in the reallocation of resources towards the Company’s strategic priorities and faster growth businesses, efficiencies in the Company’s operations and the streamlining of its supply chain to reduce structural costs.\nOver the course of the 2022 Global Productivity Initiative, the Company incurred total pretax charges of $\n228\n ($\n186\n aftertax) in connection with the implementation of various projects as follows:\nTotal Program Charges\nas of December 31, 2024\nEmployee-Related Costs\n$\n175\n \nIncremental Depreciation\n13\n \nAsset Impairments\n1\n \nOther\n39\n \nTotal\n$\n228\n \nTotal pretax charges resulting from the 2022 Global Productivity Initiative were comprised of the following categories: employee-related costs, including severance, pension and other termination benefits (\n80\n%); asset-related costs, primarily accelerated depreciation and asset write-downs (\n5\n%); and other charges (\n15\n%), which include contract termination costs, consisting primarily of implementation-related charges resulting directly from exit activities and the implementation of new strategies. Over the course of the 2022 Global Productivity Initiative, approximately \n80\n% of the charges resulted in cash expenditures. \nFor the twelve months ended December 31, 2024 and December 31, 2023, charges resulting from the 2022 Global Productivity Initiative are reflected in the income statement as follows:\nTwelve Months Ended December 31,\n2024\n2023\nGross Profit\n$\n20\n \n$\n1\n \nSelling, general and administrative expenses\n6\n \n2\n \nOther (income) expense, net\n59\n \n24\n \nNon-service related postretirement costs\n—\n \n5\n \nTotal 2022 Global Productivity Initiative charges, pretax\n$\n85\n \n$\n32\n \nTotal 2022 Global Productivity Initiative charges, aftertax\n$\n73\n \n$\n25\n \nRestructuring and related implementation charges are recorded in the Corporate segment as these initiatives are predominantly centrally directed and controlled and are not included in internal measures of segment operating performance.  \n83\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\nTotal charges incurred for the 2022 Global Productivity Initiative relate to initiatives undertaken by the following reportable operating segments:\nTwelve Months Ended December 31,\nTotal Program Charges\n \n2024\n2023\nNorth America\n(1)\n3\n \n%\n15\n \n%\n9\n \n%\nLatin America \n—\n \n%\n—\n \n%\n9\n \n%\nEurope\n(1)\n89\n \n%\n19\n \n%\n44\n \n%\nAsia Pacific\n—\n \n%\n20\n \n%\n7\n \n%\nAfrica/Eurasia\n—\n \n%\n5\n \n%\n6\n \n%\nHill's Pet Nutrition\n6\n \n%\n23\n \n%\n11\n \n%\nCorporate\n2\n \n%\n18\n \n%\n14\n \n%\nTotal\n100\n \n%\n100\n \n%\n100\n \n%\n(1) \nThe Company has recast its historical geographic segment information to conform to the reporting structure effective as of July 1, 2024. See Note 13, Segment Information for additional details.\nThe following table summarizes the activity for the restructuring and related implementation charges discussed above and the related accruals:\nTwelve Months Ended December 31,\n \nEmployee-Related\nCosts \nIncremental\nDepreciation \nAsset\nImpairments\nOther\nTotal\nBalance at December 31, 2022\n$\n30\n \n$\n—\n \n$\n1\n \n$\n3\n \n$\n34\n \nCharges\n24\n \n—\n \n—\n \n8\n \n32\n \nCash Payments\n(\n45\n)\n—\n \n—\n \n(\n10\n)\n(\n55\n)\nCharges against assets\n(\n5\n)\n—\n \n(\n1\n)\n—\n \n(\n6\n)\nForeign exchange\n6\n \n—\n \n—\n \n—\n \n6\n \nBalance at December 31, 2023\n$\n10\n \n$\n—\n \n$\n—\n \n$\n1\n \n$\n11\n \nCharges \n49\n \n13\n \n—\n \n23\n \n85\n \nCash Payments \n(\n20\n)\n—\n \n—\n \n(\n14\n)\n(\n34\n)\nCharges against assets\n—\n \n(\n13\n)\n—\n \n—\n \n(\n13\n)\nForeign exchange\n(\n5\n)\n—\n \n—\n \n—\n \n(\n5\n)\nBalance at December 31, 2024\n$\n34\n \n$\n—\n \n$\n—\n \n$\n10\n \n$\n44\n \nEmployee-Related Costs primarily include severance and other termination benefits and are calculated based on long-standing benefit practices, written severance policies, local statutory requirements and, in certain cases, voluntary termination arrangements. Employee-Related Costs also include pension enhancements which are reflected as Charges against assets within Employee-Related Costs in the preceding table, as the corresponding balance sheet amounts are reflected as a reduction of pension assets or an increase in pension liabilities. \nIncremental Depreciation is recorded to reflect changes in useful lives and estimated residual values for long-lived assets that will be taken out of service prior to the end of their normal service period. Asset Impairments are recorded to write down inventories and assets held for sale or disposal to their fair value based on amounts expected to be realized. Charges against assets within Asset Impairments are net of cash proceeds pertaining to the sale of certain assets, as applicable.\n84\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\n4.    \nGoodwill and Other Intangible Assets\nThe changes in net carrying value of Goodwill by segment for the years ended December 31, 2024 and 2023 were as follows:\n2023\n  \nBeginning Balance\nForeign currency translation\nEnding Balance\nOral, Personal and Home Care\n \n \nNorth America\n$\n906\n \n$\n2\n \n$\n908\n \nLatin America\n168\n \n11\n \n179\n \nEurope\n1,504\n \n67\n \n1,571\n \nAsia Pacific\n179\n \n—\n \n179\n \nAfrica/Eurasia\n107\n \n(\n19\n)\n88\n \nTotal Oral, Personal and Home Care\n2,864\n \n61\n \n2,925\n \nPet Nutrition\n488\n \n(\n3\n)\n485\n \nTotal Goodwill\n$\n3,352\n \n$\n58\n \n$\n3,410\n \n2024\n  \nBeginning Balance\nReallocation \n(1)\nForeign currency translation\nEnding Balance\nOral, Personal and Home Care\n \n \nNorth America\n$\n908\n \n$\n223\n \n$\n(\n23\n)\n$\n1,108\n \nLatin America\n179\n \n— \n(\n34\n)\n145\n \nEurope\n1,571\n \n(\n223\n)\n(\n67\n)\n1,281\n \nAsia Pacific\n179\n \n— \n(\n1\n)\n178\n \nAfrica/Eurasia\n88\n \n— \n(\n10\n)\n78\n \nTotal Oral, Personal and Home Care\n2,925\n \n—\n \n(\n135\n)\n2,790\n \nPet Nutrition\n485\n \n— \n(\n3\n)\n482\n \nTotal Goodwill\n$\n3,410\n \n$\n—\n \n$\n(\n138\n)\n$\n3,272\n \n(1)\n As a result of a reporting structure realignment, the Company reallocated the goodwill of a certain reporting unit from the Europe segment to the North America segment. Before and after the reallocation of the goodwill, the Company completed an assessment indicating no goodwill impairment was required as a result of this segment reporting structure realignment. Refer to Note 13, Segment Information for additional information.\n85\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\nOther intangible assets as of December 31, 2024 and 2023 were comprised of the following:\n  \n2024\n2023\n  \nGross Carrying Amount\nAccumulated Amortization\nNet\nGross Carrying Amount\nAccumulated Amortization\nNet\nTrademarks - finite life\n$\n1,135\n \n$\n(\n545\n)\n$\n590\n \n$\n1,167\n \n$\n(\n519\n)\n$\n648\n \nOther finite life intangible assets\n603\n \n(\n385\n)\n218\n \n624\n \n(\n363\n)\n261\n \nIndefinite life intangible assets\n948\n \n— \n948\n \n978\n \n— \n978\n \nTotal Other intangible assets\n$\n2,686\n \n$\n(\n930\n)\n$\n1,756\n \n$\n2,769\n \n$\n(\n882\n)\n$\n1,887\n \nThe change in the net carrying amounts of Other intangible assets during 2024 was due to foreign currency translation and amortization expense of $\n75\n. Annual estimated amortization expense for each of the next five years is expected to be approximately $\n68\n. In 2023, the Company re-characterized a certain trademark from an indefinite to a finite life intangible asset based on an assessment of certain macroeconomic conditions, historical performance and demand. The carrying value of this trademark as of December 31, 2024 is $\n234\n and is being amortized over its estimated remaining useful life of \n24\n years.\nAs of the date of the annual impairment test of indefinite-lived intangible assets, the fair value of one of the Company’s indefinite-lived trademark intangible assets exceeded its carrying value by less than 20%. The carrying value of this trademark is $\n293\n as of December 31, 2024.  \nGiven the inherent uncertainties of estimating the future cash flows, the impact of interest rates and inflation on macroeconomic conditions, actual results may differ from management's current estimates which could potentially result in impairment charges in future periods.\n \n5.    \nLong-Term Debt and Credit Facilities\nLong-term debt consisted of the following at December 31:\n  \nWeighted Average Interest Rate\nMaturities\n2024\n2023\nNotes\n3.0\n%\n2025\n-\n2078\n$\n6,946\n \n$\n7,580\n \nCommercial paper\n3.0\n%\n2025\n936\n \n606\n \nFinance Lease Obligations\nVarious\n59\n \n53\n \n7,941\n \n8,239\n \nLess: Current portion of long-term debt\n(\n652\n)\n(\n20\n)\nTotal\n \n$\n7,289\n \n$\n8,219\n \nDebt payable within one year consisted of the following at December 31:\n  \n2024\n2023\nNotes and loans payable\n$\n8\n \n$\n310\n \nCurrent portion of long-term debt\n652\n \n20\n \nDebt payable within one year \n$\n660\n \n$\n330\n \n86\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\nThe Company classifies commercial paper as long-term debt when it has the intent and ability to refinance such obligations on a long-term basis. \nExcluding commercial paper, scheduled maturities of long-term debt and finance leases outstanding as of December 31, 2024, were as follows:  \nYears Ended December 31,\n2025\n$\n652\n \n2026\n1,035\n \n2027\n509\n \n2028\n612\n \n2029\n519\n \nThereafter\n3,678\n \nTotal\n$\n7,005\n \nThe Company’s debt issuances and redemptions support its capital structure strategy objectives of funding its business and growth initiatives while minimizing its risk-adjusted cost of capital. During the year ended December 31, 2024, the Company redeemed at maturity $\n500\n of \nten-year\n Medium-Term Notes with a fixed coupon of \n3.25\n%. The redemption was financed with commercial paper borrowings. In March 2023, the Company issued $\n500\n of \nthree-year\n Senior Notes at a fixed coupon rate of \n4.800\n%, $\n500\n of \nfive-year\n Senior Notes at a fixed coupon rate of \n4.600\n% and $\n500\n of \nten-year\n Senior Notes at a fixed coupon rate of \n4.600\n%. \nAt December 31, 2024, the Company had access to unused domestic and foreign lines of credit of $\n3,725\n (including under the facility discussed below) and could also issue long-term debt pursuant to an effective shelf registration statement. In November 2022, the Company entered into an amended and restated $\n3,000\n \nfive-year\n revolving credit facility with a syndicate of banks for a \nfive-year\n term expiring November 2027, which replaced, on substantially similar terms, the Company’s $\n3,000\n revolving credit facility that was scheduled to expire in August 2026. In November 2023, the Company extended the term of the credit facility for an additional year, expiring in November 2028. In November 2024, the Company further extended the term of the credit facility for an additional year, expiring in November 2029. Commitment fees related to the credit facility are not material. \nCertain agreements with respect to the Company’s bank borrowings contain financial and other covenants as well as cross-default provisions. Noncompliance with these requirements could ultimately result in the acceleration of amounts owed. The Company is in full compliance with all such requirements.\n \n87\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\n6.    \nFair Value Measurements and Financial Instruments \nThe Company uses available market information and other valuation methodologies in assessing the fair value of financial instruments. Judgment is required in interpreting market data to develop the estimates of fair value and, accordingly, changes in assumptions or the estimation methodologies may affect the fair value estimates. The Company is exposed to the risk of credit loss in the event of nonperformance by counterparties to financial instrument contracts; however, nonperformance is considered unlikely and any nonperformance is unlikely to be material, as it is the Company’s policy to contract only with diverse, credit-worthy counterparties based upon both strong credit ratings and other credit considerations.\nThe Company is exposed to market risk from foreign currency exchange rates, interest rates and commodity price fluctuations. Volatility relating to these exposures is managed on a global basis by utilizing a number of techniques, including working capital management, sourcing strategies, selling price increases, selective borrowings in local currencies and entering into selective derivative instrument transactions, issued with standard features, in accordance with the Company’s treasury and risk management policies, which prohibit the use of derivatives for speculative purposes and leveraged derivatives for any purpose. It is the Company’s policy to enter into derivative instrument contracts with terms that match the underlying exposure being hedged. Provided below are details of the Company’s exposures by type of risk and derivative instruments by type of hedge designation.\nValuation Considerations\nThe Company’s derivative instruments include foreign currency contracts and commodity contracts. The fair value of these instruments are classified as follows:\nLevel 1: Quoted market prices in active markets for identical assets or liabilities.\nLevel 2: Observable market-based inputs or unobservable inputs that are corroborated by market data.\nLevel 3: Unobservable inputs reflecting the reporting entity’s own assumptions.\nForeign Exchange Risk\nAs the Company markets its products in over \n200\n countries and territories, it is exposed to currency fluctuations related to manufacturing and selling its products in currencies other than the U.S. dollar. The Company manages its foreign currency exposures through a combination of cost containment measures, sourcing strategies, selling price increases and the hedging of certain costs in an effort to minimize the impact on earnings of foreign currency rate movements.\nThe Company primarily utilizes foreign currency contracts, including forward and swap contracts, option contracts, foreign and local currency deposits and local currency borrowings to hedge portions of its foreign currency purchases, assets and liabilities arising in the normal course of business and the net investment in certain foreign subsidiaries. The duration of foreign currency contracts generally does not exceed 12 months and the contracts are valued using observable market rates (Level 2 valuation).\nInterest Rate Risk\nThe Company manages its targeted mix of fixed and floating rate debt with debt issuances and by entering into interest rate swaps in order to mitigate fluctuations in earnings and cash flows that may result from interest rate volatility. The Company utilizes forward-starting interest rate swaps to mitigate the risk of variability in interest rates for future debt issuances. The notional amount, interest payment and maturity date of the swaps generally match the principal, interest payment and maturity date of the related debt, and the swaps are valued using observable benchmark rates (Level 2 valuation).\n88\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\nCommodity Price Risk\nThe Company is exposed to price volatility related to raw materials used in production, such as resins, essential oils, tropical oils, pulp, tallow, corn, poultry and soybeans. The Company manages its raw material exposures through a combination of cost containment measures, sourcing strategies, ongoing productivity initiatives and the limited use of commodity hedging contracts. Futures contracts are used on a limited basis, primarily in the Hill’s Pet Nutrition segment, to manage volatility related to raw material inventory purchases of certain traded commodities, and these contracts are measured using quoted commodity exchange prices (Level 1 valuation). The duration of the commodity contracts generally does not exceed 12 months.\nCredit Risk\nThe Company is exposed to the risk of credit loss in the event of nonperformance by counterparties to financial instrument contracts; however, nonperformance is considered unlikely and any nonperformance is unlikely to be material as it is the Company’s policy to contract with diverse, credit-worthy counterparties based upon both strong credit ratings and other credit considerations. \nThe following table summarizes the fair value of the Company’s derivative instruments and other financial instruments which are carried at fair value in the Company’s Consolidated Balance Sheets as of December 31, 2024 and 2023:\n \nAssets\nLiabilities\n \nAccount\nFair Value\nAccount\nFair Value\nDesignated derivative instruments\n \nDecember 31, 2024\nDecember 31, 2023\n \nDecember 31, 2024\nDecember 31, 2023\nForeign currency contracts\nOther current assets\n33\n \n19\n \nOther accruals\n22\n \n25\n \nCommodity contracts\nOther current assets\n—\n \n—\n \nOther accruals\n1\n \n1\n \nTotal designated\n \n$\n33\n \n$\n19\n \n \n$\n23\n \n$\n26\n \nOther financial instruments\n \n \n \n \n \n \nMarketable securities\nOther current assets\n160\n \n179\n \n \n \n \nTotal other financial instruments\n \n$\n160\n \n$\n179\n \n \n \n \nThe carrying amount of cash, cash equivalents, accounts receivable and short-term debt approximated fair value as of December 31, 2024 and 2023. The estimated fair value of the Company’s long-term debt, including the current portion, as of December 31, 2024 and 2023, was $\n7,433\n and $\n7,862\n, respectively, and the related carrying value was $\n7,941\n and $\n8,239\n, respectively. The estimated fair value of long-term debt was derived principally from quoted prices on the Company’s outstanding fixed-term notes (Level 2 valuation).\n89\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\nThe following tables present the notional values as of:\n \nDecember 31, 2024\n \nForeign\nCurrency\nContracts\nForeign Currency Debt\nCommodity Contracts\n \nTotal\nFair Value Hedges \n$\n1,669\n \n$\n—\n \n$\n—\n \n$\n1,669\n \nCash Flow Hedges \n1,023\n \n—\n \n18\n \n1,041\n \nNet Investment Hedges\n289\n \n3,750\n \n—\n \n4,039\n \n \nDecember 31, 2023\n \nForeign\nCurrency\nContracts\nForeign Currency Debt\nCommodity Contracts\n \nTotal\nFair Value Hedges \n$\n1,625\n \n$\n—\n \n$\n—\n \n$\n1,625\n \nCash Flow Hedges \n869\n \n—\n \n39\n \n908\n \nNet Investment Hedges\n280\n \n3,908\n \n—\n \n4,188\n \nThe amount of gain (loss) recognized in income associated with fair value hedges did not have a material impact on the Company’s Consolidated Financial Statements during the twelve months ended December 31, 2024.\nThe amount of gain (loss) recognized in income and Accumulated Other Comprehensive Income (AOCI) associated with cash flow hedges did not have a material impact on the Company’s Consolidated Financial Statements during the twelve months ended December 31, 2024.\nThe following table presents the amount of gain (loss) on net investment hedges recognized in the Company’s AOCI:\nGain (Loss) Recognized in AOCI\nTwelve Months Ended December 31,\nHedging instruments:\n2024\n2023\nForeign currency contracts\n$\n42\n \n$\n(\n34\n)\nForeign currency debt\n211\n \n(\n124\n)\nTotal gain (loss) on net investment hedges\n$\n253\n \n$\n(\n158\n)\n90\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\n7.    \nCapital Stock and Stock-Based Compensation Plans\nPreference Stock\nThe Company has the authority to issue \n50,262,150\n shares of preference stock. \nStock Repurchases\nOn March 10, 2022, the Board authorized the repurchase of shares of the Company’s common stock having an aggregate purchase price of up to $\n5\n billion under a new share repurchase program, which replaced a previously authorized share repurchase program. The Board also has authorized share repurchases on an ongoing basis to fulfill certain requirements of the Company’s compensation and benefit programs. The shares are repurchased from time to time in open market or privately negotiated transactions at the Company’s discretion, subject to market conditions, customary blackout periods and other factors. The Company repurchased its common stock at a cost of $\n1,739\n during 2024.\nThe Company may use either authorized and unissued shares or treasury shares to meet share requirements resulting from the exercise of stock options and the vesting of restricted stock unit awards.\nA summary of common stock and treasury stock activity for the three years ended December 31 is as follows:\n  \nCommon Stock Outstanding\nTreasury Stock\nBalance, January 1, 2022\n840,480,284\n \n625,226,076\n \nCommon stock acquired\n(\n17,060,788\n)\n17,060,788\n \nShares issued for stock options\n5,654,692\n \n(\n5,654,692\n)\nShares issued for restricted stock units and other\n1,138,418\n \n(\n1,138,418\n)\nBalance, December 31, 2022\n830,212,606\n \n635,493,754\n \nCommon stock acquired\n(\n14,735,909\n)\n14,735,909\n \nShares issued for stock options\n5,318,430\n \n(\n5,318,430\n)\nShares issued for restricted stock units and other\n617,642\n \n(\n617,642\n)\nBalance, December 31, 2023\n821,412,769\n \n644,293,591\n \nCommon stock acquired\n(\n18,321,422\n)\n18,321,422\n \nShares issued for stock options\n8,606,699\n \n(\n8,606,699\n)\nShares issued for restricted stock units and other\n876,652\n \n(\n876,652\n)\nBalance, December 31, 2024\n812,574,698\n \n653,131,662\n \n91\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\nStock-Based Compensation\nThe Company recognizes the cost of employee services received in exchange for awards of equity instruments, such as stock options and restricted stock units, based on the fair value of those awards at the date of grant. The fair value of restricted stock units, generally based on market price, is amortized ratably over the requisite service period. The estimated fair value of stock options on the date of grant, based on the Black-Scholes value described below, is amortized on a straight-line basis over the requisite service period for each separately vesting portion of the award. The Company accounts for forfeitures as they occur. Awards to employees eligible for retirement prior to the award becoming fully vested are recognized as compensation cost from the grant date through the date that the employee first becomes eligible to retire and is no longer required to provide service to earn the award.\nThe Company has \none\n incentive compensation plan pursuant to which it issues restricted stock units (both performance-based and time-vested) and stock options to employees and shares of common stock and stock options to non-employee directors. The Personnel and Organization Committee of the Board, which is comprised entirely of independent directors, administers the incentive compensation plan. The total stock-based compensation expense charged against pretax income for this plan was $\n135\n, $\n122\n and $\n125\n for the years ended December 31, 2024, 2023 and 2022, respectively. The total income tax benefit recognized on stock-based compensation, excluding excess tax benefits, was approximately $\n26\n, $\n22\n and $\n25\n for the years ended December 31, 2024, 2023 and 2022, respectively.\nStock-based compensation expense is recorded within Selling, general and administrative expenses in the Corporate segment as these amounts are not included in internal measures of segment operating performance.\nThe Company uses the Black-Scholes option pricing model to estimate the fair value of stock option awards. \nThe weighted-average fair value assumptions are summarized in the following table:\n  \n2024\n2023\n2022\nExpected term of options\n6\n years\n6\n years\n6\n years\nExpected volatility rate\n20.5\n \n%\n19.8\n \n%\n21.1\n \n%\nRisk-free interest rate\n3.8\n \n%\n4.3\n \n%\n3.0\n \n%\nExpected dividend yield\n2.1\n \n%\n2.5\n \n%\n2.4\n \n%\nWeighted-average estimated fair value\n$\n22.65\n$\n14.89\n$\n14.71\nThe weighted-average expected term of options granted each year was determined with reference to historical exercise and post-vesting cancellation experience, the vesting period of the awards and the contractual term of the awards, among other factors. Expected volatility incorporates implied share-price volatility derived from exchange traded options on the Company’s common stock. The risk-free interest rate for the expected term of the option is based on the yield of a zero-coupon U.S. Treasury bond with a maturity period equal to the option’s expected term.\nStock Options\nThe Company issues non-qualified stock options to non-employee directors, officers and other key employees. Stock options have a contractual term of \neight years\n and generally vest ratably over \nthree years\n. As of December 31, 2024, approximately \n19,248,078\n shares of common stock were available for future stock option grants. \n92\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\nA summary of stock option activity during 2024 is presented below:\n  \nShares\n(in thousands)\nWeighted Average Exercise Price\nWeighted Average Remaining Contractual Life\n(in years)\nIntrinsic Value of Unexercised \nIn-the-Money Options\nOptions outstanding, January 1, 2024\n20,742\n \n$\n75\n \nGranted\n955\n \n106\n \n \n \nExercised\n(\n8,662\n)\n74\n \n \nForfeited\n(\n240\n)\n76\n \n \n \nExpired\n(\n21\n)\n73\n \nOptions outstanding, December 31, 2024\n12,774\n \n78\n \n5\n$\n176\n \nOptions exercisable, December 31, 2024\n9,265\n \n$\n76\n \n4\n$\n136\n \nAs of December 31, 2024, there \nwas $\n12\n of total unrecognized compensation expense related to unvested stock options, which will be recognized over a weighted-average period of \n1.3\n years\n. The\n total intrinsic value of options \nexercised during the years ended December 31, 2024, 2023 and 2022 was \n$\n150\n, $\n28\n and $\n47\n, respectively.\nThe benefits of tax deductions in excess of grant date fair value resulting from the exercise of stock options and vesting of restricted stock unit awards for the years ended December 31, 2024, 2023 and 2022 were\n $\n18\n,\n $\n4\n and $\n2\n, respectively, and are recognized in the provision for income taxes as a discrete item in the quarterly period in which they occur and classified as an operating cash flow. Cash proceeds received from options exercised for the years ended December 31, 2024, 2023 and 2022 were \n$\n638\n,\n $\n380\n and $\n418\n, respectively.\nPerformance-based Restricted Stock Units\nUnder the Company’s long-term incentive compensation program, the Company grants officers and other key employees a target number of unearned performance-based restricted stock units at the beginning of each \nthree-year\n performance cycle. Awards are earned and vest following the conclusion of the performance period on the basis of achievement of performance goals established at the commencement of each \nthree-year\n performance period.\nA summary of performance-based restricted stock unit activity for the year ended December 31, 2024 is presented below:\n  \nShares\n(in thousands)\nWeighted Average Grant Date Fair Value Per Award\nPerformance-based restricted stock units as of January 1, 2024\n1,069\n \n$\n68\n \nActivity:\nGranted\n321\n \n91\n \nVested\n(\n283\n)\n70\n \nForfeited\n(\n89\n)\n72\n \nChange due to performance and/or market condition achievement\n19\n \n57\n \nPerformance-based restricted stock units as of December 31, 2024\n1,037\n \n$\n74\n \n      As of December 31, 2024, there was $\n32\n of total unrecognized compensation expense related to unvested performance-based restricted stock unit awards, which will be recognized ratably over the remaining performance period.\nThe Company uses a Monte-Carlo simulation model to estimate the fair value of performance-based restricted stock units at the date of grant.\n93\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\nTime-Vested Restricted Stock Units\nThe Company also grants time-vested restricted stock unit awards. Awards either vest at the end of the restriction period, which is generally \nthree years\n from the date of grant, or ratably over the restriction period. As of December 31, 2024, approximately \n7,324,623\n shares of common stock were available for future restricted stock unit awards.\nA summary of restricted stock unit activity during 2024 is presented below:\n  \nShares\n(in thousands)\nWeighted Average Grant Date Fair Value Per Award\nRestricted stock units as of January 1, 2024\n2,174\n \n$\n76\n \nActivity:\nGranted\n854\n \n105\n \nVested\n(\n951\n)\n76\n \nForfeited\n(\n90\n)\n77\n \nRestricted stock units as of December 31, 2024\n1,987\n \n$\n88\n \nAs of December 31, 2024, there was $\n68\n of total unrecognized compensation expense related to unvested time-vested restricted stock unit awards, which will be recognized over a weighted-average period of \n1.6\n years. The total fair value of time-vested restricted stock units vested during the years ended December 31, 2024, 2023 and 2022 was $\n72\n, $\n45\n and $\n40\n, respectively.\n94\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\n8.    \nEmployee Stock Ownership Plan\nIn 1989, the Company expanded its Employee Stock Ownership Plan (\n“\nESOP\n”\n) through the introduction of a leveraged ESOP that funds certain benefits for employees who have met eligibility requirements. As of December 31, 2024 and 2023, there were \n7,428,343\n and \n8,348,104\n shares of common stock, respectively, outstanding and issued to the Company\n’\ns ESOP. \nDuring 2000, the ESOP entered into a loan agreement with the Company under which the benefits of the ESOP may be extended through 2035. As of December 31, 2024, the ESOP had \nno\n outstanding borrowings from the Company.\nDividends on stock held by the ESOP are paid to the ESOP trust and, together with cash contributions from the Company, are (a) used by the ESOP to repay principal and interest, (b) credited to participant accounts, (c) used for contributions to the Company’s defined contribution plans or (d) used to pay the Company’s defined contribution plan expenses. Stock is allocated to participants based upon the ratio of the current year’s debt service to the sum of total outstanding principal and interest payments over the life of the debt. As of December 31, 2024, \n7,334,758\n shares of common stock had been released and allocated to participant accounts and \n93,585\n shares of common stock were available for future release and allocation to participant accounts. \nDividends on the stock used to repay principal and interest or credited to participant accounts are deductible for income tax purposes and, accordingly, are reflected net of their tax benefit in the Consolidated Statements of Changes in Shareholders’ Equity.\nAnnual expense related to the ESOP was $\n0\n in 2024, 2023 and 2022. \n The Company paid dividends on the shares held by the ESOP of $\n16\n in 2024, $\n17\n in 2023 and $\n19\n in 2022. The Company did \nno\nt make any contributions to the ESOP in 2024, 2023 or 2022.\n95\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\n9.    \nRetirement Plans and Other Retiree Benefits\nRetirement Plans\nThe Company and certain of its U.S. and foreign subsidiaries maintain defined benefit retirement plans. Benefits under these plans are based primarily on years of service and employees’ earnings.\nIn the U.S., effective January 1, 2014, the Company provides virtually all future retirement benefits through the Company’s defined contribution plan. As a result, service after December 31, 2013 is not considered for participants in the Company’s principal U.S. defined benefit retirement plan. Participants in the Company’s principal U.S. defined benefit retirement plan whose retirement benefit was determined under the cash balance formula continue to earn interest credits on their vested balances as of December 31, 2013 but no longer receive pay credits. Participants whose retirement benefit was determined under the final average earnings formula or career average earnings formula continue to have their accrued benefit adjusted for pay increases until termination of employment. \nIn the first quarter of 2023, the Company recorded a charge of $\n267\n as a result of a decision of the United States Court of Appeals for the Second Circuit (the “Second Circuit”) affirming a grant of summary judgment to the plaintiffs in a lawsuit under the Employee Retirement Income Security Act seeking the recalculation of benefits and other relief associated with a 2005 residual annuity amendment to the Colgate-Palmolive Company Employees’ Retirement Income Plan (the “Retirement Plan”). The decision resulted in an increase in the obligations of the Retirement Plan, which based on the current funded status of the Retirement Plan and depending on further developments in the litigation, may require a cash contribution by the Company in 2025. See Note 12, Commitments and Contingencies for additional information.\n96\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\nIn the Company’s principal U.S. plans and certain funded foreign plans, funds are contributed to trusts in accordance with regulatory limits to provide for current service and for any unfunded projected benefit obligation over a reasonable period. \nThe target asset allocation for the Company’s defined benefit plans is as follows:\n  \nUnited States\nInternational\nAsset Category\nEquity securities\n26\n \n%\n17\n \n%\nFixed income securities\n60\n \n%\n63\n \n%\nOther investments\n14\n \n%\n20\n \n%\nTotal\n100\n \n%\n100\n \n%\nAt December 31, 2024, the allocation of the Company’s plan assets and the level of valuation input, as applicable, for each major asset category were as follows:\n \nLevel of Valuation\nInput\nPension Plans\n  \nUnited States\nInternational\n  \n \n \nCash and cash equivalents\nLevel 1\n$\n226\n \n$\n21\n \nU.S. common stocks\nLevel 1\n1\n \n2\n \nInternational common stocks\nLevel 1\n—\n \n15\n \nPooled funds\n(1)\nLevel 1\n35\n \n103\n \nFixed income securities\n(2)\nLevel 2\n624\n \n75\n \nGuaranteed investment contracts\n(3)\nLevel 2\n—\n \n30\n \n  \n886\n \n246\n \nInvestments valued using NAV per share\n(4)\n  \nDomestic, developed and emerging markets equity funds\n  \n223\n \n28\n \nFixed income funds\n(5)\n  \n68\n \n222\n \nHedge funds\n(6)\n  \n—\n \n7\n \nMulti-asset funds\n(7)\n  \n157\n \n2\n \nReal estate funds\n(8)\n—\n \n27\n \n  \n448\n \n286\n \nOther assets and liabilities, net\n(9)\n(\n39\n)\n5\n \nTotal Investments\n$\n1,295\n \n$\n537\n \n97\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\nAt December 31, 2023, the allocation of the Company’s plan assets and the level of valuation input, as applicable, for each major asset category were as follows:\n \nLevel of Valuation\nInput\nPension Plans\n  \nUnited States\nInternational\n  \n \nCash and cash equivalents\nLevel 1\n$\n206\n \n$\n14\n \nU.S. common stocks\nLevel 1\n—\n \n2\n \nInternational common stocks\nLevel 1\n—\n \n20\n \nPooled funds\n(1)\nLevel 1\n20\n \n113\n \nFixed income securities\n(2)\nLevel 2\n710\n \n71\n \nGuaranteed investment contracts\n(3)\nLevel 2\n—\n \n34\n \n  \n936\n \n254\n \nInvestments valued using NAV per share\n(4)\n  \nDomestic, developed and emerging markets equity funds\n  \n315\n \n55\n \nFixed income funds\n(5)\n  \n99\n \n219\n \nHedge funds\n(6)\n  \n—\n \n7\n \nMulti-asset funds\n(7)\n  \n40\n \n1\n \nReal estate funds\n(8)\n—\n \n30\n \n454\n \n312\n \nOther assets and liabilities, net\n(9)\n(\n30\n)\n—\n \nTotal Investments\n  \n$\n1,360\n \n$\n566\n \n(1)\nPooled funds primarily invest in U.S. and foreign equity securities, debt and money market securities. \n(2)\nThe fixed income securities are traded over-the-counter and certain of these securities lack daily pricing or liquidity and as such are classified as Level 2. As of December 31, 2024 and December 31, 2023, approximately \n30\n% of the U.S. pension plan fixed income portfolio was invested in U.S. treasury or agency securities, with the remainder invested in other government bonds and corporate bonds.\n(3)\nThe guaranteed investment contracts (“GICs”) represent contracts with insurance companies measured at the cash surrender value of each contract. The Level 2 valuation reflects that the cash surrender value is based principally on a referenced pool of investment funds with active redemption.\n(4)\nInvestments that are measured at fair value using net asset value (“NAV”) per share as a practical expedient have not been classified in the fair value hierarchy. The NAV is based on the value of the underlying investments owned, minus its liabilities, divided by the number of shares outstanding. There are no unfunded commitments related to these investments. Redemption notice period primarily ranges from \n0\n-\n3\n months and redemption frequency windows range from daily to quarterly.\n(5)\nFixed income funds primarily invest in U.S. government and investment grade corporate bonds.\n(6)\nConsists of investments in underlying hedge fund strategies that are primarily implemented through the use of long and short equity and fixed income securities and derivative instruments such as futures and options.\n(7)\nMulti-asset funds primarily invest across a variety of asset classes, including global stocks and bonds, as well as alternative strategies.\n(8)\nReal estate is valued using the NAV per unit of funds that are invested in real estate property. The investment value of the real estate property is determined quarterly using independent market appraisals as determined by the investment manager. \n(9)\nThis category primarily includes unsettled trades for investments purchased and sold and interest receivables.\n \n98\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\nEquity securities in the U.S. defined benefit retirement plans did \nno\nt include any investment in the Company’s common stock at either December 31, 2024 or December 31, 2023. \nNo\n shares of the Company’s stock were purchased by the U.S. plans in 2024 or 2023. The plans received \nno\n dividends on the Company’s common stock in either 2024 or 2023.\nOther Retiree Benefits\nThe Company and certain of its subsidiaries provide, to the extent not otherwise provided by government-sponsored plans, health and life insurance benefits or subsidies for retired employees who meet applicable eligibility requirements.\nThe Company uses a December 31 measurement date for its defined benefit and other retiree benefit plans. Summarized information for the Company’s defined benefit and other retiree benefit plans is as follows:\n99\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\n  \nPension Plans\nOther Retiree Benefit Plans\n \n2024\n2023\n2024\n2023\n2024\n2023\n  \nUnited States\nInternational\n \n \nChange in Benefit Obligations\n \n \n \n \n \n \nBenefit obligations at beginning of year\n$\n1,922\n \n$\n1,673\n \n$\n776\n \n$\n675\n \n$\n665\n \n$\n658\n \nService cost\n1\n \n—\n \n16\n \n15\n \n7\n \n7\n \nInterest cost\n99\n \n91\n \n33\n \n33\n \n36\n \n38\n \nParticipants’ contributions\n—\n \n—\n \n5\n \n5\n \n—\n \n—\n \nPlan amendments\n—\n \n—\n \n—\n \n—\n \n—\n \n(\n33\n)\nActuarial loss (gain)\n(\n54\n)\n36\n \n(\n11\n)\n65\n \n(\n14\n)\n38\n \nForeign exchange impact\n—\n \n—\n \n(\n40\n)\n29\n \n(\n8\n)\n4\n \nTermination benefits\n5\n \n3\n \n—\n \n2\n \n—\n \n—\n \nCurtailments and settlements\n(\n1\n)\n—\n \n(\n18\n)\n(\n6\n)\n—\n \n—\n \nBenefit payments\n(\n141\n)\n(\n148\n)\n(\n41\n)\n(\n42\n)\n(\n54\n)\n(\n47\n)\nERISA litigation matter\n—\n \n267\n \n—\n \n—\n \n—\n \n—\n \nBenefit obligations at end of year\n$\n1,831\n \n$\n1,922\n \n$\n720\n \n$\n776\n \n$\n632\n \n$\n665\n \nChange in Plan Assets\n \n \nFair value of plan assets at beginning of year\n$\n1,360\n \n$\n1,363\n \n$\n566\n \n$\n516\n \n$\n—\n \n$\n—\n \nActual return on plan assets\n49\n \n115\n \n18\n \n26\n \n—\n \n—\n \nCompany contributions\n29\n \n30\n \n37\n \n39\n \n54\n \n47\n \nParticipants’ contributions\n—\n \n—\n \n5\n \n5\n \n—\n \n—\n \nForeign exchange impact\n—\n \n—\n \n(\n31\n)\n27\n \n—\n \n—\n \nSettlements and acquisitions\n(\n2\n)\n—\n \n(\n17\n)\n(\n5\n)\n—\n \n—\n \nBenefit payments\n(\n141\n)\n(\n148\n)\n(\n41\n)\n(\n42\n)\n(\n54\n)\n(\n47\n)\nFair value of plan assets at end of year\n$\n1,295\n \n$\n1,360\n \n$\n537\n \n$\n566\n \n$\n—\n \n$\n—\n \nFunded Status\n \n \nBenefit obligations at end of year\n$\n1,831\n \n$\n1,922\n \n$\n720\n \n$\n776\n \n$\n632\n \n$\n665\n \nFair value of plan assets at end of year\n1,295\n \n1,360\n \n537\n \n566\n \n—\n \n—\n \nNet amount recognized\n$\n(\n536\n)\n$\n(\n562\n)\n$\n(\n183\n)\n$\n(\n210\n)\n$\n(\n632\n)\n$\n(\n665\n)\nAmounts Recognized in Balance Sheet\n \n \n \n \nNoncurrent assets\n$\n1\n \n$\n1\n \n$\n47\n \n$\n48\n \n$\n—\n \n$\n—\n \nCurrent liabilities\n(\n27\n)\n(\n28\n)\n(\n15\n)\n(\n15\n)\n(\n51\n)\n(\n53\n)\nNoncurrent liabilities\n(\n510\n)\n(\n535\n)\n(\n215\n)\n(\n243\n)\n(\n581\n)\n(\n612\n)\nNet amount recognized\n$\n(\n536\n)\n$\n(\n562\n)\n$\n(\n183\n)\n$\n(\n210\n)\n$\n(\n632\n)\n$\n(\n665\n)\nAmounts Recognized in Accumulated Other Comprehensive Income (Loss)\n \n \nActuarial loss\n$\n710\n \n$\n767\n \n$\n174\n \n$\n177\n \n$\n109\n \n$\n128\n \nTransition/prior service cost(credit)\n—\n \n—\n \n8\n \n9\n \n(\n159\n)\n(\n180\n)\n  \n$\n710\n \n$\n767\n \n$\n182\n \n$\n186\n \n$\n(\n50\n)\n$\n(\n52\n)\nAccumulated benefit obligation\n$\n1,818\n \n$\n1,907\n \n$\n668\n \n$\n719\n \n$\n—\n \n$\n—\n \n100\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\n  \nPension Plans\nOther Retiree Benefit Plans\n  \n2024\n2023\n2024\n2023\n2024\n2023\n  \nUnited States\nInternational\n \n \nWeighted-Average Assumptions Used to Determine Benefit Obligations\n \n \n \n \n \n \nDiscount rate\n5.73\n \n%\n5.40\n \n%\n4.69\n \n%\n4.35\n \n%\n5.74\n \n%\n5.37\n \n%\nLong-term rate of compensation increase\n3.50\n \n%\n3.50\n \n%\n3.36\n \n%\n3.19\n \n%\n—\n \n%\n—\n \n%\nESOP growth rate\n—\n \n%\n—\n \n%\n—\n \n%\n—\n \n%\n6.00\n \n%\n6.00\n \n%\nMedical cost trend rate of increase\n—\n \n%\n—\n \n%\n—\n \n%\n—\n \n%\n7.00\n \n%\n6.00\n \n%\nInterest Crediting Rate\n5.58\n \n%\n4.99\n \n%\n3.23\n \n%\n1.13\n \n%\n—\n \n%\n—\n \n%\nThe actuarial gains recorded during 2024 for both the U.S. pension and Other retiree benefit plans were primarily a result of an increase in discount rates applied against future estimated benefit payments that resulted in a decrease in the benefit obligation for both the U.S. pension and Other retiree benefit plans. The actuarial losses recorded during 2023 for both the U.S. pension and Other retiree benefit plans were primarily a result of a decrease in discount rates applied against future estimated benefit payments that resulted in an increase in the benefit obligation for both the U.S. pension and Other retiree benefit plans.\nThe overall investment objective of the plans is to balance risk and return so that obligations to employees are met. The Company evaluates its expected long-term rate of return on plan assets on an annual basis. In determining the expected long-term rate of return, the Company considers the nature of the plans’ investments and the historical rates of return. The assumed expected long-term rate of return on plan assets for U.S. pension plans was \n6.50\n% as of December 31, 2024 and  December 31, 2023. Average annual rates of return on plan assets for the U.S. pension plans for the most recent 1-year, 5-year, 10-year, 15-year and 25-year periods were \n5\n%, \n2\n%, \n4\n%, \n6\n% and \n5\n%, respectively. Similar assessments were performed in determining rates of return on international pension plan assets to arrive at the Company’s 2024 weighted-average expected long-term rate of return on plan assets of \n5.69\n%.\nThe medical cost trend rate of increase assumed in measuring the expected cost of benefits is projected to decrease from \n7.00\n% in 2025 to \n5.00\n% by \n2030\n, remaining at \n4.50\n% for the years thereafter. \nPension plans with projected benefit obligations in excess of plan assets and plans with accumulated benefit obligations in excess of plan assets as of December 31 consisted of the following:\n  \n2024\n2023\nBenefit Obligation Exceeds Fair Value of Plan Assets\n \n \nProjected benefit obligation\n$\n2,251\n \n$\n2,352\n \nFair value of plan assets\n1,486\n \n1,532\n \nAccumulated benefit obligation\n2,075\n \n2,204\n \nFair value of plan assets\n1,345\n \n1,428\n \nOther Retiree Benefit plans with accumulated postretirement benefit obligation in excess of plan assets as of December 31 consisted of the following:\n  \n2024\n2023\nBenefit Obligation Exceeds Fair Value of Plan Assets\n \n \nAccumulated postretirement benefit obligation\n$\n632\n \n$\n665\n \nFair value of plan assets\n—\n \n—\n \n101\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\nSummarized information regarding the net periodic benefit costs for the Company’s defined benefit and other retiree benefit plans is as follows:\n  \nPension Plans\nOther Retiree Benefit Plans\n  \n2024\n2023\n2022\n2024\n2023\n2022\n2024\n2023\n2022\n  \nUnited States\nInternational\n \n \n \nComponents of Net Periodic Benefit Cost\n \n \n \n \n \n \n \n \n \nService cost\n$\n1\n \n$\n—\n \n$\n—\n \n$\n16\n \n$\n15\n \n$\n15\n \n$\n7\n \n$\n7\n \n$\n18\n \nInterest cost\n99\n \n91\n \n64\n \n33\n \n33\n \n21\n \n36\n \n38\n \n36\n \nExpected return on plan assets\n(\n85\n)\n(\n79\n)\n(\n101\n)\n(\n29\n)\n(\n25\n)\n(\n21\n)\n—\n \n—\n \n—\n \nAmortization of transition and prior service costs (credits)\n—\n \n—\n \n—\n \n1\n \n1\n \n1\n \n(\n21\n)\n(\n20\n)\n(\n6\n)\nAmortization of actuarial loss\n39\n \n43\n \n46\n \n5\n \n5\n \n7\n \n4\n \n1\n \n14\n \nNet periodic benefit cost\n$\n54\n \n$\n55\n \n$\n9\n \n$\n26\n \n$\n29\n \n$\n23\n \n$\n26\n \n$\n26\n \n$\n62\n \nOther postretirement charges\n5\n \n3\n \n13\n \n—\n \n2\n \n4\n \n—\n \n—\n \n2\n \nERISA litigation matter\n—\n267\n \n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \nTotal pension cost\n$\n59\n \n$\n325\n \n$\n22\n \n$\n26\n \n$\n31\n \n$\n27\n \n$\n26\n \n$\n26\n \n$\n64\n \nWeighted-Average Assumptions Used to Determine Net Periodic Benefit Cost\n \n \n \n \n \n \n \n \n \nDiscount rate\n5.40\n \n%\n5.66\n \n%\n2.98\n \n%\n4.61\n \n%\n4.75\n \n%\n2.10\n \n%\n5.37\n \n%\n5.67\n \n%\n3.06\n \n%\nExpected long-term rate of return on plan assets\n6.50\n \n%\n6.25\n \n%\n5.70\n \n%\n5.69\n \n%\n4.66\n \n%\n2.72\n \n%\nN/A\nN/A\nN/A\nLong-term rate of compensation increase\n3.50\n \n%\n3.50\n \n%\n3.50\n \n%\n3.24\n \n%\n3.22\n \n%\n2.89\n \n%\n—\n \n%\n—\n \n%\n—\n \n%\nESOP growth rate\n—\n \n%\n—\n \n%\n—\n \n%\n—\n \n%\n—\n \n%\n—\n \n%\n6.00\n \n%\n6.00\n \n%\n6.00\n \n%\nMedical cost trend rate of increase\n—\n \n%\n—\n \n%\n—\n \n%\n—\n \n%\n—\n \n%\n—\n \n%\n6.00\n \n%\n6.25\n \n%\n6.00\n \n%\nInterest Crediting Rate\n4.99\n \n%\n5.21\n \n%\n2.82\n \n%\n0.64\n \n%\n2.28\n \n%\n0.84\n \n%\n—\n \n%\n—\n \n%\n—\n \n%\n102\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\nThe service related component of pension and other postretirement benefit costs is included in Operating profit. The non-service related components (interest cost, expected return on assets, amortization of transition and prior service costs and credits and amortization of actuarial gains and losses) are included in the line item “Non-service related postretirement costs,” which is below Operating profit.\nThe Company made \nno\n voluntary contributions in 2024, 2023 and 2022.\n \nExpected Contributions and Benefit Payments\nAt present, the Company does not expect to make any voluntary contributions to its U.S. postretirement plans for the year ending December 31, 2025. Actual funding may differ from current estimates depending on the variability of the market value of the assets, changes in the benefit obligations and other market or regulatory conditions.\nBenefit payments expected to be paid from the Company’s assets to participants in unfunded plans are estimated to be approximately $\n95\n for the year ending December 31, 2025. \nTotal benefit payments expected to be paid to participants in both funded and unfunded plans are estimated as follows:\n  \nPension Plans\n \nYears Ended December 31,\nUnited States\nInternational\nOther Retiree Benefit Plans\nTotal\n2025\n$\n377\n \n$\n42\n \n$\n52\n \n471\n \n2026\n143\n \n41\n \n54\n \n238\n \n2027\n143\n \n43\n \n55\n \n241\n \n2028\n142\n \n45\n \n55\n \n242\n \n2029\n141\n \n46\n \n55\n \n242\n \n2030-2034\n653\n \n247\n \n274\n \n1,174\n \n103\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\n10.    \nIncome Taxes\nThe components of Income before income taxes are as follows for the years ended December 31:\n  \n2024\n2023\n2022\nUnited States\n$\n1,084\n \n$\n692\n \n$\n1,169\n \nInternational\n2,872\n \n2,700\n \n1,491\n \nTotal Income before income taxes\n$\n3,956\n \n$\n3,392\n \n$\n2,660\n \nThe Provision for income taxes consists of the following for the years ended December 31:\n  \n2024\n2023\n2022\nUnited States\n$\n188\n \n$\n72\n \n$\n199\n \nInternational\n719\n \n865\n \n494\n \nTotal Provision for income taxes\n$\n907\n \n$\n937\n \n$\n693\n \nTemporary differences between accounting for financial statement purposes and accounting for tax purposes result in the current provision for taxes being higher (lower) than the total provision for income taxes as follows:\n  \n2024\n2023\n2022\nGoodwill and intangible assets\n$\n3\n \n$\n1\n \n$\n106\n \nProperty, plant and equipment\n12\n \n(\n13\n)\n2\n \nPension and other retiree benefits\n(\n6\n)\n68\n \n(\n1\n)\nStock-based compensation\n(\n14\n)\n2\n \n(\n3\n)\nRight-of-use assets/lease liabilities\n2\n \n1\n \n(\n5\n)\nTax credits and tax loss carryforwards, net of valuation allowance\n37\n \n29\n \n8\n \nDeferred withholding tax\n(\n14\n)\n7\n \n8\n \nResearch and Experimentation Capitalization\n21\n \n29\n \n58\n \nOther, net\n(\n8\n)\n11\n \n(\n10\n)\nTotal deferred tax benefit (provision)\n$\n33\n \n$\n135\n \n$\n163\n \nThe difference between the statutory U.S. federal income tax rate and the Company’s global effective tax rate as reflected in the Consolidated Statements of Income is as follows:\n2024\n2023\n2022\nPercentage of Income before income taxes\nTax at United States statutory rate\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nState income taxes, net of federal benefit\n0.5\n \n(\n0.1\n)\n0.8\n \nEarnings taxed at other than United States statutory rate\n4.1\n \n5.4\n \n5.4\n \nNon-deductible goodwill impairment charges\n—\n \n—\n \n1.9\n \nForeign-derived intangible income benefit\n(\n2.6\n)\n(\n2.4\n)\n(\n2.6\n)\nForeign tax matter\n—\n \n3.7\n \n—\n \nOther, net\n(\n0.1\n)\n—\n \n(\n0.4\n)\nEffective tax rate\n22.9\n \n%\n27.6\n \n%\n26.1\n \n%\n104\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\nThe components of deferred tax assets (liabilities) are as follows at December 31:\n  \n2024\n2023\nDeferred tax liabilities:\n \nGoodwill and intangible assets\n$\n(\n389\n)\n$\n(\n412\n)\nProperty, plant and equipment\n(\n397\n)\n(\n420\n)\nRight-of-use assets\n(\n126\n)\n(\n126\n)\nDeferred withholding tax\n(\n110\n)\n(\n96\n)\nOther\n(\n130\n)\n(\n34\n)\nTotal deferred tax liabilities\n(\n1,152\n)\n(\n1,088\n)\nDeferred tax assets:\n \nPension and other retiree benefits\n272\n \n295\n \nTax credits and tax loss carryforwards\n430\n \n356\n \nLease liabilities\n137\n \n134\n \nAccrued liabilities\n223\n \n221\n \nStock-based compensation\n61\n \n75\n \nResearch and Experimentation Capitalization\n108\n \n87\n \nOther\n101\n \n60\n \nTotal deferred tax assets\n1,332\n \n1,228\n \nValuation Allowance\n$\n(\n328\n)\n$\n(\n287\n)\nNet deferred tax assets\n$\n1,004\n \n$\n941\n \nNet deferred income taxes\n$\n(\n148\n)\n$\n(\n147\n)\nThe changes in valuation allowance for deferred tax assets are as follows: \n2024\n2023\n2022\nBalance, January 1\n$\n287\n \n$\n129\n \n$\n120\n \nAdditions\n     Charged to costs and expenses\n56\n158\n14\nDeductions\n15\n—\n \n5\nBalance, December 31\n$\n328\n \n$\n287\n \n$\n129\n \nAs of December 31, 2024, the Company had net operating losses (“NOLs”) and capital loss carryforwards of $\n37\n. Of this amount, capital loss and NOL carryforwards of $\n6\n will begin to expire in 2025 and NOLs of $\n13\n can be carried forward indefinitely. The Company believes that it will be able to utilize these capital loss and NOL carryforwards. There is an additional NOL of $\n18\n which has a full valuation allowance.\nAs of December 31, 2024, the Company has $\n393\n of tax credits, of which $\n66\n will begin to expire in 2030 and $\n17\n can be carried forward indefinitely.  The Company believes that it will be able to utilize these tax credits. The remaining credits of $\n310\n have a full valuation allowance. \nApplicable U.S. income and foreign withholding taxes have been provided on substantially all of the Company’s accumulated earnings of foreign subsidiaries. \nNet tax expense of $\n55\n, net tax benefit of $\n19\n and net tax expense of $\n164\n were recorded directly through equity in 2024, 2023 and 2022 respectively. The net tax expense or benefit in each year predominantly includes current and future tax impacts related to benefit plans and the impact of currency translation adjustments. \nThe Company uses a comprehensive model to recognize, measure, present and disclose in its financial statements uncertain tax positions that the Company has taken or expects to take on an income tax return.\n105\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\nUnrecognized tax benefits activity for the years ended December 31, 2024, 2023 and 2022 is summarized below:\n  \n2024\n2023\n2022\nUnrecognized tax benefits:\n \n \n \nBalance, January 1\n$\n314\n \n$\n298\n \n$\n245\n \nIncreases as a result of tax positions taken during the current year\n37\n \n73\n \n32\n \nDecreases of tax positions taken during prior years\n(\n53\n)\n(\n61\n)\n(\n21\n)\nIncreases of tax positions taken during prior years\n10\n \n6\n \n46\n \nDecreases as a result of settlements with taxing authorities and the expiration of statutes of limitations\n(\n3\n)\n(\n2\n)\n(\n2\n)\nEffect of foreign currency rate movements\n(\n9\n)\n—\n \n(\n2\n)\nBalance, December 31\n$\n296\n \n$\n314\n \n$\n298\n \nIf all of the unrecognized tax benefits for 2024 above were recognized, approximately $\n286\n would impact the effective tax rate. It is reasonably possible that the amount of unrecognized benefits with respect to our uncertain tax positions could change in the next twelve months and such change may or may not be material.\nThe Company recognized expenses of approximately $\n22\n, $\n10\n and $\n8\n for interest and penalties related to the above unrecognized tax benefits within income tax expense in 2024, 2023 and 2022, respectively. The Company had accrued interest and penalties of approximately $\n68\n, $\n45\n and $\n40\n as of December 31, 2024, 2023 and 2022, respectively.\nIn the third quarter of 2023, the Internal Revenue Service (the “IRS”) issued a notice giving taxpayers temporary relief from the effects of certain U.S. tax regulations that were issued in December 2021, which place greater restrictions on foreign taxes that are creditable against U.S. taxes on foreign-source income. This notice allowed taxpayers to defer the application of these new regulations through the end of 2023. In December 2023, the IRS issued further guidance modifying this temporary relief period to the date that a notice or other guidance withdrawing or modifying the temporary relief is issued. The Company will recognize the impact, if any, in the period in which the temporary relief is withdrawn or modified. \nDuring the quarter ended June 30, 2023, the Company reassessed with its legal and tax advisers certain tax deductions taken in prior years by one of our subsidiaries and concluded that it was more likely than not that the deductions would not be sustained by the courts in that jurisdiction. The value of the tax deductions was not material to the Company in any year in which they were taken. The cumulative effect of the change in tax position of $\n148\n was reflected as a discrete item in the quarter ended June 30, 2023 income tax expense, partially offset by the reversal of certain prior years’ withholding tax reserves of $\n22\n that were no longer required. The tax liability was paid in the quarter ended September 30, 2023.\nOn August 16, 2022, the Inflation Reduction Act of 2022 (the “IRA”) was enacted, which among other things, implements a 15% minimum tax on book income of certain large corporations effective for years beginning after December 31, 2022. Based on the Company’s analysis, as well as guidance published by the IRS, the IRA, and in particular the 15% minimum tax, did not have an impact on the Company’s Consolidated Financial Statements. Subsequent to the aforementioned guidance published by the IRS, on September 12, 2024, the U.S. Treasury Department and IRS released proposed regulations relating to this 15% minimum tax. Based on the Company’s analysis, these proposed regulations, if finalized in their current form, are not expected to have an impact on the Company’s Consolidated Financial Statements. However, the Company will continue to evaluate any additional guidance and clarification that becomes available.\nAdditionally, on December 15, 2022, the \n27\n member states of the European Union (“EU”) reached an agreement on a minimum level of taxation for certain large corporations to pay a minimum corporate tax rate of 15% in every jurisdiction in which they operate. This agreement, which is known as the Minimum Tax Directive (part of the “Pillar II Model Rules”), was supposed to be transposed into the laws of all EU member states by December 31, 2023. Most member states complied, while some were granted extensions of time. In addition, many other jurisdictions outside the EU have implemented a similar minimum tax regime consistent with the policy of the Pillar II Model Rules. Detailed regulations of these minimum tax regimes are still being considered in certain countries and, in some cases, enactment and timing is still \n106\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\nuncertain. Based on current legislation and available guidance, apart from a significant additional compliance burden, Pillar II did not have a material impact as of December 31, 2024 and the Company does not believe it will have a material impact on its Consolidated Financial Statements. However, as these rules and related regulations are revised and implemented, the Company will evaluate the impact, if any, on its Consolidated Financial Statements.\nThe Company has ongoing federal, state and international income tax audits in various jurisdictions and evaluates uncertain tax positions that may be challenged by local tax authorities and not fully sustained. All U.S. federal income tax returns through December 31, 2013 have been audited by the IRS and there are limited matters which the Company plans to appeal for years 2010 through 2013. One such matter relates to the IRS assessment of taxes on the Company by imputing income on certain activities within one of our international operations, which is also under audit for the years 2014 through 2018. There were U.S. Tax Court rulings during 2023 in favor of the IRS against unrelated third parties on similar matters. Despite the U.S. Tax Court rulings, the Company continues to believe that the tax assessment against the Company is without merit. While there can be no assurances, the Company believes this matter will ultimately be decided in favor of the Company. The amount of tax plus interest for the years 2010 through 2018 is estimated to be approximately $\n153\n, which is not included in the Company’s uncertain tax positions. In May 2024, the IRS initiated an audit for the years 2019 through 2021.\nThe Company has made an accounting policy election to treat Global Intangible Low-Taxed Income taxes as a current period expense rather than including these amounts in the measurement of deferred taxes.\n107\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\n11.    \nEarnings Per Share\nFor the years ended December 31, 2024, 2023 and 2022, earnings per share were as follows:\n \n2024\n2023\n2022\n \nNet income attributable to Colgate-Palmolive Company\nShares\n(millions)\nPer\nShare\nNet income attributable to Colgate-Palmolive Company\nShares\n(millions)\nPer\nShare\nNet income attributable to Colgate-Palmolive Company\nShares\n(millions)\nPer\nShare\nBasic EPS\n$\n2,889\n \n819.1\n \n$\n3.53\n \n$\n2,300\n \n827.4\n \n$\n2.78\n \n$\n1,785\n \n836.4\n \n$\n2.13\n \nStock options and restricted stock units\n4.1\n \n \n \n1.8\n \n \n \n2.4\n \n \nDiluted EPS\n$\n2,889\n \n823.2\n \n$\n3.51\n \n$\n2,300\n \n829.2\n \n$\n2.77\n \n$\n1,785\n \n838.8\n \n$\n2.13\n \nBasic earnings per common share is computed by dividing net income available for common stockholders by the weighted-average number of shares of common stock outstanding for the period. \nDiluted earnings per common share is computed using the treasury stock method on the basis of the weighted-average number of shares of common stock plus the dilutive effect of potential common shares outstanding during the period. Dilutive potential common shares include outstanding stock options and restricted stock units.\nFor the years ended December 31, 2024, 2023 and 2022, the average number of stock options that were anti-dilutive and not included in diluted earnings per share calculations were \n295,968\n, \n13,719,286\n and \n5,236,371\n, respectively. For the years ended December 31, 2024, 2023 and 2022, the average number of restricted stock units that were anti-dilutive and not included in diluted earnings per share calculations were \n100,191\n, \n1,183\n and \n155,118\n, respectively.\n108\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\n12.    \nCommitments and Contingencies\nAs of December 31, 2024, the Company has various contractual commitments for future multi-year purchases of raw, packaging and other materials and services totaling approximately $\n568\n.\nAs a global company serving consumers in more than \n200\n countries and territories, the Company is routinely subject to a wide variety of legal proceedings. These include disputes relating to intellectual property, contracts, product liability, marketing, advertising, foreign exchange controls, antitrust and trade regulation, as well as labor and employment, pension, data privacy and security, environmental and tax matters and consumer class actions. In addition, management proactively reviews and monitors the Company’s exposure to, and the impact of, environmental matters. The Company is party to various environmental matters and, as such, may be responsible for all or a portion of the cleanup, restoration and post-closure monitoring of several sites.\nThe Company establishes accruals for loss contingencies when it has determined that a loss is probable and that the amount of loss, or range of loss, can be reasonably estimated. Any such accruals are adjusted thereafter as appropriate to reflect changes in circumstances.\nThe Company also determines estimates of reasonably possible losses or ranges of reasonably possible losses in excess of related accrued liabilities, if any, when it has determined that a loss is reasonably possible and it is able to determine such estimates. For those matters disclosed below for which the amount of any potential losses can be reasonably estimated, the Company currently estimates that the aggregate range of reasonably possible losses in excess of any accrued liabilities is $\n0\n to approximately $\n250\n (based on current exchange rates). The estimates included in this amount are based on the Company’s analysis of currently available information and, as new information is obtained, these estimates may change. Due to the inherent subjectivity of the assessments and the unpredictability of outcomes of legal proceedings, any amounts accrued or included in this aggregate range may not represent the ultimate loss to the Company. Thus, the Company’s exposure and ultimate losses may be higher or lower, and possibly significantly so, than the amounts accrued or the range disclosed above.\nBased on current knowledge, management does not believe that the ultimate resolution of loss contingencies arising from the matters discussed herein will have a material effect on the Company’s consolidated financial position or its ongoing results of operations or cash flows. However, in light of the inherent uncertainties noted above, an adverse outcome in one or more matters could be material to the Company’s results of operations or cash flows for any particular quarter or year.\nBrazilian Matters\nThere are certain tax and civil proceedings outstanding, as described below, related to the Company’s 1995 acquisition of the Kolynos oral care business from Wyeth (the “Seller”).\nThe Brazilian internal revenue authority has disallowed interest deductions and foreign exchange losses taken by the Company’s Brazilian subsidiary for certain years in connection with the financing of the Kolynos acquisition. The tax assessments with interest, penalties and any court-mandated fees, at the current exchange rate, are approximately $\n93\n. This amount includes additional assessments received from the Brazilian internal revenue authority in April 2016 relating to net operating loss carryforwards used by the Company’s Brazilian subsidiary to offset taxable income that had also been deducted from the authority’s original assessments. The Company has been disputing the disallowances by appealing the assessments since October 2001. \n109\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\nIn each of September 2015, February 2017, September 2018, April 2019 and August 2020, the Company lost an administrative appeal and subsequently challenged these assessments in the Brazilian federal courts. Currently, there are \nthree\n lawsuits pending in the Lower Federal Court and \ntwo\n cases have progressed to the Federal Court of Appeals. Although there can be no assurances, management believes, based on the opinion of its Brazilian legal counsel, that it has strong legal grounds to contest the disallowances and that the Company should ultimately prevail. The Company is challenging these disallowances vigorously. In November 2023, based upon changes in Brazilian tax law, the Company filed petitions in \nthree\n of the actions requesting that the penalty portion of the claim be removed. The Brazilian tax authority agreed with the Company's position and in August 2024 reduced its claim in \ntwo\n of those actions and in October 2024 reduced its claim in the third.\n \nIn July 2002, the Brazilian Federal Public Attorney filed a civil action against the federal government of Brazil, Laboratorios Wyeth-Whitehall Ltda. (the Brazilian subsidiary of the Seller) and the Company, as represented by its Brazilian subsidiary, in the 6th. Lower Federal Court in the City of São Paulo, seeking to annul an April 2000 decision by the Brazilian Board of Tax Appeals that found in favor of the Seller’s Brazilian subsidiary on the issue of whether it had incurred taxable capital gains as a result of the divestiture of Kolynos. The action seeks to make the Company’s Brazilian subsidiary jointly and severally liable for any tax due from the Seller’s Brazilian subsidiary. The case has been pending since 2002, and the Lower Federal Court has not issued a decision. Although there can be no assurances, management believes, based on the opinion of its Brazilian legal counsel, that it has strong legal grounds to contest the action and that the Company should ultimately prevail. The Company is challenging this action vigorously. \n \nIn December 2005, the Brazilian internal revenue authority issued to the Company’s Brazilian subsidiary a tax assessment with interest, penalties and any court-mandated fees of approximately $\n47\n, at the current exchange rate, based on a claim that certain purchases of U.S. Treasury bills by the subsidiary and their subsequent disposition during the period 2000 to 2001 were subject to a tax on foreign exchange transactions. The Company had been disputing the assessment within the internal revenue authority’s administrative appeals process. However, in November 2015, the Superior Chamber of Administrative Tax Appeals denied the Company’s final administrative appeal, and the Company has filed a lawsuit in the Brazilian federal court. In the event the Company is unsuccessful in this lawsuit, further appeals are available within the Brazilian federal courts. Although there can be no assurances, management believes, based on the opinion of its Brazilian legal counsel, that it has strong legal grounds to contest the tax assessment and that the Company should ultimately prevail. The Company is challenging this assessment vigorously. In addition, in April 2024, based upon changes in Brazilian tax law, the Company filed a petition in this matter requesting that the penalty portion of the claim be removed. The Brazilian tax authority has not yet responded to that petition.\n \n110\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\nTalcum Powder Matters\nThe Company has been named as a defendant in civil actions alleging that certain of its talcum powder products were contaminated with asbestos and/or caused mesothelioma and other cancers. Many of these actions involve a number of co-defendants from a variety of different industries, including suppliers of asbestos and manufacturers of products that, unlike the Company’s products, were designed to contain asbestos. \nAs of December 31, 2024, there were \n309\n individual cases pending against the Company in state and federal courts throughout the United States, as compared to \n279\n cases as of December 31, 2023.  During the year ended December 31, 2024, \n142\n new cases were filed and \n111\n cases were resolved by voluntary dismissal, settlement or dismissal by the court, and \none\n case was removed from the case count when it was established that the claim does not relate to talcum powder. The value of the settlements in the periods presented was not material, either individually or in the aggregate, to such periods’ results of operations. During the three months ended March 31, 2024, \none\n case resulted in a jury verdict in favor of the Company after a trial. Subsequently, the trial court granted plaintiffs’ motion for a new trial in that case. However, during the three months ended September 30, 2024, an appellate court granted the Company’s request to reinstate the jury’s verdict in favor of the Company. Plaintiffs are challenging that ruling and separately are appealing other issues related to the verdict.\nA significant portion of the Company’s costs incurred in defending and resolving these claims has been, and the Company believes that a portion of the costs will continue to be, covered by insurance policies issued by several primary, excess and umbrella insurance carriers, subject to deductibles, exclusions, retentions, policy limits and insurance carrier insolvencies.\nWhile the Company and its legal counsel believe that the Company has strong legal grounds to contest these cases and intends to challenge them vigorously, there can be no assurances regarding the ultimate resolution of these matters.\nERISA Matter\nIn June 2016, a lawsuit was filed in the United States District Court for the Southern District of New York (the “District Court”) against the Retirement Plan, the Company and certain individuals (the “Company Defendants”) claiming that residual annuity payments associated with a 2005 residual annuity amendment to the Retirement Plan were improperly calculated for certain Retirement Plan participants in violation of ERISA. The relief sought included recalculation of benefits, pre- and post-judgment interest and attorneys’ fees. This action was certified as a class action in July 2017. In July 2020, the District Court dismissed certain claims, and in August 2020 granted the plaintiffs’ motion for summary judgment on the remaining claims. In September 2020, the Company appealed to the Second Circuit. In March 2023, the Second Circuit affirmed the grant of summary judgment to the plaintiffs.\nIn light of the Second Circuit decision, the Company recorded a charge to earnings of $\n267\n in the quarter ended March 31, 2023, which is comprised of the recalculation of benefits and interest. Possible additional charges associated with this matter are expected to be immaterial and, where estimable, are reflected in the range of reasonably possible losses disclosed above. The decision resulted in an increase in the obligations of the Retirement Plan, which based on the current funded status of the Retirement Plan and depending on further developments in the litigation, may require a cash contribution by the Company in 2025. In June 2023, the Company filed a petition for certiorari to the United States Supreme Court requesting permission for an appeal to that court and that petition was denied in October 2023. Also, in June 2023, the plaintiffs filed a motion to enter a revised final judgment in the District Court to address certain unresolved calculation issues, which the Company opposed. In March 2024, the District Court granted the plaintiffs’ motion and found for the plaintiffs on those calculation issues. The Company has appealed that decision to the Second Circuit.\n111\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\n13.    \nSegment Information\nThe Company operates in \ntwo\n product segments: Oral, Personal and Home Care; and Pet Nutrition. \nThe operations of the Oral, Personal and Home Care product segment are managed geographically in \nfive\n reportable operating segments: North America, Latin America, Europe, Asia Pacific and Africa/Eurasia.\nIn connection with management changes, the Company realigned the reporting structure of its skin health business effective July 1, 2024. Accordingly, commencing with the quarter ended September 30, 2024, the results of the skin health business previously reported within the Europe reportable operating segment are reported with the other skin health businesses in the North America reportable operating segment, with no impact on the Company's consolidated results of operations or financial position. The Company has recast its historical geographic segment information to conform to the new reporting structure.\nThe Company evaluates segment performance based on several factors, including Operating profit. The Company uses Operating profit as a measure of operating segment performance because it excludes the impact of Corporate-driven decisions related to interest expense and income taxes. The Chairman of the Board, President and Chief Executive Officer has been determined to be the Company’s Chief Operating Decision Maker who uses Operating Profit to assess performance and to allocate resources for each of the reportable operating segments in the budgeting and forecasting process. Asset information by segment is not utilized for purposes of assessing performance or allocating resources, and therefore such information has not been presented.\nThe accounting policies of the operating segments are generally the same as those described in Note 2, Summary of Significant Accounting Policies. Intercompany sales have been eliminated. Corporate operations include costs related to stock options and restricted stock units, research and development costs, Corporate overhead costs, restructuring and related implementation charges and gains and losses on sales of non-core product lines and assets. The Company reports these items within Corporate operations as they relate to Corporate-based responsibilities and decisions and are not included in the internal measures of segment operating performance used by the Company to measure the underlying performance of the operating segments.\nApproximately two-thirds of the Company’s Net sales are generated from markets outside the U.S., with approximately \n45\n% of the Company’s Net sales coming from emerging markets (which consist of Latin America, Asia (excluding Japan), Africa/Eurasia and Central Europe). Oral, Personal and Home Care sales to Walmart, Inc. and its affiliates represent approximately \n11\n% of the Company’s Net sales in each of the years 2024, 2023 and 2022. No other customer represented more than 10% of Net sales in any period presented.\nIn 2024, Corporate \nOperating profit\n included charges resulting from the 2022 Global Productivity Initiative of $\n85\n. In 2023, Corporate Operating profit included charges resulting from the 2022 Global Productivity Initiative of $\n27\n and product recall costs of $\n25\n. In 2022, Corporate \nOperating profit\n included goodwill and intangible assets impairment charges of $\n721\n, charges resulting from the 2022 Global Productivity Initiative of $\n95\n, a gain on the sale of land in Asia Pacific of $\n47\n and acquisition-related costs of $\n19\n. \n112\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\n2024\nNet sales\nCost of Sales\nSelling, general and administrative expenses\nOther (income) expense, net \n(3)\nOperating Profit\nReportable Segments\nOral, Personal and Home Care\nNorth America\n(1)\n$\n4,113\n \n$\n1,571\n \n$\n1,668\n \n$\n36\n \n$\n839\n \nLatin America\n4,782\n \n1,933\n \n1,328\n \n(\n5\n)\n1,526\n \nEurope\n2,770\n \n1,050\n \n1,031\n \n31\n \n658\n \nAsia Pacific\n2,858\n \n1,078\n \n997\n \n(\n30\n)\n812\n \nAfrica/Eurasia\n1,095\n \n432\n \n395\n \n16\n \n253\n \nTotal Oral, Personal and Home Care\n15,618\n \n4,088\n \nPet Nutrition\n(2)\n4,483\n \n1,869\n \n1,641\n \n8\n \n965\n \nReconciliation with Total Company Operating Profit\nCorporate\n(\n784\n)\nTotal\n$\n20,101\n \n$\n4,268\n \nNote: Table may not sum due to rounding. \n(1) \nNet sales in the U.S. for Oral, Personal and Home Care were $\n3,640\n in 2024.\n(2) \nNet sales in the U.S. for Pet Nutrition were $\n3,059\n in 2024.\n(3) \nRefer to Note 16, Supplemental Income Statement for information related to Other (income) expense, net. \n2023\nNet sales\nCost of Sales\nSelling, general and administrative expenses\nOther (income) expense, net \n(3)\nOperating Profit\nReportable Segments\nOral, Personal and Home Care\nNorth America\n(1)\n$\n4,091\n \n$\n1,588\n \n$\n1,594\n \n$\n37\n \n$\n871\n \nLatin America\n4,640\n \n1,977\n \n1,241\n \n5\n1,417\n \nEurope\n2,571\n \n1,069\n \n899\n \n31\n \n573\n \nAsia Pacific\n2,782\n \n1,108\n \n925\n \n(\n18\n)\n767\n \nAfrica/Eurasia\n1,083\n \n442\n \n377\n \n9\n \n254\n \nTotal Oral, Personal and Home Care\n15,167\n \n3,882\n \nPet Nutrition\n(2)\n4,290\n \n1,964\n \n1,493\n \n26\n806\n \nReconciliation with Total Company Operating Profit\nCorporate\n$\n(\n704\n)\nTotal\n$\n19,457\n \n$\n3,984\n \nNote: Table may not sum due to rounding. \n(1) \nNet sales in the U.S. for Oral, Personal and Home Care were $\n3,625\n in 2023.\n(2) \nNet sales in the U.S. for Pet Nutrition were $\n2,918\n in 2023.\n(3) \nRefer to Note 16, Supplemental Income Statement for information related to Other (income) expense, net.\n113\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\n2022\nNet sales\nCost of Sales\nSelling, general and administrative expenses\nOther (income) expense, net \n(3)\nOperating Profit\nReportable Segments\nOral, Personal and Home Care\nNorth America\n(1)\n$\n4,002\n \n$\n1,649\n \n$\n1,567\n \n$\n46\n \n$\n741\n \nLatin America\n3,982\n \n1,885\n \n1,059\n \n(\n71\n)\n1,108\n \nEurope\n2,362\n \n1,023\n \n778\n \n28\n \n534\n \nAsia Pacific\n2,826\n \n1,160\n \n954\n \n(\n24\n)\n737\n \nAfrica/Eurasia\n1,082\n \n447\n \n389\n \n18\n \n228\n \nTotal Oral, Personal and Home Care\n14,254\n \n3,348\n \nPet Nutrition\n(2)\n3,713\n \n1,569\n \n1,287\n \n7\n850\n \nReconciliation with Total Company Operating Profit\nCorporate\n$\n(\n1,305\n)\nTotal\n$\n17,967\n \n$\n2,893\n \nNote: Table may not sum due to rounding. \n(1) \nNet sales in the U.S. for Oral, Personal and Home Care were $\n3,511\n in 2022.\n(2) \nNet sales in the U.S. for Pet Nutrition were $\n2,432\n in 2022\n(3) \nRefer to Note 16, Supplemental Income Statement for information related to Other (income) expense, net.\n2024\n2023\n2022\nCapital expenditures\n \n \nOral, Personal and Home Care\n \n \nNorth America\n$\n52\n \n$\n46\n \n$\n66\n \nLatin America\n126\n \n146\n \n121\n \nEurope\n63\n \n44\n \n31\n \nAsia Pacific\n64\n \n65\n \n60\n \nAfrica/Eurasia\n12\n \n10\n \n30\n \nTotal Oral, Personal and Home Care\n317\n \n311\n \n308\n \nPet Nutrition\n143\n \n301\n \n297\n \nCorporate\n101\n \n93\n \n91\n \nTotal Capital expenditures\n$\n561\n \n$\n705\n \n$\n696\n \n114\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\n2024\n2023\n2022\nDepreciation and amortization\n \n \nOral, Personal and Home Care\n \n \nNorth America\n$\n124\n \n$\n116\n \n$\n128\n \nLatin America\n100\n \n98\n \n93\n \nEurope\n65\n \n65\n \n68\n \nAsia Pacific\n81\n \n84\n \n89\n \nAfrica/Eurasia\n8\n \n9\n \n9\n \nTotal Oral, Personal and Home Care\n378\n \n372\n \n387\n \nPet Nutrition\n132\n \n101\n \n65\n \nCorporate\n95\n \n94\n \n93\n \nTotal Depreciation and amortization\n$\n605\n \n$\n567\n \n$\n545\n \n2024\n2023\nLong-lived assets\n(1)\nUnited States\n$\n2,728\n \n$\n2,733\n \nInternational\n2,223\n \n2,340\n \nTotal Long-lived assets\n$\n4,951\n \n$\n5,073\n \n \n (1)\n Long-lived assets include Property, plant and equipment, net and lease right-of-use assets.\n \n115\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\n14.        \nLeases \nThe Company enters into leases for land, office space, warehouses and equipment. A number of the leases include \none\n or more options to renew the lease terms, purchase the leased property or terminate the lease. The exercise of these options is at the Company’s discretion and is therefore recognized on the balance sheet when it is reasonably certain the Company will exercise such options. As the Company’s leases typically do not contain a readily determinable implicit rate, the Company determines the present value of the lease liability using its incremental borrowing rate at the lease commencement date. \nSubstantially all of the Company’s leases are considered operating leases. Finance leases were not material as of December 31, 2024 and 2023. \nAs of December 31, 2024 and 2023, the Company’s right-of use assets and liabilities for operating leases were as follows:\n2024\n2023\nOther assets\n$\n529\n \n$\n491\n \nOther accruals\n107\n \n95\n \nOther liabilities\n456\n \n420\n \nTotal operating lease liabilities \n$\n563\n \n$\n515\n \nLease liabilities for operating leases as of December 31, 2024 were as follows:\n2025\n$\n126\n \n2026\n108\n \n2027\n101\n \n2028\n80\n \n2029\n58\n \nThereafter\n182\n \nTotal lease commitments\n$\n655\n \nLess: Interest\n(\n92\n)\nPresent value of lease liabilities\n$\n563\n \nThe components of the Company’s operating lease cost for the twelve months ended December 31, 2024 and 2023 were as follows:\n2024\n2023\nOperating lease cost\n$\n144\n \n$\n136\n \nShort-term lease cost\n3\n \n3\n \nVariable lease cost\n19\n \n20\n \nSublease Income\n(\n2\n)\n(\n2\n)\nTotal lease cost\n$\n164\n \n$\n157\n \nShort-term lease cost represents the Company’s cost with respect to leases with a duration of 12 months or less and is not reflected on the Company’s Consolidated Balance Sheets. Variable lease costs are comprised of costs, such as the Company’s proportionate share of actual costs for utilities, common area maintenance, property taxes and insurance, that are not included in the lease liability and are recognized in the period in which they are incurred. \n116\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\nSupplemental cash flow information related to operating leases for the twelve months ended December 31, 2024 and 2023 was as follows:\n▪\nPayments against amounts included in the measurement of lease liabilities: $\n132\n and $\n171\n, respectively \n▪\nLease assets obtained in exchange for lease liabilities: $\n141\n and $\n139\n, respectively.\nAs of December 31, 2024 and 2023, the weighted-average remaining lease term for operating leases was \n7\n and \n8\n years, respectively, and the weighted-average discount rate for operating leases was \n4.4\n% and \n4.5\n%, respectively. \nThere were no material operating leases that the Company had entered into or that were yet to commence as of December 31, 2024.\n \n15.          \nSupplier Finance Program\nThe Company has agreements to provide supplier finance programs which facilitate participating suppliers' ability to finance payment obligations of the Company with designated third-party financial institutions. Participating suppliers may, at their sole discretion, elect to finance one or more payment obligations of the Company prior to their scheduled due dates at a discounted price to participating financial institutions. The Company’s obligations to its suppliers, including amounts due and scheduled payment dates, are not impacted by suppliers’ decisions to finance amounts under these arrangements. The outstanding payment obligations under the Company’s supplier finance programs are included in Accounts Payable in the Consolidated Balance Sheets and were not material as of December 31, 2024 or 2023.\n16.    \nSupplemental Income Statement Information\nOther (income) expense, net\n2024\n2023\n2022\nAmortization of intangible assets\n$\n75\n \n$\n72\n \n$\n80\n \nEquity income\n(\n22\n)\n(\n17\n)\n(\n12\n)\n2022 Global Productivity Initiative\n59\n \n24\n \n90\n \nProduct recall costs\n—\n \n25\n \n—\n \nLosses (gains) from marketable securities and other assets\n6\n \n11\n \n(\n22\n)\nIndirect tax payments (refunds)\n27\n \n18\n \n(\n14\n)\nGain on the sale of land in Asia Pacific\n—\n \n—\n \n(\n47\n)\nAcquisition-related costs\n—\n \n—\n \n19\n \nOther, net\n19\n \n58\n \n(\n25\n)\nTotal Other (income) expense, net\n$\n164\n \n$\n191\n \n$\n69\n \n \n2024\n2023\n2022\nResearch and development\n$\n355\n \n$\n343\n \n$\n320\n \nAdvertising\n$\n2,720\n \n$\n2,371\n \n$\n1,997\n \n117\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\n17.    \nSupplemental Balance Sheet Information\nInventories by major class are as follows at December 31:\nInventories\n2024\n2023\nRaw materials and supplies\n$\n631\n \n$\n606\n \nWork-in-process\n46\n \n46\n \nFinished goods\n1,431\n \n1,411\n \nTotal Inventories, net\n$\n2,108\n \n$\n2,063\n \nNon-current inventory, net\n(\n121\n)\n(\n129\n)\nCurrent Inventories, net\n$\n1,987\n \n$\n1,934\n \nInventories valued under LIFO amounted to $\n453\n and $\n471\n at December 31, 2024 and 2023, respectively. The excess of current cost over LIFO cost at the end of each year was $\n105\n and $\n120\n, respectively. The liquidations of LIFO inventory quantities had no material effect on income in 2024, 2023 and 2022. Inventory classified as non-current at December 31, 2024 was recorded on the Consolidated Balance Sheets as “Other assets.”\nProperty, plant and equipment, net\n2024\n2023\nLand\n$\n226\n \n$\n227\n \nBuildings\n2,056\n \n2,047\n \nManufacturing machinery and equipment\n6,265\n \n6,365\n \nOther equipment\n1,580\n \n1,647\n \n \n10,127\n \n10,286\n \nAccumulated depreciation\n(\n5,705\n)\n(\n5,704\n)\nTotal Property, plant and equipment, net\n$\n4,422\n \n$\n4,582\n \nOther current assets\n2024\n2023\nMarketable securities\n$\n160\n \n$\n179\n \nPrepaids\n520\n \n595\n \nDerivatives\n33\n \n19\n \nTotal Other current assets\n$\n713\n \n$\n793\n \n118\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\nOther accruals\n2024\n2023\nAccrued advertising and consumer and trade promotions\n$\n912\n \n$\n882\n \nAccrued payroll and employee benefits\n437\n \n403\n \nAccrued taxes other than income taxes\n162\n \n167\n \nRestructuring accrual\n15\n \n11\n \nPension and other retiree benefits\n93\n \n96\n \nLease liabilities due in one year\n107\n \n95\n \nAccrued interest\n72\n \n78\n \nDerivatives\n23\n \n26\n \nDividend payable\n408\n \n—\n \nOther\n662\n \n619\n \nTotal Other accruals\n$\n2,891\n \n$\n2,377\n \nOther liabilities\n2024\n2023\nPension and other retiree benefits\n$\n1,306\n \n$\n1,390\n \nLong-term lease liabilities\n456\n \n420\n \nRestructuring accrual\n29\n \n—\n \nOther\n320\n \n305\n \nTotal Other liabilities\n$\n2,111\n \n$\n2,115\n \n119\nCOLGATE-PALMOLIVE COMPANY\n \nNotes to Consolidated Financial Statements (continued)\n(Dollars in Millions Except Share and Per Share Amounts)\n18.    \nSupplemental Other Comprehensive Income (Loss) Information\nOther comprehensive income (loss) components attributable to Colgate-Palmolive Company before tax and net of tax during the years ended December 31 were as follows:\n \n2024\n2023\n2022\nCumulative translation adjustments:\nCumulative translation adjustments, pre-tax\n$\n(\n298\n)\n$\n127\n \n$\n(\n113\n)\nTax amounts\n(\n37\n)\n13\n \n(\n29\n)\nCumulative translation adjustments, net of tax \n(\n335\n)\n140\n \n(\n142\n)\nPension and other benefits:\n   Net actuarial gain (loss), prior service costs and settlements\n   during the period\n31\n \n(\n49\n)\n466\n \nAmortization of net actuarial loss, transition and prior service costs\n(1)\n28\n \n30\n \n62\n \nRetirement Plan and other retiree benefit adjustments, pre-tax\n59\n \n(\n19\n)\n528\n \nTax amounts\n(\n16\n)\n3\n \n(\n115\n)\nRetirement Plan and other retiree benefit adjustments, net of tax \n43\n \n(\n16\n)\n413\n \nCash flow hedges:\nGains (losses) on cash flow hedges, pre-tax\n10\n \n(\n10\n)\n80\n \nTax amounts\n(\n2\n)\n3\n \n(\n20\n)\nGains (losses) on cash flow hedges, net of tax\n8\n \n(\n7\n)\n60\n \nTotal Other comprehensive income (loss), net of tax\n$\n(\n284\n)\n$\n117\n \n$\n331\n \n(1)\nThese components of Other comprehensive income (loss) are included in the computation of total pension cost. See Note 9, Retirement Plans and Other Retiree Benefits for additional details.\nThere were no tax impacts on Other comprehensive income (loss) attributable to Noncontrolling interests.\nAccumulated Other Comprehensive Income (Loss)\nAccumulated other comprehensive income (loss) is comprised of cumulative foreign currency translation gains and losses, unrecognized pension and other retiree benefit costs and unrealized gains and losses from derivative instruments designated as cash flow hedges. At December 31, 2024 and 2023, Accumulated other comprehensive income (loss) consisted primarily of aftertax unrecognized pension and other retiree benefit costs of $\n605\n and $\n647\n, respectively, and aftertax cumulative foreign currency translation losses of $\n3,687\n and $\n3,351\n, respectively. Foreign currency translation adjustments in 2024 primarily reflect losses from the Euro, Brazilian Real and Mexican Peso. Foreign currency translation adjustments in 2023 primarily reflect gains from the Euro, Mexican Peso and Brazilian Real.\n120\nCOLGATE-PALMOLIVE COMPANY\nMarket Information\nThe Company’s common stock is listed on the New York Stock Exchange, and its trading symbol is CL. \nStock Price Performance Graphs \n       The following graphs compare cumulative total shareholder returns on Colgate-Palmolive Company common stock against the S&P Composite-500 Stock Index and a peer company index for the twenty-year, ten-year and five-year periods each ended December 31, 2024. The peer company index is comprised of consumer products companies that have both domestic and international businesses. For 2024, the peer company index consisted of Church & Dwight Co., Inc., The Clorox Company, The Coca-Cola Company, The Estee Lauder Companies, Inc., General Mills, Inc., Haleon plc, Kellanova (formerly known as Kellogg Company), Kenvue Inc. (from and after its spin-off from Johnson & Johnson), Kimberly-Clark Corporation, The Kraft Heinz Company, Mondelez International, Inc., PepsiCo, Inc., The Procter & Gamble Company, Reckitt Benckiser Group plc and Unilever PLC. \n       These performance graphs do not constitute soliciting material, are not deemed filed with the SEC and are not incorporated by reference in any of the Company’s filings under the Securities Act of 1933 or the Securities Exchange Act of 1934, as amended, whether made before or after the date of this Annual Report on Form 10-K and irrespective of any general incorporation language in any such filing, except to the extent the Company specifically incorporates these performance graphs by reference therein.\n121"
  }
}