{
  "ticker": "CMCSA",
  "cik": "0001166691",
  "company_name": "COMCAST CORP",
  "filing_date": "2025-01-31",
  "accession": "0001166691-25-000011",
  "primary_doc": "cmcsa-20241231.htm",
  "item_sections": {
    "item1": "Item 1: Business: Network and Technology for additional information.\nOur Connectivity & Platforms business headquarters is located in One Comcast Center, Philadelphia, Pennsylvania. We also own the Comcast Technology Center, which is a center for our technology and engineering workforce located adjacent to the Comcast Center, and our Sky headquarters, located in Middlesex, United Kingdom.\nWe also own or lease buildings throughout the Connectivity & Platforms markets that contain administrative space, retail stores and customer service centers, and warehouses.\nContent & Experiences Business\nOur Content & Experiences business and NBCUniversal headquarters are located in New York, New York at 30 Rockefeller Plaza and its surrounding campus, which include offices and studios used by the Media segment. We own substantially all of the space we occupy at 30 Rockefeller Plaza, and we lease the spaces in the surrounding campus. \nOther principal locations supporting our Media segment operations include our leased Telemundo headquarters and production facilities in Miami, Florida, as well as our Universal City location in Los Angeles, California, our owned CNBC headquarters and production facilities located in Englewood Cliffs, New Jersey and our leased NBC Sports headquarters and production facilities in Stamford, Connecticut.\nRefer to Item 1: Business: Studios Segment and Theme Parks Segment for information on properties used in those respective segment operations.\nWe also own or lease additional offices, studios, production facilities, screening rooms, retail operations, warehouse space, satellite transmission receiving facilities and data centers in numerous locations in the United States and around the world.\nItem 3: Legal Proceedings\nSee Note 14 to the consolidated financial statements included in this Annual Report on Form 10-K for a discussion of legal proceedings.\nItem 4: Mine Safety Disclosures\nNot applicable.\n27\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nPart II\nItem 5: Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information\nComcast’s Class A common stock is listed on The Nasdaq Stock Market LLC under the symbol CMCSA. There is no established public trading market for Comcast’s Class B common stock. The Class B common stock can be converted, on a share for share basis, into Class A common stock.\nHolders\nRecord holder\ns as of January 15, 2025 are presented in the table below.\nStock Class\nRecord\nHolders\nClass A Common Stock\n303,127 \nClass B Common Stock\n1 \nHolders of Class A common stock in the aggregate hold 66\n2\n/\n3\n% of the combined voting power of our common stock. The number of votes that each share of Class A common stock has at any given time depends on the number of shares of Class A common stock and Class B common stock then outstanding, with each share of Class B common stock having 15 votes per share. The Class B common stock represents 33\n1\n/\n3\n% of the combined voting power of our common stock, which percentage is generally non-dilutable under the terms of our articles of incorporation. Mr. Brian L. Roberts beneficially owns all outstanding shares of Class B common stock. Generally, including as\n to the election of directors, holders of Class A common stock and Class B common stock vote as one class except where class voting is required by law.\nDividends\nWe expect to continue to pay quarterly dividends, although each dividend is subject to approval by our Board of Directors. Refer to Liquidity and Capital Resources in Item 7: Management’s Discussion and Analysis of Financial Condition and Results of Operations for additional information.\nShare Repurchases\nThe table below summarizes Comcast’s common stock repurchases during 2024.\nPeriod\nTotal Number of\nShares\nPurchased\nAverage\nPrice Per\nShare\nTotal Number of\nShares\nPurchased as\nPart of Publicly\nAnnounced\nAuthorization\nTotal Dollar\nAmount\nPurchased Under the Publicly Announced \nAuthorization\nMaximum Dollar Value\nof Shares That\nMay Yet Be Purchased\nUnder the Publicly \nAnnounced \nAuthorization\n(a)\nFirst Quarter 2024\n55,961,536 \n$\n43.03 \n55,961,536 \n$\n2,408,046,377 \n$\n13,186,952,831 \nSecond Quarter 2024\n56,381,926 \n$\n39.29 \n56,381,926 \n$\n2,214,999,556 \n$\n10,971,953,275 \nThird Quarter 2024\n49,913,271 \n$\n39.44 \n49,913,271 \n$\n1,968,792,051 \n$\n9,003,161,225 \nOctober 1-31, 2024\n16,562,668 \n$\n41.66 \n16,562,668 \n$\n689,999,638 \n$\n8,313,161,586 \nNovember 1-30, 2024\n12,943,713 \n$\n43.26 \n12,943,713 \n$\n559,999,640 \n$\n7,753,161,946 \nDecember 1-31, 2024\n20,002,768 \n$\n39.89 \n20,002,768 \n$\n797,999,685 \n$\n6,955,162,262 \nTotal\n211,765,882\n \n$\n40.80\n \n211,765,882\n \n$\n8,639,836,946\n \n$\n6,955,162,262\n \n(a)\nIn September 2022, our Board of Directors ap\nproved a share repurchase program authorization of $20 billion and in January 2024, our Board of Directors terminated the existing program and approved a new program authorization of $15 billion effective as of January 26, 2024, which had no expiration date. In January 2025, our Board of Directors terminated this existing program and approved a new program authorization of $15 billion, which has no expiration date. We expect to repurchase additional shares of our Class A common stock under this authorization in the open market or in private transactions, subject to market and other conditions.\nComcast 2024 Annual Report on Form 10-K\n28\nTable of Contents\nStock Performance Graph\nThe following graph compares the annual percentage change in the cumulative total shareholder return on Comcast’s Class A common stock during the five years ended December 31, 2024 with the cumulative total returns on the Standard & Poor’s 500 Stock Index and a select peer group consisting of us and other companies engaged in the transmission and distribution and media industries. This peer group consists of our Class A common stock and the common stock of AT&T Inc., Charter Communications, Inc., Fox Corp. (Class A), Lumen Technologies, Inc., Paramount Global (Class B), T-Mobile US, Inc., Verizon Communications Inc., Warner Bros. Discovery Inc. and The Walt Disney Company.\nThe comparison assumes $100 was invested on December 31, 2019 in our Class A common stock and in each of the following indices and assumes the reinvestment of dividends.\nComparison of 5 Year Cumulative Total Return\n2020\n2021\n2022\n2023\n2024\nComcast Class A\n$\n119 \n$\n117 \n$\n83 \n$\n107 \n$\n95 \nS&P 500 Stock Index\n$\n118 \n$\n152 \n$\n125 \n$\n157 \n$\n197 \nPeer Group\n$\n112 \n$\n103 \n$\n79 \n$\n87 \n$\n103 \nItem 6: [Reserved]\n[Reserved]\n29\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nItem 7: Management’s Discussion and Analysis of Financial Condition and Results of Operations\nManagement’s discussion and analysis of financial condition and results of operations is provided as a supplement to, and should be read in conjunction with, the consolidated financial stateme\nnts and related notes (“Notes”) to enhance the understanding of our operations and our present business environment. For more information about our company’s operations and the risks facing our businesses, see Item 1: Business and",
    "item1a": "Item 1A: Risk Factors, respectively. Refer to Item 7: Management’s Discussion and Analysis of Financial Condition and Results of Operations in our \n2023 Annual Report on Form 10-K\n for management’s discussion and analysis of our financial condition and results of operations for fiscal year 2022, including comparison to fiscal year 2023.\nOverview\nWe are a global media and technology company with two primary businesses: Connectivity & Platforms and Content & Experiences. We present the operations of (1) our Connectivity & Platforms business in two segments: Residential Connectivity & Platforms and Business Services Connectivity; and (2) our Content & Experiences business in three segments: Media, Studios and Theme Parks. The discussion and analysis that follows includes the results of the cable television networks and complementary digital assets proposed to be included in the Spin-off and does not reflect or give effect to what our results of operations and financial condition may be following the Spin-off, if consummated.\nConsolidated Revenue, Net Income Attributable to Comcast Corporation and Adjusted EBITDA\n(a)\n(in billions)\nRevenue\nNet Income Attributable to Comcast Corporation\nAdjusted EBITDA\n(a)\nAdjusted EBITDA is a financial measure that is not defined by generally accepted accounting principles in the United States (“GAAP”). Refer to the “Non-GAAP Financial Measures” section on page 44 for additional information, including our definition and our use of Adjusted EBITDA, and for a reconciliat\nion from net income attributable to Comcast Corporation to Adjusted EBITDA. Revenue, Net Income Attributable to Comcast Corporation and Adjusted EBITDA charts are not presented on the same scale.\n2024 Revenue and Adjusted EBITDA Segment Contribution\n(a)\nRevenue\nAdjusted EBITDA\n \n(a)\nCharts exclude the results of Content & Experiences Headquarters and Other, Corporate and Other, and eliminations. Refer to our Management’s Discussion and Analysis of Financial Condition and Results of Operations for additional information.\nComcast 2024 Annual Report on Form 10-K\n30\nTable of Contents\n2024 Developments\nConnectivity & Platforms\n(a)\nContent & Experiences\n(a)(b)\n(a) Revenue and Adjusted EBITDA charts are not presented on the same scale.\n(b) Segment details in the charts exclude the results of Content & Experiences Headquarters and Other and Eliminations and therefore the amounts do not equal the total.\nResidential Connectivity & Platforms\nMedia\n•\nRevenue remained consistent due to decreases in video and other revenue, offset by increases in domestic broadband, domestic wireless, international connectivity and advertising revenue.\n•\nAdjusted EBITDA increased primarily due to a decrease in programming expenses, while revenue remained consistent. \n•\nAdjusted EBITDA margin increased from 37.5% to 38.2%.\nBusiness Services Connectivity\n•\nRevenue increased due to an increase in revenue from enterprise solutions offerings and small business customers.\n•\nAdjusted EBITDA increased due to an increase in revenue, partially offset by increased costs and expenses.\n•\nAdjusted EBITDA margin decreased from 57.2% to 56.7%.\nCustomer Metrics\n•\nTotal customer relationships decreased by 527,000 to 51.6 million.\n•\nDomestic broadband customers decreased by 411,000 to 31.8 million.\n•\nDomestic wireless lines increased by 1.2 million to 7.8 million.\n•\nDomestic video customers decreased by 1.6 million to 12.5 million.\n•\nDomestic homes and businesses passed increased by 1.2 million to 63.7 million.\nCapital Expenditures\n•\nTotal Connectivity & Platforms capital expenditures remained consistent at $8.3 billion, reflecting increased spending on line extensions and support capital, offset by decreased spending on customer premise equipment and scalable infrastructure.\n•\nRevenue increased\n primarily due to the impact of the Paris Olympics in 2024. Excluding $1.9 billion of incremental revenue associated with this event, revenue increased due to increases in domestic distribution and international networks revenue.\n•\nAdjusted EBITDA increased primarily due to an increase in revenue, partially offset by an increase in programming and production costs driven by the Paris Olympics.\n•\nPeacock generated revenue and costs and expenses of \n$4.9 billion \nand \n$6.7 billion\n in \n2024\n, respectively, including the Paris Olympics, compared to \n$3.4 billion\n and \n$6.1 billion\n in \n2023, respectively. \nPaid subscribers increased by \n5\n million to \n36\n million in \n2024\n.\nStudios\n•\nRevenue decreased primarily due to decreases in theatrical and content licensing revenue. 2023 included the impact of the Writers Guild and SAG work stoppages.\n•\nAdjusted EBITDA increased due to a decrease in costs and expenses driven by programming and production, partially offset by a decrease in revenue.\nTheme Parks\n•\nRevenue decreased due to decreases in revenue at our domestic theme parks, as well as the negative impact of foreign currency at our international theme parks.\n•\nAdjusted EBITDA decreased due to a decrease in revenue and an increase in costs and expenses.\n•\nCapital expenditures continues to reflect significant spending for the development of Epic Universe in Orlando.\n31\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nOther\n•\nRepurchased a total of 212 million shares of our Class A common stock for $8.6 billion in 2024 compared to a total of 262 million shares of our Class A common stock for $11.0 billion in 2023. Raised our dividend by $0.08 to $1.24 per share on an annualized basis in January 2024 and paid $4.8 billion of dividends in 2024.\n•\nIn the fourth quarter of 2023, we exercised our put right requiring Disney to purchase our interest in Hulu and received $8.6 billion, representing $9.2 billion for our share of Hulu’s minimum equity value presented as an advance on the sale of our investment in our consolidated balance sheet, less $557 million for our share of prior capital calls. We expect to receive additional proceeds for the sale of our interest in Hulu following the final determination of Hulu’s fair value pursuant to a third-party appraisal process, at which time we will recognize the sale of our interest. See Note 7.\n•\nIn November 2024, we announced our intention to create SpinCo, a new independent publicly traded company through a tax-free spin-off. We are targeting to complete the Spin-off by the end of 2025, subject to the satisfaction of customary conditions. There can be no assurance that a separation transaction will occur, or, if one does occur, of its terms or timing.\nConsolidated Operating Results\nYear ended December 31 (in millions, except per share data)\n2024\n2023\nChange \n2023 to 2024\nRevenue\n$\n123,731\n \n$\n121,572 \n1.8\n \n%\nCosts and Expenses:\nProgramming and production\n37,026\n \n36,762 \n0.7\n \nMarketing and promotion\n8,073\n \n7,971 \n1.3\n \nOther operating and administrative\n40,533\n \n39,190 \n3.4\n \nDepreciation\n8,729\n \n8,854 \n(1.4)\nAmortization\n6,072\n \n5,482 \n10.8\n \nTotal costs and expenses\n100,434\n \n98,258 \n2.2\n \nOperating income\n23,297\n \n23,314 \n(0.1)\nInterest expense\n(4,134)\n(4,087)\n1.2\n \nInvestment and other income (loss), net\n(490)\n1,252 \nNM\nIncome before income taxes\n18,673\n \n20,478 \n(8.8)\nIncome tax expense\n(2,796)\n(5,371)\n(48.0)\nNet income\n15,877\n \n15,107 \n5.1\n \nLess: Net income (loss) attributable to noncontrolling interests\n(315)\n(282)\n12.0\n \nNet income attributable to Comcast Corporation\n$\n16,192\n \n$\n15,388 \n5.2\n \n%\nBasic earnings per common share attributable to Comcast Corporation shareholders\n$\n4.17\n \n$\n3.73 \n11.7\n \n%\nDiluted earnings per common share attributable to Comcast Corporation shareholders\n$\n4.14\n \n$\n3.71 \n11.7\n \n%\nWeighted-average number of common shares outstanding - basic\n3,885\n \n4,122\n(5.8)\n%\nWeighted average number of common shares outstanding - diluted\n3,908\n \n4,148\n(5.8)\n%\nAdjusted EBITDA\n(a)\n$\n38,069\n \n$\n37,633 \n1.2\n \n%\nPercentage changes that are considered not meaningful are denoted with NM.\n(a)\nAdjusted EBITDA is a non-GAAP financial measure. Refer to the “Non-GAAP Financial Measures” section on page 44 for additional information, including our definition and our use of Adjusted EBITDA, and for a reconciliation from net income attributable to Comcast Corporation to Adjusted EBITDA.\nComcast 2024 Annual Report on Form 10-K\n32\nTable of Contents\nConsolidated Revenue\nThe following graph illustrates the contributions to the change in consolidated revenue made by our Connectivity & Platforms and Content & Experiences businesses, as well as by Corporate and Other activities, including eliminations.\n(a) Graph is presented using a truncated scale.\nRevenue for our segments and other businesses is discussed separately below under the heading “Segment Operating Results.” \nConsolidated Costs and Expenses\nThe following graph illustrates the contributions to the change in consolidated costs and expenses, excluding depreciation expense and amortization expense, made by our Connectivity & Platforms and Content & Experiences businesses, as well as by Corporate and Other activities, including adjustments and eliminations.\n(a) Graph is presented using a truncated scale.\nCosts and expenses for our segments and our corporate operations and other businesses are discussed separately below under the heading “Segment Operating Results.”\nConsolidated depreciation and amortization expense \nincreased in 2024 compared to 2023 primarily due to increased amortization of certain acquisition-related intangible assets related to the linear media business, partially offset by a decrease in depreciation of our international property and equipment and a decrease in the amortization of software.\nAmortization expense from acquisition-related intangible assets totaled $2.7 billion and $2.3 billion in 2024 and 2023, respectively. Amounts primarily relate to customer relationship intangible assets recorded in connection with the Sky transaction in 2018 and the NBCUniversal transaction in 2011.\n33\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nConsolidated interest expense\n increased in 2024 compared to 2023 primarily due to an increase in average debt outstanding and higher weighted-average interest rates in the current year, partially offset by interest expense in the prior year associated with a collateralized obligation that was repaid in the fourth quarter of 2023. \nConsolidated investment and other income (loss), net \nincreased \nin 2024 compared to 2023\n. \nYear ended December 31 (in millions)\n2024\n2023\nEquity in net income (losses) of investees, net\n$\n(680)\n$\n789 \nRealized and unrealized gains (losses) on equity securities, net\n(313)\n(130)\nOther income (loss), net\n502\n \n592 \nTotal investment and other income (loss), net\n$\n(490)\n$\n1,252 \nThe change in equity in net income (losses) of investees, net in 2024 compared to 2023 was primarily due to our investment in Atairos. The income (losses) at Atairos were driven by fair value adjustments on its underlying investments with income (loss) of $(474) million and $1.1 billion in 2024 and 2023, respectively. \nThe change in realized and unrealized gains (losses) on equity securities, net in 2024 compared to 2023 was primarily \ndue to higher losses on nonmarketable securities in the current year. \nThe change in other income (loss), net in 2024 compared to 2023 primarily resulted from foreign exchange remeasurement.\nConsolidated Income Tax Expense\nOur effective income tax rate in 2024 and 2023 was 15.0% and 26.2%, respectively.\nThe decrease in income tax expense in 2024 was primarily driven by a tax benefit from an internal corporate reorganization completed in 2024, as well as lower domestic income before income taxes.\n See Note 5 for additional information on our income taxes.\nConsolidated Net Income (Loss) Attributable to Noncontrolling Interests\nThe changes in net income (loss) attributable to noncontrolling interests in 2024 compared to 2023 was primarily due to our regional sports networks.\nComcast 2024 Annual Report on Form 10-K\n34\nTable of Contents\nSegment Operating Results\nOur segment operating results are presented based on how we assess operating performance and internally report financial information. See Note 2 for additional information on our segments.\nConnectivity & Platforms Overview\n2023 to 2024\nYear ended December 31 (in millions)\n2024\n2023\nChange\nConstant Currency Change\n(b)\nRevenue\nResidential Connectivity & Platforms\n$\n71,574\n \n$\n71,946 \n(0.5)\n%\n(1.0)\n%\nBusiness Services Connectivity\n9,701\n \n9,255 \n4.8\n \n4.8\n \nTotal Connectivity & Platforms revenue\n$\n81,275\n \n$\n81,201 \n0.1\n \n%\n(0.3)\n%\nAdjusted EBITDA\nResidential Connectivity & Platforms\n$\n27,338\n \n$\n26,948 \n1.4\n \n%\n1.2\n \n%\nBusiness Services Connectivity\n5,500\n \n5,291 \n3.9\n \n4.0\n \nTotal Connectivity & Platforms Adjusted EBITDA\n$\n32,838\n \n$\n32,239 \n1.9\n \n%\n1.7\n \n%\nAdjusted EBITDA Margin\n(a)\nResidential Connectivity & Platforms\n38.2\n \n%\n37.5 \n%\n70 bps\n80 bps\nBusiness Services Connectivity\n56.7\n \n57.2 \n(50) bps\n(50) bps\nTotal Connectivity & Platforms Adjusted EBITDA margin\n40.4\n \n%\n39.7 \n%\n70 bps\n80 bps\n(a)\nOur Adjusted EBITDA margin is Adjusted EBITDA as a percentage of revenue. We believe this metric is useful particularly as we continue to focus on growing our higher-margin businesses and improving overall operating cost management. The changes reflect the year-over-year basis point changes in the rounded Adjusted EBITDA margins.\n(b)\nConstant currency is a non-GAAP financial measure. Refer to the “Non-GAAP Financial Measures” section on page 44 for additional information, including our definition and our use of constant currency, and for a reconciliation of constant currency amounts.\nWe continue to focus on growing our higher-margin connectivity businesses while managing overall operating costs. We also continue to invest in our network to support higher-speed broadband offerings and to expand the number of homes and businesses passed. A competitive environment, which has increased in recent years, has had negative impacts on our customer relationships additions/(losses). In addition, government funding for the Affordable Connectivity Program, which provided a monthly discount towards broadband service for eligible low-income households, expired during the second quarter of 2024, which had a negative impact on our residential domestic broadband customer relationships. We believe our residential connectivity revenue will increase as a result of growth in average domestic broadband revenue per customer, as well as increases in domestic wireless and international connectivity revenue. At the same time, we expect continued declines in video revenue as a result of domestic customer net losses due to shifting video consumption patterns and the competitive environment, although customer net losses typically mitigate the impact of continued rate increases on programming expenses. We also expect continued declines in other revenue related to declines in wireline voice revenue. \nWe believe our Business Services Connectivity segment will continue to grow by offering competitive services, including enterprise solutions.\n35\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nConnectivity & Platforms Customer Metri\ncs\nNet Additions / (Losses)\n(in thousands)\n2024\n2023\n2024\n2023\nCustomer Relationships\nDomestic Residential Connectivity & Platforms customer relationships\n(a)\n31,172\n \n31,648 \n(476)\n(212)\nInternational Residential Connectivity & Platforms customer relationships\n(a)\n17,811\n17,847\n(36)\n(93)\nBusiness Services Connectivity customer relationships\n(b)\n2,626\n2,641\n(16)\n17 \nTotal Connectivity & Platforms customer relationships\n51,609\n52,136\n(527)\n(288)\nDomestic Broadband\nResidential customers\n29,373\n29,748\n(375)\n(64)\nBusiness customers\n2,469\n2,505\n(36)\n(2)\nTotal domestic broadband customers\n31,842\n32,253\n(411)\n(66)\nDomestic Wireless\nTotal domestic wireless lines\n(c)\n7,826\n6,588\n1,237\n \n1,275 \nDomestic Video\nTotal domestic video customers\n12,523\n14,106\n(1,583)\n(2,037)\nDomestic homes and businesses passed\n(d)\n63,692\n62,457\nDomestic broadband penetration of homes and businesses passed\n(e)\n49.8\n \n%\n51.5 \n%\n(a)\nResidential Connectivity & Platforms customer relationships generally represent the number of residential customer locations that subscribe to at least one of our services. International Residential Connectivity & Platforms customer relationships represent customers receiving Sky services in the United Kingdom and Italy. Because each of our services includes a variety of product tiers, which may change from time to time, net additions or losses in any one period will reflect a mix of customers at various tiers.\n(b)\nBusiness Services Connectivity customer metrics are gener\nally counted based on the number of locations receiving services, including locations within our network in the United States, as well as locations outside of our network both in the United States and internationally. Certain arrangements whereby third parties provide connectivity services leveraging our network are also generally counted based on the number of locations served.\n(c)\nDomestic wireless lines represent the number of residential and business customers\n’\n wireless devices. An individual customer relationship may have multiple wireless lines.\n(d)\nConnectivity & Platforms domestic homes and businesses are considered passed if we can connect them to our network in the United States without further extending the transmission lines. Homes and businesses passed is an estimate based on the best available information. \n(e)\nPenetration is calculated by dividing the number of domestic customers located within our network by the number of domestic homes and businesses passed. \n2023 to 2024\n2024\n2023\nChange\nConstant Currency Change\n(a)\nAverage monthly total Connectivity & Platforms revenue per customer relationship\n$\n130.57\n \n$\n129.43 \n0.9\n \n%\n0.4\n \n%\nAverage monthly total Connectivity & Platforms Adjusted EBITDA per customer relationship\n$\n52.75\n \n$\n51.39 \n2.7\n \n%\n2.5\n \n%\n(a)\nConstant currency is a non-GAAP financial measure. Refer to the “Non-GAAP Financial Measure” section on page 44 for additional information, including our definition and our use of constant currency, and for a reconciliation of constant currency amounts.\nAverage monthly total revenue per customer relationship is impacted by rate adjustments and changes in the types and levels of services received by our residential and business customers, as well as changes in advertising and other revenue and in foreign currency exchange rates. While revenue from our individual service offerings is also impacted by changes in the allocation of revenue among services sold in a bundle, the allocation does not impact average monthly total revenue per customer relationship. Each of our services has a different contribution to Adjusted EBITDA margin. We use average monthly Adjusted EBITDA per customer relationship to evaluate the profitability of our customer base across our service offerings. We believe both metrics are useful to understand the trends in our business, and average monthly Adjusted EBITDA per customer relationship is useful particularly as we continue to focus on growing our higher-margin businesses.\nComcast 2024 Annual Report on Form 10-K\n36\nTable of Contents\nConnectivity & Platforms — Supplemental Costs and Expenses Information\nConnectivity & Platforms supplemental costs and expenses information in the table below is presented on an aggregate basis across the Connectivity & Platforms segments as the segments use certain shared infrastructure, including our network in the United States. Costs and expenses information reported separately for the Residential Connectivity & Platforms and Business Services Connectivity segments includes each segment’s direct costs and an allocation of shared costs. \n \n2023 to 2024\n(in millions)\n2024\n2023\nChange\nConstant Currency Change\n(g)\nCosts and Expenses\nProgramming\n(a)\n$\n16,881\n \n$\n18,067 \n(6.6)\n%\n(7.1)\n%\nTechnical and support\n(b)\n7,617\n \n7,416 \n2.7\n \n2.3\n \nDirect product costs\n(c)\n6,607\n \n6,146 \n7.5\n \n6.0\n \nMarketing and promotion\n(d)\n4,772\n \n4,720 \n1.1\n \n0.6\n \nCustomer service\n(e)\n2,732\n \n2,783 \n(1.9)\n(2.3)\nOther\n(f)\n9,828\n \n9,830 \n—\n \n(0.6)\nTotal Connectivity & Platforms costs and expenses\n$\n48,438\n \n$\n48,962 \n(1.1)\n%\n(1.7)\n%\n(a)\nProgramming expenses, which represent our most significant operating expense, are the fees we incur to provide video services to our customers, and primarily include fees related to the distribution of television network programming and fees charged for retransmission of the signals from local broadcast television stations. These expenses also include the costs of content on the Sky-branded entertainment television networks, including amortization of licensed content.\n(b)\nTechnical and support expenses primarily consists of costs for labor to complete service call and installation activities; and costs for network operations and satellite transmission, product development, fulfillment and provisioning.\n(c)\nDirect product costs primarily consists of access fees related to using wireless and broadband networks owned by third parties to deliver our services and costs of products sold, including wireless devices and Sky Glass smart televisions.\n(d)\nMarketing and promotion expenses primarily consists of the costs associated with attracting new customers and promoting our service offerings.\n(e)\nCustomer service expenses primarily consists of the personnel and other costs associated with customer service and certain selling activities.\n(f)\nOther expenses primarily consists of administrative personnel costs; franchise and other regulatory fees; fees paid to third parties where we sell advertising on their behalf; bad debt; building and office expenses, taxes and billing costs; and other business, headquarters and support costs necessary to operate the Connectivity & Platforms business.\n(g)\nConstant currency is a non-GAAP financial measure. Refer to the “Non-GAAP Financial Measures” section on page 44 for additional information, including our definition and our use of constant currency, and for a reconciliation of constant currency amounts.\nResidential Connectivity & Platforms Segment Results of Operations\n \n2023 to 2024\n(in millions)\n2024\n2023\nChange\nConstant Currency Change\n(a)\nRevenue\nDomestic broadband\n$\n26,228\n \n$\n25,489 \n2.9\n \n%\n2.9\n \n%\nDomestic wireless\n4,273\n \n3,664 \n16.6\n \n16.6\n \nInternational connectivity\n4,854\n \n4,207 \n15.4\n \n12.4\n \nTotal residential connectivity \n35,355\n \n33,359 \n6.0\n \n5.6\n \nVideo\n26,872\n \n28,797 \n(6.7)\n(7.2)\nAdvertising\n4,089\n \n3,969 \n3.0\n \n2.1\n \nOther\n5,259\n \n5,820 \n(9.6)\n(10.2)\nTotal revenue\n71,574\n \n71,946 \n(0.5)\n(1.0)\nCosts and Expenses\nProgramming\n16,881\n \n18,067 \n(6.6)\n(7.1)\nOther\n27,355\n \n26,932 \n1.6\n \n0.8\n \nTotal costs and expenses\n44,237\n \n44,998 \n(1.7)\n(2.3)\nAdjusted EBITDA\n$\n27,338\n \n$\n26,948 \n1.4\n \n%\n1.2\n \n%\n(a)\nConstant currency is a non-GAAP financial measure. Refer to the “Non-GAAP Financial Measures” section on page 44 for additional information, including our definition and our use of constant currency, and for a reconciliation of constant currency amounts.\n37\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nResidential Connectivity & Platforms Segment – Revenue\nDomestic broadband revenue\n primarily consists of revenue from sales of broadband services to residential customers in the United States, including equipment and installation services. Domestic broadband revenue also includes revenue related to Xumo Stream Boxes and commission revenue from the sale of certain DTC streaming services.\nDomestic broadband revenue increased in 2024 primarily due to an increase in average rates. \nDomestic wireless revenue\n primarily consists of revenue from sales of wireless services and devices, including handsets, tablets and smart watches, to residential customers in the United States. \nDomestic wireless revenue increased in 2024 primarily due to an increase in the number of customer lines and device sales.\nInternational connectivity revenue\n primarily consists of revenue from sales of broadband services, including equipment and installation services, wireless services and wireless devices to residential customers in the United Kingdom and Italy, as well as commission revenue from the sale of certain third-party DTC streaming services.\nInternational connectivity revenue increased in 2024 primarily due to an increase in broadband revenue resulting from an increase in average rates and an increase in wireless revenue primarily resulting from an increase in the sale of wireless services. This increase includes the positive impact of foreign currency. \nVideo revenue\n primarily consists of revenue from sales of video services to residential and business customers across the Connectivity & Platforms markets, including equipment and installation services. Video revenue includes pay-per-view and other transactional revenue and franchise fees, as well as revenue from sales of certain hardware, including Sky Glass smart televisions.\nVideo revenue decreased in 2024 due to declines in the overall number of video customers, partially offset by an overall increase in average rates.\nAdvertising revenue\n \nprimarily consists of revenue from the sale of advertising across our platforms in the Connectivity & Platforms markets, including advertising as part of our distribution agreements with cable networks in the United States, and advertising on Sky-branded entertainment television networks and on our digital properties. Advertising also includes revenue where we enter into representation agreements under which we sell advertising on behalf of third parties and from our advanced advertising businesses. \nAdvertising revenue increased in 2024 primarily driven by an increase in domestic political advertising, partially offset by lower domestic nonpolitical advertising.\nOther revenue\n primarily consists of revenue in the Connectivity & Platforms markets from sales of wireline voice services to residential customers; our residential security and automation services businesses; the licensing of our technology platforms to other multichannel video providers; the distribution of certain of our Sky-branded entertainment television networks to third-party video service providers; commissions from electronic retailing networks; and certain billing and collection fees. \nOther revenue decreased in 2024 primarily due to a decrease in residential wireline voice revenue driven by a decline in the number of customers.\nResidential Connectivity & Platforms Segment – Costs and Expenses\nProgramming expenses\n decreased in 2024 primarily due to a decline in the number of domestic video subscribers, partially offset by domestic contractual rate increases.\nOther expenses \nincreased in 2024 primarily due to an increase in direct product costs, the impact of foreign currency and higher technical and support costs, partially offset by lower severance charges in 2024 compared to severance and other charges in 2023.\nComcast 2024 Annual Report on Form 10-K\n38\nTable of Contents\nBusiness Services Connectivity Segment Results of Operations\n(in millions)\n2024\n2023\nChange \n2023 to 2024\nRevenue\n$\n9,701\n \n$\n9,255 \n4.8\n \n%\nCosts and expenses\n4,201\n \n3,964 \n6.0\n \nAdjusted EBITDA\n$\n5,500\n \n$\n5,291 \n3.9\n \n%\nBusiness services connectivity revenue\n primarily consists of revenue from our service offerings for small business locations in the United States, which include broadband, wireline voice and wireless services, as well as our enterprise solutions offerings, and our business connectivity service offerings in the United Kingdom.\nBusiness services connectivity revenue increased in 2024 primarily due to an increase in revenue from enterprise solutions offerings and from higher rates from small business customers.\nBusiness services connectivity costs and expenses\n increased in 2024 primarily due to increases in direct product costs, marketing and promotion expenses, and technical and support expenses. Severance charges in 2024 were consistent compared to severance and other charges in 2023.\nContent & Experiences Overview\nYear ended December 31 (in millions)\n2024\n2023\nChange \n2023 to 2024\nRevenue\nMedia\n$\n28,148\n \n$\n25,355 \n11.0\n \n%\nStudios\n11,092\n \n11,625 \n(4.6)\nTheme Parks\n8,617\n \n8,947 \n(3.7)\nHeadquarters and Other\n50\n \n64 \n(21.7)\nEliminations\n(2,798)\n(2,800)\n0.1\n \nTotal Content & Experiences revenue\n$\n45,108\n \n$\n43,191 \n4.4\n \n%\nAdjusted EBITDA\nMedia\n$\n3,130\n \n$\n2,955 \n5.9\n \n%\nStudios\n1,404\n \n1,269 \n10.7\n \nTheme Parks\n2,949\n \n3,345 \n(11.8)\nHeadquarters and Other\n(831)\n(946)\n12.2\n \nEliminations\n82\n \n77 \n5.9\n \nTotal Content & Experiences Adjusted EBITDA\n$\n6,735\n \n$\n6,700 \n0.5\n \n%\nWe operate our Media segment as a combined television and streaming business. We expect that the number of subscribers and audience ratings at our linear television networks will continue to decline as a result of the competitive environment and shifting video consumption patterns, which we aim to mitigate over time by continued growth in paid subscribers and advertising revenue at Peacock. We expect to continue to incur significant costs related to content and marketing at Peacock. Revenue and programming expenses are also impacted by the timing of certain sporting events, including the Olympics in the third quarter of 2024 and our acquisition of NBA rights, which begin in 2025.\nOur Studios segment generates revenue primarily from third parties and from licensing content to our Media segment. While results of operations for our Studios segment are not impacted, results for our total Content & Experiences business may be impacted as the Studios segment licenses content to the Media segment, including for Peacock, rather than licensing the content to third parties. The Writers Guild and the SAG work stoppages from May to September 2023 and July to November 2023, respectively, resulted in reduced content licensing revenue at our Studios segment and reduced programming and production costs at both our Studios and Media segments in 2023.\nWe continue to invest significantly in existing and new theme park attractions, hotels and infrastructure, including Epic Universe in Orlando, which we expect will open in May 2025, as well as in new destinations and experiences, which we believe will have a positive impact on attendance and guest spending at our theme parks.\n39\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nMedia Segment Results of Operations\nYear ended December 31 (in millions)\n2024\n2023\nChange \n2023 to 2024\nRevenue\nDomestic advertising\n$\n10,008\n \n$\n8,600 \n16.4\n \n%\nDomestic distribution\n11,826\n \n10,663 \n10.9\n \nInternational networks\n4,282\n \n4,109 \n4.2\nOther\n2,031\n \n1,983 \n2.4\n \nTotal revenue\n28,148\n \n25,355 \n11.0\n \nCosts and Expenses\nProgramming and production\n18,968\n \n16,921 \n12.1\n \nMarketing and promotion\n1,473\n \n1,389 \n6.1\n \nOther\n4,577\n \n4,091 \n11.9\n \nTotal costs and expenses\n25,017\n \n22,400 \n11.7\n \nAdjusted EBITDA\n$\n3,130\n \n$\n2,955 \n5.9\n \n%\nMedia Segment – Revenue\nRevenue increased in 2024 primarily due to the Paris Olympics in 2024. Excluding incremental revenue associated with this event, revenue increased in 2024 driven by increases in domestic distribution and international networks revenue.\nYear ended December 31 (in millions)\n2024\n2023\nChange \n2023 to 2024\nTotal revenue\n$\n28,148\n \n$\n25,355 \n11.0\n \n%\nOlympics\n1,906\n \n— \nNM\nTotal revenue, excluding Olympics\n$\n26,242\n \n$\n25,355 \n3.5\n \n%\nTotal domestic advertising revenue\n$\n10,008\n \n$\n8,600 \n16.4\n \n%\nOlympics\n1,432\n \n— \nNM\nDomestic advertising revenue, excluding Olympics\n$\n8,576\n \n$\n8,600 \n(0.3)\n%\nTotal domestic distribution revenue\n$\n11,826\n \n$\n10,663 \n10.9\n \n%\nOlympics\n473\n \n— \nNM\nDomestic distribution revenue, excluding Olympics\n$\n11,353\n \n$\n10,663 \n6.5\n \n%\nPercentage changes that are considered not meaningful are denoted with NM.\nDomesti\nc advertising revenue\n primarily consists of revenue generated from sales of advertising on our linear television networks, Peacock and other digital properties operating predominantly in the United States.\nDomestic advertising revenue increased in 2024 primarily due to the Paris Olympics in 2024. Excluding incremental revenue associated with this event, domestic advertising revenue remained consistent in 2024 primarily due to a decrease in revenue at our linear television networks, offset by an increase in revenue at Peacock.\nDomestic distribution revenue \nprimarily consists of revenue generated from the distribution of our television networks operating predominantly in the United States to traditional and virtual multichannel video providers, and from NBC-affiliated and Telemundo-affiliated local broadcast television stations. Our revenue from distribution agreements is generally based on the number of subscribers receiving the programming on our television networks and a per subscriber fee. Distribution revenue also includes Peacock subscription fees.\nDomestic distribution revenue increased in 2024, including the impact of the Paris Olympics in 2024. Excluding incremental revenue associated with this event, domestic distribution revenue increased in 2024 primarily due to an increase in Peacock paid subscribers, partially offset by a decrease in revenue at our linear television networks. The decrease at our networks was primarily due to a decline in the number of subscribers, partially offset by contractual rate increases. \nComcast 2024 Annual Report on Form 10-K\n40\nTable of Contents\nInternational networks revenue\n primarily consists of revenue generated by our networks operating predominantly outside the United States, including\n the Sky Sports networks in the United Kingdom and Italy. This revenue primarily results from the distribution of our television networks to traditional and virtual multichannel video providers and other platforms, as well as sales of advertising. A significant portion of this revenue comes from the Residential Connectivity & Platforms segment. \nInternational networks revenue increased in 2024 primarily due to an increase in revenue associated with the distribution of sports networks and the positive impact of foreign currency.\nOt\nher r\nevenue\n primarily consists of revenue generated from various digital properties and the licensing of our owned content and technology.\n*        *        *\nMedia segment total revenue included $4.9 billion and $3.4 billion related to Peacock in 2024 and 2023, respectively, including amounts related to the Paris Olympics in 2024. We had 36 million and 31 million paid subscribers of Peacock as of 2024 and 2023, respectively. Peacock paid subscribers represent customers from which we recognize distribution revenue, including both customers that pay us directly and customers receiving the service through arrangements with companies who sell Peacock on our behalf. In these arrangements, paid subscribers are counted based on the terms of the arrangement when the related revenue is recognized. As a result, certain customers are counted when they activate their account, while other customers are counted when the Peacock service is made available to them as part of their bundled service offering regardless of whether it is activated. \nMedia Segment – Costs and Expenses\nProgramming and production costs \nprimarily consists of the amortization of owned and licensed content, including sports rights, direct production costs, p\nroduction overhead, on-air talent costs and costs associated with the distribution of our television networks to multichannel video providers.\nProgramming and production costs increased in 2024 primarily due to costs associated with the Paris Olympics, an increase in other sports programming costs for our domestic television networks, the impact of foreign currency, an increase in entertainment content costs for our television networks, including the impact of the Writers Guild and SAG work stoppages in the prior year, and higher programming costs at Peacock.\nMarketing and promotion expenses \nprimarily consists of the costs associated with promoting our television networks, Peacock and other digital properties. \nMarketing and promotion expenses increased in 2024 primarily due to increased costs associated with the Paris Olympics, partially offset by lower costs related to marketing for entertainment programming.\nOther expenses \nprimarily consists of salaries, employee benefits, rent and other overhead expenses. \nOther expenses increased in 2024 primarily due to an increase in costs related to Peacock and higher severance charges in 2024.\n*        *        *\nMedia segment total costs and expenses included $6.7 billion and $6.1 billion related to Peacock in 2024 and 2023, respectively, including amounts related to the Paris Olympics in 2024.\n41\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nStudios Segment Results of Operations\nYear ended December 31 (in millions)\n2024\n2023\nChange \n2023 to 2024\nRevenue\nContent licensing\n$\n8,063\n \n$\n8,231 \n(2.0)\n%\nTheatrical\n1,693\n \n2,079 \n(18.6)\nOther\n1,335\n \n1,315 \n1.5\n \nTotal revenue\n11,092\n \n11,625 \n(4.6)\nCosts and Expenses\nProgramming and production\n7,257\n \n7,958 \n(8.8)\nMarketing and promotion\n1,483\n \n1,579 \n(6.1)\nOther\n947\n \n818 \n15.7\n \nTotal costs and expenses\n9,687\n \n10,356 \n(6.5)\nAdjusted EBITDA\n$\n1,404\n \n$\n1,269 \n10.7\n \n%\nStudios Segment – Revenue\nC\nontent licensing r\nevenue\n primarily relates to the licensing of our owned film and television content in the United States and internationally to television networks and DTC streaming service providers, as well as through video on demand services provided by multichannel video providers and other service providers. \nContent licensing revenue decreased in \n2024\n primarily due to the timing of when content was made available by our film studios, partially offset by the timing of when content was made available by our television studios under licensing agreements, including the impact of the Writers Guild and SAG work stoppages in the prior year.\nTheatrical r\nevenue\n primarily relates to the worldwide distribution of our produced and acquired films for exhibition in movie theaters. \nTheatrical revenue decreased in 2024 primarily due to higher revenue from releases in our 2023 slate, including \nThe Super Mario Bros. Movie, Oppenheimer\n and \nFast X, \ncompared to revenue from releases in our 2024 slate, including \nDespicable Me 4, Wicked, and Kung Fu Panda 4\n.\nOther revenue\n primarily consists of the sale of physical and digital home entertainment products, as well as the production and licensing of live stage plays and the distribution of content produced by third parties.\nStudios Segment – Costs and Expenses\nProg\nramming and production costs \nprimarily consists of the amortization of capitalized film and television production and acquisition costs; residuals and participations expenses; and distribution expenses.\nProgramming and production costs decreased in 2024 primarily due to lower costs associated with theatrical releases, partially offset by higher costs associated with content licensing sales, including the impact of the Writers Guild and SAG work stoppages in the prior year.\nMarketing and promotion expenses \nprimarily consists of expenses associated with advertising for our theatrical releases.\nMarketing and promotion expenses decreased in 2024 primarily due to decreased spending on current year and upcoming theatrical film releases.\nOther expenses \ninclude salaries, employee benefits, rent and other overhead expenses.\nTheme Parks Segment Results of Operations\nYear ended December 31 (in millions)\n2024\n2023\nChange \n2023 to 2024\nRevenue\n$\n8,617\n \n$\n8,947 \n(3.7)\n%\nCosts and expenses\n5,668\n \n5,602 \n1.2\n \nAdjusted EBITDA\n$\n2,949\n \n$\n3,345 \n(11.8)\n%\nComcast 2024 Annual Report on Form 10-K\n42\nTable of Contents\nTheme parks segment revenue\n \nprimarily relates to guest spending at our theme parks, including ticket sales and in-park spending, and to our consumer products business.\nTheme park segment revenue decreas\ned in 2024 primarily due to decreases at our domestic theme parks primarily driven by decreased park attendance, as well as the negative impact of foreign currency at our international theme parks.\nTheme parks segment costs and expenses\n \nprimarily consists of theme park operations, including repairs and maintenance and related administrative expenses; food, beverage and merchandise costs; labor costs; and sales and marketing costs.\nTheme parks segment costs and expenses increased in 2024 primarily due to higher costs associated with park operations and preopening costs for Epic Universe, partially offset by the impact of foreign currency. We expect to incur additional preopening costs for Epic Universe ahead of the expected opening in May 2025. \nContent & Experiences Headquarters, Other and Eliminations\nHeadquarters and Other Results of Operations\nYear ended December 31 (in millions)\n2024\n2023\nChange \n2023 to 2024\nRevenue\n$\n50\n \n$\n64 \n(21.7)\n%\nCosts and expenses\n881\n \n1,010 \n(12.8)\nAdjusted EBITDA\n$\n(831)\n$\n(946)\n12.2\n \n%\nHeadquarters and Other expenses primarily consists of overhead, personnel and other costs necessary to operate the Content & Experiences business. Expenses decreased in 2024 primarily due to higher severance charges in 2023. \nEliminations\nYear ended December 31 (in millions)\n2024\n2023\nChange \n2023 to 2024\nRevenue\n$\n(2,798)\n$\n(2,800)\n(0.1)\n%\nCosts and expenses\n(2,880)\n(2,877)\n0.1\n \nAdjusted EBITDA\n$\n82\n \n$\n77 \n5.9\n \n%\nAmounts represent eliminations of transactions between segments in our Content & Experiences business, the most significant being content licensing between the Studios and Media segments, which are affected by the timing of recognition of content licenses. \nEliminations increase or decrease to the extent that additional content is made available to our other segments within the Content & Experiences business. Refer to Note 2 for additional information on transactions between our segments.\nCorporate, Other and Eliminations\nCorporate and Other Results of Operations\nYear ended December 31 (in millions)\n2024\n2023\nChange \n2023 to 2024\nRevenue\n$\n2,933\n \n$\n2,763 \n6.1\n \n%\nCosts and expenses\n4,308\n \n4,098 \n5.1\n \nAdjusted EBITDA\n$\n(1,376)\n$\n(1,335)\n(3.1)\n%\nCorporate and Other primarily consists of overhead and personnel costs; Sky-branded video services and television networks in Germany; Comcast Spectacor, which owns the Philadelphia Flyers and the We\nlls Fargo Center arena in Philadelphia, Penn\nsylvania; and Xumo, our consolidated streaming platform joint venture.\nCorporate and Other revenue\n increased in 2024 reflecting higher revenue across each of our other businesses.\nCorporate and Other costs and expenses\n increased in 2024 primarily due to increases related to corporate functions and increased marketing associated with the Paris Olympics, partially offset by lower costs related to Sky operations in Germany, including charges related to entertainment content and the impact of the timing of recognition of costs in the prior year as a result of the 2022 FIFA World Cup. We will have expanded German broadcast rights to Bundesliga beginning with the 2025/2026 season, which will result in an increase in programming and production costs. \n43\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nEliminations\nYear ended December 31 (in millions)\n2024\n2023\nChange \n2023 to 2024\nRevenue\n$\n(5,585)\n$\n(5,583)\n—\n \n%\nCosts and expenses\n(5,456)\n(5,611)\n(2.8)\nAdjusted EBITDA\n$\n(128)\n$\n28 \nNM\nPercentage changes that are considered not meaningful are denoted with NM.\nAmounts represent eliminations of transactions between our Connectivity & Platforms, Content & Experiences and other businesses, the most significant being distribution of television network programming between the Media and Residential Connectivity & Platforms segments. Eliminations of transactions between segments within Content & Experiences are presented separately. Amounts are affected by the periodic broadcast of the Olympic Games, including the Paris Olympics in 2024. Refer to Note 2 for additional information on transactions between our segments.\nNon-GAAP Financial Measures\nConsolidated Adjusted EBITDA\nAdjusted EBITDA is a non-GAAP financial measure and is the primary basis used to measure the operational strength and performance of our businesses as well as to assist in the evaluation of underlying trends in our businesses. This measure eliminates the significant level of noncash depreciation and amortization expense that results from the capital-intensive nature of certain of our businesses and from intangible assets recognized in business combinations. It is also unaffected by our capital and tax structures, and by our investment activities, including the results of entities that we do not consolidate, as our management excludes these results when evaluating our operating performance. Our management and Board of Directors use this financial measure to evaluate our consolidated operating performance and the operating performance of our operating segments and to allocate resources and capital to our operating segments. It is also a significant performance measure in our annual incentive compensation programs. Additionally, we believe that Adjusted EBITDA is useful to investors because it is one of the bases for comparing our operating performance with that of other companies in our industries, although our measure of Adjusted EBITDA may not be directly comparable to similar measures used by other companies. \nWe define Adjusted EBITDA as net income attributable to Comcast Corporation before net income (loss) attributable to noncontrolling interests, income tax expense, investment and other income (loss), net, interest expense, depreciation and amortization expense, and other operating gains and losses (such as impairment charges related to fixed and intangible assets and gains or losses on the sale of long-lived assets), if any. From time to time, we may exclude from Adjusted EBITDA the impact of certain events, gains, losses or other charges (such as significant legal settlements) that affect the period-to-period comparability of our operating performance. \nWe reconcile consolidated Adjusted EBITDA to net income attributable to Comcast Corporation. This measure should not be considered a substitute for operating income (loss), net income (loss), net income (loss) attributable to Comcast Corporation, or net cash provided by operating activities that we have reported in accordance with GAAP.\nReconciliation from Net Income Attributable to Comcast Corporation to Adjusted EBITDA\nYear ended December 31 (in millions)\n2024\n2023\nNet income attributable to Comcast Corporation \n$\n16,192\n \n$\n15,388 \nNet income (loss) attributable to noncontrolling interests\n(315)\n(282)\nIncome tax expense\n2,796\n \n5,371 \nInterest expense\n4,134\n \n4,087 \nInvestment and other (income) loss, net\n490\n \n(1,252)\nDepreciation\n8,729\n \n8,854 \nAmortization\n6,072\n \n5,482 \nAdjustments\n(a)\n(30)\n(16)\nAdjusted EBITDA\n$\n38,069\n \n$\n37,633 \n(a)\nAmounts represent the impact of certain events, gains, losses or other charges that are excluded from Adjusted EBITDA, including costs associated with the Spin-off and costs related to our investment portfolio.\nComcast 2024 Annual Report on Form 10-K\n44\nTable of Contents\nConstant Currency\nConstant currency and constant currency growth rates are non-GAAP financial measures that present our results of operations excluding the estimated effects of foreign currency exchange rate fluctuations. Certain of our businesses, including Connectivity & Platforms, have operations outside the United States that are conducted in local currencies. As a result, the comparability of the financial results reported in U.S. dollars is affected by changes in foreign currency exchange rates. In our Connectivity & Platforms business, we use constant currency and constant currency growth rates to evaluate the underlying performance of the businesses, and we believe they are helpful for investors because such measures present operating results on a comparable basis year over year to allow the evaluation of their underlying performance.\nConstant currency and constant currency growth rates are calculated by comparing the results for each comparable prior year period adjusted to reflect the average exchange rates from each current year period presented rather than the actual exchange rates that were in effect during the respective periods. \nReconciliation of Connectivity & Platforms Constant Currency\n2023\nYear ended December 31 (in millions)\nAs Reported\nEffects of Foreign Currency\nConstant Currency Amounts\nRevenue\nResidential Connectivity & Platforms\n$\n71,946\n$\n355\n$\n72,301\nBusiness Services Connectivity\n9,255\n1\n9,256\nTotal Connectivity & Platforms revenue\n$\n81,201\n$\n356\n$\n81,557\nAdjusted EBITDA\nResidential Connectivity & Platforms\n$\n26,948\n$\n60\n$\n27,008\nBusiness Services Connectivity\n5,291\n(1)\n5,291\nTotal Connectivity & Platforms Adjusted EBITDA\n$\n32,239\n$\n60\n$\n32,299\nAdjusted EBITDA Margin\nResidential Connectivity & Platforms\n37.5 \n%\n(10) bps\n37.4 \n%\nBusiness Services Connectivity\n57.2 \n— bps\n57.2 \nTotal Connectivity & Platforms Adjusted EBITDA margin\n39.7\n \n%\n(10) bps\n39.6\n \n%\n2023\nAs Reported\nEffects of Foreign Currency\nConstant Currency Amounts\nAverage monthly total Connectivity & Platforms revenue per customer relationship\n$\n129.43 \n$\n0.57 \n$\n130.00 \nAverage monthly total Connectivity & Platforms Adjusted EBITDA per customer relationship\n$\n51.39 \n$\n0.09 \n$\n51.48 \n \n2023\n(in millions)\nAs Reported\nEffects of Foreign Currency\nConstant Currency Amounts\nCosts and Expenses\nProgramming\n$\n18,067 \n$\n100 \n$\n18,167 \nTechnical and support\n7,416 \n27 \n7,443 \nDirect product costs\n6,146 \n84 \n6,230 \nMarketing and promotion\n4,720 \n22 \n4,741 \nCustomer service\n2,783 \n11 \n2,795 \nOther\n9,830 \n53 \n9,883 \nTotal Connectivity & Platforms costs and expenses\n$\n48,962\n \n$\n297\n \n$\n49,259\n \n45\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nReconciliation of Residential Connectivity & Platforms Constant Currency\n2023\n(in millions)\nAs Reported\nEffects of Foreign Currency\nConstant Currency Amounts\nRevenue\nDomestic broadband\n$\n25,489 \n$\n— \n$\n25,489 \nDomestic wireless\n3,664 \n— \n3,664 \nInternational connectivity\n4,207 \n112 \n4,319 \nTotal residential connectivity\n33,359 \n112 \n33,472 \nVideo\n28,797 \n169 \n28,966 \nAdvertising\n3,969 \n35 \n4,004 \nOther\n5,820 \n39 \n5,859 \nTotal revenue\n71,946\n \n355\n \n72,301\n \nCosts and Expenses\nProgramming\n18,067 \n100 \n18,167 \nOther\n26,932 \n195 \n27,126 \nTotal costs and expenses\n44,998 \n295 \n45,293 \nAdjusted EBITDA\n$\n26,948\n \n$\n60\n \n$\n27,008\n \nOther Adjustments\nFrom time to time, we present adjusted information, such as revenue, to exclude the impact of certain events, gains, losses or other charges. This adjusted information is a non-GAAP financial measure. We believe, among other things, that the adjusted information may help investors evaluate our ongoing operations and can assist in making meaningful period-over-period comparisons.\nLiquidity and Capital Resources\nYear ended December 31 (in billions)\n2024\n2023\nCash provided by operating activities\n$\n27.7\n \n$\n28.5 \nCash used in investing activities\n$\n(15.7)\n$\n(7.2)\nCash used in financing activities\n$\n(10.9)\n$\n(19.9)\nDecember 31 (in billions)\n2024\n2023\nCash and cash equivalents\n$\n7.3\n \n$\n6.2 \nDebt\n$\n99.1\n \n$\n97.1 \nOur businesses generate significant cash flows from operating activities. We believe that we will be able to continue to meet our current and long-term liquidity and capital requirements, including fixed charges, through our cash flows from operating activities; existing cash, cash equivalents and investments; available borrowings under our existing credit facility; and our ability to obtain future external financing. Refer to the “Contractual Obligations” discussion below for additional information regarding our cash requirements. We anticipate that we will continue to use a substantial portion of our cash flows from operating activities in repaying our debt obligations, funding our capital expenditures and cash paid for intangible assets, investing in business opportunities, and returning capital to shareholders.\nWe entered into a new revolving credit facility in May 2024 (see Note 6). \nWe maintain significant availability under our revolving credit facility and our commercial paper program to meet our short-term liquidity requirements. Our commercial paper program generally provides a lower-cost source of borrowing to fund our short-term working capital requirements. As of December 31, 2024, amounts available under our revolving credit facility, net of amounts outstanding under our commercial paper program and outstanding letters of credit and bank guarantees, totaled \n$\n11.8 billion.\nComcast 2024 Annual Report on Form 10-K\n46\nTable of Contents\nW\ne are subject to customary covenants and restrictions set forth in agreements related to debt issued at Comcast and certain of our subsidiaries, including the indentures governing our public debt securities and the credit agreement governing the Comcast revolving credit facility. Our revolving credit facility contains a financial covenant pertaining to leverage, which is the ratio of debt to EBITDA, as defined in the agreement. Compliance with this financial covenant is tested on a quarterly basis. As of December 31, 2024, we met this financial covenant, and we expect to remain in compliance with this financial covenant and other covenants related to our debt. \nOperating Activities\nComponents of Net Cash Provided by Operating Activities\nYear ended December 31 (in millions)\n2024\n2023\nOperating income\n$\n23,297\n \n$\n23,314 \nDepreciation and amortization \n14,802\n \n14,336 \nNoncash share-based compensation\n1,288\n \n1,241 \nChanges in operating assets and liabilities\n(1,559)\n(2,055)\nPayments of interest\n(3,657)\n(3,711)\nPayments of income taxes\n(7,096)\n(5,107)\nProceeds from investments and other\n597\n \n483 \nNet cash provided by operating activities\n$\n27,673\n \n$\n28,501 \nThe variance in changes in operating assets and liabilities in 2024 was primarily related to the timing of amortization and related payments for our film and television costs, including the timing of sports, which was partially offset by reduced spending in the prior year due to the work stoppages.\nThe decrease in payments of interest in 2024 was primarily due to the payments of interest in the prior year associated with our collateralized obligation which was repaid in the fourth quarter of 2023, partially offset by increased debt balances following debt issuances in the current year and higher weighted-average interest rates.\nPayments of income taxes increased in 2024 and included higher payments in the current year related to the 2023 tax year, primarily driven by the taxable gain recognized on our investment in Hulu. Payments of income taxes in 2024 were favorably impacted by the timing of transferable tax credit purchases, as payments for certain tax credits used in 2024 will be made in 2025. Additionally, we expect to receive a federal income tax refund in 2025 as a result of carrying back a capital loss created primarily as part of a 2024 internal corporate reorganization to offset capital gains recognized in our federal income tax returns for 2021 through 2023 (see Note 5).\nInvesting Activities\nNet cash used in investing activities increased in 2024 primarily due to net proceeds received as an advance on the sale of our interest in Hulu in the prior year (see Note 7), partially offset by decreased cash paid for intangible assets related to software development in the current year and decreased purchases of investments.\nWe expect to receive additional proceeds for the sale of our interest in Hulu following the finalization of the third-party appraisal process, at which time we will recognize the sale of our interest. See Note 7.\nIn September 2023, we entered into an agreement with T-Mobile to sell certain of our spectrum licenses. The agreement provides us with a right to remove certain licenses from the transaction, which will result in total cash consideration between $1.2 billion and $3.3 billion. The sale is expected to close in 2028 subject to various conditions and approvals.\nCapital Expenditures\nCapital expenditures remained consistent in 2024 compared to 2023. Spending on theme park attractions increased in 2024, and included costs associated with the construction of Epic Universe. 2023 expenditures included the acquisition of land for potential theme park expansion opportunities. The costs associated with the construction of Universal Beijing Resort are presented separately in our consolidated statements of cash flows. See Note 7. \nOur most significant capital expenditures are within the Connectivity & Platforms business, and we expect that this will continue in the future. Connectivity & Platforms’ capital expenditures remained consistent in 2024 compared to 2023 primarily due to increased spending on line extensions and support capital, offset by decreased spending on customer premise equipment and scalable infrastructure. The table below summarizes the capital expenditures we incurred in our segments in the Connectivity & Platforms business in 2024 and 2023.\n47\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nYear ended December 31 (in millions)\n2024\n2023\nCustomer premise equipment\n$\n2,013\n \n$\n2,234 \nScalable infrastructure\n3,024\n \n3,161 \nLine extensions\n2,691\n \n2,333 \nSupport capital\n557\n \n514 \nTotal\n$\n8,286\n \n$\n8,241 \nWe expect our capital expenditures in 2025 will continue to be focused on investments in the Connectivity & Platforms business in scalable infrastructure as we increase capacity and continue to execute our plans to upgrade our network to deliver multigigabit symmetrical speeds, in line extensions for the expansion of homes and businesses passed, and in the continued deployment of wireless gateways. In addition, we expect to continue investment in existing and new attractions at our Universal theme parks, including Epic Universe. Capital expenditures for subsequent years will depend on numerous factors, including competition, changes in technology, regulatory changes, the timing and rate of deployment of new services, the capacity required for existing services, the timing of new attractions at our theme parks and potential acquisitions. \nFinancing Activities\nNet cash used in financing activities decreased in 2024 primarily due to repayment of a collateralized obligation in the prior year (see Note 7), a decrease in repurchases of common stock under our share repurchase program and employee plans, lower repurchases and repayments of debt in the current year, repayments of short-term borrowings, net in the prior year and higher proceeds from borrowings in the current year.\nIn September 2024, we issued €1.8 billion aggregate principal amount of fixed-rate euro senior notes maturing in 2032 and 2036 and entered into a corresponding cross-currency swap, effectively converting the debt to an aggregate U.S. dollar principal amount of $2.0 billion with a weighted-average interest rate of 4.72%. We also issued £750 million ($1.0 billion using exchange rates on the date of issuance) principal amount of fixed rate sterling senior notes maturing in 2040 with an interest rate of 5.25%. The net proceeds from this issuance were intended for working capital and general corporate purposes, including the early redemption of $725 million of our outstanding 5.25% Notes due 2025, which was completed in October 2024, and the repayment of certain of our other outstanding debt with near-term maturities. In May 2024, we issued $3.3 billion aggregate principal amount of fixed-rate senior notes, which have maturities ranging between 2029 and 2054 and a weighted-average interest rate of 5.38%. The net proceeds from this issuance were used for the repayment of our outstanding commercial paper, and for working capital and general corporate purposes.\nIn 2024, we made debt repayments of $3.6 billion, including $1.9 billion principal amount of notes due at maturity and $750 million of 5.250% Notes due 2025, $391 million of 3.950% Notes due 2025, $256 million of 3.375% Notes due 2025, and $104 million of 3.150% Notes due 2026.\nWe have made, and may from time to time in the future make, optional repayments on our debt obligations, which may include repurchases or exchanges of our outstanding public notes and debentures, depending on various factors, such as market conditions. Any such repurchases may be effected through privately negotiated transactions, market transactions, tender offers, redemptions or otherwise. In particular, we may repurchase varying amounts of our outstanding public notes and debentures with short to medium term maturities through privately negotiated or market transactions. See Notes 6 and 7 for additional information on our financing activities. \nShare Repurchases and Dividends\nIn the second quarter of 2021, we restarted our share repurchase program, which had been paused since the beginning of 2019. In January 2024, our Board of Directors terminated our existing program and approved a new share repurchase program authorization of $15 billion effective as of January 26, 2024, which had no expiration date. In 2024, we repurchased a total of 212 million shares of our Class A common stock for $8.6 billion under our authorization programs. We did not purchase any shares outside of these programs. As of December 31, 2024, we had $7.0 billion remaining under the authorization, and in January 2025, our Board of Directors terminated the existing program and approved a new share repurchase program authorization of $15 billion, which has no expiration date. We expect to repurchase additional shares of our Class A common stock under this new authorization in the open market or in private transactions, subject to market and other conditions.\nIn 2024, our Board of Directors declared quarterly dividends of $0.31 per share, including our fourth quarter dividend payable in January 2025 and we made dividend payments of $4.8 billion. In January 2025, our Board of Directors approved a 6.5% increase in our dividend to $1.32 per share on an annualized basis and approved our first quarter dividend of $0.33 per share, to be paid in April 2025. We expect to continue to pay quarterly dividends, although each dividend is subject to approval by our Board of Directors.\nComcast 2024 Annual Report on Form 10-K\n48\nTable of Contents\nThe chart below summarizes share repurchases and dividend payments. In addition, we paid $463 million and $291 million in 2024 and 2023, respectively, related to employee taxes associated with the administration of our share-based compensation plans and excise taxes related to share repurchases. Our share repurchases have more than offset dilution that resulted from issuing our Class A common stock in connection with our share-based compensation plans in those years, thereby having the effect of reducing the total number of our Class A common stock outstanding.\nShare Repurchases Under Share Repurchase Program Authorization and Dividends Paid and Weighted-Average Number of Common Shares Outstanding - Diluted\n($ in billions and shares in millions)\nContractual Obligations\nThe following table summarizes our most significant contractual obligations as of December 31, \n2024\n:\nAs of December 31, 2024 (in billions)\nTotal\nWithin the next 12 months\nBeyond the next 12 months\nDebt obligations\n(a)\n$\n105.1 \n$\n4.9 \n$\n100.2 \nProgramming and production obligations\n96.2 \n17.2 \n79.0 \n(a) Amounts represent the face value of debt and exclude interest payments. \nOur largest contractual obligations relate to our outstanding debt. As of December 31, \n2024\n, our debt had a weighted-average time to maturity of approximately 16 years. Including the effects of our derivative financial instruments, as of December 31, \n2024, \nour debt had a weighted-average interest rate based on the stated coupons of 3.7% and the percentage of our debt obligations that were fixed-rate debt was 98%. We typically fund and expect to continue to be able to fund debt maturities and interest payments with cash flows generated in our operations; existing cash, cash equivalents and investments; or proceeds \nfrom additional external financing. See Note 6 and Item 7A for additional information on our debt. \nWe also have significant contractual obligations associated with our programming and production expenses. We have multiyear agreements for television and/or streaming rights of sporting events, such as for the NBA, the NFL, the Olympics and the English Premier League, which represent the substantial majority of our programming and production obligations. \nConnectivity & Platforms’ programming expenses related to the distribution of third-party television networks are generally acquired under multiyear distribution agreements with fees based on the number of subscribers receiving the television network programming and a per subscriber fee. The amounts included in the table above relate to minimum guaranteed commitments for these distribution agreements or fixed fees, and as a result, we expect the total fees to be paid under these arrangements to be significantly higher than the amounts included above. We have funded and expect to continue to be able to fund our programming and production obligations with the cash generated from our operations. As of December 31, \n2024\n, approximately 37% of cash payments related to our programming and production obligations are due after five years, of which the vast majority related to multiyear sports rights agreements. See Note 4 for additional information on programming and production costs.\nOur other contractual obligations relate primarily to operating leases (see Note 14) and other arrangements recorded in our consolidated balance sheets and/or disclosed in the notes to our financial statements, including benefit plan obligations (see Note 10), liabilities for uncertain tax positions (see Note 5), our remaining unfunded capital commitment to Atairos (see Note 7) and a contractual obligation related to an interest held by a third party in the revenue of certain theme parks (see Note 14). \n49\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nGuarantee Structure\nOur debt is primarily issued at Comcast, although we also have debt at certain of our subsidiaries as a result of acquisitions and other issuances. A substantial amount of this debt is subject to guarantees by Comcast and by certain subsidiaries that we have put in place to simplify our capital structure. We believe this guarantee structure provides liquidity benefits to debt investors and helps to simplify credit analysis with respect to relative value considerations of guaranteed subsidiary debt.\nDebt and Guarantee Structure\nDecember 31 (in billions)\n2024\n2023\nDebt Subject to Cross-Guarantees\nComcast\n$\n94.6\n \n$\n91.9 \nNBCUniversal\n(a)\n1.6\n \n1.6 \nComcast Cable\n(a)\n0.9\n \n0.9 \n97.1\n \n94.4 \nDebt Subject to One-Way Guarantees\nSky\n3.0\n \n3.6 \nOther\n(a)\n0.1\n \n0.1 \n3.1\n \n3.8 \nDebt Not Guaranteed\nUniversal Beijing Resort\n(b)\n3.4\n \n3.5 \nOther\n1.4\n \n1.5 \n4.8\n \n5.0 \nDebt issuance costs, premiums, discounts, fair value adjustments for acquisition accounting and hedged positions, net\n(6.0)\n(6.1)\nTotal debt\n$\n99.1\n \n$\n97.1 \n(a)\nNBCUniversal Media, LLC (“NBCUniversal”), Comcast Cable Communications, LLC (“Comcast Cable”) and Comcast Holdings Corporation (“Comcast Holdings”), which is included within other debt subject to one-way guarantees, are each consolidated subsidiaries subject to the periodic reporting requirements of the SEC. The guarantee structures and related disclosures in this section, together with Exhibit 22, satisfy these reporting obligations.\n(b)\nUniversal Beijing Resort debt financing is secured by the assets of Universal Beijing Resort and the equity interests of the investors. See Note 7 for additional information.\nCross-Guarantees\nComcast, NBCUniversal and Comcast Cable (the “Guarantors”) fully and unconditionally, jointly and severally, guarantee each other’s debt securities. NBCUniversal and Comcast Cable also guarantee other borrowings of Comcast, including its revolving credit facility. These guarantees rank equally with all other general unsecured and unsubordinated obligations of the respective Guarantors. However, the obligations of the Guarantors under the guarantees are structurally subordinated to the indebtedness and other liabilities of their respective non-guarantor subsidiaries. The obligations of each Guarantor are limited to the maximum amount that would not render such Guarantor’s obligations subject to avoidance under applicable fraudulent conveyance provisions of U.S. and non-U.S. law. Each Guarantor’s obligations will remain in effect until all amounts payable with respect to the guaranteed securities have been paid in full. However, a guarantee by NBCUniversal or Comcast Cable of Comcast’s debt securities, or by NBCUniversal of Comcast Cable’s debt securities, will terminate upon a disposition of such Guarantor entity or all or substantially all of its assets. \nThe Guarantors are each holding companies that principally hold investments in, borrow from and lend to non-guarantor subsidiary operating companies; issue and service third-party debt obligations; repurchase shares and pay dividends; and engage in certain corporate and headquarters activities. The Guarantors are generally dependent on non-guarantor subsidiary operating companies to fund these activities. \nAs of December 31, 2024 and 2023, the combined Guarantors have noncurrent notes payable to non-guarantor subsidiaries of $88 billion and $136 billion, respectively, and noncurrent notes receivable from non-guarantor subsidiaries of $14 billion and $18 billion, respectively. This financial information is that of the Guarantors presented on a combined basis with intercompany balances between the Guarantors eliminated. The combined financial information excludes financial information of non-guarantor subsidiaries. The underlying net assets of the non-guarantor subsidiaries are significantly in excess of the Guarantor obligations. Excluding investments in non-guarantor subsidiaries, external debt and the noncurrent notes payable and receivable with non-guarantor subsidiaries, the Guarantors do not have material assets, liabilities or results of operations.\nComcast 2024 Annual Report on Form 10-K\n50\nTable of Contents\nOne-Way Guarantees\nComcast provides full and unconditional guarantees of certain debt issued by Sky Limited (“Sky\n”)\n, including all of its senior notes, and other consolidated subsidiaries not subject to the periodic reporting requirements of the SEC. \nComcast also provides a full and unconditional guarantee of $138 million principal amount of subordinated debt issued by Comcast Holdings. Comcast’s obligations under this guarantee are subordinated and subject, in right of payment, to the prior payment in full of all of Comcast’s senior indebtedness, including debt guaranteed by Comcast on a senior basis, and are structurally subordinated to the indebtedness and other liabilities of its non-guarantor subsidiaries (for purposes of this Comcast Holdings discussion, Comcast Cable and NBCUniversal are included within the non-guarantor subsidiary group). Comcast’s obligations as guarantor will remain in effect until all amounts payable with respect to the guaranteed debt have been paid in full. However, the guarantee will terminate upon a disposition of Comcast Holdings or all or substantially all of its assets. Comcast Holdings is a consolidated subsidiary holding company that directly or indirectly holds 100% and approximately 37% of our equity interests in Comcast Cable and NBCUniversal, respectively. \nAs of December 31, 2024 and 2023, Comcast and Comcast Holdings, the combined issuer and guarantor of the guaranteed subordinated debt, have noncurrent senior notes payable to non-guarantor subsidiaries of $53 billion and $104 billion, respectively, and noncurrent notes receivable from non-guarantor subsidiaries of $10 billion and $14 billion, respectively. This financial information is that of Comcast and Comcast Holdings presented on a combined basis with intercompany balances between Comcast and Comcast Holdings eliminated. The combined financial information excludes financial information of non-guarantor subsidiaries of Comcast and Comcast Holdings. The underlying net assets of the non-guarantor subsidiaries of Comcast and Comcast Holdings are significantly in excess of the obligations of Comcast and Comcast Holdings. Excluding investments in non-guarantor subsidiaries, external debt, and the noncurrent notes payable and receivable with non-guarantor subsidiaries, Comcast and Comcast Holdings do not have material assets, liabilities or results of operations.\nCritical Accounting Estimates\nThe preparation of our consolidated financial statements requires us to make estimates that affect the reported amounts of assets, liabilities, revenue and expenses, and the related disclosure of contingent assets and contingent liabilities. We base our judgments on our historical experience and on various other assumptions that we believe are reasonable under the circumstances, the results of which form the basis for making estimates about the carrying value of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\nWe believe our estimates associated with the valuation and impairment testing of goodwill and cable franchise rights and the accounting for film and television costs are critical in the preparation of our consolidated financial statements. Management has discussed the development and selection of these critical accounting estimates with the Audit Committee of our Board of Directors, and the Audit Committee has reviewed the related disclosures below. See also Notes 4 and 9.\nValuation and Impairment Testing of Goodwill and Cable Franchise Rights\nWe assess the recoverability of our goodwill and indefinite-lived intangible assets, including cable franchise rights, annually as of July 1, or more frequently whenever events or substantive changes in circumstances indicate that the assets might be impaired. The assessment of recoverability may first consider qualitative factors to determine whether the existence of events or circumstances leads to a determination that it is more likely than not that the fair value of a reporting unit or an indefinite-lived intangible asset is less than its carrying amount. A quantitative assessment is performed if the qualitative assessment results in a more-likely-than-not determination or if a qualitative assessment is not performed. In connection with our impairment assessment process, from time to time, we perform quantitative assessments of our reporting units and cable franchise rights in order to support our qualitative assessments.\nGoodwill\nGoodwill results from business combinations and represents the excess amount of the consideration paid over the identifiable assets and liabilities recorded in the acquisition. We test goodwill for impairment at the reporting unit level.\nWhen performing a quantitative assessment, we estimate the fair values of our reporting units primarily based on a discounted cash flow analysis that involves significant judgment, including market participant estimates of future cash flows expected to be generated by the business and the selection of discount rates. Wh\nen performing this analysis, we also consider multiples of earnings from comparable public companies and recent market transactions.\n51\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nWe performed qualitative assessments in 2024 for goodwill in our Residential Connectivity & Platforms, Business Services Connectivity, Studios and Theme Parks segments in connection with our annual impairment testing. These analyses considered the results of previous quantitative assessments, and also considered various factors that would affect the estimated fair value of these reporting units in our qualitative assessments, including changes in projected future cash flows, recent market transactions and overall macroeconomic conditions, discount rates, and changes in our market capitalization. Based on these assessments, we concluded that it was more likely than not that the estimated fair values of our reporting units were substantially higher than their carrying values and that the performance of a quantitative impairment test was not required. We performed a quantitative assessment in 2024 for goodwill in our Media segment. Based on this assessment, the estimated fair value of the Media reporting unit substantially exceeded its carrying value and no impairment was required.\nChanges in market conditions, laws and regulations, and key assumptions made in future quantitative assessments, such as expected cash flows, competitive factors, discount rates, and value indications from market transactions, including the proposed Spin-off of businesses within our Media segment, could negatively impact the results of future impairment testing and could result in the recognition of an impairment charge.\nCable Franchise Rights\nOur cable franchise rights assets result from agreements we have with state and local governments that allow us to construct and operate a cable business within a specified geographic area. The value of a franchise is derived from the economic benefits we receive from the right to solicit new customers and to market additional services in a particular service area. The amounts we record for cable franchise rights are primarily a result of cable system acquisitions. Typically when we acquire a cable system, the most significant asset we record is the value of the cable franchise rights.\nWhen performing a quantitative assessment, we estimate the fair values of our cable franchise rights primarily based on a discounted cash flow analysis that involves significant judgment, including the estimate of future cash flows and the selection of discount rates. \nIn 2024, we performed a qualitative assessment of our cable franchise rights. At the time of our previous quantitative assessment in 2022, which was pursuant to our practice of performing quantitative assessments of cable franchise rights approximately once every four years, the estimated fair values of our franchise rights substantially exceeded their carrying values. We also considered various factors that would affect the estimated fair values of our cable franchise rights in our qualitative assessment, including changes in our projected future cash flows, recent market transactions and overall macroeconomic conditions, discount rates, and changes in our market capitalization. Based on this assessment, we concluded that it was more likely than not that the estimated fair values of our cable franchise rights were substantially higher than the carrying values and that the performance of a quantitative impairment test was not required.\nChanges in market \nconditions, laws and regulations, and key assumptions made in future quantitative assessments, such as expected cash flows, competitive factors, discount rates, and value indications from market transactions, could negatively impact the results of future impairment testing and could result in the\n recognition of an impairment charge.\nFilm and Television Content\nWe capitalize costs for owned film and television content, including direct costs, production overhead, print costs, development costs and interest, as\n well as acquired libraries. We have determined that the predominant monetization strategy for the substantial majority of our content is on an individual basis. Amortization for owned content predominantly monetized on an individual basis and accrued costs associated with participations and residuals payments are recorded using the individual film forecast computation method, which recognizes the costs in the same ratio as the associated ultimate revenue.\nOur estimates of ultimate revenue for films generally include revenue from all sources that are expected to be earned within 10 years from the date of a film’s initial release. These estimates are based on the distribution strategy and historical performance of similar content, as well as factors unique to the content itself. The most sensitive factor affecting our estimate of ultimate revenue for a film intended for theatrical release is the film’s theatrical performance, as subsequent revenue from the licensing and sale of a film has historically exhibited a high correlation to its theatrical performance. Upon a film’s release, our estimates of revenue from succeeding markets, including from content licensing across multiple platforms and home entertainment sales, are revised based on historical relationships and an analysis of current market trends.\nComcast 2024 Annual Report on Form 10-K\n52\nTable of Contents\nWith respect to television series or other owned television programming, the most sensitive factor affecting our estimate of ultimate revenue is whether the series can be successfully licensed beyond its initial license window. Initial estimates of ultimate revenue are limited to the amount of revenue attributed to the initial license window. Once it is determined that a television series or other owned television programming can be licensed beyond the initial license window, revenue estimates for these additional windows or platforms, such as U.S. and international syndication, home entertainment, and other distribution \nplatforms, are included in ultimate revenue. Revenue estimates for produced episodes include revenue expected to be earned within 10 years of delivery of the initial episode or, if still in production, 5 years from the delivery of the most recent episode, if later.\nWe capitalize the costs of licensed content when the license period begins, the content is made available for use and the costs of the licenses are known. Licensed content is amortized as the associated programs are used, incorporating estimated viewing patterns.\nCapitalized film and television costs are subject to impairment testing when certain triggering events are identified. The substantial majority of our owned content is evaluated for impairment on an individual title basis. Licensed content that is not part of a fil\nm group is tested for impairment primarily on a channel, network or platform basis, with the exception of our broadcast networks and owned local broadcast television stations, which are tested on a daypart basis. Sports rights are accounted for as executory contracts and are not subject to impairment. When performing an impairment assessment, we estimate fair value primarily based on a discounted cash flow analysis that involves significant judgment, including market participant estimates of future cash flows, which are supported by internal forecasts. Impairments of capitalized film and television costs were not material in any of the periods presented.\nWe recognize the costs of multiyear, live-event sports rights as the rights are utilized over the contract term based on estimated relative value. Estimated relative value is generally based on terms of the contract and the nature of and potential revenue generation of the deliverables within the contract.\n53\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nItem 7A: Quantitative and Qualitative Disclosures About Market Risk\nInterest Rate Risk Management\nWe maintain a mix of fixed-rate and variable-rate debt and we are exposed to the market risk of adverse changes in interest rates. In order to manage the cost and volatility relating to the interest cost of our outstanding debt, we enter into various interest rate risk management derivative transactions in accordance with our policy.\nWe monitor our exposure to the risk of adverse changes in interest rates through the use of techniques that include market valuation and sensitivity analyses. We do not engage in any speculative or leveraged derivative transactions.\nOur interest rate derivative financial instruments, which primarily include cross-currency swaps and interest rate swaps, represent an integral part of our interest rate risk management program.\nThe effect of our interest rate derivative financial instruments to our consolidated interest expense was an increase of $49 million in 2024, a decrease of $56 million in 2023 and a decrease of $66 million in 2022. Interest rate derivative financial instruments may have a significant effect on consolidated interest expense in the future.\nThe table below summarizes by contractual year of maturity the principal amount of our debt, notional amount of our interest rate instruments, effective rates, and fair values subject to interest rate risk maintained by us as of December 31, 2024. We had no variable rate debt outstanding as of December 31, 2024. We estimate interest rates on variable rate swaps using the relevant average implied forward rates through the year of maturity based on the yield curve in effect on December 31, 2024, plus the applicable borrowing margin.\n(in billions)\n2025\n2026\n2027\n2028\n2029\nThereafter\nTotal\nEstimated\nFair Value as of\nDecember 31, 2024\nDebt\nFixed-rate debt\n$\n4.9 \n$\n4.9 \n$\n5.7 \n$\n7.0 \n$\n4.8 \n$\n77.7 \n$\n105.1 \n$\n89.8 \nAverage interest rate\n(a)\n2.9 \n%\n1.7 \n%\n3.3 \n%\n4.0 \n%\n3.7 \n%\n3.8 \n%\n3.6 \n%\nFixed-to-Variable Interest Rate Swaps\nNotional amount\n(b)\n$\n— \n$\n1.3 \n$\n0.3 \n$\n1.0 \n$\n— \n$\n— \n$\n2.5 \n$\n(0.2)\nAverage pay rate\n— \n%\n6.5 \n%\n6.3 \n%\n6.8 \n%\n— \n%\n— \n%\n6.6 \n%\nAverage receive rate\n— \n%\n3.3 \n%\n3.6 \n%\n4.2 \n%\n— \n%\n— \n%\n3.7 \n%\n(a)\nIncludes the effects of our fixed-to-fixed cross-currency swaps, which are discussed further below under the heading “Foreign Exchange Risk Management.” \n(b)\nNotional amounts are used to calculate the interest to be paid or received and do not represent our exposure to credit loss. The estimated fair value approximate\ns the amount of payments to be made or proceeds to be received to settle the outstanding contracts, excluding accrued interest.\nSee Notes 1 and 6 for additional information.\nComcast 2024 Annual Report on Form 10-K\n54\nTable of Contents\nForeign Exchange Risk Management\nWe have significant operations in a number of countries outside the United States, and certain of our operations are conducted in foreign currencies. The value of these currencies, primarily including the British pound, euro, Japanese yen and Chinese yuan, fluctuates relative to the U.S. dollar. These changes could adversely affect the U.S. dollar equivalent value of our non-U.S. dollar operations, which could negatively affect our business, financial condition or results of operations in a given period or in specific territories.\nAs part of our overall strategy to manage the level of exposure to the risk of foreign exchange rate fluctuations, we enter into derivative financial instruments related to a significant portion of our foreign currency exposure for transactions denominated in currencies other than the functional currency of the transacting entity. We use cross-currency swaps as fair value and cash flow hedges for certain debt obligations denominated in a currency other than the functional currency of the issuer. Cross-currency swaps effectively convert foreign currency denominated debt to debt denominated in the functional currency, which hedge currency exchange risks associated with foreign currency denominated debt. We also enter into foreign currency forward contracts that change in value as currency exchange rates fluctuate to protect the functional currency equivalent value of non-functional currency denominated assets, liabilities, commitments, and forecasted non-functional currency revenue and expenses. In accordance with our policy, we hedge forecasted foreign currency transactions for periods generally not to exceed 30 months. Certain of these derivatives are designated as fair value hedges, including foreign currency forwards designated as fair value hedges on our foreign currency intercompany loans receivable. \nWe are also exposed to foreign exchange risk on the consolidation of our foreign operations. We have foreign currency denominated debt and cross-currency swaps designated as hedges of our net investments in certain of these subsidiaries.\nSee Note 6 for additional information. \nWe have analyzed our foreign currency exposure related to our foreign operations as of December 31, 2024, including our hedging contracts, to identify assets and liabilities denominated in a currency other than their functional currency. For those assets and liabilities, we then evaluated the effect of a hypothetical 10% shift in currency exchange rates, inclusive of the effects of derivatives. The results of our analysis indicate that such a shift in exchange rates would not have a material impact on our 2024 net income attributable to Comcast Corporation.\nCounterparty Credit Risk Management\nWe manage the credit risks associated with our derivative financial instruments through diversification and the evaluation and monitoring of the creditworthiness of counterparties. Although we may be exposed to losses in the event of nonperformance by counterparties, we do not expect such losses, if any, to be significant. We have agreements with certain counterparties that include collateral provisions. These provisions require a party with an aggregate unrealized loss position in excess of certain thresholds to post cash collateral for the amount in excess of the threshold. The threshold levels in our collateral agreements are based on our and the counterparty’s credit ratings. As of December 31, 2024 and 2023, we were not required to post collateral under the terms of these agreements, nor did we hold any collateral under the terms of these agreements.\n55\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nItem 8: Comcast Corporation Financial Statements and Supplementary Data \nIndex\nPage\nReport of Management\n57\nReport of Independent Registered Public Accounting Firm\n58\nConsolidated Statements of Income\n61\nConsolidated Statements of Comprehensive Income\n62\nConsolidated Statements of Cash Flows\n63\nConsolidated Balance Sheets\n64\nConsolidated Statements of Changes in Equity\n65\nNotes to Consolidated Financial Statements\n66\nNote 1: Summary of Significant Accounting Policies\n66\nNote 2: Segment Information\n67\nNote 3: Revenue\n70\nNote 4: Programming and Production Costs\n73\nNote 5: Income Taxes\n76\nNote 6: Debt\n78\nNote 7: Investments and Variable Interest Entities\n81\nNote 8: Property and Equipment\n84\nNote 9: Goodwill and Intangible Assets\n85\nNote 10: Employee Benefit Plans\n87\nNote 11: Equity\n88\nNote 12: Share-Based Compensation\n89\nNote 13: Supplemental Financial Information \n90\nNote 14: Commitments and Contingencies\n90\nComcast 2024 Annual Report on Form 10-K\n56\nTable of Contents\nReport of Management\nManagement’s Report on Financial Statements\nOur management is responsible for the preparation, integrity and fair presentation of information in the consolidated financial statements, including estimates and judgments. The consolidated financial statements presented in this report have been prepared in accordance with accounting principles generally accepted in the United States. Our management believes the consolidated financial statements and other financial information included in this report fairly present, in all material respects, the financial condition, results of operations and cash flows as of and for the periods presented in this report. The consolidated financial statements have been audited by Deloitte & Touche LLP, an independent registered public accounting firm, as stated in their report, which is included herein.\nManagement’s Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining an adequate system of internal control over financial reporting. Our system of internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States.\nOur internal control over financial reporting includes those policies and procedures that:\n•\nPertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect our transactions and dispositions of our assets.\n•\nProvide reasonable assurance that our transactions are recorded as necessary to permit preparation of our financial statements in accordance with accounting principles generally accepted in the United States, and that our receipts and expenditures are being made only in accordance with authorizations of our management and our directors.\n•\nProvide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, a system of internal control over financial reporting can provide only reasonable assurance and may not prevent or detect misstatements. Further, because of changes in conditions, effectiveness of internal control over financial reporting may vary over time. Our system contains self-monitoring mechanisms, and actions are taken to correct deficiencies as they are identified.\nOur management conducted an evaluation of the effectiveness of the system of internal control over financial reporting based on the framework in \nInternal Control — Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this evaluation, our management concluded that the system of internal control over financial reporting was effective as of December 31, 2024. The effectiveness of internal control over financial reporting has been audited by Deloitte & Touche LLP, an independent registered public accounting firm, as stated in their report, which is included herein.\nAudit Committee Oversight\nThe Audit Committee of the Board of Directors, which is comprised solely of independent directors, has oversight responsibility for our financial reporting process and the audits of the consolidated financial statements and internal control over financial reporting. The Audit Committee meets regularly with management and with our internal auditors and independent registered public accounting firm (collectively, the “auditors”) to review matters related to the quality and integrity of our financial reporting, internal control over financial reporting (including compliance matters related to our Code of Conduct), and the nature, extent, and results of internal and external audits. Our auditors have full and free access and report directly to the Audit Committee. The Audit Committee recommended, and the Board of Directors approved, that the audited consolidated financial statements be included in this Form 10-K. \n/s/ BRIAN L. ROBERTS\n/s/ JASON S. ARMSTRONG\n/s/ DANIEL C. MURDOCK\nBrian L. Roberts\n \nJason S. Armstrong\n  \nDaniel C. Murdock\nChairman and\nChief Executive Officer\n \nChief Financial Officer\n  \nExecutive Vice President, Chief \nAccounting Officer and Controller\n57\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and Board of Directors of\nComcast Corporation\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Comcast Corporation and subsidiaries (the “Company”) as of December 31, 2024 and 2023, the related consolidated statements of income, comprehensive income, cash flows, and changes in equity for each of the three years in the period ended December 31, 2024, and the related notes (collectively referred to as the “financial statements”). We also have audited the Company’s internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control — Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). \nIn our opinion, the financial statements referred to above present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with accounting principles generally accepted in the United States of America. Also, in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control — Integrated Framework (2013)\n issued by COSO.\nBasis for Opinions\nThe Company’s management is responsible for these financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying \nManagement’s Report on Internal Control Over Financial Reporting.\n Our responsibility is to express an opinion on these financial statements and an opinion on the Company’s internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects. \nOur audits of the financial statements included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures to respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions. \nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements. \nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. \nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current-period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nRevenue - Refer to Note 3 to the financial statements.\nCritical Audit Matter Description\nThe Company’s Residential Connectivity & Platforms segment generates revenue from customers that subscribe to broadband and wireless connectivity services, video services and wireline voice services. These services are offered to customers individually and as bundled services at a discounted rate. \nComcast 2024 Annual Report on Form 10-K\n58\nTable of Contents\nReport of Independent Registered Public Accounting Firm\nThe processing and recording of revenue are reliant upon multiple information technology (IT) systems.\nGiven the volume of data and the number of IT systems, subjective auditor judgment was involved in evaluating the sufficiency of audit evidence over revenue recognition for bundled services within the Residential Connectivity & Platforms segment, including the involvement of professionals with expertise in IT to identify, test, and evaluate the Company’s systems and automated controls used in processing revenue transactions.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to the judgments necessary to determine the appropriate recognition and processing of revenue included the following, among others:\n•\nWe tested the effectiveness of controls in the revenue recognition processes, including those in place to (a) establish revenue recognition accounting policies for bundled services, (b) record revenue, including any related discounts, in accordance with the established accounting policies, and (c) reconcile the various systems to the Company’s general ledger.\n•\nWith the assistance of our IT specialists, we:\n◦\nIdentified the relevant systems and databases used to process revenue transactions and tested the relevant IT controls over each of those systems and databases.\n◦\nPerformed testing of automated business controls over revenue from domestic residential and business customers.\n•\nWe tested the allocation of revenue for bundled services by selecting a sample of subscriber invoices, evaluating management’s determination of the transaction price and the distinct performance obligations, and recalculating the allocation of transaction price to each performance obligation based on the respective stand-alone selling prices.\n•\nWe tested the accuracy and completeness of the subscriber information used in our audit procedures by selecting a sample of the subscribers, and for those selections agreeing the selected subscriber information to supporting documentation.\n•\nWe developed expectations of revenue at a disaggregated level based on historical transaction prices, changes in stand-alone selling prices and current year volumes. We also developed an expectation of aggregate domestic residential revenue from subscribers based on cash received during the year. We compared those estimates to revenue recognized by the Company.\nGoodwill - Refer to Note 9 to the financial statements.\nCritical Audit Matter Description\nThe Company’s evaluation of goodwill for impairment is performed at the reporting unit level. To determine its reporting units, the Company evaluates the components one level below the segment level and aggregates the components if they have similar economic characteristics. The Company performed a quantitative assessment of goodwill for the Media reporting unit, which involved a comparison of the fair value of the Media reporting unit to its carrying value. \nThe Company used the discounted cash flow model to estimate fair value, which requires management to make significant judgments related to discount rates and forecasts of expected cash flows. Changes in these assumptions could have a significant impact on either the fair value, the amount of any goodwill impairment charge, or both.\nThe goodwill balance was $58 billion as of December 31, 2024, of which $20 billion was allocated to the Media reporting unit. Based on the quantitative assessment, the estimated fair value of the Media reporting unit exceeded its carrying value and no impairment was recognized.\nWe identified the goodwill impairment assessment of the Media reporting unit as a critical audit matter because of the significant judgments made by management to estimate the fair value of the Media reporting unit. This required a high degree of auditor judgment and an increased extent of effort, when performing audit procedures to evaluate management’s conclusion related to the aggregation of components into a single reporting unit and the reasonableness of management’s estimates and assumptions related to the selection of the discount rate, revenue growth rate and Adjusted EBITDA margin included in future expected cash flows for the Media reporting unit.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures to evaluate the determination of the reporting unit as well as the discount rate, revenue growth rate and Adjusted EBITDA margin included in future expected cash flows used by management to estimate the fair value of the Media reporting unit included the following, among others:\n•\nWe tested the effectiveness of controls over management’s goodwill impairment evaluation, including those over (a) the accounting policies regarding identification of the unit of account for goodwill and (b) the determination of the fair value of Media, such as controls related to management’s selection of the discount rate and forecasts of future expected cash flows.\n•\nWith the assistance of our fair value specialists, we evaluated the reasonableness of the (1) valuation methodology and (2) discount rate, including testing the source information underlying the determination of the discount rate, testing the mathematical accuracy of the calculation, and developing a range of independent estimates and comparing those to the discount rate selected by management.\n•\nWe evaluated management’s ability to accurately forecast future revenue and Adjusted EBITDA margin by comparing prior year forecasts to actual results in the respective years.\n59\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nReport of Independent Registered Public Accounting Firm\n•\nWe evaluated the reasonableness of management’s current forecasts of future revenue and Adjusted EBITDA margin by comparing such forecasts to historical results and to forecasted information included in Company press releases as well as in analyst and industry reports of the Company and companies in its peer group.\nIncome Taxes - Refer to Note 5 to the financial statements.\nCritical Audit Matter Description\nThe Company completed an internal corporate reorganization which resulted in a federal net capital loss of $9.1 billion, which can be carried back three years. Given capital gains recognized in prior federal income tax returns, the Company recognized an income tax benefit and a corresponding refund receivable of $1.9 billion.\nWe identified the accounting for the tax benefit as a critical audit matter due to the significant judgment required to (1) determine whether the tax position’s technical merits are more-likely-than-not to be sustained and (2) measure the amount of the tax benefit that qualifies for recognition. Auditing the Company’s accounting for this position required a high degree of auditor judgment, specialized knowledge, and involvement of our tax specialists.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to the tax benefit associated with the internal corporate reorganization included the following, among others:\n•\nWe tested the effectiveness of controls over management’s determination of the tax position and the measurement of the tax benefit.\n•\nWith the assistance of our tax specialists, we:\n◦\nEvaluated management’s memoranda and third-party opinions used by management to support its position and the related accounting impacts. We assessed the consistency of management’s position with our interpretation of the relevant laws and regulations.\n◦\nAssessed management’s methods and assumptions used in calculating the capital loss and measuring the tax benefit.\n◦\nRecalculated the tax basis of the entities included in the calculation of the capital loss by comparing the amounts to supporting evidence and evaluating the appropriateness of management’s assumptions used to determine the tax basis.\n/s/ \nDeloitte & Touche LLP\nPhiladelphia, Pennsylvania\nJanuary 31, 2025 \nWe have served as the Company’s auditor since 1963.\nComcast 2024 Annual Report on Form 10-K\n60\nTable of Contents\nComcast Corporation\nConsolidated Statements of Income\nYear ended December 31 (in millions, except per share data)\n2024\n2023\n2022\nRevenue\n$\n123,731\n \n$\n121,572\n \n$\n121,427\n \nCosts and Expenses:\nProgramming and production\n37,026\n \n36,762\n \n38,213\n \nMarketing and promotion\n8,073\n \n7,971\n \n8,506\n \nOther operating and administrative\n40,533\n \n39,190\n \n38,263\n \nDepreciation\n8,729\n \n8,854\n \n8,724\n \nAmortization\n6,072\n \n5,482\n \n5,097\n \nGoodwill and long-lived asset impairments\n—\n \n—\n \n8,583\n \nTotal costs and expenses\n100,434\n \n98,258\n \n107,385\n \nOperating income\n23,297\n \n23,314\n \n14,041\n \nInterest expense\n(\n4,134\n)\n(\n4,087\n)\n(\n3,896\n)\nInvestment and other income (loss), net\n(\n490\n)\n1,252\n \n(\n861\n)\nIncome before income taxes\n18,673\n \n20,478\n \n9,284\n \nIncome tax expense\n(\n2,796\n)\n(\n5,371\n)\n(\n4,359\n)\nNet income\n15,877\n \n15,107\n \n4,925\n \nLess: Net income (loss) attributable to noncontrolling interests\n(\n315\n)\n(\n282\n)\n(\n445\n)\nNet income attributable to Comcast Corporation\n$\n16,192\n \n$\n15,388\n \n$\n5,370\n \nBasic earnings per common share attributable to Comcast Corporation shareholders\n$\n4.17\n \n$\n3.73\n \n$\n1.22\n \nDiluted earnings per common share attributable to Comcast Corporation shareholders\n$\n4.14\n \n$\n3.71\n \n$\n1.21\n \nSee accompanying notes to consolidated financial statements.\n61\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nComcast Corporation\nConsolidated Statements of Comprehensive Income\nYear ended December 31 (in millions)\n2024\n2023\n2022\nNet income\n$\n15,877\n \n$\n15,107\n \n$\n4,925\n \nOther comprehensive income (loss), net of tax (expense) benefit:\nCurrency translation adjustments, net of deferred taxes of $(\n137\n), $(\n29\n) and $\n310\n(\n895\n)\n1,478\n \n(\n4,242\n)\nCash flow hedges:\nDeferred gains (losses), net of deferred taxes of $(\n4\n), $\n8\n and $(\n18\n)\n57\n \n16\n \n281\n \nRealized (gains) losses reclassified to net income, net of deferred taxes of $(\n1\n), $\n38\n and $(\n3\n)\n(\n1\n)\n(\n158\n)\n(\n192\n)\nEmployee benefit obligations and other, net of deferred taxes of $(\n9\n), $(\n2\n) and $(\n11\n)\n31\n \n3\n \n33\n \nOther comprehensive income (loss)\n(\n807\n)\n1,338\n \n(\n4,120\n)\nComprehensive income (loss)\n15,070\n \n16,445\n \n805\n \nLess: Net income (loss) attributable to noncontrolling interests\n(\n315\n)\n(\n282\n)\n(\n445\n)\nLess: Other comprehensive income (loss) attributable to noncontrolling interests\n(\n17\n)\n(\n19\n)\n(\n29\n)\nComprehensive income attributable to Comcast Corporation\n$\n15,402\n \n$\n16,746\n \n$\n1,280\n \nSee accompanying notes to consolidated financial statements.\nComcast 2024 Annual Report on Form 10-K\n62\nTable of Contents\nComcast Corporation\nConsolidated Statements of Cash Flows\nYear ended December 31 (in millions)\n2024\n2023\n2022\nOperating Activities\nNet income\n$\n15,877\n \n$\n15,107\n \n$\n4,925\n \nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization \n14,802\n \n14,336\n \n13,821\n \nGoodwill and long-lived asset impairments\n—\n \n—\n \n8,583\n \nShare-based compensation\n1,288\n \n1,241\n \n1,336\n \nNoncash interest expense (income), net\n464\n \n316\n \n309\n \nNet (gain) loss on investment activity and other\n1,088\n \n(\n768\n)\n1,177\n \nDeferred income taxes\n(\n902\n)\n(\n2,739\n)\n(\n834\n)\nChanges in operating assets and liabilities, net of effects of acquisitions and divestitures:\nCurrent and noncurrent receivables, net\n136\n \n(\n996\n)\n(\n1,327\n)\nFilm and television costs, net\n290\n \n(\n260\n)\n(\n451\n)\nAccounts payable and accrued expenses related to trade creditors\n(\n758\n)\n(\n520\n)\n497\n \nOther operating assets and liabilities\n(\n4,611\n)\n2,784\n \n(\n1,623\n)\nNet cash provided by operating activities\n27,673\n \n28,501\n \n26,413\n \nInvesting Activities\nCapital expenditures\n(\n12,181\n)\n(\n12,242\n)\n(\n10,626\n)\nCash paid for intangible assets\n(\n2,949\n)\n(\n3,298\n)\n(\n3,141\n)\nConstruction of Universal Beijing Resort\n(\n116\n)\n(\n137\n)\n(\n330\n)\nProceeds from sales of businesses and investments\n771\n \n661\n \n1,985\n \nAdvance on sale of investment\n—\n \n8,610\n \n—\n \nPurchases of investments\n(\n1,082\n)\n(\n1,313\n)\n(\n2,274\n)\nOther\n(\n113\n)\n558\n \n246\n \nNet cash provided by (used in) investing activities\n(\n15,670\n)\n(\n7,161\n)\n(\n14,140\n)\nFinancing Activities\nProceeds from (repayments of) short-term borrowings, net\n—\n \n(\n660\n)\n660\n \nProceeds from borrowings\n6,268\n \n6,052\n \n2,745\n \nRepurchases and repayments of debt\n(\n3,573\n)\n(\n4,015\n)\n(\n2,307\n)\nRepayment of collateralized obligation\n—\n \n(\n5,175\n)\n—\n \nRepurchases of common stock under repurchase program and employee plans\n(\n9,103\n)\n(\n11,291\n)\n(\n13,328\n)\nDividends paid\n(\n4,814\n)\n(\n4,766\n)\n(\n4,741\n)\nOther\n339\n \n5\n \n786\n \nNet cash provided by (used in) financing activities\n(\n10,883\n)\n(\n19,850\n)\n(\n16,184\n)\nImpact of foreign currency on cash, cash equivalents and restricted cash\n(\n26\n)\n9\n \n(\n86\n)\nIncrease (decrease) in cash, cash equivalents and restricted cash\n1,095\n \n1,500\n \n(\n3,997\n)\nCash, cash equivalents and restricted cash, beginning of year\n6,282\n \n4,782\n \n8,778\n \nCash, cash equivalents and restricted cash, end of year\n$\n7,377\n \n$\n6,282\n \n$\n4,782\n \nSee accompanying notes to consolidated financial statements.\n63\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nComcast Corporation\nConsolidated Balance Sheets\nDecember 31 (in millions, except share data)\n2024\n2023\nAssets\nCurrent Assets:\nCash and cash equivalents\n$\n7,322\n \n$\n6,215\n \nReceivables, net\n13,661\n \n13,813\n \nOther current assets\n5,817\n \n3,959\n \nTotal current assets\n26,801\n \n23,987\n \nFilm and television costs\n12,541\n \n12,920\n \nInvestments\n8,647\n \n9,385\n \nProperty and equipment, net\n62,548\n \n59,686\n \nGoodwill\n58,209\n \n59,268\n \nFranchise rights\n59,365\n \n59,365\n \nOther intangible assets, net\n25,599\n \n27,867\n \nOther noncurrent assets, net\n12,501\n \n12,333\n \nTotal assets\n$\n266,211\n \n$\n264,811\n \nLiabilities and Equity\nCurrent Liabilities:\nAccounts payable and accrued expenses related to trade creditors\n$\n11,321\n \n$\n12,437\n \nDeferred revenue\n3,507\n \n3,242\n \nAccrued expenses and other current liabilities\n10,679\n \n13,284\n \nCurrent portion of debt\n4,907\n \n2,069\n \nAdvance on sale of investment\n9,167\n \n9,167\n \nTotal current liabilities\n39,581\n \n40,198\n \nNoncurrent portion of debt\n94,186\n \n95,021\n \nDeferred income taxes\n25,227\n \n26,003\n \nOther noncurrent liabilities\n20,942\n \n20,122\n \nCommitments and contingencies\nRedeemable noncontrolling interests\n237\n \n241\n \nEquity:\nPreferred stock—authorized, \n20,000,000\n shares; issued, \nzero\n—\n \n—\n \nClass A common stock, $\n0.01\n par value—authorized, \n7,500,000,000\n shares; issued, \n4,651,093,045\n and \n4,842,108,959\n; outstanding, \n3,778,302,017\n and \n3,969,317,931\n47\n \n48\n \nClass B common stock, $\n0.01\n par value—authorized, \n75,000,000\n shares; issued and outstanding, \n9,444,375\n—\n \n—\n \nAdditional paid-in capital\n38,102\n \n38,533\n \nRetained earnings\n56,972\n \n52,892\n \nTreasury stock, \n872,791,028\n Class A common shares\n(\n7,517\n)\n(\n7,517\n)\nAccumulated other comprehensive income (loss)\n(\n2,043\n)\n(\n1,253\n)\nTotal Comcast Corporation shareholders’ equity\n85,560\n \n82,703\n \nNoncontrolling interests\n477\n \n523\n \nTotal equity\n86,038\n \n83,226\n \nTotal liabilities and equity\n$\n266,211\n \n$\n264,811\n \nSee accompanying notes to consolidated financial statements.\nComcast 2024 Annual Report on Form 10-K\n64\nTable of Contents\nComcast Corporation\nConsolidated Statements of Changes in Equity\n(in millions, except per share data)\n2024\n2023\n2022\nRedeemable Noncontrolling Interests\nBalance, beginning of year\n$\n241\n \n$\n411\n \n$\n519\n \nContributions from (distributions to) noncontrolling interests, net\n(\n13\n)\n(\n24\n)\n(\n77\n)\nOther\n—\n \n(\n171\n)\n(\n80\n)\nNet income (loss)\n9\n \n25\n \n49\n \nBalance, end of year\n$\n237\n \n$\n241\n \n$\n411\n \nClass A Common Stock\nBalance, beginning of year\n$\n48\n \n$\n51\n \n$\n54\n \nRepurchases of common stock under repurchase program and employee plans\n(\n2\n)\n(\n2\n)\n(\n3\n)\nBalance, end of year\n$\n47\n \n$\n48\n \n$\n51\n \nClass B Common Stock\nBalance, beginning and end of year\n$\n—\n \n$\n—\n \n$\n—\n \nAdditional Paid-In Capital\nBalance, beginning of year\n$\n38,533\n \n$\n39,412\n \n$\n40,173\n \nShare-based compensation\n1,169\n \n1,063\n \n1,055\n \nRepurchases of common stock under repurchase program and employee plans\n(\n1,841\n)\n(\n2,086\n)\n(\n2,431\n)\nIssuances of common stock under employee plans\n240\n \n272\n \n278\n \nOther\n2\n \n(\n127\n)\n337\n \nBalance, end of year\n$\n38,102\n \n$\n38,533\n \n$\n39,412\n \nRetained Earnings\nBalance, beginning of year\n$\n52,892\n \n$\n51,609\n \n$\n61,902\n \nRepurchases of common stock under repurchase program and employee plans\n(\n7,251\n)\n(\n9,309\n)\n(\n10,897\n)\nDividends declared\n(\n4,862\n)\n(\n4,795\n)\n(\n4,757\n)\nOther\n—\n \n(\n1\n)\n(\n10\n)\nNet income\n16,192\n \n15,388\n \n5,370\n \nBalance, end of year\n$\n56,972\n \n$\n52,892\n \n$\n51,609\n \nTreasury Stock at Cost\nBalance, beginning and end of year\n$\n(\n7,517\n)\n$\n(\n7,517\n)\n$\n(\n7,517\n)\nAccumulated Other Comprehensive Income (Loss)\nBalance, beginning of year\n$\n(\n1,253\n)\n$\n(\n2,611\n)\n$\n1,480\n \nOther comprehensive income (loss)\n(\n790\n)\n1,358\n \n(\n4,091\n)\nBalance, end of year\n$\n(\n2,043\n)\n$\n(\n1,253\n)\n$\n(\n2,611\n)\nNoncontrolling Interests\nBalance, beginning of year\n$\n523\n \n$\n684\n \n$\n1,398\n \nOther comprehensive income (loss)\n(\n17\n)\n(\n19\n)\n(\n29\n)\nContributions from (distributions to) noncontrolling interests, net\n295\n \n166\n \n89\n \nOther\n—\n \n—\n \n(\n280\n)\nNet income (loss)\n(\n324\n)\n(\n307\n)\n(\n495\n)\nBalance, end of year\n$\n477\n \n$\n523\n \n$\n684\n \nTotal equity\n$\n86,038\n \n$\n83,226\n \n$\n81,627\n \nCash dividends declared per common share\n$\n1.24\n \n$\n1.16\n \n$\n1.08\n \nSee accompanying notes to consolidated financial statements.\n65\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nComcast Corporation\nNotes to Consolidated Financial Statements\nNote 1: Summary of Significant Accounting Policies\nBasis of Presentation\nThe accompanying consolidated financial statements include all entities in which we have a controlling voting interest and variable interest entities (“VIEs”) required to be consolidated, including Universal Beijing Resort (see Note 7).\n \nWe translate assets and liabilities of our foreign operations where the functional currency is the local currency into U.S. dollars at the exchange rate as of the balance sheet date and translate revenue and expenses using average periodic exchange rates. The related translation adjustments are recorded as a component of accumulated other comprehensive income (loss) in our consolidated balance sheets. Any foreign currency transaction gains or losses are included in our consolidated statements of income in investment and other income (loss), net. For disclosures containing future amounts where the functional currency is the local currency, we translate the amounts into U.S. dollars at the exchange rates as of the balance sheet date.\n \nIn November 2024, we announced our intention to create SpinCo, a new independent publicly traded company comprised of select domestic cable television networks along with complementary digital assets through a tax-free spin-off. We are targeting to complete the Spin-off by the end of 2025, subject to the satisfaction of customary conditions, including obtaining final approval from our Board of Directors, satisfactory completion of SpinCo financings, receipt of tax opinions and receipt of any regulatory approvals. There can be no assurance that a separation transaction will occur, or, if one does, of its terms or timing. The consolidated financial statements and related notes do not reflect the proposed Spin-off.\nReclassifications\nOur current liability for accrued participations and residuals is separately disclosed in Note 4 in the current year and is included within the “accrued expenses and other current liabilities” caption in our consolidated balance sheet for all periods presented. Previously these amounts were presented in a separate caption in our consolidated balance sheet.\nAccounting Policies\nOur consolidated financial statements are prepared in accordance with GAAP, which require us to select accounting policies, including in certain cases industry-specific policies, and make estimates that affect the reported amount of assets, liabilities, revenue and expenses, and the related disclosure of contingent assets and contingent liabilities. Actual results could differ from these estimates. The following accounting policies are specific to the industries in which we operate:\n•\ncapitalization and amortization of film and television costs (see Note 4)\n•\ncosts for connecting customers to our HFC network (see Note 8)\nInformation on other accounting policies and methods that we use in the preparation of our consolidated financial statements are included, where applicable, in their respective footnotes that follow. Below is a discussion of accounting policies and methods used in our consolidated financial statements that are not presented within other footnotes. \nAdvertising Expenses\nAdvertising costs are expensed as incurred.\n \nFair Value Measurements\nThe accounting guidance related to fair value measurements establishes a hierarchy based on the types of inputs used for the various valuation techniques. The levels of the hierarchy are described below. \n•\nLevel 1: Values are determined using quoted market prices for identical financial instruments in an active market. \n•\nLevel 2: Values are determined using quoted prices for similar instruments in active markets; quoted prices for identical or similar instruments in markets that are not active; and model-derived valuations in which all significant inputs and significant value drivers are observable in active markets. \n•\nLevel 3: Values are determined using models that use significant inputs that are primarily unobservable, discounted cash flow methodologies or similar techniques, as well as instruments for which the determination of fair value requires significant management judgment or estimation. \nWe use this three-tier fair value hierarchy to measure the fair value of certain financial instruments on a recurring basis, such as for investments (see Note 7); on a non-recurring basis, such as for acquisitions and impairment testing (see Note 9); and for disclosure purposes, such as for debt (see Note 6). Our assessment of the significance of a particular input to the fair value measurement requires judgment and may affect the valuation and classification within the fair value hierarchy.\n \nComcast 2024 Annual Report on Form 10-K\n66\nTable of Contents\nComcast Corporation\nRecent Accounting Pronouncements\nIncome Tax Disclosures\nIn December 2023, the Financial Accounting Standards Board (“FASB”) issued updated accounting guidance related to income tax disclosures. The updated accounting guidance, among other things, requires additional disclosure primarily related to the income tax rate reconciliation and income taxes paid. We will adopt the updated accounting guidance in our Annual Report on Form 10-K for the year ending December 31, 2025.\n \nDisaggregation of Income Statement Expenses\nIn November 2024, the FASB issued updated accounting guidance related to disclosures about certain costs and expenses. The updated accounting guidance, among other things, requires quantitative disclosures for employee compensation, selling expenses and purchases of inventory. The updated guidance is effective beginning in our Annual Report on Form 10-K for the year ending December 31, 2027.\nNote 2: Segment Information\nWe are a global media and technology company with \nfive\n segments: Residential Connectivity & Platforms, Business Services Connectivity, Media, Studios and Theme Parks. Our segments align to our primary business operations and how our \nChairman and Chief Executive Officer\n, the chief operating decision maker, reviews our operating results. See\n Note 3 for a description of the various products and services within each segment.\nOur segments generally report transactions with one another as if they were stand-alone businesses in accordance with GAAP, and these transactions are eliminated in consolidation. When multiple segments enter into transactions to provide products and services to third parties, revenue is generally allocated to our segments based on relative value. Transactions between our segments generally include intercompany profit consistent with third-party transactions. The Residential Connectivity & Platforms and the Business Services Connectivity segments use certain shared infrastructure, including our network in the United States, and each segment is presented with its direct costs and an allocation of shared costs, as well as revenue from its customers.\nOur financial data by segment is presented in the tables below. We do not present asset information for our segments as this information is not used to allocate resources.\n \n67\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nComcast Corporation\nYear Ended December 31, 2024\n(in millions)\nResidential Connectivity & Platforms\nBusiness Services Connectivity\nMedia\nStudios\nTheme Parks\nTotal\nRevenue from external customers\n$\n71,401\n \n$\n9,678\n \n$\n23,463\n \n$\n7,832\n \n$\n8,615\n \n$\n120,990\n \nIntersegment revenue\n(a)\n173\n \n23\n \n4,685\n \n3,259\n \n1\n \n8,142\n \n71,574\n \n9,701\n \n28,148\n \n11,092\n \n8,617\n \n129,132\n \nReconciliation of Revenue\nOther revenue\n(b)\n2,982\n \nEliminations\n(a)\n(\n8,383\n)\nTotal consolidated revenue\n$\n123,731\n \nLess segment expenses:\n(c)\nProgramming and production\n$\n16,881\n \n$\n18,968\n \n$\n7,257\n \nMarketing and promotion\n1,473\n \n1,483\n \nOther\n(d)\n27,355\n \n4,201\n \n4,577\n \n947\n \n5,668\n \nSegment Adjusted EBITDA\n(e)\n$\n27,338\n \n$\n5,500\n \n$\n3,130\n \n$\n1,404\n \n$\n2,949\n \n$\n40,322\n \nReconciliation of total segment Adjusted EBITDA\nMedia, Studios and Theme Parks headquarters and other\n(f)\n(\n831\n)\nCorporate and other\n(b)(e)\n(\n1,346\n)\nEliminations\n(\n47\n)\nDepreciation\n(\n8,729\n)\nAmortization\n(\n6,072\n)\nInterest expense\n(\n4,134\n)\nInvestment and other income (loss), net\n(\n490\n)\nIncome before income taxes\n$\n18,673\n \nYear Ended December 31, 2023\n(in millions)\nResidential Connectivity & Platforms\nBusiness Services Connectivity\nMedia\nStudios\nTheme Parks\nTotal\nRevenue from external customers\n$\n71,739\n \n$\n9,233\n \n$\n20,734\n \n$\n8,308\n \n$\n8,948\n \n$\n118,962\n \nIntersegment revenue\n(a)\n207\n \n22\n \n4,621\n \n3,317\n \n(\n1\n)\n8,166\n \n71,946\n \n9,255\n \n25,355\n \n11,625\n \n8,947\n \n127,128\n \nReconciliation of Revenue\nOther revenue\n(b)\n2,827\n \nEliminations\n(a)\n(\n8,383\n)\nTotal consolidated revenue\n$\n121,572\n \nLess segment expenses:\n(c)\nProgramming and production\n$\n18,067\n \n$\n16,921\n \n$\n7,958\n \nMarketing and promotion\n1,389\n \n1,579\n \nOther\n(d)\n26,932\n \n3,964\n \n4,091\n \n818\n \n5,602\n \nSegment Adjusted EBITDA\n(e)\n$\n26,948\n \n$\n5,291\n \n$\n2,955\n \n$\n1,269\n \n$\n3,345\n \n$\n39,808\n \nReconciliation of total segment Adjusted EBITDA\nMedia, Studios and Theme Parks headquarters and other\n(f)\n(\n946\n)\nCorporate and other\n(b)(e)\n(\n1,318\n)\nEliminations\n105\n \nDepreciation\n(\n8,854\n)\nAmortization\n(\n5,482\n)\nInterest expense\n(\n4,087\n)\nInvestment and other income (loss), net\n1,252\n \nIncome before income taxes\n$\n20,478\n \nComcast 2024 Annual Report on Form 10-K\n68\nTable of Contents\nComcast Corporation\nYear Ended December 31, 2022\n(in millions)\nResidential Connectivity & Platforms\nBusiness Services Connectivity\nMedia\nStudios\nTheme Parks\nTotal\nRevenue from external customers\n$\n72,177\n \n$\n8,798\n \n$\n22,147\n \n$\n8,294\n \n$\n7,541\n \n$\n118,957\n \nIntersegment revenue\n(a)\n208\n \n21\n \n4,572\n \n3,963\n \n1\n \n8,765\n \n72,386\n \n8,819\n \n26,719\n \n12,257\n \n7,541\n \n127,722\n \nReconciliation of Revenue\nOther revenue\n(b)\n2,737\n \nEliminations\n(a)\n(\n9,032\n)\nTotal consolidated revenue\n$\n121,427\n \nLess segment expenses:\n(c)\nProgramming and production\n$\n18,500\n \n$\n17,650\n \n$\n8,778\n \nMarketing and promotion\n1,520\n \n1,699\n \nOther\n(d)\n27,775\n \n3,759\n \n3,951\n \n819\n \n4,858\n \nSegment Adjusted EBITDA\n(e)\n$\n26,111\n \n$\n5,060\n \n$\n3,598\n \n$\n961\n \n$\n2,683\n \n$\n38,414\n \nReconciliation of total segment Adjusted EBITDA\nMedia, Studios and Theme Parks headquarters and other\n(f)\n(\n881\n)\nCorporate and other\n(b)(e)\n(\n1,021\n)\nEliminations\n(\n66\n)\nDepreciation\n(\n8,724\n)\nAmortization\n(\n5,097\n)\nGoodwill and long-lived asset impairments\n(g)\n(\n8,583\n)\nInterest expense\n(\n3,896\n)\nInvestment and other income (loss), net\n(\n861\n)\nIncome before income taxes\n$\n9,284\n \n(a)\nOur most significant intersegment revenue transactions include distribution revenue in Media related to fees from Residential Connectivity & Platforms for the rights to distribute television programming, and content licensing revenue in Studios for licenses of owned content to Media. Revenue for licenses of content from Studios to Media is generally recognized at a point in time, consistent with the recognition of transactions with third parties, when the content is delivered and made available for use. The costs of these licenses in Media are recognized as the content is used over the license period. The difference in timing of recognition between segments results in an Adjusted EBITDA impact in eliminations, as the profits (losses) on these transactions are deferred in our consolidated results and recognized as the content is used over the license period.\n(b)\nIncludes the operations of our Sky-branded video services and television networks in Germany; Comcast Spectacor, which owns the Philadelphia Flyers and the Wells Fargo Center arena in Philadelphia, Pennsylvania; and Xumo, our consolidated streaming platform joint venture with Charter Communications. Corporate and other also includes overhead and personnel costs for Corporate.\n(c)\nThe significant expense categories and amounts align with the segment-level information that is regularly provided to our chief operating decision maker. Intersegment expenses are included in the amounts shown.\n(d)\nOther for each segment primarily includes:\nResidential Connectivity & Platforms and Business Services Connectivity: technical and support; direct product costs; marketing and promotion; customer service; administrative personnel costs; franchise and other regulatory fees; fees paid to third parties where we sell advertising on their behalf; bad debt; and other business, headquarters and support costs, including building and office expenses, taxes and billing costs necessary to operate the Residential Connectivity & Platforms and Business Services Connectivity segments. Our chief operating decision maker uses aggregate expense information to manage the operations of the Business Services Connectivity segment.\nMedia and Studios: salaries, employee benefits, rent and other overhead expenses.\nTheme Parks: theme park operations, including repairs and maintenance and related administrative expenses; food, beverage and merchandise costs; labor costs; and sales and marketing costs. Our chief operating decision maker uses aggregate expense information to manage the operations of the Theme Parks segment.\n(e)\nWe use Adjusted EBITDA as the measure of profit or loss for our segments. For each of our segments, our chief operating decision maker uses Adjusted EBITDA to measure operational strength and performance, assist in the evaluation of underlying trends, and allocate resources in the annual budget and forecasting process. Adjusted EBITDA is also a significant performance measure in our annual incentive compensation programs. From time to time we may report the impact of certain events, gains, losses or other charges related to our segments within Corporate and other. \n(f)\nIncludes overhead, personnel costs and other costs necessary to operate the Media, Studios and Theme Parks segments.\n(g)\nRefe\nr to Note 9 for a discussion of impairment charges in 2022 related to goodwill and long-lived assets.\n69\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nComcast Corporation\nNote 3: Revenue \nYear ended December 31 (in millions)\n2024\n2023\n2022\nDomestic broadband\n$\n26,228\n \n$\n25,489\n \n$\n24,469\n \nDomestic wireless\n4,273\n \n3,664\n \n3,071\n \nInternational connectivity\n4,854\n \n4,207\n \n3,426\n \nTotal residential connectivity\n35,355\n \n33,359\n \n30,966\n \nVideo\n26,872\n \n28,797\n \n30,496\n \nAdvertising\n4,089\n \n3,969\n \n4,546\n \nOther\n5,259\n \n5,820\n \n6,378\n \nTotal Residential Connectivity & Platforms Segment\n71,574\n \n71,946\n \n72,386\n \nTotal Business Services Connectivity Segment\n9,701\n \n9,255\n \n8,819\n \nDomestic advertising\n10,008\n \n8,600\n \n10,360\n \nDomestic distribution\n11,826\n \n10,663\n \n10,525\n \nInternational networks\n4,282\n \n4,109\n \n3,729\n \nOther\n2,031\n \n1,983\n \n2,105\n \nTotal Media Segment\n28,148\n \n25,355\n \n26,719\n \nContent licensing\n8,063\n \n8,231\n \n9,348\n \nTheatrical\n1,693\n \n2,079\n \n1,607\n \nOther\n1,335\n \n1,315\n \n1,302\n \nTotal Studios Segment\n11,092\n \n11,625\n \n12,257\n \nTotal Theme Parks Segment\n8,617\n \n8,947\n \n7,541\n \nOther revenue\n(a)\n2,982\n \n2,827\n \n2,737\n \nEliminations\n(a)\n(\n8,383\n)\n(\n8,383\n)\n(\n9,032\n)\nTotal revenue\n$\n123,731\n \n$\n121,572\n \n$\n121,427\n \n(a)\nSee Note 2 for additional information on intersegment revenue transactions. \nWe operate primarily in the Un\nited States but also in select international markets. The table below summarizes our consolidated revenue from customers in certain geographic locations. \nYear ended December 31 (in millions)\n2024\n2023\n2022\nUnited States\n$\n96,237\n \n$\n94,375\n \n$\n96,441\n \nUnited Kingdom\n14,194\n \n13,364\n \n13,380\n \nOther\n13,300\n \n13,833\n \n11,606\n \nTotal revenue\n$\n123,731\n \n$\n121,572\n \n$\n121,427\n \nResidential Connectivity & Platforms Segment\nResidential Connectivity & Platforms generates revenue from customers that subscribe to our residential broadband and wireless connectivity services, residential and business video services and residential wireline voice services in the United States, the United Kingdom and Italy. We offer these services individually and as bundled services at a discounted rate.\nSubscription rates and related charges vary according to the services and features customers receive, and customers are typically billed in advance and pay on a monthly basis. Revenue from customers that purchase bundled services at a discounted rate is allocated between the separate services based on the respective stand-alone selling prices. The stand-alone selling prices are determined based on the current prices at which we separately sell the services. Significant judgment is used to determine performance obligations that should be accounted for separately and the allocation of revenue when services are combined in a bundle. \nComcast 2024 Annual Report on Form 10-K\n70\nTable of Contents\nComcast Corporation\nWhile a portion of our customers are subject to contracts for their services, which are typically \n1\n month to \n2\n years in length, based on our evaluation of the terms of these contracts, we recognize revenue for these services primarily on a basis that is consistent with our customers that are not subject to contracts and recognize revenue as the services are provided on a monthly basis. Installation fees for these customers are deferred and recognized as revenue over the period of benefit to the customer, which is less than a year. Certain international customers are under contracts, with terms typically ranging from rolling monthly to \n24\n months, depending on the service, and may only discontinue service in accordance with the terms of their contracts. We recognize revenue for these customers as the services are provided over the contract period. At any given time, the amount of future revenue to be earned from these customers related to existing agreements is equal to less than \n10\n% of our annual Residential Connectivity & Platforms revenue and will generally be recognized within \n24\n months. Sales commissions are generally expensed as incurred, as the related period of benefit is less than a year. Sales commissions for the international customers under contract are generally deferred and recognized over the respective contract terms. \nOur services generally involve customer premise equip\nment, such as wireless gateways and set-top boxes, that are generally considered part of our services for revenue recognition. We recognize revenue from the sale of devices, including wireless devices and Sky Glass smart televisions, when they are transferred to the customer. Under an equipment installment plan, customers typically have the option to finance wireless devices and Sky Glass smart televisions interest-free over \n24\n months, and up to \n48\n months for international customers. Equipment installment plan receivables under these arrangements are recorded net of imputed interest when the devices are transferred to the customer.  \nWe also have arrangements to sell certain DTC streaming services t\no our customers. We have concluded we are the sales agent in these arrangements, and we record net commission revenue as earned, which is generally as customers are billed on a monthly basis, within domestic broadband and international connectivity revenue.\nUnder the terms of our domestic cable franchise agreements, we are generally required to pay the cable franchising authority an amount based on gross video revenue. We generally pass these and other similar fees through to our domestic customers and classify these fees in the respective Residential Connectivity & Platforms services revenue, with the corresponding costs included in other operating and administrative expenses.\nAdvertising\nRevenue is generated from the sale of advertising and technology, tools and solutions relating to advertising businesses. As part of distribution agreements with domestic cable networks, we generally receive an allocation of scheduled advertising time that we sell to advertisers. In addition, we generate revenue from the sale of advertising on our owned Sky-branded entertainment television networks and our digital platforms. In most cases, the available advertising units are sold by our sales force. We also enter into representation agreements under which we sell advertising on behalf of third parties. Since we are acting as the principal in these arrangements, we record the advertising that is sold in advertising revenue and the fees paid to the third parties in other operating and administrative expenses. In some cases, we work with representation firms as an extension of our sales force to sell a portion of the advertising units allocated to us and record the revenue net of agency commissions. \nWe have determined that a contract exists for our advertising sales arrangements once all terms and conditions are agreed upon, typically when the number of advertising units is specifically identified and scheduled. Advertisements are generally aired or delivered within one year once all terms and conditions are agreed upon. Revenue from these arrangements is recognized in the period in which advertisements are aired or delivered. Payment terms vary by contract, although terms generally require payment within \n30\n to \n60\n days from when advertisements are aired or delivered. We also provide technology, tools, data-driven services and marketplace solutions to customers in the media industry to facilitate the more effective engagement of advertisers with their target audiences and recognize revenue when these services are provided. \nBusiness Services Connectivity Segment\nBusiness Services Connectivity generates revenue from subscribers to a variety of our products and services which are offered to businesses. Our connectivity service offerings for small business locations in the United States primarily include broadband, wireline voice and wireless services that are similar to those provided to our residential customers and include certain other features specific to businesses. Our enterprise solutions offerings for medium-sized customers and larger enterprises also include ethernet network services, advanced voice services and a software-defined networking product. We also have certain business connectivity service offerings in the United Kingdom. \n71\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nComcast Corporation\nWe recognize revenue as the services are provided over the contract period. Substantially all of our customers are initially under contracts, with terms typically ranging from \n2\n years for small and medium-sized businesses to up to \n5\n years for larger enterprises. Customers with contracts may only discontinue service in accordance with the terms of their contracts. At any given time, the amount of future revenue to be earned related to fixed pricing under existing agreements is equal to approximately half of our annual Business Services Connectivity segment revenue, of which the substantial majority will be recognized within \n2\n years. Customers under contract typically pay on a monthly basis. Installation revenue and sales commissions are generally deferred and recognized over the respective contract terms.\nMedia Segment\nAdvertising\nMedia generates revenue from the sale of advertising on our linear television networks, Peacock and other digital properties. \nWe have determined that a contract exists for our advertising sales once all terms and conditions are agreed upon, typically when the number of advertising units is specifically identified and scheduled. Advertisements are generally aired or delivered within one year once all terms and conditions are agreed upon. Revenue is recognized, net of agency commissions, in the period in which advertisements are aired or delivered and payment occurs thereafter, with payment generally required within \n30\n days. In some instances, we guarantee audience ratings for the advertisements. To the extent there is a shortfall in contracts where the ratings were guaranteed, a portion of the revenue is deferred until the shortfall is settled, typically by providing additional advertising units generally within one year of the original airing.\nDistribution\nMedia generates revenue from the distribution of television programming in the United States and internationally to traditional multichannel video providers, such as our Residential Connectivity & Platforms segment, and to virtual multichannel video providers that offer streamed linear television networks. This revenue includes amounts under NBC and Telemundo retransmission consent agreements, and we also receive associated fees from NBC-affiliated and Telemundo-affiliated local broadcast television stations. We also receive monthly subscription fees for our Peacock service either directly from customers or from companies who sell Peacock to customers on our behalf. We have determined that we are principal in these arrangements and in the event we do not have transparency into the pricing charged by a company selling Peacock on our behalf, the amount of revenue recognized is limited to the fees receivable from that company pursuant to our arrangement.\nMonthly fees received under distribution agreements with multichannel video providers are generally under multiyear agreements with revenue based on the number of subscribers receiving the programming on our television networks and a per subscriber fee, although revenue for certain of our television networks is based on a fixed fee. Payment terms and conditions vary by contract type, although terms generally include payment within \n60\n days. These arrangements are accounted for as licenses of functional intellectual property and revenue is recognized as programming is provided.\nStudios Segment \nContent Licensing\nStudios generates revenue from the worldwide licensing of our owned film and television content to television networks and DTC streaming service providers, as well as through video on demand services provided by multichannel video providers and other service providers. Our agreements generally include fixed pricing and span multiple years. For example, following a film’s theatrical release, Studios may license the exhibition rights of a film to different customers over multiple successive distribution windows. \nWe recognize revenue when the content is delivered and available for use by the licensee. When the term of an existing agreement is renewed or extended, we recognize revenue when the licensed content becomes available under the renewal or extension. Payment terms and conditions vary by contract type, although payments are generally collected over the license term. The amount of future revenue to be earned related to fixed pricing under existing third-party agreements at any given time equals approximately one-half year to 1 year of annual Studios content licensing revenue, which is the segment with the largest portion of this future revenue. The majority of this revenue will be recognized within \n2\n years. This amount may fluctuate from period to period depending on the timing of the releases and the availability of content under existing agreements and may not represent the total revenue expected to be recognized as it does not include revenue from future agreements or from variable pricing or optional purchases under existing agreements.\nFor our agreements that include variable pricing, such as pricing based on the number of subscribers to a DTC streaming service sold by our customers, we generally recognize revenue as our customers sell to their subscribers. \nComcast 2024 Annual Report on Form 10-K\n72\nTable of Contents\nComcast Corporation\nTheatrical\nStudios generates revenue from the worldwide distribution of our produced and acquired films for exhibition in movie theaters. Our arrangements with exhibitors generally entitle us to a percentage of ticket sales. We recognize revenue as the films are viewed and exhibited in theaters and payment generally occurs within \n30\n days after exhibition.\nTheme Parks Segment\nTheme Parks generates revenue primarily from guest spending at our Universal theme parks in Orlando, Florida; Hollywood, California; Osaka, Japan; and Beijing, China. Guest spending includes ticket sales and in-park spending on food, beverages and merchandise. We also generate revenue from our consumer products business. Additionally, we license the right to use the Universal Studios brand name and other intellectual property and provide other services to third parties, including the party that owns and operates the Universal Studios Singapore theme park on Sentosa Island, Singapore. We recognize revenue from ticket sales when the tickets are used, generally within a year from the date of purchase. For annual passes, we generally recognize revenue on a straight-line basis over the period the pass is available to be used. We recognize revenue from in-park spending and consumer products at the point of sale.\nConsolidated Balance Sheets\nThe table below summarizes our accounts receivable, other balances that are not separately presented in our consolidated balance sheets that relate to the recognition of revenue and collection of the related cash, and deferred costs associated with our contracts with customers.\nDecember 31 (in millions)\n2024\n2023\nReceivables, gross\n$\n14,399\n \n$\n14,511\n \nLess: Allowance for credit losses\n738\n \n698\n \nReceivables, net\n$\n13,661\n \n$\n13,813\n \nNoncurrent receivables, net (included in other noncurrent assets, net)\n$\n1,853\n \n$\n1,914\n \nContract acquisition and fulfillment costs (included in other noncurrent assets, net)\n(a)\n$\n1,184\n \n$\n1,088\n \nNoncurrent deferred revenue (included in other noncurrent liabilities)\n$\n665\n \n$\n618\n \n(a) Amortization of contract acquisition and fulfillment costs totaled $\n716\n million, $\n692\n million and $\n707\n million in 2024, 2023 and 2022, respectively, included in marketing and promotion and other operating and administrative expenses.\n \nChanges in Allowance for Credit Losses\n(in millions)\n2024\n2023\n2022\nBeginning balance\n$\n698\n \n$\n736\n \n$\n658\n \nCurrent-period provision for expected credit losses\n747\n \n775\n \n758\n \nWrite-offs charged against the allowance, net of recoveries and other\n(\n707\n)\n(\n812\n)\n(\n680\n)\nEnding balance\n$\n738\n \n$\n698\n \n$\n736\n \nOur accounts receivables include amounts not yet billed related to equipment installment plans, as summarized in the table below.\nDecember 31 (in millions)\n2024\n2023\nReceivables, net\n$\n1,827\n \n$\n1,695\n \nNoncurrent receivables, net (included in other noncurrent assets, net)\n1,225\n \n1,223\n \nTotal\n$\n3,052\n \n$\n2,918\n \nNote 4: Programming and Production Costs\nYear ended December 31 (in millions)\n2024\n2023\n2022\nVideo distribution programming \n$\n11,428\n \n$\n12,460\n \n$\n13,013\n \nFilm and television content:\nOwned\n(a)\n9,617\n \n10,224\n \n10,765\n \n     Licensed, including sports rights\n14,668\n \n12,619\n \n13,151\n \nOther\n1,314\n \n1,459\n \n1,283\n \nTotal programming and production costs\n$\n37,026\n \n$\n36,762\n \n$\n38,213\n \n(a) Amount includes amortization of owned content of $\n7.8\n billion, $\n7.8\n billion and $\n8.6\n billion for the year ended December 31, 2024, 2023 and 2022, respectively, as well as participations and residuals expenses.\n73\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nComcast Corporation\nVideo Distribution Programming Expenses\nWe incur programming expenses related to the license of the rights to distribute or integrate third-party programmed television networks, platforms and related content included in video services we sell to end consumers. Programming is generally acquired under multiyear distribution agreements, with fees typically based on the number of customers receiving the television network programming and a per subscriber fee. Programming distribution arrangements are accounted for as executory contracts with expenses generally recognized based on the rates in the agreements, and the arrangements are not subject to impairment. \nFilm and Television Content\nWe incur costs related to the production of owned content and the license of the rights to use content owned by third parties and sports rights on our owned television networks and digital properties, which are described as owned and licensed content, respectively. We have determined that the predominant monetization strategy for the substantial majority of our content is on an individual basis.\nCapitalized Film and Television Costs\nDecember 31 (in millions)\n2024\n2023\nOwned:\nIn production and in development\n$\n3,342\n \n$\n2,893\n \nCompleted, not released\n209\n \n317\n \nReleased, less amortization\n4,545\n \n4,340\n \n8,095\n \n7,551\n \nLicensed, including sports advances\n4,446\n \n5,369\n \nFilm and television costs\n$\n12,541\n \n$\n12,920\n \nProduction tax incentives reduced \ncapitalized owned film and television costs\n by $\n455\n million and $\n418\n million as of December 31, 2024 and 2023, respectively, and resulted in a reduction of \nprogramming and production costs\n of $\n652\n million, $\n578\n million and $\n733\n million in 2024, 2023 and 2022, respectively. We have receivables related to our production tax incentives of $\n2.2\n billion and $\n1.9\n billion as of December 31, 2024 and 2023, respectively, a substantial majority of which are reflected in other \nnoncurrent assets\n in our consolidated balance sheets.\nThe table below summarizes estimated future amortization expense for the capitalized film and television costs recorded in our consolidated balance sheets as of December 31, 2024. \n(in millions)\nOwned \nLicensed\nCompleted, not released:\n2025\n$\n127\n \nReleased and licensed content:\n2025\n$\n2,299\n \n$\n2,373\n \n2026\n$\n842\n \n$\n1,471\n \n2027\n$\n452\n \n$\n351\n \nWe have future minimum commitments for licensed content that are not recognized in our consolidated balance sheet as of December 31, 2024 totaling $\n2.8\n billion.\nThe following table summarizes the amount of accrued participation and residual liabilities that we expect to pay during the upcoming operating cycle.\nDecember 31 (in millions)\n2024\n2023\nCurrent portion of accrued participations and residuals\n$\n1,444\n \n$\n1,671\n \nComcast 2024 Annual Report on Form 10-K\n74\nTable of Contents\nComcast Corporation\nCapitalization and Recognition of Film and Television Content\nWe capitalize costs for owned film and television content, including direct costs, production overhead, print costs, development costs and interest, as well as acquired libraries. Amortization for owned content predominantly monetized on an individual basis and accrued costs associated with participations and residuals payments are recorded using the individual film forecast computation method, which recognizes the costs in the same ratio as the associated ultimate revenue. Estimates of ultimate revenue and total costs are based on anticipated release patterns and distribution strategies, public acceptance and historical results for similar productions. Amortization for content predominantly monetized with other owned or licensed content is recorded based on estimated usage. In determining the method of amortization and estimated life of an acquired film or television library, we generally use the method and the life that most closely follow the undiscounted cash flows over the estimated life of the asset. We do not capitalize costs related to the distribution of a film in movie theaters or the licensing or sale of a film or television production, which primarily include costs associated with marketing and distribution.\nWe capitalize the costs of licensed content when the license period begins, the content is made available for use and the costs of the licenses are known. Licensed content is amortized as the associated programs are used, incorporating estimated viewing patterns.\nOwned and licensed content are presented as noncurrent assets in film and television costs. We present amortization of owned and licensed content and accrued costs associated with participations and residuals payments in programming and production costs.\nFilm and television productions may be eligible for tax incentives from certain state, local or foreign jurisdictions. These incentives generally provide for transferable or redeemable tax credits upon meeting established levels of qualified production spending within a participating jurisdiction. We record a receivable for a production tax incentive program when there is a reasonable assurance of collection with a corresponding reduction of capitalized film and television costs, and the related amortization.\nWe may enter into co-financing arrangements with third parties to jointly finance or distribute certain of our film productions. These arrangements can take various forms, but in most cases involve the grant of an economic interest in a film to an investor who owns an undivided copyright interest in the film. The number of investors and the terms of these arrangements can vary, although investors generally assume the full risks and rewards of ownership proportionate to their ownership in the film. We account for the proceeds received from the investor under these arrangements as a reduction of our capitalized film costs and the investor’s interest in the profit or loss of the film is recorded as either a charge or a benefit, respectively, in programming and production costs. The investor’s interest in the profit or loss of a film is recorded each period using the individual film forecast computation method.\nWhen an event or a change in circumstance occurs that was known or knowable as of the balance sheet date and that indicates the fair value of either owned or licensed content is less than the unamortized costs in the balance sheet, we determine the fair value and record an impairment charge to the extent the unamortized costs exceed the fair value. Owned content is assessed either individually or in identified film groups, for content predominantly monetized on an individual basis or with other content, respectively. The substantial majority of our owned content is evaluated for impairment on an individual title basis. Licensed content that is not part of a film group is generally assessed in packages, channels or dayparts. A daypart is an aggregation of programs broadcast during a particular time of day or programs of a similar type. Licensed content is tested for impairment primarily on a channel, network or platform basis, with the exception of our broadcast networks and owned local broadcast television stations, which are tested on a daypart basis. Estimated fair values of owned and licensed content are generally based on Level 3 inputs including analysis of market participant estimates of future cash flows. We record charges related to impairments or content that is substantively abandoned to programming and production costs.\nSports Rights\nWe recognize the costs of multiyear, live-event sports rights as the rights are used over the contract term based on estimated relative value. Estimated relative value is generally based on the terms of the contract and the nature of and potential revenue generation of the deliverables within the contract. Sports rights are accounted for as executory contracts and are not subject to impairment. When cash payments, including advanc\ned payments, exceed the relative value of the sports rights delivered, we recognize an asset in licensed content. Production costs incurred in advance of airing are also presented in licensed content.\n \n75\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nComcast Corporation\nNote 5: Income Taxes\nIncome (Loss) Before Income Taxes\nYear ended December 31 (in millions)\n2024\n2023\n2022\nDomestic\n$\n19,615\n \n$\n22,164\n \n$\n19,329\n \nForeign \n(\n942\n)\n(\n1,686\n)\n(\n10,045\n)\n$\n18,673\n \n$\n20,478\n \n$\n9,284\n \nComponents of Income Tax Expense\nYear ended December 31 (in millions)\n2024\n2023\n2022\nCurrent Expense (Benefit):\nFederal\n$\n2,194\n \n$\n6,270\n \n$\n4,025\n \nState\n1,115\n \n1,591\n \n961\n \nForeign\n389\n \n249\n \n207\n \n3,698\n \n8,110\n \n5,193\n \nDeferred Expense (Benefit):\nFederal\n(\n599\n)\n(\n2,126\n)\n(\n281\n)\nState\n(\n49\n)\n(\n468\n)\n(\n483\n)\nForeign\n(\n253\n)\n(\n145\n)\n(\n70\n)\n(\n902\n)\n(\n2,739\n)\n(\n834\n)\nIncome tax expense (benefit)\n$\n2,796\n \n$\n5,371\n \n$\n4,359\n \nOur income tax expense (benefit) differs from the federal statutory amount because of the effect of the items detailed in the table below.\n \nYear ended December 31 (in millions)\n2024\n2023\n2022\nFederal tax at statutory rate\n$\n3,921\n \n$\n4,300\n \n$\n1,950\n \nState income taxes, net of federal benefit\n363\n \n418\n \n454\n \nForeign income taxed at different rates\n(a)\n363\n \n455\n \n586\n \nAdjustments to uncertain and effectively settled tax positions, net\n332\n \n353\n \n179\n \nTax credits\n(a)\n(\n328\n)\n(\n280\n)\n(\n171\n)\nExcess tax benefits recognized on share-based compensation\n(\n4\n)\n4\n \n(\n30\n)\nTax legislation\n(\n24\n)\n8\n \n(\n287\n)\nInternal corporate reorganization\n(\n1,920\n)\n—\n \n—\n \nGoodwill impairment\n—\n \n—\n \n1,666\n \nOther\n93\n \n113\n \n12\n \nIncome tax expense (benefit)\n$\n2,796\n \n$\n5,371\n \n$\n4,359\n \n(a) We updated our presentation in 2024 to include all federal tax credits within the “tax credits” caption, which results in reclassification of prior period amounts. Federal tax credits for foreign income taxes previously presented within the “foreign income taxed at different rates” caption and federal research and development credits previously presented in a stand-alone caption are now presented within the “tax credits” caption.\nWe base our provision for income taxes on our current period income, changes in our deferred income tax assets and liabilities, income tax rates, changes in estimates of our uncertain tax positions, tax planning opportunities available in the jurisdictions in which we operate and excess tax benefits or deficiencies that arise when the tax consequences of share-based compensation differ from amounts previously recognized in the statements of income. We recognize deferred tax assets and liabilities when there are temporary differences between the financial reporting basis and tax basis of our assets and liabilities and for the expected benefits of using net operating loss carryforwards. When a change in the tax rate or tax law has an impact on deferred taxes, we apply the change based on the years in which the temporary differences are expected to reverse. We record the change in our consolidated financial statements in the period of enactment. \nComcast 2024 Annual Report on Form 10-K\n76\nTable of Contents\nComcast Corporation\nThe determination of the income tax consequences of a business combination includes identifying the tax basis of assets and liabilities acquired and any contingencies associated with uncertain tax positions assumed or resulting from the business combination. Deferred tax assets and liabilities related to temporary differences of an acquired entity are recorded as of the date of the business combination and are based on our estimate of the ultimate tax basis that will be accepted by the various tax authorities. We record liabilities for contingencies associated with prior tax returns filed by the acquired entity based on criteria set forth in the appropriate accounting guidance. We adjust the deferred tax accounts and the liabilities periodically to reflect any revised estimated tax basis and any estimated settlements with the various tax authorities. The effects of these adjustments are recorded to income tax expense.\nFrom time to time, we engage in transactions in which the tax consequences may be subject to uncertainty. In these cases, we evaluate our tax position using the recognition threshold and the measurement attribute in accordance with the accounting guidance related to uncertain tax positions. Examples of these transactions include business acquisitions and dispositions, including consideration paid or received in connection with these transactions, certain financing transactions, and the allocation of income among state and local tax jurisdictions. Significant judgment is required in assessing and estimating the tax consequences of these transactions. We determine whether it is more likely than not that a tax position will be sustained on examination, including the resolution of any related appeals or litigation processes, based on the technical merits of the position. A tax position that meets the more-likely-than-not recognition threshold is measured to determine the amount of benefit to be recognized in our consolidated financial statements. We classify interest and penalties, if any, associated with our uncertain tax positions as a component of income tax expense (benefit).\nComponents of Net Deferred Tax Liability\nDecember 31 (in millions)\n2024\n2023\nDeferred Tax Assets:\nNet operating loss and other loss carryforwards\n$\n4,415\n \n$\n3,530\n \nAdvance on sale of investment (see Note 7)\n2,437\n \n2,367\n \nNondeductible accruals and other\n4,232\n \n4,100\n \nLess: Valuation allowance\n4,498\n \n3,679\n \n \n6,586\n \n6,318\n \nDeferred Tax Liabilities:\nProperty and equipment and intangible assets\n28,672\n \n29,337\n \nInvestments\n934\n \n1,002\n \nDebt\n2,055\n \n1,814\n \nForeign subsidiaries and undistributed foreign earnings\n43\n \n59\n \n31,704\n \n32,212\n \nNet deferred tax liability\n$\n25,118\n \n$\n25,894\n \nChanges in our Valuation Allowance for Deferred Tax Assets\n(in millions)\n2024\n2023\n2022\nBeginning balance\n$\n3,679\n \n$\n3,295\n \n$\n2,907\n \nAdditions charged to income tax expense and other accounts\n910\n \n469\n \n433\n \nDeductions from reserves\n(\n91\n)\n(\n84\n)\n(\n45\n)\nEnding balance\n$\n4,498\n \n$\n3,679\n \n$\n3,295\n \nChanges in our net deferred tax liability in 2024 that were not recorded as deferred income tax expense (benefit) are primarily related to an increase of $\n124\n million associated with items included in other comprehensive income (loss).\nAs of December 31, 2024, net operating loss and other carryforwards primarily reflects foreign net operating loss carryforwards of $\n11.8\n billion, which primarily relate to our foreign operations in Europe and the majority of which can be carried forward indefinitely. The determination of the realization of the foreign net operating loss carryforwards is dependent on our subsidiaries’ taxable income or loss, redetermination from taxing authorities, and foreign laws that can change from year to year and impact the amount of such carryforwards. We recognize a valuation allowance if we determine it is more likely than not that some portion, or all, of a deferred tax asset will not be realized. As of December 31, 2024 and 2023, our valuation allowance was primarily related to our foreign net operating loss carryforwards. \n77\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nComcast Corporation\nDuring 2024, we completed an internal corporate reorganization related to certain foreign subsidiaries, which resulted in a federal net capital loss of $\n9.1\n billion as of December 31, 2024. This capital loss can be carried back and applied against capital gains recognized on our prior federal income tax returns for 2021 through 2023, and as a result, we recognized an income tax benefit and a corresponding refund receivable of $\n1.9\n billion. Deferred federal income tax has not been recognized on the excess of the financial reporting basis over the tax basis in foreign subsidiaries resulting from the reorganization where indefinite reversal criteria have been met. Any liabilities would be recognized upon a taxable disposition of such subsidiaries; however, the determination of the amount of any unrecognized deferred income tax liabilities is not practicable.\nA net current federal tax receivable of $\n2.0\n billion is included in other current assets within our consolidated balance sheet as of December 31, 2024. There were \nno\n net current federal tax receivables as of December 31, 2023.\nUncertain Tax Positions\nReconciliation of Unrecognized Tax Benefits\n(in millions)\n2024\n2023\n2022\nGross unrecognized tax benefits, January 1\n$\n2,593\n \n$\n2,161\n \n$\n2,042\n \nAdditions based on tax positions related to the current year\n396\n \n546\n \n380\n \nAdditions based on tax positions related to prior years\n201\n \n1\n \n56\n \nReductions for tax positions of prior years\n(\n268\n)\n(\n43\n)\n(\n145\n)\nReductions due to expiration of statutes of limitations\n(\n29\n)\n(\n56\n)\n(\n148\n)\nSettlements with tax authorities and other\n(\n28\n)\n(\n15\n)\n(\n24\n)\nGross unrecognized tax benefits, December 31\n$\n2,865\n \n$\n2,593\n \n$\n2,161\n \nOur gross unrecognized tax benefits include both amounts related to positions for which we have recorded liabilities for potential payment obligations and those for which tax has been assessed and paid. The amounts exclude the federal benefits on state tax positions that were recorded to deferred income taxes. If we were to recognize our gross unrecognized tax benefits in the future, $\n2.2\n billion would impact our effective tax rate and the remaining amount would increase our deferred income tax liability.\n \nThe amount and timing of the recognition of any such tax benefit is dependent on the completion of examinations of our tax filings by the various tax authorities and the expiration of statutes of limitations. It is reasonably possible that certain tax contests could be resolved within the next 12 months that may result in a decrease in our effective tax rate. Accrued interest and penalties associated with our liability for uncertain tax positions were not material in any period presented.\nThe IRS has completed its examination of our income tax returns for all years through 2022. Various states are examining our state tax returns and the tax years of those tax returns currently under examination vary by state, with most of the periods relating to tax years 2011 and forward. Various foreign jurisdictions are examining our tax returns and the tax years of those tax returns currently under examination vary by country, with most of the periods relating to tax years 2010 and forward.\n \nNote 6: Debt\nDebt Outstanding\nDecember 31 (in billions)\nWeighted-Average Interest Rate as of December 31, 2024\nWeighted-Average Interest Rate as of December 31, 2023\n2024\n(b)\n2023\n(b)\nTerm loans\n3.2\n \n%\n3.2\n \n%\n$\n3.1\n \n$\n3.1\n \nSenior notes with maturities of 5 years or less, at face value\n3.4\n \n%\n3.5\n \n%\n26.7\n \n25.9\n \nSenior notes with maturities between 5 and 10 years, at face value\n3.6\n \n%\n3.3\n \n%\n18.1\n \n18.8\n \nSenior notes with maturities greater than 10 years, at face value\n3.9\n \n%\n3.8\n \n%\n55.4\n \n53.4\n \nFinance lease obligations and other\n1.9\n \n2.0\n \nDebt issuance costs, premiums, discounts, fair value adjustments for acquisition accounting and hedged positions, net\n(\n6.0\n)\n(\n6.1\n)\nTotal debt\n4.1\n \n%\n(a)\n4.0\n \n%\n(a)\n99.1\n \n97.1\n \nLess: Current portion\n4.9\n \n2.1\n \nNoncurrent portion of debt\n$\n94.2\n \n$\n95.0\n \n(a)\nRate represents an effective interest rate and includes the effects of amortization of debt issuance costs, premiums, discounts, fair value adjustments for acquisition accounting and hedged positions, as well as the effects of our derivative financial instruments.\nComcast 2024 Annual Report on Form 10-K\n78\nTable of Contents\nComcast Corporation\n(b)\nAs of December 31, 2024, included in our outstanding debt were foreign currency denominated senior notes and term loans with principal amounts of £\n3.3\n billion, €\n8.5\n billion and ¥\n22.3\n billion RMB. As of December 31, 2023, included in our outstanding debt were foreign currency denominated senior notes and term loans with principal amounts of £\n2.6\n billion, €\n6.7\n billion and ¥\n22.1\n billion RMB.\nOur senior notes are unsubordinated and unsecured obligations and are subject to parent and/or subsidiary guarantees. As of December 31, 2024 and 2023, substantially all of our debt obligations were fixed-rate debt and our debt had an estimated fair value of $\n89.8\n billion and $\n92.2\n billion, respectively. The estimated fair value of our publicly traded debt was primarily based on Level 1 inputs that use quoted market value for the debt. The estimated fair value of debt for which there are no quoted market prices was based on Level 2 inputs that use interest rates available to us for debt with similar terms and remaining maturities. \nPrincipal Maturities of Debt\n(in billions)\n2025\n$\n4.9\n \n2026\n$\n4.9\n \n2027\n$\n5.7\n \n2028\n$\n7.0\n \n2029\n$\n4.8\n \nThereafter\n$\n77.7\n \nRevolving Credit Facility and Commercial Paper Program\nIn May 2024, we entered into a new $\n11.8\n billion revolving credit facility with a syndicate of banks, due May 17, 2029, that may be used for general corporate purposes. We may increase the commitments under the facility up to a total of $\n14.8\n billion, as well as extend the expiration date to no later than May 17, 2031, subject to the approval of the lenders. The interest rate consists of a benchmark rate plus a borrowing margin that is determined based on Comcast’s credit rating. \nAs of December 31, 2024, the borrowing margin for borrowings based on the Adjusted Term SOFR Rate, as defined in the agreement, was \n0.875\n%\n. The facility requires that we maintain a certain financial ratio based on debt and EBITDA, as defined in th\ne agreement. In connection with our entry into the new credit facility, we terminated our prior credit facility dated as of March 30, 2021. \nOur commercial paper program is supported by our revolving credit facility and provides a lower cost source of borrowing to fund short-term working capital requirements.\nAs of December 31, 2024 and 2023, we had \nno\n borrowings outstanding under our revolving credit facility or our commercial paper program. As of December 31, 2024, amounts available under our revolving credit facility, net of amounts outstanding under our commercial paper program and outstanding letters of credit and bank guarantees, totaled $\n11.8\n billion. \nLetters of Credit and Bank Guarantees\nAs of December 31, 2024, we and certain of our subsidiaries had undrawn irrevocable standby letters of credit and bank guarantees totaling $\n288\n million to cover potential fundings under various agreements.\n79\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nComcast Corporation\nDerivatives and Hedging\nWe use financial instruments designated as hedging instruments primarily to manage exposures to (1) foreign exchange rate fluctuations resulting from certain foreign currency denominated debt obligations and intercompany funding arrangements and from the consolidation of our foreign operations; and (2) interest rate risk relating to our debt. Our objective is to manage the financial and operational exposure arising from these risks by offsetting gains and losses on underlying exposures with gains and losses on the instruments used to hedge them.\nDecember 31, 2024\nDecember 31, 2023\n(in billions)\nDesignation\nNotional\nNet Derivative Asset (Liability)\nNotional\nNet Derivative Asset (Liability)\nForeign Exchange Risk\nForeign Currency Denominated Debt\nCross-currency swaps\nFair value hedge\n$\n1.9\n \n$\n(\n0.1\n)\n$\n—\n \n$\n—\n \nCross-currency swaps\nCash flow hedge\n0.8\n \n(\n0.2\n)\n0.8\n \n(\n0.2\n)\nIntercompany Loans\nForeign currency forwards\nFair value hedge\n1.7\n \n0.1\n \n2.0\n \n—\n \nNet Investments in Foreign Subsidiaries\nForeign currency denominated debt\n(a)\nNet investment hedge\n7.3\n \n7.4\n \nCross-currency swaps\nNet investment hedge\n1.7\n \n0.4\n \n2.8\n \n—\n \nInterest Rate Risk\nFixed-to-variable interest rate swaps\nFair value hedge\n$\n2.5\n \n$\n(\n0.2\n)\n$\n2.5\n \n$\n(\n0.2\n)\n(a)\nOur foreign currency denominated debt designated as net investment hedges are non-derivative instruments and amount shown is the value of debt designated as a hedge.\n \nThe fair value of our derivative financial instruments are primarily measured using Level 2 inputs using a market-based approach. Net cash received or paid related to our derivative instruments is classified in our consolidated statements of cash flows based on the objective of the instrument and the classifications of the applicable underlying cash flows.\nChanges in the fair value of derivative instruments accounted for as fair value hedges are primarily recorded within earnings and changes in the fair value of cash flow hedges are recorded as a component of accumulated other comprehensive income (loss) until the hedged items affect earnings. The earnings impacts are recorded within the same line item as the item being hedged. \nThe table below summarizes the impact of our hedged foreign currency denominated debt and intercompany loans and the associated derivative contracts on the other income (loss) component of investment and other income (loss).\n(in billions)\n2024\n2023\n2022\nForeign currency transaction gains (losses)\n$\n—\n \n$\n(\n0.2\n)\n$\n(\n0.6\n)\nDerivative gains (losses)\n$\n0.1\n \n$\n0.3\n \n$\n0.6\n \nTransaction gains and losses resulting from currency movements on debt and changes in the fair value of cross-currency swaps designated as net investment hedges are recorded within the currency translation adjustments component of accumulated other comprehensive income (loss). \nThe table below summarizes the amount of pre-tax gains (losses) related to net investment hedges recognized in the cumulative translation adjustments component of other comprehensive income (loss).\n(in billions)\n2024\n2023\n2022\nEffect of net investment hedges\n$\n0.9\n \n$\n0.3\n \n$\n(\n0.4\n)\nComcast 2024 Annual Report on Form 10-K\n80\nTable of Contents\nComcast Corporation\nNote 7: Investments and Variable Interest Entities\nInvestment and Other Income (Loss), Net\nYear ended December 31 (in millions)\n2024\n2023\n2022\nEquity in net income (losses) of investees, net \n$\n(\n680\n)\n$\n789\n \n$\n(\n537\n)\nRealized and unrealized gains (losses) on equity securities, net \n(\n313\n)\n(\n130\n)\n(\n320\n)\nOther income (loss), net \n502\n \n592\n \n(\n3\n)\nInvestment and other income (loss), net\n$\n(\n490\n)\n$\n1,252\n \n$\n(\n861\n)\nThe amount of unrealized gains (losses), net recognized in 2024, 2023 and 2022 that related to marketable and nonmarketable equity securities still held as of the end of each reporting period was $(\n288\n) million, $(\n140\n) million and $(\n394\n) million, respectively.\nInvestments\nDecember 31 (in millions)\n2024\n2023\nEquity method\n$\n7,252\n \n$\n7,615\n \nMarketable equity securities \n11\n \n39\n \nNonmarketable equity securities\n1,221\n \n1,482\n \nOther investments\n184\n \n559\n \nTotal investments\n8,668\n \n9,694\n \nLess: Current investments\n21\n \n310\n \nNoncurrent investments\n$\n8,647\n \n$\n9,385\n \nEquity Method\nWe use the equity method to account for investments in which we have the ability to exercise significant influence over the investee’s operating and financial policies, or in which we hold a partnership or limited liability company interest in an entity with specific ownership accounts, unless we have virtually no influence over the investee’s operating and financial policies. Equity method investments are recorded at cost and are adjusted to recognize (1) our share, based on percentage ownership or other contractual basis, of the investee’s net income or loss after the date of investment, (2) amortization of the recorded investment that exceeds our share of the book value of the investee’s net assets, (3) additional contributions made and dividends or other distributions received, and (4) impairments resulting from other-than-temporary declines in fair value. For some investments, we record our share of the investee’s net income or loss one quarter in arrears due to the timing of our receipt of such information. Gains or losses on the \nsale of equity method investments are recorded to other income (loss), net. If an equity method investee were to issue additional securities that would change our proportionate share of the entity, we would recognize the change, if any, as a gain or loss to oth\ner income (loss), net. Cash distributions received from equity method investments are considered returns on investment and are presented within operating activities in the consolidated statements of cash flows to the extent of cumulative equity in net income of the investee.\n Additional distributions are presented as investing activities. Distributions presented within operating activities totaled $\n297\n million, $\n217\n million and $\n162\n million in 2024, 2023 and 2022, respectively.\nAtairos\nOn January 1, 2016, we established Atairos Group, Inc., a strategic company focused on investing in and operating companies in a range of industries and business sectors, both domestically and internationally. Atairos is controlled by management companies led by our former CFO through interests that carry all of the voting rights. We are the only third-party investor in Atairos. \nIn November 2020, we amended our agreement with Atairos, which primarily extended the investment term of the agreement from up to \n12\n years to up to \n16.5\n years, extended the period in which capital can be recycled to the full investment period and decreased our commitment to fund Atairos from up to $\n5\n billion to up to $\n4.5\n billion in the aggregate at any one time, subject to certain offsets, with the maximum amount of annual capital calls reduced to $\n400\n million, plus certain amounts previously distributed. In addition, we have separately committed to fund Atairos $\n40\n million annually for a management fee, subject to certain adjustments. The management company investors have committed to fund from $\n50\n million to $\n100\n million, with at least $\n40\n million to be funded by our former CFO, subject to his continued role with Atairos. Our economic interests do not carry voting rights and obligate us to absorb approximately \n99\n% of any losses and they provide us the right to receive approximately \n86\n% of any residual returns in Atairos, in either case on a cumulative basis.\n81\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nComcast Corporation\nWe have concluded that Atairos is a VIE, that we do not have the power to direct the activities that most significantly impact the economic performance of Atairo\ns as we have no voting rights and only certain consent rights, and that we are not a related party with our former CFO or the management companies. We therefore do not consolidate Atairos and account for our investment as an equity method investment. Certain distributions retained by Atairos on our behalf are accounted for as advances and classified within other investments. Atairos may pledge our remaining unfunded capital commitment as security to lenders in connection with certain financing arrangem\nents. This has no effect on our funding commitments. There are no other liquidity arrangements, guarantees or other financial commitments between Comcast and Atairos, and therefore our maximum risk of financial loss is our investment balance and our remaining unfunded capital commitment of $\n1.4\n billion as of December 31, 2024.\nAtairos follows investment company accounting and records its inv\nestments at their fair values each reporting period with the net gains or losses reflected in its statement of operations. We recognize our share of these gains and losses in equity in net income (losses) of investees, net. In 2024, 2023 and 2022, we made cash capital contributions totaling $\n73\n million, $\n145\n million, and $\n52\n million, respe\nctively, to Atairos. As of December 31, 2024 and 2023, our investment, inclusive of advances classified within other investments, was $\n5.1\n billion and $\n5.5\n billion, respectively.\nHulu and Collateralized Obligation\nIn 2019, we entered into a series of agreements with The Walt Disney Company and certain of its subsidiaries, whereby we relinquished our board seats and substantially all voting rights associated with our investment in Hulu, and Disney assumed full operational control. Concurrent with these agreements, we also acquired additional ownership interest in Hulu previously held by AT&T. Following these transactions, our interest was approximately \n33\n% and we had the right, but not the obligation, to fund our proportionate share of future equity capital calls. The agreements included put and call provisions regarding our ownership interest in Hulu, pursuant to which, as early as January 2024, we could require Disney to buy, and Disney could require us to sell our interest, in either case, for fair value at that future time subject to a minimum equity value of $\n27.5\n billion for \n100\n% of the equity of Hulu. In the third quarter of 2023, we amended these agreements and agreed, among other things, that the put/call provisions regarding our interest could be exercised in November 2023 (in addition to subsequent periods) and that we would fund our share of prior equity capital calls if the put/call was exercised in November 2023.\nIn November 2023, we exercised our put right requiring Disney to purchase our interest in Hulu. As a result, in the fourth quarter of 2023, Disney paid us $\n8.6\n billion, representing $\n9.2\n billion for our share of Hulu’s minimum equity value, less $\n557\n million for our share of prior capital calls. Additional proceeds for any excess of the fair value of our interest over the $\n9.2\n billion minimum equity value will be due following final determination of Hulu’s fair value pursuant to a third-party appraisal process. In connection with the transaction, Disney also agreed to share with us \n50\n% of the future tax benefits resulting from the purchase of our interest in Hulu. Because we continue to hold our interest in Hulu, the $\n9.2\n billion payment from Disney is treated as an advance on the sale of our interest, which will be recognized following the finalization of the appraisal process. The receipt of the minimum proceeds resulted in a tax gain in 2023. The recorded value of our investment in Hulu of $\n883\n million and $\n863\n million as of December 31, 2024 and 2023, respectively, continues to reflect our historical cost in applying the equity method, and therefore, is less than its fair value.\nIn 2019, we entered into a financing arrangement with a syndicate of banks whereby we received proceeds of $\n5.2\n billion under a term loan facility, which was fully collateralized by the minimum guaranteed proceeds of the put/call option related to our investment in Hulu. The term loan was due at the earlier of March 2024 or upon receipt of the proceeds under the put/call provisions and was repaid in the fourth quarter of 2023.\nWe present the advance on the sale of our investment and the term loan separately in our consolidated balance sheets in the captions “advance on sale of investment” and “collateralized obligation,” respectively.\nMarketable Equity Securities\nWe classify investments with readily determinable fair values that are not accounted for under the equity method as marketable equity securities and the carrying values are primarily presented in other current assets. The changes in fair value of our marketable equity securities between measurement dates are recorded in realized and unrealized gains (losses) on equity securities, net. The fair values of our marketable equity securities are based on Level 1 inputs that use quoted market prices.\nComcast 2024 Annual Report on Form 10-K\n82\nTable of Contents\nComcast Corporation\nNonmarketable Equity Securities \nWe classify investments without readily determinable fair values that are not accounted for under the equity method as nonmarketable equity securities. The accounting guidance requires nonmarketable equity securities to be recorded at cost and adjusted to fair value at each reporting period. However, the guidance allows for a measurement alternative, which is to record the investments at cost, less impairment, if any, and subsequently adjust for observable price changes of identical or similar investments of the same issuer. We generally apply the measurement alternative, adjusting the investments for observable price changes of identical or similar investments of the same issuer, to our nonmarketable equity securities. When an observable event occurs, we estimate the fair values of our nonmarketable equity securities primarily based on Level 2 inputs that are derived from observable price changes of similar securities adjusted for insignificant differences in rights and obligations. The changes in value are recorded in realized and unrealized gains (losses) on equity securities, net.\nOther Investments\nOther investments also includes certain short-term instruments with maturities over three months when purchased, such as commercial paper, certificates of deposit and U.S. government obligations, that are generally accounted for at amortized cost. We had \nno\n short-term instruments as of \nDecember 31, 2024. As of December 31, 2023, these short-term instruments \ntotaled $\n254\n million\n.\n The carrying amounts of these investments approximate their fair values, which are primarily based on Level 2 inputs that use interest rates for instruments with similar terms and remaining maturities. Proceeds from short-term instruments in\n 2024, 2023 and \n2022\n were $\n702\n million, $\n560\n million and $\n1.6\n billion, respectively. Purchases of short-term instruments in\n \n2024, 2023 and \n2022\n were $\n443\n million, $\n506\n million and $\n1.8\n billion, respectively.\nImpairment Testing of Investments\nWe review our investment portfolio, other than our marketable equity securities, each reporting period to determine whether there are identified events or circumstances that would indicate there is a decline in the fair value. For our nonpublic investments, if there are no identified events or circumstances that would have a significant adverse effect on the fair value of the investment, then the fair value is not estimated. For our equity method investments, if an investment is deemed to have experienced an other-than-temporary decline below its cost basis, we reduce the carrying amount of the investment to its quoted or estimated fair value, as applicable, and establish a new cost basis for the investment. For our nonmarketable equity securities, we record the impairment to realized and unrealized gains (losses) on equity securities, net. For our equity method investments, we record the impairment to other income (loss), net.\nConsolidated Variable Interest Entity\nUniversal Beijing Resort\nIn 2018, we entered into an agreement with a consortium of Chinese state-owned companies to build and operate a Universal theme park and resort in Beijing, China (“Universal Beijing Resort”), which opened in September 2021. We own a \n30\n% interest in Universal Beijing Resort and the construction was funded through a combination of debt financing and equity contributions from the partners in accordance with their equity interests. The debt financing, which is being provided by a syndicate of Chinese financial institutions, contains certain covenants and a maximum borrowing limit of ¥\n29.7\n billion RMB (approximately $\n4.2\n billion). The debt financing is secured by the assets of Universal Beijing Resort and the equity interests of the inve\nstors. A\ns of December 31, 2024, Universal Beijing Resort had $\n3.4\n billion of debt outstanding, including $\n3.0\n billion principal amount of a term loan outstanding under the debt financing agreement. As of December 31, 2023, Universal Beijing Resort had $\n3.5\n billion of debt outstanding, including $\n3.1\n billion principal amount of a term loan outstanding under the debt financing agreement.\nWe have concluded that Universal Beijing Resort is a VIE based on its governance structure, and we consolidate it because we have the power to direct activities that most significantly impact its economic performance. There are no liquidity arrangements, guarantees or other financial commitments between us and Universal Beijing Resort, and therefore our maximum risk of financial loss is our \n30\n% interest. Universal Beijing Resort’s results of operations are reported in our Theme Parks segment. Our consolidated statements of cash flows includes the costs of construction and related borrowings in the “construction of Universal Beijing Resort” and “proceeds from borrowings” captions, respectively, and equity contributions from the noncontrolling interests are included in other financing activities. \nAs of December 31, 2024, our consolidated balance sheets included assets and liabilities of Universal Beijing Resort totaling $\n7.3\n billion and $\n7.0\n billion, respectively. As of December 31, 2023, our consolidated balance sheets included assets and liabilities of Universal Beijing Resort totaling $\n7.8\n billion and $\n7.2\n billion, respectively. The assets and liabilities of Universal Beijing Resort primarily consist of property and equipment, operating lease assets and liabilities, and debt.\n83\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nComcast Corporation\nNote 8: Property and Equipment\nDecember 31 (in billions)\nWeighted-Average\nOriginal Useful Life\nas of December 31, 2024\n2024\n2023\nDistribution systems\n \n11\n years \n$\n47.8\n \n$\n45.7\n \nCustomer premise equipment\n \n6\n years \n23.2\n \n25.0\n \nBuildings, theme park infrastructure and leasehold improvements\n \n32\n years \n22.1\n \n20.9\n \nOther equipment\n \n11\n years \n18.1\n \n17.5\n \nConstruction in process\nN/A\n8.6\n \n7.1\n \nLand\nN/A\n2.2\n \n2.2\n \nProperty and equipment, at cost\n122.1\n \n118.4\n \nLess: Accumulated depreciation\n \n59.5\n \n58.7\n \nProperty and equipment, net\n \n$\n62.5\n \n$\n59.7\n \nProperty and Equipment by Geographic Location\nDecember 31 (in billions)\n2024\n2023\nUnited States\n$\n52.6\n \n$\n48.7\n \nOther\n10.0\n \n11.0\n \nProperty and equipment, net\n$\n62.5\n \n$\n59.7\n \nProperty and equipment are stated at cost. We capitalize improvements that extend asset lives and expense repairs and maintenance costs as incurred. We record depreciation using the straight-line method over the asset’s estimated useful life. For assets that are sold or retired, we remove the applicable cost and accumulated depreciation and, unless the gain or loss on disposition is presented separately, we recognize it as a component of depreciation expense. Capital expenditures for the construction of Universal Beijing Resort are presented separately in our consolidated statements of cash flows.\nWe capitalize the costs associated with the construction of and improvements to our HFC network, including scalable infrastructure and line extensions; costs associated with acquiring and deploying new customer premise equipment; and costs associated with installation of our services, including the customer’s connection to our network, in accordance with the accounting guidance related to cable television companies. Costs capitalized include all direct costs for labor and materials, as well as various indirect costs. Costs incurred in connection with subsequent disconnects, and reconnects of previously deployed customer premise equipment, are expensed as they are incurred.\nWe evaluate the recoverability of our property and equipment whenever events or substantive changes in circumstances indicate that the carrying amount may not be recoverable. The evaluation is based on the cash flows generated by the underlying asset groups, including estimated future operating results, trends or other determinants of fair value. If the total of the expected future undiscounted cash flows were less than the carrying amount of the asset group, we would recognize an impairment charge to the extent the carrying amount of the asset group exceeded its estimated fair value. Unless presented separately, the impairment charge is included as a component of depreciation expense.\nCertain of our cable franchise agreements and lease agreements contain provisions requiring us to restore facilities or remove property in the event that the franchise or lease agreement is not renewed. We expect to continually renew our cable franchise agreements and therefore cannot reasonably estimate liabilities associated with such agreements. A remote possibility exists that franchise agreements could be terminated unexpectedly, which could result in us incurring significant expense in complying with restoration or removal provisions. We do not have any material liabilities related to asset retirement obligations recorded in our consolidated financial statements.\nComcast 2024 Annual Report on Form 10-K\n84\nTable of Contents\nComcast Corporation\nNote 9: Goodwill and Intangible Assets\nGoodwill \n(in billions)\nCable\nCommunications\nResidential Connectivity & Platforms\nBusiness Services Connectivity\nMedia\nStudios\nTheme\nParks\nSky\nTotal\nBalance, December 31, 2022\nGoodwill\n$\n16.2\n \n$\n—\n \n$\n—\n \n$\n14.7\n \n$\n3.7\n \n$\n5.8\n \n$\n26.0\n \n$\n66.4\n \nAccumulated impairment losses\n(a)\n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n(\n7.9\n)\n(\n7.9\n)\n$\n16.2\n \n$\n—\n \n$\n—\n \n$\n14.7\n \n$\n3.7\n \n$\n5.8\n \n$\n18.1\n \n$\n58.5\n \nSegment change\n(\n16.2\n)\n27.4\n \n2.2\n \n4.7\n \n—\n \n—\n \n(\n18.1\n)\n—\n \nForeign currency translation and other\n—\n \n0.8\n \n—\n \n0.3\n \n—\n \n(\n0.3\n)\n—\n \n0.8\n \nBalance, December 31, 2023\nGoodwill\n$\n—\n \n$\n34.5\n \n$\n2.2\n \n$\n21.9\n \n$\n3.7\n \n$\n5.4\n \n$\n—\n \n$\n67.8\n \nAccumulated impairment losses\n(a)\n—\n \n(\n6.3\n)\n—\n \n(\n2.2\n)\n—\n \n—\n \n—\n \n(\n8.5\n)\n$\n—\n \n$\n28.2\n \n$\n2.2\n \n$\n19.7\n \n$\n3.7\n \n$\n5.4\n \n$\n—\n \n$\n59.3\n \nForeign currency translation and other\n—\n \n(\n0.4\n)\n—\n \n(\n0.2\n)\n—\n \n(\n0.5\n)\n—\n \n(\n1.0\n)\nBalance, December 31, 2024\nGoodwill\n$\n—\n \n$\n33.9\n \n$\n2.2\n \n$\n21.7\n \n$\n3.7\n \n$\n5.0\n \n$\n—\n \n$\n66.4\n \nAccumulated impairment losses\n(a)\n—\n \n(\n6.1\n)\n—\n \n(\n2.2\n)\n—\n \n—\n \n—\n \n(\n8.2\n)\n$\n—\n \n$\n27.8\n \n$\n2.2\n \n$\n19.5\n \n$\n3.7\n \n$\n5.0\n \n$\n—\n \n$\n58.2\n \n(a) Amounts relate to the 2022 impairment related to Sky, with the 2023 amounts allocated to our new segments on a consistent basis with goodwill. Amounts are impacted by foreign currency translation each period.\nGoodwill is calculated as the excess of the consideration transferred over the identifiable net assets acquired in a business combination and represents the future economic benefits expected to arise from anticipated synergies and intangible assets acquired that do not qualify for separate recognition, including increased footprint, assembled workforce, noncontractual relationships and other agreements. We assess the recoverability of our goodwill annually, or more frequently whenever events or substantive changes in circumstances indicate that the carrying amount of a reporting unit may exceed its fair value. We test goodwill for impairment at the reporting unit level. To determine our reporting units, we evaluate the components one level below the segment level and we aggregate the components if they have similar economic characteristics. We evaluate the determination of our reporting units used to test for impairment periodically or whenever events or substantive changes in circumstances occur. The assessment of recoverability may first consider qualitative factors to determine whether the existence of events or circumstances leads to a determination that it is more likely than not that the fair value of a reporting unit is less than its carrying amount. A quantitative assessment is performed if the qualitative assessment results in a more-likely-than-not determination or if a qualitative assessment is not performed. The quantitative assessment considers whether the carrying amount of a reporting unit exceeds its fair value, in which case an impairment charge is recorded to the extent the reporting unit’s carrying value exceeds its fair value. Unless presented separately, the impairment charge is included as a component of amortization expense. \nIn 2022, we recorded a goodwill impairment of $\n8.1\n billion in our Sky reporting unit. The fair value of the reporting unit was estimated using a discounted cash flow analysis. When performing this analysis, we also considered multiples of earnings from comparable public companies and recent market transactions. The decline in fair value primarily resulted from an increased discount rate and reduced estimated future cash flows as a result of macroeconomic conditions in the Sky territories. The impairment is presented in goodwill and long-lived asset impairments in the consolidated statements of income.\n85\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nComcast Corporation\nIntangible Assets\n \n \n2024\n2023\nDecember 31 (in billions)\nWeighted-Average\nOriginal Useful Life\nas of December 31, 2024\nGross\nCarrying\nAmount\nAccumulated\nAmortization\nGross\nCarrying\nAmount\nAccumulated\nAmortization\nIndefinite-Lived Intangible Assets:\nFranchise rights\nN/A\n$\n59.4\n \n$\n59.4\n \nFCC licenses\nN/A\n2.8\n \n2.8\n \nTotal\n$\n62.2\n \n$\n62.2\n \nFinite-Lived Intangible Assets:\nCustomer relationships\n13\n years \n$\n20.5\n \n$\n(\n15.1\n)\n$\n20.8\n \n$\n(\n13.3\n)\nSoftware\n5\n years\n24.9\n \n(\n16.2\n)\n23.2\n \n(\n14.8\n)\nOther agreements and rights\n27\n years\n11.4\n \n(\n2.7\n)\n11.3\n \n(\n2.2\n)\nTotal\n \n$\n56.8\n \n$\n(\n34.0\n)\n$\n55.3\n \n$\n(\n30.3\n)\nIndefinite-Lived Intangible Assets\nIndefinite-lived intangible assets consist primarily of our cable franchise rights. Our cable franchise rights represent the values we attributed to agreements with state and local authorities that allow access to homes and businesses in cable service areas acquired in business combinations. We do not amortize our cable franchise rights because we have determined that they meet the definition of indefinite-lived intangible assets since there are no legal, regulatory, contractual, competitive, economic or other factors that limit the period over which these rights will contribute to our cash flows. We reassess this determination periodically or whenever events or substantive changes in circumstances occur. The purchase of spectrum rights \nis presented \nseparately in our consolidated statements of cash flows.\nWe assess the recoverability of our cable franchise rights and other indefinite-lived intangible assets annually, or more frequently whenever events or substantive changes in circumstances indicate that the assets might be impaired. We evaluate the unit of account used to test for impairment of our cable franchise rights and other indefinite-lived intangible assets periodically or whenever events or substantive changes in circumstances occur to ensure impairment testing is performed at an appropriate level. The assessment of recoverability may first consider qualitative factors to determine whether it is more likely than not that the fair value of an indefinite-lived intangible asset is less than its carrying amount. A quantitative assessment is performed if the qualitative assessment results in a more-likely-than-not determination or if a qualitative assessment is not performed. When performing a quantitative assessment, we estimate the fair value of our cable franchise rights and other indefinite-lived intangible assets. If the fair value of our cable franchise rights or other indefinite-lived intangible assets were less than the carrying amount, we would recognize an impairment charge for the difference between the estimated fair value and the carrying value of the assets. Unless presented separately, the impairment charge is included as a component of amortization expense.\n \nFinite-Lived Intangible Assets\nFinite-lived intangible assets are subject to amortization and consist primarily of customer relationships acquired in business combinations, software, trade names and intellectual property rights. Our finite-lived intangible assets are amortized primarily on a straight-line basis over their estimated useful life or the term of the associated agreement.\nThe table below presents the estimated amortization expense of our customer relationships and other agreements and rights, including trade names and intellectual property rights. \nEstimated Amortization Expense \n(in billions)\n \n \n2025\n$\n3.0\n \n2026\n$\n2.8\n \n2027\n$\n0.6\n \n2028\n$\n0.5\n \n2029\n$\n0.5\n \nComcast 2024 Annual Report on Form 10-K\n86\nTable of Contents\nComcast Corporation\nWe capitalize direct development costs associated with internal-use software, including external direct costs of material and services and payroll costs for employees devoting time to these software projects. We also capitalize costs associated with arrangements that constitute the purchase of, or convey a license to, software licenses. We generally amortize them on a straight-line basis over a period not to exceed \nfive years\n. We expense maintenance and training costs, as well as costs incurred during the preliminary stage of a project, as they are incurred. We capitalize initial operating system software costs and amortize them over the life of the associated hardware. \nWe evaluate the recoverability of our finite-lived intangible assets whenever events or substantive changes in circumstances indicate that the carrying amount may not be recoverable. The evaluation is based on the cash flows generated by the underlying asset groups, including estimated future operating results, trends or other determinants of fair value. If the total of the expected future undiscounted cash flows were less than the carrying amount of the asset group, we would recognize an impairment charge to the extent the carrying amount of the asset group exceeded its estimated fair value. Unless presented separately, the impairment charge is included as a component of amortization expense.\nIn 2022, in connection with our annual goodwill impairment assessment, we also recorded impairments of intangible assets, which primarily related to customer relationship assets resulting from our Sky acquisition. These impairments totaled $\n485\n million and are presented in \ngoodwill and long-lived asset impairments\n in the consolidated statements of income.\n \nNote 10: Employee Benefit Plans\nDeferred Compensation Plans\nAs of and for the year ended December 31 (in millions)\n2024\n2023\n2022\nBenefit obligation\n$\n4,812\n \n$\n4,507\n \n$\n4,158\n \nInterest expense\n$\n370\n \n$\n341\n \n$\n272\n \nWe maintain unfunded, nonqualified deferred compensation plans for certain members of management and nonemployee directors. The amount of compensation deferred by each participant is based on participant elections. Participant accounts are credited with income primarily based on a fixed annual rate. Participants are eligible to receive distributions from their account based on elected deferral periods that are consistent with the plans and applicable tax law.\nWe have purchased life insurance policies to recover a portion of the future payments related to our deferred compensation plans. As of December 31, 2024 and 2023, the cash surrender value of these policies, which is recorded to other noncurrent assets, net, was $\n566\n million and $\n512\n million, respectively.\nPension and Postretirement Benefit Plans\nWe sponsor several 401(k) defined contribution retirement plans that allow eligible employees to contribute a portion of their compensation through payroll deductions in accordance with specified plan guidelines. We make contributions to the plans that include matching a percentage of the employees’ contributions up to certain limits.\n In 2024, 2023 and 2022, expenses related to these plans totaled $\n661\n million, $\n650\n million and $\n632\n million, respectively. \nWe participate in various multiemployer benefit plans, including pension and postretirement benefit plans, that cover some of our employees and temporary employees who are represented by labor unions. We also participate in other multiemployer benefit plans that provide health and welfare and retirement savings benefits to active and retired participants. If we cease to be obligated to make contributions or were to otherwise withdraw from participation in any of these plans, applicable law would require us to fund our allocable share of the unfunded vested benefits, which is known as a withdrawal liability. In addition, actions taken by other participating employers may lead to adverse changes in the financial condition of one of these plans, which could result in an increase in our withdrawal liability.\n Total contributions we made to multiemployer benefit plans and any potential withdrawal liabilities were not material in any of the periods presented.\n87\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nComcast Corporation\nNote 11: Equity\nCommon Stock\nIn the aggregate, holders of our Class A common stock have 66\n2\n/\n3\n% of the voting power of our common stock and holders of our Class B common stock have 33\n1\n/\n3\n% of the voting power of our common stock, which percentage is generally non-dilutable under the terms of our articles of incorporation. Each share of our Class B common stock is entitled to \n15\n votes. The number of votes held by each share of our Class A common stock depends on the number of shares of Class A and Class B common stock outstanding at any given time. The 33\n1\n/\n3\n% aggregate voting power of our Class B common stock cannot be diluted by additional issuances of any other class of common stock. Our Class B common stock is convertible, share for share, into Class A common stock, subject to certain restrictions.\nWe present excise tax payments related to repurchases of common stock within repurchases of common stock under repurchase program and employee plans in the consolidated statements of cash flows.\nShares of Common Stock Outstanding\n(in millions)\nClass A\nClass B\nBalance, December 31, 2021\n4,524\n \n9\n \nStock compensation plans\n12\n \n—\n \nRepurchases and retirements of common stock\n(\n332\n)\n—\n \nEmployee stock purchase plans\n7\n \n—\n \nBalance, December 31, 2022\n4,211\n \n9\n \nStock compensation plans\n14\n \n—\n \nRepurchases and retirements of common stock\n(\n262\n)\n—\n \nEmployee stock purchase plans\n7\n \n—\n \nBalance, December 31, 2023\n3,969\n \n9\n \nStock compensation plans\n14\n \n—\n \nRepurchases and retirements of common stock\n(\n212\n)\n—\n \nEmployee stock purchase plans\n6\n \n—\n \nBalance, December 31, 2024\n3,778\n \n9\n \nWeighted-Average Common Shares Outstanding\nYear ended December 31 (in millions)\n2024\n2023\n2022\nWeighted-average number of common shares outstanding – basic\n3,885\n \n4,122\n \n4,406\n \nEffect of dilutive securities\n24\n \n25\n \n24\n \nWeighted-average number of common shares outstanding\n \n– diluted\n3,908\n \n4,148\n \n4,430\n \nAntidilutive securities\n184\n \n169\n \n176\n \nWeighted-average common shares outstanding used in calculating diluted earnings per common share attributable to Comcast Corporation shareholders (“diluted EPS”) considers the impact of potentially dilutive securities using the treasury stock method. Our potentially dilutive securities include potential common shares related to our stock options and our restricted share units (“RSUs”). Diluted EPS excludes the impact of potential common shares related to our stock options in periods in which the combination of the option exercise price and the associated unrecognized compensation expense is greater than the average market price of our common stock.\n \nAntidilutive securities represent the number of potential common shares related to share-based compensation awards that were excluded from diluted EPS because their effect would have been antidilutive.\nAccumulated Other Comprehensive Income (Loss)\nDecember 31 (in millions)\n2024\n2023\nCumulative translation adjustments\n$\n(\n2,474\n)\n$\n(\n1,596\n)\nDeferred gains (losses) on cash flow hedges\n106\n \n49\n \nUnrecognized gains (losses) on employee benefit obligations and other\n325\n \n293\n \nAccumulated other comprehensive income (loss), net of deferred taxes\n$\n(\n2,043\n)\n$\n(\n1,253\n)\nComcast 2024 Annual Report on Form 10-K\n88\nTable of Contents\nComcast Corporation\nNote 12: Share-Based Compensation\nYear ended December 31 (in millions)\n2024\n2023\n2022\nShare-based compensation expense\n$\n1,069\n \n$\n1,021\n \n$\n1,100\n \nRelated income tax benefit\n$\n222\n \n$\n203\n \n$\n248\n \nOur share-based compensation plans consist primarily of awards of RSUs and stock options to certain employees and directors as part of our long-term incentive compensation structure. Awards generally vest over a period of \n5\n years and, in the case of stock options, have a \n10\n year term. RSUs include performance stock units awarded to certain senior executives with vesting after \n3\n years based upon the achievement of certain performance conditions. These performance stock units are not material to our consolidated results of operations in any period presented. As of December 31, 2024, virtually all of our stock options outstanding were net settled stock options, which result in fewer shares being issued and no cash proceeds being received by us when the options are exercised. Additionally, eligible employees may purchase shares of our common stock at a discount under our employee stock purchase plans. \nStock Options and Restricted Share Units\nAs of December 31, 2024, unless otherwise stated (in millions, except per share data)\nStock\nOptions\nRSUs\nAwards granted during 2024\n4\n \n35\n \nWeighted-average exercise price of awards granted during 2024\n$\n40.72\n \n \nStock options outstanding and unvested RSUs\n224\n \n62\n \nWeighted-average exercise price of stock options outstanding\n$\n41.70\n \nWeighted-average fair value at grant date of unvested RSUs\n \n$\n42.11\n \nThe cost associated with our share-based compensation is based on an award’s estimated fair value at the date of grant and is recognized over the period in which any related services are provided. RSUs are primarily valued based on the closing price of our common stock on the date of grant and are discounted for the lack of dividends, if any, during the vesting period. We use the Black-Scholes option pricing model to estimate the fair value of stock option awards.\n \nThe table below presents the weighted-average fair value on the date of grant of RSUs and stock options awarded under our various plans and the related weighted-average valuation assumptions. \nYear ended December 31\n2024\n2023\n2022\nRSUs fair value\n$\n42.23\n \n$\n37.14\n \n$\n45.20\n \nStock options fair value\n$\n9.93\n \n$\n8.41\n \n$\n8.77\n \nStock Option Valuation Assumptions:\nDividend yield\n2.9\n \n%\n3.2\n \n%\n2.4\n \n%\nExpected volatility\n24.8\n \n%\n26.2\n \n%\n25.0\n \n%\nRisk-free interest rate\n4.2\n \n%\n4.2\n \n%\n1.8\n \n%\nExpected option life (in years)\n5.1\n5.9\n5.8\nAs of December 31, 2024, we had unrecognized pretax compensation expense of $\n2.1\n billion related to unvested RSUs and unvested stock options that will be recognized over a weighted-average period of approximately \n1.6\n years.\n89\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nComcast Corporation\nNote 13: Supplemental Financial Information\nCash Payments for Interest and Income Taxes\nYear ended December 31 (in millions)\n2024\n2023\n2022\nInterest\n$\n3,657\n \n$\n3,711\n \n$\n3,413\n \nIncome taxes\n(a)(b)\n$\n7,096\n \n$\n5,107\n \n$\n5,265\n \n(a) Cash payments for income taxes in 2024 includes $\n1.7\n billion related to the purchase of third-party transferable tax credits.\n(b) Changes in other operating assets and liabilities in the consolidated statements of cash flows included an increase in current tax receivables and a decrease in current taxes payable for the year ended December 31, 2024, and an increase in current taxes payable for the year ended December 31, 2023. See Notes 5 and 7.\nNoncash Activities\nDuring 2024:\n•\nwe acquired $\n2.8\n billion of property and equipment and intangible assets that were accrued but unpaid\n•\nwe recorded a liability of $\n1.2\n billion for a quarterly cash dividend of $\n0.31\n per common share paid in January 2025\nDuring 2023:\n•\nwe acquired $\n2.1\n billion of property and equipment and intangible assets that were accrued but unpaid\n•\nwe recorded a liability of $\n1.2\n billion for a quarterly cash dividend of $\n0.29\n per common share paid in January 2024\nDuring 2022:\n•\nwe acquired $\n2.0\n billion of property and equipment and intangible assets that were accrued but unpaid\n•\nwe recorded a liability of $\n1.1\n billion for a quarterly cash dividend of $\n0.27\n per common share paid in January 2023\nCash, Cash Equivalents and Restricted Cash\nThe following table provides a reconciliation of cash, cash equivalents and restricted cash reported in the consolidated balance sheets to the total of the amounts reported in our consolidated statements of cash flows.\nDecember 31 (in millions)\n2024\n2023\nCash and cash equivalents\n$\n7,322\n \n$\n6,215\n \nRestricted cash included in other current assets and other noncurrent assets, net\n55\n \n67\n \nCash, cash equivalents and restricted cash, end of year\n$\n7,377\n \n$\n6,282\n \nOur cash equivalents consist primarily of money market funds and U.S. government obligations, as well as commercial paper and certificates of deposit with maturities of three months or less when purchased. The carrying amounts of our cash equivalents approximate their fair values, which are primarily based on Level 1 inputs.\n \nNote 14: Commitments and Contingencies\nLicensed Content \nWe have significant fixed-price purchase obligations related to long-term agreements for licensed content. Refer to Note 4 for additional information. \nLeases\nOur leases consist primarily of real estate, vehicles and other equipment. We determine if an arrangement is a lease at inception. Lease assets and liabilities are recognized upon commencement of the lease based on the present value of the future minimum lease payments over the lease term. The lease term includes options to extend the lease when it is reasonably certain that we will exercise that option. We generally use our incremental borrowing rate based on information available at the commencement of the lease in determining the present value of future payments. The lease asset also includes any lease payments made and initial direct costs incurred and excludes lease incentives. Lease assets and liabilities are not recorded for leases with an initial term of one year or less. \nComcast 2024 Annual Report on Form 10-K\n90\nTable of Contents\nComcast Corporation\nFor our operating leases recorded in the balance sheets, lease expense is based on the future minimum lease payments recognized on a straight-line basis over the term of the lease plus any variable lease costs.\n In 2024, 2023 and 2022, operating lease expenses, inclusive of short-term and variable lease expenses, recognized in our consolidated statements of income were each $\n1.2\n billion.\nOperating Lease Assets and Liabilities Recorded in our Consolidated Balance Sheet\nDecember 31 (in millions)\n2024\n2023\nOther noncurrent assets, net\n$\n5,524\n \n$\n5,786\n \nAccrued expenses and other current liabilities\n$\n751\n \n$\n748\n \nOther noncurrent liabilities\n$\n5,569\n \n$\n5,838\n \nFuture Minimum Lease Commitments for Operating Leases\n(in millions)\nDecember 31,\n2024\n2025\n$\n965\n \n2026\n896\n \n2027\n787\n \n2028\n624\n \n2029\n406\n \nThereafter\n6,163\n \nTotal future minimum lease payments\n9,840\n \nLess: imputed interest \n(\n3,521\n)\nTotal liability\n$\n6,319\n \nThe weighted-average remaining lease terms for operating leases and the weighted-average discount rates used to calculate our operating lease liabilities as of December 31, 2024 were \n17\n years and \n4.2\n%, respectively, and as of December 31, 2023 were \n17\n years and \n4.1\n%, respectively.\nIn 2024, 2023 and 2022, cash payments for operating leases recorded in the consolidated balance sheets were $\n1.0\n billion, $\n963\n million and $\n965\n million, respectively. Lease assets and liabilities associated with operating leases entered into or modified were not material in any period presented. \nContractual Obligation \nWe are party to a contractual obligation that involves an interest held by a third party in the revenue of certain theme parks. The arrangement provides the counterparty with the right to periodic payments associated with current period revenue which are recorded as an operating expense, and beginning in June 2017, the option to require NBCUniversal to purchase the interest for cash in an amount based on a contractual formula. The contractual formula is based on an average of specified historical theme park revenue at the time of exercise, which amount could be significantly higher than our carrying value. As of December 31, 2024, our carrying value was $\n1.1\n billion, and the estimated value of the contractual obligation was $\n1.8\n billion based on inputs to the contractual formula as of that date.\nContingencies \nWe are subject to legal proceedings and claims that arise in the ordinary course of our business. While the amount of ultimate liability with respect to such proceedings and claims is not expected to materially affect our results of operations, cash flows or financial position, any such legal proceedings or claims could be time-consuming and injure our reputation.\n91\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nItem 9: Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.\nItem 9A: Controls and Procedures\nConclusions regarding disclosure controls and procedures \nOur principal executive and principal financial officers, after evaluating the effectiveness of our disclosure controls and procedures (as defined in Exchange Act Rules 13a-15(e) and 15d-15(e)) as of the end of the period covered by this report, have concluded that, based on the evaluation of these controls and procedures required by paragraph (b) of Exchange Act Rules 13a-15 or 15d-15, such disclosure controls and procedures were effective. \nManagement’s annual report on internal control over financial reporting \nRefer to Management’s Report on Internal Control Over Financial Reporting on page 57.\nAttestation report of the registered public accounting firm\nRefer to Report of Independent Registered Public Accounting Firm on page 58.\nChanges in internal control over financial reporting \nThere were no changes in internal control over financial reporting identified in connection with the evaluation required by paragraph (d) of Exchange Act Rules 13a-15 or 15d-15 that occurred during the last fiscal quarter that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nItem 9B: \nOther Information\nOn January 28, 2025, the Company’s Board of Directors adopted Amended and Restated Bylaws of the Company, effective immediately. The Amended and Restated Bylaws were amended to specify that proposals of business that would have an adverse effect on the rights, powers or preferences of a class of capital stock that require consent of one or more classes of stock in order to be effected may be made only by the Board or holder(s) of any class of capital stock that would be adversely affected. The Amended and Restated Bylaws also incorporate other minor clean-up and conforming changes. The foregoing description is qualified in its entirety by reference to the Amended and Restated Bylaws, which are filed as Exhibit 3.2 to this Annual Report on Form 10-K and incorporated herein by reference.\nItem 9C: Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\nComcast 2024 Annual Report on Form 10-K\n92\nTable of Contents\nPart III\nItem 10: Directors, Executive Officers and Corporate Governance\nExcept for the information regarding executive officers required by Item 401 of Regulation S-K, we incorporate the information required by this item by reference to our definitive proxy statement for our annual meeting of shareholders. We refer to this proxy statement as the 2025 Proxy Statement.\nThe term of office of each of our executive officers continues until his successor is selected and qualified or until his earlier death, resignation or removal. The following table sets forth information concerning our executive officers, including their ages, positions and tenure, as of the date hereof.\nName\nAge\nOfficer Since\nPosition with Comcast\nBrian L. Roberts\n65\n1986\nChairman and Chief Executive Officer\nMichael J. Cavanagh\n59\n2015\nPresident\nJason S. Armstrong\n48\n2023\nChief Financial Officer\nJennifer Khoury\n51\n2023\nChief Communications Officer\nDaniel C. Murdock\n51\n2017\nExecutive Vice President; Chief Accounting Officer and Controller\nThomas J. Reid\n60\n2019\nChief Legal Officer and Secretary\nBrian L. Roberts\n has served as a director and as Chairman of the Board and Chief Executive Officer for more than five years. Mr. Roberts previously served as President until October 2022. As of December 31, 2024, Mr. Roberts had sole voting power over approximately 33\n1\n/\n3\n% of the combined voting power of our two classes of common stock. He is a son of our late founder, Mr. Ralph J. Roberts. \nMichael J. Cavanagh\n has served as President since October 2022 and Chief Financial Officer between July 2015 and January 2023. Prior to joining our company, Mr. Cavanagh had been Co-President and Co-Chief Operating Officer for The Carlyle Group, a global investment firm, since 2014. Prior to that, Mr. Cavanagh was the Co-Chief Executive Officer of the Corporate & Investment Bank of JPMorgan Chase & Co. from 2012 until 2014; the Chief Executive Officer of JPMorgan Chase & Co.’s Treasury & Securities Services business from 2010 to 2012; and the Chief Financial Officer of JPMorgan Chase & Co. from 2004 to 2010.\nJason S. Armstrong\n has served as Chief Financial Officer since January 2023. He previously served as Treasurer between July 2020 and October 2023 and as Deputy Chief Financial Officer between January 2022 and January 2023, and held various other senior positions since joining our company in 2014, including as Chief Financial Officer of Sky Limited and as Senior Vice President of Investor Relations. Prior to that, Mr. Armstrong spent 14 years at Goldman Sachs & Co. LLC where he most recently served as Managing Director, Deputy Business Unit Leader of the firm’s Technology, Media and Telecommunications Research Group.\nJennifer Khoury\n has served as Chief Communications Officer since February 2020. She had held various other senior positions since joining our company in 1999, including Senior Vice President of Corporate and Digital Communications, leading communications for Comcast Cable and the corporation’s digital and social media. Previously, Ms. Khoury led communications, public affairs and social responsibility programs and campaigns for AT&T Broadband and MediaOne and served as a strategic consultant for ML Strategies, LLC.\nDaniel C. Murdock\n has served as an Executive Vice President since March 2020, Chief Accounting Officer since March 2017 and Controller since July 2015. Prior to joining our company, Mr. Murdock had been with the U.S. Securities and Exchange Commission where he served as the Deputy Chief Accountant in the agency’s Office of the Chief Accountant since 2013. Prior to that, he was Deloitte & Touche’s Audit/Industry Professional Practice Director for media and entertainment.\nThomas J. Reid\n has served as Chief Legal Officer and Secretary since April 2019. Prior to joining our company, Mr. Reid had served as the Chairman and Managing Partner of Davis Polk & Wardwell LLP, a global law firm, since 2011. Prior to that, Mr. Reid was a partner at Davis Polk & Wardwell LLP from 2003 to 2011 and a Managing Director in the Investment Banking Division of Morgan Stanley from 2000 to 2003.  \nItem 11: Executive Compensation\nWe incorporate the information required by this item by reference to our 2025 Proxy Statement.\n93\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\nItem 12: Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nWe incorporate the information required by this item by reference to our 2025 Proxy Statement.\nItem 13: Certain Relationships and Related Transactions, and Director Independence\nWe incorporate the information required by this item by reference to our 2025 Proxy Statement.\nItem 14: Principal Accountant Fees and Services\nWe incorporate the information required by this item relating to our principal accountant, Deloitte & Touche LLP (PCAOB ID No. \n34\n), by reference to our 2025 Proxy Statement.\nComcast 2024 Annual Report on Form 10-K\n94\nTable of Contents\nPart IV\nItem 15: Exhibits and Financial Statement Schedules\n(a) Our consolidated financial statements are filed as a part of this report on Form 10-K in Item 8, Financial Statements and Supplementary Data, and a list of Comcast’s consolidated financial statements are found on page 56 of this report. Financial statement schedules are omitted because the required information is not applicable, or because the information required is included in the consolidated financial statements and notes thereto.\n(b) Exhibits required to be filed by Item 601 of Regulation S-K (all of which are under Commission File No. 001-32871, except as otherwise noted):\n3.1\nAmended and Restated Articles of Incorporation of Comcast Corporation (incorporated by reference to Exhibit 3.1 to Comcast’s Current Report on Form 8-K filed on December 15, 2015).\n3.1.1\nCertificate of a Change of Registered Office Provider (incorporated by reference to Exhibit 3.1.1 to Comcast’s Annual Report on Form 10-K for the year ended December 31, 2023).\n3.2\nAmended and Restated By-Laws of Comcast Corporation.\n4.1\nSpecimen Class A Common Stock Certificate (incorporated by reference to Exhibit 4.1 to Comcast’s Annual Report on Form 10-K for the year ended December 31, 2002).\n4.2\nIndenture, dated January 7, 2003, between Comcast Corporation, the subsidiary guarantor party thereto, and The Bank of New York Mellon (f/k/a The Bank of New York), as trustee (incorporated by reference to Exhibit 4.4 to Comcast’s Annual Report on Form 10-K for the year ended December 31, 2008).\n4.3\nFirst Supplemental Indenture, dated March 25, 2003, to the Indenture between Comcast Corporation, the subsidiary guarantors party thereto, and The Bank of New York Mellon (f/k/a The Bank of New York), as trustee, dated January 7, 2003 (incorporated by reference to Exhibit 4.5 to Comcast’s Annual Report on Form 10-K for the year ended December 31, 2008).\n4.4\nSecond Supplemental Indenture, dated August 31, 2009, to the Indenture between Comcast Corporation, the subsidiary guarantors party thereto, and The Bank of New York Mellon, as Trustee, dated January 7, 2003, as supplemented by a First Supplemental Indenture dated March 25, 2003 (incorporated by reference to Exhibit 4.1 to Comcast’s Current Report on Form 8-K filed on September 2, 2009).\n4.5\nThird Supplemental Indenture, dated March 27, 2013, to the Indenture between Comcast Corporation, the subsidiary guarantors party thereto, and The Bank of New York Mellon (f/k/a The Bank of New York), as trustee, dated January 7, 2003, as supplemented by a First Supplemental Indenture dated March 25, 2003 and a second Supplemental Indenture dated August 31, 2009 (incorporated by reference to Exhibit 4.4 to Comcast’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2013).\n4.6\nFourth Supplemental Indenture, dated October 1, 2015, to the Indenture dated January 7, 2003 between Comcast Corporation, the subsidiary guarantors party thereto, and The Bank of New York Mellon (f/k/a The Bank of New York), as trustee, as supplemented by a First Supplemental Indenture dated March 25, 2003, a second Supplemental Indenture dated August 31, 2009 and a Third Supplemental Indenture dated March 27, 2013 (incorporated by reference to Exhibit 4.1 to Comcast’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2015).\n4.7\nSenior Indenture dated September 18, 2013, among Comcast Corporation, the guarantors party thereto and The Bank of New York Mellon, as trustee (incorporated by reference to Exhibit 4.3 to Comcast’s Registration Statement on Form S-3 filed September 18, 2013).\n4.8\nFirst Supplemental Indenture dated as of November 17, 2015, to the Senior Indenture dated September 18, 2013, among Comcast Corporation, the guarantors party thereto, and The Bank of New York Mellon, as trustee (incorporated by reference to Exhibit 4.4 to Post Effective Amendment No. 2 to Comcast’s Registration Statement on Form S-3 filed November 23, 2015).\n4.9\nSecond Supplemental Indenture dated as of July 29, 2022, to the Senior Indenture dated September 18, 2013, among Comcast Corporation, the guarantors party thereto, and The Bank of New York Mellon, as trustee, as supplemented by a First Supplemental Indenture dated November 17, 2015 (incorporated by reference to Exhibit 4.4 to Comcast’s Registration Statement on Form S-3 filed July 29, 2022).\n4.10\nIndenture, dated as of April 30, 2010, between NBC Universal, Inc. (n/k/a NBCUniversal Media, LLC) and The Bank of New York Mellon, as trustee (incorporated by reference to Exhibit 4 to the Registration Statement on Form S-4 of NBCUniversal Media, LLC (Commission File No. 333-174175) filed on May 13, 2011).\n95\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\n4.11\nFirst Supplemental Indenture, dated March 27, 2013, to the Indenture between NBCUniversal Media, LLC (f/k/a NBC Universal, Inc.) and The Bank of New York Mellon, as trustee, dated April 30, 2010 (incorporated by reference to Exhibit 4.3 to Comcast’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2013).\n4.12\nSecond Supplemental Indenture, dated October 1, 2015, to the Indenture dated April 30, 2010 between NBC Universal, Inc. (n/k/a NBCUniversal Media, LLC) and The Bank of New York Mellon, as trustee, as supplemented by a First Supplemental Indenture dated March 27, 2013 (incorporated by reference to Exhibit 4.2 to Comcast’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2015).\n4.13\nTrust Deed dated September 5, 2014 among BSKYB Finance UK plc, British Sky Broadcasting Group plc, the initial guarantors party thereto and BNY Mellon Corporate Trustee Services Limited, as trustee (incorporated by reference to Exhibit 4.13 to Comcast’s Annual Report on Form 10-K for the year ended December 31, 2018).\n4.14\nSupplemental Trust Deed dated March 18, 2015 among Sky Group Finance plc (f/k/a BSKYB Finance UK plc), Sky plc (f/k/a British Sky Broadcasting Group plc), the initial guarantors party thereto and BNY Mellon Corporate Trustee Services Limited, as trustee (incorporated by reference to Exhibit 4.14 to Comcast’s Annual Report on Form 10-K for the year ended December 31, 2018).\n4.15\nDescription of Comcast Corporation’s securities registered pursuant to Section 12 of the Securities Exchange Act.\nCertain instruments defining the rights of holders of long-term obligation of the registrant and certain of its subsidiaries (the total amount of securities authorized under each of which does not exceed ten percent of the total assets of the registrant and its subsidiaries on a consolidated basis), are omitted pursuant to Item 601(b)(4)(iii)(A) of Regulation S-K. We agree to furnish copies of any such instruments to the SEC upon request.\n10.\n1\nCredit Agreement dated as of May 17, 2024, among Comcast Corporation, the financial institutions party thereto, JPMorgan Chase Bank, N.A., as administrative agent, Citibank, N.A., as syndication agent, and Bank of America, N.A., Barclays Bank PLC, Mizuho Bank, Ltd., Morgan Stanley MUFG Partners, LLC and Wells Fargo Bank, National Association, as co-documentation agents (incorporated by reference to Exhibit 10.1 to Comcast’s Current Report on Form 8-K filed on May 17, 2024). \n10.\n2\n*\nComcast Select Deferred Compensation Plan, as amended and restated effective October 12, 2021 (incorporated by reference to Exhibit 10.3 to Comcast’s Annual Report on Form 10-K for the year ended December 31, 2021).\n10.\n3\n*\nComcast Corporation 2003 Stock Option Plan, as amended and restated April 10, 2020 (incorporated by reference to Exhibit 10.4 to Comcast’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2020). \n10.\n4\n*\nComcast Corporation 2002 Deferred Compensation Plan, as amended and restated effective March 1, 2021 (incorporated by reference to Exhibit 10.2 to Comcast’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2021).\n10.\n5\n*\nComcast Corporation 2005 Deferred Compensation Plan, as amended and restated effective May 14, 2024.\n10.\n6\n*\nComcast Corporation 2002 Restricted Stock Plan, as amended and restated effective May 14, 2024.\n10.\n7\n*\nComcast Corporation 2006 Cash Bonus Plan, as amended and restated effective February 18, 2015 (incorporated by reference to Exhibit 10.11 to Comcast’s Annual Report on Form 10-K for the year ended December 31, 2015).\n10.\n8\n*\nComcast Corporation Non-Employee Director Compensation Plan, as amended and restated effective July 11, 2023 (incorporated by reference to Exhibit 10.3 to Comcast’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2023).\n10.\n9\n*\nComcast Corporation 2002 Employee Stock Purchase Plan, as amended and restated effective May 14, 2024.\n10.1\n0\n*\nComcast-NBCUniversal 2011 Employee Stock Purchase Plan, as amended and restated effective May 14, 2024. \n10.1\n1\n*\nComcast Corporation 2023 Omnibus Equity Incentive Plan, effective June 7, 2023 (incorporated by reference to Exhibit 10.1 to Comcast’s Current Report on Form 8-K filed on June 9, 2023).\n10.1\n2\n*\nEmployment Agreement with Brian L. Roberts, dated as of July 26, 2017 (incorporated by reference to Exhibit 10.2 to Comcast’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2017).\n10.1\n3\n*\nAmendment No. 1 to Employment Agreement with Brian L. Roberts, dated as of December 16, 2019 (incorporated by reference to Exhibit 10.20 to Comcast’s Annual Report on Form 10-K for the year ended December 31, 2019).\n10.1\n4\n*\nEmployment Agreement dated as of December 27, 2022 between Comcast Corporation and Michael J. Cavanagh (incorporated by reference to Exhibit 10.15 to Comcast’s Annual Report on Form 10-K for the year ended December 31, 2022).\nComcast 2024 Annual Report on Form 10-K\n96\nTable of Contents\n10.1\n5\n*\nEmployment Agreement dated as of January 6, 2023 between Comcast Corporation and Jason S. Armstrong (incorporated by reference to Exhibit 10.16 to Comcast’s Annual Report on Form 10-K for the year ended December 31, 2022).\n10.1\n6\n*\nEmployment Agreement between Comcast Corporation and Jennifer Khoury, dated as of December 31, 2022 (incorporated by reference to Exhibit 10.2 to Comcast’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2024).\n10.\n1\n7\n*\nEmployment Agreement between Comcast Corporation and Thomas J. Reid, dated as of April 17, 2024 (incorporated by reference to Exhibit 10.3 to Comcast’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2024).\n10.\n1\n8\n*\nForm of Non-Qualified Stock Option and Long-Term Incentive Awards Summary Schedule under the Comcast Corporation 2003 Stock Option Plan.\n10.\n19\n*\nForm of Non-Qualified Stock Option and Long-Term Incentive Awards Summary Schedule under the Comcast Corporation 2023 Omnibus Equity Incentive Plan.\n10.2\n0\n*\nForm of Performance-Based Restricted Stock Unit Award and Long-Term Incentive Awards Summary Schedule under the Comcast Corporation 2002 Restricted Stock Plan (incorporated by reference to Exhibit 10.37 to Comcast’s Annual Report on Form 10-K for the year ended December 31, 2020).\n10.2\n1\n*\nForm of Performance-Based Stock Option Award (incorporated by reference to Exhibit 10.24 to Comcast’s Annual Report on Form 10-K for the year ended December 31, 2022).\n10.2\n2\n*\nForm of Performance-Based Restricted Stock Unit Award and Long-Term Incentive Awards Summary Schedule.\n10.2\n3\n*\nForm of Time-Based Restricted Stock Unit Award.\n10.2\n4\n*\nForm of Airplane Time Sharing Agreement (incorporated by reference to Exhibit 10.60 to Comcast’s Annual Report on Form 10-K for the year ended December 31, 2014).\n10.2\n5\n*\nForm of Director Indemnification Agreement (incorporated by reference to Exhibit 10.3 to Comcast’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2009).\n10.2\n6\nFourth Amended and Restated\n \nShareholders Agreement, dated as of April 15, 2022, among Atairos Group, Inc., Comcast AG Holdings, LLC, Atairos Partners, L.P., Atairos Management, L.P. and Comcast Corporation (incorporated by reference to Exhibit 10.27 to Comcast’s Annual Report on Form 10-K for the year ended December 31, 2022).\n10.\n27\nFirst Amendment dated June 2, 2023 to Fourth Amended and Restated Shareholders Agreement, dated as of April 15, 2022, among Atairos Group, Inc., Comcast AG Holdings, LLC, Atairos Partners, L.P. and Atairos Management, L.P. (incorporated by reference to Exhibit 10.28 to Comcast’s Annual Report on Form 10-K for the year ended December 31, 2023).\n10.\n28\nSecond Amendment dated February 26, 2024 to Fourth Amended and Restated Shareholders Agreement, dated as of April 15, 2022, among Atairos Group, Inc., Comcast AG Holdings, LLC, Atairos Partners, L.P. and Atairos Management, L.P.\n10.\n29\nConsultant Agreement, dated as of January 20, 1987, between Steven Spielberg and Universal City Florida Partners (incorporated by reference to Exhibit 10.49 to the Registration Statement on Form S-4 of Universal City Development Partners, Ltd. and UCDP Finance, Inc. filed on January 20, 2010 (File No. 333-164431)).\n10.3\n0\nAmendment dated February 5, 2001 to the Consultant Agreement dated as of January 20, 1987, between the Consultant and Universal City Florida Partners (incorporated by reference to Exhibit 10.50 to the Registration Statement on Form S-4 of Universal City Development Partners, Ltd. and UCDP Finance, Inc. filed on January 20, 2010 (File No. 333-164431)).\n10.3\n1\nAmendment to the Consultant Agreement, dated as of October 18, 2009, between Steven Spielberg, Diamond Lane Productions, Inc. and Universal City Development Partners, Ltd. (incorporated by reference to Exhibit 10.52 to the Registration Statement on Form S-4 of Universal City Development Partners, Ltd. and UCDP Finance, Inc. filed on January 20, 2010 (File No. 333-164431)).\n10.3\n2\nLetter Agreement dated July 15, 2003, among Diamond Lane Productions, Vivendi Universal Entertainment LLLP and Universal City Development Partners, Ltd. (incorporated by reference to Exhibit 10.51 to the Registration Statement on Form S-4 of Universal City Development Partners, Ltd. and UCDP Finance, Inc. filed on January 20, 2010 (File No. 333-164431)).\n19\nComcast Corporation Insider Trading Policies.\n21\nList of subsidiaries.\n97\nComcast 2024 Annual Report on Form 10-K\nTable of Contents\n22\nSubsidiary guarantors and issuers of guaranteed securities and affiliates whose securities collateralize securities of the registrant.\n23\nConsent of Deloitte & Touche LLP.\n31\nCertification of Chief Executive Officer and Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32\nCertification of Chief Executive Officer and Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n97\nComcast Corporation Recoupment Policy (incorporated by reference to Exhibit 97 to Comcast’s Annual Report on Form 10-K for the year ended December 31, 2023).\n101\nThe following financial statements from Comcast Corporation’s Annual Report on Form 10-K for the year ended December 31, 2024, filed with the Securities and Exchange Commission on January 31, 2025, formatted in Inline Extensible Business Reporting Language (iXBRL): (1) the Consolidated Statement of Income; (2) the Consolidated Statement of Comprehensive Income; (3) the Consolidated Statement of Cash Flows; (4) the Consolidated Balance Sheet; (5) the Consolidated Statement of Changes in Equity; and (6) the Notes to Consolidated Financial Statements.\n104\nCover Page Interactive Data File (embedded within the iXBRL document)\n*\nConstitutes a management contract or compensatory plan or arrangement.\nItem 16: Form 10-K Summary\nNone.\nComcast 2024 Annual Report on Form 10-K\n98\nTable of Contents\nSignatures\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized in Philadelphia, Pennsylvania on January 31, 2025.\nBy:\n/s/ BRIAN L. ROBERTS\nBrian L. Roberts\nChairman and Chief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\n \nSignature\nTitle\nDate\n/s/ BRIAN L. ROBERTS\nChairman and Chief Executive Officer; Director \n(Principal Executive Officer)\nJanuary 31, 2025\nBrian L. Roberts\n/s/ JASON S. ARMSTRONG\nChief Financial Officer\n(Principal Financial Officer)\nJanuary 31, 2025\nJason S. Armstrong\n/s/ DANIEL C. MURDOCK\nExecutive Vice President, Chief Accounting\nOfficer and Controller\n(Principal Accounting Officer)\nJanuary 31, 2025\nDaniel C. Murdock\n/s/ KENNETH J. BACON\nDirector\nJanuary 31, 2025\nKenneth J. Bacon\n/s/ THOMAS J. BALTIMORE, JR.\nDirector\nJanuary 31, 2025\nThomas J. Baltimore, Jr.\n/s/ LOUISE F. BRADY\nDirector\nJanuary 31, 2025\nLouise F. Brady\n/s/ MADELINE S. BELL\nDirector\nJanuary 31, 2025\nMadeline S. Bell\n/s/ EDWARD D. BREEN\nDirector\nJanuary 31, 2025\nEdward D. Breen\n/s/ JEFFREY A. HONICKMAN\nDirector\nJanuary 31, 2025\nJeffrey A. Honickman\n/s/ WONYA Y. LUCAS\nDirector\nJanuary 31, 2025\nWonya Y. Lucas\n/s/ ASUKA NAKAHARA\nDirector\nJanuary 31, 2025\nAsuka Nakahara\n/s/ DAVID C. NOVAK\nDirector\nJanuary 31, 2025\nDavid C. Novak\n \n99\nComcast 2024 Annual Report on Form 10-K"
  }
}