{
  "ticker": "CME",
  "cik": "0001156375",
  "company_name": "CME GROUP INC.",
  "filing_date": "2025-02-27",
  "accession": "0001156375-25-000021",
  "primary_doc": "cme-20241231.htm",
  "item_sections": {
    "item1": "Item 1 - Business\" beginning o\nn page \n10\n.\nRegulatory Environment.\n Our exchange-traded derivatives exchanges and other businesses are regulated and we serve a customer base that includes regulated institutions and individuals. Developments in the regulatory environment have the potential to significantly impact our business. Compliance with regulations may require us and our customers to dedicate significant financial and operational resources, which could advers\nely affect our profitability. The regulatory environment to which we are subject is discussed in \"Item 1 - Business\" beginning on page \n12\n.\nBusiness Strategy\nOur strategy focuses on maximizing futures and options growth globally, diversifying our business and revenues and delivering unparalleled customer efficiencies and operational excellence, including through our partnership with Google Cloud. This strategy allows us to continue to develop into a more broadly diversified financial exchange that provides trading and clearing solutions across a wide range of products and asset classes. Our strategic initiatives are discussed in \"Item 1 - Business\" beginning o\nn page \n7\n. \nRevenues\nClearing and transaction fees.\n A majority of our revenue is derived from clearing and transaction fees, which include electronic trading fees, surcharges for privately negotiated transactions and other volume-related charges for exchange-traded and over-the-counter (OTC) contracts. Because clearing and transaction fees are assessed on a per-contract or notional value basis, revenues and profitability fluctuate with changes in contract volume. In addition to the business trends noted earlier, our contract volume, and consequently our revenues, tend to increase during periods of economic and geopolitical uncertainty as our customers seek to manage their exposure to, or speculate on, the market volatility resulting from that uncertainty. \nWhile volume has the most significant impact on our clearing and transaction fees revenue, there are four other factors that also influence this source of revenue: \n•\nrate structure;\n•\nproduct mix;\n•\nvenue; and\n•\nthe percentage of trades executed by customers who are members compared with non-member customers.\nRate structure. \nCustomers benefit from volume discounts and limits on fees as part of our effort to increase liquidity in certain products. We offer various incentive programs to promote trading and clearing in various products and geographic locations. We may periodically change fees, volume discounts, fee limits and member discounts, perhaps significantly, based on our review of operations and the business environment. \nProduct mix. \nWe offer exchange-traded futures and options contracts as well as cleared-only interest rate swap contracts. We also offer foreign exchange spot and forward contracts and fixed income products. Rates are varied by product in order to optimize revenue on existing products and to encourage contract volume upon introduction of new products. \nVenue. \nOur exchange and platforms are an international marketplace that brings together buyers and sellers mainly through our electronic trading as well as through open outcry trading and privately negotiated transactions. Any customer who is guaranteed by a clearing firm and who agrees to be bound by our exchange rules is able to obtain direct access to our electronic platforms. Open outcry trading is conducted exclusively by our members, who may execute trades on behalf of \n33\nTable of Contents\ncustomers or for themselves. Beginning in July 2023, open outcry trading is now limited to Secured Overnight Financing Rate (SOFR) options products following the permanent closure of most of our open outcry pits. \nTypically, customers submitting trades through our electronic platforms are charged fees for using the platforms in addition to the fees assessed on all transactions executed on our exchange. Customers entering into privately negotiated transactions also incur additional charges beyond the fees assessed on other transactions. \nMember/non-member mix. \nGenerally, member customers are charged lower fees than our non-member customers. Holding all other factors constant, revenue decreases if the percentage of trades executed by members increases, and increases if the percentage of non-member trades increases. \nClearing and transaction fees for cash markets business\n. Our cash markets business provides matching services whereby we match a buyer and seller of financial instruments to allow both parties to complete the trade bilaterally or through a third-party clearing house. We are not involved in the settlement of the contract but charge a transaction fee generally based on volume or notional value of the trade for providing the matching service. BrokerTec Americas also generates revenue from a matched principal business. This business serves as a fully matched counterparty to offsetting positions entered into by clients on our electronic trading platform to facilitate anonymity and access to clearing and settlement. Revenue is generated from this business generally on a transaction fee basis. \nOther sources. \nRevenue is also derived from other sources, including market data and information services and other various services related to our exchange operations. \nMarket data and information services. \nWe receive market data and information services revenue from the dissemination of our market data to subscribers. Subscribers can obtain access to our market data services either directly or through third-party distributors. \nOur service offerings include access to real-time, delayed and end-of-day quotations, trade and summary market data for our products and other data sources. Users of our basic service receive real-time quotes and pay a flat monthly fee for each screen, or device, displaying our market data. Alternatively, customers can subscribe to market data provided on a limited group of products. The fee for this service is also a flat rate per month.\nPricing for our market data services is based on the value of the service provided and the price of comparable services offered by our competitors. Increases or decreases in our market data and information services revenue are influenced by changes in our price structure and incentive programs for existing market data offerings, introduction of new market data services and changes in the number of devices in use. General economic factors that affect the financial services industry, which constitutes our primary customer base, also influence revenue from our market data services. \nOther revenues. \nOther revenue includes access and communication fees. Access and communication fees are connectivity fees charged to members and clearing firms that utilize our various telecommunications networks and communications services. Our communication services include our co-location program as well as the connectivity charges to customers of the CME Globex platform. Access fee revenue varies depending on the type of connection provided to customers. \nOther revenues also include fees for collateral management, equity subscription fees and fees for trade order routing through agreements from various strategic relationships as well as other services to members and clearing firms.\nExpenses\nThe majority of our expenses do not vary directly with changes in our contract volume. However, licensing and other fee agreements can vary directly with certain equity, energy and swap volumes. \nCompensation and benefits. \nCompensation and benefits expense is our most significant expense and includes employee wages, bonuses, stock-based compensation, benefits and employer taxes. Changes in this expense are driven by fluctuations in the number of employees, increases in wages as a result of labor market conditions, changes in rates for employer taxes and other cost increases affecting benefit plans. In addition, this expense is affected by the composition of our workforce. The expense associated with our bonus and stock-based compensation plans can also have a significant impact on this expense category. \nThe bonus component of our compensation and benefits expense is based on our financial performance. Under the performance criteria of our annual incentive plans, the bonus funded under the plans is based on achieving certain financial performance targets established by the compensation committee of our board of directors. The compensation committee has discretion to make equitable adjustments to the cash earnings performance calculation to reflect effects of unplanned operating results or capital expenditures to meet intermediate- to long-term growth opportunities. \nIn general, stock-based compensation is a non-cash expense related to restricted stock and performance share grants. Stock-based compensation varies depending on the quantity and fair value of awards granted. The fair value of restricted stock awards \n34\nTable of Contents\nand other performance share grants is based on either the share price on the date of the grant or a model of expected future stock prices. \nProfessional fees and outside services.\n This expense includes fees for consulting services received on strategic and technology initiatives; regulatory and other compliance matters; temporary labor as well as legal and accounting fees. This expense may fluctuate as a result of changes in services required to complete initiatives, handle legal proceedings and comply with regulatory and compliance requirements.\nDepreciation and amortization. \nDepreciation and amortization expense results from the depreciation of long-lived assets such as buildings, leasehold improvements, furniture, fixtures and equipment. This expense also includes the amortization of purchased and internally developed software. \nAmortization of purchased intangibles. \nAmortization of purchased intangibles includes amortization of intangible assets obtained in our acquisitions of CBOT Holdings, Inc., NYMEX Holdings, Inc. and NEX as well as other asset and business acquisitions. Intangible assets subject to amortization consist primarily of clearing firm, market data and other customer relationships. \nOther expenses. \nWe incur additional ongoing expenses for technology, licensing and other fee agreements and various other activities necessary to support our operations. \n•\nTechnology expense consists of costs related to maintenance of the hardware and software required to support our technology. It also includes costs for network connections for our electronic platforms and some market data customers; telecommunications costs of our exchange, and fees paid for access to external market data. This expense may be driven by system capacity, cloud consumption, functionality and redundancy requirements. It also may be impacted by growth in electronic contract volume and changes in the number of telecommunications hubs and connections which allow customers outside the U.S. to access our electronic platforms directly. \n•\nLicensing and other fee agreements expense includes license fees paid as a result of contract volume in equity index products. This expense also includes royalty fees and broker rebates on energy and metals products, as well as revenue sharing on cleared swaps contracts and some new product launches. This expense fluctuates with changes in contract volumes as well as changes in fee structures. \n•\nOther expenses include occupancy and building operations expenses including rent, maintenance, real estate taxes, utilities and other related costs related to leased property in Chicago, New York, the U.K., and India, as well as other smaller locations throughout the world. Other expenses also include marketing and travel-related expenses as well as general and administrative costs. Marketing, advertising and public relations expense includes media, print and other advertising costs, as well as costs associated with our product promotion. Other expenses also include litigation and customer settlements, impairment charges on operating assets, gains and losses on disposals of certain operating assets, and foreign currency transaction gains and losses resulting from changes in exchange rates on certain foreign monetary assets and liabilities.\nNon-Operating Income and Expenses\nIncome and expenses incurred through activities outside of our core operations are considered non-operating. These activities include non-core investing and financing activities. \n•\nInvestment income includes income from short-term investment of clearing firms' cash performance bonds and guaranty fund contributions as well as excess operating cash; interest income and realized gains and losses from our marketable securities; realized gains and losses and dividend income from our strategic equity investments, and gains and losses on trading securities in our non-qualified deferred compensation plans. Investment income is influenced by market interest rates, changes in the levels of cash performance bonds deposited by clearing firms, the amount of dividends distributed by our strategic investments and the availability of funds generated by operations. \n•\nInterest and other borrowing costs expense includes charges associated with various short-term and long-term funding facilities, including commitment fees on lines of credit agreements.\n•\nEquity in net earnings (losses) of unconsolidated subsidiaries includes income and losses from our investments in S&P Dow Jones Indices LLC, OSTTRA, Shanghai CFETS-NEX International Money Broking Co., Ltd. and Gulf Mercantile Exchange.\n•\nOther income (expense) includes expenses related to the distribution of a portion of interest earned on performance bond collateral reinvestment to the clearing firms, gains and losses on derivative contracts and other various income and expenses outside our core operations.\n35\nTable of Contents\nCRITICAL ACCOUNTING POLICIES\nThe notes to our consolidated financial statements include disclosure of our significant accounting policies. In establishing these policies within the framework of accounting principles generally accepted in the United States (U.S.), management must make certain assessments, estimates and choices that will result in the application of these principles in a manner that appropriately reflects our financial condition and results of operations. Critical accounting policies are those policies that we believe present the most complex or subjective measurements and have the most potential to affect our financial position and operating results. While all decisions regarding accounting policies are important, there are certain accounting policies that we consider to be critical. These critical policies, which are presented in detail in the notes to our consolidated financial statements, relate to the valuation of financial instruments, goodwill and intangible assets, revenue recognition, income taxes and internal use software costs. \nValuation of financial instruments. \nFair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date, or an exit price. We have categorized  financial instruments measured at fair value into the following three-level fair value hierarchy based upon the level of judgment associated with the inputs used to measure the fair value: \n•\nLevel 1 inputs, which are considered the most reliable evidence of fair value, consist of quoted prices (unadjusted) for identical assets or liabilities in active markets. \n•\nLevel 2 inputs consist of observable market data, such as quoted prices for similar assets and liabilities in active markets, or inputs other than quoted prices that are directly observable. \n•\nLevel 3 inputs consist of unobservable inputs, which are derived and cannot be corroborated by market data or other entity-specific inputs.\nFor further discussion regarding the fair value of financial assets and liabilities, see note 2. Summary of Significant Accounting Policies and note 17. Fair Value Measurements to the consolidated financial statements. \nGoodwill and intangible assets. \nWe review goodwill for impairment on a quarterly basis and whenever events or circumstances indicate that its carrying value may not be recoverable. Goodwill may be tested quantitatively for impairment by comparing the carrying value of a reporting unit to its estimated fair value. Estimating the fair value of a reporting unit involves the use of valuation techniques that rely on significant estimates and assumptions. These estimates and assumptions may include forecasted revenue growth rates; forecasted operating margins; risk-adjusted discount rates; forecasted economic and market conditions; and industry multiples. We base our fair value estimates on assumptions we believe to be reasonable given the information that is available to us at the time of our assessment; however, actual future results may differ significantly from those estimates. Under certain favorable circumstances, goodwill may be reviewed qualitatively for indications of impairment without utilizing valuation techniques to estimate fair value. The qualitative assessment of goodwill may rely on significant assumptions about forecasts of revenue growth, operating margins and economic conditions as well as overall market and industry-specific trends. In addition, the carrying value of goodwill, as denominated in foreign currencies, is adjusted each reporting period as a result of movements in foreign currency exchange rates relative to the U.S. dollar. Such foreign currency translation adjustments are recorded in accumulated other comprehensive income (loss) within shareholders' equity.\nWe also review indefinite-lived intangible assets on a quarterly basis or more frequently when events and circumstances indicate that their carrying values may not be recoverable. Indefinite-lived intangible assets may be tested quantitatively for impairment by comparing their carrying values to their estimated fair values. Estimating the fair value of indefinite-lived intangible assets involves the use of valuation techniques that rely on significant estimates and assumptions. These estimates and assumptions may include forecasted revenue growth rates, forecasted allocations of expense and risk-adjusted discount rates. We base our fair value estimates on assumptions we believe to be reasonable given the information that is available to us at the time of our assessment; however, actual future results may differ significantly from those estimates. Similar to goodwill, under certain favorable circumstances, indefinite-lived intangible assets may be reviewed qualitatively for indications of impairment without utilizing valuation techniques to estimate fair value. The qualitative assessment of indefinite-lived intangible assets may rely on significant assumptions about forecasts of revenue growth, operating margins and economic conditions as well as overall market and industry-specific trends.\nIntangible assets subject to amortization are also assessed for impairment on a quarterly basis or more frequently when indicated by a change in economic or operational circumstances. The impairment assessment of these assets requires management to first compare the carrying value of the amortizing asset to its undiscounted net cash flows. If the carrying value exceeds the undiscounted net cash flows, management is then required to estimate the fair value of the assets and record an impairment loss for the excess of the carrying value over the fair value. In connection with this impairment assessment, management also challenges the useful lives of our definite-lived intangible assets. \nRevenue recognition. \nA significant portion of our revenue is derived from the clearing and transaction fees we assess on each contract executed through our trading venues and cleared through our clearing house. Clearing and transaction fees are \n36\nTable of Contents\nrecognized as revenue when a buy and sell order are matched, novated and when the trade is cleared. On occasion, the customer's exchange trading privileges may not be properly entered by the clearing firm and incorrect fees are charged for the transactions in the affected accounts. When this information is corrected within the time period allowed by the exchange, a fee adjustment is provided to the clearing firm. We also earn revenue from the dissemination of market data to subscribers, distributors, and other third-party licensees of market data. Market data and information services fee revenue is generally recognized on a monthly basis as the customers receive and consume the benefit of the market data services. \nIncome taxes.\n Calculation of the income tax provision includes an estimate of the income taxes that will be paid for the current year, as well as an estimate of income tax liabilities or benefits deferred into future years. Deferred tax assets are reviewed to determine if they will be realized in future periods. To the extent it is determined that some deferred tax assets may not be fully realized, the assets are reduced to their realizable value by a valuation allowance. The calculation of our tax provision involves uncertainty in the application of complex tax regulations and we occasionally may consult with relevant tax authorities or engage third-party expertise where appropriate. We recognize potential liabilities for anticipated tax audit issues in the U.S. and other applicable foreign tax jurisdictions using a more-likely-than-not recognition threshold based on the technical merits of the tax position taken or expected to be taken. If the actual obligation of these amounts varies from our estimate, our income tax provision would be reduced or increased at the time that determination is made. This determination may not be known for several years. Past tax audits have not resulted in tax adjustments that resulted in a material change to the income tax provision in the year the audit was completed. The effective tax rate, defined as the income tax provision as a percentage of income before income taxes, will vary from year to year based on changes in tax jurisdictions, tax rates and regulations. In addition, the effective tax rate will vary with changes to income that are not subject to income tax and changes in expenses or losses that are not deductible, such as the utilization of foreign net operating losses. \nInternal use software costs.\n Certain internal and external costs that are incurred in connection with developing or obtaining software for internal use are capitalized.  We also enter into software hosting arrangements for software projects maintained or developed in the cloud. Software development costs incurred during the planning or maintenance stages of a software project are expensed as incurred, while certain costs incurred during the application development stage are capitalized and are amortized over the estimated useful life of the software, which is generally two to four years, but up to eight years for certain trading and clearing applications, depending upon expected useful lives. Amortization of capitalized costs begins only when the software becomes ready for its intended use. In addition, software assets are assessed for impairment when events or circumstances indicate that the carrying values may not be recoverable or that a reduction in the estimated useful lives is warranted.\nRESULTS OF OPERATIONS\nFinancial Highlights\nThe following summarizes significant changes in our financial performance for the years presented. For a comparison of our results of operations for the fiscal years ended December 31, 2023 to December 31, 2022, see \"Part II, Item 7 - Management's Discussion and Analysis of Financial Condition and Results of Operations\" of our Annual Report on Form 10-K for the fiscal year ended December 31, 2023, filed with the SEC on February 28, 2024.\n \n \n \nYear-over-Year Change\n(dollars in millions, except per share data)\n2024\n2023\n2024-2023\nTotal revenues\n$\n6,130.1 \n$\n5,578.9 \n10 \n%\nTotal expenses\n2,198.6 \n2,143.2 \n3 \nOperating margin\n64.1 \n%\n61.6 \n%\nNon-operating income (expense)\n$\n609.9 \n$\n717.9 \n(15)\nEffective tax expense rate\n22.4 \n%\n22.3 \n%\nNet income attributable to CME Group\n$\n3,525.8 \n$\n3,226.2 \n9 \nDiluted earnings per common share attributable to CME Group\n9.67 \n8.86 \n9 \nCash flows from operating activities\n3,690.5 \n3,453.8 \n7 \n37\nTable of Contents\nRevenues\n \n \n \nYear-over-Year Change\n(dollars in millions)\n2024\n2023\n2024-2023\nClearing and transaction fees\n$\n4,988.2 \n$\n4,588.5 \n9 \n%\nMarket data and information services\n710.2 \n663.7 \n7 \nOther\n431.7 \n326.7 \n32 \nTotal Revenues\n$\n6,130.1 \n$\n5,578.9 \n10 \nClearing and Transaction Fees\nFutures and Options\n \nThe following table summarizes our total contract volume, revenue and average rate per contract for futures and options. Total contract volume includes contracts that are traded on our exchange and cleared through our clearing house and certain cleared-only contracts. Volume is measured in round turns, which is considered a completed transaction that involves a purchase and an offsetting sale of a contract. Average rate per contract is determined by dividing total clearing and transaction fees by total contract volume. Contract volume and average rate per contract disclosures below exclude trading volume for the cash markets business as well as interest rate swaps. \n \n \n \nYear-over-Year Change\n \n \n2024\n2023\n2024-2023\nTotal contract volume (in millions)\n6,685.0 \n6,098.5 \n10 \n%\nClearing and transaction fees (in millions)\n$\n4,623.3 \n$\n4,220.8 \n10 \nAverage rate per contract\n0.692 \n0.692 \n— \nWe estimate the following net increase in clearing and transaction fees based on a change in total contract volume and a change in average rate per contract during 2024 compared with 2023.\n \nYear-over-Year Change\n(in millions)\n2024-2023\nIncrease due to change in total contract volume\n$\n405.7 \nDecrease due to change in average rate per contract\n(3.2)\nNet increase in clearing and transaction fees\n$\n402.5 \nAverage rate per contract is impacted by our rate structure, including volume-based incentives, product mix, trading venue and the percentage of volume executed by customers who are members compared with non-member customers. Due to the relationship between average rate per contract and contract volume, the change in clearing and transaction fees attributable to changes in each is only an approximation.\n38\nTable of Contents\nContract Volume\nThe following table summarizes average daily contract volume. Contract volume can be influenced by many factors, including political and economic factors, the regulatory environment and market competition. \n \n \n \nYear-over-Year Change\n(amounts in thousands)\n2024\n2023\n2024-2023\nAverage Daily Volume by Product Line:\nInterest rates\n13,716\n12,517\n10 \n%\nEquity indexes\n6,847\n6,698\n2 \nForeign exchange\n1,030\n954\n8 \nAgricultural commodities\n1,711\n1,508\n13 \nEnergy\n2,488\n2,118\n17 \nMetals\n736\n599\n23 \nAggregate average daily volume\n26,528\n24,394\n9 \nAverage Daily Volume by Venue:\nCME Globex\n24,510\n22,353\n10 \nOpen outcry\n1,023\n1,145\n(11)\nPrivately negotiated \n995\n896\n11 \nAggregate average daily volume\n26,528\n24,394\n9 \nElectronic Volume as a Percentage of Total Volume\n92 \n%\n92 \n%\nMarket volatility within certain financial markets remained high throughout 2024. Interest rate volatility was higher as a result of mixed inflation levels and market uncertainty surrounding the Federal Reserve’s interest rate policy decisions.  The Federal Open Markets Committee (FOMC) cut the federal funds rate multiple times throughout 2024 and issued cautious guidance for the future. In addition, the energy markets saw an increase in volatility as a result of continued geopolitical tensions in the Middle East and Eastern Europe as well as more weather uncertainty in 2024 compared to 2023. We also expanded our ongoing sales efforts across many of the product lines to increase our sales growth across the globe. We believe these factors contributed to the increase in total volume in 2024 compared with 2023.\nInterest Rate Products\nThe following table summarizes average daily contract volume for our key interest rate products. We no longer offer Eurodollar contract trading as of June 2023.\n \n \n \nYear-over-Year Change\n(amounts in thousands)\n2024\n2023\n2024-2023\nEurodollar futures and options:\nFutures expiring within two years\n—\n87\n(100)\n%\nOptions\n—\n41\n(100)\nFutures expiring beyond two years\n—\n21\n(100)\nSOFR futures and options:\nFutures expiring within two years\n2,654\n2,545\n4 \nFutures expiring beyond two years\n957\n850\n13 \nOptions\n1,580\n1,726\n(8)\nU.S. Treasury futures and options:\n10-Year\n3,248\n2,701\n20 \n5-Year\n1,977\n1,834\n8 \n2-Year\n1,044\n838\n25 \nTreasury Bond\n714\n587\n22 \nUltra T-Bond\n415\n312\n33 \nFederal Funds futures and options\n414\n442\n(6)\n39\nTable of Contents\nIn 2024 compared with 2023, overall interest rate contract volume increased as a result of general market uncertainty. We believe this was a result of mixed inflation results that occurred throughout the year, as well as the U.S. presidential and congressional elections in November. We also believe there was uncertainty regarding the Federal Reserve's interest policy decisions. The Federal Reserve cut interest rates three times in 2024 and issued cautious guidance for 2025. The increase in overall interest rate contract volume was also due to our ongoing sales efforts to increase global participation. \nEquity \nIndex Products\nThe following table summarizes average daily contract volume for our key equity index products. \n \n \n \nYear-over-Year Change\n(amounts in thousands)\n2024\n2023\n2024-2023\nE-mini S&P 500 futures and options\n4,016\n4,154\n(3)\n%\nE-mini Nasdaq 100 futures and options\n \n2,065\n1,829\n13 \nE-mini Russell 2000 futures and options\n308\n316\n(2)\nEquity index contract volume increased slightly in 2024 compared with 2023. We believe the increase in Nasdaq-100 contract volume was due to higher volatility within the technology sector as a result of market speculation about artificial intelligence initiatives. The increase in volume was partially offset by lower overall equity volatility within the S&P 500, which is more diversified than the tech heavy Nasdaq-100. We also believe the increase in volume is due our additional client outreach efforts throughout the year.\nForeign Exchange Products\nThe following table summarizes average daily contract volume for our key foreign exchange products.\n \n \n \nYear-over-Year Change\n(amounts in thousands)\n2024\n2023\n2024-2023\nEuro\n258\n252\n2 \n%\nJapanese yen\n192\n185\n4 \nBritish pound\n120\n111\n8 \nAustralian dollar\n114\n106\n8 \nOverall foreign exchange contract volume increased in 2024 when compared with 2023, which we believe is due to uncertainty surrounding the Federal Reserve and other global central banks' interest rate policy decisions. The Federal Reserve cut interest rates three times in 2024, but issued cautious guidance moving forward as a result of continued uncertainty surrounding inflation. We believe these factors led to higher overall foreign exchange contract volume in 2024 compared with 2023. \nAgricultural Commodity Products\nThe following table summarizes average daily volume for our key agricultural commodity products.\n \n \n \nYear-over-Year Change\n(amounts in thousands)\n2024\n2023\n2024-2023\nCorn\n511\n444\n15 \n%\nSoybean\n367\n319\n15 \nWheat \n228\n208\n10 \nIn 2024 when compared with 2023, overall commodity contract volume increased due to higher overall market volatility. We believe this is a result of continued weather uncertainty due to a drier than average 2024 growing season. In addition, poor weather conditions throughout the Black Sea region led to increased uncertainty surrounding soybean and wheat yields. We also believe the increase in volume is due to our initiatives to increase cross selling among key customers and optimization of our incentive programs to promote volume growth of new and existing products.\n40\nTable of Contents\nEnergy Products\nThe following table summarizes average daily volume for our key energy products.\n \n \n \nYear-over-Year Change\n(amounts in thousands)\n2024\n2023\n2024-2023\nWTI crude oil\n1,167\n1,087\n7 \n%\nNatural gas\n811\n601\n35 \nRefined products\n375\n336\n12 \nOverall energy contract volume increased in 2024 when compared with 2023. We believe the increase in volume is due to uncertainty in the global energy markets caused by multiple geopolitical conflicts in the Middle East and Eastern Europe.  In addition, uncertain weather conditions throughout the year led to an increase in overall natural gas volume. We also believe the increase in volume is due our additional client outreach efforts throughout the year.\nMetal Products\nThe following table summarizes average daily volume for our key metal products.\nYear-over-Year Change\n(amounts in thousands)\n2024\n2023\n2024-2023\nGold\n431\n356\n21 \n%\nCopper\n133\n114\n17 \nSilver\n123\n93\n33 \nOverall metal contract volume increased in 2024 when compared with 2023, which we believe was attributable to higher overall market volatility. Market uncertainty surrounding Federal Reserve's interest rate policy decisions as well as uncertainty surrounding the U.S. presidential and congressional elections led to an overall increase in demand for gold and other precious metals as safe-haven investments. In addition, copper contract volume increased largely due to an increase in demand for artificial intelligence data centers and renewable infrastructure. We also believe the increase in volume was due to increased sales efforts, specifically with retail clients and our international sales efforts for copper products. \nAverage Rate per Contract\nThe average rate per contract remained consistent in 2024 when compared with 2023. The average rate per contract was impacted by an increase in our fee structure, which went into effect on February 1, 2024. The overall increase due to the rise in fees was offset by a decrease resulting from higher member trading as a percentage of total volume as well as our tiered volume pricing structure. \nCash Markets Business\nTotal clearing and transaction fees revenue in 2024 included $276.7 million of transaction fees attributable to the cash markets business, compared with\n $284.7 million in \n2023. This revenue primarily includes transaction fees from BrokerTecs's fixed income volume and EBS foreign exchange volume.\nYear-over-Year Change\n(amounts in millions)\n2024\n2023\n2024-2023\nBrokerTec fixed income transaction fees\n$\n145.1 \n$\n152.1 \n(5)\n%\nEBS foreign exchange transaction fees\n131.6 \n132.6 \n(1)\n41\nTable of Contents\nThe related average daily notional value for the years ended 2024 and 2023 for key cash markets products were as follows:\nYear-over-Year Change\n(amounts in billions)\n2024\n2023\n2024-2023\nU.S. Repos\n$\n328.4 \n$\n293.6 \n12 \n%\nEuropean Repo (in euros)\n290.1 \n326.5 \n(11)\nU.S. Treasury \n101.9 \n106.1 \n(4)\nSpot FX\n59.5 \n56.7 \n5 \nOverall average daily notional values and transactions revenues for the cash markets business were slightly lower in 2024 when compared with 2023. \nConcentration of Revenue\nWe bill a significant portion of our clearing and transaction fees to our clearing firms. The majority of clearing and transaction fees received from clearing firms represent charges for trades executed and cleared on behalf of their customers. One clearing firm represented at lea\nst 10%\n of \nour clearing and transaction fees in 2024. Should a clearing firm withdraw, we believe that the customer portion of the firm's trad\ning activity would likely transfer to another clearing firm of the exchange. Therefore, we do not believe we are exposed to significant risk from an ongoing loss of revenue received from or through a particular clearing firm. \nOther Sources of Revenue\nMarket data and information services. \nIn 2024 when compared with 2023, the increase in market data and information services revenue was largely attributable to price increases for certain products as well as an increase in usage for certain products.\nApproximately 30% of our market data and information services revenue in 2024 was earned from the two largest resellers of our market data. Despite this concentration, we consider exposure to significant risk of revenue loss to be minimal. In the event that one of these vendors no longer distributes our market data, we believe the majority of that vendor's customers would likely subscribe to our market data through another reseller. Additionally, several of our largest institutional customers that utilize services from our two largest resellers report usage and remit payment of their fees directly to us.\nOther revenues\n. In 2024 when compared with 2023, the increase in other revenue was largely attributable to higher custody fees as well as an increase in co-location and other connectivity fees.\nExpenses\n \n \n \nYear-over-Year Change\n(dollars in millions)\n2024\n2023\n2024-2023\nCompensation and benefits\n$\n850.3 \n$\n828.6 \n3 \n%\nTechnology\n255.8 \n218.7 \n17 \nProfessional fees and outside services\n132.7 \n144.4 \n(8)\nAmortization of purchased intangibles\n221.7 \n226.6 \n(2)\nDepreciation and amortization\n115.1 \n126.0 \n(9)\nLicensing and other fee agreements\n355.4 \n322.8 \n10 \nOther\n267.6 \n276.1 \n(3)\nTotal Expenses\n$\n2,198.6 \n$\n2,143.2 \n3 \n42\nTable of Contents\n2024 Compared With 2023\nOperating expenses increased by $55.4 million in 2024 when compared with 2023. The following table shows the estimated impact of key factors resulting in the net increase in operating expenses.\n(dollars in millions)\nYear-\nover-Year\nChange\nChange as a\nPercentage of\n2023 Expenses\nTechnology support services\n$\n37.0 \n2 \n%\nLicense fees\n32.7 \n2 \nSalaries, benefits and employer taxes\n27.2 \n2 \nOccupancy and building operations\n(11.5)\n(1)\nProfessional fees and outside services\n(11.7)\n(1)\nEmployee separation and restructuring\n(12.5)\n(1)\nOther expenses, net\n(5.8)\n— \nTotal\n$\n55.4 \n3 \n%\nOverall operating expenses increased in 2024 when compared with 2023 due to the following reasons:\n•\nThe increase in expenses related to technology support services was primarily driven by higher software license fees and third party services to support the ongoing Google Cloud transformation project.\n•\nLicense fees expense was higher primarily due to an increase in volume for certain equity products and improved revenue performance related to certain other incentive arrangements.\n•\nSalaries, benefits and employer taxes was higher due to an increase in headcount during the year, which was primarily attributable to additional headcount in the company's international locations.\nDecreases in operating expenses in 2024 when compared with 2023 were due to the following reasons:\n•\nOccupancy and building operations expense decreased due to lower rent expenses and real estate taxes driven by reduced office space.\n•\nThe decrease in professional fees and outside services were largely due to a decrease in consulting costs associated with the Google Cloud Migration, which began in late 2021, as well as lower legal fees during 2024.\n•\nEmployee separation and restructuring costs decreased year over year largely due to a reduction in force of 3% of employees during 2023. \nNon-Operating Income (Expense)\n \n \n \nYear-over-Year Change\n(dollars in millions)\n2024\n2023\n2024-2023\nInvestment income\n$\n4,079.1 \n$\n5,275.3 \n(23)\n%\nInterest and other borrowing costs\n(160.9)\n(159.4)\n1 \nEquity in net earnings (losses) of unconsolidated subsidiaries\n350.9 \n296.9 \n18 \nOther income (expense)\n(3,659.2)\n(4,694.9)\n(22)\nTotal Non-Operating\n$\n609.9 \n$\n717.9 \n(15)\nInvestment income\n. In 2024 when compared with 2023, there was a decrease in earnings from reinvested cash performance bond and guaranty fund contributions due to lower average reinvestment balances. In 2024 and 2023, earnings from cash performance bond and guaranty fund contributions we\nre $3,943.8 million \nand $5,073.9 million, respectively. In addition, there was a decrease in net realized and unrealized gains on investments.\nEquity in net earnings (losses) of unconsolidated subsidiaries. \nHigher income generated from our S&P/DJI and OSTTRA business ventures contributed to an increase in equity in net earnings of unconsolidated subsidiaries in 2024 when compared with 2023.\nOther income (expense).\n In 2024 when compared with 2023, we recognized lower expense related to the distribution of interest earned on performance bond collateral reinvestments to the clearing firms in conjunction with lower interest income earned on our reinvestment during the period due to lower average reinvestment balances in 2024. In 2024 and 2023, expenses related to the distribution of interest earned on collateral reinvestments were\n $3,669.4 million a\nnd $4,717.5 million, respectively. \n43\nTable of Contents\nIncome Tax Provision\nThe following table summarizes the effective tax rate for the periods presented:\n \n2024\n2023\nYear-over-Year Change\n2024-2023\nYear ended December 31\n22.4 \n%\n22.3 \n%\n0.1 \n%\nThe overall effective tax rate remained relatively consistent in 2024 when compared with the same period in 2023.\nLIQUIDITY AND CAPITAL RESOURCES\nCash Requirements\nWe have historically met our funding requirements with cash generated by our ongoing operations. However, we have used our commercial paper program from time to time to fund large short-term funding needs.  While our cost structure is generally fixed in the short term, our sources of operating cash are largely dependent on contract trading volume levels. In addition to using our existing cash, cash equivalents, marketable securities and cash generated from operations, we may continue to utilize our commercial paper program to meet our working capital needs, capital expenditures and other commitments. It is also possible that we may need to raise additional funds to finance our activities through future public debt offerings or by direct borrowings from financial institutions through our committed revolving credit facilities.\nCash will also be required for non-cancellable purchase obligations as at December 31, 2024. Commitments include material contractual purchase obligations that are non-cancellable. Purchase obligations relate to advertising, licensing, hardware, software and maintenance as well as telecommunication services. Aside from the table below, we have certain other arrangements that have a perpetual term for which we pay a minimum of $5.0 million per year.  At December 31, 2024, future minimum payments due under purchase obligations were payable as follows (in millions): \nYear\n \n2025\n$\n176.5 \n2026-2027\n382.7 \n2028-2029\n377.2 \nThereafter\n350.0 \nTotal\n$\n1,286.4 \nFuture capital expenditures for technology are anticipated as we continue to support our growth through increased system capacity, performance improvements, integration of acquired platforms and improvements to some of our office spaces. Each year, capital expenditures are incurred for improvements to and modification of our offices, remote data centers, telecommunications network and other operating equipment. In 2025, we expect capital expenditures to total approximately\n $90.0 million, n\net of any leasehold improvement allowances. We continue to monitor our capital needs and may revise our forecasted expenditures as necessary in the future. \nIn December 2024, the board of directors approved a share repurchase program, which authorizes us to repurchase up to $3.0 billion of CME Group Class A common stock at prevailing market prices. As of December 31, 2024, there have been no shares repurchased under this program.\nWe intend to continue to pay a regular quarterly dividend to our shareholders, with a target of between 50% to 60% of the prior year's cash earnings. The decision to pay a dividend and the amount of the dividend, however, remains within the discretion of our board of directors and may be affected by various factors, including our earnings, financial condition, capital requirements, levels of indebtedness and other considerations our board of directors deems relevant. We are also required to comply with restrictions contained in the general corporation laws of our state of incorporation, which could limit our ability to declare and pay dividends.\n On February 6, 2025, the company declared a regular quarterly dividend\n of\n $1.25 per sh\nare for all outstanding common and preferred shares. The dividend will be payable on March 26, 2025 to shareholders of record on March 7, 2025. \nAssuming no changes in the number of shares outstanding, the first quarter dividend payment will total approximately $455.0 million. \nThe board of directors also declared an additional, annual variable dividend of $5.80 per share on December 5, 2024 paid on January 16, 2025 to the shareholders of record on December 27, 2024. In general, the amount of the annual variable dividend will be determined at the end of each year, and the level will increase or decrease from year to year based on operating results, capital expenditures, potential merger and acquisition activity and other forms of capital return, including regular dividends and share buybacks during the prior year. \n44\nTable of Contents\nSources and Uses of Cash\nThe following is a summary of cash flows from operating, investing and financing activities.\n \n \n \nYear-over-Year Change\n(dollars in millions)\n2024\n2023\n2024-2023\nNet cash provided by operating activities\n$\n3,690.5 \n$\n3,453.8 \n7 \n%\nNet cash (used in) provided by investing activities\n(82.6)\n20.9 \nn.m.\nNet cash provided by (used in) financing activities\n5,076.5 \n(48,339.3)\n(111)\n_________\nn.m. not meaningful\nOperating activities\nNet cash provided by operating activities was higher in 2024 compared with 2023, largely due to an increase in revenue resulting from fee increases and an increase in overall volumes. \nInvesting activities\nThe increase in cash used in investing activities in 2024 compared with 2023 was due to lower overall proceeds on sales of investments in 2024 compared to 2023. In addition, the increase in cash used was also due to higher additions in property, plant and equipment. \nFinancing activities\nCash provided by financing activities was higher in 2024 when compared with 2023 mainly due to an increase in cash performance bonds and guaranty fund contributions. This was partially offset by an increase in dividends paid in 2024. \nDebt Instruments\nThe following table summarizes our debt outstanding as of December 31, 2024:\n(in millions)\nPar Value\nFixed rate notes due March 2025, stated rate of 3.00%\n (1)\n$\n750.0 \nFixed rate notes due June 2028, stated rate of 3.75%\n500.0 \nFixed rate notes due March 2032, stated rate of 2.65%\n750.0 \nFixed rate notes due September 2043, stated rate of 5.30%\n (2)\n750.0 \nFixed rate notes due June 2048, stated rate of 4.15%\n700.0 \n _______________\n(1)\nWe maintained a forward-starting interest rate swap agreement that modified the interest obligation associated with these notes so that the interest payable on the notes effectively became fixed at a rate of 3.11%.\n(2)\nWe maintained a forward-starting interest rate swap agreement that modified the interest obligation associated with these notes so that the interest payable effectively became fixed at a rate of 4.73%.\nWe maintain a $2.3 billion multi-currency revolving senior credit facility with various financial institutions, which matures in November 2026. The proceeds from this facility can be used for general corporate purposes, which includes providing liquidity for our clearing house in certain circumstances at CME Group's discretion and, if necessary, for maturities of commercial paper. As long as we are not in default under this facility, we have the option to increase it up to $3.3 billion with the consent of the agent and lenders providing the additional funds. This facility is voluntarily pre-payable from time to time without premium or penalty. Under this facility, we are required to remain in compliance with a consolidated net worth test, which is defined as our consolidated shareholders' equity at September 30, 2021, giving effect to share repurchases made and special dividends paid during the term of the agreements (and in no event greater than $2.0 billion in aggregate), multiplied by 0.65. We currently do not have any borrowings outstanding under this facility, but any commercial paper balance if or when outstanding can be backstopped against this facility.\nWe maintain a 364-day multi-currency revolving secured credit facility with a consortium of domestic and international banks to be used in certain situations by the clearing house. The facility provides for borrowings of up to $7.0 billion. We may use the proceeds to provide temporary liquidity in the unlikely event a clearing firm fails to promptly discharge an obligation to the clearing house, in the event of a liquidity constraint or default by a depositary (custodian for our collateral), in the event of a temporary disruption with the domestic payments system that would delay payment of settlement variation between us and our clearing firms, or in other cases as provided by the CME rulebook. Clearing firm guaranty fund contributions received in the \n45\nTable of Contents\nform of cash or U.S. Treasury securities as well as the performance bond assets (pursuant to the CME rulebook) can be used to collateralize the facility. At December 31, 2024, guaranty fund contributions available to collateralize the facility totaled\n $10.1 billion. \nWe have the option to request an increase in the line from $7.0 billion to $10.0 billion. Our 364-day facility contains a requirement that CME remain in compliance with a consolidated tangible net worth test, defined as CME's consolidated shareholder's equity less intangible assets (as defined in the agreement), of not less than $800.0 million. We currently do not have any borrowings outstanding under this facility. \nThe indentures governing our fixed rate notes, our $2.3 billion multi-currency revolving senior credit facility and our 364-day multi-currency revolving secured credit facility for $7.0 billion do not contain specific covenants that restrict the ability to pay dividends. These documents, however, do contain other customary financial and operating covenants that place restrictions on the operations of the company that could indirectly affect the ability to pay dividends. \nAt December 31, 2024, we have excess borrowing capacity for general corporate purposes of approximatel\ny $2.3 billion \nunder our multi-currency revolving senior credit facility.\nWe maintain committed repurchase facility agreements amounting to a total of $1.0 billion.  The committed repurchase facilities provide access to cash, secured by non-cash collateral, in the event that one or more of our clearing firms fails to promptly discharge an obligation to the clearing house.  The facilities are subject to annual renewal. We currently do not have any borrowings outstanding under these facilities.\nWe maintain a committed facility of up to $750.0 million for foreign currency conversions. The committed foreign currency facility allows the clearing house to convert cash to another currency within generally accepted local market timeframes in the event that one or more of our clearing firms fails to promptly discharge an obligation to the clearing house.  The facility is subject to annual renewal. We currently do not have any foreign currency trades outstanding under this facility.\nAt December 31, 2024, we were in compliance with the various covenant requirements of all our debt facilities.\nCME Group, as a holding company, has no operations of its own. Instead, it relies on dividends declared and paid to it by its subsidiaries in order to provide the funds that it uses to pay dividends to its shareholders.\nTo satisfy our performance bond obligation with Singapore Exchange Limited, we may pledge irrevocable standby letters of credit. At December 31, 2024, the letters of credit totaled \n$400.0\n million. We also maintain a $350.0 million line of credit to meet our obligations under this agreement.\nThe following table summarizes our credit ratings as of December 31, 2024: \nRating Agency\nShort-Term\nDebt Rating\nLong-Term\nDebt Rating\nOutlook\nStandard & Poor’s\nA1+\nAA-\nStable\nMoody’s Investors Service\nP1\nAa3\nStable\nGiven our cash flow generation, our ability to pay down debt levels and our ability to refinance existing debt facilities, if necessary, we expect to maintain an investment grade rating. If our ratings are downgraded below investment grade within certain specified time periods due to a change of control, we are required to make an offer to repurchase our fixed rate notes at a price equal to 101% of the principal amount, plus accrued and unpaid interest. No report of any rating agency is incorporated by reference herein.\nLiquidity and Cash Management\nCash and cash equivalents, excluding restricted cash, totaled $2.9 billion at both December 31, 2024 and December 31, 2023. The balance retained in cash and cash equivalents is a function of anticipated or possible short-term cash needs, prevailing interest rates, our corporate investment policy and alternative investment choices. A majority of our cash and cash equivalents balance is invested in money market mutual funds that invest only in U.S. Treasury securities, U.S. government agency securities and U.S. Treasury security reverse repurchase agreements and short-term bank deposits. Our exposure to credit and liquidity risk is minimal given the nature of the investments. Cash that is not available for general corporate purposes because of regulatory requirements or other restrictions is classified as restricted cash and is included in other current assets or other assets in the consolidated balance sheets. Cash performance bonds and guarantee fund contribution assets are deemed to be restricted cash. \nOur practice is to have our pension plan 100% funded at each year end on a projected benefit obligation basis, while also satisfying any minimum required contribution and obtaining the maximum tax de\nduction. Base\nd on our actuarial projections, we estimate that a $12.2 million additional contribution will be necessary in 2025 to meet our funding goal. However, the amount of the actual contribution is contingent on various factors, including the actual rate of return on our plan assets during 2025 and the December 31, 2025 discount rate. \n46\nTable of Contents\nRegulatory Requirements \nCME is regulated by the CFTC as a derivatives clearing organization (DCO). DCOs are required to maintain capital, as defined by the CFTC, in an amount at least equal to one year of projected operating expenses as well as cash, liquid securities, or a line of credit at least equal to six months of projected operating expenses. CME was designated by the Financial Stability Oversight Council as a systemically important financial market utility under Title VIII of the Dodd-Frank Wall Street Reform and Consumer Protection Act. As a result, CME must comply with CFTC regulations applicable to a systemically important DCO for financial resources and liquidity resources. CME is in compliance with all DCO financial requirements.\nCME, CBOT, NYMEX and COMEX are regulated by the CFTC as designated contract markets (DCM). DCMs are required to maintain capital, as defined by the CFTC, in an amount at least equal to one year of projected operating expenses as well as cash, liquid securities or a line of credit at least equal to six months of projected operating expenses. Our DCMs are in compliance with all DCM financial requirements. \nBrokerTec Americas LLC is required to maintain sufficient net capital under the Securities Exchange Act of 1934, as amended (Exchange Act), Rule 15c3-1 (the Net Capital Rule). The Net Capital Rule focuses on liquidity and is designed to protect securities customers, counterparties, and creditors by requiring that broker-dealers have sufficient liquid resources on hand at all times to satisfy claims promptly. Rule 15c3-3, or the customer protection rule, which complements Rule 15c3-1, is designed to ensure that customer property (securities and funds) in the custody of broker-dealers is adequately safeguarded. By law, both of these rules apply to the activities of registered broker-dealers, but not to unregistered affiliates. The firm began operating as a (k)(2)(i) broker-dealer in November 2017 following notification to the Financial Industry Regulatory Authority and the SEC. A company operating under the (k)(2)(i) exemption is not required to lock up customer funds as would otherwise be required under Exchange Act Rule 15c3-3.\nITEM 7A.    QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nWe are subject to various market risks, including those caused by changes in interest rates, credit and foreign currency exchange rates.\nInterest Rate Risk \nDebt outstanding at December 31, 2024 consisted of fixed-rate borrowings of $3.4 billion. Changes in interest rates impact the fair values of fixed-rate debt, but do not impact earnings or cash flows. We did not have any variable-rate borrowings at December 31, 2024. \nCredit Risk \nCME Clearing House\nOur clearing house acts as the counterparty to all trades consummated on our exchange as well as through third-party exchanges and swaps markets for which we provide clearing services. As a result, we are exposed to significant credit risk of third parties, including clearing firms. We are also exposed, indirectly, to the credit risk of customers of our clearing firms. These parties may default on their obligations due to bankruptcy, lack of liquidity, operational failure or other reasons. \nIn order to ensure performance, we establish and monitor financial requirements for our clearing firms. We set minimum performance bond requirements for exchange-traded and interest rate swaps products. For clearing firms, we establish performance bond requirements to cover at least 99% of expected price changes for a given product within a given historical period with further quantitative and qualitative considerations based on market risk. We establish haircuts applied to collateral deposited to meet performance bond requirements to cover at least 99% of expected price changes and foreign currency changes for a given asset within a given historical period with further quantitative and qualitative considerations. Haircuts vary depending on the type of collateral and maturity.  We mark-to-market open positions of clearing firms at least once a day (twice a day for futures and options contracts) and require payment from clearing firms whose positions have lost value and make payments to clearing firms whose positions have gained value. We have the capability to mark-to-market more frequently as market conditions warrant. These practices allow our clearing house to quickly identify any clearing firms that may not be able to satisfy the financial obligations resulting from changes in the prices of their open positions before those financial obligations become exceptionally large and jeopardize the ability of our clearing house to ensure performance of their open positions. \nAlthough we have policies and procedures to help ensure that our clearing firms can satisfy their obligations, these policies and procedures may not succeed in detecting problems or preventing defaults. We also have in place various measures intended to enable us to cover any default and maintain liquidity. \nDespite our safeguards, we cannot guarantee that these measures will be sufficient to protect us from a default or that we will not be materially and adversely affected in the event of a significant default.\n47\nTable of Contents\nWe maintain two separate financial safeguard packages: \n•\na financial safeguard package for all futures, options and OTC swap contracts other than cleared interest rate swap contracts (base package); and\n•\na financial safeguard package for cleared interest rate swap contracts.\nIn the unlikely event of a payment default by a clearing firm, we would first apply assets of the defaulting clearing firm to satisfy its payment obligation. These assets include the defaulting firm's guaranty fund contributions, performance bonds and any other available assets, such as assets required for clearing membership and any associated trading rights. Thereafter, if the payment default remains unsatisfied, we would use our corporate contributions designated for the respective financial safeguard package. We would then use guaranty fund contributions of other clearing firms within the respective financial safeguard package and funds collected through an assessment against non-defaulting clearing firms within the respective financial safeguard package to satisfy the deficit.\nWe maintain a $7.0 billion 364-day multi-currency line of credit with a consortium of domestic and international banks to be used in certain situations by our clearing house. We have the option to request an increase in the line from $7.0 billion to $10.0 billion. We may use the proceeds to provide temporary liquidity in the unlikely event of a clearing firm default, in the event of a liquidity constraint or default by a depositary (custodian of the collateral) or in the event of a temporary disruption with the  payments systems that would delay payment of settlement variation between us and our clearing firms. The credit agreement requires us to pledge certain assets to the line of credit custodian prior to drawing on the line of credit. Pledged assets may include clearing firm guaranty fund deposits held by us in the form of cash or U.S. Treasury securities. Performance bond collateral of a defaulting clearing firm may also be used to secure a draw on the line. In addition to the 364-day multi-currency line of credit, we also have the option to use our $2.3 billion multi-currency revolving senior credit facility to provide liquidity for our clearing house in the unlikely event of default. \nWe maintain committed repurchase facility agreements amounting to a total of $1.0 billion.  The committed repurchase facilities provide access to cash, secured by non-cash collateral, in the event that one or more of our clearing firms fails to promptly discharge an obligation to the clearing house.  The facilities are subject to annual renewal. We currently do not have any borrowings outstanding under these facilities.\nWe also maintain a committed facility of up to $750.0 million for foreign currency conversions. The committed foreign currency facility allows the clearing house to convert cash to another currency within generally accepted local market timeframes in the event that one or more of our clearing firms fails to promptly discharge an obligation to the clearing house.  The facility is subject to annual renewal. We currently do not have any foreign currency trades outstanding under this facility.\nAt December 31, 2024, aggregate performance bond deposits for clearing firms for both financial safeguard packages was $291.5 billion, including cash performance bond deposits, non-cash deposits, Interest Earnings Facility funds and letters of credit. A defaulting firm's performance bond deposits can be used in the event of default of that clearing firm. \nThe following shows the available assets at December 31, 2024 in the event of a payment default by a clearing firm for the base financial safeguard package after first utilizing the defaulting firm's available assets: \n(in millions)\nClearing House\nAvailable Assets\nDesignated corporate contributions for futures and options\n(1)\n$\n100.0 \nGuaranty fund contributions\n(2)\n8,254.3 \nAssessment powers\n(3)\n22,699.2 \n_______________\n(1)\nOur clearing house designates $100.0 million of corporate contributions to satisfy a clearing firm default in the event that the defaulting clearing firm's guaranty contributions and performance bonds do not satisfy the deficit.  \n(2)\nGuaranty fund contributions of clearing firms include guaranty fund contributions required of clearing firms, but do not include any excess deposits held by us at the direction of clearing firms. \n(3)\nIn the event of a clearing firm default, if a loss continues to exist after the utilization of the assets of the defaulted firm, our corporate contribution and the non-defaulting clearing firms' guaranty fund contributions, we would assess all non-defaulting clearing firm as provided in the rules governing the guaranty fund. We could assess non-defaulting clearing firms 275% of their existing guaranty fund requirements in the event of a single default, and up to a maximum of 550% of their existing guaranty fund requirements in the event of a default by multiple clearing firms, as provided in the rules. Assessment powers are calculated to reflect the potential obligation that each clearing member could be called for in the event clearing member defaults exhaust the guaranty fund; however, the total amount available would be reduced by the defaulted clearing firms' assessment obligations since they would no longer be able to satisfy their obligations.\n48\nTable of Contents\nThe following shows the available assets for the interest rate swap financial safeguard package at December 31, 2024 in the event of a payment default by a clearing firm that clears interest rate swap contracts, after first utilizing the defaulting firm's available assets: \n(in millions)\nClearing House\nAvailable Assets\nDesignated corporate contributions for interest rate swap contracts\n(1)\n$\n150.0 \nGuaranty fund contributions\n(2)\n1,798.9 \nAssessment powers\n(3)\n905.7 \n_______________\n(1)\nOur clearing house designates $150.0 million of corporate contributions to satisfy a clearing firm default in the event that the defaulting clearing firm's guaranty contributions and performance bonds do not satisfy the deficit.  \n(2)\nGuaranty fund contributions of clearing firms include guaranty fund contributions required of clearing firms, but do not include any excess deposits held by us at the direction of clearing firms. \n(3)\nIn the event of a clearing firm default, if a loss continues to exist after the utilization of the assets of the defaulted firm, our corporate contribution and the non-defaulting firms' guaranty fund contributions, we would assess non-defaulting clearing firms as provided in the rules governing the interest rate swap guaranty fund. Assessment powers are calculated to reflect the potential obligation that each clearing member could be called for based on potential failure of the third and fourth largest clearing member; however, the total amount available would be reduced by the defaulted clearing firms' assessment obligations since they would no longer be able to satisfy their obligations.\nBrokerTec Americas Matched Principal Business\nBrokerTec Americas maintains a matched principal business, where it serves as a fully matched counterparty to offsetting positions entered into by clients on its electronic trading platform to facilitate anonymity and access to clearing and settlement. BrokerTec Americas uses Fixed Income Clearing Corporation (FICC), a third-party central clearing house as well as a third-party clearing bank for the settlement of transactions and is required to post short-term margin requirements twice a day that can vary based on the size of unsettled transactions and any adverse market changes. At December 31, 2024, the balance of the collateral at FICC\n was $230.0 million, wh\nich was included in other current assets on the consolidated balance sheet.  \nWithout sufficient funds to meet its obligations, BrokerTec Americas could be exposed to risk of breach of contract with the counterparties and the inability to continue as a member of the third-party central clearing house. Transactions with clearing house members are typically confirmed and novated shortly after execution, at which point the clearing house assumes the risk of settlement. For transactions with counterparties that are not members of the third-party clearing house, settlement typically occurs on the day following execution and, prior to settlement, BrokerTec Americas is exposed to the risk of loss in the event a counterparty fails to meet its obligations. If that were to occur, BrokerTec Americas would have the right to cover or liquidate the open position but could incur a loss as a result of market movements.\nForeign Currency Exchange Rate Risk\nForeign Currency Transaction Risk \nWe have foreign currency transaction risk related to changes in exchange rates on monetary assets, liabilities, revenues and expenses held at subsidiaries where those balances and activity are denominated in a currency other than the subsidiary's functional currency. Gains and losses on foreign currency transactions result primarily from cash, debt and other monetary assets, liabilities, revenues and expenses denominated in British pounds, euros and Japanese yen. \nAggregate transaction gains (losses) for 2024, 2023 and 2022 were $(3.0) million, $(12.9) million and $13.2 million, respectively. We expect the foreign currency gain/loss to continue to fluctuate as long as we continue to hold monetary assets and liabilities at those subsidiaries. Market uncertainty could potentially lead to significant volatility with foreign currency exchange rates, which could result in additional foreign currency gain/loss.  \nForeign Currency Translation Risk \nWe have foreign currency translation risk related to the translation of our foreign consolidated and unconsolidated subsidiaries' assets, liabilities, revenues and expenses from their respective functional currencies to the U.S. dollar at each reporting date. Fluctuations in exchange rates may impact the amount of assets, liabilities, revenues and expenses we report on our consolidated balance sheets and consolidated statements of income. The financial statements of those foreign subsidiaries with functional currencies other than the U.S. dollar are translated into U.S. dollars using a current exchange rate. Gains and losses resulting from this translation are recognized as a foreign currency translation adjustment within accumulated other comprehensive income, which is a component of shareholders' equity and comprehensive income. Aggregate translation gains (losses) for 2024, 2023 and 2022 were $(61.0) million, $70.8 million and $(195.4) million, respectively. \n49\nTable of Contents\nForeign Currency Exchange Risk Related to Customer Collateral\nA portion of performance bond deposits is denominated in various foreign currencies. We mark-to-market all deposits daily and require payment from clearing firms whose collateral has lost value due to changes in foreign currency rates and price.  Therefore, our exposure to foreign currency risk related to performance bond deposits is considered minimal and is not expected to be material to our financial condition or operating results.\n50\nTable of Contents\nITEM 8.    FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nCME GROUP INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\n(dollars in millions, except per share data; shares in thousands)\n \nDecember 31,\n \n2024\n2023\nAssets\nCurrent Assets:\nCash and cash equivalents\n$\n2,892.4\n \n$\n2,912.0\n \nMarketable securities\n113.2\n \n111.7\n \nAccounts receivable, net of allowance of $9.0 and $7.1\n573.1\n \n535.6\n \nOther current assets (includes $6.3 and $5.2 in restricted cash)\n559.4\n \n1,138.4\n \nPerformance bonds and guaranty fund contributions\n98,895.4\n \n90,192.5\n \nTotal current assets\n103,033.5\n \n94,890.2\n \nProperty, net\n386.2\n \n409.5\n \nIntangible assets—trading products\n17,175.3\n \n17,175.3\n \nIntangible assets—other, net\n2,821.6\n \n3,050.2\n \nGoodwill\n10,486.9\n \n10,495.3\n \nOther assets\n3,543.5\n \n3,685.6\n \nTotal Assets\n$\n137,447.0\n \n$\n129,706.1\n \nLiabilities and Equity\nCurrent Liabilities:\nAccounts payable\n$\n79.9\n \n$\n90.6\n \nShort-term debt\n749.8\n \n—\n \nOther current liabilities\n2,588.8\n \n3,133.8\n \nPerformance bonds and guaranty fund contributions\n98,895.4\n \n90,192.5\n \nTotal current liabilities\n102,313.9\n \n93,416.9\n \nLong-term debt\n2,678.2\n \n3,425.4\n \nDeferred income tax liabilities, net\n5,246.8\n \n5,327.7\n \nOther liabilities\n721.2\n \n798.2\n \nTotal Liabilities\n110,960.1\n \n102,968.2\n \nShareholders’ Equity:\nPreferred stock, $0.01 par value, 10,000 shares authorized as of December 31, 2024 and 2023; 4,584 issued and outstanding as of December 31, 2024 and 2023\n—\n \n—\n \nClass A common stock, $0.01 par value, 1,000,000 shares authorized as of December 31, 2024 and 2023, 359,602 and 359,231 shares issued and outstanding as of December 31, 2024 and 2023, respectively\n3.6\n \n3.6\n \nClass B common stock, $0.01 par value, 3 shares authorized, issued and outstanding as of December 31, 2024 and 2023\n—\n \n—\n \nAdditional paid-in capital\n22,403.0\n \n22,334.7\n \nRetained earnings\n4,185.8\n \n4,455.2\n \nAccumulated other comprehensive income (loss)\n(\n105.5\n)\n(\n55.6\n)\nTotal CME Group shareholders’ equity\n26,486.9\n \n26,737.9\n \nTotal Liabilities and Equity\n$\n137,447.0\n \n$\n129,706.1\n \nSee accompanying notes to consolidated financial statements.\n51\nTable of Contents\nCME GROUP INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF INCOME\n(dollars in millions, except per share data; shares in thousands)\n \nYear Ended December 31,\n \n2024\n2023\n2022\nRevenues\nClearing and transaction fees\n$\n4,988.2\n \n$\n4,588.5\n \n$\n4,142.7\n \nMarket data and information services\n710.2\n \n663.7\n \n610.9\n \nOther\n431.7\n \n326.7\n \n265.8\n \nTotal Revenues\n6,130.1\n \n5,578.9\n \n5,019.4\n \nExpenses\nCompensation and benefits\n850.3\n \n828.6\n \n753.1\n \nTechnology\n255.8\n \n218.7\n \n188.6\n \nProfessional fees and outside services\n132.7\n \n144.4\n \n137.4\n \nAmortization of purchased intangibles\n221.7\n \n226.6\n \n227.7\n \nDepreciation and amortization\n115.1\n \n126.0\n \n134.9\n \nLicensing and other fee agreements\n355.4\n \n322.8\n \n320.0\n \nOther\n267.6\n \n276.1\n \n241.8\n \nTotal Expenses\n2,198.6\n \n2,143.2\n \n2,003.5\n \nOperating Income\n3,931.5\n \n3,435.7\n \n3,015.9\n \nNon-Operating Income (Expense)\nInvestment income\n4,079.1\n \n5,275.3\n \n2,198.4\n \nInterest and other borrowing costs\n(\n160.9\n)\n(\n159.4\n)\n(\n162.7\n)\nEquity in net earnings (losses) of unconsolidated subsidiaries\n350.9\n \n296.9\n \n301.1\n \nOther non-operating income (expense)\n(\n3,659.2\n)\n(\n4,694.9\n)\n(\n1,862.4\n)\nTotal Non-Operating Income (Expense)\n609.9\n \n717.9\n \n474.4\n \nIncome before Income Taxes\n4,541.4\n \n4,153.6\n \n3,490.3\n \nIncome tax provision\n1,015.6\n \n927.4\n \n799.3\n \nNet Income\n$\n3,525.8\n \n$\n3,226.2\n \n$\n2,691.0\n \nNet Income Attributable to Common Shareholders of CME Group\n$\n3,481.5\n \n$\n3,185.6\n \n$\n2,657.2\n \nEarnings per Share Attributable to Common Shareholders of CME Group:\nBasic\n$\n9.69\n \n$\n8.87\n \n$\n7.41\n \nDiluted\n9.67\n \n8.86\n \n7.40\n \nWeighted Average Number of Common Shares:\nBasic\n359,389\n \n359,023\n \n358,713\n \nDiluted\n359,944\n \n359,500\n \n359,181\n \nSee accompanying notes to consolidated financial statements.\n52\nTable of Contents\nCME GROUP INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(in millions)\nYear Ended December 31,\n2024\n2023\n2022\nNet income\n$\n3,525.8\n \n$\n3,226.2\n \n$\n2,691.0\n \nOther comprehensive income, net of tax:\nInvestment securities:\nNet unrealized holding gains (losses) arising during the period\n0.2\n \n0.6\n \n(\n2.7\n)\nIncome tax benefit (expense)\n(\n0.1\n)\n(\n0.1\n)\n0.7\n \nInvestment securities, net\n0.1\n \n0.5\n \n(\n2.0\n)\nDefined benefit plans:\nNet change in defined benefit plans arising during the period\n12.2\n \n(\n0.9\n)\n14.9\n \nAmortization of net actuarial (gains) losses and prior service costs included in compensation and benefits expense\n0.1\n \n0.1\n \n1.2\n \nIncome tax benefit (expense)\n(\n3.0\n)\n0.2\n \n(\n4.1\n)\nDefined benefit plans, net\n9.3\n \n(\n0.6\n)\n12.0\n \nDerivative investments:\nAmortization of effective portion of net (gains) losses on cash flow hedges included in interest expense\n(\n3.6\n)\n(\n3.6\n)\n(\n1.9\n)\nIncome tax benefit (expense)\n0.9\n \n0.9\n \n0.5\n \nDerivative investments, net\n(\n2.7\n)\n(\n2.7\n)\n(\n1.4\n)\nForeign currency translation:\nForeign currency translation adjustments\n(\n61.0\n)\n70.8\n \n(\n195.4\n)\nReclassification adjustment for (gain) loss included in other expense\n2.2\n \n9.7\n \n—\n \nIncome tax benefit (expense)\n2.2\n \n—\n \n—\n \nForeign currency translation, net\n(\n56.6\n)\n80.5\n \n(\n195.4\n)\nOther comprehensive income (loss), net of tax\n(\n49.9\n)\n77.7\n \n(\n186.8\n)\nComprehensive income \n$\n3,475.9\n \n$\n3,303.9\n \n$\n2,504.2\n \nSee accompanying notes to consolidated financial statements.\n53\nCME GROUP INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF EQUITY\n(dollars in millions, except per share data; shares in thousands)\n     \nPreferred Stock (Shares)\nClass A\nCommon\nStock\n(Shares)\nClass B\nCommon\nStock\n(Shares)\nCommon\nStock and\nAdditional\nPaid-in\nCapital\nRetained\nEarnings\nAccumulated\nOther\nComprehensive\nIncome (Loss)\nTotal CME Group Shareholders' Equity\nBalance at December 31, 2021\n4,584\n358,599\n3\n$\n22,193.9\n \n$\n5,151.9\n \n$\n53.5\n \n$\n27,399.3\n \nNet income \n2,691.0\n \n2,691.0\n \nOther comprehensive income (loss)\n(\n186.8\n)\n(\n186.8\n)\nDividends of $8.50 per common share and per preferred share\n(\n3,096.1\n)\n(\n3,096.1\n)\nExercise of stock options\n1\n0.1\n \n0.1\n \nVesting of issued restricted Class A common stock\n269\n(\n24.8\n)\n(\n24.8\n)\nShares issued to Board of Directors\n19\n4.0\n \n4.0\n \nShares issued under Employee Stock Purchase Plan\n41\n7.7\n \n7.7\n \nStock-based compensation\n84.3\n \n84.3\n \nBalance at December 31, 2022\n4,584\n358,929\n3\n$\n22,265.2\n \n$\n4,746.8\n \n$\n(\n133.3\n)\n$\n26,878.7\n \n \nSee accompanying notes to consolidated financial statements.\n54\nCME GROUP INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF EQUITY\n (continued)\n(dollars in millions, except per share data; shares in thousands)\n \nPreferred Stock (Shares)\nClass A\nCommon\nStock\n(Shares)\nClass B\nCommon\nStock\n(Shares)\nPreferred Stock, Common\nStock and\nAdditional\nPaid-in\nCapital\nRetained\nEarnings\nAccumulated\nOther\nComprehensive\nIncome (Loss)\nTotal CME Group Shareholders' Equity\nBalance at December 31, 2022\n4,584\n358,929\n3\n$\n22,265.2\n \n$\n4,746.8\n \n$\n(\n133.3\n)\n$\n26,878.7\n \nNet income\n3,226.2\n \n3,226.2\n \nOther comprehensive income (loss)\n77.7\n \n77.7\n \nDividends of $9.65 per common share and preferred share\n(\n3,517.8\n)\n(\n3,517.8\n)\nVesting of issued restricted Class A common stock\n241\n(\n21.4\n)\n(\n21.4\n)\nShares issued to Board of Directors\n20\n3.6\n \n3.6\n \nShares issued under Employee Stock Purchase Plan\n41\n8.0\n \n8.0\n \nStock-based compensation\n82.9\n \n82.9\n \nBalance at December 31, 2023\n4,584\n359,231\n3\n$\n22,338.3\n \n$\n4,455.2\n \n$\n(\n55.6\n)\n$\n26,737.9\n \n \nSee accompanying notes to consolidated financial statements.\n55\nCME GROUP INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF EQUITY\n (continued)\n(dollars in millions, except per share data; shares in thousands)\n \nPreferred Stock (Shares)\nClass A\nCommon\nStock\n(Shares)\nClass B\nCommon\nStock\n(Shares)\nPreferred Stock, Common\nStock and\nAdditional\nPaid-in\nCapital\nRetained\nEarnings\nAccumulated\nOther\nComprehensive\nIncome (Loss)\nTotal CME Group Shareholders' Equity\nBalance at December 31, 2023\n4,584\n359,231\n3\n$\n22,338.3\n \n$\n4,455.2\n \n$\n(\n55.6\n)\n$\n26,737.9\n \nNet income \n3,525.8\n \n3,525.8\n \nOther comprehensive income (loss)\n(\n49.9\n)\n(\n49.9\n)\nDividends of $10.40 per common share and preferred share\n(\n3,795.2\n)\n(\n3,795.2\n)\nVesting of issued restricted Class A common stock\n315\n(\n33.0\n)\n(\n33.0\n)\nShares issued to Board of Directors\n19\n3.7\n \n3.7\n \nShares issued under Employee Stock Purchase Plan\n37\n8.1\n \n8.1\n \nStock-based compensation\n89.5\n \n89.5\n \nBalance at December 31, 2024\n4,584\n359,602\n3\n$\n22,406.6\n \n$\n4,185.8\n \n$\n(\n105.5\n)\n$\n26,486.9\n \n \nSee accompanying notes to consolidated financial statements.\n56\nTable of Contents\nCME GROUP INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in millions)\n \nYear Ended December 31,\n \n2024\n2023\n2022\nCash Flows from Operating Activities\nNet income\n$\n3,525.8\n \n$\n3,226.2\n \n$\n2,691.0\n \nAdjustments to reconcile net income to net cash provided by operating activities:\nStock-based compensation\n89.5\n \n82.9\n \n84.3\n \nAmortization of purchased intangibles\n221.7\n \n226.6\n \n227.7\n \nDepreciation and amortization\n115.1\n \n126.0\n \n134.9\n \nNet realized and unrealized (gains)/losses on investments\n(\n3.6\n)\n(\n72.1\n)\n(\n4.8\n)\nDeferred income taxes\n(\n66.4\n)\n(\n75.0\n)\n(\n23.2\n)\nChange in:\nAccounts receivable\n(\n39.4\n)\n(\n51.5\n)\n(\n51.1\n)\nOther current assets\n664.8\n \n(\n637.8\n)\n(\n76.5\n)\nOther assets\n75.4\n \n92.0\n \n87.0\n \nAccounts payable\n(\n10.7\n)\n(\n30.8\n)\n72.5\n \nIncome taxes payable\n(\n117.4\n)\n(\n77.1\n)\n(\n147.8\n)\nOther current liabilities\n(\n705.9\n)\n642.7\n \n88.1\n \nOther liabilities\n(\n55.4\n)\n(\n32.7\n)\n(\n67.4\n)\nOther\n(\n3.0\n)\n34.4\n \n41.3\n \nNet Cash Provided by Operating Activities\n3,690.5\n \n3,453.8\n \n3,056.0\n \nCash Flows from Investing Activities\nProceeds from maturities and sales of available-for-sale marketable securities\n6.0\n \n5.9\n \n6.3\n \nPurchases of available-for-sale marketable securities\n(\n4.5\n)\n(\n4.1\n)\n(\n4.4\n)\nPurchases of property, net\n(\n94.0\n)\n(\n76.4\n)\n(\n89.7\n)\nInvestments in business ventures\n(\n3.6\n)\n(\n2.4\n)\n(\n3.1\n)\nProceeds from sale of business ventures\n13.5\n \n97.9\n \n11.1\n \nInvestment in S&P Dow Jones Indices LLC\n—\n \n—\n \n(\n410.0\n)\nNet Cash Provided by (Used in) Investing Activities\n(\n82.6\n)\n20.9\n \n(\n489.8\n)\nSee accompanying notes to consolidated financial statements.\n57\nTable of Contents\nCME GROUP INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n (continued) \n(in millions)\n \n \nYear Ended December 31,\n \n2024\n2023\n2022\nCash Flows from Financing Activities\nProceeds from debt, net of issuance costs\n$\n—\n \n$\n—\n \n$\n741.0\n \nRepayment of other borrowings, including call premiums\n—\n \n(\n16.4\n)\n(\n756.2\n)\nCash dividends\n(\n3,584.2\n)\n(\n3,235.5\n)\n(\n2,633.5\n)\nChange in performance bond and guaranty fund contributions\n8,702.9\n \n(\n45,056.7\n)\n(\n22,700.3\n)\nEmployee taxes paid on restricted stock vesting\n(\n33.0\n)\n(\n21.4\n)\n(\n24.8\n)\nOther\n(\n9.2\n)\n(\n9.3\n)\n(\n7.9\n)\nNet Cash Provided by (Used in) Financing Activities\n5,076.5\n \n(\n48,339.3\n)\n(\n25,381.7\n)\nNet change in cash, cash equivalents, restricted cash and restricted cash equivalents\n8,684.4\n \n(\n44,864.6\n)\n(\n22,815.5\n)\nCash, cash equivalents, restricted cash and restricted cash equivalents, beginning of period\n93,109.7\n \n137,974.3\n \n160,789.8\n \nCash, Cash Equivalents, Restricted Cash and Restricted Cash Equivalents, End of Period\n$\n101,794.1\n \n$\n93,109.7\n \n$\n137,974.3\n \nReconciliation of cash, cash equivalents, restricted cash and restricted cash equivalents:\nCash and cash equivalents\n$\n2,892.4\n \n$\n2,912.0\n \n$\n2,720.1\n \nShort-term restricted cash (within other current assets)\n6.3\n \n5.2\n \n4.9\n \nLong-term restricted cash (within other assets)\n—\n \n—\n \n0.1\n \nRestricted cash and restricted cash equivalents (performance bonds and guaranty fund contributions)\n98,895.4\n \n90,192.5\n \n135,249.2\n \nTotal\n$\n101,794.1\n \n$\n93,109.7\n \n$\n137,974.3\n \nSupplemental Disclosure of Cash Flow Information\nIncome taxes paid\n$\n1,197.6\n \n$\n1,109.4\n \n$\n973.4\n \nInterest paid\n129.9\n \n129.9\n \n133.2\n \nNon-cash financing activities:\nDeclaration of annual variable dividend, payable in January 2025, January 2024 and January 2023\n2,112.2\n \n1,910.0\n \n1,635.7\n \n \nSee accompanying notes to consolidated financial statements.\n58\nTable of Contents\nCME GROUP INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1. \nORGANIZATION AND BUSINESS \nCME Group Inc. (CME Group) exchanges offer the widest range of global benchmark products across all major asset classes based on interest rates, equity indexes, foreign exchange (FX), agricultural, energy and metal commodities. We offer futures and options across asset classes as well as cash, repo fixed income and OTC FX trading through the CME Globex platform. In addition, it operates one of the world’s leading central counterparty clearing houses.  CME Group offers clearing, settlement and guarantees for all products cleared through the clearing house, which is operated by CME.\nChicago Mercantile Exchange Inc. (CME), the Board of Trade of the City of Chicago, Inc. (CBOT), New York Mercantile Exchange, Inc. (NYMEX) and Commodity Exchange, Inc. (COMEX), wholly-owned subsidiaries of CME Group, are designated contract markets for the trading of futures and options contracts. \nCME Group and its subsidiaries are referred to collectively as \"the company\" in the notes to the consolidated financial statements.\n \n2. \nSUMMARY OF SIGNIFICANT ACCOUNTING POLICIES \nBasis of Presentation. \nThe accompanying consolidated financial statements are prepared in accordance with accounting principles generally accepted in the U.S. and include the accounts of the company and its subsidiaries.  All intercompany transactions and balances have been eliminated.\n \nUse of Estimates.\n The preparation of consolidated financial statements requires management to make estimates and assumptions that affect the reported amounts and the disclosure of contingent amounts on the consolidated financial statements and accompanying notes.  Estimates are based on historical experience, where applicable, and assumptions management believes are reasonable under the circumstances.  Due to the inherent uncertainty involved with estimates, actual results may differ.\n \nCash and Cash Equivalents.\n Cash and cash equivalents consist of cash and highly liquid investments with a maturity of three months or less at the time of purchase.\n \nFinancial Investments.  \nThe company maintains short-term and long-term investments, classified as equity method investments, available-for-sale debt securities, equity investments in privately-held entities and trading securities.  Available-for-sale debt securities are carried at fair value, with unrealized gains and losses, net of deferred income taxes, reported as a component of accumulated other comprehensive income.  Trading securities held in connection with non-qualified deferred compensation plans are recorded at fair value, with net realized and unrealized gains and losses and dividend income reported as investment income. For equity investments in privately-held entities that do not have a readily determinable fair value, our accounting policy is to utilize the measurement alternative for valuation of these investments, which permits the company to estimate fair value at cost minus impairment, plus or minus changes resulting from observable price movements. Additionally, the company maintains long-term investments accounted for under the equity method, which requires that the company recognize its share of net income (loss) and other comprehensive income (loss) in the investee as an adjustment to the carrying amount of the investment each reporting period.\nThe company reviews its investment portfolio at least quarterly, as well as whenever facts or circumstances exist which indicate that the carrying value of an investment is greater than its fair value. For investments not carried at fair value, the carrying value of the investment is reduced to its fair value and a corresponding impairment expense is charged to earnings, if events and circumstances indicate that a markdown to fair value is warranted. Declines in the fair value of available-for-sale debt securities that are deemed to represent indicators of impairment are charged to earnings as a realized loss.\nFair Value of Financial Instruments.\n The company uses a three-level classification hierarchy of fair value measurements that establishes the quality of inputs used to measure fair value. The fair value of a financial instrument is the amount that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date.  The fair value of financial instruments is determined using various techniques that involve some level of estimation and judgment, the degree of which is dependent on the price transparency and the complexity of the instruments.\n \nDerivative Investments. \nThe company occasionally uses derivative instruments to limit exposure to changes in interest rates and foreign currency exchange rates.  Derivatives are recorded at fair value on the consolidated balance sheets. For those derivatives that meet the criteria for hedge accounting and are classified as effective cash flow hedges, changes in the fair value of derivative financial instruments are initially recorded in other comprehensive income and subsequently reclassified into earnings when the hedged item affects income. The company assesses, both at the inception of each hedge and on an ongoing basis, whether the derivative financial instruments that are designated as cash flow hedging transactions are highly effective in offsetting changes in cash flows of the hedged items. For any hedges no longer deemed effective or for which hedge accounting \n59\nTable of Contents\nis not applied, changes in fair value of the derivative instruments are recognized in earnings within other non-operating income (expense). There were no outstanding derivative instruments at December 31, 2024.\nAccounts Receivable. \nAccounts receivable are comprised of trade receivables and unbilled revenue. All accounts receivable are stated at net realizable value. Exposure to losses on receivables for clearing and transaction fees and other amounts owed by clearing and trading firms is dependent on each firm's financial condition. With respect to clearing firms, our credit loss exposure is mitigated by the memberships that collateralize fees owed to the company. The company retains the right to liquidate exchange memberships to satisfy an outstanding receivable. The allowance for doubtful accounts is calculated based on management's assessment of future expected losses over the life of the receivable, historical trends and the current economic environment within which we operate.\n \nPerformance Bonds and Guaranty Fund Contributions. \nPerformance bonds and guaranty fund contributions held for clearing firms may be in the form of cash, securities or other non-cash deposits. \nPerformance bonds and guaranty fund contributions received in the form of cash held by CME may be invested in U.S. government securities, U.S. government agency securities and certain foreign government securities acquired through and held by a bank or broker-dealer subsidiary of a bank, a cash account at the Federal Reserve Bank of Chicago, investments in highly rated government securities, money market funds or through CME's Interest Earning Facility (IEF) program. Any interest earned on these investments accrues to CME and is included in investment income on the consolidated statements of income. CME may distribute any interest earned on its investments to the clearing firms at its discretion. Because CME has control of the cash collateral and the benefits and market risks of ownership accrue to CME, cash performance bonds and guaranty fund contributions are reflected on the consolidated balance sheets. The cash performance bonds and guaranty fund contributions are considered restricted cash as the cash deposits cannot be used for the company's operations or to satisfy any operational liabilities. Cash performance bonds and guaranty fund contributions are included as restricted cash and restricted cash equivalents on the consolidated statements of cash flows.\nSecurities and other non-cash deposits may include U.S. Treasury securities, U.S. government agency securities, Eurobonds, corporate bonds, other foreign government securities and gold bullion. Securities and other non-cash deposits are held in safekeeping by a custodian bank. Interest and gains or losses on securities deposited to satisfy performance bond and guaranty fund requirements accrue to the clearing firm. Non-cash performance bonds can also include letters of credit. Because the benefits and risks of ownership accrue to the clearing firm, non-cash performance bonds and guaranty fund contributions are not reflected on the consolidated balance sheets.\n \nProperty. \nProperty is stated at cost, less accumulated depreciation and amortization. Depreciation and amortization are calculated using the straight-line method, generally over one to twenty years. Property and equipment are depreciated over their estimated useful lives. Leasehold improvements are amortized over the shorter of the remaining term of the respective lease to which they relate or the remaining useful life of the leasehold improvement. Land is reported at cost. Internal and external costs incurred in developing, obtaining, or implementing computer software for internal use which meet the requirements for capitalization are amortized on a straight-line basis over the estimated useful life of the software, generally two to four years, but up to eight years for certain trading and clearing applications, depending upon expected useful lives.\n \nLeases.  \nThe company accounts for our leases of office space as operating leases. Landlord allowances are recorded as a direct reduction to the capitalized lease asset, which is reported in other assets and amortized to rent expense over the term of the lease. Both lease and direct non-lease costs are accounted for as a single lease component for purposes of capitalization on the consolidated balance sheets.The associated lease liability represents the present value of lease payments remaining in the lease term and is recorded within current and other liabilities depending upon the balance sheet classification of the payment obligations as short-term or long-term.  For sale leaseback transactions, the company evaluates the sale and the lease arrangement based on the company's conclusion as to whether control of the underlying asset has been transferred and recognizes the sale leaseback as either a sale transaction or under the financing method, which requires the asset to remain on the consolidated balance sheets throughout the term of the lease and the proceeds to be recognized as a financing obligation. A portion of the lease payments is recognized as a reduction of the financing obligation and a portion is recognized as interest expense based on an imputed interest rate.\n \nGoodwill and Other Intangible Assets.\n Goodwill represents the excess of the purchase price over the fair value of the net assets acquired in a business combination. The company reviews goodwill for impairment at least quarterly and whenever events or circumstances indicate that the carrying value may not be recoverable. The company may test goodwill quantitatively for impairment by comparing the carrying value of a reporting unit to its estimated fair value.  Estimating the fair value of a reporting unit involves significant judgments inherent in the analysis, including estimating the amount and timing of future cash flows and the selection of appropriate discount rates and long-term growth rate assumptions. Changes in these estimates and assumptions could materially affect the determination of fair value for the reporting unit.  If the carrying amount exceeds fair value, an impairment loss is recorded.  In certain circumstances, goodwill may be reviewed qualitatively for indications of impairment without utilizing valuation techniques to estimate fair value. \n60\nTable of Contents\nThe company performs an impairment assessment of indefinite-lived intangible assets at least quarterly or whenever events or circumstances indicate that their carrying values may not be recoverable. If the indefinite-lived intangible asset carrying value exceeds its fair value, an impairment loss is recognized in an amount equal to that excess.  Estimating the fair value of indefinite-lived intangible assets involves the use of valuation techniques that rely on significant estimates and assumptions, including forecasted revenue growth rates, forecasted allocations of expense and risk-adjusted discount rates.  Changes in these estimates and assumptions could materially affect the determination of fair value for indefinite-lived intangible assets.  In certain circumstances, indefinite-lived intangible assets may be reviewed qualitatively for indications of impairment without utilizing valuation techniques to estimate fair value.\nIntangible assets subject to amortization are also assessed for impairment at least quarterly or when indicated by a change in economic or operational circumstances. The impairment assessment of these assets requires management to first compare the carrying value of the amortizing asset to undiscounted net cash flows. If the carrying value exceeds the undiscounted net cash flows, management is then required to estimate the fair value of the assets and record an impairment loss for the excess of the carrying value over the fair value. In connection with this impairment assessment, management also challenges the useful lives of our amortizing intangible assets.\n \nBusiness Combinations.\n The company accounts for business combinations using the acquisition method. The method requires the acquirer to recognize the assets acquired, liabilities assumed, and any non-controlling interest in the acquiree at the acquisition date, measured at their fair values as of that date.  The company may use independent valuation services to assist in determining the estimated fair values.\n \nEmployee Benefit Plans. \nThe company recognizes the funded status of defined benefit postretirement plans on its consolidated balance sheets. Changes in that funded status are recognized in the year of change in other comprehensive income (loss). Plan assets and obligations are measured at year end. The company recognizes future changes in actuarial gains and losses and prior service costs in the year in which the changes occur through accumulated other comprehensive income (loss).\n \nForeign Currency Translation and Re-measurement\n. Foreign currency denominated monetary assets and liabilities are re-measured into the functional currency using period-end exchange rates.  Gains and losses from foreign currency transactions and re-measurement of monetary assets and liabilities into the functional currency are included in other expense on the accompanying consolidated statements of income.  When the functional currency differs from the reporting currency, revenues and expenses of foreign subsidiaries are translated from their functional currencies into U.S. dollars using weighted-average exchange rates while their assets and liabilities are translated into U.S. dollars using period-end exchange rates. Gains and losses resulting from foreign currency translations are included in accumulated other comprehensive income (loss) within shareholders' equity.\n \nRevenue Recognition. \nRevenue recognition policies for specific sources of revenue are discussed below. \nClearing and Transaction Fees.\n Clearing and transaction fees include per-contract charges for trade matching, clearing, trading on the company's electronic trading platforms, portfolio reconciliation and compression services, risk mitigation,  and other fees. Fees are charged at various rates based on the product traded, the method of trade, the exchange trading privileges of the customer making the trade and the type of contract. The majority of our clearing and transaction fees are recognized as revenue upon successful execution of the trade, which represents completion of our trade matching, novation and clearing activities. Therefore, unfilled or canceled buy and sell orders have no impact on revenue. On occasion, the customer's exchange trading privileges may not be properly entered by the clearing firm and incorrect fees are charged for the transactions. When this information is corrected within the time period allowed by the company, a fee adjustment is provided to the clearing firm. A reserve is established for estimated fee adjustments to reflect corrections to customer exchange trading privileges. The reserve is based on the historical pattern of adjustments processed as well as management's estimate of future adjustment activity. This reserve has historically been immaterial. The company believes the reserve is adequate to cover estimated adjustments as of December 31, 2024 and 2023.  \nMarket Data and Information Services. \nMarket data and information services represent revenue earned for the dissemination of market information. Revenues are accrued each month based on the number of devices reported by vendors or over a straight line basis in accordance with the market data subscription contract term. The company conducts periodic examinations of the number of devices reported and assesses additional fees as necessary. On occasion, customers will pay for services in a lump sum payment; however, revenue is recognized as services are provided. \nOther Revenues. \nOther revenues include access and communication fees, fees for collateral management, equity membership subscription fees and fees for trade order routing through agreements from various strategic relationships as well as other services to customers. Revenue is recognized as services are provided. \nConcentration of Revenue.\n One clearing firm represented at least approximately \n10\n% of the company's clearing and transaction fee revenue in 2024 and 2022, but no clearing firms represented at least approximately \n10\n% of the company's clearing and transaction fee revenue in 2023. Should a clearing firm withdraw from the company, management believes \n61\nTable of Contents\nthat the customer portion of that firm's trading activity would likely transfer to another clearing firm. Therefore, management does not believe that the company is exposed to significant risk from the ongoing loss of revenue received from a particular clearing firm. \nThe two largest resellers of market data represented approximately \n30\n% of market data and information services revenue in 2024, \n32\n% in 2023, and \n33\n% in 2022. Should one of these vendors no longer subscribe to the company's market data, management believes that the majority of that firm's customers would likely subscribe to the market data through another reseller. Therefore, management does not believe that the company is exposed to significant risk from a loss of revenue received from any particular market data reseller.\n \nShare-Based Payments.\n The company accounts for share-based payments at fair value, which is based on the grant date price of the equity awards issued. The company recognizes expense relating to stock-based compensation on an accelerated basis. As a result, the expense associated with each vesting date within a stock grant is recognized over the period of time that each portion of that grant vests. Forfeitures are recognized in the period in which they occur.\n \nMarketing Costs.\n Marketing costs are incurred for the production and communication of advertising as well as other marketing activities. These costs are expensed when incurred, except for costs related to the production of broadcast advertising, which are expensed when the first broadcast occurs.\n \nIncome Taxes.\n Deferred income taxes arise from temporary differences between the tax basis and book basis of assets and liabilities. A valuation allowance is recognized if it is anticipated that some or all of a deferred tax asset may not be realized. The company accounts for uncertainty in income taxes recognized in its consolidated financial statements by using a more-likely-than-not recognition threshold based on the technical merits of the tax position taken or expected to be taken. The company recognizes interest and penalties related to uncertain tax positions in income tax expense.\n \nSegment Reporting. \nThe company reports the results of its operations as one operating segment primarily comprised of the businesses of CME, CBOT, NYMEX, COMEX and our cash markets business. The individual operations of the company do not meet the criteria for classification as separate reporting segments.\n \nRecent Accounting Pronouncements. \nThe following accounting pronouncements were issued during 2024:\nIn November 2024, the FASB issued final guidance requiring public business entities to provide disclosures, in tabular format, of each relevant expense line item on the face of the income statement in continuing operations as disaggregated into the following: purchases of inventory, employee compensation, depreciation, intangible asset amortization and depreciation, depletion and amortization of capitalized acquisition, exploration and development costs recognized as part of oil- and gas-producing activities, or other amounts of depletion expense. Specified expenses, gains, or losses that are already disclosed under existing U.S. GAAP are required to be included in the disaggregated income statement expense line item disclosures, and any remaining amounts need to be described qualitatively. The disclosures are effective beginning in 2027, and required on an annual and interim basis. Entities may apply the guidance prospectively or retrospectively. Early adoption is permitted. Adoption of this guidance is not expected to have a material impact on our consolidated financial statements.\n3. \nREVENUE RECOGNITION\nThe company generates revenue from customers from the following sources:\nClearing and transaction fees.\n Clearing and transaction fees include per-contract charges for trade matching, clearing, trading on the company's electronic trading platforms, portfolio reconciliation and compression services, risk mitigation,  and other fees. Clearing and transaction fees are assessed upfront at the time of trade execution. As such, the company recognizes the majority of the fee revenue upon successful execution of the trade. The minimal remaining portion of the fee revenue related to settlement activities performed after trade execution is recognized over the short-term period that the contract is outstanding, based on management’s estimates of the average contract lifecycle. These estimates are based on various assumptions to approximate the amount of fee revenue to be attributed to services performed through contract settlement, expiration, or termination. For cleared trades, these assumptions include the average number of days that a contract remains in open interest, contract turnover, average revenue per day, and revenue remaining in open interest at the end of each period. \nThe nature of contracts gives rise to several types of variable consideration, including volume-based pricing tiers, customer incentives associated with market maker programs and other fee discounts. The company includes fee discounts and incentives in the estimated transaction price when there is a basis to reasonably estimate the amount of the fee reduction. These estimates are based on historical experience, anticipated performance, and best judgment at the time. Because of the company's certainty in estimating these amounts, they are included in the transaction price of contracts.  \nMarket data and information services.\n Market data and information services represent revenue from the dissemination of market data to subscribers, distributors, and other third-party licensees of market data. Pricing for market data is primarily based on the number of reportable devices used as well as the number of subscribers enrolled under the arrangement. Fees for these services are generally billed monthly. Market data services are satisfied over time and revenue is recognized on a monthly basis \n62\nTable of Contents\nas the customers receive and consume the benefit of the market data services. However, the company also maintains certain annual license arrangements with one-time upfront fees. The fees for annual licenses are initially recorded as a contract liability and recognized as revenue monthly over the term of the annual period. \nOther. \nOther revenues include certain access and communication fees, fees for collateral management, equity membership subscription fees, and fees for trade order routing through agreements from various strategic relationships. Access and communication fees are charged to customers that utilize various telecommunications networks and communications services. Fees for these services are generally billed monthly and the associated fee revenue is recognized as billed. Collateral management fees are charged to clearing firms that have collateral on deposit with the clearing house to meet their minimum performance bond and guaranty fund obligations on the exchange. These fees are calculated based on daily collateral balances and are billed monthly. This fee revenue is recognized monthly as billed as the customers receive and consume the benefits of the services. The company also has an equity membership program which provides equity members the option to pay a monthly subscription fee in satisfaction of their existing requirement to hold CME Group Class A common stock. Choosing to pay this fee in lieu of holding Class A shares is entirely voluntary and the client's choice. Fee revenue under this program is earned monthly as billed over the contractual term. Pricing for strategic relationships may be driven by customer levels and activity. There are fee arrangements which provide for monthly as well as quarterly payments in arrears. Revenue is recognized monthly for strategic relationship arrangements as the customers receive and consume the benefits of the services. \nThe following table represents a disaggregation of revenue from contracts with customers for the years ended December 31, 2024, 2023 and 2022:\n(in millions)\n2024\n2023\n2022\nInterest rates\n$\n1,659.6\n \n$\n1,558.4\n \n$\n1,326.8\n \nEquity indexes\n1,095.3\n \n1,036.4\n \n1,016.3\n \nForeign exchange\n198.5\n \n190.0\n \n188.3\n \nAgricultural commodities\n585.1\n \n508.5\n \n444.7\n \nEnergy\n800.5\n \n702.8\n \n585.5\n \nMetals\n284.3\n \n224.7\n \n196.9\n \nBrokerTec fixed income\n145.1\n \n152.1\n \n164.7\n \nEBS foreign exchange\n131.6\n \n132.6\n \n154.1\n \nInterest Rate Swap\n88.2\n \n83.0\n \n65.4\n \nTotal clearing and transaction fees\n4,988.2\n \n4,588.5\n \n4,142.7\n \nMarket data\n710.2\n \n663.7\n \n610.9\n \nOther\n431.7\n \n326.7\n \n265.8\n \nTotal revenues\n$\n6,130.1\n \n$\n5,578.9\n \n$\n5,019.4\n \nTiming of Revenue Recognition\nServices transferred at a point in time\n$\n4,887.4\n \n$\n4,491.1\n \n$\n4,044.3\n \nServices transferred over time\n1,223.0\n \n1,069.7\n \n955.3\n \nOne-time charges and miscellaneous revenues\n19.7\n \n18.1\n \n19.8\n \nTotal revenues\n$\n6,130.1\n \n$\n5,578.9\n \n$\n5,019.4\n \nThe timing of revenue recognition, billings and cash collections results in billed accounts receivable, and customer advances and deposits (contract liabilities) on the consolidated balance sheets. Certain fees for transactions, annual licenses, and other revenue arrangements are billed upfront before revenue is recognized, which results in the recognition of contract liabilities. These liabilities are recognized on the consolidated balance sheets on a contract-by-contract basis upon commencement of services under the customer contract. These upfront customer payments are recognized as revenue over time as the obligations under the contracts are satisfied. Changes in the contract liability balances during 2024 were not materially impacted by any other factors.  The balance of contract liabilities wa\ns $15.6 million \nand $13.2 million as of December 31, 2024 and 2023, respectively.\n4. \nPERFORMANCE BONDS AND GUARANTY FUND CONTRIBUTIONS\nThe clearing house clears and guarantees the settlement of contracts traded in the futures and options and interest rate swap markets. In its guarantor role, the clearing house has precisely equal and offsetting claims to and from clearing firms on opposite sides of each contract, standing as an intermediary on every contract cleared. In the U.S., clearing firm funds are held \n63\nTable of Contents\naccording to Commodity and Futures Trading Commission (CFTC) regulatory account segregation standards. To the extent that funds are not otherwise available to satisfy an obligation under the applicable contract, the clearing house bears counterparty credit risk in the event that future market movements create conditions that could lead to clearing firms failing to meet their obligations to the clearing house. The clearing house reduces the exposure through risk management programs that include initial and ongoing financial standards for designation as a clearing firm, performance bond requirements, daily mark-to-market, mandatory guaranty fund contributions and intra-day monitoring. \nEach clearing firm is required to deposit and maintain balances in the form of cash, U.S. government securities, certain foreign government securities, bank letters of credit or other approved collateral to satisfy performance bond and guaranty fund requirements. All non-cash deposits and certain cash deposits with foreign currency exposure are marked-to-market and haircut on a daily basis. Securities deposited by the clearing firms are not reflected on the consolidated financial statements and the clearing house does not earn any interest on these deposits. These balances may fluctuate significantly over time due to investment choices available to clearing firms and changes in the amount of contributions required. Cash performance bonds and guaranty fund contributions are included as restricted cash and restricted cash equivalents on the consolidated statements of cash flows.\nThe clearing house marks-to-market open positions at least once a day (twice a day for futures and options contracts), and requires payment from clearing firms whose positions have lost value and makes payments to clearing firms whose positions have gained value. The clearing house has the capability to mark-to-market more frequently as market conditions warrant. \nUnder the extremely unlikely scenario of simultaneous default by every clearing firm who has open positions with unrealized losses, the maximum exposure at the time of default related to positions other than interest rate swap contracts would be one half day of changes in fair value of all open positions, before considering the clearing house's ability to access defaulting clearing firms' collateral deposits. For cleared interest rate swap contracts, the maximum exposure at the time of default related to the clearing house's guarantee would be one full day of changes in fair value of all open positions, before considering the clearing house's ability to access defaulting clearing firms' collateral. During 2024, the clearing house transferred an average of approximately $\n5.7\n billion a day through the clearing system for settlement from clearing firms whose positions had lost value to clearing firms whose positions had gained value. The clearing house reduces its exposure through maintenance performance bond requirements and guaranty fund contributions. For futures and options products, the clearing firms' collateral requirements are sized to cover at least one day of anticipated price movements. For cleared swap products, the clearing firms' collateral requirements are sized to cover at least five days of anticipated price movements. Management has assessed the fair value of the company's settlement guarantee liability by taking the following factors into consideration: the design and operations of the clearing risk management process, the financial safeguard packages in place, historical evidence of default by a clearing member and the estimated probability of potential payouts by the clearing house. Based on the assessment performed, management estimates the guarantee liability to be nominal and therefore has not recorded any liability at December 31, 2024. \nCME has been designated as a systemically important financial market utility by the Financial Stability Oversight Council and is authorized to maintain cash accounts at the Federal Reserve Bank of Chicago. At December 31, 2024 and 2023, the clearing house maintained $\n87.4\n billion and $\n79.3\n billion, respectively, within the cash accounts at the Federal Reserve Bank of Chicago. The cash deposited at the Federal Reserve Bank of Chicago is included within performance bonds and guaranty fund contributions on the consolidated balance sheets.\nIn 2024 and 2023, earnings from cash performance bond and guaranty fund contributions were \n$3,943.8 million \nand $5,073.9 million, respectively. In 2024 and 2023, expense related to the distribution of interest earned on collateral reinvestments were $\n3,669.4 million a\nnd $4,717.5 million, respectively. The earnings from cash performance bonds and guaranty fund contributions are included in investment income and the expense related to the distribution of interest earned is included in other non-operating income (expense) on the consolidated statements of income. \nCME and The Options Clearing Corporation (OCC) have a perpetual cross-margin arrangement, whereby a clearing firm may maintain a cross-margin account in which a clearing firm's positions in certain equity index futures and options are combined with certain positions cleared by OCC for purposes of calculating performance bond requirements. The performance bond deposits are held jointly by CME and OCC. Cross-margin cash, securities and letters of credit jointly held with OCC under the cross-margin agreement are reflected at \n50\n% of the total, or CME's proportionate share per that agreement. If a participating firm defaults, the gain or loss on the liquidation of the firm's open position and the proceeds from the liquidation of the cross- margin account would be allocated equally between CME and OCC. In the event of a remaining loss, CME would first apply assets of the defaulting clearing firm to satisfy its payment obligation. These assets include the defaulting firm's guaranty fund contributions, performance bonds and any other available assets, such as assets required for clearing membership and any associated trading rights. Thereafter, if the payment default remains unsatisfied, the clearing house would use its corporate contributions designated for the respective financial safeguard package. The clearing house would then use guaranty fund contributions of other clearing firms within the respective financial safeguard package and funds collected through an assessment against solvent clearing firms within the respective financial safeguard package to satisfy the deficit.\n64\nTable of Contents\nIn addition, CME has a cross-margin arrangement with Fixed Income Clearing Corporation (FICC) whereby certain of the clearing firms' offsetting positions with CME and FICC are subject to reduced performance bond requirements. Clearing firms maintain separate performance bond deposits with each clearing house, but based on the net offsetting positions between CME and FICC, each clearing house may reduce that firm's performance bond requirements. If a participating firm defaults, the gain or loss on the liquidation of the firm’s open positions and the proceeds from the liquidation of the cross margin account would be allocated between CME and FICC pursuant to a publicly-available cross-margining agreement. In the event of a remaining loss, CME would first apply assets of the defaulting clearing firm to satisfy its payment obligation. These assets include the defaulting firm's guaranty fund contributions, performance bonds and any other available assets, such as assets required for clearing membership and any associated trading rights. Thereafter, if the payment default remains unsatisfied, the clearing house would use its corporate contributions designated for the respective financial safeguard package. The clearing house would then use guaranty fund contributions of other clearing firms within the respective financial safeguard package and funds collected through an assessment against solvent clearing firms within the respective financial safeguard package to satisfy the deficit.\nEach clearing firm for futures and options is required to deposit and maintain specified guaranty fund contributions in the form of cash or U.S. Treasury securities (base guaranty fund). In the event that performance bonds, guaranty fund contributions and other assets required to support clearing membership of a defaulting clearing firm are inadequate to fulfill that clearing firm's outstanding financial obligation, the base guaranty fund for contracts other than interest rate swaps is available to cover potential losses after first utilizing $\n100.0\n million of corporate contributions designated by CME to be used in the event of a default of a clearing firm for the base guaranty fund. \nThe clearing house maintains a separate guaranty fund to support the clearing firms that clear interest rate swap products (cleared interest rate swaps contract guaranty fund). The funds for interest rate swaps are independent of the base guaranty fund and are isolated to clearing firms for products in the respective asset class. Each clearing firm for cleared interest rate swaps is required to deposit and maintain specified guaranty fund contributions in the form of cash or U.S. Treasury securities. In the event that performance bonds, guaranty fund contributions and other assets required to support clearing membership of a defaulting clearing firm for cleared interest rate swap contracts are inadequate to fulfill that clearing firm's outstanding financial obligation, the interest rate swaps contracts guaranty fund is available to cover potential losses after first utilizing $\n150.0\n million of corporate contributions designated by CME to be used in the event of a default of a cleared interest rate swap clearing firm. \nCME maintains a \n364\n-day multi-currency line of credit with a consortium of domestic and international banks to be used in certain situations by the clearing house. CME may use the proceeds to provide temporary liquidity in the unlikely event of a clearing firm default, in the event of a liquidity constraint or default by a depositary (custodian of the collateral), or in the event of a temporary disruption with the domestic payments system that would delay payment of settlement variation between CME and its clearing firms. Clearing firm guaranty fund contributions received in the form of cash or U.S. Treasury securities as well as the performance bond assets of a defaulting firm can be used to collateralize the facility. The line of credit provides for borrowings of up to $\n7.0\n billion. At December 31, 2024, guaranty fund contributions available to collateralize the facility were $\n10.1\n billion. CME has the option to request an increase in the line from $\n7.0\n billion to $\n10.0\n billion, subject to the approval of participating banks. In addition to the \n364\n-day fully secured, committed multi-currency line of credit, the company also has the option to use the $\n2.3\n billion multi-currency revolving senior credit facility to provide liquidity for the clearing house in the unlikely event of default. \nThe company maintains committed repurchase facility agreements amounting to a total of $1.0 billion.  The committed repurchase facilities provide access to cash, secured by non-cash collateral, in the event that one or more of our clearing firms fails to promptly discharge an obligation to the clearing house.  The facilities are subject to annual renewal. The company currently does not have any borrowings outstanding under these facilities.\nCME also maintains a committed facility of up to $750.0 million for foreign currency conversions. The committed foreign currency facility allows the clearing house to convert cash to another currency within generally accepted local market timeframes in the event that one or more of our clearing firms fails to promptly discharge an obligation to the clearing house. The facility is subject to annual renewal. The company currently does not have any foreign currency trades outstanding under this facility.\nThe clearing house is required under the U.S. Commodity Exchange Act to segregate cash and securities deposited by clearing firms from its clearing member customers. In addition, the clearing house requires segregation of all funds deposited by its clearing firms from operating funds. \n65\nTable of Contents\nCash and non-cash deposits held as performance bonds and guaranty fund contributions at fair value at December 31, 2024 and 2023 were as follows: \n \n2024\n2023\n(in millions)\nCash\nNon-Cash\nDeposits\nand\nIEF Funds \n(1)\nCash\nNon-Cash\nDeposits\nand\nIEF Funds \n(1)\nPerformance bonds\n$\n96,036.4\n \n$\n191,241.1\n \n$\n87,285.5\n \n$\n180,866.3\n \nGuaranty fund contributions\n2,343.5\n \n7,977.2\n \n2,379.6\n \n6,849.6\n \nCross-margin arrangements\n233.1\n \n678.5\n \n183.1\n \n1,374.5\n \nOther\n(2)\n282.4\n \n2.1\n \n344.3\n \n2.1\n \nTotal\n$\n98,895.4\n \n$\n199,898.9\n \n$\n90,192.5\n \n$\n189,092.5\n \n  _______________\n(1) IEF funds include customer-directed investments in IEF funds that are not included on the consolidated balance sheets. \n(2) Other includes collateral for delivery and accrued interest earned on collateral reinvestment due to the clearing firms. \nCross-margin arrangements include collateral for the cross-margin accounts with OCC and FICC. \nCash performance bonds may include intraday settlement, if any, that is owed to the clearing firms and paid the following business day. The balance of intraday settlements was $\n198.4\n million and $\n237.5\n million at December 31, 2024 and 2023, respectively. Intraday settlements may be invested on an overnight basis and are offset by an equal liability owed to clearing firms. \nIn addition to cash, securities and other non-cash deposits, irrevocable letters of credit may be used as performance bond deposits for clearing firms. \nAt December 31, 2024 and 2023, these letters of credit, which are not included in the accompanying consolidated balance sheets, were as follows: \n(in millions)\n2024\n2023\nPerformance bonds\n$\n4,254.8\n \n$\n3,916.7\n \nPerformance bond collateral for delivery\n3,505.9\n \n4,631.4\n \nTotal Letters of Credit\n$\n7,760.7\n \n$\n8,548.1\n \n_______________\nAll cash, securities and letters of credit posted as performance bonds are only available to meet the financial obligations of that clearing firm to the clearing house.\n5. \nPROPERTY\nA summary of the property accounts at December 31, 2024 and 2023 is presented below:\n(in millions)\n2024\n2023\nEstimated Useful Life\nBuilding and building improvements\n$\n130.7\n \n$\n130.7\n \n1 - 10 years\nLeasehold improvements\n147.1\n \n143.7\n \n2 - 20 years\nFurniture, fixtures and equipment\n432.6\n \n413.3\n \n1 - 7 years\nSoftware and software development costs\n700.1\n \n654.9\n \n2 - 8 years\nTotal property\n1,410.5\n \n1,342.6\n \nLess accumulated depreciation and amortization\n(\n1,024.3\n)\n(\n933.1\n)\nProperty, net\n$\n386.2\n \n$\n409.5\n \n66\nTable of Contents\n6. \nINTANGIBLE ASSETS AND GOODWILL\nIntangible assets consisted of the following at  December 31, 2024 and 2023:\n \n \n2024\n2023\n(in millions)\nAssigned Value\nAccumulated\nAmortization\nNet Book\nValue\nAssigned Value\nAccumulated\nAmortization\nNet Book\nValue\nAmortizable Intangible Assets:\nClearing firm, market data and other customer relationships \n$\n4,683.5\n \n$\n(\n2,334.4\n)\n$\n2,349.1\n \n$\n4,694.4\n \n$\n(\n2,124.9\n)\n$\n2,569.5\n \nTechnology-related intellectual property\n62.5\n \n(\n62.5\n)\n—\n \n62.5\n \n(\n62.2\n)\n0.3\n \nOther\n71.1\n \n(\n48.6\n)\n22.5\n \n71.6\n \n(\n41.2\n)\n30.4\n \nTotal Amortizable Intangible Assets\n$\n4,817.1\n \n$\n(\n2,445.5\n)\n$\n2,371.6\n \n$\n4,828.5\n \n$\n(\n2,228.3\n)\n$\n2,600.2\n \nIndefinite-Lived Intangible Assets:\nTrade names\n450.0\n \n450.0\n \nTotal Intangible Assets—Other, Net\n$\n2,821.6\n \n$\n3,050.2\n \nTrading products \n(1)\n$\n17,175.3\n \n$\n17,175.3\n \n _______________\n(1)\nTrading products represent futures and options products acquired in our business combinations with CBOT Holdings, Inc., NYMEX Holdings, Inc. and The Board of Trade of Kansas City, Missouri, Inc. Clearing and transaction fees are generated through the trading of these products. These trading products, most of which have traded for decades, require authorization from the CFTC. Product authorizations from the CFTC have no term limits.\nThe originally assigned useful lives for the amortizable intangible assets as of December 31, 2024 are as follows:\nClearing firm, market data and other customer relationships\n5 - 30 years\nTechnology-related intellectual property\n5 - 9 years\nOther\n3 - 24.5 years\nTotal amortization expense for intangible assets was $\n221.7\n million, $\n226.6\n million and $\n227.7\n million for the years ended December 31, 2024, 2023 and 2022, respectively. \nAs of December 31, 2024, the future estimated amortization expense related to amortizable intangible assets is expected to be as follows: \n \n(in millions)\n \n2025\n$\n221.5\n \n2026\n221.5\n \n2027\n220.2\n \n2028\n213.8\n \n2029\n213.8\n \nThereafter\n1,280.8\n \nGoodwill activity consisted of the following for the years ended December 31, 2024 and 2023\n:\n(in millions)\nGoodwill\nBalance at December 31, 2022\n$\n10,482.5\n \nForeign currency translation\n12.8\n \nBalance at December 31, 2023\n10,495.3\n \nForeign currency translation\n(\n8.4\n)\nBalance at December 31, 2024\n$\n10,486.9\n \n67\nTable of Contents\n7. LONG-TERM INVESTMENTS\nThe company maintains various long-term investments as described below. The investments are recorded in other assets on the consolidated balance sheets.\nGME Holdings Limited. \nThe company owns a \n33\n% interest in GME Holdings Limited (GME Holdings), and accounts for its investment in GME Holdings using the equity method of accounting. Dubai Mercantile Exchange (DME) was rebranded as the Gulf Mercantile Exchange (GME) in 2024 to reflect its position as the key regional commodities exchange in the Middle East. In June 2024, the company invested $\n3.5 million\n in GME Holdings in exchange for \n3.5\n million additional shares of GME.  This transaction was immediately followed by a secondary share sale to a third party of \n15.5\n million shares for $\n15.5 million\n, which ultimately reduced our stake in GME Holdings from \n50\n% to \n33\n%. The company recognized a net gain of $\n9.2\n million on the transaction as recorded in other non-operating income on the consolidated statements of income during 2024. The carrying amount of the company's investment in GME Holdings was $\n11.6\n million at December 31, 2024. The company and GME Holdings maintain an agreement for Gulf Mercantile Exchange futures contracts to be exclusively traded on the CME Globex platform. \nOSTTRA. \nThe company owns a \n50\n% equity interest in OSTTRA, which is a joint venture withe IHS Markit.  OSTTRA performs trade processing and risk mitigation services. The company accounts for its investment using the equity method of accounting. The carrying amount of the company's investment in OSTTRA was $\n1.2\n billion at December 31, 2024. \nS&P Dow Jones Indices LLC.\n  In June 2022, the company invested $\n410.0\n million in S&P Dow Jones Indices LLC, which S&P Dow Jones Indices LLC used as part of the consideration for its acquisition of the IHS Markit index business. The company continues to own a \n27\n% interest in S&P Dow Jones Indices LLC and accounts for its investment in S&P Dow Jones Indices LLC using the equity method of accounting. The carrying amount of the company's investment in S&P Dow Jones Indices LLC was $\n1.3\n billion at December 31, 2024.  The company has long-term exclusive licensing agreements with S&P Dow Jones Indices LLC to list products based on the Standard & Poor's Indices and Dow Jones Indices. \nShanghai CFETS-NEX International Money Broking Co., Ltd.\n  The company owns a \n33\n% interest in Shanghai CFETS-NEX International Money Broking Co., Ltd. (CFETS) and accounts for its investment in CFETS using the equity method of accounting. The carrying amount of the company's investment in CFETS was \n$\n58.4\n million\n at December 31, 2024.\n \n68\nTable of Contents\n8. \nDEBT\nShort-term debt consisted of the following at December 31, 2024 and 2023:\n(in millions)\n2024\n2023\n$750.0 million fixed rate notes due March 2025, stated rate of 3.00% \n(1)\n$\n749.8\n \n$\n—\n \nTotal short-term debt\n$\n749.8\n \n$\n—\n \n_______________\n(1)\nThe company maintained a forward-starting interest rate swap agreement that modified the interest obligation associated with these notes so that the interest payable on the notes effectively became fixed at a rate of \n3.11\n%.\n \nLong-term debt outstanding consisted of the following at December 31, 2024 and 2023:\n(in millions)\n2024\n2023\n$750.0 million fixed rate notes due March 2025, stated rate of 3.00% \n(1)\n$\n—\n \n$\n749.1\n \n$500.0 million fixed rate notes due June 2028, stated rate of 3.75%\n498.5\n \n498.1\n \n$750.0 million fixed rate notes due March 2032, stated rate of 2.65%\n743.7\n \n742.9\n \n$750.0 million fixed rate notes due September 2043, stated rate of 5.30% \n(2)\n744.3\n \n744.0\n \n$700.0 million fixed rate notes due June 2048, stated rate of 4.15%\n691.7\n \n691.3\n \nTotal long-term debt\n$\n2,678.2\n \n$\n3,425.4\n \n _______________\n(1)\nThe company maintained a forward-starting interest rate swap agreement that modified the interest obligation associated with these notes so that the interest payable on the notes effectively became fixed at a rate of \n3.11\n%.\n(2)\nThe company maintained a forward-starting interest rate swap agreement that modified the interest obligation associated with these notes so that the interest payable on the notes effectively became fixed at a rate of \n4.73\n%\n.\nShort term and long-term debt maturities, at par value were as follows as of December 31, 2024:\n(in millions)\nPar Value\n2025\n$\n750.0\n \n2026\n—\n \n2027\n—\n \n2028\n500.0\n \n2029\n—\n \nThereafter\n2,200.0\n \n69\nTable of Contents\n9. \nINCOME TAXES\nThe company is subject to regulation under a wide variety of U.S., federal, state and foreign tax laws and regulations. \nIncome before income taxes and the income tax provision consisted of the following for the years ended  December 31, 2024,  2023 and 2022:\n(in millions)\n2024\n2023\n2022\nIncome before income taxes:\nDomestic\n$\n4,305.9\n \n$\n3,900.5\n \n$\n3,291.7\n \nForeign\n235.5\n \n253.1\n \n198.6\n \nTotal\n$\n4,541.4\n \n$\n4,153.6\n \n$\n3,490.3\n \nIncome tax provision:\nCurrent:\nFederal\n$\n776.9\n \n$\n751.7\n \n$\n620.5\n \nState\n252.8\n \n205.8\n \n177.1\n \nForeign\n52.3\n \n44.9\n \n24.9\n \nTotal\n1,082.0\n \n1,002.4\n \n822.5\n \nDeferred:\nFederal\n(\n49.6\n)\n21.9\n \n(\n16.3\n)\nState\n(\n17.0\n)\n(\n33.8\n)\n(\n7.3\n)\nForeign\n0.2\n \n(\n63.1\n)\n0.4\n \nTotal\n(\n66.4\n)\n(\n75.0\n)\n(\n23.2\n)\nTotal Income Tax Provision\n$\n1,015.6\n \n$\n927.4\n \n$\n799.3\n \nReconciliation of the U.S. federal income tax rate (statutory tax rate) to the effective tax rate is as follows:\n2024\n2023\n2022\nStatutory tax rate\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nState taxes, net of federal benefit\n4.1\n \n3.3\n \n3.9\n \nForeign-derived intangible income deduction\n(\n1.7\n)\n(\n1.5\n)\n(\n1.5\n)\nOther, net\n(\n1.0\n)\n(\n0.5\n)\n(\n0.5\n)\nEffective Tax Expense Benefit Rate\n22.4\n \n%\n22.3\n \n%\n22.9\n \n%\nIn 2024, 2023 and 2022, the effective tax rates were higher than the statutory tax rate.  The increases to the effective tax rate for the state taxes were partially offset by the foreign-derived intangible income (FDII) deduction.  \n70\nTable of Contents\nAt  December 31, 2024 and 2023, deferred income tax assets (liabilities) consisted of the following: \n(in millions)\n2024\n2023\nDeferred Income Tax Assets:\nNet operating losses\n$\n5.3\n \n$\n3.4\n \nProperty\n12.8\n \n—\n \nAccrued expenses, compensation, leases  and other\n123.9\n \n131.4\n \nSubtotal\n142.0\n \n134.8\n \nValuation allowance\n—\n \n(\n0.4\n)\nTotal deferred income tax assets\n142.0\n \n134.4\n \nDeferred Income Tax Liabilities:\nPurchased intangible assets\n(\n5,240.6\n)\n(\n5,298.2\n)\nOther\n(\n114.1\n)\n(\n115.4\n)\nProperty\n—\n \n(\n1.3\n)\nTotal deferred income tax liabilities\n(\n5,354.7\n)\n(\n5,414.9\n)\nNet Deferred Income Tax Liabilities\n$\n(\n5,212.7\n)\n$\n(\n5,280.5\n)\nReported as:\nNet non-current deferred tax assets\n$\n34.1\n \n$\n47.2\n \nNet non-current deferred tax liabilities\n(\n5,246.8\n)\n(\n5,327.7\n)\nNet Deferred Income Tax Liabilities\n$\n(\n5,212.7\n)\n$\n(\n5,280.5\n)\nA valuation allowance is recorded when it is more-likely-than-not that some portion or all of the deferred income tax assets may not be realized. The ultimate realization of the deferred income tax assets depends on the ability to generate sufficient taxable income of the appropriate character in the future and in the appropriate taxing jurisdictions.\nAt December 31, 2024, the company had domestic income tax loss carryforwards of $\n25.1\n million of which $\n22.1\n million will expire between 2030 and 2036 and $\n3.0\n million can be carried forward indefinitely. These amounts primarily relate to losses from the acquisition of NEX Group plc and the acquisition of Pivot, Inc. No valuation allowance was recorded at December 31, 2024 and a valuation allowance of $\n0.4\n million was recorded at December 31, 2023.\nThe following is a summary of the company’s unrecognized tax benefits at December 31, 2024, 2023 and 2022:\n(in millions)\n2024\n2023\n2022\nGross unrecognized tax benefits\n$\n251.6\n \n$\n264.1\n \n$\n280.3\n \nUnrecognized tax benefits, net of tax impacts in other jurisdictions\n238.1\n \n251.9\n \n264.4\n \nInterest and penalties related to uncertain tax positions\n18.8\n \n16.6\n \n28.0\n \nInterest and penalties recognized on the consolidated statements of income\n2.1\n \n(\n4.0\n)\n(\n3.8\n)\nThe company does not believe it is reasonably possible that within the next twelve months, unrecognized tax benefits will change by a significant amount.\nA reconciliation of the beginning and ending amounts of gross unrecognized tax benefits is as follows:\n(in millions)\n2024\n2023\n2022\nBalance at January 1\n$\n264.1\n \n$\n280.3\n \n$\n316.4\n \nAdditions based on tax positions related to the current year\n12.0\n \n10.0\n \n8.5\n \nAdditions for tax positions of prior years\n3.9\n \n4.3\n \n2.7\n \nReductions for tax positions of prior years\n(\n17.7\n)\n(\n8.0\n)\n(\n9.5\n)\nReductions resulting from the lapse of statutes of limitations\n(\n5.6\n)\n(\n5.2\n)\n(\n5.5\n)\nSettlements with taxing authorities\n(\n5.1\n)\n(\n17.3\n)\n(\n32.3\n)\nBalance at December 31\n$\n251.6\n \n$\n264.1\n \n$\n280.3\n \nThe company is subject to U.S. federal income tax as well as income taxes in Illinois and multiple other state, local and foreign jurisdictions.  As of December 31, 2024, substantially all federal income tax matters have been concluded through 2016 other than the Section 199 deduction.  On April 15, 2024, the company filed a court case with the U.S. court of Federal Claims \n71\nTable of Contents\nrelated to the Section 199 deduction.  All United Kingdom income tax matters have been concluded through 2017, and substantially all state income tax matters have been concluded through 2019.\n10. \nEMPLOYEE BENEFIT PLANS\nPension Plans.\n CME maintains a non-contributory defined benefit cash balance pension plan for eligible employees. CME's plan provides for a pay-based credit added to the cash balance account based on age and earnings and includes salary and cash bonuses in the definition of earnings. Employees who have completed a continuous 12-month period of employment and have reached the age of \n21\n are eligible to participate. Participant cash balance accounts receive an interest credit equal to the greater of the one-year constant maturity yield for U.S. Treasury notes or \n4.0\n%. Participants become vested in their accounts after \nthree years\n of service. The measurement date used for the plan is December 31. \nThe following is a summary of the change in projected benefit obligation:\n(in millions)\n2024\n2023\nBalance at January 1\n$\n351.5\n \n$\n316.4\n \nService cost\n21.9\n \n21.1\n \nInterest cost\n18.8\n \n18.5\n \nActuarial (gain) loss\n(\n9.8\n)\n18.3\n \nBenefits paid\n(\n18.4\n)\n(\n22.8\n)\nBalance at December 31\n$\n364.0\n \n$\n351.5\n \nThe aggregate accumulated benefit obligation was \n$\n335.6\n million an\nd $\n323.2\n million at December 31, 2024 and 2023, respectively.\nThe following is a summary of the change in fair value of plan assets:\n(in millions)\n2024\n2023\n2022\nBalance at January 1\n$\n350.8\n \n$\n331.7\n \n$\n402.3\n \nActual return on plan assets\n26.1\n \n38.9\n \n(\n50.0\n)\nEmployer contributions\n9.0\n \n3.0\n \n—\n \nBenefits paid\n(\n18.4\n)\n(\n22.8\n)\n(\n20.6\n)\nBalance at December 31\n$\n367.5\n \n$\n350.8\n \n$\n331.7\n \nThe plan assets are classified into a fair value hierarchy in their entirety based on the lowest level of input that is significant to each asset or liability’s fair value measurement. Valuation techniques for level 2 assets use significant observable inputs such as quoted prices for similar assets, quoted market prices in inactive markets and other inputs that are observable or can be supported by observable market data. \nThe fair value of each major category of plan assets as of December 31, 2024 and 2023 is indicated below:\n(in millions)\n2024\n2023\nLevel 2:\nMoney market funds\n$\n15.9\n \n$\n6.2\n \nMutual funds:\nFixed income\n168.1\n \n165.3\n \nU.S. equity\n137.3\n \n131.6\n \nForeign equity\n46.2\n \n47.7\n \nTotal\n$\n367.5\n \n$\n350.8\n \nAt December 31, 2024, the fair value of pension plan assets exceeded the pension benefit obligation by \n$\n3.5\n million and the excess was recorded as a non-current pension asset in other assets. At December 31, 2023, \nthe fair value of pension plan assets had a shortfall of the projected benefit obligation \nby $\n0.7\n million and the shortfall was recorded as a non-current pension liability in other liabilities.\nCME's funding goal is to have its pension plan \n100\n% funded at each year-end on a projected benefit obligation basis, while also satisf\nying any minimum required contribution and obtaining the maximum tax deduction. Year-end 2024 assumptions have been used to project the assets and liabilities from December 31, 2024 to December 31, 2025. The company anticipates based on this projection that an additional contribution of $\n12.2\n million in 2025 will be necessary for it to meet its funding goal. \n72\nTable of Contents\nHowever, the amount of the actual contribution is contingent on various factors, including the actual rate of return on the plan assets during 2025 and the December 31, 2025 discount rate. \nThe components of net pension expense and the assumptions used to determine the end-of-year projected benefit obligation and net pension expense in aggregate at  December 31, 2024, 2023 and 2022 are indicated below:\n(in millions)\n2024\n2023\n2022\nComponents of Net Pension Expense:\nService cost\n$\n21.9\n \n$\n21.1\n \n$\n25.7\n \nInterest cost\n18.8\n \n18.5\n \n12.0\n \nExpected return on plan assets\n(\n24.1\n)\n(\n21.6\n)\n(\n22.3\n)\nRecognized net actuarial loss\n0.4\n \n0.3\n \n1.4\n \nNet Pension Expense\n$\n17.0\n \n$\n18.3\n \n$\n16.8\n \nAssumptions Used to Determine End-of-Year Benefit Obligation:\nDiscount rate\n5.70\n \n%\n5.20\n \n%\n5.60\n \n%\nRate of compensation increase\n4.00\n \n4.00\n \n4.00\n \nCash balance interest crediting rate\n4.20\n \n5.14\n \n4.75\n \nAssumptions Used to Determine Net Pension Expense:\nDiscount rate\n5.20\n \n%\n5.60\n \n%\n3.00\n \n%\nRate of compensation increase\n4.00\n \n4.00\n \n4.00\n \nExpected return on plan assets\n7.25\n \n6.75\n \n5.75\n \nInterest crediting rate\n5.14\n \n4.75\n \n4.00\n \nThe discount rate for the plan was determined based on the market value of a theoretical settlement bond portfolio. This portfolio consisted of U.S. dollar denominated Aa-rated corporate bonds across the full maturity spectrum. A single equivalent discount rate was determined to align the present value of the required cash flow with that settlement value. The resulting discount rate was reflective of both the current interest rate environment and the plan's distinct liability characteristics. \nThe basis for determining the expected rate of return on plan assets for the plan is comprised of three components: historical returns, industry peers and forecasted return. The plan's total return is expected to equal the composite performance of the security markets over the long term. The security markets are represented by the returns on various domestic and international stock, bond and commodity indexes. These returns are weighted according to the allocation of plan assets to each market and measured individually. \nThe overall objective of the plan is to achieve required long-term rates of return in order to meet future benefit payments. The component of the investment policy for the plan that has the most significant impact on returns is the asset mix. The asset mix has a minimum and maximum range depending on asset class. The plan assets are diversified to minimize the risk of large losses by any one or more individual assets. Such diversification is accomplished, in part, through the selection of asset mix and investment management. \nThe asset allocation for the plan, by asset category, at December 31, 2024 and 2023 was as follows:\n2024\n2023\nFixed income\n45.7\n \n%\n47.1\n \n%\nMoney market funds\n4.3\n \n1.8\n \nU.S. equity\n37.4\n \n37.5\n \nForeign equity\n12.6\n \n13.6\n \nFor 2025, management expects the fixed income asset class to be approximately \n50\n% of the portfolio. The target allocation for the equity asset classes is expected to be approximately \n50\n% of the portfolio.\nAt times, the company may determine that it is necessary to place some assets in cash equivalent investments in order to pay  expected plan liabilities. Given this, the actual asset allocation for the plan may not fall within the target allocation ranges from time to time. \nAccording to the plan's investment policy, the plan is not allowed to invest in securities that compromise independence, short sales of securities directly owned by the plan, securities purchased on margin or other uses of borrowed funds, derivatives not used for hedging purposes, restricted stock or illiquid securities or any other transaction prohibited by employment laws. If the plan directly invests in short-term and long-term debt obligations, the investments are limited to obligations rated at the highest rating category by Standard & Poor's or Moody's. \n73\nTable of Contents\nThe pre-tax balance and activity of actuarial losses for the pension plan, which are included in other comprehensive income (loss), for 2024 are as follows: \n(in millions)\nActuarial\nLoss\nBalance at January 1\n$\n33.0\n \nUnrecognized net loss\n(\n0.4\n)\nRecognized as a component of net pension expense\n(\n11.8\n)\nBalance at December 31\n$\n20.8\n \nAt December 31, 2024, anticipated benefit payments from the plan in future years are as follows:\n(in millions)\n2025\n$\n34.9\n \n2026\n35.7\n \n2027\n36.4\n \n2028\n37.4\n \n2029\n38.4\n \n2030-2034\n196.2\n \nSavings Plans. \nCME maintains a defined contribution savings plan pursuant to Section 401(k) of the Internal Revenue Code, whereby all U.S. employees are participants and have the option to contribute to this plan. CME matches employee contributions up to \n3\n% of the employee's base salary and may make additional discretionary contributions. \nIn addition to the plan for U.S. employees, the company maintains defined contribution savings plans for employees in international locations.  \nAggregate expense for all of the defined contribution savings plans amount\ned to $\n20.8\n million, $\n19.7\n million\n and $\n18.3\n million in 2024, 2023 and 2022, respectively. \nCME Non-Qualified Plans. \nCME maintains non-qualified plans, under which participants may make assumed investment choices with respect to amounts contributed on their behalf. Although not required to do so, CME invests such contributions in assets that mirror the assumed investment choices. The balances in these plans are subject to the claims of general creditors of the company and totaled \n$\n104.2\n million\n and $\n101.3\n million at December 31, 2024 and 2023, respectively. Although the value of the plans is recorded as an asset in marketable securities on the consolidated balance sheets, there is an equal and offsetting liability. The investment results of these plans have no impact on net income as the investment results are recorded in equal amounts to both investment income and compensation and benefits expense. The non-qualified plans include the following:\nSupplemental Savings Plan. \nCME maintains a supplemental plan to provide benefits for employees who have been impacted by statutory limits under the provisions of the qualified pension and savings plan. Employees in this plan are subject to the vesting requirements of the underlying qualified plans.\nDeferred Compensation Plan. \nA deferred compensation plan is maintained by CME, under which eligible employees and members of the board of directors may contribute a percentage of their compensation and defer income taxes thereon until the time of distribution. \nCOMEX Members' Retirement Plan and Benefits. \nCOMEX maintains a non-qualified retirement and benefit plan under the COMEX Members' Retirement Plan and Benefits plan (MRRP). This plan provides benefits to certain members of the COMEX division based on long-term membership, and participation is limited to individuals who were COMEX division members prior to NYMEX's acquisition of COMEX in 1994. No new participants were permitted into the plan after the date of this acquisition. All benefits to be paid under the MRRP are based on reasonable actuarial assumptions, which are based upon the amounts that are available and are expected to be available to pay benefits.\n There were no contributions to the plan in 2024, 2023 and 2022. At December 31, 2024 and 2023, the obligation for the MRRP totaled $\n7.3\n million and $\n8.7\n million, respectively. Assets with a fair value of $\n9.0\n million and $\n10.8\n million have been allocated to this plan at December 31, 2024 and 2023, respectively, and are included in marketable securities and cash and cash equivalents on the c\nonsolidated balance sheets. The balances in this plan are subject to the claims of general creditors of COMEX.\n74\nTable of Contents\n11. \nLEASES\nLeases. \nThe company has operating leases for datacenters and corporate offices. The operating leases have remaining lease terms of up to 13 years, some of which include options to extend or renew the leases for up to an additional \nfive\n years, and some of which include options to early terminate the leases in less than \n12\n months. Management evaluates the exercisability of these options at least quarterly in order to determine whether the contract term must be reassessed. For a small number of the leases, primarily the international locations, management's approach is to enter into short-term leases for a lease term of \n12\n months or less in order to provide for greater flexibility in the local environment. For certain office spaces, the company has entered into arrangements to sublease excess space to third parties, while the original lease contract remains in effect with the landlord. \nThe company also has one finance lease, which is related to the sale of our datacenter in March 2016. In connection with the sale, the company leased back a portion of the property. The sale leaseback transaction was recognized under the financing method and not as a sale leaseback arrangement. \nThe right-of-use lease asset is recorded within other assets, and the present value of the lease liability is recorded within other liabilities (segregated between short-term and long-term) on the consolidated balance sheets. The discount rate applied to the lease payments represents the company's incremental borrowing rate. The company has elected to utilize the short-term lease exception as prescribed in the leasing standard, such that the company has not capitalized on the balance sheet a lease asset or lease liability for leasing arrangements with a contractual term of \n12\n months or less from the lease commencement date.\nThe components of lease costs were as follows for the years ended December 31, 2024 and 2023:\n(in millions)\n2024\n2023\nOperating lease expense:\nOperating lease cost\n$\n51.4\n \n$\n55.1\n \nShort-term lease cost\n0.4\n \n0.4\n \nTotal operating lease expense included in other expense\n$\n51.8\n \n$\n55.5\n \nFinance lease expense:\nInterest expense\n$\n2.2\n \n$\n2.5\n \nDepreciation expense\n8.7\n \n8.7\n \nTotal finance lease expense\n$\n10.9\n \n$\n11.2\n \nSublease revenue included in other revenue\n$\n9.8\n \n$\n9.8\n \nSupplemental cash flow information related to leases was as follows for years ended December 31, 2024 and 2023:\n(in millions)\n2024\n2023\nCash outflows for operating leases\n$\n73.7\n \n$\n66.2\n \nCash outflows for finance leases\n17.4\n17.2\nSupplemental balance sheet information related to leases was as follows as of  December 31, 2024 and 2023: \nOperating leases\n \n(in millions)\n2024\n2023\nOperating lease right-of-use assets\n$\n231.1\n \n$\n272.0\n \nOperating lease liabilities:\nOther current liabilities\n$\n44.7\n \n$\n46.7\n \nOther liabilities\n289.3\n \n344.0\n \nTotal operating lease liabilities\n$\n334.0\n \n$\n390.7\n \nWeighted average remaining lease term (in months)\n106\n114\nWeighted average discount rate\n4.2\n \n%\n3.8\n \n%\n75\nTable of Contents\nFinance leases\n \n(in millions)\n2024\n2023\nFinance lease right-of-use assets\n$\n54.2\n \n$\n62.8\n \nFinance lease liabilities:\nOther current liabilities\n$\n8.7\n \n$\n8.4\n \nOther liabilities\n50.7\n \n59.4\n \nTotal finance lease liabilities\n$\n59.4\n \n$\n67.8\n \nWeighted average remaining lease term (in months)\n75\n87\nWeighted average discount rate\n3.5\n \n%\n3.5\n \n%\nFuture minimum lease payments were as follows as of December 31, 2024 for operating and finance leases:\n(in millions)\nOperating Leases\n2025\n$\n58.0\n \n2026\n52.6\n \n2027\n50.1\n \n2028\n49.1\n \n2029\n35.1\n \nThereafter\n153.7\n \nTotal lease payments\n398.6\n \nLess: imputed interest\n(\n64.6\n)\nPresent value of lease liability\n$\n334.0\n \n        \n(in millions)\nFinance Lease\n2025\n$\n17.5\n \n2026\n17.6\n \n2027\n17.8\n \n2028\n17.9\n \n2029\n18.1\n \nThereafter\n22.9\n \nTotal lease payments\n111.8\n \nLess: imputed interest\n(\n52.4\n)\nPresent value of lease liability\n$\n59.4\n \n12. \nCONTINGENCIES\nLegal and Regulatory Matters. \nIn the normal course of business, the company discusses matters with its regulators raised during regulatory examinations or otherwise subject to their inquiry and oversight. These matters could result in censures, fines, penalties or other sanctions. Management believes the outcome of any resulting actions will not have a material impact on the company's consolidated financial position or results of operations. However, the company is unable to predict the outcome or the timing of the ultimate resolution of these matters, or the potential fines, penalties or injunctive or other equitable relief, if any, that may result from these matters. \nA putative class action complaint was filed January 15, 2014 in the Circuit Court of Cook County, Chancery Division, against CME Group Inc. and the Board of Trade of the City of Chicago, Inc. The plaintiffs, certain Class B shareholders of CME Group and Class B members of CBOT, allege breach of contract and breach of the implied covenant of good faith and fair dealing for violations of their core rights granted in the defendants’ respective Certificates of Incorporation. On December 2, 2021, the court granted the plaintiffs’ motion for certification of a damages-only class. In early 2024, the defendants moved for summary judgment on all claims. The court heard oral argument on that motion on January 31, 2025. Should the case proceed past summary judgment in whole or in part, the Court has set the matter for a jury trial starting on July 7, 2025. Plaintiffs have \n76\nTable of Contents\nproduced an expert report estimating damages through June 30, 2023, and claiming that additional damages in an unspecified amount continue to accrue on a daily basis through final judgment. The defendants believe that the damages report is invalid under Illinois law and on that basis have filed a motion to exclude the expert from offering an opinion at trial and a motion to decertify the class. Given the uncertainty of factors that may potentially affect the resolution of the matter, at this time the company is unable to estimate the reasonably possible loss or range of reasonably possible losses in the unlikely event it were found to be liable at trial. Based on its investigation to date, the company believes that it has strong factual and legal defenses to the claims.\nIn addition, the company is a defendant in, and has potential for, various other legal proceedings arising from its regular business activities. While the ultimate results of such proceedings against the company cannot be predicted with certainty, the company believes that the resolution of any of these matters on an individual or aggregate basis will not have a material impact on its consolidated financial position or results of operations.\nNo accrual was \nrequired for contingent legal and regulatory matters as none were probable and estimable as of December 31, 2024 and 2023.\nIntellect\nual Property Indemnifications. \nCertain agreements with customers and other third parties related to accessing the CME Group platforms, utilizing market data services and licensing CME SPAN and SPAN 2 software may contain indemnifications from intellectual property claims that may be made against them as a result of their use of the applicable products and/or services. The potential future claims relating to these indemnifications cannot be estimated and therefore no liability has been recorded.\n13. \nGUARANTEES\nMutual Offset Agreement. \nCME and Singapore Exchange Limited (SGX) maintain a mutual offset agreement with a current term through May 2025. This agreement enables market participants to open a futures position on one exchange and liquidate it on the other. The term of the agreement will automatically renew for a one-year period after May 2025 unless either party provides advance notice of its intent to terminate. CME can maintain collateral in the form of irrevocable standby letters of credit. At December 31, 2024, CME was contingently liable to SGX on irrevocable letters of credit totaling \n$\n400.0\n million\n. CME also maintains a $\n350.0\n million line of credit to meet its obligations under this agreement. Regardless of the collateral, CME guarantees all cleared transactions submitted through SGX and would initiate procedures designed to satisfy these financial obligations in the event of a default, such as the use of performance bonds and guaranty fund contributions of the defaulting clearing firm. Management has assessed the fair value of the company's guarantee liability under this mutual offset agreement by taking the following factors into consideration: the design and operations of the clearing risk management process, the financial safeguard packages in place, historical evidence of default by a clearing member and the estimated probability of potential payouts by the clearing house. Based on the assessment performed, management estimates the guarantee liability to be nominal and therefore has not recorded any liability at \nDecember 31, 2024\n. \nFamily Farmer and Rancher Protection Fund. \nIn 2012, the company established the Family Farmer and Rancher Protection Fund (the Fund). The Fund is designed to provide payments, up to certain maximum levels, to family farmers, ranchers and other agricultural industry participants who use the company's agricultural products and who suffer losses to their segregated account balances due to their CME clearing member becoming insolvent. Under the terms of the Fund, farmers and ranchers are eligible for up to $\n25,000\n per participant. Farming and ranching cooperatives are eligible for up to $\n100,000\n per cooperative. The Fund has an aggregate maximum payment amount of $\n100.0\n million. Since its establishment, the Fund has made payments of approximately $\n2.0\n million, which leaves $\n98.0\n million available for future claims. If payments to participants were to exceed this amount, payments would be pro-rated. Clearing firms and customers must register in advance with the company and provide certain documentation in order to substantiate their eligibility\n. The company believes that its guarantee liability is nominal and therefore has not recorded any liability at December 31, 2024.\n77\nTable of Contents\n14. \nCAPITAL STOCK\nShares Outstanding.\n \nThe following table presents information regarding capital stock:\n \nDecember 31,\n(in thousands)\n2024\n2023\nPreferred stock authorized\n10,000\n10,000\nPreferred stock issued and outstanding\n4,584\n4,584\nClass A common stock authorized\n1,000,000\n1,000,000\nClass A common stock issued and outstanding\n359,602\n359,231\nClass B-1 common stock authorized, issued and outstanding\n0.6\n0.6\nClass B-2 common stock authorized, issued and outstanding\n0.8\n0.8\nClass B-3 common stock authorized, issued and outstanding\n1.3\n1.3\nClass B-4 common stock authorized, issued and outstanding\n0.4\n0.4\n \nPreferred Stock.\n CME Group has approximately \n4.6\n million shares of Series G Non-Voting Convertible Preferred Stock (Series G preferred stock) outstanding. The Series G preferred stock is non-voting and is convertible into Class A common stock at a specified conversion rate, which is initially 1:1. The Series G preferred stock ranks on a parity basis with the Class A common stock with respect to dividend and liquidation rights and therefore participates in the earnings and losses of CME Group on the same basis as Class A common stock. \nAssociated Trading Rights.\n Members of CME, CBOT, NYMEX and COMEX own or lease trading rights which entitle them  access to open outcry trading, discounts on trading fees and the right to vote on certain matters as provided for by the rules of the particular exchange and CME Group's or the subsidiary's organizational documents. Each class of CME Group Class B common stock is associated with a membership in a specific division for trading at CME. A CME trading right is a separate asset that is not part of or evidenced by the associated share of Class B common stock of CME Group. The Class B common stock of CME Group is intended only to ensure that the Class B shareholders of CME Group retain rights with respect to the election of \nsix\n members to the board of directors and approval rights with respect to the core rights described below. \nTrading rights at CBOT are evidenced by Class B memberships in CBOT, at NYMEX by Class A memberships in NYMEX and at COMEX by COMEX Division Memberships. Members of CBOT, NYMEX and COMEX do not have any rights to elect members of the board of directors and are not entitled to receive dividends or other distributions on their memberships or trading permits. \nCore Rights.\n Holders of CME Group Class B common shares have the right to approve changes in specified rights relating to the trading privileges at CME associated with those shares. These core rights relate primarily to trading right protections, certain trading fee protections and certain membership benefit protections. Votes on changes to these core rights are weighted by class. Each class of Class B common stock has the following number of votes on matters relating to core rights: Class B-1, six votes per share; Class B-2, two votes per share; Class B-3, one vote per share; and Class B-4, 1/6th of one vote per share. The approval of a majority of the votes cast by the holders of shares of Class B common stock is required in order to approve any changes to core rights. Holders of shares of Class A common stock do not have the right to vote on changes to core rights. \nVoting Rights.\n With the exception of the matters reserved to holders of CME Group Class B common stock, holders of CME Group common stock vote together on all matters for which a vote of common shareholders is required. In these votes, each holder of shares of Class A or Class B common stock of CME Group has one vote per share. The holder of Series G preferred stock does not have any voting rights.\nTransfer Restrictions.\n Each class of CME Group Class B common stock is subject to transfer restrictions contained in the Certificate of Incorporation of CME Group. These transfer restrictions prohibit the sale or transfer of any shares of Class B common stock separate from the sale of the associated trading rights. \nElection of Directors.\n The CME Group board of directors is currently comprised of \n22\n members. Holders of Class B-1, Class B-2 and Class B-3 common stock have the right to elect \nsix\n directors, of which \nthree\n are elected by Class B-1 shareholders, \ntwo\n are elected by Class B-2 shareholders and \none\n is elected by Class B-3 shareholders. The remaining directors are elected by the Class A and Class B shareholders voting as a single class. \nDividends.\n Holders of Class A and Class B common stock and Series G preferred stock of CME Group are entitled to receive proportionately such dividends, if any, as may be declared by the CME Group board of directors. \nCME Group Omnibus Stock Plan.\n CME Group has adopted an Omnibus Stock Plan under which stock-based awards may be made to employees. A total of \n40.2\n million Class A common stock shares have been reserved for awards under the plan. \n78\nTable of Contents\nAwards totaling \n25.9\n million shares have been granted and are outstanding or have been exercised under this plan at December 31, 2024 (See note 15 for further discussion). \nDirector Stock Plan.\n CME Group has adopted a Director Stock Plan under which awards are made to non-executive directors as part of their annual compensation. Effective May 4, 2022, the number of Class A available shares reserved under the plan was increased from \n625,000\n to \n725,000\n, and approximately \n488,223\n shares have been awarded through December 31, 2024. \nEmployee Stock Purchase Plan.\n CME Group has adopted an Employee Stock Purchase Plan (ESPP) under which employees may purchase Class A shares at \n90\n% of the market value of the shares using after-tax payroll deductions. Effective May 4, 2022, the number of Class A shares reserved under the plan was increased from \n500,000\n to \n800,000\n, of which approximately \n510,567\n shares have been purchased through December 31, 2024 (See note 15 for further discussion).\n \nShare Repurchase Program.\n In December 2024, the Board of Directors approved a share repurchase program, which authorizes the company to repurchase up to $\n3.0\n billion of CME Group Class A common stock at prevailing market prices. As of December 31, 2024, there have been no shares repurchased under this program.\nThe timing of any repurchases and the number of shares repurchased under the share repurchase program are within the discretion of CME Group and may be affected by various factors, including general market and economic conditions; the market price of the Class A common stock; CME Group’s earnings, financial condition, capital requirements and levels of indebtedness; legal requirements; and other considerations. The share repurchase program has no expiration date, does not obligate CME Group to acquire any particular amount of Class A common stock and may be modified, suspended or terminated at any time.\n15. \nSTOCK-BASED PAYMENTS\nCME Group adopted an Omnibus Stock Plan under which stock-based awards may be made to employees. A total of \n40.2\n million Class A shares have been reserved for awards under the plan. Awards totaling 25.9 million shares have been granted and are outstanding or have been exercised under the plan as of December 31, 2024. Awards granted generally vest over a four-year period, with \n25\n% vesting one year after the grant date and on that same date in each of the following three years. \nTotal compensation expense for all stock-related awards (including ESPP) and total income tax benefit recognized on the consolidated statements of income for these awards at  December 31, 2024, 2023 and 2022 were as follows:\n(in millions)\n2024\n2023\n2022\nCompensation expense\n$\n90.4\n \n$\n83.7\n \n$\n84.8\n \nIncome tax benefit recognized\n19.2\n \n14.2\n \n13.2\n \nAt December 31, 2024, there was $\n139.6\n million of total unrecognized compensation expense related to employee stock-based compensation arrangements that had not yet vested. The total unrecognized expense is expected to be recognized over a weighted average period of \n2.2\n years.\nIn 2024, the company granted \n342,716\n shares of restricted Class A common stock and restricted stock units with respect to \n12,812\n shares of Class A common stock. Restricted common stock and restricted stock units generally have a vesting period of two to four years. The fair value related to these grants was $\n77.7\n million, which is recognized as compensation expense on an accelerated basis over the vesting period. Dividends are accrued on restricted Class A common stock and restricted stock units and are paid once the restricted stock vests. In 2024, the company also granted \n129,381\n performance shares. The fair value related to these grants was $\n33.4\n million, which is recognized as compensation expense on a straight-lined basis over the vesting period. The vesting of these shares is contingent on meeting stated performance or market conditions, generally measured over a three-year period. \nThe following table summarizes restricted stock, restricted stock units and performance shares activity for 2024: \nNumber of Shares\nWeighted\nAverage\nGrant Date\nFair Value\nOutstanding at December 31, 2023\n1,099,880\n \n$\n204\n \nGranted\n484,909\n \n229\n \nVested\n(\n314,695\n)\n204\n \nCancelled\n(\n182,736\n)\n208\n \nOutstanding at December 31, 2024\n1,087,358\n \n219\n \n79\nTable of Contents\nThe total fair value of restricted stock, restricted stock units and performance shares that vested during 2024, 2023 and 2022 was $\n61.4\n million, $\n49.6\n million and $\n52.2\n million, respectively.\nUnder the ESPP, eligible employees may acquire shares of Class A common stock using after-tax payroll deductions made during consecutive offering periods of approximately six months in duration. Shares are purchased at the end of each offering period at a price of \n90\n% of the closing price of the Class A common stock as reported on the Nasdaq Global Select Market. Compensation expense is recognized on the dates of purchase for the discount from the closing price. In 2024, 2023 and 2022, a total of \n37,466\n, \n40,960\n and \n41,722\n shares, respectively, of Class A common stock were issued to participating employees. These shares are subject to a six-month holding period. Annual expense of $\n0.8\n million for the purchase discount was recognized in 2024, 2023 and 2022. \nNon-executive directors receive an annual award of Class A common stock with a value equal to $\n145,000\n. Non-executive directors could also elect to receive some or all of the cash portion of their annual stipend, up to $\n95,000\n, in shares of stock based on the closing price at the date of distribution. As a result, \n18,901\n shares, \n19,966\n shares and \n18,836\n shares of Class A common stock were issued to non-executive directors during 2024, 2023 and 2022, respectively. These shares are not subject to any vesting restrictions. Expense of $\n3.6\n million related to these stock-based payments was recognized for the years ended December 31, 2024, 2023 and 2022.\n \n16. \nACCUMULATED OTHER COMPREHENSIVE INCOME (LOSS)\nThe following tables present changes in the accumulated balances for each component of other comprehensive income (loss), including current period other comprehensive income and reclassifications out of accumulated other comprehensive income (loss):\n(in millions)\nInvestment Securities\nDefined Benefit Plans\nDerivative Investments\nForeign Currency Translation\nTotal\nBalance at December 31, 2023\n$\n(\n0.4\n)\n$\n(\n23.4\n)\n$\n62.0\n \n$\n(\n93.8\n)\n$\n(\n55.6\n)\nOther comprehensive income before reclassifications and income tax benefit (expense)\n0.2\n \n12.2\n \n—\n \n(\n61.0\n)\n(\n48.6\n)\nAmounts reclassified from accumulated other comprehensive income\n—\n \n0.1\n \n(\n3.6\n)\n2.2\n \n(\n1.3\n)\nIncome tax benefit (expense)\n(\n0.1\n)\n(\n3.0\n)\n0.9\n \n2.2\n \n—\n \nNet current period other comprehensive income \n0.1\n \n9.3\n \n(\n2.7\n)\n(\n56.6\n)\n(\n49.9\n)\nBalance at December 31, 2024\n$\n(\n0.3\n)\n$\n(\n14.1\n)\n$\n59.3\n \n$\n(\n150.4\n)\n$\n(\n105.5\n)\n(in millions)\nInvestment Securities\nDefined Benefit Plans\nDerivative Investments\nForeign Currency Translation\nTotal\nBalance at December 31, 2022\n$\n(\n0.9\n)\n$\n(\n22.8\n)\n$\n64.7\n \n$\n(\n174.3\n)\n$\n(\n133.3\n)\nOther comprehensive income before reclassifications and income tax benefit (expense)\n0.6\n \n(\n0.9\n)\n—\n \n70.8\n \n70.5\n \nAmounts reclassified from accumulated other comprehensive income\n—\n \n0.1\n \n(\n3.6\n)\n9.7\n \n6.2\n \nIncome tax benefit (expense)\n(\n0.1\n)\n0.2\n \n0.9\n \n—\n \n1.0\n \nNet current period other comprehensive income\n0.5\n \n(\n0.6\n)\n(\n2.7\n)\n80.5\n \n77.7\n \nBalance at December 31, 2023\n$\n(\n0.4\n)\n$\n(\n23.4\n)\n$\n62.0\n \n$\n(\n93.8\n)\n$\n(\n55.6\n)\n80\nTable of Contents\n(in millions)\nInvestment Securities\nDefined Benefit Plans\nDerivative Investments\nForeign Currency Translation\nTotal\nBalance at December 31, 2021\n$\n1.1\n \n$\n(\n34.8\n)\n$\n66.1\n \n$\n21.1\n \n$\n53.5\n \nOther comprehensive income before reclassifications and income tax benefit (expense)\n(\n2.7\n)\n14.9\n \n—\n \n(\n195.4\n)\n(\n183.2\n)\nAmounts reclassified from accumulated other comprehensive income\n—\n \n1.2\n \n(\n1.9\n)\n—\n \n(\n0.7\n)\nIncome tax benefit (expense)\n0.7\n \n(\n4.1\n)\n0.5\n \n—\n \n(\n2.9\n)\nNet current period other comprehensive income\n(\n2.0\n)\n12.0\n \n(\n1.4\n)\n(\n195.4\n)\n(\n186.8\n)\nBalance at December 31, 2022\n$\n(\n0.9\n)\n$\n(\n22.8\n)\n$\n64.7\n \n$\n(\n174.3\n)\n$\n(\n133.3\n)\n17. \nFAIR VALUE MEASUREMENTS\nThe company uses a three-level classification hierarchy of fair value measurements for disclosure purposes: \n•\nLevel 1 inputs, which are considered the most reliable evidence of fair value, consist of quoted prices (unadjusted) for identical assets or liabilities in active markets. \n•\nLevel 2 inputs consist of observable market data, such as quoted prices for similar assets and liabilities in active markets, or inputs other than quoted prices that are directly observable. \n•\nLevel 3 inputs consist of unobservable inputs which are derived and cannot be corroborated by market data or other entity-specific inputs.\nThe company’s level 1 assets generally include investments in publicly traded mutual funds, equity securities and corporate debt securities with quoted market prices. In general, the company uses quoted prices in active markets for identical assets to determine the fair value of marketable securities. \nThe company’s level 2 assets and liabilities generally consist of long-term debt notes. The fair values of the long-term debt notes were based on quoted market prices in an inactive market. \nThe company’s level 3 assets and liabilities include certain investments that were adjusted to fair value. \nRecurring Fair Value Measurements. \nFinancial assets recorded at fair value on the consolidated balance sheets as of December 31, 2024 and 2023 were classified in their entirety based on the lowest level of input that was significant to each asset's fair value measurement. \nFinancial Instruments Measured at Fair Value on a Recurring Basis:\n \nDecember 31, 2024\n(in millions)\nLevel 1\nLevel 2\nLevel 3\nTotal\nAssets at Fair Value:\nMarketable securities:\nCorporate debt securities\n$\n8.8\n \n$\n—\n \n$\n—\n \n$\n8.8\n \nMutual funds\n104.2\n \n—\n \n—\n \n104.2\n \nEquity securities\n0.2\n \n—\n \n—\n \n0.2\n \nTotal Marketable Securities\n113.2\n \n—\n \n—\n \n113.2\n \nTotal Assets at Fair Value\n$\n113.2\n \n$\n—\n \n$\n—\n \n$\n113.2\n \n81\nTable of Contents\n \nDecember 31, 2023\n(in millions)\nLevel 1\nLevel 2\nLevel 3\nTotal\nAssets at Fair Value:\nMarketable securities:\nCorporate debt securities\n$\n10.2\n \n$\n—\n \n$\n—\n \n$\n10.2\n \nMutual funds\n101.3\n \n—\n \n—\n \n101.3\n \nEquity securities\n0.2\n \n—\n \n—\n \n0.2\n \nTotal Marketable Securities\n111.7\n \n—\n \n—\n \n111.7\n \nTotal Assets at Fair Value\n$\n111.7\n \n$\n—\n \n$\n—\n \n$\n111.7\n \nNon-Recurring Fair Value Measurements.\n \nDuring 2024, the company recognized net unrealized losses of $\n6.6\n million on equity investments without readily determinable fair value. The fair value of these investments were estimated to be $\n11.6\n million at December 31, 2024. This fair value assessments were based on quantitative factors, including observable price changes. The fair value measurements of these investments are considered level 3 and non-recurring. This investment is included in other assets on the consolidated balance sheet.\nFair Values of Debt Notes. \nThe follo\nwing presents the estimated fair values of short-term and long-term debt notes, which are carried at amortized cost on the consolidated balance sheets. The fair values below are classified as level 2 under the fair value hierarchy and were estimated using quoted market prices in inactive markets.  \nAt December 31, 2024, the fair values were as follows: \n(in millions)\nFair Value\nLevel\n$750.0 million fixed rate notes due March 2025\n$\n747.0\n \nLevel 2\n$500.0 million fixed rate notes due June 2028\n487.1\n \nLevel 2\n$750.0 million fixed rate notes due March 2032\n646.4\n \nLevel 2\n$750.0 million fixed rate notes due September 2043\n752.4\n \nLevel 2\n$700.0 million fixed rate notes due June 2048\n581.1\n \nLevel 2\n18. SEGMENT REPORTING\nThe company's business is conducted through one reportable business segment, CME Group consolidated. The company has one operating segment as this is the level at which resource allocation and operating decisions regarding company performance are evaluated and determined by the senior leadership team.\nThe company’s chief operating decision maker (CODM) is the senior leadership team that includes the Chairman and Chief Executive Officer, Chief Information Officer, Senior Managing Director Global Head of Fixed Income, President and Chief Financial Officer, Senior Managing Director and General Counsel, Senior Managing Director Global Head Equities, FX, and Alternative Products, Chief Human Resources Officer, Senior Managing Director Global Head of Commodities Markets, Chief Operating Officer and Global Head of Clearing, Chief Transformation Officer, and Chief Commercial Officer.  The members of the senior leadership team represent a cross-functional group of management, which evaluates the company’s operating results in order to evaluate performance and make decisions about the company’s operating matters.  \nThe CODM reviews the financial results of CME Group consolidated on an ongoing basis throughout the year. As a single segment, the segment profitability measure is consolidated net income. Consolidated net income informs key operating decisions as made by the CODM, which include bonus allocation, discretionary share-based awards, liquidity and cash needs, new product development, existing product expansion, and product discontinuation. Consolidated net income is deemed the best indicator of segment performance. Segment assets are not reported to, or used by, the CODM to allocate resources or to assess performance.\nThe CODM evaluates current period consolidated net income performance as compared to prior periods, budgeted results, and forecasts. The CODM reviews consolidated revenues as disaggregated by the following: clearing and transaction fees as a combination of rate per contract and average daily volume for each major asset class, market data fee revenue, and other revenue. The significant expense categories are consistent with those presented on the face of the consolidated statements of income. The components of non-operating income are also reviewed by the CODM. It is noted that the level of financial information provided to the CODM is consistent with the financial statement line items as disclosed in our consolidated statements of income.\n \n82\nTable of Contents\n19. \nEARNINGS PER SHARE\nThe company uses the two-class method to calculate basic and diluted earnings per common share because its Series G preferred stock are participating securities. Under the two-class method, undistributed earnings are allocated to common stock and participating securities according to their respective rights in undistributed earnings, as if all of the earnings for the period had been distributed. Basic earnings per common share is computed by dividing the net income attributable to common shareholders by the weighted average number of common shares outstanding during the period. Net income attributable to common shareholders is reduced for preferred stock dividends earned during the period. Series G preferred stock also receives a proportionate allocation of undistributed or overdistributed earnings for the period because Series G preferred stock has a contractual obligation to share in profits and losses of the company. Diluted earnings per share is computed by dividing the net income attributable to common shareholders by the weighted average number of common shares outstanding plus potentially dilutive common shares.\nAnti-dilutive stock awards were as follows for the years presented:\n(in thousands)\n2024\n2023\n2022\nStock awards\n89\n \n455\n \n158\n \nTotal\n89\n \n455\n \n158\n \nThe following table presents the earnings per share calculation for the years presented:\n2024\n2023\n2022\nNet Income Attributable to CME Group (in millions)\n$\n3,525.8\n \n$\n3,226.2\n \n$\n2,691.0\n \nLess: Preferred stock dividends\n(\n47.7\n)\n(\n44.2\n)\n(\n38.9\n)\nLess: (Undistributed earnings) overdistributed earnings allocated to preferred stock\n3.4\n \n3.6\n \n5.1\n \nNet Income Attributable to Common Shareholders of CME Group\n$\n3,481.5\n \n$\n3,185.6\n \n$\n2,657.2\n \nWeighted Average Common Shares Outstanding (in thousands):\nBasic\n359,389\n \n359,023\n \n358,713\n \nEffect of stock options and stock awards \n555\n \n477\n \n468\n \nDiluted\n359,944\n \n359,500\n \n359,181\n \nEarnings per Common Share Attributable to Common Shareholders of CME Group:\nBasic\n$\n9.69\n \n$\n8.87\n \n$\n7.41\n \nDiluted\n9.67\n \n8.86\n \n7.40\n \n20. \nSUBSEQUENT EVENTS\nThe company has evaluated subsequent events through the date the financial statements were issued. The company has determined that there were no subsequent events that require disclosure.\n83\nTable of Contents\nITEM 9.    CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNot applicable.\n \nITEM 9A.    CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nOur management, with the participation of our Chief Executive Officer and Chief Financial Officer, has evaluated the effectiveness of our disclosure controls and procedures (as such term is defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (Exchange Act)) as of the end of the period covered by this Annual Report on Form 10-K. Based on such evaluation, our Chief Executive Officer and Chief Financial Officer have concluded that, as of the end of such period, our disclosure controls and procedures are effective. \nChanges in Internal Control Over Financial Reporting\nAs required by Rule 13a-15(d) under the Exchange Act, the company's management, including the company's Chief Executive Officer and Chief Financial Officer, have evaluated the company's internal control over financial reporting (as such term is defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) to determine whether any changes occurred during the period covered by this report that have materially affected, or are reasonably likely to materially affect, the company's internal control over financial reporting. There were no changes in the company’s internal control over financial reporting which occurred during the fourth quarter of 2024, that have materially affected, or are reasonably likely to materially affect, the company’s internal control over financial reporting.\nManagement’s Annual Report on Internal Control Over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting. Our internal control system has been designed to provide reasonable assurance to management and the board of directors regarding the preparation and fair presentation of published financial statements.\nManagement assessed the effectiveness of the company’s internal control over financial reporting as of December 31, 2024. Management based its assessment on criteria for effective internal control over financial reporting described in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework). Management’s assessment included evaluating the design of our internal control over financial reporting and testing the operational effectiveness of our internal control over financial reporting. The results of its assessment were reviewed with the audit committee of the board of directors.\nBased on this assessment, management believes that, as of December 31, 2024, our internal control over financial reporting is effective. The effectiveness of our internal control over financial reporting as of December 31, 2024 has been audited by Ernst & Young LLP (PCAOB ID \n42\n), an independent registered public accounting firm, as stated in the report on page 87.\n84\nTable of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of CME Group Inc.\nOpinion on the Financial Statements \nWe have audited the accompanying consolidated balance sheets of CME Group Inc. and subsidiaries (the Company) as of December 31, 2024 and 2023, the related consolidated statements of income, comprehensive income, equity and cash flows for each of the three years in the period ended December 31, 2024, and the related notes and financial statement schedule listed in the Index at Item 15(a) (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with U.S. generally accepted accounting principles. \nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework), and our report dated February 27, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB. \nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the account or disclosure to which it relates. \n85\nTable of Contents\nUncertain Tax Positions\nDescription of the Matter\nAs discussed in Note 9 to the consolidated financial statements, the Company had unrecognized income tax benefits of $251.6 million related to uncertain tax positions as of December 31, 2024. Uncertainty in a tax position may arise due to the application of complex tax regulations. The Company uses significant judgment to (1) determine whether, based on the technical merits, the tax position is more likely than not to be sustained upon examination and (2) measure the amount of the tax benefit that qualifies for recognition.\nAuditing management’s estimate of the Company’s uncertain tax positions that qualified for recognition and the related unrecognized income tax benefits was especially challenging because management’s estimate involved significant judgment in evaluating the technical merits of the positions, including interpretations of applicable tax laws and regulations.\nHow We Addressed the Matter in Our Audit\nWe tested the Company’s controls that address the risk of material misstatement relating to the recognition and measurement of uncertain tax positions. For example, we tested controls over the Company’s assessment of the technical merits of tax positions and management’s process to measure the benefit of those tax positions that qualified for recognition, including management’s review of the inputs used in the calculations.\nWe involved our tax professionals to evaluate the technical merits of the Company's tax positions. Our audit procedures included, among others, evaluating the assumptions the Company used to develop its uncertain tax positions and related unrecognized income tax benefit amount by jurisdiction. We also tested the completeness and accuracy of the underlying data used by the Company to calculate its uncertain tax positions, inspected correspondence with relevant tax authorities, and evaluated third-party advice obtained and used by the Company in assessing the technical merits of its tax positions.\n/s/ \nErnst & Young LLP\nWe have served as the Company’s auditor since 2002.\nChicago, Illinois\n \nFebruary 27, 2025\n86\nTable of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of CME Group Inc.\nOpinion on Internal Control Over Financial Reporting\nWe have audited CME Group Inc. and subsidiaries’ internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, CME Group Inc. and subsidiaries (the Company) maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on the COSO criteria. \nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of December 31, 2024 and 2023, the related consolidated statements of income, comprehensive income, equity and cash flows for each of the three years in the period ended December 31, 2024, and the related notes and financial statement schedule listed in the Index at Item 15(a) and our report dated February 27, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Annual Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB. \nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. \nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP  \nChicago, Illinois \nFebruary 27, 2025\n87\nTable of Contents\nITEM 9B.    OTHER INFORMATION\nDuring the \nquarter ended\n December 31, 2024, no director or officer of the Company adopted or terminated a “Rule 10b5-1 trading arrangement” or “non-Rule 10b5-1 trading arrangement,” as each term is defined in Item 408(a) of Regulation S-K.\nITEM 9C.\n \n   DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTION\nS\nNot applicable.\nPART III\n \nITEM 10.    DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nWe have adopted written codes of conduct applicable to all of our employees, including our Chairman and Chief Executive Officer, Chief Financial Officer, Chief Accounting Officer and other senior financial officers. In accordance with SEC rules and regulations, copies of these codes of conduct are available on our website at \nwww.cmegroup.com \nunder the \"Investor Relations — Corporate Governance\" link. In accordance with SEC rules and regulations and the listing requirements of Nasdaq, we intend to disclose promptly on the website and location specified above any substantive amendments to these codes of conduct and any waivers granted to our executive officers or Board members. In addition, we have adopted Corporate Governance Principles which govern the practices of our board of directors. You may also obtain a copy of our codes of conduct and our Corporate Governance Principles by following the instructions in the section of this Annual Report on Form 10-K entitled \"Item 1 - Business - Available Information.\" \nWe have adopted an insider trading policy governing the purchase, sale and other dispositions of the Company's securities by the Company's directors, officers and employees, as well as by the Company itself. We believe our insider trading policy is reasonably designed to promote compliance with insider trading laws, rules and regulations, and listing standards applicable to the Company. Our insider trading policy is filed as Exhibit 19.1 to this Form 10-K.\nCertain of the information called for by this item is hereby incorporated herein by reference to the relevant portions of CME Group’s definitive proxy statement for the Annual Meeting of Shareholders to be held on May 8, 2025, to be filed by CME Group with the SEC pursuant to Regulation 14A within 120 days after December 31, 2024 (Proxy Statement). Additional information called for by this item is contained in Item 1 of this Annual Report on Form 10-K under the caption \"Information about our Executive Officers.\" \nITEM 11.    EXECUTIVE COMPENSATION\nCertain of the information called for by this item is hereby incorporated herein by reference to the relevant portions of the Proxy Statement. \nITEM 12.    SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED SHAREHOLDER MATTERS\nCertain of the information called for by this item relating to the security ownership of certain beneficial owners and management is hereby incorporated herein by reference to the relevant portions of the Proxy Statement. \nEQUITY COMPENSATION PLAN INFORMATION \nWe currently maintain the following equity compensation plans: CME Group Inc. Amended and Restated Omnibus Stock Plan, CME Group Inc. Director Stock Plan and CME Group Inc. Amended and Restated Employee Stock Purchase Plan. We do not maintain any equity compensation plans not approved by shareholders. A description of each of these plans and the number of shares authorized and available for future awards is included in note 15 of the notes to consolidated financial statements. The numbers in the following table are as of December 31, 2024. \n88\nTable of Contents\n \nPlan Category\nNumber of Securities\nto be Issued Upon\nExercise of Outstanding Options (a)\nWeighted-Average Exercise Price of Outstanding Options\nNumber of Securities Remaining Available for Future Issuance Under Equity Compensation Plans (excluding securities reflected in column (a))\nEquity compensation plans approved by security holders\n— \n$\n— \n14,815,109 \nEquity compensation plans not approved by security holders\n— \n— \n— \nTotal\n— \n14,815,109 \nITEM 13.    CERTAIN RELATIONSHIPS, RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nCertain of the information called for by this item is hereby incorporated herein by reference to the relevant portions of CME Group's definitive proxy statement for the Annual Meeting of Shareholders to be held on May 8, 2025. \nITEM 14.    PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information required by this Item will appear in the Proxy Statement and is incorporated herein by reference. \nPART IV\n \nITEM 15.    EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a) Financial Statements, Financial Statement Schedules and Exhibits \n(1) Financial Statements \nThe following Consolidated Financial Statements and related Notes included within Item 8, together with the Reports of Independent Registered Public Accounting Firm with respect thereto and included within Item 9A, are hereby incorporated by reference: \nReports of Independent Registered Public Accounting Firm \nConsolidated Balance Sheets at December 31, 2024 and 2023 \nConsolidated Statements of Income for the Years Ended December 31, 2024, 2023 and 2022 \nConsolidated Statements of Comprehensive Income for the Years Ended December 31, 2024, 2023 and 2022\nConsolidated Statements of Equity for the Years Ended December 31, 2024, 2023 and 2022\nConsolidated Statements of Cash Flows for the Years Ended December 31, 2024, 2023 and 2022 \nNotes to Consolidated Financial Statements \n(2) Financial Statement Schedules \nThe following Financial Statement Schedule is filed as part of this Annual Report on Form 10-K:\n \nCME Group Inc. and Subsidiaries\nSchedule II—Valuation and Qualifying Accounts\nFor the Years Ended December 31, 2024, 2023 and 2022 \n(dollars in millions)\n \n89\nTable of Contents\nBalance at\nbeginning\nof year\nCharged\n(credited) to\ncosts and\nexpenses\nOther\n(1)\nBalance\nat end\nof year\nYear Ended December 31, 2024\nAllowance for doubtful accounts\n$\n7.1\n \n$\n2.1\n \n$\n(\n0.2\n)\n$\n9.0\n \nAllowance for deferred tax assets\n0.4\n \n(\n0.4\n)\n—\n \n—\n \nYear Ended December 31, 2023\nAllowance for doubtful accounts\n$\n8.1\n \n$\n0.6\n \n$\n(\n1.6\n)\n$\n7.1\n \nAllowance for deferred tax assets\n0.4\n \n—\n \n—\n \n0.4\n \nYear Ended December 31, 2022\nAllowance for doubtful accounts\n$\n5.6\n \n$\n3.9\n \n$\n(\n1.4\n)\n$\n8.1\n \nAllowance for deferred tax assets\n0.6\n \n—\n \n(\n0.2\n)\n0.4\n \n_______________\n(1)\nIncludes write-offs of doubtful accounts, foreign currency and write-offs of fully reserved deferred tax assets. \nAll other schedules have been omitted because the information required to be set forth in those schedules is not applicable or is shown on the consolidated financial statements or notes thereto.\n(3)\nExhibits\nSee (b) Exhibits below\n90\nTable of Contents\n(b) Exhibits\n \nExhibit\nNumber\nDescription of Exhibit\n3.\nArticles of Incorporation and Bylaws\n3.1\nFourth Amended and Restated Certificate of Incorporation of CME Group Inc., as amended (incorporated by reference to Exhibit 3.2 to CME Group Inc.'s Current Report on Form 8-K, filed with the SEC on November 4, 2021).\n3.2\nSeventeenth Amended and Restated Bylaws of CME Group Inc. (incorporated by reference to Exhibit 3.1 to CME Group Inc.’s Current Report on Form 8-K, filed with the SEC on December 9, 2022).\n3.3\nCertificate of Designations of Series G Non-Voting Convertible Preferred Stock (incorporated by reference to Exhibit 3.1 to CME Group Inc.'s Current Report on Form 8-K, filed with the SEC on November 4, 2021). \n4.\nInstruments Defining the Rights of Security Holders\n4.1\nAmended and Restated Commercial Paper Dealer Agreement, dated as of October 20, 2014, among CME Group Inc., as Issuer, and Barclays Capital Inc., as Dealer (incorporated by reference to Exhibit 4.1 to CME Group Inc.'s Form 10-K, filed with the SEC on February 26, 2015).\n4.2\nAmended and Restated Commercial Paper Dealer Agreement, dated as of October 20, 2014, between CME Group Inc., as Issuer, and Merrill Lynch, Pierce, Fenner & Smith Incorporated, as Dealer (incorporated by reference to Exhibit 4.3 to CME Group Inc.'s 10-K, filed with the SEC on February 26, 2015).\n4.3\nAmended and Restated Commercial Paper Dealer Agreement, dated as of October 20, 2014, between CME Group Inc., as Issuer, and Goldman, Sachs & Co., as Dealer (incorporated by reference to Exhibit 4.4 to CME Group Inc.'s Form 10-K, filed with the SEC on February 26, 2015).\n4.4\nIndenture, dated August 12, 2008, between CME Group Inc. and U.S. Bank National Association (incorporated by reference to Exhibit 4.1 to CME Group Inc.’s Current Report on Form 8-K, filed with the SEC on August 13, 2008).\n4.5\nSixth Supplemental Indenture (including the form of 5.300% note due 2043), dated as of September 9, 2013, between CME Group Inc. and U.S. Bank National Association (incorporated by reference to Exhibit 4.2 to CME Group Inc.'s Current Report on Form 8-K, filed with the SEC on September 9, 2013). \n4.6\nSeventh Supplemental Indenture (including the form of 3.000% note due 2025), dated as of March 9, 2015, between CME Group Inc. and U.S. Bank National Association (incorporated by reference to Exhibit 4.2 to CME Group Inc.'s Current Report on Form 8-K, filed with the SEC on March 9, 2015).\n4.7\nEighth Supplemental Indenture (including the form of 3.750% note due 2028), dated as of June 21, 2018, between CME Group Inc. and U.S. Bank National Association (incorporated by reference to Exhibit 4.2 to CME Group  Inc.'s Current Report on Form 8-K, filed with the SEC on June 21, 2018).\n4.8\nNinth Supplemental Indenture (including the form of 4.150% note due 2048), dated as of June 21, 2018, between CME Group Inc. and U.S. Bank National Association (incorporated by reference to Exhibit 4.3 to CME Group Inc.'s Current Report on Form 8-K, filed with the SEC on June 21, 2018).\n4.9\nTenth Supplemental Indenture (including the form of 2.650% Notes due 2032), dated as of March 8, 2022, between CME Group Inc. and U.S. Bank Trust Company, National Association (incorporated by reference to Exhibit 4.2 to CME Group Inc.’s Current Report on Form 8-K filed with the SEC on March 8, 2022).\n4.10\nDescription of securities (incorporated by reference to Exhibit 4.11 to CME Group Inc's Form 10-K, filed with the SEC on February 2, 2022).\n10.\nMaterial Contracts\n10.1(1)\nCME Group Inc. Fourth Amended and Restated Omnibus Stock Plan, amended and restated as of March 1, 2024 (incorporated by reference to Exhibit 10.1 to CME Group Inc.’s Form 8-K, filed with the SEC on March 7, 2024).\n10.2(1)\nCME Group Inc. Director Stock Plan, amended and restated as of May 4, 2022 (incorporated by reference to Exhibit 99.1 to CME Group Inc.’s Form S-8, filed with the SEC on June 9, 2022).\n10.3(1)\nForm of Equity Stipend Grant Letter for Non-Executive Directors (incorporated by reference to Exhibit 10.5 to CME Group Inc.'s Form 10-K, filed with the SEC on March 1, 2018).\n10.4(1)\nCME Group Inc. Employee Stock Purchase Plan, amended and restated as of May 4, 2022 (incorporated by reference to Exhibit 99.2 to CME Group Inc.’s Form S-8, filed with the SEC on June 9, 2022).\n91\nTable of Contents\nExhibit\nNumber\nDescription of Exhibit\n10.5(1)\nThird Amendment to Chicago Mercantile Exchange Inc. Senior Management Supplemental Deferred Savings Plan, as of December 6, 2023 (filed herewith). Second Amendment to Chicago Mercantile Exchange Inc. Senior Management Supplemental Deferred Savings Plan, as of June 1, 2023 (filed herewith). First Amendment to Chicago Mercantile Exchange Inc. Senior Management Supplemental Deferred Savings Plan, as of January 1, 2020 (filed herewith). Chicago Mercantile Exchange Inc. Senior Management Supplemental Deferred Savings Plan (SMSDSP), Amended and Restated as of January 1, 2017 (incorporated by reference to Exhibit 10.1 to CME Group Inc.'s Form 10-Q, filed with the SEC on August 2, 2017).\n10.6(1)\nChicago Mercantile Exchange Inc. Directors' Deferred Compensation Plan, amended and restated as of January 1, 2009 (incorporated by reference to Exhibit 10.9 to CME Group Inc.'s Form 10-K, filed with the SEC on March 2, 2009).\n10.7(1)\nRecognition and Retention Plan for Members of the COMEX Division of New York Mercantile Exchange (incorporated by reference to Exhibit 10.11 to NYMEX Holdings, Inc.'s Form 10-K, filed with the SEC on March 29, 2001); Amendment to the Recognition and Retention Plan for Members of the COMEX Division of the New York Mercantile Exchange, dated October 22, 2015 (incorporated by reference to Exhibit 10.1 to CME Group Inc.'s Form 10-Q, filed with the SEC on November 6, 2015).\n10.8\nAmended and Restated Commercial Paper Dealer Agreement, dated as of October 20, 2014, among CME Group Inc., as Issuer, and Barclays Capital Inc., as Dealer (incorporated by reference to Exhibit 4.1 above).\n10.9\nAmended and Restated Commercial Paper Dealer Agreement, dated as of October 20, 2014, between CME Group Inc., as Issuer, and Merrill Lynch, Pierce, Fenner & Smith Incorporated, as Dealer (incorporated by reference to Exhibit 4.2 above).\n10.10\nAmended and Restated Commercial Paper Dealer Agreement, dated as of October 20, 2014, between CME Group Inc., as Issuer, and Goldman, Sachs & Co., as Dealer (incorporated by reference to Exhibit 4.3 above).\n10.11\nAmendment No. 5 to Credit Agreement, dated as of April 28, 2021, among Chicago Mercantile Exchange Inc., certain lenders, Bank of America, N.A., as Administrative Agent, and Citibank, N.A., as Collateral Agent and Collateral Monitoring Agent. The Amended Credit Agreement, as amended through Amendment No. 5, among Chicago Mercantile Exchange Inc., certain lenders, Bank of America, N.A., as Administrative Agent, and Citibank, N.A., as Collateral Agent and Collateral Monitoring Agent, is attached as Annex A to Amendment No. 5 (incorporated by reference to Exhibit 10.1 to CME Group Inc.'s Current Report on Form 8-K, filed with the SEC on April 29, 2021).\n10.12\nAmendment No. 6 to Credit Agreement, dated as of April 27, 2022, among Chicago Mercantile Exchange Inc., Bank of America, N.A., in its capacity as administrative agent, Citibank, N.A., in its capacity as collateral agent and collateral monitoring agent, and the banks party thereto. The Amended Credit Agreement, as amended through Amendment No. 6, among Chicago Mercantile Exchange Inc., each of the banks party thereto, Bank of America, N.A., in its capacity as administrative agent, and Citibank, N.A., in its capacity as collateral agent and collateral monitoring agent, is attached as Annex A to Amendment No. 6 (incorporated by reference to Exhibit 10.1 to CME Group Inc.’s Current Report on Form 8-K, filed with the SEC on April 28, 2022).\n10.13\nAmendment No. 7 to Credit Agreement, dated as of April 26, 2023, among Chicago Mercantile Exchange Inc., Bank of America, N.A., in its capacity as administrative agent, Citibank, N.A., in its capacity as collateral agent and collateral monitoring agent, and the banks party thereto. The Amended Credit Agreement, as amended through Amendment No. 7, among Chicago Mercantile Exchange Inc., each of the banks party thereto, Bank of America, N.A., in its capacity as administrative agent, and Citibank, N.A., in its capacity as collateral agent and collateral monitoring agent, is attached as Annex A to Amendment No. 7 (incorporated by reference to Exhibit 10.1 to CME Group Inc.’s Current Report on Form 8-K, filed with the SEC on April 28, 2023).\n10.14\nAmendment No. 8 to Credit Agreement, dated as of April 24, 2024, among Chicago Mercantile Exchange Inc., Bank of America, N.A., in its capacity as administrative agent, Citibank, N.A., in its capacity as collateral agent and collateral monitoring agent, and the banks party thereto. The Amended Credit Agreement, as amended through Amendment No. 8, among Chicago Mercantile Exchange Inc., each of the banks party thereto, Bank of America, N.A., in its capacity as administrative agent, and Citibank, N.A., in its capacity as collateral agent and collateral monitoring agent, is attached as Annex A to Amendment No. 8 (incorporated by reference to Exhibit 10.1 to CME Group Inc.’s Current Report on Form 8-K, filed with the SEC on April 25, 2024).\n10.15(1)\nForm of Equity Grant Letter for Restricted Shares (incorporated by reference to Exhibit 10.1 to CME Group Inc.'s Form 10-Q, filed with the SEC on November 3, 2021).\n10.16(1)\nForm of Equity Grant Letter for Annual Grant of Performance Shares (incorporated by reference to Exhibit 10.1(1) to CME Group Inc.’s Form 10-Q, filed with the SEC on November 1, 2023)\n92\nTable of Contents\nExhibit\nNumber\nDescription of Exhibit\n10.17\nCredit Agreement, dated as of November 12, 2021, among CME Group Inc., certain lenders, agents, arrangers, bookrunners, and Bank of America, N.A., as Administrative Agent (incorporated by reference to Exhibit 10.1 to CME Group Inc.'s Current Report on Form 8-K, filed with the SEC on November 16, 2021).\n10.18(2)\nLicense Agreement, dated June 29, 2012, between Standard & Poor’s Financial Services LLC and Chicago Mercantile Exchange Inc. (incorporated by reference to Exhibit 10.5 to CME Group Inc.'s Form 10-Q, filed with the SEC on August 3, 2022).\n10.19(1)\nCME Group Inc. Severance Plan, as amended and restated, effective March 7, 2023 (incorporated by reference to Exhibit 10.1 to CME Group Inc.’s Form 8-K, filed with the SEC on March 10, 2023). \n10.20(1)\nCME Group Inc. Annual Incentive Plan, as amended and restated effective as of October 2, 2023 (incorporated by reference to Exhibit 10.2 to CME Group Inc.’s Form 8-K, filed with the SEC on November 13, 2023). \n10.22(1)\nAmended and Restated Agreement, effective as of November 6, 2024, between CME Group Inc. and Terrence A. Duffy (incorporated by reference to Exhibit 10.1 to CME Group Inc.’s Form 8-K, filed with the SEC on November 7, 2024).\n19.1(2)*\nCME Group Inc. Personal Trading Policy.\n21.1*\nList of Subsidiaries of CME Group Inc.\n23.1*\nConsent of Ernst & Young LLP.\n31.1*\nSection 302—Certification of Terrence A. Duffy.\n31.2*\nSection 302—Certification of Lynne Fitzpatrick.\n32.1*\nCertification Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n97.1\nCME Group Inc. Compensation Recoupment Policy for Executive Officers effective as of October 2, 2023.\n101\nThe following materials from CME Group Inc.’s Annual Report on Form 10-K for the year ended December 31, 2024, formatted in Inline XBRL (Extensible Business Reporting Language): (i) the Consolidated Balance Sheets, (ii) the Consolidated Statements of Income, (iii) the Consolidated Statements of Comprehensive Income, (iv) the Consolidated Statements of Equity, (v) the Consolidated Statements of Cash Flows and (vi) the Notes to Consolidated Financial Statements, tagged as blocks of text.\n104\nThe cover page from CME Group Inc.'s Annual Report on Form 10-K for the year ended December 31, 2024, formatted in Inline XBRL.\n_______________\n \n*\nFiled herewith.\n(1)\nManagement contract or compensatory plan or arrangement.\n(2)\nPortions of this exhibit have been redacted in compliance with Item 601(b)(10) of Regulation S-K.\n93\nTable of Contents\nITEM 16.    FORM 10-K SUMMARY\nNone.\n94\nTable of Contents\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized, in the City of Chicago and State of Illinois on the 27th day of February, 2025.\n \nCME Group Inc.\nBy:\n \n/\nS\n/  LYNNE FITZPATRICK\n  \n \nLynne Fitzpatrick\nSenior Managing Director, President and Chief Financial Officer\n \nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities indicated, in the City of Chicago and State of Illinois on the 27th day of February, 2025.\nSignature\nTitle\n/\nS\n/    TERRENCE A. DUFFY  \nChairman of the Board, Director and Chief Executive Officer\nTerrence A. Duffy\n/\nS\n/    LYNNE FITZPATRICK\nSenior Managing Director, President and Chief Financial Officer\nLynne Fitzpatrick \n/\nS\n/    JACK TOBIN\nManaging Director and Chief Accounting Officer\nJack Tobin\n/\nS\n/    KATHRYN BENESH \n      \nDirector\nKathryn Benesh\n/\nS\n/    TIMOTHY S. BITSBERGER \n      \nDirector\nTimothy S. Bitsberger\n/\nS\n/    CHARLES P. CAREY\n      \nDirector\nCharles P. Carey\n/\nS\n/    ELIZABETH A. COOK\nDirector\nElizabeth A. Cook\n/\nS\n/    BRYAN T. DURKIN\nDirector\nBryan T. Durkin\n/\nS\n/    HAROLD FORD JR.\nDirector\nHarold Ford Jr.\n/\nS\n/    MARTIN J. GEPSMAN\nDirector\nMartin J. Gepsman\n/\nS\n/    LARRY G. GERDES\n        \nDirector\nLarry G. Gerdes\n/\nS\n/    DANIEL R. GLICKMAN \nDirector\nDaniel R. Glickman\n  /\nS\n/   WILLIAM W. HOBERT\nDirector\nWilliam W. Hobert\n  /\nS\n/   DANIEL G. KAYE\nDirector\nDaniel G. Kaye\n95\nTable of Contents\n  /\nS\n/   PHYLLIS M. LOCKETT\nDirector\nPhyllis M. Lockett\n/\nS\n/    DEBORAH J. LUCAS\nDirector\nDeborah J. Lucas\n/S/ PATRICK W. MALONEY\nDirector\nPatrick W. Maloney\n/S/ PATRICK J. MULCHRONE\nDirector\nPatrick J. Mulchrone\n/S/    TERRY L. SAVAGE\nDirector\nTerry L. Savage\n /\nS\n/    RAHAEL SEIFU\nDirector\nRahael Seifu\n /\nS\n/    WILLIAM R. SHEPARD\nDirector\nWilliam R. Shepard\n/\nS\n/    HOWARD J. SIEGEL\nDirector\nHoward J. Siegel\n/\nS\n/    DENNIS A. SUSKIND\nLead Director\nDennis A. Suskind\n/\nS\n/    ROBERT J. TIERNEY JR.\nDirector\nRobert J. Tierney Jr.\n96"
  }
}