{
  "ticker": "CMG",
  "cik": "0001058090",
  "company_name": "CHIPOTLE MEXICAN GRILL INC",
  "filing_date": "2025-02-05",
  "accession": "0001058090-25-000014",
  "primary_doc": "cmg-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1. BUSINESS\nGeneral\nChipotle Mexican Grill, Inc., a Delaware corporation, together with its subsidiaries (“Chipotle,” “we,” “us,” or “our”) owns and operates Chipotle Mexican Grill restaurants, which feature a relevant menu of burritos, burrito bowls (a burrito without the tortilla), quesadillas, tacos, and salads. We strive to cultivate a better world by serving responsibly sourced, classically cooked, real food with wholesome ingredients and without artificial colors, flavors or preservatives. We are passionate about providing a great guest experience and making our food more accessible to everyone while continuing to be a brand with a demonstrated purpose. Our first Chipotle restaurant opened in Denver, Colorado in 1993. Over 30 years later, our devotion to seeking out high-quality ingredients, raised with respect for animals, farmers, and the environment, remains at the core of our commitment to Food with Integrity.\nAs of December 31, 2024, we owned and operated 3,644 Chipotle restaurants throughout the United States (“U.S.”) and 82 international Chipotle restaurants. Additionally, we had three international licensed restaurants. We manage our U.S. operations based on ten regions and aggregate our operations to one reportable segment. \nOur revenue is derived from sales by our restaurants.\n3\nTable of Contents\nBusiness Strategy\nWe are a brand with a demonstrated purpose of Cultivating a Better World. Our mission is to win today while we grow our future by focusing on five key fundamental strategies:\n•\nRunning successful restaurants with a people accountable culture that provides great Food with Integrity while delivering exceptional in-restaurant and digital experiences;\n•\nAmplifying technology and innovation to drive growth and productivity at our restaurants, support centers and in our supply chain; \n•\nMaking the brand visible, relevant, and loved to acquire new guests and improve overall guest engagement;\n•\nSustaining world class people leadership by developing and retaining top talent at every level; and\n•\nExpanding access and convenience by accelerating new restaurant openings in North America and internationally. \nFood with Integrity\nServing high-quality food at reasonable prices is critical to ensuring guests enjoy wholesome food at a great value. In Chipotle-owned and operated restaurants, we strive to serve only animal products that are raised in accordance with criteria we have established in an effort to improve sustainability and promote animal welfare, and without the use of non-therapeutic antibiotics or added growth hormones. We brand our meats as “Responsibly Raised®.” We also seek to use responsibly grown produce, by which we mean produce grown by suppliers whose practices conform to our Food with Integrity standards and our priorities with respect to environmental considerations and employee welfare. For more information about our sustainability and animal welfare initiatives, see our biennial Sustainability Report and interim Update Report on our website www.chipotle.com/sustainability.\nPurchasing\nMaintaining the high levels of quality and safety we demand in our restaurants depends in part on our ability to acquire high-quality, fresh ingredients and other necessary supplies that meet our specifications from reliable suppliers. We work with 26 independently owned and operated regional distribution centers that purchase from various suppliers we carefully select based on the suppliers' understanding of and adherence to our mission and Food with Integrity standards, quality and price availability. We have also sought to increase the number of suppliers for our ingredients to help mitigate pricing volatility and reduce our reliance on one or several suppliers, which could create supply shortages. In addition, we closely monitor industry news, trade tariffs, weather, exchange rates, foreign demand, geopolitical crises and other world events that may affect our ingredient prices or available supply. Certain key ingredients are purchased from a small number of suppliers.\nQuality Assurance and Food Safety\nWe are committed to serving only safe, high-quality food. Our food safety and quality assurance teams work to ensure compliance with our food safety programs and practices, components of which include:\n•\nnaturally derived inhibitors to prevent microbial growth in ingredients;\n•\nadvanced technologies and tools that reduce or eliminate pathogens while maintaining food quality;\n•\nenhanced restaurant procedures and protocols for handling ingredients and sanitizing surfaces in our restaurants;\n•\nfood safety certifications;\n•\ninternal and third-party restaurant inspections;\n•\nsmall grower support during on-site audits;\n•\nsupplier interventions steps to mitigate food safety risks before ingredients reach Chipotle; and\n•\ningredient traceability.\n4\nTable of Contents\nThese and other food safety practices underscore our commitment to be a leader in food safety while continuing to serve high-quality food that our guests love. Our food safety and quality assurance teams establish and monitor our quality and food safety programs and work closely with suppliers to ensure our high standards are met throughout the supply chain. We maintain a limited list of approved suppliers, many of whom are among the top suppliers in the industry. In addition, we have a team approach where our training, operations, culinary, legal and restaurant food safety and quality assurance departments develop and implement operating standards for food quality, food preparation, restaurant cleanliness, employee health protocols, and safety in the restaurants. Our food safety programs are also intended to ensure we not only continue to comply with applicable food safety regulations, but also establish Chipotle as an industry leader in food safety. To help achieve this goal, we have a Food Safety Advisory Council comprised of some of the nation’s foremost food safety authorities. The Food Safety Advisory Council is charged with evaluating our programs and advising us on ways to maintain and elevate our food safety program. Our food safety and quality assurance team members hold board seats and participate in technical working groups with several associations. This gives us the opportunity to learn and share our knowledge and expertise with other food safety professionals and regulatory agencies.\nDigital Business and Innovation\nOur digital platform continues to be a strategic driver of our growth. Digital sales represent food and beverage revenue for company-owned restaurants generated through the Chipotle website, Chipotle app or third-party delivery aggregators and include revenue deferrals associated with Chipotle Rewards. Digital sales represented 35.1% of food and beverage revenue in 2024, compared to 37.4% in 2023. We have made digital ordering convenient with continued enhancements to our app and by building more Chipotlanes, which is our drive through format for guest pick-up of digital orders. We are also investing in technology and tools to modernize the back of house of our restaurants and to improve the team member experience.\nHuman Capital\nAt Chipotle, our vision is to cultivate an environment where our employees can thrive and grow into great leaders. We believe in investing and supporting our people because they are our most important asset. As of December 31, 2024, Chipotle employed 130,504 people worldwide and 1,328 contract workers. Of our employees, 127,820 worked in the United States, and 2,684 worked internationally across Canada, France, Germany, and the United Kingdom. Within the U.S., 126,233 employees worked in our restaurants, and 1,587 in our Restaurant Support Centers and Field Leadership. There were no union petitions or campaigns in 2024, and we continue to bargain in good faith with the one restaurant that voted in 2022 to form a union. We also continue to focus on building a positive people culture where employees feel supported, heard, and are able to grow with Chipotle. \nTalent Acquisition\nWe remain committed to the growth, development, and advancement of our people. In 2024, over 85% of our in-restaurant leadership roles were filled through internal promotions, which remains a critical component to our staffing strategy. To continually attract and hire external talent, we remain focused on creating a best-in-class job seeker and General Manager hiring experience that prioritizes speed, but that also aims to create a transparent process; an experience that identifies shift-specific needs and elevates our talent bar for quality-of-hire. We have seen early success with our new virtual hiring assistant \"Ava Cado\", almost doubling our application flow. With Ava Cado, approximately 90% of applications are completed, and restaurants are leveraging automated interview rescheduling, freeing up managers to run great restaurants and serve our guests. \nTo expand our recruitment marketing efforts we continue developing both new and existing partnerships, such as Transition Overwatch and Recruit Military, which assist transitioning Veterans and their spouses. We also prioritize understanding the hiring needs of our international operations in Canada, the United Kingdom, France, and Germany. \n5\nTable of Contents\nCulture and Inclusivity (\"C&I\")\nOur purpose extends beyond serving nutritious food using real ingredients. We are on a journey to create a global culture where everyone is welcome and feels a genuine sense of belonging, and we believe this is achieved through our daily interactions and commitment to model inclusive leadership.\nIn 2024, Chipotle continued to invest in employee development and training. Our learning programs include inclusive topics and skill-building to provide our leaders with the resources they need to succeed in their current roles and prepare for the future. Our training programs will continue to evolve to respond to a constantly changing world.\nDevotion to our culture of inclusivity emanates from our values and the belief that our people make us what we are. We do not see inclusion as a moment, but a movement towards a future where all people can experience success as their best authentic selves. That is why our efforts are not confined to certain roles, departments, identities, or geographies. Driven by a strategy spanning across culture, community, candidate, career, and commerce, we are making meaningful strides towards a future where diversity is understood, embraced, and is a source of our strength. \nMaintaining a work environment where all people can succeed as their full authentic self is critical to our success as a business. To deliver meaningful programs that meet the needs of our employees, it is important we understand the dynamic composition of our workforce. As of December 31, 2024, 48.9% of our workforce was male and 49.8% of our workforce was female.\n \nOur most recent Equal Employment Opportunity consolidated report is posted on the Investors page of our website at www.ir.chipotle.com under Corporate Governance – Human Capital Information and additional details about the demographics of our employee population is included in our biennial Sustainability Report and interim Update Report on our website www.chipotle.com/sustainability\n.\n6\nTable of Contents\nWe have undertaken a range of activity to promote a culture of inclusion:\n•\nWe continue to drive a consistent and structured candidate interview process with interview guides. This ensures top candidates are identified through equitable hiring practices in both internal and external candidate interviews. We also launched an internal job board across multiple communication channels to provide increased visibility and access to internal opportunities.\n•\nIn 2024, Chipotle hired a Director of C&I to create and execute a strategy for inclusion, advise across Centers of Excellence, and enhance existing programs with C&I training. This specialized role is also responsible for the continued maturation of our Employee Resource Groups through a new strategy that improves the leader and member experience. \n•\nWe have a holistic approach to pay equity to ensure consistent and equitable compensation among our employees. We retain an independent third-party compensation consultant each year to conduct a pay equity analysis of our U.S. and Canadian workforce, including factors of pay (e.g., grade level, tenure in role, most recent promotion) and external market conditions (e.g., geographic location), to ensure equitable treatment among our employees. In 2024, our review included 99% of our U.S. and Canadian employee population, excluding only approximately 50 of our most senior management employees. The analysis identified small, isolated pay gaps for certain segments of the population, and we subsequently made pay adjustments to close those gaps. Since there are not many common roles among our 50 most senior executives, we consider both internal equity by level, as well as individualized market data, to help ensure we maintain pay equity among this group.\nTalent Management\nWe are committed to cultivating a high-performing workforce through a talent development strategy that prioritizes attracting, developing, and retaining exceptional talent at every level of the organization. In 2024, we promoted over 23,000 employees. Importantly, amongst our Field Leadership roles (Field Leaders, Team Directors, Regional Directors of Operations, and Regional Vice Presidents), the internal promotion rate was above 80%.\nOur robust hiring, onboarding, and training programs ensure our newly hired and recently promoted employees are set up for success and are aligned with Chipotle's values and goals. We deployed a variety of critical programming ensuring leadership development where most needed. Some notable highlights include:\n•\nCultivate University is our leadership training program for new Field Leaders and Team Directors navigating multi-unit management for the first time. Leaders are brought together for a four-day immersive leadership experience designed to bolster leadership skills, while validating and grounding attendees in the operational skills necessary to succeed. In 2024, we had 129 leaders complete the program.\n•\nWe introduced additional required restaurant leader training at all levels in 2024, building skills around accountability, coaching, feedback, delegation, and resolving conflict. The courses are designed to align with the leadership skills necessary to excel at each level of restaurant management. \n•\nWe formalized our Field Leader in Training materials and have seen cohorts launch throughout the business, ensuring that Managers interested in promotion are getting the development they need to take on the next role. \n•\nLeadership Evolution and Development, our leadership development program, is designed to prepare a cross-functional cohort of mid-level managers for the future of work and leadership. During the 6-month program, participants focus on the capabilities of leading oneself, others, and the business with topics designed to stretch capabilities and improve decision-making skills.\nIn addition, to ensure leadership continuity, we maintain a robust succession planning process, focusing on critical roles across the company. In 2024, we identified successors for 72% of key positions and continued to develop individualized development plans tailored to prepare successors for readiness. Due to Chipotle's growth, we are excited about two newly created regions and three promotions into Regional Director of Operations and Regional Vice President roles, highlighting additional growth and development for our field teams. \n7\nTable of Contents\nTotal Rewards\nThe financial, physical, and mental well being of our employees remains our top priority. We believe we have compelling compensation packages and incentive programs, and a robust suite of benefit offerings that enable us to engage current team members and attract new team members. In 2024, we conducted an Employee Value Proposition survey which was intended to help us understand what employees appreciate in Chipotle as an employer, what needs improvement and what drives value for our employees. We have gathered valuable insights that will help us continue to improve the employee experience and attract and retain the best talent in the industry. Other areas of Total Rewards that help support our employees include: \n•\nWe have made substantial investments in our compensation packages, including competitive wages and industry leading incentive programs, such as our annual and quarterly bonus programs.\n•\nWe offer a Debt-Free Degree program that provides Chipotle employees' access to nearly 100 degrees at 10 universities, completely tuition free.\n•\nWe support Career Certificates, which further enhances our Tuition Assistance benefits by providing on-demand certificate programs to help Chipotle team members advance their careers in as little as eight weeks.\n•\nWe offer a student loan payment matching programs via our 401(k) retirement program. This, in addition to a credit optimization service, has helped to bolster our employees' financial well-being.\n•\nWe also offer personalized mental health assistance to all Chipotle employees and their family members with support available 24/7 via in-person, phone, or virtual visits with a licensed counselor.\n•\nStarting in 2025, we are expanding our mental health benefits by offering free access to a mental health app to all U.S. employees. \nEmployee Listening\nWe value feedback; both positive sentiments and constructive comments help us improve our organization and culture. Many of our best ideas come from Chipotle employees and we use various communication channels to maintain awareness and responsiveness to questions, concerns, and ideas across our workforce. This includes direct daily engagement through meetings with General Managers, lunch and learns, and other one-on-one interactions. \nEmployees are encouraged to ask questions, voice concerns directly or anonymously report potential violations of Chipotle's Code of Ethics through our Respectful Workplace hotline. Employees also can raise concerns using other mechanisms, including communication with their managers or human resources business partners. We actively encourage our employees to report any issues or concerns without fear of reprisal, intimidation, or harassment. \nWe also respond to employee issues quickly via our Employee Service Center which is available seven days a week to resolve employee questions about things like restaurant health and safety, compliance, benefits, payroll, etc. \nWe are eager to improve our employee engagement efforts and build even stronger feedback mechanisms to ensure our employees feel valued, heard and respected. \nGovernment Regulation and Environmental Matters\nWe are subject to various federal, state and local laws and regulations that govern aspects of our business operations. While costs associated with compliance with laws and regulations have increased as the number and scope of regulations have increased, the total costs incurred have not had, and are not expected to have, a material effect on our capital expenditures, results of operations or competitive position. See “Risk Factors” in",
    "item1a": "Item 1A, “Risk Factors” in this Annual Report. \nCybersecurity Governance\nOur cybersecurity risk management and strategy processes are led by our \nCISO and our CCTO\n.\n These individuals have collectively over 50 years of professional experience in various roles across multiple industries involving managing information security, developing cybersecurity strategy, implementing effective information and cybersecurity programs and managing multiple industry and regulatory compliance environments. Both individuals previously held positions similar to their current roles at other large publicly traded organizations.\nCybersecurity is an important part of our risk management processes and an area of focus for our Board of Directors (the “Board”) and management. Although cybersecurity risk oversight continues to remain a top priority for the Board, the Audit and Risk Committee of our Board has primary oversight responsibility for the Company’s cybersecurity and other technology risks.\n The Committee regularly reviews with and discusses cybersecurity, privacy and data security programs, the status of projects to strengthen internal cybersecurity, results from third-party assessments, and any significant cybersecurity incidents, including recent incidents at other companies and the emerging threat landscape with our CISO and CCTO. The Committee also reviews with management the implementation and effectiveness of the Company’s controls to monitor and mitigate cybersecurity risks. In addition, \nour Board receives an annual report and quarterly written updates regarding our cybersecurity program.\n22\nTable of Contents",
    "item1b": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone.",
    "item1c": "ITEM 1C. CYBERSECURITY\nCybersecurity Risk Management and Strategy\nAs a global company, we are regularly subject to cyberattacks and other cybersecurity incidents. \nIn response, we have implemented cybersecurity processes, technologies, and controls to aid in our efforts to assess, identify, and manage cybersecurity risks.\n Our enterprise risk management framework considers cybersecurity risk alongside other company risks as part of our overall risk assessment process. Our enterprise risk management team collaborates with our Information Security function, led by our Chief Information Security Officer (“CISO”) and our Chief Customer and Technology Officer (“CCTO”), to gather insights for assessing, identifying and managing cybersecurity threat risks, their severity, and potential mitigations. We also are a member of an industry cybersecurity intelligence and risk sharing organization to stay abreast of changes in the cybersecurity environment.\nWe assess Chipotle’s Information Security program using an industry cybersecurity framework from the National Institute of Standards and Technology. This program includes policies, processes and procedures that help assess and identify our cybersecurity risks and inform how security measures and controls are developed, implemented and maintained. The risk assessment along with risk-based analysis and judgment are used to select security controls to address risks. During this process, the following factors, among others, are considered: likelihood and severity of risk, impact on the Company and others if a risk materializes, feasibility and cost of controls and impact of controls on operations. \nWe maintain internal resources to perform penetration testing designed to simulate evolving tactics and techniques of real-world threat actors, engage with industry partners and law enforcement and intelligence communities and conduct tabletop exercises and periodic risk interviews across our business. We also engage an independent third party to periodically perform internal and external penetration testing of Chipotle's information security environment and engage other third parties to periodically conduct assessments of our cybersecurity capabilities. In addition, we continue to expand training and awareness practices to mitigate risk from human error, including mandatory computer-based training and internal communications for employees. Our employees undergo cybersecurity awareness training and regular phishing awareness campaigns that are based upon and designed to emulate real-world contemporary threats. We provide prompt feedback (and, if necessary, additional training or remedial action) based on the results of such exercises.\n21\nTable of Contents\nOur processes also address cybersecurity risks associated with our use of third-party service providers including suppliers, software and cloud-based service providers, as well as third-party security firms used in different capacities to provide or operate some of our cybersecurity controls and technology systems.\n We proactively evaluate the cybersecurity risk of a third party by utilizing a repository of risk assessments, external monitoring sources, threat intelligence and predictive analytics to better inform Chipotle during contracting and vendor selection processes. Additionally, when third party risks are identified, we require those third parties to agree by contract to implement appropriate security controls. Security issues are documented and tracked, and periodic monitoring of third parties is conducted in an effort to mitigate risk.\nIn addition to the processes, technologies, and controls that we have in place to reduce the likelihood of a material cybersecurity incident (or series of related cybersecurity incidents), Chipotle has a written incident response plan outlining how to address cybersecurity events that occur. The plan sets forth the steps for coordination among various corporate functions and governance groups and serves as a framework for the execution of responsibilities across businesses and operational roles. Our incident response plan is designed to help us coordinate actions to prepare for, detect, respond to and recover from cybersecurity incidents, and includes processes to triage, assess severity, escalate, contain, investigate, and remediate the incident, as well as to assess the need for disclosure, comply with applicable legal obligations and mitigate the impact to our brand and reputation and on impacted parties. We also maintain insurance coverage that, subject to its terms and conditions, is intended to help us cover certain costs associated with cybersecurity incidents and information system failures.\nIn addition to our cybersecurity incident response plan, we conduct tabletop exercises to enhance our incident response preparedness. We maintain business continuity and disaster recovery plans to prepare for and respond to the potential for a disruption in the technology we rely on. \nChipotle (or the third parties it relies on) may not be able to fully, continuously, or effectively implement security controls as intended. As described above, we utilize a risk-based approach and judgment to determine whether and how to implement certain security controls and it is possible that we may not implement the necessary controls if we are unable to recognize or underestimate a particular risk. In addition, security controls, no matter how well designed or implemented, may only mitigate and not fully eliminate cybersecurity risks. Cybersecurity events, when detected by security tools or third parties, may not always be identified immediately or addressed in the manner intended by our cybersecurity incident response plan.\nImpact of cybersecurity risks on business strategy, results of operations or financial condition\nBased on the information available as of the date of this Annual Report, we have no reason to believe any risks from cybersecurity threats, including as a result of any previous cybersecurity incidents, have materially affected or are reasonably likely to materially affect us, including our business strategy, results of operations or financial condition.\n For additional information, see “Risks Related to Cybersecurity, Data Privacy and IT Systems,” in"
  }
}