{
  "ticker": "CMS",
  "cik": "0000811156",
  "company_name": "CMS ENERGY CORP",
  "filing_date": "2025-02-11",
  "accession": "0000811156-25-000036",
  "primary_doc": "cms-20241231.htm",
  "item_sections": {
    "item1": "Item 1.    Business\nGeneral\nCMS Energy\nCMS Energy was formed as a corporation in Michigan in 1987 and is an energy company operating primarily in Michigan. It is the parent holding company of several subsidiaries, including Consumers, an electric and gas utility, and NorthStar Clean Energy, primarily a domestic independent power producer and marketer. Consumers’ customer base consists of a mix of primarily residential, commercial, and diversified industrial customers. NorthStar Clean Energy, through its subsidiaries and equity investments, is engaged in domestic independent power production, including the development and operation of renewable generation, and the marketing of independent power production.\nCMS Energy manages its businesses by the nature of services each provides, and operates principally in three business segments: electric utility; gas utility; and NorthStar Clean Energy, its non‑utility operations and investments. Consumers’ consolidated operations account for the substantial majority of CMS Energy’s total assets, income, and operating revenue. CMS Energy’s consolidated operating revenue was $7.5 billion in 2024 and 2023, and $8.6 billion in 2022.\nFor further information about operating revenue, income, and assets and liabilities attributable to all of CMS Energy’s business segments and operations, see Item 8. Financial Statements and Supplementary Data—CMS Energy Consolidated Financial Statements and Notes to the Consolidated Financial Statements.\nConsumers\nConsumers has served Michigan customers since 1886. Consumers was incorporated in Maine in 1910 and became a Michigan corporation in 1968. Consumers owns and operates electric generation and distribution facilities and gas transmission, storage, and distribution facilities. It provides electricity and/or natural gas to 6.8 million of Michigan’s 10 million residents. Consumers’ rates and certain other aspects of its business are subject to the jurisdiction of the MPSC and FERC, as well as to NERC reliability standards, as described in CMS Energy and Consumers Regulation.\nConsumers’ consolidated operating revenue was $7.2 billion in 2024 and 2023, and $8.2 billion in 2022. For further information about operating revenue, income, and assets and liabilities attributable to Consumers’ electric and gas utility operations, see Item 8. Financial Statements and Supplementary Data—Consumers Consolidated Financial Statements and Notes to the Consolidated Financial Statements.\nConsumers owns its principal properties in fee, except that most electric lines, gas mains, and renewable generation projects are located below or adjacent to public roads or on land owned by others and are accessed by Consumers through easements, leases, and other rights. Almost all of Consumers’ properties are subject to the lien of its First Mortgage Bond Indenture. For additional information on Consumers’ properties, see Business Segments—Consumers Electric Utility—Electric Utility Properties and Consumers Gas Utility—Gas Utility Properties.\n17\nTable of Contents\nIn 2024, Consumers served 1.9 million electric customers and 1.8 million gas customers in Michigan’s Lower Peninsula. Presented in the following map are Consumers’ service territories:\nElectric service territory\nGas service territory\nCombination electric and gas service territory\nCMS Energy and Consumers—The Triple Bottom Line\nFor information regarding CMS Energy’s and Consumers’ purpose and impact on the “triple bottom line” of people, planet, and prosperity, see Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations—Executive Overview.\nBusiness Segments\nConsumers Electric Utility\nElectric Utility Operations:\n Consumers’ electric utility operations, which include the generation, purchase, distribution, and sale of electricity, generated operating revenue of $5.1 billion in 2024, $4.7 billion in 2023, and $5.4 billion in 2022. Consumers’ electric utility customer base consists of a mix of primarily residential, commercial, and diversified industrial customers in Michigan’s Lower Peninsula.\n18\nTable of Contents\nPresented in the following illustration is Consumers’ 2024 electric utility operating revenue of $5.1 billion by customer class:\nConsumers’ electric utility operations are not dependent on a single customer, or even a few customers, and the loss of any one or even a few of Consumers’ largest customers is not reasonably likely to have a material adverse effect on Consumers’ financial condition.\nIn 2024, Consumers’ electric deliveries were 37 billion kWh, which included ROA deliveries of four billion kWh, resulting in net bundled sales of 33 billion kWh. In 2023, Consumers’ electric deliveries were 36 billion kWh, which included ROA deliveries of three billion kWh, resulting in net bundled sales of 33 billion kWh.\nConsumers’ electric utility operations are seasonal. The consumption of electric energy typically increases in the summer months, due primarily to the use of air conditioners and other cooling equipment.\n19\nTable of Contents\nPresented in the following illustration are Consumers’ monthly weather-normalized electric deliveries (deliveries adjusted to reflect normal weather conditions) to its customers, including ROA deliveries, during 2024 and 2023: \nConsumers’ 2024 summer peak demand was 8,030 MW, which included ROA demand of 603 MW. For the 2023-2024 winter season, Consumers’ peak demand was 5,594 MW, which included ROA demand of 410 MW. As required by MISO reserve margin requirements, Consumers owns or controls, through long-term PPAs, short-term capacity purchases, and auction capacity purchases, all of the capacity required to supply its projected firm peak load and necessary reserve margin for summer 2025.\nElectric Utility Properties:\n Consumers owns and operates electric generation and distribution facilities. For details about Consumers’ electric generation facilities, see the Electric Utility Generation and Supply Mix section that follows this Electric Utility Properties section. Consumers’ distribution system consists of:\n•\n270 miles of high-voltage distribution overhead lines operating at 138 kV\n•\nfour miles of high-voltage distribution underground lines operating at 138 kV\n•\n4,646 miles of high-voltage distribution overhead lines operating at 46 kV and 69 kV\n•\n18 miles of high-voltage distribution underground lines operating at 46 kV\n•\n81,924 miles of electric distribution overhead lines\n•\n9,775 miles of underground distribution lines\n•\n1,098 substations with an aggregate transformer capacity of 28 million kVA\nConsumers is interconnected to the interstate high-voltage electric transmission system owned by METC and operated by MISO. Consumers is also interconnected to neighboring utilities and to other transmission systems.\nElectric Utility Generation and Supply Mix:\n Consumers’ Clean Energy Plan details its strategy to meet customers’ long-term energy needs. The Clean Energy Plan was most recently revised and approved by the MPSC in 2022. Under Michigan’s integrated resource planning process, Consumers will file updates \n20\nTable of Contents\nto its Clean Energy Plan in 2026. Together with updates to its renewable energy plan that Consumers filed in November 2024, these updated plans will serve as Consumers’ blueprint to meeting the requirements of the 2023 Energy Law that was enacted in Michigan in November 2023. \nUnder its Clean Energy Plan, Consumers will eliminate the use of coal in owned generation in 2025. Specifically, Consumers retired the D.E. Karn coal-fueled generating units in June 2023 and plans to retire the J.H. Campbell coal-fueled generating units in 2025. In order to continue providing controllable sources of electricity to customers while expanding its investment in renewable energy, Consumers purchased the Covert Generating Station, a natural gas-fueled generating facility with 1,200 MW of nameplate capacity, in May 2023. Consumers has also contracted to purchase 400 MW of capacity from battery storage facilities, which will be located in Michigan’s Lower Peninsula and are expected to be operational by 2027.\nIn November 2024, Consumers filed updates to its renewable energy plan, proposing an addition of up to 9,000 MW of both purchased and owned solar energy resources and up to 2,800 MW of new, competitively bid wind capacity. These actions will enable Consumers to achieve 60 percent renewable energy by 2035 and 100 percent clean energy by 2040. For further information on Consumers’ progress towards reducing carbon emissions and towards meeting the requirements of the 2023 Energy Law, see Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations—Executive Overview and Outlook—Consumers Electric Utility Outlook and Uncertainties.\n21\nTable of Contents\nPresented in the following table are details about Consumers’ 2024 electric generation and supply mix:\nName and Location (Michigan)\nNumber of Units and Year Entered Service\n2024\nGeneration Capacity\n(MW)\n1\n2024\nElectric Supply\n(GWh)\nCoal steam generation\nJ.H. Campbell 1 & 2 – West Olive\n2\n2 Units, 1962-1967\n540 \n2,718 \nJ.H. Campbell 3 – West Olive\n2,3\n1 Unit, 1980\n791 \n5,214 \n1,331 \n7,932 \nOil/Gas steam generation\nD.E. Karn 3 & 4 – Essexville\n2 Units, 1975-1977\n1,200 \n96 \nHydroelectric\nLudington – Ludington\n6 Units, 1973\n1,112 \n4\n(458)\n5\nConventional hydro generation\n35 Units, 1906-1949\n75 \n366 \n1,187 \n(92)\nGas combined cycle\nCovert Generating Station – Covert\n3 Units, 2004\n1,089 \n7,159 \nJackson – Jackson\n1 Unit, 2002\n534 \n2,001 \nZeeland – Zeeland\n3 Units, 2002\n520 \n3,963 \n2,143 \n13,123 \nGas combustion turbines\nZeeland (simple cycle) – Zeeland\n2 Units, 2001\n314 \n1,733 \nWind generation\nCrescent Wind Farm – Hillsdale County\n2021\n150 \n369 \nCross Winds\n®\n Energy Park – Tuscola County\n2014-2019\n232 \n721 \nGratiot Farms Wind Project – Gratiot County\n2020\n150 \n364 \nHeartland Farms Wind Project – Gratiot County\n2023\n200 \n432 \nLake Winds\n®\n Energy Park – Mason County\n2012\n101 \n262 \n833 \n2,148 \nSolar generation\nSolar Gardens – Allendale, Cadillac, and Kalamazoo\n2016-2021\n5 \n7 \nBattery storage capacity\nBatteries – Grand Rapids, Cadillac, Kalamazoo, and Standish\n4 Units, 2021-2022\n3 \n— \nTotal owned generation\n7,016 \n24,947 \nPurchased power\n6\nCoal generation – T.E.S. Filer City\n63 \n230 \nGas generation – MCV Facility\n7\n1,240 \n8,440 \nOther gas generation\n153 \n1,222 \nWind generation\n384 \n996 \nSolar generation\n803 \n1,152 \nOther renewable generation\n194 \n990 \n2,837 \n13,030 \nNet interchange power\n8\n— \n(2,715)\nTotal purchased and interchange power\n2,837 \n10,315 \nTotal supply\n9,853 \n35,262 \nLess distribution and transmission loss\n2,065 \nTotal net bundled sales\n33,197 \n1\nWith the exception of wind and solar generation, the amount represents generation capacity during the summer months (planning year 2024 capacity as reported to MISO and limited by interconnection service limits). For wind and solar generation, the amount represents installed capacity during the summer months.\n22\nTable of Contents\n2\nConsumers plans to retire these generating units in 2025. \n3\nRepresents Consumers’ share of the capacity of the J.H. Campbell 3 unit, net of the 6.69‑percent ownership interest of the Michigan Public Power Agency and Wolverine Power Supply Cooperative, Inc, each a non\n‑\naffiliated company.\n4\nRepresents Consumers’ 51‑percent share of the capacity of Ludington. DTE Electric holds the remaining 49‑percent ownership interest.\n5\nRepresents Consumers’ share of net pumped-storage generation. The pumped-storage facility consumes electricity to pump water during off-peak hours for storage in order to generate electricity later during peak‑demand hours.\n6\nRepresents purchases under long-term PPAs.\n7\nFor information about Consumers’ long-term PPA related to the MCV Facility, see Item 8. Financial Statements and Supplementary Data—Notes to the Consolidated Financial Statements—Note 3, Contingencies and Commitments—Contractual Commitments.\n8\nRepresents the net amount of generation offered to and purchased from the MISO energy market. \n23\nTable of Contents\nPresented in the following table are the sources of Consumers’ electric supply for the last three years:\nGWh\nYears Ended December 31\n2024\n2023\n2022\nOwned generation\nGas\n14,856 \n11,221 \n6,684 \nCoal\n7,932 \n6,884 \n10,217 \nRenewable energy\n2,521 \n1,993 \n2,217 \nOil\n96 \n2 \n4 \nNet pumped storage\n1\n(458)\n(349)\n(370)\nTotal owned generation\n24,947 \n19,751 \n18,752 \nPurchased power\n2\nGas generation\n9,662 \n7,244 \n7,182 \nRenewable energy generation\n3,138 \n2,585 \n2,441 \nCoal generation\n230 \n318 \n500 \nNuclear generation\n3\n— \n— \n2,692 \nNet interchange power\n4\n(2,715)\n4,532 \n3,943 \nTotal purchased and interchange power\n10,315 \n14,679 \n16,758 \nTotal supply\n35,262 \n34,430 \n35,510 \n1\nRepresents Consumers’ share of net pumped-storage generation. During 2024, the pumped-storage facility consumed 1,721 GWh of electricity to pump water during off-peak hours for storage in order to generate 1,263 GWh of electricity later during peak-demand hours.\n2\nRepresents purchases under long-term PPAs.\n3\nRepresents purchases from a nuclear generating facility that closed in May 2022.\n4\nRepresents the net amount of generation offered to and purchased from the MISO energy market. \nDuring 2024, 42 percent of the electric energy Consumers provided to customers was generated by its natural gas‑fueled generating units, which burned 107 Bcf of natural gas and produced a combined total of 14,856 GWh of electricity.\nIn order to obtain the gas it needs for electric generation fuel, Consumers’ electric utility purchases gas from the market near the time of consumption, at prices that allow it to compete in the electric wholesale market. For the Covert Generating Station and Jackson and Zeeland plants, Consumers utilizes an agent that owns firm transportation rights to each plant to purchase gas from the market and transport the gas to the facilities. For units 3 & 4 of D.E. Karn, Consumers holds gas transportation contracts to transport to the plant gas that Consumers or an agent purchase from the market.\nDuring 2024, Consumers acquired 29 percent of the electricity it provided to customers through long-term PPAs and the MISO energy market. Consumers offers its generation into the MISO energy market on a day-ahead and real-time basis and bids for power in the market to serve the demand of its customers. Consumers supplements its generation capability with purchases from the MISO energy market.\nAt December 31, 2024, Consumers had future commitments to purchase capacity and energy under long-term PPAs with various generating plants. These contracts require monthly capacity payments based on the plants’ availability or deliverability. The payments for 2025 through 2047 are estimated to total $7.0 billion and, for each of the next five years, $0.7 billion annually. These amounts may vary depending \n24\nTable of Contents\non plant availability and fuel costs. For further information about Consumers’ future capacity and energy purchase obligations, see Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations—Capital Resources and Liquidity—Other Material Cash Requirements and Item 8. Financial Statements and Supplementary Data—Notes to the Consolidated Financial Statements—Note 3, Contingencies and Commitments—Contractual Commitments.\nDuring 2024, 22 percent of the electric energy Consumers provided to customers was generated by its coal-fueled generating units, which burned four million tons of coal and produced a combined total of 7,932 GWh of electricity. In order to obtain the coal it needs, Consumers enters into physical coal supply contracts.\nAt December 31, 2024, Consumers had future commitments to purchase coal during 2025 until the retirement of its last coal generating unit; payment obligations under these contracts totaled $24 million. Most of Consumers’ rail-supplied coal contracts have fixed prices, although some contain market-based pricing. At December 31, 2024, Consumers had 100 percent of its remaining 2025 expected coal requirements under contract, as well as a 20\n‑\nday supply of coal on hand.\nIn conjunction with its coal supply contracts, Consumers leases a fleet of railcars and has transportation contracts with various companies to provide rail services for delivery of purchased coal to Consumers’ generating facilities. Consumers’ coal transportation contracts are future commitments and expire on various dates through 2025; payment obligations under these contracts totaled $65 million at December 31, 2024.\nElectric Utility Competition:\n Consumers’ electric utility business is subject to actual and potential competition from many sources, in both the wholesale and retail markets, as well as in electric generation, electric delivery, and retail services.\nMichigan law allows electric customers in Consumers’ service territory to buy electric generation service from alternative electric suppliers in an aggregate amount capped at ten percent of Consumers’ sales, with certain exceptions. At December 31, 2024, electric deliveries under the ROA program were at the ten‑percent limit. Fewer than 300 of Consumers’ electric customers purchased electric generation service under the ROA program. For additional information, see Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations—Outlook—Consumers Electric Utility Outlook and Uncertainties.\nConsumers also faces competition or potential competition associated with industrial customers relocating all or a portion of their production capacity outside of Consumers’ service territory for economic reasons; municipalities owning or operating competing electric delivery systems; and customer self-generation. Consumers addresses this competition in various ways, including:\n•\naggressively controlling operating, maintenance, power supply, and fuel costs and passing savings on to customers\n•\nproviding renewable energy options and energy waste reduction programs\n•\nproviding competitive rate-design options, particularly for large energy-intensive customers\n•\noffering tariff-based incentives that support economic development\n•\nmonitoring activity in adjacent geographical areas\n25\nTable of Contents\nConsumers Gas Utility\nGas Utility Operations:\n Consumers’ gas utility operations, which include the purchase, transmission, storage, distribution, and sale of natural gas, generated operating revenue of $2.1 billion in 2024, $2.4 billion in 2023, and $2.7 billion in 2022. Consumers’ gas utility customer base consists of a mix of primarily residential, commercial, and diversified industrial customers in Michigan’s Lower Peninsula.\nPresented in the following illustration is Consumers’ 2024 gas utility operating revenue of $2.1 billion by customer class: \nConsumers’ gas utility operations are not dependent on a single customer, or even a few customers, and the loss of any one or even a few of Consumers’ largest customers is not reasonably likely to have a material adverse effect on Consumers’ financial condition.\nIn 2024, deliveries of natural gas through Consumers’ pipeline and distribution network, including off-system transportation deliveries, totaled 362 Bcf, which included GCC deliveries of 27 Bcf. In 2023, deliveries of natural gas through Consumers’ pipeline and distribution network, including off-system transportation deliveries, totaled 375 Bcf, which included GCC deliveries of 31 Bcf. Consumers’ gas utility operations are seasonal. The consumption of natural gas increases in the winter, due primarily to colder temperatures and the resulting use of natural gas as heating fuel. Consumers injects natural gas into storage during the summer months for use during the winter months. During 2024, 47 percent of the natural gas supplied to all customers during the winter months was supplied from storage.\n26\nTable of Contents\nPresented in the following illustration are Consumers’ monthly weather-normalized natural gas deliveries (deliveries adjusted to reflect normal weather conditions) to its customers, including GCC deliveries, during 2024 and 2023:\nGas Utility Properties:\n Consumers’ gas transmission, storage, and distribution system consists of:\n•\n2,342 miles of transmission lines\n•\n15 gas storage fields with a total storage capacity of 309 Bcf and a working gas volume of 154 Bcf\n•\n28,368 miles of distribution mains\n•\neight compressor stations with a total of 153,393 installed and available horsepower\nUnder its Methane Reduction Plan, Consumers has set a goal of net-zero methane emissions from its natural gas delivery system by 2030. Consumers plans to reduce methane emissions from its system by about 80 percent, from 2012 baseline levels, by accelerating the replacement of aging pipe, rehabilitating or retiring outdated infrastructure, and adopting new technologies and practices. The remaining emissions will likely be offset by purchasing and/or producing renewable natural gas. For further information on Consumers’ progress towards its net-zero methane emissions goal, see Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations—Executive Overview.\n27\nTable of Contents\nGas Utility Supply:\n In 2024, Consumers purchased 85 percent of the gas it delivered to its full-service sales customers. The remaining 15 percent was purchased from authorized GCC suppliers and delivered by Consumers to customers in the GCC program. Presented in the following illustration are the supply arrangements for the gas Consumers delivered to GCC and GCR customers during 2024:\nFirm city-gate and firm gas transportation contracts are those that define a fixed amount, price, and delivery time frame. Consumers’ firm gas transportation contracts are with Panhandle Eastern Pipe Line Company and Trunkline Gas Company, LLC, each a non‑affiliated company. Under these contracts, Consumers purchases and transports gas to Michigan for ultimate delivery to its customers. Consumers’ firm gas transportation contracts expire on various dates through 2028 with planned contract volumes providing 36 percent of Consumers’ total forecasted gas supply requirements for 2025. Consumers purchases the balance of its required gas supply under firm city-gate contracts and through authorized suppliers under the GCC program.\nGas Utility Competition:\n Competition exists in various aspects of Consumers’ gas utility business. Competition comes from GCC and transportation programs; system bypass opportunities for new and existing customers; and from alternative fuels and energy sources, such as propane, oil, and electricity.\n28\nTable of Contents\nNorthStar Clean Energy—Non-utility Operations and Investments\nNorthStar Clean Energy, through various subsidiaries and certain equity investments, is engaged in domestic independent power production, including the development and operation of renewable generation, and the marketing of independent power production. NorthStar Clean Energy’s operating revenue was $316 million in 2024, $297 million in 2023, and $445 million in 2022.\nIndependent Power Production:\n Presented in the following table is information about the independent power plants in which CMS Energy had an ownership interest at December 31, 2024:\nLocation\nOwnership Interest\n(%)\nPrimary Fuel Type\nGross Capacity\n(MW)\n1\n2024 Net Generation\n(GWh)\nDearborn, Michigan\n100 \nNatural gas\n770 \n5,655 \nJackson County, Arkansas\n100 \nSolar\n180 \n363 \nGaylord, Michigan\n100 \nNatural gas\n134 \n20 \nPaulding County, Ohio\n2\n100 \nWind\n100 \n270 \nComstock, Michigan\n100 \nNatural gas\n76 \n245 \nDelta Township, Michigan\n2\n100 \nSolar\n24 \n40 \nPhillips, Wisconsin\n3\n100 \nSolar\n3 \n4 \nPaulding County, Ohio\n100 \nSolar and storage\n3 \n— \nCoke County, Texas\n51 \nWind\n525 \n1,786 \nFiler City, Michigan\n50 \nCoal\n73 \n230 \nNew Bern, North Carolina\n50 \nWood waste\n50 \n261 \nFlint, Michigan\n50 \nWood waste\n40 \n96 \nGrayling, Michigan\n50 \nWood waste\n38 \n164 \nTotal\n2,016 \n9,134 \n1\nRepresents the intended full-load sustained output of each plant. The amount of capacity relating to CMS Energy’s ownership interest was 1,658 MW and net generation relating to CMS Energy’s ownership interest was 7,883 GWh at December 31, 2024.\n2\nNorthStar Clean Energy has entered into an agreement to sell a noncontrolling interest in this plant in 2025.\n3\nNorthStar Clean Energy has entered into an agreement to sell this plant in 2025. \nThe operating revenue from independent power production was $69 million in 2024, $64 million in 2023, and $58 million in 2022.\nEnergy Resource Management:\n CMS ERM purchases and sells energy commodities in support of NorthStar Clean Energy’s generating facilities with a focus on optimizing the independent power production portfolio. In 2024, CMS ERM marketed one Bcf of natural gas and 7,475 GWh of electricity. Electricity marketed by CMS ERM was generated by independent power production of NorthStar Clean Energy and by unrelated third parties. CMS ERM’s operating revenue was $247 million in 2024, $233 million in 2023, and $387 million in 2022.\nNorthStar Clean Energy Competition:\n NorthStar Clean Energy competes with other energy developers, energy retailers, and independent power producers. The needs of this market are driven by current electric demand and available generation, as well as projections of future electric demand and available generation.\n29\nTable of Contents\nCMS Energy and Consumers Regulation\nCMS Energy, Consumers, and their subsidiaries are subject to regulation by various federal, state, and local governmental agencies, including those described in the following sections. If CMS Energy, Consumers, or their subsidiaries failed to comply with applicable laws and regulations, they could become subject to fines, penalties, or disallowed costs, or be required to implement additional compliance, cleanup, or remediation programs, the cost of which could be material. For more information on the potential impacts of government regulation affecting CMS Energy, Consumers, and their subsidiaries, see",
    "item1a": "Item 1A. Risk Factors.\n \nManagement’s Role:\n \nThe \nVice President of Information Technology and Security and CIO\n has over 25 years of information technology and security experience and, to enhance governance, reports to the Senior Vice President and General Counsel.\n The \nVice President of Information Technology and Security and CIO\n is responsible for informing the CEO and other members of senior management, as necessary, about cybersecurity incidents, covering prevention, detection, mitigation, and remediation efforts as they are detected by the cybersecurity team. Cybersecurity incidents are managed using the companies’ standard process for critical events. In the event of such cybersecurity incidents, the \nVice President of \n50\nTable of Contents\nInformation Technology and Security and CIO\n communicates and collaborates with the officers of the companies and subject matter experts to address business continuity, contingency, and recovery plans. Senior management will notify the \nBoard\n, including the Audit Committee, of any significant cybersecurity incidents.\n \nBoard Oversight:\n \nAs part of the Board’s risk oversight process, senior management meets with the Board or Audit Committee at least twice annually to provide updates on and discuss cybersecurity. Such updates include a review of the companies’ cybersecurity strategy, a scan of the threat landscape, and recent performance. Additionally, cybersecurity risks are included in the Audit Committee’s risk oversight functions, which focus on operating and financial activities that could impact the companies’ financial and other disclosure reporting. The Audit Committee’s oversight involves reviewing and approving policies on risk assessment, controls, and accounting risk exposure. The Audit Committee also reviews internal audit reports regarding cybersecurity processes, and receives updates that focus on CMS Energy’s and Consumers’ cybersecurity program, mitigation of cybersecurity risks, and assessments by third-party experts. Of note, two members of the Board have extensive industry experience in cybersecurity and are on CMS Energy’s and Consumers’ Audit Committee.",
    "item1b": "Item 1B.    Unresolved Staff Comments\nNone.",
    "item1c": "Item 1C.    Cybersecurity\nEnterprise Risk Management:\n CMS Energy and Consumers manage security risks, including cybersecurity risks, through a robust enterprise risk management program that includes people, processes, technology, and governance structures. The enterprise risk management program identifies risks that may significantly impact the business and informs the companies’ risk-mitigation strategies. The enterprise risk management program is reviewed with the Board at least annually.\nCybersecurity Program:\n \nCMS Energy’s and Consumers’ security function, led by the \nVice President of Information Technology and Security and CIO\n, is accountable for cyber and physical security and is subject to various state, federal, and industry cybersecurity, physical security, and privacy regulations.\n Their cybersecurity program is responsible for assessing, identifying, and managing risks from cybersecurity threats using industry frameworks, as well as best practices developed by government and industry partners.\n All employees and contractors are required to complete annual trainings on a variety of security-related topics. Additionally, the companies continuously upgrade technological investments designed to prevent, detect, and respond to attacks. The companies’ electric, natural gas, and corporate systems each follow standards, controls, and requirements designed to maintain compliance with applicable regulations and standards, such as MPSC, NERC critical infrastructure protection, and payment card industry regulations. \nTechnology projects and third-party service providers are reviewed for adherence to cybersecurity requirements\n. \nCMS Energy’s and Consumers’ cybersecurity program focuses on finding and remediating vulnerabilities in their systems. \nThe companies use third-party firms for penetration testing, audits, and assessments, and conduct technical exercises to practice their response to simulated events as well as tabletop exercises to test that response using their incident command system, including leadership decisions.\n The companies also have a dedicated, proactive function focused fully on monitoring CMS Energy’s and Consumers’ systems and responding when cybersecurity attacks occur. This includes regular information sharing with industry partners, peer utilities, and state and federal partners. The companies’ incident response plan outlines the individuals responsible, the methods employed, and the timeline for notifying state and federal governmental agencies. The companies retain a third-party cybersecurity firm to assist with potentially significant cybersecurity incidents and have invested in cybersecurity insurance to offset costs incurred from any such cybersecurity incidents. To manage cybersecurity risks associated with the companies’ use of third-party service providers, the companies incorporate security requirements into contracts, when deemed applicable, and pursue third-party security certifications for vendors with a higher risk profile. \nCMS Energy and Consumers have experienced no material cybersecurity incidents; however, future cybersecurity incidents could materially affect their business strategy, results of operations, or financial condition. For additional details regarding these and other uncertainties,\n see"
  }
}