{
  "ticker": "CNC",
  "cik": "0001071739",
  "company_name": "CENTENE CORP",
  "filing_date": "2025-02-18",
  "accession": "0001071739-25-000027",
  "primary_doc": "cnc-20241231.htm",
  "item_sections": {
    "item1": "Item 1 \"\nBusiness - Regulation\n\" and",
    "item1a": "Item 1A, \"\nRisk Factors\n.\"\n2024 Highlights\nOur financial performance for 2024 is summarized as follows:\n•\nYear-end membership of 28.6 million, an increase of 1.1 million members, or 4% over 2023.\n•\nTotal revenues of $163.1 billion, representing 6% growth year-over-year.\n•\nPremium and service revenues of $145.5 billion, representing 4% growth year-over-year.\n•\nHBR of 88.3% for 2024, compared to 87.7% for 2023.\n•\nSG&A expense ratio of 8.5% for 2024, compared to 9.0% for 2023. \n•\nAdjusted SG&A expense ratio of 8.5% for 2024, compared to 8.9% for 2023. \n•\nDiluted earnings per share (EPS) of $6.31 for 2024, compared to $4.95 for 2023.\n•\nAdjusted diluted EPS of $7.17 for 2024, compared to $6.68 for 2023, representing 7% growth year-over-year.\n•\nOperating cash flows of $154 million for 2024, compared to $8.1 billion for 2023.\n45\nTable of Contents\nA reconciliation from GAAP diluted EPS to Adjusted Diluted EPS is highlighted below, and additional detail is provided under the heading \"\nNon-GAAP Financial Presentation\n\": \nWe reference adjusted SG&A expense ratio defined as adjusted SG&A expenses, which excludes acquisition and divestiture related expenses and other items, divided by premium and service revenues. We also reference effective tax rate on adjusted earnings, defined as GAAP income tax expense (benefit) excluding the income tax effects of adjustments to net earnings divided by adjusted earnings (loss) before income tax expense.\nYear Ended December 31,\n2024\n2023\nGAAP diluted EPS attributable to Centene\n$\n6.31 \n$\n4.95 \nAmortization of acquired intangible assets \n1.32 \n1.32 \nAcquisition and divestiture related expenses\n0.16 \n0.13 \nOther adjustments \n(1)\n(0.22)\n0.85 \nIncome tax effects of adjustments \n(2)\n(0.40)\n(0.57)\nAdjusted diluted EPS\n$\n7.17 \n$\n6.68 \n(1)\n  Other adjustments include the following pre-tax items:\n2024\n:\n(a) net gain on the previously reported divestiture of Magellan Specialty Health due to the achievement of contingent consideration and finalization of working capital adjustments of $83 million, or $0.16 per share ($0.12 after-tax), net gain on the sale of property of $24 million, or $0.04 per share ($0.03 after-tax), gain on the previously reported divestiture of Circle Health of $20 million, or $0.04 per share ($0.12 after-tax), gain on the sale of CHS of $17 million, or $0.03 per share ($0.02 after-tax), Health Net Federal Services asset impairment due to the 2024 final ruling on the TRICARE Managed Care Support Contract of $14 million, or $0.03 per share ($0.02 after-tax), severance costs due to a restructuring of $13 million, or $0.02 per share ($0.01 after-tax), an additional loss on the divestiture of our Spanish and Central European businesses of $7 million, or $0.01 per share ($0.01 after-tax) and gain on the previously reported divestiture of HealthSmart due to the finalization of working capital adjustments of $7 million, or $0.01 per share ($0.01 after-tax).\n2023\n:\n(b) Circle Health impairment of $292 million, or $0.53 per share ($0.47 after-tax), Operose Health impairment of $140 million, or $0.26 per share ($0.24 after-tax), real estate impairments of $105 million, or $0.19 per share ($0.16 after-tax), gain on the sale of Apixio of $93 million, or $0.17 per share ($0.12 after-tax), severance costs due to a restructuring of $79 million, or $0.15 per share ($0.11 after-tax), gain on the sale of Magellan Specialty Health of $79 million, or $0.14 per share ($0.11 after-tax), a reduction to the previously reported gain on the sale of Magellan Rx of $22 million, or $0.04 per share ($0.02 after-tax), gain on the previously reported divestiture of Centurion of $15 million, or $0.03 per share ($0.02 after-tax) and an additional loss on the divestiture of our Spanish and Central European businesses of $13 million, or $0.02 per share ($0.01 after-tax).\n(2)\n  The income tax effects of adjustments are based on the effective income tax rates applicable to each adjustment. In addition, the year ended December 31, 2024, includes a tax benefit of $1 million, or $0.00 per share, related to tax adjustments on previously reported divestitures. The year ended December 31, 2023 includes a one-time income tax benefit of $69 million, or $0.13 per share, resulting from the distribution of long-term stock awards to the estate of the Company's former CEO and tax expense of $3 million, or $0.01 per share, related to tax adjustments on previously reported divestitures.\n46\nTable of Contents\nCurrent and Future Operating Drivers\nThe following items contributed to our 2024 results of operations as compared to the previous year:\nMedicaid\n•\nIn October 2024, our subsidiary, Meridian Health Plan of Michigan, commenced the contract awarded by the Michigan Department of Health and Human Services (MDHHS) to continue serving as a Medicaid health plan for the Comprehensive Health Care Program. The contract has a five-year term, with three optional one-year extensions, for a total of eight possible contract years.\n•\nIn September 2024, our subsidiary, Superior HealthPlan (Superior), commenced the contract awarded by the Texas Health and Human Services Commission to continue to provide healthcare coverage to the Aged, Blind or Disabled (ABD) population in the state's STAR+PLUS program. The contract has a six-year term with a maximum of three additional two-year extensions.\n•\nIn September 2024, our subsidiary, NH Healthy Families, commenced the contract awarded by the New Hampshire Department of Health and Human Services to continue providing physical health, behavioral health and pharmacy services for New Hampshire's Medicaid managed care program, known as Medicaid Care Management. The contract has a five-year term.\n•\nIn July 2024, our subsidiaries, Carolina Complete Health and WellCare of North Carolina, began coordinating physical and other health services with Local Management Entities/Managed Care Organizations under the state's new Tailored Plan program. The Tailored Plans are integrated health plans designed for individuals with significant behavioral health needs or intellectual/developmental disabilities.\n•\nIn June 2024, our subsidiary, Western Sky Community Care, concluded serving members upon the expiration of its New Mexico Medicaid managed care contract.\n•\nIn April 2024, our subsidiary, Oklahoma Complete Health, commenced the statewide contracts to provide managed care for the SoonerSelect and SoonerSelect Children's Specialty Plan programs. The new contracts have a one-year term with five, one-year renewal options.\n•\nIn January 2024, our subsidiary, Nebraska Total Care, commenced the statewide Medicaid managed care contract to continue serving the state's Medicaid Managed Care Program, known as Heritage Health. The initial contract term is five years and includes the option for two subsequent, one-year renewals, for a potential total of seven years.\n•\nIn January 2024, our California health plan commenced direct Medicaid contracts in 10 counties (Los Angeles, Sacramento, Amador, Calaveras, Inyo, Mono, San Joaquin, Stanislaus, Tulare and Tuolumne). In Los Angeles, a portion of the membership is subcontracted. Prior to January 2024, our California health plan previously served the state's Medicaid Managed Care population with contracts in 13 counties, including San Diego.\n•\nIn December 2023, our subsidiaries, Carolina Complete Health and WellCare of North Carolina, began providing coverage under North Carolina's new Medicaid Expansion program.\n•\nIn September 2023, our subsidiary, Superior, commenced a new six-year contract awarded by the Texas Health and Human Services Commission to continue providing youth in foster care with healthcare coverage through the STAR Health Medicaid program. Superior has been the sole provider of STAR Health coverage since the program launched in 2008.\n•\nIn April 2023, eligibility redeterminations related to the PHE began. States have substantially completed their unwinding processes as of December 2024. We continue to work with our state partners to match rates to acuity post-redeterminations.\n•\nIn April 2023, the state of New York removed pharmacy services for certain of our managed care contracts in connection with the state's transition of pharmacy services to Medicaid fee-for-service.\n•\nIn February 2023, our subsidiary, Buckeye Health Plan, commenced the Medicaid contract awarded by the Ohio Department of Medicaid to continue providing members with quality healthcare, coordinated services and benefits.\n47\nTable of Contents\nMedicare\n•\nGiven our strong bid positioning, Medicare PDP membership increased 50% year-over-year.\n•\nConsistent with our strategic positioning and bid strategy, Medicare Advantage membership declined 13% year-over-year.\n•\nThe decrease in our Star quality ratings in the 2023 rating year, which CMS published in October 2022, adversely impacted our 2024 Medicare revenue. The decrease in Star quality ratings was driven by the expiration of certain disaster relief provisions as well as deterioration in select metrics. As a result of this impact, we recorded a premium deficiency reserve of $250 million in the fourth quarter of 2023. We anticipate that the 2025 Plan year will operate at a loss driven primarily by Star ratings; accordingly, we recorded a premium deficiency reserve of $92 million in the fourth quarter of 2024.\nCommercial\n•\nIn 2024, our Health Insurance Marketplace product, Ambetter Health expanded into Delaware. In total, the Marketplace plan was available across 29 states. Additionally, Marketplace membership increased 12% year-over-year due to the expanded footprint, strong product positioning and open enrollment results, as well as overall market growth.\nOther\n•\nIn December 2024, Health Net Federal Services concluded serving members upon the expiration of its TRICARE Managed Care Support Contract.\n•\nIn October 2024, we completed the sale of CHS, a management services organization.\n•\nIn July 2024, our subsidiary, Magellan Health, commenced the Idaho Behavioral Health Plan contract.\n•\nIn December 2023 and January 2024, we completed the divestitures of Operose Health and Circle Health, respectively.\n•\nIn June 2023, we completed the divestiture of Apixio. We maintain a close relationship with, and a minority interest in, the business.\n•\nIn January 2023, we completed the divestitures of Magellan Specialty Health, Centurion and HealthSmart.\nThe benefits of successful execution of our value creation initiatives have impacted our current results of operations and will continue to impact future results of operations, including the implementation of our new third-party pharmacy benefits management (PBM) contract, which commenced in January 2024.\nWe expect the following items to impact our future results of operations, subject to the resolution of various third-party protests within the Medicaid segment:\nMedicaid\n•\nIn February 2025, our subsidiary, Sunshine Health, commenced the Statewide Medicaid Managed Care program, including integrated Managed Medical Assistance, Long-Term Care services, Serious Mental Illness, Child Welfare and HIV specialty products. The contract has a six-year term.\n•\nIn January 2025, our subsidiary, Sunflower Health Plan, commenced the contract to continue providing managed health care services through KanCare, the State of Kansas' Medicaid and Children's Health Insurance Program. The contract has a three-year term, with two optional one-year extensions, for a total of five possible contract years.\n•\nIn November 2024, our subsidiary, Buckeye Health Plan, was selected by the Ohio Department of Medicaid to continue providing Medicare and Medicaid services for dually eligible individuals through a Fully Integrated Dual Eligible Special Needs Plan (FIDE SNP). The three-year contract is expected to commence in January 2026.\n48\nTable of Contents\n•\nIn September 2024, our subsidiary, Health Net Community Solutions, was selected by the California Department of Health Care Services to provide managed dental health care services to beneficiaries of Medi-Cal, the State's Medicaid program, in Los Angeles and Sacramento counties. The new 54-month contract is expected to commence in July 2025.\n•\nIn September 2024, our subsidiary, Iowa Total Care, was selected by the Iowa Department of Health and Human Services to continue providing Medicaid managed care services under the Iowa Health Link program. The contract is expected to begin in July 2025 and has a four-year term, with an optional two-year extension, for a total of six possible contract years.\n•\nIn August 2024, our subsidiary, PA Health and Wellness, was selected by the Pennsylvania Department of Human Services to continue to administer Pennsylvania's Community HealthChoices program, the Medicaid managed care program that covers adults who are dually eligible for Medicare and Medicaid or who qualify to receive Medicaid long-term services and supports due to a need for the level of care provided in a nursing facility. The contract is expected to begin in January 2026 and has a five-year term, with three optional one-year extensions, for a total of eight possible contract years.\n•\nIn December 2023, our subsidiary, Arizona Complete Health, was selected by the Arizona Health Care Cost Containment System – Arizona's single state Medicaid agency – to provide managed care for the Arizona Long Term Care System (ALTCS). The program supports Arizonans who are elderly and/or have a physical disability (E/PD) with physical and behavioral healthcare, as well as provides pharmacy benefits and home and community-based services. The new ALTCS-E/PD contract is expected to begin in October 2025 and has a three-year term, with four optional one-year extensions, for a total of seven possible contract years.\n•\nIn August 2022, our subsidiary, Magnolia Health Plan (Magnolia), was awarded the Mississippi Division of Medicaid contract. Under the new contract, Magnolia will continue serving the state's Coordinated Care Organization Program, which will consist of the Mississippi Coordinated Access Network and the Mississippi CHIP. The contract is expected to begin in July 2025 and has a four-year term, with two optional one-year extensions, for a total of six possible contract years.\nMedicare\n•\nIn 2025, Wellcare is offering Medicare Advantage plans in 32 states, including its newest state, Iowa. Wellcare discontinued offering Medicare Advantage products in Alabama, Massachusetts, New Hampshire, New Mexico, Rhode Island and Vermont in 2025.\n•\nIn October 2024, CMS issued 2025 Medicare Advantage Star Ratings on the Medicare Plan Finder. Based on the data as well as our successful appeal of the initial scoring of our TTY (Text-to-Voice teletypewriter services for the hearing impaired), we had approximately 55% of our Medicare Advantage membership enrolled in plans rated 3.5 stars or higher – compared to approximately 23% in the prior year. This represents meaningful progress despite higher than industry-anticipated cut point changes.\n•\nIn October 2024, our subsidiary, Meridian Health Plan of Michigan, was selected by the MDHHS to provide highly integrated Medicare and Medicaid services for dually eligible Michiganders through a Highly Integrated Dual Eligible Special Needs Plan. The plan is expected to launch on January 1, 2026 and has a seven-year term, with three optional one-year extensions, for a total of 10 possible contract years.\nCommercial\n•\nIn 2025, our Health Insurance Marketplace product, Ambetter Health, expanded its geographic footprint, adding 60 new counties across 10 states, which includes expansion into Iowa.\n49\nTable of Contents\nMEMBERSHIP\nFrom December 31, 2023 to December 31, 2024, our managed care membership increased by 1.1 million, or 4%. The following table sets forth our membership by line of business:\n \nDecember 31,\n \n2024\n2023\nTraditional Medicaid \n(1)\n11,408,100 \n12,754,000 \nHigh Acuity Medicaid \n(2)\n1,595,400 \n1,718,000 \nTotal Medicaid\n13,003,500 \n14,472,000 \nCommercial Marketplace\n4,382,100 \n3,900,100 \nCommercial Group\n431,400 \n427,500 \nTotal Commercial\n4,813,500 \n4,327,600 \nMedicare \n(3)\n1,110,900 \n1,284,200 \nMedicare PDP\n6,925,700 \n4,617,800 \nTotal at-risk membership\n25,853,600 \n24,701,600 \nTRICARE eligibles\n2,747,000 \n2,773,200 \nTotal\n28,600,600 \n27,474,800 \n(1)\nMembership includes Temporary Assistance for Needy Families (TANF), Medicaid Expansion, Children's Health Insurance Program (CHIP), Foster Care and Behavioral Health.\n(2)\nMembership includes Aged, Blind or Disabled (ABD), Intellectual and Developmental Disabilities (IDD), Long-Term Services and Supports (LTSS) and Medicare-Medicaid Plans (MMP) Duals.\n(3)\nMembership includes Medicare Advantage and Medicare Supplement.\n50\nTable of Contents\nRESULTS OF OPERATIONS\nThe following discussion and analysis is based on our Consolidated Statements of Operations, which reflect our results of operations for years ended December 31, 2024 and 2023, respectively, prepared in accordance with generally accepted accounting principles in the United States (GAAP) ($ in millions, except per share data in dollars):\n \n2024\n2023\n% Change 2023-2024\nPremium\n$\n142,303 \n$\n135,636 \n5 \n%\nService\n3,202 \n4,459 \n(28)\n%\nPremium and service revenues\n145,505 \n140,095 \n4 \n%\nPremium tax\n17,566 \n13,904 \n26 \n%\nTotal revenues\n163,071 \n153,999 \n6 \n%\nMedical costs\n125,707 \n118,894 \n6 \n%\nCost of services\n2,729 \n3,564 \n(23)\n%\nSelling, general and administrative expenses\n12,400 \n12,563 \n(1)\n%\nDepreciation expense\n549 \n575 \n(5)\n%\nAmortization of acquired intangible assets\n692 \n718 \n(4)\n%\nPremium tax expense\n17,806 \n14,226 \n25 \n%\nImpairment\n13 \n529 \n(98)\n%\nEarnings from operations\n3,175 \n2,930 \n8 \n%\nInvestment and other income\n1,784 \n1,393 \n28 \n%\nInterest expense\n(702)\n(725)\n(3)\n%\nEarnings before income tax expense\n4,257 \n3,598 \n18 \n%\nIncome tax expense\n963 \n899 \n7 \n%\nNet earnings\n3,294 \n2,699 \n22 \n%\nLoss attributable to noncontrolling interests\n11 \n3 \nn.m.\nNet earnings attributable to Centene Corporation\n$\n3,305 \n$\n2,702 \n22 \n%\nDiluted earnings per common share attributable to Centene Corporation\n$\n6.31 \n$\n4.95 \n27 \n%\nn.m.: not meaningful\n51\nTable of Contents\nYear Ended December 31, 2024 Compared to Year Ended December 31, 2023\nTotal Revenues\nTotal revenues increased 6% in the year ended December 31, 2024, over the corresponding period in 2023 primarily driven by membership growth in the Marketplace business due to strong product positioning as well as overall market growth and outperformance in Marketplace risk adjustment for the 2023 benefit year, along with Medicaid rate increases and increased premium tax revenue. The increases were partially offset by lower Medicaid membership primarily due to redeterminations and divestitures in the Other segment.\nOperating Expenses\nMedical Costs/HBR\nThe HBR for the year ended December 31, 2024 was 88.3%, compared to 87.7% in 2023. The increase was primarily driven by higher acuity in Medicaid resulting from the redetermination process as we continue to work with states to match rates with acuity. The increase was also driven by Medicare Star rating impacts. The increases were partially offset by Marketplace membership growth and improved margin through strong 2024 product design and execution, outperformance in Marketplace risk adjustment for the 2023 benefit year as well as the Marketplace cost sharing reduction (CSR) settlement related to prior years. The 2024 HBR was also favorably impacted by the decrease in the Medicare Advantage premium deficiency reserve-related expenses compared to 2023.\nCost of Services \nCost of services decreased by $835 million in the year ended December 31, 2024, compared to the corresponding period in 2023. The cost of service ratio for the year ended December 31, 2024 was 85.2%, compared to 79.9% in 2023. The decrease in expense and increase in the ratio were primarily driven by the divestiture of Circle Health, which operated at a lower cost of service ratio.\nSelling, General & Administrative Expenses\nThe SG&A expense ratio was 8.5% for the year ended December 31, 2024, compared to 9.0% for the year ended December 31, 2023. The adjusted SG&A expense ratio was 8.5% for the year ended December 31, 2024, compared to 8.9% for the year ended December 31, 2023. The decrease in the adjusted SG&A expense ratio was primarily driven by the divestiture of Circle Health, which operated at a higher SG&A expense ratio, lower Medicare SG&A, and continued leveraging of expenses over higher revenues. The decrease was partially offset by growth in the Marketplace business, which operates at a meaningfully higher SG&A expense ratio as compared to Medicaid.\nImpairment\nDuring the year ended December 31, 2024, we recorded total impairment charges of $13 million driven by Health Net Federal Services property, software and equipment related to the TRICARE Managed Care Support Contract that was no longer recoverable following the 2024 final ruling.\nDuring the year ended December 31, 2023, we recorded total impairment charges of $529 million, including a $292 million charge related to assets associated with the divestiture of Circle Health, a $140 million charge related to the Operose Health divestiture and additional impairments of $97 million related to our real estate optimization initiative.\n52\nTable of Contents\nOther Income (Expense)\nThe following table summarizes the components of other income (expense) for the year ended December 31, ($ in millions): \n \n2024\n2023\nInvestment and other income\n$\n1,784 \n$\n1,393 \nInterest expense\n(702)\n(725)\nOther income (expense), net\n$\n1,082 \n$\n668 \nInvestment and other income. \nInvestment and other income increased by $391 million for the year ended December 31, 2024 compared to 2023, driven by higher interest rates on larger investment balances. The year ended December 31, 2024 also included net gains on divestitures described above, partially offset by a private equity investment reduction. The year ended December 31, 2023 included net gains on divestitures described above, partially offset by a realized loss on the sale of investments from rebalancing a portion of our portfolio with a focus on higher interest rate investments.\nInterest expense. \nInterest expense for the year ended December 31, 2024 was $702 million compared to $725 million for the corresponding period in 2023.\nIncome Tax Expense\nFor the year ended December 31, 2024, we recorded an income tax expense of $963 million on pre-tax earnings of $4.3 billion, or an effective tax rate of 22.6%. The effective tax rate for the year ended December 31, 2024 reflects tax effects of the Circle Health divestiture, which closed during the first quarter, settlements with tax authorities and valuation allowance releases. For the year ended December 31, 2024, our effective tax rate on adjusted earnings was 23.8%.\nFor the year ended December 31, 2023, we recorded income tax expense of $899 million on pre-tax earnings of $3.6 billion, or an effective tax rate of 25.0%. The effective tax rate for the year ended December 31, 2023 reflects the tax effects of the distribution of long-term stock awards to the estate of the Company's former CEO, divestiture gains and losses, lower state taxes as well as the then pending divestiture of Circle Health. For the year ended December 31, 2023, our effective tax rate on adjusted earnings was 24.9%.\n53\nTable of Contents\nSegment Results\nThe following table summarizes our consolidated operating results by segment for the year ended December 31, ($ in millions):\n \n2024\n2023\n% Change 2023-2024\nTotal Revenues\n \n \n \nMedicaid\n$\n101,417 \n$\n100,759 \n1 \n%\nMedicare\n23,032 \n22,261 \n3 \n%\nCommercial\n33,702 \n24,845 \n36 \n%\nOther\n4,920 \n6,134 \n(20)\n%\nConsolidated Total\n$\n163,071 \n$\n153,999 \n6 \n%\nGross Margin \n(1)\nMedicaid\n$\n6,246 \n$\n8,641 \n(28)\n%\nMedicare\n2,595 \n2,867 \n(9)\n%\nCommercial\n7,663 \n5,029 \n52 \n%\nOther\n565 \n1,100 \n(49)\n%\nConsolidated Total\n$\n17,069 \n$\n17,637 \n(3)\n%\n(1)\nGross margin represents premium and service revenues less medical costs and cost of services.\nMedicaid\nTotal revenues increased 1% in the year ended December 31, 2024, compared to the corresponding period in 2023. Gross margin decreased $2.4 billion in the year ended December 31, 2024, compared to the corresponding period in 2023. The increase in total revenues was primarily driven by increased premium tax revenue and rate increases, partially offset by lower membership primarily due to redeterminations. Gross margin decreased primarily due to lower overall membership as a result of the redetermination process, coupled with higher acuity post-redeterminations as we continue to work with our state partners to match rates to the changes in acuity.\nMedicare\nTotal revenues increased 3% in the year ended December 31, 2024, compared to the corresponding period in 2023, primarily driven by increased PDP membership of 50%, partially offset by lower Medicare Advantage membership. Gross margin decreased $272 million in the year ended December 31, 2024, compared to the corresponding period in 2023 driven primarily by lower Medicare Advantage revenue resulting from the Star quality ratings impact and lower membership discussed above. Gross margin in 2024 was favorably impacted by the decrease in the Medicare Advantage premium deficiency reserve-related expenses compared to 2023 and growth and performance in the PDP business.\nCommercial\nTotal revenues increased 36% in the year ended December 31, 2024, compared to the corresponding period in 2023. Gross margin increased $2.6 billion in the year ended December 31, 2024, compared to the corresponding period in 2023. The increases were primarily driven by 12% membership growth in the Marketplace business along with improved margin through strong 2024 product design and execution as well as outperformance in Marketplace risk adjustment for the 2023 benefit year and the Marketplace CSR settlement related to prior years.\nOther\nTotal revenues decreased 20% in the year ended December 31, 2024, compared to the corresponding period in 2023. Gross margin decreased $535 million in the year ended December 31, 2024, compared to the corresponding period in 2023. The decreases were primarily due to divestitures.\n54\nTable of Contents\n \nLIQUIDITY AND CAPITAL RESOURCES\nThe following table is a condensed schedule of cash flows used in the discussion of liquidity and capital resources ($ in millions):\n \nYear Ended December 31,\n \n2024\n2023\nNet cash provided by operating activities\n$\n154 \n$\n8,053 \nNet cash used in investing activities\n(1,052)\n(1,191)\nNet cash used in financing activities\n(2,406)\n(1,658)\nEffect of exchange rate changes on cash, cash equivalents and restricted cash\n8 \n(32)\nNet increase (decrease) in cash, cash equivalents, and restricted cash and cash equivalents\n$\n(3,296)\n$\n5,172 \nCash Flows Provided by Operating Activities\nNormal operations are funded primarily through operating cash flows and borrowings under our Revolving Credit Facility. In 2024, operating activities provided cash of $154 million compared to providing cash of $8.1 billion in 2023. Cash flows provided by operations in 2024 was primarily driven by net earnings, almost entirely offset by an increase in pharmacy receivables driven by pharmacy rebate remittance timing associated with our transition to a new third-party PBM in January 2024, a decrease in net risk adjustment payables and higher state premium receivables for recent rate increases.\nCash flows provided by operations in 2023 were primarily driven by net earnings, an increase in risk adjustment payable for Marketplace and the timing of pass-through payments.\nCash Flows Used in Investing Activities\nInvesting activities used cash of $1.1 billion for the year ended December 31, 2024 and $1.2 billion in 2023. Cash flows used in investing activities in 2024 and 2023 primarily consisted of net additions to the investment portfolio of our regulated subsidiaries (including transfers from cash and cash equivalents to long-term investments) and capital expenditures, partially offset by divestiture proceeds.\nWe spent $644 million and $799 million in the years ended December 31, 2024 and 2023, respectively, on capital expenditures primarily for system enhancements and computer hardware.\nAs of December 31, 2024, our investment portfolio consisted primarily of fixed-income securities with a weighted average duration of 3.4 years. We had unregulated cash and investments of $1.1 billion at December 31, 2024. At December 31, 2023, we had unregulated cash and investments of $1.0 billion, the majority of which was utilized in January 2024 to complete planned pass-through payments. Unregulated cash and investments include private equity investments and company owned life insurance contracts.\nCash Flows Used in Financing Activities\nFinancing activities used cash of $2.4 billion in the year ended December 31, 2024, compared to using cash of $1.7 billion in the comparable period in 2023. Financing activities in 2024 were driven by stock repurchases of $3.1 billion, which included $3.0 billion under the stock repurchase program and $114 million of repurchases related to income tax withholding upon the vesting of previously awarded stock grants, partially offset by net proceeds from long-term debt.\nIn 2023, financing activities were driven by stock repurchases of $1.6 billion.\n55\nTable of Contents\nLiquidity Metrics\nWe have a stock repurchase program authorizing us to repurchase common stock from time to time on the open market or through privately negotiated transactions. In 2023, the Company's Board of Directors authorized up to a cumulative total of $10.0 billion of repurchases under the program. \nIn 2024, we repurchased a total of 42.0 million shares of common stock for $3.0 billion under the stock repurchase program, primarily funded through divestiture proceeds and free cash flow generated from operations. We have $2.2 billion remaining under the program as of December 31, 2024. No duration has been placed on the repurchase program. We reserve the right to discontinue the repurchase program at any time. Refer to Note 12. \nStockholders' Equity\n for further information on stock repurchases.\nAs of December 31, 2024, we had an aggregate principal amount of $15.7 billion of senior notes issued and outstanding. The indentures governing our various maturities of senior notes contain limited restrictive covenants. As of December 31, 2024, we were in compliance with all covenants.\nAs part of our capital allocation strategy, we may decide to repurchase debt or raise capital through the issuance of debt in the form of senior notes. In 2022, the Company's Board of Directors authorized a $1.0 billion senior note debt repurchase program. No repurchases were made during the year ended December 31, 2024. As of December 31, 2024, there was $700 million available under the senior note debt repurchase program. Refer to Note 10.\n Debt\n for further information regarding the issuance and redemption of senior notes.\nThe credit agreement underlying our Revolving Credit Facility and Term Loan Facility contains customary covenants, as well as financial covenants, including, a minimum fixed charge coverage ratio and a maximum debt-to-EBITDA ratio. Our maximum debt-to-EBITDA ratio under the credit agreement may not exceed 4.0 to 1.0. As of December 31, 2024, we had $950 million of borrowings outstanding under our Revolving Credit Facility, $2.0 billion of borrowings outstanding under our Term Loan Facility and we were in compliance with all covenants. As of December 31, 2024, there were no limitations on the availability of our Revolving Credit Facility as a result of the debt-to-EBITDA ratio.\nWe had outstanding letters of credit of $145 million as of December 31, 2024, which were not part of our Revolving Credit Facility. The letters of credit bore weighted interest of 0.7% as of December 31, 2024. In addition, we had outstanding surety bonds of $844 million as of December 31, 2024.\nAt December 31, 2024, our debt-to-capital ratio, defined as total debt divided by the sum of total debt and total equity, was 41.2%, compared to 40.7% at December 31, 2023. The debt-to-capital ratio increase was driven by stock repurchases and increased borrowings under the Revolving Credit Facility in 2024 to fund pharmacy benefit-related activities, partially offset by net earnings. We utilize the debt-to-capital ratio as a measure, among others, of our leverage and financial flexibility.\nAt December 31, 2024, we had working capital, defined as current assets less current liabilities, of $3.7 billion, compared to $4.0 billion at December 31, 2023. We manage our short-term and long-term investments with the goal of ensuring that a sufficient portion is held in investments that are highly liquid.\nDuring the years ended December 31, 2024 and 2023, we received dividends of $3.2 billion and $2.3 billion, respectively, from our regulated subsidiaries.\n56\nTable of Contents\n2025 Expectations\nDuring 2025, we expect to receive net dividends of approximately $1.9 billion from our regulated subsidiaries and expect to spend approximately $700 million in capital expenditures primarily associated with system enhancements.\nWe have material short-term medical claims, debt and lease obligations. Refer to\n \nNote 8. \nMedical Claims Liability, \nNote 10. \nDebt \nand Note 11. \nLeases,\n respectively\n, \nfor further information.\nBased on our operating plan, we expect that our available cash, cash equivalents and short-term investments, cash from our operations and cash available under our Revolving Credit Facility will be sufficient to finance our general operations and capital expenditures for at least 12 months from the date of this filing. While we are currently in a strong liquidity position and believe we have adequate access to capital, we may elect to increase borrowings on our Revolving Credit Facility, which matures in August 2026. Additionally, our senior notes mature between December 2027 and August 2031. From time to time, we may elect to raise additional funds for working capital and other purposes, either through issuance of debt or equity, the sale of investment securities or otherwise, as appropriate. In addition, we may strategically pursue refinancing or redemption opportunities to extend maturities and/or improve terms of our indebtedness if we believe such opportunities are favorable to us.\nWe intend to continue to target initiatives to improve productivity, efficiencies and reduced organizational costs, as well as capital deployment activities, including stock repurchases, portfolio optimization and the evaluation of refinancing opportunities. In addition to creating shareholder value, these actions encompass a larger organizational mission to enhance our member and provider experience, improve outcomes for our members and innovate to ensure that Centene is a great partner in all aspects of our operations.\n57\nTable of Contents\nREGULATORY CAPITAL AND DIVIDEND RESTRICTIONS\n \nOur operations are conducted through our subsidiaries. As managed care organizations (MCOs), most of our subsidiaries are subject to state regulations and other requirements that, among other things, require the maintenance of minimum levels of statutory capital, as defined by each state, and restrict the timing, payment and amount of dividends and other distributions that may be paid to us. Generally, the amount of dividend distributions that may be paid by a regulated subsidiary without prior approval by state regulatory authorities is limited based on the entity's level of statutory net income and statutory capital and surplus.\nAs of December 31, 2024, our subsidiaries had aggregate statutory capital and surplus of $20.3 billion, compared with the required minimum aggregate statutory capital and surplus requirements of $9.1 billion. During the year ended December 31, 2024, we received dividends of $3.2 billion from and made $752 million of capital contributions to our regulated subsidiaries. For our subsidiaries that file with the National Association of Insurance Commissioners (NAIC), we estimate our Risk Based Capital (RBC) percentage to be in excess of 350% of the Authorized Control Level.\nUnder the California Knox-Keene Health Care Service Plan Act of 1975, as amended (Knox-Keene), certain of our California subsidiaries must comply with tangible net equity (TNE) requirements. Under these Knox-Keene TNE requirements, actual net worth less unsecured receivables and intangible assets must be more than the greater of (i) a fixed minimum amount, (ii) a minimum amount based on premiums or (iii) a minimum amount based on healthcare expenditures, excluding capitated amounts.\nUnder the New York State Department of Health Codes, Rules and Regulations Title 10, Part 98, our New York subsidiary must comply with contingent reserve requirements. Under these requirements, net worth based upon admitted assets must equal or exceed a minimum amount based on annual net premium income.\nThe NAIC has adopted rules which set minimum risk-based capital requirements for insurance companies, MCOs and other entities bearing risk for healthcare coverage. As of December 31, 2024, each of our health plans was in compliance with the risk-based capital requirements enacted in those states.\nAs a result of the above requirements and other regulatory requirements, certain of our subsidiaries are subject to restrictions on their ability to make dividend payments, loans or other transfers of cash to their parent companies. Such restrictions, unless amended or waived or unless regulatory approval is granted, limit the use of any cash generated by these subsidiaries to pay our obligations. The maximum amount of dividends that can be paid by our insurance company subsidiaries without prior approval of the applicable state insurance departments is subject to restrictions relating to statutory surplus, statutory income and unassigned surplus. As of December 31, 2024, the amount of capital and surplus or net worth that was unavailable for the payment of dividends or return of capital to us was $9.1 billion in the aggregate. \n58\nTable of Contents\nRECENT ACCOUNTING PRONOUNCEMENTS\nFor this information, refer to Note 2. \nSummary of Significant Accounting Policies\n, in the Notes to the Consolidated Financial Statements, included herein. \nCRITICAL ACCOUNTING ESTIMATES\nOur discussion and analysis of our results of operations and liquidity and capital resources are based on our consolidated financial statements which have been prepared in accordance with GAAP. Our significant accounting policies are more fully described in Note 2. \nSummary of Significant Accounting Policies,\n to our consolidated financial statements included elsewhere herein. Our accounting policies regarding intangible assets, medical claims liability and revenue recognition are particularly important to the portrayal of our financial condition and results of operations and require the application of significant judgment by our management. As a result, they are subject to an inherent degree of uncertainty. We have reviewed these critical accounting policies and related disclosures with the Audit and Compliance Committee of our Board of Directors.\nGoodwill and Intangible Assets \n \nWe have made several acquisitions that have resulted in our recording of intangible assets. These intangible assets primarily consist of purchased contract rights and customer relationships, provider contracts, trade names, developed technologies and goodwill. Key assumptions used in the valuation of these intangible assets include, but are not limited to, member attrition rates, contract renewal probabilities, revenue growth rates, expectations of profitability and discount and royalty rates. We allocate the fair value of purchase consideration to the assets acquired and liabilities assumed based on their fair values at the acquisition date. The excess of the fair value of consideration transferred over the fair value of the net assets acquired is recorded as goodwill. Goodwill is generally attributable to the value of the synergies between the combined companies and the value of the acquired assembled workforce, neither of which qualifies for recognition as an intangible asset. At December 31, 2024, we had $17.6 billion of goodwill and $5.4 billion of other intangible assets.\nIntangible assets are amortized using the straight-line method over the following periods:\nIntangible Asset\nAmortization Period\nPurchased contract rights and customer relationships\n3 - 21 years\nProvider contracts\n4 - 15 years\nTrade names\n7 - 20 years\nDeveloped technologies\n2 - 7 years\nOur management evaluates whether events or circumstances have occurred that may affect the estimated useful life or the recoverability of the remaining balance of goodwill and other identifiable intangible assets. If the events or circumstances indicate that the remaining balance of the intangible asset or goodwill may be impaired, the potential impairment will be measured based upon the difference between the carrying amount of the intangible asset or goodwill and the fair value of such asset. Our management must make assumptions and estimates, such as the discount factor, future utility and other internal and external factors, in determining the estimated fair values. While we believe these assumptions and estimates are appropriate, other assumptions and estimates could be applied and might produce significantly different results. \nGoodwill is reviewed annually during the fourth quarter for impairment. In addition, an impairment analysis of intangible assets would be performed based on other factors. These factors include significant changes in membership, financial performance, state funding, government contracts and provider networks and contracts.\nWe operate in four segments: (1) a Medicaid segment, (2) a Medicare segment, (3) a Commercial segment and (4) an Other segment. We define our reporting units as our operating segments or one level below the operating segment. If a reporting unit's carrying amount exceeds its fair value, an entity will record an impairment charge based on that difference. The impairment charge will be limited to the amount of goodwill allocated to that reporting unit. We first assess qualitative factors to determine if a quantitative impairment test is necessary. We generally do not calculate the fair value of a reporting unit unless we determine, based on a qualitative assessment, that it is more likely than not that its fair value is less than its carrying amount. However, in certain circumstances, such as recent acquisitions, we may elect to perform a quantitative assessment without first assessing qualitative factors.\nWe do not believe any of our reporting units are currently at risk for impairment.\n59\nTable of Contents\nMedical Claims Liability \nOur medical claims liability includes claims reported but not yet paid, or claims inventory, estimates for claims incurred but not reported (IBNR) and estimates for the costs necessary to process unpaid claims at the end of each period. We estimate our medical claims liability using actuarial methods that are commonly used by health insurance actuaries and meet Actuarial Standards of Practice. These actuarial methods consider factors such as historical data for payment patterns, cost trends, product mix, seasonality, utilization of healthcare services and other relevant factors.\n    \nActuarial Standards of Practice generally require that the medical claims liability estimates be adequate to cover obligations under moderately adverse conditions. Moderately adverse conditions are situations in which the actual claims are expected to be higher than the otherwise estimated value of such claims at the time of estimate. The claims amounts ultimately settled will most likely be different than the estimate that satisfies the Actuarial Standards of Practice. We include in our IBNR an estimate for medical claims liability under moderately adverse conditions which represents the risk of adverse deviation of the estimates in our actuarial method of reserving.\nWe use our judgment to determine the assumptions to be used in the calculation of the required estimates. The assumptions we consider when estimating IBNR include, without limitation, claims receipt and payment experience (and variations in that experience), changes in membership, provider billing practices, healthcare service utilization trends, cost trends, product mix, seasonality, prior authorization of medical services, benefit changes, known outbreaks of disease or increased incidence of illness such as influenza, provider contract changes, changes to fee schedules and the incidence of high-dollar or catastrophic claims.\nWe apply various estimation methods depending on the claim type and the period for which claims are being estimated. For more recent periods, incurred non-inpatient claims are estimated based on historical per member per month claims experience adjusted for known factors. Incurred hospital inpatient claims are estimated based on known inpatient utilization data and prior claims experience adjusted for known factors. For older periods, we utilize an estimated completion factor based on our historical experience to develop IBNR estimates. The completion factor is an actuarial estimate of the percentage of claims that have been received or adjudicated as of the end of a reporting period relative to the estimate of the total ultimate incurred costs for that same period. When we commence operations in a new state or region, we have limited information with which to estimate our medical claims liability. See \"Risk Factors - \nFailure to accurately estimate and price our medical expenses or effectively manage our medical costs or related administrative costs could have a material adverse effect on our results of operations, financial condition and cash flows.\n\" These approaches are consistently applied to each period presented.\nOur development of the medical claims liability estimate is a continuous process which we monitor and refine on a monthly basis as additional claims receipts and payment information becomes available. As more complete claims information becomes available, we adjust the amount of the estimates and include the changes in estimates in medical costs in the period in which the changes are identified. In every reporting period, our operating results include the effects of more completely developed medical claims liability estimates associated with previously reported periods. We consistently apply our reserving methodology from period to period. As additional information becomes known to us, we adjust our actuarial models accordingly to establish medical claims liability estimates.\nWe review actual and anticipated experience compared to the assumptions used to establish medical costs. We establish premium deficiency reserves if actual and anticipated experience indicates that existing policy liabilities together with the present value of future gross premiums will not be sufficient to cover the present value of future benefits, settlement and maintenance costs. For purposes of determining premium deficiencies, contracts are grouped in a manner consistent with the method of acquiring, servicing and measuring the profitability of such contracts and expected investment income is excluded. We recorded a premium deficiency reserve of $250 million in December 2023 related to the 2024 Medicare Advantage contract year. In December 2024, we recorded a premium deficiency reserve of $92 million related to the 2025 Medicare Advantage contract year.\n60\nTable of Contents\nThe paid and received completion factors, claims per member per month and per diem cost trend factors are the most significant factors affecting the IBNR estimate. The following table illustrates the sensitivity of these factors and the estimated potential impact on our operating results caused by changes in these factors based on December 31, 2024 data:\nCompletion Factors: \n(1)\nCost Trend Factors: \n(2)\n(Decrease) Increase in Factors\nIncrease (Decrease) in Medical Claims Liabilities\n(Decrease) Increase in Factors\nIncrease (Decrease) in Medical Claims Liabilities\n \n(In millions)\n(In millions)\n(1.00)\n%\n$\n1,221 \n(1.00)\n%\n$\n(240)\n(0.75)\n912 \n(0.75)\n(180)\n(0.50)\n605 \n(0.50)\n(120)\n(0.25)\n301 \n(0.25)\n(60)\n0.25 \n(299)\n0.25 \n60 \n0.50 \n(596)\n0.50 \n120 \n0.75 \n(890)\n0.75 \n180 \n1.00 \n(1,181)\n1.00 \n240 \n(1)\nReflects estimated potential changes in medical claims liability caused by changes in completion factors.\n(2)\nReflects estimated potential changes in medical claims liability caused by changes in cost trend factors for the most recent periods.\nWhile we believe our estimates are appropriate, it is possible future events could require us to make significant adjustments for revisions to these estimates. For example, a 1% increase or decrease in our estimated medical claims liability would have affected net earnings by $142 million for the year ended December 31, 2024, excluding the effect of any return of premium, risk corridor or minimum medical loss ratio (MLR) programs. The estimates are based on our historical experience, terms of existing contracts, our observation of trends in the industry, information provided by our providers and information available from other outside sources.\n \nThe change in medical claims liability is summarized as follows (in millions): \nYear Ended December 31,\n2024\n2023\n2022\nBalance, January 1,\n$\n18,000 \n$\n16,745 \n$\n14,243 \nLess: Reinsurance recoverables\n49 \n26 \n23 \nBalance, January 1, net\n17,951 \n16,719 \n14,220 \nAcquisitions and divestitures\n— \n— \n105 \nIncurred related to:\nCurrent year\n128,312 \n120,680 \n112,896 \nPrior years\n(2,447)\n(2,036)\n(1,367)\nTotal incurred\n125,865 \n118,644 \n111,529 \nPaid related to:\nCurrent year\n111,456 \n104,725 \n97,799 \nPrior years\n13,959 \n12,937 \n11,336 \nTotal paid\n125,415 \n117,662 \n109,135 \nPlus: Premium deficiency reserve\n(158)\n250 \n— \nBalance, December 31, net\n18,243 \n17,951 \n16,719 \nPlus: Reinsurance recoverables\n65 \n49 \n26 \nBalance, December 31,\n$\n18,308 \n$\n18,000 \n$\n16,745 \nDays in claims payable \n(1)\n53 \n54 \n54 \n(1)\nDays in claims payable is a calculation of medical claims liability at the end of the period divided by average expense per calendar day for the fourth quarter of each year.\n61\nTable of Contents\nMedical claims are usually paid within a few months of the member receiving service from the physician or other healthcare provider. As a result, the liability generally is described as having a \"short-tail,\" which causes less than 10% of our medical claims liability as of the end of any given year to be outstanding the following year. We believe that the vast majority of the development of the estimate of medical claims liability as of December 31, 2024 will be known by the end of 2025.\nChanges in estimates of incurred claims for prior years are primarily attributable to reserving under moderately adverse conditions. Additionally, as a result of minimum MLR and other return of premium programs, approximately $243 million, $382 million and $198 million of the \"Incurred related to: Prior years\" was recorded as a reduction to premium revenues in 2024, 2023 and 2022, respectively. Further, claims processing and coordination of benefits initiatives yielded claim payment recoveries related to dates of service from prior years. Changes in medical utilization, claims submission patterns, and cost trends and the effect of population health management initiatives may also contribute to changes in medical claim liability estimates. While we have evidence that population health management initiatives are effective on a case by case basis, these initiatives primarily focus on events and behaviors prior to the incurrence of the medical event and generation of a claim. Accordingly, any change in behavior, leveling of care or coordination of treatment occurs prior to claim generation and as a result, the costs prior to the population health management initiative are not known by us. Additionally, certain population health management initiatives are focused on member and provider education with the intent of influencing behavior to appropriately align the medical services provided with the member's acuity. In these cases, determining whether the population health management initiative changed the behavior cannot be determined. Because of the complexity of our business, the number of states in which we operate and the volume of claims that we process, we are unable to practically quantify the impact of these initiatives on our changes in estimates of IBNR.\nRevenue Recognition \n \nOur health plans generate revenues primarily from premiums received from the states in which we operate health plans, premiums received from our members and CMS for our Medicare product and premiums from members of our commercial health plans. In addition to member premium payments, our Marketplace contracts also generate revenues from subsidies received from CMS. We generally receive a fixed premium per member per month pursuant to our contracts and recognize premium revenues during the period in which we are obligated to provide services to our members at the amount reasonably estimable. In some instances, our base premiums are subject to an adjustment, in the form of a risk score or risk adjustment, based on the acuity of our membership. Generally, the risk score or risk adjustment is determined by the state or CMS analyzing submissions of processed claims and medical record data to determine the acuity of our membership, often relative to the respective program's membership. We estimate the amount of risk score and risk adjustment based upon the processed claims and medical record data submitted and expected to be submitted to the state or CMS and record revenues on a risk adjusted basis. Some contracts allow for additional premiums related to certain supplemental services provided such as maternity deliveries.\nOur contracts with states and CMS may require us to maintain a minimum MLR or may require us to share cost-savings in excess of certain levels. In certain circumstances, including commercial plans, our plans may be required to return premium to the state or policyholders in the event costs are below established levels. We estimate the effect of these programs and recognize reductions in revenue in the current period. Other states may require us to meet certain performance and quality metrics in order to receive additional or full contractual revenue. For performance-based contracts, we do not recognize revenue subject to refund until data is sufficient to measure performance.\nRevenues are recorded based on membership and eligibility data provided by the states or CMS, which is adjusted on a monthly basis by the states or CMS for retroactive additions or deletions to membership data. These eligibility adjustments are estimated monthly and subsequent adjustments are made in the period known. We review and update those estimates as new information becomes available. It is possible that new information could require us to make additional adjustments, which could be significant, to these estimates.\nOur Medicare Advantage contracts are with CMS. CMS deploys a risk adjustment model which apportions premiums paid to all health plans according to health severity and certain demographic factors. The CMS risk adjustment model pays more for members whose medical history would indicate that they are expected to have higher medical costs. Under this risk adjustment methodology, CMS calculates the risk adjusted premium payment using diagnosis data from hospital inpatient, hospital outpatient, physician treatment settings as well as prescription drug events. We and the healthcare providers collect, compile and submit the necessary and available diagnosis data to CMS within prescribed deadlines. We estimate risk adjustment revenues based upon the diagnosis data submitted and expected to be submitted to CMS and record revenues on a risk adjusted basis.\n62\nTable of Contents\nFor qualifying low-income prescription drug benefit members, CMS pays for some, or all, of the member's monthly premium. We receive certain Part D prospective subsidy payments from CMS for these members as a fixed monthly per member amount, based on the estimated costs of providing prescription drug benefits over the plan year, as reflected in our bids. Approximately nine to ten months subsequent to the end of the plan year, or later in the case of the coverage gap discount subsidy, a settlement payment is made between CMS and our plans based on the difference between the prospective payments and actual claims experience. \nOur specialty companies generate revenues under contracts with state and federal programs, healthcare organizations and other commercial organizations and from our own subsidiaries. Revenues are recognized when the related services are provided or as ratably earned over the covered period of services. For performance-based measures in our contracts, revenue is recognized as data sufficient to measure performance is available. We recognize revenue related to administrative services under the TRICARE government-sponsored Managed Care Support Contract for the Department of Defense (DoD's) TRICARE program on a straight-line basis over the option period, when the fees become fixed and determinable. The TRICARE contract includes various performance-based measures. For each of the measures, an estimate of the amount that has been earned is made at each interim date, and revenue is recognized accordingly. We concluded serving members at the end of 2024 upon the expiration of its TRICARE Managed Care Support Contract.\nSome states enact premium taxes, similar assessments and provider pass-through payments, collectively premium taxes, and these taxes are recorded as a separate component of both revenues and operating expenses. For certain products, premium taxes and state assessments are not pass-through payments and are recorded as premium revenue and premium tax expense in the Consolidated Statements of Operations.\nSome states require state directed payments that have minimal risk, but are administered as a premium adjustment. These payments are recorded as premium revenue and medical costs at close to a 100% HBR. In many instances, we have little visibility to the timing of these payments until they are paid by the state.\n63\nTable of Contents\nITEM 7A. \nQuantitative and Qualitative Disclosures About Market Risk\nMarket risk represents the risk of loss that may impact our financial condition due to adverse changes in financial market prices and rates. Our market risk exposure is primarily the result of fluctuations in interest rates.\nINVESTMENTS AND DEBT\nAs of December 31, 2024, we had short-term investments of $2.6 billion and long-term investments of $18.8 billion, including restricted deposits of $1.4 billion. The short-term investments generally consist of highly liquid securities with maturities between three and 12 months. The long-term investments consist of municipal, corporate and U.S. Treasury securities, government-sponsored obligations, life insurance contracts, asset backed securities, equity securities and private equity investments and have maturities greater than one year. Private equity investments include direct investments in private equity securities as well as private equity funds. Restricted deposits consist of investments required by various state statutes to be deposited or pledged to state agencies. Due to the nature of the states' requirements, these investments are classified as long-term regardless of the contractual maturity date. Substantially all of our investments are subject to interest rate risk and will decrease in value if market rates increase. Assuming a hypothetical and immediate 1% increase in market interest rates at December 31, 2024, the fair value of our fixed income investments would decrease by approximately $665 million. Declines in interest rates over time will reduce our investment income. \nFor a discussion of the interest rate risk that our investments are subject to, see \"Risk Factors -\n \nOur investment portfolio may suffer losses which could materially and adversely affect our results of operations or liquidity.\n\"\n64\nTable of Contents\nItem 8. \nFinancial Statements and Supplementary Data\n \nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors\nCentene Corporation:\nOpinion on the Consolidated\n \nFinancial Statements\nWe have audited the accompanying consolidated balance sheets of Centene Corporation and subsidiaries (the Company) as of December 31, 2024 and 2023, the related consolidated statements of operations, comprehensive earnings (loss), stockholders' equity, and cash flows for each of the years in the three‑year period ended December 31, 2024, and the related notes (collectively, the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the years in the three‑year period ended December 31, 2024, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control - Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission, and our report dated February 18, 2025 expressed an unqualified opinion on the effectiveness of the Company's internal control over financial reporting.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on these consolidated financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the Audit and Compliance Committee and that: (1) relate to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nEvaluation of the estimated medical claims liability \nAs discussed in Note 2 to the consolidated financial statements, the Company's medical claims liability includes claims reported but not yet paid, estimates for claims incurred but not reported, and estimates for the costs necessary to process unpaid claims. As discussed in Note 8 to the consolidated financial statements, the balance at December 31, 2024 was $18,308 million.\n65\nTable of Contents\nWe identified the evaluation of the estimated medical claims liability as a critical audit matter. The Company estimates its medical claims liability using actuarial methods. Specialized skills were required to evaluate these actuarial methods, which include analyzing historical claims data in order to estimate the medical claims liability. The medical claims liability included an estimate for medical claims developing under moderately adverse conditions, which represents the risk of adverse deviation in the Company's actuarial methods of reserving, which required auditor judgment to evaluate.\nThe following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of certain internal controls related to the critical audit matter. This included controls over the Company's process to evaluate the estimate of the medical claims liability. We involved actuarial professionals with specialized skills and knowledge who evaluated the actuarial methods used by the Company to estimate the medical claims liability. With the assistance of the actuarial professionals, we challenged the Company's estimate of the medical claims liability, including the effects of moderately adverse conditions, by developing an independent estimate for certain health plans using the Company's medical claims data, and relative range. We assessed the potential for management bias by evaluating the Company's position and movement within the actuarial professionals' relative range. \nEvaluation of the estimated Affordable Care Act risk adjustment accruals\nAs discussed in Note 2 to the consolidated financial statements, the Affordable Care Act (ACA) established a permanent risk adjustment program. This program transfers funds from qualified individual and small group insurance plans with below average risk scores to those insurance plans with above average risk scores within each state. The final settlement of the December 31, 2024 ACA risk adjustment accruals is scheduled to be determined by the Centers for Medicare and Medicaid Services (CMS) in June 2025, based on data submitted by insurance companies through April 2025. As discussed in Note 9, the Company recorded an estimated asset and liability (the ACA risk adjustment accruals) of $1,434 million, and $1,605 million, respectively at December 31, 2024.\nWe identified the evaluation of the estimated ACA risk adjustment accruals as a critical audit matter. Specialized skills and a higher degree of auditor judgment were required to evaluate the Company's estimates. The Company's estimates are based on its analysis of member data, claims data, and projections of claims data expected to be submitted by the Company, and other insurance plans, to CMS for settlement.\nThe following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of certain internal controls over the Company's process to develop the estimated ACA risk adjustment accruals. We involved actuarial professionals with specialized skills and knowledge who assisted in evaluating the Company's methodology used in estimating the ACA risk adjustment accruals for consistency with the federally developed risk adjustment methodology. Additionally, the actuarial professionals assisted in evaluating the projections of claims data utilized to estimate the ACA risk adjustment accruals, and assessed the methodologies utilized by the Company for consistency with industry practice. We assessed the Company's process to estimate the ACA risk adjustment accruals, in order to consider the potential for management bias, by performing a retrospective review of the prior period ACA risk adjustment accruals and assessing the consistency of those estimated balances with the subsequent settlement.\n/s/ KPMG LLP\nWe have served as the Company's auditor since 2005.\nSt. Louis, Missouri\nFebruary 18, 2025 \n66\nTable of Contents\nCENTENE CORPORATION AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\n(In millions, except shares in thousands and per share data in dollars)\n \nDecember 31, 2024\nDecember 31, 2023\nASSETS\n \n \nCurrent assets:\n \n \nCash and cash equivalents\n$\n14,063\n \n$\n17,193\n \nPremium and trade receivables\n19,713\n \n15,532\n \nShort-term investments\n2,622\n \n2,459\n \nOther current assets\n1,601\n \n5,572\n \nTotal current assets\n37,999\n \n40,756\n \nLong-term investments\n17,429\n \n16,286\n \nRestricted deposits\n1,390\n \n1,386\n \nProperty, software and equipment, net\n2,067\n \n2,019\n \nGoodwill\n17,558\n \n17,558\n \nIntangible assets, net\n5,409\n \n6,101\n \nOther long-term assets\n593\n \n535\n \nTotal assets\n$\n82,445\n \n$\n84,641\n \nLIABILITIES, REDEEMABLE NONCONTROLLING INTERESTS AND STOCKHOLDERS' EQUITY\n \n \nCurrent liabilities:\n \n \nMedical claims liability\n$\n18,308\n \n$\n18,000\n \nAccounts payable and accrued expenses\n13,174\n \n16,420\n \nReturn of premium payable\n2,008\n \n1,462\n \nUnearned revenue\n661\n \n715\n \nCurrent portion of long-term debt\n110\n \n119\n \nTotal current liabilities\n34,261\n \n36,716\n \nLong-term debt\n18,423\n \n17,710\n \nDeferred tax liability\n684\n \n641\n \nOther long-term liabilities\n2,567\n \n3,618\n \nTotal liabilities\n55,935\n \n58,685\n \nCommitments and contingencies\nRedeemable noncontrolling interests\n10\n \n19\n \nStockholders' equity:\n \n \nPreferred stock, $\n0.001\n par value; authorized \n10,000\n shares; \nno\n shares issued or outstanding at December 31, 2024 and December 31, 2023\n—\n \n—\n \nCommon stock, $\n0.001\n par value; authorized \n800,000\n shares; \n620,195\n issued and \n495,907\n outstanding at December 31, 2024, and \n615,291\n issued and \n534,484\n outstanding at December 31, 2023\n1\n \n1\n \nAdditional paid-in capital\n20,562\n \n20,304\n \nAccumulated other comprehensive (loss)\n(\n504\n)\n(\n652\n)\nRetained earnings\n15,348\n \n12,043\n \nTreasury stock, at cost (\n124,288\n and \n80,807\n shares, respectively)\n(\n8,997\n)\n(\n5,856\n)\nTotal Centene stockholders' equity\n26,410\n \n25,840\n \nNonredeemable noncontrolling interest\n90\n \n97\n \nTotal stockholders' equity\n26,500\n \n25,937\n \nTotal liabilities, redeemable noncontrolling interests and stockholders' equity\n$\n82,445\n \n$\n84,641\n \nThe accompanying notes to the consolidated financial statements are an integral part of these statements. \n67\nTable of Contents\nCENTENE CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(In millions, except shares in thousands and per share data in dollars)\n \nYear Ended December 31,\n \n2024\n2023\n2022\nRevenues:\n \nPremium\n$\n142,303\n \n$\n135,636\n \n$\n127,131\n \nService\n3,202\n \n4,459\n \n8,348\n \nPremium and service revenues\n145,505\n \n140,095\n \n135,479\n \nPremium tax\n17,566\n \n13,904\n \n9,068\n \nTotal revenues\n163,071\n \n153,999\n \n144,547\n \nExpenses:\n \n \n \nMedical costs\n125,707\n \n118,894\n \n111,529\n \nCost of services\n2,729\n \n3,564\n \n7,032\n \nSelling, general and administrative expenses\n12,400\n \n12,563\n \n11,589\n \nDepreciation expense\n549\n \n575\n \n614\n \nAmortization of acquired intangible assets\n692\n \n718\n \n817\n \nPremium tax expense\n17,806\n \n14,226\n \n9,330\n \nImpairment\n13\n \n529\n \n2,318\n \nTotal operating expenses\n159,896\n \n151,069\n \n143,229\n \nEarnings from operations\n3,175\n \n2,930\n \n1,318\n \nOther income (expense):\n \n \n \nInvestment and other income\n1,784\n \n1,393\n \n1,279\n \nDebt extinguishment\n—\n \n—\n \n30\n \nInterest expense\n(\n702\n)\n(\n725\n)\n(\n665\n)\nEarnings before income tax\n4,257\n \n3,598\n \n1,962\n \nIncome tax expense\n963\n \n899\n \n760\n \nNet earnings\n3,294\n \n2,699\n \n1,202\n \nLoss attributable to noncontrolling interests\n11\n \n3\n \n—\n \nNet earnings attributable to Centene Corporation\n$\n3,305\n \n$\n2,702\n \n$\n1,202\n \nNet earnings per common share attributable to Centene Corporation:\nBasic earnings per common share\n$\n6.33\n \n$\n4.97\n \n$\n2.09\n \nDiluted earnings per common share\n$\n6.31\n \n$\n4.95\n \n$\n2.07\n \nWeighted average number of common shares outstanding:\nBasic \n521,790\n \n543,319\n \n575,191\n \nDiluted \n523,744\n \n545,704\n \n582,040\n \nThe accompanying notes to the consolidated financial statements are an integral part of these statements.\n68\nTable of Contents\nCENTENE CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE EARNINGS (LOSS)\n(In millions)\n \nYear Ended December 31,\n \n2024\n2023\n2022\nNet earnings\n$\n3,294\n \n$\n2,699\n \n$\n1,202\n \nChange in unrealized gain (loss) on investments\n94\n \n520\n \n(\n1,475\n)\nChange in unrealized gain (loss) on investments, tax effect\n(\n29\n)\n(\n128\n)\n349\n \nChange in unrealized gain (loss) on investments, net of tax\n65\n \n392\n \n(\n1,126\n)\nReclassification adjustment, net of tax\n83\n \n62\n \n11\n \nForeign currency translation adjustments, net of tax\n—\n \n36\n \n(\n94\n)\nNet unrealized (loss) on cash flow hedge, net of tax\n—\n \n(\n10\n)\n—\n \nOther comprehensive earnings (loss)\n148\n \n480\n \n(\n1,209\n)\nComprehensive earnings (loss)\n3,442\n \n3,179\n \n(\n7\n)\nComprehensive loss attributable to noncontrolling interests\n11\n \n3\n \n—\n \nComprehensive earnings (loss) attributable to Centene Corporation\n$\n3,453\n \n$\n3,182\n \n$\n(\n7\n)\nThe accompanying notes to the consolidated financial statements are an integral part of these statements.\n69\nTable of Contents\nCENTENE CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS' EQUITY\n(In millions, except shares in thousands and per share data in dollars)\n \nCentene Stockholders' Equity\n \n \n \nCommon Stock\n \n \n \nTreasury Stock\n \n \n \n$\n0.001\n Par\nValue Shares\nAmt\nAdditional \nPaid-in Capital\nAccumulated Other\nComprehensive Earnings (Loss)\nRetained Earnings\n$\n0.001\n Par\nValue Shares\nAmt\nNoncontrolling Interest\nTotal\nBalance, December 31, 2021\n602,704\n \n$\n1\n \n$\n19,672\n \n$\n77\n \n$\n8,139\n \n20,225\n \n$\n(\n1,094\n)\n$\n145\n \n$\n26,940\n \nNet earnings (loss)\n— \n— \n— \n— \n1,202\n \n— \n— \n(\n13\n)\n1,189\n \nOther comprehensive loss, net of $(\n349\n) tax\n— \n— \n— \n(\n1,209\n)\n— \n— \n— \n— \n(\n1,209\n)\nCommon stock issued for employee benefit plans\n5,143\n \n— \n71\n \n— \n— \n— \n— \n— \n71\n \nFair value of unvested equity awards in connection with acquisition\n— \n— \n60\n \n— \n— \n— \n— \n— \n60\n \nCommon stock repurchases\n— \n— \n23\n \n— \n— \n36,868\n \n(\n3,119\n)\n— \n(\n3,096\n)\nStock compensation expense\n— \n— \n234\n \n— \n— \n— \n— \n— \n234\n \nReclassification to non-redeemable\n— \n— \n— \n— \n— \n— \n— \n17\n \n17\n \nDivestiture of noncontrolling interest\n— \n— \n— \n— \n— \n— \n— \n(\n14\n)\n(\n14\n)\nDividend to noncontrolling interest\n— \n— \n— \n— \n— \n— \n— \n(\n10\n)\n(\n10\n)\nPurchase of noncontrolling interest\n— \n— \n— \n— \n— \n— \n— \n(\n1\n)\n(\n1\n)\nBalance, December 31, 2022\n607,847\n \n$\n1\n \n$\n20,060\n \n$\n(\n1,132\n)\n$\n9,341\n \n57,093\n \n$\n(\n4,213\n)\n$\n124\n \n$\n24,181\n \nNet earnings (loss)\n— \n— \n— \n— \n2,702\n \n— \n— \n(\n3\n)\n2,699\n \nOther comprehensive earnings, net of $\n144\n tax\n— \n— \n— \n480\n \n— \n— \n— \n— \n480\n \nCommon stock issued for employee benefit plans\n7,444\n \n— \n44\n \n— \n— \n— \n— \n— \n44\n \nCommon stock repurchases\n— \n— \n— \n— \n— \n23,714\n \n(\n1,643\n)\n— \n(\n1,643\n)\nStock compensation expense\n— \n— \n216\n \n— \n— \n— \n— \n— \n216\n \nPurchase of redeemable noncontrolling interest\n— \n— \n(\n12\n)\n— \n— \n— \n— \n— \n(\n12\n)\nPurchase of non-redeemable noncontrolling interest\n— \n— \n(\n4\n)\n— \n— \n— \n— \n(\n24\n)\n(\n28\n)\nBalance, December 31, 2023\n615,291\n \n$\n1\n \n$\n20,304\n \n$\n(\n652\n)\n$\n12,043\n \n80,807\n \n$\n(\n5,856\n)\n$\n97\n \n$\n25,937\n \nNet earnings (loss)\n— \n— \n— \n— \n3,305\n \n— \n— \n(\n5\n)\n3,300\n \nOther comprehensive earnings, net of $\n31\n tax\n— \n— \n— \n148\n \n— \n— \n— \n— \n148\n \nCommon stock issued for employee benefit plans\n4,904\n \n— \n46\n \n— \n— \n— \n— \n— \n46\n \nCommon stock repurchases\n— \n— \n— \n— \n— \n43,481\n \n(\n3,141\n)\n— \n(\n3,141\n)\nStock compensation expense\n— \n— \n212\n \n— \n— \n— \n— \n— \n212\n \nDivestiture of noncontrolling interest\n— \n— \n— \n— \n— \n— \n— \n(\n2\n)\n(\n2\n)\nBalance, December 31, 2024\n620,195\n \n$\n1\n \n$\n20,562\n \n$\n(\n504\n)\n$\n15,348\n \n124,288\n \n$\n(\n8,997\n)\n$\n90\n \n$\n26,500\n \n    \nThe accompanying notes to the consolidated financial statements are an integral part of this statement. \n70\nTable of Contents\nCENTENE CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(In millions)\n \nYear Ended December 31,\n \n2024\n2023\n2022\nCash flows from operating activities:\n \n \nNet earnings\n$\n3,294\n \n$\n2,699\n \n$\n1,202\n \nAdjustments to reconcile net earnings to net cash provided by operating activities\n \n \n \nDepreciation and amortization\n1,241\n \n1,293\n \n1,430\n \nStock compensation expense\n212\n \n216\n \n234\n \nImpairment\n13\n \n529\n \n2,318\n \n(Gain) loss on debt extinguishment\n—\n \n—\n \n(\n25\n)\n(Gain) on acquisition\n—\n \n—\n \n(\n2\n)\nDeferred income taxes\n13\n \n(\n78\n)\n(\n631\n)\n(Gain) loss on divestitures, net\n(\n120\n)\n(\n152\n)\n(\n772\n)\nLoss on disposal of equipment\n—\n \n—\n \n221\n \nOther adjustments, net\n16\n \n172\n \n(\n31\n)\nChanges in assets and liabilities\n \n \n \nPremium and trade receivables\n(\n4,333\n)\n(\n2,380\n)\n(\n1,627\n)\nOther assets\n46\n \n5\n \n128\n \nMedical claims liabilities\n368\n \n1,261\n \n2,397\n \nUnearned revenue\n(\n54\n)\n238\n \n31\n \nAccounts payable and accrued expenses\n(\n528\n)\n3,398\n \n421\n \nOther long-term liabilities\n(\n70\n)\n856\n \n842\n \nOther operating activities, net\n56\n \n(\n4\n)\n125\n \nNet cash provided by operating activities\n154\n \n8,053\n \n6,261\n \nCash flows from investing activities:\n \n \n \nCapital expenditures\n(\n644\n)\n(\n799\n)\n(\n1,004\n)\nPurchases of investments\n(\n7,183\n)\n(\n6,622\n)\n(\n6,736\n)\nSales and maturities of investments\n5,785\n \n5,523\n \n3,802\n \nAcquisitions, net of cash acquired\n—\n \n—\n \n(\n1,460\n)\nDivestiture proceeds, net of divested cash\n990\n \n707\n \n2,477\n \nNet cash used in investing activities\n(\n1,052\n)\n(\n1,191\n)\n(\n2,921\n)\nCash flows from financing activities:\n \n \n \nProceeds from long-term debt\n1,300\n \n2,335\n \n360\n \nPayments and repurchases of long-term debt\n(\n622\n)\n(\n2,316\n)\n(\n1,490\n)\nCommon stock repurchases\n(\n3,124\n)\n(\n1,633\n)\n(\n3,096\n)\nProceeds from common stock issuances\n46\n \n44\n \n70\n \nPayments for debt extinguishment\n—\n \n—\n \n(\n14\n)\nPurchase of noncontrolling interest\n—\n \n(\n88\n)\n—\n \nOther financing activities, net\n(\n6\n)\n—\n \n(\n27\n)\nNet cash used in financing activities\n(\n2,406\n)\n(\n1,658\n)\n(\n4,197\n)\nEffect of exchange rate changes on cash, cash equivalents and restricted cash\n8\n \n(\n32\n)\n(\n11\n)\nNet increase (decrease) in cash, cash equivalents and restricted cash and cash equivalents\n(\n3,296\n)\n5,172\n \n(\n868\n)\nCash and cash equivalents reclassified (to) from held for sale\n—\n \n(\n50\n)\n(\n16\n)\nCash, cash equivalents and restricted cash and cash equivalents,\n beginning of period\n17,452\n \n12,330\n \n13,214\n \nCash, cash equivalents and restricted cash and cash equivalents,\n end of period\n$\n14,156\n \n$\n17,452\n \n$\n12,330\n \nSupplemental disclosures of cash flow information:\n \n \nInterest paid\n$\n688\n \n$\n688\n \n$\n657\n \nIncome taxes paid, net\n$\n1,002\n \n$\n887\n \n$\n1,198\n \nEquity issued in connection with acquisitions\n$\n—\n \n$\n—\n \n$\n60\n \nThe following table provides a reconciliation of cash, cash equivalents and restricted cash and cash equivalents reported within the Consolidated Balance Sheets to the totals above:\n2024\n2023\n2022\nCash and cash equivalents\n$\n14,063\n \n$\n17,193\n \n$\n12,074\n \nRestricted cash and cash equivalents, included in restricted deposits\n93\n \n259\n \n256\n \nTotal cash, cash equivalents, and restricted cash and cash equivalents\n$\n14,156\n \n$\n17,452\n \n$\n12,330\n \nThe accompanying notes to the consolidated financial statements are an integral part of these statements.\n71\nTable of Contents\nCENTENE CORPORATION AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n \n1. \nOrganization and Operations \nCentene Corporation, or the Company, is a leading provider of government-sponsored healthcare. Centene's focus is on improving health and health care for low-income populations with complex needs. The Company provides access to high-quality healthcare, innovative programs and a wide range of health solutions that help families and individuals get well, stay well and be well. \nThe Company operates in \nfour\n segments: (1) a Medicaid segment, (2) a Medicare segment, (3) a Commercial segment and (4) an Other segment. The Medicaid, Medicare and Commercial segments primarily represent the government-sponsored or subsidized programs under which the Company offers managed healthcare services. Specifically, the Medicaid segment includes the Temporary Assistance for Needy Families (TANF) program, Medicaid Expansion programs, the Aged, Blind or Disabled (ABD) program, the Children's Health Insurance Program (CHIP), Long-Term Services and Supports (LTSS), Foster Care, Medicare-Medicaid Plans (MMP), which cover beneficiaries who are dually eligible for Medicaid and Medicare and other state-based programs. The Medicare segment includes Medicare Advantage, Medicare Supplement, Dual Eligible Special Needs Plans (D-SNPs) and Medicare Prescription Drug Plans (PDPs), also known as Medicare Part D. The Commercial segment includes the Health Insurance Marketplace product along with individual, small group and large group commercial health insurance products. The Other segment includes the Company's pharmacy operations, Envolve Benefit Options' vision and dental services, clinical healthcare, behavioral health, international operations and corporate management company, among others. The Company's international businesses, Operose Health Group (Operose Health) and Circle Health Group (Circle Health), which were included in the Other segment, were divested in December 2023 and January 2024, respectively.\n2. \nSummary of Significant Accounting Policies \nBasis of Presentation\n \nThe accompanying consolidated financial statements include the accounts of Centene Corporation and all majority owned subsidiaries and subsidiaries over which the Company exercises the power and control to direct activities significantly impacting financial performance. All material intercompany balances and transactions have been eliminated. \nCertain 2022 and 2023 amounts in the consolidated financial statements and notes to the consolidated financial statements have been reclassified to conform to the 2024 presentation. These reclassifications have no effect on net earnings or stockholders' equity as previously reported.\nDuring 2024, the Company completed the divestitures of Circle Health and Collaborative Health Systems (CHS). See Note 3. \nAcquisitions and Divestitures \nfor further details.\nUse of Estimates \nThe preparation of financial statements in conformity with generally accepted accounting principles in the United States (GAAP) requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Future events and their effects cannot be predicted with certainty; accordingly, the accounting estimates require the exercise of judgment. The accounting estimates used in the preparation of the consolidated financial statements will change as new events occur, as more experience is acquired, as additional information is obtained, and as the operating environment changes. The Company evaluates and updates its assumptions and estimates on an ongoing basis and may employ outside experts to assist in its evaluation, as considered necessary. Actual results could differ from those estimates.\n \nBusiness Combinations\nBusiness combinations are accounted for using the acquisition method of accounting. The Company allocates the fair value of purchase consideration to the assets acquired and liabilities assumed based on their fair values at the acquisition date. The excess of the fair value of consideration transferred over the fair value of the net assets acquired is recorded as goodwill. Goodwill is generally attributable to the value of the synergies between the combined companies and the value of the acquired assembled workforce, neither of which qualifies for recognition as an intangible asset. \n72\nTable of Contents\nThe Company uses its best estimates and assumptions to value assets acquired and liabilities assumed at the acquisition date; however, these estimates are sometimes preliminary and, in some instances, all information required to value the assets acquired and liabilities assumed may not be available or final as of the end of a reporting period subsequent to the business combination. If the accounting for the business combination is incomplete, provisional amounts are recorded. The provisional amounts are updated during the period determined, up to one year from the acquisition date. The Company includes the results of operations of acquired businesses in the Company's consolidated results prospectively from the date of acquisition. \nAcquisition related expenses and post-acquisition restructuring costs are recognized separately from the business combination and are expensed as incurred.\n \nCash and Cash Equivalents \n \nInvestments with original maturities of three months or less are considered to be cash equivalents. Cash equivalents consist of money market funds, bank certificates of deposit and savings accounts. \nThe Company maintains amounts on deposit with various financial institutions, which may exceed federally insured limits. However, management periodically evaluates the credit-worthiness of those institutions, and the Company has not experienced any losses on such deposits.\nInvestments \n \nShort-term investments include securities with maturities greater than three months to one year. Long-term investments include securities with maturities greater than one year. \nShort-term and long-term investments are generally classified as available-for-sale and are carried at fair value. Certain equity investments are recorded using the fair value or equity method. The Company monitors the difference between the carrying value and fair value of its available-for-sale debt investments and whether declines in fair value are credit related. Unrealized gains and losses on debt investments available-for-sale are excluded from earnings and reported in accumulated other comprehensive earnings (loss), a separate component of stockholders' equity, net of income tax effects. If a loss is deemed to be credit related, the Company recognizes an allowance through earnings. For each security in an unrealized loss position, the Company assesses whether it intends to sell the security or if it is more likely than not the Company will be required to sell the security before recovery of the amortized cost basis for reasons such as liquidity, contractual or regulatory purposes. If the security meets this criterion, the decline in fair value is recorded in earnings through investment and other income. Premiums and discounts are amortized or accreted over the life of the related security using the effective interest method. To calculate realized gains and losses on the sale of investments, the Company uses the specific amortized cost of each investment sold. Realized gains and losses are recorded in investment and other income. \nThe Company uses the equity method to account for investments in entities that it does not control but has the ability to exercise significant influence over operating and financial policies. Generally, under the equity method, original investments in these entities are recorded at cost and subsequently adjusted by the Company's share of equity in income or losses after the date of acquisition as well as capital contributions to and distributions from these companies.\n \nRestricted Deposits \n \nRestricted deposits consist of investments required by various state statutes to be deposited or pledged to state agencies. These investments are classified as long-term, regardless of the contractual maturity date, due to the nature of the states' requirements. The Company is required to annually adjust the amount of the deposit pledged to certain states.\nFair Value Measurements\nIn the normal course of business, the Company invests in various financial assets and incurs various financial liabilities. Fair values are disclosed for all financial instruments, whether or not such values are recognized in the Consolidated Balance Sheets. Management obtains quoted market prices and other observable inputs for these disclosures. The carrying amounts reported in the Consolidated Balance Sheets for cash and cash equivalents, premium and trade receivables, medical claims liability, accounts payable and accrued expenses, unearned revenue and certain other current assets and liabilities are carried at cost, which approximates fair value because of their short-term nature. \n73\nTable of Contents\nThe following methods and assumptions were used to estimate the fair value of each financial instrument: \n•\nAvailable-for-sale investments and restricted deposits: The carrying amount is stated at fair value, based on quoted market prices, where available. For securities not actively traded, fair values were estimated using values obtained from independent pricing services or quoted market prices of comparable instruments.\n•\nSenior unsecured notes: Estimated based on third-party quoted market prices for the same or similar issues.\n•\nVariable rate debt: The carrying amount of the Company's floating rate debt approximates fair value since the interest rates adjust based on market rate adjustments.\n•\nContingent consideration: Estimated based on expected achievement of metrics included in the acquisition agreement considering circumstances that exist as of the acquisition date.\n \nProperty, Software and Equipment \n \nProperty, software and equipment are stated at cost less accumulated depreciation. Computer hardware and software includes certain costs incurred in the development of internal-use software, including external direct costs of materials and services and payroll costs of team members devoted to specific software development. Depreciation is calculated principally by the straight-line method over estimated useful lives. Leasehold improvements are depreciated using the straight-line method over the shorter of the expected useful life or the remaining term of the lease. \nProperty, software and equipment are depreciated over the following periods:\nFixed Asset\nDepreciation Period\nBuildings and improvements\n \n10\n - \n40\n years\nComputer hardware and software\n3\n - \n5\n years\nFurniture and equipment\n \n5\n - \n10\n years\nLand improvements\n \n10\n - \n25\n years\nLeasehold improvements\n \n1\n - \n20\n years\nThe carrying amounts of all long-lived assets are evaluated to determine if adjustment to the depreciation and amortization period or to the unamortized balance is warranted. Such evaluation is based principally on the expected utilization of the long-lived assets.\nThe Company retains fully depreciated assets in property and accumulated depreciation accounts until it removes them from service. In the case of sale, retirement or disposal, the asset cost and related accumulated depreciation balance is removed from the respective account, and the resulting net amount, less any proceeds, is included as a component of earnings from operations in the Consolidated Statements of Operations.\n \nGoodwill and\n \nIntangible Assets \n \nIntangible assets represent assets acquired in purchase transactions and consist primarily of purchased contract rights and customer relationships, provider contracts, trade names, developed technologies and goodwill. \nIntangible assets are amortized using the straight-line method over the following periods:\nIntangible Asset\nAmortization Period\nPurchased contract rights and customer relationships\n3\n - \n21\n years\nProvider contracts\n4\n - \n15\n years\nTrade names\n7\n - \n20\n years\nDeveloped technologies\n2\n - \n7\n years\n74\nTable of Contents\nThe Company tests for impairment of intangible assets, as well as long-lived assets, whenever events or circumstances indicate that the carrying value of an asset or asset group (hereinafter referred to as \"asset group\") may not be recoverable by comparing the sum of the estimated undiscounted future cash flows expected to result from use of the asset group and its eventual disposition to the carrying value. Such factors include significant changes in membership, financial performance, state funding, government contracts and provider networks and contracts. If the sum of the estimated undiscounted future cash flows is less than the carrying value, an impairment determination is required. The amount of impairment is calculated by subtracting the fair value of the asset group from the carrying value of the asset group. An impairment charge, if any, is recognized within earnings from operations.\nThe Company operates in four segments: (1) a Medicaid segment, (2) a Medicare segment, (3) a Commercial segment and (4) an Other segment. The Company defines its reporting units as its operating segments or one level below the operating segment. The Company tests goodwill for impairment at the reporting unit level using a fair value approach. The Company is required to test for impairment at least annually, absent a triggering event, which could include a significant decline in operating performance that would require an impairment assessment. Absent any impairment indicators, the Company performs its goodwill impairment testing during the fourth quarter of each year. The Company recognizes an impairment charge for any amount by which the carrying amount of goodwill exceeds its fair value.\nThe Company first assesses qualitative factors to determine whether it is necessary to perform the quantitative goodwill impairment test. The Company generally does not calculate the fair value of a reporting unit unless it determines, based on a qualitative assessment, that it is more likely than not that its fair value is less than its carrying amount.\nIf the quantitative test is deemed necessary, the Company determines an appropriate valuation technique to estimate a reporting unit's fair value as of the testing date. The Company utilizes either the income approach or the market approach, whichever is most appropriate for the respective reporting unit. The income approach is based on an internally developed discounted cash flow model that includes assumptions related to future growth rates, discount factors, future tax rates and other various assumptions. The market approach is based on financial multiples of comparable companies derived from current market data. The Company then compares the fair value of the reporting unit calculated using the income approach or market approach with its carrying amount and recognizes an impairment charge for the amount by which the carrying amount exceeds fair value. The impairment charge is limited to the total amount of goodwill allocated to the reporting unit. Changes in economic and operating conditions impacting assumptions used in the Company's analyses could result in goodwill impairment in future periods.\nMedical Claims Liability\n \nMedical claims liability includes claims reported but not yet paid, or claims inventory, estimates for claims incurred but not reported, or IBNR, and estimates for the costs necessary to process unpaid claims at the end of each period. The Company estimates its medical claims liability using actuarial methods that are commonly used by health insurance actuaries and meet Actuarial Standards of Practice. These actuarial methods consider factors such as historical data for payment patterns, cost trends, product mix, seasonality, utilization of healthcare services and other relevant factors.\nActuarial Standards of Practice generally require that the medical claims liability estimates be adequate to cover obligations under moderately adverse conditions. Moderately adverse conditions are situations in which the actual claims are expected to be higher than the otherwise estimated value of such claims at the time of estimate. The claims amounts ultimately settled will most likely be different than the estimate that satisfies the Actuarial Standards of Practice. The Company includes in its IBNR an estimate for medical claims liability under moderately adverse conditions which represents the risk of adverse deviation of the estimates in its actuarial method of reserving.\nThe Company uses its judgment to determine the assumptions to be used in the calculation of the required estimates. The assumptions it considers when estimating IBNR include, without limitation, claims receipt and payment experience (and variations in that experience), changes in membership, provider billing practices, healthcare service utilization trends, cost trends, product mix, seasonality, prior authorization of medical services, benefit changes, known outbreaks of disease or increased incidence of illness such as influenza, provider contract changes, changes to fee schedules and the incidence of high-dollar or catastrophic claims.\n75\nTable of Contents\nThe Company's development of the medical claims liability estimate is a continuous process which it monitors and refines on a monthly basis as additional claims receipts and payment information becomes available. As more complete claims information becomes available, the Company adjusts the amount of the estimates, and includes the changes in estimates in medical costs in the period in which the changes are identified. In every reporting period, the operating results include the effects of more completely developed medical claims liability estimates associated with previously reported periods. The Company consistently applies its reserving methodology from period to period. As additional information becomes known, it adjusts the actuarial models accordingly to establish medical claims liability estimates.\nThe Company reviews actual and anticipated experience compared to the assumptions used to establish medical costs. The Company establishes premium deficiency reserves if actual and anticipated experience indicates that existing policy liabilities together with the present value of future gross premiums will not be sufficient to cover the present value of future benefits, settlement and maintenance costs. For purposes of determining premium deficiencies, contracts are grouped in a manner consistent with the method of acquiring, servicing and measuring the profitability of such contracts and expected investment income is excluded. In December 2023, the Company recorded a premium deficiency reserve of $\n250\n million related to the 2024 Medicare Advantage contract year. In December 2024, the Company recorded a premium deficiency reserve of $\n92\n million related to the 2025 Medicare Advantage contract year.\nRevenue Recognition \nThe Company's health plans generate revenues primarily from premiums received from the states in which it operates health plans, premiums received from its members and the Centers for Medicare and Medicaid Services (CMS) for its Medicare product and premiums from members of its commercial health plans. In addition to member premium payments, its Marketplace contracts also generate revenues from subsidies received from CMS. The Company generally receives a fixed premium per member per month pursuant to its contracts and recognizes premium revenues during the period in which it is obligated to provide services to its members at the amount reasonably estimable. In some instances, the Company's base premiums are subject to an adjustment, in the form of a risk score or risk adjustment, based on the acuity of its membership. Generally, the risk score or risk adjustment is determined by the state or CMS analyzing submissions of processed claims and medical record data to determine the acuity of the Company's membership, often relative to the respective program's membership. The Company estimates the amount of risk score and risk adjustment based upon the processed claims and medical record data submitted and expected to be submitted to the state or CMS and records revenues on a risk adjusted basis. Some contracts allow for additional premiums related to certain supplemental services provided such as maternity deliveries.\nThe Company's contracts with states and CMS may require it to maintain a minimum medical loss ratio (MLR) or may require it to share cost-savings in excess of certain levels. In certain circumstances, including commercial plans, its plans may be required to return premium to the state or policyholders in the event costs are below established levels. The Company estimates the effect of these programs and recognizes reductions in revenue in the current period. Other states may require us to meet certain performance and quality metrics in order to receive additional or full contractual revenue. For performance-based contracts, the Company does not recognize revenue subject to refund until data is sufficient to measure performance.\nRevenues are recorded based on membership and eligibility data provided by the states or CMS, which is adjusted on a monthly basis by the states or CMS for retroactive additions or deletions to membership data. These eligibility adjustments are estimated monthly and subsequent adjustments are made in the period known. The Company reviews and updates those estimates as new information becomes available. It is possible that new information could require us to make additional adjustments, which could be significant, to these estimates.\nThe Company's Medicare Advantage contracts are with CMS. CMS deploys a risk adjustment model which apportions premiums paid to all health plans according to health severity and certain demographic factors. The CMS risk adjustment model pays more for members whose medical history would indicate that they are expected to have higher medical costs. Under this risk adjustment methodology, CMS calculates the risk adjusted premium payment using diagnosis data from hospital inpatient, hospital outpatient, physician treatment settings as well as prescription drug events. The Company and the healthcare providers collect, compile and submit the necessary and available diagnosis data to CMS within prescribed deadlines. The Company estimates risk adjustment revenues based upon the diagnosis data submitted and expected to be submitted to CMS and records revenues on a risk adjusted basis.\n76\nTable of Contents\nFor qualifying low-income prescription drug benefit members, CMS pays for some, or all, of the member's monthly premium. The Company receives certain Part D prospective subsidy payments from CMS for these members as a fixed monthly per member amount, based on the estimated costs of providing prescription drug benefits over the plan year, as reflected in its bids. Approximately nine to ten months subsequent to the end of the plan year, or later in the case of the coverage gap discount subsidy, a settlement payment is made between CMS and the Company's plans based on the difference between the prospective payments and actual claims experience.\nThe Company's specialty companies generate revenues under contracts with state and federal programs, healthcare organizations and other commercial organizations, as well as from its own subsidiaries. Revenues are recognized when the related services are provided, when inventory is shipped, or as ratably earned over the covered period of services. For performance-based measures in the Company's contracts, revenue is recognized as data sufficient to measure performance is available. The Company recognizes revenue related to administrative services under the TRICARE government-sponsored Managed Care Support Contract for the Department of Defense (DoD's) TRICARE program on a straight-line basis over the option period, when the fees become fixed and determinable. The TRICARE contract includes various performance-based measures. For each of the measures, an estimate of the amount that has been earned is made at each interim date, and revenue is recognized accordingly. The Company concluded serving members at the end of 2024 upon the expiration of its TRICARE Managed Care Support Contract.\nSome states enact premium taxes, similar assessments and provider pass-through payments, collectively premium taxes, and these taxes are recorded as a separate component of both revenues and operating expenses. For certain products, premium taxes and state assessments are not pass-through payments and are recorded as premium revenue and premium tax expense in the Consolidated Statements of Operations.\nSome states require state directed payments that have minimal risk, but are administered as a premium adjustment. These payments are recorded as premium revenue and medical costs at close to a 100% health benefits ratio (HBR). In many instances, the Company has little visibility to the timing of these payments until they are paid by the state.\n \n \nAffordable Care Act\nThe Affordable Care Act (ACA) established risk spreading premium stabilization programs as well as minimum MLR and cost sharing reductions (CSRs). The Company's accounting policies for the programs are as follows: \nRisk Adjustment\nThe permanent risk adjustment program established by the ACA transfers funds from qualified individual and small group insurance plans with below average risk scores to those plans with above average risk scores within each state. The Company estimates the receivable or payable under the risk adjustment program based on its estimated risk score compared to the state average risk score. The Company may record a receivable or payable as an adjustment to premium revenues to reflect the year-to-date impact of the risk adjustment based on its best estimate. The Company refines its estimate as new information becomes available. \nMinimum Medical Loss Ratio\nAdditionally, the ACA established a minimum MLR for the Health Insurance Marketplace. The risk adjustment program described above is taken into consideration to determine if the Company's estimated annual medical costs are less than the minimum MLR and require an adjustment to premium revenues to meet the minimum MLR. \nCost Sharing Reductions\nThe ACA directs issuers to reduce the Company's members' cost sharing for essential health benefits for individuals with Federal Poverty Levels (FPLs) between 100% and 250% who are enrolled in a silver tier product; eliminate cost sharing for Indians/Alaska Natives with a FPL less than 300% and eliminate cost sharing for Indians/Alaska Natives regardless of FPL when services are provided by an Indian Health Service. In October 2017, the Trump Administration issued an executive order that immediately ceased payments of CSRs to issuers, and beginning in 2018, premium rates for Health Insurance Marketplace were set without factoring in the cost sharing subsidy payments from the federal government. In 2024, the Company reached an agreement with the federal government to retroactively compensate the Company for the difference between its actual CSR experience and its pricing assumptions for 2018 through 2020.\n \n77\nTable of Contents\nPremium and Trade Receivables and Unearned Revenue\nPremium and service revenues collected in advance are recorded as unearned revenue. For performance-based contracts, the Company does not recognize revenue subject to refund until data is sufficient to measure performance. Premiums and service revenues due to the Company are recorded as premium and trade receivables and are recorded net of an allowance based on historical trends and management's judgment on the collectability of these accounts. As the Company generally receives payments during the month in which services are provided, the allowance is typically not significant in comparison to total revenues and does not have a material impact on the presentation of the financial condition or results of operations. Amounts receivable under federal contracts are comprised primarily of contractually defined billings, accrued contract incentives under the terms of the contract and amounts related to change orders for services not originally specified in the contract.\nActivity in the allowance for uncollectible accounts is summarized below ($ in millions):\nYear Ended December 31,\n \n2024\n2023\n2022\nBalance, January 1\n$\n120\n \n$\n130\n \n$\n139\n \nAmounts charged to expense\n68\n \n58\n \n70\n \nWrite-offs of uncollectible receivables\n(\n77\n)\n(\n68\n)\n(\n79\n)\nBalance, December 31\n$\n111\n \n$\n120\n \n$\n130\n \nSignificant Customers \n \nThe Company receives the majority of its revenues under contracts or subcontracts with state Medicaid managed care programs. \nNone\n of the Company's customers exceeded 10% of total annual revenues for the years ended December 31, 2024, 2023 and 2022.\nOther Income (Expense) \n \nOther income (expense) consists routinely of investment income, interest expense and equity method earnings from investments. Investment income is derived from the Company's cash, cash equivalents, restricted deposits and investments. Interest expense relates to borrowings under the senior notes, credit facilities, mortgage and construction loans and capital leases. Further, other income (expense) includes gains or losses on sales of investments, divestitures and acquisitions as well as debt extinguishment costs.\n \nIncome Taxes \n \nDeferred tax assets and liabilities are recorded for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax law or tax rates is recognized in income in the period that includes the enactment date. \nValuation allowances are provided when it is considered more likely than not that deferred tax assets will not be realized. In determining if a deductible temporary difference or net operating loss can be realized, the Company considers future reversals of existing taxable temporary differences, future taxable income, taxable income in prior carryback periods and tax planning strategies.\n \nContingencies\nThe Company accrues for loss contingencies associated with outstanding litigation, claims and assessments for which it has determined it is probable that a loss contingency exists and the amount of loss can be reasonably estimated. The Company expenses professional fees associated with litigation claims and assessments as incurred.\nStock Based Compensation\n \nStock based compensation expense is recognized at grant date fair value over the period during which an employee is required to provide service in exchange for the award. Excess tax benefits related to stock compensation are presented as a cash inflow from operating activities. The Company accounts for forfeitures when they occur.\n78\nTable of Contents\nRecently Adopted Accounting Guidance\nIn November 2023, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2023-07 - Segment Reporting: Improvements to Reportable Segment Disclosures which is intended to improve reportable segment disclosure requirements, primarily through enhanced disclosures about significant expenses. The amendments will require public entities to disclose significant segment expenses that are regularly provided to the chief operating decision-maker and included within segment profit and loss. The new standard is effective for annual periods beginning after December 15, 2023, and for interim periods within fiscal years beginning after December 15, 2024. The Company adopted the new guidance in the fourth quarter of 2024.\nIn December 2023, the FASB issued ASU 2023-09 - Income taxes: Improvements to Income Tax Disclosures which includes amendments that further enhance income tax disclosures, primarily through standardization and disaggregation of rate reconciliation categories and income taxes paid by jurisdiction. The new standard is effective for annual periods beginning after December 15, 2024. The Company early adopted the new guidance in the fourth quarter of 2024, as permissible by the ASU.\nRecent Accounting Guidance Not Yet Adopted\nIn November 2024, the FASB issued ASU 2024-03 - Income Statement - Reporting Comprehensive Income: Disaggregation of Income Statement Expenses which expands disclosures about specific expense categories presented on the face of the Statement of Operations. The new standard is effective for annual periods beginning after December 15, 2026, and interim periods beginning after December 15, 2027. The Company is currently evaluating the effect of the new disclosure requirements.\n3. \nAcquisitions and Divestitures\nSpanish and Central European Divestiture\nOn November 16, 2022, the Company completed the divestiture of its ownership stakes in its Spanish and Central European businesses, including Ribera Salud, Torrejón Salud and Pro Diagnostics Group.\nDuring 2022, the Company recorded an impairment charge primarily related to intangible assets and goodwill associated with the divestiture of $\n163\n million, or $\n140\n million after-tax. In 2023, the Company recognized an additional loss on sale of $\n13\n million, or $\n10\n million after-tax, which is included in investment and other income in the Consolidated Statements of Operations.\nMagellan Rx Divestiture\nOn December 2, 2022, the Company completed the divestiture of Magellan Rx for $\n1,337\n million. The Company recognized a gain of $\n269\n million, or $\n99\n million after-tax, which is included in investment and other income in the Consolidated Statements of Operations. \nDuring 2023, the Company recorded a reduction to the previously reported gain on the divestiture of $\n22\n million, or $\n10\n million after-tax, due to the finalization of working capital adjustments.\nMagellan Specialty Health Divestiture\nOn January 20, 2023, the Company completed the divestiture of Magellan Specialty Health for $\n646\n million in cash and stock, including an estimated working capital adjustment, and recognized a gain of $\n79\n million, or $\n68\n million after-tax. The stock consideration was subsequently sold in April 2023 for cash proceeds of $\n245\n million.\nDuring 2024, the Company recorded an additional gain on the previously reported divestiture of Magellan Specialty Health of $\n83\n million for achievement of contingent consideration related to the sale and finalization of working capital adjustments, which is included in investment and other income in the Consolidated Statements of Operations.\n79\nTable of Contents\nCenturion Divestiture\nOn January 10, 2023, the Company signed and closed a definitive agreement to divest Centurion. During 2022, the Company recorded an impairment charge related to goodwill and other current assets associated with the divestiture of $\n259\n million, or $\n181\n million after-tax. During 2023, the Company recognized a gain of $\n15\n million, or $\n10\n million after-tax, reflecting additional proceeds for contingent consideration, partially offset by net working capital adjustments. The gain is included in investment and other income in the Consolidated Statements of Operations.\nHealthSmart Divestiture\nOn January 5, 2023, the Company completed the divestiture of HealthSmart. During 2022, the Company recorded an impairment charge related to goodwill associated with the divestiture of $\n36\n million, or $\n27\n million after-tax.\nApixio Divestiture\nOn June 13, 2023, the Company completed the divestiture of its majority stake in Apixio. During 2023, the Company recognized a pre-tax gain of $\n93\n million, or $\n67\n million after-tax, which is included in investment and other income in the Consolidated Statements of Operations.\nCircle Health Group Divestiture\nOn August 28, 2023, the Company signed a definitive agreement to sell Circle Health, one of the U.K.'s largest independent hospital operators, which is included in the Other segment. As of December 31, 2023, the assets and liabilities of Circle Health were considered held for sale resulting in $\n3,897\n million of assets held for sale in other current assets and $\n3,094\n million of liabilities held for sale in accounts payable and accrued expenses in the Consolidated Balance Sheets. The majority of the held for sale assets were previously reported as other long-term assets, goodwill and property, software and equipment. The majority of the liabilities were previously reported as debt and other long-term liabilities.\nIn accordance with the signed definitive agreement in the third quarter of 2023, and subsequently updated in the fourth quarter of 2023, the Company recorded impairment charges related to goodwill associated with the pending divestiture totaling $\n292\n million, or $\n258\n million after-tax.\nIn order to manage the foreign exchange risk on the sale price associated with the pending divestiture of Circle Health, in August 2023 the Company entered into a foreign currency swap agreement for a notional amount of $\n931\n million, to sell £\n740\n million. The swap agreement was formally designated and qualified as a cash flow hedge. The swap expired on the earlier of the divestiture closing date or March 28, 2024. The gain or loss due to changes in the fair value of the foreign currency swap was recorded in other comprehensive income until the Circle Health divestiture closed, at which time the gain or loss was recorded in earnings to the same line in the Consolidated Statements of Operations as the gain or loss on sale. The fair value of the swap agreement as of December 31, 2023 was $\n13\n million, which was recorded in accounts payable and accrued expenses in the Consolidated Balance Sheets.\nOn January 12, 2024, the Company completed the divestiture for $\n931\n million and settled the foreign currency swap. Upon closing the divestiture, the Company settled the foreign currency swap and recorded a corresponding gain of $\n20\n million, which includes the cumulative translation adjustment previously recorded in accumulated other comprehensive income in the Consolidated Balance Sheet. The gain is included in investment and other income in the Consolidated Statements of Operations. During the year ended December 31, 2024, the Company realized a net tax benefit of approximately $\n40\n million on the loss recognized on the divestiture.\nOperose Health Group Divestiture\nIn November 2023, the Company signed a definitive agreement to sell Operose Health and completed the divestiture on December 28, 2023. During 2023, the Company recorded impairment charges to Operose Health primarily related to goodwill, intangible assets and property, software and equipment of $\n140\n million, or $\n128\n million after-tax based on market indicators of fair value.\nCollaborative Health Systems Divestiture\nIn July 2024, the Company entered into a definitive agreement to sell CHS, a management services organization, which is included in the Other segment.\n80\nTable of Contents\nOn October 4, 2024, the Company completed the previously announced sale of CHS. During 2024, the Company recognized a pre-tax gain of $\n17\n million, or $\n13\n million after-tax, which is included in investment and other income in the Consolidated Statements of Operations.\n4. \nShort-term and Long-term Investments, Restricted Deposits \nShort-term and long-term investments and restricted deposits by investment type consist of the following ($ in millions):\n \nDecember 31, 2024\nDecember 31, 2023\n \nAmortized Cost\nGross\nUnrealized Gains\nGross\nUnrealized Losses\nFair Value\nAmortized Cost\nGross\nUnrealized Gains\nGross\nUnrealized Losses\nFair Value\nDebt securities:\nU.S. Treasury securities and obligations of \nU.S. government corporations and agencies\n$\n593\n \n$\n2\n \n$\n(\n4\n)\n$\n591\n \n$\n403\n \n$\n—\n \n$\n(\n8\n)\n$\n395\n \nCorporate securities\n10,820\n \n47\n \n(\n360\n)\n10,507\n \n9,984\n \n78\n \n(\n461\n)\n9,601\n \nRestricted certificates of deposit\n4\n \n—\n \n—\n \n4\n \n4\n \n—\n \n—\n \n4\n \nRestricted cash equivalents\n93\n \n—\n \n—\n \n93\n \n259\n \n—\n \n—\n \n259\n \nShort-term time deposits\n425\n \n—\n \n—\n \n425\n \n746\n \n—\n \n—\n \n746\n \nMunicipal securities\n4,174\n \n7\n \n(\n151\n)\n4,030\n \n4,135\n \n21\n \n(\n171\n)\n3,985\n \nAsset-backed securities\n1,820\n \n13\n \n(\n21\n)\n1,812\n \n1,665\n \n8\n \n(\n35\n)\n1,638\n \nResidential mortgage-backed securities\n1,807\n \n1\n \n(\n129\n)\n1,679\n \n1,503\n \n7\n \n(\n103\n)\n1,407\n \nCommercial mortgage-backed securities\n1,298\n \n3\n \n(\n62\n)\n1,239\n \n1,149\n \n5\n \n(\n82\n)\n1,072\n \nEquity securities\n14\n \n— \n— \n14\n \n17\n \n— \n— \n17\n \nPrivate equity investments\n851\n \n— \n— \n851\n \n833\n \n— \n— \n833\n \nLife insurance contracts\n196\n \n— \n— \n196\n \n174\n \n— \n— \n174\n \nTotal\n$\n22,095\n \n$\n73\n \n$\n(\n727\n)\n$\n21,441\n \n$\n20,872\n \n$\n119\n \n$\n(\n860\n)\n$\n20,131\n \nThe Company's investments are debt securities classified as available-for-sale with the exception of equity securities, certain private equity investments and life insurance contracts. Private equity investments include direct investments in private equity securities as well as private equity funds. In December 2024, the Company impaired a private equity investment for $\n50\n million. The Company's investment policies are designed to provide liquidity, preserve capital and maximize total return on invested assets with a focus on high credit quality securities. The Company limits the size of investment in any single issuer other than U.S. treasury securities and obligations of U.S. government corporations and agencies. As of December 31, 2024, \n99\n% of the Company's investments in rated securities carry an investment grade rating by nationally recognized statistical rating organizations. At December 31, 2024, the Company held certificates of deposit, equity securities, private equity investments and life insurance contracts, which did not carry a credit rating. Accrued interest income on available-for-sale debt securities was $\n178\n million and $\n153\n million at December 31, 2024 and 2023, respectively, and is included in \nother current assets\n in the Consolidated Balance Sheets.\nThe Company's residential mortgage-backed securities are primarily issued by the Federal National Mortgage Association, Government National Mortgage Association or Federal Home Loan Mortgage Corporation, which carry implicit or explicit guarantees of the U.S. government. The Company's commercial mortgage-backed securities are primarily senior tranches with a weighted average rating of AA+ and a weighted average duration of \n3\n years at December 31, 2024.\n81\nTable of Contents\nThe fair value of available-for-sale debt securities with gross unrealized losses by investment type and length of time that individual securities have been in a continuous unrealized loss position were as follows ($ in millions):\n \nDecember 31, 2024\nDecember 31, 2023\n \nLess Than 12 Months\n12 Months or More\nLess Than 12 Months\n12 Months or More\n \nUnrealized Losses\nFair Value\nUnrealized Losses\nFair Value\nUnrealized Losses\nFair Value\nUnrealized Losses\nFair Value\nU.S. Treasury securities and obligations of \nU.S. government corporations and agencies\n$\n(\n1\n)\n$\n60\n \n$\n(\n3\n)\n$\n144\n \n$\n—\n \n$\n79\n \n$\n(\n8\n)\n$\n232\n \nCorporate securities\n(\n41\n)\n2,621\n \n(\n319\n)\n4,782\n \n(\n6\n)\n658\n \n(\n455\n)\n6,260\n \nMunicipal securities\n(\n16\n)\n1,217\n \n(\n135\n)\n2,073\n \n(\n4\n)\n553\n \n(\n167\n)\n2,237\n \nAsset-backed securities\n(\n4\n)\n301\n \n(\n17\n)\n331\n \n(\n2\n)\n197\n \n(\n33\n)\n855\n \nResidential mortgage-backed securities\n(\n18\n)\n786\n \n(\n111\n)\n738\n \n(\n2\n)\n153\n \n(\n101\n)\n814\n \nCommercial mortgage-backed securities\n(\n4\n)\n210\n \n(\n58\n)\n666\n \n(\n2\n)\n114\n \n(\n80\n)\n754\n \nShort-term time deposits\n—\n \n—\n \n—\n \n—\n \n—\n \n31\n \n—\n \n—\n \nTotal\n$\n(\n84\n)\n$\n5,195\n \n$\n(\n643\n)\n$\n8,734\n \n$\n(\n16\n)\n$\n1,785\n \n$\n(\n844\n)\n$\n11,152\n \nAs of December 31, 2024, the gross unrealized losses were generated from \n5,276\n positions out of a total of \n6,750\n positions. The change in fair value of available-for-sale debt securities is primarily a result of movement in interest rates subsequent to the purchase of the security.\nFor each security in an unrealized loss position, the Company assesses whether it intends to sell the security or if it is more likely than not the Company will be required to sell the security before recovery of the amortized cost basis for reasons such as liquidity, contractual or regulatory purposes. If the security meets this criterion, the decline in fair value is recorded in earnings. The Company does not intend to sell these securities prior to maturity and it is not likely that the Company will be required to sell these securities prior to maturity; therefore, the Company did not record an impairment for these securities.\nIn addition, the Company monitors available-for-sale debt securities for credit losses. Certain investments have experienced a decline in fair value due to changes in credit quality, market interest rates and/or general economic conditions. The Company recognizes an allowance when evidence demonstrates that the decline in fair value is credit related. Evidence of a credit-related loss may include rating agency actions, adverse conditions specifically related to the security or failure of the issuer of the security to make scheduled payments.\nThe contractual maturities of short-term and long-term debt securities and restricted deposits are as follows ($ in millions):\n \nDecember 31, 2024\nDecember 31, 2023\n \nInvestments\nRestricted Deposits\nInvestments\nRestricted Deposits\n \nAmortized Cost\nFair Value\nAmortized Cost\nFair Value\nAmortized Cost\nFair Value\nAmortized Cost\nFair Value\nOne year or less\n$\n2,383\n \n$\n2,365\n \n$\n477\n \n$\n475\n \n$\n2,308\n \n$\n2,284\n \n$\n566\n \n$\n564\n \nOne year through five years\n7,799\n \n7,563\n \n610\n \n593\n \n7,738\n \n7,431\n \n527\n \n504\n \nFive years through ten years\n4,343\n \n4,172\n \n301\n \n291\n \n3,905\n \n3,735\n \n298\n \n283\n \nGreater than ten years\n165\n \n160\n \n31\n \n31\n \n155\n \n154\n \n34\n \n35\n \nAsset-backed securities\n4,925\n \n4,730\n \n—\n \n—\n \n4,317\n \n4,117\n \n—\n \n—\n \nTotal\n$\n19,615\n \n$\n18,990\n \n$\n1,419\n \n$\n1,390\n \n$\n18,423\n \n$\n17,721\n \n$\n1,425\n \n$\n1,386\n \n \nActual maturities may differ from contractual maturities due to call or prepayment options. Equity securities, private equity investments and life insurance contracts are excluded from the table above because they do not have a contractual maturity. The Company has an option to redeem substantially all of the securities included in the greater than ten years category listed above at amortized cost.\n82\nTable of Contents\n5. \nFair Value Measurements\nAssets and liabilities recorded at fair value in the Consolidated Balance Sheets are categorized based upon observable or unobservable inputs used to estimate fair value. \nLevel inputs are as follows: \nLevel Input:\nInput Definition:\nLevel I\nInputs are unadjusted, quoted prices for identical assets or liabilities in active markets at the measurement date.\nLevel II\nInputs other than quoted prices included in Level I that are observable for the asset or liability through corroboration with market data at the measurement date.\nLevel III\nUnobservable inputs that reflect management's best estimate of what market participants would use in pricing the asset or liability at the measurement date.\nThe following table summarizes fair value measurements by level at December 31, 2024, for assets and liabilities measured at fair value on a recurring basis ($ in millions):\n \nLevel I\nLevel II\nLevel III\nTotal\nAssets\n \n \n \n \nCash and cash equivalents\n$\n14,063\n \n$\n—\n \n$\n—\n \n$\n14,063\n \nInvestments:\n \n \n \n \nU.S. Treasury securities and obligations of U.S. government corporations and agencies\n$\n58\n \n$\n—\n \n$\n—\n \n$\n58\n \nCorporate securities\n—\n \n10,505\n \n—\n \n10,505\n \nMunicipal securities\n—\n \n3,272\n \n—\n \n3,272\n \nShort-term time deposits\n—\n \n425\n \n—\n \n425\n \nAsset-backed securities\n—\n \n1,812\n \n—\n \n1,812\n \nResidential mortgage-backed securities\n—\n \n1,679\n \n—\n \n1,679\n \nCommercial mortgage-backed securities\n—\n \n1,239\n \n—\n \n1,239\n \nEquity securities\n13\n \n1\n \n—\n \n14\n \nTotal investments\n$\n71\n \n$\n18,933\n \n$\n—\n \n$\n19,004\n \nRestricted deposits:\n \n \n \n \nCash and cash equivalents\n$\n93\n \n$\n—\n \n$\n—\n \n$\n93\n \nU.S. Treasury securities and obligations of U.S. government corporations and agencies\n533\n \n—\n \n533\n \nCorporate securities\n—\n \n2\n \n—\n \n2\n \nCertificates of deposit\n—\n \n4\n \n—\n \n4\n \nMunicipal securities\n—\n \n758\n \n—\n \n758\n \nTotal restricted deposits\n$\n626\n \n$\n764\n \n$\n—\n \n$\n1,390\n \nTotal assets at fair value\n$\n14,760\n \n$\n19,697\n \n$\n—\n \n$\n34,457\n \n83\nTable of Contents\nThe following table summarizes fair value measurements by level at December 31, 2023, for assets and liabilities measured at fair value on a recurring basis ($ in millions):\n \nLevel I\nLevel II\nLevel III\nTotal\nAssets\n \n \n \n \nCash and cash equivalents\n$\n17,193\n \n$\n—\n \n$\n—\n \n$\n17,193\n \nInvestments:\nU.S. Treasury securities and obligations of U.S. government corporations and agencies\n$\n62\n \n$\n—\n \n$\n—\n \n$\n62\n \nCorporate securities\n—\n \n9,564\n \n—\n \n9,564\n \nMunicipal securities\n—\n \n3,232\n \n—\n \n3,232\n \nShort-term time deposits\n—\n \n746\n \n—\n \n746\n \nAsset-backed securities\n—\n \n1,638\n \n—\n \n1,638\n \nResidential mortgage-backed securities\n—\n \n1,407\n \n—\n \n1,407\n \nCommercial mortgage-backed securities\n—\n \n1,072\n \n—\n \n1,072\n \nEquity securities\n15\n \n2\n \n—\n \n17\n \nTotal investments\n$\n77\n \n$\n17,661\n \n$\n—\n \n$\n17,738\n \nRestricted deposits:\n \n \n \n \nCash and cash equivalents\n$\n259\n \n$\n—\n \n$\n—\n \n$\n259\n \nU.S. Treasury securities and obligations of U.S. government corporations and agencies\n333\n \n—\n \n—\n \n333\n \nCorporate securities\n—\n \n37\n \n—\n \n37\n \nCertificates of deposit\n—\n \n4\n \n—\n \n4\n \nMunicipal securities\n—\n \n753\n \n—\n \n753\n \nTotal restricted deposits\n$\n592\n \n$\n794\n \n$\n—\n \n$\n1,386\n \nTotal assets at fair value\n$\n17,862\n \n$\n18,455\n \n$\n—\n \n$\n36,317\n \nLiabilities\nAccounts payable and accrued expenses:\nForeign currency swap agreement\n$\n—\n \n$\n13\n \n$\n—\n \n$\n13\n \nTotal liabilities at fair value\n$\n—\n \n$\n13\n \n$\n—\n \n$\n13\n \n \nThe Company utilizes matrix pricing services to estimate fair value for securities which are not actively traded on the measurement date. The Company designates these securities as Level II fair value measurements. In addition, the aggregate carrying amount of the Company's private equity investments and life insurance contracts, which approximates fair value, was $\n1,047\n million and $\n1,007\n million as of December 31, 2024 and December 31, 2023, respectively.\n84\nTable of Contents\n6. \nProperty, Software and Equipment\n \nProperty, software and equipment consist of the following ($ in millions): \n \nDecember 31, 2024\nDecember 31, 2023\nComputer software\n$\n3,051\n \n$\n2,631\n \nComputer hardware\n535\n \n542\n \nBuildings\n523\n \n534\n \nFurniture and office equipment\n332\n \n304\n \nLeasehold improvements\n273\n \n252\n \nLand\n156\n \n156\n \nProperty, software and equipment, at cost\n4,870\n \n4,419\n \nLess: accumulated depreciation\n(\n2,803\n)\n(\n2,400\n)\nProperty, software and equipment, net\n$\n2,067\n \n$\n2,019\n \nDepreciation expense for the years ended December 31, 2024, 2023 and 2022 was $\n549\n million, $\n575\n million and $\n614\n million, respectively.\nDuring the second quarter of 2022, in connection with the adoption of a more modern, flexible work environment, the Company undertook a real estate optimization initiative to evaluate future real estate needs and downsize its real estate footprint for owned and leased properties. As a result of this evaluation, the Company substantially changed the use or abandoned various properties and assessed for impairment. The Company engaged a third-party real estate specialist to determine the fair value of its owned properties. The valuation primarily considered comparable properties in each market as well as future cash flows.\nAs a result of the optimization, the Company recognized impairment charges related to owned real estate and fixed assets related to leased real estate of $\n57\n million and $\n1,050\n million for the years ended December 31, 2023 and 2022, respectively. The remainder of the $\n97\n million and $\n1,627\n million impairment charges for the years ended December 31, 2023 and 2022, respectively, relate to right-of-use (ROU) asset impairments, which is included within other long-term assets in the Consolidated Balance Sheets, refer to\n \nNote 11.\n Leases. \nAdditionally, during 2024, the Company sold an owned property for a pre-tax gain of $\n24\n million.\n7. \nGoodwill and Intangible Assets\nThe following table summarizes the changes in goodwill by operating segment ($ in millions):\n \nMedicaid\nMedicare\nCommercial\nOther\nConsolidated Total\nBalance, December 31, 2022\n$\n10,198\n \n$\n1,592\n \n$\n5,424\n \n$\n1,598\n \n$\n18,812\n \nDivestitures\n—\n \n—\n \n—\n \n(\n912\n)\n(\n912\n)\nImpairments\n—\n \n—\n \n—\n \n(\n392\n)\n(\n392\n)\nTranslation impact\n—\n \n—\n \n—\n \n50\n \n50\n \nBalance, December 31, 2023\n$\n10,198\n \n$\n1,592\n \n$\n5,424\n \n$\n344\n \n$\n17,558\n \nCurrent year activity\n—\n \n—\n \n—\n \n—\n \n—\n \nBalance, December 31, 2024\n$\n10,198\n \n$\n1,592\n \n$\n5,424\n \n$\n344\n \n$\n17,558\n \nIn 2023, divestiture related activity in goodwill included the completed divestiture of Apixio as well as $\n760\n million of goodwill reclassified to other current assets associated with the divestiture of Circle Health, which was considered held for sale as of December 31, 2023.\nThe Company's Other segment impairments in 2023 were driven by the Circle Health and Operose Health divestitures.\n85\nTable of Contents\nIntangible assets at December 31, consist of the following ($ in millions):\n \nWeighted Average Useful Life in Years\n \n2024\n2023\n2024\n2023\nPurchased contract rights and customer relationships\n$\n7,845\n \n$\n7,845\n \n13.5\n13.5\nTrade names\n943\n \n943\n \n15.6\n15.6\nProvider contracts\n612\n \n612\n \n14.0\n14.0\nDeveloped technologies\n298\n \n298\n \n4.4\n4.4\nIntangible assets\n9,698\n \n9,698\n \n13.4\n13.4\nLess: accumulated amortization\n \n \n \nPurchased contract rights and customer relationships\n(\n3,348\n)\n(\n2,768\n)\n \nTrade names\n(\n383\n)\n(\n320\n)\n \nProvider contracts\n(\n271\n)\n(\n227\n)\n \nDeveloped technologies\n(\n287\n)\n(\n282\n)\nTotal accumulated amortization\n(\n4,289\n)\n(\n3,597\n)\n \nIntangible assets, net\n$\n5,409\n \n$\n6,101\n \n \nAmortization expense was $\n692\n million, $\n718\n million and $\n817\n million for the years ended December 31, 2024, 2023 and 2022, respectively. \nEstimated total amortization expense related to the December 31, 2024 intangible assets for each of the five succeeding fiscal years is as follows ($ in millions):\nEstimated Total Amortization Expense\n2025\n$\n690\n \n2026\n673\n \n2027\n663\n \n2028\n662\n \n2029\n558\n \n86\nTable of Contents\n8. \nMedical Claims Liability\nThe following table summarizes the change in medical claims liability for the year ended December 31, 2024 ($ in millions): \n \nMedicaid\nMedicare\nCommercial\nOther\nConsolidated Total\nBalance, January 1, 2024\n$\n10,814\n \n$\n3,612\n \n$\n3,460\n \n$\n114\n \n$\n18,000\n \nLess: Reinsurance recoverables\n5\n \n—\n \n44\n \n—\n \n49\n \nBalance, January 1, 2024, net\n10,809\n \n3,612\n \n3,416\n \n114\n \n17,951\n \nIncurred related to:\nCurrent year\n78,886\n \n21,170\n \n26,548\n \n1,708\n \n128,312\n \nPrior years\n(\n1,370\n)\n(\n575\n)\n(\n509\n)\n7\n \n(\n2,447\n)\nTotal incurred\n77,516\n \n20,595\n \n26,039\n \n1,715\n \n125,865\n \nPaid related to:\nCurrent year\n69,351\n \n18,036\n \n22,547\n \n1,522\n \n111,456\n \nPrior years\n8,693\n \n2,655\n \n2,492\n \n119\n \n13,959\n \nTotal paid\n78,044\n \n20,691\n \n25,039\n \n1,641\n \n125,415\n \nPlus: Premium deficiency reserve\n— \n(\n158\n)\n— \n— \n(\n158\n)\nBalance, December 31, 2024, net\n10,281\n \n3,358\n \n4,416\n \n188\n \n18,243\n \nPlus: Reinsurance recoverables\n18\n \n—\n \n47\n \n—\n \n65\n \nBalance, December 31, 2024\n$\n10,299\n \n$\n3,358\n \n$\n4,463\n \n$\n188\n \n$\n18,308\n \nThe following table summarizes the change in medical claims liability for the year ended December 31, 2023 ($ in millions): \n \nMedicaid\nMedicare\nCommercial\nOther\nConsolidated Total\nBalance, January 1, 2023\n$\n11,253\n \n$\n3,431\n \n$\n1,921\n \n$\n140\n \n$\n16,745\n \nLess: Reinsurance recoverables\n7\n \n—\n \n19\n \n—\n \n26\n \nBalance, January 1, 2023, net\n11,246\n \n3,431\n \n1,902\n \n140\n \n16,719\n \nIncurred related to:\nCurrent year\n79,747\n \n19,487\n \n19,966\n \n1,480\n \n120,680\n \nPrior years\n(\n1,537\n)\n(\n343\n)\n(\n150\n)\n(\n6\n)\n(\n2,036\n)\nTotal incurred\n78,210\n \n19,144\n \n19,816\n \n1,474\n \n118,644\n \nPaid related to:\nCurrent year\n69,904\n \n16,631\n \n16,823\n \n1,367\n \n104,725\n \nPrior years\n8,743\n \n2,582\n \n1,479\n \n133\n \n12,937\n \nTotal paid\n78,647\n \n19,213\n \n18,302\n \n1,500\n \n117,662\n \nPlus: Premium deficiency reserve\n— \n250\n \n— \n— \n250\n \nBalance, December 31, 2023, net\n10,809\n \n3,612\n \n3,416\n \n114\n \n17,951\n \nPlus: Reinsurance recoverables\n5\n \n—\n \n44\n \n—\n \n49\n \nBalance, December 31, 2023\n$\n10,814\n \n$\n3,612\n \n$\n3,460\n \n$\n114\n \n$\n18,000\n \n87\nTable of Contents\nThe following table summarizes the change in medical claims liability for the year ended December 31, 2022 ($ in millions): \n \nMedicaid\nMedicare\nCommercial\nOther\nConsolidated Total\nBalance, January 1, 2022\n$\n9,845\n \n$\n2,286\n \n$\n2,014\n \n$\n98\n \n$\n14,243\n \nLess: Reinsurance recoverables\n23\n \n—\n \n—\n \n—\n \n23\n \nBalance, January 1, 2022, net\n9,822\n \n2,286\n \n2,014\n \n98\n \n14,220\n \nAcquisitions and divestitures\n—\n \n—\n \n—\n \n105\n \n105\n \nIncurred related to:\nCurrent year\n76,344\n \n19,474\n \n14,296\n \n2,782\n \n112,896\n \nPrior years\n(\n1,046\n)\n(\n102\n)\n(\n204\n)\n(\n15\n)\n(\n1,367\n)\nTotal incurred\n75,298\n \n19,372\n \n14,092\n \n2,767\n \n111,529\n \nPaid related to:\nCurrent year\n66,221\n \n16,275\n \n12,556\n \n2,747\n \n97,799\n \nPrior years\n7,653\n \n1,952\n \n1,648\n \n83\n \n11,336\n \nTotal paid\n73,874\n \n18,227\n \n14,204\n \n2,830\n \n109,135\n \nBalance, December 31, 2022, net\n11,246\n \n3,431\n \n1,902\n \n140\n \n16,719\n \nPlus: Reinsurance recoverables\n7\n \n—\n \n19\n \n—\n \n26\n \nBalance, December 31, 2022\n$\n11,253\n \n$\n3,431\n \n$\n1,921\n \n$\n140\n \n$\n16,745\n \nReinsurance recoverables related to medical claims are included in premium and trade receivables. Changes in estimates of incurred claims for prior years were primarily attributable to reserving under moderately adverse conditions, including residual pandemic impacts. Additionally, as a result of minimum MLR and other return of premium programs, the Company recorded approximately $\n243\n million, $\n382\n million and $\n198\n million of the \"Incurred related to: Prior years\" as a reduction to premium revenues in 2024, 2023 and 2022, respectively. Further, claims processing and coordination of benefits initiatives yielded claim payment recoveries related to dates of service from prior years.\nChanges in medical utilization, claims submission patterns, and cost trends and the effect of population health management initiatives may also contribute to changes in medical claim liability estimates. While the Company has evidence that population health management initiatives are effective on a case by case basis, population health management initiatives primarily focus on events and behaviors prior to the incurrence of the medical event and generation of a claim. Accordingly, any change in behavior, leveling of care or coordination of treatment occurs prior to claim generation and as a result, the costs prior to the population health management initiative are not known by the Company. Additionally, certain population health management initiatives are focused on member and provider education with the intent of influencing behavior to appropriately align the medical services provided with the member's acuity. In these cases, determining whether the population health management initiative changed the behavior cannot be determined. Because of the complexity of its business, the number of states in which it operates and the volume of claims that it processes, the Company is unable to practically quantify the impact of these initiatives on its changes in estimates of IBNR. \nThe Company reviews actual and anticipated experience compared to the assumptions used to establish medical costs. The Company establishes premium deficiency reserves if actual and anticipated experience indicates that existing policy liabilities together with the present value of future gross premiums will not be sufficient to cover the present value of future benefits, settlement and maintenance costs. For purposes of determining premium deficiencies, contracts are grouped in a manner consistent with the method of acquiring, servicing and measuring the profitability of such contracts and expected investment income is excluded. In December 2023, the Company recorded a premium deficiency reserve of $\n250\n million related to the 2024 Medicare Advantage contract year. In December 2024, the Company recorded a premium deficiency reserve of $\n92\n million related to the 2025 Medicare Advantage contract year.\n88\nTable of Contents\nInformation about incurred and paid claims development as of December 31, 2024 is included in the table below. The claims development information for all periods preceding the most recent reporting period is considered required supplementary information.\nConsolidated incurred and paid claims development as of December 31, 2024 is as follows ($ in millions):\nCumulative Incurred Claims and Allocated Claim Adjustment Expenses, Net of Reinsurance\nFor the Year Ended December 31,\nClaim Year\n2022 (unaudited)\n2023 (unaudited)\n2024\n2022\n$\n112,896\n \n$\n110,870\n \n$\n110,394\n \n2023\n120,680\n \n118,709\n \n2024\n128,312\n \nTotal incurred claims\n$\n357,415\n \nCumulative Paid Claims and Allocated Claim Adjustment Expenses, Net of Reinsurance\nFor the Year Ended December 31,\nClaim Year\n2022 (unaudited)\n2023 (unaudited)\n2024\n2022\n$\n97,799\n \n$\n109,680\n \n$\n110,097\n \n2023\n104,725\n \n117,635\n \n2024\n111,456\n \nTotal payment of incurred claims\n339,188\n \nAll outstanding liabilities prior to 2022, net of reinsurance\n174\n \nMedical claims liability, net of reinsurance\n$\n18,401\n \nIncurred and paid claims development for the Medicaid segment as of December 31, 2024 is as follows ($ in millions):\nCumulative Incurred Claims and Allocated Claim Adjustment Expenses, Net of Reinsurance\nFor the Year Ended December 31,\nClaim Year\n2022 (unaudited)\n2023 (unaudited)\n2024\n2022\n$\n76,344\n \n$\n74,861\n \n$\n74,722\n \n2023\n79,747\n \n78,517\n \n2024\n78,885\n \nTotal incurred claims\n$\n232,124\n \nCumulative Paid Claims and Allocated Claim Adjustment Expenses, Net of Reinsurance\nFor the Year Ended December 31,\nClaim Year\n2022 (unaudited)\n2023 (unaudited)\n2024\n2022\n$\n66,220\n \n$\n74,125\n \n$\n74,608\n \n2023\n69,904\n \n77,952\n \n2024\n69,351\n \nTotal payment of incurred claims\n221,911\n \nAll outstanding liabilities prior to 2022, net of reinsurance\n68\n \nMedical claims liability, net of reinsurance\n$\n10,281\n \n89\nTable of Contents\nIncurred and paid claims development for the Medicare segment as of December 31, 2024 is as follows ($ in millions):\nCumulative Incurred Claims and Allocated Claim Adjustment Expenses, Net of Reinsurance\nFor the Year Ended December 31,\nClaim Year\n2022 (unaudited)\n2023 (unaudited)\n2024\n2022\n$\n19,475\n \n$\n19,124\n \n$\n19,027\n \n2023\n19,487\n \n19,008\n \n2024\n21,171\n \nTotal incurred claims\n$\n59,206\n \nCumulative Paid Claims and Allocated Claim Adjustment Expenses, Net of Reinsurance\nFor the Year Ended December 31,\nClaim Year\n2022 (unaudited)\n2023 (unaudited)\n2024\n2022\n$\n16,276\n \n$\n18,818\n \n$\n18,942\n \n2023\n16,631\n \n18,778\n \n2024\n18,036\n \nTotal payment of incurred claims\n55,756\n \nAll outstanding liabilities prior to 2022, net of reinsurance\n66\n \nMedical claims liability, net of reinsurance\n$\n3,516\n \nIncurred and paid claims development for the Commercial segment as of December 31, 2024 is as follows ($ in millions):\nCumulative Incurred Claims and Allocated Claim Adjustment Expenses, Net of Reinsurance\nFor the Year Ended December 31,\nClaim Year\n2022 (unaudited)\n2023 (unaudited)\n2024\n2022\n$\n14,296\n \n$\n14,110\n \n$\n13,870\n \n2023\n19,966\n \n19,698\n \n2024\n26,548\n \nTotal incurred claims\n$\n60,116\n \nCumulative Paid Claims and Allocated Claim Adjustment Expenses, Net of Reinsurance\nFor the Year Ended December 31,\nClaim Year\n2022 (unaudited)\n2023 (unaudited)\n2024\n2022\n$\n12,556\n \n$\n13,963\n \n$\n13,773\n \n2023\n16,823\n \n19,420\n \n2024\n22,547\n \nTotal payment of incurred claims\n55,740\n \nAll outstanding liabilities prior to 2022, net of reinsurance\n40\n \nMedical claims liability, net of reinsurance\n$\n4,416\n \n90\nTable of Contents\nIncurred and paid claims development for the Other segment as of December 31, 2024 is as follows ($ in millions):\nCumulative Incurred Claims and Allocated Claim Adjustment Expenses, Net of Reinsurance\nFor the Year Ended December 31,\nClaim Year\n2022 (unaudited)\n2023 (unaudited)\n2024\n2022\n$\n2,781\n \n$\n2,775\n \n$\n2,775\n \n2023\n1,480\n \n1,486\n \n2024\n1,708\n \nTotal incurred claims\n$\n5,969\n \nCumulative Paid Claims and Allocated Claim Adjustment Expenses, Net of Reinsurance\nFor the Year Ended December 31,\nClaim Year\n2022 (unaudited)\n2023 (unaudited)\n2024\n2022\n$\n2,747\n \n$\n2,774\n \n$\n2,774\n \n2023\n1,367\n \n1,485\n \n2024\n1,522\n \nTotal payment of incurred claims\n5,781\n \nAll outstanding liabilities prior to 2022, net of reinsurance\n—\n \nMedical claims liability, net of reinsurance\n$\n188\n \nIncurred claims and allocated claim adjustment expenses, net of reinsurance, total IBNR plus expected development on reported claims and cumulative claims data as of December 31, 2024 are included in the following table. For claims frequency information summarized below, a claim is defined as the financial settlement of a single medical event in which remuneration was paid to the servicing provider. Total IBNR plus expected development on reported claims represents estimates for claims incurred but not reported, development on reported claims and estimates for the costs necessary to process unpaid claims at the end of each period. The Company estimates its liability using actuarial methods that are commonly used by health insurance actuaries and meet Actuarial Standards of Practice. These actuarial methods consider factors such as historical data for payment patterns, cost trends, product mix, seasonality, utilization of healthcare services and other relevant factors.\nConsolidated information is summarized as follows (in millions):\nDecember 31, 2024\nIncurred Claims and Allocated Claim\nAdjustment Expenses, Net of Reinsurance\nTotal IBNR Plus Expected\nDevelopment on Reported Claims\nCumulative Paid Claims\n2022\n$\n110,394\n \n$\n3\n \n638.0\n \n2023\n118,709\n \n383\n \n623.6\n \n2024\n128,312\n \n12,079\n \n641.3\n \nInformation for the Medicaid segment is summarized as follows (in millions):\nDecember 31, 2024\nIncurred Claims and Allocated Claim\nAdjustment Expenses, Net of Reinsurance\nTotal IBNR Plus Expected\nDevelopment on Reported Claims\nCumulative Paid Claims\n2022\n$\n74,722\n \n$\n3\n \n370.9\n \n2023\n78,517\n \n218\n \n345.6\n \n2024\n78,885\n \n6,968\n \n300.1\n \n91\nTable of Contents\nInformation for the Medicare segment is summarized as follows (in millions):\nDecember 31, 2024\nIncurred Claims and Allocated Claim\nAdjustment Expenses, Net of Reinsurance\nTotal IBNR Plus Expected\nDevelopment on Reported Claims\nCumulative Paid Claims\n2022\n$\n19,027\n \n$\n—\n \n204.8\n \n2023\n19,008\n \n102\n \n200.6\n \n2024\n21,171\n \n1,724\n \n253.0\n \nInformation for the Commercial segment is summarized as follows (in millions):\nDecember 31, 2024\nIncurred Claims and Allocated Claim\nAdjustment Expenses, Net of Reinsurance\nTotal IBNR Plus Expected\nDevelopment on Reported Claims\nCumulative Paid Claims\n2022\n$\n13,870\n \n$\n—\n \n57.5\n \n2023\n19,698\n \n62\n \n72.9\n \n2024\n26,548\n \n3,211\n \n83.0\n \nInformation for the Other segment is summarized as follows (in millions):\nDecember 31, 2024\nIncurred Claims and Allocated Claim\nAdjustment Expenses, Net of Reinsurance\nTotal IBNR Plus Expected\nDevelopment on Reported Claims\nCumulative Paid Claims\n2022\n$\n2,775\n \n$\n—\n \n4.8\n \n2023\n1,486\n \n1\n \n4.5\n \n2024\n1,708\n \n176\n \n5.2\n \n9.\n \nAffordable Care Act\n \nThe ACA established risk spreading premium stabilization programs as well as a minimum annual MLR and CSRs. \nThe Company's net receivables (payables) for each of the programs are as follows ($ in millions): \nDecember 31, 2024\nDecember 31, 2023\nRisk adjustment receivable\n$\n1,434\n \n$\n893\n \nRisk adjustment payable\n(\n1,605\n)\n(\n2,553\n)\nMinimum medical loss ratio\n(\n688\n)\n(\n164\n)\nCost sharing reduction receivable\n305\n \n—\n \nCost sharing reduction payable\n(\n74\n)\n(\n114\n)\nIn July 2024, CMS announced the final risk adjustment transfers for the 2023 benefit year. As a result of the announcement, the risk adjustment net payable was decreased by $\n1,475\n million in the twelve months ended December 31, 2024. After consideration of minimum MLR and other related impacts, which includes the effect to the 2024 benefit year, the net pre-tax benefit recognized was $\n853\n million for the year ended December 31, 2024.\nIn October 2017, the Trump Administration issued an executive order that immediately ceased payments of CSRs to issuers, and beginning in 2018, premium rates for Health Insurance Marketplace were set without factoring in the cost sharing subsidy payments from the federal government. In 2024, the Company reached an agreement with the federal government to retroactively compensate the Company $\n299\n million (gross) for the difference between its actual CSR experience and its pricing assumptions for 2018 through 2020.\n92\nTable of Contents\n10. \nDebt \n \nDebt consists of the following ($ in millions):\n \nDecember 31, 2024\nDecember 31, 2023\n$\n2,500\n million \n4.25\n% Senior Notes, due December 15, 2027\n$\n2,398\n \n$\n2,395\n \n$\n2,300\n million \n2.45\n% Senior Notes, due July 15, 2028\n2,302\n \n2,303\n \n$\n3,500\n million \n4.625\n% Senior Notes, due December 15, 2029\n3,277\n \n3,277\n \n$\n2,000\n million \n3.375\n% Senior Notes, due February 15, 2030\n2,000\n \n2,000\n \n$\n2,200\n million \n3.00\n% Senior Notes, due October 15, 2030\n2,200\n \n2,200\n \n$\n2,200\n million \n2.50\n% Senior Notes, due March 1, 2031\n2,200\n \n2,200\n \n$\n1,300\n million \n2.625\n% Senior Notes, due August 1, 2031\n1,300\n \n1,300\n \nTotal senior notes\n15,677\n \n15,675\n \nTerm Loan Facility\n2,006\n \n2,115\n \nRevolving Credit Agreement\n950\n \n150\n \nFinance leases and other\n—\n \n11\n \nDebt issuance costs\n(\n100\n)\n(\n122\n)\nTotal debt\n18,533\n \n17,829\n \nLess: current portion\n(\n110\n)\n(\n119\n)\n Long-term debt\n$\n18,423\n \n$\n17,710\n \nSenior Notes\nThe indentures governing the senior notes listed in the table above contain restrictive covenants of Centene Corporation. At December 31, 2024, the Company was in compliance with all covenants.\nCircle Health Debt Refinancing\nIn May 2022, the Company refinanced certain debt agreements for its Circle Health subsidiary with a new £\n250\n million credit facility maturing in May 2025. The Company recognized a $\n13\n million pre-tax gain on the extinguishment of the existing debt. As of December 31, 2023, £\n150\n million was drawn on the facility, and was included in accounts payable and accrued expenses in the Consolidated Balance Sheets as a liability held for sale. The facility is guaranteed by the Company and has similar borrowing rates and covenants to the Company's Revolving Credit Agreement, except it uses the Sterling Overnight Index Average (SONIA) as the reference rate for the interest rate payable. In January 2024, the Company completed the divestiture of Circle Health and terminated the credit facility.\nRevolving Credit Facility and Term Loan Credit Facility\nIn May 2023, the Company entered into a first amendment to the Company's Fourth Amended and Restated Credit Agreement. The amendment removed and replaced the interest rate benchmark based on the London Interbank Offered Rate (LIBOR) and related LIBOR-based mechanics applicable to U.S. dollar borrowings under the Amended and Restated Credit Agreement with an interest rate benchmark based on the Secured Overnight Financing Rate (SOFR) (including a customary credit spread adjustment) and related SOFR-based mechanics. Additionally, the amendment removed certain provisions which required the Company to make certain mandatory prepayments of the Term Loan Facility.\n93\nTable of Contents\nThe Company has (i) unsecured $\n2,000\n million multi-currency revolving credit facility (the Revolving Credit Facility), which includes a $\n300\n million sub-limit for letters of credit and a $\n200\n million sub-limit for swingline loans and (ii) a $\n2,200\n million unsecured delayed-draw term loan facility (the Term Loan Facility, and together with the Revolving Credit Facility, the Company Credit Facility). Borrowings under the Revolving Credit Facility bear interest, at the Company's option, at SOFR, SONIA, Euro Interbank Offered Rate (EURIBOR), Swiss Average Rate Overnight (SARON), Tokyo Interbank Offered Rate (TIBOR), Bank Buying Rate (BBR) or base rates plus, in each case, an applicable margin between \n1.50\n% to \n1.125\n%, based on the total debt-to-EBITDA ratio and type of borrowing. Borrowings under the Term Loan Facility bear interest, at the Company's option, at SOFR or base rates plus, in each case, an applicable margin based on the total debt-to-EBITDA ratio. The Company has an uncommitted option to increase its Company Credit Facility by an additional $\n500\n million plus certain additional amounts based on its total debt-to-EBITDA ratio. The Term Loan Facility includes scheduled amortization payments equal to \n0\n% for the first year following closing, \n2.5\n% for the second year following closing and \n5\n% thereafter until maturity.\nThe Company Credit Facility contains financial covenants including maintenance of a minimum fixed charge coverage ratio and a restriction on the Company's maximum total debt-to-EBITDA ratio not to exceed \n4.0\n to 1.0. It also contains certain non-financial covenants including: limitations on incurrence of additional indebtedness; restrictions on incurrence of liens; restrictions on dividends and other restricted payments; restrictions on investments, mergers, consolidations and asset sales; and limitations on transactions with affiliates. As of December 31, 2024, the Company was in compliance with all financial and non-financial covenants under the Company Credit Facility.\nAs of December 31, 2024, the Company had $\n950\n million of borrowings outstanding under the Revolving Credit Facility, with an interest rate of the base rate plus \n0.25\n% margin, and $\n2,006\n million of borrowings outstanding under the Company's Term Loan Facility.\nThe Revolving Credit Facility and the Term Loan Facility will mature on August 16, 2026.\nSenior Note Debt Repurchase Program\nIn June 2022, the Company's Board of Directors authorized a $\n1,000\n million senior note debt repurchase program in preparation for future debt reductions as part of the Company's strategic initiatives. \nNo\n repurchases were made during the year ended December 31, 2024 and 2023. As of December 31, 2024, there was $\n700\n million available under the senior note debt repurchase program.\nLetters of Credit & Surety Bonds\nThe Company had outstanding letters of credit of $\n145\n million as of December 31, 2024, which were not part of the Revolving Credit Facility. The letters of credit bore interest at \n0.7\n% as of December 31, 2024. The Company had outstanding surety bonds of $\n844\n million as of December 31, 2024.\nAggregate maturities for the Company's debt for the years ending December 31, are as follows ($ in millions):\nAggregate Maturities\n2025\n$\n110\n \n2026\n2,848\n \n2027\n2,405\n \n2028\n2,300\n \n2029\n3,277\n \nThereafter\n7,700\n \nTotal\n$\n18,640\n \nThe fair value of outstanding debt was approximately $\n16,929\n million and $\n16,322\n million at December 31, 2024 and 2023, respectively.\n94\nTable of Contents\n11. \nLeases\nThe Company records ROU assets and lease liabilities for non-cancelable operating leases primarily for real estate and equipment. Leases with an initial term of 12 months or less are not recorded on the balance sheet. Expense related to leases is recorded on a straight-line basis over the lease term, including rent holidays. The Company recognized operating lease expense of $\n108\n million and $\n349\n million during the years ended December 31, 2024 and 2023, respectively.\nThe Company considers the existence of options to extend or terminate leases in its analysis of the lease term for the purposes of measuring its ROU assets and lease liabilities. The renewal options are not included in the measurement of the ROU assets and lease liabilities unless the Company is reasonably certain to exercise the optional renewal periods.\nThe following table sets forth the ROU assets and lease liabilities ($ in millions):\n \nDecember 31, 2024\nDecember 31, 2023\nAssets\nROU assets (recorded within other long-term assets)\n$\n359\n \n$\n396\n \nLiabilities\nShort-term (recorded within accounts payable and accrued expenses)\n$\n158\n \n$\n168\n \nLong-term (recorded within other long-term liabilities)\n738\n \n880\n \nTotal lease liabilities\n$\n896\n \n$\n1,048\n \nCash paid for amounts included in the measurement of lease liabilities, recorded as operating cash flows in the Consolidated Statements of Cash Flows, was $\n227\n million and $\n378\n million during the years ended December 31, 2024 and 2023, respectively. New operating leases commenced resulting in the recognition of ROU assets and lease liabilities of $\n69\n million and $\n40\n million during the years ended December 31, 2024 and 2023, respectively. As of December 31, 2024, the Company had additional operating leases that have not yet commenced of $\n8\n million. These operating leases will commence in 2025 with lease terms of approximately \nfive years\n.\nAs part of the real estate optimization initiative as described in Note 6.\n Property, Software and Equipment\n, the Company vacated and abandoned various domestic leased properties. As a result, the Company assessed the ROU assets for impairment. The Company engaged a third-party real estate specialist to determine the recoverability of the leased properties. The valuation primarily considered comparable leased properties in each market and the assessment of potential future rental income that could be generated by the ROU assets.\nAs a result of the real estate optimization initiative, the Company recognized $\n40\n million and $\n577\n million of ROU asset impairments for the years ended December 31, 2023 and 2022, respectively. The remainder of the $\n97\n million and $\n1,627\n million real estate optimization impairment charges for the years ended December 31, 2023 and 2022, respectively, was related to Property, Software and Equipment, refer to Note 6.\n Property, Software and Equipment\n. \nNo\n impairment charges related to this optimization occurred in 2024.\nAs of December 31, 2024, the weighted average remaining lease term for the Company was \n7.5\n years. The lease liabilities as of December 31, 2024, reflect a weighted average discount rate of \n3.4\n%.\n95\nTable of Contents\nLease payments over the next five years and thereafter are as follows ($ in millions):\n \nLease Payments\n2025\n$\n185\n \n2026\n157\n \n2027\n134\n \n2028\n112\n \n2029\n98\n \nThereafter\n334\n \nTotal lease payments\n1,020\n \nLess: imputed interest\n(\n124\n)\nTotal lease liabilities\n$\n896\n \n12. \nStockholders' Equity\n \nThe Company's Board of Directors has authorized a stock repurchase program of the Company's common stock from time to time on the open market or through privately negotiated transactions. In 2023, the Company's Board of Directors authorized an increase under the program of $\n4,000\n million. With these increases, the Company is authorized to repurchase up to $\n10,000\n million, inclusive of past authorizations. As of December 31, 2024, the Company had a remaining amount of $\n2,230\n million available under the Company's stock repurchase program. No duration has been placed on the repurchase program. The Company reserves the right to discontinue the repurchase program at any time.\nShare repurchases in 2024, 2023 and 2022 were primarily funded through divestiture proceeds and free cash flow generated from operations. \nThe following represents the Company's share repurchase activity ($ in millions, shares in thousands):\nYear Ended December 31,\n2024\n2023\n2022\n (2)\nShares\nCost\nShares\nCost\nShares\nCost\nShare buybacks\n41,987\n \n$\n2,999\n \n22,886\n \n$\n1,577\n \n35,655\n \n$\n2,994\n \nIncome tax withholding\n1,494\n \n114\n \n828\n \n56\n \n1,213\n \n102\n \nTotal share repurchases \n(1)\n43,481\n \n$\n3,113\n \n23,714\n \n$\n1,633\n \n36,868\n \n$\n3,096\n \n(1)\nExcludes year-to-date share repurchase excise tax of approximately $\n28\n million and $\n10\n million accrued as of December 31, 2024 and 2023, respectively.\n(2)\nIncludes \n11.6\n million shares delivered as part of an accelerated share repurchase (ASR) agreement with a $\n1,000\n million notional amount. The Company purchased additional shares throughout the year through open market repurchases, including repurchase plans designed to comply with Rule 10b5-1.\nShares repurchased for income tax withholding are shares withheld in connection with employee stock plans to meet applicable tax withholding requirements. These shares are typically included in the Company's treasury stock.\n13. \nStatutory Capital Requirements and Dividend Restrictions\n \nVarious state laws require Centene's regulated subsidiaries to maintain minimum capital levels specified by each state and restrict the amount of dividends that may be paid without prior regulatory approval. At December 31, 2024 and 2023, Centene's subsidiaries had aggregate statutory capital and surplus of $\n20,258\n million and $\n18,117\n million, respectively, compared with the required minimum aggregate statutory capital and surplus of $\n9,083\n million and $\n8,267\n million, respectively. As of December 31, 2024, the amount of capital and surplus or net worth that was unavailable for the payment of dividends or return of capital to the Company was $\n9,083\n million in the aggregate.\n \n96\nTable of Contents\n14. \nIncome Taxes\nThe consolidated income tax expense consists of the following ($ in millions):\nYear Ended December 31,\n \n2024\n2023\n2022\nIncome (loss) from continuing operations before income tax expense (benefit)\nU.S. Federal\n$\n3,529\n \n$\n3,686\n \n$\n1,938\n \nForeign \n(1)\n728\n \n(\n88\n)\n24\n \nTotal\n$\n4,257\n \n$\n3,598\n \n$\n1,962\n \nIncome tax expense (benefit) from continuing operations\nCurrent tax expense\nFederal\n$\n798\n \n$\n833\n \n$\n1,144\n \nState and local\n142\n \n132\n \n261\n \nForeign\n—\n \n1\n \n4\n \nTotal current tax expense\n$\n940\n \n$\n966\n \n$\n1,409\n \nDeferred tax expense (benefit)\nFederal\n$\n8\n \n$\n(\n71\n)\n$\n(\n514\n)\nState and local\n7\n \n33\n \n(\n126\n)\nForeign\n8\n \n(\n29\n)\n(\n9\n)\nTotal deferred tax expense (benefit)\n$\n23\n \n$\n(\n67\n)\n$\n(\n649\n)\nTotal income tax expense (benefit)\nFederal\n$\n806\n \n$\n762\n \n$\n630\n \nState and local\n149\n \n165\n \n135\n \nForeign\n8\n \n(\n28\n)\n(\n5\n)\nTotal income tax expense (benefit)\n$\n963\n \n$\n899\n \n$\n760\n \n(1)\nForeign income from continuing operations includes the Company's Cayman Islands reinsurance entity. The Company has elected for its Cayman Islands entity to be taxed as a U.S. corporation and pays U.S. tax at the 21% tax rate. The U.S. tax resulting from this entity is included in Federal income tax expense. This entity is expected to cease operating in 2025.\n97\nTable of Contents\nThe reconciliation of the tax provision at the U.S. federal statutory rate to income tax expense is as follows ($ in millions):\nYear Ended December 31,\n \n2024\n2023\n2022\nTotal\n%\nTotal\n%\nTotal\n%\nEarnings from continuing operations, before income tax expense\n$\n4,257\n \n$\n3,598\n \n$\n1,962\n \nTax provision at the U.S. federal statutory rate\n894\n \n21.0\n \n%\n756\n \n21.0\n \n%\n412\n \n21.0\n \n%\nFederal\nEffect of cross-border tax laws\nGlobal Intangible Low-Taxed Income (GILTI)\n44\n \n1.0\n \n%\n4\n \n0.1\n \n%\n—\n \n—\n \n%\nCayman Islands\nStatutory income tax rate differential \n(1)\n142\n \n3.3\n \n%\n62\n \n1.7\n \n%\n6\n \n0.3\n \n%\nOther\n2\n \n—\n \n%\n(\n21\n)\n(\n0.6\n)\n%\n(\n1\n)\n(\n0.1\n)\n%\nTax credits\n(\n14\n)\n(\n0.3\n)\n%\n(\n5\n)\n(\n0.1\n)\n%\n(\n8\n)\n(\n0.4\n)\n%\nChanges in valuation allowances\n(\n12\n)\n(\n0.3\n)\n%\n(\n2\n)\n(\n0.1\n)\n%\n(\n11\n)\n(\n0.6\n)\n%\nNontaxable or nondeductible items\nNondeductible compensation\n37\n \n0.9\n \n%\n29\n \n0.8\n \n%\n51\n \n2.6\n \n%\nNondeductible goodwill\n—\n \n—\n \n%\n—\n \n—\n \n%\n56\n \n2.9\n \n%\nNontaxable or nondeductible divestiture (gains) losses\n(\n97\n)\n(\n2.3\n)\n%\n(\n9\n)\n(\n0.3\n)\n%\n79\n \n4.0\n \n%\nOther nontaxable or nondeductible items\n(\n1\n)\n—\n \n%\n(\n6\n)\n(\n0.2\n)\n%\n13\n \n0.7\n \n%\nOther\nDeferred taxes for investments in subsidiaries\n—\n \n—\n \n%\n—\n \n—\n \n%\n70\n \n3.6\n \n%\nExcess tax benefit on stock awards\n(\n3\n)\n(\n0.1\n)\n%\n(\n59\n)\n(\n1.6\n)\n%\n(\n13\n)\n(\n0.7\n)\n%\nOther\n9\n \n0.2\n \n%\n26\n \n0.7\n \n%\n29\n \n1.5\n \n%\nForeign tax effects\nUnited Kingdom\nNondeductible goodwill\n(\n34\n)\n(\n0.8\n)\n%\n83\n \n2.3\n \n%\n—\n \n—\n \n%\nOther\n12\n \n0.3\n \n%\n(\n26\n)\n(\n0.7\n)\n%\n(\n2\n)\n(\n0.1\n)\n%\nCayman Islands\nStatutory income tax rate differential \n(1)\n(\n142\n)\n(\n3.3\n)\n%\n(\n62\n)\n(\n1.7\n)\n%\n(\n6\n)\n(\n0.3\n)\n%\nOther jurisdictions\n7\n \n0.2\n \n%\n(\n16\n)\n(\n0.4\n)\n%\n—\n \n—\n \n%\nChanges in unrecognized tax benefits\n24\n \n0.6\n \n%\n27\n \n0.8\n \n%\n13\n \n0.7\n \n%\nState income taxes, net of federal income tax benefit \n(2)\n95\n \n2.2\n \n%\n118\n \n3.3\n \n%\n72\n \n3.7\n \n%\nIncome tax expense\n$\n963\n \n22.6\n \n%\n$\n899\n \n25.0\n \n%\n$\n760\n \n38.7\n \n%\n(1)\nThe Company has elected for its Cayman Islands reinsurance entity to be taxed as a U.S. corporation and pays U.S. tax at the 21% tax rate. The taxability of this entity does not represent a reconciling item between the U.S. federal rate and the Company's effective tax rate. This entity ceased to operate in 2025.\n(2)\nDuring the year ended December 31, 2024, state taxes in California, Florida and Illinois comprised greater than 50% of the tax effect in this category. During the year ended December 31, 2023, state taxes in California and Florida comprised greater than 50% of the tax effect in this category. During the year ended December 31, 2022, state taxes in California and Pennsylvania comprised greater than 50% of the tax effect in this category.\n98\nTable of Contents\nIncome taxes paid are as follows ($ in millions):\nYear Ended December 31,\n2024\n2023\n2022\nU.S. Federal \n(1)\n$\n930\n \n$\n698\n \n$\n1,009\n \nPennsylvania\n*\n53\n \n*\nOther \n(2)\n71\n \n138\n \n175\n \nTotal U.S. State and Local \n71\n \n191\n \n175\n \nForeign \n1\n(\n2\n)\n14\nTotal income taxes paid, net\n$\n1,002\n \n$\n887\n \n$\n1,198\n \n(1)\nIncludes amounts paid to purchase transferable tax credits of $\n100\n million and $\n49\n million during the years ended December 31, 2024 and 2023, respectively.\n(2)\nIncludes amounts paid to purchase transferable tax credits of $\n15\n million, $\n10\n million and $\n19\n million during the years ended December 31, 2024, 2023 and 2022, respectively.\n*\nThe amount of income taxes paid during the years ended December 31, 2024 and 2022 does not meet the 5% disaggregation threshold. \nThe tax effects of temporary differences which give rise to deferred tax assets and liabilities are presented below ($ in millions):\n \nDecember 31, 2024\nDecember 31, 2023\nDeferred tax assets:\nMedical claims liability\n$\n178\n \n$\n217\n \nNondeductible liabilities\n81\n \n111\n \nNet operating loss and tax credit carryforwards\n70\n \n71\n \nCompensation accruals\n93\n \n113\n \nPremium and trade receivables\n72\n \n94\n \nOperating lease liability\n231\n \n269\n \nUnrealized gain/loss\n153\n \n179\n \nSoftware development costs\n246\n \n193\n \nOther\n92\n \n92\n \nDeferred tax assets\n1,216\n \n1,339\n \nValuation allowance\n(\n77\n)\n(\n82\n)\nNet deferred tax assets\n$\n1,139\n \n$\n1,257\n \nDeferred tax liabilities:\nGoodwill and intangible assets\n$\n1,518\n \n$\n1,603\n \nFixed assets\n135\n \n127\n \nRight-of-use asset\n88\n \n98\n \nOther\n82\n \n70\n \nDeferred tax liabilities\n1,823\n \n1,898\n \nNet deferred tax liabilities\n$\n(\n684\n)\n$\n(\n641\n)\nValuation allowances are provided when it is considered more likely than not that deferred tax assets will not be realized. The valuation allowances primarily relate to future tax benefits on certain federal and state net operating loss, federal and state capital loss and tax credit carryforwards.\nFederal net operating loss and credit carryforwards of $\n11\n million expire beginning in 2025 through 2042. State net operating loss and tax credit carryforwards of $\n42\n million expire beginning in 2025 through 2043, while the remaining $\n16\n million have indefinite carryforward periods.\n99\nTable of Contents\nThe Company maintains a reserve for uncertain tax positions that may be challenged by a tax authority. A rollforward of the beginning and ending amount of uncertain tax positions, exclusive of related interest and penalties, is as follows ($ in millions):\nYear Ended December 31,\n \n2024\n2023\nGross unrecognized tax benefits, January 1\n$\n439\n \n$\n410\n \nGross increases:\nCurrent year tax positions\n16\n \n19\n \nPrior year tax positions\n31\n \n29\n \nGross decreases:\nSettlements \n(1)\n(\n133\n)\n(\n2\n)\nPrior year tax positions\n(\n6\n)\n(\n10\n)\nStatute of limitation lapses\n(\n7\n)\n(\n7\n)\nGross unrecognized tax benefits, December 31\n$\n340\n \n$\n439\n \n(1)\nPrimarily reflects the resolution of an item that had no net impact on the Consolidated Statement of Operations.\nAs of December 31, 2024, $\n213\n million of unrecognized tax benefits would impact the Company's effective tax rate in future periods, if recognized.\nThe table above excludes interest and penalties, net of related tax benefits, which are treated as income tax expense (benefit) under the Company's accounting policy. The Company recognized net interest expense and penalties related to uncertain positions of $\n13\n million and $\n18\n million for the years ended December 31, 2024 and 2023, respectively. The Company had $\n98\n million and $\n84\n million of accrued interest and penalties for uncertain tax positions as of December 31, 2024 and 2023, respectively.\nThe Company files federal tax returns as well as returns for numerous state tax jurisdictions and is engaged in multiple audit proceedings for its state filings. Generally, no further state audit activity is expected for years prior to 2015. As of December 31, 2024, the Company is not under federal examination.\n15. \nStock Incentive Plans\n \nThe Company's stock incentive plans allow for the granting of restricted stock or restricted stock unit awards and options to purchase common stock. Both incentive stock options and nonqualified stock options can be awarded under the plans. However, an immaterial amount of options were granted, exercised or outstanding in 2024. The plans have \n10\n million shares available for future awards. \nCompensation expense for stock options and restricted stock unit awards is recognized on a straight-line basis over the vesting period, generally \nthree\n to \nfive years\n for stock options and \none\n to \nthree years\n for restricted stock or restricted stock unit awards. Vesting is accelerated by \none year\n for individuals who qualify under the Company's retirement eligible provisions. Certain restricted stock unit awards contain performance-based or market-based provisions as well as service-based provisions. The fair value of restricted stock and restricted stock units with only service-based or performance-based provisions is determined using the previous day's market close price at the time of grant. The fair value of restricted stock units with market-based provisions is determined using a Monte Carlo simulation model. The fair value of stock options is determined based on the Black-Scholes option-pricing model. Forfeitures for all stock awards are recognized as they occur. The total compensation cost that has been charged against income for the stock incentive plans was $\n212\n million, $\n216\n million and $\n234\n million for the years ended December 31, 2024, 2023 and 2022, respectively. The total income tax benefit recognized in the Statements of Operations for stock-based compensation arrangements was $\n26\n million, $\n101\n million and $\n48\n million for the years ended December 31, 2024, 2023 and 2022, respectively. \n100\nTable of Contents\nA summary of the Company's non-vested restricted stock and restricted stock unit shares as of December 31, 2024, and changes during the year ended December 31, 2024, is presented below (shares in thousands):\n \nShares\nWeighted Average\nGrant Date Fair Value \nNon-vested balance, December 31, 2023\n7,462\n \n$\n68.96\n \nGranted\n3,741\n \n76.84\n \nVested\n(\n4,196\n)\n69.42\n \nForfeited\n(\n655\n)\n70.88\n \nNon-vested balance, December 31, 2024\n6,352\n \n$\n73.10\n \nThe total fair value of restricted stock and restricted stock units vested during the years ended December 31, 2024, 2023 and 2022, was $\n317\n million, $\n185\n million and $\n298\n million, respectively.\nAs of December 31, 2024, there was $\n223\n million of total unrecognized compensation cost related to non-vested share-based compensation arrangements granted under the plans; that cost is expected to be recognized over a weighted-average period of \n1.9\n years. \nThe Company maintains an employee stock purchase plan and issued \n572\n thousand shares, \n607\n thousand shares and \n449\n thousand shares in 2024, 2023 and 2022, respectively.\n \n16. \nRetirement Plan \n \nCentene has a defined contribution plan which covers substantially all team members who are at least \n21\n years of age. Under the plan, eligible team members may contribute a percentage of their base salary, subject to certain limitations. Centene may elect to match a portion of the employee's contribution. Company expense related to matching contributions to the plan was $\n136\n million, $\n131\n million and $\n133\n million during the years ended December 31, 2024, 2023 and 2022, respectively.\n \n17. \nContingencies \nThe Company is routinely subjected to legal and regulatory proceedings in the normal course of business. These matters can include, without limitation:\n•\nperiodic compliance and other reviews and investigations by various federal and state regulatory agencies with respect to requirements applicable to the Company's business, which could result in litigation, including, without limitation, those related to payment of out-of-network claims, compliance with CMS Medicare and Marketplace regulations, including risk adjustment and broker compensation, compliance with the False Claims Act, the calculation of minimum MLR and rebates related thereto, submissions to state agencies related to payments or state false claims acts, pre-authorization penalties, timely review of grievances and appeals, timely and accurate payment of claims, provider directory accuracy, cybersecurity issues, including those related to the Company's or the Company's third-party vendors' information systems, and the Health Insurance Portability and Accountability Act of 1996 (HIPAA) and other federal and state fraud, waste and abuse laws;\n•\nlitigation arising out of regulatory proceedings and general business activities, such as tax matters, disputes related to healthcare benefits coverage or reimbursement, putative securities class actions, and medical malpractice, privacy, real estate, intellectual property, vendor disputes and employment-related claims; and\n•\ndisputes regarding reinsurance arrangements, claims arising out of the acquisition or divestiture of various assets, class actions, and claims relating to the performance of contractual and non-contractual obligations to providers, members, employer groups, third-party vendors and others, including, but not limited to, the alleged failure to properly pay claims and challenges to the manner in which the Company processes claims, claims related to network adequacy, provider directory accuracy and claims alleging that the Company has engaged in unfair business practices.\nAmong other things, these matters may result in awards of damages, fines, or penalties, which could be substantial, and/or could require changes to the Company's business. The Company intends to vigorously defend itself against legal and regulatory proceedings to which it is currently a party; however, these proceedings are subject to many uncertainties. In some of the cases pending against the Company, substantial non-economic or punitive damages are being sought. \n101\nTable of Contents\nThe Company records reserves and accrues costs for certain legal proceedings and regulatory matters to the extent that it determines an unfavorable outcome is probable and the amount of the loss can be reasonably estimated. While such reserves and accrued costs reflect the Company's best estimate of the probable loss for such matters, the recorded amounts may differ materially from the actual amount of any such losses. In some cases, no estimate of the possible loss or range of loss in excess of amounts accrued, if any, can be made because of the inherently unpredictable nature of legal and regulatory proceedings, which may be exacerbated by various factors, including but not limited to, they may involve indeterminate claims for monetary damages or may involve fines, penalties or punitive damages; present novel legal theories or legal uncertainties; involve disputed facts; represent a shift in regulatory policy; involve a large number of parties, claimants or regulatory bodies; are in the early stages of the proceedings; involve a number of separate proceedings and/or a wide range of potential outcomes; or result in a change of business practices. \nAs of the date of this report, amounts accrued for legal proceedings and regulatory matters were not material. It is possible that in a particular quarter or annual period the Company's financial condition, results of operations, cash flow, and/or liquidity could be materially adversely affected by an ultimate unfavorable resolution of or development in legal and/or regulatory proceedings. The Company believes that the ultimate outcome of any of the regulatory and legal proceedings that are currently pending against it should not have a material adverse effect on financial condition, results of operations, cash flow, or liquidity.\n18. \nEarnings Per Share\nThe following table sets forth the calculation of basic and diluted net earnings per common share ($ in millions, except per share data in dollars and shares in thousands):\nYear Ended December 31,\n \n2024\n2023\n2022\nEarnings attributable to Centene Corporation\n$\n3,305\n \n$\n2,702\n \n$\n1,202\n \nShares used in computing per share amounts:\n \nWeighted average number of common shares outstanding\n521,790\n \n543,319\n \n575,191\n \nCommon stock equivalents (as determined by applying the treasury stock method)\n1,954\n \n2,385\n \n6,849\n \nWeighted average number of common shares and potential dilutive common shares outstanding\n523,744\n \n545,704\n \n582,040\n \n \n \n \nNet earnings per common share attributable to Centene Corporation:\nBasic earnings per common share\n$\n6.33\n \n$\n4.97\n \n$\n2.09\n \nDiluted earnings per common share\n$\n6.31\n \n$\n4.95\n \n$\n2.07\n \nThe calculation of diluted earnings per common share for 2024, 2023 and 2022 excludes the impact of \n278\n thousand shares, \n376\n thousand shares and \n187\n thousand shares, respectively, related to anti-dilutive stock options and restricted stock units.\n102\nTable of Contents\n19. \nSegment Information\nThe Company operates in four segments: (1) a Medicaid segment, (2) a Medicare segment, (3) a Commercial segment and (4) an Other segment. The Medicaid, Medicare and Commercial segments primarily represent the government-sponsored or subsidized programs under which the Company offers managed healthcare services. The Other segment includes the Company's pharmacy operations, Envolve Benefit Options' vision and dental services, clinical healthcare, behavioral health, international operations and corporate management company, among others. The Company's international businesses, Operose Health and Circle Health, which were included in the Other segment, were divested in December 2023 and January 2024, respectively.\nFactors used in determining the reportable business segments include the nature of operating activities, the existence of separate senior management teams and the type of information presented to the Company's chief operating decision-maker (CODM) to evaluate all results of operations. The Company's CODM is its Chief Executive Officer. The Company's CODM focuses primarily on each segment's ability to generate sufficient revenues and manage expenses associated with health benefits and cost of services (including estimated costs incurred). As such, the CODM measures operating performance at the segment level based on gross margin, including evaluation of budget to actual variances, to determine the allocation of financial and capital resources for each segment. The Company does not report total assets by segment since this is not a metric used by the Company's CODM to allocate resources or evaluate segment performance.\nSegment information for the year ended December 31, 2024, is as follows ($ in millions):\n \nMedicaid\nMedicare\nCommercial\nOther/Eliminations\nConsolidated Total\nPremium\n$\n83,758\n \n$\n23,032\n \n$\n33,699\n \n$\n1,814\n \n$\n142,303\n \nService\n93\n \n—\n \n3\n \n3,106\n \n3,202\n \nPremium and service revenues\n83,851\n \n23,032\n \n33,702\n \n4,920\n \n145,505\n \nPremium tax\n17,566\n \n—\n \n—\n \n—\n \n17,566\n \nTotal external revenues\n101,417\n \n23,032\n \n33,702\n \n4,920\n \n163,071\n \nInternal revenues\n—\n \n—\n \n—\n \n16,879\n \n16,879\n \nEliminations\n—\n \n—\n \n—\n \n(\n16,879\n)\n(\n16,879\n)\nTotal revenues\n$\n101,417\n \n$\n23,032\n \n$\n33,702\n \n$\n4,920\n \n$\n163,071\n \nMedical costs\n$\n77,516\n \n$\n20,437\n \n$\n26,039\n \n$\n1,715\n \n$\n125,707\n \nCost of services\n89\n \n—\n \n—\n \n2,640\n \n2,729\n \nOther operating expenses \n(1)\n31,460\n \nOther income (expense) \n(2)\n1,082\n \nEarnings before income tax expense\n$\n4,257\n \nSegment gross margin \n(3)\n$\n6,246\n \n$\n2,595\n \n$\n7,663\n \n$\n565\n \n$\n17,069\n \n(1)\nOther operating expenses include selling, general and administrative expenses, depreciation, amortization, premium tax expense and impairment.\n(2)\nOther income (expense) includes investment and other income, debt extinguishment and interest expense.\n(3)\nSegment gross margin represents premium and service revenues less medical costs and cost of services.\n103\nTable of Contents\nSegment information for the year ended December 31, 2023, is as follows ($ in millions):\n \nMedicaid\nMedicare\nCommercial\nOther/Eliminations\nConsolidated Total\nPremium\n$\n86,853\n \n$\n22,261\n \n$\n24,843\n \n$\n1,679\n \n$\n135,636\n \nService\n2\n \n—\n \n2\n \n4,455\n \n4,459\n \nPremium and service revenues\n86,855\n \n22,261\n \n24,845\n \n6,134\n \n140,095\n \nPremium tax\n13,904\n \n—\n \n—\n \n—\n \n13,904\n \nTotal external revenues\n100,759\n \n22,261\n \n24,845\n \n6,134\n \n153,999\n \nInternal revenues\n—\n \n—\n \n—\n \n16,735\n \n16,735\n \nEliminations\n—\n \n—\n \n—\n \n(\n16,735\n)\n(\n16,735\n)\nTotal revenues\n$\n100,759\n \n$\n22,261\n \n$\n24,845\n \n$\n6,134\n \n$\n153,999\n \nMedical costs\n$\n78,210\n \n$\n19,394\n \n$\n19,816\n \n$\n1,474\n \n$\n118,894\n \nCost of services\n4\n \n—\n \n—\n \n3,560\n \n3,564\n \nOther operating expenses \n(1)\n28,611\n \nOther income (expense) \n(2)\n668\n \nEarnings before income tax expense\n$\n3,598\n \nSegment gross margin \n(3)\n$\n8,641\n \n$\n2,867\n \n$\n5,029\n \n$\n1,100\n \n$\n17,637\n \n(1)\nOther operating expenses include selling, general and administrative expenses, depreciation, amortization, premium tax expense and impairment.\n(2)\nOther income (expense) includes investment and other income, debt extinguishment and interest expense.\n(3)\nSegment gross margin represents premium and service revenues less medical costs and cost of services.\nSegment information for the year ended December 31, 2022, is as follows ($ in millions):\n \nMedicaid\nMedicare\nCommercial\nOther/Eliminations\nConsolidated Total\nPremium\n$\n84,084\n \n$\n22,484\n \n$\n17,377\n \n$\n3,186\n \n$\n127,131\n \nService\n(\n1\n)\n—\n \n3\n \n8,346\n \n8,348\n \nPremium and service revenues\n84,083\n \n22,484\n \n17,380\n \n11,532\n \n135,479\n \nPremium tax\n9,068\n \n—\n \n—\n \n—\n \n9,068\n \nTotal external revenues\n93,151\n \n22,484\n \n17,380\n \n11,532\n \n144,547\n \nInternal revenues\n—\n \n—\n \n—\n \n25,191\n \n25,191\n \nEliminations\n—\n \n—\n \n—\n \n(\n25,191\n)\n(\n25,191\n)\nTotal revenues\n$\n93,151\n \n$\n22,484\n \n$\n17,380\n \n$\n11,532\n \n$\n144,547\n \nMedical costs\n$\n75,298\n \n$\n19,372\n \n$\n14,092\n \n$\n2,767\n \n$\n111,529\n \nCost of services\n—\n \n—\n \n—\n \n7,032\n \n7,032\n \nOther operating expenses \n(1)\n24,668\n \nOther income (expense) \n(2)\n644\n \nEarnings before income tax expense\n$\n1,962\n \nSegment gross margin \n(3)\n$\n8,785\n \n$\n3,112\n \n$\n3,288\n \n$\n1,733\n \n$\n16,918\n \n(1)\nOther operating expenses include selling, general and administrative expenses, depreciation, amortization, premium tax expense and impairment.\n(2)\nOther income (expense) includes investment and other income, debt extinguishment and interest expense.\n(3)\nSegment gross margin represents premium and service revenues less medical costs and cost of services.\n104\nTable of Contents\n20. \nCondensed Financial Information of Registrant\nCentene Corporation (Parent Company Only)\nCondensed Balance Sheets\n(In millions, except shares in thousands and per share data in dollars)\n \nDecember 31, 2024\nDecember 31, 2023\nASSETS\n \n \nCurrent assets:\n \n \nCash and cash equivalents\n$\n7\n \n$\n7\n \nOther current assets\n9\n \n7\n \nTotal current assets\n16\n \n14\n \nLong-term investments\n206\n \n264\n \nInvestment in subsidiaries\n45,148\n \n43,853\n \nOther long-term assets\n85\n \n186\n \nTotal assets\n$\n45,455\n \n$\n44,317\n \nLIABILITIES, REDEEMABLE NONCONTROLLING INTERESTS AND STOCKHOLDERS' EQUITY\n \n \nCurrent liabilities:\nCurrent liabilities\n$\n243\n \n$\n417\n \nCurrent portion of long-term debt\n110\n \n110\n \nTotal current liabilities\n353\n \n527\n \nLong-term debt\n18,423\n \n17,708\n \nOther long-term liabilities\n169\n \n126\n \nTotal liabilities\n18,945\n \n18,361\n \nCommitments and contingencies\nRedeemable noncontrolling interest\n10\n \n19\n \nStockholders' equity:\n \n \nPreferred stock, $\n0.001\n par value; authorized \n10,000\n shares; \nno\n shares issued or outstanding at December 31, 2024 and December 31, 2023\n—\n \n—\n \nCommon stock, $\n0.001\n par value; authorized \n800,000\n shares; \n620,195\n issued and \n495,907\n outstanding at December 31, 2024, and \n615,291\n issued and \n534,484\n outstanding at December 31, 2023\n1\n \n1\n \nAdditional paid-in capital\n20,562\n \n20,304\n \nAccumulated other comprehensive (loss)\n(\n504\n)\n(\n652\n)\nRetained earnings\n15,348\n \n12,043\n \nTreasury stock, at cost (\n124,288\n and \n80,807\n shares, respectively)\n(\n8,997\n)\n(\n5,856\n)\nTotal Centene stockholders' equity\n26,410\n \n25,840\n \nNonredeemable noncontrolling interest\n90\n \n97\n \nTotal stockholders' equity\n26,500\n \n25,937\n \nTotal liabilities, redeemable noncontrolling interests and stockholders' equity\n$\n45,455\n \n$\n44,317\n \nSee notes to condensed financial information of registrant.\n105\nTable of Contents\nCentene Corporation (Parent Company Only)\nCondensed Statements of Operations\n(In millions, except per share data in dollars)\nYear Ended December 31,\n \n2024\n2023\n2022\nExpenses:\n \n \n \nSelling, general and administrative expenses\n$\n13\n \n$\n14\n \n$\n21\n \nLegal settlement\n—\n \n—\n \n33\n \nOther income (expense):\n \n \n \nInvestment and other income\n(\n34\n)\n(\n47\n)\n55\n \nGain (loss) on divestiture\n(\n34\n)\n108\n \n13\n \nDebt extinguishment \n—\n \n—\n \n14\n \nInterest expense\n(\n700\n)\n(\n710\n)\n(\n643\n)\n(Loss) before income taxes\n(\n781\n)\n(\n663\n)\n(\n615\n)\nIncome tax (benefit)\n(\n76\n)\n(\n118\n)\n(\n208\n)\nNet (loss) before equity in subsidiaries\n(\n705\n)\n(\n545\n)\n(\n407\n)\nEquity in earnings from subsidiaries\n3,999\n \n3,244\n \n1,609\n \nNet earnings\n3,294\n \n2,699\n \n1,202\n \nLoss attributable to noncontrolling interests\n11\n \n3\n \n—\n \nNet earnings attributable to Centene Corporation\n$\n3,305\n \n$\n2,702\n \n$\n1,202\n \nNet earnings per common share attributable to Centene Corporation:\n \n \n \nBasic earnings per common share\n$\n6.33\n \n$\n4.97\n \n$\n2.09\n \nDiluted earnings per common share\n$\n6.31\n \n$\n4.95\n \n$\n2.07\n \nSee notes to condensed financial information of registrant.\n \n106\nTable of Contents\nCentene Corporation (Parent Company Only)\nCondensed Statements of Cash Flows\n(In millions)\n \nYear Ended December 31,\n \n2024\n2023\n2022\nCash flows from operating activities:\n \n \n \nDividends from subsidiaries, return on investment\n$\n1,797\n \n$\n2,823\n \n$\n1,706\n \nPayments for legal settlement\n(\n263\n)\n(\n326\n)\n(\n282\n)\nOther operating activities, net\n(\n422\n)\n(\n334\n)\n(\n450\n)\nNet cash provided by operating activities\n1,112\n \n2,163\n \n974\n \nCash flows from investing activities:\n \n \n \nCapital contributions to subsidiaries\n(\n730\n)\n(\n443\n)\n(\n880\n)\nPurchases of investments\n(\n2\n)\n(\n202\n)\n(\n2\n)\nDividends from subsidiaries, return of investment\n321\n \n85\n \n10\n \nInvestments in acquisitions\n—\n \n—\n \n(\n2,431\n)\nProceeds from divestitures\n—\n \n325\n \n—\n \nIntercompany activities\n1,693\n \n(\n357\n)\n5,785\n \nOther investing activities, net\n—\n \n—\n \n3\n \nNet cash (used in) provided by investing activities\n1,282\n \n(\n592\n)\n2,485\n \nCash flows from financing activities:\n \n \n \nProceeds from common stock issuances\n46\n \n44\n \n70\n \nProceeds from long-term debt\n1,300\n \n2,305\n \n75\n \nPayments and repurchases of long-term debt\n(\n610\n)\n(\n2,290\n)\n(\n491\n)\nCommon stock repurchases\n(\n3,124\n)\n(\n1,633\n)\n(\n3,096\n)\nPayments for debt extinguishment\n—\n \n—\n \n(\n14\n)\nOther financing activities, net\n(\n6\n)\n(\n2\n)\n—\n \nNet cash used in financing activities\n(\n2,394\n)\n(\n1,576\n)\n(\n3,456\n)\nNet increase (decrease) in cash and cash equivalents\n—\n \n(\n5\n)\n3\n \nCash and cash equivalents,\n beginning of period\n7\n \n12\n \n9\n \nCash and cash equivalents,\n end of period\n$\n7\n \n$\n7\n \n$\n12\n \n \nSee notes to condensed financial information of registrant.\n107\nTable of Contents\nNotes to Condensed Financial Information of Registrant\nNote A - Basis of Presentation and Significant Accounting Policies\nThe parent company only financial statements should be read in conjunction with Centene Corporation's audited consolidated financial statements and the notes to consolidated financial statements included in this Form 10-K.\n    \nThe parent company's investment in subsidiaries is stated at cost plus equity in undistributed earnings of the subsidiaries. The parent company's share of net income of its unconsolidated subsidiaries is included in income using the equity method of accounting. Certain unrestricted subsidiaries receive monthly management fees from the Company's restricted subsidiaries. The management and service fees received by its unrestricted subsidiaries are associated with all of the functions required to manage the restricted subsidiaries including, but not limited to, salaries and wages for personnel, rent, utilities, population health management, provider contracting, compliance, member services, claims processing, information technology, cash management, finance and accounting and other services. Beginning in 2023, the management fees are based on a cost basis reimbursement.\nDue to the Company's centralized cash management function, cash flows generated by its unrestricted subsidiaries are utilized by the parent company to the extent required, primarily to repay borrowings on the parent company's credit facilities, repurchase the parent company's common stock, make acquisitions, fund capital contributions to subsidiaries and fund its operations.\nCertain amounts presented in the parent company only financial statements are eliminated in the consolidated financial statements of Centene Corporation.\nItem 9. \nChanges in and Disagreements With Accountants on Accounting and Financial Disclosure\n \n \nNone.\nItem 9A. \nControls and Procedures\nEvaluation of Disclosure Controls and Procedures\n -\n \nOur management, with the participation of our Chief Executive Officer and Chief Financial Officer, evaluated the effectiveness of our disclosure controls and procedures as of December 31, 2024. The term \"disclosure controls and procedures,\" as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act, means controls and other procedures of a company that are designed to ensure that information required to be disclosed by a company in the reports that it files or submits under the Exchange Act is recorded, processed, summarized and reported, within the time periods specified in the SEC's rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by a company in the reports that it files or submits under the Exchange Act is accumulated and communicated to the company's management, including its principal executive and principal financial officers, as appropriate to allow timely decisions regarding required disclosure. Management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving their objectives and management necessarily applies its judgment in evaluating the cost-benefit relationship of possible controls and procedures. Based on the evaluation of our disclosure controls and procedures as of December 31, 2024, our Chief Executive Officer and Chief Financial Officer concluded that, as of such date, our disclosure controls and procedures were effective.\nManagement's Report on Internal Control Over Financial Reporting \n- Our management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rules 13a-15(f) and 15d-15(f). Under the supervision and with the participation of our management, including our principal executive officer and principal financial officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework in\n Internal\n \nControl - Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on our evaluation under the framework in \nInternal Control - Integrated Framework (2013)\n, our management concluded that our internal control over financial reporting was effective at the reasonable assurance level as of December 31, 2024. Our management's assessment of the effectiveness of our internal control over financial reporting as of December 31, 2024, has been audited by KPMG LLP, an independent registered public accounting firm, as stated in their report which is included herein.\nChanges in Internal Control Over Financial Reporting \n- No change in our internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) occurred during the year ended December 31, 2024 that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.\n108\nTable of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors\nCentene Corporation:\nOpinion on Internal Control Over Financial Reporting\nWe have audited Centene Corporation and subsidiaries' (the Company) internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control - Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission. In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control - Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission. \nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of December 31, 2024 and 2023, the related consolidated statements of operations, comprehensive earnings (loss), stockholders' equity, and cash flows for each of the years in the three-year period ended December 31, 2024, and the related notes (collectively, the consolidated financial statements), and our report dated February 18, 2025 expressed an unqualified opinion on those consolidated financial statements.\nBasis for Opinion \nThe Company's management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management's Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Company's internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audit also included performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting \nA company's internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company's internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company's assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ KPMG LLP\nSt. Louis, Missouri\nFebruary 18, 2025 \n109\nTable of Contents\nItem 9B. \nOther Information\n \n(a)   None.\n(b)  During the three months ended December 31, 2024, no director or officer of the Company \nadopted\n or \nterminated\n a \"Rule 10b5-1 trading arrangement\" or \"non-Rule 10b5-1 trading arrangement,\" as each term is defined in Item 408(a) of Regulation S-K.\nItem 9C. \nDisclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable\nPART III \nItem 10. \nDirectors, Executive Officers and Corporate Governance\n \n(a) Directors of the Registrant \n \nInformation concerning our directors will appear in our Proxy Statement for our 2025 annual meeting of stockholders under \"Proposal One: Election of Directors.\" This portion of the Proxy Statement is incorporated herein by reference.\n \n(b) Information about our Executive Officers\n \nPursuant to General Instruction G(3) to Form 10-K and the Instruction to Item 401 of Regulation S-K, information regarding our executive officers is provided in Item 1 of Part I of this Annual Report on Form 10-K under the caption \"Information about our Executive Officers.\"\nInformation concerning our executive officers' compliance with Section 16(a) of the Exchange Act will appear in our Proxy Statement for our 2025 annual meeting of stockholders under \"Delinquent Section 16(a) Reports,\" if applicable.\n(c) Corporate Governance \nInformation concerning certain corporate governance matters, including information concerning our audit committee financial expert and identification of our Audit and Compliance Committee, and our code of ethics will appear in our Proxy Statement for our 2025 annual meeting of stockholders under \"Corporate Governance.\" These portions of our Proxy Statement are incorporated herein by reference. \n(d) Insider Trading Policies and Procedures\nThe Company has adopted the Policy on Inside Information and Insider Trading attached as Exhibit 19.1 hereto, which governs the purchase, sale, and/or other dispositions of the Company's securities by directors, officers and employees, and by the Company itself, and is reasonably designed to promote compliance with insider trading laws, rules and regulations, and the NYSE listing standards. \nItem 11. \nExecutive Compensation\n \n \nInformation concerning executive compensation will appear in our Proxy Statement for our 2025 Annual Meeting of Stockholders under \"Executive Compensation.\" Information concerning Compensation and Talent Committee interlocks and insider participation will appear in the Proxy Statement for our 2025 Annual Meeting of Stockholders under \"Compensation & Talent Committee Interlocks and Insider Participation.\" These portions of the Proxy Statement are incorporated herein by reference. \nItem 12. \nSecurity Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\n \n \nInformation concerning the security ownership of certain beneficial owners and management and our equity compensation plans will appear in our Proxy Statement for our 2025 annual meeting of stockholders under \"Security Ownership of Certain Beneficial Owners and Management\" and \"Equity Compensation Plan Information.\" These portions of the Proxy Statement are incorporated herein by reference. \n110\nTable of Contents\nItem 13. \nCertain Relationships and Related Transactions\n, \nand Director Independence\n \nInformation concerning director independence, certain relationships and related transactions will appear in our Proxy Statement for our 2025 annual meeting of stockholders under \"Corporate Governance,\" \"Independence of Directors\" and \"Related Party Transactions.\" These portions of our Proxy Statement are incorporated herein by reference.\nItem 14. \nPrincipal Accountant Fees and Services\n \nOur independent registered public accounting firm is \nKPMG LLP\n, \nSt. Louis, MO\n. The Auditor Firm ID is \n185\n.\n \nInformation concerning principal accountant fees and services will appear in our Proxy Statement for our 2025 annual meeting of stockholders under \"Proposal Three: Ratification of Appointment of Independent Registered Public Accounting Firm.\" This portion of our Proxy Statement is incorporated herein by reference. \n111\nTable of Contents\nPART IV\n \nItem 15. \nExhibits and Financial Statement Schedules \n \n(a)\nFinancial Statements and Schedules\nThe following documents are filed under Item 8 of this report: \n1.    Financial Statements:\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as of December 31, 2024 and 2023 \nConsolidated Statements of Operations for the years ended December 31, 2024, 2023 and 2022 \nConsolidated Statements of Comprehensive Earnings (Loss) for the years ended December 31, 2024, 2023 and 2022\nConsolidated Statements of Stockholders' Equity for the years ended December 31, 2024, 2023 and 2022 \nConsolidated Statements of Cash Flows for the years ended December 31, 2024, 2023 and 2022 \nNotes to Consolidated Financial Statements\n2.    Financial Statement Schedules:\n    \nNone.\n3.    The exhibits listed in the accompanying Exhibit Index are filed or incorporated by reference as part of this filing.\n112\nTable of Contents\nEXHIBIT INDEX\n \n \n \nINCORPORATED BY REFERENCE\nEXHIBIT NUMBER\n \nDESCRIPTION \nFILED WITH \nTHIS FORM\n10-K\nFORM\n \nFILING DATE WITH SEC\nEXHIBIT NUMBER\n3.1\nAmended and Restated Certificate of Incorporation of Centene Corporation, dated September 27, 2022\n8-K\nSeptember 30, 2022\n3.1\n3.2\nAmended and Restated By-laws of Centene Corporation, dated December 8, 2023\n8-K\nDecember 13, 2023\n3.1\n4.1\nDescription of Securities of the Company\nS-3ASR\nFebruary 21, 2024\n4.2\nIndenture, dated as of December 6, 2019, by and between Centene Corporation, as issuer, and The Bank of New York Mellon Trust Company, N.A., as trustee, relating to the Company's 4.25% Senior Notes due 2027 (including the Form of Global Note attached thereto)\n8-K\nDecember 6, 2019\n4.2\n4.3\nIndenture, dated as of December 6, 2019, by and between Centene Corporation, as issuer, and The Bank of New York Mellon Trust Company, N.A., as trustee, relating to the Company's 4.625% Senior Notes due 2029 (including the Form of Global Note attached thereto)\n8-K\nDecember 6, 2019\n4.3\n4.4\nIndenture, dated as of February 13, 2020, by and between Centene Corporation, as issuer, and The Bank of New York Mellon Trust Company, N.A., as trustee, relating to the Company's 3.375% Senior Notes due 2030 (including the Form of Global Note attached thereto)\n8-K\nFebruary 13, 2020\n4.1\n4.5\nBase Indenture, dated as of October 7, 2020, between the Company and The Bank of New York Mellon Trust Company, N.A., as trustee\n8-K\nOctober 7, 2020\n4.1\n4.6\nFirst Supplemental Indenture, dated as of October 7, 2020, between the Company and The Bank of New York Mellon Trust Company, N.A., as trustee\n8-K\nOctober 7, 2020\n4.2\n4.7\nSecond Supplemental Indenture, dated as of February 17, 2021, between the Company and The Bank of New York Mellon Trust Company, N.A., as trustee\n8-K\nFebruary 17, 2021\n4.2\n4.8\nThird Supplemental Indenture, dated as of July 1, 2021, between the Company and The Bank of New York Mellon Trust Company, N.A., as trustee\n8-K\nJuly 1, 2021\n4.2\n4.9\nFourth Supplemental Indenture, dated as of August 12, 2021, between the Company and The Bank of New York Mellon Trust Company, N.A., as trustee\n8-K\nAugust 12, 2021\n4.4\n10.1\n*\n2002 Employee Stock Purchase Plan, As Amended and Restated\n10-Q\nJuly 23, 2019\n10.1\n10.2\n*\nAmendment No.1 to the 2002 Employee Stock Purchase Plan, As Amended and Restated\nS-8\nMay 22, 2020\n4.2\n10.3\n*\nCentene Corporation 2012 Stock Incentive Plan, as amended\n8-K\nApril 30, 2021\n10.1\n10.4\n*\nAmended and Restated Non-Employee Directors Deferred Stock Compensation Plan\n10-Q\nJuly 26, 2024\n10.1\n10.5\n*\nAmended and Restated Voluntary Nonqualified Deferred Compensation Plan\n10-K\nFebruary 20, 2024\n10.5\n10.6\n*\nCentene Corporation 2007 Long-Term Incentive Plan, as Amended\n10-K\nFebruary 22, 2021\n10.6\n10.7\n*\nCentene Corporation Short-Term Executive Compensation Plan\n10-K\nFebruary 22, 2011\n10.12\n113\nTable of Contents\n10.8\n*\nExecutive Severance and Change in Control Plan\n10-Q\nOctober 25, 2024\n10.1\n10.9\n*\nForm of Non-Employee Director Compensation Policy\nX\n10.10\n*\nForm of Non-Employee Director Restricted Stock Unit Agreement #1\n10-Q\nJuly 26, 2024\n10.2\n10.11\n*\nForm of Non-statutory Stock Option Agreement (Employees) #1\n10-K\nFebruary 22, 2021\n10.11\n10.12\n*\nForm of Non-statutory Stock Option Agreement (Employees) #2\n10-K\nFebruary 22, 2022\n10.12\n10.13\n*\nForm of Non-statutory Stock Option Agreement (Directors)\n10-K\nFebruary 21, 2023\n10.13\n10.14\n*\nForm of Restricted Stock Agreement (Directors) #1\n10-K\nFebruary 21, 2023\n10.14\n10.15\n*\nForm of Restricted Stock Agreement (Directors) #2\n10-Q\nJuly 28, 2023\n10.1\n10.16\n*\nForm of Restricted Stock Unit Agreement #1\n10-Q\nApril 26, 2024\n10.1\n10.17\n*\nForm of Restricted Stock Unit Agreement #2\n8-K\nDecember 21, 2020\n10.1\n10.18\n*\nForm of Restricted Stock Unit Agreement #3\n10-Q\nApril 25, 2023\n10.1\n10.19\n*\nForm of Restricted Stock Unit Agreement #4\n10-Q\nApril 25, 2023\n10.2\n10.20\n*\nForm of Performance Based Restricted Stock Unit Agreement #1\n10-Q\nApril 26, 2024\n10.2\n10.21\n*\nForm of Performance Based Restricted Stock Unit Agreement #2\n8-K\nDecember 21, 2020\n10.2\n10.22\n*\nForm of Performance Based Restricted Stock Unit Agreement #3\n10-Q\nApril 25, 2023\n10.3\n10.23\n*\nForm of Long-Term Incentive Plan Agreement\n8-K\nDecember 21, 2020\n10.3\n10.24\nFourth Amended and Restated Credit Agreement, dated as of August 16, 2021, among the Company, Wells Fargo Bank, National Association, as administrative agent, and the lenders and other parties thereto \n8-K\nAugust 18, 2021\n1.1\n10.24a\nFirst Amendment to the Fourth Amended and Restated Credit Agreement, dated as of May 31, 2023, by and among Centene Corporation, the several banks and other financial institutions party thereto, and Wells Fargo Bank, National Association, as the administrative agent.\n8-K\nJune 6, 2023\n10.1\n10.25\n*\nExecutive Employment Agreement between Centene Corporation and Sarah M. London, dated April 27, 2022\n10-Q\nJuly 26, 2022\n10.1\n10.25a\n*\nAmendment of Executive Employment Agreement between Centene Corporation and Sarah M. London, dated February 20, 2023\n10-K\nFebruary 21, 2023\n10.22a\n10.26\n*\nExecutive Employment Agreement between Centene Corporation and Andrew Asher, dated April 28, 2022\n10-Q\nJuly 26, 2022\n10.3\n10.26a\n*\nAmendment of Executive Employment Agreement between Centene Corporation and Andrew Asher, dated February 20, 2023\n10-K\nFebruary 21, 2023\n10.23a\n10.27\n*\nExecutive Employment Agreement between Centene Corporation and Kenneth Fasola, dated February 20, 2023\n10-K\nFebruary 21, 2023\n10.24\n10.28\n*\nExecutive Employment Agreement between Centene Corporation and James E. Murray, dated February 20, 2023\n10-K\nFebruary 21, 2023\n10.25\n10.29\n*\nTransition Services Agreement between Centene Corporation and Kenneth Burdick, dated February 21, 2020\n10-K\nFebruary 22, 2021\n10.25\n114\nTable of Contents\n10.30\n*\nExecutive Officer Cash Severance Policy\n10-K\nFebruary 21, 2023\n10.31\n10.31\n*\nExecutive Restricted Covenant Agreement \n10-K\nFebruary 20, 2024\n10.31\n19.1\nPolicy on Inside Information and Insider Trading\nX\n21\nList of subsidiaries\nX\n23\nConsent of Independent Registered Public Accounting Firm incorporated by reference in each prospectus constituting part of the Registration Statements on Form S-8 (File Numbers 333-261993, 333-255735, 333-238597, 333-236036, 333-217634, 333-210376, 333-197737, 333-180976, and 333-90976) and Form S-3 (File Number 333-277218)\nX\n31.1\nCertification Pursuant to Rule 13a-14(a) and 15d-14(a) of the Exchange Act, as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (Chief Executive Officer)\nX\n31.2\nCertification Pursuant to Rule 13a-14(a) and 15d-14(a) of the Exchange Act, as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (Chief Financial Officer)\nX\n32.1\n#\nCertification Pursuant to 18 U.S.C. Section 1350 (Chief Executive Officer)\nX\n32.2\n#\nCertification Pursuant to 18 U.S.C. Section 1350 (Chief Financial Officer)\nX\n97\n*\nCentene Corporation Clawback Policy\n10-K\nFebruary 20, 2024\n97\n101\nThe following materials from the Centene Corporation Annual Report on Form 10-K for the fiscal year ended December 31, 2024, formatted in Inline Extensible Business Reporting Language (iXBRL): (i) the Consolidated Balance Sheets, (ii) the Consolidated Statements of Operations, (iii) the Consolidated Statements of Comprehensive Earnings (Loss), (iv) the Consolidated Statements of Stockholders' Equity, (v) the Consolidated Statements of Cash Flows and (vi) related notes.\nX\n104\nCover Page Interactive Data File (embedded within the Inline XBRL document)\nX\n* Indicates a management contract or compensatory plan or arrangement.\n# This certification is deemed not filed for purposes of Section 18 of the Exchange Act, or otherwise subject to the liability of that section, nor shall it be deemed incorporated by reference into any filing under the Securities Act of 1933, as amended, or the Exchange Act.\n115\nTable of Contents\nItem 16. \nForm 10-K Summary\n \nNone.\n116\nTable of Contents\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized, as of February 18, 2025. \n \nCENTENE CORPORATION\nBy:\n/s/ SARAH M. LONDON\n \nSarah M. London\nChief Executive Officer\n \nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities as indicated, as of February 18, 2025. \n \nSignature\n \nTitle\n \n/s/ Sarah M. London\nChief Executive Officer\n(principal executive officer)\nSarah M. London\n/s/ Andrew L. Asher\nExecutive Vice President, Chief Financial Officer \n(principal financial officer)\nAndrew L. Asher\n/s/ Katie N. Casso\nSenior Vice President, Finance, Corporate Controller and Chief Accounting Officer \n(principal accounting officer)\nKatie N. Casso\n/s/ Jessica L. Blume\nDirector\nJessica L. Blume\n/s/ Kenneth A. Burdick\nDirector\nKenneth A. Burdick\n/s/ Christopher J. Coughlin\nDirector\nChristopher J. Coughlin\n/s/ H. James Dallas\nDirector\nH. James Dallas\n/s/ Wayne S. DeVeydt\nDirector\nWayne S. DeVeydt\n/s/ Fred H. Eppinger\nDirector\nFred H. Eppinger\n/s/ Monte E. Ford\nDirector\nMonte E. Ford\n/s/ Thomas R. Greco\nDirector\nThomas R. Greco\n/s/ Lori J. Robinson\nDirector\nLori J. Robinson\n/s/ Theodore R. Samuels\nDirector\nTheodore R. Samuels\n117"
  }
}