{
  "ticker": "COIN",
  "cik": "0001679788",
  "company_name": "Coinbase Global, Inc.",
  "filing_date": "2025-02-13",
  "accession": "0001679788-25-000022",
  "primary_doc": "coin-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1.\n \nBUSINESS \nCoinbase Overview\nOur mission is to increase ec\nonomic freedom in the world.\nWe are working to update the century-old financial system by providing a trusted platform that makes it easy for our customers to engage with crypto assets. We also provide critical infrastructure for the onchain economy and support builders who share our vision of bringing the world onchain. Onchain activities are interactions with the blockchain that take place in a broad category of blockchain-powered technologies, including self-custody wallets, decentralized apps and services, and open community engagement platforms. Together with the crypto community, we advocate for responsible rules to make the benefits of crypto available around the world.\nWe differentiate ourselves from our competition with:\n•\nTrust\n:\n \nWe are deeply invested in building the most secure and compliant platform. We hold customer assets one-to-one at all times. We do not act on customer assets, including staking, lending, rehypothecating, or engaging in fractional reserve banking, without customer consent. \n•\nEase of use\n:\n We strive to build products that are easy to use and that our customers love. We obsess over quality and craft in our products. We strive to make buying, storing, and using crypto easy.\nOur Business\nWe offer products and services to three customer groups:\n•\nConsumers\n:\n Retail customers seeking to invest in or trade crypto assets and engage onchain. \n•\nInstitutions\n:\n Businesses that include market makers, asset managers, hedge funds, banks, wealth platforms, registered investment advisors, payment platforms, and public and private corporations. \n•\nDevelopers\n:\n Entrepreneurs, creators, merchants, crypto asset issuers, organizations and financial institutions, and other groups building decentralized protocols, applications, products, or other services onchain. \nOur platform serves as a trusted and compliant on-ramp to the onchain economy and enables our users to engage in a wide variety of activities with their crypto assets in both our own proprietary and third-party product experiences enabled by access to decentralized applications. Our business consists of \n7\nTable of Contents\nproducts that we monetize through transaction fees, such as our consumer trading product suite, as well as subscription products and services, such as our stablecoin products. We describe these products below. Throughout this Annual Report on Form 10-K, we will refer to our full suite of products and offerings as our platform or platforms.\nTransaction products\nConsumer trading\nOur platform is designed to serve a wide variety of consumers, whether they are buying their first crypto asset or are advanced traders. We offer two trading experiences: \n•\nSimple trade\n: Our simple trading experience offers customers the ability to buy, sell, and convert crypto assets using the basic interface of our platform, and includes value-added services such as fixed price quotes and recurring trades. Simple trading focuses on consumers of all experience levels who are prioritizing  ease of use.\n•\nAdvanced trade\n: Our advanced trading experience offers traders access to spot and derivatives order books, real-time market information through interactive charts, a live trade history on the advanced trade view, and other trading tools. Advanced trading focuses on sophisticated traders who are prioritizing a robust set of features to meet their more complex needs and higher volume.\nWe generate fees from consumers trading on our platform, including through volume-based transaction fees and a spread depending on the type of trade. Simple trading and advanced trading fees differ due to both the typical nature of the transactions and unique benefits of each offering. Generally, simple trading fees are higher than those on advanced trading because advanced traders typically trade at higher volumes than simple traders. \nPrime Trading\nCoinbase Prime is our full-service prime brokerage platform, where our institutional customers can access deep pools of liquidity across a network of trading venues. We offer volume-based pricing and charge a transaction fee for executed trades. \nMarkets\nWe provide market infrastructure in the form of trading venues for customers to trade spot and derivatives. We currently provide access to three trading venues: the Coinbase Exchange, the Coinbase International Exchange, and the Coinbase Derivatives Exchange. These markets generate revenue by charging a transaction fee for executed trades. \nBase Protocol\nBase is an L2 Ethereum blockchain offering fast, cheap, global onchain transactions. In 2024, Base reduced median transaction fees by more than 90% to enable sub-one cent median transactions. Base’s goal is to bring one million developers and one billion users onchain to build a global economy. Base aspires to be the best place to build applications, create content, and earn money onchain. Coinbase generates revenue from sequencer fees paid each time a transaction is processed on the Base blockchain.\nCoinbase Wallet \nCoinbase Wallet is a self-custodial wallet software product, which we offer globally. Coinbase Wallet enables users to engage and transact with the full universe of Dapps and actively engage in the onchain economy without the need for a centralized intermediary. Customers can also link their Coinbase account to their Coinbase Wallet to more easily transfer assets between the two. In 2024, Coinbase launched “smart wallet,” which is an improved self-custody technology that enables instant onboarding with no separate app or extension, and no need to memorize a seed phrase. Coinbase Wallet now includes smart \n8\nTable of Contents\nwallet compatibility. A benefit of Coinbase Wallet is that consumers have sole control over their private keys and/or seed phrase, which are stored directly on their mobile devices or personal storage accounts and not with a centralized entity. Because the private key is unilaterally controlled by the user, Coinbase is unable to assist in recovery in the event a user loses their key or seed phrase. \nSubscription products and other services\nStablecoins\nStablecoins play a key role in updating the financial system and advancing economic freedom by combining the benefits of crypto rails, which are global, cheap, and fast, with an asset that is stable relative to fiat currencies. We offer a variety of stablecoins denominated in multiple fiat currencies on our platform, and we continue to explore partnerships with a number of stablecoin issuers to expand our offerings. \nIn 2018, we partnered with Circle Internet Financial, LLC (“Circle”) to launch USDC, with the goal of driving global, mainstream adoption of stablecoins. Circle and its affiliate, Circle Internet Financial Europe SAS, are the issuers of USDC, a stablecoin redeemable on a one-to-one basis for U.S. dollars, and Circle Internet Financial Europe SAS is the issuer of EURC, a stablecoin redeemable on a one-to-one basis for Euros. In August 2023, we entered into an updated arrangement with Circle to (i) support USDC; (ii) help drive long-term success of the stablecoin ecosystem; and (iii) share in the economics of the reserves backing stablecoins in circulation both on and off our platform (the “Circle Agreement”). Pursuant to the Circle Agreement, Circle pays us for our role in the growth of USDC: the greater the proportion of USDC in circulation generally and on our platform, the greater our revenue generated under the Circle Agreement. The Circle Agreement has an initial three-year term. Upon completion of the initial term, we and Circle will discuss in good faith whether any modifications to the Circle Agreement are warranted. If such modifications are not agreed upon, the Circle Agreement will automatically renew for additional three-year terms unless we or Circle fail to meet ongoing obligations under the Circle Agreement. \nWe and Circle may, from time to time, enter into arrangements with third parties approved by both us and Circle (such third parties, “approved participants”) that provide for fees to be paid to such approved participants to increase the circulation of stablecoins subject to the Circle Agreement. In anticipation of such arrangements, in November 2024, we and Circle entered into a supplement to the Circle Agreement, pursuant to which we and Circle will agree upon the fees that such third parties are eligible to receive and the undertakings to be required of them upon becoming an approved participant. We have filed a copy of the Circle Agreement and its 2024 supplement as exhibits to this Annual Report on Form 10-K in order to provide investors with additional information about this partnership.\nHistorically, we have observed that customers holding USDC on our platform are more likely to use other products such as trading. Therefore, where permitted, we pay rewards to both consumer and institutional customers who hold USDC to incentivize on-platform balances and deeper engagement with our product suite. In 2024, we began paying rewards onchain to customers holding USDC balances in Coinbase Wallet. \nStaking   \nStaking is one of our most popular services. Certain blockchain protocols, such as Ethereum and Solana, rely on staking to validate blockchain transactions, an essential operation to these protocols’ operations and an alternative consensus mechanism to mining. Network participants can designate a certain amount of their crypto assets on the network to validate transactions and earn rewards. Today, many users choose to outsource the technical processes involved in staking by staking through a service provider. \nWe provide an onchain staking service, which allows our customers to stake their assets with a few clicks. Our customers maintain full ownership of their crypto assets while earning staking rewards. Customers who stake their assets receive compensation, paid out by applicable blockchain protocols, in \n9\nTable of Contents\nthe form of the network’s crypto asset. The rewards rates, expressed as an annual percentage yield, vary by asset. In return for the services we provide, we earn a fixed percentage commission on all staking rewards received. \nBecause staking rewards depend on the relevant protocol and network conditions, the estimated rewards rate for each asset made available for staking is displayed on our website and through our platform, and is calculated by periodically consulting onchain data to determine the total amount. We only facilitate staking of a consumer’s crypto assets in response to a direct instruction from that consumer, and the staked crypto assets remain the property of the consumer and in our custody while staked. According to certain protocol rules, staked crypto assets cannot be sold or transferred while they remain staked, and we do not use or allocate consumers’ staked crypto assets for any other purpose.\nSubject to jurisdiction, we support eight staking assets through our platform for consumers as of December 31, 2024: Cardano (ADA), Avalanche (AVAX), Cosmos (ATOM), Polkadot (DOT), Ethereum (ETH), MATIC (POL), Solana (SOL), and Tezos (XTZ). As of December 31, 2024, approximately $15.2 billion worth of these assets were held on behalf of individual consumers staked through our platform, as adjusted to USD.  \nFor our institutional customers, our staking process varies by customer. In addition to operating our own validator nodes to provide staking services, we utilize third-party service providers to operate validator nodes on our customers’ behalf. Institutional customers receive rewards directly from the protocol as we do not stake on behalf of these customers. The fees we charge to institutional customers depend on the customer agreement and the selected service. As of December 31, 2024, over $8.1 billion worth of assets were staked by institutional customers through Coinbase Prime, as adjusted to USD.  \nWe also operate a cbETH token wrapping service. cbETH is an Ethereum-based “wrapped staking token” that represents ownership of ETH staked through our platform. Eligible customers can obtain cbETH tokens by wrapping their staked ETH or by purchasing cbETH tokens on our exchange or on third-party exchanges. A cbETH holder can sell or transfer their cbETH within the Coinbase app or send cbETH to a self-custody wallet or to other addresses on the Ethereum blockchain. Selling or otherwise transferring cbETH automatically transfers ownership of the underlying staked ETH, along with any rewards earned.\nThere are risks associated with our staking services, which are described in the risk factor in the section titled “Risk Factors” in Part I,",
    "item1a": "Item 1A of this Annual Report on Form 10-K.\nCybersecurity Governance\nWith oversight from our board of directors, the Audit Committee is primarily responsible for assisting our board of directors in fulfilling its ultimate oversight responsibilities relating to risk assessment and management, including relating to cybersecurity and other information technology risks. The Audit Committee oversees management’s implementation of our cybersecurity risk management program, including processes and policies for determining risk tolerance, and reviews management’s strategies for adequately mitigating and managing identified risks, including risks relating to cybersecurity threats.\n \nThe Audit Committee has established the Enterprise Risk Management Working Group (“ERMWG”), comprising members of our senior management team and other senior leaders, to provide executive oversight of our enterprise risk management program\n. \nOur Chief Security Officer (“CSO”) is a member of the ERMWG, and together with our Chief Information Security Officer (“CISO”)\n leads an ERMWG sub-working group related to cybersecurity, which meets periodically to review and discuss emerging and key risks relating to cybersecurity at the company, and to provide regular updates to the ERMWG.\nThe Audit Committee receives updates from the ERMWG and from members of management, including our CSO and CISO, on our cybersecurity risks at its quarterly meetings, and reviews metrics about cyber threat response preparedness, program maturity milestones, risk mitigation status, and the current and emerging threat landscape. In addition, management updates the Audit Committee, as necessary, regarding any material cybersecurity threats or incidents, as well as any incidents with lesser impact potential. \nThe Audit Committee reports to our board of directors regarding its activities, including those related to key cybersecurity risks, mitigation strategies, and ongoing developments, on a quarterly basis or more frequently as needed. The \nboard of directors\n also receives updates from our CSO and CISO on our cyber risk management program and other matters relating to our data privacy and cybersecurity approach, including risk mitigations to bolster and enhance our data protection and data governance framework. Members of our board of directors receive presentations that include cybersecurity topics and the management of key cybersecurity risks from our CSO and CISO as part of the continuing education of our board of directors on topics that impact public companies. Finally, our board of directors annually reviews and is required to approve our Global Information Security Program Policy and any changes recommended by our CSO.\nOur management team, including our CSO and CISO, is responsible for assessing and managing our material risks from cybersecurity threats and for our overall cybersecurity risk management program on a day-to-day basis, and supervises both our internal cybersecurity personnel and the relationship with our retained external cybersecurity consultants. \nOur CSO’s and CISO’s experience includes years of working in the cybersecurity field in various industries, including the financial services industry\n. \n86\nTable of Contents\nOur management team supervises efforts to prevent, detect, mitigate, and remediate cybersecurity risks and incidents through various means, including through periodic ERMWG sub-working group meetings; briefings from internal security personnel; threat intelligence and other information obtained from governmental, public or private sources, including external consultants engaged by us; and alerts and reports produced by security tools deployed in the IT environment.",
    "item1b": "ITEM 1B. UNRESOLVED STAFF COMMENTS\n \nNot applicable",
    "item1c": "ITEM 1C. CYBERSECURITY\nCybersecurity Risk Management and Strategy\nWe have developed and implemented cybersecurity risk management processes intended to protect the confidentiality, integrity, and availability of our critical systems and information. While everyone at our company plays a part in managing cybersecurity risks, primary cybersecurity oversight responsibility is shared by our board of directors, our audit and compliance committee (“Audit Committee”), and senior management. \nOur cybersecurity risk management program is integrated into our overall enterprise risk management program.\n \nOur cybersecurity risk management program includes:\n•\nphysical, technological, and administrative controls intended to support our cybersecurity and data governance framework, including protections designed to protect the confidentiality, integrity, and availability of our key information systems and customer, employee, partner, and other third-party information stored on those systems, such as access controls, encryption, data handling requirements, and other cybersecurity safeguards, and internal policies that govern our cybersecurity risk management and data protection practices;\n \n•\na defined procedure for timely incident detection, containment, response, and remediation, including a written security incident response plan that includes procedures for responding to cybersecurity incidents; \n•\ncybersecurity risk assessment processes designed to help identify material cybersecurity risks to our critical systems, information, products, services, and broader enterprise IT environment;\n•\na security team responsible for managing our cybersecurity risk assessment processes and security controls;\n•\nthe use of external consultants or other third-party experts and service providers, where considered appropriate, to assess, test, or otherwise assist with aspects of our cybersecurity controls;\n•\nannual cybersecurity and privacy training of employees, including incident response personnel and senior management, and specialized training for certain teams depending on their role and/or access to certain types of information, such as consumer information; and\n•\na third-party risk management process that includes internal vetting of certain third-party vendors and service providers with whom we may share data.\n85\nTable of Contents\nOver the past fiscal year, we have not identified risks from known cybersecurity threats, including as a result of any prior cybersecurity incidents we have experienced from time to time, that have materially affected or are reasonably likely to materially affect us, including our operations, business strategy, operating results, or financial condition.\n We will continue to monitor and assess our cybersecurity risk management program as well as invest in and seek to improve such systems and processes as appropriate. If we were to experience a material cybersecurity incident in the future, such incident may have a material effect, including on our operations, business strategy, operating results, or financial condition. For more information regarding cybersecurity risks that we face and potential impacts on our business related thereto, see the section titled “\nRisk Factors\n” in Part I,"
  }
}