{
  "ticker": "COR",
  "cik": "0001140859",
  "company_name": "Cencora, Inc.",
  "filing_date": "2025-11-25",
  "accession": "0001140859-25-000131",
  "primary_doc": "cor-20250930.htm",
  "item_sections": {
    "item1": "ITEM 1.    \nBUSINESS\nAs used herein, the terms “Company,” “Cencora,” “we,” “us,” or “our” refer to Cencora, Inc., a Delaware corporation.\nCencora is one of the largest global pharmaceutical sourcing and distribution services companies, helping both healthcare providers and pharmaceutical and biotech manufacturers improve patient access to products and enhance patient care. We deliver innovative programs and services designed to increase the effectiveness and efficiency of the pharmaceutical supply chain in both human and animal health. More specifically, we distribute a comprehensive offering of brand-name, specialty brand-name, and generic pharmaceuticals, over-the-counter healthcare products, home healthcare supplies and equipment, and related services to a wide variety of healthcare providers located in the United States and select global markets, including acute care hospitals and health systems, independent and chain retail pharmacies, mail order pharmacies, medical clinics, long-term care and alternate site pharmacies, physician practices, medical and dialysis clinics, veterinarians, and other customers. Additionally, we furnish healthcare providers and pharmaceutical manufacturers with an assortment of related services, including data analytics, outcomes research, reimbursement and pharmaceutical consulting services (including regulatory affairs, development consulting and scientific affairs, pharmacovigilance, and quality management and compliance) niche premium logistics services, inventory management, pharmacy automation, pharmacy management, and packaging solutions. \nReferences to “fiscal 2025,” “fiscal 2024,” and “fiscal 2023” refer to the fiscal years ended September 30, 2025, 2024, and 2023, respectively.\nIndustry Overview\nPharmaceutical sales in the United States, as recently estimated by IQVIA, an independent third-party provider of information to the pharmaceutical and healthcare industry, are expected to grow at a compound annual growth rate of approximat\ne\nly 8.4% f\nrom 2024 through 2029, an\nd the growth rate is dependent, in part, on pharmaceutical manufacturer price increases. In addition to general economic conditions, factors that impact the growth of the pharmaceutical industry in the U.S. and other industry trends include:\nAging Population.\n The number of individuals aged 65 and over in the U.S. is expected to be approximately 71 million by 2029 and is the most rapidly growing segment of the population. This age group suffers from more chronic \nillne\nsses and disabilities than the rest of the population and accounts for a substantial portion of total healthcare expenditures in the U.S.\nIntroduction of New Pharmaceuticals.\n Traditional research and development, as well as the advent of new research, production, and delivery methods, such as biotechnology and gene therapy, continue to generate new pharmaceuticals and delivery methods that are more effective in treating diseases. We believe ongoing research and development expenditures by the leading pharmaceutical manufacturers will contribute to continued growth of the industry. In particular, we believe ongoing research and development of biotechnology and other specialty pharmaceutical drugs will provide opportunities for the continued growth of our specialty pharmaceuticals business.\nUse of Generic and Biosimilar Pharmaceuticals.\n A number of patents for widely used brand-name pharmaceutical products will continue to expire during the next several years. In addition, increased emphasis by managed care and other third-party payors on utilization of generics and biosimilars has accelerated their growth. We consider the increase in generic and biosimilar usage a favorable trend because generic and biosimilar pharmaceuticals have historically provided us with a greater gross profit margin opportunity than brand-name products, although their lower prices reduce revenue growth. Generic pharmaceuticals currently account for approximately 90% of the prescription volume in the U.S.\nUse of Drug Therapies.\n In response to rising healthcare costs, governmental and private payors have adopted cost containment measures that encourage the use of efficient drug therapies to prevent or treat diseases. While national attention h\nas been focused on the overall increase in aggregate healthcare costs, we believe drug therapy has had a beneficial impact on healthcare costs by reducing expensive surgeries and prolonged hospital stays. According to the Centers for Medicare & Medicaid Services (“CMS”), pharmaceuticals currently account for approximately 9% of overall healthcare costs. Pharmaceutical manufacturers’ continued emphasis on research and development is expected to result in the continuing introduction of cost-effective drug therapies and new uses for existing drug therapies.\nOther economic conditions and certain risk factors could adversely affect our business and prospects (see",
    "item1a": "Item 1A of Part I above for additional information on risks related to our business, including for example, risks related to privacy and data protection, cybersecurity incidents, third-party relationships, and continuity of our information systems and networks, operational technology, and technology products or services.\n \nBoard Governance and Management\nAs described above, our CDIO leads management’s assessment and management of cybersecurity with the assistance of our CISO, who reports directly to the CDIO and meets with the CDIO on a regular basis to discuss pertinent risks, mitigation factors, remediation status, and risk acceptance. \nThe CDIO, who reports directly to our President and Chief Executive Officer, is a member of the Enterprise Leadership Team (the “ELT”) and provides updates to the ELT about cybersecurity matters. Our CDIO has more than 25 plus years of experience managing technology and risks and advising on cybersecurity issues, and our CISO has more than 20 plus years of IT and relevant cybersecurity experience.\nAdditionally, we have an Extended Cyber Crisis Response Team (“ECCRT”), which is a cross-functional team comprised of senior leaders that, in the event of a cyber incident, help lead the decision-making process for the execution of containment and recovery processes and incident communications, including reporting to senior management and, in turn, the Board, as appropriate, in each case in accordance with the protocols set forth in our Response Process.\n \nCybersecurity is among the risks identified by our Enterprise Risk Management Team for Board-level oversight. \nWhile the full \nBoard\n retains overall oversight over cybersecurity, the Board has delegated to its Audit Committee oversight of the Company’s information technology security program and the controls around cybersecurity, and to its Compliance and Risk Committee oversight of an enterprise risk management program that is designed to assist with monitoring and mitigating operational risks.\n \nThe Audit Committee and Compliance and Risk Committee meet every quarter. The Audit Committee is updated as needed on cybersecurity threats, incidents, and programs, and the Compliance and Risk Committee is updated as needed on new developments in our cybersecurity risk profile. After each such meeting, the respective chairs of the Audit Committee and Compliance and Risk Committee provide a report to the full Board on the committee meeting.\n \nSenior leadership, including our \nCDIO and CISO\n, routinely update and report to the Board, the Audit Committee, and the Compliance and Risk Committee, as applicable, on our cybersecurity and information security risks and the management of such risks, our data governance and usage, our technology infrastructure, our training and compliance efforts, and implications for our business strategy. In addition to the information provided in these meetings, members of our Board have access to continuing education, which includes topics relating to cybersecurity risks.",
    "item1b": "ITEM 1B.    \nUNRESOLVED STAFF COMMENTS\nNone.",
    "item1c": "ITEM 1C.\n    CYBERSECURITY\nAs one of the largest global pharmaceutical sourcing and distribution services companies engaged in helping both healthcare providers and pharmaceutical and biotechnology manufacturers, we are exposed to various cybersecurity threats. These threats include both those typical of companies operating in many industries, like ransomware and denial-of-service attacks, as well as more sophisticated and persistent threats from highly organized adversaries that specifically target the healthcare sector and other critical infrastructure. The emergence of artificial intelligence has provided additional tools for those who perpetrate these attacks, including through social engineering, the development of customized malware, and an enhanced ability to evade detection.\n \nOur suppliers, third-party vendors, service providers, customers, contractors, those who work for our contractors, and other business partners (collectively, our “third-party business partners”) are also vulnerable to similar cybersecurity risks, and any cyber incident affecting us and/or our third-party business partners could significantly disrupt our operations. In light of these risks, cybersecurity is a priority for the Company, management, and our Board of Directors (the “Board”), and we believe that it is essential for us to invest substantial resources in our cybersecurity efforts. \nRisk Management and Strategy\nCybersecurity risk management is integral to our enterprise risk management strategy.\n Our management, with involvement and input from external consultants and advisors, and oversight from our Board, regularly performs an enterprise-wide risk assessment to identify key existing and emerging risks.\nTo oversee cybersecurity risk at the management level, we employ a Chief Data and Information Officer (“CDIO”) and a Chief Information Security Officer (“CISO”). The CDIO is responsible for the global data landscape and IT systems across our business units, including information security. The CISO leads our Information Security team. The CISO and his team are responsible for administering our comprehensive, company-wide information security program, which includes strategy, regulatory intelligence, IT risk management, policy development, security engineering, cyber threat detection, response, and operations. Our information security program is based upon, informed by, and responsive to industry best practice frameworks such as HITRUST CSF and ISO 27001. Our program undergoes an internal annual review that is conducted by our CISO, as well as an annual third-party external review. Additionally, we leverage a diverse array of internal and external assessors, consultants, auditors, and other third parties to identify opportunities for improvements to our information security program through methods such as penetration testing, independent audits, and consulting on best practices to address emerging risks and challenges. These assessments encompass evaluations of both the design and operational effectiveness of our security measures. They also consider the evolution of different cybersecurity threats, including through artificial intelligence. Additionally, we are a member of H-ISAC, an industry cybersecurity intelligence and risk-sharing organization, which enables us to stay informed about developments, trends, and risks in the cybersecurity threat landscape and consider any necessary updates to our information security program related thereto. We are committed to employing cybersecurity best practices and have obtained and maintain multiple industry best practice cybersecurity certifications such as ISO 27001and SOC1/SOC2.\nUnder the leadership of our CDIO and CISO, and with oversight, as appropriate, from the Board’s Audit Committee, we have developed a Cybersecurity Incident Response Process (the “Response Process”), which sets forth a framework for the actions to be taken in response to a cybersecurity incident and includes appropriate escalations to the Company’s senior management, including our ECCRT (as defined below), and the Board. Under the guidance of our CISO, the Response Process is routinely evaluated, tested and updated as appropriate. \nIn addition to our Response Process, which is employed in the event of a cybersecurity incident, we take preventative measures that are designed to mitigate the likelihood and prevalence of cybersecurity incidents. For example, we believe that enterprise-wide cybersecurity and privacy training serve an important role in risk reduction. Accordingly, we require employees to complete periodic access-based and role-based privacy and cybersecurity training. These trainings are routinely updated to reflect changes in the threat environment, assessment, and/or audit findings, laws, and regulations. We also engage and educate employees through cybersecurity and privacy awareness programs and communication campaigns. \nWe recognize that our cybersecurity risk profile extends beyond our organization. As such, we strive to manage cybersecurity risks associated with our third-party business partners and external users of our systems. Our \nthird-party business partner\n risk management program is built upon, informed by, and responsive to industry best practices. \nThis program is designed to conduct appropriate due diligence on the third-party business partners with whom we engage and conduct business, as well as on the systems and the cybersecurity controls of such third-party business partners.\n Specifically, to evaluate third-\n24\nTable of Contents \nparty cybersecurity controls, we utilize third-party cybersecurity monitoring and alerting tools, cybersecurity due diligence questionnaires, and request and review third-party audit reports and assurance certifications if they exist. \nOur information systems have been subject to cybersecurity incidents in the past. To date, we are not aware of cybersecurity incidents that have materially affected or are reasonably likely to materially affect us.\n However, there is no guarantee that future cybersecurity incidents will not have a material impact. Despite our comprehensive approach to cybersecurity, we may not be able to prevent or mitigate a cybersecurity incident that could materially impact our business, results of operations, or financial condition. While we hold cybersecurity insurance, the expenses associated with cybersecurity threats or disruptions may not be completely covered by our policy. See “Risk Factors” in"
  }
}