{
  "ticker": "COST",
  "cik": "0000909832",
  "company_name": "COSTCO WHOLESALE CORP /NEW",
  "filing_date": "2025-10-08",
  "accession": "0000909832-25-000101",
  "primary_doc": "cost-20250831.htm",
  "item_sections": {
    "item1": "Item 1—Business\nCostco Wholesale Corporation and its subsidiaries (Costco or the Company) began operations in 1983, in Seattle, Washington. We are principally engaged in the operation of membership warehouses in the United States (U.S.) and Puerto Rico, Canada, Mexico, Japan, the United Kingdom (U.K.), Korea, Australia, Taiwan, China, Spain, France, Sweden, Iceland, and New Zealand. Costco operated 914, 890, and 861 warehouses worldwide at August 31, 2025, September 1, 2024, and September 3, 2023. The Company operates e-commerce sites in the U.S., Canada, Mexico, the U.K., Korea, Taiwan, Japan, and Australia. Our common stock trades on the NASDAQ Global Select Market, under the symbol “COST.”\nWe report on a 52/53-week fiscal year, consisting of thirteen four-week periods and ending on the Sunday nearest the end of August. The first three quarters consist of three periods each, and the fourth quarter consists of four periods (five weeks in the thirteenth period in a 53-week year). The material seasonal impact in our operations is increased net sales and earnings during the winter holiday season. References to 2025 and 2024 relate to the 52-week fiscal years ended August 31, 2025, and September 1, 2024. References to 2023 relate to the 53-week fiscal year ended September 3, 2023. \nGeneral\nWe operate membership warehouses and e-commerce sites based on the concept that offering low prices on a limited selection of nationally-branded and private-label products in a wide range of categories will produce high sales volumes and rapid inventory turnover. When combined with the operating efficiencies achieved by volume purchasing, efficient distribution and reduced handling of merchandise in no-frills, self-service warehouse facilities, these volumes and turnover enable us to operate profitably at significantly lower gross margins (net sales less merchandise costs) than most other retailers. We often sell inventory before we are required to pay for it, even while taking advantage of early payment discounts.\nWe buy most of our merchandise directly from suppliers and route it to cross-docking consolidation points (depots) or directly to our warehouses. Our depots receive large shipments from suppliers and quickly ship these goods to warehouses. This process creates freight volume and handling efficiencies, lowering \n3\nTable of Contents\ncosts associated with traditional multiple-step distribution channels. Our e-commerce operations ship merchandise through our depots and logistics operations, as well as through drop-ship and other delivery arrangements with our suppliers.\nOur average warehouse space is approximately 147,000 square feet, with newer units being slightly larger. Floor plans are designed for efficiency in the use of selling space, the handling of merchandise, and the control of inventory. Because shoppers are attracted principally by the quality of merchandise and low prices, our warehouses are not elaborate. By strictly controlling the entrances and exits and using a membership format, we believe our inventory losses (shrinkage) are well below those of typical retail operations.\nOur operating hours are shorter than many other retailers, and due to other efficiencies inherent in a warehouse club operation, we believe labor costs are lower relative to the volume of sales. In the U.S., we recently added exclusive shopping hours for our Executive members and our gasoline operations generally have extended hours. Merchandise is generally stored on racks above the sales floor and displayed on pallets containing large quantities, reducing labor required. In general, with variations by country, our warehouses accept certain credit cards, including Costco co-branded cards, debit cards, cash and checks, Executive member 2% reward certificates, co-brand cardholder rebates, and our proprietary stored-value card (shop card).\nOur strategy is to provide our members with a broad range of high-quality merchandise at prices we believe are consistently lower than elsewhere. We seek to limit most items to fast-selling models, sizes, and colors. We carry less than 4,000 active stock keeping units (SKUs) per warehouse in our core warehouse business, significantly less than other broadline retailers. We average from 9,000 to 10,000 SKUs online, some of which are available in our warehouses. Many consumable products are offered for sale in case, carton, or multiple-pack quantities only.\nTo promote member satisfaction, we generally accept returns of merchandise. On certain electronic items, we have a 90-day return policy and provide, free of charge, technical support services, as well as an extended warranty. Additional third-party warranty coverage is sold on certain electronic items and major appliances.\nWe offer merchandise and services in the following categories:\n■\nCore Merchandise Categories:\n•\nFoods and Sundries\n (including sundries, dry grocery, candy, cooler, freezer, liquor, and tobacco)\n•\nNon-Foods\n (including major appliances, small electronics, health and beauty aids, hardware, lawn and garden, sporting goods, tires, toys and seasonal, automotive, stamps, tickets, apparel, furniture, domestics, housewares, special order kiosk, and jewelry)\n•\nFresh Foods\n (including meat, produce, deli, and bakery)\n■\nWarehouse Ancillary\n (includes gasoline, pharmacy, optical, food court, hearing aids, and tire installation)\n■\nOther Businesses\n (includes e-commerce, business centers, travel, and other)\nWarehouse ancillary operate primarily within, next to or near our warehouses, encouraging more frequent shopping. The number of warehouses with gas stations varies significantly by country. We operated 747 gas stations at the end of 2025. Our gasoline business represented approximately 10% of total net sales in 2025.\nOur other businesses sell products and services that largely complement our warehouse operations. Our e-commerce operations give members convenience and a broader selection of goods and services. Net sales for e-commerce represented approximately 7% of total net sales in 2025. Digitally-enabled sales, \n4\nTable of Contents\nwhich represents sales delivered to members that are initiated through a digital device, whether fulfilled through a warehouse or distribution center, as well as Costco Travel, represented approximately 10% of total net sales in 2025. Our business centers carry items tailored for food services, convenience stores and offices and offer walk-in shopping and deliveries. Business centers are included in our total warehouse count. Costco Travel offers vacation packages, car rentals, cruises and other travel products exclusively for Costco members (offered to varying degrees in the U.S., Canada, Australia, and the U.K.).\nWe have direct relationships with many producers of brand-name merchandise. We do not obtain a significant portion of merchandise from any one supplier. When sources of supply become unavailable, we seek alternative sources or items. For future product supply need, we pursue diversification in our supply-chain and seek to expand in-country production. We also purchase and manufacture private-label merchandise, as long as quality and member demand are high and the value to our members is significant. \nCertain financial information for our segments and geographic areas is included in \nNote 11\n to the consolidated financial statements included in Item 8 of this Report.\nMembership\nOur members may utilize their memberships at all of our warehouses and e-commerce sites. Gold Star memberships are available to individuals; Business memberships are limited to businesses, including individuals with a business license or comparable document. Business members may add additional cardholders (affiliates), to which the same annual fee applies. Affiliates are not available for Gold Star members. Our annual fee for these memberships is $65 in the U.S. and varies in other countries. All paid memberships include a free household card. \nPaid members (except affiliates) are eligible to upgrade to an Executive membership in the U.S., for an additional annual fee of $65. Executive memberships are also available in Canada, Mexico, the U.K., Japan, Korea, Taiwan, and Australia, for which the additional fee varies. Executive members earn a 2% reward on qualified purchases (generally up to a maximum reward of $1,250 per year), redeemable at Costco warehouses. The sales penetration of Executive members represented approximately 73.6% of worldwide net sales in 2025.\nMembership at the end of 2025, 2024, and 2023 was made up of the following (in thousands):\n2025\n2024\n2023\nGold Star\n68,300 \n63,700 \n58,800 \nBusiness, including affiliates\n12,700 \n12,500 \n12,200 \nTotal paid members\n1\n81,000 \n76,200 \n71,000 \nHousehold cards\n64,200 \n60,600 \n56,900 \nTotal cardholders\n145,200 \n136,800 \n127,900 \n_______________\n(1)\nExecutive members represented 38,700, 35,400, and 32,300 of total paid members in 2025, 2024, and 2023.\nThese membership counts include active memberships as well as memberships that have expired and not renewed within the 12 months prior to the reporting date. These expired memberships make up a small percentage of these membership counts, and many of them are subsequently renewed.\nOur member renewal rate was 92.3% in the U.S. and Canada and 89.8% worldwide at the end of 2025. That rate, which excludes affiliates of Business members, is a trailing calculation that captures renewals during the period seven to eighteen months prior to the reporting date. Memberships that have an expiration date in the six months prior to the end of our reporting period are excluded from this calculation, regardless of whether or not they have been renewed. Although most members renew prior to expiration, the vast majority of those who renew late do so within six months of expiration. The timing of \n5\nTable of Contents\nrenewal after expiration is impacted by a variety of factors, such as warehouse openings and promotional activity.\nHuman Capital\n“Take Care of Our Employees,” is a key component of our code of ethics and is fundamental to our commitment to “Take Care of Our Members.” Compensation and benefits for employees is our largest expense after the cost of merchandise and is carefully monitored.\nEmployee Base\nAt the end of 2025, we employed 341,000 employees worldwide. Approximately 95% are employed in our membership warehouses and distribution channels. Around 5% are represented by unions. We also utilize seasonal employees.\nThe total number of employees by segment was:\n2025\n2024\n2023\nUnited States\n223,000 \n219,000 \n208,000 \nCanada\n55,000 \n53,000 \n51,000 \nOther International\n63,000 \n61,000 \n57,000 \nTotal employees\n341,000 \n333,000 \n316,000 \nGrowth and Engagement\nWe believe that our warehouses are among the most productive in the retail industry, owing largely to the commitment and efficiency of our employees. We seek to provide them not merely with employment but careers. Many attributes of our business contribute to the objective. The more significant include: competitive compensation and benefits; a commitment to employee development and promoting from within; and a target ratio of at least 50% of our base being full-time employees. These attributes contribute to what we consider, especially for the industry, a high retention rate. In 2025, in the U.S. and Canada that rate was approximately 94% for employees who have been with us for at least one year.\nInclusion\nThe commitment to “Take Care of Our Employees” includes promoting an inclusive and respectful workplace. We strive for an environment where all employees feel that they belong, are accepted, included, respected and supported. We demonstrate leadership commitment to inclusion through consistent communication, employee development and education, support of diversity and inclusion initiatives within the organization, community involvement, and supplier inclusion. Listening to our employees is one of the ways Costco takes care of its workforce. In 2025, we hosted the Costco Connects meetings, its second annual Costco Connects campaign. These open listening sessions are an invitation for employees to talk about what is on their minds and what is impacting them both personally and professionally. This allows Costco leaders to engage with their employees on a deeper level and for employees to build connections with each other. This year we had approximately 200,000 employees participate globally. Costco continues its efforts to develop future leaders, including through our supervisor in training (SIT) programs in the U.S. and Canada. In 2025, approximately 7,500 hourly employees completed the 6-week course.\nWell Being\nWe strive to provide our employees with competitive wages and excellent benefits. In March 2025, we increased the starting wage by $0.50 an hour to at least $20.00 for all entry-level positions in the U.S. and Canada. We also increased the top of wage scales by $1.00 per hour, bringing our average hourly rate at the end of 2025 for hourly employees in the U.S. to approximately $32.00 per hour. We continue to offer \n6\nTable of Contents\nexpansive benefits in the U.S. that provide physical, emotional, mental, and financial well-being support for employees and their dependents at low cost to our employees.\nFor more detailed information regarding our programs and initiatives, see “Employees” within our Sustainability Commitment (located on our website). The Sustainability Commitment and other information on our website are not incorporated by reference into and do not form any part of this Annual Report.\nCompetition\nOur industry is highly competitive, based on factors such as price, merchandise quality and selection, location, convenience, distribution strategy, and customer service. We compete on a worldwide basis with global, national, and regional wholesalers and retailers, including supermarkets, supercenters, online retailers, gasoline stations, hard discounters, department and specialty stores, and operators selling a single category or narrow range of merchandise. Walmart, Target, Kroger, and Amazon are among our significant general merchandise retail competitors in the U.S. We also compete with other warehouse clubs, including Walmart’s Sam’s Club and BJ’s Wholesale Club in the U.S. Many of the metropolitan areas in the U.S. and certain of our Other International locations have multiple competing clubs.\nIntellectual Property\nWe believe that, to varying degrees, our trademarks, trade names, copyrights, proprietary processes, trade secrets, trade dress, domain names and similar intellectual property add significant value to our business and are important to our success. We have invested significantly in the development and protection of our well-recognized brands, including the Costco Wholesale trademarks and our private-label brand, Kirkland Signature. We believe that Kirkland Signature products are high quality, offered at prices that are generally lower than national brands, and help lower costs, differentiate our merchandise offerings, and generally earn higher margins. We expect to continue to increase the sales penetration of our private-label items.\nWe rely on trademark and copyright laws, trade-secret protection, and confidentiality, license and other agreements with our suppliers, employees and others to protect our intellectual property. The availability and duration of trademark registrations vary by country; however, trademarks are generally valid and may be renewed indefinitely as long as they are in use and registrations are maintained.\nAvailable Information\nOur U.S. website is www.costco.com. We make available through the Investor Relations section of that site, free of charge, our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, Proxy Statements and Forms 3, 4 and 5, and any amendments to those reports, as soon as reasonably practicable after filing such materials with or furnishing such documents to the Securities and Exchange Commission (SEC). The information found on our website is not part of this or any other report filed with or furnished to the SEC. The SEC maintains a site that contains reports, proxy and information statements, and other information regarding issuers, such as the Company, that file electronically with the SEC at www.sec.gov.\nWe have a code of ethics for senior financial officers, pursuant to Section 406 of the Sarbanes-Oxley Act. Copies of the code are available free of charge by writing to Secretary, Costco Wholesale Corporation, 999 Lake Drive, Issaquah, WA 98027. If the Company makes any amendments to this code (other than technical, administrative, or non-substantive amendments) or grants any waivers, including implicit waivers, to the Chief Executive Officer, Chief Financial Officer or principal accounting officer and controller, we will disclose (on our website or in a Form 8-K report filed with the SEC) the nature of the amendment or waiver, its effective date, and to whom it applies.\n7\nTable of Contents\nInformation about our Executive Officers\nThe executive officers of Costco, their position, and ages are listed below. Most officers have over 25 years of service with the Company.\nName\nPosition\nExecutive\nOfficer\nSince\nAge\nRon M. Vachris\nPresident and Chief Executive Officer. Mr. Vachris has been a director since February 2022. Mr. Vachris was previously President and Chief Operating Officer from February 2022 to December 2023. He was Executive Vice President of Merchandising from June 2016 to January 2022, Senior Vice President, Real Estate Development, from August 2015 to June 2016, and Senior Vice President, General Manager, Northwest Region, from 2010 to July 2015.\n2016\n60\nGary Millerchip\nExecutive Vice President and Chief Financial Officer. Mr. Millerchip previously served as Senior Vice President and Chief Financial Officer of The Kroger Co. from April 2019 to February 2024 and, prior to that, as Chief Executive Officer of Kroger Personal Finance since July 2010.\n2024\n54\nRuss Miller\nSenior Executive Vice President, U.S. Operations. Mr. Miller was Executive Vice President, Chief Operating Officer, Southwest Division and Mexico, from January 2018 to May 2022. Mr. Miller was Senior Vice President, Western Canada Region, from 2001 to January 2018. Mr. Miller will be retiring from the Company effective February 2026.\n2018\n68\nClaudine Adamo\nExecutive Vice President, Merchandising. Ms. Adamo was Senior Vice President, Non-Foods, from 2018 to February 2022, and Vice President, Non-Foods, from 2013 to 2018.\n2022\n55\nPatrick Callans\nExecutive Vice President, Administration. Mr. Callans was Senior Vice President, Human Resources and Risk Management, from 2013 to December 2018.\n2019\n63\nCaton Frates\nExecutive Vice President, Chief Operating Officer, Southwest Division. Mr. Frates was Senior Vice President, Los Angeles Region, from 2015 to May 2022. Mr. Frates will be appointed Senior Executive Vice President, Warehouse Operations - U.S. and Mexico, effective February 2026.\n2022\n57\nTeresa Jones\nExecutive Vice President, Global Depots and Traffic. Ms. Jones was Senior Vice President, Depot Operations from August 2022 to July 2024, and Vice President, Depot Operations, from 2018 to 2022.\n2024\n56\nJim C. Klauer\nExecutive Vice President, Chief Operating Officer, Northern Division. Mr. Klauer was Senior Vice President, Non-Foods and E-commerce Merchandise, from 2013 to January 2018.\n2018\n63\nJavier Polit\nExecutive Vice President, Chief Information and Digital Officer. Mr. Polit previously served as Chief Information Officer for Mondelez International (formerly Kraft Foods) from 2022 to 2024. From 2017 to 2022, he was Chief Information Officer for The Procter & Gamble Company. Prior to that role, he served as Group Chief Information Officer for The Coca-Cola Company from 2007 to 2017.\n2023\n61\nPierre Riel\nExecutive Vice President, Chief Operating Officer, International Division. Mr. Riel was Senior Vice President, Country Manager, Canada, from 2019 to March 2022, and Senior Vice President, Eastern Canada Region, from 2001 to 2019.\n2022\n62\nYoram Rubanenko\nExecutive Vice President, Chief Operating Officer, Eastern Division. Mr. Rubanenko was Senior Vice President and General Manager, Southeast Region, from 2013 to September 2021, and Vice President, Regional Operations Manager for the Northeast Region, from 1998 to 2013.\n2021\n61\nJohn Sullivan\nExecutive Vice President, General Counsel & Corporate Secretary. Mr. Sullivan has been General Counsel since 2016 and Corporate Secretary since 2010.\n2021\n65\nW. Richard Wilcox\nExecutive Vice President, Chief Operating Officer, Southwest Division. Mr. Wilcox was Senior Vice President, General Manager - San Diego Region from 2016 to October 2025.\n2025\n59\n8\nTable of Contents",
    "item1a": "Item 1A of this Form 10-K for more information on our cybersecurity-related risks.\n19\nTable of Contents",
    "item1b": "Item 1B—Unresolved Staff Comments\nNone.",
    "item1c": "Item 1C—Cybersecurity\nRisk Management and Global Strategy\nWe have implemented processes, technologies, and controls to seek to assess, identify, and manage risks associated with cybersecurity threats.\n Management considers cybersecurity risks within our overall approach to enterprise risk management. We evaluate these risks based on several frameworks, including the National Institute of Standards and Technology (NIST) Cybersecurity Framework (CSF), Center for Internet Security (CIS) 18 Critical Security Controls, and the Payment Card Industry Data Security Standard. Our governance policies, including our Information Security Policy, outline high-level objectives designed to meet compliance and regulatory requirements.\nWe undertake regular NIST CSF and CIS 18 Critical Security Controls assessments, conducted by a third-party, to measure program maturity.\n \nWe have implemented a variety of technologies, leveraging third-party security providers for some, and engage in multiple activities to seek to identify and mitigate vulnerabilities and risks in systems. These include, among other activities, scanning for common vulnerabilities and exposures, penetration tests on internal and external networks, code scans on applications, allowed application listing, configuration management tools, employee awareness and training, and internal and external audits. We also review with various frequencies and on a risk-based priority select third parties with whom we do business, in an effort to reduce the likelihood of security \n18\nTable of Contents\nincidents or business interruptions.\n We maintain cybersecurity insurance that would apply to certain losses arising from significant security incidents.\nWe maintain a security operations center, supported by external providers and our employees, which provides threat detection and incident response capabilities. We maintain cyber incident response plans and related playbooks in coordination with stakeholders (including legal counsel). Significant incidents will be escalated to a Cybersecurity Materiality Committee to assess materiality based on qualitative and quantitative factors. The Committee is composed of a cross-divisional group of executives representing the core business functions of Information Technology and Security, Operations, Administration, Finance and Accounting, and Legal. We conduct periodic tabletop exercises, including at the executive level, to review our response processes and incident management procedures.\nGovernance\nOur Board of Directors has delegated certain responsibilities to the Audit Committee of the Board.\n \nThe Audit Committee reviews and discusses with management the identification and mitigation of cybersecurity risks, including (among other things) the effectiveness of risk-management policies and practices designed to help safeguard our operations, financial systems, and data\n. \nOur Chief Information and Digital Officer (CIDO) and his executive team, including the Vice President of Information Security and Chief Information Security Officer (CISO), present cybersecurity-related topics, including program maturity progress, regularly to the Audit Committee.\n The Internal Audit team, in its periodic compliance and risk assessment updates to the Audit Committee, also reports on its reviews of certain of our cybersecurity risk exposures, controls, and management actions. The full Board also receives cybersecurity evaluations from time to time.\nOur information security organization is led by the \nCISO\n. The CISO is responsible for all aspects of our cybersecurity program, including cybersecurity engineering and architecture, cybersecurity operations, incident response, threat intelligence, identity and access management, cybersecurity risk and compliance, and vulnerability management.\n Our former CISO left the Company in June 2025, and we are actively sourcing a qualified replacement. In the interim, our Deputy CISO, who has over 20 years of cybersecurity and leadership experience, is managing the CISO responsibilities. The \nCISO position reports to our CIDO, who has more than 30 years experience in which he has led global digital responsibilities, including leading global cyber teams. Our CIDO reports to the Chief Executive Officer.\nRisks from Material Cybersecurity Threats\nWe and our third-party service and merchandise providers have experienced cybersecurity incidents and threats. \nBased on the information available as of the date of this Form 10-K, we are not aware of any risks from actual cybersecurity incidents that have materially affected us or are reasonably likely to materially affect us, including our business strategy, results of operations, or financial condition.\n It is possible that there have been intrusions into our systems that have not been identified by our controls and procedures and that might manifest in significant events at a later time. There can be no guarantee that the actions and controls we and our third-party service providers have implemented and are implementing will be sufficient to protect our systems, information or other property. See “Risk Factors” in"
  }
}