{
  "ticker": "CPT",
  "cik": "0000906345",
  "company_name": "CAMDEN PROPERTY TRUST",
  "filing_date": "2025-02-20",
  "accession": "0000906345-25-000008",
  "primary_doc": "cpt-20241231.htm",
  "item_sections": {
    "item1": "Item 16.\nForm 10-K Summary\n40\nSIGNATURES\n41\nii\nTable of Contents\nPART I\nItem 1. Business\nGeneral\nFormed on May 25, 1993, Camden Property Trust, a Texas real estate investment trust (\"REIT\"), and all consolidated subsidiaries are primarily engaged in the ownership, management, development, reposition, redevelopment, acquisition, and construction of multifamily apartment communities. Unless the context requires otherwise, \"we,\" \"our,\" \"us,\" and the \"Company\" refer to Camden Property Trust and its consolidated subsidiaries. Our multifamily apartment communities are referred to as \"communities,\" \"multifamily communities,\" \"properties,\" or \"multifamily properties\" in the following discussion.\nOur website is located at www.camdenliving.com and we make available free of charge through our website our annual report on Form 10-K, quarterly reports on Form 10-Q and current reports on Form 8-K, and amendments to such reports, filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), as soon as reasonably practicable after we electronically file such material with, or furnish it to, the U.S. Securities and Exchange Commission (the \"SEC\"). We also make available free of charge on our website our Guidelines on Governance, Code of Business Conduct and Ethics, Code of Ethical Conduct for Senior Financial Officers, and the charters of each of our Audit; Compensation; and Nominating, Corporate Governance and Sustainability Committees. Copies are also available, without charge, from Investor Relations, 11 Greenway Plaza, Suite 2400, Houston, Texas 77046. References to our website in this report are provided as a convenience and do not constitute, and should not be viewed as, an incorporation by reference of the information contained on or available through our website and therefore such information should not be considered part of this report.\nOur annual, quarterly and current reports, proxy statements, and other information are electronically filed with the SEC.  The SEC maintains a website (http://www.sec.gov) that contains reports, proxy, and information statements and other information regarding issuers that file electronically with the SEC. \nNarrative Description of Business\nAs of December 31, 2024, we owned interests in, operated, or were developing 177 multifamily properties comprised of 59,996 apartment homes across the United States. Of the 177 properties, three properties were under construction and will consist of a total of 1,138 apartment homes when completed. We also own land holdings which we may develop into communities in the future.\nOperating and Business Strategy\nWe believe producing consistent earnings growth through property operations, development and acquisitions, achieving market balance, and recycling capital are crucial factors to our success. We rely heavily on our sophisticated property management capabilities and innovative operating strategies to maximize the earnings potential of our communities.\nReal Estate Investments and Market Balance.\n We believe we are well-positioned in our current markets and have the expertise to take advantage of new opportunities as they arise. These capabilities, combined with what we believe is a conservative financial structure, should allow us to concentrate our growth efforts toward selective opportunities to enhance our strategy of having a geographically diverse portfolio of assets which meet the requirements of our residents.\nWe continue to operate in our core markets which we believe provides an advantage due to economies of scale. We believe, where possible, it is best to operate with a strong base of properties in order to benefit from the personnel allocation and the market strength associated with managing multiple properties in the same market. However, consistent with our goal of generating sustained earnings growth, we intend to selectively dispose of properties and redeploy capital for various strategic reasons, including if we determine a property cannot meet our long-term earnings growth expectations.\nWe try to maximize capital appreciation of our properties by investing in markets characterized by conditions favorable to multifamily property appreciation. These markets generally feature the following:\n•\nstrong economic growth leading to household formation and job growth, which in turn should support higher demand for our apartments; and\n•\nan attractive quality of life, which may lead to higher demand and retention for our apartments and allow us to more readily grow revenue.\nSubject to market conditions, we intend to continue to seek opportunities to acquire operating communities, develop new communities, and to redevelop and reposition existing communities. We also intend to evaluate our operating property and land development portfolio and plan to continue our practice of selective dispositions as market conditions warrant and opportunities arise. \nWe expect to maintain a strong balance sheet and preserve our financial flexibility by continuing to focus on our core fundamentals which currently are generating positive cash flows from operations, maintaining appropriate debt levels and \n1\nTable of Contents\nleverage ratios, and controlling overhead costs. We intend to meet our short-term and long-term liquidity requirements through a combination of one or more of the following: cash flows generated from operations, draws on our unsecured revolving credit facility, the use of debt and equity offerings under our automatic shelf registration statement, proceeds from property dispositions, equity issued from our at-the-market (\"ATM\") share offering programs, other unsecured borrowings, or secured mortgages. \nSophisticated Property Management\n. We believe the depth of our organization enables us to deliver quality services, promote resident satisfaction, and retain residents, thereby increasing our operating revenues and reducing our operating expenses. We manage our properties utilizing a staff of professionals and support personnel, including certified property managers, experienced apartment managers and leasing staff, and trained apartment maintenance technicians. Our on-site personnel are trained to deliver high-quality services to our residents and we strive to motivate our on-site employees through incentive compensation arrangements based upon property operational results.\nOperations.\n We believe an intense focus on operations is necessary to realize consistent, sustained earnings growth. Ensuring customer satisfaction, increasing rents as market conditions allow, maximizing rent collections (subject to restrictions of applicable law), maintaining property occupancy at optimal levels, and controlling operating costs comprise our principal strategies to maximize property financial results. Lease terms are generally staggered based on vacancy exposure by apartment type such that lease expirations are matched to each property's seasonal rental patterns. Our average lease terms are approximately fourteen months, and our individual property marketing plans are structured to respond to local market conditions. In addition, we conduct ongoing customer service surveys to help ensure timely responses to customers' changing needs and a high-level of satisfaction.\nCompetition\nThere are numerous housing alternatives which compete with our communities in attracting residents. Our properties compete directly with other multifamily properties as well as condominiums, single-family homes, and third-party providers of short-term rentals, which are available for rent or purchase in the markets in which our communities are located. This competitive environment could have a material adverse effect on our ability to lease apartment homes or on the rents realized at our present properties or any newly-developed or acquired property.\nHuman Capital Management\nPurpose and Culture.\n We strive to differentiate ourselves by our culture and talent. How we manage our human capital is critical to how we deliver on our strategy and create sustained growth and value for our shareholders. We strive to improve the lives of our team members, customers, and shareholders one experience at a time. We recognize a great culture is foundational to the success of this vision. Key components in managing our human capital are listed below.\nCamden's Values. \nWe care deeply about our team members, our residents, and the local communities in which we live, work, and play. We are committed to maintaining a high-trust work environment which attracts, retains, and rewards the best and brightest people. We believe our workplace reflects Camden’s nine core values: Customer Focused; People Driven; Team Players; Lead by Example; Results Oriented; Work Smart; Always Do the Right Thing; Act with Integrity; and Have Fun. We believe these values cultivate an environment of respect, fairness, diversity, and fun for all.\nA Great Place to Work.\n In addition to our core values, we are committed to creating a great working environment that fosters all team members' well-being, health, and happiness. We believe our team members are given meaningful opportunities to provide feedback and effect change. We are proud of our culture and the recognition we have received as a great place to work, including being recognized nationally as one of the 100 Best Companies to Work For® by FORTUNE magazine for 17 consecutive years, most recently ranking #24. \nCompensation and Benefits.\n We provide high-quality health benefits and compensation to competitively compensate all team members for their contributions to Camden. We have formal programs intended to positively impact team members such as healthcare, rent discounts, education allowances, and scholarships for children of our employees.\nTraining and Development. \nOur mission, vision, and values are also incorporated into our employee training and development programs.\n \nOne of our most cherished mantras is \"Never Stop Learning.\" We encourage team members to discover their individual strengths and cultivate new interests. We offer tuition assistance to team members working to earn industry designations from various organizations. We also support team members who want to continue their education at an accredited educational institution through our Education Assistance Program. In addition to these programs, we also help employees improve their personal and professional lives through training, coaching, and mentoring. CamdenU, our in-house learning center, is available to all employees and offers courses in subjects related to leadership, management, and operations. In addition to formal training, Camden’s mentoring program supports its newest employees by pairing them with experienced employees to facilitate their on-boarding process and immerse them in Camden’s culture.\nAt December 31, 2024, we had approximately 1,660 employees including executive, community, and administrative personnel. Camden embraces all team members as full and valued members of the organization. \n2\nTable of Contents\nQualification as a Real Estate Investment Trust\nAs of December 31, 2024, we met the qualification of a REIT under Sections 856-860 of the Internal Revenue Code of 1986, as amended (the \"Code\"). As a result, with the exception of our taxable REIT subsidiaries, we will not be subject to federal income tax to the extent we continue to meet certain requirements of the Code.",
    "item1a": "Item 1A\n under the heading “Risk Factors-Risks Associated with Our Operations - A cybersecurity incident and other technology disruptions could negatively impact our business.\n”",
    "item1b": "Item 1B. Unresolved Staff Comments\nNone.",
    "item1c": "Item 1C. Cybersecurity\nAddressing cybersecurity risks is a priority for us. We have in place systems of internal controls as well as business continuity and disaster recovery plans, and we regularly perform assessments of these systems and plans to address cybersecurity and technology. Our cybersecurity program has been developed based on industry standards set by the National Institute of Standards and Technology (\"NIST\") and includes a comprehensive set of security policies and procedures which guide our protection strategy against threats by utilizing the following measures: identifying critical assets and high-risk threats; implementing cybersecurity detection, controls, and remediation practices; implementing a third-party risk management program to evaluate our cyber position; and, evaluating our cybersecurity program effectiveness by auditing risk and performing both internal and external testing.\nIn addition to a dedicated information technology cybersecurity team monitoring our daily operations, we annually assess our cybersecurity program against the NIST framework and engage outside security firms to conduct penetration tests and assist with monitoring of daily operations.\n \nWe require annual cybersecurity awareness training for all of our employees to aid in promptly identifying and reporting potential or actual issues. Additionally, our dedicated information technology cybersecurity team undertakes regular robust cybersecurity training to increase cybersecurity awareness, internal expertise, and readiness efforts.\n We install and regularly update antivirus software on all Company managed systems and workstations in an effort to detect and prevent malicious code. We conduct ongoing security breach and phishing simulations to raise awareness of various critical security threats. Periodically, we run tabletop exercises involving members of the Company's management team intended to simulate a response to a cybersecurity incident and use the findings to improve our policies and procedures. In addition to these procedures we have in place, we also maintain cybersecurity insurance to cover certain losses and damages caused by a cybersecurity incident. \nAll third-party service providers or vendors utilized as part of the Company’s cybersecurity framework are required to comply with our policies regarding non-public personal information and information security.\n \nOur cybersecurity program is led by our Senior Vice President - Strategic Services and Chief Information Officer (\"CIO\") and our Chief Information Security Officer (\"CISO\"). Our CIO also serves as the Chair of our Cybersecurity Executive Oversight Committee (\"CEOC\"), comprised of our CISO and other senior executives representing various teams and functions of the Company including legal, finance, accounting, investor relations, and operations.\n The CEOC supports efforts to evaluate the materiality of any incidents, determines whether notice to third parties such as residents or vendors is required, and determines whether any disclosures to stakeholders are required. \nThe CEOC is also responsible for ensuring the Company's management and Board of Trust Managers (\"Board\") are fully aware of key activities and events associated with our cybersecurity program on an ongoing basis.\n \n8\nTable of Contents\nOur entire Board is actively involved in overseeing risk management and the Audit Committee Charter tasks the Audit Committee with providing oversight of management's guidelines and policies to govern the process by which risk assessments and risks are managed, including the Company’s major financial risk exposures and the steps management has taken to monitor and control such exposures.\n \nThe Audit Committee also discusses with management the processes undertaken to evaluate our systems of disclosure controls and procedures, including those relating to cybersecurity risk management. \nOur CIO reports quarterly to the Audit Committee and Board regarding cybersecurity matters, which includes emerging cybersecurity threats and the risk landscape as well as updates on our cybersecurity program and related readiness, resiliency, and response efforts.\n \nLike other businesses, we have been, and expect to continue to be, subject to attempts on unauthorized access, mishandling or misuse, computer viruses or malware, cyber-attacks, and intrusions and other events of varying degrees. \nTo date, we have not experienced a material cybersecurity incident nor are we aware of any of our third-party outside service providers experiencing such an incident.\n \nFor a discussion on certain of the Company’s cybersecurity-related risks, see"
  }
}