{
  "ticker": "CRL",
  "cik": "0001100682",
  "company_name": "CHARLES RIVER LABORATORIES INTERNATIONAL, INC.",
  "filing_date": "2025-02-19",
  "accession": "0001100682-25-000011",
  "primary_doc": "crl-20241228.htm",
  "item_sections": {
    "item1": "Item 1. Business\nGeneral \nThis Annual Report on Form 10-K contains forward-looking statements regarding future events and the future results of Charles River Laboratories International, Inc. that are based on our current expectations, estimates, forecasts and projections about the industries in which we operate and the beliefs and assumptions of our management. Words such as “expect,” “anticipate,” “target,” “goal,” “project,” “intend,” “plan,” “believe,” “seek,” “estimate,” “will,” “likely,” “may,” “designed,” “would,” “future,” “can,” “could” and other similar expressions, which are predictions of, indicate future events and trends or which do not relate to historical matters are intended to identify such forward-looking statements. These statements are based on our current expectations and beliefs and involve a number of risks, uncertainties and assumptions that are difficult to predict. For example, we may use forward-looking statements when addressing topics such as: our expectations regarding the availability of non-human primates and our ability to diversify our non-human primate (NHP) supply chain; the outcome of (1) the U.S. government investigations and inquiries related to the NHP supply chain (including shipments of NHPs from Cambodia received by the Company), (2) the putative securities class action lawsuit filed against us and certain current/former officers on May 19, 2023, (3) the derivative lawsuit filed against members of the Board of Directors and certain current/former officers on November 8, 2023; and (4) the derivative lawsuit filed against certain current/former members of the Board of Directors and certain current/former officers on August 2, 2024; the timing and impact of the development and implementation of enhanced procedures to reasonably ensure that non-human primates we import are legally sourced; changes and uncertainties in the global economy and financial markets, including any changes in business, political, or economic conditions due to the November 16, 2022 announcement by the U.S. Department of Justice through the U.S. Attorney’s Office for the Southern District of Florida that a Cambodian non-human primate supplier and two Cambodian officials had been criminally charged in connection with illegally importing non-human primates into the United States; client demand, particularly future demand for drug discovery and development products and services, including the outsourcing of these services; our expectations with respect to our ability to meet financial targets; our expectations regarding stock repurchases, including the number of shares to be repurchased, expected timing and duration, the amount of capital that may be expended and the treatment of repurchased shares; our ability to successfully execute our business strategy; our ability to timely build infrastructure to satisfy capacity needs and support business growth; our ability to fund our operations for the foreseeable future; the impact of unauthorized access into our information systems, including the timing and effectiveness of any enhanced security and monitoring present spending trends and other cost reduction activities by our clients; future actions by our management; the outcome of contingencies; changes in our business strategy, business practices and methods of generating revenue; the development and performance of our services and products; market and industry conditions, including competitive and pricing trends and the impact of those conditions, including on our allowances for credit losses; our strategic relationships with leading pharmaceutical and biotechnology companies, venture capital investments, and opportunities for future similar arrangements; our cost structure; our expectations regarding our acquisitions and divestitures, including their impact and projected timing; our expectations with respect to revenue growth and operating synergies (including the impact of specific actions intended to cause related improvements); the nature, timing and impact of specific actions intended to improve overall operating efficiencies and profitability (and our ability to accommodate future demand with our infrastructure), including actions to optimize our global footprint, and gains and losses attributable to businesses we plan to close, consolidate, divest or repurpose and the impact of operations and restructuring actions (including as estimated on an annualized basis); our expectations with respect to study cancellation rates and the impact of such cancellations; our expectations with respect to tax rates and benefits; changes in our expectations regarding future stock option, restricted stock, performance share units and other equity grants to employees and directors; expectations with respect to foreign currency exchange; assessing (or changing our assessment of) our tax positions for financial statement purposes; our liquidity; and the impact of litigation, including our ability to successfully defend litigation against us. In addition, these statements include the impact of economic and market conditions on us and our clients, the effects of our cost-saving actions, including on an annualized basis, and the steps to optimize returns to shareholders on an effective and timely basis; and our ability to withstand the current market conditions.\nForward-looking statements are predictions and are subject to risks, uncertainties and assumptions that are difficult to predict. Therefore, actual results may differ materially and adversely from those expressed in any forward-looking statements. You are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this document or, in the case of statements incorporated by reference, on the date of the document incorporated by reference. Factors that might cause or contribute to such differences include, but are not limited to, those discussed in this Form 10-K under the sections entitled “Our Strategy,” “Risk Factors,” “Management's Discussion and Analysis of Financial Condition and Results of Operations,” in our press releases and other financial filings with the SEC. We have no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or risks. New information, future events or risks may cause the forward-looking events we discuss in this report not to occur.\n1\nCHARLES RIVER LABORATORIES INTERNATIONAL, INC.\nCorporate History\nWe began operating in 1947 and, since then, have undergone several changes to our business structure. Charles River Laboratories International, Inc. was incorporated in 1994 and we completed our initial public offering in 2000. Our stock is traded on the New York Stock Exchange under the symbol “CRL” and is included in the Standard & Poor’s 500 and Composite 1500 indices, the New York Stock Exchange (NYSE) Arca Biotechnology Index, the NYSE Composite and many of the Russell indices, among others. We are headquartered in Wilmington, Massachusetts. Our headquarters mailing address is 251 Ballardvale Street, Wilmington, MA, 01887, and the telephone number at that location is (781) 222-6000. Our Internet site is www.criver.com. Material contained on our Internet site is not incorporated by reference into this Form 10-K. Unless the context otherwise requires, references in this Form 10-K to “Charles River,” “we,” “us,” “the Company” or “our” refer to Charles River Laboratories International, Inc. and its subsidiaries.\nThis Form 10-K, as well as all other reports filed with the SEC, is available free of charge through the Investor Relations section of our Internet site (www.criver.com) as soon as practicable after we electronically file such material with, or furnish it to, the SEC. The SEC maintains an Internet site (http://www.sec.gov) that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC.\nOverview\nWe are a leading, non-clinical global drug development partner with a mission to create healthier lives. We have built upon our original core competency of laboratory animal medicine and science (research model technologies) to develop a diverse portfolio of discovery and safety assessment services, both Good Laboratory Practice (GLP) and non-GLP, that supports our clients from target identification through non-clinical development. We also provide a suite of products and services to support our clients’ manufacturing activities. Utilizing our broad portfolio of products and services enables our clients to create a more efficient and flexible drug development model, which reduces their costs, enhances their productivity and effectiveness, and increases speed to market.\nThe development of new drugs requires a steadily increasing investment of time and money. Various studies and reports estimate that it takes between 10 to 15 years, up to $2.5 billion excluding time costs and exploration of between 10,000 and 15,000 drug molecules to produce a single Food and Drug Administration (FDA)-approved drug. \nDiscovery represents the earliest stages of research in the life sciences, directed at the identification, screening, and selection of a lead molecule for future drug development. Discovery activities typically extend anywhere from 4 to 7 years in conventional pharmaceutical research and development (R&D) timelines.\nDevelopment activities, which follow, and which can take up to 7 to 10 years, are directed at demonstrating the safety, tolerability and clinical efficacy of the selected drug candidates. During the non-clinical stage of the development process, a drug candidate is tested \nin vitro\n (non-animal, typically on a cellular or sub-cellular level in a test tube or multi-well petri plate) and \nin vivo\n (in research models) to establish drug safety prior to and in support of human clinical trials.\nFor over 75 years, we have been in the business of providing the research models required in the research and development of new drugs, devices and therapies. Over this time, we have built upon our core competency of \nin vivo\n biology to develop a diverse and expanding portfolio of products and services, which now encompasses the broader non-clinical drug research process. We are positioned to leverage our leading portfolio in non-clinical drug research in an efficient and cost-effective way to aid our clients in bringing their drugs to market faster.\nOur client base includes major global pharmaceutical companies, many biotechnology companies; \nagricultural and industrial chemical, life science, veterinary medicine, medical device, diagnostic and consumer product companies; contract research and contract manufacturing organizations; and other commercial entities, as well as leading hospitals, academic institutions, and government agencies\n around the world. In recent years, we have focused our efforts on improving the efficiency of our global operations to enhance our ability to support our clients. Our pharmaceutical and biotechnology clients are increasingly seeking full service, “one-stop” global partners to whom they can outsource more of their drug discovery and development efforts. It is estimated that the market for regulated safety assessment services is 60% outsourced or more, while emerging growth areas such as discovery and certain research model services are currently believed to be less outsourced.\nWe currently operate in over 130 sites and in over 20 countries worldwide (excluding certain Insourcing Solutions sites). Our products and services, supported by our global infrastructure and deep scientific expertise, enable our clients to overcome many of the challenges of non-clinical life sciences research. In 2024, our total revenue was $4.0 billion. As part of our efforts to manage the Company through the current demand environment, we have undertaken a comprehensive review of our global footprint. Through these optimization initiatives, we expect to close or consolidate approximately 15 additional sites over the next two years, principally focused on the DSA and RMS segments. These footprint optimization efforts will enhance the efficiency and economies of scale in our global infrastructure, leading to a more disciplined operating model.\n2\nCHARLES RIVER LABORATORIES INTERNATIONAL, INC.\nWe have three reportable segments: Research Models and Services (RMS), Discovery and Safety Assessment (DSA) and Manufacturing Solutions (Manufacturing).\nThrough our RMS segment, we have provided foundational tools for the discovery of new molecules by supplying research models to the drug development industry since 1947. We continue to maintain our position as a global leader in the production and sale of the most widely used research models, including over 140 different stocks and strains of purpose-bred rodents. We also provide a variety of related services that are designed to support our clients in the use of research models in drug discovery and development. We maintain multiple production centers, including barrier rooms and isolator facilities, on three continents (North America, Europe, and Asia). We are also a premier provider of high quality, purpose bred, large research models to the biomedical research community. \nOur RMS segment also includes our \nInsourcing Solutions \nbusiness, which includes our CRADL\n™\n (Charles River Accelerator and Development Lab) footprint. \nIn 2024, RMS accounted for 20.5% of our total revenue and approximately 4,100 of our employees, including approximately 200 science professionals with advanced degrees.\nOur DSA segment provides services that enable our clients to outsource their innovative drug discovery research, their related non-clinical and clinical bioanalytical activities, and regulatory-required safety testing of potential new drugs, vaccines, industrial and agricultural chemicals, consumer products, veterinary medicines and medical devices. The demand for these services is driven by the needs of large global pharmaceutical companies where outsourcing may complement internal activities, in addition to mid-size and emerging biotechnology/biopharma pharmaceutical companies, hospitals, academic institutions, contract research organizations, and industrial and agrochemical companies and non-governmental organizations that rely more heavily on outsourcing partners. Many of these entities choose to outsource their discovery, development, bioanalytical and/or safety assessment activities to reduce fixed costs and to gain access to scientific expertise, robust capabilities, and regulatory experience. \nWe are the largest provider of outsourced drug discovery, non-clinical development and regulated safety testing services worldwide. We have extensive expertise in the discovery of clinical candidates and in the design, execution and reporting of safety assessment studies for numerous types of therapeutic modalities, including cell and gene therapies, small and large molecule pharmaceuticals, industrial and agricultural chemicals, vaccines, consumer products, veterinary medicines, biocides and medical devices. We currently provide discovery and safety assessment services at multiple facilities located in the United States (U.S.), Canada, and Europe. In 2024, our DSA segment represented 60.5% of our total revenue and employed approximately 12,100 of our employees including approximately 1,500 science professionals with advanced degrees. \nWithin our Manufacturing segment, we work with our clients and the biopharmaceutical industry to ensure the quality and safe production and release of commercial therapies and products manufactured both by our clients and internally for our clients. Our Manufacturing Segment is comprised of two businesses: Microbial Solutions and Biologics Solutions. Our Microbial Solutions products and services businesses provide \nin vitro\n methods for conventional and rapid quality control testing of sterile and non-sterile pharmaceuticals and consumer products. Biologics Solutions is comprised of both our Biologics Testing Solutions business, which provides specialized testing of biologics frequently outsourced by global pharmaceutical and biotechnology companies, and our contract development and manufacturing products and services (“CDMO”) business, which provides comprehensive contract development and manufacturing solutions for cell and gene therapies. In 2024, Manufacturing accounted for 19.0% of our total revenue from continuing operations and approximately 2,800 of our employees, including approximately 380 science professionals with advanced degrees. \nResearch Models and Services\n. Our RMS segment is comprised of three businesses that provide foundational tools that enable our clients to discover new molecules: Research Models, Research Model Services and Cell Solutions.\nResearch Models\n. Our Research Models business is principally comprised of the production and sale of the most widely used small research models, primarily rodents. A significant portion of our Research Models business involves the commercial production and sale of small research models, principally purpose-bred rats and mice for use by researchers in fundamental biology through to drug discovery and development. The FDA and foreign regulatory agencies typically require that the safety and efficacy of new drug candidates be tested on research models like ours prior to testing in humans. As a result, our research models are an essential part of the drug discovery and development process. \nWe provide our research models to numerous clients around the world, including most pharmaceutical companies, a broad range of biotechnology companies, contract research organizations and many government agencies, hospitals, and academic institutions. We have a global footprint with production facilities strategically located in 7 countries, in close proximity to major biohubs and client concentrations. Our research models include commonly used laboratory strains, disease models and specialized strains with compromised immune systems, which are in demand as early-stage tools in the drug research and development process. \nThe research models we supply have been, and continue to be, some of the most extensively used in the world, largely as a result of our geographic footprint and continuous commitment to innovation, quality, and biosecurity. Our research models are bred and maintained in controlled environments, which are designed to ensure that the models are free of specific viral and \n3\nCHARLES RIVER LABORATORIES INTERNATIONAL, INC.\nbacterial agents and other contaminants that can disrupt research operations and distort scientific results. With our production capabilities, we are able to deliver consistently high-quality research models worldwide. \nOur small research models include inbred, outbred, and hybrid strains, as well as mutant strains, genetically engineered models and humanized models with biological features, which enable research aims. Certain of our research models are proprietary rodent models used to research treatments in several therapeutic areas. We are also a premier provider of high quality, purpose bred, large research models to the biomedical research community. While we provide some non-human primates directly to clients who utilize them primarily for safety testing of new therapies, most of the non-human primates associated with our business are utilized in connection with our clients’ studies conducted by our Safety Assessment services in our DSA business. In both cases - non-human primates we provide directly to clients and non-human primates which are utilized through our Safety Assessment services – these large research models are sourced from Charles River audited and approved suppliers, some of which we have an ownership and/or operational involvement. \nResearch Model Services.\n RMS offers a variety of flexible solutions designed to support our clients' use of research models in basic research and screening pre-clinical drug candidates. These services address the need among pharmaceutical and biotechnology companies to outsource the non-core aspects of their drug discovery activities. Our services include those related to the maintenance and monitoring of research models, and managing research operations for government entities, academic organizations, and commercial clients. Our expanded service offering provides greater flexibility for our clients’ research and supports increased scientific complexity. We currently have three service offerings in research models services: Insourcing Solutions, Genetically Engineered Models and Services (GEMS), and Research Animal Diagnostic Services (RADS).\nInsourcing Solutions\n. We manage the research operations of government entities, academic organizations and commercial clients (including recruitment, training, staffing and management services) both within our clients’ facilities and utilizing our Charles River Accelerator and Development Lab (CRADL™) offerings, where we provide vivarium space to our clients. Some research institutions prefer to retain certain elements of their research in-house, while outsourcing staffing and management, thus driving demand for our services. We believe that our expertise in early-stage drug research, and in particular research model care, scientific and technical support, facility operations, and discovery and development services, enhances the productivity and quality of our clients’ research programs.\nGenetically Engineered Models and Services\n. We create, breed and maintain research models required by our clients for biomedical research activities. The creation of a genetically engineered model (GEM) is a critical scientific event, but it is only one step in the discovery process, and our scientists can advise clients on how to efficiently create custom models utilizing in-licensed technologies and approaches to modify the genome. Productive utilization of GEMs requires significant additional technical expertise in order to properly support basic and early discovery research. We provide breeding expertise and colony expansion, quarantine, health and genetic testing and monitoring, germplasm cryopreservation and rederivation, including assisted reproduction and model creation. Our team of project managers is supported by a proprietary, technologically advanced Internet Colony Management (ICM™) system that allows for real-time data exchange. We provide these services to clients around the world, including pharmaceutical and biotechnology companies, hospitals, universities, and government agencies.\nResearch Animal Diagnostic Services\n. We monitor and analyze the health profiles of our clients’ research models and research biologics by assessing infectious agents and pathology. We developed this capability internally to address the quality control of our research model business. We can serve as our clients’ sole-source testing laboratory, or as an alternative source supporting our clients’ internal laboratory capabilities. We believe we are the reference laboratory of choice for health assessment of laboratory research models and an industry leader in the field of laboratory animal diagnostics.\nCell Solutions\n. Our Cell Solutions business provides consenting human donor-derived cellular materials used in the development and production of cell therapies. The business supplies controlled, consistent, customized primary cells and blood components derived from normal and mobilized peripheral blood and bone marrow, as well as cells from disease state donors. Our Cell Solutions business supports biotechnology and pharmaceutical companies, academic institutions and other research organizations who rely on high-quality, viable and functional human primary cells and blood components for biomedical and drug discovery research and cell therapy development, including clinical trials. \nDiscovery and Safety Assessment\nWe currently offer regulated and non-regulated DSA services to support the discovery, development, and regulatory-required safety testing of potential new drugs, including \nin vitro\n and \nin vivo \nstudies, laboratory support services, including bioanalytical and strategic non-clinical consulting and program management.\nIn 2025, we initiated the integration of our Discovery Services and Safety Assessment businesses into one overarching DSA organization. This unification focuses on a combined sales force and leadership approach, with integrated scientific expertise to facilitate a more seamless client experience and make us a stronger and even more responsive partner for our clients. \n4\nCHARLES RIVER LABORATORIES INTERNATIONAL, INC.\nDiscovery Services\n.\n We offer a single source of services for discovering and characterizing novel drug candidates for preclinical development by providing a full spectrum of discovery services — from identification and validation of novel targets, low molecular weight small molecule compounds, oligonucleotides, and biotherapeutics with actual or potential intellectual property value, through to delivery of preclinical drug and biotherapeutic candidates ready for safety assessment and progression toward the clinic. This includes services to streamline and enhance drug discovery programs for our clients, including expertise and capabilities in all stages of discovery and all major modalities including small molecules, biologics (antibodies), oligonucleotides, and cell and gene therapies. In the discovery phase, we leverage our capabilities in non-GLP toxicity assessment and predictive models to enable identification and mitigation of safety issues to ensure a smooth progression into regulatory safety assessment. We have in depth capabilities in formulation and pharmaceutics to provide seamless transfer of optimized drug substance from the discovery phase into pre-clinical development and safety assessment. Our Safety Assessment teams can flag unexpected issues observed in regulatory toxicology to our Discovery Services team that might be resolved by further optimization within Discovery Services, enabling clients to potentially regain momentum in pre-clinical programs after resolution of the issues. Our seamless offering portfolio, along with our broad expertise and capabilities allow us to better engage with clients at any stage of their drug discovery programs and support their complex scientific needs. We focus on major therapeutic areas, with a strategic emphasis on neuroscience, oncology, and immunology. We believe there are growing opportunities to assist our clients in a variety of drug discovery applications and platforms, from target discovery to candidate selection and across the full range of modalities. \nWe are a leader in integrated drug discovery services. Our full suite of service offerings, together with our knowledge and expertise, allows us to engage and support our clients at any stage of their discovery or early-stage development programs, including the design and implementation of their research programs, and to stay with them through the entire drug discovery process, providing a seamless end-to-end offering. Our offerings include:\n•\ntarget discovery and validation;\n•\ndisease biology;\n•\ntarget deconvolution through proteomics and cell microarray technology;\n•\nhit identification, hit-to-lead progression and lead optimization to deliver candidate molecules and biotherapeutics across modalities, making use of state-of-the-art techniques such as computer-aided drug design, structural biology and machine learning/artificial intelligence;\n•\nearly non-clinical pharmacokinetic and pharmacodynamic studies, transporter-mediated drug-drug interaction, and \nin vitro \nand \nin vivo\n assays to assess mechanism, bioavailability and metabolism as required for regulatory approval; \n•\nappropriate \nin vivo \nDiscovery Services evaluation, which is essential to generate confidence in the initial safety of a novel therapeutic agent, its fate in an intact mammalian system and its potential to translate into an efficacious treatment in humans;\n•\ntarget engagement and safety biomarker development to support non-clinical and potentially downstream clinical studies.\nSafety Assessment. \nWe offer a full range of safety assessment studies required for regulatory submission on a global basis across all therapeutic areas in the pharmaceutical, biotechnology, industrial chemical, agrochemicals, consumer products, veterinary medicines and medical devices industries. We are a global leader in both non-regulated and regulated GLP outsourced safety assessment services and provide expertise in a variety of therapeutic areas and modalities.\nToxicology.\n In addition to offering standard toxicology services, we also provide a broad range of specialty toxicology offering from inhalation and infusion to developmental and reproductive toxicology. Our services include an extensive offering of capabilities and study types designed to identify possible safety risks as well as a comprehensive offering of \nin vitro\n and \nin vivo\n studies in support of general toxicology (acute, sub-acute and chronic studies), genetic toxicology, safety pharmacology, off-target screening, receptor identification profiling, reproductive and developmental toxicology, juvenile toxicology, and carcinogenicity bioassays that are required for regulatory submissions supporting “first-in-human” to “first-to-the-market” strategies for potential human therapeutics. Additionally, we support safety studies in numerous specialty areas including cell and gene therapies, ecotoxicology, environmental risk, musculoskeletal toxicology, neurotoxicology, ocular toxicology, ototoxicology, and phototoxicology. We have expertise in the design and execution of development programs in support of a broad diversity of therapeutic modalities in numerous laboratory species and test systems. We also support safety studies to test industrial chemical, agrochemicals, consumer products, veterinary medicines and medical devices. For human pharmaceutical candidates, once a lead candidate is selected, toxicology studies are required to support clinical trials in humans and for regulatory approval. These toxicology studies focus on assessing the safety of the potential therapeutic to determine if administration to humans might cause any unintended harmful effects. For new chemicals, industrial chemicals, agrochemicals, veterinary medicines, consumer products and medical devices, safety studies are performed to identify potential hazards to \n5\nCHARLES RIVER LABORATORIES INTERNATIONAL, INC.\nhumans and the environment and are required for regulatory registration. Toxicology studies performed for any of these compounds are typically performed using \nin vitro\n and \nin vivo\n research models to identify any potential adverse effects that a compound has on an organism or tissue over a variety of doses and over various time periods of exposure.\nPathology Services.\n The ability to identify and characterize clinical and anatomic pathologic changes is critical in determining the safety and efficacy of potential new therapeutics, industrial and agricultural chemicals, veterinary medicines, and medical devices. Key “go/no-go” decisions regarding continued product development are typically dependent on the identification, characterization and evaluation of fluid, tissue and cellular changes that our experts identify and interpret for our clients. We employ many highly trained veterinary anatomic and clinical pathologists and other scientists who use state-of-the-art techniques to identify potential test item-related changes. In addition to all standard anatomic and clinical pathology techniques, we provide specialized evaluations such as digital primary and peer review histopathology options, cytology, platelet function, assay development, immunohistochemistry, in situ hybridization, image analysis, tissue morphometry and spatial analysis services.\nSafety Pharmacology.\n Our clients are also required to conduct an assessment of safety pharmacology. This suite of studies is used to determine any effects on the vital organ systems of the body - cardiovascular, respiratory and central nervous system (CNS). Along with heart rate and blood pressure measurements, the cardiovascular assessment will also assess if the test article has the potential to alter cardiac ion channel currents and prolong the cardiac QT interval of the electrocardiogram. Additionally, effects on the CNS and respiratory systems are assessed to complete the battery of studies to evaluate the vital organ systems of the body. Supplemental studies can also be performed to assess the renal, gastrointestinal and autonomic nervous systems, as well as dependency potential. We have \nin vitro\n, \nex vivo \n(use of cells, tissues or organs outside of an \nin vivo\n system) and \nin vivo\n assays and perform the screening prior to the initiation of first-in-human clinical trials. Our capabilities can also be used to investigate the mode of action behind an adverse effect found in a safety assessment study.\nBioanalysis, Drug Metabolism and Pharmacokinetics\n. In support of non-clinical drug safety testing and new chemical development, our clients are required to demonstrate appropriate stability in the collected biological sample, pharmacokinetics of their drug or compound in circulation, the presence of metabolites and, in the case of biologics, the presence or absence of anti-drug antibodies. We have scientific expertise in the sophisticated bioanalytical techniques required to satisfy these requirements for many drugs and chemicals. Once analysis is complete, our scientists evaluate the data to provide information on the pharmacokinetics and/or toxicokinetics of the drug or chemical and complete an evaluation of the biologic disposition of the drug or chemical and its potential metabolites. Pharmacokinetics refers to the understanding of what the body does to a drug or compound administered at therapeutic dose levels, including the process by which the drug is absorbed, distributed in the body, metabolized and excreted. Toxicokinetics refers to the same understanding as applied at higher doses that may result in adverse effects. These studies are routinely required for the full non-clinical assessment of the disposition of the drug or chemical and the results are used in the safety evaluation of the compound. After performing sample analysis in support of non-clinical studies, we also support the clinical bioanalysis required in clinical trials for drug development. In addition, our Laboratory Sciences group is able to measure a wide range of non-clinical and clinical biomarkers related to the safety and efficacy of the drugs and/or chemicals being developed.\nOur Safety Assessment facilities comply with animal welfare and GLP regulations to the extent required by the FDA, Environmental Protection Agency, United States Department of Agriculture (USDA), Centers for Disease Control and Prevention (CDC), European Medicines Agency, European Chemicals Agency and the Organization for Economic Co-operation and Development (OECD), Canadian Council on Animal Care (CCAC) as well as other international regulatory agencies. Furthermore, our non-GLP and early-stage discovery work performed at our Safety Assessment facilities, which are not subject to GLP regulations, is typically carried out under a quality management system. Our Safety Assessment facilities and Manufacturing facilities are regularly inspected by regulatory compliance monitoring authorities, our clients’ quality assurance departments and our own internal quality audit program.\nManufacturing Solutions\nOur Manufacturing Solutions segment is comprised of two businesses: Microbial Solutions and Biologics Solutions.\nMicrobial Solutions\n. Our Microbial Solutions business operates as a rapid, efficient testing platform for microbial detection and identification of sterile and non-sterile applications. Microbial Solutions is a premier global provider of \nin vitro\n methods for conventional and rapid quality control testing, including FDA-mandated lot release testing for sterile biopharmaceutical products. The products and services are provided by our Endosafe®, Celsis® and Accugenix® businesses, which produce, globally distribute and service a comprehensive portfolio of endotoxin testing, microbial detection and identification kits, reagents, instruments, software, accessories, and laboratory services to a broad range of companies manufacturing and releasing products from the pharmaceutical, biotechnology, medical devices and consumer products companies. Our Endosafe® business provides lot release testing of medical devices and injectable drugs for endotoxin contamination. Our Celsis® business provides rapid microbial detection systems for lot release testing as well as raw materials and in-process for quality control testing in the pharmaceutical, medical device and consumer products industries. Our Accugenix® business provides state-of-the-art microbial \n6\nCHARLES RIVER LABORATORIES INTERNATIONAL, INC.\nidentification services and products for manufacturing in the biopharmaceutical, medical device, nutraceutical and consumer care industries. We expect our comprehensive portfolio of offerings and global network of laboratories to drive increased adoption of our quality control testing solutions across both sterile and non-sterile applications.\nEndosafe\n®\n. We are a market leader in endotoxin testing products and services, which are used for FDA-required quality control testing of injectable drugs and medical devices, their components, and the processes by which they are manufactured. Endotoxin testing is an \nin vitro\n process that uses a processed extract from horseshoe crabs, known as limulus amebocyte lysate (LAL). The LAL test is the first and most successful FDA-validated alternative to an \nin vivo\n test to date. Generally, the extraction of the raw materials for LAL does not harm the crabs, which are subsequently returned to their natural ocean environment. We have worked closely with regulatory agencies in states where we collect to limit our impact on the horseshoe crab population and their surrounding environment.\nOne of the primary growth drivers in our Microbial Solutions business is our FDA-approved line of next-generation endotoxin testing products. This line is based on the Endosafe Portable Testing System (Endosafe® -PTS™) technology, which allows rapid endotoxin testing in the central laboratory or manufacturing environment. In recent years, we expanded the PTS product portfolio to include a multiple sample testing system known as the Endosafe®-MCS™ (multi-cartridge system) and the first fully automated robotic system developed specifically for high-volume endotoxin testing, Endosafe®-Nexus, to satisfy the demand of our clients who require higher sample throughput. We have seen expanded use of this rapid endotoxin testing technology as clients transition from traditional methods to our rapid cartridge technology and are seeking to meet data integrity requirements with our automated systems and software solutions. In 2023, we launched Endosafe® Trillium®, our animal-free recombinant test for endotoxin detection. Endosafe® Trillium® utilizes three biological proteins, which we believe provides superior accuracy and testing outcomes to competitors’ single-protein recombinant alternatives, as well as equivalence to LAL-based testing method. Endosafe® Trillium® represents a next-generation solution to our industry-leading Endosafe® bacterial endotoxin detection portfolio.\nCelsis\n®\n. The Celsis® reagents and instrument systems are used for in-process and product-release testing to help ensure the safe and efficient manufacture of pharmaceutical and consumer products. Celsis® products utilize adenosine triphosphate bioluminescence technology for the rapid detection of microbial contamination delivering definitive results for some applications as fast as 24 hours. The product range includes reagent kits, instruments, software and services. The Celsis Advance II™, Celsis Accel™, and Celsis Adapt™ instruments and software automate the process for rapid microbial detection. We maintain a suite of products focused on sterility testing. Sterility testing is required prior to the release of sterile injectable products. The legacy method required a 14-day sample incubation period and was subjective. Using the Celsis® protocol and instrumentation, clients can detect contamination within 6 days and make definitive product release decisions. We also offer Celsis Complete™ and Celsis Advantage™ services. The Celsis Complete™ services supply both the documentation and testing required as part of a client sterility technology method validation process. This assists clients to complete their validation process very quickly without utilizing their own personnel resources. The Celsis Advantage product supplies the required documentation needed for the clients to conduct their own internal validation. The Celsis Adapt™ is an accessory instrument for the Celsis® rapid detection systems, which is used to prepare and concentrate samples and provide a rapid testing solution for advanced therapy medicinal products, cell therapies, gene therapies, and other cell-containing products. \nAccugenix\n®\n. Our Accugenix\n®\n global lab network is the premier provider of ISO17025-accredited contract microbial identification services. Accugenix\n®\n is an industry leader in species-level identification and strain typing of bacteria and fungi that are recovered from manufacturing facilities. Utilizing state-of-the-art and proprietary technologies, coupled with scientific expertise and analysis from a network of nine global labs, Accugenix\n®\n excels in providing accurate, timely, and cost-effective microbial identification services and products required to meet internal quality standards and government regulations. Accugenix\n®\n also offers an in- house solution with our Axcess\n®\n instrument that allows clients to perform identification testing in their own lab with access to our proprietary library.\nBiologics Solutions\n. Our Biologics Solutions (Biologics) business is comprised of our Biologics Testing Services business and CDMO business. \nBiologics Testing Services\nOur Biologics Testing Services business provides clients with analytical testing and related capabilities to support the safe manufacture of their biologic drugs, as well as a suite of manufacturing services to produce our clients’ advanced therapeutics. \nOur current Good Manufacturing Practices (cGMP) testing services facilities also grow and store well-characterized early-stage client cell lines and virus seed stocks for later development or manufacture of therapeutic proteins and vaccines for clinical trials. We further design and provide viral clearance programs according to GLP at our German facility and cGMP at our U.S. facility for Phase I, II and III human clinical studies as well as for market authorization.\nWe perform specialized testing of biologics frequently outsourced by pharmaceutical and biotechnology companies globally and are a partner in navigating the complex pathway to biologic effectiveness. Our laboratories in the U.S., Germany, Ireland \n7\nCHARLES RIVER LABORATORIES INTERNATIONAL, INC.\nand France provide timely and regulatory-compliant services in the areas of analytical, molecular biology, virology, cell-based bioassays, bioanalysis, immunochemistry, microbiology, cell biology, \nin vivo\n and \nin vitro \nstudies and related services. We provide analytical characterization, lot release and safety testing support for chemistry, manufacturing and controls and investigational new drug (IND) filings and confirm that biomanufacturing of clinical drug candidates and commercial drugs are consistent, correctly defined, stable and essentially contaminant free. This testing is required by the FDA, EMA and other international regulatory authorities for our clients to obtain new drug approvals, to maintain government-licensed manufacturing facilities and to manufacture and release market-approved therapeutic products for patient treatment.\nWe continue to look for opportunities to expand our Biologics Testing Solutions service offerings and facilities in the U.S. and Europe. We have also commissioned a biosafety level 3 (BSL3) facility to provide \nin vivo \nand \nin vitro\n testing services for BSL3 materials, such as SARS-CoV2.\nCDMO Services\nOur CDMO business operates in the three major areas of the high-growth advanced therapy CDMO market: cell therapy, viral vector, and plasmid DNA production. Our CDMO services include expertise in gene-modified and unmodified cell therapy manufacturing coupled with capabilities in viral vector manufacturing, as well as plasma DNA. Our CDMO services establish us as a premier scientific partner for cell and gene therapy development, testing, and manufacturing. The fully integrated advanced therapeutics portfolio enables us to provide clients with an integrated solution from basic research and discovery through cGMP production; driving efficiency and accelerating clients’ speed-to-market by integrating preclinical CRO activities with manufacturing and testing. This provides our clients with a seamless experience across the value chain with the same advanced therapeutics scientific partner. Our cGMP CDMO facilities have the capability to manufacture and store raw materials, drug substance, and drug product, which are suitable for use in clinical trials as well as for commercial manufacturing. \nOur Strategy\nOur objective is to be the scientific partner of choice to accelerate biomedical research and therapeutic innovation. Our strategy is to deliver a comprehensive and integrated portfolio of drug discovery and non-clinical development products, services and solutions to support our clients’ discovery and early-stage drug research, process development, scale up, manufacturing and product release efforts, and enable them to bring new and improved therapies to market faster and more cost effectively. \nWe believe we have certain competitive advantages in executing this strategy because of our continuing focus on the following:\nIntegrated Early-Stage Portfolio\n. Our large, global portfolio of products, services and solutions focuses on drug discovery and early-stage development. We provide research models and associated services, discovery research studies and services and comprehensive safety assessment studies in both regulated and non-regulated environments. As such, we can collaborate with clients from target discovery through development candidate selection. When critical decisions are made regarding which therapeutics will progress from discovery to development, we continue to work alongside our clients as the drug candidates move downstream. Our recognized expertise in early-stage drug research and pharmacology provides us with a competitive advantage and enables our clients to make critical drug development decisions more quickly. We understand our clients’ therapies and the challenges they face during the discovery and development process, including mechanism of action, efficacy, drug metabolism, safety assessment and toxicological testing, which are all critical for making “go/no-go” decisions.\nComprehensive Biopharmaceutical Manufacturing Portfolio. \nWe also offer a portfolio of products, services and solutions that supports the process development, scale up, quality control and production efforts of the biopharmaceutical industry. We provide products and services that support the development and release of clinical stage and commercialized biologics products, including CDMO services to manufacture advanced therapeutics for our clients. In particular, we are an industry leader in the areas of microbial detection and microbial identification to support process development and ongoing commercial production. Our portfolio spans a broad range of traditional and rapid methods, which provide the highest testing quality, enhanced productivity and reduced cycle time. \nDeep Scientific Expertis\ne. We provide a breadth and depth of scientific expertise across a broad range of therapeutic areas which may be too costly for our clients to build and/or maintain in-house. We provide essential capabilities, including medicinal chemistry, \nin vitro\n biology, \nin vivo\n pharmacology, pathology, advanced modalities manufacturing, analytical testing for early and late stage products, immunology, biomarker assessment, biologics process development testing, microbial detection and identification and other specialty service areas that have high infrastructure costs or are cost-prohibitive for clients to maintain independently. We continue to look for opportunities to expand our portfolio in key therapeutic and pharmacology areas to align with our clients’ internal drug discovery and development areas of focus. We also continue to enhance our small molecule, biologics, and advanced modalities portfolios in areas of greatest industry need, where outsourcing provides major benefits for our clients and where we could provide significant benefits given our unique early-stage development portfolio and global footprint.\n8\nCHARLES RIVER LABORATORIES INTERNATIONAL, INC.\nCommitment to Animal Welfare\n. We are committed to being the worldwide leader in the humane care of research animals and implementation of the “3Rs” initiative (Replacement, Reduction, and Refinement). As researchers, we are responsible to our clients, our animals and the public for the health and well-being of the animals in our care. We work closely with the scientific community to understand how living conditions, handling procedures and reduction of stress play an important role in the quality and efficiency of research. We are committed to working with the industry to support development and to provide the best translational models to supplement or replace traditional live animal models. These include \nin vitro \nmodels, \nin silico\n predictive tools, and virtual control groups. \nSuperior Quality and Client Support\n. We maintain scientific rigor and high-quality standards through management of key performance indicators and an intense focus on biosecurity and quality. These standards help to reduce research risk and allow clients to access our global portfolio of products and services with the confidence that they will obtain consistent results no matter where they choose to obtain their products or conduct their research. \nFlexible and Customized Environment to Provide the Right Solutions\n. Each of our clients is different, with unique needs and specific requirements. We understand the importance of flexibility, and leverage the expertise embedded in our integrated, non-clinical portfolio to provide customized solutions tailored to the specific need or therapeutic area for a particular client. By utilizing our streamlined and efficient facilities, we help clients create a flexible and integrated infrastructure in order to improve their workload and staffing requirements. This allows our clients to optimize internal capacity and/or staff while ensuring the conduct of effective quality research for their projects. We provide enhanced value to clients who use us as a full-service integrated partner over a longer period of time.\nLarge, Global Partner\n. We believe there is an important advantage in being a full service, high-quality provider of research models and associated services, discovery and non-clinical\n in vivo\n and \nin vitro\n services and manufacturing solutions on a global scale. Many of our clients, especially large biopharmaceutical companies, have decided to limit the number of suppliers with which they work. They frequently choose to partner with large companies similar to Charles River, that can offer clients support across the non-clinical drug research process as a result of broader portfolios and experience in project management. This includes extensive scientific, technical and therapeutic area expertise, timely access to data, documentation and data visualization through secure portals, provision of data in sponsor-specific formats for data warehousing needs, accelerated reporting, reduced standard reporting timelines and industry-leading Standard Exchange of Non-Clinical Data (SEND) capabilities, a global footprint, streamlined and simplified processes and communications, including professional project and relationship management. We are focused on leveraging our competitive advantages to ensure we are recognized as the premier preferred provider, thereby enabling us to build broader and deeper long-term strategic relationships with our clients.\nDigital Enhancements. \nAs the healthcare industry evolves, technology is playing an essential role. This technological revolution is not only helping streamline processes and operations, but the effects of this digitization directly impact patients. We are committed in our efforts to reduce the timeline to develop, safe and innovative new treatments for patients who desperately need them. To progress this forward, we strive to understand the true challenges that can slow drug research and development and re-imagine the way we work and collaborate to create digitally native solutions that improve efficiency, accelerate processes and enable automated, data driven outcomes. Our commitment to understanding the problem before finding a solution has enabled us to keep clients—and ultimately patients—at the center of the way we look at problems. By using client-centric design thinking, agile-based test and learn processes in short iterative cycles, and automating existing processes, we optimize client experiences and bring holistic solutions to pressing concerns. \nOur clients’ R&D needs continue to evolve. These clients are increasingly emphasizing studies that have greater translation to the clinic so that they can make appropriate decisions regarding the progression of potential therapeutic entities earlier in the development process. The result is a focus on discovery services, including \nin vitro \nmodels and\n in vivo\n pharmacology studies consisting of efficacy and non-GLP DMPK (drug metabolism and pharmacokinetics) studies. Second, these clients are choosing to outsource additional discovery and safety assessment services to increase the efficiency and effectiveness of their drug selection processes.\nWe believe that this changing environment will provide enhanced outsourcing opportunities for us in the future. We remain optimistic that our clients are increasingly receptive to partnering with us as a means of meeting their discovery and non-clinical support needs. We believe that the successful development of new therapies and outsourcing by the pharmaceutical industry will continue to be positive drivers of demand for our products and services.\nGlobal biopharmaceutical companies are continuing to make the decision to outsource more significant tranches of their drug discovery, development and manufacturing processes. The success of our business model is underscored by the fact that we have entered into strategic commercial relationships with leading global biopharmaceutical companies and expanded existing preferred provider agreements with other leading global biopharmaceutical companies. We also continue to broaden and extend our relationships with other research institutions across the portfolio. \n9\nCHARLES RIVER LABORATORIES INTERNATIONAL, INC.\nWe believe that larger biopharmaceutical companies will increasingly focus on efficiencies and execution. They will continue to reassess their core differentiators from R&D to commercialization, and which aspects of their drug discovery, development and manufacturing processes they will choose to outsource. We expect they will also continue to be conservative in building infrastructure and expertise. This should lead to more opportunities for strategic outsourcing as larger biopharmaceutical clients choose to utilize external resources rather than invest in internal infrastructure. By partnering with Charles River, we believe our clients can take advantage of efficiencies in their early-stage research activities that can result in months saved in getting a drug to market. In the aggregate, we believe that the evolving large biopharmaceutical R&D business model along with our focus on data and digitalization will make our essential products and services even more relevant to our clients, and allow them to leverage our integrated offerings and expertise to drive their research, non-clinical development and manufacturing efficiency and cost effectiveness.\nWe believe it is critical to participate in the strategic commercial partnering process because these relationships are likely to extend for multiple years and drive pull-through across our portfolio. Furthermore, both the client and Charles River invest heavily in the initial phases of the relationship to successfully transfer work streams and establish governance processes. Given this investment, clients are less likely to change partners at the conclusion of the initial relationship. \nThe evolving biopharmaceutical R&D business model, coupled with solid long-term biopharmaceutical industry fundamentals and a historically sustained funding environment, have also led to the continued creation of new biotechnology companies focused on developing innovative new therapies. The biopharmaceutical industry continues to evolve and become more sophisticated, with research yielding new types of treatments with increasing complexity, and more targeted and individualized therapies. While the recent biopharmaceutical demand environment has been less robust, we believe that our portfolio provides flexible solutions and scientific expertise that meet the customized needs for virtual and small biotechnology companies, which have limited or no infrastructure. These clients also value our ability to provide a broad range of services where we work hand in hand with our clients to design, plan and manage integrated projects and programs. This includes classically outsourced services, “insourced” services and hybrid offerings blending resources from both our clients and our staff.\nWe are taking decisive action to manage the Company through the current demand environment, including appropriately right-sizing our infrastructure, optimizing operations, and driving efficiency with a goal to protect operating margin. We are committed to initiatives to generate more revenue, contain costs, and protect shareholder value through enhanced commercial initiatives, restructuring and efficiency actions to drive cost savings, as well as a balanced approach to capital deployment, including:\n•\nRestructuring initiatives to manage costs and generate efficiency by reducing staffing levels to align with the level of demand, as well as evaluating our global footprint to optimize, consolidate, and simplify operations. We are also engaging in global footprint optimization efforts to maximize capacity and enhance our capabilities. We have taken a client-centric approach to these actions with a goal of serving our clients more efficiently and seamlessly in order to capture synergies and savings that extend beyond the facility costs. These footprint optimization efforts are intended to enhance the efficiency and economies of scale in our global infrastructure, leading to a more disciplined operating model. In addition, Charles River’s culture of continuous improvement strives to implement initiatives to drive greater operating efficiencies. In the current demand environment, we are focused on achieving this goal through streamlining global business services, driving enhanced procurement savings, and leveraging our digital platform. \n•\nFocusing on commercial enhancements to promote a client-centric focus and gain additional market share. Our goal is to enhance the client experience and reinforce our role as a flexible and responsive partner to our clients, including through leveraging technology such as our Apollo™ cloud-based platform to provide real-time access to scientific data and self-service tools for clients.\n•\nContinuing to evaluate additional strategies to enhance the business. We are working on initiatives to further transform how we operate, including harmonization and centralization of processes, tools and tasks, continuing to better leverage technology, adoption of a global businesses service model to streamline our operations, as well as other projects such as generating greater procurement savings.\nOur strategic imperatives and operational goals are centered around our intense focus on initiatives designed to allow us to drive profitable growth, enhance our operating efficiency and better position ourselves to function successfully in the current and future business environment, which we believe will collectively enable us to maximize value for our shareholders. \n10\nCHARLES RIVER LABORATORIES INTERNATIONAL, INC.\nOver the past decade, we have expanded our capabilities by adding high-science services with the goal to deliver fast and high quality end-to-end integrated, non-clinical solution to accelerate drug development.\n \nWe intend to continue to broaden the scope of the products and services that we provide across the drug discovery and non-clinical development continuum primarily through internal development, and also, through focused acquisitions and our strategic partnerships strategy, all of which are intended to enable us with the flexibility to adapt and innovate to meet our client’s changing needs. Acquisitions, such as our acquisitions of Explora BioLabs in fiscal 2022, SAMDI in 2023, and Noveprim in 2023, have been (and we expect will be in the future) an integral part of our growth strategy, both to expand our portfolio and broaden our geographic footprint. We are committed to a disciplined approach that seeks to target businesses that are a sound strategic fit. We aim to consistently deliver shareholder value, including the achievement of a hurdle rate for return on invested capital above our weighted average cost of capital.\nMergers and acquisitions remain one of our top, long-term priorities for disciplined capital deployment and enhancing growth strategy with focus on enhancing the breadth of our scientific capabilities principally within our core competencies, expanding our global scale, and maintaining our leadership position in advanced and emerging therapies. Our long-term strategy also includes growth through establishing relationships and exploring other opportunities and areas that have the potential to strengthen our broad-based portfolio of products and services. \nWe also partner with a diverse set of leading venture capital firms around the world primarily investing in life sciences, health care and therapeutics with an emphasis on early-stage companies. Through these partnerships and close relationships, we gain insight into their company and asset portfolios and are thus able to promote our services for each of our businesses. We also view these partnerships as an investment in new and emerging sciences and technologies as they allow us to gain insights to cutting-edge capabilities. Thus, we have the opportunity to establish ourselves as a provider of choice for a unique client group that has emerged as biopharmaceutical companies rationalize and prioritize their development pipelines.\nWe routinely evaluate strategic fit and fundamental performance of our businesses. As part of this ongoing assessment, we may determine certain capital could be better deployed in other long-term growth opportunities. Most recently, we divested our Avian Vaccine Services business in 2022, and a Safety Assessment site in 2024, as we determined these businesses/sites were no longer a strategic fit.\nClients\nOur clients consist primarily of major biopharmaceutical companies; many small, emerging, and established biotechnology, agricultural and industrial chemical, life science, veterinary medicine, medical device, diagnostic and consumer product companies; contract research and contract manufacturing organizations; and other commercial entities, as well as leading hospitals, academic institutions, government agencies, and non-governmental organizations. We have stable, long-term relationships with many of our clients. During 2024, no single client accounted for more than 4% of our total revenue and no single client accounted for more than 8% of the revenue of any of our three business segments.\nWe continue to pursue a goal of expanding our relationships with our large biopharmaceutical clients, and with many of our larger mid-tier clients. These relationships take different forms, from preferred provider arrangements to strategic partnerships. The structure of these relationships incentivizes clients to purchase more products and services across our non-clinical portfolio. Because of the strength of these relationships, we have better insight into our clients’ planning processes and, therefore, better visibility than in the past. For information regarding revenue attributable to each of our business segments for the last three fiscal years, please see Note 4. Segment and Geographic Information, included in the Notes to Consolidated Financial Statements included elsewhere in this Form 10-K. For information regarding revenue and long-lived assets attributable to operations in the United States, Europe, Canada, Asia Pacific and other countries for each of the last three fiscal years, please review Note 4. Segment and Geographic Information, included in the Notes to Consolidated Financial Statements included elsewhere in this Form 10-K.\nSales, Marketing and Customer Support\nOur marketing efforts are focused on stimulating demand for further outsourcing across our entire services portfolio. We believe that our ability to provide solutions that address all aspects of early-stage drug research are increasingly attractive to our clients, and we continue to design and market our commercial activities to deliver flexible, customized programs designed by segment to meet our clients’ global and site-specific needs.\nOur go-to-market approach employs a number of sales and marketing strategies, including dedicated sales teams for each of our major lines of business and global and key account managers who represent the entire portfolio. We also maintain several sales specialists that either have specific technical expertise (often degreed scientists) or cover unique markets.\nIn addition to our field sales teams and related specialists, we also have a team of alliance managers who are organized by key client within our market segments (global biopharmaceutical, small and mid-sized pharmaceutical and biotechnology companies, and academic and government institutions). This enhances our ability to meet client needs by offering customized, \n11\nCHARLES RIVER LABORATORIES INTERNATIONAL, INC.\ntailored solutions across our entire portfolio. In addition, our clients benefit by additional support from a combination of technical specialists with specific scientific and therapeutic area expertise. We also apply the use of dedicated sales specialists for certain technical product lines, such as in our Manufacturing businesses.\nWe sell our products and services principally through our direct sales and business development teams who work in North America, Europe and Asia. In addition to interactions with our direct sales force, our primary promotional activities include presenting scientific symposia to targeted audiences, publishing scientific papers, technical support pieces and white papers, and newsletters, hosting webinars and virtual seminars and making presentations at, and participating in, scientific conferences and trade shows in North America, Europe and Asia. We supplement these scientifically based marketing activities with digital marketing, advertising and website content. In certain areas, our direct sales force is supplemented by international distributors and agents.\nOur internal strategic marketing and marketing operations teams support the field sales and business development teams while developing and implementing programs to build awareness about products and services and create opportunities for interaction with our clients in the biomedical research industry. We maintain client engagement, lead development support, digital experience, eCommerce, and event management departments, which address both our clients’ routine and more specialized needs and purposely serve as a scientific support and information resource for them. We frequently assist our clients in solving problems related to resourcing products and services, research support, non-clinical study design, regulatory consulting, protocol development and other areas in which our expertise is widely recognized as a valuable resource by our clients.\nCompetition\nOur goal is to be a leader in each of the markets in which we participate. We compete in the marketplace on the basis of our therapeutic and scientific expertise in early-stage drug research, quality, reputation, flexibility, responsiveness, pricing, innovation and global capabilities. We are able to offer a unique portfolio of early-stage products and services to support drug discovery and development.\nWe encounter a broad range of competitors of different sizes and capabilities in each of our three businesses segments. We also face competition from the internal discovery and development resources of our clients.\n•\nFor RMS, we have four main competitors of which one is a government funded, not-for-profit entity; one is a public company in the U.S.; one is privately held in Europe; and one is privately held in the U.S. \n•\nFor DSA, both our discovery services and safety assessment services have numerous competitors. Our discovery services offerings have hundreds of competitors, but two main competitors: one is a public company in China and one is a public company in Europe. Our safety assessment offerings have dozens of competitors of varying size, but one main competitor that is a division of a large public company in the U.S. Our DSA segment also competes with in-house departments of pharmaceutical and biotechnology companies, universities and teaching hospitals.\n•\nFor Manufacturing, each of our underlying businesses has several competitors. Microbial Solutions has four main competitors, of which three are public companies in Europe and one is part of a public company in Japan. In addition to many smaller competitors, Biologics Solutions has five main competitors, of which three are public companies in Europe, one is a public company in the U.S., and one is a public company in China. \nIndustry Support and Animal Welfare\nOne of our core values is a commitment to animal welfare. Research animals are an important resource that further our knowledge of living systems and contribute to the discovery and development of life-saving drugs. We work with our scientific community peers to understand how living conditions, handling procedures, and experimental procedures contribute to animal stress and play a role in the quality of research outcomes. As researchers, we are responsible to our clients and the public for the health and well-being of the animals in our care, and prioritize the humane treatment of these critically important research models. \nWe have been at the forefront of animal welfare improvements in our industry and continue to show our commitment with special recognition programs for employees who demonstrate an extraordinary commitment in this critical aspect of our business. We created our own Humane Care Imperative (HCI), which is overseen by our Global Animal Welfare and Training corporate group. The goal of HCI is to ensure that we continue as a worldwide leader in the humane care of research animals and implementation of the 3Rs (Replacement, Reduction, and Refinement). As part of the HCI, we also have quarterly recognition and celebration of employees that go above and beyond to promote animal welfare and safety, In 2024, we published on our website an extensive and comprehensive Corporate Citizenship Report, which includes information on our Global Animal Welfare and Training, Responsible Animal Use and New Alternative Methodologies (NAMs) work, including investments in NAMs through our recently launched Alternative Methods Advancement Project (AMAP) initiative that is dedicated to investing in and developing alternatives to reduce animal testing.\n12\nCHARLES RIVER LABORATORIES INTERNATIONAL, INC.\nWe are firmly committed to the 3Rs and to reducing the number of animals that we work with by emphasizing health, research animal behavioral management programs and genetic integrity to decrease study data variability. Whenever possible, we use low stress handling of our animals, technological advances such as \nin vitro \ndiagnostic tests for health surveillance in laboratory rodents, microsampling and various \nin vitro\n assays. We support a wide variety of organizations and individuals working to further animal welfare and the 3Rs, as well as the interests of the biomedical research community. We also partner with clients to develop study designs to right-size the number of animals needed and suggest pilot studies where appropriate. We maintain a quarterly award program that recognizes our employees’ efforts to continually implement the 3Rs at our sites globally.\nWe provide scholarships for training in laboratory animal science, financial support to non-profit organizations that promote and educate the public about animal welfare, the 3Rs, and the benefits of animal research, and awards to outstanding leaders in the laboratory animal science field and the supporters of 3Rs.\nIn 2023, our Board of Directors established a Responsible Animal Use Committee to assist the Company in improving our impact on responsible animal utilization, including evaluating and advising scientific and technological opportunities which may appropriately reduce the impact of animals in the Company’s operations. Additionally, in March 2024 we published our first annual report to shareholders on the measures the Company takes to reinforce confidence that the NHPs we import are sourced in accordance with applicable laws. \nHuman Capital Resources \nEmployees\nAs of December 28, 2024, we had approximately 20,100 employees (including approximately 2,550 science professionals with advanced degrees, including Ph.D.s, D.V.M.s and M.D.s). Approximately 18,600 of our employees are considered full-time employees, while approximately 1,400 are considered part-time employees. Our workforce was distributed geographically approximately as follows: 61% in North America, 32% in Europe, 5% in Asia, and 2% in other regions.\nPart of the decisive action we have and continue to implement to manage the Company through the current demand environment includes restructuring initiatives to manage costs and generate efficiency by reducing staffing levels to align with the pace of demand. We have reduced our total headcount by approximately 8% since the end of 2023. It is imperative in this environment to keep our staff well utilized in order to protect operating income margin, which is our goal.\nOur employees are not unionized in the U.S. Employees at some of our European facilities are represented by works councils, employee representative groups and/or unions, which is consistent with local customs for our industry. We collaborate with the works councils and believe we have good relationships with our employees.\nValues\nAt Charles River, our values of Care, Lead, Own, and Collaborate guide our decisions and actions; they are standards we hold ourselves to each and every day and are critical to success in fulfilling our goals. In addition, our Charles River DNA are the behaviors based on these values that we use to make decisions, grow our future leaders, and pave the way for years ahead.\nTalent Management, Belonging, and Engagement\nSustaining our company culture is a vital part of our strategy. Our culture is built on trust, belonging, accountability, respect, well-being, and safety. Our objective is to enable an environment where every colleague can connect with their work in a way that supports each other, our clients, and our communities. We strive to maintain an environment wherein every person has the ability to deliver on business commitments, while having purpose, being energized, continuously learning, and delivering quality outcomes that make a difference. As a global organization, our growth and development depend on hiring, engaging, and retaining a skilled and global workforce in a highly competitive marketplace. In fiscal 2024, we hired over 2,200 people and our voluntary turnover for all employees was approximately 11.1%.\nWe pride ourselves on supporting our people both professionally and personally throughout their employee experience with us. In order to attract the best candidate for each position, we prioritize widescale recruitment efforts to attract a larger pool of applicants from a variety of backgrounds. Our hiring process is designed to ensure fair and objective decisions lead to the most qualified candidate being hired. We strive to make our hiring practices accessible, including offering reasonable accommodations as appropriate. \nBeginning with our onboarding program, our talent management approach is structured to be highly collaborative, encourage ownership, and provide the opportunity to contribute and develop through regular performance conversations, annual goal setting, and ongoing feedback. Furthermore, we have created a global learning strategy that includes technical training, mentoring and coaching approaches, tuition reimbursement, sabbaticals, leadership development programs, and on-the-job training to ensure access to skill building and career advancement for all. We conduct regular talent reviews to identify and develop global leadership and key talent pipelines to deliver on short-term and long-term business strategy. \n13\nCHARLES RIVER LABORATORIES INTERNATIONAL, INC.\nWe are also committed to cultivating a welcoming environment where every employee can succeed and thrive. We believe in treating our employees and prospective talent with fairness, dignity, decency, and respect. We recognize that our differences contribute to a more innovative workforce and are a strength for our business. It is critical that our people feel valued, supported, and that we provide opportunities for all. \nOur engagement surveys are in the form of frequent, shorter “Pulse” surveys. These Pulse surveys were issued twice during 2024 and serve as a foundation for more meaningful conversations and actions between our people and people leaders to continue making Charles River a best place to work, learn, and grow.\nIn addition to growth and learning opportunities, we strive to attract, motivate, and retain top talent by providing competitive compensation programs while rewarding outcomes and behaviors that align with our performance, culture, and values. We perform pay equity audits in countries where they are legally required. Our global job architecture generally allows for aligning pay by job role with market rates and serves as a career path tool to support advancement. Additionally, we assess pay on a global scale to ensure we continue to be competitive in the marketplace. \nHealth and Safety\nWe are committed to creating a healthy and safe workplace for our employees and visitors to our facilities. This commitment is outlined in our Global Policy on Safety & Sustainability where we define the company’s approach to embedding safety and sustainably into our company’s purpose. Our EHS&S Global Operating Framework (GOF) is the foundation of our management system approach to incorporating health and safety into our business practices. These programs are supported by site health and safety leaders who engage employees and management to reinforce the importance of ownership of the programs and integration of these practices into our work each day. In 2022 we launched a Safety-First Culture initiative to reinforce that every person working for and on behalf of Charles River recognizes the importance of working safely as their first directive. The underpinning of this initiative was delivering safety culture training to all levels of leadership across the organization. As of 2024, we have conducted safety culture training and workshops to the executive leadership team, site general managers and all people leaders. In 2023 we initiated a formal Environment, Health, Safety and Sustainability Assessment program conducting 17 site assessments in the inaugural year of the program. In 2024 we have continued our safety-first culture journey by requiring all operational people leaders to include a health and safety goal as part of their annual performance, conducted 23 additional site program assessments and provided quarterly updates to business leadership on injury data analysis, trends to track performance against goals, and opportunities to invest in impactful safety improvements.\nBacklog\nOur backlog for our RMS, DSA and Manufacturing reportable segments was approximately $685 million, $2.0 billion and $103 million, respectively, as of December 28, 2024, as compared to $489 million, $2.5 billion and $143 million, respectively, as of December 30, 2023. Related services are performed over varying durations, from short to extended periods of time, which may be as long as several years. We maintain an order backlog to track anticipated revenue from studies and projects that either have not started, but are anticipated to begin in the near future, or are in process and have not been completed. We only recognize a study or project in backlog after we have received written evidence of a client’s intention to proceed. Canceled studies or projects are removed from backlog.\nWe believe our aggregate backlog as of any date is not necessarily a meaningful indicator of our future results for a variety of reasons. First, studies vary in duration (i.e., some studies or projects that are included in December 28, 2024 backlog may be completed in 2025, while others may be completed in later years). Second, the scope of studies or projects may change, which may either increase or decrease their value. Third, studies or projects included in backlog may be subject to bonus or penalty payments. Fourth, studies or projects may be terminated or delayed at any time by the client or regulatory authorities for a number of reasons, including the failure of a drug to satisfy safety and efficacy requirements, or a sponsor making a strategic decision that a study or service is no longer necessary. Delayed contracts remain in our backlog until a determination of whether to continue, modify or cancel the study has been made. We may not be able to realize all or most of the net revenues included in backlog or estimate the portion to be filled in the current year. Refer to",
    "item1a": "Item 1A. Risk Factors – Business and Operational Risk Factors - We have in the past experienced and in the future could experience unauthorized access into our information systems.”\nGovernance of Cybersecurity Risk Management\nOur board of directors, as a whole, has oversight responsibility for Charles River’s strategic and operational risks. \nThe Audit Committee of the Board of Directors has been delegated by the Board responsibility by reviewing and discussing Charles River’s risk assessment and risk management practices, including cybersecurity risks, with members of management. The Audit Committee, in turn, periodically discusses its review and assessment with the board of directors.\n \nOur management team is responsible for day-to-day assessment and management of cybersecurity risks. On our management team, our \nChief Information Officer\n has primary oversight of material risks from cybersecurity threats. The Chief Information Officer is Charles River’s Senior Vice President responsible for the Global Technology organization and for information protection at Charles River.\n \nThe Chief Information Officer has more than 25 years of experience in the field, including serving as the Senior Vice President of Charles River’s Digital Transformation organization, leading the development and implementation of information technology strategies and roadmaps for digital and automation solutions.\nOur Chief Information Security Officer reports to our Chief Information Officer. Our Chief Information Security Officer has more than 25 years of experience working in information technology-related roles, of which more than 10 years has been in information security leadership, and holds degrees in bio-medical engineering and computer science.\nOur Chief Information Officer and Chief Information Security Officer assess our cybersecurity readiness through internal assessment tools as well as third-party control tests, vulnerability assessments, audits, and evaluation against industry standards. We have governance and compliance structures that are designed to elevate issues relating to cybersecurity to our Chief Information Officer and Chief Information Security Officer, such as potential threats or vulnerabilities. We also employ various defensive and monitoring techniques based on industry frameworks and cybersecurity standards.\nOur Chief Information Officer and our Chief Information Security Officer meet regularly with the full \nBoard\n, and periodically, but generally at least quarterly, with the Chief Executive Officer, Chief Operations Officer, and Audit Committee to review the company’s information technology systems and discuss key cybersecurity risks. Our Chief Information Security Officer has direct access to the Chair of our Audit Committee and keeps the Audit Committee apprised of any developments that may emerge in between regularly scheduled meetings that require its attention. Additionally, our Incident Response Plan includes escalation protocols to raise occurrences that require attention from the Audit Committee or the board of directors as a whole.",
    "item1b": "Item 1B.",
    "item1c": "Item 1C.   Cybersecurity \nCybersecurity Risk Management and Strategy\nCharles River places high importance on identifying and mitigating potential cybersecurity threats to its employees, customers, IT infrastructure, proprietary technologies and confidential information. \nOur cybersecurity risk management is based on recognized industry governance frameworks, including the International Organization for Standardization (ISO), the National Institute of Standards and Technology (NIST), the Center for Internet Security Controls (CIS), and the Cloud Security Alliance (CSA). We use these frameworks together with information collected from internal and 3rd party assessments to develop policies such as our technology acceptable use policy for information assets, our access requirements for data, systems, or technologies, and policies for the protection and use of personal information of our employees and customers. We protect our IT assets through industry-standard techniques such as multifactor authentication, malware defenses, network and endpoint monitoring, and access review processes. We also work with our business units to leverage and implement foundational cybersecurity principles, such as security by design, defense-in-depth, least privilege, and resilience-focused backups, throughout our organization. We deliver cybersecurity awareness and confidential information protection training to our employees, and we send our employees ethical simulated phishing and spear-phishing emails to test their compliance with our policies.\nWe engage third parties to conduct annual penetration testing, and we use external risk assessors to measure our program to industry standard frameworks. Our information security management system is certified to the ISO/IEC 27001:2013 and 27017:2018 standards by the British Standards Institution (BSI); certificates IS 780367 and CLOUD 806141,respectively. We also collaborate with experts and industry partners to exchange information about threats, best practices, and trends.\n \nOur cybersecurity risk management extends to risks associated with our use of third-party service and technology providers as well as partnerships with third parties we may enter into. For instance, we conduct risk and compliance assessments of third parties that request access to our IT resources and information or who provide technology products or services to Charles River.\nOur cybersecurity risk management is an important part of our comprehensive business continuity program and enterprise risk management. Our global information security team periodically engages with a cross-functional group of Charles River subject-matter experts and leaders to assess and refine Charles River’s cybersecurity risk posture and preparedness. For example, we regularly evaluate and update contingency strategies for our business in the event that a portion of our IT systems were to be unavailable due to a cybersecurity incident. We practice our response to potential cybersecurity incidents through regular tabletop exercises. We also perform threat hunting and red team exercises.\nThrough these processes, during our fiscal year 2024 and through the date of this filing we did not identify risks from cybersecurity threats, including as a result of any previous cybersecurity incidents, that have materially affected, or are reasonably likely to materially affect, our business strategy, results of operations, or financial condition.\n However, despite our efforts, we cannot eliminate all risks from cybersecurity threats, or provide assurances that we have not experienced an \n36\nCHARLES RIVER LABORATORIES INTERNATIONAL, INC.\nundetected cybersecurity incident. For more information about these risks, please see the section titled “"
  }
}