{
  "ticker": "CRM",
  "cik": "0001108524",
  "company_name": "Salesforce, Inc.",
  "filing_date": "2025-03-05",
  "accession": "0001108524-25-000006",
  "primary_doc": "crm-20250131.htm",
  "item_sections": {
    "item1": "ITEM 1. BUSINESS\nOverview\nSalesforce, Inc. (“Salesforce,” the “Company,” “we” or “our”) is a global leader in customer relationship management (“CRM”) technology, enabling companies of every size and industry to connect with their customers through the power of data, artificial intelligence (“AI”), CRM and trust. Founded in 1999, we bring humans together with AI agents to drive customer success on one deeply unified platform.  \nOur AI-powered Salesforce Platform unites our offerings — spanning sales, service, marketing, commerce, collaboration, integration, AI, analytics, automation, industries and more — by connecting customer data across systems, applications and devices to create a complete view of customers. With this single source of customer truth, teams can be more responsive, productive and efficient and deliver intelligent, personalized and automated experiences across every channel. With Agentforce, the agentic layer of the Salesforce Platform, our customers can build and augment their teams with an always-on digital labor force, deploying autonomous AI agents across business functions that aim to increase productivity, lower costs and drive operational efficiencies.\nOur service offerings are designed to be flexible, scalable and easy to use. They can generally be configured easily, deployed rapidly and integrated with other platforms and enterprise applications. We sell to businesses worldwide, primarily on a subscription basis, through our direct sales efforts and also indirectly through partners. In addition, we enable third parties to use our platform and developer tools to create additional functionality and new applications that run on our platform, which are sold separately from, or in conjunction with, our service offerings.\nSalesforce is committed to a core set of values: trust, customer success, innovation, equality and sustainability – all of which are grounded in legal and regulatory frameworks that guide and inform our business. Foremost among these is trust, which is paramount and the foundation for everything we do, and is also firmly rooted in compliance with applicable laws governing security, privacy, data protection and operational integrity. Our customers expect to trust and rely on our technology to meet the high enterprise-grade standards of security, privacy, performance, legal compliance and availability at scale. Customer success is at the core of our business, and we align the entire company around our customers’ needs, promoting their success, showing our value and upholding applicable laws, contractual obligations and industry regulations and standards. Innovation is fundamental to our mission, empowering and enabling our customers to stay ahead in their industries and driving technological advancements in line with evolving laws, standards and guidelines. Equality is a legal and ethical mandate and a core tenet that informs how we operate. Our commitment to equal opportunity is anchored in applicable laws, statutes, regulations and principles.  We value the equality of every individual at our company and in our communities and are dedicated to fostering a workplace that complies with these protections, creating an inclusive culture where every individual feels seen, heard and valued. Finally, we are committed to creating a more sustainable and nature-positive future for all. Our products and services help our customers meet their own sustainability and compliance priorities, guided by applicable environmental and sustainability-related laws, corporate social responsibility frameworks and legal requirements. By grounding our values in legal and regulatory principles, we reinforce our opportunity and responsibility to uphold high integrity and robust ethical standards, ensuring that trust, fairness, and compliance remain central to everything we seek to do.\nWe believe that our values, grounded in legal and regulatory frameworks, create value, and the business of business is to make the world a better place for all of our stakeholders, including stockholders, customers, employees, partners, the planet and the communities in which we work and live. Salesforce is committed to giving back to our communities, helping businesses grow while protecting the environment for future generations, and transparent environmental, social and governance disclosures. We believe we have a broad responsibility to society, and we aspire to create a framework for the ethical and humane use of technology that not only drives the success of our customers, but also upholds the basic human rights of every individual.\nOur Service Offerings\nWe believe that every business, in every industry, has to optimize for an AI-first experience for their customers, employees and partners, leveraging trusted AI, data and CRM technology to increase efficiency, boost productivity and drive growth. Through Agentforce, our suite of customizable AI agents and tools, Salesforce brings autonomous AI, unified data and applications together on one deeply unified platform that enables companies of any industry or size to deliver AI-powered, personalized engagement across every customer touchpoint with the ability to hyperscale data and automation. \nOur service offerings are designed to work together and include:\nSales.\n Our Sales offering is an integrated platform that brings together the power of humans with AI agents to help sales teams sell faster and smarter, and to efficiently manage and automate entire sales processes. It provides sales capabilities and tools built for an entire sales organization – across prospecting, sales engagement, team collaboration, sales analytics and AI, sales programs, sales performance, partner management, and revenue and orders. With our Sales offering, businesses can create \n4\nTable of Contents\nlifelong customers by connecting their entire organization and unifying all data sources on a single integrated platform. Further, with Agentforce for Sales, customers can build a sales team augmented by a digital labor force and empower every seller with their own AI agent to help accelerate productivity and drive growth.\nService.\n Our Service offering enables companies in every industry to bring all of their customer service and field service needs onto one integrated, AI-powered platform to deliver trusted, highly personalized customer support at scale. It also helps our customers maximize productivity, resolve cases faster and improve customer satisfaction by automating routine tasks. With Agentforce for Service, customers can tap the power of digital labor to handle low-touch interactions and help their teams with high-touch tasks, unlocking new levels of efficiency. Our AI technology enables service teams to automatically route cases to the best service agent for the job, respond to customers with personalized, relevant answers grounded in company data and perform tasks like auto-summarizing support cases and field work orders. Our service offering also provides a field service solution that enables companies to connect service agents, dispatchers and mobile employees through one centralized platform, on which they can intelligently schedule and dispatch work as well as track and manage jobs.\nPlatform and Other. \nThe Salesforce Platform enables companies of all industries, sizes, and locations to build business workflows, applications and AI agents on a single, comprehensive platform to help boost efficiency, increases productivity and automation and save on information technology costs. It facilitates development with no-code and low-code tools that are easy to use and free to learn, empowering anyone to build trusted applications, AI agents, models, code, prompts, automations, and much more. Our Trust Layer is built into the Salesforce Platform to help customers safely use their data and set guardrails on what AI agents do with that data. The Salesforce Platform is built on Hyperforce, our infrastructure that helps customers manage data governance and compliance at a local level, all over the world. Our technology partners help customers to easily add the applications they need and utilize the data lakes and systems they have already invested in, and because the platform is open source, customers can integrate and build with any data or partner application they choose to make the platform work for their business.\nSlack. \nOur Slack offering is a workplace communication and productivity platform where work happens for millions of people every day. It centralizes conversations and collaboration, automates business processes, makes search and knowledge sharing seamless, and delivers trusted generative and agentic AI that augments employees so they can work smarter, make decisions faster, and drive real outcomes. Slack is also deeply integrated with every Salesforce offering, including Agentforce, bringing a digital labor force into the messages and channels where work is happening. With Agentforce in Slack, employees across every department can collaborate with specialized AI agents and accelerate high-impact work directly in the flow of work.\nMarketing and Commerce.\n \nMarketing.\n Our Marketing offering is a complete marketing platform designed to help customers personalize engagement across the customer lifecycle. By connecting departments through actionable data, trusted AI, and autonomous AI agents, we empower teams to work together to build lasting customer relationships. With Agentforce, marketers can save time on every step of the campaign process by using prompts to generate briefs, content, and journeys, as well as optimize performance and spend with actionable insights and predictive AI. With operational customer profiles, marketers and AI agents can easily take action on structured and unstructured data to build segments, calculate insights, analyze performance, and power AI recommendations, decisioning, and automations. Our Marketing offering is built on the Salesforce Platform, so that marketing teams are able to seamlessly provide sales next-best-offer recommendations, help service retain customers with proactive promotions, and re-engage inactive shoppers.\nCommerce. \nOur Commerce offering helps connect every aspect of commerce—from marketing and sales to service and fulfillment—on a single, connected, AI-powered platform, enabling brands to deliver personalized, seamless shopping experiences across every customer touchpoint. With Agentforce for Commerce, brands can autonomously manage a range of tasks with AI agents, such as product recommendations and order lookup, helping to boost capacity and productivity across marketing, commerce, merchandising, and store operations. With trusted AI and AI agents, businesses can generate product descriptions and web pages; and deliver personalized shopping assistance using natural language. Native integrations between our Commerce, Sales, Service, and Marketing offerings enable brands to tackle complex challenges and build cohesive digital experiences. Additionally, our Commerce offering delivers click-to-code tools, which provide customers with the ability to quickly build and deploy our solutions around their customers as markets, industries, and customers evolve.\nIntegration and Analytics.\n \nIntegration.\n Our unified Integration, Automation and API Management offerings, powered by MuleSoft, provide the essential building blocks to deliver AI-powered, end-to-end, connected experiences and innovate faster. Customers use MuleSoft to connect data across any system, take action on their data using no-code or low-code to automate tasks across any system, and scale API governance to help secure and monitor all of their data in transit. With MuleSoft, customers can extend Agentforce to any system to take action outside of Salesforce.\n5\nTable of Contents\nAnalytics\n. Our analytics offerings, including Tableau, provide advanced, end-to-end solutions for a wide range of business use cases, powered by agentic AI. With Tableau, customers can visualize, analyze, and act on business data from any source. Tableau helps users work more efficiently, spot trends, predict outcomes, receive timely recommendations, and take action with autonomous AI agents. Additionally, Tableau enriches Agentforce with best-in-class data visualizations and business context, lowering the barriers of data access for everyone.\nOther Salesforce Offerings\nIn addition to our solution specific service offerings, we have specialized solutions that work across our offerings to support our customers’ business needs. These additional service offerings include:\nAgentforce.\n Agentforce is the agentic layer of the Salesforce Platform for deploying autonomous AI agents that can understand and respond to customer inquiries without human intervention across business functions. Agentforce includes a set of tools to create and customize AI agents, as well as a library of ready-to-use skills for most any use cases across sales, service, marketing and commerce, Tableau, Slack, partners and more. Agentforce is a complete AI system for building a digital labor force, integrating data, AI, automation, and humans to deploy trusted AI agents for concrete business outcomes. It works by giving teams tools, services, and AI agents that can tap into the power of a large language model (“LLM”) and their connected business data to autonomously identify what work needs to be done, build a plan to complete the work, and then execute the plan.  \nData Cloud.\n Data Cloud is our hyperscale, trusted data engine native to Salesforce. It brings a company’s enterprise data into Salesforce to deliver an actionable, comprehensive and robust view of a customer by connecting enterprise data from disparate sources and harmonizing it into a single, trusted model that is easy to access and understand. By leveraging Data Cloud’s robust framework for data ingestion, transformation and indexing, integrations with retrieval-augmented generation improve customer experiences by transforming unstructured text and data into searchable insights, empowering companies to respond to customer queries with more context, relevance, knowledge, and advanced reasoning. Data Cloud leverages the power of Salesforce metadata to enable companies to ingest and federate data to power automation, analytics, and AI agents across Salesforce applications. \nIndustries.\n Our industry vertical offerings meet the specific needs of our customers across different industries, such as financial services, healthcare and life sciences, manufacturing, automotive and government. Each of our distinct industry offerings provide out-of-the-box, AI-powered capabilities that make it easy for industry customers to leverage the full Salesforce Platform with purpose-built tools that address industry-specific needs and enable the speed and flexibility to keep up with changing times and customer demands. Salesforce’s industry offering also includes Industries AI – a suite of more than 100 industries capabilities and a library with resources on how to get started for every industry offering. Industries AI capabilities serve as the foundation for creating industry-specific AI agents with Agentforce that can be set up in minutes, work around the clock, and autonomously perform industry-specific business tasks and actions.\nSalesforce Starter.\n We offer Starter Suite, an all-in-one, easy-to-use solution for small and medium-size businesses that brings sales. service, marketing and commerce together. Starter Suite helps businesses get set up with Salesforce quickly and easily, so they can save time, boost productivity, and manage relationships with all of their customer operations in one, centralized location. Starter Suite allows businesses to build a trusted foundation of customer data for advanced AI technology to support efficient business growth.\nBusiness Benefits of Using Our Solutions\nThe key advantages of our solutions include the following:\n•\nan industry-leading, AI-powered deeply unified platform for business-to-business, business-to-consumer and business-to-employee for the all-digital, work-from-anywhere world;\n•\nscalable, efficient and flexible solutions for any size company or industry;\n•\na single source of truth that connects customer data across systems, applications and devices to help companies sell, service, market and conduct commerce from anywhere;\n•\nthe ability to unlock companies’ customer data across their business, see and understand their data with advanced analytics, make predictions with pervasive AI, automate tasks and personalize every interaction; \n•\nthe ability to infuse trusted AI in the flow of work and create AI agents that help make the customer experience more intelligent, automated and personalized, and employees more productive;\n•\nthe ability to collaborate easily with customers, employees, partners and systems;\n•\nmodern low-code and no-code tools powered by leading edge AI, which empowers developers and business users to create digital experiences and configure and automate business processes to fit the needs of any business, accelerating time to value;\n•\nthe ability to accelerate adoption and drive results with purpose-built, compliant tools and processes that deliver out-of-the-box functionality, security and interoperability; and\n6\nTable of Contents\n•\nan enterprise application marketplace and a community of tens of millions of Trailblazers: passionate developers, admins and experts who use Salesforce to innovate and extend the platform with thousands of partner applications.\nOur Business and Growth Strategy\nWe continue to expand in the growing addressable markets across all of our service offerings. We continue to focus on several key growth levers, including driving multiple service offering adoption, increasing our penetration with enterprise and international customers and our industry-specific reach with more vertical software solutions. We orient our business strategy and invest for future growth by focusing on the following key priorities:\nExpand relationships with existing customers.\n We see significant opportunities to deepen existing customer relationships through cross-selling and upselling our service offerings. For example, we continue to focus on driving multiple service offering adoption, which provides our customers with a one-stop-shop for their front-office business technology needs. As our customers realize the benefits of our entire suite of service offerings, we aim to upgrade the customers’ experience with new products and features and gain additional subscriptions by targeting new functional areas and business units. Finally, we aim to expand our relationships with existing customers through our additional support offerings.\nIncrease geographic reach. \nBy extending our go-to-market capabilities globally, we aim to grow our business by selling to new customers in new regions. We will continue to pursue businesses of all sizes in most major markets globally. We also plan to continue to develop distribution channels through new and existing marketplaces and partners for our solutions around the globe and new go-to-market strategies. We continue to invest in our domestic and international operations and infrastructure to deliver the highest-quality service to our customers around the world.\nFocus on industries and new products. \nAs part of our growth strategy, we are delivering innovative and value-driven solutions in new categories based on our existing and potential customers’ needs. For example, we provide out-of-the-box solutions specifically built for customers in certain industries, such as financial services, healthcare and life sciences, manufacturing and more. In addition, through direct discussions and strategic engagements with our customers, we are able to deliver the innovations and enhancements that align with the needs of our customers. In the third quarter of fiscal 2025, we introduced Agentforce, the agentic layer of the Salesforce Platform for deploying autonomous AI agents across any business function. Agentforce includes a set of tools to create and customize AI agents, as well as a library of ready-to-use skills for any use case across sales, service, marketing and commerce, Tableau, Slack, partners and more. \nLeverage our partner ecosystem. \nThe Salesforce Platform enables customers, independent software vendors (“ISVs”) and third-party developers to create, test and deliver cloud-based applications. These applications can be marketed and sold on the AppExchange, our enterprise cloud marketplace, or sold directly by software vendors. In addition, we rely on our consulting partners to deliver technology solutions and expertise to customers, from large-scale implementations to more limited solutions that help businesses run more efficiently. We continue to work with and invest in our partner ecosystem, including these ISVs and system integrators (“SIs”), to accelerate our reach into new markets and industries.\nPromote strong customer adoption and reduce customer attrition. \nWe believe that we have the people, processes and proven innovation to help companies transform successfully. Our customer success programs, including success management resources, advisory services, technical architects and business strategists, help enable and accelerate our customers’ digital transformations. In addition, we have free, curated resources such as Trailhead to help companies learn our systems and a community of Trailblazers who drive innovation. With these programs and resources, we aim to reduce attrition and secure renewals of existing customer subscriptions.\nMergers and Acquisitions and Strategic Investments\nWe evaluate opportunities to acquire or invest in complementary businesses, services, technologies and intellectual property to complement our organic innovation and advance the development of our Salesforce Platform. Our evaluation seeks to confirm that any potential acquisition accelerates our strategy, represents an attractive customer opportunity, provides a pathway to effectively monetize the acquired products and drive significant operational efficiencies and presents a clear timeline for value accretion. Our acquisitions can range in size and complexity, from those that enhance or complement existing products and accelerate development of features to large-scale acquisitions that result in new service offerings. Our goal is to prioritize the use of our balance sheet, through cash and debt, to complete acquisitions.\nWe also manage a portfolio of strategic investments in both privately held and publicly traded companies focused primarily on enterprise cloud companies, technology startups and SIs. Our investments range from early to late stage companies, including investments made concurrent with a company’s initial public offering. We invest in companies that we believe are digitally transforming their industries, improving customer experiences, helping us expand our solution ecosystem or supporting other corporate initiatives, including AI. We plan to continue making these types of strategic investments as opportunities arise that we find attractive, including investments in companies representing targeted businesses, technological initiatives and geographies. Our strategy includes growing our strategic investment portfolio, in part, by reinvesting proceeds from the sales of strategic investments.\n7\nTable of Contents\nTechnology, Development and Operations\nWe primarily deliver our solutions as highly scalable cloud computing application and platform services on a multi-tenant technology architecture. Multi-tenancy is an architectural approach that allows us to operate a single application instance for multiple organizations, treating all customers as separate tenants who run in virtual isolation from each other. This approach allows us to spread the cost of delivering our services across our user base and scale our business faster than traditional software vendors while focusing our resources on building new functionality and enhancing existing offerings.\nWe provide our services through cloud computing platform partners who offer Infrastructure-as-a-Service, including servers, storage, databases and networking, as well as through infrastructure designed and operated by us but secured within third-party data center facilities. We continue to invest and expand the deployment of Hyperforce, which allows our platform and applications to be delivered rapidly and reliably to locations worldwide and provides our customers autonomy and control over data residency.\nOur technology and product efforts are focused on improving and enhancing the features, functionality, performance, availability and security of our existing service offerings, as well as developing new features, functionality and services. We also remain focused on integrating businesses, services and technologies from acquisitions. Performance, functional depth, security, usability, ease of integration and configuration and sustainability of our solutions influence our technology decisions and product direction.\nCompetition\nThe market for our service offerings is highly competitive, rapidly evolving and fragmented, and subject to changing technology with low barriers to entry, shifting customer needs and frequent introductions of new products and services.\nOur current competitors include:\n•\nvendors of packaged business software, as well as companies offering enterprise applications delivered through on-premises offerings from enterprise software application vendors and cloud computing application service providers, either individually or with others;\n•\nsoftware companies that provide their product or service free of charge as a single product or when bundled with other offerings, or only charge a premium for advanced features and functionality, as well as companies that offer solutions that are sold without a direct sales organization;\n•\nvendors who offer software tailored to specific services, industries or market segments, as opposed to our full suite of service offerings including suppliers of traditional business intelligence and data preparation products, integration software vendors, marketing vendors, e-commerce solutions vendors, or AI software and service vendors;\n•\nproductivity tool and email providers, unified communications providers and consumer application companies that have entered the business software market; and\n•\ntraditional platform development environment companies and cloud computing development platform companies who may develop toolsets and products that allow customers to build new applications, including AI augmented applications, that run on the customers’ current infrastructure or as hosted services, as well as would-be customers who may develop enterprise applications for internal use.\nWe believe more companies may become competitive threats due to the attractiveness of the markets in which we operate. We also expect our competition to change and evolve as we expand into more markets, with new offerings.\nCustomers\nWe sell to businesses of all sizes and in almost every industry worldwide. The number of paying subscriptions at each of our customers ranges from one to hundreds of thousands. None of our customers accounted for more than ten percent of our revenues in fiscal years 2025, 2024 or 2023. In addition, we do not have any material dependencies on any specific product, service or particular group or groups.\nCustomer Service and Support\nWe offer professional services to help customers achieve business results faster with Salesforce solutions. Our architects and innovation program teams act as advisors to plan and execute digital transformations for our customers. This includes implementation services for multi-offering and complex deployments. We provide best-practices and AI-based recommendations and adoption programs globally. In addition, we provide advanced education, including in-person and online courses, to certify our customers and partners on architecting, administering, deploying and developing our service offerings.\nOur global customer support group responds to both business and technical inquiries about the use of our products via the web, telephone, email, social networks and other channels. We provide standard customer support during regular business hours to customers as part of our paying subscription editions. We also offer premier customer support that is either included in a premium success offering or sold for an additional fee, which can include services such as priority access to technical resources, developer support and system administration. In addition, we offer a premier priority support add-on that includes proactive monitoring, rapid incident response and instruction from a dedicated support team knowledgeable about the customer's specific \n8\nTable of Contents\nenterprise architecture. With the launch of Agentforce, we’ve made it easier for customers to find answers by providing an even more intuitive experience on our Salesforce Help page. Agentforce can resolve customer issues swiftly and accurately because answers are grounded in our trusted unstructured content unified in Data Cloud. By automating simple and repetitive tasks, our support engineers will be able to augment and scale their time in a more valuable way.\nSales and Marketing\nWe sell our services primarily through our direct sales force, which comprises sales personnel based in regional hubs, field sales personnel based in territories close to their customers and self-service offerings.\nTo a lesser extent, we also utilize a network of partners who refer sales leads to us and assist in selling to prospects. This network includes global consulting firms, SIs and other partners. In return, we typically pay these partners a fee based on the first-year subscription revenue generated by the customers they refer. We continue to invest in developing additional distribution channels for our subscription services.\nWe use a variety of marketing programs across traditional and social channels to target our prospective and current customers, partners and developers. We focus our marketing activities in the cities and countries with the largest market opportunities. Our primary marketing activities include:\n•\nmultichannel marketing campaigns that span email, social media, the web, television and more, which align to a broader customer journey;\n•\nin-person and virtual customer events of all sizes to create customer and prospect awareness, including proprietary events such as Dreamforce and our virtual Dreamforce to You, World Tours and other virtual events, as well as participation in trade shows and industry events;\n•\nlive events and original programming on our Salesforce+ streaming service, which includes discussions about the future of technology in the AI-first, work anywhere world and educational content to learn new skills and pursue new career opportunities;\n•\npress and industry analyst relations to garner third-party validation and generate positive coverage for our company, brand, service offerings and value proposition;\n•\npartner co-marketing activities with global and regional implementation partners;\n•\ncustomer testimonials and our community of Trailblazers: individuals who drive innovation, grow their careers and transform their businesses using the Salesforce Platform;\n•\nin-person and virtual technology event sponsorships; and\n•\nevent partnerships with high-profile global brands and organizations.\nIntellectual Property\nWe rely on a combination of trademarks, copyrights, trade secrets, patents and contractual provisions to protect our proprietary technology and our brands. We also enter into confidentiality and proprietary rights agreements with our employees, consultants and other third parties and control access to software, services, documentation and other proprietary information. We believe the duration of our patents is adequate relative to the expected lives of our service offerings. We also purchase or license technology that we incorporate into our products or services. At times, we make select intellectual property broadly available at no or low cost to achieve a strategic objective, such as promoting industry standards, advancing interoperability, supporting open source software or attracting and enabling our external development community. While it may be necessary in the future to seek or renew licenses relating to various aspects of our products and business methods, we believe, based upon past experience and industry practice, such licenses generally should be obtainable on commercially reasonable terms.\nHuman Capital Management \nSalesforce is committed to a core set of values: trust, customer success, innovation, equality and sustainability. These core values are the foundation of our company culture, which we believe is fundamental to, and a competitive advantage in, our approach to managing our workforce. We believe our company culture fosters open dialogue, collaboration, recognition and a sense of belonging, all of which allow us to attract and retain the best talent, which is critical for our continued success. For example, our sales, engineering and customer success teams are critical to our ability to grow, innovate, and promote the trust and success of our customers.\nWe believe our efforts in managing our workforce have been effective. Our focus on our workplace environment and a strong company culture has led to recognition across the globe, as evidenced by the following awards: Ethisphere’s World’s Most Ethical Companies (2024 and for the 15th time), One of America's Most JUST Companies from JUST Capital (2025 and for the eighth year in a row), Fortune World's Most Admired Companies (2025 for the 11th year in a row), Fortune 100 Best Companies to Work For (2024 and for the 16th year in a row), Fortune World’s Most Innovative Companies (2024, for the second year in a row), a Top 100 Employer of Choice on the American Opportunity Index (2024 and for the third year in a row), A Glassdoor Best Places to Work 2025, a 2024 Great Place to Work Best Workplace in: Japan, UK, South Korea, Argentina, France, Spain, Denmark, Canada, United States, Switzerland, Mexico, Ireland, The Netherlands, India, Portugal, \n9\nTable of Contents\nBrazil, Singapore, Australia and a Built In’s 2025 Best Places to Work winner in: Dallas, Colorado, Austin, Seattle, Atlanta, Boston, San Francisco and a 100 Best U.S. Large Companies to Work For in 2025 overall. \nAs of January 31, 2025, we had 76,453 employees. None of our employees in the United States are represented by a labor union. However, employees of certain foreign subsidiaries are represented by works councils.\nWe have continued to invest in development programs, employee engagement and ongoing communications and feedback. For additional information on our workforce, refer to our annual Stakeholder Impact Report, https://salesforce.com/stakeholder-impact-report. Some of our key human capital management initiatives are summarized below:\nEquality\nOur approach to equality is firmly rooted in compliance with federal law (as a U.S. company) and other applicable laws and regulations in the regions in which we operate, including statutes, regulations and principles governing equal pay, equal opportunity and anti-discrimination protections. These legal frameworks shape our long-standing commitment to fostering a workplace where all individuals are treated equally, have access to opportunities and are protected from discrimination. By adhering to these laws, we uphold a fair and inclusive environment where our employees can do the best work and teaming of their careers, reinforcing principles of equality, dignity and respect for all.\nTalent and Career Development\nWe offer our employees various talent development programs to create a culture of continuous learning and new ways to grow their careers. We provide learning and development opportunities through Career Connect, our internal talent marketplace, and Trailhead, our learning platform available for all employees. We encourage our employees to seek personal and professional development opportunities with external organizations and offer yearly education reimbursement to employees who wish to continue job-related education from accredited institutions or organizations.\nTotal Rewards\nWe believe offering competitive compensation packages and robust benefits is an important factor in our ability to attract, retain and motivate our employees and to help enhance their everyday wellbeing. We use a combination of fixed and variable cash compensation for all employees and award equity compensation to certain employees in the form of restricted stock units and performance-based restricted stock units, and on a limited basis, stock options. Eligible employees are also able to participate in our Employee Stock Purchase Plan, which allows employees to purchase our stock at a 15 percent discount up to U.S. Internal Revenue Code limits. We also match up to $5,000 of donations, per employee, to eligible nonprofit organizations, and effective February 1, 2025, donations are matched up to $10,000 per employee. We offer employees benefits that vary by country and are designed to meet or exceed local legal requirements and to be competitive in the marketplace.\nOur V2MOM and Code of Conduct\nAlignment and consistent and clear communication are a key part of our employee engagement, especially as we continue to grow. Each year, we complete a corporate V2MOM, which is our business plan for the year used to align the Company on our vision, values, methods, obstacles and measures for the upcoming year. All employees are then expected to complete their own V2MOM that aligns with the corporate V2MOM. In addition, our Code of Conduct reflects our core values, which remain the foundation of the Company and which directly impact our ability to deliver success. We expect all of our employees to act with integrity, including treating others with compassion and respect.\nEmployee Engagement and Satisfaction\nOur leadership strives for active engagement with our employees through a variety of channels, including all-company meetings and our daily newsletter, The Daily, allowing employees to stay connected with the business and new developments. Twice a year, all employees have the opportunity to complete a confidential survey measuring employee engagement and experience, the health of our culture and how we are living up to our values. This survey is one of several ways we see to understand employee experience and drive real change across the Company.   \nGovernment Regulation\nWe operate globally and are subject to numerous U.S. federal, state and foreign laws and regulations covering a wide variety of subject matters. Additional information regarding governmental regulations relevant to our business is discussed in Part I,",
    "item1a": "ITEM 1A. RISK FACTORS\nIn evaluating our business, you should carefully consider the following discussion of material risks, events and uncertainties that make an investment in us speculative or risky in addition to the other information included in this Annual Report. A manifestation of any of the following risks and uncertainties could, in circumstances we may or may not be able to accurately predict, materially and adversely affect our business and operations, growth, reputation, prospects, operating and financial results, financial condition, cash flows, liquidity and stock price. Some of the factors, events and contingencies discussed below may have occurred in the past, but the disclosures below are not representations as to whether or not the factors, events or contingencies have occurred in the past and instead reflect our beliefs and opinions as to the factors, events or contingencies that could materially and adversely affect us in the future. The risks and uncertainties described below are not the only ones we face. Other events, factors or uncertainties that we do not currently anticipate or that we currently deem immaterial also may affect our business, financial condition, results of operations, cash flows, other key metrics and the trading price of our common stock. Therefore, you should not consider the following risks to be a complete statement of all the potential risks or uncertainties that we face. \nRisk Factor Summary\nOperational and Execution Risks\n•\nAny breaches in our security measures or those of our third-party data center hosting facilities, cloud computing platform providers or third-party service partners, or the underlying infrastructure of the Internet that cause unauthorized access to a customer’s data, our data or our IT systems, or the blockage or disablement of authorized access to our services.\n•\nAny defects or disruptions in our services that diminish demand for our services.\n•\nAny interruptions or delays in services from third parties, including data center hosting facilities, cloud computing platform providers and other hardware and software vendors, as well as internet availability, or from our inability to adequately plan for and manage service interruptions or infrastructure capacity requirements.\n•\nAn inability to realize the expected business or financial benefits of company and technology acquisitions.\n•\nStrain on our personnel resources and infrastructure from supporting our existing and growing customer base or an inability to scale our operations and increase productivity.\n•\nCustomer attrition, or our inability to accurately predict subscription renewals and upgrade rates.\n•\nDisruptions caused by periodic changes to our sales organization.\n•\nExposure to risks inherent in international operations from sales to customers outside the United States.\n•\nA more time-consuming and expensive sales cycle, pricing pressure and implementation and configuration challenges as we target more of our sales efforts at larger enterprise customers.\n•\nAny loss of key members of our management team or development and operations personnel, or inability to attract and retain employees necessary to support our operations and growth.\n•\nAny failure in the delivery of high-quality professional and technical support services related to our online applications.\nStrategic and Industry Risks\n•\nAn inability to compete effectively in the intensely competitive markets in which we participate.\n•\nAny failure to expand our services and to develop and integrate our existing services in order to keep pace with technological developments.\n•\nAn inability to maintain and enhance our brands.\n•\nPartial or complete loss of invested capital, or significant changes in the fair value, of our strategic investment portfolio. \n•\nAny discontinuance by third-party developers and providers in embracing our technology delivery model and enterprise cloud computing services, or customers asking us for warranties for third-party applications, integrations, data and content.\n•\nSocial and ethical issues, including the use or capabilities of AI in our offerings.\n11\nTable of Contents\n•\nThe evolving landscape related to ESG matters.\nLegal and Regulatory Risks\n•\nPrivacy concerns and laws as well as evolving regulation of cloud computing, increased restriction of cross-border data transfers and other regulatory developments.\n•\nEvolving industry-specific regulations, requirements, interpretive positions or standards.\n•\nLawsuits against us by third parties for various claims, including alleged infringement of proprietary rights.\n•\nAny failure to obtain registration or protection of our intellectual property rights.\n•\nRisks related to government contracts and related procurement regulations.\n•\nGovernmental sanctions and export and import controls that could impair our ability to compete in international markets and may subject us to liability.\nFinancial Risks\n•\nDownturns or upturns in new business, which may not be immediately reflected in our operating results because we generally recognize revenue from subscriptions for our services over the term of the subscription.\n•\nSignificant fluctuations in our rate of anticipated growth and any failure to balance our expenses with our revenue forecasts.\n•\nUnanticipated changes in our effective tax rate and additional tax liabilities and global tax developments.\n•\nFluctuations in currency exchange rates, particularly the U.S. Dollar versus local currencies.\n•\nOur debt service obligations, lease commitments and other contractual obligations.\nRisks Related to Owning Our Common Stock\n•\nFluctuations in our quarterly results.\n•\nVolatility in the market price of our common stock and associated litigation.\n•\nProvisions in our certificate of incorporation and bylaws and Delaware law that might discourage, delay or prevent a change of control of the Company or changes in our management.\nGeneral Risks\n•\nVolatile and significantly weakened global economic conditions.\n•\nThe occurrence of natural disasters and other events beyond our control.\n•\nThe long-term impact of climate change on our business.\nOperational and Execution Risks\nIf our security measures or those of our third-party data center hosting facilities, cloud computing platform providers or third-party service partners, or the underlying infrastructure of the Internet are breached, and unauthorized access is obtained to a customer’s data, our data or our IT systems, or authorized access is blocked or disabled, our services may be perceived as not being secure, customers may curtail or stop using our services, and we may incur significant reputational harm, legal exposure and liabilities, or a negative financial impact.\nOur services involve the storage and transmission of our customers’ and our customers’ customers’ proprietary and other sensitive data, including financial, health and other personal information. Our services and underlying infrastructure may in the future be materially breached or compromised as a result of the following:\n•\nthird-party attempts to fraudulently induce our employees, partners or customers to disclose sensitive information to gain access to our customers’ data or IT systems, or our data or our IT systems;\n•\nefforts by hackers or sophisticated groups, such as criminal organizations, state-sponsored organizations or nation-states, to launch coordinated cyberattacks on internally built infrastructure or on third-party cloud-computing platform providers, including ransomware, destructive malware and distributed denial-of-service attacks;\n•\nthird-party attempts to abuse our marketing, advertising, messaging or social products and functionalities to impersonate persons or organizations and disseminate information that is false, misleading or malicious;\n•\nvulnerabilities existing within new technologies and infrastructures, including those from acquired companies, or resulting from enhancements and updates to our existing service offerings;\n•\nvulnerabilities in the products or components across the broad ecosystem that our services operate in conjunction with and are dependent on;\n•\nattacks on, or vulnerabilities in, the many different underlying networks and services that power the Internet that our products depend on, most of which are not under our control or the control of our vendors, partners or customers; and\n12\nTable of Contents\n•\nemployee or contractor errors or intentional acts that compromise our security systems.\nThese risks are mitigated, to the extent possible, by our ability to maintain and improve business and data governance policies and enhance processes and internal security controls, including our ability to escalate and respond to known and potential risks. We can provide no assurances that our security measures, including implemented systems and processes designed to protect our customers’ and our customers’ customers’ proprietary and other sensitive data, will provide absolute security or otherwise be effective or that a material breach will not occur. For example, our ability to mitigate these risks may be impacted by the following: \n•\nevolving techniques used to breach or sabotage IT systems and infrastructure, including as a result of the increased use of AI technologies by bad actors, which are generally not recognized until launched against a target, and could result in our being unable to anticipate or implement adequate measures to prevent such techniques;\n•\nthe increasing complexity of our internal IT systems as we incorporate and secure IT environments from acquired companies and early adoption of new technologies and new ways of sharing data; and\n•\nour limited control over our customers or third-party technology providers (including those authorized by customers to access their data), or the processing of data by third-party technology providers, which may not allow us to maintain the integrity or security of such transmissions or processing.\nIn the normal course of business, we are and have been the target of malicious cyberattacks and have experienced other security incidents. Although, to date, such identified security events have not had a material financial impact, there can be no assurance that future cyberattacks will not be material or significant. Additionally, as our market presence grows, we may face increased risks of cyberattacks or security threats, and as AI technologies, including generative AI models, develop rapidly, threat actors are using these technologies to create new sophisticated attack methods that are increasingly automated, targeted and coordinated and more difficult to defend against.\nA security breach or incident could result in unauthorized parties obtaining access to, or the denial of authorized access to, our IT systems or data, or our customers’ systems or data, including intellectual property and proprietary, sensitive or other confidential information. We have contractual and other legal obligations to notify relevant stakeholders of security breaches. For example, SEC rules require disclosure on Form 8-K of the nature, scope and timing of any material cybersecurity incident and the reasonably likely impact of any such incident. A security breach or resulting mandatory disclosure could result in a loss of confidence in the security of our services, damage our reputation, negatively impact our future sales, disrupt our business and lead to increases in insurance premiums and legal, regulatory and financial exposure and liability. Further, there can be no assurance that our insurance coverage will be sufficient to cover the financial, legal, business, or reputational losses that may result from a cybersecurity incident or breach of our IT systems. Finally, the detection, prevention and remediation of known or potential security vulnerabilities, including determining whether a cybersecurity incident is notifiable or reportable, may not be straightforward and may result in additional financial burdens due to additional direct and indirect costs to respond to or alleviate problems caused by the actual or perceived security breach, such as additional infrastructure capacity spending to mitigate any system degradation and the reallocation of resources from development activities. \nDefects or disruptions in our services could diminish demand for our services and subject us to substantial liability.\nWe have in the past and may in the future find defects in or experience disruptions to our services. Such issues may arise in a variety of circumstances, including due to our customers using our services in unanticipated ways that may cause a disruption in services for other customers attempting to access their data; as a result of employee, contractor or other third-party action or inaction; or due to the complexity of our services, which incorporate a variety of hardware, proprietary software and third-party and open-source software. Across the industry, cloud services frequently contain undetected errors when first introduced or when new versions or enhancements are released. We may also encounter difficulties integrating acquired or licensed technologies into our services and in augmenting the technologies we use to meet quality standards that are consistent with our brand and reputation, which may result in our services containing errors or defects. \nWe have experienced and may in the future experience defects in our products that create vulnerabilities that inadvertently permit access to protected customer data. We can provide no assurance that such product defects or other vulnerabilities will not occur in the future, have a material adverse effect on our business or subject us to substantial liability. Vulnerabilities in open source or any proprietary or third-party product can persist even after security patches have been issued if customers have not installed the most recent updates, or if the attackers exploited the vulnerabilities before patching was complete. In some cases, vulnerabilities may not be immediately detected, which may make it difficult to recover critical services and lead to damaged assets. \nSince our customers use our services for important aspects of their business, errors, defects, disruptions in service or other performance problems have in the past adversely impacted our customers’ businesses and could do so in the future. As a result, customers could elect to not renew our services or delay or withhold payment to us. We could also lose future sales or customers may make warranty or other claims against us, which could result in an increase in our allowance for doubtful accounts, an increase in collection cycles for accounts receivable or the expense and risk of litigation.\n13\nTable of Contents\nAny interruptions or delays in services from third parties, including data center hosting facilities, cloud computing platform providers and other hardware and software vendors, as well as internet availability, or from our inability to adequately plan for and manage service interruptions or infrastructure capacity requirements, could impair the delivery of our services and harm our business.\nWe currently rely on third-party data center hosting facilities and cloud computing platform providers located in the United States and other countries, as well as the many different underlying networks and services that power the Internet, to deliver our products, services and business operations and to operate critical business systems. We also rely on computer hardware purchased or leased from, software licensed from, and cloud computing platforms provided by, third parties in order to offer our services, including database software, hardware and data from a variety of vendors. Any disruption or damage to, or failure of our systems generally, including the systems of third-party providers we rely on, could result in service interruptions and harm our business. We have from time to time experienced service interruptions and such interruptions may occur in the future. As we increase our reliance on these third-party systems, particularly with respect to third-party cloud computing platforms, our exposure to damage from service interruptions or other performance or quality issues may increase. Service interruptions or other performance or quality issues may cause us to issue credits or pay penalties, cause customers to make warranty or other claims against us or to terminate their subscriptions, and adversely affect our attrition rates and our ability to attract new customers, all of which would reduce our revenue. Our business and reputation would also be harmed if our customers and potential customers believe our services are unreliable.\nFor many of our offerings, our production environment and customers’ data are replicated in a separate facility located elsewhere. Certain offerings, including some offerings of companies added through acquisitions, may be served through alternate facilities or arrangements. We do not control the operation of any of these facilities, and they may be vulnerable to damage or interruption from earthquakes, floods, fires, power loss, telecommunications failures and similar events. They may also be subject to break-ins, sabotage, intentional acts of destruction or vandalism or similar misconduct, as well as local administrative actions, changes to legal or permitting requirements and litigation to stop, limit or delay operation. In addition, supply chain disruptions due to geopolitical developments in Europe may lead to power disruptions in regions where our facilities are located. Despite precautions taken at these facilities, such as disaster recovery and business continuity arrangements, the occurrence of any of the foregoing events or risks, or a natural disaster or public health emergency, an act of terrorism, a decision to close the facilities without adequate notice or other unanticipated problems or operational failures at these facilities could result in lengthy service interruptions, and no assurance can be provided that any such interruptions would be remediated without significant cost or in a timely manner or at all.\nThe hardware, software, data and cloud computing platforms that we rely on, including, for example, the large language models leveraged in our AI offerings, may not continue to be available at reasonable prices, on commercially reasonable terms or at all. Any loss of the right to use any of these hardware, software, data or cloud computing platforms could significantly increase our expenses and disrupt or otherwise result in delays in the provisioning of our services until equivalent technology is either developed by us, or, if available, is identified, obtained through purchase or license and integrated into our services, and no assurance can be provided that such equivalent technology would be developed or obtained in a timely manner or at all.\nAs we scale our operations, the amount and type of information transferred on our offerings continues to evolve, including as a result of the deployment of AI technologies, and our infrastructure capacity requirements, including network capacity and computing power, may increase as a result. If we do not accurately plan for our infrastructure capacity requirements and we experience significant strains on our data center capacity, our customers could experience performance degradation or service outages that may subject us to financial liabilities, result in customer losses and harm our reputation and business. As we add data centers and capacity and continue to move to cloud computing platform providers, we move or transfer our data and our customers’ data from time to time. Despite precautions taken during this process, any unsuccessful data transfers may impair the delivery of our services, which may damage our business.\nAs we acquire companies or technologies, we may not realize the expected business or financial benefits and the acquisitions could prove difficult to integrate, disrupt our business, dilute stockholder value and adversely affect our operating results and the market value of our common stock.\nAs part of our business strategy, we periodically acquire complementary businesses, joint ventures, services and technologies and intellectual property rights. We continue to evaluate such opportunities and expect to make such acquisitions in the future. \nAcquisitions and other transactions and arrangements involve numerous risks and could create unforeseen operating difficulties and expenditures, including:\n•\npotential failure to achieve the expected benefits on a timely basis or at all;\n•\npotential identified or unknown security vulnerabilities in acquired products that expose us to additional security risks or delay our ability to integrate the product into our service offerings, as well as difficulties in increasing or maintaining the security standards for acquired technology;\n14\nTable of Contents\n•\ndifficulty of transitioning the acquired technology onto our existing platforms and customer acceptance of multiple platforms on a temporary or permanent basis; \n•\nbrand or reputational harm associated with our acquired companies;\n•\nchallenges converting the acquired company’s revenue recognition policies and forecasting the related revenues, including both consumption- and subscription-based revenues and term software license revenue, as well as appropriate allocation of the customer consideration to the individual deliverables;\n•\nchallenges entering into new markets in which we have little or no experience or where competitors may have stronger market positions;\n•\ncurrency and regulatory risks associated with foreign countries and potential additional cybersecurity and compliance risks resulting from entry into new markets;\n•\noperational and financial difficulties and strains on resources in integrating acquired operations, technologies, services, platforms and personnel;\n•\nregulatory challenges from antitrust or other regulatory authorities that may block, delay or impose conditions (such as divestitures, ownership or operational restrictions or other structural or behavioral remedies) on the completion of transactions or the integration of acquired operations;\n•\nfailure to fully assimilate, integrate or retrain acquired employees, which may lead to retention risk with respect to both key acquired employees and our existing key employees or disruption to existing teams or our workplace culture;\n•\nchallenges with maintaining the acquired company’s customers, partners and third-party service providers;\n•\nknown and potential unknown liabilities associated with the acquired businesses, including due to litigation;\n•\ndifficulties in managing, or potential write-offs of, acquired assets, and potential financial and credit risks associated with acquired customers; \n•\nnegative impact to our results of operations because of the depreciation and amortization of acquired intangible assets, fixed assets and operating lease right-of-use assets;\n•\ndifficulties in and financial costs of addressing acquired compensation structures inconsistent with our compensation structure;\n•\nadditional stock-based compensation issued or assumed in connection with the acquisition, including the impact on stockholder dilution and our results of operations;\n•\nineffective or inadequate controls, procedures and policies at the acquired company; and\n•\nthe tax effects related to integration and business operation changes, realizability of our deferred tax assets, and uncertain tax liabilities. \nAny of these risks could harm our business or negatively impact our results of operations. In addition, to facilitate acquisitions, we may seek additional equity or debt financing, which may not be available on terms favorable to us or at all, which may affect our ability to complete subsequent acquisitions, and which may affect the risks of owning our common stock. For example, if we finance acquisitions by issuing equity or convertible or other debt securities or loans, our existing stockholders may be diluted, or we could face constraints related to the terms of, and repayment obligation related to, the incurrence of indebtedness that could affect the market price of our common stock.\nOur ability to acquire other businesses or technologies, or integrate acquired businesses effectively, may be impaired by trade tensions and increased global scrutiny of foreign investments and acquisitions in the technology sector. For example, several countries, including the United States and countries in Europe and the Asia-Pacific region, are considering or have adopted restrictions of varying kinds on transactions involving foreign investments and acquisitions. Antitrust authorities in a number of countries have also reviewed acquisitions in the technology industry with increased scrutiny. Governments may continue to adopt or tighten restrictions of this nature, some of which may apply to acquisitions or integrations of businesses by us, and such restrictions or government actions could negatively impact our business and financial results.\nSupporting our existing and growing customer base could strain our personnel resources and infrastructure, and if we are unable to scale our operations and increase productivity, we may not be able to successfully implement our business plan.\nWe continue to experience significant growth in our customer base, including through acquisitions, which has placed a strain on and in the future may strain our management, administrative, operational and financial infrastructure. We anticipate that significant additional investments, including in human capital software, as well as leveraging agentic AI and other technologies, will be required to scale our operations and increase productivity, to address the needs of our customers, to further develop and enhance our services, to expand into new geographic areas and to scale with our overall growth. These investments will increase our cost base, making it more difficult for us to offset any future revenue shortfalls by reducing expenses in the \n15\nTable of Contents\nshort term. We may not be able to make these investments as quickly or effectively as necessary to successfully scale our operations.\nWe regularly upgrade or replace our various software systems and processes. If the implementations of these new applications are delayed, or if we encounter unforeseen problems with our new systems and processes or in migrating away from our existing systems and processes, our operations and our ability to manage our business could be negatively impacted. \nOur success will depend in part upon the ability of our senior management to plan and manage our projected growth effectively. To do so, we must continue to increase the productivity of our existing employees and to hire, train and manage new employees as needed. Additionally, changes in our work environment and workforce may not meet the needs and expectations of our workforce or may create operational and workplace culture challenges, which could negatively impact our ability to increase employee productivity or attract and retain our employees and could adversely affect our operations. To manage the expected domestic and international growth of our operations and personnel, we will need to continue to improve our operational, financial and management controls, our reporting systems and procedures and our utilization of real estate. If we fail to successfully scale our operations and increase productivity, we may be unable to execute our business plan and the value of our common stock could decline.\nIf our customers do not renew their subscriptions for our services or if they reduce the number of paying subscriptions at the time of renewal, our revenue and current remaining performance obligation could decline and our business may suffer. If customer usage of certain consumption-based offerings is below expected levels, our revenue could decline. If we cannot accurately predict subscription renewals or upgrade rates or optimal pricing for consumption-based contracts, we may not meet our revenue targets, which may adversely affect the market price of our common stock. \nOur customers have no obligation to renew their subscriptions for our services after the expiration of their contractual subscription period, which is typically 12 to 36 months, and in the normal course of business, some customers have elected not to renew. In addition, our customers may renew for fewer subscriptions, renew for shorter contract lengths or switch to lower cost offerings of our services, particularly in times of general economic uncertainty. It is difficult to predict attrition rates given our varied customer base and the number of multi-year subscription contracts. Our attrition rates may increase or fluctuate as a result of various factors, including customer dissatisfaction with our services, customers’ spending levels, mix of customer base, decreases in the number of users at our customers, competition, pricing increases or changes, such as the increased prevalence of consumption-based pricing models and economic downturns. \nOur future success also depends in part on our ability to sell additional features and services, more subscriptions or enhanced editions of our services to our current customers. This may also require increasingly sophisticated and costly sales efforts that are targeted at senior management. Similarly, the rate at which our customers purchase new or enhanced services depends on a number of factors, including general economic conditions and customer receptiveness to any price changes related to these additional features and services.\nIn addition, the markets and monetization strategies for certain offerings, including Agentforce and Data Cloud, remain relatively new and uncertain and as a result our expansion into such offerings, and related investments, may present additional risks and challenges. For example, we offer certain products, including Agentforce and Data Cloud, through a consumption-based business model and may increase the number of products through which we do so. We have limited experience with determining optimal pricing for our consumption-based contracts. Additionally, due to customer flexibility in the timing of their consumption, we could have lower levels of customer consumption of our products than we expect which may result in suboptimal pricing for consumption-based contracts.\nPeriodic changes to our sales organization can be disruptive and may reduce our rate of growth.\nWe periodically change and make adjustments to our sales organization in response to market opportunities, competitive threats, management changes, product introductions or enhancements, acquisitions, sales performance, increases in sales headcount, cost levels and other internal and external considerations. Such sales organization changes have in some periods resulted in, and may in the future result in, a reduction of productivity, which could negatively impact our rate of growth in the current and future quarters and operating results, including revenue. In addition, any significant change to the way we structure our compensation of our sales organization may be disruptive and may affect our revenue growth. \nSales to customers outside the United States expose us to risks inherent in international operations.\nWe sell our services throughout the world and are subject to risks and challenges associated with international business. We intend to seek to continue to expand our international sales efforts. The risks and challenges associated with sales to customers outside the United States or those that can affect international operations generally, include:\n•\nregional economic and political conditions, natural disasters, acts of war, terrorism and actual or threatened public health emergencies; \n•\nlocalization of our services, including translation into foreign languages and associated expenses;\n•\nregulatory frameworks or business practices favoring local competitors;\n16\nTable of Contents\n•\npressure on the creditworthiness of sovereign nations, where we have customers and a balance of our cash, cash equivalents and marketable securities;\n•\nforeign currency fluctuations and controls, which may make our services more expensive for international customers and could add volatility to or negatively impact our operating results;\n•\ncompliance with complex and evolving governmental laws and regulations, including employment, tax, anti-corruption, import/export, customs, anti-boycott, sanctions and embargoes, antitrust, cybersecurity, sustainability and industry-specific laws and regulations, including rules related to compliance by our third-party resellers;\n•\nliquidity issues or political actions by sovereign nations, including nations with a controlled currency environment, could result in decreased values of these balances or potential difficulties protecting our foreign assets or satisfying local obligations;\n•\nvetting and monitoring our third-party resellers in new and evolving markets to confirm they maintain standards consistent with our brand and reputation;\n•\ntreatment of revenue from international sources, evolving domestic and international tax environments and changes to tax codes, including being subject to and paying withholding taxes under foreign tax laws;\n•\nuncertainty regarding the imposition of and changes in trade policies, including trade wars, tariffs or other trade restrictions or the threat of such actions, or other geopolitical events, including the evolving relations between the United States and China, the United States and Russia, and ongoing conflicts, such as the war in Ukraine and the regional conflict in the Middle East;\n•\nperceptions of regions or governments in the regions where we operate or plan to operate, resulting in negative publicity or reputational harm;\n•\nregional data privacy laws and other regulatory requirements that apply to outsourced service providers and to the transmission of our customers’ data across international borders;\n•\ndifferent pricing environments;\n•\ndifficulties in staffing and managing foreign operations;\n•\ndifferent or lesser protection of our intellectual property, including increased risk of theft of our proprietary technology and other intellectual property, and more prevalent cybersecurity risks, particularly in jurisdictions in which we have historically chosen not to operate; and\n•\nlonger accounts receivable payment cycles and other collection difficulties.\nAny of these factors could negatively impact our business and results of operations. The above factors may also negatively impact our ability to successfully expand into emerging market countries, where we have little or no operating experience, where it can be costly and challenging to establish and maintain operations, including hiring and managing required personnel, and difficult to promote our brand, and where we may not benefit from any first-to-market advantage or otherwise succeed.\nAs more of our sales efforts are targeted at larger enterprise customers, our sales cycle may become more time-consuming and expensive, we may encounter pricing pressure and implementation and configuration challenges, and we may have to delay revenue recognition for some complex transactions, all of which could harm our business and operating results.\nAs we target more of our sales efforts at larger enterprise customers, including governmental entities, and specific industries, such as financial services and healthcare and life sciences, we may face greater costs, longer sales cycles, greater competition and less predictability in completing some of our sales. In these market segments, the customer’s decision to use our services is often an enterprise-wide decision and, if so, may require us to provide greater levels of education regarding the use and benefits of our services, as well as addressing concerns regarding privacy and data protection laws and regulations of prospective customers with international operations or whose own customers operate internationally.\nIn addition, larger customers and governmental entities often demand more configuration, integration services and features. As a result of these factors, these sales opportunities often require us to devote greater sales support and professional services resources to individual customers, driving up costs and time required to complete sales and diverting our own sales and professional services resources to a smaller number of larger transactions, while potentially requiring us to delay revenue recognition on some of these transactions until the technical or implementation requirements have been met.\nPricing and packaging strategies for enterprise and other customers for our existing and future service offerings, including for our AI offerings such as Agentforce, may not be widely accepted by new or existing customers. We offer certain products, such as Agentforce and Data Cloud, through a consumption-based pricing model, and we have limited experience with determining the optimal pricing for our consumption-based contracts. Due to customer flexibility in the timing of their consumption, we could have lower levels of customer consumption of our products than we expect may result in suboptimal \n17\nTable of Contents\npricing for consumption-based contracts. Our adoption of or failure to adopt, as well as the manner and time of, changes to our pricing and packaging models and strategies may harm our business.\nWe may lose key members of our management team or development and operations personnel, and may be unable to attract and retain employees we need to support our operations and growth.\nOur success depends substantially upon the continued services of our executive officers and other key members of management, particularly our chief executive officer. We are also substantially dependent on the continued service of our existing development and operations personnel because of the complexity of our services and technologies. Our executive officers, key management, development or operations personnel could terminate their employment with us at any time. Effective succession planning for management is important to our long-term success, and changes in our management team resulting from the hiring, departure or realignment of executives may be disruptive to our business. If we do not develop adequate succession planning for our key personnel, the loss of one or more of our key employees or groups of employees could seriously harm our business. \nThe technology industry is subject to substantial and continuous competition for engineers with high levels of experience in designing, developing and managing software and technology services, as well as competition for sales executives, data scientists and operations personnel. We have experienced challenges with significant competition in talent recruitment and retention, and may not in the future be successful in recruiting or retaining such talent. We have experienced and expect to continue to experience difficulty in hiring, developing, integrating and retaining highly skilled employees with appropriate qualifications. These difficulties may be amplified by evolving restrictions on immigration, travel, or availability of visas for skilled technology workers. Additionally, our compensation arrangements and benefits may not always be successful in attracting new employees or retaining and motivating our existing personnel. If we fail to attract new personnel or fail to retain and motivate our current personnel, our business and future growth prospects could be severely harmed. \nIn January 2023, we announced a restructuring plan intended to reduce operating costs, improve operating margins and continue advancing our ongoing commitment to profitable growth, which included a reduction of our workforce and office space reductions within certain markets. The workforce reduction was substantially completed by the end of fiscal 2024, and real estate actions are expected to be completed by the end of fiscal 2026. Additionally, throughout fiscal 2025 we initiated further targeted workforce and office space reductions. These restructuring actions, or any similar actions taken in the future, could negatively impact our ability to attract, integrate, retain and motivate key employees.\nIn addition, we believe in the importance of our corporate culture, which fosters dialogue, collaboration, recognition, equality and a sense of family. As our organization has grown and expanded globally, and as our workplace plans have developed, including workforce and office space reductions related to our restructuring actions, we have experienced and may continue to experience difficulties maintaining our corporate culture globally, including managing the complexities of communicating with all employees. Any inability to maintain our corporate culture could negatively impact our ability to attract and retain employees, harm our reputation with customers or negatively impact our future growth.\nAny failure in the delivery of high-quality professional and technical support services related to our online applications may adversely affect our relationships with our customers and our financial results.\nOur customers sometimes require highly skilled and trained service professionals to successfully implement our applications and depend on our support organization to resolve technical issues relating to our applications. Implementation services may be performed by us, our customers, a third party, or a combination thereof. Our strategy is to work with third parties to increase the breadth of capability and depth of capacity for delivery of these services to our customers. If customers are not satisfied with the quality and timing of work by us or a third party or with the type of services or solutions delivered, we could incur additional costs to address the situation, the profitability of that work might be impaired, our revenue recognition could be impacted and the customer’s dissatisfaction with the services received could negatively impact our ability to sell our other offerings to that customer or retain existing customers. In addition, negative publicity related to our customer relationships, regardless of its accuracy, may further damage our business by affecting our ability to compete for new business with current or prospective customers. We may be unable to respond quickly enough to accommodate short-term increases in customer demand for support services across our varying and diverse offerings. In addition, our sales process is highly dependent on our applications and business reputation and on positive recommendations from our existing customers. Any failure or perceived failure to maintain high-quality professional and technical support services could adversely affect our reputation, our ability to sell our service offerings to existing and prospective customers, and our business, operating results and financial position. \nStrategic and Industry Risks\nThe markets in which we participate are intensely competitive, and if we do not compete effectively, our operating results could be harmed.\n18\nTable of Contents\nThe market for enterprise applications and platform services is highly competitive, rapidly evolving, fragmented and subject to changing technology, low barriers to entry, shifting customer needs and frequent introductions of new products and services. Many prospective customers have invested substantial personnel and financial resources to implement and integrate their current enterprise software into their businesses and therefore may be reluctant or unwilling to migrate away from their current solution to a different enterprise software service. Additionally, third-party developers may be reluctant to build application services on our platform since they have invested in other competing technology platforms.\nOur current competitors include:\n•\nvendors of packaged business software, as well as companies offering enterprise applications delivered through on-premises offerings from enterprise software application vendors and cloud computing application service providers, either individually or with others;\n•\nsoftware companies that provide their product or service free of charge as a single product or when bundled with other offerings, or only charge a premium for advanced features and functionality, as well as companies that offer solutions that are sold without a direct sales organization;\n•\nvendors who offer software tailored to specific services, industries or market segments, as opposed to our full suite of service offerings, including suppliers of traditional business intelligence and data preparation products, integration software vendors, marketing vendors, e-commerce solutions vendors or AI software and service vendors;\n•\nproductivity tool and email providers, unified communications providers and consumer application companies that have entered the business software market; and\n•\ntraditional platform development environment companies and cloud computing development platform companies who may develop toolsets and products that allow customers to build new applications, including AI-augmented applications, that run on the customers’ current infrastructure or as hosted services, as well as would-be customers who may develop enterprise applications for internal use.\nIn addition, we may face more competition as we expand our product offerings. Some of our current and potential competitors may have competitive advantages, such as greater name recognition, longer operating histories, more significant installed bases, broader geographic scope, broader suites of service offerings and larger marketing budgets, as well as substantially greater financial, technical, personnel and other resources. In addition, many of our current and potential competitors have established marketing relationships and access to larger customer bases, and have major distribution agreements with consultants, system integrators and resellers. We also experience competition from smaller, younger competitors that may be more agile in responding to customers’ demands and offer more targeted and simplified solutions. Our competitors may be able to respond more quickly and effectively than we can to new or changing opportunities, technologies, standards or customer requirements, or provide competitive pricing, more flexible contracts or faster implementations. Additionally, as we continue to increase building AI into many of our offerings, we face more competition as AI technologies are increasingly integrated into the markets in which we compete. New AI offerings may disrupt workforce needs and negatively impact demand for our offerings, or our competitors may be able to incorporate AI into their offerings more efficiently or successfully than we are able to and achieve greater and faster adoption. Even if our services are more effective than the products and services that our competitors offer, potential customers might select competitive products and services in lieu of purchasing our services. For all of these reasons, we may not be able to compete successfully against our competitors, which could negatively impact our future sales and harm our business.\nOur efforts to expand our service offerings and to develop and integrate our existing services in order to keep pace with technological developments may not succeed and may reduce our revenue growth rate and harm our business.\nOur efforts to expand our current service offerings may not succeed and may reduce our revenue growth rate. In addition, the markets and monetization strategies for certain offerings, including Agentforce and Data Cloud, remain relatively new and uncertain and as a result our expansion into such offerings, and related investments, may present additional risks and challenges. For example, we offer certain products, including Agentforce and Data Cloud, through a consumption-based business model and may increase the number of products through which we do so. We have limited experience with determining optimal pricing for our consumption-based contracts. Additionally, due to customer flexibility in the timing of their consumption, we could have lower levels of customer consumption of our products than we expect which may result in suboptimal pricing for consumption-based contracts. Further, the introduction of future platform changes and upgrades may not result in long term revenue growth. \nIf we are unable to develop enhancements to, and new features for, our existing or new services that keep pace with rapid technological developments, our business could be harmed. The success of enhancements, new features and services depends on several factors, including its timely completion, introduction and market acceptance, as well as our ability to integrate all of our product and service offerings and develop adequate selling capabilities in new markets. Failure in this regard may significantly impair our revenue growth as well as negatively impact our operating results if the additional costs are not offset by additional revenues. In addition, because our services are designed to operate over various network technologies and on a \n19\nTable of Contents\nvariety of mobile devices, operating systems and computer hardware and software platforms, we need to continuously modify and enhance our services to keep pace with changes in these technologies, as well as continue to maintain and support our services on legacy systems. We may not be successful in either developing these modifications and enhancements or in bringing them to market timely.\nAdditionally, if we fail to timely anticipate or identify significant technology trends and developments, or if we do not devote appropriate resources to adapting to such trends and developments, our business could be harmed. Uncertainties about the timing and nature of new network platforms or technologies, modifications to existing platforms or technologies, including text messaging capabilities, or changes in customer usage patterns thereof could increase our research and development or service delivery expenses or lead to our increased reliance on certain vendors. Any failure of our services to operate effectively with future network platforms and technologies could reduce the demand for our services, result in customer dissatisfaction and harm our business. \nOur continued success depends on our ability to maintain and enhance our brands.\nWe believe that the brand identities we have developed, including associations with trust, customer success, innovation, equality and sustainability have significantly contributed to the success of our business. Maintaining and enhancing the Salesforce brand and our other brands is critical to expanding our base of customers, partners and employees. Our brand strength, particularly for our core services, depends largely on our ability to remain a technology leader and to continue to provide high-quality innovative products, services and features in a secure, reliable manner that enhances our customers’ success even as we scale and expand our services. In order to maintain and enhance the strength of our brands, we have made and may in the future make substantial investments to expand or improve our product offerings and services, or we may enter new markets that may be accompanied by initial complications or ultimately prove to be unsuccessful. \nIn addition, we have secured the naming rights to facilities controlled by third parties, such as office towers and a transit center, and any negative events or publicity arising in connection with these facilities could adversely impact our brand.\nFurther, entry into markets with weaker protection of brands or changes in the legal systems in countries we operate may impact our ability to protect our brands. If we fail to maintain, enhance or protect our brands, or if we incur excessive expenses in our efforts to do so, our business, operating results and financial condition may be materially and adversely affected. \nWe are subject to risks associated with our strategic investments, including partial or complete loss of invested capital. Significant changes in the fair value of this portfolio could negatively impact our financial results. \nWe manage a portfolio of strategic investments in both privately held and publicly traded companies focused primarily on enterprise cloud companies, technology startups and system integrators. While we invest in companies that we believe are digitally transforming their industries, advancing responsible generative AI, improving customer experiences, helping us expand our solution ecosystem or supporting other corporate initiatives, we may still experience unforeseen brand or reputational harm associated with our investments. Our investments range from early to late stage companies, including investments made concurrent with a company’s initial public offering. Investments in early stage companies are inherently speculative, as these companies may not yet be revenue-generating and could still be in the process of developing their products and services at the time of our investment. The financial success of our investment in any company is typically dependent on a liquidity event, such as a public offering, acquisition or other favorable market event reflecting appreciation to the cost of our initial investment. Our investments may face challenges from regulatory authorities, including antitrust authorities, potentially resulting in unexpected costs, delays, or unfavorable conditions imposed on transactions involving our investment portfolio. In certain cases, our ability to sell these investments may be impacted by contractual obligations to hold the securities for a set period of time after a public offering. All of our investments are subject to a risk of partial or total loss of invested capital.\nWe are exposed to volatility in our operating results due to changes in market prices, observable price changes and impairments of our strategic investments. The measurement of our non-marketable equity and debt securities at fair value is inherently subjective and requires management judgment and estimation. The resulting gains or losses could be material depending on market conditions and events, particularly in periods with economic uncertainty, inflation, geopolitical conflict, volatile public equity markets or unsettled global market conditions.\nIf third-party developers and providers do not continue to embrace our technology delivery model and enterprise cloud computing services, or if our customers seek warranties from us for third-party applications, integrations, data and content, our business could be harmed.\nOur success depends on the willingness of a growing community of third-party developers and technology providers to build applications and provide integrations, data and content that are complementary to our services. Without the continued development of these applications and provision of such integrations, data and content, both current and potential customers may not find our services sufficiently attractive, which could impact future sales. In addition, for those customers who authorize a third-party technology partner to access their data, we do not provide any warranty related to the functionality, security or integrity of the data access, transmission or processing. Despite contract provisions to protect us, customers may look to us to \n20\nTable of Contents\nsupport and provide warranties for the third-party applications, integrations, data and content, even though not developed or sold by us, which may expose us to potential claims, liabilities and obligations, all of which could harm our reputation and our business.\nSocial and ethical issues, including the use or capabilities of AI in our offerings, may result in reputational harm and liability.\nPolicies we adopt or choose not to adopt on social and ethical issues, especially regarding the use of our products, may be unpopular with some of our employees or with our customers or potential customers, and have in the past impacted and may in the future impact our ability to attract or retain employees and customers. Our decisions about whether to conduct business with potential customers, or whether to continue or expand business with existing customers, may also impact our ability to attract or retain employees and customers, and could result in negative publicity or reputational harm. Further, actions taken by our customers and employees, including through the use or misuse of our products or new technologies for illegal activities or improper information sharing, may result in reputational harm or possible liability, particularly in light of regulatory requirements like the Digital Services Act (“DSA”) from the EU. For example, we have been subject to allegations in legal proceedings that we should be liable for the use of certain of our products by third parties. Although we believe that we have a strong defense against these allegations, legal proceedings can be lengthy, expensive and disruptive to our operations and the outcome of any claims or litigation, regardless of the merits, is inherently uncertain. Regardless of outcome, these types of claims could cause reputational harm to our brand or result in liability. \nWe are increasingly building AI into many of our offerings, including generative and agentic AI. As with many innovations, AI offerings, such as Agentforce, and our Salesforce Platform present additional risks and challenges that could affect their adoption and therefore our business. For example, the development of our AI offerings and the Salesforce Platform, which provides information regarding our customers’ customers, present emerging ethical issues. If we enable or offer solutions that draw controversy due to their perceived or actual impact on human rights, privacy, employment, or in other social contexts, we may experience new or enhanced governmental or regulatory scrutiny, brand or reputational harm, competitive harm or legal liability, especially as geopolitical turmoil creates increasingly volatile political and market conditions. Inadequate or ineffective AI development, deployment, content labeling or governance by us or others that result in controversy could also impair the acceptance of AI solutions or result in unintended performance of the services. This in turn could undermine confidence in the decisions, predictions, analysis or other content that our AI applications produce, subjecting us to competitive harm, legal liability and brand or reputational harm. The rapid evolution of AI will require the application of resources to develop, test and maintain our products and services to help ensure that AI is implemented ethically in order to minimize unintended, harmful impact. Uncertainty around new and emerging AI applications such as generative AI content creation and AI agents will require additional investment in compliance, governance and the licensing or development of proprietary datasets, machine learning models and systems to test for accuracy, bias and other variables, which are often complex, may be costly and could impact our profit margin. Moreover, the move from AI content classification to AI content generation through our development of Agentforce and other generative AI products brings additional risks and responsibility. Known risks of generative AI currently include risks related to accuracy, bias, toxicity, privacy and security and data provenance. For example, AI technologies, including generative AI, may create content that appears correct but is factually inaccurate or flawed, or contains copyrighted or other protected material, and if our customers or others use this flawed or protected content to their detriment, or the owners of such copyrighted material seek to enforce their rights, we may be exposed to brand or reputational harm, competitive harm and/or legal liability. Developing, testing and deploying AI systems may also increase the cost profile of our offerings due to the nature of the computing costs involved in such systems. If we are unable to mitigate these risks, or if we incur excessive expenses in our efforts to do so, our reputation, business, operating results and financial condition may be harmed. \nThe evolving landscape related to ESG matters may expose us to risks that could adversely affect our reputation and performance.\nEquality and sustainability are core values of the Company. In furtherance of these values, we have in the past and may in the future establish and disclose quantitative and qualitative statements related to ESG matters, which are aspirational and subject to numerous risks and dependencies. The proliferation of regulations addressing climate, human capital and other ESG topics at the regional, state, national and international levels has required and may continue to require significant effort and resources, and our practices, processes and controls may not ensure compliance with evolving standards. Further, various regulations may conflict with each other, making universal compliance challenging as a multinational company, and our status as a government contractor in various jurisdictions, including but not limited to the U.S. where we are headquartered, may also result in greater exposure or differentiated obligations or requirements with which we would seek to comply. The standards and frameworks for tracking and reporting on ESG matters continue to evolve, and our use, interpretation or application of such frameworks and standards may change from time to time or differ from those of other companies, which may result in a lack of consistent or meaningful comparative data from period to period or between Salesforce and other companies. In addition, our ESG practices and disclosures may not satisfy, appropriately respond to the concerns of or be supported by all investors, customers, partners, regulators, enforcement authorities or other stakeholders (including those in support of and those in \n21\nTable of Contents\nopposition to various ESG practices), whose expectations and requirements are evolving and varied. Any violation of, non-compliance with or failure to meet such expectations or requirements, or negative publicity related to our ESG practices or disclosures, could result in harm to our reputation, our ability to attract or retain employees, and our attractiveness as an investment, business partner, acquiror or service provider, could expose us to increased scrutiny or criticism or to regulatory or enforcement actions or litigation, and could cause us to incur increased costs to address or defend against such actions.  \nLegal and Regulatory Risks\nPrivacy concerns and laws as well as evolving regulation of cloud computing, AI services, cross-border data transfer restrictions and other domestic or foreign regulations may limit the use and adoption of our services and adversely affect our business.\nRegulation related to the provision of services over the Internet is evolving, as federal, state and foreign governments continue to adopt new, or modify existing, laws and regulations addressing data privacy, cybersecurity, data protection, data sovereignty and the collection, processing, storage, hosting, transfer and use of data, generally. In some cases, data privacy laws and regulations, such as the EU’s General Data Protection Regulation (“GDPR”), impose obligations directly on us as both a data controller and a data processor, as well as on many of our customers. In addition, domestic data privacy laws, such as the California Consumer Privacy Act as amended by the California Privacy Rights Act (“CCPA”), and laws that have recently passed and/or gone into effect in many other states similarly impose new obligations on us and many of our customers, potentially as both a covered business and service provider. These laws continue to evolve, including, for example, India’s Digital Personal Data Protection Act 2023, and as various jurisdictions introduce similar proposals, which often include subsequent rules and regulation, we and our customers become subject to additional regulatory burdens. New EU laws, including the DSA, the Data Act and the AI Act, may impose additional rules and restrictions on the use of our products and services. \nIn addition, various safe harbors have historically been provided to those who hosted content provided by others, such as safe harbors from monetary damages for copyright infringement arising from copyrighted content provided by customers and others and for defamation and other torts arising from information provided by customers and others. There is an increasing demand for repealing or limiting these safe harbors by either judicial decision or legislation, and we have active legal proceedings that have been impacted by the repeal or limiting of safe harbors that were previously available to us. Loss of these safe harbors may require altering or limiting some of our services or may require additional contractual terms to avoid liabilities for our customers’ misconduct.\nAlthough we monitor the regulatory, judicial and legislative environment and have invested in addressing these developments, these laws may require us to make additional changes to our practices and services to enable us or our customers to meet the new legal requirements, and may also increase our potential liability exposure through new or higher potential penalties for noncompliance, including as a result of penalties, fines and lawsuits related to data breaches. Furthermore, privacy laws and regulations are subject to differing interpretations and may be inconsistent among jurisdictions. These and other requirements are causing increased scrutiny among customers, particularly in the public sector and highly regulated industries, and may be perceived differently from customer to customer. These developments could reduce demand for our services, require us to take on more onerous obligations in our contracts, restrict our ability to store, transfer and process data or, in some cases, impact our ability or our customers’ ability to offer our services in certain locations, to deploy our solutions, to reach current and prospective customers, or to derive insights from customer data globally. For example, in July 2020, the Court of Justice of the European Union (“CJEU”) invalidated the EU-U.S. Privacy Shield Framework, one of the mechanisms that allowed companies, including us, to transfer personal data from the European Economic Area (“EEA”) to the United States. Even though the CJEU decision upheld the Standard Contractual Clauses (“SCCs”) as an adequate transfer mechanism, the decision created uncertainty around the validity of all EU-to-U.S. data transfers. While the EU and U.S. governments have since adopted the EU-U.S. Data Privacy Framework to foster EU-to-U.S. data transfers and address the concerns raised in the aforementioned CJEU decision, it is uncertain whether this framework will be overturned in court like the previous two EU-U.S. bilateral cross-border transfer frameworks. As a result, regulators may continue to be inclined to interpret the CJEU’s decision, and the logic behind it, as significantly restricting certain cross-border transfers and the cost and complexity of providing our services in certain markets may increase. Certain countries outside of the EEA have also passed or are considering passing laws requiring varying degrees of local data residency. By way of further example, statutory damages available through a private right of action for certain data breaches under the CCPA, may increase our and our customers’ potential liability and the demands our customers place on us.\nThe costs of compliance with, and other burdens imposed by, privacy laws, regulations and standards may limit the use and adoption of our services, reduce overall demand for our services, make it more difficult to meet expectations from our commitments to customers and our customers’ customers, lead to significant fines, penalties or liabilities for noncompliance, impact our reputation, or slow the pace at which we close sales transactions, in particular where customers request specific warranties and unlimited indemnity for noncompliance with privacy laws, any of which could harm our business.\n22\nTable of Contents\nIn addition to government activity, privacy advocates and other industry groups have established or may establish new self-regulatory standards that may place additional burdens on our ability to provide our services globally. Our customers expect us to meet voluntary certification and other standards established by third parties. If we are unable to maintain these certifications or meet these standards, it could adversely affect our ability to provide our solutions to certain customers and could harm our business. In addition, we have seen a trend toward the private enforcement of data protection obligations, including through private actions for alleged noncompliance, which could harm our business and negatively impact our reputation. For example, in 2020 we were made a party to a legal proceeding brought by a Dutch privacy advocacy group (the Privacy Collective) on behalf of certain Dutch citizens that claims we violated the GDPR and Dutch Telecommunications Act through the processing and sharing of data in connection with our Audience Studio and Data Studio products. In December 2021, the Amsterdam District Court declared the Privacy Collective’s claims against us inadmissible and dismissed the case, however, this ruling was appealed by the Privacy Collective. The appeal hearing took place in the Amsterdam Court of Appeal in February 2024 and the appellate court reversed the district court’s judgment. We have appealed that appellate decision to the Dutch Supreme Court. We were also named as a defendant in a similar lawsuit brought in the UK, which has subsequently been dismissed. Although we believe we have a strong defense for these claims, these or similar future claims could cause reputational harm to our brand or result in liability. In addition, a shift in consumers’ data privacy expectations or other social, economic or political developments could impact the regulatory enforcement of privacy regulations, which could require our cooperation and increase the cost of compliance with the imposed regulations. \nFurthermore, the uncertain and shifting regulatory environment and trust climate may raise concerns regarding data privacy and cybersecurity, which may cause our customers or our customers’ customers to resist providing the data necessary to allow our customers to use our services effectively. In addition, new products we develop or acquire in connection with changing events may expose us to liability or regulatory risk. Even the perception that the privacy and security of personal information are not satisfactorily protected or do not meet regulatory requirements could inhibit sales of our products or services and could limit adoption of our cloud-based solutions.\nIndustry-specific regulations and other requirements and standards are evolving and industry-specific laws, regulations, interpretive positions or standards could harm our business.\nOur customers and potential customers conduct business in a variety of industries, including financial services, the public sector, healthcare and telecommunications. Regulators in certain industries have adopted and may in the future adopt regulations or interpretive positions regarding the use of cloud computing, AI services and other outsourced services. The costs of compliance with, and other burdens imposed by, industry-specific laws, regulations and interpretive positions may limit our customers’ use and adoption of our services and reduce overall demand for our services. Compliance with these regulations may also require us to devote greater resources to support certain customers, which may increase costs and lengthen sales cycles. For example, some financial services regulators have imposed guidelines for use of cloud computing services that mandate specific controls or require financial services enterprises to obtain regulatory approval prior to outsourcing certain functions. If we are unable to comply with these guidelines or controls, or if our customers are unable to obtain regulatory approval to use our services where required, our business may be harmed. In addition, an inability to satisfy the standards of certain voluntary third-party certification bodies that our customers may expect, such as an attestation of compliance with the Payment Card Industry Data Security Standards, may have an adverse impact on our business and results. Any inability in the future to achieve or maintain industry-specific certifications or other requirements or standards relevant to our customers may harm our business and adversely affect our results.\nFurther, in some cases, industry-specific, regionally-specific or product-specific laws, regulations or interpretive positions may impact our ability, as well as the ability of our customers, partners and data providers, to collect, augment, analyze, use, transfer and share personal and other information that is integral to certain services we provide. The interpretation of many of these statutes, regulations and rulings is evolving in the courts and administrative agencies and an inability to comply may have an adverse impact on our business and results. This impact may be particularly acute in countries that have passed or are considering passing legislation that requires data to remain localized “in country,” as this may impose financial costs on companies required to store data in jurisdictions not of their choosing and to use nonstandard operational processes that add complexity and are difficult and costly to integrate with global processes. This is also true with respect to the global proliferation of laws regulating the financial services industry, including its use of cloud services. In Europe, the Digital Operational Resilience Act (“DORA”), which aims to ensure the resilience of the EU financial sectors, including through mandatory risk management, incident reporting, resilience testing and third-party outsourcing restrictions, went into effect in January 2025. The UK is advancing similar legislation and other countries may follow. \nFurther, countries and states are applying their data and consumer protection laws to AI, and particularly generative AI, and/or are enacting or considering legal frameworks on AI, such as the Utah Artificial Intelligence Policy Act, the Colorado Artificial Intelligence Act and the draft CCPA regulations on automated decision-making technology. Any failure or perceived failure by us to comply with such requirements could have an adverse impact on our business.\n23\nTable of Contents\nThere are various statutes, regulations and rulings relevant to direct email marketing and text-messaging, including the Telephone Consumer Protection Act (“TCPA”) and related Federal Communication Commission orders, which impose significant restrictions on the ability to utilize telephone calls and text messages to mobile telephone numbers as a means of communication, when the prior consent of the person being contacted has not been obtained. We have been, and may in the future be, subject to one or more class-action lawsuits, as well as individual lawsuits, containing allegations that one of our businesses or customers violated the TCPA. A determination that we or our customers violated the TCPA or other communications-based statutes could expose us to significant damage awards that could, individually or in the aggregate, materially harm our business. In addition, many jurisdictions across the world are currently considering, or have already begun implementing, changes to antitrust and competition laws, regulations or interpretative positions to enhance competition in digital markets and address practices by certain digital platforms that they perceive to be anticompetitive. These regulatory efforts could result in laws, regulations or interpretative positions that may require us to change certain of our business practices, undertake new compliance obligations or otherwise may have an adverse impact on our business and results. \nWe have been and may in the future be sued by third parties for various claims, including alleged infringement of proprietary rights.\nWe are involved in various legal matters arising from the normal course of business activities. These include claims, suits, government investigations and other proceedings involving alleged infringement of third-party patents and other intellectual property rights, as well as commercial, corporate and securities, labor and employment, class actions, wage and hour, antitrust, data privacy, cybersecurity and other matters.\nThe software and Internet industries are characterized by the existence of many patents, trademarks, trade secrets and copyrights and by frequent litigation based on allegations of infringement or other violations of intellectual property rights. We have received in the past and may receive in the future communications from third parties, including practicing entities and non-practicing entities, claiming that we have infringed their intellectual property rights. We have also been, and may in the future be, sued by third parties for alleged infringement of their claimed proprietary rights. Our technologies may be subject to injunction if they are found to infringe the rights of a third party or we may be required to pay damages, or both. Further, many of our subscription agreements require us to indemnify our customers for third-party intellectual property infringement claims, which would increase the cost to us of an adverse ruling on such a claim.\nIn addition, we have in the past been, and may in the future be, sued by third parties who seek to target us for actions taken by our customers, including through the use or misuse of our products. For example, we have been subject to allegations in legal proceedings that we should be liable for the use of certain of our products by third parties. Although we believe we have a strong defense for these claims, such claims could cause reputational harm to our brand or result in liability. \nOur exposure to risks associated with various claims may be increased as a result of acquisitions of other companies. For example, we are subject to ongoing securities class action litigation and related stockholder derivative claims brought against Slack that remain outstanding, and as to which we may ultimately be subject to liability or settlement costs. Additionally, we may have a lower level of visibility into the development process with respect to intellectual property or the care taken to safeguard against infringement risks with respect to acquired companies or technologies. In addition, third parties have made claims in connection with our acquisitions and may do so in the future, and they may also make infringement and similar or related claims after we have acquired technology that had not been asserted prior to our acquisition.\nThe outcome of any claims or litigation, regardless of the merits, is inherently uncertain. Any claims or lawsuits, and the disposition of such claims and lawsuits, whether through settlement or licensing discussions, or litigation, could be time-consuming and expensive to resolve, divert management attention from executing our business plan, result in efforts to enjoin our activities, lead to attempts on the part of other parties to pursue similar claims and, in the case of intellectual property claims, require us to change our technology, change our business practices, pay monetary damages or enter into short- or long-term royalty or licensing agreements.\nAny adverse determination or settlement could prevent us from offering our services to others, could be material to our financial condition or cash flows, or both, or could otherwise adversely affect our operating results, including our operating cash flow in a particular period. In addition, depending on the nature and timing of any such dispute, an unfavorable resolution of a legal matter could materially affect our current or future results of operations or cash flows in a particular period.\nAny failure to obtain registration or protection of our intellectual property rights could impair our ability to protect our proprietary technology and our brand, causing us to incur significant expenses and harm our business.\nIf we fail to protect our intellectual property rights adequately, our competitors may gain access to our technology, affecting our brand, causing us to incur significant expenses and harming our business. Any of our patents, trademarks or other intellectual property rights may be challenged by others or invalidated through administrative process or litigation. While we have many U.S. patents and pending U.S. and international patent applications, we may be unable to obtain patent protection for the technology covered in our patent applications or the patent protection may not be obtained quickly enough to meet our business needs. In addition, our existing patents and any patents issued in the future may not provide us with competitive \n24\nTable of Contents\nadvantages, or may be successfully challenged by third parties. Similar uncertainty applies to our U.S. and international trademark registrations and applications. Furthermore, legal standards relating to the validity, enforceability and scope of protection of intellectual property rights are uncertain, and we also may face proposals to change the scope of protection for some intellectual property rights in the U.S. and elsewhere. Additionally, the intellectual property ownership and license rights, including copyright, surrounding AI technologies, which we are increasingly building into our product offerings, has not been fully addressed by U.S. courts or other federal or state laws or regulations, and the use or adoption of AI technologies in our products and services may expose us to copyright infringement or other intellectual property misappropriation claims related to AI training or output. Effective patent, trademark, copyright and trade secret protection may not be available to us in every country in which our services are available and legal changes and uncertainty in various countries’ intellectual property regimes may result in making conduct that we believe is lawful to be deemed violative of others’ rights. The laws of some foreign countries may not be as protective of intellectual property rights as those in the U.S., and mechanisms for enforcement of intellectual property rights may be inadequate. Also, our involvement in standard-setting activity, our contribution to open source projects, various competition law regimes or the need to obtain licenses from others may require us to license our intellectual property in certain circumstances. Accordingly, despite our efforts, we may be unable to prevent third parties from using our intellectual property.\nWe may be required to spend significant resources and expense to monitor and protect our intellectual property rights. We may initiate claims or litigation against third parties for infringement of our proprietary rights or to establish the validity of our proprietary rights. If we fail to protect our intellectual property rights, it could impact our ability to protect our technology and brand. Furthermore, any litigation, whether or not it is resolved in our favor, could result in significant expense to us, cause us to divert time and resources from our core business, and harm our business.\nWe may be subject to risks related to government contracts and related procurement regulations.\nContracting with federal, state, local and foreign governments or state-owned entities subjects us to various procurement regulations and other requirements relating to these contracts’ formation, administration and performance, and how we engage with government officials. We are from time to time subject to audits, inquiries and investigations relating to our government contracts, which may result in adverse perceptions of our business, reductions in utilization of our services or termination of our contracts without cause and at any time. Additionally, any violations could result in various civil and criminal penalties and administrative sanctions, including termination of contracts, refunding or suspending of payments, forfeiture of profits, payment of fines and suspension or debarment from future government business, as well as reputational harm. Additionally, our contracting with certain government entities may result in negative publicity or reputational harm. Any of these risks related to contracting with governmental entities could adversely impact our future sales, costs of doing business and operating results.\nWe are subject to governmental sanctions and export and import controls that could impair our ability to compete in international markets and may subject us to liability if we are not in full compliance with applicable laws. \nOur solutions are subject to trade control laws and regulations where we conduct our business activities, including the U.S. Commerce Department’s Export Administration Regulations, U.S. customs regulations, U.S. supply chain regulations and various economic and trade sanctions regulations administered by the U.S. Treasury Department’s Office of Foreign Assets Control. If we fail to comply with applicable trade control laws and regulations, we and certain of our employees could be subject to substantial civil or criminal penalties, including the possible loss of trade privileges; fines, which may be imposed on us and responsible employees or managers; and, in extreme cases, the incarceration of responsible employees or managers. Obtaining necessary authorizations, including any required licenses, may be time-consuming, requires expenditure of corporate resources, is not guaranteed, and may result in the delay or loss of sales opportunities or the ability to realize value from certain acquisitions or engagements. Acquisitions may also subject us to successor liability and other integration compliance risks. Furthermore, export control and economic sanctions laws and regulations may prohibit or limit the transfer of certain products and services to embargoed or sanctioned countries, governments and parties. We can provide no assurance that any of the precautions we take to prevent our solutions from being provisioned or provided to sanctions targets in violation of applicable regulations will be effective, and, accordingly, our solutions could be provisioned or provided to those targets, including by our resellers or other third parties, which could have negative consequences for our business, including government investigations, penalties and reputational harm. Changes in our solutions or trade control laws and regulations may create delays in the introduction, sale and deployment of our solutions in international markets or prevent the export or import of our solutions to certain countries, governments or persons altogether. Any decreased use of our solutions or limitation on our ability to export or sell our solutions may adversely affect our business, financial condition and results of operations. Sanctions and export and import control regulations in the United States and other countries are subject to change and uncertainty, including as a result of rapidly evolving technology, increased government regulation of AI and cloud service solutions, and geopolitical developments such as events affecting relations between the United States and China, multi-jurisdictional sanctions on Russia, the war in Ukraine and regional conflict in the Middle East. Regulators in the United States and elsewhere have signaled an increased emphasis on sanctions and export control enforcement, including efforts to combat diversion of services to sanctioned countries and parties, several recent high-profile enforcement actions and increased pressure for companies to self-disclose potential violations.\n25\nTable of Contents\nFinancial Risks\nBecause we generally recognize revenue from subscriptions for our services over the term of the subscription, downturns or upturns in new business may not be immediately reflected in our operating results.\nWe generally recognize revenue from customers ratably over the terms of their subscription and support agreements, which are typically 12 to 36 months. As a result, most of the revenue we report in each quarter is the result of subscription and support agreements entered into during previous quarters. Consequently, a decline in new or renewed subscriptions in any one quarter may not be reflected in our revenue results for that quarter but will negatively impact our revenue in future quarters. Accordingly, the effect of significant downturns in sales and market acceptance of our services, and changes in our attrition rate, may not be fully reflected in our results of operations until future periods. Our subscription model also makes it difficult for us to rapidly increase our revenue through additional sales in any period, as revenue from new customers must be recognized over the applicable subscription and support term.\nIf we experience significant fluctuations in our rate of anticipated growth and fail to balance our expenses with our revenue forecasts, our business could be harmed and the market price of our common stock could decline.\nDue to the unpredictability of future general economic and financial market conditions, including from the global economic impact of ongoing conflicts, such as the war in Ukraine and the regional conflict in the Middle East; the pace of change and innovation in enterprise cloud computing services; the impact of foreign currency exchange rate fluctuations; uncertainty regarding changes in trade policy; changing interest rates and inflation; the growing complexity of our business, including the use of multiple pricing and packaging models and the increasing amount of revenue from term software license sales; and our increasing focus on enterprise cloud computing services, we may not be able to realize our projected revenue growth plans. We plan our expense and investment levels based on estimates of future revenue and future anticipated rate of growth. We may not be able to adjust our spending appropriately if the addition of new subscriptions or the renewals of existing subscriptions fall short of our expectations, and unanticipated events may cause us to incur expenses beyond what we anticipated. A portion of our expenses may also be fixed in nature for some minimum amount of time, such as with costs capitalized to obtain revenue contracts, data center and infrastructure service contracts or office leases, so it may not be possible to reduce costs in a timely manner, or at all, without the payment of fees to exit certain obligations early. Additionally, if sales through indirect channels or for consumption-based product offerings increase, this may lead to greater difficulty in forecasting revenue and anticipated rate of growth. As a result, our revenues, operating results and cash flows may fluctuate significantly on a quarterly basis and revenue growth rates may not be sustainable and may decline in the future. If we are not able to provide continued operating margin expansion, our business could be harmed and the market price of our common stock could decline.\nUnanticipated changes in our effective tax rate and additional tax liabilities and global tax developments may impact our financial results.\nWe are subject to income taxes in the United States and various other jurisdictions. Significant judgment is often required in the determination of our worldwide provision for income taxes. Our effective tax rate could be impacted by changes in our earnings and losses in countries with differing statutory tax rates, changes in operations, changes in non-deductible expenses, changes in the tax effects of stock-based compensation expense, changes in the valuation of deferred tax assets and liabilities and our ability to utilize them, the applicability of withholding taxes, effects from acquisitions and changes in accounting principles and tax laws. Any changes, ambiguity or uncertainty in taxing jurisdictions’ administrative interpretations, decisions, policies and positions could also materially impact our income tax liabilities. \nWe may also be subject to additional tax liabilities and penalties due to changes in non-income based taxes resulting from changes in federal, state, local or international tax laws, changes in taxing jurisdictions’ administrative interpretations, decisions, policies and positions, results of tax examinations, settlements or judicial decisions, changes in accounting principles, or changes to our business operations, including as a result of acquisitions. Any resulting increase in our tax obligation or cash taxes paid could adversely affect our cash flows and financial results.\nWe are also subject to tax examinations or engaged in alternative resolutions in multiple jurisdictions. While we regularly evaluate new information that may change our judgment resulting in recognition, derecognition or changes in measurement of a tax position taken, there can be no assurance that the final determination of any examinations will not have an adverse effect on our operating results or financial position.\nAs our business continues to grow, increasing our brand recognition and profitability, we may be subject to increased scrutiny and corresponding tax disputes, which may impact our cash flows and financial results. Furthermore, our growing prominence may bring public attention to our tax profile, and if perceived negatively, may cause brand or reputational harm.\nGlobal tax developments applicable to multinational businesses may have a material impact to our business, cash flows, or financial results. Such developments, for example, may include certain provisions introduced by certain Organization for Economic Co-operation and Development’s proposals including the implementation of the global minimum tax under the Pillar Two model rules, and the European Commission’s and certain major jurisdictions’ heightened interest in and taxation of \n26\nTable of Contents\ncompanies participating in the digital economy. Furthermore, governments’ responses to macroeconomic factors and tax revenue needs may lead to tax rule changes that could materially and adversely affect our cash flows and financial results. \nWe are exposed to fluctuations in currency exchange rates that have in the past and could in the future negatively impact our financial results and cash flows from changes in the value of the U.S. Dollar versus local currencies. \nWe primarily conduct our business in the following regions: the Americas, Europe and Asia Pacific. The expanding global scope of our business exposes us to risk of fluctuations in foreign currency markets, including in emerging markets. This exposure is the result of selling in multiple currencies, growth in our international investments, additional headcount in foreign locations, and operating in countries where the functional currency is the local currency. Specifically, our results of operations and cash flows are subject to currency fluctuations primarily in Euro, British Pound Sterling, Japanese Yen, Canadian Dollar, Australian Dollar, Brazilian Real and Indian Rupee against the U.S. Dollar. These exposures may change over time as business practices evolve, economic and political conditions change and evolving tax regulations come into effect. The fluctuations of currencies in which we conduct business can both increase and decrease our overall revenue and expenses for any given fiscal period. Furthermore, fluctuations in foreign currency exchange rates, combined with the seasonality of our business, could affect our ability to accurately predict our future results and earnings.\nAdditionally, global events as well as geopolitical developments, including the war in Ukraine and regional conflict in the Middle East, fluctuating commodity prices, uncertainty regarding changes in trade policy and inflation, have caused, and may in the future cause, global economic uncertainty and uncertainty about the interest rate environment, which has and could in the future amplify the volatility of currency fluctuations. Although we attempt to mitigate some of this volatility and related risks through foreign currency hedging, our hedging activities are limited in scope and may not effectively offset the adverse financial impacts that may result from unfavorable movements in foreign currency exchange rates, which could adversely impact our financial condition or results of operations.\nOur debt service obligations, lease commitments and other contractual obligations may adversely affect our financial condition, results of operations and cash flows.\nAs of January 31, 2025, we had a substantial level of outstanding debt, including our Senior Notes. We are also party to the Revolving Loan Credit Agreement, which provides for our $5.0 billion Credit Facility. Although there were no outstanding borrowings under the Credit Facility as of January 31, 2025, we may use the proceeds of future borrowings under the Credit Facility for general corporate purposes.\nIn addition to the outstanding and potential debt obligations above, we have also recorded substantial liabilities associated with noncancellable future payments on our long-term lease agreements. We also have significant other contractual commitments, including leases that have not yet commenced and commitments with infrastructure service providers, which are not reflected on our consolidated balance sheets. \nMaintenance of our indebtedness and contractual commitments and any additional issuances of indebtedness could:\n•\nimpair our ability to obtain additional financing in the future for working capital, capital expenditures, acquisitions, general corporate or other purposes;\n•\ncause us to dedicate a substantial portion of our cash flows from operations toward debt service obligations and principal repayments; and \n•\nmake us more vulnerable to downturns in our business, our industry or the economy in general.\nOur ability to meet our expenses and debt obligations will depend on our future performance, which will be affected by financial, business, economic, regulatory and other factors. We will not be able to control many of these factors, such as economic conditions and governmental regulations. Further, our operations may not generate sufficient cash to enable us to service our debt or contractual obligations resulting from our leases. If we fail to make a payment on our debt, we could be in default on such debt. If we are at any time unable to generate sufficient cash flows from operations to service our indebtedness when payment is due, we may be required to attempt to renegotiate the terms of the instruments relating to the indebtedness, seek to refinance all or a portion of the indebtedness or obtain additional financing. There can be no assurance that we would be able to successfully renegotiate such terms, that any such refinancing would be possible or that any additional financing could be obtained on terms that are favorable or acceptable to us. Any new or refinanced debt may be subject to substantially higher interest rates, which could adversely affect our financial condition and impact our business. \nIn addition, adverse changes by any rating agency to our credit ratings may negatively impact our reputation, the value and liquidity of both our debt and equity securities, as well as the potential costs associated with a refinancing of our debt. Downgrades in our credit ratings could also affect the terms of any such refinancing or future financing or restrict our ability to obtain additional financing in the future.\nThe indentures governing our Senior Notes and the Revolving Loan Credit Agreement impose restrictions on us and require us to maintain compliance with specified covenants. Our ability to comply with these covenants may be affected by events beyond our control. A failure to comply with the covenants and other provisions of our outstanding debt could result in \n27\nTable of Contents\nevents of default under such instruments, which could permit acceleration of all of our debt and borrowings. Any required repayment of our debt as a result of a fundamental change or other acceleration would lower our current cash on hand such that we would not have those funds available for use in our business.\nLease accounting guidance requires that we record a liability for operating lease activity on our consolidated balance sheet, which increases both our assets and liabilities and therefore may impact our ability to obtain the necessary financing from financial institutions at commercially viable rates or at all. Our lease terms may include options to extend or terminate the lease. Periods beyond the noncancellable term of the lease are included in the measurement of the lease liability and associated asset only when it is reasonably certain that we will exercise the associated extension option or waive the termination option. We reassess the lease term if and when a significant event or change in circumstances occurs within our control. The potential impact of these options to extend could be material to our financial position and financial results.\nRisks Related to Owning Our Common Stock\nOur quarterly results are likely to fluctuate, which may cause the value of our common stock to decline substantially.\nOur quarterly results are likely to fluctuate. Fluctuations have occurred due to known and unknown risks, such as the global economic impact of ongoing conflicts, including the war in Ukraine and the regional conflict in the Middle East, and uncertainty about the interest rate environment. In addition, our fiscal fourth quarter has historically been our strongest quarter for new business and renewals, and the year-over-year compounding effect of this seasonality in billing patterns and overall new business and renewal activity causes the value of invoices that we generate in the fourth quarter to continually increase in proportion to our billings in the other three quarters of our fiscal year. As a result, our fiscal first quarter has typically in the past been our largest collections and operating cash flow quarter.\nAdditionally, some of the important factors that may cause our revenues, operating results and cash flows to fluctuate from quarter to quarter include:\n•\ngeneral economic or geopolitical conditions, including the impacts of the war in Ukraine and the regional conflict in the Middle East; financial market conditions; uncertainty regarding the imposition of and changes in trade policies, including trade wars, tariffs or other trade restrictions or the threat of such actions; and increasing costs of operation;\n•\nour ability to retain and increase sales to existing customers, attract new customers and satisfy our customers’ requirements, including large enterprise customers;\n•\nthe attrition rates for our services;\n•\nthe size and productivity of our workforce, as well as the cost to recruit and train new employees;\n•\nthe length of the sales cycle for our services;\n•\nnew product and service introductions by our competitors;\n•\nchanges in unearned revenue and remaining performance obligation;\n•\nour ability to realize benefits from strategic partnerships, acquisitions or investments;\n•\nour ability to execute and realize benefits from restructuring actions and other workforce reductions, or any similar actions taken in the future;\n•\nvariations in the revenue mix of our services and growth rates of our subscription and support offerings;\n•\nthe seasonality of our sales cycle, as well as timing of contract execution and term software license sales;\n•\nthe lack of certainty regarding customer usage and associated costs for consumption-based product offerings;\n•\nchanges in and expenses associated with our pricing policies and terms of contracts;\n•\nthe seasonality of our customers’ businesses, especially our Commerce service offering customers; \n•\nfluctuations in foreign currency exchange rates;\n•\nthe amount and timing of operating costs and capital expenditures related to the operations and expansion of our business;\n•\nthe timing of commission, bonus and other compensation payments to employees; \n•\nthe cost, timing and management effort required for the introduction of new features to our services;\n•\nthe costs associated with acquiring and integrating new businesses and technologies;\n•\nexpenses related to our real estate or changes in the nature or extent of our use of existing real estate, including our office leases and our data center capacity and expansion;\n•\ntiming of additional investments in our enterprise cloud computing application and platform services and in our consulting services;\n•\nexpenses related to significant, unusual or discrete events, which are recorded in the period in which the events occur, including litigation or other dispute-related settlement payments;\n28\nTable of Contents\n•\nincome tax effects resulting from, but not limited to, tax law changes, court decisions on tax matters, global tax developments applicable to multinational corporations, changes in operations or business structures and acquisition activity;\n•\nthe timing of stock awards to employees and payroll and other withholding tax expenses;\n•\ntechnical difficulties or service interruptions;\n•\nchanges in interest rates and our mix of investments, which impact the return on our investments in cash and marketable securities;\n•\nchanges in the fair value of our strategic investments, including changes due to impairments, particularly in periods of significant market fluctuations; \n•\nequity or debt issuances, including as consideration in or in conjunction with acquisitions;\n•\nevolving regulations of cloud computing, AI and cross-border data transfer restrictions and similar regulations; and\n•\nregulatory compliance and acquisition costs.\nMany of these factors are outside of our control, and the occurrence of one or more of them might negatively and materially impact our operating results. If we fail to meet or exceed operating results expectations or if securities analysts and investors have estimates and forecasts of our future performance that are unrealistic or that we do not meet, the market price of our common stock could decline. In addition, if one or more of the securities analysts who cover us adversely change their recommendations regarding our stock, the market price of our common stock could decline.\nThe market price of our common stock is likely to be volatile and could subject us to litigation.\nThe trading prices of the securities of technology companies have historically been highly volatile. Accordingly, the market price of our common stock has been and is likely to continue to be subject to wide fluctuations. Factors affecting the market price of our common stock include:\n•\nvariations in our financial results and how those results compare to analyst expectations;\n•\nvariations in, and limitations of, the various financial and other metrics and modeling used by analysts in their research and reports about our business;\n•\nforward-looking guidance to industry and financial analysts related to future operating results, the accuracy of which may be impacted by various factors, many of which are beyond our control;\n•\nour ability to meet or exceed forward-looking guidance we have given or to meet or exceed the expectations of investors, analysts or others; our ability to give forward-looking guidance consistent with past practices;\n•\nchanges to previous guidance or long-range targets, in the estimates of our operating results or in recommendations by securities analysts that elect to follow our common stock;\n•\nannouncements or rumors of technological innovations, new services or service enhancements, strategic alliances, mergers or other strategic acquisitions or significant agreements by us or within our industry;\n•\nannouncements of customer additions and customer cancellations or delays in customer purchases;\n•\nthe coverage of our common stock by the financial media;\n•\nrecruitment or departure of key personnel;\n•\ndisruptions in our service due to computer hardware, software, network or data center problems;\n•\nthe economy as a whole, geopolitical conditions, including global trade and health concerns, market conditions in our industry and the industries of our customers, and financial institution instability;\n•\ntrading activity or positions by a limited number of stockholders who together beneficially own a significant portion of our outstanding common stock, as well as other institutional or activist investors;\n•\nour ability to execute on our Share Repurchase Program as planned, including whether we meet internal or external expectations around the timing or price of share repurchases, and any changes to the program;\n•\nissuance of equity, debt or other convertible securities; \n•\nany increase to or reduction, suspension or elimination of dividend payments;\n•\nthe inability to conclude that our internal controls over financial reporting are effective;\n•\nchanges to our credit ratings; and\n•\nissues impacting our reputation. \nIn addition, if the market for technology stocks or the greater securities market in general experience uneven investor confidence, the market price of our common stock has and could in the future decline for reasons unrelated to us, including as a reaction to events that affect other companies within, or outside, our industry. Some companies that have experienced volatility \n29\nTable of Contents\nin the trading price of their stock have been the subject of securities class action litigation, such as the securities litigation against Slack that was brought before our acquisition. Such litigation, whether against us or an acquired subsidiary, could result in substantial costs and a diversion of management’s attention and resources and any liability resulting from or the settlement of such litigation could result in material adverse impacts to our operating cash flows or results of operations for a given period.\nProvisions in our amended and restated certificate of incorporation and bylaws and Delaware law might discourage, delay or prevent a change of control of the Company or changes in our management and, therefore, depress the market price of our common stock.\nOur amended and restated certificate of incorporation and bylaws contain provisions that could depress the market price of our common stock by acting to discourage, delay or prevent a change in control of the Company or changes in our management that the stockholders of the Company may deem advantageous. These provisions among other things:\n•\npermit the Board to establish the number of directors;\n•\nauthorize the issuance of “blank check” preferred stock that our board could use to implement a stockholder rights plan (also known as a “poison pill”);\n•\nprohibit stockholder action by written consent, which requires all stockholder actions to be taken at a meeting of our stockholders;\n•\nprovide that the Board is expressly authorized to make, alter or repeal our bylaws; and\n•\nestablish advance notice requirements for nominations for election to our board or for proposing matters that can be acted upon by stockholders at annual stockholder meetings.\nIn addition, Section 203 of the Delaware General Corporation Law may discourage, delay or prevent a change in control of our company. Section 203 imposes certain restrictions on merger, business combinations and other transactions between us and holders of 15 percent or more of our common stock.\nThere can be no assurance that we will continue to declare cash dividends in any particular amounts, or at all.\nWhether we continue to pay cash dividends, as well as the rate at which we pay cash dividends, in the future is subject to continued capital availability, general economic and market conditions, applicable laws and agreements and our Board continuing to determine that the declaration of dividends is in the best interests of the Company and its stockholders. The declaration and payment of any dividend may be discontinued at any time and dividend amounts may be reduced at any time. A discontinuation of or reduction in our dividend payments could have a negative effect on our stock price.\nGeneral Risks\nVolatile and significantly weakened global economic conditions have in the past and may in the future adversely affect our industry, business and results of operations.\nOur overall performance depends in part on worldwide economic and geopolitical conditions. The United States and other key international economies have experienced significant economic and market downturns in the past, and are likely to experience additional cyclical downturns from time to time in which economic activity is impacted by falling demand for a variety of goods and services, restricted credit, poor liquidity, reduced corporate profitability, volatility in credit, equity and foreign exchange markets, inflation, bankruptcies and overall uncertainty with respect to the economy. These economic conditions can arise suddenly and the full impact of such conditions can be difficult to predict. In addition, geopolitical and domestic political developments, such as uncertainty regarding changes in trade policy and other events beyond our control, such as war in Ukraine and the regional conflict in the Middle East, have increased and may continue to increase levels of political and economic unpredictability globally and the volatility of global financial markets. Moreover, these conditions have affected and may continue to affect the rate of IT spending; could adversely affect our customers’ ability or willingness to attend our events or to purchase our enterprise cloud computing services; have delayed and may delay customer purchasing decisions; and have reduced and may in the future reduce the value and duration of customer subscription contracts or cause our customers to seek to modify their existing subscription contracts. All of these risks and conditions could materially adversely affect our future sales, attrition rates and operating results.\nGeopolitical crises, natural disasters and other events beyond our control have in the past and may in the future materially adversely affect us.\nGeopolitical crises, natural disasters or other catastrophic events have in the past and may in the future cause damage or disruption to our people, operations, international commerce and the global economy, and thus could have a strong negative effect on us. Our business operations, the business operations of third-party providers or suppliers that we rely on to conduct our business and the business operations of our customers are subject to interruption by geopolitical crises, natural disasters, fire, power or water shutoffs or shortages, telecommunications failures, terrorist attacks, acts of violence, political and/or civil unrest, acts of war or other military actions, actual or threatened public health emergencies and other events beyond our control. \n30\nTable of Contents\nFor example, the occurrence of regional conflicts, epidemics or a global pandemic have in the past and may in the future materially affect how we and our customers operate our businesses, as well as our operating results and cash flows. Although we maintain crisis management and disaster response plans, such events could make it difficult or impossible for us to deliver our services to our customers, and could decrease demand for our services. Our corporate headquarters, and a significant portion of our personnel, research and development activities and other critical business operations, are located near major seismic faults in the San Francisco Bay Area. Because we do not carry earthquake insurance for direct earthquake-related losses and significant recovery time could be required to resume operations, our financial condition and operating results could be materially and adversely affected in the event of a major earthquake or catastrophic event, and the adverse effects of any such catastrophic event would be exacerbated if experienced at the same time as another unexpected and adverse event. \nClimate change may have an impact on our business.\nWhile we seek to mitigate our business risks associated with climate change by establishing appropriate environmental programs and partnering with organizations who are also focused on mitigating their own climate-related risks, there are inherent climate-related risks where our business is conducted. Any of our primary locations may be vulnerable to the adverse effects of climate change. For example, our offices globally have historically experienced, and are projected to continue to experience, climate-related events at an increasing frequency, including drought, water scarcity, heat waves, cold waves, flooding, wildfires and resultant air quality impacts and power shutoffs associated with climate-related events. These events in turn have impacts on inflation risks, the cost and availability of insurance, food security, water security (including for water availability for data center cooling), energy security and on our employees’ health, productivity and well-being. Furthermore, it is more difficult to mitigate the impact of these events on our employees working remotely or at client sites. Changing market dynamics, global policy developments and the increasing frequency and impact of extreme weather events on critical infrastructure in the United States and elsewhere have the potential to disrupt our business, the business of companies we invest in, the business of third-party providers or suppliers that we rely on to conduct our business and the business of our customers, and may cause us to experience higher attrition, losses and additional costs to maintain or resume operations. In particular, climate-related events, energy market volatility, and power grid disruptions may increase the operational costs related to inputs across our value chain, including for data centers. Perceived associations with data centers’ growing energy demand or data center/AI-related changes to existing environmental pledges in certain jurisdictions may also result in increased targeting of our sites and operations by activists. Additionally, failure to uphold, meet or make timely forward progress against our public commitments and goals related to climate action could adversely impact the resilience of our business to the impacts of climate-related events.\n31\nTable of Contents",
    "item1b": "ITEM 1B.    UNRESOLVED STAFF COMMENTS\nNone.",
    "item1c": "ITEM 1C.    CYBERSECURITY\nAs a global leader in CRM technology, our services involve the storage and transmission of our customers’ and our customers’ customers’ data. As such, we have in the past been, and likely will in the future be, the target of cybersecurity threats and other efforts to breach or compromise our services and underlying infrastructure. With trust as our foremost value and the foundation of everything we do, we recognize the importance of maintaining the safety and security of our systems and data.\nManagement is responsible for the day-to-day administration of the Company’s cybersecurity policies, processes, practices and risk management. The Board, including through its dedicated Cybersecurity and Privacy committee (the “Committee”), oversees the various cybersecurity risks facing the Company and the Company’s efforts to mitigate those risks.\nDuring the last fiscal year, we did not identify any risks from cybersecurity threats, including as a result of any previous cybersecurity incidents, that materially affected the Company, including its business strategy, results of operations, or financial condition. However, we face ongoing and increasing cybersecurity risks, including from bad actors that are becoming more sophisticated and effective over time, as well as a result of potential defects or disruptions in our or our customers’ services. If realized, these risks are reasonably likely to materially affect the Company.\n Additional information on the cybersecurity risks we face is discussed in Part I, Items 1A-C, “Risk Factors.”\nCybersecurity Risk Management and Strategy\nWhen a company purchases our service offerings, they gain a trusted digital advisor who will work together with them in their efforts to protect their data. We aim to provide a secure and compliant enterprise cloud platform and we work to build trust and in-depth defense into all of our systems. Among other things, we employ an experienced team of cybersecurity professionals, engage in community events and offer free online cybersecurity incident prevention training to help enable our customers to focus on their business, knowing their data is safe and accessible as needed.\nWe seek to address material cybersecurity risks through a company-wide approach that assesses, ranks and prioritizes cybersecurity threats, vulnerabilities and issues as they are identified to maintain the confidentiality, integrity and availability of our information systems and the information that we collect and store. \nThe Company’s cybersecurity policies, standards, processes and practices are informed by recognized frameworks established by the National Institute of Standards and Technology, the International Organization for Standardization and an array of other applicable standards-setting bodies, which are integrated into a broader risk management framework and related processes.\n We also hold various security-related industry certifications and attestations that have been validated by external auditors, including SOC 1, SOC 2, SOC 3, ISO 27001, 27017 and 27018, CSA STAR and others.\nLeveraging threat intelligence and other signals, the Company undergoes periodic testing, audits and reviews of its policies, standards, processes and practices to identify, assess and address cybersecurity risks and events. The Company also undergoes routine internal and external penetration testing. The results of such tests and assessments are evaluated by management and periodically reported to the Committee. The Company further adjusts its cybersecurity policies, standards, processes and practices based on these results and evolving industry practices. The Company also publishes attestations of its various certifications, audits, and penetration tests on its global compliance webpage.\nBoard Oversight and Governance\nAs mentioned above, the \nBoard\n established the Committee to provide dedicated oversight of cybersecurity-related management, strategy, initiatives, risks, threats and remediation activities.\n \nThe Committee receives regular presentations, reports and updates from the Company’s \nChief Trust Officer (“CTrO”) and other members of management\n on developments regarding the Company’s cybersecurity program, broader cybersecurity trends, evolving industry standards, the threat environment and other topics. After each quarterly meeting of the Committee, the Board receives a report from the Chair of the Committee with an update on the Company’s oversight of cybersecurity risks and mitigation efforts. The Committee also receives periodic reports from an experienced outside consultant with information security expertise providing insights on key focus areas to aid in the Committee’s oversight of the Company’s cybersecurity program.\nThe Company’s processes also allow for the Board and the Committee to be informed of key cybersecurity risks outside the regular reporting schedule. While regular meetings of the Committee are scheduled on a quarterly cadence, the Committee is authorized to meet with management or individual directors at any time it deems appropriate to discuss matters relevant to the Committee. In between meetings, the Board and the Committee receive information regarding relevant cybersecurity risks \n32\nTable of Contents\n(including cybersecurity incidents) that meet pre-established reporting thresholds, as well as ongoing updates regarding any such risks.\nManagement Oversight and Governance\nThe CTrO, reporting to the Company’s Chief Engineering & Customer Success Officer (“C/E”), is responsible for designing and implementing a security program and strategy based on the mandate provided by the Board and senior management.\n \nThe CTrO has extensive experience in the management of cybersecurity risk programs, having served in various leadership roles in information technology and information security for over 15 years, including serving as the Chief Security Officer of two other large public technology companies. He also holds an undergraduate and master’s degree in computer science. We believe the Company’s business leaders, including our CEO, CFO, C/E and CLO, who have experience managing cybersecurity risk at the Company and at similar companies, have the appropriate expertise, background and depth of experience to manage risks arising from cybersecurity threats.\nThe CTrO, in coordination with other members of senior management, works collaboratively across the Company to implement a program designed to help protect the Company’s information systems from cybersecurity threats and to promptly respond to cybersecurity incidents in accordance with the Company’s incident response and recovery plans. To facilitate the success of the Company’s cybersecurity program, cross-functional teams throughout the Company are tasked with addressing cybersecurity threats and responding to cybersecurity incidents. Through ongoing communications with these teams, the CTrO and senior management are able to be informed promptly about, and monitor the prevention, detection, investigation, mitigation and remediation of, cybersecurity threats. These teams are expected to operate pursuant to documented plans and playbooks that include processes for escalation of incidents to leadership and to the Committee and Board, as appropriate, based on the severity level of a cybersecurity incident. In addition, the Company periodically consults with outside advisors and experts to assist with assessing, identifying and managing cybersecurity risks, including to anticipate future threats and trends, and their impact on the Company’s risk management environment.\nSpecifically, management implements the Company’s cybersecurity and risk management strategy across several areas: \n \n•\nIdentification and Reporting\n. The Company has implemented a robust, cross-functional approach to identifying, assessing and managing cybersecurity threats and risks. The Company’s program includes controls and procedures designed to properly identify, classify, and escalate cybersecurity risks and incidents to provide management with visibility and prioritization of risk mitigation efforts and to publicly report material cybersecurity incidents when appropriate. \n•\nThreat Intelligence\n. The Company maintains a Threat Intelligence team focused on profiling, intelligence collection, and threat analysis supporting the Company’s ongoing efforts to identify, assess and manage cybersecurity threats. The team’s input supports both near-term response to cybersecurity events, and long-term strategic planning and development of the Company’s cybersecurity risk management framework. \n•\nTechnical Safeguards\n. The Company implements technical safeguards that are designed to protect both the Company’s service offerings and other information systems we control from cybersecurity threats, including firewalls, intrusion prevention and detection systems, anti-malware functionality, vulnerability management, encryption processes and access controls, all of which are periodically evaluated and improved through risk and control assessments and in response to cybersecurity threat intelligence as well as outside audits and certifications. \n•\nIncident Response and Recovery Planning\n. The Company has established and maintains incident response, business continuity and disaster recovery plans designed to address the Company’s response to a cybersecurity incident, including the public disclosure and reporting of material incidents in a timely manner. These plans and procedures serve to guide and document a rigorous incident response program that reflects the roles of an array of stakeholders, including personnel providing technical, operational, engineering, legal and other perspectives across the Company. The Company conducts regular tabletop exercises involving multiple operational teams, including senior management, to test these plans and to familiarize personnel with their roles in a response scenario.  \n•\nThird-Party Risk Management\n. The Company maintains a risk-based approach to identifying and \noverseeing cybersecurity threats presented by certain third parties\n, including vendors, service providers and other external users of the Company’s systems, as well as the systems of third parties that could adversely impact our business in the event of a significant cybersecurity incident affecting those third-party systems. \n•\nEducation and Awareness\n. The Company regularly provides employee training on security-related duties and responsibilities, including knowledge about how to recognize cybersecurity incidents and how to proceed if an actual or suspected incident should occur. This training is mandatory for employees across the Company, and is intended to provide the Company’s employees with effective tools to address cybersecurity threats, and to communicate the Company’s evolving information security policies, standards, processes and practices. The Company maintains several \n33\nTable of Contents\nplans designed to prepare the Salesforce Security Response Center (SSRC) with the proper training, processes and capabilities needed to effectively respond to incidents."
  }
}