{
  "ticker": "CSCO",
  "cik": "0000858877",
  "company_name": "CISCO SYSTEMS, INC.",
  "filing_date": "2025-09-03",
  "accession": "0000858877-25-000111",
  "primary_doc": "csco-20250726.htm",
  "item_sections": {
    "item1": "Item 1. Business.”\nOther Key Financial Measures\nThe following is a summary of our other key financial measures for fiscal 2025 compared with fiscal 2024 (in millions): \nFiscal 2025\nFiscal 2024\nCash and cash equivalents and investments\n$16,110\n$17,854\nCash provided by operating activities\n$14,193\n$10,880\nRemaining performance obligations\n$43,533\n$41,048\nRepurchases of common stock—stock repurchase program\n$5,995\n$5,764\nDividends paid\n$6,437\n$6,384\nInventories\n$3,164\n$3,373\nTotal debt\n$28,093\n$30,962\n32\nTable of Contents\nCISCO SYSTEMS, INC.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (Continued)\nCRITICAL ACCOUNTING ESTIMATES\nThe preparation of financial statements and related disclosures in conformity with accounting principles generally accepted in the United States requires us to make judgments, assumptions, and estimates that affect the amounts reported in the Consolidated Financial Statements and accompanying notes. Note 2 to the Consolidated Financial Statements describes the significant accounting policies and methods used in the preparation of the Consolidated Financial Statements. The accounting policies described below are significantly affected by critical accounting estimates. Such accounting policies require significant judgments, assumptions, and estimates used in the preparation of the Consolidated Financial Statements, and actual results could differ materially from the amounts reported based on these policies.\nRevenue Recognition \nWe enter into contracts with customers that can include various combinations of products and services which are generally distinct and accounted for as separate performance obligations, resulting in contracts that may contain multiple performance obligations. We determine whether arrangements are distinct based on whether the customer can benefit from the product or service on its own or together with other resources that are readily available and whether our commitment to transfer the product or service to the customer is separately identifiable from other obligations in the contract. We classify our hardware, perpetual software licenses, and SaaS as distinct performance obligations. Term software licenses represent multiple obligations, which include software licenses and software maintenance. In transactions where we deliver hardware or software, we are typically the principal and we record revenue and costs of goods sold on a gross basis.\nWe recognize revenue upon transfer of control of promised goods or services in a contract with a customer in an amount that reflects the consideration we expect to receive in exchange for those products or services. Transfer of control occurs once the customer has the contractual right to use the product, generally upon shipment, electronic delivery (or when the software is available for download by the customer), or once title and risk of loss has transferred to the customer. Transfer of control can also occur over time for software maintenance and services as the customer receives the benefit over the contract term. Our hardware and perpetual software licenses are distinct performance obligations where revenue is recognized upfront upon transfer of control. Term software licenses include multiple performance obligations where the term licenses are recognized upfront upon transfer of control, with the associated software maintenance revenue recognized ratably over the contract term as services and software updates are provided. SaaS arrangements do not include the right for the customer to take possession of the software during the term, and therefore have one distinct performance obligation which is satisfied over time with revenue recognized ratably over the contract term as the customer consumes the services. On our product sales, we record consideration from shipping and handling on a gross basis within net product sales. We record our revenue net of any associated sales taxes.\nRevenue is allocated among these performance obligations in a manner that reflects the consideration that we expect to be entitled to for the promised goods or services based on standalone selling prices (SSP). SSP is estimated for each distinct performance obligation and judgment may be required in their determination. The best evidence of SSP is the observable price of a product or service when we sell the goods separately in similar circumstances and to similar customers. In instances where SSP is not directly observable, we determine SSP using information that may include market conditions and other observable inputs. \nWe assess relevant contractual terms in our customer contracts to determine the transaction price. We apply judgment in identifying contractual terms and determining the transaction price as we may be required to estimate variable consideration when determining the amount of revenue to recognize. Variable consideration includes potential contractual penalties and various rebate, cooperative marketing and other incentive programs that we offer to our distributors, channel partners and customers that we sell to directly. When determining the amount of revenue to recognize, we estimate the expected usage of these programs, applying the expected value or most likely estimate and update the estimate at each reporting period as actual utilization becomes available. We also consider the customers’ right of return in determining the transaction price, where applicable. If actual credits received by customers under these programs were to deviate significantly from our estimates, which are based on historical experience, our revenue could be adversely affected.\nSee Note 3 to the Consolidated Financial Statements for more details. \nInventory Valuation and Liability for Purchase Commitments with Contract Manufacturers and Suppliers\nInventory is written down based on excess and obsolete inventories, determined primarily by future demand forecasts. Inventory write-downs are measured as the difference between the cost of the inventory and net realizable value, based upon assumptions about future demand, and are charged to the provision for inventory. At the point of the loss recognition, a new, lower cost basis for that inventory is established, and subsequent changes in facts and circumstances do not result in the restoration or increase in that newly established cost basis.\n33\nTable of Contents\nCISCO SYSTEMS, INC.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (Continued)\nWe record a provision for firm, noncancelable, and unconditional purchase commitments with contract manufacturers and suppliers for quantities in excess of our future demand forecasts consistent with the valuation of our excess and obsolete inventory.  Both provisions are a component of cost of sales.\nOur total provisions for inventory and the liability related to purchase commitments with contract manufacturers and suppliers were $493 million, $819 million, and $730 million\n \nin fiscal 2025, 2024, and 2023, respectively. If there were to be a sudden and significant decrease in demand for our products, or a higher incidence of inventory obsolescence because of rapidly changing technology or customer requirements, then we could be required to increase our inventory write-downs and our liability for purchase commitments with contract manufacturers and suppliers, and accordingly our profitability, could be adversely affected. We regularly evaluate our exposure for inventory write-downs, and the adequacy of our liability for purchase commitments. For further discussion around the supply chain impacts and risks, see “—Results of Operations—Gross Margin—Supply Chain Impacts and Risks” and “—Liquidity and Capital Resources—Inventory Supply Chain” under Item 7 of this report.\nLoss Contingencies\nWe are subject to the possibility of various losses arising in the ordinary course of business. We consider the likelihood of the incurrence of a liability, as well as our ability to reasonably estimate the amount of loss, in determining loss contingencies. An estimated loss contingency is accrued when it is probable that a liability has been incurred and the amount of loss can be reasonably estimated. We regularly evaluate information available to us to determine whether such accruals should be made or adjusted and whether new accruals are required. \nThird parties, including customers, have in the past and may in the future assert claims or initiate litigation related to exclusive patent, copyright, trademark, and other intellectual property rights to technologies and related standards that are relevant to us. These assertions have increased over time as a result of our growth and the general increase in the pace of patent claims assertions, particularly in the United States. If any infringement or other intellectual property claim made against us by any third party is successful, or if we fail to develop non-infringing technology or license the proprietary rights on commercially reasonable terms and conditions, our business, operating results, and financial condition could be materially and adversely affected.\nValuation of Goodwill and Purchased Intangible Assets \nGoodwill\nOur methodology for allocating the purchase price relating to purchase acquisitions is determined through established valuation techniques. Goodwill represents a residual value as of the acquisition date, which in most cases results in measuring goodwill as an excess of the purchase consideration transferred plus the fair value of any noncontrolling interest in the acquired company over the fair value of net assets acquired, including contingent consideration. We perform goodwill impairment tests on an annual basis in the fourth fiscal quarter and between annual tests in certain circumstances for each reporting unit. The assessment of fair value for goodwill and purchased intangible assets is based on factors that market participants would use in an orderly transaction in accordance with the guidance for the fair value measurement of nonfinancial assets.\nIn response to changes in industry and market conditions, we could be required to strategically realign our resources and consider restructuring, disposing of, or otherwise exiting businesses, which could result in an impairment of goodwill. There was no impairment of goodwill in fiscal 2025, 2024, and 2023. For the annual impairment testing in fiscal 2025, the excess of the fair value over the carrying value for each of our reporting units was $56.5 billion for the Americas, $80.1 billion for EMEA, and $32.9 billion for APJC. \nDuring the fourth quarter of fiscal 2025, we performed a sensitivity analysis for goodwill impairment with respect to each of our respective reporting units and determined that a hypothetical 10% decline in the fair value of each reporting unit would not result in an impairment of goodwill for any reporting unit. \nPurchased Intangible Assets\nThe accounting for acquisitions requires significant estimates and judgments in the valuation of purchased intangible assets. Critical estimates used in the valuation of purchased intangible assets include, but are not limited to, the amount and timing of expected future cash flows, useful lives and discount rates. While our estimates of fair value are based on assumptions that are believed to be reasonable, these assumptions are inherently uncertain and unpredictable and would not reflect unanticipated events and circumstances that may occur.\nWe make judgments about the recoverability of purchased intangible assets with finite lives whenever events or changes in circumstances indicate that an impairment may exist. Recoverability of purchased intangible assets with finite lives is measured \n34\nTable of Contents\nCISCO SYSTEMS, INC.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (Continued)\nby comparing the carrying amount of the asset group to the future undiscounted cash flows the asset group is expected to generate. We review indefinite-lived intangible assets for impairment annually or whenever events or changes in circumstances indicate that the asset might be impaired. If the asset is considered impaired, the amount of any impairment is measured as the difference between the carrying value and the fair value of the impaired asset. Assumptions and estimates about future values and remaining useful lives of our purchased intangible assets are complex and subjective. They can be affected by a variety of factors, including external factors such as industry and economic trends, and internal factors such as changes in our business strategy and our internal forecasts. Our ongoing consideration of all the factors described previously could result in impairment charges in the future, which could adversely affect our net income. \nIncome Taxes\nWe are subject to income taxes in the United States and numerous foreign jurisdictions. Our effective tax rates differ from the statutory rate, primarily due to the tax impact of state taxes, foreign operations, R&D tax credits, foreign-derived intangible income deductions, global intangible low-taxed income, tax audit settlements, nondeductible compensation, and international realignments. Our effective tax rate was 8.3%, 15.6%, and 17.7% in fiscal 2025, 2024, and 2023, respectively.\nSignificant judgment is required in evaluating our uncertain tax positions and determining our provision for income taxes. Although we believe our reserves are reasonable, no assurance can be given that the final tax outcome of these matters will not be different from that which is reflected in our historical income tax provisions and accruals. We adjust these reserves due to changing facts and circumstances, such as the closing of a tax audit or the refinement of an estimate. To the extent that the final tax outcome of these matters is different than the amounts recorded, such differences will impact the provision for income taxes in the period in which such determination is made. The provision for income taxes includes the impact of reserve provisions and changes to reserves that are considered appropriate, and the related net interest and penalties.\nSignificant judgment is also required in determining any valuation allowance recorded against deferred tax assets. In assessing the need for a valuation allowance, we consider all available evidence, including past operating results, estimates of future taxable income, and the feasibility of tax planning strategies. If we change our determination as to the amount of deferred tax assets that can be realized, we will adjust our valuation allowance with a corresponding impact to the provision for income taxes in the period in which such determination is made.\nOur provision for income taxes is subject to volatility and could be adversely impacted by earnings being lower than anticipated in countries that have lower tax rates and higher than anticipated in countries that have higher tax rates; by changes in the valuation of our deferred tax assets and liabilities; by changes to foreign-derived intangible income deduction, global intangible low-tax income and base erosion and anti-abuse tax, research and development capitalization and amortization, and corporate alternative minimum tax laws, regulations, or interpretations thereof; by expiration of or lapses in tax incentives; by transfer pricing adjustments, including the effect of acquisitions on our legal structure; by tax effects of nondeductible compensation; by tax costs related to intercompany realignments; by changes in accounting principles; or by changes in tax laws and regulations, treaties, or interpretations thereof, including changes to the taxation of earnings of our foreign subsidiaries, the deductibility of expenses attributable to foreign income, and the foreign tax credit rules. Significant judgment is required to determine the recognition and measurement attributes prescribed in the accounting guidance for uncertainty in income taxes. The OECD, an international association comprised of 38 countries, including the United States, has made changes, including a Pillar Two framework that imposes a minimum tax rate of 15% in each taxing jurisdiction, and is contemplating additional changes to numerous long-standing tax principles. There can be no assurance that these changes and any contemplated changes if finalized, once adopted by countries, will not have an adverse impact on our provision for income taxes. As a result of certain of our ongoing employment and capital investment actions and commitments, our income in certain countries was subject to reduced tax rates. Our failure to meet these commitments could adversely impact our provision for income taxes. In addition, we are subject to the continuous examination of our income tax returns by the IRS and other tax authorities. We regularly assess the likelihood of adverse outcomes resulting from these examinations to determine the adequacy of our provision for income taxes. There can be no assurance that the outcomes from these continuous examinations will not have an adverse impact on our operating results and financial condition. \n35\nTable of Contents\nCISCO SYSTEMS, INC.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (Continued)\nRESULTS OF OPERATIONS\nSubsequent to the issuance of our earnings release on August 13, 2025, we settled a legal dispute with a supplier, resulting in a GAAP charge to product cost of sales, which is described in Note 21 to the Consolidated Financial Statements. The information in this Annual Report on Form 10-K supersedes the information contained in our earnings release.\nA discussion regarding our financial condition and results of operations for fiscal 2025 compared to fiscal 2024 is presented below. A discussion regarding our financial condition and results of operations for fiscal 2024 compared to fiscal 2023 can be found under Item 7 in our Annual Report on Form 10-K for the fiscal year ended July 27, 2024, filed with the SEC on September 5, 2024. \nRevenue\nThe following table presents the breakdown of revenue between product and services (in millions, except percentages):\nYears Ended\n2025 vs. 2024\nJuly 26, 2025\nJuly 27, 2024\nJuly 29, 2023\nVariance in Dollars\nVariance in Percent\nRevenue:\nProduct\n$\n41,608\n \n$\n39,253 \n$\n43,142 \n$\n2,355 \n6 \n%\nPercentage of revenue\n73.4\n \n%\n73.0 \n%\n75.7 \n%\n \n \nServices\n15,046\n \n14,550 \n13,856 \n496 \n3 \n%\nPercentage of revenue\n26.6\n \n%\n27.0 \n%\n24.3 \n%\n \n \nTotal\n$\n56,654\n \n$\n53,803 \n$\n56,998 \n$\n2,851 \n5 \n%\nAmounts may not sum and percentages may not recalculate due to rounding.\nWe manage our business primarily on a geographic basis, organized into three geographic segments. Our revenue, which includes product and services for each segment, is summarized in the following table (in millions, except percentages):\nYears Ended\n2025 vs. 2024\nJuly 26, 2025\nJuly 27, 2024\nJuly 29, 2023\nVariance in Dollars\nVariance in Percent\nRevenue:\n \n \n \n \nAmericas\n$\n33,656\n \n$\n31,971 \n$\n33,447 \n$\n1,685 \n5 \n%\nPercentage of revenue\n59.4\n \n%\n59.4 \n%\n58.7 \n%\n \n \nEMEA\n14,824\n \n14,117 \n15,135 \n707 \n5 \n%\nPercentage of revenue\n26.2\n \n%\n26.2 \n%\n26.6 \n%\n \n \nAPJC\n8,174\n \n7,716 \n8,417 \n458 \n6 \n%\nPercentage of revenue\n14.4\n \n%\n14.3 \n%\n14.8 \n%\n \n \nTotal\n$\n56,654\n \n$\n53,803 \n$\n56,998 \n$\n2,851 \n5 \n%\nAmounts may not sum and percentages may not recalculate due to rounding. \nTotal revenue in fiscal 2025 increased by 5% compared with fiscal 2024. Product revenue increased by 6% and services revenue increased by 3%. Our total revenue reflected growth across each of our geographic segments.\nIn addition to the impact of macroeconomic factors, including the IT spending environment and the level of spending by government entities, revenue by segment in a particular period may be significantly impacted by the timing of revenue recognition for complex transactions with multiple performance obligations. In addition, certain customers tend to make large and sporadic purchases, and the revenue related to these transactions may also be affected by the timing of revenue recognition, which in turn would impact the revenue of the relevant segment.\n36\nTable of Contents\nCISCO SYSTEMS, INC.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (Continued)\nProduct Revenue by Segment\nThe following table presents the breakdown of product revenue by segment (in millions, except percentages):\nYears Ended\n2025 vs. 2024\nJuly 26, 2025\nJuly 27, 2024\nJuly 29, 2023\nVariance in Dollars\nVariance in Percent\nProduct revenue:\n \n \n \n \n \nAmericas\n$\n24,637\n \n$\n23,142 \n$\n25,019 \n$\n1,495 \n6 \n%\nPercentage of product revenue\n59.2\n \n%\n59.0 \n%\n58.0 \n%\n \n \nEMEA\n11,122\n \n10,645 \n11,866 \n477 \n4 \n%\nPercentage of product revenue\n26.7\n \n%\n27.1 \n%\n27.5 \n%\n \n \nAPJC\n5,849\n \n5,466 \n6,257 \n383 \n7 \n%\nPercentage of product revenue\n14.1\n \n%\n13.9 \n%\n14.5 \n%\n \n \nTotal\n$\n41,608\n \n$\n39,253 \n$\n43,142 \n$\n2,355 \n6 \n%\nAmounts may not sum and percentages may not recalculate due to rounding. \nAmericas\nProduct revenue in the Americas segment increased by 6%, with growth in the enterprise market and the service provider and cloud market. The growth in the service provider and cloud market was driven by AI infrastructure revenue from webscale customers. These increases were partially offset by a decline in the public sector market. From a country perspective, product revenue increased in the United States, Canada, and Brazil by 7%, 4%, and 8%, respectively.\nEMEA\nProduct revenue in the EMEA segment increased by 4%, driven by growth in the public sector and enterprise markets, partially offset by a slight decline in the service provider and cloud market. From a country perspective, product revenue increased in the United Kingdom, Germany, and France by 9%, 4%, and 6%, respectively.\nAPJC\nProduct revenue in the APJC segment increased by 7%,\n \nwith growth across each of our customer markets. From a country perspective, product revenue increased in Japan, Australia, India, and China by 7%, 11%, 11%, and 10% respectively\n.\n37\nTable of Contents\nCISCO SYSTEMS, INC.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (Continued)\nProduct Revenue by Category\nIn addition to the primary view on a geographic basis, we also prepare financial information related to product categories and customer markets for various purposes.\nThe following table presents product revenue by category (in millions, except percentages):\nYears Ended\n2025 vs. 2024\nJuly 26, 2025\nJuly 27, 2024\nJuly 29, 2023\nVariance in Dollars\nVariance in Percent\nProduct revenue:\n \n \n \n \n \nNetworking\n$\n28,304\n \n$\n29,229 \n$\n34,570 \n$\n(925)\n(3)\n%\nSecurity\n8,094\n \n5,075 \n3,859 \n3,019 \n59 \n%\nCollaboration\n4,154\n \n4,113 \n4,052 \n41 \n1 \n%\nObservability\n1,055\n \n837 \n661 \n218 \n26 \n%\nTotal\n$\n41,608\n \n$\n39,253 \n$\n43,142 \n$\n2,355 \n6 \n%\nAmounts may not sum and percentages may not recalculate due to rounding.\nNetworking\nThe Networking product category consists of our core networking technologies of switching, routing, wireless, and servers. Revenue from the Networking product category decreased by 3%, or $0.9 billion. Revenue declined across the portfolio as a result of product shipments returning to normalized levels during the first half of fiscal 2025 from the elevated levels of product shipments we experienced in the first half of fiscal 2024. Within the portfolio, the revenue decline was primarily driven by servers. We also experienced a revenue decline in switching as a result of a decline in campus switching.\nSecurity\nThe Security product category consists of our Network Security, Identity and Access Management, SASE and Threat Intelligence, Detection, and Response offerings. Revenue in our Security product category increased by 59%, or $3.0 billion,\n \nprimarily driven by Threat Intelligence, Detection, and Response offerings, which includes the offerings from Splunk, and to a lesser extent, growth in our SASE and Network Security offerings. \nCollaboration\nThe Collaboration product category consists of our Webex Suite, Collaboration Devices, Contact Center and CPaaS offerings. Revenue in our Collaboration product category increased 1%, or $41 million, primarily driven by revenue growth in our Collaboration Devices, CPaaS and Contact Center offerings, partially offset by a decline in our Webex Suite offerings.\nObservability\nThe Observability product category consists of our network assurance, monitoring and analytics and observability suite offerings. Revenue in our Observability product category\n \nincreased by 26%, or $218 million,\n \nprimarily\n \ndriven by our Observability Suite offerings from Splunk and growth in our ThousandEyes network services offerings, partially offset by a decline in monitoring and analytics.\n38\nTable of Contents\nCISCO SYSTEMS, INC.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (Continued)\nServices Revenue by Segment\nThe following table presents the breakdown of services revenue by segment (in millions, except percentages):\nYears Ended\n2025 vs. 2024\nJuly 26, 2025\nJuly 27, 2024\nJuly 29, 2023\nVariance in Dollars\nVariance in Percent\nServices revenue:\n \n \n \n \n \nAmericas\n$\n9,019\n \n$\n8,829 \n$\n8,427 \n$\n190 \n2 \n%\nPercentage of service revenue\n59.9\n \n%\n60.7 \n%\n60.8 \n%\nEMEA\n3,702\n \n3,472 \n3,269 \n230 \n7 \n%\nPercentage of service revenue\n24.6\n \n%\n23.9 \n%\n23.6 \n%\nAPJC\n2,325\n \n2,249 \n2,160 \n76 \n3 \n%\nPercentage of service revenue\n15.5\n \n%\n15.5 \n%\n15.6 \n%\nTotal\n$\n15,046\n \n$\n14,550 \n$\n13,856 \n$\n496 \n3 \n%\nAmounts may not sum and percentages may not recalculate due to rounding.  \nServices revenue increased 3%, primarily driven by software, cloud and virtualization support from Splunk and product offering support services.\n \nServices revenue increased across each of our geographic segments.\nGross Margin\nThe following table presents the gross margin for products and services (in millions, except percentages):\nAMOUNT\nPERCENTAGE\nYears Ended\nJuly 26, 2025\nJuly 27, 2024\nJuly 29, 2023\nJuly 26, 2025\nJuly 27, 2024\nJuly 29, 2023\nGross margin:\nProduct\n$\n26,487\n \n$\n24,914 \n$\n26,552 \n63.7\n \n%\n63.5 \n%\n61.5 \n%\nServices\n10,303\n \n9,914 \n9,201 \n68.5\n \n%\n68.1 \n%\n66.4 \n%\nTotal\n$\n36,790\n \n$\n34,828 \n$\n35,753 \n64.9\n \n%\n64.7 \n%\n62.7 \n%\nProduct Gross Margin\nThe following table summarizes the key factors that contributed to the change in product gross margin percentage from fiscal 2024 to fiscal 2025:\nProduct Gross Margin Percentage\nFiscal 2024\n63.5 \n%\nProductivity \n(1)\n2.0 \n%\nProduct pricing\n(1.6)\n%\nMix of products sold\n1.1 \n%\nLegal dispute with supplier\n(0.8)\n%\nAmortization of purchased intangible assets\n(0.4)\n%\nOthers\n(0.1)\n%\nFiscal 2025\n63.7 \n%\n (1)\n \nProductivity includes overall manufacturing-related costs, such as component costs, warranty expense, provisions for inventory and the liability related to purchase commitments with contract manufacturers and suppliers, freight, logistics, shipment volume, and other items not categorized elsewhere.\nProduct gross margin increased by 0.2 percentage points primarily driven by benefits from Splunk and productivity improvements, partially offset by negative impacts from pricing, a charge as a result of a legal dispute with a supplier, and amortization of purchased intangible assets primarily related to Splunk. The productivity improvements were primarily driven \n39\nTable of Contents\nCISCO SYSTEMS, INC.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (Continued)\nby the effects of higher shipment volume and lower total provisions for inventory and the liability related to purchase commitments with contract manufacturers and suppliers.\nSupply Chain Impacts and Risks \nIn past periods, we took multiple actions in order to mitigate component shortages and address significant supply constraints, which resulted in the need to secure long-term supply and increased our inventory supply chain balances compared to historical levels. In fiscal 2025, we entered into additional purchase commitments with contract manufacturers and suppliers related to manufacturing Cisco Silicon One and other products to meet demand from webscale and other customers. We expect to continue entering into these additional purchase commitments in fiscal 2026. These actions and additional purchase commitments have in turn significantly increased our supply chain exposure, which has resulted in negative impacts to our product gross margin in recent periods and may result in further negative impacts in future periods. In addition, on August 26, 2025, we settled a legal dispute with a supplier relating to purchase obligations arising under long-term supply arrangements, which resulted in a charge to product cost of sales, which is described in Note 21 to the Consolidated Financial Statements. The remaining and new supply chain exposures include potential material excess and obsolete or other charges if product demand significantly decreases for a sustained duration, we are unable to generate demand for certain products planned for development, or we are otherwise unable to mitigate these supply chain exposures. Additionally, while we are exposed to new and proposed tariffs and other trade policies, the extent of such exposure is uncertain but could be significant if the exposure remains and we are unable to mitigate it.\nServices Gross Margin\nOur services gross margin percentage increased by 0.4 percentage points primarily due to higher sales volume and lower delivery costs, partially offset by higher headcount-related costs.\nOur services gross margin normally experiences some fluctuations due to various factors such as the timing of contract initiations in our renewals, our strategic investments in headcount, and the resources we deploy to support the overall service business. Other factors include the mix of service offerings, as the gross margin from our advanced services is typically lower than the gross margin from technical support services.\nGross Margin by Segment\nThe following table presents the total gross margin for each segment (in millions, except percentages):\nAMOUNT\nPERCENTAGE\nYears Ended\nJuly 26, 2025\nJuly 27, 2024\nJuly 29, 2023\nJuly 26, 2025\nJuly 27, 2024\nJuly 29, 2023\nGross margin:\nAmericas\n$\n22,962\n \n$\n21,372 \n$\n21,350 \n68.2\n \n%\n66.8 \n%\n63.8 \n%\nEMEA\n10,545\n \n9,755 \n10,016 \n71.1\n \n%\n69.1 \n%\n66.2 \n%\nAPJC\n5,431\n \n5,187 \n5,424 \n66.4\n \n%\n67.2 \n%\n64.4 \n%\nSegment total\n38,938\n \n36,312 \n36,788 \n68.7\n \n%\n67.5 \n%\n64.5 \n%\nUnallocated corporate items \n(1)\n(2,148)\n(1,484)\n(1,035)\nTotal\n$\n36,790\n \n$\n34,828 \n$\n35,753 \n64.9\n \n%\n64.7 \n%\n62.7 \n%\n \n(1) \nThe unallocated corporate items\n \ninclude the effects of amortization and impairments of acquisition-related intangible assets, share-based compensation expense, significant litigation settlements (which includes the supplier-related legal settlement as described in Note 21 to the Consolidated Financial Statements) and other contingencies, charges related to asset impairments and restructurings, and certain other charges. We do not allocate these items to the gross margin for each segment because management does not include such information in measuring the performance of the operating segments. \nAmounts may not sum and percentages may not recalculate due to rounding. \nThe Americas segment had a gross margin percentage increase driven by positive impacts from productivity improvements and favorable product mix, partially offset by pricing erosion. \nThe gross margin percentage increase in our EMEA segment was primarily due to positive impacts from productivity improvements and favorable product mix, partially offset by pricing erosion.\nThe APJC segment had a\n \ngross margin percentage decrease driven primarily by pricing erosion and lower services gross margin, partially offset by positive impacts from productivity improvements and favorable product mix.\n40\nTable of Contents\nCISCO SYSTEMS, INC.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (Continued)\nResearch and Development (“R&D”), Sales and Marketing, and General and Administrative (“G&A”) Expenses\nR&D, sales and marketing, and G&A expenses are summarized in the following table (in millions, except percentages):\nYears Ended\n2025 vs. 2024\nJuly 26, 2025\nJuly 27, 2024\nJuly 29, 2023\nVariance in Dollars\nVariance in Percent\nResearch and development\n$\n9,300\n \n$\n7,983 \n$\n7,551 \n$\n1,317 \n16 \n%\nPercentage of revenue\n16.4\n \n%\n14.8 \n%\n13.2 \n%\nSales and marketing\n10,966\n \n10,364 \n9,880 \n602 \n6 \n%\nPercentage of revenue\n19.4\n \n%\n19.3 \n%\n17.3 \n%\nGeneral and administrative\n2,992\n \n2,813 \n2,478 \n179 \n6 \n%\nPercentage of revenue\n5.3\n \n%\n5.2 \n%\n4.3 \n%\nTotal\n$\n23,258\n \n$\n21,160 \n$\n19,909 \n$\n2,098 \n10 \n%\nPercentage of revenue\n41.1\n \n%\n39.3\n \n%\n34.9\n \n%\nR&D Expenses\nR&D expenses increased primarily due to higher headcount-related expenses reflecting our investments in AI, share-based compensation expense, cash compensation expenses from acquisitions, and discretionary spending.\nSales and Marketing Expenses\nSales and marketing expenses increased primarily due to higher headcount-related expenses, cash compensation expenses from acquisitions, share-based compensation expense, and discretionary spending, partially offset by lower contracted services spending.\nG&A Expenses\nG&A expenses increased primarily due to higher headcount-related expenses, share-based compensation expense, and  discretionary spending, partially offset by lower acquisition-related costs and lower contracted services spending.\nEffect of Foreign Currency\nIn fiscal 2025, foreign currency fluctuations, net of hedging, decreased the combined R&D, sales and marketing, and G&A expenses by approximately $16 million, or 0.1%,\n \ncompared with fiscal 2024.\nAmortization of Purchased Intangible Assets\nThe following table presents the amortization of purchased intangible assets including impairment charges (in millions):\nYears Ended\nJuly 26, 2025\nJuly 27, 2024\nJuly 29, 2023\nAmortization of purchased intangible assets:\nCost of sales\n$\n1,174\n \n$\n955 \n$\n649 \nOperating expenses\n1,028\n \n698 \n282 \nTotal\n$\n2,202\n \n$\n1,653 \n$\n931 \nThe increase in amortization of purchased intangible assets was primarily due to the acquisition of Splunk and other recent acquisitions, partially offset by certain purchased intangible assets that became fully amortized in larger part from our fiscal 2021 acquisition of Acacia, and lower impairment charges in fiscal 2025. Impairment charges related to purchased intangible assets were $40 million and $145 million for fiscal 2025 and fiscal 2024, respectively. The impairment charges were a result of declines in estimated fair values resulting from the reductions in or the elimination of expected future cash flows associated with certain in-process research and development and technology intangible assets.\nRestructuring and Other Charges\nWe recognized total restructuring and other charges, which are included in operating expenses, of $744 million and $789 million in fiscal 2025 and 2024, respectively.\n41\nTable of Contents\nCISCO SYSTEMS, INC.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (Continued)\nIn the first quarter of fiscal 2025, we announced a restructuring plan in order to allow us to invest in key growth opportunities and drive more efficiencies in our business. This restructuring plan is expected to impact approximately 7% of our global workforce with estimated pre-tax charges of approximately $1 billion. In connection with this restructuring plan, we incurred charges of $744 million during fiscal 2025. We expect this plan to be substantially completed by the end of the second quarter of fiscal 2026.\nIn the third quarter of fiscal 2024, we initiated a restructuring plan in order to realign the organization and enable further investment in key priority areas. In connection with this plan, we incurred charges of $654 million for fiscal 2024 and the plan is complete.\nOperating Income\nThe following table presents our operating income and our operating income as a percentage of revenue (in millions, except percentages):\nYears Ended\nJuly 26, 2025\nJuly 27, 2024\nJuly 29, 2023\nOperating income\n$\n11,760\n \n$\n12,181 \n$\n15,031 \nOperating income as a percentage of revenue\n20.8\n \n%\n22.6 \n%\n26.4 \n%\nOperating income decreased by 3%, and as a percentage of revenue operating income decreased by 1.8 percentage points. These changes resulted primarily from higher share-based compensation expense, higher amortization of purchased intangible assets, a charge as a result of a legal dispute with a supplier, and higher cash compensation expenses from acquisitions.\nInterest and Other Income (Loss), Net\nInterest Income (Expense), Net\n   The following table summarizes interest income and interest expense (in millions):\nYears Ended\n2025 vs. 2024\nJuly 26, 2025\nJuly 27, 2024\nJuly 29, 2023\nVariance in Dollars\nInterest income\n$\n1,001\n \n$\n1,365 \n$\n962 \n$\n(364)\nInterest expense\n(1,593)\n(1,006)\n(427)\n(587)\nInterest income (expense), net\n$\n(592)\n$\n359 \n$\n535 \n$\n(951)\nThe decrease in interest income was driven by a lower average balance of cash and available-for-sale debt investments and lower interest rates. The increase in interest expense was primarily driven by a higher average balance of debt outstanding during the period.\nOther Income (Loss), Net\n   The components of other income (loss), net, are summarized as follows (in millions):\nYears Ended\n2025 vs. 2024\nJuly 26, 2025\nJuly 27, 2024\nJuly 29, 2023\nVariance in Dollars\nGains (losses) on investments, net:\nAvailable-for-sale debt investments\n$\n(100)\n$\n(67)\n$\n(21)\n$\n(33)\nMarketable equity investments\n126\n \n65 \n37 \n61 \nPrivately held investments\n56\n \n(164)\n(193)\n220 \nNet gains (losses) on investments\n82\n \n(166)\n(177)\n248 \nOther gains (losses), net\n(150)\n(140)\n(71)\n(10)\nOther income (loss), net\n$\n(68)\n$\n(306)\n$\n(248)\n$\n238 \nThe change in our other income (loss), net was primarily driven by lower impairment charges, higher unrealized gains on our privately held investments, and higher gains on our marketable equity investments.\n42\nTable of Contents\nCISCO SYSTEMS, INC.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (Continued)\nProvision for Income Taxes \nThe provision for income taxes resulted in an effective tax rate of 8.3% for fiscal 2025, compared with 15.6% for fiscal 2024. The net 7.3 percentage points decrease in the effective tax rate was primarily due to a $720 million tax benefit related to the U.S. Tax Court opinion issued during the first quarter of fiscal 2025 regarding the U.S. taxation of deemed foreign dividends in the transition year of the Tax Cut and Job Act (\"Tax Act\") (our fiscal 2018) and an increase in stock-based compensation windfall.\nFor a full reconciliation of our effective tax rate to the U.S. federal statutory rate of 21% and for further explanation of our provision for income taxes, see Note 18 to the Consolidated Financial Statements.\n43\nTable of Contents\nCISCO SYSTEMS, INC.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (Continued)\nLIQUIDITY AND CAPITAL RESOURCES\nThe following sections discuss the effects of changes in our balance sheet, our capital allocation strategy including stock repurchase program and dividends, our contractual obligations, and certain other commitments and activities on our liquidity and capital resources.\nBalance Sheet and Cash Flows\nCash and Cash Equivalents and Investments\n  The following table summarizes our cash and cash equivalents and investments (in millions):\n   \nJuly 26, 2025\nJuly 27, 2024\nIncrease (Decrease)\nCash and cash equivalents\n$\n8,346\n \n$\n7,508 \n$\n838 \nAvailable-for-sale debt investments\n7,381\n \n9,865 \n(2,484)\nMarketable equity securities\n383\n \n481 \n(98)\nTotal\n$\n16,110\n \n$\n17,854 \n$\n(1,744)\nThe net decrease in cash and cash equivalents and investments from fiscal 2024 to fiscal 2025 was primarily driven by cash returned to stockholders in the form of cash dividends of $6.4 billion and repurchases of common stock of $6.0 billion, net repayments of debt and short-term borrowing of $2.8 billion, and capital expenditures of $0.9 billion. These uses of cash were partially offset by net cash provided by operating activities of $14.2 billion. The net cash provided by operating activities during fiscal 2025 benefited from lower tax payments.\nWe maintain an investment portfolio of various holdings, types, and maturities. We classify our investments as short-term investments based on their nature and their availability for use in current operations. We believe the overall credit quality of our portfolio is strong, with our cash equivalents and our available-for-sale debt investment portfolio consisting primarily of high quality investment-grade securities. We believe that our strong cash and cash equivalents and investments position allows us to use our cash resources for strategic investments to gain access to new technologies, for acquisitions, for customer financing activities, for working capital needs, and for the repurchase of shares of common stock and payment of dividends as discussed below.\nSecurities Lending\n  We periodically engage in securities lending activities with certain of our available-for-sale debt investments. These transactions are accounted for as a secured lending of the securities, and the securities are typically loaned only on an overnight basis. We require collateral equal to at least 102% of the fair market value of the loaned security and that the collateral be in the form of cash or liquid, high-quality assets. We engage in these secured lending transactions only with highly creditworthy counterparties, and the associated portfolio custodian has agreed to indemnify us against collateral losses. We did not experience any losses in connection with the secured lending of securities during the periods presented. As of July 26, 2025 and July 27, 2024, we had no outstanding securities lending transactions.\nFree Cash Flow and Capital Allocation\n  As part of our capital allocation strategy, we target to return a minimum of 50% of our free cash flow annually to our stockholders through cash dividends and repurchases of common stock.\nWe define free cash flow as net cash provided by operating activities less cash used to acquire property and equipment. The following table reconciles our net cash provided by operating activities to free cash flow (in millions):\nYears Ended\nJuly 26, 2025\nJuly 27, 2024\nJuly 29, 2023\nNet cash provided by operating activities\n$\n14,193\n \n$\n10,880 \n$\n19,886 \nAcquisition of property and equipment\n(905)\n(670)\n(849)\nFree cash flow\n$\n13,288\n \n$\n10,210 \n$\n19,037 \nWe expect that cash provided by operating activities may fluctuate in future periods as a result of a number of factors, including fluctuations in our operating results, the rate at which products are shipped during the quarter (which we refer to as shipment linearity), the timing and collection of accounts receivable and financing receivables, inventory and supply chain management, deferred revenue and the timing and amount of tax and other payments. For additional discussion, see “Part I,",
    "item1a": "Item 1A. Risk Factors—We may be found to infringe on intellectual property rights of others” herein.\n  \n15.\nStockholders’ Equity \n(a)\nStock Repurchase Program\nIn September 2001, our Board of Directors authorized a stock repurchase program. As of July 26, 2025, the remaining authorized amount for stock repurchases under this program was approximately $\n14.2\n billion with no termination date. \nOur stock repurchase activity under the stock repurchase program, reported based on the trade date, is summarized as follows (in millions, except per-share amounts):\nYears Ended\nShares\nWeighted-Average Price per Share\nAmount\nJuly 26, 2025\n105\n \n$\n56.53\n \n$\n5,995\n \nJuly 27, 2024\n117\n \n$\n49.45\n \n$\n5,764\n \nJuly 29, 2023\n88\n \n$\n48.49\n \n$\n4,271\n \nThere were $\n20\n million,\n \n$\n25\n million and $\n48\n million in stock repurchases that were pending settlement as of July 26, 2025, July 27, 2024 and July 29, 2023, respectively.\nThe purchase price for the shares of our stock repurchased is reflected as a reduction to stockholders’ equity. \nWe are required to allocate the purchase price of the repurchased shares as (i) a reduction to retained earnings or an increase to accumulated deficit and (ii) a reduction of common stock and additional paid-in capital.\n(b)\nDividends Declared\nOn August 13, 2025, our Board of Directors declared a quarterly dividend of $\n0.41\n per common share to be paid on October 22, 2025, to all stockholders of record as of the close of business on October 3, 2025. Future dividends will be subject to the approval of our Board of Directors.\n(c)\nPreferred Stock\nUnder the terms of our Amended and Restated Certificate of Incorporation, the Board of Directors is authorized to issue preferred stock in one or more series and, in connection with the creation of such series, to fix by resolution the designation, powers (including voting powers (if any)), preferences and relative, participating, optional or other special rights, if any, of such series, and any qualifications, limitations or restrictions thereof, of the shares of such series. As of July 26, 2025, we have not issued any shares of preferred stock.\n91\nTable of Contents\nCISCO SYSTEMS, INC.\nNotes to Consolidated Financial Statements (Continued)\n16.\nEmployee Benefit Plans  \n(a)\nEmployee Stock Incentive Plans\nWe have \none\n stock incentive plan: the 2005 Stock Incentive Plan (the “2005 Plan”). In addition, we have, in connection with our acquisitions of various companies, assumed the share-based awards granted under stock incentive plans of the acquired companies or issued share-based awards in replacement thereof. Share-based awards are designed to reward employees for their long-term contributions to us and provide incentives for them to remain with us. The number and frequency of share-based awards are based on competitive practices, our operating results, government regulations, and other factors.\nThe 2005 Plan provides for the granting of stock options, stock grants, stock units and stock appreciation rights (SARs), the vesting of which may be time-based or upon satisfaction of performance goals, or both, and/or other conditions. Time-based and performance-based RSUs generally vest over \nthree years\n with certain awards containing retirement eligible provisions. Employees (including employee directors and executive officers) and consultants of Cisco and its subsidiaries and affiliates and non-employee directors of Cisco are eligible to participate in the 2005 Plan. The 2005 Plan may be terminated by our Board of Directors at any time and for any reason, and is currently set to terminate at the 2030 Annual Meeting unless re-adopted or extended by our stockholders prior to or on such date.\nUnder the 2005 Plan’s share reserve feature, a distinction is made between the number of shares in the reserve attributable to (i) stock options and SARs and (ii) “full value” awards (i.e., stock grants and stock units). Shares issued as stock grants, pursuant to stock units or pursuant to the settlement of dividend equivalents are counted against shares available for issuance under the 2005 Plan on a \n1.5\n-to-1 ratio. For each share awarded as restricted stock or a restricted stock unit award under the 2005 Plan, \n1.5\n shares was deducted from the available share-based award balance. If awards issued under the 2005 Plan are forfeited or terminated for any reason before being exercised or settled, then the shares underlying such awards, plus the number of additional shares, if any, that counted against shares available for issuance under the 2005 Plan at the time of grant as a result of the application of the share ratio described above, will become available again for issuance under the 2005 Plan. As of July 26, 2025, \n100\n million shares were authorized for future grant under the 2005 Plan.\n(b)\nEmployee Stock Purchase Plan\nWe have an Employee Stock Purchase Plan under which eligible employees are offered shares through a \n24\n-month offering period, which consists of \nfour\n consecutive \n6\n-month purchase periods. Employees may purchase a limited amount of shares of our stock at a discount of up to \n15\n% of the lesser of the fair market value at the beginning of the offering period or the end of each \n6\n-month purchase period. The Employee Stock Purchase Plan is scheduled to terminate on the earlier of (i) January 3, 2030 and (ii) the date on which all shares available for issuance under the Employee Stock Purchase Plan are sold pursuant to exercised purchase rights. We issued \n18\n million, \n20\n million, and \n19\n million shares under the Employee Stock Purchase Plan in fiscal 2025, 2024, and 2023, respectively. As of July 26, 2025, \n50\n million shares were available for issuance under the Employee Stock Purchase Plan.\n(c)\nSummary of Share-Based Compensation Expense\nShare-based compensation expense consists of expenses for RSUs, stock purchase rights, and stock options, granted to employees or assumed from acquisitions. The following table summarizes share-based compensation expense (in millions):\nYears Ended\nJuly 26, 2025\nJuly 27, 2024\nJuly 29, 2023\nCost of sales—product\n$\n255\n \n$\n214\n \n$\n151\n \nCost of sales—services\n329\n \n300\n \n245\n \nShare-based compensation expense in cost of sales\n584\n \n514\n \n396\n \nResearch and development\n1,625\n \n1,316\n \n1,008\n \nSales and marketing\n918\n \n846\n \n673\n \nGeneral and administrative\n476\n \n375\n \n270\n \nRestructuring and other charges\n38\n \n23\n \n6\n \nShare-based compensation expense in operating expenses\n3,057\n \n2,560\n \n1,957\n \nTotal share-based compensation expense\n$\n3,641\n \n$\n3,074\n \n$\n2,353\n \nIncome tax benefit for share-based compensation\n$\n871\n \n$\n696\n \n$\n449\n \nAs of July 26, 2025, the total compensation cost related to unvested share-based awards not yet recognized was $\n4.5\n billion, which is expected to be recognized over approximately \n1.9\n years on a weighted-average basis. \n92\nTable of Contents\nCISCO SYSTEMS, INC.\nNotes to Consolidated Financial Statements (Continued)\n(d)\nRestricted Stock Unit Awards\nA summary of the restricted stock and stock unit activity, which includes time-based and performance-based or market-based RSUs, is as follows (in millions, except per-share amounts):\nRestricted Stock/\nStock Units\nWeighted-Average\nGrant Date Fair\nValue per Share\nAggregate Fair  Value\nUNVESTED BALANCE AT JULY 30, 2022\n97\n \n$\n46.67\n \nGranted and assumed\n72\n \n42.08\n \nVested\n(\n39\n)\n46.69\n \n$\n1,746\n \nCanceled/forfeited/other\n(\n8\n)\n45.17\n \nUNVESTED BALANCE AT JULY 29, 2023\n122\n \n44.04\n \nGranted and assumed\n63\n \n48.97\n \nVested\n(\n58\n)\n43.46\n \n$\n2,906\n \nCanceled/forfeited/other\n(\n10\n)\n45.65\n \nUNVESTED BALANCE AT JULY 27, 2024\n117\n \n46.86\n \nGranted and assumed\n70\n \n55.73\n \nVested\n(\n65\n)\n46.95\n \n$\n3,707\n \nCanceled/forfeited/other\n(\n9\n)\n48.04\n \nUNVESTED BALANCE AT JULY 26, 2025\n113\n \n$\n52.26\n \n(e)\nValuation of Employee Share-Based Awards\nTime-based restricted stock units and PRSUs that are based on our financial performance metrics or non-financial operating goals are valued using the market value of our common stock on the date of grant, discounted for the present value of expected dividends. For PRSUs granted, we included a relative total shareholder return (TSR) modifier to determine the number of shares earned at the end of the performance period. The TSR modifier is determined using a Monte Carlo simulation model. The PRSUs granted during the fiscal years presented are contingent on the achievement of our financial performance metrics, our comparative market-based returns, or the achievement of financial and non-financial operating goals.\nThe assumptions for the valuation of time-based RSUs and PRSUs are summarized as follows:\nRESTRICTED STOCK UNITS\nYears Ended\nJuly 26, 2025\nJuly 27, 2024\nJuly 29, 2023\nNumber of shares granted (in millions)\n65\n \n60\n \n70\n \nGrant date fair value per share\n$\n55.93\n \n$\n48.71\n \n$\n42.13\n \nWeighted-average assumptions/inputs:\n   Expected dividend yield\n2.7\n \n%\n3.0\n \n%\n3.4\n \n%\n   Range of risk-free interest rates\n3.5\n% \n–\n \n4.9\n%\n4.2\n% \n–\n \n5.6\n%\n3.7\n% \n–\n \n5.7\n%\nPERFORMANCE BASED RESTRICTED STOCK UNITS\nYears Ended\nJuly 26, 2025\nJuly 27, 2024\nJuly 29, 2023\nNumber of shares granted (in millions)\n4\n \n3\n \n2\n \nGrant date fair value per share\n$\n54.50\n \n$\n59.31\n \n$\n40.44\n \n93\nTable of Contents\nCISCO SYSTEMS, INC.\nNotes to Consolidated Financial Statements (Continued)\nThe assumptions for the valuation of employee stock purchase rights are summarized as follows:\n \nEMPLOYEE STOCK PURCHASE RIGHTS\nYears Ended\nJuly 26, 2025\nJuly 27, 2024\nJuly 29, 2023\nWeighted-average assumptions:\n   Expected volatility\n22.5\n \n%\n28.3\n \n%\n28.7\n \n%\n   Risk-free interest rate\n5.0\n \n%\n2.9\n \n%\n2.8\n \n%\n   Expected dividend\n3.3\n \n%\n3.5\n \n%\n3.6\n \n%\n   Expected life (in years)\n1.3\n1.2\n1.2\nWeighted-average estimated grant date fair value per share\n$\n12.18\n \n$\n11.59\n \n$\n12.40\n \nThe valuation of employee stock purchase rights and the related assumptions are for the employee stock purchases made during the respective fiscal years.\nWe used the implied volatility for traded options (with contract terms corresponding to the expected life of the employee stock purchase rights) on our stock as the expected volatility assumption required in the Black-Scholes model. The implied volatility is more representative of future stock price trends than historical volatility. The risk-free interest rate assumption is based upon observed interest rates appropriate for the term of our employee stock purchase rights. The dividend yield assumption is based on the history and expectation of dividend payouts at the grant date.\n(f)\nEmployee 401(k) Plans\nWe sponsor the Cisco Systems, Inc. 401(k) Plan (the “Plan”) to provide retirement benefits for our employees. As allowed under Section 401(k) of the Internal Revenue Code, the Plan provides for tax-deferred salary contributions and after-tax contributions for eligible employees. The Plan allows employees to contribute up to \n75\n% of their annual eligible earnings to the Plan on a pretax and after-tax basis, including Roth contributions. Employee contributions are limited to a maximum annual amount as set periodically by the Internal Revenue Code. We match pretax and Roth employee contributions up to \n100\n% of the first \n4.5\n% of eligible earnings that are contributed by employees. Therefore, the maximum matching contribution that we may allocate to each participant’s account will not exceed $\n15,750\n for the 2025 calendar year due to the $350,000 annual limit on eligible earnings imposed by the Internal Revenue Code. All matching contributions vest immediately. Our matching contributions to the Plan totaled $\n373\n million, $\n358\n million, and $\n342\n million in fiscal 2025, 2024, and 2023, respectively.\nThe Plan allows employees who meet the age requirements and reach the Plan contribution limits to make catch-up contributions (pretax or Roth) not to exceed the lesser of \n75\n% of their annual eligible earnings or the limit set forth in the Internal Revenue Code. Catch-up contributions are not eligible for matching contributions. In addition, the Plan provides for discretionary profit-sharing contributions as determined by the Board of Directors. Such contributions to the Plan are allocated among eligible participants in the proportion of their salaries to the total salaries of all participants. There were \nno\n discretionary profit-sharing contributions made in fiscal 2025, 2024, and 2023.\nWe also sponsor other 401(k) plans as a result of acquisitions of other companies. Our contributions to these plans were not material to Cisco on either an individual or aggregate basis for any of the fiscal years presented.\n(g)\nDeferred Compensation Plans\nThe Cisco Systems, Inc. Deferred Compensation Plan (the “Deferred Compensation Plan”), a nonqualified deferred compensation plan, became effective in 2007. As required by applicable law, participation in the Deferred Compensation Plan is limited to a select group of our management employees. Under the Deferred Compensation Plan, which is an unfunded and unsecured deferred compensation arrangement, a participant may elect to defer base salary, bonus, and/or commissions, pursuant to such rules as may be established by Cisco, up to the maximum percentages for each deferral election as described in the plan. We may also, at our discretion, make a matching contribution to the employee under the Deferred Compensation Plan. A matching contribution equal to \n4.5\n% of eligible compensation in excess of the Internal Revenue Code limit for qualified plans for calendar year 2025 that is deferred by participants under the Deferred Compensation Plan (with a $\n1.5\n million cap on eligible compensation) will be made to eligible participants’ accounts at the end of calendar year 2025. The total deferred compensation liability under the Deferred Compensation Plan, together with deferred compensation plans assumed from acquired companies, was approximately $\n1.2\n billion\n \nand $\n1.1\n billion as of July 26, 2025 and July 27, 2024, respectively, and was recorded primarily in other long-term liabilities.\n \n94\nTable of Contents\nCISCO SYSTEMS, INC.\nNotes to Consolidated Financial Statements (Continued)\n17.\nAccumulated Other Comprehensive Income (Loss)  \nThe components of AOCI, net of tax, and the other comprehensive income (loss) are summarized as follows (in millions):\nNet Unrealized Gains (Losses) on Available-for-Sale Investments\nNet Unrealized  Gains (Losses) Cash Flow Hedging Instruments\nCumulative Translation Adjustment and Actuarial Gains (Losses)\nAccumulated Other Comprehensive Income (Loss)\nBALANCE AT JULY 30, 2022\n$\n(\n379\n)\n$\n44\n \n$\n(\n1,287\n)\n$\n(\n1,622\n)\nOther comprehensive income (loss) before reclassifications\n(\n113\n)\n29\n \n116\n \n32\n \n(Gains) losses reclassified out of AOCI\n21\n \n(\n63\n)\n(\n1\n)\n(\n43\n)\nTax benefit (expense)\n31\n \n8\n \n19\n \n58\n \nBALANCE AT JULY 29, 2023\n(\n440\n)\n18\n \n(\n1,153\n)\n(\n1,575\n)\nOther comprehensive income (loss) before reclassifications\n193\n \n128\n \n(\n115\n)\n206\n \n(Gains) losses reclassified out of AOCI\n67\n \n(\n49\n)\n(\n2\n)\n16\n \nTax benefit (expense)\n(\n61\n)\n(\n18\n)\n2\n \n(\n77\n)\nBALANCE AT JULY 27, 2024\n(\n241\n)\n79\n \n(\n1,268\n)\n(\n1,430\n)\nOther comprehensive income (loss) before reclassifications\n152\n \n29\n \n304\n \n485\n \n(Gains) losses reclassified out of AOCI\n100\n \n(\n47\n)\n—\n \n53\n \nTax benefit (expense)\n(\n68\n)\n4\n \n2\n \n(\n62\n)\nBALANCE AT JULY 26, 2025\n$\n(\n57\n)\n$\n65\n \n$\n(\n962\n)\n$\n(\n954\n)\n95\nTable of Contents\nCISCO SYSTEMS, INC.\nNotes to Consolidated Financial Statements (Continued)\n18.\nIncome Taxes\n(a)\nProvision for Income Taxes\nThe provision for income taxes consists of the following (in millions):\nYears Ended\nJuly 26, 2025\nJuly 27, 2024\nJuly 29, 2023\nFederal:\nCurrent\n$\n956\n \n$\n1,939\n \n$\n3,754\n \nDeferred\n(\n838\n)\n(\n883\n)\n(\n1,955\n)\n118\n \n1,056\n \n1,799\n \nState:\nCurrent\n431\n \n388\n \n623\n \nDeferred\n(\n250\n)\n11\n \n(\n175\n)\n181\n \n399\n \n448\n \nForeign:\nCurrent\n665\n \n559\n \n412\n \nDeferred\n(\n44\n)\n(\n100\n)\n46\n \n621\n \n459\n \n458\n \nTotal\n$\n920\n \n$\n1,914\n \n$\n2,705\n \nIncome before provision for income taxes consists of the following (in millions):\nYears Ended\nJuly 26, 2025\nJuly 27, 2024\nJuly 29, 2023\nUnited States\n$\n9,500\n \n$\n10,790\n \n$\n14,074\n \nInternational\n1,600\n \n1,444\n \n1,244\n \nTotal\n$\n11,100\n \n$\n12,234\n \n$\n15,318\n \nThe items accounting for the difference between income taxes computed at the federal statutory rate and the provision for income taxes consist of the following:\nYears Ended\nJuly 26, 2025\nJuly 27, 2024\nJuly 29, 2023\nFederal statutory rate\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nEffect of:\nState taxes, net of federal tax benefit\n1.3\n \n2.8\n \n2.4\n \nForeign income at other than U.S. rates\n0.7\n \n(\n0.3\n)\n(\n0.1\n)\nTax credits\n(\n2.7\n)\n(\n2.4\n)\n(\n0.3\n)\nForeign-derived intangible income deduction\n(\n6.0\n)\n(\n5.5\n)\n(\n5.8\n)\nStock-based compensation\n0.7\n \n0.7\n \n1.1\n \nImpact of the Tax Act\n(\n6.5\n)\n—\n \n—\n \nOther, net\n(\n0.2\n)\n(\n0.7\n)\n(\n0.6\n)\nTotal\n8.3\n \n%\n15.6\n \n%\n17.7\n \n%\nOn August 26, 2024, the U.S. Tax Court issued an opinion in \nVarian Medical Systems, Inc. v. Commissioner\n. The opinion related to the U.S. taxation of deemed foreign dividends in the transition year of the Tax Act (our fiscal 2018). While we were not a party to the case, the opinion resulted in a change to our tax position. As such, we recorded a tax benefit of $\n720\n million as a reduction to the provision for income taxes in fiscal 2025 due to this U.S. Tax Court opinion.\nDuring fiscal 2023, we resolved certain items with the Internal Revenue Service (IRS) related to the audit of our federal income tax returns for the fiscal years ended July 26, 2014 through July 30, 2016. As a result of this resolution, we recognized a net benefit to the provision for income taxes of $\n145\n million, which included a reduction of interest expense of $\n53\n million. During fiscal 2024, we resolved all remaining items with the IRS related to the audit of our federal income tax returns for the fiscal years ended July 26, 2014 through July 30, 2016. As a result of this resolution, we recognized a net benefit to the provision for income taxes of $\n55\n million, which included a reduction of interest expense of $\n18\n million.\n96\nTable of Contents\nCISCO SYSTEMS, INC.\nNotes to Consolidated Financial Statements (Continued)\nDuring the fourth quarter of fiscal 2025, we changed our assertion regarding our intent to indefinitely reinvest $\n6.5\n billion of undistributed earnings for certain foreign subsidiaries and determined that those earnings are no longer considered permanently reinvested. The deferred income tax impact of this change is not material.\nUnrecognized Tax Benefits\n \nThe aggregate changes in the balance of gross unrecognized tax benefits were as follows (in millions):\nYears Ended\nJuly 26, 2025\nJuly 27, 2024\nJuly 29, 2023\nBeginning balance\n$\n2,156\n \n$\n2,137\n \n$\n3,101\n \nAdditions based on tax positions related to the current year\n283\n \n205\n \n159\n \nAdditions for tax positions of prior years\n81\n \n256\n \n261\n \nReductions for tax positions of prior years\n(\n68\n)\n(\n344\n)\n(\n265\n)\nSettlements\n(\n75\n)\n(\n53\n)\n(\n1,063\n)\nLapse of statute of limitations\n(\n40\n)\n(\n45\n)\n(\n56\n)\nEnding balance\n$\n2,337\n \n$\n2,156\n \n$\n2,137\n \nAs a result of the resolution of the IRS audit of our federal tax income tax returns for the fiscal years ended July 26, 2014 through July 30, 2016, the amount of gross unrecognized tax benefits was reduced by approximately $\n1.1\n billion in fiscal 2023 and $\n245\n million in fiscal 2024.\nAs of July 26, 2025, $\n1.6\n billion of the unrecognized tax benefits would affect the effective tax rate if realized. We recognized net interest expense of $\n77\n million, $\n21\n million and $\n27\n million during fiscal 2025, 2024, and 2023, respectively. Our net penalty expense for fiscal 2025, 2024, and 2023 was not material. Our total accrual for interest and penalties was\n \n$\n497\n million, $\n401\n million, and $\n523\n million as of the end of fiscal 2025, 2024, and 2023, respectively. We are no longer subject to U.S. federal income tax audit for returns covering tax years through fiscal 2016. We are no longer subject to foreign or state income tax audits for returns covering tax years through fiscal 2003 and fiscal 2008, respectively.\nWe regularly engage in discussions and negotiations with tax authorities regarding tax matters in various jurisdictions. We believe it is reasonably possible that certain federal, foreign, and state tax matters may be concluded in the next 12 months. Specific positions that may be resolved include issues involving transfer pricing and various other matters. We estimate that the unrecognized tax benefits at July 26, 2025 could be reduced by approximately\n \n$\n250\n million in the next 12 months.\n(b)\nDeferred Tax Assets and Liabilities\nThe following table presents the breakdown for net deferred tax assets (in millions):\nJuly 26, 2025\nJuly 27, 2024\nDeferred tax assets\n$\n7,356\n \n$\n6,262\n \nDeferred tax liabilities\n(\n75\n)\n(\n76\n)\nTotal net deferred tax assets\n$\n7,281\n \n$\n6,186\n \n97\nTable of Contents\nCISCO SYSTEMS, INC.\nNotes to Consolidated Financial Statements (Continued)\nThe following table presents the components of the deferred tax assets and liabilities (in millions):\nJuly 26, 2025\nJuly 27, 2024\nASSETS\nInventory write-downs and capitalization\n$\n532\n \n$\n530\n \nDeferred foreign income\n221\n \n277\n \nIPR&D and purchased intangible assets\n961\n \n1,039\n \nDepreciation\n242\n \n184\n \nDeferred revenue\n1,933\n \n2,034\n \nCredits and net operating loss carryforwards\n1,350\n \n1,863\n \nShare-based compensation expense\n319\n \n297\n \nAccrued compensation\n175\n \n275\n \nLease liabilities\n379\n \n308\n \nCapitalized research expenditures\n4,182\n \n3,030\n \nOther\n678\n \n559\n \nGross deferred tax assets\n10,972\n \n10,396\n \nValuation allowance\n(\n910\n)\n(\n1,024\n)\nTotal deferred tax assets\n10,062\n \n9,372\n \nLIABILITIES\nGoodwill and purchased intangible assets\n(\n2,288\n)\n(\n2,808\n)\nROU lease assets\n(\n315\n)\n(\n259\n)\nOther\n(\n178\n)\n(\n119\n)\nTotal deferred tax liabilities\n(\n2,781\n)\n(\n3,186\n)\nTotal net deferred tax assets\n$\n7,281\n \n$\n6,186\n \nThe changes in the valuation allowance for deferred tax assets are summarized as follows (in millions):\nJuly 26, 2025\nJuly 27, 2024\nJuly 29, 2023\nBalance at beginning of fiscal year\n$\n1,024\n \n$\n754\n \n$\n834\n \nAdditions\n33\n \n148\n \n35\n \nAdditions from Splunk\n—\n \n147\n \n—\n \nDeductions\n(\n4\n)\n(\n4\n)\n(\n18\n)\nWrite-offs\n(\n145\n)\n(\n20\n)\n(\n93\n)\nForeign exchange and other\n2\n \n(\n1\n)\n(\n4\n)\nBalance at end of fiscal year\n$\n910\n \n$\n1,024\n \n$\n754\n \nAs of July 26, 2025, our federal, state, and foreign net operating loss carryforwards before valuation allowance for income tax purposes were $\n284\n million, $\n2.1\n billion, and $\n533\n million, respectively. A significant amount of the net operating loss carryforwards relates to acquisitions and, as a result, is limited in the amount that can be recognized in any one year. If not utilized, the federal, state, and foreign net operating loss carryforwards will begin to expire in fiscal 2026. We have provided a valuation allowance of $\n10\n million and $\n96\n million for deferred tax assets related to state and foreign net operating losses respectively that are not expected to be realized.\nAs of July 26, 2025, our federal, state, and foreign tax credit carryforwards for income tax purposes before valuation allowance were approximately $\n7\n million, $\n1.8\n billion, and $\n8\n million, respectively. The federal tax credit carryforwards will begin to expire in fiscal 2027. The majority of state and foreign tax credits can be carried forward indefinitely. We have provided a valuation allowance of $\n752\n million for deferred tax assets related to state and foreign tax credits carryforwards that are not expected to be realized.\n \n98\nTable of Contents\nCISCO SYSTEMS, INC.\nNotes to Consolidated Financial Statements (Continued)\n19.\nSegment Information and Major Customers \n(a)\nRevenue and Gross Margin by Segment\nWe conduct business globally and are primarily managed on a geographic basis consisting of \nthree\n segments: the Americas, EMEA, and APJC. Our chief executive officer is the chief operating decision maker (CODM). The CODM reviews certain financial information for each segment, to evaluate performance and allocate resources by comparing actual performance to our annual targets. Performance of each segment is measured based on segment revenue and segment gross margin.\nWe do not allocate research and development, sales and marketing, or general and administrative expenses to our segments because the CODM does not include this information in our measurement of performance of the operating segments. In addition, we do not allocate amortization and impairment of acquisition-related intangible assets, share-based compensation expense, significant litigation settlements (which includes the supplier-related legal settlement as described in Note 21) and other contingencies, charges related to asset impairments and restructurings, and certain other charges to the cost of sales and gross margin for each segment because the CODM does not include this information in the measurement of the performance of our operating segments.\nThe following summarizes our revenue and gross margin by segment and the significant expenses by each segment for fiscal 2025, 2024, and 2023 (in millions):\nYears Ended\nJuly 26, 2025\nJuly 27, 2024\nJuly 29, 2023\nRevenue:\nAmericas\n$\n33,656\n \n$\n31,971\n \n$\n33,447\n \nEMEA\n14,824\n \n14,117\n \n15,135\n \nAPJC\n8,174\n \n7,716\n \n8,417\n \nTotal\n$\n56,654\n \n$\n53,803\n \n$\n56,998\n \nGross margin:\nAmericas\n$\n22,962\n \n$\n21,372\n \n$\n21,350\n \nEMEA\n10,545\n \n9,755\n \n10,016\n \nAPJC\n5,431\n \n5,187\n \n5,424\n \nSegment total\n38,938\n \n36,312\n \n36,788\n \nUnallocated corporate items\n(\n2,148\n)\n(\n1,484\n)\n(\n1,035\n)\nTotal\n$\n36,790\n \n$\n34,828\n \n$\n35,753\n \nSupplemental information about our significant expenses:\nAmericas:\nCost of sales — product\n$\n8,206\n \n$\n8,077\n \n$\n9,479\n \nCost of sales — services\n2,487\n \n2,523\n \n2,619\n \nSegment total\n$\n10,694\n \n$\n10,600\n \n$\n12,097\n \nEMEA:\nCost of sales — product\n$\n3,138\n \n$\n3,264\n \n$\n3,998\n \nCost of sales — services\n1,140\n \n1,098\n \n1,121\n \nSegment total\n$\n4,279\n \n$\n4,362\n \n$\n5,119\n \nAPJC:\nCost of sales — product\n$\n2,010\n \n$\n1,838\n \n$\n2,324\n \nCost of sales — services\n734\n \n690\n \n668\n \nSegment total\n$\n2,743\n \n$\n2,529\n \n$\n2,992\n \nAmounts may not sum due to rounding.\nRevenue in the United States was $\n30.4\n billion, $\n28.7\n billion, and $\n29.9\n billion for fiscal 2025, 2024, and 2023, respectively.\n99\nTable of Contents\nCISCO SYSTEMS, INC.\nNotes to Consolidated Financial Statements (Continued)\n(b)\nRevenue for Groups of Similar Products and Services\nWe design and sell IP-based networking and other products related to the communications and IT industry and provide services associated with these products and their use.\nThe following table presents revenue for groups of similar products and services (in millions):\nYears Ended\nJuly 26, 2025\nJuly 27, 2024\nJuly 29, 2023\nRevenue:\nNetworking\n$\n28,304\n \n$\n29,229\n \n$\n34,570\n \nSecurity\n8,094\n \n5,075\n \n3,859\n \nCollaboration\n4,154\n \n4,113\n \n4,052\n \nObservability\n1,055\n \n837\n \n661\n \nTotal Product\n41,608\n \n39,253\n \n43,142\n \nServices\n15,046\n \n14,550\n \n13,856\n \nTotal\n$\n56,654\n \n$\n53,803\n \n$\n56,998\n \nAmounts may not sum due to rounding. \n(c)\nAdditional Segment Information\nNo single customer accounted for\n \n10% or more of revenue in fiscal 2025, 2024, and 2023.\nOur long-lived assets are based on the physical location of the assets. \nThe following table presents our long-lived assets, which consists of property and equipment, net and operating lease ROU assets information for geographic areas (in millions):\n \nJuly 26, 2025\nJuly 27, 2024\nLong-lived assets:\nUnited States\n$\n2,370\n \n$\n2,253\n \nInternational\n1,044\n \n903\n \nTotal\n$\n3,414\n \n$\n3,156\n \n20.\nNet Income per Share \nThe following table presents the calculation of basic and diluted net income per share (in millions, except per-share amounts):\nYears Ended\nJuly 26, 2025\nJuly 27, 2024\nJuly 29, 2023\nNet income\n$\n10,180\n \n$\n10,320\n \n$\n12,613\n \nWeighted-average shares—basic\n3,976\n \n4,043\n \n4,093\n \nEffect of dilutive potential common shares\n22\n \n19\n \n12\n \nWeighted-average shares—diluted\n3,998\n \n4,062\n \n4,105\n \nNet income per share—basic\n$\n2.56\n \n$\n2.55\n \n$\n3.08\n \nNet income per share—diluted\n$\n2.55\n \n$\n2.54\n \n$\n3.07\n \nAntidilutive employee share-based awards, excluded\n78\n \n82\n \n86\n \n100\nTable of Contents\nCISCO SYSTEMS, INC.\nNotes to Consolidated Financial Statements (Continued)\n21.\nSubsequent Event\nOn August 26, 2025, we settled a legal dispute with a supplier over purchase obligations arising under certain long-term supply arrangements entered into to help us mitigate significant supply chain constraints seen in prior periods. Under the terms of the settlement, the parties agreed to the dismissal of all pending actions in exchange for mutual releases of claims related to the long-term supply arrangements with the supplier, the termination of such arrangements between the parties, the release back to us of approximately $\n563\n million held in escrow under the arrangements (which is reported as restricted cash within other current assets), and the forfeiture by us of approximately $\n450\n million in supplier-held prepayments, after giving effect to certain amounts to be applied against such prepayments. No incremental cash consideration is to be paid in connection with the settlement. As a result of this settlement, we recorded a charge in the fourth quarter of fiscal 2025 of approximately $\n355\n million to product cost of sales and a corresponding income tax benefit of approximately $\n82\n million.\n \n101\nTable of Contents\nItem 9.\nChanges in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.\nItem 9A.\nControls and Procedures\nEvaluation of Disclosure Controls and Procedures\nBased on our management’s evaluation (with the participation of our principal executive officer and principal financial officer), as of the end of the period covered by this report, our principal executive officer and principal financial officer have concluded that our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the “Exchange Act”)), are effective to ensure that information required to be disclosed by us in reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in Securities and Exchange Commission rules and forms and is accumulated and communicated to our management, including our principal executive officer and principal financial officer, as appropriate to allow timely decisions regarding required disclosure.\nInternal Control over Financial Reporting\nManagement’s report on our internal control over financial reporting and the report of our independent registered public accounting firm on our internal control over financial reporting are set forth, respectively, on page 55 under the caption “Management’s Report on Internal Control Over Financial Reporting” and on page 53 of this report.\nThere was no change in our internal control over financial reporting during our fourth quarter of fiscal 2025 that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.\nItem 9B.\nOther Information\nRule 10b5-1 \nTrading Arrangements\nOn \nJune 20, 2025\n, \nOliver Tuszik\n, Cisco's \nExecutive Vice President, Global Sales\n, \nadopted\n a trading plan intended to satisfy the affirmative defense conditions of Rule 10b5-1(c) under the Exchange Act. Mr. Tuszik’s trading plan provides for the sale of approximately \n49,067\n gross shares (with any shares underlying performance-based equity awards being calculated at target), plus any related dividend-equivalent shares earned with respect to such shares and shares from purchases made pursuant to Cisco’s employee stock purchase plan, and excluding, as applicable, any shares withheld to satisfy tax withholding obligations in connection with the net settlement of the equity awards. Mr. Tuszik’s trading plan is scheduled to terminate on \nDecember 31, 2025\n, subject to early termination for certain specified events set forth therein.\nItem 9C.\nDisclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\n102\nTable of Contents\nPART III\nItem 10.\nDirectors, Executive Officers and Corporate Governance\nWe have adopted a code of ethics that applies to our principal executive officer and all members of our finance department, including the principal financial officer and principal accounting officer. This code of ethics can be found at the “Financial Officer Code of Ethics” link in the Corporate Governance section of Cisco’s Investor Relations website at investor.cisco.com. We intend to satisfy any disclosure requirement regarding an amendment to, or waiver from, a provision of this code of ethics by posting such information on that website or in a report on Form 8-K.\nInsider Trading Arrangements and Policies\nWe are committed to promoting high standards of ethical business conduct and compliance with applicable laws, rules and regulations. As part of this commitment, we have adopted an Insider Trading Policy governing transactions in our securities by our directors, employees, contractors, consultants and other personnel providing services to Cisco, as well as by Cisco itself, that we believe is reasonably designed to promote compliance with insider trading laws, rules and regulations and The Nasdaq Stock Market listing standards. The foregoing summary of the Insider Trading Policy does not purport to be complete and is qualified in its entirety by reference to the full text of the Insider Trading Policy, which was filed with the Securities and Exchange Commission on September 5, 2024 as Exhibit 19.1 to Cisco's Annual Report on Form 10-K.\nThe addit\nional information required by this item is included in our Proxy Statement related to the 2025 Annual Meeting of Stockholders to be filed with the SEC within 120 days after July 26, 2025 (the “Proxy Statement”) and is incorporated herein by reference.\nItem 11.\nExecutive Compensation\nThe information required by this item is included in our Proxy Statement and is incorporated herein by reference.\nItem 12.\nSecurity Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by this item is included in our Proxy Statement and is incorporated herein by reference.\nItem 13.\nCertain Relationships and Related Transactions, and Director Independence\nThe information required by this item is included in our Proxy Statement and is incorporated herein by reference.\nItem 14.\nPrincipal Accountant Fees and Services\nThe information required by this item is included in our Proxy Statement and is incorporated herein by reference.\nPART IV\nItem 15.\nExhibits and Financial Statement Schedules\n(a)\n1.    Financial Statements\nSee the “Index to Consolidated Financial Statements” on page 52 of this report.\n2.\nFinancial Statement Schedule\nAll financial statement schedules have been omitted, since the required information is not applicable or is shown in the financial statements or notes herein.\n3.\nExhibits\nSee the “Index to Exhibits” beginning on page 104 of this report.\n103\nTable of Contents\nINDEX TO EXHIBITS\n \nExhibit\nNumber\nExhibit Description\nIncorporated by Reference\nFiled\nHerewith\n \n \nForm\nFile No.\nExhibit\nFiling Date\n \n2.1\nAgreement and Plan of Merger, dated as of September 20, 2023, by and among Cisco Systems, Inc., Spirit Merger Corp. and Splunk Inc.\n8-K\n001-39940\n2.1\n9/21/2023\n3.1\nAmended and Restated Certificate of Incorporation of Cisco Systems, Inc., as currently in effect\n8-K12B\n001-39940\n3.1\n1/25/2021\n3.2\nAmended and Restated Bylaws of Cisco Systems, Inc., as currently in effect\n8-K\n001-39940\n3.2\n8/25/2025\n4.1\nIndenture, dated February 17, 2009, between Cisco Systems, Inc. and the Bank of New York Mellon Trust Company, N.A., as trustee\n8-K\n000-18225\n4.1\n2/17/2009\n4.2\nIndenture, dated November 17, 2009, between Cisco Systems, Inc. and the Bank of New York Mellon Trust Company, N.A., as trustee\n8-K\n000-18225\n4.1\n11/17/2009\n4.3\nIndenture, dated March 3, 2014, between the Company and The Bank of New York Mellon Trust Company, N.A., as trustee\n8-K\n000-18225\n4.1\n3/3/2014\n4.4\nFirst Supplemental Indenture, dated January 25, 2021 to the Indenture, dated February 17, 2009, between Cisco Systems, Inc. and the Bank of New York Mellon Trust Company, N.A., as trustee\n10-Q\n001-39940\n4.1\n2/16/2021\n4.5\nFirst Supplemental Indenture, dated January 25, 2021 to the Indenture, dated November 17, 2009, between Cisco Systems, Inc. and the Bank of New York Mellon Trust Company, N.A., as trustee\n10-Q\n001-39940\n4.2\n2/16/2021\n4.6\nFirst Supplemental Indenture, dated January 25, 2021 to the Indenture, dated March 3, 2014, between the Company and The Bank of New York Mellon Trust Company\n10-Q\n001-39940\n4.3\n2/16/2021\n4.7\nIndenture, dated as of February 26, 2024, between Cisco Systems, Inc. and The Bank of New York Mellon Trust Company, N.A., as trustee\n8-K\n001-39940\n4.1\n2/26/2024\n4.8\nFirst Supplemental Indenture, dated as of February 26, 2024, between Cisco Systems, Inc. and The Bank of New York Mellon Trust Company, N.A., as trustee, for 4.900% Senior Notes due 2026, 4.800% Senior Notes due 2027, 4.850% Senior Notes due 2029, 4.950% Senior Notes due 2031, 5.050% Senior Notes due 2034, 5.300% Senior Notes due 2054 and 5.350% Senior Notes due 2064\n8-K\n001-39940\n4.2\n2/26/2024\n4.9\nSecond Supplemental Indenture, dated as of February 24, 2025 to the Indenture, dated February 26, 2024, between Cisco Systems, Inc. and The Bank of New York Mellon Trust Company, N.A., as trustee, relating to the issuance of the 4.550% Senior Notes due 2028, 4.750% Senior Notes due 2030, 4.950% Senior Notes due 2032, 5.100% Senior Notes due 2035 and 5.500% Senior Notes due 2055\n8-K\n001-39940\n4.2\n2/24/2025\n4.10\nForms of Global Note for the registrant’s 5.90% Senior Notes due 2039\n8-K\n000-18225\n4.1\n2/17/2009\n4.11\nForms of Global Note for the registrant’s 4.45% Senior Notes due 2020 and 5.50% Senior Notes due 2040\n8-K\n000-18225\n4.1\n11/17/2009\n4.12\nForm of Officer’s Certificate setting forth the terms of the Fixed and Floating Notes issued in June 2015\n8-K\n000-18225\n4.1\n6/18/2015\n4.13\nForm of Officer’s Certificate setting forth the terms of the Fixed and Floating Notes issued in February 2016\n8-K\n000-18225\n4.1\n2/29/2016\n104\nTable of Contents\nExhibit\nNumber\nExhibit Description\nIncorporated by Reference\nFiled\nHerewith\n \n \nForm\nFile No.\nExhibit\nFiling Date\n \n4.14\nForm of Officer’s Certificate setting forth the terms of the Fixed and Floating Notes issued in September 2016\n8-K\n000-18225\n4.1\n9/20/2016\n4.15\nDescription of Registrant’s Securities\n10-K\n001-39940\n4.13\n9/9/2021\n10.1*\nCisco Systems, Inc. 2005 Stock Incentive Plan (including related form agreements)\n10-Q\n001-39940\n10.1\n2/18/2025\n10.2*\nCisco Systems, Inc. Employee Stock Purchase Plan\n10-Q\n001-39940\n10.1\n5/20/2025\n10.3*\nCisco Systems, Inc. Deferred Compensation Plan, as amended\n10-Q\n001-39940\n10.3\n11/22/2022\n10.4*\nCisco Systems, Inc. Executive Incentive Plan\n8-K\n000-18225\n10.2\n12/12/2017\n10.5*\nForm of Indemnity Agreement\n8-K12B\n001-39940\n10.1\n1/25/2021\n10.6†\nThird Amended and Restated Credit Agreement, dated as of February 2, 2024, by and among Cisco Systems, Inc., certain lenders party thereto, and Bank of America, N.A., as administrative agent, swing line lender and letter of credit issuer\n8-K\n001-39940\n10.1\n2/8/2024\n10.7*\nLetter Agreement, dated May 15, 2024, between Cisco and Gary Steele\n8-K\n001-39940\n10.1\n5/15/2024\n10.8*\nSeparation Agreement and General Release, by and between Cisco Systems, Inc. and Maria Martinez\n10-Q\n001-39940\n10.2\n5/21/2024\n10.9*\nSeparation Agreement and General Release, by and between Cisco Systems, Inc. and Jeff Sharritts\n8-K\n001-39940\n10.1\n7/19/2024\n19.1\nInsider Trading Policy\n10-K\n001-39940\n19.1\n9/5/2024\n21.1\nSubsidiaries of the Registrant\nX\n23.1\nConsent of Independent Registered Public Accounting Firm\nX\n24.1\nPower of Attorney (included on page 107 of this Annual Report on Form 10-K)\nX\n31.1\nRule 13a–14(a)/15d–14(a) Certification of Principal Executive Officer\nX\n31.2\nRule 13a–14(a)/15d–14(a) Certification of Principal Financial Officer\nX\n32.1\nSection 1350 Certification of Principal Executive Officer\nX\n32.2\nSection 1350 Certification of Principal Financial Officer\nX\n97.1\nCompensation Recovery Policy\n10-K\n001-39940\n97.1\n9/5/2024\n101.INS\nInline XBRL Instance Document\nX\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\nX\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\nX\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\nX\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\nX\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nX\n104\nCover Page Interactive Data File (Embedded within the Inline XBRL document and included in Exhibit 101)\nX\n105\nTable of Contents\n†\nCertain of the exhibits and schedules to this Exhibit have been omitted in accordance with Regulation S-K Item 601(a)(5). Cisco agrees to furnish a copy of all omitted exhibits and schedules to the SEC upon its request.\n*\nIndicates a management contract or compensatory plan or arrangement.\n \nItem 16.\nForm 10-K Summary\nNone.\n106\nTable of Contents\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this Report on Form 10-K to be signed on its behalf by the undersigned, thereunto duly authorized.\n \nSeptember 3, 2025\n \n \nCISCO SYSTEMS, INC.\n \n \n \n/S/ \nC\nHARLES \nH\n. \nR\nOBBINS\n \n \nCharles H. Robbins\n \n \nChair and Chief Executive Officer\nPOWER OF ATTORNEY\nKNOW ALL PERSONS BY THESE PRESENTS, that each person whose signature appears below constitutes and appoints Charles H. Robbins and Mark Patterson, jointly and severally, his attorney-in-fact, each with the full power of substitution, for such person, in any and all capacities, to sign any and all amendments to this Annual Report on Form 10-K, and to file the same, with all exhibits thereto and other documents in connection therewith, with the Securities and Exchange Commission, granting unto said attorney-in-fact and agent full power and authority to do and perform each and every act and thing requisite and necessary to be done in connection therewith, as fully to all intents and purposes as he might do or could do in person hereby ratifying and confirming all that each of said attorneys-in-fact and agents, or his substitute, may do or cause to be done by virtue hereof.\nPursuant to the requirements of the Securities Exchange Act of 1934, this Report on Form 10-K has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\n \nSignature\nTitle\nDate\n/S/ \nC\nHARLES \nH\n. \nR\nOBBINS\nChair and Chief Executive Officer\nSeptember 3, 2025\nCharles H. Robbins\n(Principal Executive Officer)\n/S/ \nMARK PATTERSON\nExecutive Vice President and Chief Financial Officer\nSeptember 3, 2025\nMark Patterson\n(Principal Financial Officer)\n/S/ \nM\n. \nV\nICTORIA \nW\nONG\nSenior Vice President and Chief Accounting Officer\nSeptember 3, 2025\nM. Victoria Wong\n(Principal Accounting Officer)\n107\nTable of Contents\nSignature\nTitle\nDate\n/S/ \nW\nESLEY \nG\n. \nB\nUSH\nDirector\nSeptember 3, 2025\nWesley G. Bush\n/S/ \nM\nICHAEL \nD\n. \nC\nAPELLAS\nLead Independent Director\nSeptember 3, 2025\nMichael D. Capellas\n/S/ \nM\nARK\n G\nARRETT\nDirector\nSeptember 3, 2025\nMark Garrett\n/S/\n J\nOHN\n D. H\nARRIS\n II\nDirector\nSeptember 3, 2025\nJohn D. Harris II\n/S/\n K\nRISTINA \nM\n. \nJ\nOHNSON\nDirector\nSeptember 3, 2025\nDr. Kristina M. Johnson\n/S/ \nS\nARAH\n R\nAE\n M\nURPHY\nDirector\nSeptember 3, 2025\nSarah Rae Murphy\n/S/ \nD\nANIEL \nH\n. \nS\nCHULMAN\nDirector\nSeptember 3, 2025\nDaniel H. Schulman\n/S/ \nM\nARIANNA\n T\nESSEL\nDirector\nSeptember 3, 2025\nMarianna Tessel\nDirector\nKevin Weil\n108"
  }
}