{
  "ticker": "CSX",
  "cik": "0000277948",
  "company_name": "CSX CORP",
  "filing_date": "2025-02-27",
  "accession": "0000277948-25-000008",
  "primary_doc": "csx-20241231.htm",
  "item_sections": {
    "item1": "Item 1.  Business\nCSX Corporation, together with its subsidiaries (\"CSX\" or the “Company”), based in Jacksonville, Florida, is one of the nation's leading transportation companies. The Company provides rail-based freight transportation services including traditional rail service, the transport of intermodal containers and trailers, as well as other transportation services such as rail-to-truck transfers and bulk commodity operations. CSX and the rail industry provide customers with access to an expansive and interconnected transportation network that plays a key role in North American commerce and is critical to the long-term economic success and improved global competitiveness of the United States. In addition, freight railroads provide the most economical and environmentally efficient means to transport goods over land. \nCSX Transportation, Inc.\nCSX’s principal operating subsidiary, CSX Transportation, Inc. (“CSXT”), provides an important link to the transportation supply chain through its approximately 20,000 route-mile rail network and serves major population centers in 26 states east of the Mississippi River, the District of Columbia and the Canadian provinces of Ontario and Quebec. It has access to over 70 ocean, river and lake port terminals along the Atlantic and Gulf Coasts, the Mississippi River, the Great Lakes and the St. Lawrence Seaway. This access allows the Company to meet the dynamic transportation needs of manufacturers, industrial producers, the automotive industry, construction companies, farmers and feed mills, wholesalers and retailers, and energy producers. The Company’s intermodal business links customers to railroads via trucks and terminals. CSXT also serves thousands of production and distribution facilities through track connections with other Class I railroads and more than 240 short-line and regional railroads. On June 1, 2022, CSX completed its acquisition of Pan Am Systems, Inc. (“Pan Am”), which is the parent company of Pan Am Railways, Inc. This acquisition expanded CSXT’s reach in the Northeastern United States. For further details, refer to Note 17, \nBusiness Combinations.\nCSXT is also responsible for the Company's real estate sales, leasing, acquisition and management and development activities. Substantially all of these activities are focused on supporting railroad operations.\nOther Entities\nIn addition to CSXT, the Company’s subsidiaries include Quality Carriers, Inc. (\"Quality Carriers\"), CSX Intermodal Terminals, Inc. (“CSX Intermodal Terminals”), Total Distribution Services, Inc. (“TDSI”), TRANSFLO Terminal Services, Inc. (“TRANSFLO”), CSX Technology, Inc. (“CSX Technology”) and other subsidiaries. Quality Carriers is the largest provider of bulk liquid chemicals truck transportation in North America. CSX Intermodal Terminals owns and operates a system of intermodal terminals, predominantly in the eastern United States, and also provides drayage services (the pickup and delivery of intermodal shipments) for certain customers. TDSI serves the automotive industry with distribution centers and storage locations. TRANSFLO connects non-rail served customers to the many benefits of rail by transferring products from rail to trucks. The biggest TRANSFLO markets are chemicals and agriculture, which includes shipments of plastics and ethanol. CSX Technology and other subsidiaries provide support services for the Company.\nOperating Model\nThe Company is focused on developing and strictly maintaining a scheduled service plan with an emphasis on improving customer service, optimizing assets and increasing employee engagement. When this operating model is executed effectively, the Company competes for an increased share of the U.S. freight market. Further, this model leads to reduced costs and strong free cash flow generation. \nCSX 2024 Form 10-K p.3\nCSX CORPORATION\nPART I\nLines of Business\nDuring 2024, the Company's services generated $14.5 billion of revenue and served four primary lines of business: merchandise, intermodal, coal and trucking.\n•\nThe merchandise business shipped 2.6 million\n \ncarloads (42% of volume) and generated $8.9 billion in revenue (61% of revenue) in 2024. The Company’s merchandise business is comprised of shipments in the following diverse markets: chemicals, agricultural and food products, automotive, minerals, forest products, metals and equipment, and fertilizers.\n•\nThe intermodal business shipped 2.9 million units (46% of volume) and generated $2.0 billion in revenue (14% of revenue) in 2024. The intermodal business combines the superior economics of rail transportation with the flexibility of trucks and offers a cost and environmental advantage over long-haul trucking. Through a network of approximately 30 terminals, the intermodal business serves all major markets east of the Mississippi River and transports mainly manufactured consumer goods in containers, providing customers with truck-like service for longer shipments.\n•\nThe coal business shipped 736 thousand carloads (12% of volume) and generated $2.2 billion in revenue (15% of revenue) in 2024. The Company transports domestic coal, coke and iron ore to electricity-generating power plants, steel manufacturers and industrial plants as well as export coal to deep-water port facilities. Most of the export coal the Company transports is used for steelmaking, while the majority of domestic coal the Company ships is used for electricity generation.\n•\nThe trucking business generated $844 million, or 6%, of revenue in 2024. Trucking revenue includes revenue from the operations of Quality Carriers.\nOther revenue accounted for 4% of the Company’s total revenue in 2024. This category includes revenue from regional subsidiary railroads and incidental charges, including intermodal storage and equipment usage, demurrage and switching. Revenue from regional subsidiary railroads includes shipments by railroads that the Company does not directly operate. Intermodal storage represents charges for customer storage of containers at an intermodal terminal, ramp facility or offsite location beyond a specified period of time. Demurrage represents charges assessed when freight cars are held by a customer beyond a specified period of time. Switching represents charges assessed when a railroad switches cars for a customer or another railroad. \nCSX's Committed Workforce\nMost of the Company’s employees provide or support transportation services. The Company had more than 23,500 employees as of December 2024, which includes approximately 17,500 employees that are members of a rail labor union. There are 12 rail unions at CSX that participate in national bargaining. As of December 2, 2022, all of these rail unions were covered by national agreements with the Class I railroads and CSX-specific agreements that remained in effect through December 31, 2024. Collective agreements under the Railway Labor Act do not expire, but continue until amended. Prior to the 2022 agreements becoming amendable, CSX worked with several major rail unions on new five-year labor agreements. As of the date of this filing, new labor agreements have been fully ratified by seven unions representing approximately 40% of the Company's unionized workforce.\nCSX prioritizes workplace safety for employees and is committed to continued improvement through enhanced processes, training, technology, communication, and continuous collaboration with customers and peers across the railroad industry. Training programs and processes are focused on injury and accident prevention as well as emergency preparedness. Additionally, the attainment of key safety targets is a component of management's annual incentive program. The FRA Personal Injury Frequency Index, a measure of the number of FRA-reportable injuries per 200,000 man-hours, was 1.19 in 2024 and 0.94 in 2023.\nCSX 2024 Form 10-K p.4\nCSX CORPORATION\nPART I\nThe Compensation and Talent Management Committee of the Board of Directors is charged with oversight of CSX's workforce. The Company is committed to developing a culture that promotes workforce diversity and inclusion and encourages ethical behavior. As of December 31, 2024, approximately 22% of CSX's overall workforce and 35% of management was diverse, calculated as the percentage of males of color and all females. In 2024, CSX was recognized as a “Best Place to Work for Disability Inclusion” by Disability:IN and the American Association of People with Disabilities for a sixth consecutive year after receiving a top score on their disability equality index. The CSX Code of Ethics serves as a guiding standard for ethical behavior and covers many types of matters, including discrimination and harassment as well as safety. Annually, all management employees are required, and union employees are highly encouraged, to complete ethics training.\nCompany History\nA leader in freight rail transportation for nearly 200 years, the Company’s heritage dates back to the early nineteenth century when The Baltimore and Ohio Railroad Company (“B&O”), the nation’s first common carrier, was chartered in 1827. Since that time, the Company has built on this foundation to create a railroad that could safely and reliably service the ever-increasing demands of a growing nation. Since its founding, numerous railroads have combined with the former B&O through merger and consolidation to create what has become CSX. Each of the railroads that combined into the CSX family brought new geographical reach to valuable markets, gateways, cities, ports and transportation corridors.\nCSX Corporation was incorporated in 1978 under Virginia law. In 1980, the Company completed the merger of the Chessie System and Seaboard Coast Line Industries into CSX. The merger allowed the Company to connect northern population centers and Appalachian coal fields to growing southeastern markets. Later, the Company’s acquisition of key portions of Conrail, Inc. (\"Conrail\") allowed CSXT to link the northeast, including New England and the New York metropolitan area, with Chicago and midwestern markets as well as the growing areas in the Southeast already served by CSXT. This current rail network, which now includes the network acquired from Pan Am, allows the Company to directly serve every major market in the eastern United States with safe, dependable, environmentally responsible and fuel efficient freight transportation and intermodal service.\nCompetition\nThe business environment in which the Company operates is highly competitive. Shippers typically select transportation providers that offer the most compelling combination of service and price. Service requirements, both in terms of transit time and reliability, vary by shipper and commodity. As a result, the Company’s primary competition varies by commodity, geographic location and mode of available transportation and includes other railroads, motor carriers that operate similar routes across its service area and, to a less significant extent, barges, ships and pipelines. \nCSXT’s primary rail competitor is Norfolk Southern Railway, which operates throughout much of the Company’s territory. Other railroads also operate in parts of the Company’s territory. Depending on the specific market, competing railroads and deregulated motor carriers may exert pressure on price and service levels. For further discussion on the risk of competition to the Company, see",
    "item1a": "Item 1A. \nRisk Factors\n. \nIn light of the numerous cybersecurity risks that CSX faces, it is reasonably likely that any of the related risks, individually or collectively, if significant, could materially affect the Company’s operations, including but not limited to service interruption, train accident or derailment, misappropriation of confidential or proprietary information (including personal information), process failure, or other operational difficulties.\nCybersecurity Governance\nThe cybersecurity program and related risks at CSX are managed by the \nVP Technology and CISO\n. \nThe Company's CISO is a Certified Information Systems Auditor with over 30 years of industry experience including information security leadership positions at multiple publicly-traded companies.\n The CISO is supported by a team that includes the SOC, which consists of the Deputy Chief Information Security Officer (\"Deputy CISO\") and other cybersecurity professionals as well as a team of third-party contractors. The Deputy CISO has over 20 years of industry experience including federal cyber law enforcement.\nThe CISO is notified of cybersecurity events as needed based on the Company’s processes for addressing cybersecurity incidents and threats.  The SOC, with the assistance of outside third-parties as needed, analyzes, evaluates and remediates cybersecurity incidents and provides investigative information to the CISO. Depending on the significance of any specific cybersecurity incident or threat, and/or relation to prior incidents, the CISO will escalate relevant information, as appropriate, and the Company’s legal and accounting groups, with assistance from other company departments and third parties, will assist in assessing potential SEC disclosure obligations. The CISO coordinates disclosure to other agencies, when necessary, including requirements under the Transportation Security Administration directives.\nMore significant cybersecurity incidents or threats may result in notifications to senior leadership and, if necessary, to the Audit Committee and the Board of Directors. Additionally, a cybersecurity governance briefing takes place quarterly with leaders from the Company's technology, operations, commercial, legal, and accounting departments to discuss cybersecurity risks, threats, and incidents, including updates from the SOC and an assessment of ways to mitigate and remediate any threats or incidents the Company may be facing. \nThe Company's Audit Committee of the \nBoard of Directors\n oversees the Company's cybersecurity risk, mitigation strategies and overall resiliency of the Company’s technology infrastructure. Such risk is managed as part of the Company’s overall risk management and business continuity processes and is included in the ERM program, which is also overseen by the Audit Committee. The Audit Committee periodically reviews assessments of information security controls and procedures, any incidents that could have a potentially significant impact on the company’s network, as well as potential cybersecurity risk disclosures. The Company's senior leadership team briefs the Audit Committee and Board of Directors at least annually on information technology and cybersecurity matters, including more frequent updates as circumstances warrant. Such annual updates include significant findings or updates by internal or external evaluations. The Audit Committee is apprised annually on emerging risks to the Company, including education on cybersecurity-related matters as needed. CSX has a cybersecurity expert on the Board and its Audit Committee to provide expanded oversight of the Company’s cybersecurity and technology systems.\nCSX 2024 Form 10-K p.15\nCSX CORPORATION\nPART I",
    "item1b": "Item 1B.  Unresolved Staff Comments\nNone\nCSX 2024 Form 10-K p.13\nCSX CORPORATION\nPART I",
    "item1c": "Item 1C.  Cybersecurity\nCybersecurity Risk Management and Strategy\nStrong performance and reliability of the Company's technology systems are critical to operating safely and effectively, and protecting personal and customer data is essential to maintaining stakeholder trust. \nThe Company has implemented processes designed to assess, identify, and manage material cybersecurity risks, as described further below.\n CSX maintains a cybersecurity framework that is integrated across the organization through people, processes and technology to help protect the personal information of its customers, its contractors and its suppliers as well as protect the integrity of its own operations. Cybersecurity is also integrated into the Company’s Enterprise Risk Management (“ERM”) program.\n The Company equips CSX systems with various cybersecurity tools, conducts vulnerability scans and provides critical cybersecurity information to application users, as appropriate. The Company also takes proactive measures to advise CSX employees of how they can assist the Company in its cybersecurity practices. CSX informs employees on cybersecurity best practices, including how to identify cyber-related suspicious activity, how to report such activity and, as appropriate, proactive measures employees can take to safeguard company information and devices. The Company also provides cybersecurity awareness training to employees and conducts cybersecurity testing exercises to help maintain cybersecurity vigilance. With the assistance of third-party consultants, the Company conducts an annual cybersecurity exercise, which is often a \"tabletop\" scenario involving a cross-functional group responding to a hypothetical cybersecurity threat. \nThe Company considers its material cybersecurity-related risks, as described in more detail below and at"
  }
}