{
  "ticker": "CTSH",
  "cik": "0001058290",
  "company_name": "COGNIZANT TECHNOLOGY SOLUTIONS CORP",
  "filing_date": "2025-02-12",
  "accession": "0001058290-25-000017",
  "primary_doc": "ctsh-20241231.htm",
  "item_sections": {
    "item1": "Item 1. Business\n for information on our strategic approach.\nWe continue to expect the focus of our clients to be on their transformation into AI-ready, technology-driven, data-enabled, customer-centric and differentiated businesses. To support this transformation and drive greater business resiliency, we expect clients will continue to \ndemand services and solutions that can enhance productivity and deliver cost savings. \nWe believe clients will continue to contend with industry-specific changes driven by evolving digital technologies, uncertainty in the regulatory environment, industry consolidation and convergence as well as international trade policie\ns and other macroeconomic and geopolitical factors, including the uncertainty related to the global economy, which has affected and may continue to affect their demand for our services. \nWe increasingly use AI-based technologies, including GenAI, in our client offerings and our own internal operations. AI technologies and services are part of a highly competitive and rapidly evolving market. We plan to make significant investments in our AI capabilities to meet the needs of our clients and harness AI's value in a flexible, secure, scalable and responsible way. As AI-based technologies or other forms of automation evolve, we expect that demand for some services that we currently perform for our clients may be reduced and our ability to obtain favorable pricing or other terms for our services may be diminished.\nPotential tax law and other regulatory changes, including possible U.S. corporate income tax reform and the Code on Social Security, 2020 in India, among other items, may impact our future results. \nWe expect that the Code on Social Security, 2020, if enacted as currently written, could result in a material one-time increase to our post-employment liability for past service and would also modestly increase our costs for employment and post-employment benefits prospectively.\n In addition, in March 2024, India and Mauritius signed a Protocol to amend the India-Mauritius Income Tax Treaty. We are currently evaluating the potential impact of the amendment, which, depending on its final terms when entered into force, could increase our effective income tax rate, as CTS India is a subsidiary of our wholly-owned Mauritius entity. For additional information, see \nPart I,",
    "item1a": "Item 1A. Risk Factors.\nDuring the third quarter of 2024, we completed the acquisition of Belcan. See \nNote 3\n to our consolidated financial statements. This acquisition is expected to have a modest near-term dilutive impact to our 2025 operating margin, primarily due to integration-related expenses and amortization of acquired intangibles.\n2\n Adjusted Operating Margin is not a measurement of financial performance prepared in accordance with GAAP. See “Non-GAAP Financial Measures” for more information and reconciliations to the most directly comparable GAAP financial measures.\nCognizant\n29\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nResults of Operations\nFor a discussion of our results of operations for the year ended December 31, 2022, including a year-to-year comparison between 2023 and 2022, refer to Part II, Item 7, \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in our Annual Report Form 10-K for the year ended December 31, 2023.\nThe Year Ended December 31, 2024 Compared to The Year Ended December 31, 2023\n \nThe following table sets forth certain financial data for the years ended December 31:\n% of\n% of\nIncrease / Decrease\n(Dollars in millions, except per share data)\n2024\nRevenues\n2023\nRevenues\n$\n%\nRevenues\n$\n19,736 \n100.0\n$\n19,353 \n100.0\n$\n383 \n2.0 \nCost of revenues\n(a)\n12,958 \n65.7\n12,664 \n65.4\n294 \n2.3 \nSelling, general and administrative expenses\n(a)\n3,223 \n16.3\n3,252 \n16.8\n(29)\n(0.9)\nRestructuring charges\n134 \n0.7\n229 \n1.2\n(95)\n(41.5)\nDepreciation and amortization expense\n529 \n2.7\n519 \n2.7\n10 \n1.9 \nIncome from operations and operating margin\n2,892 \n14.7\n2,689 \n13.9\n203 \n7.5 \nOther income (expense), net\n46 \n98 \n(52)\n(53.1)\nIncome before provision for income taxes\n2,938 \n14.9\n2,787 \n14.4\n151 \n5.4 \nProvision for income taxes\n(713)\n(668)\n(45)\n6.7 \nIncome (loss) from equity method investments\n15 \n7 \n8 \n114.3 \nNet income\n$\n2,240 \n11.3\n$\n2,126 \n11.0\n$\n114 \n5.4 \nDiluted EPS\n$\n4.51 \n$\n4.21 \n$\n0.30 \n7.1 \nOther Financial Information\n \n3\nAdjusted Income From Operations and Adjusted Operating Margin\n$\n3,026 \n15.3\n$\n2,918 \n15.1\n$\n108 \n3.7 \nAdjusted Diluted EPS\n$\n4.75 \n$\n4.55 \n$\n0.20 \n4.4 \n(a)    Exclusive of depreciation and amortization expense\n3\n3\n Adjusted Income from Operations, Adjusted Operating Margin and Adjusted Diluted EPS are not measures of financial performance prepared in accordance with GAAP. See “Non-GAAP Financial Measures” for more information and reconciliations to the most directly comparable GAAP financial measures, as applicable.\nCognizant\n30\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nRevenues - Reportable Business Segments and Geographic Markets\nRevenues of $19,736 million across our business segments and geographies were as follows for the year ended December 31, 2024:\n2024 as compared to 2023\nIncrease / (Decrease)\n(Dollars in millions)\n$\n%\nCC %\n4\nHealth Sciences\n$\n258 \n4.5 \n4.5 \nFinancial Services\n(56)\n(1.0)\n(1.1)\nProducts and Resources\n154 \n3.3 \n3.2 \nCMT\n27 \n0.8 \n0.5 \nTotal revenues\n$\n383 \n2.0 \n1.9 \n2024 as compared to 2023\nIncrease / (Decrease)\n(Dollars in millions)\n$\n%\nCC %\n4\nNorth America\n$\n435 \n3.0 \n3.1 \nUnited Kingdom\n(58)\n(3.1)\n(5.1)\nContinental Europe\n23 \n1.2 \n0.9 \nEurope - Total\n(35)\n(0.9)\n(2.1)\nRest of World\n(17)\n(1.3)\n— \nTotal revenues\n$\n383 \n2.0 \n1.9 \nChange in revenues was driven by the following factors:\n•\nNorth America revenues, particularly in the Health Sciences segment, were positively impacted by the ramp up of several recently won large deals;\n•\nRecently completed acquisitions contributed 200 basis points of growth to the overall change in revenues, including approximately 600 basis points of growth to our Products and Resources segment (primarily in North America) and approximately 150 basis points of growth to our Communications, Media and Technology segment (primarily in North America);\n•\nThe resale of third-party products, primarily in North America, in connection with our integrated offerings strategy, contributed 70 basis points of growth to the overall change in revenue;\n•\nReduced demand for discretionary work negatively impacted revenues across all segments. Clients in our Financial Services, Products and Resources, and Communications, Media and Technology segments were particularly affected;\n•\nRevenue decline in our United Kingdom region was primarily driven by weakness in the Communications, Media and Technology and Financial Services segments; and\n•\nRevenue decline in our Rest of World region was primarily driven by weakness in the Products and Resources and Financial Services segments.\n4\n Constant currency revenue growth is not a measure of financial performance prepared in accordance with GAAP. See “Non-GAAP Financial Measures” for more information.\nCognizant\n31\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nCost of Revenues (Exclusive of Depreciation and Amortization Expense)\né\n \n$294M\né\n0.3% as a % of revenues\n¡\n \n% of Revenues\nOur cost of revenues consists primarily of salaries, incentive-based compensation, stock-based compensation expense, employee benefits, project-related immigration and travel for technical personnel, subcontracting and costs of third-party products and services relating to revenues. The increase, as a percentage of revenues, was due to higher compensation costs, primarily as a result of a merit increase cycle, and the resale of third-party products in connection with our integrated offerings strategy, partially offset by the beneficial impact of foreign currency exchange rate movements and operational efficiencies.\nSG&A Expenses (Exclusive of Depreciation and Amortization Expense)\nSG&A expenses consist primarily of salaries, incentive-based compensation, stock-based compensation expense, employee benefits, immigration, travel, marketing, communications, management, finance, administrative and occupancy costs. The decrease, as a percentage of revenues, was primarily driven by the net savings generated from our NextGen program, partially offset by the impact of recently completed acquisitions, primarily as a result of transaction and integration related expenses.\nê\n$29M\nê\n0.5% as a % of revenues\n¡\n \n% of Revenues\nRestructuring Charges\nRestructuring charges consist of costs related to the NextGen program. Restructuring charges were $134 million or 0.7%, as a percentage of revenues for the year ended December 31, 2024, as compared to $229 million or 1.2%, as a percentage of revenue, for the year ended December 31, 2023. For further detail on our restructuring charges see \nNote 4\n to our consolidated financial statements.\nDepreciation and Amortization Expense\nDepreciation and amortization expense increased by 1.9%, and was flat as a percentage of revenues, in 2024 as compared to 2023. The increase in amortization expense driven by intangible assets related to our recently completed acquisitions was partially offset by the decline of depreciation expense, which was driven by actions taken under our NextGen program.\nOperating Margin and Adjusted Operating Margin\n5\n - Overall\nThe increase in our 2024 GAAP operating margin and Adjusted Operating Margin\n5\n was primarily driven by net savings generated from our NextGen program and the beneficial impact of foreign currency exchange rate movements, partially offset by increased compensation costs, primarily as a result of a merit increase cycle, and the dilutive impact of recently completed acquisitions, primarily as a result of transaction and integration related expenses and amortization of acquired intangibles. In addition, our 2024 and 2023 GAAP operating margins were negatively impacted by the NextGen charges, as discussed in \nNote 4\n to our consolidated financial statements, which were excluded from our Adjusted Operating Margin\n5\n.\n \n5\n Adjusted Income From Operations and Adjusted Operating Margin are not measurements of financial performance prepared in accordance with GAAP. See “Non-GAAP Financial Measures” for more information and reconciliations to the most directly comparable GAAP financial measures, as applicable.\nCognizant\n32\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nA predominant portion of our costs in India are denominated in the Indian rupee, representing approximately 24% of our global operating costs during \nthe year ended \nDecember 31, 2024\n.\n These costs are subject to foreign currency exchange rate fluctuations, which have an impact on our results of operations. We enter into foreign exchange derivative contracts to hedge certain Indian rupee denominated payments in India. These hedges are intended to mitigate the volatility of the changes in the exchange rate between the U.S. dollar and the Indian rupee. Including the impact of the hedges, the depreciation of the Indian rupee positively impacted our operating margin for the year ended December 31, 2024 by 44 basis points as compared to the year ended December 31, 2023.\nExcluding the impact of applicable designated cash flow hedges, the depreciation of the Indian rupee against the U.S. dollar positively impacted our operating margin by approximately 25 basis points in 2024. Each additional 1.0% change in exchange rate between the Indian rupee and the U.S. dollar will have the effect of moving our operating margin by approximately 18 basis points (excluding the impact of our cash flow hedges). In 2024, the settlement of our cash flow hedges positively impacted our operating margin by approximately 6 basis points, compared to a negative impact of 13 basis points in 2023. \nSegment Operating Profit\nSegment operating profit and operating margin percentage were as follows:\nSegment operating profit\n%\nSegment operating margin\nIn 2024, segment operating margins across all our segments were negatively impacted by increased compensation costs, partially offset by savings generated from our NextGen program and the beneficial impact of foreign currency exchange rate movements. Segment operating profit in the Health Sciences and Communications, Media and Technology segments was negatively impacted by resales of third-party products in connection with our integrated offerings strategy and higher costs typical to the initial phases of several recently won large deals. Segment operating profit in the Products and Resources segment was negatively impacted by the dilutive impact of the Belcan acquisition. Segment operating profit in the Financial Services segment was positively impacted by reduced resales of third-party products in connection with our integrated offerings strategy.\nTotal segment operating profit was as follows for the year ended December 31:\n(Dollars in millions)\n2024\n% of Revenues\n2023\n% of Revenues\nIncrease / (Decrease)\nTotal segment operating profit\n$\n4,156 \n21.1 \n$\n4,117 \n21.3 \n$\n39 \nLess: unallocated costs\n1,264 \n6.4 \n1,428 \n7.4 \n(164)\nIncome from operations\n$\n2,892 \n14.7 \n$\n2,689 \n13.9 \n$\n203 \nThe decrease in unallocated costs for 2024 as compared to 2023 was primarily driven by lower corporate expenses as well as lower NextGen charges of $134 million in 2024 as compared to $229 million in 2023 (see \nNote 4\n to our consolidated financial statements).\nCognizant\n33\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nOther Income (Expense), Net\nTotal other income (expense), net consists primarily of foreign currency exchange gains and losses, interest income and interest expense. The following table sets forth total other income (expense), net for the years ended December 31:\n(in millions)\n2024\n2023\nIncrease / Decrease\nForeign currency exchange gains (losses) \n$\n(29)\n$\n42 \n$\n(71)\nGains (losses) on foreign exchange forward contracts not designated as hedging instruments\n10 \n(40)\n50 \nForeign currency exchange gains (losses), net\n(19)\n2 \n(21)\nInterest income\n119 \n126 \n(7)\nInterest expense\n(54)\n(41)\n(13)\nOther, net\n— \n11 \n(11)\nTotal other income (expense), net\n$\n46 \n$\n98 \n$\n(52)\nThe foreign currency exchan\nge losses were attributed to the remeasurement of net monetary assets and liabilities denominated in currencies other than the functional currencies of our subsidiaries. The gains on foreign exchange forward contracts not designated as hedging instruments related to the realized and unrealized gains and losses on cont\nracts entered into to offset our foreign currency exposures. \nAs of December 31, 2024, the notional value of our undesignated hedges was $489 million. Interest income for the year ended December 31, 2024 decreased by $7 million as compared to 2023. While our invested balances decreased during the year ended December 31, 2024, primarily due to the required payment related to the ITD dispute in January 2024 (see \nNote 11\n to our consolidated financial statements) and the Belcan acquisition in August 2024, we benefited from higher interest rates compared to the year ended December 31, 2023. Interest expense for the year ended December 31, 2024 increased by $13 million as compared to 2023 primarily due to the drawdown on our revolving credit facility in connection with the Belcan acquisition.\nProvision for Income Taxes\né\n$45M\n¡\n \nEffective Income Tax Rate\n \né\n \n0.3%\nSee \nNote 11\n to our consolidated financial statements for additional information.\nIn December 2021, the OECD adopted model rules for a global framework to impose a 15% global minimum tax referred to as Pillar Two with a targeted effective date of January 1, 2024. The OECD has continued and is continuing to issue additional guidance on the operation of the model rules. While the United States has not enacted Pillar Two, certain countries in which we operate have adopted their own version of the Pillar Two model rules. Although Management continues to monitor additional guidance from the OECD and countries’ implementation of Pillar Two, based on current guidance, our net income, cash flows, or financial condition has not and will not in the future be materially impacted by Pillar Two.\nNet Income\nThe increase in net income was driven by the increase in income from operations. \né\n$114M\né\n0.3% as a % of revenues\n¡\n \n% of Revenues\nCognizant\n34\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nNon-GAAP Financial Measures\n    \nPortions of our disclosure include non-GAAP financial measures. These non-GAAP financial measures are not based on any comprehensive set of accounting rules or principles and should not be considered a substitute for, or superior to, financial measures calculated in accordance with GAAP, and may be different from non-GAAP financial measures used by other companies. In addition, these non-GAAP financial measures should be read in conjunction with our financial statements prepared in accordance with GAAP. The reconciliations of non-GAAP financial measures to the corresponding GAAP measures set forth below should be carefully evaluated. \nOur non-GAAP financial measures Adjusted Operating Margin and Adjusted Income from Operations exclude unusual items, such as NextGen charges. Our non-GAAP financial measure Adjusted Diluted EPS excludes unusual items, such as NextGen charges, and net non-operating foreign currency exchange gains or losses and the tax impact of all the applicable adjustments. For further detail on the NextGen charges, see \nNote 4\n to our consolidated financial statements. The income tax impact of each item excluded from Adjusted Diluted EPS is calculated by applying the statutory rate and local tax regulations in the jurisdiction in which the item was incurred. Constant currency revenue growth is defined as revenues for a given period restated at the comparative period’s foreign currency exchange rates measured against the comparative period's reported revenues. Free cash flow is defined as cash flows from operating activities net of purchases of property and equipment.\nWe believe providing investors with an operating view consistent with how we manage the Company provides enhanced transparency into our operating results. For internal management reporting and budgeting purposes, we use various GAAP and non-GAAP financial measures for financial and operational decision-making, to evaluate period-to-period comparisons, to determine portions of the compensation for executive officers and for making comparisons of our operating results to those of our competitors. We believe that the presentation of non-GAAP financial measures, which exclude certain costs, read in conjunction with our reported GAAP results and reconciliations to the most comparable GAAP measure, as applicable, can provide useful supplemental information to our management and investors regarding financial and business trends relating to our financial condition and results of operations.\nA limitation of using non-GAAP financial measures versus financial measures calculated in accordance with GAAP is that non-GAAP financial measures may exclude costs that are recurring such as net non-operating foreign currency exchange gains or losses. In addition, other companies may calculate non-GAAP financial measures differently than us, thereby limiting the usefulness of these non-GAAP financial measures as a comparative tool. We compensate for these limitations by providing specific information regarding the GAAP amounts excluded from non-GAAP financial measures to allow investors to evaluate such non-GAAP financial measures.\nThe following table presents a reconciliation of each non-GAAP financial measure to the most comparable GAAP measure, as applicable, for the years ended December 31: \n(Dollars in millions, except per share data)\n2024\n% of\nRevenues\n2023\n% of\nRevenues\nGAAP income from operations and operating margin\n$\n2,892 \n14.7 \n%\n$\n2,689 \n13.9 \n%\nNextGen charges \n(1)\n134 \n0.6 \n229 \n1.2 \nAdjusted Income From Operations and Adjusted Operating Margin\n$\n3,026 \n15.3 \n%\n$\n2,918 \n15.1 \n%\nGAAP diluted EPS\n$\n4.51 \n$\n4.21 \nEffect of NextGen charges, pre-tax\n0.27 \n0.45 \nEffect of non-operating foreign currency exchange losses (gains), pre-tax \n(2)\n0.04 \n— \nTax effect of above adjustments \n(3)\n(0.07)\n(0.11)\nAdjusted Diluted EPS\n$\n4.75 \n$\n4.55 \nNet cash provided by operating activities\n$\n2,124 \n$\n2,330 \nPurchases of property and equipment\n(297)\n(317)\nFree cash flow\n$\n1,827 \n$\n2,013 \n(1)    Consists of employee separation, facility exit and other costs incurred in connection with the NextGen program. See \nNote 4\n to our consolidated financial statements for additional information.\nCognizant\n35\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \n(2)    Non-operating foreign currency exchange gains and losses, inclusive of gains and losses on related foreign exchange forward contracts not designated as hedging instruments for accounting purposes, are reported in \"Foreign currency exchange gains (losses), net\" in our consolidated statements of operations.\n(3)    Presented below are the tax impacts of our non-GAAP adjustments to pre-tax income for the years ended December 31:\n(in millions)\n2024\n2023\nNon-GAAP income tax benefit (expense) related to:\nNextGen charges\n$\n34 \n$\n59 \nForeign currency exchange gains and losses\n(4)\n(6)\nThe effective tax rate related to non-operating foreign currency exchange gains and losses varies depending on the jurisdictions in which such income and expenses are generated and the statutory rates applicable in those jurisdictions. As such, the income tax effect of non-operating foreign currency exchange gains and losses shown in the above table may not appear proportionate to the net pre-tax foreign currency exchange gains and losses reported in our  consolidated statements of operations.\nLiquidity and Capital Resources\nCash generated from operations has historically been our primary source of liquidity to fund operations and investments t\no grow our business. As of December 31, 2024, we had cash, cash equivalents and short-term investments of \n$2,243\n million. Additionally, as of December 31, 2024, we had available capacity under our credit facilities of approximately \n$1.55\n billion. \nThe following table provides a summary of our cash flows for the years ended December 31:\n(in millions)\n2024\n2023\nIncrease / Decrease\nNet cash provided by (used in):\nOperating activities\n$\n2,124 \n$\n2,330 \n$\n(206)\nInvesting activities\n(1,646)\n(331)\n(1,315)\nFinancing activities\n(915)\n(1,609)\n694 \nOther Cash Flow Information\n6\nFree cash flow\n1,827 \n2,013 \n(186)\nOperating activities\n6\nThe decrease in cash provided by operating activities in 2024 compared to 2023 was primarily driven by the $360 million payment made in relation to our dispute with the ITD in January 2024 (see \nNote 11\n to our consolidated financial statements).\nWe monitor turnover, aging and the collection of accounts receivable by client. Our DSO calculation includes receivables, net of allowance for doubtful accounts, and contract assets, reduced by the uncollected portion of deferred revenue. Our DSO was 78 days as of December 31, 2024, 77 days as of December 31, 2023 and 74 days as of December 31, 2022. \nInvesting activities\nThe increase in cash used in investing activities in 2024 compared to 2023 was primarily driven by higher payments for business combinations as well as lower net maturities of investments in 2024.\nFinancing activities\nThe decrease in cash used in financing activities in 2024 compared to 2023 was primarily driven by lower repurchases of common stock and net borrowings under the revolving credit facility to finance the Belcan acquisition.\n We have a Credit Agreement providing for a $650 million Term Loan and a $1,850 million unsecured revolving credit facility, which are each due to mature in October 2027. As of December 31, 2024, we had $300 million outstanding on the revolving credit facility, consisting of a Term Benchmark loan with a maturity of October 2027 and an Interest Period (as defined in the Credit Agreement) of one month. We are required under the Credit Agreement to make scheduled quarterly \n6\n Free cash flow is not a measurement of financial performance prepared in accordance with GAAP. See “Non-GAAP Financial Measures” for more information.\nCognizant\n36\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nprincipal payments on the Term Loan. We believe that we currently meet all conditions set forth in the Credit Agreement to borrow thereunder, and we are not aware of any conditions that would prevent us from borrowing part or all of the remaining available capacity under the revolving credit facility as of December 31, 2024 and through the date of this filing. See \nNote 10\n to our consolidated financial statements. \nCapital Allocation Framework\n \nAcquisitions\nShare repurchases\nDividend payments\nOur capital allocation framework anticipates the deployment of approximately 50% of our free cash flow\n7\n for acquisitions and 50% for share repurchases and dividend payments. \nWe review our capital allocation on an ongoing basis, considering our financial performance and liquidity position, investments required to execute our strategic plans and initiatives, acquisition opportunities, the economic outlook, regulatory changes and other relevant factors. As these factors may change over time, the actual amounts expended on stock repurchase activity, dividends, and acquisitions, if any, during any particular period cannot be predicted and may fluctuate from time to time. \nOther Liquidity and Capital Resources Information \n We seek to ensure that our cash is available in the locations in which it is needed. As part of our ongoing liquidity assessments, we regularly monitor the mix of our domestic and international cash flows and cash balances. We evaluate on an ongoing basis what portion of the non-U.S. cash, cash equivalents and short-term investments is needed locally to execute our strategic plans and what amount is available for repatriation back to the United States\n. \nWe expect operating cash flows, cash and short-term investment balances, together with the available capacity under our revolving credit facilities, to be sufficient to meet our operating requirements, including purchase commitments, tax payments, including the Tax Reform Act transition tax payment, and \nservicing our debt for the next twelve months. \nOur remaining Tax Reform Act transition tax payment of $157 million is due in the second quarter of 2025. In 2024, our Tax Reform Act transition tax payment was $123 million. Additionally, we have purchase commitments of approximately $1.1 billion that will be paid over the next four years, of which approximately $440 million will be paid during the next twelve months. In a\nddition, see \nNote 7\n to our consolidated financial statements for a description of our operating lease obligations.\n The ability to expand and grow our business in accordance with current plans, make acquisitions, meet long-term capital requirements beyond a twelve-month period and execute our capital return plan will depend on many factors, including the rate, if any, at which cash flow increases, our ability and willingness to pay for acquisitions with capital stock and the availability of public and private debt, including the ability to extend the maturity of or refinance our existing debt, and equity financing. We cannot be certain that additional financing, if required, will be available on terms and conditions acceptable to us, if at all.\nCritical Accounting Estimates\nManagement’s discussion and analysis of our financial condition and results of operations is based on our accompanying consolidated financial statements that have been prepared in accordance with GAAP. We base our estimates on historical experience, current trends and on various other assumptions that are believed to be relevant at the time our consolidated financial statements are prepared. We evaluate our estimates on a continuous basis. However, the actual amounts may differ from the estimates used in the preparation of our consolidated financial statements. \nWe believe the following accounting estimates are the most critical to aid in fully understanding and evaluating our consolidated financial statements as they require the most difficult, subjective or complex judgments, resulting from the need to make estimates about the effect of matters that are inherently uncertain. Changes to these estimates could have a material effect on our results of operations and financial condition. Our significant accounting policies are described in \nNote 1\n to our consolidated financial statements.\nRevenue Recognition\n. Revenues related to fixed-price contracts for application development and systems integration services, consulting or other technology services are recognized as the service is performed using the cost-to-cost method, \n7\n Free cash flow is not a measurement of financial performance prepared in accordance with GAAP. See “Non-GAAP Financial Measures” for more information.\nCognizant\n37\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nunder which the total value of revenues is recognized on the basis of the percentage that each contract’s total labor cost to-date bears to the total expected labor costs. Revenues related to fixed-price application maintenance, quality engineering and assurance and business process services are recognized using the cost-to-cost method, if the right to invoice is not representative of the value being delivered. The cost-to-cost method requires estimation of future costs, which is updated as the project progresses to reflect the latest available information. Such estimates and changes in estimates involve the use of judgment. The cumulative impact of any change in estimates is reflected in the financial reporting period in which the change in estimate becomes known. Net changes in estimates of such future costs were immaterial to the consolidated results of operations for the periods presented.\nIncome Taxes.\n Determining the consolidated provision for income taxes, deferred income tax assets (and related valuation allowance, if any) and liabilities requires significant judgment. We are required to calculate and provide for income taxes in each of the jurisdictions where we operate. Changes in the geographic mix of income before taxes or estimated level of annual pre-tax income can affect our overall effective income tax rate. In addition, transactions between our affiliated entities are arranged in accordance with applicable transfer pricing laws, regulations and relevant guidelines. As a result, and due to the interpretive nature of certain aspects of these laws and guidelines, we have pending applications for APAs before the taxing authorities in some of our most significant jurisdictions. It could take years for the relevant taxing authorities to negotiate and conclude these applications. The consolidated provision for income taxes may change period to period based on changes in facts and circumstances, such as settlements of income tax audits, the expiration of the applicable statute of limitations or finalization of our applications for APAs.\nOur provision for income taxes also includes the impact of reserves established for uncertain income tax positions, as well as the related interest, which may require us to apply judgment to complex issues and may require an extended period of time to resolve. We apply a “more likely than not” threshold when assessing the need for a reserve for an uncertain tax position, which involves significant judgment. Although we believe we have adequately reserved for our uncertain tax positions, no assurance can be given that the final outcome of these matters will not differ from our recorded amounts. We adjust these reserves in light of changing facts and circumstances, such as the closing of a tax audit or the expiration of the applicable statute of limitations. Additionally, we have tax positions that we believe are more likely than not to be realized and for which we have therefore not established a reserve. To the extent that the final outcome of these matters differs from the amounts recorded, such differences may materially impact, positively or negatively, the provision for income taxes in the period in which such determination is made.\nBusiness Combinations, Goodwill and Intangible Assets\n. Goodwill and intangible assets, including indefinite-lived intangible assets, arise from the accounting for business combinations. We account for business combinations using the acquisition method which requires us to estimate the fair value of identifiable assets acquired, liabilities assumed, including any contingent consideration, and any noncontrolling interest in the acquiree to properly allocate purchase price to the individual assets acquired and liabilities assumed. The allocation of the purchase price utilizes estimates and assumptions\n in determining the fair values of identifiable assets acquired and liabilities assumed, especially with respect to intangible assets, including the timing and amount of forecasted revenues and cash flows, anticipated growth rates, client attrition rates and the discount rate reflecting the risk inherent in future cash flows.\nAt each acquisition date, we allocate goodwill and intangible assets to our reporting units based on how we expect each reporting unit to benefit from the respective business combination. Our seven industry-based operating segments are our reporting units. We exercise judgment to allocate goodwill to the reporting units expected to benefit from each business combination. Goodwill is tested for impairment at the reporting unit level on an annual basis and between annual tests if an event occurs or circumstances change that would more likely than not reduce the fair value of a reporting unit below its carrying value. These events or circumstances could include a significant change in the business climate, regulatory environment, established business plans, operating performance indicators or competition. Evaluation of goodwill for impairment requires judgment, including the identification of reporting units, assignment of assets, liabilities and goodwill to reporting units and determination of the fair value of each reporting unit. \nWe estimate the fair value of our reporting units using a combination of an income approach, utilizing a discounted cash flow analysis, and a market approach, using market multiples. Under the income approach, we estimate projected future cash flows, the timing of such cash flows and long-term growth rates and determine the appropriate discount rate that reflects the risk inherent in the projected future cash flows. The discount rate used is based on a market participant weighted-average cost of capital and may be adjusted for the relevant risk associated with business-specific characteristics and the uncertainty related to the reporting unit’s ability to execute on the projected future cash flows. Under the market approach, we estimate fair value based on market multiples of revenues and earnings derived from comparable publicly-traded companies with characteristics similar to the reporting unit. The estimates used to calculate the fair value of a reporting unit change from year to year based on operating results, market conditions and other factors. Changes in these estimates and assumptions could materially affect the determination of fair value for each reporting unit. \nCognizant\n38\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nBased on our most recent evaluation of goodwill performed during the fourth quarter of 2024, we concluded that the goodwill in each of our reporting units was not at risk of impairment. As of December 31, 2024, our goodwill balance was $6,953 million. \nWe review our finite-lived assets, including our finite-lived intangible assets, for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset group may not be recoverable. The carrying amount may not be recoverable when the sum of undiscounted expected future cash flows is less than the carrying amount of such asset groups. The impairment loss is determined as the amount by which the carrying amount of the asset group exceeds its fair value. Assessing the fair value of asset groups involves significant estimates and assumptions including estimation of future cash flows, the timing of such cash flows and discount rates reflecting the risk inherent in future cash flows. \nRecently Adopted and New Accounting Pronouncements\nSee \nNote 1\n to our consolidated financial statements for additional information.\nItem 7A. Quantitative and Qualitative Disclosures about Market Risk\nForeign Currency Risk\nWe are exposed to foreign currency exchange rate risk in the ordinary course of doing business as we transact or hold a portion of our funds in foreign currencies. Accordingly, we periodically evaluate the need for hedging strategies, including the use of derivative financial instruments, to mitigate the effect of foreign currency exchange rate fluctuations and expect to continue to use such instruments in the future to reduce foreign currency exposure to changes in the value of certain foreign currencies. All hedging transactions are authorized and executed pursuant to regularly reviewed policies and procedures.\nRevenues from our clients in the United Kingdom, Continental Europe and Rest of World represented 9.2%, 9.8% and 6.5%, respectively, of our 2024 revenues, and are typically denominated in currencies other than the U.S. dollar. Accordingly, our revenues may be affected by fluctuations in the exchange rates, primarily the British pound and the Eur\no, a\ns compared to the U.S. dollar.\nA predominant portion of our costs in India are denominated in the Indian rupee, representing 24% of our global operating costs during 2024, and are subject to foreign currency exchange rate fluctuations. These foreign currency exchange rate fluctuations have an impact on our results of operations.\nWe have entered into a series of foreign exchange forward and option contracts that are designated as cash flow hedges of certain Indian rupee denominated payments in India. These U.S. dollar / Indian rupee hedges are intended to partially offset the impact of movement of exchange rates on future operating costs. As of December 31, 2024, the notional value and weighted average contract rates of these contracts by year of maturity were as follows:\nNotional Value \n(in millions)\nWeighted Average Contract Rate (Indian rupee to U.S. dollar)\n2025\n$\n2,010 \n85.8 \n2026\n920 \n87.5 \nTotal\n$\n2,930 \n86.3 \nAs of December 31, 2024, the net unrealized loss on our outstanding foreign exchange forward and option contracts designated as cash flow hedges was $34 million. Based upon a sensitivity analysis at December 31, 2024, which estimates the fair value of the contracts assuming certain market exchange rate fluctuations, a 10.0% change in the foreign currency exchange rate against the U.S. dollar with all other variables held constant would have resulted in a change in the fair value of our foreign exchange forward contracts designated as cash flow hedges of approximately $277 million.\nA portion of our balance sheet is exposed to foreign currency exchange rate fluctuations, which may result in non-operating foreign currency exchange gains or losses upon remeasurement. In 2024, we reported foreign currency exchange losses, exclusive of hedging gains, of approximately $29 million, which were primarily attributed to the remeasurement of net monetary assets and liabilities denominated in currencies other than the functional currencies of our subsidiaries. We use foreign exchange forward contracts that are scheduled to mature in the first quarter of 2025 to provide an economic hedge against balance sheet exposure to certain monetary assets and liabilities denominated in currencies other than the functional currency of the subsidiary. At December 31, 2024, the notional value of these outstanding contracts was $489 million and the net unrealized loss was $1 million. Based upon a sensitivity analysis of our foreign exchange forward contracts at December 31, \nCognizant\n39\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \n2024, which estimates the fair value of the contracts assuming certain market exchange rate fluctuations, a 10.0% change in the foreign currency exchange rate against the U.S. dollar with all other variables held constant would have resulted in a change in the fair value of our foreign exchange forward contracts not designated as hedges of approximately $30 million.\nInterest Rate Risk\nWe have a Credit Agreement providing for a $650 million Term Loan and a $1,850 million unsecured revolving credit facility, which are due to mature in October 2027. As of December 31, 2024, The Credit Agreement requires interest to be paid, at our option, at either the Term Benchmark, Adjusted Daily Simple RFR or the ABR Rate (each as defined in the Credit Agreement), plus, in each case, an Applicable Margin (as defined in the Credit Agreement). The Term Loan is a Term Benchmark loan. As of December 31, 2024, we had $300 million outstanding on the revolving credit facility, consisting of a Term Benchmark loan with a maturity of October 2027 and an Interest Period (as defined in the Credit Agreement) of one month. Thus, our debt exposes us to market risk from changes in interest rates. We performed a sensitivity analysis to determine the effect of interest rate fluctuations on our interest expense. A 100 basis point change in interest rates, with all other variables held constant, would have an immaterial effect on our reported interest expense. \nWe have $1,031 million of cash equivalents, and $12 million of short-term investments as of December 31, 2024. Our cash equivalents, which consist of money market funds and time deposits, and our short-term investments, which consist primarily of a U.S. dollar denominated investment in a fixed income mutual fund, are exposed to fluctuations in interest rates, which may affect our interest income and the fair market value of the instruments. As of December 31, 2024, a 100 basis point change in interest rates, with all other variables held constant, would have an immaterial effect on the fair value of our cash equivalents as well as short-term investments.\nInformation provided by the sensitivity analysis of foreign currency risk and interest rate risk does not necessarily represent the actual changes that would occur under normal market conditions.\nItem 8. Financial Statements and Supplementary Data\nThe financial statements required to be filed pursuant to this Item 8 are appended to this Annual Report on Form 10-K. A list of the financial statements filed herewith is found in Part IV, “\nItem 15. Exhibits, Financial Statements and Financial Statement Schedule.\n”\nItem 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.\nItem 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nOur management, under the supervision and with the participation of our chief executive officer and our chief financial officer, evaluated the effectiveness of our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended) as of December 31, 2024. Based on this evaluation, our chief executive officer and our chief financial officer concluded that, as of December 31, 2024, our disclosure controls and procedures were effective.\nChanges in Internal Control over Financial Reporting\nThere has been no change in our internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act of 1934, as amended) that occurred during the fiscal quarter ended December 31, 2024 that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.\nCognizant\n40\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nManagement’s Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is defined in Rule 13a-15(f) and 15d-15(f) of the Securities Exchange Act of 1934, as amended, and is a process designed by, or under the supervision of, our chief executive and chief financial officers and effected by our Board of Directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles and includes those policies and procedures that:\n•\nPertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of our assets;\n•\nProvide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the Company are being made only in accordance with authorizations of our management and directors; and\n•\nProvide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Company’s assets that could have a material effect on the financial statements.\nOur management assessed the effectiveness of the Company’s internal control over financial reporting as of December 31, 2024. In making this assessment, the Company’s management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in \nInternal Control-Integrated Framework \n(2013). The scope of management's assessment of the effectiveness of our internal control over financial reporting included all of our consolidated operations except for the operations of Belcan, which we acquired on August 26, 2024. Belcan's operations represented approximately 7.7% of our consolidated total assets and 1.5% of our consolidated revenues as of and for the year ended December 31, 2024.\nBased on its evaluation, our management has concluded that, as of December 31, 2024, our internal control over financial reporting was effective. PricewaterhouseCoopers LLP, the independent registered public accounting firm that audited the financial statements included in this annual report, has issued an attestation report on our internal control over financial reporting, as stated in their report which is included on page F-2.\nInherent Limitations of Internal Controls\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect all misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nItem 9B. Other Information\n(c) Trading Plans\nNo director or Section 16 officer \nadopted\n or \nterminated\n any Rule 10b5-1 trading arrangements or non-Rule 10b5-1 trading arrangements (in each case, as defined in Item 408(a) of Regulation S-K) during the three months ended December 31, 2024, except as follows:\nName\nTitle\nAction\nDate of adoption/termination\nScheduled expiration date\n(1)\nAggregate number of securities to be purchased/sold\nMichael Patsalos-Fox\nDirector\nAdoption\nDecember 13, 2024\nFebruary 20, 2026\nSale of up to \n25,000\n shares of common stock\n(1)\n The trading plan may also expire on such earlier date as all transactions under the trading plan are completed.\nEach of the trading arrangements listed in the above table is intended to satisfy the affirmative defense conditions of Rule 10b5-1.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\n \nNot applicable.\nCognizant\n41\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nPART III\nItem 10. Directors, Executive Officers and Corporate Governance\nThe information relating to our executive officers in response to this item is contained in part under the caption “Information About Our Executive Officers” in \nPart I\n of this Annual Report on Form 10-K. \nWe have adopted a written code of ethics, entitled “Code of Ethics,” that applies to all of our directors, executive officers and employees, including our principal executive officer, principal financial officer, principal accounting officer and controller, or persons performing similar functions. We make available our code of ethics free of charge through our website which is located at \nwww.cognizant.com\n. We intend to post on our website all disclosures that are required by law or Nasdaq Stock Market listing standards concerning any amendments to, or waivers from, any provision of our code of ethics.\nWe have \nadopted\n an insider trading policy governing purchases, sales and/or other dispositions of our securities by our directors, officers, employees and other covered persons, as well as the Company itself, that we believe is reasonably designed to promote compliance with insider trading laws, rules and regulations and the exchange listing standards applicable to us. A copy of our insider trading policy is filed as Exhibit 19.1 to this Annual Report on Form 10-K.\nThe remaining information required by this item will be included under the caption \"Corporate governance\" in our definitive proxy statement for the 2025 Annual Meeting of Stockholders, which will be filed with the SEC pursuant to Regulation 14A not later than 120 days after the end of the fiscal year ended December 31, 2024 and is incorporated herein by reference to such proxy statement.\nItem 11. Executive Compensation\nThe information required by this item will be included in our definitive proxy statement for the 2025 Annual Meeting of Stockholders and is incorporated herein by reference to such proxy statement.\nI\ntem 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by this item will be included in our definitive proxy statement for the 2025 Annual Meeting of Stockholders and is incorporated herein by reference to such proxy statement.\nItem 13. Certain Relationships and Related Transactions, and Director Independence\nThe information required by this item will be included in our definitive proxy statement for the 2025 Annual Meeting of Stockholders and is incorporated herein by reference to such proxy statement.\nItem 14. Principal Accountant Fees and Services\nThe information required by this item will be included in our definitive proxy statement for the 2025 Annual Meeting of Stockholders and is incorporated herein by reference to such proxy statement.\nCognizant\n42\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nPART IV\nItem 15. Exhibits, Financial Statement Schedules\n(a)\n    (1) Consolidated Financial Statements.\n          Reference is made to the Index to Consolidated Financial Statements on Page F-1.\n    (2) Consolidated Financial Statement Schedule.\n          Reference is made to the Index to Financial Statement Schedule on Page F-1.\n    (3) Exhibits.\nSchedules other than as listed above are omitted as not required or inapplicable or because the required information is provided in the consolidated financial statements, including the notes thereto.\nEXHIBIT INDEX\n \n \nIncorporated by Reference\nNumber\nExhibit Description\nForm\nFile No.\nExhibit\nDate\nFiled or Furnished\nHerewith\n2.1\nAgreement and Plan of Merger, dated June 5, 2024, among Propulsion Holdings, LLC, Cognizant Domestic Holdings Corporation, Eagle Acquisition Sub, LLC, and Propulsion Intermediate, LP\n8-K\n000-24429\n2.1 \n6/10/2024\n3.1\nAmended and Restated Certificate of Incorporation, dated June 4, 2024\n8-K\n000-24429\n3.1 \n6/7/2024\n3.2\nAmended and Restated Bylaws, as adopted on September 14, 2018\n8-K\n000-24429\n3.1 \n9/20/2018\n4.1\nSpecimen Certificate for shares of Class A common stock\nS-4/A\n333-101216\n4.2 \n1/30/2003\n4.2\nDescription of Capital Stock\n10-K\n000-24429\n4.2 \n2/14/2020\n10.1†\nForm of Indemnification Agreement for Directors and Officers\n10-Q\n000-24429\n10.1 \n8/7/2013\n10.2†\nForm of Amended and Restated Executive Employment and Non-Disclosure, Non-Competition, and Invention Assignment Agreement, between the Company and each of the following current or former Executive Officers: \nRobert Telesmanic, Balu Ganesh Ayyar and John Kim\n10-K\n000-24429\n10.3 \n2/27/2018\n10.3†\n2022 Form of Executive Employment and Non-Disclosure, Non-Competition and Invention Assignment Agreement between the Company and each of the following current or former Executive Officers: Surya Gummadi, Kathryn Diaz and Jatin Dalal\n10-Q\n000-24429\n10.1 \n7/28/2022\n10.4†\nExecutive Employment and Non-Disclosure, Non-Competition and Invention Assignment Agreement, entered into between the Company and Ravi Kumar Singisetti, dated effective January 12, 2023\n8-K\n000-24429\n10.2 \n1/12/2023\n10.5†\nOffer Letter, by and between the Company and Ravi Kumar Singisetti, acknowledged and agreed January 9, 2023\n8-K\n000-24429\n10.1 \n1/12/2023\n10.6†\nOffer Letter, by and between the Company and Jatin Dalal, acknowledged and agreed September 25, 2023\n8-K\n000-24429\n10.1 \n9/28/2023\n10.7†\nDescription of Reimbursement Arrangement with Jatin Dalal\n10-Q\n000-24429\n10.1 \n10/30/2024\n10.8†\nNon-Employee Director Compensation Guidelines (effective as of June \n4\n, 202\n4\n)\n10-Q\n000-24429\n10.9 \n7/31/2024\nCognizant\n43\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \n \n \nIncorporated by Reference\nNumber\nExhibit Description\nForm\nFile No.\nExhibit\nDate\nFiled or Furnished\nHerewith\n10.9†\n2004 Employee Stock Purchase Plan (as amended and restated effective as of January 1, 2022)\n10-K\n000-24429\n10.7 \n2/16/2022\n10.10†\nCognizant Technology Solutions Corporation Amended and Restated 2009 Incentive Compensation Plan, effective March 9, 2015\n10-Q\n000-24429\n10.1 \n5/4/2015\n10.11†\nForm of Restricted Stock Unit Award Agreement Non-Employee Director Deferred Issuance\n8-K\n000-24429\n10.7 \n7/6/2009\n10.12†\nForm of Cognizant Technology Solutions Corporation Notice of Award of Restricted Stock Units Non-Employee Director Deferred Issuance\n8-K\n000-24429\n10.8 \n7/6/2009\n10.13†\nCognizant Technology Solutions Corporation 2017 Incentive Award Plan\n8-K\n000-24429\n10.1 \n6/7/2017\n10.14†\nForm of Restricted Stock Unit Award Grant Notice\n10-Q\n000-24429\n10.2 \n8/3/2017\n10.15†\nForm of Performance-Based Restricted Stock Unit Award Grant Notice\n10-Q\n000-24429\n10.3 \n8/3/2017\n10.16†\nForm of Restricted Stock Unit Award Grant Notice\n10-Q\n000-24429\n10.4 \n8/3/2017\n10.17†\nForm of Stock Option Grant Notice and Stock Option Agreement\n10-Q\n000-24429\n10.5 \n8/3/2017\n10.18†\nForm of Restricted Stock Unit Award Grant Notice (March 5, 2020 form)\n10-Q\n000-24429\n10.1 \n5/8/2020\n10.19†\nForm of Performance-Based Restricted Stock Unit Award Grant Notice (March 5, 2020 form)\n10-Q\n000-24429\n10.2 \n5/8/2020\n10.20†\nCognizant Technology Solutions Corporation 2023 Incentive Award Plan\nS-8\n333-272444\n99.1 \n6/6/2023\n10.21†\nForm of Cognizant Technology Solutions Corporation Restricted Stock Unit Award Grant Notice for Employees, including Executive Officers\nFiled\n10.22†\nForm of Cognizant Technology Solutions Corporation Performance-Based Restricted Stock Unit Award Grant Notice\nFiled\n10.23†\nForm of Cognizant Technology Solutions Corporation Restricted Stock Unit Award Grant Notice for Non-Employee Director (Non-Deferred\n)\nFiled\n10.24†\nForm of Cognizant Technology Solutions Corporation Restricted Stock Unit Award Grant Notice Non-Employee Director (Deferred Settlement)\nFiled\n10.25†\nForm of Cognizant Technology Solutions Corporation Deferred Stock Unit Award Grant Notice Non-Employee Director (for Deferred Equity in lieu of Cash Retainer)\nFiled\n10.26†\nLetter Agreement with each of Steven Rohleder and Sandra Wijnberg regarding grant of dividend equivalents on previously issued Deferred Stock Units\n10-Q\n000-24429\n10.8 \n8/3/2023\n10.27†\nRetirement, Death and Disability Policy\n10-Q\n000-24429\n10.1 \n7/30/2020\n10.28†\nCognizant Technology Solutions Corporation Senior Executive Cash Severance Policy\n8-K\n000-24429\n10.1 \n3/6/2023\nCognizant\n44\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \n \n \nIncorporated by Reference\nNumber\nExhibit Description\nForm\nFile No.\nExhibit\nDate\nFiled or Furnished\nHerewith\n10.29\nCredit Agreement, dated as of October 6, 2022, among Cognizant Technology Solutions Corporation, Cognizant Worldwide Limited, certain financial institutions party thereto and JPMorgan Chase Bank, N.A., as administrative agent\n8-K\n000-24429\n10.1 \n10/7/2022\n10.30\nAmendment No. 1 to the Credit Agreement, dated as of October 6, 2022, among Cognizant Technology Solutions Corporation, Cognizant Worldwide Limited, certain financial institutions party thereto and JPMorgan Chase Bank, N.A., as administrative agent\n10-Q\n000-24429\n10.2 \n7/31/2024\n10.31†\nFirst Amendment to the 2004 Employee Stock Purchase Plan (as amended and restated effective as of January 1, 2022)\nS-8\n333-272444\n99.3 \n6/6/2023\n19.1\nCognizant Technology Solutions Corporation Insider Trading Policy\nFiled\n21.1\nList of subsidiaries of the Company\nFiled\n23.1\nConsent of PricewaterhouseCoopers LLP\nFiled\n31.1\nCertification Pursuant to Rule 13a-14(a) and 15d-14(a) of the Exchange Act, as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (Chief Executive Officer)\nFiled\n31.2\nCertification Pursuant to Rule 13a-14(a) and 15d-14(a) of the Exchange Act, as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (Chief Financial Officer)\nFiled\n32.1\nCertification Pursuant to 18 U.S.C. Section 1350 (Chief Executive Officer)\nFurnished\n32.2\nCertification Pursuant to 18 U.S.C. Section 1350 (Chief Financial Officer)\nFurnished\n97.1\nCognizant Technology Solutions Corporation Rule 10D-1 Compensation Recoupment (Clawback) Policy adopted September 6, 2023\n10-K\n000-24429\n97.1\n2/14/2024\n101.INS\nInline XBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\nFiled\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\nFiled\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\nFiled\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\nFiled\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\nFiled\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nFiled\n104\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\nFiled\n†\nA management contract or compensatory plan or arrangement required to be filed as an exhibit pursuant to Item 15(a)(3) of Form 10-K.\nCognizant\n45\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nItem 16. Form 10-K Summary\nNone.\nCognizant\n46\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\n \nCOGNIZANT TECHNOLOGY SOLUTIONS CORPORATION\nBy:\n \n    /\nS\n/    R\nAVI\n K\nUMAR \nS\n \nRavi Kumar S,\n \n \nChief Executive Officer\n \n \n(Principal Executive Officer)\nDate:\nFebruary 12, 2025\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nSignature\n \nTitle\n \nDate\n    /s/    R\nAVI\n K\nUMAR \nS\nChief Executive Officer and Director\n(Principal Executive Officer)\nFebruary 12, 2025\nRavi Kumar S\n \n \n/s/    J\nATIN \nD\nALAL\nChief Financial Officer\n(Principal Financial Officer)\nFebruary 12, 2025\nJatin Dalal\n \n \n/s/    R\nOBERT\n T\nELESMANIC\nSenior Vice President, Controller and Chief Accounting Officer\n(Principal Accounting Officer)\nFebruary 12, 2025\nRobert Telesmanic\n/s/    S\nTEPHEN\n J. R\nOHLEDER \nChair of the Board and Director\nFebruary 12, 2025\nStephen J. Rohleder\n \n \n/s/    \nZ\nEIN  \nA\nBDALLA\n \nDirector\nFebruary 12, 2025\nZein Abdalla\n \n/s/    \nV\nINITA \nB\nALI\nDirector\nFebruary 12, 2025\nVinita Bali\n/s/    E\nRIC\n B\nRANDERIZ\n \nDirector\n \nFebruary 12, 2025\nEric Branderiz\n \n/s/    \nA\nRCHANA\n D\nESKUS\nDirector\nFebruary 12, 2025\nArchana Deskus\n/s/    J\nOHN\n M. D\nINEEN\n \nDirector\n \nFebruary 12, 2025\nJohn M. Dineen\n/s/    L\nEO\n S. M\nACKAY\n, J\nR\n.\n \nDirector\n \nFebruary 12, 2025\nLeo S. Mackay, Jr.\n/s/    M\nICHAEL\n P\nATSALOS\n-F\nOX\nDirector\nFebruary 12, 2025\nMichael Patsalos-Fox\n/s/    A\nBRAHAM\n S\nCHOT\nDirector\nFebruary 12, 2025\nAbraham Schot\n/s/    K\nARIMA\n S\nILVENT\nDirector\nFebruary 12, 2025\nKarima Silvent\n/s/    J\nOSEPH\n M. V\nELLI\n \nDirector\nFebruary 12, 2025\nJoseph M. Velli\n/s/    S\nANDRA\n S. W\nIJNBERG\nDirector\nFebruary 12, 2025\nSandra S. Wijnberg\n    \nCognizant\n47\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nCOGNIZANT TECHNOLOGY SOLUTIONS CORPORATION\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nAND FINANCIAL STATEMENT SCHEDULE\n \n \n  \nPage\nConsolidated Financial Statements:\n  \nReport of Independent Registered Public Accounting Firm (PCAOB ID No. \n238\n)\n  \n \nF-\n2\nConsolidated Statements of Financial Position as of December 31, 2024 and 20\n23\n  \n \nF-\n4\nConsolidated Statements of Operations for the years ended December 31, 2024, 2023 and 20\n2\n2\n  \n \nF-\n5\nConsolidated Statements of Comprehensive Income for the years ended December 31, 2024, 2023 and 20\n2\n2\n  \n \nF-\n6\nConsolidated Statements of Stockholders’ Equity for the years ended December  31, 2024, 2023 and 20\n2\n2\n  \n \nF-\n7\nConsolidated Statements of Cash Flows for the years ended December 31, 2024, 2023 and 20\n2\n2\n  \n \nF-\n8\nNotes to Consolidated Financial Statements\n  \n \nF-\n9\nFinancial Statement Schedule:\n  \nSchedule of Valuation and Qualifying Accounts for the years ended December 31, 2024, 2023 and 20\n2\n2\n  \n \nF-\n40\nCognizant\nF-1\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Stockholders of Cognizant Technology Solutions Corporation\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated statements of financial position of Cognizant Technology Solutions Corporation and its subsidiaries (the “Company”) as of December 31, 2024 and 2023, and the related consolidated statements of operations, of comprehensive income, of stockholders’ equity and of cash flows for each of the three years in the period ended December 31, 2024, including the related notes and financial statement schedule listed in the accompanying index (collectively referred to as the “consolidated financial statements”). We also have audited the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control - Integrated Framework\n (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).  \nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024 in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control - Integrated Framework\n (2013) issued by the COSO.\nBasis for Opinions\nThe Company's management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in Management's Report on Internal Control Over Financial Reporting appearing under Item 9A. Our responsibility is to express opinions on the Company’s consolidated financial statements and on the Company's internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.  \nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nAs described in Management’s Report on Internal Control over Financial Reporting, management has excluded Belcan from its assessment of internal control over financial reporting as of December 31, 2024 because it was acquired by the Company in a purchase business combination during 2024. We have also excluded Belcan from our audit of internal control over financial reporting. Belcan is a wholly-owned subsidiary whose total assets and total revenues excluded from management’s assessment and our audit of internal control over financial reporting represent 7.7% and 1.5%, respectively, of the related consolidated financial statement amounts as of and for the year ended December 31, 2024.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the \nCognizant\nF-2\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \ncompany; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that (i) relates to accounts or disclosures that are material to the consolidated financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates. \nRevenue Recognition – Expected Labor Costs to Complete for Certain Fixed-Price Contracts\nAs described in Notes 1 and 2 to the consolidated financial statements, fixed-price contracts comprised $9.0 billion of the Company’s total revenues for the year ended December 31, 2024, which includes performance obligations where control is transferred over time. For performance obligations where control is transferred over time, revenues are recognized based on the extent of progress towards completion of the performance obligation. The selection of the method to measure progress towards completion requires judgment and is based primarily on the nature of the deliverables to be provided. Management recognizes revenues related to fixed-price contracts for application development and systems integration services, consulting or other technology services as the service is performed using the cost-to-cost method, under which the total value of revenues is recognized on the basis of the percentage that each contract’s total labor cost to date bears to the total expected labor costs. The cost-to-cost method requires estimation of future costs, which is updated as the project progresses to reflect the latest available information. Revenues related to fixed-price application maintenance, quality engineering and assurance as well as business process services are recognized based on management’s right to invoice for services performed for contracts in which the invoicing is representative of the value being delivered. If management’s invoicing is not consistent with the value delivered, revenues are recognized as the service is performed based on the cost-to-cost method described above. \nThe principal considerations for our determination that performing procedures relating to revenue recognition – expected labor costs to complete for certain fixed-price contracts is a critical audit matter are the significant judgment by management when developing the estimated total expected labor costs to complete fixed-price contracts and the significant auditor judgment, subjectivity, and effort in performing procedures and evaluating audit evidence relating to management’s estimate of total expected labor costs\n.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to the revenue recognition process, including controls over the development of the estimated total expected labor costs to complete fixed-price contracts. These procedures also included, among others, evaluating and testing management’s process for developing the estimated total expected labor costs for a sample of contracts, which included evaluating the reasonableness of the total expected labor cost assumptions used by management. Evaluating the reasonableness of the assumptions related to the total expected labor costs involved assessing management’s ability to reasonably develop total expected labor costs by (i) performing a comparison of expected labor cost metrics at project inception with actual cost metrics for similar completed projects and (ii) evaluating the timely identification of circumstances that may warrant a modification to previous labor cost estimates, including actual labor costs in excess of estimates. \n/s/ \nPricewaterhouseCoopers LLP\nNew York, New York\nFebruary 12, 2025\nWe have served as the Company’s auditor since 1997. \nCognizant\nF-3\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nCOGNIZANT TECHNOLOGY SOLUTIONS CORPORATION\nCONSOLIDATED STATEMENTS OF FINANCIAL POSITION\n \nDecember 31,\n(in millions, except par values)\n2024\n2023\nAssets\nCurrent assets:\nCash and cash equivalents\n$\n2,231\n \n$\n2,621\n \nShort-term investments\n12\n \n14\n \nTrade accounts receivable, net\n4,059\n \n3,849\n \nOther current assets\n1,202\n \n1,022\n \nTotal current assets\n7,504\n \n7,506\n \nProperty and equipment, net\n994\n \n1,048\n \nOperating lease assets, net\n552\n \n611\n \nGoodwill\n6,953\n \n6,085\n \nIntangible assets, net\n1,599\n \n1,149\n \nDeferred income tax assets, net\n1,248\n \n993\n \nLong-term investments\n90\n \n435\n \nOther noncurrent assets\n1,026\n \n656\n \nTotal assets\n$\n19,966\n \n$\n18,483\n \nLiabilities and Stockholders’ Equity\nCurrent liabilities:\nAccounts payable\n$\n340\n \n$\n337\n \nDeferred revenue\n450\n \n385\n \nShort-term debt\n33\n \n33\n \nOperating lease liabilities\n152\n \n153\n \nAccrued expenses and other current liabilities\n2,610\n \n2,425\n \nTotal current liabilities\n3,585\n \n3,333\n \nDeferred revenue, noncurrent\n30\n \n42\n \nOperating lease liabilities, noncurrent\n420\n \n523\n \nDeferred income tax liabilities, net\n154\n \n226\n \nLong-term debt\n875\n \n606\n \nLong-term income taxes payable\n—\n \n157\n \nOther noncurrent liabilities\n494\n \n369\n \nTotal liabilities\n5,558\n \n5,256\n \nCommitments and contingencies (See \nNote 15\n)\nStockholders’ equity:\nPreferred stock, $\n0.10\n par value, \n15\n shares authorized, \nnone\n issued\n—\n \n—\n \nClass A common stock, $\n0.01\n par value, \n1,000\n shares authorized, \n495\n and \n498\n shares issued and outstanding as of December 31, 2024 and 2023, respectively\n5\n \n5\n \nAdditional paid-in capital \n13\n \n15\n \nRetained earnings\n14,686\n \n13,301\n \nAccumulated other comprehensive income (loss)\n(\n296\n)\n(\n94\n)\nTotal stockholders’ equity\n14,408\n \n13,227\n \nTotal liabilities and stockholders’ equity\n$\n19,966\n \n$\n18,483\n \nThe accompanying notes are an integral part of the consolidated financial statements.\nCognizant\nF-4\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nCOGNIZANT TECHNOLOGY SOLUTIONS CORPORATION\nCONSOLIDATED STATEMENTS OF OPERATIONS\n \n \nYear Ended December 31,\n(in millions, except per share data)\n2024\n2023\n2022\nRevenues\n$\n19,736\n \n$\n19,353\n \n$\n19,428\n \nOperating expenses:\nCost of revenues (exclusive of depreciation and amortization expense shown separately below)\n12,958\n \n12,664\n \n12,448\n \nSelling, general and administrative expenses\n3,223\n \n3,252\n \n3,443\n \nRestructuring charges\n134\n \n229\n \n—\n \nDepreciation and amortization expense\n529\n \n519\n \n569\n \nIncome from operations\n2,892\n \n2,689\n \n2,968\n \nOther income (expense), net:\nInterest income\n119\n \n126\n \n59\n \nInterest expense\n(\n54\n)\n(\n41\n)\n(\n19\n)\nForeign currency exchange gains (losses), net\n(\n19\n)\n2\n \n7\n \nOther, net\n—\n \n11\n \n1\n \nTotal other income (expense), net\n46\n \n98\n \n48\n \nIncome before provision for income taxes\n2,938\n \n2,787\n \n3,016\n \nProvision for income taxes\n(\n713\n)\n(\n668\n)\n(\n730\n)\nIncome (loss) from equity method investments\n15\n \n7\n \n4\n \nNet income\n$\n2,240\n \n$\n2,126\n \n$\n2,290\n \nBasic earnings per share\n$\n4.52\n \n$\n4.21\n \n$\n4.42\n \nDiluted earnings per share\n$\n4.51\n \n$\n4.21\n \n$\n4.41\n \nWeighted average number of common shares outstanding—Basic\n496\n \n505\n \n518\n \nDilutive effect of shares issuable under stock-based compensation plans\n1\n \n—\n \n1\n \nWeighted average number of common shares outstanding—Diluted\n497\n \n505\n \n519\n \nThe accompanying notes are an integral part of the consolidated financial statements.\nCognizant\nF-5\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nCOGNIZANT TECHNOLOGY SOLUTIONS CORPORATION\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n \n \nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nNet income\n$\n2,240\n \n$\n2,126\n \n$\n2,290\n \nChange in Accumulated other comprehensive income (loss), net of tax:\nForeign currency translation adjustments\n(\n150\n)\n144\n \n(\n228\n)\nUnrealized gains and losses on cash flow hedges\n(\n35\n)\n61\n \n(\n108\n)\nLoss on defined benefit plans \n(\n17\n)\n—\n \n—\n \nOther comprehensive income (loss)\n(\n202\n)\n205\n \n(\n336\n)\nComprehensive income\n$\n2,038\n \n$\n2,331\n \n$\n1,954\n \nThe accompanying notes are an integral part of the consolidated financial statements.\nCognizant\nF-6\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nCOGNIZANT TECHNOLOGY SOLUTIONS CORPORATION\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY\n \n(in millions, except per share data)\nClass A Common Stock\nAdditional\nPaid-in\nCapital\nRetained\nEarnings\nAccumulated\nOther\nComprehensive\nIncome (Loss)\n Total\nShares    \nAmount\nBalance, December 31, 2021\n525\n \n$\n5\n \n$\n27\n \n$\n11,922\n \n$\n37\n \n$\n11,991\n \nNet income\n— \n— \n— \n2,290\n \n— \n2,290\n \nOther comprehensive income (loss)\n— \n— \n— \n— \n(\n336\n)\n(\n336\n)\nCommon stock issued, stock-based compensation plans\n4\n \n— \n86\n \n— \n— \n86\n \nStock-based compensation expense\n— \n— \n261\n \n— \n— \n261\n \nRepurchases of common stock\n(\n20\n)\n— \n(\n359\n)\n(\n1,059\n)\n— \n(\n1,418\n)\nDividends declared, $\n1.08\n per share\n— \n— \n— \n(\n565\n)\n— \n(\n565\n)\nBalance, December 31, 2022\n509\n \n5\n \n15\n \n12,588\n \n(\n299\n)\n12,309\n \nNet income\n— \n— \n— \n2,126\n \n— \n2,126\n \nOther comprehensive income (loss)\n— \n— \n— \n— \n205\n \n205\n \nCommon stock issued, stock-based compensation plans\n4\n \n— \n71\n \n— \n— \n71\n \nStock-based compensation expense\n— \n— \n176\n \n— \n— \n176\n \nRepurchases of common stock\n(\n15\n)\n— \n(\n247\n)\n(\n823\n)\n— \n(\n1,070\n)\nDividends declared, $\n1.16\n per share\n— \n— \n— \n(\n590\n)\n— \n(\n590\n)\nBalance, December 31, 2023\n498\n \n5\n \n15\n \n13,301\n \n(\n94\n)\n13,227\n \nNet income\n— \n— \n— \n2,240\n \n— \n2,240\n \nOther comprehensive income (loss)\n— \n— \n— \n— \n(\n202\n)\n(\n202\n)\nCommon stock issued, stock-based compensation plans\n4\n \n— \n63\n \n— \n— \n63\n \nCommon stock issued, acquisition related\n1\n \n— \n113\n \n— \n— \n113\n \nStock-based compensation expense\n— \n— \n175\n \n— \n— \n175\n \nRepurchases of common stock\n(\n8\n)\n— \n(\n353\n)\n(\n255\n)\n— \n(\n608\n)\nDividends declared, $\n1.20\n per share\n— \n— \n— \n(\n600\n)\n— \n(\n600\n)\nBalance, December 31, 2024\n495\n \n$\n5\n \n$\n13\n \n$\n14,686\n \n$\n(\n296\n)\n$\n14,408\n \nThe accompanying notes are an integral part of the consolidated financial statements.\nCognizant\nF-7\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nCOGNIZANT TECHNOLOGY SOLUTIONS CORPORATION\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n \nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nCash flows from operating activities:\nNet income\n$\n2,240\n \n$\n2,126\n \n$\n2,290\n \nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization\n542\n \n555\n \n569\n \nDeferred income taxes\n(\n355\n)\n(\n339\n)\n(\n273\n)\nStock-based compensation expense\n175\n \n176\n \n261\n \nOther, net\n32\n \n1\n \n45\n \nChanges in operating assets and liabilities, net of effects of businesses acquired:\nTrade accounts receivable\n(\n49\n)\n(\n43\n)\n(\n238\n)\nOther current and noncurrent assets\n(\n386\n)\n123\n \n343\n \nAccounts payable\n(\n23\n)\n(\n23\n)\n(\n11\n)\nDeferred revenue, current and noncurrent\n44\n \n(\n4\n)\n(\n26\n)\nOther current and noncurrent liabilities\n(\n96\n)\n(\n242\n)\n(\n392\n)\nNet cash provided by operating activities\n2,124\n \n2,330\n \n2,568\n \nCash flows from investing activities:\nPurchases of property and equipment\n(\n297\n)\n(\n317\n)\n(\n332\n)\nPurchases of available-for-sale investment securities\n—\n \n(\n59\n)\n(\n1,227\n)\nProceeds from maturity of available-for-sale investment securities\n—\n \n285\n \n1,315\n \nPurchases of held-to-maturity investment securities\n—\n \n(\n3\n)\n(\n44\n)\nProceeds from maturity of held-to-maturity investment securities\n3\n \n24\n \n54\n \nPurchases of other investments\n(\n2\n)\n(\n379\n)\n(\n546\n)\nProceeds from maturity or sale of other investments\n265\n \n527\n \n1,013\n \nProceeds from sales of businesses\n—\n \n—\n \n28\n \nPayments for business combinations, net of cash acquired\n(\n1,615\n)\n(\n409\n)\n(\n367\n)\nNet cash (used in) investing activities\n(\n1,646\n)\n(\n331\n)\n(\n106\n)\nCash flows from financing activities:\nIssuance of common stock under stock-based compensation plans\n63\n \n71\n \n86\n \nRepurchases of common stock\n(\n605\n)\n(\n1,064\n)\n(\n1,422\n)\nRepayment of term loan borrowings and earnout obligations and finance leases\n(\n73\n)\n(\n25\n)\n(\n686\n)\nProceeds from borrowings under the revolving credit facility\n600\n—\n \n—\n \nRepayment of notes outstanding under the revolving credit facility\n(\n300\n)\n—\n \n—\n \nProceeds from debt refinancing\n—\n—\n \n650\n \nDebt issuance costs\n—\n \n—\n \n(\n3\n)\nDividends paid\n(\n600\n)\n(\n591\n)\n(\n564\n)\nNet cash (used in) financing activities\n(\n915\n)\n(\n1,609\n)\n(\n1,939\n)\nEffect of exchange rate changes on cash, cash equivalents and restricted cash and cash equivalents\n(\n49\n)\n33\n \n(\n21\n)\n(Decrease) increase in cash, cash equivalents and restricted cash and cash equivalents\n(\n486\n)\n423\n \n502\n \nCash, cash equivalents and restricted cash, beginning of year\n2,717\n \n2,294\n \n1,792\n \nCash, cash equivalents, and restricted cash and cash equivalents, end of year\n$\n2,231\n \n$\n2,717\n \n$\n2,294\n \nSupplemental information:\nCash paid for income taxes during the year\n$\n1,120\n \n$\n1,245\n \n$\n813\n \nCash interest paid during the year\n$\n53\n \n$\n40\n \n$\n15\n \nThe accompanying notes are an integral part of the consolidated financial statements.\nCognizant\nF-8\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nCOGNIZANT TECHNOLOGY SOLUTIONS CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Dollars in millions, except share data)\nNote 1 — Business Description and Summary of Significant Accounting Policies\nThe terms “Cognizant,” “we,” “our,” “us” and “the Company” refer to Cognizant Technology Solutions Corporation and its subsidiaries unless the context indicates otherwise.\nDescription of Business. \nWe are one of the world’s leading professional services companies, engineering modern businesses and delivering strategic outcomes for our clients. We help clients modernize technology, reimagine processes and transform experiences so they can stay ahead in today's fast-changing world, where AI is beginning to reshape organizations in every field. We provide industry expertise and close client collaboration, combining critical perspective with a flexible engagement style. We tailor our services and solutions to specific industries with an integrated global delivery model that employs client service and delivery teams based at client locations and dedicated global and regional delivery centers. Our collaborative services include digital services and solutions, consulting, application development, systems integration, quality engineering and assurance, engineering research and development, application maintenance, infrastructure and security as well as business process services and automation. Digital, AI-enhanced services continue to be an important part of our portfolio, aligning with our clients' focus on becoming data-enabled, customer-centric and differentiated businesses.\nBasis of Presentation, Principles of Consolidation and Use of Estimates.\n The consolidated financial statements are presented in accordance with GAAP and reflect the consolidated financial position, results of operations, comprehensive income and cash flows of our consolidated subsidiaries for all periods presented. All intercompany balances and transactions have been eliminated in consolidation.\n \nThe preparation of financial statements requires management to make estimates and assumptions that affect the reported amounts in the consolidated financial statements and accompanying disclosures. We evaluate our estimates on a continuous basis. We base our estimates on historical experience and on various other assumptions that are believed to be reasonable under the circumstances. The actual amounts may vary from the estimates used in the preparation of the accompanying consolidated financial statements.\n \nCash and Cash Equivalents and Investments.\n Cash and cash equivalents consist of all cash balances, including money market funds and time deposits that have a maturity, at the date of purchase, of 90 days or less.\nWe determine the appropriate classification of our investments in marketable securities at the date of purchase and reevaluate such designation at each balance sheet date. We classify and account for our marketable debt securities as either available-for-sale or held-to-maturity. We determine the cost of the securities sold based on the specific identification method. Our held-to-maturity investment securities are financial instruments that we have the intent and ability to hold to maturity and we classify these securities with maturities less than one year as short-term investments. Any held-to-maturity investment securities with maturities beyond one year from the balance sheet date are classified as long-term investments. Held-to-maturity securities are reported at amortized cost. Interest and amortization of premiums and discounts for debt securities are included in interest income.\nOn initial recognition and on an ongoing basis, we evaluate our held-to-maturity investment securities for expected credit losses collectively when they share similar risk characteristics or individually, when the risk characteristics are different. The allowance for expected credit losses is determined using our historical loss experience. We monitor the credit ratings of the securities in our portfolio to evaluate the need for any changes to the allowance. An increase or a decrease in the allowance for expected credit losses is recorded through income as a credit loss expense or a reversal thereof. The allowance for expected credit losses is presented as a deduction from the amortized cost. A held-to-maturity investment security is written off when deemed uncollectible.\n \nFinancial Assets and Liabilities.\n Cash and certain cash equivalents, time deposits, trade receivables, accounts payable and other accrued liabilities are short-term in nature and, accordingly, their carrying values approximate fair value.\nProperty and Equipment.\n Property and equipment are stated at cost, net of accumulated depreciation. Depreciation is calculated on a straight-line basis over the estimated useful lives of the assets. Leasehold improvements are amortized on a straight-line basis over the shorter of the term of the lease or the estimated useful life of the asset. Deposits paid towards acquisition of long-lived assets and the cost of assets not put in use by the balance sheet date are disclosed under the caption \"Capital work-in-progress\" in \nNote 6\n.\nCognizant\nF-9\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nLeases.\n Our lease asset classes primarily consist of operating leases for office space, data centers and IT equipment. At inception of a contract, we determine whether a contract contains a lease, and if a lease is identified, whether it is an operating or finance lease. In determining whether a contract contains a lease we consider whether (1) we have the right to obtain substantially all of the economic benefits from the use of the asset throughout the term of the contract, (2) we have the right to direct how and for what purpose the asset is used throughout the term of the contract and (3) we have the right to operate the asset throughout the term of the contract without the lessor having the right to change the terms of the contract. Some of our lease agreements contain both lease and non-lease components that we account for as a single lease component for all of our lease asset classes.\nOur ROU lease assets represent our right to use an underlying asset for the lease term and may include any advance lease payments made and any initial direct costs and exclude lease incentives. Our lease liabilities represent our obligation to make lease payments arising from the terms of the lease. ROU lease assets and lease liabilities are recognized at the commencement of the lease and are calculated using the present value of lease payments over the lease term. Typically, our lease agreements do not provide sufficient detail to determine the rate implicit in the lease. Therefore, we use our estimated country-specific incremental borrowing rate based on information available at the commencement date of the lease to calculate the present value of the lease payments. In estimating our country-specific incremental borrowing rates, we consider market rates of comparable collateralized borrowings for similar terms. Our lease terms may include the option to extend or terminate the lease before the end of the contractual lease term. Our ROU lease assets and lease liabilities include these options when it is reasonably certain that they will be exercised. \nA portion of our real estate lease costs is subject to annual changes in the CPI. Changes in CPI subsequent to the lease commencement are treated as variable lease payments and are recognized in the period in which the obligation for those payments is incurred. Other variable lease costs primarily relate to adjustments for common area maintenance, utilities, property tax and lease concessions. These variable costs are recognized in the period in which the obligation is incurred.\nWe elect not to recognize ROU assets and lease liabilities for short-term leases with a term equal to or less than 12 months. We recognize the lease payments in our income statement on a straight-line basis over the lease term and variable lease payments in the period in which the obligation for those payments is incurred.\nBoth ROU assets and finance lease assets are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of the related asset group may not be recoverable.\nInternal Use Software.\n We capitalize certain costs that are incurred to purchase, develop and implement internal-use software during the application development phase, which primarily include coding, testing and certain data conversion activities. These capitalized costs are reported in \"Property and equipment, net\" in our consolidated statements of financial position. Capitalized costs are amortized on a straight-line basis over the useful life of the software. Costs incurred in performing planning and post-implementation activities are expensed as incurred.\nCloud Computing Arrangements. \nWe defer certain implementation costs that are incurred when implementing cloud computing service or software-as-a-service arrangements, which primarily include efforts associated with configuration and development activities. These capitalized costs are reported in \"Other current assets\" and \"Other noncurrent assets\" in our consolidated statements of financial position. Once the service is ready for use, deferred costs are expensed over the term of the arrangement and recognized in income from operations.\n \nSoftware to be Sold, Leased or Marketed. \nWe capitalize costs incurred after technological feasibility is reached but before software is available for general release to clients, which primarily include coding and testing activities.\n \nOnce the product is ready for general release, capitalized costs are amortized over the useful life of the software.\nBusiness Combinations.\n We account for business combinations using the acquisition method, which requires the identification of the acquirer, the determination of the acquisition date and the allocation of the purchase price paid by the acquirer to the identifiable tangible and intangible assets acquired, the liabilities assumed, including any contingent consideration and any noncontrolling interest in the acquiree at their acquisition date fair values. Goodwill represents the excess of the purchase price over the fair value of net assets acquired, including the amount assigned to identifiable intangible assets. Identifiable intangible assets with finite lives are amortized over their expected useful lives. Acquisition-related costs are expensed in the periods in which the costs are incurred. The results of operations of acquired businesses are included in our consolidated financial statements from the acquisition date\n.\nEquity Method Investments. \nEquity investments that give us the ability to exercise significant influence, but not control, over an investee are accounted for using the equity method of accounting and recorded in the caption \"Long-term investments\" on our consolidated statements of financial position. Equity method investments are initially recorded at cost. We periodically \nCognizant\nF-10\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nreview the carrying value of our equity method investments to determine if there has been an other-than-temporary decline in the carrying value. The investment balance is increased to reflect contributions and our share of earnings and decreased to reflect our share of losses, distributions and other-than-temporary impairments. Our proportionate share of the net income or loss of the investee is recorded in the caption \"Income (loss) from equity method investments\" on our consolidated statements of operations.\n \nLong-lived Assets and Finite-lived Intangible Assets.\n We review long-lived assets and certain finite-lived intangible assets for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset group may not be recoverable. The carrying amount may not be recoverable when the sum of undiscounted expected future cash flows is less than the carrying amount of such asset groups. The impairment loss is determined as the amount by which the carrying amount of the asset group exceeds its fair value. Intangible assets consist primarily of customer relationships and developed technology, which are being amortized on a straight-line basis over their estimated useful lives.\nGoodwill and Indefinite-lived Intangible Assets.\n At each acquisition date, we allocate goodwill and intangible assets to our reporting units based on how we expect each reporting unit to benefit from the respective business combination. Our seven industry-based operating segments are our reporting units. We evaluate goodwill and indefinite-lived intangible assets for impairment at least annually, or as circumstances warrant. Goodwill is evaluated at the reporting unit level by comparing the fair value of the reporting unit with its carrying amount including goodwill. An impairment of goodwill exists if the carrying amount of the reporting unit exceeds its fair value. The impairment loss is the amount by which the carrying amount exceeds the reporting unit’s fair value, limited to the total amount of goodwill allocated to that reporting unit. For indefinite-lived intangible assets, if our qualitative assessment indicates that it is more-likely-than-not that an indefinite-lived intangible asset is impaired, we test the assets for impairment by comparing the fair value of such assets to their carrying value. If an impairment is indicated, a write down to the fair value of indefinite-lived intangible asset is recorded.\nStock Repurchase Program.\n Under the Board of Directors authorized stock repurchase program, the Company is authorized to repurchase its Class A common stock through open market purchases, \nincluding under a 10b5-1 Plan, in accordance with applica\nble federal securities laws. We account for the repurchased shares as constructively retired. Shares are returned to the status of authorized and unissued shares at the time of repurchase. To reflect share repurchases in the consolidated statements of financial position, we (1) reduce common stock for the par value of the shares, (2) reduce additional paid-in capital for the amount in excess of par during the period in which the shares are repurchased and (3) record any residual amount in excess of available additional paid-in capital as a reduction to retained earnings.\n \nRevenue Recognition.\n We recognize revenues as we transfer control of deliverables (products, solutions and services) to our clients in an amount reflecting the consideration to which we expect to be entitled. To recognize revenues, we apply the following five step approach: (1) identify the contract with a customer, (2) identify the performance obligations in the contract, (3) determine the transaction price, (4) allocate the transaction price to the performance obligations in the contract, and (5) recognize revenues when a performance obligation is satisfied. We account for a contract when it has approval and commitment from all parties, the rights of the parties are identified, payment terms are identified, the contract has commercial substance and collectibility of consideration is probable. We apply judgment in determining the customer’s ability and intention to pay based on a variety of factors including the customer’s historical payment experience.\nFor performance obligations where control is transferred over time, revenues are recognized based on the extent of progress towards completion of the performance obligation. The selection of the method to measure progress towards completion requires judgment and is based primarily on the nature of the deliverables to be provided. \nRevenues related to fixed-price contracts for application development and systems integration services, consulting or other technology services are recognized as the service is performed using the cost-to-cost method, under which the total value of revenues is recognized on the basis of the percentage that each contract’s total labor cost to date bears to the total expected labor costs. Revenues related to fixed-price application maintenance, quality engineering and assurance as well as business process services are recognized based on our right to invoice for services performed for contracts in which the invoicing is representative of the value being delivered. If our invoicing is not consistent with the value delivered, revenues are recognized as the service is performed based on the cost-to-cost method described above. The cost-to-cost method requires estimation of future costs, which is updated as the project progresses to reflect the latest available information. Such estimates and changes in estimates involve the use of judgment. The cumulative impact of any revision in estimates is reflected in the financial reporting period in which the change in estimate becomes known and any anticipated losses on contracts are recognized immediately, where appropriate. \nRevenues related to fixed-price hosting and infrastructure and security services are recognized based on our right to invoice for services performed for contracts in which the invoicing is representative of the value being delivered. If our invoicing is not consistent with the value delivered, revenues are recognized on a straight-line basis unless revenues are earned \nCognizant\nF-11\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nand obligations are fulfilled in a different pattern. The revenue recognition method applied to the types of contracts described above provides the most faithful depiction of performance towards satisfaction of our performance obligations; for example, the cost-to-cost method is used when the value of services provided to the customer is best represented by the costs expended to deliver those services. \nRevenues related to our time-and-materials, transaction-based or volume-based contracts are recognized over the period the services are provided either using an output method such as labor hours, or a method that is otherwise consistent with the way in which value is delivered to the customer.\nRevenues related to our non-hosted software license arrangements that do not require significant modification or customization of the underlying software are recognized when the software is delivered as control is transferred at a point in time. For software license arrangements that require significant functionality enhancements or modification of the software, revenues for the software license and related services are recognized as the services are performed in accordance with the methods applicable to application development and systems integration services described above. In software hosting arrangements, the rights provided to the customer, such as ownership of a license, contract termination provisions and the feasibility of the client to operate the software, are considered in determining whether the arrangement includes a license or a service. Sales and usage-based fees promised in exchange for licenses of intellectual property are not recognized as revenue until the uncertainty related to the variable amounts is resolved. Revenues related to software maintenance and support are recognized on a straight-line basis over the contract period.\nIncentive revenues, volume discounts, or any other form of variable consideration is estimated using either the sum of probability weighted amounts in a range of possible consideration amounts (expected value) or the single most likely amount in a range of possible consideration amounts (most likely amount), depending on which method better predicts the amount of consideration to which we may be entitled. We include in the transaction price variable consideration only to the extent it is probable that a significant reversal of revenues recognized will not occur when the uncertainty associated with the variable consideration is resolved. Our estimates of variable consideration and determination of whether and when to include estimated amounts in the transaction price may involve judgment and are based largely on an assessment of our anticipated performance and all information that is reasonably available to us.\nRevenues also include the reimbursement of out-of-pocket expenses. Our warranties generally provide a customer with assurance that the related deliverable will function as the parties intended because it complies with agreed-upon specifications and are therefore not considered an additional performance obligation in the contract.\nWe enter into arrangements that consist of multiple performance obligations. Such arrangements may include any combination of our deliverables. To the extent a contract includes multiple promised deliverables, we apply judgment to determine whether promised deliverables are capable of being distinct and are distinct in the context of the contract. If these criteria are not met, the promised deliverables are accounted for as a combined performance obligation. For arrangements with multiple distinct performance obligations, we allocate consideration among the performance obligations based on their relative standalone selling price. Standalone selling price is the price at which we would sell a promised good or service separately to the customer. When not directly observable, we typically estimate standalone selling price by using the expected cost plus margin or, in limited circumstances, the residual value approach. We typically establish a standalone selling price range for our deliverables, which is reassessed on a periodic basis or when facts and circumstances change.\nWe assess the timing of the transfer of goods or services to the customer as compared to the timing of payments to determine whether a significant financing component exists. As a practical expedient, we do not assess the existence of a significant financing component when the difference between payment and transfer of deliverables is a year or less. If the difference in timing arises for reasons other than the provision of finance to either the customer or us, no financing component is deemed to exist. The primary purpose of our invoicing terms is to provide customers with simplified and predictable ways of purchasing our services, not to receive or provide financing from or to customers. We do not consider set up or transition fees paid upfront by our customers to represent a financing component, as such fees are required to encourage customer commitment to the project and protect us from early termination of the contract.\nOur contracts may be modified to add, remove or change existing performance obligations. The accounting for modifications to our contracts involves assessing whether the services added to an existing contract are distinct and whether the pricing is at the standalone selling price. Services added that are not distinct are accounted for on a cumulative catch up basis, while those that are distinct are accounted for prospectively, either as a separate contract if the additional services are priced at the standalone selling price, or as a termination of the existing contract and creation of a new contract if not priced at the standalone selling price. Services added to our application development and systems integration service contracts are typically \nCognizant\nF-12\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nnot distinct, while services added to our other contracts, including application maintenance, quality engineering and assurance as well as business process services contracts, are typically distinct.\nWe enter into arrangements with third party suppliers to resell products or services. In such cases, we evaluate whether we are the principal (i.e., report revenues on a gross basis) or agent (i.e., report revenues on a net basis). In doing so, we evaluate whether we control the good or service before it is transferred to the customer. If we control the good or service before it is transferred to the customer, we are the principal; if not, we are the agent. Determining whether we control the good or service before it is transferred to the customer requires significant judgment. \nTrade Accounts Receivable, Contract Assets and Contract Liabilities.\n We classify our right to consideration in exchange for deliverables as either a receivable or a contract asset. A receivable is a right to consideration that is unconditional (i.e., only the passage of time is required before payment is due). For example, we recognize a receivable for revenues related to our time and materials and transaction or volume-based contracts when earned regardless of whether amounts have been billed. We present such receivables in \"Trade accounts receivable, net\" in our consolidated statements of financial position at their net estimated realizable value. A contract asset is a right to consideration that is conditional upon factors other than the passage of time. Contract assets are presented in \"Other current assets\" or \"Other noncurrent assets\" in our consolidated statements of financial position, based on the expected timing of billing, and primarily relate to unbilled amounts on fixed-price contracts utilizing the cost-to-cost method of revenue recognition. Our contract liabilities, or deferred revenue, consist of advance payments from clients and billings in excess of revenues recognized. We classify deferred revenue as current or noncurrent based on the timing of when we expect to recognize the revenues. \nOur contract assets and contract liabilities are reported on a net basis by contract at the end of each reporting period. The difference between the opening and closing balances of our contract assets and contract liabilities primarily results from the timing difference between our performance obligations and the client’s payment. We receive payments from clients based on the terms established in our contracts, which vary from contract to contract. \nAllowance for Credit Losses\n. We calculate expected credit losses for our trade accounts receivable and contract assets. Expected credit losses include losses expected based on known credit issues with specific customers as well as a general expected credit loss allowance based on relevant information, including historical loss rates, current conditions, and reasonable economic forecasts that affect collectibility\n. We update our allowance for credit losses \non a quarterly basis with changes in the allowance recognized in income from operations.\n \nCosts to Fulfill. \nRecurring operating costs for contracts with customers are recognized as incurred. Certain eligible, nonrecurring costs (i.e., set-up or transition costs) are capitalized when such costs (1) relate directly to the contract, (2) generate or enhance resources of the Company that will be used in satisfying the performance obligation in the future, and (3) are expected to be recovered. These costs are expensed ratably over the estimated life of the customer relationship, including expected contract renewals. In determining the estimated life of the customer relationship, we evaluate the average contract term on a portfolio basis by nature of the services to be provided, and apply judgment in evaluating the rate of technological and industry change. Capitalized amounts are monitored regularly for impairment. Impairment losses are recorded when projected remaining consideration that has not already been recognized as revenue less costs related to the services being provided are not sufficient to recover the carrying amount of the capitalized costs to fulfill. Costs to fulfill are recorded in \"Other noncurrent assets\" in our consolidated statements of financial position and the amortization expense of costs to fulfill is included in \"Cost of revenues\" in our consolidated statements of operations.\n \nStock-Based Compensation.\n Stock-based compensation expense for awards of equity instruments to employees and non-employee directors is determined based on the grant date fair value of those awards. We recognize these compensation costs net of an estimated forfeiture rate over the requisite service period of the award. Forfeitures are estimated on the date of grant and revised if actual or expected forfeiture activity differs materially from origin\nal estimates. Stock-based compensation expense relating to RSUs and PSUs is recognized as shares vest over the requisite service period. If the m\ninimum performance targets are not met, no compensation cost is recognized and any recognized compensation\n cost is reversed, except for awards subject to a market condition. The fair value of RSUs and PSUs is determined based on the number of stock units granted and the quoted price of our stock at the date of grant. The fair value of PSUs granted subject to a market condition is determined using a Monte Carlo valuation model.\nForeign Currency.\n The assets and liabilities of our foreign subsidiaries whose functional currency is not the U.S. dollar are translated into U.S. dollars at current exchange rates while revenues and expenses are translated at average monthly exchange rates. The resulting translation adjustments are recorded in the caption \"Accumulated other comprehensive income (loss)\" on the consolidated statements of financial position.\nForeign currency transactions and balances are those that are denominated in a currency other than the entity’s functional currency. An entity's functional currency is the currency of the primary economic environment in which it operates. The U.S. \nCognizant\nF-13\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \ndollar is the functional currency for some of our foreign subsidiaries. For these subsidiaries, transactions and balances denominated in the local currency are foreign currency transactions. Foreign currency transactions and balances related to non-monetary assets and liabilities are remeasured to the functional currency of the entity at historical exchange rates while monetary assets and liabilities are remeasured to the functional currency of the entity at current exchange rates. Foreign currency exchange gains or losses from remeasurement are included in the caption \"Foreign currency exchange gain (losses), net\" on our consolidated statements of operations together with gains or losses on our undesignated foreign currency hedges.\nDerivative Financial Instruments.\n Derivative financial instruments are recorded on our consolidated statements of financial position as either an asset or liability measured at its fair value as of the reporting date. Our derivative financial instruments consist primarily of foreign exchange forward and option contracts. For derivative financial instruments to qualify for hedge accounting, the following criteria must be met: (1) the hedging instrument must be designated as a hedge; (2) the hedged exposure must be specifically identifiable and must expose us to risk; and (3) it must be expected that a change in fair value of the hedging instrument and an opposite change in the fair value of the hedged exposure will have a high degree of correlation. Changes in our derivatives’ fair values are recognized in net income unless specific hedge accounting and documentation criteria are met (i.e., the instruments are designated and accounted for as hedges). We record the effective portion of the unrealized gains and losses on our derivative financial instruments that are designated as cash flow hedges in the caption \"Accumulated other comprehensive income (loss)\" in the consolidated statements of financial position. Any ineffectiven\ness or excluded portion of a designated cash flow hedge is recognized in net income. U\npon occurrence of the hedged transaction, the gains and losses on the derivative are recognized in net income.\nDefined Benefit Pension Plans\n. The funded status of the defined benefit pension plans, which is measured as the difference between the projected benefit obligation and the fair value of plan assets, is recognized on the consolidated statement of financial position. The projected benefit obligation is measured annually using actuarial valuation. Net periodic pension cost includes service cost, interest cost, expected return on plan assets, and amortization of gains and losses and prior service costs. Gains and losses and prior service costs are initially recognized as a component of other comprehensive income and subsequently amortized and recognized as a component of net periodic pension cost applying the requirements of applicable accounting guidance. Assumptions used in measuring the benefit obligation and net periodic pension cost, such as discount rates and expected return on plan assets, are reviewed annually and updated as needed.\nNonretirement Post-employment Benefit Plans. \nThe obligation is measured as the undiscounted amount of expected future payments of benefits earned for service to-date adjusted for expected forfeitures.\nIncome Taxes.\n We provide for income taxes utilizing the asset and liability method of accounting. Under this method, deferred income taxes are recorded to reflect the tax consequences in future years of differences between the tax basis of assets and liabilities and their financial reporting amounts at each balance sheet date, based on enacted tax laws and statutory tax rates applicable to the periods in which the differences are expected to affect taxable income. If it is determined that it is more likely than not that future tax benefits associated with a deferred income tax asset will not be realized, a valuation allowance is provided. The effect of a change in tax rates on deferred income tax assets and liabilities is recognized in the provision for income taxes in the period that includes the enactment date. \nOur provision for income taxes also includes the impact of reserves established for uncertain income tax positions, as well as the related interest, which may require us to apply judgment to complex issues and may require an extended period of time to resolve. We apply a “more likely than not” threshold when assessing the need for a reserve for an uncertain tax position, which involves significant judgment. Although we believe we have adequately reserved for our uncertain tax positions, no assurance can be given that the final outcome of these matters will not differ from our recorded amounts. We adjust these reserves in light of changing facts and circumstances, such as the closing of a tax audit or the expiration of the applicable statute of limitations. Additionally, we have tax positions that we believe are more likely than not to be realized and for which we have therefore not established a reserve\n. \nTo the extent that the final outcome of these matters differs from the amounts recorded, such differences may materially impact, positively or negatively, the provision for income taxes in the period in which such determination is made.\nEarnings Per Share.\n Basic EPS is computed by dividing earnings available to common stockholders by the weighted-average number of common shares outstanding for the period. Diluted EPS, computed using the treasury stock method, includes all potential dilutive common stock in the weighted average shares outstanding. We excluded less than \n1\n million of anti-dilutive shares in each of 2024, 2023 and 2022 from our diluted EPS calculation. We include PSUs in the dilutive common shares when they become contingently issuable per the authoritative guidance and exclude them when they are not contingently issuable.\nRestructuring Charges\n. Restructuring charges principally consist of severance and related separation costs, facility exit costs, third party and other costs necessary to the restructuring program. The Company accrues for severance and other related separation costs when it is probable that termination benefits will be paid and the amount is reasonably estimable. Recognition \nCognizant\nF-14\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nof employee severance and other separation costs is also dependent on requirements established by severance policy, statutory laws, or historical experience. Facility exit costs generally reflect the accelerated lease expense for right-of-use assets, expected lease termination costs, and asset impairments in connection with closure of certain sites, net of gains on exit-related disposals. Third party and other costs include certain non-facility related asset impairments and professional services fees directly related to the restructuring program.\nRestructuring costs are recorded in “Restructuring charges” in the consolidated statements of operations. The restructuring liability related to accrued employee separation costs is included in \"Accrued expenses and other current liabilities\" in the consolidated statements of financial position.\nRecently Adopted Accounting Pronouncements\nDate Issued and Topic\nDate Adopted and Method\nDescription\nImpact\nNovember 2023\nSegment Reporting (Topic 280): Improvements to Reportable Segment Disclosures\nAnnual period starting in 2024 and interim periods starting in 2025\nRetrospective basis\nThe standard requires enhanced segment disclosures but does not change the definition of a segment or the guidance for determining a reportable segment. The amendments require disclosure of significant segment expenses regularly provided to the CODM included within segment operating profit or loss and a description of how the CODM utilizes segment operating profit or loss to assess segment performance and allocating resources.  The new standard also allows companies to disclose multiple measures of segment profit or loss if those measures are used to allocate resources. \nThe adoption did not have significant impact on our disclosures. See \nNote 1\n8\n for disclosures that reflect the adoption of this standard.\nNew Accounting Pronouncements\nDate Issued and Topic\nEffective Date\nDescription\nImpact\nDecember 2023\nIncome Taxes (Topic 740): Improvements to Income Tax Disclosures\nAnnual period starting in 2025 \nProspective basis \nThe standard requires enhanced income tax disclosures primarily related to the income tax rate reconciliation and income taxes paid information.  \nWe are currently evaluating the impact of the new standard on our disclosures. \nNovember 2024\nIncome Statement—Reporting Comprehensive Income—Expense Disaggregation Disclosures (Subtopic 220-40)\nAnnual period starting in 2027 and interim periods starting in 2028 \nProspective basis \nThe standard is intended to improve financial reporting by requiring that public business entities disclose additional information about specific expense categories in the notes to financial statements at interim and annual reporting periods.\nWe are currently evaluating the impact of the new standard on our disclosures. \nCognizant\nF-15\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nNote 2 — Revenues\nDisaggregation of Revenues\nThe tables below present disaggregated revenues from contracts with clients by client location, service line and contract type for each of our reportable business segments. We believe this disaggregation best depicts how the nature, amount, timing and uncertainty of revenues and cash flows are affected by industry, market and other economic factors. Our consulting and technology services include consulting, application development, systems integration, quality engineering and assurance services as well as software solutions and related services while our outsourcing services include application maintenance, infrastructure and security as well as business process services. Revenues are attributed to geographic regions based upon client location, which is the client's billing address. Substantially all revenues in the North America region relate to clients in the United States.\nYear Ended December 31, 2024\n(in millions)\nHS\nFS\nP&R\nCMT\nTotal\nRevenues\nGeography:\nNorth America\n$\n5,072\n \n$\n4,075\n \n$\n3,272\n \n$\n2,279\n \n$\n14,698\n \nUnited Kingdom\n186\n \n572\n \n558\n \n511\n \n1,827\n \nContinental Europe\n559\n \n613\n \n605\n \n155\n \n1,932\n \nEurope - Total\n745\n \n1,185\n \n1,163\n \n666\n \n3,759\n \nRest of World \n115\n \n493\n \n347\n \n324\n \n1,279\n \nTotal\n$\n5,932\n \n$\n5,753\n \n$\n4,782\n \n$\n3,269\n \n$\n19,736\n \nService line:\nConsulting and technology services \n$\n3,456\n \n$\n4,022\n \n$\n3,193\n \n$\n1,821\n \n$\n12,492\n \nOutsourcing services\n2,476\n \n1,731\n \n1,589\n \n1,448\n \n7,244\n \nTotal\n$\n5,932\n \n$\n5,753\n \n$\n4,782\n \n$\n3,269\n \n$\n19,736\n \nType of contract:\nTime and materials\n$\n1,968\n \n$\n3,188\n \n$\n1,995\n \n$\n1,775\n \n$\n8,926\n \nFixed-price\n2,878\n \n2,384\n \n2,442\n \n1,324\n \n9,028\n \nTransaction or volume-based\n1,086\n \n181\n \n345\n \n170\n \n1,782\n \nTotal\n$\n5,932\n \n$\n5,753\n \n$\n4,782\n \n$\n3,269\n \n$\n19,736\n \nCognizant\nF-16\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nYear Ended December 31, 2023\n(in millions)\nHS\nFS\nP&R\nCMT\nTotal\nRevenues \nGeography:\nNorth America\n$\n4,865\n \n$\n4,091\n \n$\n3,102\n \n$\n2,205\n \n$\n14,263\n \nUnited Kingdom\n167\n \n613\n \n534\n \n571\n \n1,885\n \nContinental Europe\n533\n \n605\n \n612\n \n159\n \n1,909\n \nEurope - Total\n700\n \n1,218\n \n1,146\n \n730\n \n3,794\n \nRest of World \n109\n \n500\n \n380\n \n307\n \n1,296\n \nTotal\n$\n5,674\n \n$\n5,809\n \n$\n4,628\n \n$\n3,242\n \n$\n19,353\n \nService line:\nConsulting and technology services \n$\n3,238\n \n$\n3,965\n \n$\n3,010\n \n$\n1,751\n \n$\n11,964\n \nOutsourcing services\n2,436\n \n1,844\n \n1,618\n \n1,491\n \n7,389\n \nTotal\n$\n5,674\n \n$\n5,809\n \n$\n4,628\n \n$\n3,242\n \n$\n19,353\n \nType of contract:\nTime and materials\n$\n2,004\n \n$\n3,215\n \n$\n1,837\n \n$\n1,832\n \n$\n8,888\n \nFixed-price\n2,600\n \n2,369\n \n2,435\n \n1,260\n \n8,664\n \nTransaction or volume-based\n1,070\n \n225\n \n356\n \n150\n \n1,801\n \nTotal\n$\n5,674\n \n$\n5,809\n \n$\n4,628\n \n$\n3,242\n \n$\n19,353\n \nYear Ended December 31, 2022\n(in millions)\nHS\nFS\nP&R\nCMT\nTotal\nRevenues \nGeography:\nNorth America\n$\n4,853\n \n$\n4,312\n \n$\n3,078\n \n$\n2,192\n \n$\n14,435\n \nUnited Kingdom\n171\n \n599\n \n521\n \n519\n \n1,810\n \nContinental Europe\n483\n \n590\n \n585\n \n137\n \n1,795\n \nEurope - Total\n654\n \n1,189\n \n1,106\n \n656\n \n3,605\n \nRest of World \n124\n \n571\n \n382\n \n311\n \n1,388\n \nTotal\n$\n5,631\n \n$\n6,072\n \n$\n4,566\n \n$\n3,159\n \n$\n19,428\n \nService line:\nConsulting and technology services \n$\n3,226\n \n$\n4,207\n \n$\n3,017\n \n$\n1,775\n \n$\n12,225\n \nOutsourcing services\n2,405\n \n1,865\n \n1,549\n \n1,384\n \n7,203\n \nTotal\n$\n5,631\n \n$\n6,072\n \n$\n4,566\n \n$\n3,159\n \n$\n19,428\n \nType of contract:\nTime and materials\n$\n2,010\n \n$\n3,516\n \n$\n1,856\n \n$\n1,797\n \n$\n9,179\n \nFixed-price\n2,471\n \n2,265\n \n2,357\n \n1,206\n \n8,299\n \nTransaction or volume-based\n1,150\n \n291\n \n353\n \n156\n \n1,950\n \nTotal\n$\n5,631\n \n$\n6,072\n \n$\n4,566\n \n$\n3,159\n \n$\n19,428\n \nCognizant\nF-17\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nCosts to Fulfill\nThe following table shows significant movements in the capitalized costs to fulfill: \n(in millions)\n2024\n2023\nBeginning balance\n$\n245\n \n$\n265\n \nCosts capitalized\n53\n \n67\n \nAmortization expense\n(\n89\n)\n(\n87\n)\nEnding balance\n$\n209\n \n$\n245\n \nCosts to obtain contracts were immaterial for the periods disclosed.\nContract Balances\nThe table below shows significant movements in contract assets (current and noncurrent):\n(in millions)\n2024\n2023\nBeginning balance\n$\n316\n \n$\n326\n \nRevenues recognized during the period but not billed\n358\n \n308\n \nAmounts reclassified to trade accounts receivable\n(\n288\n)\n(\n327\n)\nAmounts acquired in business combinations\n—\n \n9\n \nEnding balance\n$\n386\n \n$\n316\n \nThe table below shows significant movements in the deferred revenue balances (current and noncurrent):\n(in millions)\n2024\n2023\nBeginning balance\n$\n427\n \n$\n417\n \nAmounts billed but not recognized as revenues\n421\n \n406\n \nRevenues recognized related to the beginning balance of deferred revenue\n(\n380\n)\n(\n409\n)\nAmounts acquired in business combinations\n12\n \n13\n \nEnding balance\n$\n480\n \n$\n427\n \nRevenues recognized during the year ended December 31, 2024 for performance obligations satisfied or partially satisfied in previous periods were immaterial.\nRemaining Performance Obligations\nAs of December 31, 2024, the aggregate amount of transaction price allocated to remaining performance obligations, was $\n4,911\n million, of which approximately \n35\n% is expected to be recognized as revenues within \n1\n year, approximately \n55\n% is expected to be recognized as revenues within \n2\n years and approximately \n90\n% is expected to be recognized as revenues within \n5\n years.\n \nDisclosure is not required for performance obligations that meet any of the following criteria: \n(1)\ncontracts with a duration of one year or less as determined under ASC Topic 606: \"Revenue from Contracts with Customers,\"\n(2)\ncontracts for which we recognize revenues based on the right to invoice for services performed, \n(3)\nvariable consideration allocated entirely to a wholly unsatisfied performance obligation or to a wholly unsatisfied promise to transfer a distinct good or service that forms part of a single performance obligation in accordance with ASC 606-10-25-14(b), for which the criteria in ASC 606-10-32-40 have been met, or \n(4)\nvariable consideration in the form of a sales-based or usage-based royalty promised in exchange for a license of intellectual property. \nMany of our performance obligations meet one or more of these exemptions and therefore are not included in the remaining performance obligation amount disclosed above.\nCognizant\nF-18\nDecember 31, 2024 Form 10-K\nTrade Accounts Receivable and Allowance for Credit Losses\nThe following table presents the activity in the allowance for credit losses for the trade accounts receivable:\n(in millions)\n2024\n2023\n2022\nBeginning balance\n$\n32\n \n$\n43\n \n$\n50\n \nCredit loss expense \n(1)\n12\n \n12\n \n9\n \nWrite-offs charged against the allowance\n(\n18\n)\n(\n23\n)\n(\n16\n)\nEnding balance\n$\n26\n \n$\n32\n \n$\n43\n \n(1)\nReported in \"Selling, general and administrative expenses\" in our consolidated statements of operations.\nNote 3 — Business Combinations\nAcquisitions completed during each of the three years ended December 31, 2024, 2023 and 2022 were not individually or in the aggregate material to our operations. Accordingly, pro forma results have not been presented. The primary items that generated goodwill are the acquired assembled workforces and synergies between the acquired companies and us, neither of which qualify as an identifiable intangible asset.\n2024\nOn January 22, 2024, through the execution of a share purchase agreement, \nwe acquired \n100\n% owners\nhip in \nThirdera, an Elite ServiceNow Partner specializing in advisory, implementation and optimization solutions related to the ServiceNow platform.\nOn August 26, 2024, through the execution of a merger agreement, we acquired \n100\n% ownership in Belcan, a leading global supplier of engineering research & development services for the commercial aerospace, defense, space, marine and industrial verticals. We paid $\n1,195\n million in cash, net of cash acquired, and issued \n1,470,589\n shares of our Class A common stock, valued at $\n113\n million, in connection with our acquisition of Belcan.\nThe allocations of purchase price to the fair value of the aggregate assets acquired and li\nabilities assumed were as follows: \n(in millions)\nThirdera\nBelcan\nTotal\nWeighted Average Useful Life\nCash\n$\n8\n \n$\n55\n \n$\n63\n \nTrade accounts receivable\n21\n \n173\n \n194\n \nOther current assets\n11\n \n22\n \n33\n \nProperty and equipment and other noncurrent assets\n2\n \n22\n \n24\n \nOperating lease assets\n— \n55\n \n55\n \nNon-deductible goodwill\n180\n \n614\n \n794\n \nTax-deductible goodwill\n164\n \n— \n164\n \nCustomer relationship assets\n73\n \n539\n \n612\n \n11.0\n years\nOther definite-lived intangible assets\n1\n \n— \n1\n \n1.0\n years\nIndefinite-lived intangible assets\n— \n45\n \n45\n \nOperating lease liabilities, current\n— \n(\n8\n)\n(\n8\n)\nOther current liabilities\n(\n29\n)\n(\n72\n)\n(\n101\n)\nDeferred income tax liabilities, net\n(\n3\n)\n(\n34\n)\n(\n37\n)\nOperating lease liabilities, noncurrent\n— \n(\n48\n)\n(\n48\n)\nPurchase price\n$\n428\n \n$\n1,363\n \n$\n1,791\n \nGoodwill from our acquisition of Thirdera is expected to benefit all of our reportable segments and has been allocated as such. \nGoodwill from our acquisition of Belcan has been allocated to our Product and Resources segment. \nFor the year ended \nDecember 31, 2024\n, revenues from acquisitions completed in \n2024\n, since the dates of acquisition, wer\ne $\n384\n million. The above allocations are preliminary and will be finalized as soon as practicable within the measurement period, but in no event later than one year following the date of acquisition. \nCognizant\nF-19\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \n2023\nIn 2023\n, we acquired \n100\n% owners\nhip in each of the following:\n•\nCertain net assets of OneSource Virtual, the professional and application management services business of OneSource Virtual, Inc. and OneSource Virtual (UK) Ltd., a leading provider of Workday services, solutions and products, acquired to complement our existing finance and human resources advisory implementation services related to Workday (acquired January 1, 2023), and\n•\nMobica, an IoT software engineering services provider, acquired to expand our IoT embedded software engineering capabilities (acquired March 10, 2023).\nThe allocations of purchase price to the fair value of the aggregate assets acquired and li\nabilities assumed were as follows: \n(in millions)\nOneSource Virtual\nMobica\nTotal\nWeighted Average Useful Life\nCash\n$\n—\n \n$\n20\n \n$\n20\n \nTrade accounts receivable\n—\n \n10\n \n10\n \nOther current assets\n4\n \n8\n \n12\n \nProperty and equipment and other assets\n1\n \n6\n \n7\n \nNon-deductible goodwill\n18\n \n202\n \n220\n \nTax-deductible goodwill\n88\n \n—\n \n88\n \nCustomer relationship assets\n11\n \n120\n \n131\n \n10.9\n years\nCurrent liabilities\n(\n18\n)\n(\n9\n)\n(\n27\n)\nNoncurrent liabilities\n(\n1\n)\n(\n32\n)\n(\n33\n)\nPurchase price\n$\n103\n \n$\n325\n \n$\n428\n \nFor the year ended December 31, 2023, revenues from acquisitions completed in 2023, since the dates of acquisition, wer\ne $\n130\n million. \n2022\nIn 2022, we acquired \n100\n% owners\nhip in each of the following:\n•\nAustinCSI, a digital transformation consultancy specializing in enterprise cloud and data analytics advisory services, acquired to complement our technology and industry expertise (acquired December 15, 2022), and\n•\nUtegration, a full service consulting and solutions provider specializing in SAP technology and SAP-certified products for the energy and utilities sectors, acquired to expand and strengthen our industry expertise in our SAP practice (acquired December 19, 2022).\nThe allocations of purchase price to the fair value of the assets acquired and li\nabilities assumed were as follows: \n(dollars in millions)\nAustinCSI\nUtegration\nTotal\nWeighted Average Useful Life\nCash\n$\n—\n \n$\n5\n \n$\n5\n \nTrade accounts receivable\n9\n \n19\n \n28\n \nProperty and equipment and other assets\n4\n \n6\n \n10\n \nNon-deductible goodwill\n—\n \n23\n \n23\n \nTax-deductible goodwill\n83\n \n98\n \n181\n \nCustomer relationship assets\n69\n \n82\n \n151\n \n12.7\n years\nOther intangible assets\n—\n \n2\n \n2\n \n6.7\n years\nCurrent liabilities\n(\n3\n)\n(\n18\n)\n(\n21\n)\nNoncurrent liabilities\n(\n1\n)\n(\n3\n)\n(\n4\n)\nPurchase price\n$\n161\n \n$\n214\n \n$\n375\n \nFor the year ended December 31, 2022, revenues from acquisitions completed in 2022, since the dates of acquisition, were\n immaterial.\n \nCognizant\nF-20\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nNote 4 — Restructuring Charges\nAt the end of 2024, we completed our NextGen program, which began in the second quarter of 2023 and was aimed at  simplifying our operating model, optimizing corporate functions and consolidating and realigning office space to reflect the post-pandemic hybrid work environment.\nThe total costs related to our NextGen program are reported in \"Restructuring charges\" in our consolidated statements of operations. We do not allocate these charges to individual segments in internal management reports used by the CODM. Accordingly, such expenses are separately disclosed in our segment reporting as “unallocated costs.” See \nNote 18\n. The costs related to our NextGen program were as follows for the years ended December 31:\n(in millions)\n2024\n2023\nEmployee separation costs\n$\n85\n \n$\n115\n \nFacility exit costs \n(1)\n36\n \n108\n \nThird party and other costs \n(2)\n13\n \n6\n \nTotal restructuring charges\n$\n134\n \n$\n229\n \n(1)\nFor the year ended December 31, 2024, facility exit costs include lease restructuring of $\n23\n million and accelerated depreciation charges of $\n13\n million. For the year ended December 31, 2023, facility exit costs include lease restructuring of $\n71\n million, accelerated depreciation charges of $\n36\n million and impairment of long-lived assets of $\n1\n million.\n(2)\nThird party and other costs include certain non-facility related asset impairments and professional services fees directly related to the NextGen program.\n \nChanges in our accrued employee separation costs included in \"Accrued expenses and other current liabilities\" in our consolidated statements of financial position are presented in the table below for the years ended December 31: \n(in millions)\n2024\n2023\nBeginning balance\n$\n42\n \n$\n—\n \nEmployee separation costs accrued\n85\n \n115\n \nPayments made\n(\n92\n)\n(\n73\n)\nEnding balance\n$\n35\n \n$\n42\n \nThere were no restructuring charges during 2022.\nNote 5 — Investments\nOur investments were as follows as of December 31:\n(in millions)\n2024\n2023\nShort-term investments:\nEquity investment security\n$\n11\n \n$\n11\n \nHeld-to-maturity investment securities\n—\n \n3\n \nTime deposits\n1\n \n—\n \nTotal short-term investments\n$\n12\n \n$\n14\n \nLong-term investments:\nOther investments\n$\n90\n \n$\n80\n \nRestricted time deposits\n(1)\n—\n \n355\n \nTotal long-term investments\n$\n90\n \n$\n435\n \n(1)\nAs of December 31, 2023 the balance of restricted time deposits contained $\n96\n million of restricted cash equivalents. See \nNote 11\n.\nEquity Investment Security\nOur equity investment security is a U.S. dollar denominated investment in a fixed income mutual fund. Realized and unrealized gains and losses were immaterial for each of the years ended December 31, 2024, 2023 and 2022.\nCognizant\nF-21\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nOther Investments\nAs of December 31, 2024 and 2023, we had an equity method investment of $\n84\n million and $\n74\n million, respectively, in the technology sector. Additionally, as of each of December 31, 2024 and 2023, we had equity securities without a readily determinable fair value of $\n6\n million.\n \nNote 6 — Property and Equipment, net\nProperty and equipment were as follows as of December 31:\nEstimated Useful Life\n2024\n2023\n(in years)\n(in millions)\nBuildings\n30\n$\n736\n \n$\n769\n \nComputer equipment\n3\n – \n5\n811\n \n794\n \nComputer software\n3\n – \n8\n1,024\n \n1,007\n \nFurniture and equipment\n5\n – \n9\n716\n \n733\n \nLand\n6\n \n7\n \nCapital work-in-progress\n115\n \n88\n \nLeasehold improvements\nShorter of the lease term or\nthe life of the asset\n373\n \n422\n \nSub-total\n3,781\n \n3,820\n \nAccumulated depreciation and amortization\n(\n2,787\n)\n(\n2,772\n)\nProperty and equipment, net\n$\n994\n \n$\n1,048\n \nDepreciation and amortization expense related to property and equipment was $\n354\n million, $\n390\n million and $\n385\n million for the years ended December 31, 2024, 2023 and 2022, respectively. For the years ended December 31, 2024 and 2023, $\n13\n million and $\n36\n million, respectively, of our depreciation and amortization expense was reported in \"Restructuring charges\". As of December 31, 2024, we had $\n9\n million of physical assets held for sale reported in \"Other current assets\". We had \nno\n assets held for sale as of December 31, 2023.\nThe gross amount of property and equipment recorded under finance leases was $\n30\n million and $\n25\n million as of December 31, 2024 and 2023, respectively. Accumulated amortization for our ROU finance lease assets was $\n16\n million and $\n13\n million as of December 31, 2024 and 2023, respectively. Amortization expense related to our ROU finance lease assets was $\n5\n million, $\n4\n million and $\n4\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\nThe gross amount of property and equipment recorded for software to be sold, leased or marketed reported in the caption \"Computer software\" above was $\n338\n million and $\n279\n million as of December 31, 2024 and 2023, respectively. Accumulated amortization for software to be sold, leased or marketed was $\n210\n million and $\n177\n million as of December 31, 2024 and 2023, respectively. Amortization expense for software to be sold, leased or marketed recorded as property and equipment was $\n36\n million,  $\n37\n million, and $\n37\n million for the years ended December 31, 2024,  2023 and 2022, respectively.\nCognizant\nF-22\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nNote 7 — Leases\nThe following table provides information on the components of our operating and finance leases included in our consolidated statement of financial position as of December 31:\nLeases\nLocation on Statement of Financial Position\n2024\n2023\nAssets\n(in millions)\nROU operating lease assets\nOperating lease assets, net\n$\n552\n \n$\n611\n \nROU finance lease assets\nProperty and equipment, net\n14\n \n12\n \nTotal \n$\n566\n \n$\n623\n \nLiabilities\nCurrent\nOperating lease\nOperating lease liabilities\n$\n152\n \n$\n153\n \nFinance lease\nAccrued expenses and other current liabilities\n8\n \n8\n \nNoncurrent\nOperating lease\nOperating lease liabilities, noncurrent\n420\n \n523\n \nFinance lease\nOther noncurrent liabilities\n15\n \n16\n \nTotal\n$\n595\n \n$\n700\n \nFor the years ended December 31, 2024, 2023 and 2022, our operating lease costs were $\n216\n million, $\n304\n million and $\n256\n million, respectively, including variable lease costs of $\n23\n million, $\n21\n million and $\n17\n million, respectively\n. \nOur short-term lease rental expense was $\n11\n million, $\n15\n million and $\n21\n million for the years ended December 31, 2024, 2023 and 2022, respectively. Lease interest expense related to our finance leases for each of the years ended December 31, 2024, 2023 and 2022 was immaterial.\nThe following table provides information on the weighted average remaining lease term and weighted average discount rate for our operating leases as of December 31:\nOperating Lease Term and Discount Rate\n2024\n2023\nWeighted average remaining lease term\n5.3\n years\n5.6\n years\nWeighted average discount rate\n5.5\n \n%\n5.4\n \n%\nThe following table provides supplemental cash flow and non-cash information related to our operating leases for the years ended December 31:\n(in millions)\n2024\n2023\n2022\nCash paid for amounts included in the measurement of operating lease liabilities\n$\n251\n \n$\n240\n \n$\n241\n \nROU assets obtained in exchange for operating lease liabilities\n123\n \n86\n \n164\n \nReduction of ROU assets and lease liabilities as a result of our NextGen program\n(\n62\n)\n(\n110\n)\n— \nCash paid for amounts included in the measurement of finance lease liabilities and ROU assets obtained in exchange for finance lease liabilities were each immaterial for each of the years ended December 31, 2024, 2023 and 2022. \nThe following table provides the schedule of maturities of our operating lease liabilities and a reconciliation of the undiscounted cash flows to the operating lease liabilities recognized in the statement of financial position as of December 31:\n(in millions)\n2024\n2025\n$\n179\n \n2026\n138\n \n2027\n110\n \n2028\n84\n \n2029\n50\n \nThereafter\n98\n \nTotal operating lease payments\n659\n \nInterest\n(\n87\n)\nTotal operating lease liabilities\n$\n572\n \nCognizant\nF-23\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nAs of December 31, 2024, additional obligations related to operating leases whose lease term had yet to commence were immaterial.\nNote 8 — Goodwill and Intangible Assets, net\nChanges in goodwill by our reportable business segments were as follows for the years ended December 31, 2024 and 2023: \n(in millions)\nJanuary 1, 2024\nGoodwill Additions\nForeign Currency Translation Adjustments\nDecember 31, 2024\nHealth Sciences\n$\n2,840\n \n$\n68\n \n$\n(\n13\n)\n$\n2,895\n \nFinancial Services\n1,109\n \n48\n \n(\n28\n)\n1,129\n \nProducts and Resources\n1,217\n \n698\n \n(\n31\n)\n1,884\n \nCommunications, Media and Technology\n919\n \n144\n \n(\n18\n)\n1,045\n \nTotal goodwill\n$\n6,085\n \n$\n958\n \n$\n(\n90\n)\n$\n6,953\n \n(in millions)\nJanuary 1, 2023\nGoodwill Additions and Adjustments\nForeign Currency Translation Adjustments\nDecember 31, 2023\nHealth Sciences\n$\n2,819\n \n$\n15\n \n$\n6\n \n$\n2,840\n \nFinancial Services\n1,073\n \n19\n \n17\n \n1,109\n \nProducts and Resources\n1,062\n \n137\n \n18\n \n1,217\n \nCommunications, Media and Technology\n756\n \n148\n \n15\n \n919\n \nTotal goodwill\n$\n5,710\n \n$\n319\n \n$\n56\n \n$\n6,085\n \nBased on our most recent goodwill impairment assessment performed as o\nf October 31, 2024, we \nconcluded that the goodwill in each of our reporting units was not at risk of impairment. We have not recognized any impairment losses on our goodwill. \nComponents of intangible assets were as follows as of December 31:\n \n2024\n2023\n(in millions)\nGross Carrying\nAmount\nAccumulated\nAmortization\nNet Carrying\nAmount\nGross Carrying\nAmount\nAccumulated\nAmortization\nNet Carrying\nAmount\nCustomer relationships\n$\n2,534\n \n$\n(\n1,068\n)\n$\n1,466\n \n$\n1,956\n \n$\n(\n902\n)\n$\n1,054\n \nDeveloped technology\n384\n \n(\n379\n)\n5\n \n384\n \n(\n376\n)\n8\n \nIndefinite lived trademarks\n116\n \n— \n116\n \n72\n \n— \n72\n \nFinite lived trademarks and other\n81\n \n(\n69\n)\n12\n \n82\n \n(\n67\n)\n15\n \nTotal intangible assets\n$\n3,115\n \n$\n(\n1,516\n)\n$\n1,599\n \n$\n2,494\n \n$\n(\n1,345\n)\n$\n1,149\n \nOther than certain trademarks with indefinite lives, our intangible assets have finite lives and, as such, are subject to amortization. Amortization of intangible assets totaled $\n188\n million, $\n165\n million and $\n184\n million for the years ended December 31, 2024, 2023 and 2022, respectively. \nThe following table provides the estimated amortization expense related to our existing intangible assets for the next five years.\n(in millions)\nEstimated Amortization\n2025\n$\n214\n \n2026\n211\n \n2027\n203\n \n2028\n182\n \n2029\n165\n \nCognizant\nF-24\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nNote 9 — Accrued Expenses and Other Current Liabilities\nAccrued expenses and other current liabilities were as follows as of December 31:\n(in millions)\n2024\n2023\nCompensation and benefits\n$\n1,499\n \n$\n1,511\n \nCustomer volume and other incentives\n247\n \n241\n \nIncome taxes\n100\n \n27\n \nProfessional fees\n171\n \n146\n \nOther\n593\n \n500\n \nTotal accrued expenses and other current liabilities\n$\n2,610\n \n$\n2,425\n \nNote 10 — Debt\nWe entered into the Credit Agreement providing for a $\n650\n million Term Loan and a $\n1,850\n million unsecured revolving credit facility, which are each due to mature in October 2027. We are required under the Credit Agreement to make scheduled quarterly principal payments on the Term Loan. During the third quarter of 2024, we borrowed $\n600\n million under our revolving credit facility to partially fund the acquisition of Belcan. We repaid $\n300\n million during the fourth quarter of 2024, leaving $\n300\n million of notes outstanding under the revolving credit facility as of December 31, 2024.\nThe Credit Agreement requires interest to be paid, at our option, at either the Term Benchmark, Adjusted Daily Simple RFR or the ABR Rate (each as defined in the Credit Agreement), plus, in each case, an Applicable Margin (as defined in the Credit Agreement). Initially, the Applicable Margin is \n0.875\n% with respect to Term Benchmark loans and RFR loans and \n0.00\n% with respect to ABR loans. Subsequently, the Applicable Margin with respect to Term Benchmark loans and RFR loans will be determined quarterly and may range from \n0.75\n% to \n1.125\n%, depending on our public debt ratings or, if we have not received public debt ratings, from \n0.875\n% to \n1.125\n%, depending on our Leverage Ratio, which is the ratio of indebtedness for borrowed money to Consolidated EBITDA, as defined in the\n Credit Agreement. Since issuance of the Term Loan, t\nhe Term Loan has been a Term Benchmark loan. The Credit Agreement contains customary affirmative and negative covenants as well as a financial covenant. The financial covenant is tested at the end of each fiscal quarter and requires us to maintain a Leverage Ratio not in excess of \n3.50\n:1.00, or for a period of up to four quarters following certain material acquisitions, \n3.75\n:1.00. We were in compliance with all debt covenants and representations of the Credit Agreement as of December 31, 2024.\nShort-term Debt\nAs of each of December 31, 2024 and 2023, we had $\n33\n million of short-term debt related to current maturities of our Term Loan, with a weighted average interest rate of \n5.3\n% and \n6.3\n%, respectively.\nLong-term Debt\nThe following table summarizes the long-term debt balances as of December 31:\n(in millions)\n2024\n2023\nNotes outstanding under revolving credit facility\n$\n300\n \n$\n—\n \nTerm Loan\n610\n \n642\n \nLess:\nCurrent maturities - Term Loan\n(\n33\n)\n(\n33\n)\nUnamortized deferred financing costs\n(\n2\n)\n(\n3\n)\nLong-term debt, net of current maturities\n$\n875\n \n$\n606\n \nThe carrying value of our debt approximated its fair value as of each of December 31, 2024 and 2023.\nThe following represents the schedule of maturities of our Term Loan:\nYear\nAmounts (in millions)\n2025\n$\n33\n \n2026\n33\n \n2027\n544\n \nTotal\n$\n610\n \nCognizant\nF-25\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nNote 11 — Income Taxes\nIncome before provision for income taxes shown below is based on the geographic location to which such income was attributed for years ended December 31:\n(in millions)\n2024\n2023\n2022\nUnited States\n$\n906\n \n$\n813\n \n$\n975\n \nForeign\n2,032\n \n1,974\n \n2,041\n \nIncome before provision for income taxes\n$\n2,938\n \n$\n2,787\n \n$\n3,016\n \nThe provision for income taxes consisted of the following components for the years ended December 31:\n(in millions)\n2024\n2023\n2022\nCurrent:\nFederal and state\n$\n426\n \n$\n522\n \n$\n492\n \nForeign\n642\n \n485\n \n511\n \nTotal current provision\n1,068\n \n1,007\n \n1,003\n \nDeferred:\nFederal and state\n(\n229\n)\n(\n354\n)\n(\n240\n)\nForeign\n(\n126\n)\n15\n \n(\n33\n)\nTotal deferred income tax (benefit)\n(\n355\n)\n(\n339\n)\n(\n273\n)\nTotal provision for income taxes\n$\n713\n \n$\n668\n \n$\n730\n \nWe are involved in two separate ongoing disputes with the ITD in connection with previously disclosed share repurchase transactions undertaken by CTS India in 2013 and 2016 to repurchase shares from its shareholders (non-Indian Cognizant entities) valued at $\n523\n million and $\n2.8\n billion, respectively. \nThe 2016 transaction was undertaken pursuant to a plan approved by the High Court in Chennai, India, and resulted in the payment of $\n135\n million in Indian income taxes - an amount we believe includes all the applicable taxes owed for this transaction under Indian law. In March 2018, the ITD asserted that it is owed an additional \n33\n billion Indian rupees ($\n386\n million at the December 31, 2024 exchange rate) on the 2016 transaction. We deposited \n5\n billion Indian rupees, representing \n15\n% of the disputed tax amount related to the 2016 transaction, with the ITD. Additionally, certain time deposits of CTS India were placed under lien in favor of the ITD, representing the remainder of the disputed tax amount. As of December 31, 2023, the balance of deposits under lien was \n30\n billion Indian rupees, including previously earned interest, or $\n355\n million, was presented in \"Long-term investments.\"\nIn April 2020, we received a formal assessment from the ITD on the 2016 transaction, which is consistent with the ITD's previous assertions. Our appeal was ruled on unfavorably by the CITA in March 2022 and by the ITAT in September 2023. We filed an appeal against the order of the ITAT with the High Court. On January 8, 2024, the SCI ruled that, in order to proceed with the appeal, we must deposit \n30\n billion Indian rupees, \nrepresenting the time deposits of CTS India under lien, on the condition that, if CTS India prevails at the High Court, the amount deposited will be returned to CTS India, along with interest accrued, within four weeks of the judgment. We made the required deposit in January 2024 and, in April 2024, the case commenced before the High Court.\nAs of December 31, 2024 and 2023, the deposit with the ITD was $\n403\n million and $\n60\n million, respectively at December 31, 2024 and 2023 exchange rates, respectively presented in \"Other noncurrent assets\". As of December 31, 2023, $\n96\n million of the $\n355\n million in deposits under lien were held in time deposits with a maturity of less than 30 days qualifying as cash equivalent instruments and thus were considered restricted cash equivalents as of December 31, 2023.\nThe dispute in relation to the 2013 share repurchase transaction is also in litigation. At this time, the ITD has not made specific demands with regards to the 2013 transaction.\nWe continue to believe we have paid all applicable taxes owed on both the 2016 and the 2013 transactions and we continue to defend our positions with respect to both matters. Accordingly, we have not recorded any reserves for these matters as of December 31, 2024.\nCognizant\nF-26\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \n \nThe reconciliation between the U.S. federal statutory rate and our effective income tax rate were as follows for the years ended December 31:\n \n(Dollars in millions)\n2024\n%\n2023\n%\n2022\n%\nTax expense, at U.S. federal statutory rate\n$\n617\n \n21.0\n \n$\n585\n \n21.0\n \n$\n633\n \n21.0\n \nState and local income taxes, net of federal benefit\n74\n \n2.5\n \n55\n \n2.0\n \n63\n \n2.1\n \nNon-taxable income for Indian tax purposes\n—\n \n—\n \n—\n \n—\n \n(\n6\n)\n(\n0.2\n)\nRate differential on foreign earnings\n104\n \n3.5\n \n95\n \n3.4\n \n98\n \n3.2\n \nRecognition of benefits related to uncertain tax positions\n(\n15\n)\n(\n0.5\n)\n(\n33\n)\n(\n1.2\n)\n(\n43\n)\n(\n1.4\n)\nCredits and other incentives\n(\n57\n)\n(\n1.9\n)\n(\n37\n)\n(\n1.3\n)\n(\n17\n)\n(\n0.6\n)\nOther\n(\n10\n)\n(\n0.3\n)\n3\n \n0.1\n \n2\n \n0.1\n \nTotal provision for income taxes\n$\n713\n \n24.3\n \n$\n668\n \n24.0\n \n$\n730\n \n24.2\n \nThe significant components of deferred income tax assets and liabilities recorded on the consolidated statements of financial position were as follows as of December 31:\n(in millions)\n2024\n2023\nDeferred income tax assets:\nNet operating losses\n$\n50\n \n$\n52\n \nRevenue recognition (including intercompany revenue)\n51\n \n126\n \nCompensation and benefits\n164\n \n172\n \nCredit carryforwards\n11\n \n16\n \nExpenses not currently deductible\n1,189\n \n672\n \n1,465\n \n1,038\n \nLess: valuation allowance\n(\n48\n)\n(\n53\n)\nDeferred income tax assets, net\n1,417\n \n985\n \nDeferred income tax liabilities:\nDepreciation and amortization\n298\n \n184\n \nDeferred costs\n24\n \n31\n \nOther\n1\n \n3\n \nDeferred income tax liabilities\n323\n \n218\n \nNet deferred income tax assets\n$\n1,094\n \n$\n767\n \nAt December 31, 2024, we had foreign and U.S. net operating loss carryforwards of approximately $\n131\n million and $\n83\n million, respectively. We have recorded valuation allowances on certain net operating loss carryforwards. \nWe conduct business globally and file income tax returns in the United States, including federal and state, as well as various foreign jurisdictions. Tax years that remain subject to examination by the IRS are 2019 and onward, \nand years that remain subject to examination by state authorities vary by state.\n Years under examination by foreign tax authorities are 2003 and onward. In addition, transactions between our affiliated entities are arranged in accordance with applicable transfer pricing laws, regulations and relevant guidelines. As a result, and due to the interpretive nature of certain aspects of these laws and guidelines, we have pending applications for APAs before the taxing authorities in some of our most significant jurisdictions.\nCognizant\nF-27\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nChanges in unrecognized income tax benefits were as follows for the years ended December 31:\n(in millions)\n2024\n2023\n2022\nBalance, beginning of year\n$\n260\n \n$\n269\n \n$\n194\n \nAdditions based on tax positions related to the current year\n15\n \n31\n \n53\n \nAdditions for tax positions of prior years\n65\n \n22\n \n65\n \nReductions for tax positions due to lapse of statutes of limitations\n(\n15\n)\n(\n15\n)\n(\n43\n)\nReductions for tax positions related to prior years\n(\n6\n)\n(\n33\n)\n—\n \nSettlements\n—\n \n(\n14\n)\n—\n \nBalance, end of year\n$\n319\n \n$\n260\n \n$\n269\n \nIn the third quarter of 2022, we recognized an income tax benefit of $\n36\n million related to a specific uncertain tax position that was previously unrecognized in our prior year consolidated financial statements. The recognition of the benefit in the third quarter of 2022 was based on management’s reassessment regarding whether this unrecognized tax benefit met the more-likely-than-not threshold in light of the lapse in the statute of limitations as to a portion of such benefit.\nThe unrecognized income tax benefits would affect our effective income tax rate, if recognized. While the Company believes uncertain tax positions may be settled or resolved within the next twelve months, it is difficult to estimate the specific timing or the income tax impact of these potential resolutions at this time. We recognize accrued interest and any penalties associated with uncertain tax positions as part of our provision for income taxes. The total amount of accrued net interest and penalties was \n$\n35\n million a\nnd  $\n33\n million as of December 31, 2024 and 2023, respectively, and related to U.S. and foreign tax matters. The total amount of net interest and penalties recorded in the provision for income taxes in each of 2024, 2023 and 2022 was immaterial.\n \nCognizant\nF-28\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nNote 12 — Derivative Financial Instruments\nIn the normal course of business, we use foreign exchange forward and option contracts to manage foreign currency exchange rate risk. Derivatives may give rise to credit risk from the possible non-performance by counterparties. Credit risk is limited to the fair value of those contracts that are favorable to us. \nWe have limited our credit risk by limi\nting the amount of credit exposure with any one financial institution and conducting ongoing evaluation of the creditworthiness of the financial institutions with which we do business. In addition, all the assets and liabilities related to the foreign exchange derivative contracts set forth in the table below are subject to master netting arrangements, such as the International Swaps and Derivatives Association Master Agreement, with each individual counterparty. These master netting arrangements generally provide for net settlement of all outstanding contracts with the counterparty in the case of an event of default or a termination event. We have presented all the assets and liabilities related to the foreign exchange derivative contracts, as applicable, on a gross basis, with no offsets, in our consolidated statements of financial position. There is no financial collateral (including cash collateral) posted or received by us related to the foreign exchange derivative contracts.\nThe following table provides information on the location and fair values of derivative financial instruments included in our consolidated statements of financial position as of December 31:\n(in millions)\n \n2024\n2023\nDesignation of Derivatives\nLocation on Statement of\nFinancial Position\nAssets\nLiabilities\nAssets\nLiabilities\nForeign exchange forward and option contracts – Designated as cash flow hedging instruments\nOther current assets\n$\n1\n \n$\n— \n$\n14\n \n$\n— \nOther noncurrent assets\n—\n \n— \n5\n \n— \nAccrued expenses and other current liabilities\n— \n22\n \n— \n5\n \nOther noncurrent liabilities\n— \n13\n \n— \n1\n \nTotal\n1\n \n35\n \n19\n \n6\n \nForeign exchange forward contracts - Not designated as hedging instruments\nOther current assets\n1\n \n— \n1\n \n— \nAccrued expenses and other current liabilities\n— \n2\n \n— \n9\n \nTotal\n1\n \n2\n \n1\n \n9\n \nTotal\n$\n2\n \n$\n37\n \n$\n20\n \n$\n15\n \nCash Flow Hedges\nWe have entered and continue to enter into a series of foreign exchange derivative contracts that are designated as cash flow hedges of Indian rupee denominated payments in India. These contracts are intended to partially offset the impact of movement of the Indian rupee against the U.S. dollar on future operating costs and are scheduled to mature each month during 2025 and 2026. The changes in fair value of these contracts are initially reported in \"Accumulated other comprehensive income (loss)\" in our consolidated statements of financial position and are subsequently reclassified to earnings within \"Cost of revenues\" and \"Selling, general and administrative expenses\" in our consolidated statements of operations in the same period that the forecasted Indian rupee denominated payments are recorded in earnings.\n As of December 31, 2024, we estimate that \n$\n16\n million\n, net of tax, \nof net losses related to derivatives designated as cash flow hedges reported in \"Accumulated other comprehensive income (loss)\" in our consolidated statements of financial position is expected to be reclassified into earnings within the next 12 months.\nThe notional value of the outstanding contracts by year of maturity was as follows as of December 31:\n(in millions)\n2024\n2023\n2024\n$\n—\n \n$\n1,878\n \n2025\n2,010\n \n1,020\n \n2026\n920\n \n—\n \nTotal notional value of contracts outstanding \n(1)\n$\n2,930\n \n$\n2,898\n \n(1)\nIncludes $\n45\n million notional value of option contracts as of December 31, 2023, with the remaining notional value related to forward contracts. There were \nno\n option contracts outstanding as of December 31, 2024.\nCognizant\nF-29\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nThe following table provides information on the location and amounts of pre-tax gains and losses on our cash flow hedges for the year ended December 31:\n(in millions)\nChange in\nDerivative Gains and Losses Recognized\nin Accumulated Other\nComprehensive Income (Loss)\n(effective portion)\nLocation of Net Gains (Losses) Reclassified\nfrom Accumulated Other\nComprehensive Income (Loss)\ninto Income\n(effective portion)\nNet Gains (Losses) Reclassified\nfrom Accumulated Other\nComprehensive Income (Loss)\ninto Income\n(effective portion)\n \n2024\n2023\n \n2024\n2023\nForeign exchange forward and option contracts – Designated as cash flow hedging instruments\n$\n(\n35\n)\n$\n55\n \nCost of revenues\n$\n11\n \n$\n(\n23\n)\nSG&A expenses\n1\n \n(\n3\n)\nTotal\n$\n12\n \n$\n(\n26\n)\nThe activity related to the change in net unrealized gains and losses on the cash flow hedges included in \"Accumulated other comprehensive income (loss)\" in our consolidated statements of stockholders' equity is presented in \nNote 14\n.\nOther Derivatives\nWe use foreign exchange forward contracts to provide an economic hedge against balance sheet exposures to certain monetary assets and liabilities denominated in currencies other than the functional currency of our foreign subsidiaries. We entered into foreign exchange forward contracts that are scheduled to mature in the first quarter of 2025. Realized gains or losses and changes in the estimated fair value of these derivative financial instruments are recorded in the caption \"Foreign currency exchange gains (losses), net\" in our consolidated statements of operations.\nAdditional information related to the outstanding foreign exchange forward contracts not designated as hedging instruments was as follows as of December 31:\n(in millions)\n2024\n2023\nNotional\nFair Value\nNotional\nFair Value\nContracts outstanding\n$\n489\n \n$\n(\n1\n)\n$\n1,317\n \n$\n(\n8\n)\nThe following table provides information on the location and amounts of realized and unrealized pre-tax gains and losses on the other derivative financial instruments for the year ended December 31:\n(in millions)\nLocation of Net Gain (Losses)\non Derivative Instruments\nAmount of Net Gains (Losses)\non Derivative Instruments\n \n \n2024\n2023\nForeign exchange forward contracts - Not designated as hedging instruments\nForeign currency exchange gains (losses), net\n$\n10\n \n$\n(\n40\n)\nThe related cash flow impacts of all the derivative activities are reflected as cash flows from operating activities.\nNote 13 — Fair Value Measurements\nWe measure our cash equivalents, certain investments, contingent consideration liabilities and foreign exchange forward and option contracts at fair value. Fair value is the exit price, or the amount that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants as of the measurement date. The fair value hierarchy is based on inputs to valuation techniques that are used to measure fair value that are either observable or unobservable. Observable inputs reflect assumptions market participants would use in pricing an asset or liability based on market data obtained from independent sources while unobservable inputs reflect a reporting entity’s pricing based upon their own market assumptions.\nCognizant\nF-30\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nThe fair value hierarchy consists of the following three levels:\n•\nLevel 1 – Inputs are quoted prices in active markets for identical assets or liabilities.\n•\nLevel 2 – Inputs are quoted prices for similar assets or liabilities in an active market, quoted prices for identical or similar assets or liabilities in markets that are not active, inputs other than quoted prices that are observable and market-corroborated inputs which are derived principally from or corroborated by observable market data.\n•\nLevel 3 – Inputs are derived from valuation techniques in which one or more significant inputs or value drivers are unobservable.\nThe following table summarizes the financial assets and (liabilities) measured at fair value on a recurring basis as of December 31, 2024:\n \n(in millions)\nLevel 1\nLevel 2\nLevel 3\nTotal\nCash equivalents:\nMoney market funds\n$\n40\n \n$\n—\n \n$\n—\n \n$\n40\n \nTime deposits\n— \n991\n \n— \n991\n \nShort-term investments:\nTime deposits\n— \n1\n \n— \n1\n \nEquity investment security\n11\n \n—\n \n—\n \n11\n \nOther current assets:\nForeign exchange forward contracts\n—\n \n2\n \n—\n \n2\n \nAccrued expenses and other current liabilities:\nForeign exchange forward contracts\n—\n \n(\n24\n)\n—\n \n(\n24\n)\nOther noncurrent liabilities:\nForeign exchange forward contracts\n—\n \n(\n13\n)\n—\n \n(\n13\n)\nThe following table summarizes the financial assets and (liabilities) measured at fair value on a recurring basis as of December 31, 2023:\n(in millions)\nLevel 1\nLevel 2\nLevel 3\nTotal\nCash equivalents:\nMoney market funds\n$\n327\n \n$\n—\n \n$\n—\n \n$\n327\n \nTime deposits\n— \n834\n \n— \n834\n \nShort-term investments:\nEquity investment security\n11\n \n—\n \n—\n \n11\n \nOther current assets:\nForeign exchange forward contracts\n—\n \n15\n \n—\n \n15\n \nLong-term investments:\nRestricted time deposits \n(1)\n— \n355\n \n— \n355\n \nOther noncurrent assets:\nForeign exchange forward contracts\n—\n \n5\n \n—\n \n5\n \nAccrued expenses and other current liabilities:\nForeign exchange forward contracts\n—\n \n(\n14\n)\n—\n \n(\n14\n)\nContingent consideration liabilities\n—\n \n—\n \n(\n30\n)\n(\n30\n)\nOther noncurrent liabilities:\nForeign exchange forward contracts\n—\n \n(\n1\n)\n—\n \n(\n1\n)\n(1)\nSee \nNote 11\nCognizant\nF-31\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nThe following table summarizes the changes in Level 3 contingent consideration liabilities:\n(in millions)\n2024\n2023\nBeginning balance\n$\n30\n \n$\n22\n \nChange in fair value recognized in SG&A expenses\n—\n \n17\n \nPayments and other adjustments\n(\n30\n)\n(\n9\n)\nEnding balance \n$\n—\n \n$\n30\n \nWe measure the fair value of money market funds based on quoted prices in active markets for identical assets and measure the fair value of our equity investment security based on the published daily net asset value at which investors can freely subscribe to or redeem from the fund. The carrying value of the time deposits approximated fair value as of  December 31, 2024 and 2023.\nWe estimate the fair value of each foreign exchange forward contract by using a present value of expected cash flows model. This model calculates the difference between the current market forward price and the contracted forward price for each foreign exchange forward contract and applies the difference in the rates to each outstanding contract. The market forward rates include a discount and credit risk factor. We estimate the fair value of each foreign exchange option contract by using a variant of the Black-Scholes model. This model uses present value techniques and reflects the time value and intrinsic value based on\nobservable market rates.\nWe estimate the fair value of contingent consideration liabilities associated with acquisitions using a variation of the income approach, which utilizes one or more significant inputs that are unobservable. This approach calculates the fair value of such liabilities based on the probability-weighted expected performance of the acquired entity against the target performance metric, discounted to present value when appropriate.\n During the years ended December 31, 2024, 2023 and 2022 there were no transfers among Level 1, Level 2 or Level 3 financial assets and liabilities.\nNote 14 — Accumulated Other Comprehensive Income (Loss)\nChanges in \"Accumulated other comprehensive income (loss)\" by component were as follows for the year ended December 31, 2024:\n2024\n(in millions)\nBefore Tax\nAmount\nTax\nEffect \nNet of Tax\nAmount\nForeign currency translation adjustments:\nBeginning balance\n$\n(\n109\n)\n$\n5\n \n$\n(\n104\n)\nChange in foreign currency translation adjustments\n(\n152\n)\n2\n \n(\n150\n)\nEnding balance\n$\n(\n261\n)\n$\n7\n \n$\n(\n254\n)\nUnrealized gains (losses) on cash flow hedges:\nBeginning balance\n$\n13\n \n$\n(\n3\n)\n$\n10\n \nUnrealized (losses) arising during the period\n(\n35\n)\n9\n \n(\n26\n)\nReclassifications of net gains to:\nCost of revenues\n(\n11\n)\n3\n \n(\n8\n)\nSG&A expenses\n(\n1\n)\n—\n \n(\n1\n)\nNet change\n(\n47\n)\n12\n \n(\n35\n)\nEnding balance\n$\n(\n34\n)\n$\n9\n \n$\n(\n25\n)\nLosses on defined benefit plans:\nBeginning balance\n$\n—\n \n$\n—\n \n$\n—\n \nLosses on defined benefit plans\n(\n20\n)\n3\n \n(\n17\n)\nEnding balance\n$\n(\n20\n)\n$\n3\n \n$\n(\n17\n)\nAccumulated other comprehensive income (loss):\nBeginning balance\n$\n(\n96\n)\n$\n2\n \n$\n(\n94\n)\nOther comprehensive income (loss)\n(\n219\n)\n17\n \n(\n202\n)\nEnding balance\n$\n(\n315\n)\n$\n19\n \n$\n(\n296\n)\nCognizant\nF-32\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nChanges in \"Accumulated other comprehensive income (loss)\" by component were as follows for the years ended December 31, 2023 and 2022:\n2023\n2022\n(in millions)\nBefore Tax\nAmount\nTax\nEffect\nNet of Tax\nAmount\nBefore Tax\nAmount\nTax\nEffect\nNet of Tax\nAmount\nForeign currency translation adjustments:\nBeginning balance\n$\n(\n256\n)\n$\n8\n \n$\n(\n248\n)\n$\n(\n22\n)\n$\n2\n \n$\n(\n20\n)\nChange in foreign currency translation adjustments\n147\n \n(\n3\n)\n144\n \n(\n234\n)\n6\n \n(\n228\n)\nEnding balance\n$\n(\n109\n)\n$\n5\n \n$\n(\n104\n)\n$\n(\n256\n)\n$\n8\n \n$\n(\n248\n)\nUnrealized (losses) gains on cash flow hedges:\nBeginning balance\n$\n(\n68\n)\n$\n17\n \n$\n(\n51\n)\n$\n71\n \n$\n(\n14\n)\n$\n57\n \nUnrealized gains (losses) arising during the period\n55\n \n(\n14\n)\n41\n \n(\n153\n)\n34\n \n(\n119\n)\nReclassifications of net losses to:\nCost of revenues\n23\n \n(\n5\n)\n18\n \n13\n \n(\n3\n)\n10\n \nSG&A expenses\n3\n \n(\n1\n)\n2\n \n1\n \n—\n \n1\n \nNet change\n81\n \n(\n20\n)\n61\n \n(\n139\n)\n31\n \n(\n108\n)\nEnding balance\n$\n13\n \n$\n(\n3\n)\n$\n10\n \n$\n(\n68\n)\n$\n17\n \n$\n(\n51\n)\nAccumulated other comprehensive income (loss):\nBeginning balance\n$\n(\n324\n)\n$\n25\n \n$\n(\n299\n)\n$\n49\n \n$\n(\n12\n)\n$\n37\n \nOther comprehensive income (loss)\n228\n \n(\n23\n)\n205\n \n(\n373\n)\n37\n \n(\n336\n)\nEnding balance\n$\n(\n96\n)\n$\n2\n \n$\n(\n94\n)\n$\n(\n324\n)\n$\n25\n \n$\n(\n299\n)\nNote 15 — Commitments and Contingencies\nWe are involved in various claims and legal proceedings arising in the ordinary course of business. We accrue a liability when a loss is considered probable and the amount can be reasonably estimated. When a material loss contingency is reasonably possible but not probable, we do not record a liability, but instead disclose the nature and the amount of the claim, and an estimate of the loss or range of loss, if such an estimate can be made. Legal fees are expensed as incurred. While we do not expect that the ultimate resolution of any existing claims and proceedings (other than the specific matters described below, if decided adversely), individually or in the aggregate, will have a material adverse effect on our financial position, an unfavorable outcome in some or all of these proceedings could have a material adverse impact on results of operations or cash flows for a particular period. This assessment is based on our current understanding of relevant facts and circumstances. As such, our view of these matters is subject to inherent uncertainties and may change in the future.\nOn January 15, 2015, Syntel sued TriZetto and Cognizant in the USDC-SDNY. Syntel’s complaint alleged breach of contract against TriZetto, and tortious interference and misappropriation of trade secrets against Cognizant and TriZetto, stemming from Cognizant’s hiring of certain former Syntel employees. Cognizant and TriZetto countersued on March 23, 2015, for breach of contract, misappropriation of trade secrets and tortious interference, based on Syntel’s misuse of TriZetto confidential information and abandonment of contractual obligations. Cognizant and TriZetto subsequently added federal D\nTSA and copyright infringement claims for Syntel’s misuse of TriZetto’s proprietary technology. The parties’ claims were narrowed by the\n court and the case was tried before a jury, which on October 27, 2020 returned a verdict in favor of Cognizant in the amount of $\n855\n million, including $\n570\n million in punitive damages. On April 20, 2021, the USDC-SDNY issued a post-trial order that, among other things, affirmed the jury’s award of $\n285\n million in actual damages, but r\neduced the award of punitive damages from $\n570\n million to $\n285\n million, thereby reducing the overall damages award from $\n855\n million to $\n570\n million. The USDC-SDNY subsequently issued a final judgment consistent with the April 20\nth\n order. On May 26, 2021, Syntel filed a notice of appeal to the Second Circuit, and on June 3, 2021 the USDC-SDNY stayed execution of judgment pending appeal. \nOn May 25, 2023, the Second Circuit issued an opinion affirming in part and vacating in part the judgment of the USDC-SDNY and remanding the case for further proceedings consistent with its opinion. The Second Circuit affirmed the judgment in all respects on liability but vacated the $\n570\n million award that had been based on avoided development costs under the DTSA, and it remanded the case to the USDC-SDNY for further evaluation of damages. On June 23, 2023, the \nCognizant\nF-33\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nSecond Circuit issued its mandate returning the case to the USDC-SDNY. On March 13, 2024, the USDC-SDNY issued a ruling that vacates the alternate compensatory damages awards that were within the scope of the Second Circuit’s remand and awards TriZetto and Cognizant approximately $\n15\n million in attorney’s fees. On October 23, 2024, the USDC-SDNY granted TriZetto and Cognizant’s motion for a new trial on the amount of compensatory damages owed to TriZetto and Cognizant. On November 12, 2024, the USDC-SDNY scheduled the trial for June 16, 2025. On November 13, 2024, the USDC-SDNY granted Syntel’s request to certify for interlocutory appeal the question of whether the Second Circuit’s mandate permits the USDC-SDNY’s October 23\nrd\n order for a new trial on compensatory damages. The parties subsequently completed briefing at the Second Circuit on December 27, 2024, regarding whether the Second Circuit should take up the interlocutory appeal, and a decision is pending. TriZetto and Cognizant will continue to vigorously pursue our claims against Syntel. \nWe will not record any gain in our financial statements until it becomes realizable.\nOn February 28, 2019, a ruling of the SCI interpreting the India Defined Contribution Obligation altered historical understandings of the obligation, extending it to cover additional portions of the employee’s income. As a result, the ongoing contributions of our affected employees and the Company were required to be increased. In the first quarter of 2019, we accrued $\n117\n million with respect to prior periods, assuming retroactive application of the SCI’s ruling, in \"Selling, general and administrative expenses\" in our consolidated statement of operations. There is significant uncertainty as to how the liability should be calculated as it is impacted by multiple variables, including the period of assessment, the application with respect to certain current and former employees and whether interest and penalties may be assessed. Since the ruling, a variety of trade associations and industry groups have advocated to the Indian government, highlighting the harm to the information technology sector, other industries and job growth in India that would result from a retroactive application of the ruling. It is possible the Indian government will review the matter and there is a substantial question as to whether the Indian government will apply the SCI’s ruling on a retroactive basis. As such, the ultimate amount of our obligation may be materially different from the amount accrued.\nOn October 31, 2016, November 15, 2016 and November 18, 2016, three putative shareholder derivative complaints were filed in New Jersey Superior Court, Bergen County, naming us, all of our then current directors and certain of our current and former officers at that time as defendants. These actions were consolidated in an order dated January 24, 2017. The complaints assert claims for breach of fiduciary duty, corporate waste, unjust enrichment, abuse of control, mismanagement, and/or insider selling by defendants. On April 26, 2017, the New Jersey Superior Court deferred further proceedings by dismissing the consolidated putative shareholder derivative litigation without prejudice but permitting the parties to file a motion to vacate the dismissal in the future. \nOn February 22, 2017, April 7, 2017, May 10, 2017 and March 11, 2019, four additional putative shareholder derivative complaints were filed in the USDC-NJ, naming us and certain of our current and former directors and officers at that time as defendants. These actions were consolidated in an order dated May 14, 2019. On August 3, 2020, lead plaintiffs filed a consolidated amended complaint. The consolidated amended complaint asserts claims similar to those in the previously-filed putative shareholder derivative actions. On February 14, 2022, we and certain of our current and former directors and officers moved to dismiss the consolidated amended complaint. On September 27, 2022, the USDC-NJ granted those motions and dismissed the consolidated amended complaint in its entirety with prejudice. Plaintiffs filed a notice of appeal on October 27, 2022. On May 3, 2024, the Third Circuit affirmed the dismissal of the consolidated amended complaint.\nOn June 1, 2021, an eighth putative shareholde\nr derivative complaint was filed in the USDC-NJ, naming us and certain of our current and former directors and officers at that time a\ns defendants. The complaint asserts claims similar to those in the previously-filed putative shareholder derivative actions. On March 31, 2022, we and certain of our current and former directors and officers moved to dismiss the complaint. On November 30, 2022, the USDC-NJ denied without prejudice those motions. The USDC-NJ ordered the parties to conduct limited discovery related to the issue of whether our board of directors wrongfully refused the plaintiff’s earlier litigation demand and, after the conclusion of such limited discovery, to file targeted motions for summary judgment on the issue of wrongful refusal. \nWe are presently unable to predict the duration, scope or result of the single putative shareholder derivative action that has not been dismissed. Although the Company continues to defend that putative shareholder derivative action vigorously, it is \nsubject to inherent uncertainties, the actual cost of such litigation will depend upon many unknown factors and the outcome of the litigation is necessarily uncertain. \nWe have indemnification and expense advancement obligations pursuant to our bylaws and indemnification agreements with respect to certain current and former members of senior management and the Company’s board of directors. In connection with the matters that were the subject of our previously disclosed internal investigation, the DOJ and SEC investigations and the related litigation, we have received and expect to continue to receive requests under such indemnification agreements and our bylaws to provide funds for legal fees and other expenses. There are no amounts remaining available to us under applicable \nCognizant\nF-34\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \ninsurance policies for our ongoing indemnification and advancement obligations with respect to certain of our current and former officers and directors or incremental legal fees and other expenses related to the above matters.\nSee \nNote 11\n for information relating to the ITD Dispute.\nOn September 18, 2017, three former employees filed suit against Cognizant in the USDC-CDCA, alleging that they and similarly situated employees suffered disparate treatment on the basis of race in violation of 42 U.S.C. § 1981. Plaintiffs subsequently amended their complaint three times, adding a fourth former employee plaintiff and claims for both disparate treatment and disparate impact on the basis of race and national origin under Title VII of the Civil Rights Act of 1964, 42 U.S.C. § 2000e \net seq. \nand disparate treatment and disparate impact on the basis of race and national origin under Title VII of the Civil Rights Act of 1964, 42 U.S.C. § 2000e \net seq.\n. Plaintiffs filed the operative Third Amended Complaint-Corrected on January 19, 2021. Cognizant filed its answer on January 29, 2021.\nOn May 13, 2022, plaintiffs filed a motion requesting that the USDC-CDCA certify the case as a class action for two putative classes of plaintiffs consisting of: (1) all individuals who are not of South Asian race or Indian national origin who applied to Cognizant in the U.S. and were not hired since September 2013 (the “hiring class”); and (2) all individuals who are not of South Asian race or Indian national origin who have been terminated in the U.S. since September 2013 (the “terminations class”). Cognizant opposed. On October 27, 2022, the court denied certification for the hiring class and the terminations class. However, the court granted certification for a sub-set of the terminations class limited to approximately 2,300 former employees whose employment had been terminated from the “bench,” a designation for employees who are not allocated to an active project. On November 10, 2022, Cognizant filed a petition with the Ninth Circuit requesting permission to appeal the class certification order as to the bench terminations class. The Ninth Circuit denied the petition on January 26, 2023.\nFrom June 13, 2023 to June 26, 2023, the USDC-CDCA held a class action jury trial on the first phase of plaintiffs’ Section 1981 claim and Title VII disparate treatment claim. The questions presented were whether Cognizant engaged in a pattern or practice of discrimination against non-South Asian and non-Indian employees with respect to bench terminations, and if so, whether punitive damages are available for class members who prevail on their claims. The jury deadlocked, and the court declared a mistrial.  \nThe case proceeded to a retrial on September 24, 2024, and on October 4, 2024, the jury returned a verdict in favor of plaintiffs. The case will now proceed to the second phase to determine individualized liability and damages, if any, for each class member. As a result of the verdict, each non-South Asian and non-Indian class member who pursues claims in the second phase will be entitled to a rebuttable presumption that all termination decisions were discriminatory and to the possibility of recovering punitive damages if they prevail. The USDC-CDCA will also consider plaintiffs’ claim that Cognizant policies had a disparate impact on non-South Asian and non-Indian employees. We believe that class certification was improper, and that the second phase of the case will confirm that individualized issues should have precluded class certification. Cognizant will continue to vigorously defend itself in the second phase of this case and to pursue all available appellate arguments concerning class certification and the September 24, 2024 trial at the appropriate time. \nBecause we cannot predict the number of individual plaintiffs who will proceed to the second phase, or the outcome of those cases, and in view of the appellate arguments regarding class certification, we are unable to reasonably estimate a possible loss or range of loss. We\n have not recorded any accruals related to this matter.\nMany of our engagements involve projects that are critical to the operations of our clients’ business and provide benefits that are difficult to quantify. Any failure in a client’s systems or our failure to meet our contractual obligations to our clients, including any breach involving a client’s confidential information or sensitive data, or our obligations under applicable laws or regulations could result in a claim for substantial damages against us, regardless of our responsibility for such failure. Although we attempt to contractually limit our liability for damages arising from negligent acts, errors, mistakes, or omissions in rendering our services, there can be no assurance that the limitations of liability set forth in our contracts will be enforceable in all instances or will otherwise protect us from liability for damages. Although we have general liability insurance coverage, including coverage for errors or omiss\nions, we retain a significant portion of risk through our insurance deductibles and the\nre can be no assurance that such coverage will cover all types of claims, continue to be available on reasonable terms or will be available in sufficient amounts to cover one or more large claims, or that the insurer will not disclaim coverage as to any future claim. The successful assertion of one or more large claims against us that exceed or are not covered by our insurance coverage or changes in our insurance policies, including premium increases or the imposition of large deductible or co-insurance requirements, could have a material adverse effect on our business, results of operations, financial position and cash flows for a particular period. \nIn the normal course of business and in conjunction with certain client engagements, we have entered into contractual arrangements through which we may be obligated to indemnify clients or other parties with whom we conduct business with \nCognizant\nF-35\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nrespect to certain matters. These arrangements can include provisions whereby we agree to hold the indemnified party and certain of their affiliated entities harmless with respect to third-party claims related to such matters as our breach of certain representations or covenants, our intellectual property infringement, our gross negligence or willful misconduct or certain other claims made against certain parties. Payments by us under any of these arrangements are generally conditioned on the client making a claim and providing us with full control over the defense and settlement of such claim. It is not possible to determine the maximum potential liability under these indemnification agreements due to the unique facts and circumstances involved in each particular agreement. Historically, we have not made material payments under these indemnification agreements and therefore they have not had a material impact on our operating results, financial position, or cash flows. However, if events arise requiring us to make payment for indemnification claims under our indemnification obligations in contracts we have entered, such payments could have a material adverse effect on our business, results of operations, financial position and cash flows for a particular period.\n \nNote 16 — Employee Benefits\nDefined Contribution Plans\nWe contribute to defined contribution plans, including 401(k) savings and supplemental retirement plans in the United States. Total expenses for our contributions to our U.S. plans were $\n115\n million, $\n117\n million  and $\n112\n million  for the years ended December 31, 2024, 2023 and 2022, respectively.\nIn addition, we maintain employee benefit plans that cover substantially all India-based employees. The employees’ provident fund, pension and family pension plans are statutorily defined contribution retirement benefit plans. Under the plans, employees contribute up to \n12.0\n% of their eligible compensation, which is matched by an equal contribution by the Company. For these plans, we recognized a contribution expense of $\n151\n million, $\n149\n million and $\n143\n million for the years ended December 31, 2024, 2023 and 2022, respectively. \nOutside of the United States and India, we incurred expenses of $\n104\n million, $\n107\n million and $\n99\n million for the years ended December 31, 2024, 2023 and 2022, respectively, related to our contributions to defined contribution plans.\nDefined Benefit Pension Plans\nWe sponsor defined benefit pension plans that are statutorily required and primarily cover employees in certain European countries. Our primary plan is in Switzerland, which provides pension benefits based on a participant’s contributions, the Company’s matching contributions and a minimum investment return guarantee. As of December 31, 2024 the net liability recognized on the balance sheet for our pension plans was $\n63\n million and amounts recognized in prior years were immaterial. The losses recognized in other comprehensive income arose mainly due to change in discount rates used in the valuation of the defined benefit obligation of our Swiss pension plan. The net periodic pension costs recognized in the income statement for the years ended December 31, 2024, 2023 and 2022 were $\n21\n million, $\n16\n million, $\n13\n million, respectively.\nPost-Employment Benefit Plan\nWe maintain a gratuity plan in India that is a statutory post-employment benefit plan providing defined lump sum benefits. We make annual contributions to the employees’ gratuity fund established with a government-owned insurance corporation to fund a portion of the estimated obligation. As of December 31, 2024 and 2023, the amount accrued under the gratuity plan was $\n80\n million and $\n130\n million, which is net of fund assets of $\n231\n million and $\n221\n million, respectively\n. \nExpense recognized by us was $\n4\n million, $\n56\n million and $\n45\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\nNote 17 — Stock-Based Compensation Plans\nOur 2023 Incentive Plan provides for the issuance of a total of \n25.0\n million shares of Class A common stock to eligible employees, less (i) the number of shares granted under the 2017 Incentive Plan between March 24, 2023 and June 6, 2023, plus (ii) any shares subject to awards under the prior 2017 and 2009 Incentive Plans that are forfeited after June 6, 2023. The 2023 Incentive Plan does not affect any awards outstanding under the prior plans. The Purchase Plan provides for the issuance of up to \n50.0\n million shares of Class A common stock to eligible employees. As of December 31, 2024, we have \n22.7\n million and \n10.6\n million shares available for grant under the 2023 Incentive Plan and the Purchase Plan, respectively.\nCognizant\nF-36\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nThe allocation of total stock-based compensation expense between cost of revenues, selling, general and administrative expenses and restructuring charges as well as the related income tax benefit were as follows for the three years ended December 31:\n(in millions)\n2024\n2023\n2022\nCost of revenues\n$\n26\n \n$\n30\n \n$\n33\n \nSG&A expenses\n150\n \n153\n \n228\n \nRestructuring charges\n(\n1\n)\n(\n7\n)\n— \nTotal stock-based compensation expense\n$\n175\n \n$\n176\n \n$\n261\n \nIncome tax benefit\n$\n38\n \n$\n34\n \n$\n59\n \nRestricted Stock Units and Performance Stock Units\nWe granted RSUs that vest in quarterly or\n annual installments over periods of up to \nfour years\n to employees, including our executive officers. \nA summary of the activity for RSUs granted under our stock-based compensation plans as of December 31, 2024 and changes during the year then ended is presented below:\nNumber of\nUnits\n(in millions)\nWeighted Average\nGrant Date\nFair Value\n(in dollars)\nUnvested at January 1, 2024\n3.3\n \n$\n69.10\n \nGranted\n2.5\n \n77.66\n \nVested\n(\n2.3\n)\n72.04\n \nForfeited\n(\n0.7\n)\n73.06\n \nUnvested at December 31, 2024\n2.8\n \n$\n73.47\n \nThe total vesting date fair value of vested RSUs was $\n172\n million, $\n176\n million and $\n207\n million for the years ended December 31, 2024, 2023 and 2022, respectively. The weighted-average grant date fair value of RSUs granted in 2024, 2023 and 2022 was $\n77.66\n, $\n65.95\n and $\n78.20\n, respectively. As of December 31, 2024, $\n146\n million of total remaining unrecognized stock-based compensation cost related to RSUs is expected to be recognized over the weighted-average remaining requisite service period of \n1.5\n years.\nWe granted PSUs that vest over periods up to \nfour years\n to employees, including our executive officers. The vesting of PSUs is contingent on meeting certain financial performance targets, market conditions and continued service. A summary of the activity for PSUs granted under our stock-based compensation plans as of December 31, 2024 and changes during the year then ended is presented below. \nThe presentation reflects the number of PSUs at the maximum performance milestones.\nNumber of\nUnits\n(in millions)\nWeighted Average\nGrant Date\nFair Value\n(in dollars)\nUnvested at January 1, 2024\n1.5\n \n$\n74.13\n \nGranted\n0.9\n \n83.63\n \nVested\n(\n0.2\n)\n72.80\n \nForfeited\n(\n0.4\n)\n78.42\n \nAdjustment at the conclusion of the performance measurement period\n(\n0.3\n)\n86.87\n \nUnvested at December 31, 2024\n1.5\n \n$\n76.76\n \nThe total vesting date fair value of vested PSUs was $\n15\n million, $\n22\n million and $\n8\n million for the years ended December 31, 2024, 2023 and 2022, respectively.The weighted-average grant date fair value of PSUs granted in 2024, 2023 and 2022 was $\n83.63\n, $\n67.82\n and $\n90.92\n, respectively. As of December 31, 2024, $\n21\n million of the total remaining unrecognized stock-based compensation cost related to PSUs is expected to be recognized over the weighted-average remaining requisite service period of \n1.5\n years. \nAll RSUs and PSUs have dividend equivalent rights, which entitle holders to the same dividend value per share as holders of common stock. Dividend equivalent rights are subject to the same vesting and other terms and conditions as the corresponding unvested RSUs and PSUs and are accumulated and paid when the underlying shares vest.\nCognizant\nF-37\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nPurchase Plan\nFor the years ended December 31, 2024, 2023 and 2022, the Purchase Plan provided for eligible employees to purchase shares of Class A common stock at a price equal to \n95\n% of the fair market value per share of our Class A common stock on the last date of the purchase period. This plan has been deemed non-compensatory and, therefore, no compensation expense has been recorded. During the years ended December 31, 2024, 2023 and 2022, we issued \n0.9\n million shares, \n1.1\n million shares and \n1.3\n million shares, respectively, of Class A common stock under the Purchase Plan.\nNote 18 — Segment Information\nOur chief executive officer is our chief operating decision maker. Our CODM regularly reviews the performance of our business by seven industry-based operating segments, which are aggregated into four reportable business segments: \n•\nHealth Sciences, which consists of a single operating segment of the same name;\n•\nFinancial Services, which consists of the banking and insurance operating segments;\n•\nProducts and Resources, which consists of the retail and consumer goods; manufacturing, logistics, energy, and utilities; and travel and hospitality operating segments; and\n•\nCommunications, Media and Technology, which consists of a single operating segment of the same name.\nWe have an industry-led go-to-market strategy, with client partners, account executives and client relationship managers aligned to the specific industries they serve. \nOur CODM is regularly provided segment revenues and operating profit, including budget‑to‑actual variances in segment revenue, to formulate industry-focused strategic priorities, allocate financial resources, set targets and key performance indicators, and evaluate the results of such strategies. These strategic priorities, targets and key performance indicators are translated and applied to each client account, rolling up to respective industry-based operating segments. Our hiring and deployment plans are devised according to the strategic priorities and targets set for the client accounts.\nRevenue from a client is directly identified with the operating segment with which the client is most closely aligned. Generally, operating expenses for each operating segment have similar characteristics and are subject to the same factors, pressures and challenges. However, the economic environment and its effects on industries served by the operating segments may affect revenues and operating expenses to differing degrees. Segment operating profit is the income from operations before unallocated costs.\nOur CODM is not regularly provided with segment expenses. Corporate expenses, expenses related to our NextGen program, a portion of depreciation and amortization and the impact of the settlements of the cash flow hedges are not allocated to individual segments. Accordingly, such expenses are excluded from segment operating profit and are included below as “unallocated costs” and adjusted against our total income from operations.\nWe do not disclose assets by segment as a significant portion of the assets is used interchangeably among the segments and our CODM is not provided such information.\nInformation by reportable segment were as follows:\nYear Ended December 31, 2024\n(in millions)\nHS\nFS\nP&R\nCMT\nTotal\nRevenues\n$\n5,932\n \n$\n5,753\n \n$\n4,782\n \n$\n3,269\n \n$\n19,736\n \nLess: other segment items\n4,599\n \n4,512\n \n3,802\n \n2,667\n \n15,580\n \nSegment operating profit\n1,333\n \n1,241\n \n980\n \n602\n \n4,156\n \nLess: unallocated costs\n1,264\n \nIncome from operations\n$\n2,892\n \nCognizant\nF-38\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nYear Ended December 31, 2023\n(in millions)\nHS\nFS\nP&R\nCMT\nTotal\nRevenues\n$\n5,674\n \n$\n5,809\n \n$\n4,628\n \n$\n3,242\n \n$\n19,353\n \nLess: other segment items\n4,322\n \n4,653\n \n3,644\n \n2,617\n \n15,236\n \nSegment operating profit\n1,352\n \n1,156\n \n984\n \n625\n \n4,117\n \nLess: unallocated costs\n1,428\n \nIncome from operations\n$\n2,689\n \nYear Ended December 31, 2022\n(in millions)\nHS\nFS\nP&R\nCMT\nTotal\nRevenues\n$\n5,631\n \n$\n6,072\n \n$\n4,566\n \n$\n3,159\n \n$\n19,428\n \nLess: other segment items\n4,441\n \n4,749\n \n3,495\n \n2,390\n \n15,075\n \nSegment operating profit\n1,190\n \n1,323\n \n1,071\n \n769\n \n4,353\n \nLess: unallocated costs\n1,385\n \nIncome from operations\n$\n2,968\n \nOther segment items for each reportable segment primarily include employee compensation and benefits, subcontractor costs, costs of third-party products and services related to revenue and project-related travel.\nGeographic Area Information\nLong-lived assets by geographic area are as follows:\n(in millions)\n2024\n2023\n2022\nLong-lived Assets:\n(1)\nNorth America\n(2)\n$\n338\n \n$\n335\n \n$\n354\n \nEurope\n72\n \n90\n \n86\n \nRest of World\n(3)\n584\n \n623\n \n661\n \nTotal\n$\n994\n \n$\n1,048\n \n$\n1,101\n \n(1)    Long-lived assets include property and equipment, net of accumulated depreciation and amortization.\n(2)    Substantially all relates to the United States.\n(3)    Substantially all relates to India.\nNote 19 — Subsequent Events\nDividend\nOn February 5, 2025, our Board of Directors approved the Company's declaration of a $\n0.31\n per share dividend with a record date of February 18, 2025 and a payment date of February 26, 2025.\n \nCognizant\nF-39\nDecember 31, 2024 Form 10-K\nTable of Contents\n                                                \nCognizant Technology Solutions Corporation\nValuation and Qualifying Accounts\nFor the Years Ended December 31, 2024, 2023 and 2022 \n(in millions)\n \n(in millions)\nBalance at\nBeginning of\nPeriod\nCharged to\nCosts and\nExpenses\nCharged to\nOther\nAccounts\nDeductions\n/Other\nBalance at\nEnd of\nPeriod\nWarranty accrual:\n2024\n$\n40\n \n$\n38\n \n$\n—\n \n$\n40\n \n$\n38\n \n2023\n$\n41\n \n$\n40\n \n$\n—\n \n$\n41\n \n$\n40\n \n2022\n$\n39\n \n$\n41\n \n$\n—\n \n$\n39\n \n$\n41\n \nValuation allowance—deferred income tax assets:\n2024\n$\n53\n \n$\n1\n \n$\n—\n \n$\n6\n \n$\n48\n \n2023\n$\n41\n \n$\n14\n \n$\n—\n \n$\n2\n \n$\n53\n \n2022\n$\n46\n \n$\n3\n \n$\n—\n \n$\n8\n \n$\n41\n \nCognizant\nF-40\nDecember 31, 2024 Form 10-K"
  }
}