{
  "ticker": "DAL",
  "cik": "0000027904",
  "company_name": "DELTA AIR LINES, INC.",
  "filing_date": "2025-02-11",
  "accession": "0000027904-25-000004",
  "primary_doc": "dal-20241231.htm",
  "item_sections": {
    "item1": "Item 1. \"Business - Environmental Sustainability,\" aircraft fleet renewal is an important component of our environmental sustainability strategy and the path to achievement of our ambitious climate goals, which will continue to require extensive capital investment in future periods. See Note 10 of the Notes to the Consolidated Financial Statements for additional information regarding our aircraft purchase commitments, which totaled approximately $18.3 billion as of December 31, 2024.\nNew York-LaGuardia Redevelopment. \nIn 2024, we substantially completed all construction for the replacement of Terminals C and D of the New York-LaGuardia Airport with a new state-of-the-art terminal facility. \nThe project cost approximately $4.2 billion and was funded through debt issuance, existing cash and a Port Authority contribution of approximately $500 million. We entered into loan agreements to fund a portion of the construction, which are recorded on our Consolidated Balance Sheets (\"balance sheets\") as debt with the proceeds reflected as restricted cash. Using funding primarily provided by these arrangements, we spent approximately\n \n$300 million, $500 million and $650 million during 2024, 2023 and 2022, respectively. We expect only a small amount of spend in 2025 as the project is finalized. See Note 6 of the Notes to the Consolidated Financial Statements for additional information on the debt related to the redevelopment project.\nLos Angeles International Airport (\"LAX\") Construction. \nIn 2023, we substantially completed all construction for the LAX upgrade and modernization project that consolidates Terminals 2 and 3, as well as connects these terminals to the Tom Bradley International Terminal. The project cost approximately $2.5 billion.\nDelta Air Lines, Inc. | 2024 Form 10-K\n41\nItem 7. MD&A - Financial Condition and Liquidity\nA substantial majority of the project costs were funded through the Regional Airports Improvement Corporation (\"RAIC\"), a California public benefit corporation, using a revolving credit facility provided by a group of lenders. The credit facility was executed in 2017 and we have guaranteed the obligations of the RAIC under the credit facility. Loans made under the credit facility are being repaid with the proceeds from the City of Los Angeles' (the \"City\") purchase of completed project assets. Under the lease agreement and subsequent project component approvals by the City's Board of Airport Commissioners, the City appropriated approximately $1.8 billion to purchase completed project assets, representing the maximum allowable reimbursement by the City. Costs incurred in excess of the $1.8 billion maximum were not reimbursed by the City.\nOur net project costs were approximately $700 million, of which approximately $350 million has been reflected as investing activities and approximately $350 million as operating activities in our cash flows statement since the project started in 2017. We expect only a small amount of spend in 2025 as the project is finalized.\nFinancing Activities\nDebt and Finance Leases.\n In 2024, we had cash outflows of approximately $4.0 billion related to repayments of our debt and finance leases, including approximately $1.1 billion of early repayments. This included early extinguishment of $844 million in principal related to a portion of the SkyMiles Term Loan and various secured and unsecured notes, and approximately $280 million for finance leased aircraft that were purchased. We continue to seek opportunities to pre-pay our debt, in addition to periodic amortization payments and scheduled maturities, during 2025 and beyond.\nDuring 2024, Fitch and S&P Global upgraded their credit ratings of Delta to BBB-, an investment grade rating. When combined with Moody's, which affirmed our credit rating (Baa3) and upgraded its outlook for Delta to positive in 2024, we have now achieved investment-grade ratings across the major credit rating agencies. See Note 6 of the Notes to the Consolidated Financial Statements for further information on the effect of these ratings changes on our debt agreements.\nThe principal amount of our debt and finance leases was $16.2 billion at December 31, 2024.\nFuture Debt Obligations.\n As described further in Note 6 of the Notes to the Consolidated Financial Statements, as of December 31, 2024, scheduled maturities of our debt in 2025 are $1.8 billion, with maturities from 2026 through 2029 ranging between $600 million and $2.3 billion annually. As of December 31, 2024, scheduled maturities after 2029 aggregate to $6.6 billion. In addition, we are obligated to make periodic interest payments at fixed and variable rates, depending on the terms of the applicable debt agreements. Based on applicable interest rates and scheduled debt maturities as of December 31, 2024, these interest obligations total approximately $3.0 billion and range from approximately $200 million to $600 million on an annual basis over the next five years.\nFinance Lease Obligations. \nAs described further in Note 7 of the Notes to the Consolidated Financial Statements, as of December 31, 2024 we had a total of $897 million of minimum finance lease obligations. These minimum lease payments range from approximately $30 million to $400 million\n \non an annual basis over the next five years.\nCapital Returns to Shareholders. \nDuring 2024, we continued our quarterly dividend program with $0.10 per share payments in the March 2024 and June 2024 quarters and $0.15 per share payments in the September 2024 and December 2024 quarters. Total dividend payments during the year ended December 31, 2024 were $321 million.\nOn February 6, 2025, the Board of Directors approved and we will pay a quarterly dividend of $0.15 per share on March 20, 2025 to shareholders of record as of February 27, 2025.\nUndrawn Lines of Credit. \nAs of December 31, 2024 we had approximately $3.1 billion undrawn and available under our revolving credit facilities.\nCovenants. \nWe were in compliance with the covenants in our debt agreements at December 31, 2024. See Note 6 of the Notes to the Consolidated Financial Statements for more information on the covenants in our debt agreements.\nDelta Air Lines, Inc. | 2024 Form 10-K\n42\nItem 7. MD&A - Critical Accounting Estimates\nCritical Accounting Estimates\nOur critical accounting estimates are those estimates made in accordance with generally accepted accounting principles in the U.S. (\"GAAP\") that involve a significant level of estimation uncertainty and have had or are reasonably likely to have a material impact on our consolidated results of operations or financial condition. Accordingly, the actual results may differ materially from these estimates. For a discussion of our significant accounting policies, see Note 1 of the Notes to the Consolidated Financial Statements, unless otherwise noted below.\nLoyalty Program\nOur SkyMiles loyalty program generates customer loyalty by rewarding customers with incentives to travel on Delta. This program allows customers to earn miles by flying on Delta, Delta Connection carriers and other airlines that participate in the loyalty program. When traveling, customers earn miles primarily based on the passenger's loyalty program status, fare class and ticket price. Customers can also earn miles through participating companies. Miles are redeemable by customers for air travel on Delta and other participating airlines, access to Delta Sky Club and other program awards. To facilitate transactions with participating companies, we sell miles to non-airline businesses and other airlines.\nThe loyalty program includes two types of transactions that are considered revenue arrangements with multiple performance obligations (1) passenger ticket sales earning miles and (2) sale of miles to participating companies. \nPassenger Ticket Sales Earning Miles.\n Passenger ticket sales earning miles provide customers with (1) miles earned and (2) air transportation, which are each considered performance obligations. We value each performance obligation on a standalone basis. To value the miles earned, we consider the quantitative value a passenger receives by redeeming miles for a ticket rather than paying cash, which is referred to as equivalent ticket value (\"ETV\"). Our estimate of ETV is adjusted for miles that are not likely to be redeemed (\"mileage breakage\"). We use statistical models to estimate mileage breakage based on historical redemption patterns. A change in assumptions regarding the redemption activity for miles or the estimated fair value of miles expected to be redeemed could have a material impact on our revenue in the year in which the change occurs and in future years. We recognize mileage breakage proportionally during the period in which the remaining miles are actually redeemed.\nAt December 31, 2024, the aggregate deferred revenue balance associated with the SkyMiles program was $8.8 billion. A hypothetical 10% change in the number of outstanding miles estimated to be redeemed would result in an impact of less than 1% of total operating revenue recognized for the year ended December 31, 2024.\nWe defer revenue for the miles when earned and recognize loyalty travel awards in passenger revenue as the miles are redeemed and transportation is provided. We record the air transportation portion of the passenger ticket sales in air traffic liability and recognize passenger revenue when we provide transportation or if the ticket goes unused. A hypothetical 10% increase in our estimate of the ETV of a mile would have decreased total operating revenue by less than 1% for the year ended December 31, 2024, as a result of an increase in the amount of revenue deferred associated with the miles earned.\nSale of Miles to Participating Companies.\n Customers earn miles based on their spending with participating companies, such as credit card, ridesharing, retail, car rental and hotel companies, with which we have marketing agreements to sell miles. Our contracts to sell miles under these marketing agreements have multiple performance obligations. Payments are typically due to us monthly based on the volume of miles sold during the period, and the initial terms of our marketing contracts are from one to thirteen years. During the years ended December 31, 2024, 2023 and 2022, total cash sales from marketing agreements related to our loyalty program were $7.4 billion, $6.9 billion and $5.7 billion, respectively, which are allocated to travel and other performance obligations, as discussed below.\nOur most significant arrangement to sell miles relates to our co-brand credit card relationship with American Express. Our agreements with American Express provide for joint marketing, grant certain benefits to Delta-American Express co-branded credit card holders (\"cardholders\") and American Express Membership Rewards program participants, and allow American Express to market its services or products using our customer database. Cardholders earn miles for making purchases using co-branded cards, and certain cardholders may also receive baggage fee waivers, lounge access, priority boarding and other benefits while traveling on Delta. Additionally, participants in the American Express Membership Rewards program may exchange their points for miles under the loyalty program. We sell miles to American Express which are then provided to their customers under the co-brand credit card program and the Membership Rewards program.\nDelta Air Lines, Inc. | 2024 Form 10-K\n43\nItem 7. MD&A - Critical Accounting Estimates\nWe account for marketing agreements, including those with American Express, by allocating the consideration to the individual products and services delivered. We allocate the value based on the relative selling prices of those products and services, which generally consist of award travel, baggage fee waivers, lounge access, priority boarding and the use of our brand. We determine our best estimate of the selling prices by using a discounted cash flow analysis using multiple inputs and assumptions, including (1) the expected number of miles awarded and number of miles redeemed, (2) ETV for the award travel obligation adjusted for mileage breakage, (3) published rates on our website for baggage fees, Delta Sky Club lounge access and other benefits while traveling on Delta, (4) brand value (using estimated royalties generated from the use of our brand) and (5) volume discounts provided to certain partners.\nWe defer the amount allocated to award travel as part of loyalty program deferred revenue and recognize loyalty travel awards in passenger revenue as the miles are redeemed and transportation is provided. Revenue allocated to services performed in conjunction with a passenger’s flight, such as baggage fee waivers, is recognized as travel-related services in passenger revenue when the related service is performed. Revenue allocated to Delta Sky Club lounge access is recognized as miscellaneous in other revenue as access is provided. Revenue allocated to the remaining performance obligations, primarily brand value, is recorded as loyalty program in other revenue as miles are delivered.\nThe timing of mile redemptions can vary widely; however, the majority of new miles have historically been redeemed within two years of being earned. The loyalty program deferred revenue classified as a current liability represents our estimate of revenue expected to be recognized in the next twelve months based on projected redemptions, while the balance classified as a noncurrent liability represents our estimate of revenue expected to be recognized beyond twelve months.\nFor additional information on our significant accounting policies related to the loyalty program, see Note 2 of the Notes to the Consolidated Financial Statements.\nPassenger Ticket Sales\nWe defer sales of passenger tickets to be flown by us or that we sell on behalf of other airlines in our air traffic liability. Passenger revenue is recognized when we provide transportation. For tickets that we sell on behalf of other airlines, we reduce the air traffic liability when consideration is remitted to those airlines. The air traffic liability primarily includes sales of passenger tickets with scheduled departure dates in the future and travel credits, which can be applied as payment toward the cost of a ticket. We periodically evaluate the estimated air traffic liability and may record adjustments in our Consolidated Statement of Operations (\"income statement\"). These adjustments relate primarily to tickets that expire unused (\"ticket breakage\") and items for which final settlement occurs in periods subsequent to the sale of the related tickets such as refunds, exchanges and transactions with other airlines.\nWe estimate the value of ticket breakage and recognize revenue at the scheduled flight date. Our ticket breakage estimates are primarily based on historical experience, ticket contract terms and customers’ travel behavior. At December 31, 2024, the aggregate air traffic liability balance was $7.1 billion. A hypothetical 10% change in the amount of tickets estimated to expire unused would result in an impact of less than 1% of total operating revenue for the year ended December 31, 2024.\nFor additional information on our significant accounting policies related to passenger ticket sales, see Note 2 of the Notes to the Consolidated Financial Statements.\nGoodwill and Indefinite-Lived Intangible Assets\nWe apply a fair value-based impairment test to the carrying value of goodwill and indefinite-lived intangible assets on an annual basis (as of October 1) and, if certain events or circumstances indicate that an impairment loss may have been incurred, on an interim basis. We assess the value of our goodwill and indefinite-lived assets under either a qualitative or quantitative approach. Under a qualitative approach, we consider various market factors, including certain of the key assumptions listed below. We analyze these factors to determine if events and circumstances have affected the fair value of goodwill and indefinite-lived intangible assets. If we determine that it is more likely than not that the asset may be impaired, we use the quantitative approach to assess the asset's fair value and the amount of the impairment. Under a quantitative approach, we calculate the fair value of the asset incorporating the key assumptions listed below into our calculation.\nDelta Air Lines, Inc. | 2024 Form 10-K\n44\nItem 7. MD&A - Critical Accounting Estimates\nWhen we evaluate goodwill for impairment using a quantitative approach, we estimate the fair value of the reporting unit by considering both comparable public company multiples (a market approach) and projected discounted future cash flows (an income approach). When we perform a quantitative impairment assessment of our indefinite-lived intangible assets, fair value is estimated based on (1) recent market transactions, where available, (2) the royalty method for the Delta tradename (which assumes hypothetical royalties generated from using our tradename) or (3) projected discounted future cash flows (an income approach).\nKey Assumptions.\n The key assumptions in our impairment tests include (1) forecasted revenues, expenses and cash flows, (2) current discount rates, (3) observable market transactions and (4) anticipated changes to the regulatory environment (e.g., changes in slot access and/or availability, additional Open Skies agreements or changes to antitrust approvals). These assumptions are consistent with those that hypothetical market participants would use. Because we are required to make estimates and assumptions when evaluating goodwill and indefinite-lived intangible assets for impairment, actual transaction amounts may differ materially from these estimates. In addition, when performing a qualitative valuation, we consider the amount by which the intangible assets' fair values exceeded their respective carrying values in the most recent fair value measurements calculated using a quantitative approach.\nChanges in certain events and circumstances could result in impairment or a change from indefinite-lived to definite-lived. Factors which could cause impairment include, but are not limited to (1) negative trends in our market capitalization, (2) reduced profitability resulting from lower passenger mile yields or higher input costs, (3) lower passenger demand as a result of weakened U.S. and global economies or other factors, (4) prolonged interruption to our operations, (5) changes to the regulatory environment, (6) operational or performance changes by other airlines and (7) strategic changes to our operations leading to diminished utilization of the intangible assets.\n \nGoodwill\n. Our goodwill balance, which is related to the airline segment, was $9.8 billion at December 31, 2024.\nIdentifiable Intangible Assets. \nOur identifiable intangible assets, which are related to the airline segment, had a net carrying amount of $6.0 billion at December 31, 2024, of which $5.9 billion related to indefinite-lived intangible assets. Indefinite-lived assets are not amortized and consist of routes, slots, the Delta tradename and assets related to alliances and collaborative arrangements. Definite-lived assets consist primarily of marketing and maintenance service agreements. \nDuring the December 2024 quarter, we performed qualitative assessments of goodwill and indefinite-lived intangible assets, including applicable factors noted above, and determined that there was no indication that the assets were impaired. Our qualitative assessments include analyses and weighting of all relevant factors that impact the fair value of our goodwill and indefinite-lived intangible assets. We previously performed quantitative assessments in the December 2023 quarter, noting no impairment of goodwill or indefinite-lived intangible assets.\n \nFor additional information on our goodwill and indefinite-lived intangible assets' significant accounting policies and the related fair values and book values, see Note 5 of the Notes to the Consolidated Financial Statements.\nDefined Benefit Pension Plans\nWe sponsor defined benefit pension plans for eligible employees and retirees. These plans are generally closed to new entrants and frozen for future benefit accruals. As of December 31, 2024, the funded status for these plans recorded on our balance sheets was $938 million, which is the net of our benefit obligation of $15.0 billion and plan assets of $15.9 billion. We had no minimum funding requirements in 2024, and estimate that there will be approximately $80 million of minimum funding requirements under these plans in 2025. The most critical assumptions impacting our defined benefit pension plan obligations, plan assets and net periodic cost/(benefit) are the discount rate, the expected long-term rate of return on plan assets and life expectancy of plan participants.\nDiscount Rate. \nWe determine our discount rate on our measurement date primarily by reference to annualized rates earned on high-quality fixed income investments and yield-to-maturity analyses specific to our estimated future benefit payments for each plan. We used a weighted average discount rate to value the obligations of 5.71% and 5.31% at December 31, 2024 and 2023, respectively.\nExpected Long-Term Rate of Return. \nOur expected long-term rate of return on plan assets is based primarily on plan-specific investment studies using historical market return and volatility data. Modest excess return expectations versus some public market indices are incorporated into the return projections based on the actively managed structure of the investment programs and their records of achieving such returns historically. We also expect to receive a premium for investing in less liquid private markets. We review our rate of return on plan assets assumptions annually.\nDelta Air Lines, Inc. | 2024 Form 10-K\n45\nItem 7. MD&A - Critical Accounting Estimates\nThe investment strategy for our defined benefit pension plan assets is to earn a long-term return that meets or exceeds our annualized return target while taking an acceptable level of risk and maintaining sufficient liquidity to pay current benefits and other cash obligations of the plan. This is achieved by investing in a globally diversified mix of public and private equity, fixed income, real assets, hedge funds and other assets and instruments. The expected long-term rate of return on our defined benefit pension plan assets is 6.97%.\nThe impact of a 0.50% change in weighted average discount rate and 1.00% change in expected long-term rate of return on assets are shown in the table below:\nBenefit plan effects of change in assumptions used\nChange in Assumption\nEffect on 2025\nPension Cost/(Benefit)\nEffect on Accrued Pension Liability at December 31, 2024\n0.50% decrease in weighted average discount rate\n$\n12 \n million\n$\n674 \n million\n0.50% increase in weighted average discount rate\n$\n(12)\n million\n$\n(624)\n million\n1.00% decrease in expected long-term rate of return on assets\n$\n154 \n million\n$\n— \n1.00% increase in expected long-term rate of return on assets\n$\n(154)\n million\n$\n— \nLife Expectancy\n. Changes in life expectancy may significantly impact our benefit obligations and future net periodic cost/(benefit). Each year we review information published by the Society of Actuaries and other publicly available information to develop our best estimate of life expectancy for purposes of measuring pension and other postretirement and postemployment benefit obligations.\nFunding. \nOur funding obligations for qualified defined benefit plans are governed by ERISA and any additional applicable legislation. Under current legislation, any required funding would be amortized over a rolling 15-year period and calculated using a discount rate of no less than 4.75% through 2030.\nWhile recent legislation makes our funding obligations for these plans more predictable, factors outside our control continue to have an impact on the funding requirements. Estimates of future funding requirements are based on various assumptions and can vary materially from actual funding requirements. Assumptions include, among other things, the actual and projected market performance of assets, statutory requirements and demographic data for participants. \nInvestments Valued at Net Asset Value (\"NAV\") Per Share.\n On an annual basis we assess the potential for adjustments to the fair value of all investments. These investments valued using NAV as a practical expedient are typically valued on a monthly or quarterly basis by third-party administrators, valuation agents or fund managers with an annual audit performed by an independent third-party, but certain of these investments have a lag in the availability of data. We solicit valuation updates from the investment fund managers and use their information and corroborating data from public markets to determine any needed fair value adjustments.\nFor additional information on our significant accounting policies related to defined benefit pension plans, see Note 9 of the Notes to the Consolidated Financial Statements.\nRecent Accounting Standards\nRecently Adopted Standards\nIn November 2023, the Financial Accounting Standards Board (\"FASB\") issued Accounting Standards Update (\"ASU\") No. 2023-07, \"Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures.\" This standard requires disclosure of significant segment expenses and other segment items by reportable segment. We adopted this standard effective January 1, 2024. See Note 14 of the Notes to the Consolidated Financial Statements for further information regarding our segment reporting.\nStandards Effective in Future Years\nIncome Taxes.\n In December 2023, the FASB issued ASU No. 2023-09, \"Income Taxes (Topic 740): Improvements to Income Tax Disclosures.\" This standard enhances disclosures related to income taxes, including the rate reconciliation and information on income taxes paid. This ASU is effective beginning January 1, 2025. Upon adoption of this ASU we expect to include certain additional disclosures in the effective income tax rate reconciliation in the footnotes to our Consolidated Financial Statements.\nDelta Air Lines, Inc. | 2024 Form 10-K\n46\nItem 7. MD&A - Critical Accounting Estimates\nDisaggregation of Income Statement Expenses.\n In November 2024, the FASB issued ASU No. 2024-03, \"Income Statement - Reporting Comprehensive Income - Expense Disaggregation Disclosures (Subtopic 220-40).\" This standard requires disclosure of specific information about costs and expenses and becomes effective January 1, 2027. We are assessing the impact of this ASU and, upon adoption, may be required to include certain additional disclosures in the footnotes to our Consolidated Financial Statements.\nSupplemental Information\nWe sometimes use information (\"non-GAAP financial measures\") that is derived from the Consolidated Financial Statements, but that is not presented in accordance with GAAP. Under the U.S. Securities and Exchange Commission rules, non-GAAP financial measures may be considered in addition to results prepared in accordance with GAAP, but should not be considered a substitute for or superior to GAAP results.\nIncluded below are reconciliations of non-GAAP measures used within this Form 10-K to the most directly comparable GAAP financial measures. Reconciliations below may not calculate exactly due to rounding. These reconciliations include certain adjustments to GAAP measures to provide comparability between the reported periods, if applicable, as indicated below:\n•\nMTM adjustments and settlements on hedges. \nMark-to-market (\"MTM\") adjustments are defined as fair value changes recorded in periods other than the settlement period. Such fair value changes are not necessarily indicative of the actual settlement value of the underlying hedge in the contract settlement period, and therefore we remove this impact to allow investors to better understand and analyze our core performance. Settlements represent cash received or paid on hedge contracts settled during the applicable period.\n•\nOne-time pilot agreement expenses. \nDuring 2023, Delta pilots ratified a new four-year Pilot Working Agreement effective January 1, 2023. The agreement includes a provision for a one-time payment made upon ratification in the March 2023 quarter of $735 million. Additionally, we recorded adjustments to other benefit-related items of approximately $130 million. Adjusting for these expenses allows investors to better understand and analyze our core cost performance.\n•\nThird-party refinery sales. \nRefinery sales to third parties, and related expenses, are not related to our airline segment. Excluding these sales therefore provides a more meaningful comparison of our airline operations to the rest of the airline industry.\n•\nAircraft fuel and related taxes. \nThe volatility in fuel prices impacts the comparability of year-over-year financial performance. The adjustment for aircraft fuel and related taxes allows investors to better understand and analyze our non-fuel costs and year-over-year financial performance.\n•\nProfit sharing.\n We adjust for profit sharing because this adjustment allows investors to better understand and analyze our recurring cost performance and provides a more meaningful comparison of our core operating costs to the airline industry.\nOperating income, adjusted reconciliation\nYear Ended December 31,\n(in millions)\n2024\n2023\nOperating income\n$\n5,995 \n$\n5,521 \nAdjusted for:\nMTM adjustments and settlements on hedges\n21 \n(52)\nOne-time pilot agreement expenses\n— \n864 \nOperating income, adjusted\n$\n6,016 \n$\n6,334 \nDelta Air Lines, Inc. | 2024 Form 10-K\n47\nItem 7. MD&A - Supplemental Information\nTotal revenue, adjusted reconciliation\nYear Ended December 31,\n(in millions)\n2024\n2023\nTotal revenue\n$\n61,643 \n$\n58,048 \nAdjusted for:\nThird-party refinery sales\n(4,642)\n(3,379)\nTotal revenue, adjusted\n$\n57,001 \n$\n54,669 \nOperating expense, adjusted reconciliation\nYear Ended December 31,\n(in millions)\n2024\n2023\nOperating expense\n$\n55,648 \n$\n52,527 \nAdjusted for:\nThird-party refinery sales\n(4,642)\n(3,379)\nMTM adjustments and settlements on hedges\n(21)\n52 \nOne-time pilot agreement expenses\n— \n(864)\nOperating expense, adjusted\n$\n50,985 \n$\n48,335 \nFuel expense, adjusted and Average fuel price per gallon, adjusted reconciliations\nAverage Price Per Gallon \nYear Ended December 31,\nYear Ended December 31,\n(in millions, except per gallon data) \n2024\n2023\n2024\n2023\nTotal fuel expense \n$\n10,566 \n$\n11,069 \n$\n2.57 \n$\n2.82 \nAdjusted for:\nMTM adjustments and settlements on hedges\n(21)\n52 \n(0.01)\n0.01 \nTotal fuel expense, adjusted\n$\n10,544 \n$\n11,121 \n$\n2.56 \n$\n2.83 \nTRASM, adjusted reconciliation\nYear Ended December 31,\n(in cents)\n2024\n2023\nTRASM\n21.37 \n¢\n21.34 \n¢\nAdjusted for:\nThird-party refinery sales\n(1.61)\n(1.24)\nTRASM, adjusted\n19.76 \n¢\n20.10 \n¢\nCASM-Ex reconciliation\nYear Ended December 31,\n(in cents)\n2024\n2023\nCASM\n19.30 \n¢\n19.31 \n¢\nAdjusted for:\nAircraft fuel and related taxes\n(3.66)\n(4.07)\nThird-party refinery sales\n(1.61)\n(1.24)\nProfit sharing\n(0.48)\n(0.51)\nOne-time pilot agreement expenses\n— \n(0.32)\nCASM-Ex\n13.54 \n¢\n13.17 \n¢\nDelta Air Lines, Inc. | 2024 Form 10-K\n48\nItem 7. MD&A - Supplemental Information\nFree Cash Flow\nThe following table shows a reconciliation of net cash provided by operating activities (a GAAP measure) to free cash flow (a non-GAAP financial measure). We present free cash flow because management believes this metric is helpful to investors to evaluate the company's ability to generate cash that is available for use for debt service or general corporate initiatives. Adjustments include:\n•\nNet redemptions of short-term investments.\n Net redemptions of short-term investments represent the net purchase and sale activity of investments and marketable securities in the period, including gains and losses. We adjust for this activity to provide investors a better understanding of the company's free cash flow generated by our operations.\n•\nNet cash flows related to certain airport construction projects and other.\n Cash flows related to certain airport construction projects are included in our GAAP operating activities and capital expenditures. We have adjusted for these items, which were primarily funded by cash restricted for airport construction, to provide investors a better understanding of the company's free cash flow that is core to our operations.\nFree cash flow reconciliation\nYear Ended December 31,\n(in millions)\n2024\nNet cash provided by operating activities\n$\n8,025 \nNet cash used in investing activities\n(3,739)\nAdjusted for:\nNet redemptions of short-term investments\n(1,137)\nNet cash flows related to certain airport construction projects and other\n276 \nFree cash flow\n$\n3,424 \nDelta Air Lines, Inc. | 2024 Form 10-K\n49\nItem 7. MD&A - Glossary of Defined Terms\nGlossary of Defined Terms\nASM \n- Available Seat Mile. A measure of capacity. ASMs equal the total number of seats available for transporting passengers during a reporting period multiplied by the total number of miles flown during that period.\nCASM \n- (Total Operating) Cost per Available Seat Mile. The amount of operating cost incurred per ASM during a reporting period. CASM is also referred to as \"unit cost.\"\nCASM-Ex \n- The amount of operating cost incurred per ASM during a reporting period, adjusted for the items shown above in \"Supplemental Information.\"\nFree Cash Flow\n - A measure of net cash from operating and investing activities, adjusted for items shown above in \"Supplemental Information.\" Represents the cash available for use for debt service or general corporate initiatives.\nLiquidity\n - Includes our cash and cash-like assets, including cash equivalents and short-term investments, as well as aggregate principal amount committed and available to be drawn under our revolving credit facilities.\nLoad Factor \n- A measure of utilized available seating capacity calculated by dividing RPMs by ASMs for a reporting period.\nPassenger Mile Yield or Yield \n- The amount of passenger revenue earned per RPM during a reporting period.\nPRASM \n- Passenger Revenue per ASM. The amount of passenger revenue earned per ASM during a reporting period. PRASM is also referred to as \"passenger unit revenue.\"\nRPM \n- Revenue Passenger Mile. One revenue-paying passenger transported one mile is one RPM. RPMs equal the number of revenue passengers during a reporting period multiplied by the number of miles flown by those passengers during that period. RPMs are also referred to as \"traffic.\"\nTRASM \n- Total Revenue per ASM. The amount of total revenue earned per ASM during a reporting period.\nTRASM, adjusted\n - The amount of total revenue earned per ASM during a reporting period, adjusted for the item shown above in \"Supplemental Information.\"\nDelta Air Lines, Inc. | 2024 Form 10-K\n50\nItem 7A. Market Risk\nITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nWe have market risk exposure related to fuel prices, interest rates, foreign currency exchange rates and changes in the market value of equity investments. Market risk is the potential negative impact of adverse changes in these prices or rates on our Consolidated Financial Statements. In an effort to manage our exposure to these risks, we may enter into derivative contracts and may adjust our derivative portfolio as market conditions change. See Note 3 of the Notes to the Consolidated Financial Statements for further information on our derivative contracts. We expect adjustments to the fair value of financial instruments to result in ongoing volatility in earnings and stockholders' equity.\nThe following sensitivity analyses do not consider the effects of a change in demand for air travel, the economy as a whole or actions we may take to seek to mitigate our exposure to a particular risk. For these and other reasons, the actual results of changes in these prices or rates may differ materially from the following hypothetical results.\nFuel Price Risk\nChanges in fuel prices materially impact our results of operations. A one cent increase in the cost of jet fuel per gallon would result in approximately $40 million of additional annual fuel expense based on annual consumption of approximately four billion gallons of jet fuel. Our derivative contracts to hedge the financial risk from changing fuel prices are related to Monroe’s inventory.\nInterest Rate Risk\nOur exposure to market risk from adverse changes in interest rates is primarily associated with our debt and lease obligations. Market risk associated with our fixed-rate debt relates to the potential reduction in fair value from an increase in interest rates. Market risk associated with our variable-rate debt and variable-rate leases relates to the potential negative impact to future earnings from an increase in interest rates.\nAt December 31, 2024, we had $14.5 billion of fixed-rate debt, $0.9 billion of variable-rate debt and $0.4 billion of variable-rate leases. The rates used in our variable-rate debt are based on Secured Overnight Financing Rate (\"SOFR\"), or another index rate, which in certain cases is subject to a floor. An increase of 100 basis points in average annual interest rates would have decreased the estimated fair value of our fixed-rate debt by $620 million at December 31, 2024 and would have increased the annual interest expense on our variable-rate debt and variable-rate leases by $12 million.\nForeign Currency Exchange Risk\nWe are subject to foreign currency exchange rate risk because we have revenue, expense and equity investments denominated in foreign currencies. To manage exchange rate risk, we execute both our international revenue and expense transactions in the same foreign currency to the extent practicable. From time to time, we may also enter into foreign currency option and forward contracts. \nAt December 31, 2024 we had no open foreign currency options or forward contracts. As of December 31, 2024, our investments denominated in foreign currencies (AirFrance-KLM, China Eastern, Hanjin-KAL and LATAM) were recorded at a fair value of $1.6 billion. A 10% change in the value of those respective currencies against the U.S. dollar would have an approximately $160 million impact on our financial statements.\nEquity Investment Risk\nWe own equity investments in a number of airlines and airline service companies, which are subject to equity price risk. We often hold our equity securities for long periods and short-term price volatility has occurred in the past and will occur in the future, impacting the volatility of our financial results. During 2024, we recorded a net loss of $319 million related to the valuation of our fair value investments compared to a net gain of $1.3 billion in 2023. As of December 31, 2024, we had long-term investments recorded at fair value of $2.4 billion and, therefore, a 10% change in the fair value of these investments would have an approximately $240 million impact on our financial results. See Note 3 and Note 4 of the Notes to the Consolidated Financial Statements for further information on our investments.\nDelta Air Lines, Inc. | 2024 Form 10-K\n51\nFinancial Statements\nITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nPage\nReport of Independent Registered Public Accounting Firm\n (PCAOB ID: \n42\n)\n53\nConsolidated Balance Sheets - December 31, 20\n2\n4\n and 20\n23\n55\nConsolidated Statements of Operations for the years ended December 31, 20\n2\n4\n, 20\n2\n3\n and 20\n22\n56\nConsolidated Statements of Comprehensive Income for the years ended December 31, \n20\n24\n, 20\n23\n and 20\n22\n57\nConsolidated Statements of Cash Flows for the years ended December 31, \n20\n24\n, 20\n23\n and 20\n22\n58\nConsolidated Statements of Stockholders' Equity for the years ended December 31, \n20\n24\n, 20\n23\n and 20\n22\n59\nNotes to the Consolidated Financial Statements\n60\nNote 1 - Summary of Significant Accounting Policies\n60\nNote \n2\n - Revenue Recognition\n63\nNote \n3\n - Fair Value Measurements\n67\nNote \n4\n - Investments\n68\nNote \n5\n -\n Goodwill and\n Intangible Assets\n69\nNote 6 - Debt\n71\nNote \n7\n - Leases\n73\nNote \n8\n - Airport Redevelopment\n75\nNote \n9\n - Employee Benefit Plans\n76\nNote 1\n0\n - Commitments and Contingencies\n81\nNote 1\n1\n - Income Taxes\n84\nNote 1\n2\n - Equity and Equity Compensation\n86\nNote 1\n3\n - Accumulated Other Comprehensive Loss\n88\nNote 1\n4\n - Segments\n89\nNote 1\n5\n - Earnings Per Share\n91\nDelta Air Lines, Inc. | 2024 Form 10-K\n52\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and the Board of Directors of Delta Air Lines, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Delta Air Lines, Inc. (the Company) as of December 31, 2024 and 2023, the related consolidated statements of operations, comprehensive income, cash flows, and stockholders' equity for each of the three years in the period ended December 31, 2024, and the related notes (collectively referred to as the \n\"\nconsolidated financial statements\n\"\n). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework), and our report dated February 11, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nEmployee Benefit Plans - Net Asset Value Per Share (NAV) Asset Valuation\nDescription of the Matter\nAt December 31, 2024, the fair value of the Company’s benefit plan assets measured at fair value on a recurring basis totaled $15.7 billion, of which $12.4 billion do not have a readily determinable fair value and are measured at NAV as a practical expedient. Management determines the fair value of NAV assets by applying the methodologies described in Note 9 to the consolidated financial statements.\nAuditing the Company’s estimates of the fair value of its NAV assets required significant judgment, primarily resulting from the lag in the availability of data provided by the investment fund managers. \nDelta Air Lines, Inc. | 2024 Form 10-K\n53\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design and tested the operating effectiveness of controls over the Company’s accounting for the fair value measurement of its NAV assets, including controls over management’s assessment of the significant inputs and estimates affecting the fair value measurement.\nTo test the fair value of plan assets measured at NAV, our audit procedures included, among others, evaluating the valuation methodologies used by the Company and comparing significant inputs and underlying data used in the Company's valuations to third-party source documentation. Additionally, we performed sensitivity analyses to evaluate the changes to the Company’s net periodic benefit that would result from changes in the fair value measurement, compared the Company’s asset performance results to applicable third-party benchmarks, and assessed management’s historical accuracy of estimating fair value by performing retrospective review procedures comparing the Company’s estimates of fair value as of the prior year end to the fair value NAV in the investment’s audited financial statements made available during the current year.\nLoyalty Program - Mileage Breakage\nDescription of the Matter\nAt December 31, 2024, the Company’s aggregate current and noncurrent loyalty program deferred revenue balance was $8.8 billion. For the year ended December 31, 2024, the Company recognized $3.8 billion of revenue classified as loyalty travel awards within passenger revenue and $3.3 billion of revenue classified as loyalty program revenue within other revenue in the consolidated statement of operations. As disclosed in Note 2 to the consolidated financial statements, the Company defers revenue for mileage credits earned and recognizes loyalty travel awards in passenger revenue as the miles are redeemed and services are provided. In accounting for its loyalty program deferred revenue, the Company estimates the amount of mileage credits outstanding that are not expected to be redeemed (mileage breakage). The Company recognizes mileage breakage proportionally during the period in which the remaining mileage credits are redeemed. Under the Company’s loyalty program, mileage credits do not expire. Therefore, the Company uses statistical models to estimate mileage breakage based on historical redemption patterns.\nAuditing the mileage breakage estimate for the loyalty program required significant judgment. In particular, there is complexity and subjectivity in estimating mileage breakage based on expectations of future redemption patterns due to the absence of historical expirations as the Company’s mileage credits do not expire.\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design and tested the operating effectiveness of controls over the Company’s accounting for its loyalty program, including controls over management’s review of the estimation of the mileage breakage and the completeness and accuracy of the data underlying the mileage breakage estimate.\nTo test the mileage breakage estimate, our audit procedures included, among others, involving an actuarial specialist to assist in assessing the method and assumptions used by the Company to develop the mileage breakage estimate and to independently develop a range of mileage breakage estimates and compare to the Company's estimate. Additionally, we tested the completeness and accuracy of the underlying mileage data used to develop the mileage breakage estimate.\n/s/ \nErnst & Young LLP\nWe have served as the Company's auditor since 2006.\nAtlanta, Georgia\nFebruary 11, 2025\nDelta Air Lines, Inc. | 2024 Form 10-K\n54\nFinancial Statements\nDELTA AIR LINES, INC.\nConsolidated Balance Sheets\nDecember 31,\n(in millions, except share data)\n2024\n2023\nASSETS\nCurrent Assets:\nCash and cash equivalents\n$\n3,069\n \n$\n2,741\n \nShort-term investments\n—\n \n1,127\n \nAccounts receivable, net of an allowance for uncollectible accounts of $\n18\n and $\n17\n3,224\n \n3,130\n \nFuel, expendable parts and supplies inventories, net of an allowance for obsolescence of $\n120\n and $\n123\n \n1,428\n \n1,314\n \nPrepaid expenses and other\n2,123\n \n1,957\n \nTotal current assets\n9,844\n \n10,269\n \nNoncurrent Assets:\nProperty and equipment, net of accumulated depreciation and amortization of $\n23,228\n and $\n21,707\n \n37,595\n \n35,486\n \nOperating lease right-of-use assets\n6,644\n \n7,004\n \nGoodwill\n9,753\n \n9,753\n \nIdentifiable intangibles, net of accumulated amortization of $\n919\n and $\n911\n5,975\n \n5,983\n \nEquity investments\n2,846\n \n3,457\n \nOther noncurrent assets\n2,715\n \n1,692\n \nTotal noncurrent assets\n65,528\n \n63,375\n \nTotal assets\n$\n75,372\n \n$\n73,644\n \nLIABILITIES AND STOCKHOLDERS' EQUITY\nCurrent Liabilities:\nCurrent maturities of debt and finance leases\n$\n2,175\n \n$\n2,983\n \nCurrent maturities of operating leases\n763\n \n759\n \nAir traffic liability\n7,094\n \n7,044\n \nAccounts payable\n4,650\n \n4,446\n \nAccrued salaries and related benefits\n4,762\n \n4,561\n \nLoyalty program deferred revenue\n4,314\n \n3,908\n \nFuel card obligation\n1,100\n \n1,100\n \nOther accrued liabilities\n1,812\n \n1,617\n \nTotal current liabilities\n26,670\n \n26,418\n \nNoncurrent Liabilities:\nDebt and finance leases\n14,019\n \n17,071\n \nPension, postretirement and related benefits\n3,144\n \n3,601\n \nLoyalty program deferred revenue\n4,512\n \n4,512\n \nNoncurrent operating leases\n5,814\n \n6,468\n \nDeferred income taxes, net\n2,176\n \n908\n \nOther noncurrent liabilities\n3,744\n \n3,561\n \nTotal noncurrent liabilities\n33,409\n \n36,121\n \nCommitments and Contingencies\nStockholders' Equity:\nCommon stock at $\n0.0001\n par value; \n1,500,000,000\n shares authorized, \n654,571,606\n and \n654,671,194\n shares issued \n—\n \n—\n \nAdditional paid-in capital\n11,740\n \n11,641\n \nRetained earnings\n8,783\n \n5,650\n \nAccumulated other comprehensive loss\n(\n4,979\n)\n(\n5,845\n)\nTreasury stock, at cost, \n8,098,971\n and \n11,224,246\n shares\n(\n251\n)\n(\n341\n)\nTotal stockholders' equity\n15,293\n \n11,105\n \nTotal liabilities and stockholders' equity\n$\n75,372\n \n$\n73,644\n \nThe accompanying notes are an integral part of these Consolidated Financial Statements.\nDelta Air Lines, Inc. | 2024 Form 10-K\n55\nFinancial Statements\nDELTA AIR LINES, INC.\nConsolidated Statements of Operations\nYear Ended December 31,\n(in millions, except per share data)\n2024\n2023\n2022\nOperating Revenue:\nPassenger\n$\n50,894\n \n$\n48,909\n \n$\n40,218\n \nCargo\n822\n \n723\n \n1,050\n \nOther\n9,927\n \n8,416\n \n9,314\n \nTotal operating revenue\n61,643\n \n58,048\n \n50,582\n \nOperating Expense:\nSalaries and related costs\n16,161\n \n14,607\n \n11,902\n \nAircraft fuel and related taxes\n10,566\n \n11,069\n \n11,482\n \nAncillary businesses and refinery\n5,416\n \n4,172\n \n5,756\n \nContracted services\n4,228\n \n4,041\n \n3,345\n \nLanding fees and other rents\n3,150\n \n2,563\n \n2,181\n \nAircraft maintenance materials and outside repairs\n2,616\n \n2,432\n \n1,982\n \nDepreciation and amortization\n2,513\n \n2,341\n \n2,107\n \nPassenger commissions and other selling expenses\n2,485\n \n2,334\n \n1,891\n \nRegional carrier expense\n2,328\n \n2,200\n \n2,051\n \nPassenger service\n1,788\n \n1,750\n \n1,453\n \nProfit sharing\n1,389\n \n1,383\n \n563\n \nAircraft rent\n548\n \n532\n \n508\n \nPilot agreement and related expenses\n—\n \n864\n \n—\n \nOther\n2,460\n \n2,239\n \n1,700\n \nTotal operating expense\n55,648\n \n52,527\n \n46,921\n \nOperating Income\n5,995\n \n5,521\n \n3,661\n \nNon-Operating (Expense)/Income:\nInterest expense, net\n(\n747\n)\n(\n834\n)\n(\n1,029\n)\nGain/(loss) on investments, net\n(\n319\n)\n1,263\n \n(\n783\n)\nLoss on extinguishment of debt \n(\n39\n)\n(\n63\n)\n(\n100\n)\nMiscellaneous, net\n(\n232\n)\n(\n279\n)\n165\n \nTotal non-operating (expense)/income, net\n(\n1,337\n)\n87\n \n(\n1,747\n)\nIncome Before Income Taxes\n4,658\n \n5,608\n \n1,914\n \nIncome Tax Provision\n(\n1,201\n)\n(\n999\n)\n(\n596\n)\nNet Income\n$\n3,457\n \n$\n4,609\n \n$\n1,318\n \nBasic Earnings Per Share\n$\n5.39\n \n$\n7.21\n \n$\n2.07\n \nDiluted Earnings Per Share\n$\n5.33\n \n$\n7.17\n \n$\n2.06\n \nThe accompanying notes are an integral part of these Consolidated Financial Statements.\nDelta Air Lines, Inc. | 2024 Form 10-K\n56\nFinancial Statements\nDELTA AIR LINES, INC.\nConsolidated Statements of Comprehensive Income\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nNet Income\n$\n3,457\n \n$\n4,609\n \n$\n1,318\n \nOther comprehensive income:\nNet change in pension and other benefits\n864\n \n(\n44\n)\n1,329\n \nNet change in other\n2\n \n—\n \n—\n \nTotal Other Comprehensive Income/(Loss)\n866\n \n(\n44\n)\n1,329\n \nComprehensive Income\n$\n4,323\n \n$\n4,565\n \n$\n2,647\n \nThe accompanying notes are an integral part of these Consolidated Financial Statements.\nDelta Air Lines, Inc. | 2024 Form 10-K\n57\nFinancial Statements\nDELTA AIR LINES, INC.\nConsolidated Statements of Cash Flows\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nCash Flows From Operating Activities:\nNet income\n$\n3,457\n \n$\n4,609\n \n$\n1,318\n \nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization\n2,513\n \n2,341\n \n2,107\n \nDeferred income taxes\n1,155\n \n980\n \n591\n \n(Gain)/loss on fair value investments\n323\n \n(\n1,283\n)\n874\n \nPension, postretirement and postemployment payments greater than expense\n(\n296\n)\n(\n121\n)\n(\n453\n)\nChanges in certain assets and liabilities:\nReceivables\n(\n126\n)\n(\n7\n)\n(\n728\n)\nPrepaids and other current assets\n(\n241\n)\n137\n \n(\n1,026\n)\nAir traffic liability\n50\n \n(\n1,216\n)\n1,902\n \nLoyalty program deferred revenue\n407\n \n538\n \n324\n \nProfit sharing\n6\n \n821\n \n455\n \nOther payables, deferred revenue and accrued liabilities\n614\n \n(\n285\n)\n1,226\n \nOther, net\n163\n \n(\n50\n)\n(\n227\n)\nNet cash provided by operating activities\n8,025\n \n6,464\n \n6,363\n \nCash Flows From Investing Activities:\nProperty and equipment additions:\nFlight equipment, including advance payments\n(\n3,914\n)\n(\n3,645\n)\n(\n4,495\n)\nGround property and equipment, including technology\n(\n1,226\n)\n(\n1,678\n)\n(\n1,871\n)\nPurchase of equity investments\n—\n \n(\n152\n)\n(\n870\n)\nPurchase of short-term investments\n—\n \n(\n2,312\n)\n(\n2,704\n)\nRedemption of short-term investments\n1,137\n \n4,547\n \n2,804\n \nOther, net\n264\n \n92\n \n212\n \nNet cash used in investing activities\n(\n3,739\n)\n(\n3,148\n)\n(\n6,924\n)\nCash Flows From Financing Activities:\nProceeds from long-term obligations\n—\n \n878\n \n—\n \nPayments on debt and finance lease obligations\n(\n3,953\n)\n(\n4,071\n)\n(\n4,475\n)\nCash dividends\n(\n321\n)\n(\n128\n)\n—\n \nOther, net\n14\n \n(\n73\n)\n(\n60\n)\nNet cash used in financing activities\n(\n4,260\n)\n(\n3,394\n)\n(\n4,535\n)\nNet Increase/(Decrease) in Cash, Cash Equivalents and Restricted Cash\n26\n \n(\n78\n)\n(\n5,096\n)\nCash, cash equivalents and restricted cash at beginning of period\n3,395\n \n3,473\n \n8,569\n \nCash, cash equivalents and restricted cash at end of period\n$\n3,421\n \n$\n3,395\n \n$\n3,473\n \nSupplemental Disclosure of Cash Paid for Interest\n$\n1,001\n \n$\n1,164\n \n$\n1,261\n \nNon-Cash Transactions:\nRight-of-use assets acquired or modified under operating leases\n$\n327\n \n$\n661\n \n$\n531\n \nFlight and ground equipment acquired or modified under finance leases\n(\n17\n)\n31\n \n91\n \nOperating leases converted to finance leases\n25\n \n84\n \n342\n \nEquity investments and other financings \n—\n \n—\n \n330\n \nThe accompanying notes are an integral part of these Consolidated Financial Statements.\nDelta Air Lines, Inc. | 2024 Form 10-K\n58\nFinancial Statements\nDELTA AIR LINES, INC.\nConsolidated Statements of Stockholders' Equity\nCommon Stock\nAdditional Paid-In Capital\nRetained Earnings / (Accumulated Deficit)\nAccumulated Other Comprehensive Loss\nTreasury Stock\n(in millions, except per share data)\nShares\nAmount\nShares\nAmount\nTotal\nBalance at January 1, 2022\n650\n \n$\n—\n \n$\n11,447\n \n$\n(\n148\n)\n$\n(\n7,130\n)\n10\n \n$\n(\n282\n)\n$\n3,887\n \nNet income\n— \n— \n— \n1,318\n \n— \n— \n— \n1,318\n \nOther comprehensive income\n— \n— \n— \n— \n1,329\n \n— \n— \n1,329\n \nCommon stock issued for employee equity awards\n(1)\n2\n \n— \n79\n \n— \n— \n1\n \n(\n31\n)\n48\n \nBalance at December 31, 2022\n652\n \n—\n \n11,526\n \n1,170\n \n(\n5,801\n)\n11\n \n(\n313\n)\n6,582\n \nNet income\n— \n— \n— \n4,609\n \n— \n— \n— \n4,609\n \nDividends declared ($\n0.2\n0 per share)\n— \n— \n— \n(\n129\n)\n— \n— \n— \n(\n129\n)\nOther comprehensive loss\n— \n— \n— \n— \n(\n44\n)\n— \n— \n(\n44\n)\nCommon stock issued for employee equity awards\n(1)\n3\n \n— \n115\n \n— \n— \n— \n(\n28\n)\n87\n \nBalance at December 31, 2023\n655\n \n—\n \n11,641\n \n5,650\n \n(\n5,845\n)\n11\n \n(\n341\n)\n11,105\n \nNet income\n— \n— \n— \n3,457\n \n— \n— \n— \n3,457\n \nDividends declared ($\n0.50\n per share)\n— \n— \n— \n(\n324\n)\n— \n— \n— \n(\n324\n)\nOther comprehensive income\n— \n— \n— \n— \n866\n \n— \n— \n866\n \nCommon stock issued for employee equity awards\n(1)\n(\n1\n)\n— \n31\n \n— \n— \n(\n3\n)\n90\n \n121\n \nStock options exercised\n1\n \n— \n68\n \n— \n— \n— \n— \n68\n \nBalance at December 31, 2024\n655\n \n$\n—\n \n$\n11,740\n \n$\n8,783\n \n$\n(\n4,979\n)\n8\n \n$\n(\n251\n)\n$\n15,293\n \n(1)\nTreasury shares were withheld for payment of taxes, at a weighted average price per share of $\n40.84\n, $\n40.08\n and $\n40.52\n in 2024, 2023 and 2022, respectively.\nThe accompanying notes are an integral part of these Consolidated Financial Statements.\nDelta Air Lines, Inc. | 2024 Form 10-K\n59\nNotes to the Consolidated Financial Statements\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 1.\n \nSUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nDelta Air Lines, Inc., a Delaware corporation, provides scheduled air transportation for passengers and cargo throughout the United States (\"U.S.\") and around the world. Our Consolidated Financial Statements include the accounts of Delta Air Lines, Inc. and our consolidated subsidiaries and have been prepared in accordance with generally accepted accounting principles in the U.S. (\"GAAP\"). We are not the primary beneficiary of, nor do we have a controlling financial interest in, any variable interest entity. Accordingly, we have not consolidated any variable interest entity.\nWe have marketing alliances with other airlines to enhance our access to domestic and international markets. These arrangements may include codesharing, reciprocal loyalty program benefits, shared or reciprocal access to passenger lounges, joint promotions, common use of airport gates and ticket counters, office co-location and other marketing agreements. We have received antitrust immunity for certain marketing arrangements, which enables us to offer a more integrated route network and develop common sales, marketing and discount programs for customers. Some of our marketing arrangements provide for the sharing of revenues and expenses. Revenues and expenses associated with the flights we operate under collaborative arrangements are presented on a gross basis in the applicable line items on our Consolidated Statements of Operations (\"income statement\").\nWe have reclassified certain prior period amounts to conform to the current period presentation. Unless otherwise noted, all amounts disclosed are stated before consideration of income taxes.\nUse of Estimates\nWe are required to make estimates and assumptions when preparing our Consolidated Financial Statements in accordance with GAAP. These estimates and assumptions affect the amounts reported in our Consolidated Financial Statements and the accompanying notes. Actual results could differ materially from those estimates.\nRecent Accounting Standards\nRecently Adopted Standards\nIn November 2023, the Financial Accounting Standards Board (\"FASB\") issued Accounting Standards Update (\"ASU\") No. 2023-07, \"Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures.\" This standard requires disclosure of significant segment expenses and other segment items by reportable segment. We adopted this standard effective January 1, 2024. See Note 14, \"Segments,\" for further information regarding our segment reporting. \nStandards Effective in Future Years\nIncome Taxes.\n In December 2023, the FASB issued ASU No. 2023-09, \"Income Taxes (Topic 740): Improvements to Income Tax Disclosures.\" This standard enhances disclosures related to income taxes, including the rate reconciliation and information on income taxes paid. This ASU is effective beginning January 1, 2025. Upon adoption of this ASU we expect to include certain additional disclosures in the effective income tax rate reconciliation in the footnotes to our Consolidated Financial Statements.\nDisaggregation of Income Statement Expenses.\n In November 2024, the FASB issued ASU No. 2024-03, \"Income Statement - Reporting Comprehensive Income - Expense Disaggregation Disclosures (Subtopic 220-40).\" This standard requires disclosure of specific information about costs and expenses and becomes effective January 1, 2027. We are assessing the impact of this ASU and, upon adoption, may be required to include certain additional disclosures in the footnotes to our Consolidated Financial Statements.\nDelta Air Lines, Inc. | 2024 Form 10-K\n60\nNotes to the Consolidated Financial Statements\nSignificant Accounting Policies\nOur significant accounting policies are disclosed below or included within the topic-specific notes included herein.\nCash and Cash Equivalents and Short-Term Investments\nShort-term, highly liquid investments with maturities of three months or less when purchased are classified as cash and cash equivalents.\n \nInvestments with maturities of greater than three months, but not in excess of one year, when purchased were classified as short-term investments and stated at fair value. Investments with maturities beyond one year when purchased may be classified as short-term investments if they are expected to be available to support our short-term liquidity needs.\nThe following table provides a reconciliation of cash, cash equivalents and restricted cash reported within the Consolidated Balance Sheets (\"balance sheets\") that sum to the total of the same such amounts shown within the Consolidated Statements of Cash Flows (\"cash flows statement\").\nReconciliation of cash, cash equivalents and restricted cash\nDecember 31,\n(in millions)\n2024\n2023\n2022\nCurrent assets:\nCash and cash equivalents\n$\n3,069\n \n$\n2,741\n \n$\n3,266\n \nRestricted cash included in prepaid expenses and other\n168\n \n199\n \n138\n \nNoncurrent assets:\nRestricted cash included in other noncurrent assets\n184\n \n455\n \n69\n \nTotal cash, cash equivalents and restricted cash\n$\n3,421\n \n$\n3,395\n \n$\n3,473\n \nInventories\nFuel.\n As part of our strategy to mitigate the cost of the refining margin reflected in the price of jet fuel, our wholly owned subsidiary, Monroe Energy, LLC (\"Monroe\"), operates the Trainer oil refinery. Refined products (finished goods) and feedstock and blendstock inventories (work-in-process) are carried at the lower of cost and net realizable value. We use jet fuel in our airline operations that is produced by the refinery, procured through the exchanges with third parties of gasoline, diesel and other refined products (\"non-jet fuel products\") the refinery produces and purchased directly from third parties. Cost is determined using the first-in, first-out method. Costs include the raw material consumed plus direct manufacturing costs (such as labor, utilities and supplies) as incurred and an applicable portion of manufacturing overhead.\nExpendables Parts and Supplies.\n Inventories of expendable parts related to flight equipment, which cannot be economically repaired, reconditioned or reused after removal from the aircraft, are carried at moving average cost and charged to aircraft maintenance materials and outside repairs as consumed. An allowance for obsolescence is provided over the remaining useful life of the related fleet. We also provide allowances for parts identified as excess or obsolete to reduce the carrying costs to the lower of cost or net realizable value. These parts are estimated to have residual value of \n5\n% of the original cost.\nAccounting for Refinery Related Buy/Sell Agreements\nTo the extent that we receive jet fuel for non-jet fuel products exchanged under buy/sell agreements, we account for these transactions as nonmonetary exchanges. We have recorded these nonmonetary exchanges at the carrying amount of the non-jet fuel products transferred within aircraft fuel and related taxes on the income statement.\nDerivatives\nChanges in fuel prices, interest rates and foreign currency exchange rates impact our results of operations. In an effort to manage our exposure to these risks, we may enter into derivative contracts and adjust our derivative portfolio as market conditions change. \nOur derivative contracts are recognized at fair value on our balance sheets and had net balances of $\n17\n million and $\n5\n million at December 31, 2024 and 2023, respectively. See Note 3, \"Fair Value Measurements,\" for further information regarding our derivative contracts.\nDelta Air Lines, Inc. | 2024 Form 10-K\n61\nNotes to the Consolidated Financial Statements\nLong-Lived Assets\nOur long-lived lived assets include property and equipment, net and operating lease right-of-use (\"ROU\") assets on our balance sheets. Our tangible assets consist primarily of flight equipment, which is mobile across geographic markets. Accordingly, assets are not allocated to specific geographic regions. \nSee Note 7, \"Leases,\" for further information regarding our leases. \nThe following table summarizes our property and equipment:\nProperty and equipment by classification\nDecember 31,\n(in millions, except for estimated useful life)\nEstimated Useful Life\n2024\n2023\nFlight equipment\n(1)\n25\n-\n34\n years\n$\n44,722\n \n$\n40,976\n \nGround property and equipment\n3\n-\n40\n years\n10,695\n \n9,986\n \nInformation technology-related assets\n3\n-\n15\n years\n3,135\n \n3,307\n \nFlight and ground equipment under finance leases\nLease term or estimated useful life\n1,196\n \n1,862\n \nAdvance payments for equipment\n1,075\n \n1,062\n \nLess: accumulated depreciation and amortization\n(2)\n(\n23,228\n)\n(\n21,707\n)\nTotal property and equipment, net\n$\n37,595\n \n$\n35,486\n \n(1)\nIncludes aircraft and associated engines and parts.\n(2)\nIncludes accumulated amortization for flight and ground equipment under finance leases in the amount of $\n371\n million and $\n525\n million at December 31, 2024 and 2023, respectively.\nWe record property and equipment at cost and depreciate or amortize these assets on a straight-line basis to their estimated residual values over their estimated useful lives. The estimated useful life for leasehold improvements is the shorter of lease term or estimated useful life.\n Depreciation and amortization expense related to our property and equipment was $\n2.5\n billion, $\n2.3\n billion and $\n2.1\n billion for the years ended December 31, 2024, 2023 and 2022, respectively. Residual values for owned aircraft, engines, spare parts and simulators are generally \n5\n% to \n10\n% of cost.\nWe capitalize certain internal and external costs incurred to develop and implement software and amortize those costs over an estimated useful life of \nthree\n to \nfifteen years\n.\n Included in the depreciation and amortization expense discussed above, we recorded $\n324\n million, $\n340\n million and $\n307\n million for amortization of capitalized software for the years ended December 31, 2024, 2023 and 2022, respectively. The net book value of these assets, which are included in information technology-related assets above, totaled $\n933\n million and $\n932\n million at December 31, 2024 and 2023, respectively.\nWe review flight equipment, ROU assets and other long-lived assets used in operations for impairment losses when events and circumstances indicate the assets may be impaired. Factors which could be indicators of impairment include, but are not limited to (1) a decision to permanently remove flight equipment or other long-lived assets from operations, (2) significant changes in the estimated useful life, (3) significant changes in projected cash flows, (4) permanent and significant declines in fleet fair values and (5) changes to the regulatory environment. For long-lived assets held for sale, we discontinue depreciation and record impairment losses when the carrying amount of these assets is greater than the fair value less the cost to sell.\nTo determine whether impairments exist for aircraft used in operations, we group assets at the fleet type level or at the contract level for aircraft operated by third-party regional carriers (i.e., the lowest level for which there are identifiable cash flows) and then estimate future cash flows based on projections of capacity, passenger mile yield, fuel and labor costs and other relevant factors. If an asset group is impaired, the impairment loss recognized is the amount by which the asset group's carrying amount exceeds its estimated fair value. We estimate aircraft fair values using published sources, appraisals and bids received from third parties, as available.\nFuel Card Obligation\nWe have a purchasing card with American Express for the purpose of buying jet fuel and crude oil.\n The card carried a maximum credit limit of $\n1.1\n billion as of December 31, 2024 and must be paid monthly. At both December 31, 2024 and 2023, we had\n \n$\n1.1\n billion outstanding on this purchasing card and the activity was classified as a financing activity in our cash flows statement.\nDelta Air Lines, Inc. | 2024 Form 10-K\n62\nNotes to the Consolidated Financial Statements\nManufacturers' Credits\nWe periodically receive credits in connection with the acquisition of aircraft and engines or in connection with delivery delays or manufacturing defects. These credits are deferred until the aircraft and engines are delivered, and then applied as a reduction to the cost of the related equipment.\nMaintenance Costs\nWe record maintenance costs related to our mainline and regional fleets in aircraft maintenance materials and outside repairs and regional carrier expense, respectively. Maintenance costs are expensed as incurred, except for costs incurred under power-by-the-hour contracts, which are expensed based on actual hours flown. Power-by-the-hour contracts transfer certain risk to third-party service providers and fix the amount we pay per flight hour or per flight cycle to the service provider in exchange for maintenance and repairs under a predefined maintenance program. Modifications that enhance the operating performance or extend the useful lives of airframes or engines are capitalized and amortized over the remaining estimated useful life of the asset or the remaining lease term, whichever is shorter.\nAdvertising Costs\nWe expense advertising costs in passenger commissions and other selling expenses in the year the advertising first takes place.\n Advertising expense was $\n438\n million, $\n347\n million and $\n302\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\nCommissions and Merchant Fees\nPassenger sales commissions and merchant fees are recognized in passenger commissions and other selling expenses when the related revenue is recognized.\nNOTE 2. \nREVENUE RECOGNITION\nPassenger Revenue\nPassenger revenue is composed of passenger ticket sales, loyalty travel awards and travel-related services performed in conjunction with a passenger’s flight.\nPassenger revenue by category\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nTicket\n$\n45,096\n \n$\n43,596\n \n$\n35,626\n \nLoyalty travel awards\n3,841\n \n3,462\n \n2,898\n \nTravel-related services\n1,957\n \n1,851\n \n1,694\n \nTotal passenger revenue\n$\n50,894\n \n$\n48,909\n \n$\n40,218\n \nTicket\nPassenger Tickets.\n We defer sales of passenger tickets to be flown by us or that we sell on behalf of other airlines in our air traffic liability. Passenger revenue is recognized when we provide transportation. For tickets that we sell on behalf of other airlines, we reduce the air traffic liability when consideration is remitted to those airlines. The air traffic liability primarily includes sales of passenger tickets with scheduled departure dates in the future and travel credits, which can be applied as payment toward the cost of a ticket. We periodically evaluate the estimated air traffic liability and may record adjustments in our income statement. These adjustments relate primarily to tickets that expire unused (\"ticket breakage\") and items for which final settlement occurs in periods subsequent to the sale of the related tickets such as refunds, exchanges and transactions with other airlines.\nWe recognized approximately $\n6.5\n billion, $\n7.4\n billion and $\n4.2\n billion in passenger revenue during the years ended December 31, 2024, 2023 and 2022, respectively, that had been recorded in our air traffic liability balance at the beginning of those periods.\nDelta Air Lines, Inc. | 2024 Form 10-K\n63\nNotes to the Consolidated Financial Statements\nTicket Breakage.\n We estimate the value of ticket breakage and recognize revenue at the scheduled flight date. Our ticket breakage estimates are primarily based on historical experience, ticket contract terms and customers’ travel behavior.\nRegional Carriers.\n Our regional carriers include both third-party regional carriers with which we have contract carrier agreements (\"contract carriers\") and Endeavor Air, Inc., our wholly owned subsidiary. Our contract carrier agreements are primarily structured as capacity purchase agreements where we purchase all or a portion of the contract carrier's capacity and are responsible for selling the seat inventory we purchase. We record revenue related to our capacity purchase agreements in passenger revenue and the related expenses in regional carrier expense. See Note 10, \"Commitments and Contingencies,\" for additional information regarding contract carrier agreements.\nLoyalty Travel Awards\nLoyalty travel awards revenue is related to the redemption of mileage credits (\"miles\") for travel. We recognize loyalty travel awards revenue in passenger revenue as miles are redeemed and transportation is provided. See below for discussion of our loyalty program accounting policies.\nTravel-Related Services\nTravel-related services are primarily composed of services performed in conjunction with a passenger’s flight, including baggage fees, administrative fees and on-board sales. We recognize revenue for these services when the related transportation service is provided.\nLoyalty Program\nOur SkyMiles loyalty program generates customer loyalty by rewarding customers with incentives to travel on Delta. This program allows customers to earn miles by flying on Delta, Delta Connection carriers and other airlines that participate in the loyalty program. When traveling, customers earn miles primarily based on the passenger's loyalty program status, fare class and ticket price. Customers can also earn miles through participating companies. Miles are redeemable by customers for air travel on Delta and other participating airlines, access to Delta Sky Club and other program awards. To facilitate transactions with participating companies, we sell miles to non-airline businesses and other airlines.\nThe loyalty program includes two types of transactions that are considered revenue arrangements with multiple performance obligations (1) passenger ticket sales earning miles and (2) sale of miles to participating companies.\nPassenger Ticket Sales Earning Miles.\n Passenger ticket sales earning miles provide customers with (1) miles earned and (2) air transportation, which are each considered performance obligations. We value each performance obligation on a standalone basis. To value the miles earned, we consider the quantitative value a passenger receives by redeeming miles for a ticket rather than paying cash, which is referred to as equivalent ticket value (\"ETV\"). Our estimate of ETV is adjusted for miles that are not likely to be redeemed (\"mileage breakage\"). We use statistical models to estimate mileage breakage based on historical redemption patterns. A change in assumptions regarding the redemption activity for miles or the estimated fair value of miles expected to be redeemed could have a material impact on our revenue in the year in which the change occurs and in future years. We recognize mileage breakage proportionally during the period in which the remaining miles are actually redeemed.\nWe defer revenue for the miles when earned and recognize loyalty travel awards in passenger revenue as the miles are redeemed and transportation is provided. We record the air transportation portion of the passenger ticket sales in air traffic liability and recognize passenger revenue when we provide transportation or if the ticket goes unused.\nSale of Miles to Participating Companies.\n Customers earn miles based on their spending with participating companies, such as credit card, ridesharing, retail, car rental and hotel companies, with which we have marketing agreements to sell miles. Our contracts to sell miles under these marketing agreements have multiple performance obligations. Payments are typically due to us monthly based on the volume of miles sold during the period, and the initial terms of our marketing contracts are from \none\n to \nthirteen years\n. During the years ended December 31, 2024, 2023 and 2022, total cash sales from marketing agreements related to our loyalty program were $\n7.4\n billion, $\n6.9\n billion and $\n5.7\n billion, respectively, which are allocated to travel and other performance obligations, as discussed below.\nDelta Air Lines, Inc. | 2024 Form 10-K\n64\nNotes to the Consolidated Financial Statements\nOur most significant arrangement to sell miles relates to our co-brand credit card relationship with American Express. Our agreements with American Express provide for joint marketing, grant certain benefits to Delta-American Express co-branded credit card holders (\"cardholders\") and American Express Membership Rewards program participants, and allow American Express to market its services or products using our customer database. Cardholders earn miles for making purchases using co-branded cards, and certain cardholders may also receive baggage fee waivers, lounge access, priority boarding and other benefits while traveling on Delta. Additionally, participants in the American Express Membership Rewards program may exchange their points for miles under the loyalty program. We sell miles to American Express which are then provided to their customers under the co-brand credit card program and the Membership Rewards program.\nWe account for marketing agreements, including those with American Express, by allocating the consideration to the individual products and services delivered. We allocate the value based on the relative selling prices of those products and services, which generally consist of award travel, baggage fee waivers, lounge access, priority boarding and the use of our brand. We determine our best estimate of the selling prices by using a discounted cash flow analysis using multiple inputs and assumptions, including (1) the expected number of miles awarded and number of miles redeemed, (2) ETV for the award travel obligation adjusted for mileage breakage, (3) published rates on our website for baggage fees, Delta Sky Club lounge access and other benefits while traveling on Delta, (4) brand value (using estimated royalties generated from the use of our brand) and (5) volume discounts provided to certain partners.\nWe defer the amount allocated to award travel as part of loyalty program deferred revenue and recognize loyalty travel awards in passenger revenue as the miles are redeemed and transportation is provided. Revenue allocated to services performed in conjunction with a passenger’s flight, such as baggage fee waivers, is recognized as travel-related services in passenger revenue when the related service is performed. Revenue allocated to Delta Sky Club lounge access is recognized as miscellaneous in other revenue as access is provided. Revenue allocated to the remaining performance obligations, primarily brand value, is recorded as loyalty program in other revenue as miles are delivered.\nCurrent Activity of the Loyalty Program.\n Miles are combined in one homogeneous pool and are not separately identifiable. Therefore, the revenue is comprised of miles that were part of the loyalty program deferred revenue balance at the beginning of the period as well as miles that were issued during the period.\nThe table below presents the activity of the current and noncurrent loyalty program deferred revenue, and includes miles earned through travel and miles sold to participating companies, which are primarily through marketing agreements.\nLoyalty program activity\n(in millions)\n2024\n2023\n2022\nBalance at January 1\n$\n8,420\n \n$\n7,882\n \n$\n7,559\n \nMiles earned\n4,463\n \n4,173\n \n3,419\n \nTravel miles redeemed\n(\n3,841\n)\n(\n3,462\n)\n(\n2,898\n)\nNon-travel miles redeemed\n(\n216\n)\n(\n173\n)\n(\n198\n)\nBalance at December 31\n$\n8,826\n \n$\n8,420\n \n$\n7,882\n \nThe timing of mile redemptions can vary widely; however, the majority of new miles have historically been redeemed within \ntwo years\n of being earned. The loyalty program deferred revenue classified as a current liability represents our estimate of revenue expected to be recognized in the next twelve months based on projected redemptions, while the balance classified as a noncurrent liability represents our estimate of revenue expected to be recognized beyond twelve months.\nCargo Revenue\nCargo revenue is recognized when we provide the transportation.\nDelta Air Lines, Inc. | 2024 Form 10-K\n65\nNotes to the Consolidated Financial Statements\nOther Revenue\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nRefinery\n$\n4,642\n \n$\n3,379\n \n$\n4,977\n \nLoyalty program\n3,297\n \n3,093\n \n2,597\n \nAncillary businesses\n772\n \n840\n \n846\n \nMiscellaneous\n1,216\n \n1,104\n \n894\n \nTotal other revenue\n$\n9,927\n \n$\n8,416\n \n$\n9,314\n \nRefinery.\n This represents refinery sales to third parties. See Note 14, \"Segments,\" for more information on revenue recognition within our refinery segment.\nLoyalty Program.\n This relates to revenues from brand usage by third parties and other performance obligations embedded in miles sold, which are included within the total cash sales from marketing agreements, discussed above. This also includes the redemption of miles for non-travel awards.\nAncillary Businesses.\n This includes revenues from aircraft maintenance services we provide to third parties and our vacation package operations.\nMiscellaneous.\n This is primarily composed of revenues related to lounge access, including access provided to certain American Express cardholders, codeshare agreements and certain other commercial relationships.\nRevenue by Geographic Region\nOperating revenue for the airline segment is recognized in a specific geographic region based on the origin, flight path and destination of each flight segment. A significant portion of the refinery segment's revenues typically consists of fuel sales to support the airline, which is eliminated in the Consolidated Financial Statements. The remaining operating revenue for the refinery segment is included in the domestic region. \nOur passenger and operating revenue by geographic region are summarized in the following table:\nRevenue by geographic region\nPassenger Revenue\nOperating Revenue\nYear Ended December 31,\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\n2024\n2023\n2022\nDomestic\n$\n35,226\n \n$\n33,968\n \n$\n30,197\n \n$\n43,508\n \n$\n40,845\n \n$\n38,478\n \nAtlantic\n9,133\n \n9,057\n \n6,093\n \n10,535\n \n10,458\n \n7,429\n \nLatin America\n3,995\n \n3,798\n \n2,889\n \n4,564\n \n4,292\n \n3,334\n \nPacific\n2,540\n \n2,086\n \n1,039\n \n3,036\n \n2,453\n \n1,341\n \nTotal\n$\n50,894\n \n$\n48,909\n \n$\n40,218\n \n$\n61,643\n \n$\n58,048\n \n$\n50,582\n \nAccounts Receivable\nAccounts receivable primarily consist of amounts due from credit card companies from the sale of passenger tickets, ancillary businesses, refinery sales and other companies for the purchase of miles under the loyalty program. We provide an allowance for uncollectible accounts using an expected credit loss model which represents our estimate of expected credit losses over the lifetime of the asset.\nPassenger Taxes and Fees\nWe are required to charge certain taxes and fees on our passenger tickets, including U.S. federal transportation taxes, federal security charges, airport passenger facility charges and foreign arrival and departure taxes. These taxes and fees are assessments on the customer for which we act as a collection agent and these amounts are not included in passenger revenue. We record a liability when the amounts are collected and reduce the liability when payments are made to the applicable government agency or operating carrier (i.e., for codeshare-related fees).\nDelta Air Lines, Inc. | 2024 Form 10-K\n66\nNotes to the Consolidated Financial Statements\nNOTE 3. \nFAIR VALUE MEASUREMENTS\nFair value is defined as an exit price, representing the amount that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants. Fair value is a market-based measurement that is determined based on assumptions that market participants would use in pricing an asset or liability. Each fair value measurement is classified into one of the following levels based on the information used in the valuation:\n•\nLevel 1.\n Observable inputs such as quoted prices in active markets.\n•\nLevel 2.\n Inputs, other than quoted prices in active markets, that are observable either directly or indirectly.\n•\nLevel 3.\n Unobservable inputs in which there is little or no market data, which require the reporting entity to develop its own assumptions.\nAssets and liabilities measured at fair value are based on the valuation techniques identified in the tables below. The valuation techniques are as follows:\n(a)\nMarket Approach.\n Prices and other relevant information generated by observable transactions involving identical or comparable assets or liabilities.\n(b)\nIncome Approach.\n Techniques to convert future amounts to a single present value amount based on market expectations (including present value techniques and option-pricing models).\nAssets (Liabilities) Measured at Fair Value on a Recurring Basis\n(1)\nDecember 31, 2024\nValuation Technique\n(in millions)\nTotal\nLevel 1\nLevel 2\nLevel 3\nCash equivalents\n$\n1,619\n \n$\n1,619\n \n$\n—\n \n$\n—\n \n(a)\nRestricted cash equivalents\n351\n \n351\n \n—\n \n—\n \n(a)\nLong-term investments and related\n2,372\n \n2,085\n \n160\n \n127\n \n(a)(b)\nFuel hedge contracts\n(\n17\n)\n—\n \n(\n17\n)\n—\n \n(a)(b)\nDecember 31, 2023\nValuation Technique\n(in millions)\nTotal\nLevel 1\nLevel 2\nLevel 3\nCash equivalents\n$\n1,545\n \n$\n1,545\n \n$\n—\n \n$\n—\n \n(a)\nRestricted cash equivalents\n653\n \n653\n \n—\n \n—\n \n(a)\nShort-term investments\nU.S. Government securities\n859\n \n204\n \n655\n \n—\n \n(a)\nCorporate obligations\n218\n \n—\n \n218\n \n—\n \n(a)\nOther fixed income securities\n50\n \n—\n \n50\n \n—\n \n(a)\nLong-term investments and related\n2,867\n \n2,614\n \n134\n \n119\n \n(a)(b)\nFuel hedge contracts\n5\n \n—\n \n5\n \n—\n \n(a)(b)\n(1)\nSee Note 9, \"Employee Benefit Plans,\" for fair value of benefit plan assets.\nCash Equivalents and Restricted Cash Equivalents.\n Cash equivalents generally consist of money market funds. Restricted cash equivalents are recorded in other noncurrent assets and prepaid expenses and other on our balance sheets and generally consist of money market funds, time deposits, commercial paper and negotiable certificates of deposit, which primarily relate to proceeds from debt issued to finance, among other things, a portion of the construction costs for our new terminal facilities at New York's LaGuardia Airport as well as certain self-insurance obligations and airport commitments. The fair value of these cash equivalents is based on a market approach using prices generated by market transactions involving identical or comparable assets.\nShort-Term Investments.\n The fair values of our short-term investments were based on a market approach using industry standard valuation techniques that incorporate observable inputs such as quoted market prices, interest rates, benchmark curves, credit ratings of the security and other observable information.\nDelta Air Lines, Inc. | 2024 Form 10-K\n67\nNotes to the Consolidated Financial Statements\nLong-Term Investments and Related.\n Our long-term investments measured at fair value primarily consist of equity investments, which are valued based on market prices or other observable transactions and inputs, and are recorded in equity investments on our balance sheets. Our equity investments in private companies are classified as Level 3 in the fair value hierarchy as their equity is not traded on a public exchange and our valuations incorporate certain unobservable inputs, including non-public equity issuances. Fair value measurement using unobservable inputs is inherently uncertain, and a change in significant inputs could result in different fair values. During the year ended December 31, 2024 there were no material gains or losses related to investments classified as Level 3 as a result of fair value adjustments. See Note 4, \"Investments,\" for further information on our long-term investments.\nFuel Hedge Contracts.\n A portion of our derivative contracts may be negotiated over-the-counter with counterparties without going through a public exchange. Accordingly, our fair value assessments give consideration to the risk of counterparty default (as well as our own credit risk). Such contracts would be classified as Level 2 within the fair value hierarchy. The remainder of our hedge contracts may be comprised of futures contracts, which are traded on a public exchange. These contracts would be classified within Level 1 of the fair value hierarchy.\n \nOur derivative contracts to hedge the financial risk from changing fuel prices are related to Monroe’s inventory. Our fuel hedge portfolio may consist of a combination of options, swaps or futures. Option and swap contracts are valued under income approaches using option pricing models and discounted cash flow models, respectively, based on data either readily observable in public markets, derived from public markets or provided by counterparties who regularly trade in public markets. Futures contracts and options on futures contracts are traded on a public exchange and valued based on quoted market prices\n. We recognized losses of $\n31\n million, $\n6\n million and $\n394\n million on our fuel hedge contracts in aircraft fuel and related taxes on our income statement for the years ended December 31, 2024, 2023 and 2022, respectively. See Note 14, \"Segments,\" for further information on our Monroe refinery segment.\nNOTE 4. \nINVESTMENTS\nWe have developed strategic relationships with a number of airlines and airline services companies through joint ventures and other forms of cooperation and support, including equity investments. Our equity investments reinforce our commitment to these relationships and generally enhance our ability to offer input to the investee on strategic issues and direction, in some cases through representation on the board of directors of the investee.\nFair Value Investments.\n Changes in the valuation of investments accounted for at fair value are recorded in gain/(loss) on investments, net in our income statement within non-operating expense and are driven by changes in stock prices, foreign currency fluctuations and other valuation techniques for investments in companies without publicly-traded shares.\nEquity Method Investments.\n We record our share of our equity method investees' financial results in our income statement as described in the table below.\nEquity investments ownership interest and carrying value\nAccounting Treatment\nOwnership Interest\nCarrying Value\n(in millions)\nDecember 31, 2024\nDecember 31, 2023\nDecember 31, 2024\nDecember 31, 2023\nAir France-KLM\nFair Value\n3\n \n%\n3\n \n%\n$\n62\n \n$\n110\n \nChina Eastern\nFair Value\n2\n \n%\n2\n \n%\n155\n \n134\n \nGrupo Aeroméxico\nEquity Method\n(1)\n20\n \n%\n20\n \n%\n354\n \n421\n \nHanjin-KAL\nFair Value\n(2)\n15\n \n%\n15\n \n%\n507\n \n561\n \nLATAM\nFair Value\n10\n \n%\n10\n \n%\n837\n \n658\n \nUnifi Aviation\nEquity Method\n(3)\n49\n \n%\n49\n \n%\n146\n \n162\n \nWheels Up\nFair Value\n(4)\n38\n \n%\n38\n \n%\n435\n \n903\n \nOther investments\nVarious\n350\n \n508\n \nEquity investments\n$\n2,846\n \n$\n3,457\n \n(1)\nResults are included in miscellaneous, net in our income statement under non-operating expense.\n(2)\nAt December 31, 2024, we held \n14.8\n% of the outstanding shares (including common and preferred), and \n14.9\n% of the common shares, of Hanjin KAL.\n(3)\nResults are included in contracted services in our income statement as this entity is integral to the operations of our business by providing services at many of our airport locations.\n(4)\nOur voting rights with respect to Wheels Up are capped at \n29.9\n%. We elected to account for our investment under the fair value option.\nDelta Air Lines, Inc. | 2024 Form 10-K\n68\nNotes to the Consolidated Financial Statements\nWheels Up.\n We concluded that Wheels Up is a variable interest entity (\"VIE\"). A VIE requires consolidation by the entity’s primary beneficiary. We determined that we are not the primary beneficiary after assessing the decision-making process for the significant activities of Wheels Up, concluding that Wheels Up's Board of Directors continues to possess the decision-making authority over the significant activities, and we do not control Wheels Up's Board. Based on this assessment, Wheels Up is not consolidated in our financial statements.\nOur investment is subject to contractual transfer restrictions until September 2025 and thereafter will remain subject to certain, more limited transfer restrictions.\nDuring the December 2024 quarter, Wheels Up entered into a \nfive year\n Note Purchase Agreement with third parties which provides for the issuance of Revolving Equipment Notes in an aggregate principal amount not to exceed $\n332\n million under a Revolving Equipment Notes Facility. We have provided credit support for the Revolving Equipment Notes Facility which effectively guarantees the Wheels Up payment obligations. As a result, and consistent with our fair value option election, we recorded the immaterial fair value of the guarantee in other noncurrent liabilities on our balance sheet.\nOther Investments\nThis category includes various investments that are accounted for at fair value or under the equity method, depending on our ownership interest and the level of influence conveyed by our investment. Among others, this category includes our equity method investments in Virgin Atlantic and JFK IAT Member LLC and our fair value investment in CLEAR.\nVirgin Atlantic.\n The carrying value of our investment in Virgin Atlantic remains \nzero\n as of December 31, 2024. We maintain our \n49\n% equity interest and continue to track our share of Virgin Atlantic's losses under the equity method of accounting. These previously unrecognized losses are only recorded to the extent we make additional investments in Virgin Atlantic (i.e., additional shareholder support). As of December 31, 2024, we have approximately $\n480\n million of unrecognized equity method losses related to our \n49\n% interest in Virgin Atlantic.\nCLEAR.\n In 2024, we sold in multiple transactions our equity ownership in Clear Secure, Inc. (\"CLEAR\"). This sale is recorded in gain/(loss) on investments, net on our income statement and cash proceeds are recorded in other, net within investing activities on our cash flows statement.\nJFK IAT Member LLC.\n We have an equity method investment in JFK IAT Member LLC, which owns JFK International Air Terminal LLC (\"IAT\"), our landlord at the New York-JFK Airport. We have a long-term agreement with IAT to sublease space in Terminal 4 through 2043 (\"Sublease\") which requires us to pay certain fixed management fees. We determined that the investment is a VIE and assessed whether we have a controlling financial interest in IAT. Our rights under the Sublease, with respect to management of Terminal 4, are consistent with rights granted to an anchor tenant under a standard airport lease. Accordingly, we do not consolidate this entity in our Consolidated Financial Statements.\nNOTE 5. \nGOODWILL AND INTANGIBLE ASSETS\nGoodwill and Indefinite-Lived Intangible Assets\nOur goodwill and identifiable intangible assets relate to the airline segment. We apply a fair value-based impairment test to the carrying value of goodwill and indefinite-lived intangible assets on an annual basis (as of October 1) and, if certain events or circumstances indicate that an impairment loss may have been incurred, on an interim basis. We assess the value of our goodwill and indefinite-lived assets under either a qualitative or quantitative approach. Under a qualitative approach, we consider various market factors, including certain of the key assumptions listed below. We analyze these factors to determine if events and circumstances have affected the fair value of goodwill and indefinite-lived intangible assets. If we determine that it is more likely than not that the asset may be impaired, we use the quantitative approach to assess the asset's fair value and the amount of the impairment. Under a quantitative approach, we calculate the fair value of the asset incorporating the key assumptions listed below into our calculation.\nDelta Air Lines, Inc. | 2024 Form 10-K\n69\nNotes to the Consolidated Financial Statements\nWe value goodwill and indefinite-lived intangible assets primarily using market and income approach valuation techniques. These measurements include the following key assumptions (1) forecasted revenues, expenses and cash flows, (2) current discount rates, (3) observable market transactions and (4) anticipated changes to the regulatory environment (e.g., changes in slot access and/or availability, additional Open Skies agreements or changes to antitrust approvals). These assumptions are consistent with those that hypothetical market participants would use. Because we are required to make estimates and assumptions when evaluating goodwill and indefinite-lived intangible assets for impairment, actual transaction amounts may differ materially from these estimates. We recognize an impairment charge if the asset's carrying value exceeds its estimated fair value.\nChanges in certain events and circumstances could result in impairment or a change from indefinite-lived to definite-lived. Factors which could cause impairment include, but are not limited to (1) negative trends in our market capitalization, (2) reduced profitability resulting from lower passenger mile yields or higher input costs, (3) lower passenger demand as a result of weakened U.S. and global economies or other factors, (4) prolonged interruption to our operations, (5) changes to the regulatory environment, (6) operational or performance changes by other airlines and (7) strategic changes to our operations leading to diminished utilization of the intangible assets.\nIdentifiable Intangible Assets.\n Indefinite-lived assets are not amortized and consist of routes, slots, the Delta tradename and assets related to alliances and collaborative arrangements. Definite-lived intangible assets consist primarily of marketing and maintenance service agreements and are amortized on a straight-line basis or under the undiscounted cash flows method over the estimated economic life of the respective agreements. Costs incurred to renew or extend the term of an intangible asset are expensed as incurred.\nDuring the December 2024 quarter, we performed qualitative assessments of goodwill and indefinite-lived intangible assets, including applicable factors noted above, and determined that there was no indication that the assets were impaired. Our qualitative assessments include analyses and weighting of all relevant factors that impact the fair value of our goodwill and indefinite-lived intangible assets. We previously performed quantitative assessments in the December 2023 quarter, noting no impairment of goodwill or indefinite-lived intangible assets.\nGoodwill and indefinite-lived intangible assets by category\nCarrying Value at\n(in millions)\nDecember 31, 2024\nDecember 31, 2023\nGoodwill\n$\n9,753\n \n$\n9,753\n \nInternational routes and slots\n2,583\n \n2,583\n \nAirline alliances\n1,863\n \n1,863\n \nDelta tradename\n850\n \n850\n \nDomestic slots\n622\n \n622\n \nTotal\n$\n15,671\n \n$\n15,671\n \nInternational Routes and Slots.\n This primarily relates to Pacific route authorities and slots at capacity-constrained airports in Asia, and slots at London-Heathrow airport.\nAirline Alliances.\n This primarily relates to our commercial agreements with LATAM and our SkyTeam partners.\nDomestic Slots.\n This primarily relates to our slots at New York-LaGuardia and Washington-Reagan National airports.\nDelta Air Lines, Inc. | 2024 Form 10-K\n70\nNotes to the Consolidated Financial Statements\nDefinite-Lived Intangible Assets\nDefinite-lived intangible assets by category\nDecember 31, 2024\nDecember 31, 2023\n(in millions)\nGross Carrying Value\nAccumulated Amortization\nGross Carrying Value\nAccumulated Amortization\nMarketing agreements\n$\n730\n \n$\n(\n712\n)\n$\n730\n \n$\n(\n708\n)\nMaintenance contracts\n192\n \n(\n154\n)\n192\n \n(\n150\n)\nOther\n54\n \n(\n53\n)\n54\n \n(\n53\n)\nTotal\n$\n976\n \n$\n(\n919\n)\n$\n976\n \n$\n(\n911\n)\nAmortization expense was $\n9\n million for the years ended December 31, 2024, 2023 and 2022. Based on our definite-lived intangible assets at December 31, 2024, we estimate that we will incur approximately $\n7\n million of amortization expense annually from 2025 through 2029.\nNOTE 6. \nDEBT\nThe following table summarizes our debt as of the dates indicated below:\nSummary of outstanding debt by category\nMaturity Dates\nInterest Rate(s) Per Annum at December 31, 2024\nDecember 31,\n(in millions)\n2024\n2023\nUnsecured Payroll Support Program Loans\n(1)\n2030\nto \n2031\n1.00\n%\n$\n3,496\n \n$\n3,496\n \nUnsecured notes\n2026\nto\n2029\n3.75\n%\nto\n7.38\n%\n1,575\n \n2,590\n \nFinancing arrangements secured by SkyMiles assets:\nSkyMiles Notes\n(2)\n2025\nto\n2028\n4.50\n%\nand \n4.75\n%\n3,970\n \n4,518\n \nSkyMiles Term Loan\n(2)(3)\n2025\nto\n2027\n8.37\n%\n784\n \n1,772\n \nNYTDC Special Facilities Revenue Bonds\n(2)\n2025\nto\n2045\n4.00\n%\nto\n6.00\n%\n3,591\n \n3,656\n \nFinancing arrangements secured by aircraft:\nCertificates\n(2)\n2025\nto\n2028\n2.00\n%\nto\n8.00\n%\n992\n \n1,591\n \nNotes\n(2)(3)\n2025\nto\n2033\n6.62\n%\nto\n6.86\n%\n87\n \n165\n \nFinancing arrangements secured by slots, gates and/or routes:\nSenior Secured Notes\n2025\n7.00\n%\n812\n \n838\n \nOther financings\n(2)\n2025\nto\n2030\n2.51\n%\nto\n5.00\n%\n66\n \n67\n \nCorporate Revolving Credit Facility\n2026\nto\n2028\nUndrawn\n—\n \n—\n \nOther revolving credit facilities\n(3)\n2025\nto\n2026\nUndrawn\n—\n \n—\n \nTotal secured and unsecured debt\n15,373\n \n18,693\n \nUnamortized (discount)/premium and debt issuance cost, net and other\n(\n26\n)\n(\n83\n)\nTotal debt\n15,347\n \n18,610\n \nLess: current maturities\n(\n1,801\n)\n(\n2,625\n)\nTotal long-term debt\n$\n13,546\n \n$\n15,985\n \n(1)\nInterest rates on the Payroll Support Program loans are \n1.00\n% for the first \nfive years\n and the applicable SOFR plus \n2.00\n% in the final \nfive years\n. The applicable interest rates will begin to adjust for each loan in April 2025, January 2026 and April 2026.\n(2)\nDue in installments.\n(3)\nCertain financings are comprised of variable rate debt. All variable rates are equal to SOFR (generally subject to a floor) or another index rate plus a specified margin.\nEarly Settlement of Outstanding Loans and Notes\nDuring 2024, through early principal repayments and open market repurchases, we extinguished an aggregate principal amount of $\n844\n million related to a portion of the SkyMiles Term Loan and various secured and unsecured notes. Collectively, these payments resulted in a $\n39\n million loss on extinguishment of debt, which is recorded in non-operating expense in our income statement.\nDelta Air Lines, Inc. | 2024 Form 10-K\n71\nNotes to the Consolidated Financial Statements\nAvailability Under Revolving Facilities\nAs of December 31, 2024, we had approximately $\n3.1\n billion undrawn and available under our revolving credit facilities.\nCorporate Revolving Credit Facility\nDuring the September 2024 quarter, Delta received a second investment grade credit rating, which satisfied the collateral release conditions under the Corporate Revolving Credit Facility. As a result, the liens on collateral, including our Pacific route authorities and certain related other assets, were released during 2024. Additionally, the minimum collateral coverage ratio and minimum liquidity covenants were replaced by minimum fixed charge coverage ratio and minimum asset coverage ratio covenants.\nFair Value of Debt\nMarket risk associated with our fixed- and variable-rate debt relates to the potential reduction in fair value and negative impact to future earnings, respectively, from an increase in interest rates. \nThe fair value of debt, shown below, is principally based on reported market values, recently completed market transactions and estimates based on interest rates, maturities, credit risk and underlying collateral. Debt is primarily classified as Level 1 or Level 2 within the fair value hierarchy.\nFair value of outstanding debt\n(in millions)\nDecember 31, 2024\nDecember 31, 2023\nNet carrying amount\n$\n15,347\n \n$\n18,610\n \nFair value\n$\n15,300\n \n$\n18,400\n \nCovenants\nOur debt agreements contain various affirmative, negative and financial covenants. For example, certain credit facilities, including our SkyMiles financing agreements, contain, among other things, a minimum liquidity covenant. The minimum liquidity covenant requires us to maintain at least $\n2.0\n billion of liquidity (defined as cash, cash equivalents, short-term investments and aggregate principal amount committed and available to be drawn under our revolving credit facilities). Our SkyMiles financing agreements include a debt service coverage ratio and also restrict our ability to, among other things, (1) modify the terms of the SkyMiles program, or otherwise change the policies and procedures of the SkyMiles program, in a manner that would reasonably be expected to materially impair repayment of the SkyMiles Debt, (2) sell pre-paid miles in excess of $\n550\n million in the aggregate and (3) terminate or materially modify the intercompany arrangements governing the relationship between Delta and SkyMiles IP Ltd. with respect to the SkyMiles program. Certain of our debt agreements limit our ability to (1) incur liens under certain circumstances, (2) dispose of collateral and (3) engage in mergers and consolidations or transfer all or substantially all of our assets. The notes secured by our non-Pacific slots, gates and routes are also subject to a collateral coverage ratio.\nEach of these restrictions is subject to certain exceptions and qualifications that are set forth in these debt agreements. We were in compliance with the covenants in our debt agreements at December 31, 2024.\nFuture Maturities\nThe following table summarizes scheduled maturities of our debt for the years succeeding December 31, 2024:\nFuture debt maturities\n(in millions)\nTotal Debt\nAmortization of Debt (Discount)/Premium and Debt Issuance Cost, net and other\n2025\n$\n1,798\n \n$\n(\n29\n)\n2026\n2,313\n \n(\n3\n)\n2027\n2,133\n \n2\n \n2028\n1,884\n \n—\n \n2029\n621\n \n2\n \nThereafter\n6,624\n \n2\n \nTotal\n$\n15,373\n \n$\n(\n26\n)\n$\n15,347\n \nDelta Air Lines, Inc. | 2024 Form 10-K\n72\nNotes to the Consolidated Financial Statements\nNOTE 7. \nLEASES\nWe lease property and equipment under finance and operating leases. For leases with terms greater than 12 months, we record the related asset and obligation at the present value of the fixed minimum lease payments over the term. Many of our leases include rental escalation clauses, renewal options and/or termination options that are factored into our determination of lease payments when appropriate. We do not separate lease and nonlease components of contracts, except for regional aircraft and information technology (\"IT\") assets as discussed below.\nWe use the rate implicit in the lease to discount lease payments to present value, when readily determinable. As the rate implicit in the lease is rarely readily determinable, we use our incremental borrowing rate, which is based on the estimated interest rate for collateralized borrowing over a similar term of the lease at commencement date.\nSome of our aircraft lease agreements include provisions for residual value guarantees. These guarantees represent an immaterial portion of our lease liability.\nAircraft\nAs of December 31, 2024, including aircraft operated by our regional carriers, we leased \n170\n aircraft, of which \n55\n were under finance leases and \n115\n were operating leases. Our aircraft leases had remaining lease terms of \nthree months\n to \n11\n years.\nIn addition, we have regional aircraft leases that are embedded within our capacity purchase agreements and included in the ROU asset and lease liability. We allocated the consideration in each capacity purchase agreement to the lease and nonlease components based on their relative standalone fair values. Lease components of these agreements consist of \n119\n aircraft as of December 31, 2024 and nonlease components primarily consist of flight operations, in-flight and maintenance services. We determined our best estimate of the standalone fair value of the individual components by considering observable information including rates paid by our wholly owned subsidiary, Endeavor Air, Inc., and rates published by independent valuation firms. See Note 10, \"Commitments and Contingencies,\" for additional information about our capacity purchase agreements.\nAirport Facilities\nOur facility leases are primarily for space at approximately \n300\n airports around the world that we serve. These leases reflect our use of airport terminals, office space, cargo warehouses and maintenance facilities. We generally lease space from government agencies that control the use of the airport, and as a result, these leases are classified as operating leases. The remaining lease terms vary from \none month\n to \n29\n years. At the majority of the U.S. airports, the lease rates depend on airport operating costs or use of the facilities and are reset at least annually. Because of the variable nature of the rates, these leases are not recorded on our balance sheets.\nSome airport facilities have fixed payment schedules, the most significant of which is New York-JFK which comprises the majority of our ground and other operating right of use asset and lease liability. For those airport leases with fixed payment schedules, we have recorded a ROU asset and lease liability representing the fixed component of the lease payments. See Note 8, \"Airport Redevelopment,\" for more information on our significant airport redevelopment projects.\nOther Ground Property and Equipment\nWe lease certain IT assets (including servers, mainframes, etc.), ground support equipment (including tugs, tractors, fuel trucks and de-icers) and various other equipment. The remaining lease terms range from \none month\n to \nfive years\n. Certain leased assets are embedded within various ground and IT service agreements. For ground service contracts, we have elected to include both the lease and nonlease components in the lease asset and lease liability balances on our balance sheets. For IT service contracts, we have elected to separate the lease and nonlease components and only the lease components are included in the lease asset and lease liability balances on our balance sheets. The amounts of these lease and nonlease components are not significant.\nDelta Air Lines, Inc. | 2024 Form 10-K\n73\nNotes to the Consolidated Financial Statements\nLease Position\nThe table below presents the lease-related assets and liabilities recorded on the balance sheets.\nLease asset and liability balance sheet position by category\nDecember 31,\n(in millions)\nClassification on the Balance Sheets\n2024\n2023\nAssets\nOperating lease assets - Fleet\n(1)\nOperating lease right-of-use assets\n$\n2,910\n \n$\n3,420\n \nOperating lease assets - Ground and other\nOperating lease right-of-use assets\n3,734\n \n3,584\n \nFinance lease assets\nProperty and equipment, net\n825\n \n1,338\n \nTotal lease assets\n$\n7,469\n \n$\n8,342\n \nLiabilities\nCurrent\nOperating - Fleet\n(1)\nCurrent maturities of operating leases\n$\n551\n \n$\n552\n \nOperating - Ground and other\nCurrent maturities of operating leases\n212\n \n207\n \nFinance\nCurrent maturities of debt and finance leases\n374\n \n358\n \nNoncurrent\nOperating - Fleet\n(1)\nNoncurrent operating leases\n2,627\n \n3,226\n \nOperating - Ground and other\nNoncurrent operating leases\n3,187\n \n3,242\n \nFinance\nDebt and finance leases\n473\n \n1,086\n \nTotal lease liabilities\n$\n7,424\n \n$\n8,671\n \nWeighted-average remaining lease term\nOperating leases\n12\n years\n13\n years\nFinance leases\n3\n years\n4\n years\nWeighted-average discount rate\nOperating leases\n4.28\n \n%\n3.73\n \n%\nFinance leases\n3.53\n \n%\n3.12\n \n%\n(1)\nIncludes mainline and regional aircraft leases, regional aircraft leases embedded within our capacity purchase arrangements and engine leases. The interest portion of straight-line rent expense related to fleet operating leases was $\n165\n million and $\n189\n million during the years ended December 31, 2024 and 2023, respectively.\nLease Costs\nThe table below presents certain information related to the lease costs for finance and operating leases.\nLease cost by category\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nFinance lease cost\nAmortization of leased assets\n$\n88\n \n$\n109\n \n$\n120\n \nInterest of lease liabilities\n54\n \n42\n \n45\n \nOperating lease cost\n(1)\n974\n \n981\n \n949\n \nShort-term lease cost\n(1)\n206\n \n258\n \n281\n \nVariable lease cost\n(1)\n2,902\n \n2,230\n \n1,859\n \nTotal lease cost\n$\n4,224\n \n$\n3,620\n \n$\n3,254\n \n(1)\nExpenses are primarily classified within aircraft rent, landing fees and other rents and regional carrier expense\n \non our income statement.\nDelta Air Lines, Inc. | 2024 Form 10-K\n74\nNotes to the Consolidated Financial Statements\nOther Information\nThe table below presents supplemental cash flow information related to leases.\nSupplemental lease-related cash flow information\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nCash paid for amounts included in the measurement of lease liabilities\nOperating cash flows for operating leases\n$\n1,225\n \n$\n1,230\n \n$\n809\n \nOperating cash flows for finance leases\n56\n \n71\n \n49\n \nFinancing cash flows for finance leases\n190\n \n264\n \n363\n \nUndiscounted Cash Flows\nThe table below reconciles the undiscounted cash flows for each of the first five years and total of the remaining years to the finance lease liabilities and operating lease liabilities recorded on the balance sheets.\nFuture lease cash flows and reconciliation to the balance sheet\n(in millions)\nOperating Leases\nFinance Leases\n2025\n$\n993\n \n$\n395\n \n2026\n917\n \n90\n \n2027\n880\n \n268\n \n2028\n781\n \n40\n \n2029\n620\n \n28\n \nThereafter\n4,183\n \n76\n \nTotal minimum lease payments\n8,374\n \n897\n \nLess: amount of lease payments representing interest\n(\n1,797\n)\n(\n50\n)\nPresent value of future minimum lease payments\n6,577\n \n847\n \nLess: current obligations under leases\n(\n763\n)\n(\n374\n)\nLong-term lease obligations\n$\n5,814\n \n$\n473\n \nNOTE 8. \nAIRPORT REDEVELOPMENT\nLos Angeles International Airport (\"LAX\")\nIn 2023, we substantially completed all construction for the LAX upgrade and modernization project that consolidates Terminals 2 and 3, as well as connects these terminals to the Tom Bradley International Terminal. The project cost approximately $\n2.5\n billion.\nA substantial majority of the project costs were funded through the Regional Airports Improvement Corporation (\"RAIC\"), a California public benefit corporation, using a revolving credit facility provided by a group of lenders. The credit facility was executed in 2017 and we have guaranteed the obligations of the RAIC under the credit facility. Loans made under the credit facility are being repaid with the proceeds from the City of Los Angeles' (the \"City\") purchase of completed project assets. Under the lease agreement and subsequent project component approvals by the City's Board of Airport Commissioners, the City appropriated approximately $\n1.8\n billion to purchase completed project assets, representing the maximum allowable reimbursement by the City. Costs incurred in excess of the $\n1.8\n billion maximum were not reimbursed by the City.\nOur net project costs were approximately $\n700\n million, of which approximately $\n350\n million has been reflected as investing activities and approximately $\n350\n million as operating activities in our cash flows statement since the project started in 2017.\nBased on our assessment of the project, we concluded that we do not control the underlying assets being constructed, and therefore, we do not have the project asset or related obligation recorded on our balance sheets, except for certain assets recorded as leasehold improvements within property and equipment, net on our balance sheets.\nDelta Air Lines, Inc. | 2024 Form 10-K\n75\nNotes to the Consolidated Financial Statements\nWe have recorded approximately $\n350\n million as a ROU asset on our balance sheets related to certain costs incurred in excess of RAIC funding, though we have not recognized a ROU asset and lease liability on our balance sheets for the variable lease payments in our agreement with the City. See Note 7, \"Leases\" for more information on our ROU assets and lease liabilities.\nNew York-LaGuardia Airport\nIn 2024, we substantially completed all construction for the replacement of Terminals C and D of the New York-LaGuardia Airport with a new state-of-the-art terminal facility.\nThe project cost approximately $\n4.2\n billion and was funded through debt issuance, existing cash and a Port Authority contribution of approximately $\n500\n million. We entered into loan agreements to fund a portion of the construction, which are recorded on our balance sheets as debt with the proceeds reflected as restricted cash. Using funding primarily provided by these arrangements, we spent approximately $\n300\n million, $\n500\n million and $\n650\n million during 2024, 2023 and 2022, respectively.\nBased on our assessment of the project, we concluded that we did not control the underlying assets being constructed. Costs incurred by Delta are accounted for as leasehold improvements recorded in property and equipment, net on our balance sheets.\nSee Note 6, \"Debt,\" for additional information on the debt (NYTDC Special Facilities Revenue Bonds) related to this redevelopment project.\nNOTE 9. \nEMPLOYEE BENEFIT PLANS\nWe sponsor defined benefit and defined contribution pension plans, healthcare plans and disability and survivorship plans for eligible employees and retirees and their eligible family members.\nDefined Benefit Pension Plans.\n We sponsor defined benefit pension plans for eligible employees and retirees. These plans are generally closed to new entrants and frozen for future benefit accruals. Our funding obligations for qualified defined benefit plans are governed by the Employee Retirement Income Security Act and any additional applicable legislation. Under current legislation, any required funding would be amortized over a rolling 15-year period and calculated using a discount rate of no less than 4.75% through 2030. We estimate that there will be approximately $\n80\n million of minimum funding requirements under these plans in 2025.\nWe also sponsor a market based cash balance defined benefit pension plan for eligible pilots that is funded by company contributions in excess of IRS limits in the 401(k) plan. We fund this plan with cash contributions as benefits are earned and invest those assets. The participants’ benefit is the sum of the contributions made on their behalf plus any positive return on the invested contributions. In estimating the related benefit obligation and net benefit cost, the expected long-term rate of return on plan assets is used in determining the interest crediting rate.\nDefined Contribution Pension Plans.\n We sponsor several defined contribution plans. These plans generally cover different employee groups and employer contributions vary by plan. The costs associated with our defined contribution pension plans were approximately $\n1.3\n billion, $\n1.2\n billion and $\n1.0\n billion for the years ended December 31, 2024, 2023 and 2022, respectively.\nPostretirement Healthcare Plans.\n We sponsor healthcare plans that provide benefits to eligible retirees and their dependents who are under age \n65\n. We have generally eliminated company-paid post age \n65\n healthcare coverage, except for (1) subsidies available to a limited group of retirees and their dependents, (2) a group of retirees who retired prior to 1987 and (3) retiree medical accounts which provide a fixed dollar amount to eligible employees who retired under the 2012 voluntary workforce reduction programs or the 2020 voluntary early retirement and separation programs (\"voluntary programs\").\nPostemployment Plans.\n We provide certain other welfare benefits to eligible former or inactive employees after employment but before retirement, primarily as part of the disability and survivorship plans. Substantially all employees are eligible for benefits under these plans in the event of death and/or disability.\nBenefits under our postretirement and post employment plans are funded from current assets and employee contributions.\nDelta Air Lines, Inc. | 2024 Form 10-K\n76\nNotes to the Consolidated Financial Statements\nBenefit Obligations, Fair Value of Plan Assets and Funded Status\nPension Benefits\nDecember 31,\nOther Postretirement and Postemployment Benefits\nDecember 31,\n(in millions)\n2024\n2023\n2024\n2023\nBenefit obligation at beginning of period\n$\n15,911\n \n$\n15,811\n \n$\n3,503\n \n$\n3,664\n \nService cost\n(1)\n233\n \n95\n \n92\n \n71\n \nInterest cost\n820\n \n855\n \n182\n \n200\n \nActuarial (gain)/loss\n(\n738\n)\n351\n \n(\n50\n)\n24\n \nBenefits paid, including lump sums and annuities\n(\n1,259\n)\n(\n1,201\n)\n(\n497\n)\n(\n485\n)\nPlan amendments\n—\n \n—\n \n—\n \n11\n \nParticipant contributions\n—\n \n—\n \n30\n \n18\n \nSpecial termination benefits\n—\n \n—\n \n5\n \n—\n \nBenefit obligation at end of period\n(2)\n$\n14,967\n \n$\n15,911\n \n$\n3,265\n \n$\n3,503\n \nFair value of plan assets at beginning of period\n$\n15,766\n \n$\n15,721\n \n$\n33\n \n$\n71\n \nActual gain on plan assets\n1,142\n \n1,142\n \n(\n7\n)\n3\n \nEmployer contributions\n256\n \n104\n \n468\n \n426\n \nParticipant contributions\n—\n \n—\n \n30\n \n18\n \nBenefits paid, including lump sums and annuities\n(\n1,259\n)\n(\n1,201\n)\n(\n497\n)\n(\n485\n)\nFair value of plan assets at end of period\n$\n15,905\n \n$\n15,766\n \n$\n27\n \n$\n33\n \nFunded status at end of period\n$\n938\n \n$\n(\n145\n)\n$\n(\n3,238\n)\n$\n(\n3,470\n)\n(1)\nService cost shown above relates to the market based cash balance plan. There is no service cost associated with traditional frozen defined benefit plans.\n(2)\nAt the end of each year presented, our accumulated benefit obligations for our pension plans are equal to the benefit obligations shown above.\nDuring 2024, net actuarial gains decreased our benefit obligation primarily due to the increase in discount rates while net actuarial losses increased our benefit obligation primarily due to the decrease in discount rates during 2023. These gains and losses are recorded in AOCI and reflected in the table below. Amounts are generally amortized from AOCI over the expected future lifetime of plan participants.\nBalance Sheet Position\nPension Benefits\nDecember 31,\nOther Postretirement and Postemployment Benefits\nDecember 31,\n(in millions)\n2024\n2023\n2024\n2023\nOther noncurrent assets \n$\n1,005\n \n$\n22\n \n$\n—\n \n$\n—\n \nCurrent liabilities\n(\n9\n)\n(\n9\n)\n(\n430\n)\n(\n404\n)\nNoncurrent liabilities\n(\n58\n)\n(\n158\n)\n(\n2,808\n)\n(\n3,066\n)\nFunded status at end of period\n$\n938\n \n$\n(\n145\n)\n$\n(\n3,238\n)\n$\n(\n3,470\n)\nNet actuarial loss\n$\n(\n5,407\n)\n$\n(\n6,474\n)\n$\n(\n103\n)\n$\n(\n162\n)\nPrior service credit\n—\n \n—\n \n(\n3\n)\n1\n \nTotal accumulated other comprehensive loss, pre-tax\n$\n(\n5,407\n)\n$\n(\n6,474\n)\n$\n(\n106\n)\n$\n(\n161\n)\nCertain pension plans have benefit obligations in excess of plan assets. These plans have aggregate projected benefit obligations of $\n67\n million and are unfunded at December 31, 2024.\nDelta Air Lines, Inc. | 2024 Form 10-K\n77\nNotes to the Consolidated Financial Statements\nNet Periodic Cost/(Benefit)\nPension Benefits\nYear Ended December 31,\nOther Postretirement and Postemployment Benefits\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\n2024\n2023\n2022\nService cost\n(1)\n$\n233\n \n$\n95\n \n$\n—\n \n$\n92\n \n$\n71\n \n$\n70\n \nInterest cost\n820\n \n855\n \n611\n \n182\n \n200\n \n128\n \nExpected return on plan assets\n(\n1,062\n)\n(\n1,060\n)\n(\n1,319\n)\n(\n2\n)\n(\n1\n)\n(\n17\n)\nAmortization of prior service credit\n—\n \n—\n \n—\n \n(\n4\n)\n(\n5\n)\n(\n5\n)\nRecognized net actuarial loss\n248\n \n240\n \n255\n \n18\n \n14\n \n56\n \nSpecial termination benefits\n—\n \n—\n \n—\n \n5\n \n—\n \n—\n \nNet periodic cost/(benefit)\n$\n239\n \n$\n130\n \n$\n(\n453\n)\n$\n291\n \n$\n279\n \n$\n232\n \n(1)\nService cost shown above relates to the market based cash balance plan. There is no service cost associated with traditional frozen defined benefit plans.\nService cost is recorded in salaries and related costs in the income statement, while all other components are recorded within miscellaneous, net under non-operating expense.\nAssumptions\nWe used the following actuarial assumptions to determine our benefit obligations and our net periodic cost/(benefit) for the periods presented:\nDecember 31,\nBenefit Obligations\n(1)\n2024\n2023\nWeighted average discount rate\n5.71\n \n%\n5.31\n \n%\nYear Ended December 31,\nNet Periodic Cost/(Benefit)\n(1)\n2024\n2023\n2022\nWeighted average discount rate\n5.33\n \n%\n5.59\n \n%\n2.96\n \n%\nWeighted average expected long-term rate of return on plan assets\n6.97\n \n%\n7.00\n \n%\n7.00\n \n%\nAssumed healthcare cost trend rate for the next year\n(2)\n6.50\n \n%\n6.25\n \n%\n6.50\n \n%\n(1)\nFuture employee compensation levels do not impact our frozen defined benefit pension plans or other postretirement plans and impact only a small portion of our other postemployment obligation.\n(2)\nHealthcare cost trend rate is assumed to decline gradually to \n5.00\n% by 2033 and remain unchanged thereafter.\nExpected Long-Term Rate of Return.\n Our expected long-term rate of return on plan assets is based primarily on plan-specific investment studies using historical market return and volatility data. Modest excess return expectations versus some public market indices are incorporated into the return projections based on the actively managed structure of the investment programs and their records of achieving such returns historically. We also expect to receive a premium for investing in less liquid private markets. We review our rate of return on plan assets assumptions annually. Our annual investment performance for one particular year does not, by itself, significantly influence our evaluation. The investment strategy for our defined benefit pension plan assets is to earn a long-term return that meets or exceeds our annualized return target while taking an acceptable level of risk and maintaining sufficient liquidity to pay current benefits and other cash obligations of the plan. This is achieved by investing in a globally diversified mix of public and private equity, fixed income, real assets, hedge funds and other assets and instruments. Our weighted average expected long-term rate of return on assets for net periodic cost/(benefit) for the year ended December 31, 2024 was \n6.97\n%.\nLife Expectancy.\n Changes in life expectancy may significantly impact our benefit obligations and future net periodic cost/(benefit). Each year we review information published by the Society of Actuaries and other publicly available information to develop our best estimate of life expectancy for purposes of measuring pension and other postretirement and postemployment benefit obligations.\nDelta Air Lines, Inc. | 2024 Form 10-K\n78\nNotes to the Consolidated Financial Statements\nBenefit Payments\nBenefit payments in the table below are based on the same assumptions used to measure the related benefit obligations. Actual benefit payments may vary significantly from these estimates. Benefits earned under our pension plans are expected to be paid from funded benefit plan trusts, while our other postretirement and postemployment benefits are funded from current assets. \nThe following table summarizes the benefit payments that are expected to be paid in the years ending December 31:\nExpected future benefit payments\n(in millions)\nPension Benefits\nOther Postretirement and Postemployment Benefits\n2025\n$\n1,330\n \n$\n470\n \n2026\n1,350\n \n470\n \n2027\n1,360\n \n490\n \n2028\n1,350\n \n500\n \n2029\n1,350\n \n510\n \n2030-2034\n6,630\n \n2,590\n \nPlan Assets\nWe have adopted and implemented investment policies for our defined benefit pension plans that incorporate strategic asset allocation mixes intended to best meet the plans' long-term obligations, while maintaining an appropriate level of risk and liquidity. These asset portfolios employ a diversified mix of investments, which are reviewed periodically. Active management strategies are utilized where feasible in an effort to realize investment returns in excess of market indices. Derivatives in the plans are primarily used to manage risk and gain asset class exposure while preserving liquidity. As part of these strategies, the plans are required to hold cash collateral associated with certain derivatives. Our investment strategies target a mix of \n20\n-\n40\n% growth-seeking assets, \n25\n-\n35\n% income-generating assets and \n35\n-\n45\n% risk-diversifying assets. Risk diversifying assets include hedge funds implementing long-short, market neutral and relative value strategies that invest primarily in publicly-traded equity, fixed income, foreign currency and commodity securities and are used to improve the impact of active management on the plans.\nBenefit Plan Assets Measured at Fair Value on a Recurring Basis\nBenefit plan assets relate to our defined benefit pension plans and certain of our postemployment benefit plans. These investments are presented net of the related benefit obligation in either other noncurrent assets or pension, postretirement and related benefits on the balance sheets depending on the funded status of each plan. See Note 3, \"Fair Value Measurements,\" for a description of the levels within the fair value hierarchy and associated valuation techniques used to measure fair value. \nThe following table shows our benefit plan assets by asset class.\nBenefit plan assets measured at fair value on a recurring basis\nDecember 31, 2024\nDecember 31, 2023\nValuation Technique\n(in millions)\nLevel 1\nLevel 2\nTotal\nLevel 1\nLevel 2\nTotal\nFixed income and fixed income-related instruments\n$\n85\n \n$\n1,080\n \n$\n1,165\n \n$\n300\n \n$\n1,858\n \n$\n2,158\n \n(a)(b)\nCash equivalents\n330\n \n138\n \n468\n \n471\n \n685\n \n1,156\n \n(a)\nEquities and equity-related instruments\n978\n \n3\n \n981\n \n647\n \n122\n \n769\n \n(a)\nDelta common stock\n595\n \n—\n \n595\n \n419\n \n—\n \n419\n \n(a)\nReal assets\n—\n \n25\n \n25\n \n11\n \n236\n \n247\n \n(a)\nBenefit plan assets\n$\n1,988\n \n$\n1,246\n \n$\n3,234\n \n$\n1,848\n \n$\n2,901\n \n$\n4,749\n \nInvestments measured at net asset value (\"NAV\")\n(1)\n12,438\n \n11,417\n \nTotal benefit plan assets\n$\n15,672\n \n$\n16,166\n \n(1)\nInvestments that were measured at NAV per share (or its equivalent) as a practical expedient have not been classified in the fair value hierarchy.\nDelta Air Lines, Inc. | 2024 Form 10-K\n79\nNotes to the Consolidated Financial Statements\nFixed Income and Fixed Income-Related Instruments.\n These investments include corporate bonds, government bonds, collateralized mortgage obligations and other asset-backed securities, and are generally valued at the bid price or the average of the bid and ask price. Prices are based on pricing models, quoted prices of securities with similar characteristics or broker quotes. Fixed income-related instruments include investments in securities traded on exchanges, including listed futures and options, which are valued at the last reported sale prices on the last business day of the year, or if not available, the last reported bid prices. Over-the-counter securities are valued at the bid prices or the average of the bid and ask prices on the last business day of the year from published sources or, if not available, from other sources considered reliable, generally broker quotes.\nCash Equivalents.\n These investments primarily consist of high-quality, short-term obligations that are a part of institutional money market mutual funds that are valued using current market quotations or an appropriate substitute that reflects current market conditions.\nEquities and Equity-Related Instruments.\n These investments include common stock and equity-related instruments. Common stock is valued at the closing price reported on the active market on which the individual securities are traded. Equity-related instruments include investments in securities traded on exchanges, including listed futures and options, which are valued at the last reported sale prices on the last business day of the year or, if not available, the last reported bid prices. Over-the-counter securities are valued at the bid prices or the average of the bid and ask prices on the last business day of the year from published sources or, if not available, from other sources considered reliable, generally broker quotes.\nDelta Common Stock.\n The Delta common stock investment is managed by an independent fiduciary.\nReal Assets.\n These investments include commodities such as precious metals and precious metals-related instruments, some of which are valued at the closing price reported on the active market on which the individual instruments are traded, while others are priced based on pricing models, quoted prices of securities with similar characteristics or broker quotes.\nThe following table summarizes investments measured at fair value based on NAV per share as a practical expedient:\nBenefit plan investment assets measured at NAV\nDecember 31, 2024\nDecember 31, 2023\n(in millions)\nFair Value\nRedemption Frequency\nRedemption Notice Period\nFair Value\nRedemption Frequency\nRedemption Notice Period\nHedge funds and hedge fund-related strategies\n$\n6,519\n \n(1)\n15\n-\n180\n Days\n$\n6,175\n \n(1)\n7\n-\n180\n Days \nCommingled funds, private equity and private equity-related instruments\n(4)\n2,351\n \n(1) (2)\n2\n-\n45\n Days\n2,279\n \n(1) (2)\n2\n-\n45\n Days\nFixed income and fixed income-related instruments\n(4)\n1,427\n \n(1) (2)\n1\n-\n180\n Days\n1,147\n \n(1) (2)\n1\n-\n180\n Days\nReal assets\n(4)\n979\n \n(2)\nN/A\n893\n \n(2)\nN/A\nBalanced allocation\n349\n \n(5)\n0\n Days\n100\n \n(5)\n0\n Days\nOther\n813\n \n(3)\n2\n-\n10\n Days\n823\n \n(3)\n2\n-\n10\n Days\nTotal investments measured at NAV\n$\n12,438\n \n$\n11,417\n \n(1)\nVarious. Includes funds with monthly or more frequent, quarterly and/or custom redemption frequencies as well as funds with a redemption window following the anniversary of the initial investment.\n(2)\nIncludes private funds that are closed-ended structures in which the plans' investments are generally not eligible for redemption.\n(3)\nIncludes funds with monthly or more frequent redemptions.\n(4)\nUnfunded commitments were $\n1.3\n billion for commingled funds, private equity and private equity-related instruments, $\n287\n million for fixed income and fixed income-related instruments and $\n618\n million for real assets at December 31, 2024.\n(5)\nIncludes funds with daily redemptions.\nOn an annual basis we assess the potential for adjustments to the fair value of all investments. Due to a lag in the availability of data for certain of these investments (this primarily applies to private equity, private equity-related strategies and real assets), we solicit valuation updates from the investment fund managers and use their information and corroborating data from public markets to determine any needed fair value adjustments.\nHedge Funds and Hedge Fund-Related Strategies.\n These investments are primarily made through shares of limited partnerships or similar structures for which a liquid secondary market does not exist.\nDelta Air Lines, Inc. | 2024 Form 10-K\n80\nNotes to the Consolidated Financial Statements\nCommingled Funds, Private Equity and Private Equity-Related Instruments.\n These investments include commingled funds invested in common stock, as well as private equity and private equity-related instruments. Commingled funds are valued based on quoted market prices of the underlying assets owned by the fund. Private equity and private equity-related instruments are typically valued quarterly by the fund managers using valuation models where one or more of the significant inputs into the model cannot be observed and which require the development of assumptions.\nFixed Income and Fixed Income-Related Instruments.\n These investments include private fixed income instruments that are typically valued monthly or quarterly by the fund managers or third-party valuation agents using valuation models where one or more of significant inputs into the model cannot be observed and which require the development of assumptions.\nReal Assets.\n These investments include real estate, energy, timberland, agriculture and infrastructure. The valuation of real assets requires significant judgment due to the absence of quoted market prices as well as the inherent lack of liquidity and the long-term nature of these assets. Real assets are typically valued quarterly by the fund managers using valuation models where one or more of the significant inputs into the model cannot be observed and which require the development of assumptions\n.\nBalanced Allocation.\n The investments include commingled funds invested in common stock and fixed income instruments. Commingled funds are valued based on quoted market prices of the underlying assets owned by the fund.\nOther.\n Primarily includes globally-diversified, risk-managed commingled funds consisting mainly of equity, fixed income and commodity exposures.\nOther\nWe also sponsor defined benefit pension plans for eligible employees in certain foreign countries. These plans did not have a material impact on our Consolidated Financial Statements in any period presented.\nProfit Sharing Program\nOur broad-based employee profit sharing program provides that, for each year in which we have an annual pre-tax profit, as defined by the terms of the program, we will pay a specified portion of that profit to employees. In determining the amount of profit sharing, the program defines profit as pre-tax profit adjusted for profit sharing and certain other items.\nFor both the years ended December 31, 2024 and 2023, we recorded profit sharing expense of $\n1.4\n billion under the program.\nNOTE 10. \nCOMMITMENTS AND CONTINGENCIES\nAircraft Purchase Commitments\nOur future aircraft purchase commitments totaled approximately $\n18.3\n billion at December 31, 2024:\nAircraft purchase commitments\n(1)\n(in millions)\nTotal\n2025\n$\n3,340\n \n2026\n5,020\n \n2027\n4,430\n \n2028\n3,880\n \n2029\n1,250\n \nThereafter\n370\n \nTotal\n$\n18,290\n \n(1)\nThe timing of these commitments is based on our contractual agreements with the aircraft manufacturers and remains uncertain due to supply chain, manufacturing and regulatory constraints.\nDelta Air Lines, Inc. | 2024 Form 10-K\n81\nNotes to the Consolidated Financial Statements\nOur future aircraft purchase commitments included the following aircraft at December 31, 2024:\nAircraft purchase commitments by fleet type\nFleet Type\nPurchase Commitments\nA220-300\n72\n \nA321-200neo\n86\n \nA330-900neo\n7\n \nA350-900\n9\n \nA350-1000\n20\n \nB-737-10\n100\n \nTotal\n294\n \nAircraft Orders\nDuring 2024, we entered into a purchase agreement with Airbus for \n20\n A350-1000 aircraft, with an option to purchase an additional \n20\n widebody aircraft. Deliveries of these aircraft are scheduled to begin in 2026.\nAlso during 2024 we amended our purchase agreement with Boeing and received an updated delivery schedule for our Boeing 737-10 orders.\nContract Carrier Agreements\nWe have contract carrier agreements with regional carriers expiring through 2034. These agreements are structured as either capacity purchase or revenue proration agreements.\nCapacity Purchase Agreements.\n Our contractual agreements with regional carriers are primarily capacity purchase arrangements, under which we control the scheduling, pricing, reservations, ticketing and seat inventories for the regional carriers' flights operating under our \"DL\" designator code. We are entitled to all ticket, cargo, mail, in-flight and ancillary revenues associated with the flights under these capacity purchase arrangements. We pay those airlines an amount, as defined in the applicable agreement, which is based on a determination of their cost of operating those flights and other factors intended to approximate market rates for those services. \nThe following table shows our minimum obligations at December 31, 2024 under our existing capacity purchase agreements with third-party regional carriers, excluding contract carrier payments accounted for as leases of aircraft, which are described in Note 7, \"Leases.\" \nThe obligations set forth in the table contemplate minimum levels of flying by the regional carriers under the respective agreements and also reflect assumptions regarding certain costs associated with the minimum levels of flying such as the cost of fuel, labor, maintenance, insurance, catering, property tax and landing fees. Accordingly, our actual payments under these agreements could differ materially from the minimum fixed obligations set forth in the table below.\nContract carrier minimum obligations\n(in millions)\nAmount\n2025\n$\n1,750\n \n2026\n1,650\n \n2027\n1,590\n \n2028\n1,290\n \n2029\n710\n \nThereafter\n680\n \nTotal\n$\n7,670\n \nDelta Air Lines, Inc. | 2024 Form 10-K\n82\nNotes to the Consolidated Financial Statements\nLegal Contingencies\nWe are involved in various legal proceedings related to employment practices, environmental issues, commercial disputes, antitrust and other regulatory matters concerning our business. We record liabilities for losses from legal proceedings when we determine that it is probable that the outcome in a legal proceeding will be unfavorable and the amount of loss can be reasonably estimated. Although the outcome of the legal proceedings in which we are involved cannot be predicted with certainty, we believe that the resolution of current matters will not have a material adverse effect on our Consolidated Financial Statements.\nCredit Card Processing Agreements\nOur VISA/MasterCard and American Express credit card processing agreements provide that no cash reserve (\"Reserve\") is required, and no withholding of payment related to receivables collected will occur, except in certain circumstances, including when we do not maintain a required level of liquidity as outlined in the merchant processing agreements. In circumstances in which the credit card processor can establish a Reserve or withhold payments, the amount of the Reserve or payments that may be withheld would be equal to the potential liability of the credit card processor for tickets purchased with VISA/MasterCard or American Express credit cards, as applicable, that had not yet been used for travel. We did not have a Reserve or an amount withheld as of December 31, 2024 or 2023.\nOther Contingencies\nGeneral Indemnifications\nWe are the lessee under many commercial real estate leases. It is common in these transactions for us, as the lessee, to agree to indemnify the lessor and the lessor's related parties for tort, environmental and other liabilities that arise out of or relate to our use or occupancy of the leased premises. This type of indemnity would typically make us responsible to indemnified parties for liabilities arising out of the conduct of, among others, contractors, licensees and invitees at, or in connection with, the use or occupancy of the leased premises. This indemnity often extends to related liabilities arising from the negligence of the indemnified parties, but usually excludes any liabilities caused by either their sole or gross negligence or their willful misconduct.\nOur aircraft and other equipment lease and financing agreements typically contain provisions requiring us, as the lessee or obligor, to indemnify the other parties to those agreements, including certain of those parties' related persons, against virtually any liabilities that might arise from the use or operation of the aircraft or other equipment.\nWe believe that our insurance would cover most of our exposure to liabilities and related indemnities associated with the commercial real estate leases and aircraft and other equipment lease and financing agreements described above. While our insurance does not typically cover environmental liabilities, we have insurance policies in place as required by applicable environmental laws.\nSome of our aircraft and other financing transactions include provisions that require us to make payments to preserve an expected economic return to the lenders if that economic return is diminished due to specified changes in law or regulations. In some of these financing transactions, we also bear the risk of changes in tax laws that would subject payments to non-U.S. lenders to withholding taxes.\nWe cannot reasonably estimate our potential future payments under the indemnities and related provisions described above because we cannot predict (1) when and under what circumstances these provisions may be triggered and (2) the amount that would be payable if the provisions were triggered because the amounts would be based on facts and circumstances existing at such time.\nDelta Air Lines, Inc. | 2024 Form 10-K\n83\nNotes to the Consolidated Financial Statements\nEmployees Under Collective Bargaining Agreements \nAs of December 31, 2024, we had approximately \n103,000\n full-time equivalent employees, approximately \n20\n% of whom were represented by unions.\nDomestic airline employees represented by collective bargaining agreements by group\nEmployee Group\nApproximate Number of Employees Represented\nUnion\nDate on which Collective Bargaining Agreement Becomes Amendable\nDelta Pilots\n17,380\n \nALPA\nDecember 31, 2026\nDelta Flight Superintendents (Dispatchers)\n(1)\n500\n \nPAFCA\nNovember 1, 2024\nEndeavor Pilots\n1,540\n \nALPA\nJanuary 1, 2029\nEndeavor Flight Attendants\n1,700\n \nAFA\nMarch 31, 2027\n(1)\nWe are in discussions with representatives of PAFCA regarding terms of the collective bargaining agreement that became amendable on November 1, 2024.\nIn addition to the domestic airline employee groups discussed above, approximately \n200\n refinery employees of our wholly owned subsidiary Monroe are represented by the United Steel Workers under an agreement that expires on February 28, 2026. This agreement is governed by the National Labor Relations Act, which generally allows either party to engage in self-help upon the expiration of the agreement. Certain of our employees outside the U.S. are represented by unions, work councils or other local representative groups.\nOther\nWe have certain contracts for goods and services that require us to pay a penalty, acquire inventory specific to us or purchase contract-specific equipment, as defined by each respective contract, if we terminate the contract without cause prior to its expiration date. Because these obligations are contingent on our termination of the contract without cause prior to its expiration date, no obligation would exist unless such a termination occurs.\nNOTE 11. \nINCOME TAXES\nIncome Tax Provision\nComponents of income tax provision\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nCurrent tax provision:\nFederal\n$\n—\n \n$\n—\n \n$\n—\n \nState and local\n(\n35\n)\n(\n8\n)\n(\n1\n)\nInternational\n(\n11\n)\n(\n11\n)\n(\n4\n)\nDeferred tax (provision) benefit:\nFederal\n(\n1,038\n)\n(\n896\n)\n(\n525\n)\nState and local\n(\n117\n)\n(\n84\n)\n(\n66\n)\nIncome tax provision\n$\n(\n1,201\n)\n$\n(\n999\n)\n$\n(\n596\n)\nDelta Air Lines, Inc. | 2024 Form 10-K\n84\nNotes to the Consolidated Financial Statements\nThe following table presents the principal reasons for the difference between the effective tax rate and the U.S. federal statutory income tax rate:\nReconciliation of statutory federal income tax rate to the effective income tax rate\nYear Ended December 31,\n2024\n2023\n2022\nU.S. federal statutory income tax rate\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nState taxes, net of federal benefit\n2.6\n \n2.0\n \n3.0\n \nPermanent differences\n1.0\n \n0.7\n \n1.0\n \nValuation allowance\n1.9\n \n(\n5.0\n)\n7.3\n \nOther\n(\n0.7\n)\n(\n0.9\n)\n(\n1.1\n)\nEffective income tax rate\n25.8\n \n%\n17.8\n \n%\n31.2\n \n%\nDeferred Taxes\nWe account for deferred income taxes under the asset and liability method. We recognize deferred tax assets and liabilities based on the tax effects of temporary differences between the financial statement and tax basis of assets and liabilities, as measured by current enacted tax rates. Deferred tax assets and liabilities are net by jurisdiction and are recorded as noncurrent on the balance sheets.\nWe have elected to recognize global intangible low tax income in the period it arises and do not recognize deferred taxes for basis differences that may reverse in future years.\nDeferred income taxes reflect the net tax effect of temporary differences between the carrying amounts of assets and liabilities for financial reporting and income tax purposes.\nSignificant components of deferred income tax assets and liabilities\nDecember 31,\n(in millions)\n2024\n2023\nDeferred tax assets:\nNet operating loss carryforwards\n$\n799\n \n$\n1,217\n \nCapital loss carryforward\n—\n \n8\n \nPension, postretirement and other benefits\n1,205\n \n1,488\n \nInvestments\n936\n \n806\n \nDeferred revenue\n2,158\n \n2,110\n \nLease liabilities\n2,816\n \n2,193\n \nOther\n608\n \n709\n \nValuation allowance\n(\n951\n)\n(\n877\n)\nTotal deferred tax assets\n$\n7,571\n \n$\n7,654\n \nDeferred tax liabilities:\nDepreciation\n$\n7,040\n \n$\n5,570\n \nOperating lease assets\n1,369\n \n1,533\n \nIntangible assets\n1,165\n \n1,143\n \nOther\n78\n \n73\n \nTotal deferred tax liabilities\n$\n9,652\n \n$\n8,319\n \nBalance Sheet Position:\nOther noncurrent assets\n$\n95\n \n$\n243\n \nDeferred income taxes, net\n2,176\n \n908\n \nNet deferred tax liabilities\n$\n2,081\n \n$\n665\n \nDelta Air Lines, Inc. | 2024 Form 10-K\n85\nNotes to the Consolidated Financial Statements\nValuation Allowance\nA valuation allowance is recorded to reduce deferred tax assets when necessary. We periodically assess whether it is more likely than not that we will generate sufficient taxable income to realize our deferred income tax assets. We establish valuation allowances if it is more likely than not that we will be unable to realize our deferred income tax assets. In making this determination, we consider available positive and negative evidence and make certain assumptions. We consider, among other things, projected future taxable income, scheduled reversals of deferred tax liabilities, the overall business environment, our historical financial results and tax planning strategies.\nAt December 31, 2024 our net deferred tax liability balance was $\n2.1\n billion, including a $\n951\n million valuation allowance primarily related to certain net realized and unrealized capital losses and certain state net operating losses.\nAs of December 31, 2024, we had approximately $\n2.7\n billion of U.S. federal pre-tax net operating loss carryforwards which we are expecting to utilize during 2025. These net operating loss carryforwards were primarily generated in 2020 and do not expire. Therefore, we have not recorded a valuation allowance on our deferred tax assets other than the certain net realized and unrealized capital losses and certain state net operating losses that have short expiration periods.\nThe following table presents the balance of our valuation allowance on our deferred income tax assets and the associated activity:\nValuation allowance activity\n(in millions)\n2024\n2023\nBalance at January 1\n$\n877\n \n$\n1,176\n \nTax provision\n74\n \n(\n299\n)\nBalance at December 31\n$\n951\n \n$\n877\n \nOther\nThe amount of, and changes to, our uncertain tax positions were not material in any of the years presented. We are currently under audit by the IRS for the 2024 and 2023 tax years.\nNOTE 12. \nEQUITY AND EQUITY COMPENSATION\nEquity\nWe are authorized to issue \n2.0\n billion shares of capital stock, of which up to \n1.5\n billion may be shares of common stock, par value $\n0.0001\n per share, and up to \n500\n million may be shares of preferred stock.\nPreferred Stock.\n We may issue preferred stock in one or more series. The Board of Directors is authorized (1) to fix the descriptions, powers (including voting powers), preferences, rights, qualifications, limitations and restrictions with respect to any series of preferred stock and (2) to specify the number of shares of any series of preferred stock. We have not issued any preferred stock.\nTreasury Stock.\n We generally withhold shares of Delta common stock to cover employees' portion of required tax withholdings when employee equity awards vest. These shares are valued at cost, which equals the market price of the common stock on the date of vesting. The weighted average cost per share held in treasury was $\n31.06\n and $\n30.37\n as of December 31, 2024 and 2023, respectively.\nDelta Air Lines, Inc. | 2024 Form 10-K\n86\nNotes to the Consolidated Financial Statements\nWarrants.\n During 2020 and 2021, in connection with the Coronavirus Aid, Relief, and Economic Security Act of 2020 (the \"CARES Act\") payroll support program (\"PSP\") and extensions, we issued warrants to the U.S Department of the Treasury to acquire more than\n \n11.1\n million s\nhares of Delta common stock, which have subsequently been sold to a third party. The number of warrants outstanding slightly increased and the exercise price of the warrants slightly decreased since December 31, 2023 due to adjustments resulting from dividend payments during 2024. \nKey terms under each program as of December 31, 2024 are as follows:\nSummary of payroll support program warrants\n(in millions, except exercise price)\nNumber of Warrants\nExercise Price\nExpiration Year\nPayroll Support Program (PSP1)\n6.9\n$\n23.99\n \n2025\nPayroll Support Program Extension (PSP2)\n2.4\n39.11\n \n2026\nPayroll Support Program 3 (PSP3)\n1.9\n47.05\n \n2026\nTotal\n11.2\nEquity Compensation\nOur broad-based equity and cash compensation plan provides for grants of restricted stock, restricted stock units, stock options, performance awards, including cash incentive awards and other equity-based awards (the \"Plan\"). Shares of common stock issued under the Plan may be made available from authorized, but unissued, common stock or common stock we acquire. If any shares of our common stock are covered by an award that expires, is canceled, forfeited or otherwise terminates without delivery of shares (including shares surrendered or withheld for payment of taxes related to an award), such shares will again be available for issuance under the Plan except for (1) any shares tendered in payment of an option, (2) shares withheld to satisfy any tax withholding obligation with respect to the exercise of an option or stock appreciation right (\"SAR\") or (3) shares covered by a stock-settled SAR or other awards that were not issued upon the settlement of the award. The Plan authorizes the issuance of up to \n163\n million shares of common stock. As of December 31, 2024, there were \nnine\n million shares available for future grants.\nWe make long-term incentive awards annually to eligible employees under the Plan. Generally, awards vest over time, subject to the employee's continued employment. Equity compensation expense, including awards payable in common stock or cash, is recognized in salaries and related costs over the employee's requisite service period (generally, the vesting period of the award) and totaled $\n236\n million, $\n180\n million and $\n150\n million for the years ended December 31, 2024, 2023 and 2022, respectively. We record expense on a straight-line basis for awards with installment vesting. As of December 31, 2024, unrecognized costs related to unvested shares and stock options totaled $\n117\n million. We expect substantially all unvested awards to vest and recognize forfeitures as they occur.\nRestricted Stock.\n Restricted stock is common stock that may not be sold or otherwise transferred for a period of time and is subject to forfeiture in certain circumstances. The fair value of restricted stock awards is based on the closing price of the common stock on the grant date. As of December 31, 2024, there were \n4.3\n million unvested restricted stock awards. \nRestricted stock activity under the Plan for the years ended December 31, 2024, 2023 and 2022 is as follows:\nRestricted stock award activity\n2024\n2023\n2022\nRestricted Stock Awards\nWeighted-Average \nGrant Price\nRestricted Stock Awards\nWeighted-Average \nGrant Price\nRestricted Stock Awards\nWeighted-Average \nGrant Price\n(in millions, except weighted avg grant price)\nOutstanding at January 1\n4.2\n \n$\n40.51\n \n3.1\n \n$\n43.43\n \n2.9\n \n$\n45.66\n \nGranted\n2.6\n \n40.75\n \n2.7\n \n39.63\n \n1.9\n \n42.45\n \nVested\n(\n2.3\n)\n40.60\n \n(\n1.5\n)\n44.79\n \n(\n1.6\n)\n46.31\n \nForfeited\n(\n0.2\n)\n40.49\n \n(\n0.1\n)\n40.94\n \n(\n0.1\n)\n45.51\n \nOutstanding at December 31\n4.3\n \n$\n40.60\n \n4.2\n \n$\n40.51\n \n3.1\n \n$\n43.43\n \nDelta Air Lines, Inc. | 2024 Form 10-K\n87\nNotes to the Consolidated Financial Statements\nStock Options.\n Stock options are granted with an exercise price equal to the closing price of Delta common stock on the grant date and generally have a \n10-year\n term. We determine the fair value of stock options at the grant date using an option pricing model. As of December 31, 2024, there were \n4.8\n million outstanding exercisable stock option awards with a weighted average exercise price of $\n50.41\n. \nStock option activity under the Plan for the years ended December 31, 2024, 2023 and 2022 is as follows:\nStock option activity\n2024\n2023\n2022\nStock Options\nWeighted-Average \nExercise Price\nStock Options\nWeighted-Average \nExercise Price\nStock Options\nWeighted-Average \nExercise Price\n(in millions, except weighted avg grant price)\nOutstanding at January 1\n6.2\n \n$\n50.42\n \n6.2\n \n$\n50.40\n \n6.2\n \n$\n50.41\n \nGranted\n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \nExercised\n(1)\n(\n1.4\n)\n50.35\n \n—\n \n39.78\n \n—\n \n—\n \nForfeited\n(1)\n—\n \n52.89\n \n—\n \n51.91\n \n—\n \n52.87\n \nOutstanding at December 31\n4.8\n \n$\n50.41\n \n6.2\n \n$\n50.42\n \n6.2\n \n$\n50.40\n \n(1)\nForfeitures in 2024, 2023 and 2022 and exercises in 2023 occurred, but round to zero in the table above.\nPerformance Awards.\n Performance awards are dollar-denominated long-term incentive opportunities which are payable in cash to all participants. Potential performance award payments range from \n0\n%-\n200\n% of a target level and are contingent upon our achieving certain financial and operational goals over a \nthree-year\n performance period.\nPerformance Restricted Stock Units (PRSU).\n Performance restricted stock units are long-term incentive opportunities that provide executive officers with the right to receive shares of Delta stock based on our achievement of certain performance conditions at the end of a \nthree-year\n period. PRSUs were first granted to executive officers in 2022. Potential payouts range from \n0\n%-\n300\n% of a target level for the grants in 2022 and 2023 and range from \n0\n%-\n200\n% of a target level for the grants in 2024. Based on the closing stock price at year end and contingent on achieving the specified performance conditions, the maximum shares that could be issued were \n6.0\n million, \n3.3\n million and \n1.3\n million for the years ended December 31, 2024, 2023 and 2022 respectively.\nNOTE 13. \nACCUMULATED OTHER COMPREHENSIVE LOSS\nComponents of accumulated other comprehensive loss\n(in millions)\nPension and Other Benefits Liabilities\n(2)\nOther\nTax Effect\nTotal\nBalance at January 1, 2022\n$\n(\n8,355\n)\n$\n41\n \n$\n1,184\n \n$\n(\n7,130\n)\nChanges in value\n1,419\n \n—\n \n(\n330\n)\n1,089\n \nReclassifications into earnings\n(1)\n312\n \n—\n \n(\n72\n)\n240\n \nBalance at December 31, 2022\n(\n6,624\n)\n41\n \n782\n \n(\n5,801\n)\nChanges in value\n(\n303\n)\n(\n1\n)\n71\n \n(\n233\n)\nReclassifications into earnings\n(1)\n246\n \n—\n \n(\n57\n)\n189\n \nBalance at December 31, 2023\n(\n6,681\n)\n40\n \n796\n \n(\n5,845\n)\nChanges in value\n859\n \n2\n \n(\n199\n)\n662\n \nReclassifications into earnings\n(1)\n265\n \n—\n \n(\n61\n)\n204\n \nBalance at December 31, 2024\n$\n(\n5,557\n)\n$\n42\n \n$\n536\n \n$\n(\n4,979\n)\n(1)\nAmounts reclassified from AOCI for pension and other benefits liabilities are recorded in miscellaneous, net in non-operating expense in our income statement.\n(2)\nIncludes approximately $\n750\n million of deferred income tax expense as a result of tax law changes and prior valuation allowance releases through continuing operations, that will not be recognized in net income until pension and other benefit obligations are fully extinguished.\nDelta Air Lines, Inc. | 2024 Form 10-K\n88\nNotes to the Consolidated Financial Statements\nNOTE 14. \nSEGMENTS\nOperating segments are defined as components of an enterprise about which separate financial information is available that is evaluated regularly by the chief operating decision maker (\"CODM\") and is used in resource allocation and performance assessments. Our executive leadership team, the Delta Leadership Committee (“DLC”), is our CODM. The DLC regularly reviews information for our \ntwo\n operating segments: our airline segment and our refinery segment.\nThe DLC uses operating income to evaluate segment performance. The DLC is involved in determining and reviewing projected operating income as part of the annual plan process. Throughout the year, the DLC considers forecast to actual results and variances on a monthly and quarterly basis to allocate resources for the airline segment's fleet and network and to optimize the refinery segment's operations. The DLC also considers this information in strategic decisions related to capital allocations, including investments in fleet, ground, information technology and refinery assets, route and network development and human capital.\nAirline Segment\nOur airline segment is managed as a single business unit that provides scheduled air transportation for passengers and cargo throughout the U.S. and around the world and includes our loyalty program, as well as other ancillary businesses. This allows us to benefit from an integrated revenue pricing and route network. Our flight equipment forms \none\n fleet, which is deployed through a single route scheduling system. When making resource allocation decisions, our CODM evaluates aggregated flight profitability data, which considers fleet type and route economics, but gives no weight to the financial impact of the resource allocation decision on a geographic region or mainline/regional carrier basis. Our objective in making resource allocation decisions is to optimize our consolidated financial results.\nRefinery Segment\nOur Monroe subsidiary operates the Trainer oil refinery and related assets located near Philadelphia, Pennsylvania, as part of our strategy to mitigate the cost of the refining margin reflected in the price of jet fuel. Monroe's operations include pipelines and terminal assets that allow the refinery to supply jet fuel to our airline operations throughout the Northeastern U.S., including our New York hubs at LaGuardia and JFK.\nOur refinery segment operates for the benefit of the airline segment by providing jet fuel to the airline segment from its own production and through jet fuel obtained through agreements with third parties. The refinery's production consists of jet fuel, as well as non-jet fuel products. We exchange the non-jet fuel products produced by the refinery with counterparties for jet fuel consumed in our airline operations. The gross fair value of the products exchanged under these agreements during the years ended December 31, 2024, 2023 and 2022 was $\n1.5\n billion, $\n2.4\n billion and $\n3.5\n billion, respectively.\nA refinery is subject to annual Environmental Protection Agency (\"EPA\") requirements to blend renewable fuels into the gasoline and on-road diesel fuel it produces. A refinery may meet its obligation by blending the necessary volumes of renewable fuels, by purchasing Renewable Identification Numbers (\"RINs\") in the open market or through a combination of blending and purchasing RINs. Because Monroe is able to blend only a small amount of renewable fuels, it must purchase the majority of its RINs requirement in the secondary market. Renewable fuel compliance costs are accrued in accounts payable each period as the RINs obligation is generated. Purchased RINs are carried at the lower of cost and net realizable value and are recorded in prepaid expenses and other. The RINs asset and obligation are retired when used to satisfy EPA requirements.\nSegment Reporting\nSegment results are prepared based on our internal accounting methods described below, with reconciliations to consolidated amounts in accordance with GAAP. Our segments are not designed to measure operating income or loss directly related to the products and services included in each segment on a stand-alone basis. Our income tax provision is determined on a consolidated basis and is not calculated at the segment level.\nDelta Air Lines, Inc. | 2024 Form 10-K\n89\nNotes to the Consolidated Financial Statements\nFinancial information by segment\n(in millions)\nAirline\nRefinery\nIntersegment Sales/Other\nConsolidated\nYear Ended December 31, 2024\nOperating revenue\n$\n57,001\n \n$\n7,767\n \n$\n(\n3,125\n)\n(1)\n$\n61,643\n \nAirline salaries and related costs\n16,161\n \nAircraft fuel and related costs\n10,566\n \nRefinery cost of goods sold\n(2)\n7,234\n \nDepreciation and amortization\n2,513\n \n113\n \nOther segment items\n(3)\n21,804\n \n382\n \nOperating income\n(4)\n5,957\n \n38\n \n5,995\n \nInterest expense, net\n747\n \n3\n \n(\n3\n)\n747\n \nOther non-operating expense\n590\n \n590\n \nIncome before income taxes\n4,620\n \n35\n \n3\n \n4,658\n \nTotal assets, end of period\n72,979\n \n2,418\n \n(\n25\n)\n75,372\n \nCapital expenditures\n5,075\n \n65\n \n5,140\n \nYear Ended December 31, 2023\nOperating revenue\n$\n54,669\n \n$\n7,572\n \n$\n(\n4,193\n)\n(1)\n$\n58,048\n \nAirline salaries and related costs\n14,607\n \nAircraft fuel and related costs\n11,069\n \nRefinery cost of goods sold\n(2)\n6,665\n \nDepreciation and amortization\n2,341\n \n94\n \nOther segment items\n(3)\n21,516\n \n428\n \nOperating income\n(4)\n5,136\n \n385\n \n5,521\n \nInterest expense, net\n834\n \n17\n \n(\n17\n)\n834\n \nOther non-operating income\n921\n \n921\n \nIncome before income taxes\n5,223\n \n368\n \n17\n \n5,608\n \nTotal assets, end of period\n71,529\n \n2,174\n \n(\n59\n)\n73,644\n \nCapital expenditures\n5,088\n \n235\n \n5,323\n \nYear Ended December 31, 2022\nOperating revenue\n$\n45,605\n \n$\n10,706\n \n$\n(\n5,729\n)\n(1)\n$\n50,582\n \nAirline salaries and related costs\n11,902\n \nAircraft fuel and related costs\n11,482\n \nRefinery cost of goods sold\n(2)\n9,442\n \nDepreciation and amortization\n2,107\n \n93\n \nOther segment items\n(3)\n17,230\n \n394\n \nOperating income\n(4)\n2,884\n \n777\n \n3,661\n \nInterest expense, net\n1,029\n \n12\n \n(\n12\n)\n1,029\n \nOther non-operating expense\n718\n \n718\n \nIncome before income taxes\n1,137\n \n765\n \n12\n \n1,914\n \nTotal assets, end of period\n69,355\n \n3,039\n \n(\n106\n)\n72,288\n \nCapital expenditures\n6,217\n \n149\n \n6,366\n \n(1)\nSee table below for detail of the intersegment operating revenue amounts.\n(2)\nRefinery cost of goods sold are included within aircraft fuel and related taxes and ancillary businesses and refinery in our income statement.\n(3)\nThe nature of other segment items for the airline segment are shown on the income statement and for the refinery segment include salaries and related costs, maintenance, utilities and other expenses.\n(4)\nRefinery segment operating results are included within aircraft fuel and related taxes in our income statement.\nDelta Air Lines, Inc. | 2024 Form 10-K\n90\nNotes to the Consolidated Financial Statements\nOperating revenue intersegment sales/other\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nSales to airline segment\n(1)\n$\n(\n1,421\n)\n$\n(\n1,535\n)\n$\n(\n1,976\n)\nExchanged products\n(2)\n(\n1,473\n)\n(\n2,354\n)\n(\n3,475\n)\nSales of refined products\n(\n231\n)\n(\n304\n)\n(\n278\n)\nTotal operating revenue intersegment sales/other\n$\n(\n3,125\n)\n$\n(\n4,193\n)\n$\n(\n5,729\n)\n(1)\nRepresents transfers, valued on a market price basis, from the refinery to the airline segment for use in airline operations. We determine market price for jet fuel from the refinery by reference to the market index for the primary delivery location, which is New York Harbor.\n(2)\nRepresents value of products delivered under our exchange agreements, as discussed above, determined on a market price basis.\nNOTE 15. \nEARNINGS PER SHARE\nWe calculate basic earnings per share by dividing net income by the weighted average number of common shares outstanding, excluding restricted shares. We calculate diluted earnings per share by dividing net income by the weighted average number of common shares outstanding plus the dilutive effect of outstanding share-based instruments, including stock options, restricted stock awards and warrants. Antidilutive common stock equivalents excluded from the diluted earnings per share calculation are not material. \nThe following table shows our computation:\nBasic and diluted earnings per share\nYear Ended December 31,\n(in millions, except per share data)\n2024\n2023\n2022\nNet income\n$\n3,457\n \n$\n4,609\n \n$\n1,318\n \nBasic weighted average shares outstanding\n641\n \n639\n \n638\n \nDilutive effect of share-based instruments\n7\n \n4\n \n3\n \nDiluted weighted average shares outstanding\n648\n \n643\n \n641\n \nBasic earnings per share\n$\n5.39\n \n$\n7.21\n \n$\n2.07\n \nDiluted earnings per share\n$\n5.33\n \n$\n7.17\n \n$\n2.06\n \nDelta Air Lines, Inc. | 2024 Form 10-K\n91\nITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND\n \nFINANCIAL DISCLOSURE\nNone.\nITEM 9A. CONTROLS AND PROCEDURES\nDisclosure Controls and Procedures\nOur management, including our Chief Executive Officer and Chief Financial Officer, performed an evaluation of our disclosure controls and procedures, which have been designed to permit us to record, process, summarize and report, within time periods specified by the SEC's rules and forms, information required to be disclosed. Our management, including our Chief Executive Officer and Chief Financial Officer, concluded that the controls and procedures were effective as of December 31, 2024 to ensure that material information was accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate to allow timely decisions regarding required disclosure.\nChanges in Internal Control\nDuring the three months ended December 31, 2024, we did not make any changes in our internal control over financial reporting that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nManagement's Annual Report on Internal Control Over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act of 1934. Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States of America.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies may deteriorate.\nManagement conducted an evaluation of the effectiveness of our internal control over financial reporting as of December 31, 2024 using the criteria issued by the Committee of Sponsoring Organizations of the Treadway Commission (\"COSO\") in the 2013 Internal Control-Integrated Framework. Based on that evaluation, management believes that our internal control over financial reporting was effective as of December 31, 2024.\nThe effectiveness of our internal control over financial reporting as of December 31, 2024 has been audited by Ernst & Young LLP, an independent registered public accounting firm, which also audited our Consolidated Financial Statements for the year ended December 31, 2024. Ernst & Young LLP's report on our internal control over financial reporting is set forth below.\nDelta Air Lines, Inc. | 2024 Form 10-K\n92\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and the Board of Directors of Delta Air Lines, Inc.\nOpinion on Internal Control Over Financial Reporting\nWe have audited Delta Air Lines, Inc.’s internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Delta Air Lines, Inc. (the Company) maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on\n \nthe COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the 2024 consolidated financial statements of the Company and our report dated February 11, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Annual Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. \nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nAtlanta, Georgia\nFebruary 11, 2025\nDelta Air Lines, Inc. | 2024 Form 10-K\n93\nITEM 9B. OTHER INFORMATION\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot Applicable.\nPART III\nITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nInformation required by this item is set forth under the headings \"Governance - Board Matters,\" \"Proposal 1 - Election of Directors\" and \"Other Information - Delinquent Section 16(a) Reports\" in our Proxy Statement to be filed with the Commission related to our 2025 Annual Meeting of Stockholders (\"Proxy Statement\"), and is incorporated by reference. Certain information regarding Delta's executive officers is contained in Part I of this Form 10-K under the heading \"Information About Our Executive Officers.\"\nITEM 11. EXECUTIVE COMPENSATION\nInformation required by this item is set forth under the headings \"Executive Compensation\" and \"Director Compensation\" in our Proxy Statement and is incorporated by reference.\nITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND\n \nRELATED STOCKHOLDER MATTERS\nSecurities Authorized for Issuance Under Equity Compensation Plans\nThe following table provides information about the number of shares of common stock that may be issued under Delta's equity compensation plans as of December 31, 2024.\nEquity compensation plan information\nPlan Category\n(a) No. of Securities to be Issued Upon Exercise of Outstanding Options, Warrants and Rights\n(1)\n(b) Weighted-Average Exercise Price of Outstanding Options, Warrants and Rights\n(2)\n(c) No. of Securities Remaining Available for Future Issuance Under Equity Compensation Plans (Excluding Securities Reflected in Column (a))\n(3)\nEquity compensation plans approved by securities holders\n10,774,202 \n$\n22.35 \n9,053,334 \nEquity compensation plans not approved by securities holders\n— \n— \n— \nTotal\n10,774,202 \n$\n22.35 \n9,053,334 \n(1)\nIncludes a maximum of 5,998,521\n \nshares of common stock that may be issued upon the achievement of certain performance conditions under outstanding performance restricted share awards as of December 31, 2024.\n(2)\nIncludes performance restricted share awards, which do not have exercise prices. The weighted average exercise price of outstanding options at December 31, 2024 was\n \n$50.41.\n(3)\nReflects shares remaining available for issuance under Delta's Performance Compensation Plan. If any shares of our common stock are covered by an award under the Plan that expires, is canceled, forfeited or otherwise terminates without delivery of shares (including shares surrendered or withheld for payment of taxes related to an award), then such shares will again be available for issuance under the Plan except for (1) any shares tendered in payment of an option, (2) shares withheld to satisfy any tax withholding obligation with respect to the exercise of an option or stock appreciation right (\"SAR\") or (3) shares covered by a stock-settled SAR or other awards that were not issued upon the settlement of the award. Because 4,324,916 shares of restricted stock remained unvested and subject to forfeiture as of December 31, 2024, these shares could again be available for issuance.\nOther information required by this item is set forth under the heading \"Share Ownership\" in our Proxy Statement and is incorporated by reference.\nITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR\n \nINDEPENDENCE\nInformation required by this item is set forth under the headings \"Governance - Board Matters\" and \"Proposal 1 - Election of Directors\" in our Proxy Statement and is incorporated by reference.\nITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nInformation required by this item is set forth under the heading \"Proposal 4 - Ratification of the Appointment of Independent Auditors\" in our Proxy Statement and is incorporated by reference.\nDelta Air Lines, Inc. | 2024 Form 10-K\n94\nPART IV\nITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a) (1). The following is an index of the financial statements required by this item that are included in this Form 10-K:\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as of December 31, 2024 and 2023\nConsolidated Statements of Operations for the years ended December 31, 2024, 2023 and 2022\nConsolidated Statements of Comprehensive Income for the years ended December 31, 2024, 2023 and 2022\nConsolidated Statements of Cash Flows for the years ended December 31, 2024, 2023 and 2022\nConsolidated Statements of Stockholders' Equity for the years ended December 31, 2024, 2023 and 2022\nNotes to the Consolidated Financial Statements\n(2). Financial Statement Schedules. Financial statement schedules are not included herein as the required information is not applicable or is not present in amounts sufficient to require submission of the schedule, or because the information required is included in the Consolidated Financial Statements and accompanying notes included in this Form 10-K.\n(3). Exhibit List.\nThe exhibits required by this item are listed below. The management contracts and compensatory plans or arrangements required to be filed as an exhibit to this Form 10-K are listed as Exhibits 10.11 through 10.20.\nNote to Exhibits\n: Any representations and warranties of a party set forth in any agreement (including all exhibits and schedules thereto) filed with this Annual Report on Form 10-K have been made solely for the benefit of the other party to the agreement. Some of those representations and warranties were made only as of the date of the agreement or such other date as specified in the agreement, may be subject to a contractual standard of materiality different from what may be viewed as material to stockholders, or may have been used for the purpose of allocating risk between the parties rather than establishing matters as facts. Such agreements are included with this filing only to provide investors with information regarding the terms of the agreements, and not to provide investors with any other factual or disclosure information regarding the registrant or its business.\n3.1(a)\nDelta's Amended and Restated Certificate of Incorporation (Filed as Exhibit 3.1 to Delta's Current Report on Form 8-K as filed on April 30, 2007).*\n3.1 (b)\nAmendment to Amended and Restated Certificate of Incorporation (Filed as Exhibit 3.1 to Delta's Current Report on Form 8-K as filed on June 27, 2014).*\n3.2\nDelta's Bylaws (Filed as Exhibit 3.1 to Delta's Current Report on Form 8-K as filed on December 9, 2022).*\n4.1\nDescription of Registrant's Securities (Filed as Exhibit 4.1 to Delta's Annual Report on Form 10-K for the year ended December 31, 2020).*\nDelta is not filing any instruments evidencing any indebtedness because the total amount of securities authorized under any single such instrument does not exceed 10% of the total assets of Delta and its subsidiaries on a consolidated basis. Copies of such instruments will be furnished to the Securities and Exchange Commission upon request.\n10.1\nAmended and Restated Credit Agreement, dated as of November 6, 2023, among Delta Air Lines, Inc., as borrower, the lenders party thereto and JPMorgan Chase Bank, N.A., as administrative agent\n \n(Fi\nled as Exhibit \n10.1\n to Delta's Annual Report on Form 10-K for the year ended December 31, 2023\n)\n.\n*\n10.2(a)\nPayroll Support Program Agreement, dated as of April 20, 2020, between Delta Air Lines, Inc. and the United States Department of the Treasury (Filed as Exhibit 10.1 to Delta's Quarterly Report on Form 10-Q for the quarter ended June 30, 2020).*\nDelta Air Lines, Inc. | 2024 Form 10-K\n95\n10.2(b)\nWarrant Agreement, dated as of April 20, 2020, between Delta Air Lines, Inc. and the United States Department of the Treasury (Filed as Exhibit 10.2 to Delta's Quarterly Report on Form 10-Q for the quarter ended June 30, 2020).*\n10.2(c)\nForm of Warrant to Purchase Common Stock (Filed as Exhibit 10.4(b) to Delta's Annual Report on Form 10-K for the year ended December 31, 2020).*\n10.3(a)\nPayroll Support Program Extension Agreement, dated as of January 15, 2021, between Delta Air Lines, Inc. and the United States Department of the Treasury (Filed as Exhibit 10.7 to Delta's Annual Report on Form 10-K for the year ended December 31, 2020).*\n10.3(b)\nWarrant Agreement, dated as of January 15, 2021, between Delta Air Lines, Inc. and the United States Department of the Treasury (Filed as Exhibit 10.8(a) to Delta's Annual Report on Form 10-K for the year ended December 31, 2020).*\n10.3(c)\nForm of Warrant to Purchase Common Stock (Filed as Exhibit 10.8(b) to Delta's Annual Report on Form 10-K for the year ended December 31, 2020).*\n10.4(a)\nPayroll Support Program 3 Agreement, dated as of April 23, 2021, between Delta Air Lines, Inc. and the United States Department of the Treasury (Filed as Exhibit 10.1 to Delta's Quarterly Report on Form 10-Q for the quarter ended June 30, 2021).*\n10.4(b)\nWarrant Agreement, dated as of April 23, 2021, between Delta Air Lines, Inc. and the United States Department of the Treasury (including Form of Warrant to Purchase Common Stock) (Filed as Exhibit 10.2 to Delta's Quarterly Report on Form 10-Q for the quarter ended June 30, 2021).*\n10.5(a)\nTerm Loan Credit and Guaranty Agreement, dated as of September 23, 2020, among Delta\n Air Lines, Inc.\n, SkyMiles IP Ltd., the guarantors party thereto, Barclays Bank PLC, as administrative agent, U.S. Bank National Association, as collateral administrator, and the lenders party thereto (Filed as Exhibit 10.1 to Delta's Current Report on Form 8-K filed with the Securities and Exchange Commission on September 25, 2020).\n*\n10.5(b)\nFirst Amendment to Term Loan Credit and Guaranty dated as of December 4, 2022 among SkyMiles IP Ltd., Delta Air Lines, Inc. and Barclays Bank PLC, as administrative agent (Filed as Exhibit 10.6(b) to Delta's Annual Report on form 10-K for the year ended December 31, 2022).*\n10.6(a)\nAnchor Tenant Agreement dated as of December 9, 2010 between JFK International Air Terminal LLC and Delta Air Lines, Inc. (Filed as Exhibit 10.4 to Delta's Annual Report on Form 10-K for the year ended December 31, 2010).*\n10.6(b)\nSixth Supplement to Anchor Tenant Agreement dated as of April 8, 2022 between JFK International Air Terminal LLC and Delta Air Lines, Inc. (Filed as Exhibit 10.1 to Delta's Quarterly Report on Form 10-Q for the quarter ended June 30, 2022).*\n10.7\nAmended and Restated Agreement of Lease by and between The Port Authority of New York and New Jersey and Delta Air Lines, Inc., dated as of September 13, 2017 (Filed as Exhibit 10.1 to Delta’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2017).*\n10.8(a)\nAirbus A330-900neo Aircraft and A350-900 Aircraft Purchase Agreement dated as of November 24, 2014 between Airbus S.A.S and Delta Air Lines, Inc.\n**\n10.8(b)\nAmendment No. 3, dated May 10, 2017, to Airbus A330-900 Aircraft and A350-900 Aircraft Purchase Agreement dated as of November 24, 2014 between Airbus S.A.S. and Delta Air Lines, Inc. (\"Amendment No. 3\")\n.\n**\n10.8(c)\nLetter Agreements, dated May 10, 2017, relating to Amendment No. 3\n.\n**\n10.8(d)\nAmendment No. 8, dated as of October 30, 2018, to Airbus A330-900 Aircraft and A350-900 Aircraft Purchase Agreement dated as of November 24, 2014 between Airbus S.A.S. and Delta Air Lines, Inc. (\"Amendment No. 8\")\n.\n**\n10.8(e)\nLetter Agreements, dated as of October 30, 2018, relating to Amendment No. 8\n.\n**\nDelta Air Lines, Inc. | 2024 Form 10-K\n96\n10.8(f)\nAmendment No 11, dated as of July 30, 2020 to Airbus A330-900 Aircraft and A350-900 Aircraft Purchase Agreement, dated as of November 24, 2014 between\n Airbus S.A.S. \nand Delta Air Lines, Inc. \n(Filed as Exhibit 10.1(a) to Delta's Quarterly Report on Form 10-Q for the quarter ended September 30, 2020).*/**\n10.8(g)\nAmended and Restated Letter Agreement No. 1, dated as of July 30, 2020, relating to Airbus A330-900 Aircraft and A350-900 Aircraft Purchase Agreement dated as of November 24, 2014\n (Filed as Exhibit 10.1(b) to Delta's Quarterly Report on Form 10-Q for the quarter ended September 30, 2020).*/**\n10.8(h)\nAmended and Restated Letter Agreement No. 4, dated as of July 30, 2020, relating to Airbus A330-900 Aircraft and A350-900 Aircraft Purchase Agreement dated as of November 24, 2014 (Filed as Exhibit 10.1(c) to Delta's Quarterly Report on Form 10-Q for the quarter ended September 30, 2020).*/**\n10.8(i)\nAmendment No. 18 dated as of January 11, 2024, to Airbus A330-900 Aircraft and A350-900 Aircraft Purchase Agreement, dated as of November 24, 2014, between Airbus S.A.S. and Delta Air Lines, Inc. (\"Amendment No. 18\") (Filed as Exhibit 10.2(a) to Delta's Quarterly Report on Form 10-Q for the quarter ended March 31, 2024).*/**\n10.8(j)\nLetter Agreements, dated as of January 11, 2024, relating to Amendment No. 18 (Filed as Exhibit 10.2(b) to Delta's Quarterly Report on Form 10-Q for the quarter ended March 31, 2024).*/**\n10.9(a)\nAirbus A321neo Aircraft Purchase Agreement dated as of December 15, 2017 between Airbus S.A.S. and Delta Air Lines, Inc.\n**\n10.9(b)\nAmendment No. 2, dated as of July 30, 2020 to Airbus A321neo Aircraft Purchase Agreement, dated as of December 15, 2017 between \nAirbus S.A.S.\n and Delta Air Lines, Inc.\n (Filed as Exhibit 10.2(a) to Delta's Qu\narterly Report on Form 10-Q for the quarter ended September 30, 2020).*/**\n10.9(c)\nAmended and Restated Letter Agreement No. 3, dated as of July 30, 2020, relating to Airbus A321neo Aircraft Purchase Agreement, dated as of December 15, 2017 between \nAirbus S.A.S.\n \nand Delta Air Lines, Inc. \n(Filed as Exhibit 10.2(b) to Delta's Q\nuarterly Report on Form 10-Q for the quarter ended September 30, 2020).*/**\n10.9(d)\nAmendment No. 3, dated April 22, 2021, to Airbus A321neo Aircraft Purchase Agreement, dated as of December 15, 2017, between Airbus S.A.S. and Delta Air Lines, Inc. (\"Amendment No. 3\") (Filed as Exhibit 10.3(a) to Delta's Quarterly Report on Form 10-Q for the quarter ended June 30, 2021).*/**\n10.9(e)\nAmended and Restated Letter Agreements related to Amendment No. 3, dated April 22, 2021 (Filed as Exhibit 10.3(b) to Delta's Quarterly Report on Form 10-Q for the quarter ended June 30, 2021).*/**\n10.9(f)\nAmendment No. 4, dated August 20, 2021, to Airbus A321neo Aircraft Purchase Agreement, dated as of December 15, 2017, between Airbus S.A.S. and Delta Air Lines, Inc. (\"Amendment No. 4\") (Filed as Exhibit 10.1 to Delta's Quarterly Report on Form 10-Q for the quarter ended September 30, 2021).*/**\n10.9(g)\nAmended and Restated Letter Agreements No. 3 related to Amendment No. 4, dated August 20, 2021 (Filed as Exhibit 10.2 to Delta's Quarterly Report on Form 10-Q for the quarter ended September 30, 2021).*/**\n10.10(a)\nPurchase Agreement Number PA-04696, dated July 18, 2022, between The Boeing Company and Delta Air Lines, Inc. relating to Boeing Model 737-10 Aircraft (Filed as Exhibit 10.1 to Delta's Quarterly Report on Form 10-Q for the quarter ended September 30, 2022).*/**\n10.10(b)\nSupplemental Agreement No. 3, dated September 18, 2024, to Purchase Agreement Number PA-04696, dated July 18, 2022, between The Boeing Company and Delta Air Lines, Inc. relating to Boeing Model 737-10 Aircraft (\"Supplemental Agreement No. 3\") (Filed as Exhibit 10.2(a) to Delta's Quarterly Report on Form 10-Q for the quarter ended September 30, 2024).*/**\n10.10(c)\nLetter Agreements, dated September 18, 2024, relating to Supplemental Agreement No. 3 (Filed as Exhibit 10.2(b) to Delta's Quarterly Report on Form 10-Q for the quarter ended September 30, 2024).*/**\n10.11\nDelta Air Lines, Inc. Performance Compensation Plan (Filed as Exhibit 10.2 to Delta's Quarterly Report on Form 10-Q for the quarter ended June 30, 2016).*\n10.12(a)\nDelta Air Lines, Inc. Officer and Director Severance Plan, as amended and restated as of June 1, 2016 (Filed as Exhibit 10.3 to Delta's Quarterly Report on Form 10-Q for the quarter ended June 30, 2016).*\nDelta Air Lines, Inc. | 2024 Form 10-K\n97\n10.12(b)\nAmendment to Delta Air Lines, Inc. Officer and Director Severance Plan, as amended and restated as of June 1, 2016 (Filed as Exhibit 10.15(b) to Delta's Annual Report on Form 10-K for the year ended December 31, 2020).*\n10.13\nDescription of Certain Benefits of Members of the Board of Directors and Executive Officers (Filed as Exhibit 10.\n2\n to Delta's \nQuarterly\n Report on Form 10-\nQ\n for the \nquarter\n ended \nJune 30, 2024\n).*\n10.14\nDelta Air Lines, Inc. Management Incentive Plan (As Amended and Restated December 1, 2023). (Filed as Exhibit 10.14 to Delta's Annual Report on Form 10-K for the year ended December 31, 2023).*\n10.15\nModel Award Agreement for the Delta Air Lines, Inc. 2022 Long-Term Incentive Program (Filed as Exhibit 10.1 to Delta's Quarterly Report on Form 10-Q for the quarter ended March 31, 2022).*\n10.16\nModel Award Agreement for the Delta Air Lines, Inc. 2023 Long-Term Incentive Program\n.\n10.17\nM\nodel Award Agreement for the Delta Air Lines, Inc. 2024 Long-Term Incentive Program (Filed as Exhibit 10.1 to Delta's Quarterly Report on Form 10-Q for the quarter ended March 31, 2024).*\n10.18\nDelta Air Lines, Inc. Restoration Long Term Disability Plan (Filed as Exhibit 10.24 to Delta's Annual Report on Form 10-K for the year ended December 31, 2011).*\n10.19\nTerms of 202\n4\n Restricted Stock Awards for Non-Employee Directors (Filed as Exhibit 10.\n1\n to Delta’s Quarterly Report on Form 10-Q for the quarter ended June 30, 202\n4\n).*\n10.20\nS\neparation Agreement and General Release, dated August 22, 2024, by and between Delta Air Lines\n, Inc. and Michael Spanos (Fi\nled as Exhibit 10.1 to Delta's Quarterly Report on Form 10-Q for the quarter ended September 30, 2024).*\n19.1\nDelta Air Lines, Inc. Insider Trading Policy.\n21.1\nSubsidiaries of the Registrant.\n23.1\nConsent of Ernst & Young LLP.\n31.1\nRule 13a-14(a)/15d-14(a) Certification of Chief Executive Officer.\n31.2\nRule 13a-14(a)/15d-14(a) Certification of Chief Financial Officer.\n32\nCertification pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act 2002.\n97\nDelta Air Lines, Inc. Executive Officer Clawback Policy\n (Filed as Exhibit 97 to Delt\na's Annual Report on Form 10-K for the year ended December 31, 2023\n)\n.\n*\n101.INS\nXBRL Instance Document - The instance document does not appear in the interactive data file because its XBRL tags are embedded within the inline XBRL document.\n101.SCH\nXBRL Taxonomy Extension Schema Document\n101.CAL\nXBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nXBRL Taxonomy Extension Labels Linkbase Document\n101.PRE\nXBRL Taxonomy Extension Presentation Linkbase Document\n104\nThe cover page from this Annual Report on Form 10-K for the year ended December 31, 2024 formatted in Inline XBRL (included in Exhibit 101)\n*\nIncorporated by reference.\n**\nPortions of this exhibit have been omitted as confidential information.\nDelta Air Lines, Inc. | 2024 Form 10-K\n98\nITEM 16. FORM 10-K SUMMARY\nNot applicable.\nDelta Air Lines, Inc. | 2024 Form 10-K\n99\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized, on the 11th day of February, 2025.\nDELTA AIR LINES, INC.\nBy:\n/s/ Edward H. Bastian\nEdward H. Bastian\nChief Executive Officer\nDelta Air Lines, Inc. | 2024 Form 10-K\n100\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below on the 11th day of February, 2025 by the following persons on behalf of the registrant and in the capacities indicated.\nSignature\nTitle\n/s/ Edward H. Bastian\nChief Executive Officer and Director\n(Principal Executive Officer)\nEdward H. Bastian\n/s/ Daniel C. Janki\nExecutive Vice President and Chief Financial Officer \n(Principal Financial Officer)\nDaniel C. Janki\n/s/ William C. Carroll\nSenior Vice President - Controller \n(Principal Accounting Officer)\nWilliam C. Carroll\n/s/ Christophe Beck\nDirector\nChristophe Beck\n/s/ Maria Black\nDirector\nMaria Black\n/s/ Willie CW Chiang\nDirector\nWillie CW Chiang\n/s/ Greg Creed\nDirector\nGreg Creed\n/s/ David G. DeWalt\nDirector\nDavid G. DeWalt\n/s/ Leslie D. Hale\nDirector\nLeslie D. Hale\n/s/ Christopher A. Hazleton\nDirector\nChristopher A. Hazleton\n/s/ Michael P. Huerta\nDirector\nMichael P. Huerta\nDirector\nJudith J. McKenna\n/s/ Vasant M. Prabhu\nDirector\nVasant M. Prabhu\n/s/ Sergio A.L. Rial\nDirector\nSergio A.L. Rial\n/s/ David S. Taylor\nChairman of the Board\nDavid S. Taylor\n/s/ Kathy N. Waller\nDirector\nKathy N. Waller\nDelta Air Lines, Inc. | 2024 Form 10-K\n101"
  }
}