{
  "ticker": "DAY",
  "cik": "0001725057",
  "company_name": "Dayforce, Inc.",
  "filing_date": "2025-02-28",
  "accession": "0000950170-25-029980",
  "primary_doc": "day-20241231.htm",
  "item_sections": {
    "item1": "Item 1A. R\nisk Factors.\n\n\nOur business ordinarily encounters and addresses risks, some of which can cause our future results to be different than we currently anticipate. The risk factors described below represent our current view of some of the most important risks facing our business and are important to its understanding. The following information includes a number of forward-looking statements and should be read in conjunction with information contained in this Annual Report on Form 10-K, including the Management’s Discussion and Analysis of Financial Condition and Results of Operations, the Quantitative and Qualitative Disclosures About Market Risk, and the consolidated financial statements and related notes.\n \n\n\nSummary of Risk Factors\n\n\nConsistent with the foregoing, we are exposed to a variety of risks, including those associated with the following:\n\n\n•\nour ability to continue to sustain and grow revenue from our Cloud solutions;\n\n\n•\nany information security breach of our systems or the loss of, or unauthorized access to, customer information or sensitive company information;\n\n\n•\ndisruptions to the movement of funds to initiate payroll-related transactions on behalf of our customers, or customer inability to provide funds sufficient to cover the amounts paid on their behalf, or funds advanced to them via our Dayforce Wallet product;\n\n\n•\nour aging software infrastructure and technology;\n\n\n•\nour ability to manage our growth effectively;\n\n\n•\nour ability to compete effectively in the competitive markets in which we participate;\n\n\n•\nour exposure to risks inherent to our international sales and operations;\n\n\n•\nany failure to manage our technical operations infrastructure, or the impact of service outages or delays in the implementation of our applications, or the failure of our applications to perform properly;\n\n\n•\nour reliance on strategic relationships with third parties to drive additional growth;\n\n\n•\nany failure to offer high-quality support services;\n\n\n•\nany dissatisfaction of our customers with the quality and pace of the implementation and professional services provided by us or our partners;\n\n\n•\nany loss of key employees or the inability to attract and retain highly skilled employees;\n\n\n•\nany loss of customer funds and wage funds of their employees that our trustees and third-party financial institution partners hold;\n\n\n•\nour acquisition of other companies or technologies;\n\n\n•\nthe implementation of new accounting systems or other applications;\n\n\n•\nany failure to protect our intellectual property rights or any lawsuits against us for alleged infringement of third-party proprietary rights;\n\n\n•\nthe use of open source software in our applications;\n\n\n•\nour failure, or the failure of our third-party service providers, to comply with laws and regulations, or to update our solutions to reflect changes in applicable laws and regulations;\n\n\n•\nadditional regulatory requirements placed on our software and services;\n\n\n•\nany litigation and regulatory investigations aimed at us;\n\n\n•\nany actual or perceived failure to comply with evolving regulatory frameworks around the development and use of AI;\n\n\n•\nour existing and future debt obligations;\n\n\n•\nvolatility in the price of our common stock or the issuance of additional common stock;\n\n\n \n10\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\n•\nour share repurchase program;\n\n\n•\nour intention to not pay cash dividends in the foreseeable future;\n\n\n•\nprovisions in our certificate of incorporation and bylaws and Delaware law that might discourage, delay or prevent a change of control of the Company or changes in our management;\n\n\n•\nany failure to maintain effective internal control over financial reporting in accordance with Section 404 of the Sarbanes-Oxley Act;\n\n\n•\nadverse economic and market conditions;\n\n\n•\nfluctuations in our quarterly results;\n\n\n•\ncatastrophic events and our disclosures and ambitions related to sustainability matters;\n\n\n•\nour being subject to taxation in multiple jurisdictions; and\n\n\n•\nany changes in generally accepted accounting principles in the United States.\n\n\nRisks Related to Our Business and Industry\n \n\n\nRevenues from our Cloud solutions have grown substantially over the last few years, and we believe a significant portion of our market capitalization depends on sustaining the revenue growth trajectory of our Cloud solutions. Our efforts to continue growing revenue from our Cloud solutions may not succeed and may reduce our revenue growth rate.\n\n\nOur ability to continue to grow revenues from our Cloud solutions depends upon a number of factors, including the quality and functionality of our platform, our ability to design our Cloud solutions to meet consumer demand, and our ability to increase sales from existing customers. While initiatives such as expansion in new global markets, sales to our existing base of customers, and the expansion of our platform with new products and features represent significant opportunity for us, it is uncertain if we will continue to successfully grow those sources of revenue.\n\n\nThe success of our growth strategies will depend upon our ability to anticipate and to adapt to changes in technology and industry standards, and to effectively develop, introduce, market, and gain broad acceptance of new product and service offerings and enhancements incorporating the latest technological advancements. Our success is also subject to the risk of future disruptive technologies, such as large language models, AI, and machine learning. One focal point of our value proposition is the ability of our platform to drive efficiencies and power decision-making at our customers. The failure to develop enhancements to our applications for, or that incorporate, technologies such as AI, machine learning, and large language models to help drive those efficiencies or power decision making at our customers may impact our ability to win and retain customers. In addition, we may not be able to successfully provide new or enhanced functionality and features for our existing solutions, including those that may involve AI or machine learning or be created using AI or machine learning, that achieve market acceptance or that keep pace with rapid technological developments.\n\n\nIf we are unable to sell our Cloud solutions into new markets or further penetrate existing markets, or to increase sales from existing customers, or if we have failures in new product functionalities, our revenue may not grow as expected, which could have a material adverse effect on our market capitalization, and our business, financial condition, and results of operations.\n\n\nIf the movement of funds to initiate payroll-related transactions on behalf of our customers is disrupted, we may suffer significant losses which could have a material adverse effect on our business, financial condition, and results of operations.\n \n \n\n\nOur payroll and tax processing services involve the movement of significant funds from the account of a customer to its employees and to relevant taxing authorities. Typically, we rely upon third party vendors to initiate payments on behalf of our customers. These payments are made in a large number of jurisdictions, in great volume and in short time windows, all of which raise the possibility of an error that disrupts the movement of funds. Further, these types of transactions are subject to an increasingly complex series of regulations and laws that we, and/or our third-party vendors must comply with. Failure to comply with these regulations and laws could result in consequences up to and including a regulator enjoining us and/or our third-party vendors from engaging in the movement of funds. In addition, as described elsewhere, the systems on which these payroll-related transactions are based are in some cases antiquated or manual or may be subject to processing and/or technological errors in communicating with third-party technology systems. Any disruption or delay to data flow in these critical time periods could lead to the disruption of fund movement. Any disruption of fund movement could have significant\n \n\n\n \n11\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\nconsequences, including defaults under our customer agreements and exposure to monetary damages, in addition to reputational harm, that could have a material adverse effect on our business, financial condition and results of operations.\n\n\nOur aging software infrastructure, technology, and sophistication of these systems, and our migration to new platforms, has and will continue to lead to increased costs, vulnerability to cyber-attack, or disruptions in operations that could have a material adverse effect on our business, market brand, financial condition, and results of operations.\n\n\nOur business continues to demand the use of sophisticated systems and technology, including technology infrastructure assets. These systems and technologies must be refined, updated and/or replaced with more advanced systems on a regular basis in order for us to meet both our customers’ and employees’ demands and expectations. Some of the crucial platforms on which we host our back office and legacy systems will need to be retired, replaced or are in the process of being replaced. All customer instances have been migrated to public Cloud environments or are in private Cloud environments on shared systems. These technological changes are expensive and have and will continue to impact our profitability and demand attention from our senior leadership. If we are unable to replace our aged, crucial platforms, if some or all these platforms fail to operate due to a software error or infrastructure failure, if we fail to continue to refine and update our systems and technologies on a timely basis or within reasonable cost parameters, if we do not appropriately and timely train our employees to operate any of these new systems, if we fail to migrate to new systems in a manner free from disruption, if the new systems fail to perform as desired, or if we are unable to appropriately protect any of these systems, we could suffer the loss of data, vulnerabilities to cyber-attack, system outages or other performance problems, which could have a material adverse effect on our business, financial condition, and results of operations.\n\n\nOur business plan is focused on an aggressive growth strategy. If we fail to manage our growth effectively or if our strategy is not successful, we may be unable to execute our business plan, to maintain high levels of service, to adequately address competitive challenges, or to achieve our profitability goals. \n \n \n\n\nWe have experienced rapid expansion in our operation and Cloud solutions and expect this trend to continue. Such growth places substantial demands on our management, administrative, operational, technological, and financial infrastructure. To manage these demands effectively, we must consistently enhance and scale our systems, internal controls, reporting frameworks, and operational procedures to meet the needs of a global organization. These improvements have and may continue to require significant investments, which could disrupt existing processes and systems during the transition.\n\n\nOur attempts to develop new or enhanced functionality to our services, whether as part of our anticipated development road map or in response to enhancement requests we have committed to our customers, has been, and will continue to be expensive and impact our profitability.  Failure to effectively manage growth or to achieve a profitable growth strategy could result in problems or delays in implementing customers, declines in quality or customer satisfaction, decreased profitability on new customer deals, increases in costs, complications or delays in introducing new features or fixing or updating our existing technology and infrastructure, or other operational challenges; and any of these difficulties could have a material adverse effect on our business, financial condition, and results of operations.\n\n\nThe markets in which we participate are highly competitive, and if we do not compete effectively, it could have a material adverse effect on our business, financial condition, and results of operations.\n\n\nThe markets in which we participate are highly competitive, and competition could intensify in the future. We believe the principal competitive factors in our market include: breadth and depth of product functionality, scalability and reliability of applications, robust workforce management, comprehensive tax services, modern and innovative Cloud technology platforms combined with an intuitive user experience, \nrapi\nd technological change such as the rise of large language models, multi-country and jurisdiction domain expertise in payroll and HCM, quality of implementation and customer service, integration with a wide variety of third party applications and systems, total cost of ownership and return on investment, brand awareness, and reputation, pricing and distribution.\n\n\nWe face a variety of competitors, some of which are long-established providers of HCM solutions. Many of our current and potential competitors are larger, have greater name recognition, longer operating histories, larger marketing budgets, and significantly greater resources than we do, and are able to devote greater resources to the development, promotion, and sale of their products and services. Some of our competitors do or could offer HCM solutions bundled as part of a larger product offering. Furthermore, our current or potential competitors may be acquired by third parties with greater available resources and the ability to initiate or to withstand substantial price competition. In addition, many of our competitors have established marketing relationships, access to larger customer bases, and major distribution agreements with consultants,\n \n\n\n \n12\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\nsystem integrators, and resellers. Our competitors have and may continue to establish cooperative relationships among themselves or with third parties that may further enhance their product offerings or resources. Although we have a global partnership strategy, additional investment and efforts will be necessary to fully implement and scale such a strategy.\n\n\nIf our competitors’ products, services, or technologies become more accepted than our applications are today, if they are successful in bringing their products or services to market earlier than ours, or if their products or services are more technologically capable than ours, it could have a material adverse effect on our business, financial condition, and results of operations. In addition, some of our competitors may offer their products and services at a lower price compared to our products or their current pricing impacting our ability to achieve our target pricing. If we are unable to achieve our target pricing levels or if we experience significant pricing pressures, it could have a material adverse effect on our business, financial condition, and results of operations.\n\n\nOur international growth strategy has and will continue to expose us to risks inherent in international sales and operations.\n\n\nWe have and will continue to expand our operations and sales into new international markets. Our international operations are subject to risks that could adversely affect those operations or our business as a whole, including but not limited to the costs of establishing a market presence, localizing product and service offerings for foreign customers, difficulties in managing and staffing international operations, and increased expenses related to introducing corporate policies and controls in our international operations and increased reliance on partners to provide services in additional geographies. Further, the expansion of our product offering into new international markets has and will continue to result in an expansion of our monitoring of local laws and regulations, which increases our costs as well as the risk of the product not incorporating in a timely fashion or at all the necessary changes to enable a customer to be compliant with such laws, or in manual workarounds that are prone to errors.\n\n\nMoreover, as part of our international strategy, we work with partners to perform services in certain geographies where we do not currently have international operations or the particular service required by our customers. As a result, we may experience business impact if our partners do not carry out the services as committed, or at a quality level that our customers demand, including potential for reduced margin from additional expense or impact to customer relationships.\n\n\nOur international growth strategy has and may continue to include growth via acquisition. Our growth following an acquisition may also be dependent on our ability to transition acquired customers from current and legacy products to Dayforce, migrate and integrate acquired technologies or to increase sales by addressing broader HCM needs with additional modules of Dayforce.\n\n\nIf we are unable to provide the required services on a multinational basis, or if we are unable to effectively manage our international expansion, we could be subject to negative customer experiences, harm to our reputation or loss of customers, claims for any fines, penalties or other damages suffered by our customer, and other financial harm, including fines, penalties, or other damages suffered by us directly, which would negatively impact revenue and earnings. Although we have a multinational strategy, additional investment and efforts may be necessary to implement such strategy. Some of our business partners also have international operations and are subject to the risks described above.\n\n\nIf our current or future applications that we provide to customers fail to perform properly, our reputation could be adversely affected, our market share could decline, and we could be subject to liability claims, which could have a material adverse effect on our business, financial condition, and results of operations.\n\n\nOur applications are inherently complex and we have, and may continue to identify material defects or errors in them that we are not yet aware of. Because of the large amount of data that we collect and manage, we have experienced, and we may continue to experience failures or errors in our systems could result in data loss or corruption or cause the information that we collect to be incomplete or to contain inaccuracies that our customers regard as significant. Any defects in functionality or that cause interruptions in the availability of our applications could result in reputational, competitive, operational, or other business harm as well as financial costs and regulatory action, any of which could have a material adverse effect on our business, financial condition, and results of operations. In addition, the costs incurred in correcting any material defects or errors might be substantial. Similarly, while we conduct standard due diligence during our acquisition process, these risks are heightened as we grow by acquisition and dedicate resources to integrating the acquisition target’s systems into ours and take on the vulnerabilities that may exist at the acquisition target.\n\n\n \n13\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\nIf we fail to manage our technical operations infrastructure, our existing customers may experience service outages, and our new customers may experience delays in the implementation of our applications, which could have a material adverse effect on our business, financial condition, and results of operations.\n\n\nWe have experienced and will continue to experience significant growth in the number of users, transactions, transmission volume and data that our operations infrastructure supports, including the acquisition of new systems via strategic transactions. We seek to maintain sufficient capacity in our operations infrastructure to meet the needs of our customers and to facilitate the rapid provision of new customer activations and the expansion of existing customer activations. In addition, we need to continue to properly manage our technological operations infrastructure to support version control, changes in hardware and software parameters, and the evolution of our applications. We have experienced, and may in the future experience, disruptions, outages, and other performance problems. These problems may be caused by a variety of factors, including hardware failures, infrastructure changes, human or software errors, viruses, security attacks, fraud, increased resource consumption from expansion or modification to our Dayforce code, spikes in customer usage, denial of service attacks and Cloud interruptions run by third party service providers and our ability to react. The risks of these problems occurring may be exacerbated by our strategic acquisitions, especially in the period following the acquisition as we integrate the acquisition target’s systems into ours, as well as our aging technology infrastructure which in some cases is supported by older platforms. In some instances, we may not be able to identify the cause or causes of these performance problems within an acceptable period of time. If we do not accurately predict our infrastructure requirements, our existing customers may experience service outages that may subject them to financial penalties, causing us to incur financial liabilities and customer losses.\n\n\nOur growth depends in part on the success of our strategic relationships with third parties who provide us with services and license us software for use in or with both our applications and our internal operations.\n\n\nIn order to maintain and grow our business, we do, and we anticipate that we will continue to, depend on the continuation and expansion of relationships with third parties who provide us with services. These service provider partners include connected payroll partners, implementation partners, systems integrators, third party sales channel partners, the operators of data centers, and banks and other providers who execute wire transfers and other money movement services to support our customer payroll and tax services. Our agreements with these third party service providers are typically non-exclusive and do not prohibit them from working with our competitors. If any third-party service providers on which we rely to provide us with services experience a disruption, go out of business, are acquired by our competitors, experience a decline in quality, or terminate their relationship with us, we could experience a material adverse effect on our business, financial condition, and results of operations.\n\n\nIn addition, we license software from third parties for use in or with both our applications and our internal operations, and the inability to maintain these licenses could result in increased costs, or reduced service levels, which could have a material adverse effect on our business, financial condition, and results of operations. To the extent that our applications depend upon the successful operation or availability of third party software in conjunction with our software, any undetected errors or defects in this third party software could prevent the deployment or impair the functionality of our applications, delay new application introductions, and result in a failure of our applications, which could have a material adverse effect on our business, financial condition, and results of operations.\n\n\nAny failure to offer high-quality support services may adversely affect our relationships with our customers and could have a material adverse effect on our business, financial condition, and results of operations. \n \n \n\n\nWe rely on retaining customers once our applications are deployed, and our customers depend on our support organization and the support capabilities of our partners to resolve technical issues relating to our applications, as well as our partner’s applications after our applications are deployed. We or our partners may be unable to respond quickly enough to accommodate short-term increases in customer demand for support services, and we may be limited in our ability to resolve the technical issues our customers have with our technology, or our partner’s technology. We or our partners also may be unable to modify the format of our or our partners’ support services to compete with changes in support services provided by our competitors. Increased customer demand for these services, without corresponding revenues, could increase costs and have an adverse effect on our results of operations. Ultimately, a client could elect to terminate their agreement due to dissatisfaction with support, resulting in lost recurring revenue. In addition, our sales process is highly dependent on our applications and business reputation and on positive recommendations from our existing customers. Any failure to maintain high-quality technical support, or a market perception that we do not maintain high-quality support, could adversely affect our reputation and our ability to sell our applications to existing and prospective customers, which could have a material adverse effect on our business, financial condition, and results of operations.\n\n\n \n14\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\nIf our customers are not satisfied with the quality and pace of the implementation and professional services provided by us or our partners, it could have a material adverse effect on our business, financial condition, and results of operations.\n\n\nOur business depends on the ability to implement our solutions in a timely, accurate, and cost-efficient basis and to provide services at the high level demanded by our customers. Implementation and other professional services may be performed by our own staff, by a third party, or by a combination of the two. If a customer is not satisfied with the timely access or the quality of work performed, then we could incur loss of revenue or additional costs to address the situation, the customer’s dissatisfaction with such services could damage our ability to expand the number of applications subscribed to by that customer or we could be liable for loss or damage suffered as a result, any of which could have a material adverse effect on our business, financial condition, and results of operations. If a new customer is dissatisfied with implementation, the customer could decide not to go-live, which could result in a delay in our collection of fees or could result in a customer seeking repayment of its implementation fees suing us for damages or could oblige us to enforce the termination provisions in our customer contracts in order to collect revenue. In addition, negative publicity related to our customer relationships, regardless of its accuracy, may affect our ability to compete for new business with current and prospective customers, which could also have a material adverse effect on our business, financial condition, and results of operations.\n\n\nWe depend on our senior management team, and the loss of one or more key employees or an inability to attract and to retain highly skilled employees could have a material adverse effect on our business, financial condition, and results of operations.\n\n\nOur success depends largely upon the continued services of our senior management team. Our executive officers, senior management or other key personnel have limited or no notice period applicable to their employment. Therefore, they could terminate their employment with us at any time. Additionally, we do not maintain key employee insurance on any of our executive officers, senior management, or key employees. The loss of one or more of our executive officers, senior management, or key employees could have a material adverse effect on our business, financial condition, and results of operations.\n\n\nTo execute our growth plan, we must attract and retain highly qualified personnel. Competition for talent is intense and has become more intense in recent years, including without limitation for individuals with high levels of experience in designing and developing software and Internet-related services and senior sales executives. We have, from time to time, experienced the need to increase compensation for current and prospective employees to retain and recruit employees of the desired qualifications which impacts our ability to profitably operate our business. In addition, we have and we expect to continue to experience, difficulty in hiring and retaining employees with appropriate qualifications, the cumulative loss of which could raise the risk of failures to operate our business to the quality needed and could have a material adverse effect on our business, financial condition, and results of operations.\n\n\nIf our vendors or affiliates initiate payroll-related transactions on behalf of our customers and do not receive funds from the customer sufficient to cover the amounts paid on their behalf, we may suffer significant losses which could have a material adverse effect on our business, financial condition, and results of operations. \n\n\nUnder certain circumstances, funds may not be received from our customers to cover the transactions that our affiliates and third party vendors have initiated on our customers’ behalf. Additionally, there is a risk that an erroneous payment instruction may trigger inaccurate payments. There is, therefore, a risk that the customer’s funds will be insufficient to cover the amounts already paid on its behalf. Should customers default on their payment obligations in the future, should our affiliates or vendors make erroneous payments on behalf of a customer, should erroneous or defaulted payment recovery be unsuccessful, or should our affiliates or vendors suffer losses from similar issues, we may be required to advance substantial amounts of funds to cover such obligations, or to make our partners whole for any losses they suffer. In such an event, we may also be required to seek additional sources of short-term liquidity, which may not be available on reasonable terms, which could have a material adverse effect on our business, financial condition, and results of operations. Further, should a customer on whose behalf our affiliate or vendor has initiated a transaction subsequently have financial difficulty or refuse to pay, collection of any funds advanced on its behalf may be difficult and we may suffer losses that could have a material adverse effect on our business, financial condition, and results of operation.\n\n\n \n15\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\nFor our Dayforce Wallet product, we advance earned net wages and associated tax amounts on behalf of customers in connection with the “on-demand pay” payroll feature of the service in order to provide their employees access to earned wages in advance of their standard payroll cycles. A customer may fail to satisfy its obligation to repay us for those advanced monies which could have a material adverse effect on our business, financial condition, and results of operations.\n\n\nIn the case of our “on-demand pay” service (a service that is offered as part of the Dayforce Wallet), credit is provided to our customers and funds are advanced on the customers’ behalf in order to fund the customers’ employees’ interim earned net wage payroll demands (including associated source and other deductions) with the requirement that the customers will repay the advance on the date of their next ordinary payroll run. These advances may or may not have priority over other creditors of our customers, and our other credit protection measures, if implemented, may be inadequate to make us whole. There is, therefore, a risk that our customers do not pay back the amounts we have already paid on their behalf, and in that event, we may possess limited legal recourse to recoup those funds from our customers. In the event of a customer’s failure to repay us, we may also be required to seek additional sources of short-term liquidity, which may not be available on reasonable terms, or suffer credit losses, which could have a material adverse effect on our business, financial condition, and results of operations.\n\n\nCustomer funds and wage funds of their employees that our trustees and third-party financial institution partners hold are subject to market, interest rate, credit, and liquidity risks. The loss of these funds could have a material adverse effect on our business, financial condition, and results of operations.\n\n\nOur trustees (in the case of customer funds held in our U.S. Employer Funds Trust and our Canada Payroll Trust) and our third party financial institution partners (in the case of employee wage funds held on their behalf as part of the U.S. Dayforce Wallet program and certain of our non-U.S. operations) may invest funds in one or more high-quality bank deposits, money market mutual funds, commercial paper, collateralized short-term investments, government securities, as well as highly rated asset-backed, mortgage-backed, municipal, corporate, and bank securities. These assets are subject to varying degrees of general market, interest rate, credit, and liquidity risks. These risks may be exacerbated, individually or in unison, during periods of unusual financial market volatility. We are required to fund the payroll and wage funds of our customers and their employees regardless of any loss realized on those investments affecting the principal funds held. In the event of a global financial crisis, such as that experienced in 2008, we could be faced with a severe constriction of the availability of liquidity, which could impact our ability to fund payrolls. Any loss of principal, or inability to access customer funds could have an adverse impact on our cash position and results of operations and could require us to obtain additional sources of liquidity, and could have a material adverse effect on our business, financial condition, and results of operations.\n\n\nWe may acquire other companies or technologies, which could divert our management’s attention, result in additional indebtedness or dilution to our stockholders, and otherwise disrupt our operations, which could have a material adverse effect on our business, financial condition, and results of operations.\n\n\nWe have, and we may in the future seek to acquire or to invest in businesses, applications, or technologies that we believe could complement or expand our applications, enhance our technical capabilities, or otherwise offer growth opportunities. The pursuit of potential acquisitions may divert the attention of management and cause us to incur various expenses in identifying, investigating, and pursuing suitable acquisitions, whether or not they are consummated. In addition, we have limited experience in acquiring other businesses. If we acquire additional businesses, we may incur significant costs to integrate such businesses. Further, we may not be able to integrate the acquired personnel, operations, and technologies successfully or profitably, or to effectively manage the combined business following the acquisition. If an acquired business fails to meet our expectations, it could have a material adverse effect on our business, financial condition, and results of operations. In order to fund acquisitions, we may issue dilutive equity securities or incur additional debt, resulting in an increase in our interest payments.\n\n\nA significant portion of the purchase price of companies we acquire may be allocated to goodwill and other intangible assets, which must be assessed for impairment at least annually. In the future, if our acquisitions do not yield expected returns, we may be required to record charges based on this impairment assessment, which could have a material adverse effect on our financial condition and results of operations.\n\n\n \n16\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\nThe implementation of new accounting systems or other applications could interfere with our business and operations.\n\n\nThe implementation of new systems and enhancements may be disruptive to our business and can be time-consuming and divert management’s attention. Any disruptions relating to our systems or any problems with implementation of new applications, particularly any disruptions impacting our operations or our ability to accurately report our financial performance on a timely basis, could materially and adversely affect our business and operations\n.\n\n\nRisks Related to Security and Intellectual Property\n\n\nAn information security breach of our systems or the loss of, or unauthorized access to, customer information or sensitive company information; or a system disruption could have a material adverse effect on our business, market brand, financial condition, and results of operations. \n\n\nOur products and services systems and our internal corporate information technology (“IT”) systems (our products, services and internal corporate IT systems collectively referred to as our “IT Systems”) have in the past been, and will in the future be, subject to numerous and evolving cybersecurity risks that threaten the confidentiality, integrity, and availability of our IT Systems and the data stored therein. These actual and potential risks include diverse threat actors, such as state-sponsored organizations and opportunistic hackers and hacktivists, as well as diverse attack vectors, such as social engineering/phishing, malware (including ransomware), malfeasance by insiders, human, or technological error, and as a result of malicious code embedded in open-source software, or misconfigurations, “bugs” or other vulnerabilities in our IT Systems, or the commercial software that is integrated into our (or our suppliers’ or service providers’) IT Systems, products, or services. Cyberattacks are expected to accelerate on a global basis in frequency and magnitude as threat actors are becoming increasingly sophisticated in using techniques and tools—including AI—that circumvent security controls, evade detection, and remove forensic evidence. As a result, we may be unable to detect, investigate, remediate, or recover from future attacks or incidents, or to avoid a material adverse impact to our IT Systems or our business. Moreover, the continued integration of AI into our products and business processes, as well as the use of AI by our third party providers, may bring about unknown and currently unmanaged risks that could cause a material adverse impact to our IT Systems, business operations and data security, including risks associated with the consequences of inadvertent or unauthorized access to, or use of, customer information.\n\n\nWe rely on our IT Systems, which are maintained both internally and externally by third parties, to operate our business, including to process, on a daily and time sensitive basis, a large number of complicated transactions. Any information security breach in our IT Systems has the potential to impact our customer information and sensitive company information, including our financial reporting capabilities, which could result in the potential loss of business and our ability to accurately report financial results. If any of the IT Systems fail to operate properly or become disabled even for a brief period, we could miss a critical filing period or lose control of customer data, either of which could result in financial loss, a disruption of our business, liability to customers, or regulatory intervention. Remote and hybrid working arrangements at our company (and at many third-party providers) increase the risks associated with our IT Systems due to the challenges associated with managing remote computing assets and security vulnerabilities that are present in many non-corporate and home networks.\n\n\nLike other software providers, we operate with our customers on a shared responsibility model. In most instances, our customers administer access to the data of their employees. While we provide certain security and data management capabilities and encourage customers and their employees to implement certain security controls in connection with use of our products and services, they may not implement controls sufficient to protect their confidential information. To the extent they do not take advantage of those capabilities and implement sufficient security controls, customers and their employees may suffer a cybersecurity attack on their own systems and allow a malicious actor access to confidential information held in our IT Systems. Even if such a breach is unrelated to our security programs or practices, it could cause us reputational harm and require us to incur significant costs to adequately assess and respond.\n\n\nWe have acquired and continue to acquire companies with cybersecurity vulnerabilities and/or unsophisticated security measures built into their products and services, which exposes us to additional cybersecurity, operational, and financial risks, and have and will continue to demand significant resources to attempt to mitigate those risks.\n\n\nAs we retire our legacy products like our bureau payroll services or sunset certain acquired products, we decrease investments in maintaining those systems, which creates the potential for a security breach of those systems.\n\n\nFor example, in 2009, an alleged criminal hack into a discontinued U.S. payroll application led to us becoming subject to a 20-year consent order with the U.S. Federal Trade Commission (“FTC”) that became final in June 2011. In connection with the order, we are required to have portions of our security program, which apply to certain segments of our U.S. business,\n \n\n\n \n17\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\nreviewed by an independent third party on a biennial basis. Maintaining, updating, monitoring, and revising an information security program in an effort to ensure that it remains reasonable and appropriate in light of changes in security threats, changes in technology, and security vulnerabilities that arise from legacy systems is time-consuming and complex, and is an ongoing effort. While we have taken and continue to take steps to ensure compliance with the consent order, if we are determined to be out of compliance with the consent order, or if any new breaches of security occur, the FTC may take enforcement actions or other parties may initiate a lawsuit. Any such resulting fines and penalties could have a material adverse effect on our liquidity and financial results, and any reputational damage therefrom could adversely affect our relationships with our existing customers and our ability to attain new customers.\n\n\nBecause we make extensive use of third party suppliers and service providers in our IT Systems, such as cloud services that support our internal and customer-facing operations, successful cyberattacks that disrupt or result in unauthorized access to third party IT systems can materially impact our operations and financial results. We and certain of our third-party providers regularly experience cyberattacks and other incidents, and we expect such attacks and incidents to continue in varying degrees. For example, in July 2024, a software update by CrowdStrike Holdings, Inc., a cybersecurity technology company, caused widespread crashes of Windows systems into which it was integrated, including certain Windows systems that may have been used by our third-party service providers, vendors, and customers. As of the date of this report, we have not experienced any material impacts as a result of the CrowdStrike software update. Though we rely on a third-party service to monitor suppliers and service providers for potential cybersecurity incidents, such monitoring itself cannot prevent such incidents and we could, in the future, experience similar third-party software-induced interruptions to our operations. Any adverse impact to the availability, integrity or confidentiality of our IT Systems could result in legal claims or proceedings (such as class actions), regulatory investigations and enforcement actions, fines and penalties, negative reputational impacts that cause us to lose existing or future customers, and/or significant incident response, system restoration or remediation and future compliance costs. Any or all of the foregoing could materially adversely affect our business, results of operations, and financial condition. Finally, we cannot guarantee that any costs and liabilities incurred in relation to an attack or incident will be covered by our existing insurance policies or that applicable insurance will be available to us in the future on economically reasonable terms or at all.\n\n\nAny failure to protect our intellectual property rights could impair our ability to protect our proprietary technology and our brand.\n\n\nOur success and ability to compete depend in part upon our intellectual property. We primarily rely on copyright, trade secret, and trademark laws; trade secret protection; internal policies and technical controls; and confidentiality, non-disclosure or license agreements with our employees, customers, partners, and others to protect our intellectual property rights. However, the steps we take to protect our intellectual property rights may be ineffective or inadequate. In addition, use of AI tools may result in the release of confidential or proprietary information which could limit our ability to protect, or prevent us from protecting, our intellectual property rights.\n\n\nIn order to protect our intellectual property rights, we have and will likely be required to continue to spend significant resources to monitor and to protect these rights. Litigation brought to protect and to enforce our intellectual property rights could be costly, time-consuming, and distracting to management, with no guarantee of success, and could result in the impairment or loss of portions of our intellectual property. Furthermore, our efforts to enforce our intellectual property rights may be met with defenses, counterclaims, and countersuits attacking the validity and enforceability of our intellectual property rights. Our failure to secure, to protect, and to enforce our intellectual property rights could have a material adverse effect on our business, financial condition, and results of operations.\n\n\nWe may be sued by third parties for alleged infringement of their proprietary rights which could have a material adverse effect on our business.\n \n\n\nThere is considerable intellectual property development activity in our industry. Third parties, including our competitors, may own or claim to own intellectual property relating to our service offerings or brand and may claim that we are infringing their intellectual property rights. Additionally, as we expand our use of AI, there is uncertainty regarding intellectual property ownership and license rights, in particular with respect to AI tools that rely on large language models to generate content, and we may become subject to similar claims of infringement. We may be found to be infringing upon such rights, even if we are unaware of their intellectual property rights. Any claims or litigation could cause us to incur significant expenses and, if successfully asserted against us or if we decide to settle, could require that we pay substantial damages or ongoing royalty payments, obtain licenses, modify applications, prevent us from offering our services, or require that we comply with other unfavorable terms. We may also be obligated to indemnify our customers, vendors, or partners in connection with any such\n \n\n\n \n18\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\nclaim or litigation. Even if we were to prevail in such a dispute, any litigation regarding our intellectual property could be costly and time consuming.\n\n\nThe use of open source software in our applications may expose us to additional risks and harm our intellectual property rights. \n \n \n\n\nSome of our applications include software covered by open source licenses. From time to time, there have been claims challenging the ownership of open source software against companies that incorporate such software into their products or applications. The terms of various open source licenses have not been interpreted by U.S. courts, and there is a risk that such licenses could be construed in a manner that imposes unanticipated conditions or restrictions on our ability to market our applications. By the terms of certain open source licenses, we could be required to release the source code of our proprietary software and to make our proprietary software available under open source licenses if we combine our proprietary software with open source software in a certain manner. In the event that portions of our proprietary software are determined to be subject to an open source license, we could be required to publicly release the affected portions of our source code, to re-engineer all or a portion of our technologies, or otherwise to be limited in the licensing of our technologies, each of which could reduce or eliminate the value of our technologies and services. Some open source software may include AI capabilities or other software that incorporates or relies on AI, or may have been created, in whole or in part, by AI. The use of such software may expose us to risks as the intellectual property ownership and license rights, including copyright, of AI software and tools, has not been fully interpreted by courts or been fully addressed by regulation. In addition to risks related to license requirements, usage of open source software can lead to greater risks than use of third party commercial software, as open source licensors generally do not provide warranties or controls on the origin of the software. Many of the risks associated with usage of open source software cannot be eliminated and could have a material adverse effect on our business, financial condition, and results of operations.\n\n\nRisks Related to Legal and Regulatory Matters\n\n\nOur solutions and our business are subject to a variety of laws and regulations, including those regarding privacy, data protection, and information security. Any failure by us or our third party service providers, as well as the failure of our services, to comply with these laws could have a material adverse effect on our business, financial condition, and results of operations.\n\n\nFailure to comply with privacy, data protection, and information security laws and regulations could have a material adverse effect on our business, results of operations or financial condition, or have other adverse consequences. These laws, which are not uniform, govern the collection, storage, hosting, transfer (including in some cases, the transfer outside the country of origin), use, disclosure, security, retention, and destruction of personal information; they require us to give notice to individuals of privacy practices; give individuals certain access and correction rights with respect to their personal information; oversee third parties whom we engaged to process data on our behalf; and regulate the use or disclosure of personal information for secondary purposes such as marketing. Under certain circumstances, some of these laws require us to provide notification to affected individuals, clients, data protection authorities and/or other regulators in the event of a data breach.  The number of related laws and regulations we are subject to continues to increase as we enter new markets in Europe, Asia Pacific, and Latin America, and as we continue our entry into the consumer space through our Dayforce Wallet product and Dayforce Flex Work service. Some of these laws we are subject to include, but are not limited to, the European Union (the “EU”) General Data Protection Regulation, the California Consumer Protection Act and its successor, the California Privacy Rights Act, Canada’s Personal Information Protection and Electronic Documents Act, the Philippines Data Privacy Act, Australia’s Privacy Act 1988, and India’s Digital Personal Data Protection Act.\n\n\nRestrictions on transfers of personal information from one geography to another continue to evolve. In many cases, these restrictions apply not only to third-party transactions, but also to transfers of information among the Company and its subsidiaries.  While the Company currently leverages contractual data transfer mechanisms and certification to the EU-US Data Privacy Framework to enable cross-border transfers, if such mechanisms cease to be sufficient to legitimize data transfers, we may face significant costs to our business associated with implementing new data transfer mechanisms or we may have to amend certain of our business practices to eliminate such transfers. Further, our ability, or the ability of our third party service providers, to comply with these laws and regulations and ensure data protection and information security may be impacted as the increased use of AI in our own HCM technology and by third parties whom we engage to process data on our behalf, if not properly managed and governed, could result in the unintended use, exposure, or loss of our own sensitive data or sensitive customer data, including through the inadvertent introduction of such data to AI agents existing in commercially acquired or other third-party applications that exist outside of our own firewalls. We may also be unable to\n \n\n\n \n19\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\nensure that appropriate governance oversight at our third party partners is being maintained, particularly with respect to the use of AI in their systems.\n\n\nEnforcement actions and investigations by regulatory authorities, as well as litigation claims brought by private citizens, related to data security incidents and privacy violations continue to increase.  Moreover, there is little if any interpretive guidance for some of the above-mentioned laws, and there are risks that regulators or courts may interpret these laws differently than us while exercising jurisdiction over us. The evolving patchwork of privacy legislation and potentially conflicting interpretations that we are or may be subject to may also make it more operationally burdensome to comply with such interpretations. The future enactment of more restrictive laws, rules, or regulations, including those pertaining to the use or development of AI with respect to data protection and security, could have a material adverse impact on us through increased costs or restrictions on our businesses. Moreover, we may be subject to future enforcement actions, investigations, or litigation, including potential future civil rights claims stemming from an alleged failure to adequately address legal risks or regulations relating to the use of AI in our applications or alleged bias in our AI tools in violation of anti-discrimination laws,  which could result in significant regulatory penalties and legal liability and damage our reputation. Restrictions on cross border data flows and data residency requirements may negatively impact our clients’ and our own ability to transfer personal information to the U.S. and other countries as part of our provision of services, and in support of our own operations, potentially impacting revenues. In addition, data security events and concerns about privacy abuses by other companies are changing consumer and social expectations for enhanced privacy and data protection. As a result, even the perception of noncompliance, whether or not valid, may damage our reputation. These regulatory requirements and considerations may also impose burdensome and costly requirements on our ability to leverage data to develop or improve our products, services, and management of our business, and potentially result in brand or reputational harm.\n\n\nCustomers depend on our solutions to assist them to comply with applicable laws, which requires us and our third party providers to constantly monitor applicable laws and to make applicable changes to our solutions. If our solutions have not been updated to enable the customer to comply with applicable laws or we fail to update our solutions on a timely basis, it could have a material adverse effect on our business, financial condition, and results of operations.\n\n\nCustomers use our solutions to assist them to comply with payroll, HR, and other applicable laws for which the solutions are intended for use. We and our third party providers must monitor all applicable laws and as such laws expand, evolve, or are amended in any way, and when new regulations or laws are implemented, we may be required to modify our solutions to assist our customers to comply with such new regulations or laws, which requires an investment of our time and resources. We are also reliant on our third party providers to modify the solutions that they provide to our customers as part of our solutions to comply with changes to such laws and regulations. The number of laws and regulations that we are required to monitor has and will continue to increase as we expand both the geographic regions in which the solutions are offered and the types of products we offer to customers. These risks have become exacerbated as we expand by acquisition and are most acute in the period following the acquisition as we integrate the acquired business and its systems. In the event our solutions fail to assist a customer to comply with applicable laws, we are subject to negative customer experiences, harm to our reputation or loss of customers, claims for any fines, penalties or other damages suffered by our customer, and other financial harm, including fines, penalties, or other damages suffered by us directly.\n\n\nRegulatory requirements placed on our software and services could impose increased costs on us, delay or prevent our introduction of new products and services, and impair or prevent the function or value of our existing products and services.\n\n\nOur products and services are subject to increasing and evolving regulatory requirements, and as these requirements proliferate, we are required to change or adapt to comply. Changing regulatory requirements might render our services obsolete or might block us from developing new products and services or the continuation of existing services. This might in turn impose additional costs upon us to comply or to further develop our products and services. Changing regulatory requirements can make introduction of new services more costly or more time-consuming than we currently anticipate and could even prevent introduction by us of new services or cause the continuation of our existing services to become more costly. For example, development of our Dayforce Flex Work platform requires us to comply with numerous complex regulatory regimes, which imposes additional costs on us.\n\n\n \n20\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\nFailure to comply with anti-corruption laws and regulations, economic and trade sanctions, anti-money laundering laws and regulations, and similar laws could have a materially adverse effect on our reputation, results of operations or financial condition, or have other adverse consequences.\n\n\nRegulators worldwide are exercising heightened scrutiny with respect to anti-corruption, economic and trade sanctions, and anti-money laundering laws and regulations. Such heightened scrutiny has resulted in more aggressive investigations and enforcement of such laws, more burdensome regulations, and more expansive application of those regulations, any of which could have a material adverse impact on our business. We are growing our business throughout the world, including in numerous developing economies where companies and government officials are more likely to engage in business practices that are prohibited by domestic and foreign laws and regulations, including the U.S. Foreign Corrupt Practices Act. Such laws generally prohibit improper payments or offers of payments to foreign government officials and leaders of political parties, and in some cases, to other persons, for the purpose of obtaining or retaining business. We are also subject to economic and trade sanctions programs, including those administered by the U.S. Treasury Department’s Office of Foreign Assets Control, which prohibit or restrict transactions or dealings with specified countries, their governments, and, in certain circumstances, their nationals, and with individuals and entities that are specially designated, including narcotics traffickers and terrorists or terrorist organizations, among others. In addition, some of our businesses and entities in the U.S., Canada and other countries in which we operate are and will continue to be subject to anti-money laundering laws and regulations. These laws require us to develop and implement risk-based anti-money laundering programs, report large cash transactions and suspicious activity, and maintain transaction records. These laws and regulations include the Bank Secrecy Act of 1970 as amended by the USA PATRIOT Act of 2000 (the “BSA”), that requires banks and money services businesses, among others, to develop and implement risk-based anti-money laundering programs, report large cash transactions and suspicious activity, and maintain transaction records.\n\n\nWe have implemented policies and procedures to monitor and address compliance with applicable anti-corruption, economic and trade sanctions and anti-money laundering laws and regulations, and we are continuously in the process of reviewing, upgrading, and enhancing certain of our policies and procedures. Implementing upgrades and enhancements to our compliance programs is costly and can in some cases impact the sales and implementation processes as our business is required to gather and screen additional information from the third parties with which we do business. There can be no assurance that our employees, consultants, or agents will not take actions in violation of our policies for which we may be ultimately responsible, or that our policies and procedures will be adequate or will be determined to be adequate by regulators. Any violations of applicable anti-corruption, economic and trade sanctions or anti-money laundering laws or regulations could limit certain of our business activities until they are satisfactorily remediated and could result in civil and criminal penalties, including fines, which could damage our reputation and have a material adverse effect on our results of operation or financial condition. Further, bank regulators, including the OCC, which now regulates the DNTB, continue to impose additional and stricter requirements on banks to ensure they are meeting their BSA obligations, and banks are increasingly viewing money services businesses, as a class, to be higher risk customers for money laundering. As a result, our banking partners that assist in processing our money movement transactions may limit the scope of services they provide to us or may impose additional material requirements on us. Further, bank regulators, including the OCC, may increase regulatory investigations or governmental oversight to ensure we are meeting our BSA obligations. These regulatory restrictions on banks and changes to banks’ internal risk-based policies and procedures may result in a decrease in the number of banks that may do business with us, may require us to materially change the manner in which we conduct some aspects of our business, may decrease our revenues and earnings and could have a material adverse effect on our results or financial condition.\n\n\nLitigation and regulatory investigations aimed at us or resulting from actions of our predecessor may result in significant financial losses and harm to our reputation.\n\n\nWe face risk of litigation, regulatory investigations, and similar actions in the ordinary course of our business, including the risk of lawsuits and other legal actions relating to breaches of contractual obligations, tortious claims, employment and labor law matters, including matters that may arise related to our Dayforce Flex Work employees, securities law claims, or claims related to erroneous transactions or breach of other laws or regulations from customers, stockholders, vendors, employees or other third parties which could result in fines, penalties, interest, loss of revenue, increased expense, or other damages. In particular, our clients have sought to pursue indemnification claims against us where they have been subject to wage compliance, payroll fraud, and data privacy claims, and as we expand our Dayforce Flex Work service, we may face litigation related to the \"shifts” employees we employ as part of that service. Litigation might result in substantial costs and may divert management’s attention and resources, which might materially harm our business, overall financial condition, and operating results. We may also be subject to various regulatory inquiries, such as information requests, subpoenas, and book and records examinations, from regulators and other authorities in the geographic markets in which we operate. A substantial\n \n\n\n \n21\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\nliability arising from a lawsuit judgment or settlement or a significant regulatory action against us or a disruption in our business arising from adverse adjudications in proceedings against our directors, officers, or employees could have a material adverse effect on our business, financial condition, and results or operations. Further, insurance might not cover such claims, might not provide sufficient payments to cover all the costs to resolve one or more such claims and might not continue to be available on terms acceptable to us. A claim brought against us that is uninsured or underinsured could result in unanticipated costs, thereby harming our operating results and leading analysts or potential investors to lower their expectations of our performance, which could reduce the trading price of our stock or potentially result in a lawsuit related to the reduced trading price of our stock.\n\n\nAdditionally, we are subject to claims and investigations as a result of our predecessor, Control Data Corporation (“CDC”), Ceridian Corporation, and other former entities for whom we are successor-in-interest with respect to assumed liabilities. For example, in September 1989, CDC became party to an environmental matters agreement with Seagate Technology plc (“Seagate”) related to groundwater contamination on a parcel of real estate in Omaha, Nebraska sold by CDC to Seagate. In February 1988, CDC entered into an arrangement with Northern Engraving Corporation and the Minnesota Pollution Control Agency in relation to groundwater contamination at a site in Spring Grove, Minnesota. We have also been subject to asbestos related claims for former CDC employees. Although we are fully reserved for these groundwater contamination liabilities, and partially insured for the asbestos claims, we cannot be certain if additional claims, investigations, or liabilities related to such predecessor companies will surface.\n\n\nAny actual or perceived failure to comply with evolving legal and regulatory frameworks around the development and use of AI could adversely affect our business, results of operations, and financial condition.\n\n\nOur business increasingly relies on AI, including large language models, machine learning, algorithms, and increasingly automated decision making to improve our offerings in addition to driving productivity and efficiency improvements in our own workforce. For example, our Dayforce Co-Pilot module leverages a large language model to help automate certain repetitive tasks and serve as a personalized assistant for customers’ employees. In addition, a proprietary machine learning algorithm is offered as part of the Dayforce recruiting module to grade job candidates. Further, our customer support organization leverages an AI tool in order to drive productivity gains into that organization. The legal and regulatory framework around the development and use of these existing and emerging technologies is rapidly evolving, and many federal, state, local, and foreign government bodies and agencies have introduced or are currently considering additional laws and regulations. As a result, implementation standards and enforcement practices are likely to remain uncertain for the foreseeable future, and we cannot yet determine the impact future laws, regulations, standards, or perception of their requirements may have on our business. In addition, it is unknown how customers, customers’ employees, and the broader public will react to the use of AI if new regulatory frameworks are adopted.\n\n\nDayforce is actively monitoring the development of compulsory and voluntary frameworks that apply to developers, deployers, or users of AI in the jurisdictions in which we operate. Dayforce AI systems undergo rigorous risk assessments, continuous monitoring, and adherence to data protection and safety measures in an effort to ensure responsible and trustworthy AI deployment and keep compliant with evolving regulatory requirements. For example, in November 2024, we became signatories to the Ottawa Statement on Generative AI and the Government of Canada’s AI Code of Conduct on the Responsible Development and Management of Advance Generative AI Systems (the “Code”). While these rules are still under development, these regulations, as well as comparable measures arising in the United States and the European Union, are likely to regulate our ability to develop and implement AI-enhanced tools on our platform.\n\n\nAny of the foregoing, together with developing guidance or decisions in this area, may affect our use of AI and our ability to provide and improve our services, require additional compliance measures and changes to our operations and processes, and result in increased compliance costs and potential increases in civil claims against us. In addition, customers or customers’ employees may decide to not purchase or use AI in our offerings due to regulatory or compliance concerns. Any actual or perceived failure to comply with evolving regulatory frameworks around the development and use of AI, machine learning, and automated decision making could adversely affect our business, results of operations, and financial condition.\n\n\nRisks Related to Our Indebtedness\n\n\nOur outstanding indebtedness could have a material adverse effect on our financial condition and our ability to operate our business, and we may not be able to generate sufficient cash flows to meet our debt service obligations.\n\n\nOur obligations under the 2024 Senior Secured Credit Facility are secured by first priority security interests in substantially all of our assets and the domestic subsidiary guarantors, subject to permitted liens and certain exceptions. Our outstanding\n \n\n\n \n22\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\nindebtedness and any additional indebtedness we incur may have important consequences for us, including, without limitation, that:\n\n\n•\nwe may be required to use a substantial portion of our cash flow to pay the principal of and interest on our indebtedness;\n\n\n•\nour indebtedness and leverage may increase our vulnerability to adverse changes in general economic and industry conditions, as well as to competitive pressures;\n\n\n•\nour ability to obtain additional financing for working capital, capital expenditures, acquisitions and for general corporate and other purposes may be limited;\n\n\n•\nour indebtedness may expose us to the risk of increased interest rates because certain of our borrowings, including and most significantly our borrowings under our 2024 Senior Secured Credit Facility, are at variable rates of interest; and\n\n\n•\nour indebtedness may prevent us from taking advantage of business opportunities as they arise or successfully carrying out our plans to expand our business.\n\n\nUnder the terms of the agreements governing our debt facilities, we are required to comply with specified operating covenants and, under certain circumstances, a financial covenant applicable to the 2024 Revolving Credit Facility, which may limit our ability to operate our business as we otherwise might operate it. If not cured, an event of default under our 2024 Senior Secured Credit Facility could result in any amounts outstanding, including any accrued interest and unpaid fees, becoming immediately due and payable, which would require us, among other things, to seek additional financing in the debt or equity markets, to refinance or restructure all or a portion of our indebtedness, to sell selected assets, and/or to reduce or to delay planned capital or operating expenditures. Such measures might not be sufficient to enable us to service our debt, and any such financing or refinancing might not be available on economically favorable terms or at all. If we are not able to generate sufficient cash flows to meet our debt service obligations or are forced to take additional measures to be able to service our indebtedness, it could have a material adverse effect on our business, financial condition, and results of operations.\n \n\n\nConversion of our Convertible Senior Notes issued under the Indenture may adversely affect our financial condition and results of operations.\n \n\n\nUnder certain circumstances, noteholders may convert their Convertible Senior Notes at their option prior to the scheduled maturities. Upon conversion of the Convertible Senior Notes, we will be obligated to make cash payments in an amount no less than the principal amount being converted, and any excess of the conversion value over the principal amount will be settled, at the Company’s election, in cash or shares of the Company’s common stock. In addition, noteholders will have the right to require us to repurchase their Convertible Senior Notes upon the occurrence of a fundamental change at a repurchase price equal to 100% of the principal amount of the Convertible Senior Notes to be repurchased, plus accrued and unpaid interest, if any, to, but not including, the fundamental change repurchase date (as defined in the Indenture). There is a risk that we may not have enough available cash or be able to obtain financing at the time we are required to make repurchases of Convertible Senior Notes surrendered therefor or Convertible Senior Notes being converted. Our failure to repurchase Convertible Senior Notes when the Indenture requires the repurchase or to pay any cash payable on future conversions of the Convertible Senior Notes as required by the Indenture would constitute a default under the Indenture. A default under the Indenture or the fundamental change itself could also lead to a default under agreements governing our future indebtedness. If the repayment of the related indebtedness were to be accelerated after any applicable notice or grace periods, we may not have sufficient funds to repay the indebtedness and repurchase the Convertible Senior Notes or make cash payments upon conversions thereof. In addition, even if noteholders do not elect to convert their Convertible Senior Notes, we could be required under applicable accounting rules to reclassify all or a portion of the outstanding principal of the Convertible Senior Notes as a current, rather than long-term, liability, which would result in a material reduction of our net working capital.\n\n\nOur debt may be downgraded, which could have a material adverse effect on our business, financial condition, and results of operations.\n\n\nA reduction in the ratings that rating agencies assign to our debt may negatively impact our access to the debt capital markets and increase our cost of borrowing, which could have a material adverse effect on our business, financial condition, and results of operations.\n\n\n \n23\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\nVolatility and weakness in bank and capital markets may adversely affect credit availability, liquidity, and related financing costs for us.\n\n\nDisruptions in the financial markets can also adversely affect our lenders, insurers, customers, and other counterparties. During periods of volatile credit markets, there is risk that financial institutions, even those with strong balance sheets and sound lending practices, could fail, no longer participate in financial offerings, or refuse to honor their existing legal commitments and obligations to us, including but not limited to, extending credit up to the maximum amount permitted by the 2024 Revolving Credit Facility or purchasing eligible receivables under our Receivables Purchase Agreement. If our financial counterparties are unable to fund borrowings under their revolving credit commitments or investments under their Receivables Purchase Agreement, or we are unable to borrow or refinance our debt in the financial markets, it could substantially increase our cost of borrowing or be difficult to obtain sufficient funding to execute our business strategy or to meet our liquidity needs, which could have a material adverse effect on our business, financial condition, and results of operations.\n\n\nAspects of the Capped Calls may not operate as planned and may affect the value of the Convertible Senior Notes and our common stock, and we are subject to counterparty credit risk with respect to the Capped Calls.\n\n\nIn connection with the pricing of the Convertible Senior Notes, we entered into the Capped Calls. Please refer to \nPart II, Item 8, Note 10, \"Debt\"\n for additional information. The Capped Calls are expected generally to reduce the potential dilution to our common stock upon any conversion of the Convertible Senior Notes and/or offset any potential cash payments we are required to make in excess of the principal amount of converted Convertible Senior Notes, as the case may be, with such reduction and/or offset subject to a cap. The Capped Calls are complex transactions that are not part of the terms of the Convertible Senior Notes and may not operate as planned. If the Capped Calls do not operate as we intend, it may have an effect on the price of the Convertible Senior Notes or our common stock.\n\n\nThe option counterparties or their respective affiliates may modify their hedge positions by entering into or unwinding various derivatives with respect to our common stock and/or purchasing or selling our common stock or other securities of ours in secondary market transactions following any conversion of the Convertible Senior Notes, any repurchase of the Convertible Senior Notes by us on any fundamental change repurchase date, any redemption date, or any other date on which the Convertible Senior Notes are retired by us, in each case if we exercise our option to terminate the relevant portion of the Capped Calls. This activity could cause or avoid an increase or a decrease in the market price of our common stock or the Convertible Senior Notes, which could affect the ability of a noteholder to convert the Convertible Senior Notes and, to the extent the activity occurs during any observation period related to a conversion of Convertible Senior Notes, could affect the number of shares of common stock, if any, and value of the consideration that a noteholder will receive upon conversion of the Convertible Senior Notes. If any such Capped Call fails to become effective, the option counterparties or their respective affiliates may unwind their hedge positions with respect to our common stock, which could adversely affect the value of our common stock and the value of the Convertible Senior Notes. The option counterparties are financial institutions, and we are subject to the risk that they might default under the Capped Calls. Our exposure to the credit risk of the option counterparties is not secured by any collateral. If an option counterparty becomes subject to insolvency proceedings, we will become an unsecured creditor in those proceedings with a claim equal to our exposure at that time under our transactions with that option counterparty. Our exposure will depend on many factors, but, generally, the increase in our exposure will be correlated with increases in the market price or the volatility of our common stock. In addition, upon a default by an option counterparty, we may suffer adverse tax consequences and more dilution than we currently anticipate with respect to our common stock. We can provide no assurances as to the financial stability or viability of any option counterparty.\n\n\nRisks Related to Ownership of Our Common Stock\n\n\nThe price of our common stock may be volatile, and investors may lose all or part of their investment.\n\n\nThe market price and volume of our common stock trading has experienced, and may continue to experience, wide fluctuations and volatility. Factors that may impact our performance and market price include those discussed elsewhere in this “Risk Factors” section of this Annual Report on Form 10-K and others such as: market factors such as economic recession or monetary policy actions by central banking authorities, announcement or filing with the SEC by us or our competitors of acquisitions, business plans or commercial relationships as well as new services; any major change in our senior management or board of directors; sales, or anticipated sales, of our stock, including sales by our officers, directors, and significant stockholders; repurchases of our common stock under our share repurchase program or the decision to terminate or suspend any repurchases; issuance of new, negative, or changed securities analysts’ reports or\n \n\n\n \n24\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\nrecommendations or estimates; investor perceptions of us and the industries in which we or our customers operate; and threatened or actual litigation and governmental investigations.\n \n\n\nThese and other factors may cause the market price and demand for shares of our common stock to fluctuate substantially, which may limit or prevent investors from readily selling their shares of common stock and may otherwise negatively affect the liquidity of our common stock. In addition, securities class action litigation has often been instituted against companies following periods of volatility in the overall market and in the market price of a company’s securities. Securities litigation against us, regardless of the merits or outcome, could result in substantial costs, damage to our reputation, and divert the time and attention of our management from our business, which could have a material adverse effect on our business, financial condition, and results of operations.\n \n\n\nThe issuance of additional stock, including common stock issued upon conversion of our Convertible Senior Notes, will dilute all other stockholders.\n\n\nThe issuance of additional stock in connection with acquisitions, financings, our equity incentive plans, our Convertible Senior Notes, or otherwise will dilute all other stockholders. Our certificate of incorporation authorizes us to issue up to five hundred million shares of common stock and up to ten million shares of preferred stock with such rights and preferences as may be determined by our board of directors. Subject to compliance with applicable rules and regulations, we may issue all of these shares that are not already outstanding without any action or approval by our stockholders. We intend to continue to evaluate strategic acquisitions or opportunities in the future. We may pay for such acquisitions or opportunities, in part or in full, through the issuance of additional equity securities. Further, the conversion of some or all of the Convertible Senior Notes will dilute the ownership interests of existing stockholders to the extent we deliver shares of our common stock upon conversion of any of the Convertible Senior Notes.\n\n\nOur share repurchase program may increase the volatility of the market price of our stock and adversely affect our liquidity. Further, we may not realize the anticipated long-term stockholder value of our share repurchase program.\n \n\n\nIn July 2024, we announced that our board of directors approved a share repurchase program authorizing the purchase of up to $500 million of our issued and outstanding common stock. The authorization does not obligate us to repurchase any specific dollar amount or number of shares, there is no expiration date for the authorization, and the repurchase program may be modified, suspended, or terminated at any time and for any reason. Any future announcement of a termination or suspension of the program, or our decision not to utilize the full authorized repurchase amount under the program, may reduce investor confidence and/or result in a decrease in the market price of our shares.\n\n\nThe existence of the repurchase program could cause our stock price to trade higher than it otherwise would and could potentially reduce the market liquidity for our stock. The repurchase program may not enhance long-term stockholder value because the market price of our common stock may decline below the levels at which we repurchased shares. Additionally, short-term stock price fluctuations could reduce the number or amount of shares we may ultimately repurchase pursuant to the program.\n\n\nRepurchasing our common stock will reduce the amount of cash we have available to fund working capital, repayment of debt, capital expenditures, strategic acquisitions or business opportunities, and other general corporate purposes. The actual timing, number, and value of shares repurchased will depend on various factors, including the market price of our common stock, trading volume, general market conditions, and other corporate and economic considerations.\n\n\nBecause we do not intend to pay cash dividends in the foreseeable future, investors may not receive any return on investment unless they are able to sell common stock for a price greater than the purchase price.\n\n\nWe have never declared nor paid cash dividends on our common stock. We currently intend to retain any future earnings to finance the operation and expansion of our business, and we do not expect to declare or to pay any dividends in the foreseeable future. Consequently, stockholders must rely on sales of their common stock after price appreciation, which may never occur, as the only way to realize any future gains on their investment. There is no guarantee that shares of our common stock will appreciate in value or even maintain the price at which investors have purchased their shares.\n\n\n \n25\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\nAnti-takeover protections in our certificate of incorporation, our bylaws, or our contractual obligations, in addition to regulatory notices or approvals, may discourage or prevent a takeover of our company, even if an acquisition would be beneficial to our stockholders.\n\n\nProvisions contained in our certificate of incorporation and bylaws, as well as provisions of Delaware law, could delay or make it more difficult to remove incumbent directors or could impede a merger, takeover, or other business combination involving us or the replacement of our management, or discourage a potential investor from making a tender offer for our common stock, which, under certain circumstances, could reduce the market value of our common stock, even if it would benefit our stockholders.\n\n\nIn addition, under the agreements governing our credit facilities, a change of control would cause us to be in default or could trigger dilutive or additional expenses. For example, in the event of a change of control default, the administrative agent under our credit facilities would have the right (or, at the direction of lenders holding a majority of the loans and commitments under our credit facilities, the obligation) to accelerate the outstanding loans and to terminate the commitments under our credit facilities, and if so accelerated, we would be required to repay all of our outstanding obligations under our credit facilities.\n\n\nFurther, certain provisions in the Convertible Senior Notes and the Indenture could increase the cost of acquiring us or otherwise discourage a third party from acquiring us or removing incumbent management, including in a transaction that noteholders or holders of our common stock may view as favorable.\n\n\nFinally, we own and operate the DNTB, and as such, we are subject to U.S. regulatory oversight by the OCC. OCC regulations require certain notices and other filings to be made in connection with a change of control, which could increase the costs associated with acquiring us, and delay or deter a takeover or acquisition.\n\n\nGeneral Risk Factors\n \n\n\nOur failure to maintain effective internal control over financial reporting in accordance with Section 404 of the Sarbanes-Oxley Act could have a material adverse effect on our business, financial condition, and results of operations.\n\n\nAs a public company, we are required to design and maintain proper and effective internal controls over financial reporting and to report any material weaknesses in such internal controls. Section 404 of the Sarbanes-Oxley Act of 2002 requires that we evaluate and determine the effectiveness of our internal controls over financial reporting and provide a management report on the internal controls over financial reporting, which must be attested to by our independent registered public accounting firm.\n\n\nInternal controls related to the operation of technology systems are critical to maintaining adequate internal control over financial reporting. We have previously identified and reported material weaknesses, for example, the material weakness we disclosed in our Annual Report on Form 10-K for the fiscal year ended December 31, 2023 relating to ineffective general information technology controls related to user access and change management over the information technology (“IT”) systems supporting our Canada Trust and Canada Powerpay revenue processes. As a result, management concluded that our internal control over financial reporting was not effective as of December 31, 2023. As of December 31, 2024, this material weakness was remediated, and we have concluded that our internal control over financial reporting was effective. However, we recognize that maintaining adequate internal control over financial reporting will continue to require significant management attention and expense, and we may identify other material weaknesses in future periods. If we were to have another material weakness in our internal controls over financial reporting, we may not detect errors on a timely basis and our financial statements may be materially misstated. There could also be a negative reaction in the financial markets due to a loss of investor confidence in us and the reliability of our consolidated financial statements, which could have a material adverse effect on our business, financial condition, and results of operations\n.\n\n\nAdverse economic and market conditions could affect our business, operating results, or financial condition.\n\n\nOur business depends on the overall demand for HCM applications and on the economic health of our current and prospective clients. If economic conditions in the U.S., Canada, or in global markets deteriorate, clients may cease their operations, reduce headcount, delay or reduce their spending on HCM and other outsourcing services or attempt to renegotiate their contracts with us. In addition, global and regional macroeconomic developments, such as increased unemployment, decreased income, uncertainty related to future economic activity, reduced access to credit, increased interest rates, inflation, volatility in capital markets, and decreased liquidity, among other possible factors, could negatively affect our ability to conduct business. An economic decline could result in reductions in sales of our applications, decreased revenue, longer sales cycles, slower adoption of new technologies, and increased price competition, any of which could\n \n\n\n \n26\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\nadversely affect our business, operating results, or financial condition. In addition, HCM spending levels may not increase following any recovery.\n\n\nThe application of tariffs on goods to countries in which we operate, including, for example, Canada, China, Mexico, and the U.S., has and will impact our business operations and ability to export goods, such as our time clocks. Any expansion of tariffs to cover services like Dayforce would have a significant impact on how we develop, distribute and monetize Dayforce, and therefore could adversely affect our operations results or financial condition. Moreover, the expansion of export controls generally could have an impact on our ability to export our software and mobile applications.\n\n\nIn recent years, there have been several instances when there has been uncertainty regarding the ability of the U.S. Congress and the U.S. President collectively to reach agreement on federal budgetary and spending matters. A period of failure to reach agreement on these matters, particularly if accompanied by an actual or threatened government shutdown, may have an adverse impact on the U.S. economy. Additionally, because certain of our clients rely on government resources to fund their operations, a prolonged government shutdown may affect such clients’ ability to make timely payments to us, which could adversely affect our operations results or financial condition.\n\n\nFurther, as part of our payroll and tax filing application, we collect and then remit client funds to taxing authorities and accounts designated by our clients. During the interval between receipt and disbursement, we may invest such funds in money market funds, demand deposit accounts, certificates of deposit, U.S. treasury securities and commercial paper. These investments are subject to general market, interest rate, credit and liquidity risks, and such risks may be exacerbated during periods of unusual financial market volatility. Any loss of or inability to access such funds could have an adverse impact on our cash position and results of operations and could require us to obtain additional sources of liquidity, which may not be available on terms that are acceptable to us, if at all.\n\n\nOur quarterly results of operations have and may continue to fluctuate significantly and may not fully reflect the underlying performance of our business.\n\n\nOur quarterly results of operations, including the levels of our revenues, gross margin, profitability, cash flow, and deferred revenue, have varied and may vary significantly in the future, and period-to-period comparisons of our results of operations may not be meaningful. Accordingly, the results of any one quarter should not be relied upon as an indication of future performance. Our quarterly financial results may fluctuate as a result of a variety of factors, many of which are outside of our control, and as a result, may not fully reflect the underlying performance of our business. These factors include: our ability to attract and retain new and current Cloud customers; changes to services or pricing impacting our customer contracts; seasonal variations in sales of and revenue from our applications, changes to our operating expenses related to the maintenance and expansion of our business including newly acquired businesses, operations, and infrastructure; and general economic, industry, and market conditions, including the addition or loss of employees by our Cloud customers who generally pay on a per-employee, per-month (\"PEPM\") basis, interest rates, and accounting rules.\n\n\nCatastrophic events may disrupt our business and expose us to risks that could adversely affect our business, financial condition, results of operations, and reputation.\n \n\n\nOur business, financial condition, results of operations, access to capital markets and borrowing costs may be adversely affected by a major natural disaster or catastrophic event, including civil unrest, economic recession, geopolitical instability, war, terrorist attack, the effects of climate change, or pandemics or other public health emergencies, and measures taken in response thereto. In the event of a major disaster or event impacting any of our locations or locations where our employees work virtually, we may be unable to continue our operations and may endure system interruptions, reputational harm, delays in our application development, lengthy interruptions in our services, breaches of data security and loss of critical data. These catastrophic events have the potential to disrupt the business of our third-party suppliers, partners, or customers, which could have a material adverse effect on our business, financial condition, and results of operations.\n\n\nFor instance, the COVID-19 pandemic created significant global volatility, uncertainty, and economic disruption. Moving forward, the extent to which other similarly disrupting events will adversely affect our business, operations, and financial results will depend on numerous evolving factors, including developments which are highly uncertain and cannot be predicted, such as the duration and scope of the event, and that affect our ability to sell and to provide our services to our current and future customers, and the ability of our customers to pay for our services or to make us whole for advances of earned net wages and associated tax amounts made on their behalf by us.\n\n\n \n27\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\nOur disclosures and ambitions related to sustainability matters, which include environmental, social, and governance matters, may expose us to risks that could adversely affect our reputation and performance.\n\n\nWe publicly share certain information about our company’s ambitions, programs, and goals on sustainability matters. These disclosures, the goals we have set, or a failure to meet these goals from time to time may generate increased scrutiny of our business that could harm our brand and our reputation. Our ability to achieve our goals related to sustainability matters is subject to numerous risks. We may rely on data and calculations provided by third parties to measure and report our sustainability metrics and if the data input or calculations are incorrect or incomplete, our brand, reputation, and financial performance may be adversely affected. Further, standards for tracking and reporting sustainability matters continue to evolve, and our processes and controls may not always comply with those evolving standards, or may require us to revise our current goals or reported progress in achieving such goals. There has also been a recent notable increase in current and proposed regulations at the state and federal level on publicly traded companies related to sustainability matters, and such expansion of regulation could result in higher associated compliance costs. A failure to fully comply with these new regulatory requirements, or a failure to do so in a timely matter, could have an adverse effect on our business, financial condition, and our perception by key stakeholders.\n\n\nWe operate and are subject to tax in multiple jurisdictions. Audits, investigations, and tax proceedings could have a material adverse effect on our business, results of operations, and financial condition.\n\n\nWe are subject to income and non-income taxes in multiple jurisdictions. Income tax accounting often involves complex issues, and significant judgment is often required in determining our worldwide provision for income taxes. We are regularly subject to tax examinations in these jurisdictions during which the tax authorities may challenge our tax positions. We regularly assess the likely outcomes of these examinations to determine the appropriateness of our tax reserves as well as our future tax liabilities. In addition, the application of withholding tax, value added tax, goods and services tax, sales tax, and other non-income taxes is not always certain, and we may be subject to examinations relating to such withholding or non-income taxes. We believe that our tax positions are reasonable and our tax reserves are adequate to cover any potential liability. However, if any of these tax authorities successfully challenge our positions, we may be liable for additional tax, penalties, and interest in excess of any reserves established, which may have a significant impact on our results and operations and future cash flow.\n\n\nChanges in generally accepted accounting principles in the U.S. could have a material adverse effect on our previously reported results of operations.\n\n\nGenerally accepted accounting principles in the U.S. are subject to interpretation by the Financial Accounting Standards Board (the “FASB”), the SEC, and various bodies formed to promulgate and to interpret appropriate accounting principles. A change in these principles or interpretations could have a significant effect on our previously reported results of operations and could affect the reporting of transactions completed before the announcement of a change. Please refer to \nPart II, Item 8, Note 2, “Summary of Significant Accounting Policies”\n, of this report for our assessment of recently issued and adopted accounting pronouncements.\n\n\n \n28\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements",
    "item1b": "Item 1B. Unresolve\nd Staff Comments.\n \n\n\nNone.\n\n\nI\ntem 1C. Cybersecurity.\nAs an HCM company, we face a multitude of cybersecurity threats from threat actors seeking to access, compromise access, or leverage the data we possess for malicious ends. Review of our information security program, including our cybersecurity policies, standards, and processes, is \nintegrated\n into our Enterprise Risk Management (\"ERM\") program which is based on the COSO Enterprise Risk Management Framework and International Organization for Standardization (\"ISO\") 31000, the two most widely used global standards for ERM.\nOur information security program aligns with recommended practices in security standards issued by ISO, American Institute of Certified Public Accountants (SSAE18), National Institute of Standards and Technology (\"NIST\") and other industry sources. Specifically, we maintain several ISO certifications (ISO 27001, 27701, 27017, 27018, 27036), NIST 800-171 compliance, and SOC 1 and 2 Type 2 reports to comply and adhere to industry standard practices. We have invested in our data security team, information security program, and security environment in an effort to identify, prevent, and mitigate cybersecurity threats and promptly identify and respond to cybersecurity incidents when they occur. Maintaining, monitoring, and updating our information security program to ensure that it remains reasonable and appropriate with respect to changes in the security threat landscape, available technology, security vulnerabilities, and legal and contractual requirements applicable to us, is a continuous effort.\nRisk Management and Strategy\nWe believe that effective cybersecurity depends upon the successful implementation and maintenance of a comprehensive information security program. Deploying suitable security technology, which encompasses analytics and automation, and leveraging the expertise of highly skilled security and risk professionals, is crucial in our strategy. Additionally, we prioritize data governance and data-centric security as integral components of our approach in an effort to ensure compliance, uphold privacy standards, and safeguard customer and enterprise data.\nWe continue to enhance our capabilities in cloud security and assurance testing, security operations and automation, product security, and enterprise risk management. To combat the evolving cybersecurity risk landscape and the enhanced level of sophistication of cybersecurity threats, management has prioritized five areas of our information security program: global standards and operations, a risk-aware workforce, product security, detection and response, and data governance management. In addition, we maintain cybersecurity insurance; however, the costs related to cybersecurity threats or disruptions may not be fully insured.\nWe contract with several outside cybersecurity experts to audit and test security controls on a regular basis.\n Any risks or control gaps identified as a result of such assessments, audits, and reviews are reported to the senior leadership of all functional areas of the Company, the Audit Committee of the Board (the \"Audit Committee\"), and the Board as appropriate, and we adjust our cybersecurity policies, standards, and practices as necessary.\nWe also have a vendor risk assessment process consisting of the distribution and review of supplier questionnaires designed to help us evaluate cybersecurity risks that we may encounter when working with third parties that have access to confidential and other sensitive company information. We take steps designed to ensure that such vendors have implemented data privacy and security controls that help mitigate the cybersecurity risks associated with these vendors. We routinely assess our high-risk suppliers’ conformance to industry-leading practices, and we evaluate them for additional information, product, and physical security requirements.\nWe face a number of risks from cybersecurity threats, which may materially affect our business, financial condition, and results of operations, because our business is dependent on the successful operation of our payroll, transaction, financial, accounting, and other data processing systems.\n We cannot eliminate all risks from cybersecurity threats or provide assurances that we have detected all cybersecurity incidents.\nPlease refer to \nPart I,",
    "item1a": "Item 1A, “Risk Factors”\n for further discussion of our cybersecurity-related risks.\n\n\n \n29\n |    \n \n2024 Form 10-K\n\n\n\n\nTable of Contents\n \nIndex to Financial Statements\n\n\nGovernance\nOur commitment to cybersecurity begins at the Board and extends to the senior leadership of all functional areas of the Company. \nOur Audit Committee oversees our risk management process at the Board level. \nThe Audit Committee’s responsibilities include regular review of policies and practices with respect to risk assessment and risk management, including in the areas of cybersecurity and other information technology risk and privacy.\n \nThe Company’s cybersecurity program is supervised by our Chief Information Security Officer (\"CISO\").\n The CISO and his team are responsible for leading enterprise-wide cybersecurity, strategy, policy, standards, and processes.\n \nThe CISO provides quarterly updates related to the cybersecurity program, including any notable incidents at regularly scheduled Audit Committee meetings. The CISO updates include details regarding the magnitude, financial impact, and remediation of cybersecurity incidents. Members of our Board and senior Company executives participate in annual tabletop exercises that focus on testing response plans to ransomware, cloud security, payroll disruption, and other incidents. In addition, in order to deploy a consistent cybersecurity framework, and to manage the risk of social engineering, software downloads, and phishing, we educate employees globally through ongoing security awareness training.\nOur CISO has over 25 years of experience in technology risk management, cybersecurity, compliance, network engineering, information systems, and business resiliency. He is a Certified Information Systems Security Professional and is a member of the National Association of Corporate Directors (\"NACD\"). Our CISO works closely with our Vice President, Enterprise Risk, Compliance and Service Management to assess and manage the cybersecurity element of our ERM program. In the area of risk, the Vice President, Enterprise Risk, Compliance and Service Management focuses on risk management, business continuity planning, crisis management, operations management, and executive and Board reporting.\nOur CISO and Vice President, Enterprise Risk, Compliance and Service Management report to our Chief Digital Officer, who in turn reports to our President and Chief Operating Officer. These officers drive our cybersecurity priorities at the executive level.\nWe have established a documented cybersecurity incident materiality assessment and disclosure program that is jointly managed by our Incident Response, Cybersecurity, and Corporate Legal teams.\n This program calls for the immediate assessment of potentially material cybersecurity incidents, and the appropriate escalation to our cross-functional Disclosure Committee in order to facilitate the prompt escalation of certain cybersecurity incidents so that decisions regarding the public disclosure and reporting of such incidents can be made by management in a timely manner and elevated to our Audit Committee or Board, as appropriate."
  }
}