{
  "ticker": "DD",
  "cik": "0001666700",
  "company_name": "DuPont de Nemours, Inc.",
  "filing_date": "2025-02-14",
  "accession": "0001666700-25-000005",
  "primary_doc": "dd-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1. BUSINESS \nThroughout this Annual Report on Form 10-K, except as otherwise noted by the context, the terms \"DuPont\" or \"Company\" used herein mean DuPont de Nemours, Inc. and its consolidated subsidiaries.\nDuPont is a Delaware corporation formed in 2015 (formerly, DowDuPont Inc.), for the purpose of effecting an all-stock merger of equals transactions between The Dow Chemical Company (\"TDCC\") and E. I. du Pont de Nemours and Company (\"EID\"). Effective August 31, 2017, pursuant to the merger of equals transaction contemplated by the Agreement and Plan of Merger, dated as of December 11, 2015, as amended on March 31, 2017 (\"DWDP Merger Agreement\"), TDCC and EID each merged with subsidiaries of DowDuPont Inc. (\"DowDuPont\") and, as a result, TDCC and EID became subsidiaries of DowDuPont (the \"DWDP Merger\"). Prior to the DWDP Merger, DowDuPont did not conduct any business activities other than those required for its formation and matters contemplated by the DWDP Merger Agreement. For purposes of DowDuPont's financial statement presentation, TDCC was determined to be the accounting acquirer in the DWDP Merger and EID's assets and liabilities are reflected at fair value as of the DWDP Merger Effectiveness Time. \nOn April 1, 2019, the Company completed the separation of the materials science business through the spin-off of Dow Inc., (“Dow”) including Dow’s subsidiary TDCC (the “Dow Distribution”). On June 1, 2019, the Company completed the separation of the agriculture business through the spin-off of Corteva, Inc. (“Corteva”) including Corteva’s subsidiary EID, (the “Corteva Distribution\" and together with the Dow Distribution, the “DWDP Distributions”). Effective January 1, 2023, Corteva’s subsidiary EID changed its name to EIDP, Inc. (“EIDP”), and therefore references to EID reflect this name change as appropriate. \nDuPont is a global innovation leader with technology-based materials and solutions that help transform industries and everyday life by applying diverse science and expertise to help customers advance their best ideas and deliver essential innovations in key markets including electronics, transportation, construction, water, healthcare and worker safety. At December 31, 2024, the Company has subsidiaries in about 50 countries worldwide and manufacturing operations in about 24 countries. See Note 23 to the Consolidated Financial Statements for details on the location of the Company's sales and property.\nSignificant Transformational Divestitures\nOn February 1, 2021, the Company completed the divestiture of the Nutrition & Biosciences (“N&B”) business to International Flavors & Fragrance Inc. (“IFF”) in a Reverse Morris Trust transaction (the “N&B Transaction”) that resulted in IFF issuing shares to DuPont stockholders. See Note 4 to the Consolidated Financial Statements for more information.\nOn February 18, 2022, the Company announced that it had entered an agreement on February 17, 2022, (the \"Transaction Agreement\") with Celanese Corporation (\"Celanese\") for divestiture of the majority of DuPont’s historic Mobility & Materials (“M&M”) segment, (the “M&M Divestiture”). The Auto Adhesives & Fluids, Multibase\nTM\n and Tedlar® product line, which were part of the historic M&M segment, are referred to as the \"Retained Businesses\". On November 1, 2022, DuPont and Celanese completed the M&M Divestiture and DuPont received cash proceeds of $11 billion which was subject to transaction adjustments in accordance with the Transaction Agreement. See Note 4 to the Consolidated Financial Statements for more information. \nAs part of its announcement on February 18, 2022 regarding the M&M Divestiture, DuPont also announced the Board of Directors' approval for the divestiture of the Delrin® acetal homopolymer (H-POM) business (the \"Delrin® Divestiture\"). On November 1, 2023, the Company closed the sale of the Delrin® business to TJC LP (\"TJC\"), (the “Delrin® Divestiture”). The Delrin® Divestiture together with the M&M Divestiture, are referred to as the “M&M Divestitures”.\nIntended Electronics Separation\nOn May 22, 2024, DuPont announced a plan to separate each of its Electronics and Water businesses in a tax-free manner to its shareholders, (the “Previously Intended Business Separations”). On January 15, 2025, DuPont announced it is targeting November 1, 2025, for the completion of the intended separation of the Electronics business (the “Intended Electronics Separation”). DuPont also announced that it would retain the Water business. The Intended Electronics Separation will not require a shareholder vote and is subject to satisfaction of customary conditions, including final approval by DuPont's Board of Directors, receipt of a tax opinion from counsel, the filing and effectiveness of a Form 10 registration statement with the U.S. Securities and Exchange Commission, applicable regulatory approvals and satisfactory completion of financing. \n6\nTable of Contents\nFinancial Flexibility and Return of Excess Capital\nFollowing the M&M Divestiture, in November 2022, DuPont redeemed in full $2.5 billion in fixed-rate long term senior unsecured notes due November 2023. Following the announcement of the Previously Intended Business Separations, in the second quarter 2024, DuPont completed a partial redemption of $650 million aggregate principal amount of its 2038 Notes and entered into two forward-starting fixed-to-floating interest rate swap agreements (“2024 Swaps”) to hedge the changes in the fair value of the Company’s long-term debt due to interest rate change movements. \nIn the fourth quarter of 2022, DuPont's Board of Directors approved a new share repurchase program authorizing the repurchase and retirement of up to $5 billion of common stock, (the \"$5B Share Buyback Program”). In the third quarter 2023, the Company completed the repurchase and retired a total of 46.8 million shares of common stock with $250 million of such repurchases completing the $1 billion share repurchase program approved in February 2022 and the remaining $3 billion under the $5B Share Buyback Program. \nIn the first quarter of 2024, the Company completed the remaining $2 billion of buyback authority under the $5B Share Buyback Program repurchasing 27.9 million shares. In the first quarter of 2024, the Company’s Board of Directors approved a new share repurchase program authorizing the repurchase and retirement of up to $1 billion of common stock (the \"$1B Share Buyback Program”). The $1B Share Buyback Program terminates on June 30, 2025, unless extended or shortened by the Board of Directors.\nIn the second quarter of 2024, DuPont completed an accelerated stock repurchase transaction (“ASR\") for the repurchase of about $500 million of common stock. In total, the Company repurchased 6.9 million shares at an average price of $71.96 per share under the transaction. In connection with the Previously Intended Business Separations and continuing in light of the Intended Electronics Separation, DuPont announced its intent not to complete the remaining $500 million in share buyback authority under the $1B Share Buyback Program. \nFor more information, see the discussion of Liquidity & Capital Resources in See Part II, Item 7, Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nTargeted Acquisitions\nOn August 1, 2023, the Company completed the acquisition of Spectrum Plastics Group (“Spectrum”) from AEA Investors (the “Spectrum Acquisition”) which is part of Industrial Solutions within the Electronics & Industrial segment.\nOn July 28, 2024, DuPont completed the acquisition of Donatelle Plastics, LLC (\"Donatelle Plastics\"), (the \"Donatelle Plastics Acquisition\"), which is being integrated into Industrial Solutions within the Electronics & Industrial segment. \nSee Note 3 to the Consolidated Financial Statements for more information.\nWater District Settlement Agreement\nIn April 2024, the $1.185B Water District Settlement became final and therefore DuPont’s $400 million contribution, plus interest, to the Water District Settlement Fund is reflected as a cash outflow within cash flows from discontinued operations during the year ended December 31, 2024. See Note 16 to the Consolidated Financial Statements for additional information.\nBASIS OF PRESENTATION \nThe M&M Divestitures represent a strategic shift with a related major impact on DuPont's operations and results.\nThe Consolidated Financial Statements included in this annual report present the financial position of DuPont as of December 31, 2024 and 2023, the results of operations of DuPont for the years ended December 31, 2024, 2023 and 2022, and the Consolidated Statements of Cash Flows giving effect to the M&M Divestitures as if it had occurred on January 1, 2022, with the historical financial results of the businesses divested as part of the M&M Divestitures (the \"M&M Businesses\") reflected as discontinued operations, as applicable. The comprehensive income related to the M&M Businesses has not been segregated and are included in the Consolidated Statements of Comprehensive Income, for the year ended December 31, 2024, 2023 and 2022, as applicable. Unless otherwise indicated, the information in the Notes to the Consolidated Financial Statements refer only to DuPont's continuing operations and do not include discussion of balances or activity of the M&M Businesses.\n7\nTable of Contents\nSEGMENT INFORMATION\nThe revenues and certain expenses of the M&M Businesses are classified as discontinued operations in the current and historical periods. Indirect costs, such as those related to corporate and shared service functions previously allocated to the M&M Businesses, do not meet the criteria for discontinued operations and remain reported within continuing operations. The Retained Businesses are not included in the scope of the M&M Divestitures and are included in Corporate & Other. \nSee Part II, Item 7, Management’s Discussion and Analysis of Financial Condition and Results of Operations and Note 23 in this annual report for additional information concerning the Company’s operating segments.\nELECTRONICS & INDUSTRIAL\nElectronics & Industrial is a leading global provider of differentiated materials and component solutions for high performance computing, 5G, electric vehicles (\"EV\"), a broad range of consumer electronics including mobile devices, television monitors, personal computers and a variety of other industries including aerospace, defense, transportation, healthcare and medical devices. The segment supplies industry leading materials and solutions for the fabrication of semiconductors and integrated circuits addressing multiple steps of the manufacturing process. The segment offers a broad portfolio of semiconductor and advanced packaging materials, providing chemical mechanical planarization (\"CMP\") pads and slurries, photoresists and advanced coatings for lithography, removers and cleaners; dielectric and metallization solutions for advanced chip packaging; along with silicones for light emitting diode (\"LED\") packaging and semiconductor applications. Electronics & Industrial also provides permanent and process chemistries for the fabrication of printed circuit boards to include laminates and substrates, electroless and electrolytic metallization solutions, as well as patterning solutions and materials and innovative metallization processes for metal finishing, decorative, and industrial applications and provides high-performance electromagnetic shielding and thermal management solutions. With the acquisitions of Spectrum and Donatelle, Electronics & Industrial also produces specialty medical devices. Electronics & Industrial is a leading global supplier in the packaging graphics industry providing photopolymer plates and platemaking systems used in flexographic printing and digital inks for textile, commercial and home-office printing applications. The segment also provides cutting-edge materials for the manufacturing of rigid and flexible displays for organic light emitting diode (\"OLED\") and other display applications. In addition, the segment produces high performance parts and specialty silicone elastomers and lubricants to meet customer specifications in automotive, aerospace, electronics, industrial and healthcare markets. Electronics & Industrial addresses these markets by leveraging a strong science and technology base and customer-driven application engineering capabilities to provide the critical materials and solutions for creating a more connected and digital world.\nAcquisitions & Divestitures\nOn July 28, 2024, DuPont completed the acquisition of Donatelle Plastics, LLC. Donatelle Plastics is a medical device company specializing in the design, development and manufacture of medical components and devices. Donatelle Plastics is presented within the Industrial Solutions business.\nOn August 1, 2023, the Company completed the acquisition of Spectrum Plastics Group from AEA Investors. Spectrum is a recognized leader in advanced manufacturing of specialty medical devices and components with a strategic focus on key therapeutic areas such as structural heart, electrophysiology, surgical robotics and cardiovascular. Spectrum is presented within the Industrial Solutions business.\nDetails on Electronics & Industrial's 2024 net sales, by major product line and geographic region, are as follows:\n \n8\nTable of Contents\nProducts\nMajor applications/market segments and technologies are listed below by major product line:\nMajor Product Line\nApplications/Market Segments\nTechnologies\nSemiconductor Technologies\nIntegrated circuit fabrication for memory and logic semiconductors\nCMP consumables, photolithography materials, semiconductor fabrication materials, fabrication cleaners and removers, advanced chip packaging materials and thermal management materials, OLED and other display process materials\nInterconnect Solutions\nPrinted circuit board, electronic and industrial finishing\nCircuit packaging film and laminate materials, interconnect metallization and imaging process chemistries, dry film photoresists, polyimide films, flexible circuit materials, LED encapsulants, electromagnetic shielding and thermal management materials\nIndustrial Solutions \n1\nFlexographic printing and inkjet printing, high performance parts and specialty silicones for automotive, aerospace, electronics, industrial, healthcare and medical device markets\nFlexographic printing plates and materials, digital inks, perfluoroelastomer and polyimide parts and shapes, specialty silicone elastomers and lubricants, and specialty extrusion and molded parts for medical devices and components\n1. Donatelle Plastics, a recently acquired component of the Electronics & Industrial segment, has been included within the Industrial Solutions business.\nKey Raw Materials\nThe major commodities, raw materials and supplies for the Electronics & Industrial segment include: p-acetoxystyrene, monomers, pigments and dyes, styrenic block copolymers, copper foil, diglycolamine, hydroxylamine, filler alumina, nickel silver, oxydianiline, palladium, photoactive compounds, polyester and other polymer films, polyethylene resins, polyurethane resins, polyvinyl chloride compounds, pyromellitic dianhydride and silicones.\nCurrent and Future Investments\nThe Company will invest approximately $70 million in its Electronics & Industrial segment to build new production assets at a Dayton, Ohio plant. The new assets will expand polymer production capacity to meet growing customer demand from the semiconductor market. At December 31, 2024, the Company had spent approximately $19 million since the start of the project and expects the new assets to be operational by the end of 2026.\nAdditionally, the Company expects to invest about $165 million over the next five years at its Newark, Delaware plant to expand domestic production capacity to meet global customer demand from the semiconductor market. The multi-year investment plan will expand capacity and improve reliability for domestic supply assurance, improve product quality and consistency for advanced nodes, and expand manufacturing capabilities to enable new technology. At December 31, 2024, the Company had spent approximately $40 million under the investment plan.\n9\nTable of Contents\nWATER & PROTECTION \nWater & Protection is the global leader in providing innovative engineered products and integrated systems for a number of industries including, worker safety, water purification and separation, transportation, energy, medical packaging and building materials. Water & Protection addresses the growing global needs of businesses, governments and consumers for solutions that make life safer, healthier and better.\nInnovation is the business imperative. By uniting market-driven science and engineering with the strength of highly regarded brands including KEVLAR® high-strength material, NOMEX® thermal-resistant material, CORIAN® solid surfaces, TYVEK® selective barriers, FILMTEC™ reverse osmosis elements, AMBERLITE™ ion exchange resins, STYROFOAM™ insulation and GREAT STUFF™ insulating foam sealants, the segment strives to bring new products and solutions to solve customers' needs faster, better and more cost effectively. Water & Protection is investing in future growth initiatives such as water management solutions, construction productivity solutions, high strength and light weighting composite solutions and circular ecosystem / zero waste solutions.\nDetails on Water & Protection's 2024 net sales, by major product line and geographic region, are as follows:\n \nProducts\nMajor applications and products are listed below by major product line:\nMajor Product Line\nApplications / Market Segments\nMajor Products / Technologies\nSafety Solutions\nIndustrial personnel protection, military and emergency response, medical devices and packaging, automotive, aerospace and oil and gas\nKEVLAR® fiber; NOMEX® fiber and paper; TYVEK® protective materials; TYCHEM® protective suits\nShelter Solutions\nRigid and spray foam insulation, weatherization, waterproofing and air sealing, caulks and sealants, roof coatings and decorative surface materials\nSTYROFOAM™ brand insulation products, THERMAX™ exterior insulation, XENERGY™ high performance insulation, LIQUIDARMOR™ flashing and sealant, GREAT STUFF™ insulating foam sealants and adhesives, CORIAN® design solid and quartz surfaces, TYVEK® weather resistant barriers\nWater Solutions\nWater filtration and purification technology for residential, municipal and industrial use. Key industries include municipal drinking water and wastewater, power generation, microelectronics, pharmaceuticals, food and beverage, industrial wastewater reuse, metals and mining and oil and gas segments\nAMBERLITE™ ion exchange resins, FILMTEC™ reverse osmosis and nanofiltration elements, INTEGRAFLUX™ ultrafiltration modules, FORTILIFE™ challenging water reverse osmosis membranes and TAPTEC™ water filtration and purification for drinking water in homes and commercial buildings\n10\nTable of Contents\nKey Raw Materials\nThe major commodities, raw materials and supplies for the Water & Protection segment include: methyl methacrylate, alumina trihydrate, methyl pentanediol, styrene, polysulfone, Terephthaloyl- & Isophthaloyl- chloride, high-density polyethylene, polyethylene, aniline, calcium chloride, divinyl benzene monomers caustic and sulfuric acid. \nCurrent and Future Investments\nThe Company completed the previously announced plans to increase capacity for the manufacture of TYVEK® nonwoven materials at its Luxembourg site due to growing global demand. The new assets were online and operational in early 2024 and the total investment was approximately $400 million.\nCORPORATE & OTHER\nCorporate & Other includes sales and activity of the Retained Businesses including the Auto Adhesives & Fluids, Multibase\nTM \nand Tedlar® product lines. Corporate & Other includes DuPont's equity interest in Derby Holdings Group related to the Delrin® Divestiture. The results of Corporate & Other also include the sales and activity of certain divested businesses including the operations of the Biomaterials business unit divested in May 2022. Corporate & Other also includes certain enterprise and governance activities including non-allocated corporate overhead costs and support functions, leveraged services, non-business aligned litigation expenses and other costs not absorbed by reportable segments.\nThe costs of the M&M Businesses that are classified as discontinued operations include only direct operating expenses incurred prior to the M&M Divestiture on November 1, 2022 and costs which the Company stopped incurring upon the close of the Delrin® Divestiture. Indirect costs, such as those related to corporate and shared service functions previously allocated to the M&M Businesses, do not meet the criteria for discontinued operations and remain reported within continuing operations. A portion of these indirect costs related to activities the Company continues to undertake post-closing of the M&M Divestitures, and for which it is reimbursed (“Future Reimbursable Indirect Costs”). Future Reimbursable Indirect Costs are reported within continuing operations in Corporate & Other but are excluded from Operating EBITDA as defined below. The remaining portion of these indirect costs are not subject to future reimbursement (“Stranded Costs”). Stranded Costs are reported within continuing operations in Corporate & Other and are included within Operating EBITDA.\nThe Company's measure of profit/loss for segment reporting purposes is Operating EBITDA as this is the manner in which the Company's chief operating decision maker (\"CODM\") assesses performance and allocates resources. The Company defines Operating EBITDA as earnings (i.e., “Income from continuing operations before income taxes\") before interest, depreciation, amortization, non-operating pension / other post-employment benefits (“OPEB”) / charges, and foreign exchange gains / losses, excluding Future Reimbursable Indirect Costs, and adjusted for significant items.\n11\nTable of Contents\nINDUSTRY SEGMENTS AND GEOGRAPHIC REGION RESULTS\nSee Note 5 to the Consolidated Financial Statements for net sales by business or major product line.\nSales by geographic region are included within Part II, Item 7 \"Management's Discussion and Analysis of Financial Condition and Results of Operations\", \"Results of Operations.\" See Note 23 to the Consolidated Financial Statements for information regarding total net sales and total assets by segment, as well as net sales and long-lived assets by geographic region.\nSIGNIFICANT CUSTOMERS AND COMPETITION\nIn 2024, no significant portion of the Company's sales was dependent upon a single customer. The markets in which the Company participates compete primarily through technology, range of products and services, performance, quality, reliability, brand, reputation, service and support. The Company provides extensive support, technical services and testing services for its customers, in addition to new product development. The Company believes that its proprietary product and process technologies, robust product and application development pipelines, customer intimacy, global manufacturing capability and local service capability enable it to compete successfully.\nDuPont is a multi-industrial company and is subject to competition across all product and service areas. Key competitors include but are not limited to:\n•\nElectronics & Industrial:\n Element Solutions, Entegris, Fujifilm, Henkel, JSR, Merck KGaA, MKS Instruments, and Resonac.\n•\nWater & Protection:\n 3M, Honeywell, Hydranautics, Kingspan, Kolon, Lanxess, Owens-Corning, Ecolab, Avient, Toray, Teijin, and Yantai.\nAgainst this competitive backdrop, value-in-use is the primary driver of price for the Company’s products, although price is impacted by many factors including, among others, fluctuations in supply and demand, and availability and cost of key manufacturing inputs including raw materials and energy. \nSOURCES AND AVAILABILITY OF MAJOR RAW MATERIALS\nThe Company uses a wide variety of raw materials in the manufacturing of products. The prices of raw materials are driven by global supply and demand. In recent years, raw material prices and availability have been affected by worldwide economic conditions, including supply chain disruptions and inflationary cost pressures. The Company actively works to mitigate impacts of such conditions. \nDISTRIBUTION\nMost products are marketed primarily through the Company's sales organization, although for some product lines, more emphasis is placed on sales through distributors. The Company has a diverse worldwide network which markets and distributes the Company's brands to customers globally. This network consists of the Company's sales and marketing organization partnering with distributors, independent retailers, cooperatives and agents throughout the world.\nBACKLOG \nIn general, the Company does not manufacture its products against a backlog of orders and does not consider backlog to be a significant indicator of the level of future sales activity. Production and inventory levels are typically based on the level of incoming orders as well as projections of future demand. However, from time to time in limited instances the Company does operate against a backlog for certain products, which has in the past resulted, and in the future may result, from the availability of raw materials from third-party suppliers. Therefore, the Company believes that backlog information is generally not meaningful to understanding its overall business and should not be considered a reliable indicator of the Company's ability to achieve any particular level of revenue or financial performance.\nSEASONALITY\nCertain of the Company's sales are seasonal as consumer electronics and North American and European construction end-market demand generally increases in the second and third fiscal quarters resulting in sales increases in Interconnect Solutions and Shelter Solutions, respectively. This seasonality is partially mitigated by the other products provided by the Company that have no material seasonal effect.\nINTELLECTUAL PROPERTY\nThe Company’s businesses differentially manage their respective intellectual property estates to support Company strategic priorities, which can include leveraging intellectual property within and across product lines. \n12\nTable of Contents\nTrade Secrets:\n Trade secrets are an important part of the Company's intellectual property. Many of the processes used to make products are kept as trade secrets which, from time to time, may be licensed to third parties. DuPont vigilantly protects all of its intellectual property including its trade secrets. When the Company discovers that its trade secrets have been unlawfully taken, it reports the matter to governmental authorities for investigation and potential criminal action, as appropriate. In addition, the Company takes measures to mitigate any potential impact, which may include civil actions seeking redress, restitution and/or damages based on loss to the Company and/or unjust enrichment.\nPatents:\n The Company applies for and obtains patents in many countries, including the U.S., and has access to a large patent portfolio, both owned and licensed. DuPont’s rights under these patents and licenses, as well as the products made and sold under them, are important to the Company in the aggregate. The Company considers various intellectual property protections and strategic business priorities when deciding whether to apply for or maintain a patent.\nThe protection afforded by patents varies based on country, scope of individual patent coverage, as well as the availability of legal remedies in each country and type of patent protection. The term of these patents is approximately twenty years from the filing date in general, but varies depending on country and type of patent protection. DuPont's significant patent estate may be leveraged to align with the Company’s strategic priorities within and across product lines. At December 31, 2024, the Company owned about 12,800 patents and patent applications globally. Approximately 80 percent of the Company’s patent estate has a remaining term of more than 5 years.\nTrademarks:\n The Company owns or licenses many trademarks that have significant recognition at the consumer retail level and/or the product line to product line level. Ownership rights in trademarks do not expire if the trademarks are continued in use and properly protected.\nENVIRONMENTAL REGULATORY MATTERS\nDuPont operates global manufacturing, product handling and distribution facilities that are subject to a broad array of environmental laws and regulations. For more information see: (1) Environmental Proceedings on page \n30\n, (2) Management's Discussion and Analysis of Financial Condition and Results of Operations beginning on page \n37\n, (3) Notes 1 and 16 to the Consolidated Financial Statements.\nSUSTAINABILITY \nDuPont’s purpose is to empower the world with the essential innovations to thrive. The Company operates within four core values of protecting safety and health; respect for people; conduct in accordance with the highest ethical behavior; and protecting the planet. DuPont’s sustainability strategy is focused on driving innovations to create sustainable solutions that help address the most pressing challenges facing society and the planet; enhancing the sustainability of its operations and facilities; and protecting the health and well-being of its employees and communities. DuPont believes that climate change is an important global environmental issue that presents risks and opportunities. The Company is continuously evaluating opportunities for existing and new product and service offerings to meet the anticipated demands of a low-carbon economy.\nInformation about DuPont’s sustainability-related policies, programs, initiatives and goals is available under Sustainability in the \"About Us\" section of its website. The Company’s 2024 Sustainability Report, which is aligned to the Global Reporting Initiative (“GRI”) Standards and the Sustainability Accounting Standards Board (\"SASB\") frameworks, includes information based on the businesses and facilities owned and operated by the Company during the calendar year 2023. \nAdditional corporate governance information, including DuPont’s amended and restated charter, amended and restated bylaws, corporate governance guidelines, Board committee charters, and code of business conduct and ethics, is available under Corporate Governance in the \"For Investors\" section of the Company’s website. Nothing on the DuPont websites shall be deemed incorporated by reference into this Annual Report on Form 10-K.\nHUMAN CAPITAL\nF\noundational to the Company’s current and future success is its employees, who drive the Company’s strategic vision, manage operations and develop products. The Company focuses significant attention on attracting, motivating and retaining talent at all levels. Through training and professional development initiatives, promoting a respectful and welcoming culture, and emphasizing the importance of health, safety and well-being, the Company’s aim is to create an environment that fully supports the needs of its employees providing opportunity for financial and career growth, an inclusive and collegial experience and purpose in doing work that matters.\n13\nTable of Contents\nThe Company is committed to upholding a workplace culture that prioritizes the wellbeing and fulfillment of our employees and strongly believes that this approach not only aligns with our values but also positively impacts our long-term performance. To ensure that the Company is consistently fulfilling this commitment, DuPont regularly gathers feedback from our colleagues and analyzes our progress. Annually, an enterprise-wide engagement survey is conducted, which provides insight into employee morale and aspects of workplace culture like core values, commitment to ethical behavior, teamwork and employee development. \nThe Company is committed to creating a high-performance culture built on continual learning to support the strategic needs of its workforce. The professional growth of our people is essential to the growth of our business. Our annual goal process asks employees to not only identify three key goals around business contributions but also and one goal focused on self-development. The Company has prioritized learning and career development opportunities for leaders and all employees. The Company offers a wide set of training, education and development opportunities, both formally and informally, throughout the year. All employees take part in a mix of on-the-job training and appropriate learning and training opportunities focusing on topics that are the most critical and relevant to each employees’ job function. Employees have the freedom to create meaningful development plans, identify goals, and take steps to achieve them. \nThe Company is committed to ensuring fair access to growth and fulfillment opportunities for its employees and to positively impacting communities in which it operates. In furtherance of these commitments, the Company supports several employee-led resource groups which are open to all employees.\nOrganizational culture is only as strong and resilient as its leaders; therefore, DuPont invests in leadership development. DuPont provides programming to equip leaders with the skills needed to support our employees through effective leadership. Annually, our senior leadership identifies key talent based on performance, potential and aspiration to develop for advancement. \nThe Company's success also depends on the well-being of employees, including physical, mental and emotional health. DuPont employees have access to online health resources through our global wellness provider to help them improve their overall well-being, including a health assessment, healthy habit building and tracking, videos and content to reduce stress and increase resilience, better sleep habits, nutrition guides, company wellness challenges, and financial wellness education. The Company continues to provide no-cost Employee Assistance Program (\"EAP\") services to all employees globally and their immediate household members. All employees also have the support of the Company’s Health Services teams, which provides onsite and intranet-based services to support and monitor the health and welfare of employees. The Company’s larger manufacturing and research sites have onsite clinics where employees can get occupational care, first aid treatment, travel vaccinations and referrals for off-site medical care. The Company continuously strives for zero workplace injuries, occupational illnesses and incidents. The Company’s safety metrics are continually measured against this goal, and DuPont’s Environmental, Health, Safety & Sustainability Committee oversees improvements in the Company's health and safety practices. Health Services also assesses health risks across DuPont to find out which health concerns are most important to the Company's employees, conducts medical surveillance exams based on occupational risks and regulatory compliance priorities flagged by DuPont’s Environmental, Health and Safety team. \nAs of December 31, 2024, the Company employed\n \napproximately 24,000 people worldwide. Approximately 34 percent of employees were in Asia Pacific, 16 percent were in the EMEA, 5 percent were in Latin America and 45 percent were in the U.S and Canada. Within the United States, about 6,000 employees were in non-exempt or hourly-rate positions. \nAVAILABLE INFORMATION\nThe Company is subject to the reporting requirements under the Securities Exchange Act of 1934. Consequently, the Company is required to file reports and information with the Securities and Exchange Commission (\"SEC\"), including reports on the following forms: annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934.\nThe SEC maintains an Internet site at http://www.sec.gov that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC, from which the public may obtain any materials the Company files with the SEC.\nThe Company's annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments to those reports are also accessible on DuPont's website at http://www.investors.dupont.com by clicking on the section labeled \"Investors\", then on \"Filings & Reports\". These reports are made available, without charge, as soon as is reasonably practicable after the Company files or furnishes them electronically with the SEC.\n14\nTable of Contents\nDuPont webcasts its quarterly earnings calls and certain events it participates in or hosts with members of the investment community under \nFor Investors\n section, in the \"About Us\" section of the Company’s website. Additionally, DuPont provides notifications of news or announcements regarding its financial performance, including SEC filings, investor events, news and earnings releases under \nFor Investors\n. The Company has used, uses and intends to continue to use, its website as means of disclosing material non-public information and for complying with its disclosure obligations under SEC’s Regulation FD. \nThe contents of the Company’s websites, including those referenced above and elsewhere in this report, are not intended to be incorporated by reference into this Annual Report on Form 10-K or in any other report or document DuPont has or in the future may file with the SEC, and any references to the Company’s websites are intended to be inactive textual references only.\n15\nTable of Contents",
    "item1a": "Item 1A. Risk Factors of this Annual Report. \n28\nTable of Contents\nGovernance \nRoles and Responsibilities\nCybersecurity is an important part of our risk management processes and an area of focus for DuPont’s Board of Directors and management. \nThe \nCIO and the CISO\n are primarily responsible for assessing and managing material risks from cybersecurity threats.\n \nThe CIO has sixteen years of cybersecurity experience, including seven years with DuPont, and the CISO has seventeen years of cybersecurity experience, including over three\n \nyears with DuPont. Each of the CIO and CISO maintain industry recognized creden\ntials relevant to their roles.\nThe Board, acting through its committee structure, is responsible for overseeing management’s implementation and execution of the risk management process and for coordinating the outcome of reviews by Committees in their respective risk areas. Although each Committee is responsible for overseeing the management of certain risks, the full Board is regularly informed by the Committees about these risks. This helps enable the Board and the Committees to coordinate risk oversight and the relationships among the various risks faced by the Company, including cybersecurity risk.\nThe full \nBoard\n is responsible for oversight of cybersecurity risk and receives regular reports from the CIO and the CISO. The CIO and the CISO also present their assessment of material risks from cybersecurity threats to the Board at least annually. The Audit Committee receives periodic reports regarding information technology general controls (“ITGC”) in connection with its oversight of internal control over financial reporting. The impact, if any, of cyber incidents on internal control over financial reporting is also discussed with the full Board. The Nomination and Governance Committee considers cyber expertise in vetting nominees for the Board and recommending Committee appointments, and DuPont’s Board of Directors has determined that one of its independent board members has cybersecurity expertise.",
    "item1b": "ITEM 1B. UNRESOLVED STAFF COMMENTS.\nNone.\n27\nTable of Contents",
    "item1c": "ITEM 1C. CYBERSECURITY.\nRisk Management and Strategy \nDuPont has implemented processes for assessing, identifying and managing material risks from cybersecurity threats, which are integrated into the Company’s overall risk management systems and processes.\n DuPont’s cybersecurity risk management program leverages the National Institute of Standards and Technology (NIST) framework. The Company regularly assesses the threat landscape and takes a holistic view of cybersecurity risks, with a layered cybersecurity strategy based on prevention, detection and containment. The Company has other policies and procedures which directly or indirectly relate to cybersecurity, including those related to remote access monitoring, encryption standards, antivirus protection, multifactor authentication, confidential information and the use of the internet, social media, email and wireless devices. \nThe Company also engages third parties in connection with the assessment of its cybersecurity risk management processes against the NIST framework.\n \nDuPont has dedicated Information Technology security professionals that form the DuPont Cyber Incident Response Team (“DCIRT”). The DCIRT is led by our Chief Information Security Officer (“CISO”) and is responsible for the detection and initial assessment of cybersecurity threats and incidents (collectively, “cyber incidents”), whether internal or experienced by significant third-party service providers, using, among other means, third-party software.\n The DCIRT classifies detected cyber incidents into one of four categories based on potential impact to the functionality of the affected systems, possible or known information involved and recoverability effort. The classification of a cyber incident is designed to allow rapid prioritization, response and escalation. The CISO and the Chief Information Officer (“CIO”) are alerted as to any detected cyber incident that is potentially significant. Incidents are documented for regular internal reporting processes including notations and considerations of related attacks. \nThe CIO and CISO are required to engage the Cybersecurity Incident Review Committee (“CIRC”), a subcommittee of the DuPont Disclosure Committee, if a cyber incident has materially affected, or is reasonably likely to materially affect, the Company, including its business strategy, results of operations or financial condition. The CIRC is engaged if, in the opinion of the DCIRT, based on information then-available, a cyber incident is, or it is reasonably possible it may be, classified in one of the highest two severity categories discussed above. The CIRC includes membership representation from information technology, legal, finance, investor relations and internal audit and, if appropriate, the impacted business. The CIRC is responsible for performing a materiality assessment, activating the Crisis Management Committee (“CMC”) when applicable, and overseeing the public disclosure of material cybersecurity matters, as appropriate. The CIRC coordinates with the Company’s legal counsel and third parties, such as consultants and legal advisors, as needed. The CMC is a standing committee comprised of senior management and reports to the CEO. In the event the CMC is activated in relation to a cyber incident, the CEO is required by Board adopted policy to notify the Lead Director and any member of the Board of Directors identified as having cybersecurity expertise. \nAs part of preparatory and post-closing integration activities in connection with merger and acquisition activity, the Company: (i) conducts a cybersecurity risk threat assessment and when evidence of a breach is uncovered, conducts additional due diligence; (ii) based on the assessment, the Company develops and implements risk mitigation plans if needed and brings the acquisition under the Company’s cyber-attack/breach detection and response programs; and (iii) conducts an internal controls risk and compliance assessment and creates, as needed, responsive action plans intended to mitigate and remediate identified weaknesses in the control environment.\nDuPont deploys annual cybersecurity training for employees and considers this a critical step in safeguarding the Company’s data and assets. The training provides employees and contractors with a baseline understanding of cybersecurity fundamentals to prevent security breaches and safely identify potential threats. The course includes enhancements to strengthen our defensive stance against the increasing number and sophistication of cyberattacks worldwide and includes interactive modules covering various areas, including insider attacks, phishing and email attacks, preventing malware attacks, data protection, data handling, passwords, cloud and internet security and cybersecurity fundamentals for mobile devices.\nLike other major corporations, DuPont is the target of cyber-attacks from time to time. \nHowever, risks from previous cybersecurity incidents, have not materially affected the Company, including its strategy, results of operations or financial condition.\n For additional information about risks related to cybersecurity, see \"The Company’s business, results of operations, financial condition and cash flows could be adversely affected by interruption of the Company’s information technology or network systems and other business disruptions” in"
  }
}