{
  "ticker": "DDOG",
  "cik": "0001561550",
  "company_name": "Datadog, Inc.",
  "filing_date": "2025-02-20",
  "accession": "0001561550-25-000025",
  "primary_doc": "ddog-20241231.htm",
  "item_sections": {
    "item1": "Item 1. Business\nOverview\nDatadog is the observability and security platform for cloud applications.\nOur SaaS platform integrates and automates infrastructure monitoring, application performance monitoring, log management, user experience monitoring, cloud security, and many other capabilities to provide unified, real-time observability and security for our customers’ entire technology stack. Datadog is used by organizations of all sizes and across a wide range of industries to enable digital transformation and cloud migration, drive collaboration among development, operations, security and business teams, accelerate time to market for applications, reduce time to problem resolution, secure applications and infrastructure, understand user behavior, and track key business metrics.\nSoftware applications are transforming how organizations engage with customers and operate their businesses. Companies across all industries are re-platforming their businesses to cloud native or hybrid on-premise and cloud infrastructures to enable this digital transformation. Historically, engineering teams have been siloed, making the development of next generation applications in dynamic cloud environments challenging. We started Datadog to break this model and facilitate collaboration among development and operations teams, enabling the adoption of DevOps practices. Since then, we have continuously pushed to unify separate tools into an integrated monitoring and analytics platform, readily available to everyone who cares about applications and their impact on business. And while we continue to broaden our capabilities in observability, we have expanded our platform into use cases beyond observability, including cloud security, software delivery, and cloud service management.\nWith our founding goal of breaking down silos between Dev and Ops, we set out in 2010 to build a real-time data integration platform to turn chaos of having uncorrelated data from disparate sources into digestible and actionable insights. Since launching our first use case with Infrastructure Monitoring in 2012, we have expanded our platform rapidly, and today, we offer end-to-end monitoring and analytics, powered by a common data model that is extensible for use cases across observability, security, software delivery, and service management. In 2024, we launched Event Management to aggregate and consolidate alerts to accelerate remediation, and LLM Observability to help customers investigate how they can safely deploy and manage their models in production.\nOur proprietary platform combines the power of metrics, traces, logs, user sessions, security signals, and other data from a single agent and over 850 integrations to provide a unified view of infrastructure, application performance and the real-time events impacting performance. Datadog is designed to be cloud agnostic and easy to deploy, with hundreds of out-of-the-box integrations, a built-in understanding of modern technology stacks, and extensive customizations. Customers can deploy our platform across their entire infrastructure, making it ubiquitous and a daily part of the lives of developers, operations engineers, security professionals, and business leaders.\nWe believe that our platform currently addresses a significant portion of the IT Operations Management market. According to Gartner, the IT Operations Management market represents a $81 billion opportunity in 2028. We believe a large portion of this spend is for legacy on-premise and private cloud environments but does not fully include the opportunity in modern multi-cloud and hybrid cloud environments. Our platform is designed to address both legacy and modern environments.\nWe employ a land-and-expand business model centered around offering products that are easy to adopt and have a very short time to value. Our customers can expand their footprint with us on a self-service basis. Our customers often significantly increase their usage of the products they initially buy from us and expand their usage to other products we offer on our platform. We grow with our customers as they expand their workloads in the public and private cloud.\nOur Solution and Key Strengths\nDatadog was founded on the premise that the old model of siloed developers and IT operations engineers is broken, and that legacy tools used for monitoring static on-premise architectures do not work in modern cloud or hybrid environments. Datadog’s cloud-native platform enables development and operations teams to collaborate, quickly build and improve applications, and drive business performance. Empowered by our out-of-the box functionality and simple, self-service installation, our customers are able to rapidly deploy our platform to provide application- and infrastructure-wide visibility, often within minutes.\n5\n•\nBuilt for dynamic cloud and hybrid infrastructures\n. Our innovative platform was born in the cloud and was built to work with ephemeral cloud technologies such as microservices, containers and serverless computing. Our data model was built to work at cloud scale with highly dynamic data sets and processes trillions of events per hour.\n•\nSimple but not simplistic\n. Our platform is easy-to-use with out-of-the-box integrations, customizable drag-and-drop dashboards, real-time visualization and prioritized alerting. The platform is deployed in a self-service installation process within minutes, allowing new users to quickly derive value without any specialized training or heavy implementation or customization. It is highly extensible across a wide array of use cases to a broad set of developers, operations engineers, security professionals, product managers, product designers, platform engineers, customer support staff, and business users. As a result, our platform is integral to business operations and used every day, and our users find increasing value in the solution over time.\n•\nIntegrated data platform\n. We were the first to combine the “three pillars of observability” - metrics, traces, and logs - into a single end-to-end platform with the introduction of our log management solution in 2018. Today, our platform combines infrastructure monitoring, application performance monitoring, log management, user experience monitoring, security monitoring, cloud service management, and developer-focused monitoring in one integrated data platform. This approach increases efficiency by reducing both the expense and friction of attempting to glean insights from disparate systems. We are able to provide a unified view across the IT stack, including infrastructure and application performance, as well as the real-time events impacting performance. Each of our products is integrated and, taken together, they provide the ability to view metrics, traces, logs, sessions, security signals, and other data side-by-side and to perform correlation analysis.\n•\nBuilt for collaboration\n. Our platform was built to break down the silos between developers and operations teams in order to help organizations adopt DevOps practices and improve overall business performance. We provide development and operations teams with a common set of tools to develop a joint understanding of application performance and shared insights into the infrastructure supporting the applications. Additionally, our customizable and interactive dashboards can be shared with business teams to provide them with real-time actionable insights. Over time, as the use cases for our platform have expanded, the types of users that we can serve and help to collaborate have expanded as well, to include security professionals, product managers, product designers, platform engineers, customer support staff, and business users.\n•\nCloud agnostic\n. Our platform is designed to be deployable across all environments, including public cloud, private cloud, on-premise, multi-cloud, and hybrid environments, allowing organizations to diversify their infrastructure and reduce single vendor dependence.\n•\nUbiquitous\n. Datadog is frequently deployed across a customer’s entire infrastructure, making it ubiquitous. Compared to legacy systems that are often used only by a few users in an organization’s IT operations team, Datadog is a daily part of the lives of developers, operations engineers and business leaders.\n•\nIntegrates with our customers’ complex environments\n. We enable development and operations teams to harness the full spectrum of SaaS and open source tools. We have over 850 out-of-the-box integrations with technologies to provide significant value to our customers without the need for professional services. Our integrations provide for comprehensive data point aggregation and consistent, up-to-date, high-quality customer experiences across heterogeneous IT environments as they are fully maintained by Datadog.\n•\nPowered by robust machine-learning and artificial intelligence\n. Our platform ingests massive amounts of data into our unified data warehouse. We develop actionable insights using our advanced analytics capabilities. Our platform's Watchdog capabilities feature artificial intelligence and machine learning that can cross-correlate metrics, traces, logs, sessions, security signals, and other data to identify outliers and notify users of potential anomalies; discover and help resolve issues quickly with automated root cause analysis; augment the troubleshooting workflow with contextual insights; and minimize impact on customers.\n•\nScalable\n. Our SaaS platform is delivered through the cloud. Our platform is massively scalable, currently monitoring trillions of events per hour and millions of servers and containers at any point in time. We offer secure, easily accessible data retention at full granularity for extensive periods of time, which can provide customers with a complete view of their historical data.\n6\nKey Benefits to Our Customers\nOrganizations of all sizes, in all industries, both private and public, purchase our products for a variety of use cases. As of December 31, 2024, we had approximately 30,000 customers in over 150 countries. Our platform provides the following key benefits to our customers:\n•\nAccelerate digital transformation\n. We enable customers to take full advantage of the cloud to develop and maintain mission-critical applications with agility and with confidence in the face of increasing business and time pressure and complexity of underlying infrastructure. As a result, our platform helps accelerate innovation cycles, deliver exceptional digital experiences and optimize business performance.\n•\nReduce time to problem detection and resolution\n. Using infrastructure, APM, log data, and data from integrations in our unified platform, our customers are able to quickly isolate the root cause of application issues in one place where they otherwise would be required to spend hours trying to investigate using multiple tools. The reduction in mean time to detection and mean time to resolution helps our customers avoid lost revenues and enhance customer experience.\n•\nImprove agility of development, operations, security and business teams\n. We eliminate the historical silos of development and operations teams and provide a platform that enables efficient and agile development through the adoption of DevOps and DevSecOps. Our platform enables development, operations and security teams to collaborate closely with a shared understanding of data and analytics. This helps them develop a joint understanding of application performance and shared insights into the infrastructure supporting the applications.\n•\nEnable operational efficiency\n. Our solution is easy to install, which eliminates the need for heavy implementation costs and professional services. We have hundreds of integrations with key technologies, from which our customers can derive significant value, avoiding internal development costs and professional services required to create those integrations. Our customer-centric pricing model is tailored to customers’ desired usage needs. Our platform empowers customers to better understand the operational needs of their applications and IT environments, enabling greater efficiency in resource allocation and spend on cloud infrastructure.\nOur Growth Strategies\nWe intend to pursue the following growth strategies:\n•\nExpand our customer base by acquiring new customers\n. Our market penetration is low. We believe there is a substantial opportunity to continue to grow our customer base. We intend to drive new customer additions by expanding our sales and marketing efforts in the markets we serve.\n•\nExpand within our existing customer base through broader deployments, new use cases and new product adoption\n. Our base of approximately 30,000 customers as of December 31, 2024 represents a significant opportunity for further sales expansion. We plan to continue to increase sales within our existing customer base through increased usage of our platform and the cross selling of additional products.\n•\nExpand our technology leadership through continued investment and new products\n. We intend to invest in expanding the functionality of our current platform and adding capabilities that address new market opportunities. We have a history of continued innovation. For example, in 2017 we launched APM; in 2018 we launched Log Management; in 2019 we launched Digital Experience Monitoring and Network Performance Monitoring; in 2020 we launched Cloud SIEM, Continuous Profiler and Incident Management; in 2021 we launched Cloud Security Posture Management, Cloud Workload Security, Database Monitoring, and Sensitive Data Scanner; in 2022 we launched Application Security Management, Cloud Security Management, Audit Trail, Observability Pipelines, Cloud Cost Management, and Universal Service Monitoring; in 2023 we launched Application Vulnerability Management, Data Streams Monitoring, and Workflow Automation; and in 2024 we launched Event Management and LLM Observability.\n•\nExpand our customer base internationally\n. We believe there is a significant opportunity to continue to expand usage of our platform outside of the United States, as international markets have increased the shift of their IT spend to the cloud.\nOur Platform\n7\nOur proprietary platform provides real-time insights into software applications and IT infrastructure performance to enable better user experiences, faster problem detection and resolution and smarter, more impactful business decisions. Our platform is modular and includes infrastructure monitoring, application performance monitoring, log management, user experience monitoring, network performance monitoring, cloud and application security, developer-focused observability, and cloud service management, as well as a range of shared features such as sophisticated dashboards, advanced analytics, collaboration tools, workflow automation, and alerting capabilities. Many of our products are fully capable stand-alone so clients can choose to use different capabilities incrementally or deploy many at once. When deployed together, our products automatically enable cross-correlation, which in turn allows customers to gain greater levels of visibility across their infrastructure and applications to more rapidly troubleshoot problems.\nOur platform is supported by more than 850 integrations to seamlessly aggregate metrics and events across all of the systems and services that power digital businesses. Our easy-to-use platform is deployed through a self-service installation process. Users can derive value from our platform within minutes without any specialized training or heavy implementation or customization. Customers can easily expand their usage of our platform on a self-serve basis, adding hosts or volumes of data monitored. Our platform is massively scalable currently monitoring trillions of events per hour and millions of servers and containers.\nThe key elements that can be leveraged across our platform:\n•\nSingle Pane of Glass\n.\n Our ability to provide a unified source of data enables users to access information from a single platform and easily explore multiple data sources. Through a single dashboard and with a common data framework, users are able to access and explore all of the relevant performance data. Users are able to more quickly assess and resolve their issues without having to toggle between multiple products.\n•\nRobust, Deep Data Set\n.\n Our client-side collection technology relies on installation of a single agent for metrics, traces, logs, and other data, allowing for a simple, seamless deployment experience for the customers. We ingest massive amounts of complex data and normalize it. The volume of data associated with combining infrastructure, APM, log management, and other products provides for a dramatically more robust data set than any of the individual data sources would provide on their own.\n•\nSaaS Platform\n.\n Our cloud based multi-tenant SaaS platform allows for real-time ingestion, and analysis of massive amounts of data, without our customers needing to worry about the provisioning, sizing and capacity of their monitoring platform.\n•\nOne Data Model.\n Every piece of data that is ingested by our platform is consistently tagged with metadata regardless of its type. This allows for different kinds of performance data, such as a log event and an application trace, to be queried together, correlated, alerted on, and visualized in a common user interface.\n•\nCross-Correlation\n.\n All of our solutions are integrated and work cohesively to provide a deep level of context and insight into what is occurring in a customer’s IT environment and power faster troubleshooting.\n•\nOut-Of-The-Box, Actionable Insights\n.\n From the moment of installation, our platform provides actionable insights through customizable dashboards, predictive analytics, automated correlations, visualizations and alerting.\n•\nHigh Accuracy Machine-Learning Capabilities and Predictive Capabilities Powered by the Network Effect\n.\n Our multi-tenant cloud platform analyzes massive data sets ingested across our customers and their IT environments. It uses machine learning to predict and identify sources of performance or availability issues that customers share due to dependencies on common service providers or third-party services.\n•\n850+ Fully Supported Integrations\n.\n We offer more than 850 out-of-the-box integrations including public cloud, private cloud, on-premise hardware, databases and third-party software.\n•\nAutomated Alerts\n.\n We offer sophisticated real time alerting capabilities in the platform that detects issues, alerts users, and integrates with their service management systems.\nOur platform consists of products that can be used individually or as a unified solution, and includes a Marketplace where customers can access products built by our partners on top of the Datadog platform. Our products include:\n•\nInfrastructure Monitoring\n.\n Our Infrastructure Monitoring platform provides real-time monitoring of IT infrastructure across public cloud, private cloud and hybrid environments, as well as in containers and serverless architectures, ensuring performance, and availability of applications. All infrastructure data is located in one repository with automatic correlation, regardless of environment size or rate of change, to provide a fulsome view of everything that is occurring across the IT ecosystem.\n8\n•\nApplication Performance Monitoring (APM).\n APM provides full visibility into the health and functioning of applications regardless of the deployment environment. Code-level distributed tracing across microservices, hosts, containers and serverless computing functions allows our customers to gain deep insights into application and code performance.\n•\nLog Management.\n Log Management for applications, systems and cloud platforms ingests data, creates indexes and enables querying of logs with visualizations and alerting to provide immediate insight into any performance issues. Logging Without Limits\n®\n decouples the cost of log ingestion from processing, allowing customers to cost effectively collect a massive volume of logs and selectively process those they need to monitor. Flex Logs decouples storage from query, so customers can adjust their retention and querying capacity independently and serve more use cases within the Datadog platform.\n•\nDigital Experience Monitoring.\n Digital Experience Monitoring brings visibility up the stack to monitor the digital experience of the user and consists of Synthetics, Real User Monitoring (RUM), and Session Replay. Synthetics provides user-experience monitoring of applications and API endpoints via simulated AI-powered user requests to proactively track application performance and ensure uptime. RUM provides analysis and visualization of the performance of web browser and mobile applications as experienced by all actual users. Session Replay captures and visually replays users' web browser and mobile application experiences to help identify errors, application usage patterns, and design issues.\n•\nContinuous Profiler\n.\n Continuous Profiler measures code level performance in any environment through an always-on, and low overhead solution. This allows customers to quickly identify and optimize the slowest and most resource-consuming parts in application code in order to improve mean time to resolution, reduce application latency, and lower cloud costs.\n•\nDatabase Monitoring.\n Database Monitoring allows customers to view query metrics and explain plans from all of their databases in a single place. With Database Monitoring, they can quickly pinpoint costly and slow queries and drill into precise execution details to address bottlenecks. Additionally, query, host, and application metric correlation makes it easy to identify and understand the impact of resource constraints on database performance.\n•\nData Observability.\n Data Observability brings production-level observability to the data engineering space, and consists of Data Streams Monitoring (DSM) and Data Jobs Monitoring (DJM). DSM enables customers to easily track and improve the performance of event-driven applications. DJM helps data platform teams and data engineers detect, remediate, and optimize problematic Spark and Databricks jobs,\n•\nUniversal Service Monitoring.\n Universal Service Monitoring automatically detects all microservices across an organization's environment and provides instant visibility into their health and dependencies—all without any code changes.\n•\nNetwork Monitoring.\n Cloud Network Monitoring enables the analysis and visualization of the flow of network traffic in on-premise, cloud-based or hybrid environments, helping customers determine when the network is the root cause of an issue. Network Device Monitoring seamlessly consolidates monitoring and troubleshooting of network hardware, such as routers, firewalls, switches, load balancers, and other network devices.\n•\nError Tracking.\n Error Tracking reduces noise by intelligently grouping errors into issues across frontend and backend applications. By providing rich debug context, down to lines of code, Error Tracking helps users identify root problems, accelerating incident resolution.\n•\nIncident Management.\n Incident Management allows users to declare incidents, investigate root cause and dependencies, collaborate around a shared view of the incident, follow to resolution, and auto-generate post-mortem documentations, all within the Datadog platform.\n•\nWorkflow Automation.\n Workflow Automation enables customers to easily automate and orchestrate processes across their tech stacks, with hundreds of out-of-the-box actions and dozens of customizable blueprints. Workflow Automation enables automated actions based on observability insights for faster incident remediation, proactive prevention, and improved security.\n•\nObservability Pipelines.\n Observability Pipelines enables IT and security teams to cost-effectively collect, transform, and route logs, metrics, and traces from any source to any destination at scale.\n•\nCloud Cost Management.\n Cloud Cost Management provides granular visibility into costs across cloud resources, automatically surfacing changes in cloud costs and visualizing cost data alongside metrics, traces, logs, and other data, and making it easy to find and fix cost inefficiencies.\n9\n•\nCloud Security Management.\n Cloud Security Management delivers vulnerability management, automated compliance checks, continuous posture management, real-time threat detection, identity risk assessments, and a comprehensive resource inventory across the entire cloud infrastructure, all in a unified platform for seamless collaboration and faster remediation. With a unified platform and real-time observability context, DevOps and security teams can quickly remediate issues and continuously improve their organization's security posture.\n•\nApplication Security Management.\n Application Security Management (ASM) delivers continuous, real-time visibility into attacks that target customers' web applications, serverless applications, and APIs. ASM is automatically integrated with APM distributed traces and code-level context, empowering Dev, Ops, and security teams to build and run secure applications in production. Application Vulnerability Management continuously monitors customers' production environments for both code-level and open-source vulnerabilities.\n•\nCloud SIEM.\n Cloud SIEM (Security Information and Event Management) allows customers to detect threats in real time and investigate security signals across metrics, traces, logs, and other data. It provides the engineering organization, including Dev, Ops, and security teams, visibility into common data sources, in order to better operationalize IT security. \n•\nSensitive Data Scanner.\n Sensitive Data Scanner helps businesses meet compliance goals by discovering, classifying, and redacting sensitive data, in real-time and at scale. Datadog scans for patterns of sensitive data upon ingestion and then hashes or redacts it, following built-in or user-defined rules to support compliance with GDPR, HIPAA, CCPA, and more.\n•\nCI Visibility.\n CI, or Continuous Integration, Visibility provides deep insight into the health and performance of customers' CI environment. Pipeline Visibility allows platform engineers to detect and find the root cause of slow or failing pipelines, builds, and jobs across all their CI providers in a single place. Test Visibility auto-instruments every test service to help developers detect and resolve slow, failing, and flaky tests.\n•\nLLM Observability.\n LLM, or Large Language Model, Observability provides end-to-end tracing of LLM chains with visibility into input-output, errors, token usage, and latency at each step. LLM Observability  seamlessly correlates LLM traces with APM and utilizes cluster visualization to identify drifts, enabling users to swiftly resolve issues and scale AI applications in production, while improving accuracy and reducing privacy risks.\n•\nEvent Management. \nEvent Management uses AIOps to intelligently aggregate and consolidate alerts into one consistent view to help centralized operations teams discover and resolve issues faster. Event Management helps teams paint a complete picture of incidents and their underlying causes by reducing noise and enriching events with observability context.\nSales and Marketing\nOur sales team is segmented into four revenue-generating areas: an enterprise sales team that sells to large businesses; a high velocity inside sales team that is focused on acquiring new customers; a customer success team that handles new customer on-boarding and expansions in existing customers; and a partner team that works with resellers, system integrators, referral partners and managed service providers. Each of these teams is further split regionally for geographic coverage across the Americas, Asia-Pacific, or APAC, and Europe, the Middle East and Africa, or EMEA, regions. The sales teams work with marketing to actively pursue leads generated from marketing programs and help take prospective customers through an evaluation and purchase process.\nWe focus our multi-touch marketing efforts on the strength of our product innovation, the value we provide, and our domain expertise. We target the development and IT operations community through our marketing activities, using diverse tactics to connect with prospective customers, such as content marketing, email marketing, events, digital advertising, social media, public relations, partner marketing and community initiatives. We offer prospective customers free trials to help them understand the power of our platform. We also host and present at regional, national, global and virtual events to engage both customers and prospects, deliver product training, share best practices and foster community.\nAs of December 31, 2024, we had approximately 3,000 employees in our sales and marketing organization, including sales development, field sales, sales engineering, technical solutions, business development, sales operations, sales strategy, customer success and marketing personnel. We intend to continue to invest in our sales and marketing capabilities to capitalize on our market opportunity.\n10\nResearch and Development\nOur research and development organization is responsible for the design, development, testing and delivery of new technologies, features and integrations of our platform, as well as the continued improvement and iteration of our existing products. It is also responsible for operating and scaling our platform including the underlying cloud infrastructure. Our research and development investments seek to drive core technology innovation and bring new products to market. Research and development employees are located primarily in our New York and Paris offices, as well as remotely distributed.\nOur research and development team consists of our software engineering, product management, development and site reliability engineering teams. As of December 31, 2024, we had approximately 3,100 employees in our research and development organization. We intend to continue to invest in our research and development capabilities to extend our platform and products.\nOur Competition\nThe worldwide monitoring and analytics market is and has been highly competitive for decades and is rapidly evolving. We compete on the basis of a number of factors, including:\n•\nability to provide unified, real-time observability of IT environments;\n•\nability to operate in dynamic and elastic environments;\n•\nextensibility across the enterprise, including development, operations and business users;\n•\npropensity to enable collaboration between development, operations and business users;\n•\nability to monitor any combination of public clouds, private clouds, on-premise and multi-cloud hybrids;\n•\nability to provide advanced analytics and machine learning;\n•\nease of deployment, implementation and use;\n•\nbreadth of offering and key technology integrations;\n•\nperformance, security, scalability and reliability;\n•\nquality of service and customer satisfaction;\n•\ntotal cost of ownership; and\n•\nbrand recognition and reputation.\nOur unified platform combines functionality from numerous traditional product categories, and hence we compete in each of these categories with different vendors:\n•\nwith respect to on-premise infrastructure monitoring, we compete with diversified technology companies and systems management vendors including IBM, Microsoft Corporation, and SolarWinds Corporation.\n•\nwith respect to APM, we compete with Cisco Systems, Inc., New Relic, Inc. and Dynatrace Software Inc.\n•\nwith respect to Log Management, we compete with Cisco Systems, Inc., and Elastic N.V.\n•\nwith respect to Cloud monitoring, we compete with native solutions from cloud providers such as Amazon Web Services, or AWS, Microsoft Azure, and Google Cloud Platform, or GCP.\nAdditionally, we compete with home-grown and open-source technologies across the categories described above. We believe that we compete favorably with respect to the factors listed above. However, many of our competitors have greater financial, technical and other resources, greater brand recognition, larger sales forces and marketing budgets, broader distribution networks, more diverse product and services offerings and larger and more mature intellectual property portfolios. They may be able to leverage these resources to gain business in a manner that discourages customers from purchasing our offerings. Furthermore, we expect that our industry will continue to attract new companies, including smaller emerging companies, which could introduce new offerings. We may also expand into new markets and encounter additional competitors in such markets.\n11\nHuman Capital Management\nAs of December 31, 2024, we had approximately 6,500 employees operating across 33 countries. Approximately 41% of our full-time employees as of that date were located outside of the United States, 35% of whom were located in France. In countries in which we operate, such as France, we are subject to, and comply with, local labor law requirements, which may automatically make our employees subject to industry-wide collective bargaining agreements. We have not experienced any work stoppages and we consider our relations with our employees to be good. \nIntellectual Property\nIntellectual property rights are important to the success of our business. We rely on a combination of patent, copyright, trademark and trade secret laws in the United States and other jurisdictions, as well as license agreements, confidentiality procedures, non-disclosure agreements with third parties, and other contractual protections, to protect our intellectual property, including our proprietary technology, software, know-how and brand. We use open source software in our services. Our API libraries and agent used by customers to send data to our proprietary platform are licensed by us on an open source basis.\nAs of December 31, 2024, we own forty-two patents globally, nine patent applications pending for examination in the United States, three pending PCT applications, and four pending foreign patent applications. The pending U.S. patent applications, if issued, would be scheduled to expire between 2039 and 2043. Despite our pending patent applications, there can be no assurance that our patent applications will result in issued patents. As of December 31, 2024, we own nine registered trademarks in the United States and one hundred twenty-four registered trademarks in various non-U.S. jurisdictions. However, as we have expanded internationally, we have been unable to register or obtain the exclusive right to use the Datadog trademark in certain jurisdictions, and as we continue to expand may face similar issues in other jurisdictions.\nAlthough we rely on intellectual property rights, including patents, copyrights, trademarks and trade secrets, as well as contractual protections to establish and protect our proprietary rights, we believe that factors such as the technological and creative skills of our personnel, creation of new services, features and functionality, and frequent enhancements to our proprietary platform are more essential to establishing and maintaining our technology leadership position.\nWe control access to and use of our proprietary technology and other confidential information through the use of internal and external controls, including contractual protections with employees, contractors, customers and partners. We require our employees, consultants and other third parties to enter into confidentiality and proprietary rights agreements and we control and monitor access to our software, internal documentation, proprietary technology and other confidential information. Our policy is to require all employees and independent contractors to sign agreements assigning to us any inventions, trade secrets, works of authorship, developments, processes and other intellectual property generated by them on our behalf and under which they agree to protect our confidential information. In addition, we generally enter into confidentiality agreements with our customers and partners. See the section titled “Risk Factors” for a more comprehensive description of risks related to our intellectual property.\nCorporate Information\nWe were incorporated in Delaware in June 2010. Our principal executive offices are located at 620 8th Avenue, 45th Floor, New York, New York 10018, and our telephone number is (866) 329-4466. Our website address is www.datadog.com. Information contained on, or that can be accessed through, our website is not incorporated by reference into this Annual Report on Form 10-K, and you should not consider information on our website to be part of this Annual Report on Form 10-K.\nAvailable Information\nOur Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and amendments to reports filed pursuant to Sections 13(a) and 15(d) of the Securities Exchange Act of 1934, as amended, or the Exchange Act, are filed with the SEC. Such reports and other information filed by us with the SEC are available free of charge on our website at www.investors.datadoghq.com when such reports are available on the SEC’s website. The SEC maintains an internet site that contains reports, proxy and information statements and other information regarding issuers that file electronically with the SEC at www.sec.gov. The information contained on the websites referenced in this Annual Report on Form 10-K is not incorporated by reference into this filing. Further, our references to website URLs are intended to be inactive textual references only.\n12",
    "item1a": "Item 1A. Risk Factors in this Annual Report on Form 10-K, including without limitation “Strategic and Operational Risks—If we or the third parties with whom we work experience, or are unable to protect against cyber-attacks, ransomware, security incidents, or security breaches, or if unauthorized parties otherwise obtain access to or otherwise compromise our customers’ data, our data, or our platform and information technology systems, then our solution may be perceived as not being secure, our reputation may be harmed, demand for our platform and products may be reduced, and we may incur significant liabilities or additional expenses.”\nGovernance\nOur Board of Directors has delegated its oversight of risks associated with cybersecurity to its Audit Committee. Generally, each quarter, the Audit Committee reviews and discusses with our Chief Information Security Officer material cybersecurity risks and our processes for assessing, identifying, and managing such risks, and the Audit Committee will receive updates as necessary between each quarterly meeting. In the event of a material cybersecurity incident, the Audit Committee will be notified, and the \nBoard of Directors will also receive updates on cybersecurity risks and incidents, as appropriate.\nOur \nChief Information Security Officer and Chief Technology Officer\n are the members of our executive team who are principally responsible for overseeing our cybersecurity risk management program. Our Chief Information Security Officer and Chief Technology Officer are informed about cybersecurity threats through their involvement with the processes set forth above. For example, our Chief Information Security Officer receives regular reports on identified cybersecurity risks and progress toward remediation from our security teams and both our Chief Information Security Officer and Chief Technology Officer are notified of cybersecurity incidents and the management of such incidents in accordance with the escalation procedures of our incident response plan.\n \nWe believe these members of our executive team have the appropriate expertise, background, and experience to manage risks arising from cybersecurity threats. Alexis Lê-Quôc is one of the co-founders of our company and has served as our Chief Technology Officer and a member of our board of directors since June 2010. Mr. Lê-Quôc has extensive knowledge and experience from building and leading the development of our technology and from his decades of experience in the technology industry. Prior to co-founding Datadog, Mr. Lê-Quôc worked at Wireless Generation from March 2004 to December 2010, where he most recently served as Director of Live Operations. Previously, Mr. Lê-Quôc held engineering positions at a number of technology and software companies, including IBM Research and France Télécom S.A. Mr. Lê-Quôc received his M.S. in Computer Science from CentraleSupélec. Emilio Escobar has served as our Chief Information Security \n41\nOfficer since September 2020. With two decades of experience in information security and compliance, Mr. Escobar has worked at large enterprises, medium-sized companies, and governmental organizations. Previously, Mr. Escobar served as the Vice President of Information Security for Hulu, where he played a pivotal role in setting up key security functions. Prior to that, Mr. Escobar worked for PlayStation, where he built and ran the software security teams. Mr. Escobar holds a BS in Computer Science from the University of Puerto Rico.",
    "item1b": "Item 1B. Unresolved Staff Comments\nNone.",
    "item1c": "Item 1C. Cybersecurity\nRisk Management and Strategy\nWe utilize various processes and tools to assess, identify, and manage risks from cybersecurity threats\n. In the development of our products and features, our security teams work with our engineering and product teams to identify, assess, and agree upon mitigation or remediation measures with respect to product development. On an ongoing basis, we encourage an environment of openness in which our engineering and product teams, led by our security teams, proactively identify, manage and discuss actual or perceived cybersecurity risks. These teams also use automated and manual processes to identify and track risks from cybersecurity threats. The identified risks are triaged, prioritized for remediation, and reported by the security teams to various levels of our senior management, as appropriate. We also deploy technical safeguards that are designed to protect our platform and systems from cybersecurity threats, including firewalls, intrusion prevention, and detection systems. We have established an incident response plan that addresses our response to cybersecurity incidents, and we require periodic training for \n40\nour employees on cybersecurity threats. In addition, we maintain cybersecurity insurance, however, the costs related to cybersecurity threats or disruptions may not be fully insured.\n \nIn addition, \nwe maintain third-party vendor management standards that are used to evaluate cybersecurity risks associated with our third-party service providers, and we assess information technology and software vendors to determine their security posture and maturity\n. All vendors that process our data or access our systems go through a security and privacy review before they are engaged that is targeted to the services to be provided and the systems and data involved. Based on the information provided by the vendor and depending on the nature of the services provided, our vendor management process may involve security questionnaires and contractual obligations such as audit rights and breach reporting.\n \nWe also periodically perform various types of security audits and assessments, including penetration tests, via internal and external parties. In addition, certain Datadog products are subject to specific compliance requirements and standards, including, as applicable, ISO 27001, SOC 2, PCI, and FedRAMP (Low and Moderate), and are tested and evaluated by third-party auditors against those applicable compliance requirements and standards. The identified risks from such audits and assessments are triaged, prioritized, reported by our security teams to various levels of our senior management and tracked and remediated depending on the severity.\nOur internal audit function conducts annual interviews across business groups to identify key areas of risk, including cybersecurity risk. This enterprise risk assessment helps inform the internal audit plan, and both the assessment and progress against the internal audit plan are periodically presented to the Audit Committee. Our Chief Information Security Officer also reports separately to our Audit Committee on cyber and information security risk on a quarterly basis.\nWe have previously and may in the future become the target of cyber-attacks by third parties seeking unauthorized access to our or our customers’ data or to disrupt our ability to provide our services\n. As a result, we have expended and plan to continue to expend significant resources in an effort to protect against security incidents and to mitigate, detect, and remediate actual and potential vulnerabilities. Notwithstanding the measures and processes we take to manage cybersecurity risk, there is no guarantee that these measures and processes will be successful in preventing or mitigating a cybersecurity incident that could have a material adverse effect on us. For a description of the risks from cybersecurity threats that may materially affect the Company and how those risks may affect the Company, see our risk factors under Part 1."
  }
}