{
  "ticker": "DECK",
  "cik": "0000910521",
  "company_name": "DECKERS OUTDOOR CORP",
  "filing_date": "2025-05-23",
  "accession": "0000910521-25-000017",
  "primary_doc": "deck-20250331.htm",
  "item_sections": {
    "item1": "Item 1A, “Risk Factors,” within this Annual Report for further discussion of risks to our business and results of operations.\nCOMMODITY PRICE RISK\nWe are exposed to commodity price fluctuations associated with the cost of raw materials used in our manufacturing process, including sheepskin and sugarcane-derived EVA (collectively, commodities). \nTo manage price volatility and ensure availability for our commodities, we currently enter into fixed purchasing contracts with designated suppliers of sheepskin and, at times, sugarcane-derived EVA. Our fixed pricing agreements are non-cancellable and may be subject to fees, including certain sheepskin purchasing contracts requiring deposits when minimum volumes are not fully consumed. In the event of significant price increases for our commodities, we will likely not be able to adjust our selling prices sufficiently to eliminate the impact of such increases on our profitability. We continue to evaluate our firm pricing agreement strategy for our commodities, including other preferred materials.\nRefer to the subsection titled “Contractual Obligations” under the section “Liquidity” within Part II, Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” and Note 7, “Commitments and Contingencies,” of our consolidated financial statements in Part IV within this Annual Report for further information on our minimum purchase obligations for commodities. \nFOREIGN CURRENCY EXCHANGE RATE RISK\nAlthough most of our sales and inventory purchases are denominated in US dollars, our global operations in the international markets where our products are sold and manufactured expose us to risk of foreign currency exchange rate fluctuations between the US dollar and primarily the currencies of Europe, Asia, Canada, and Latin America. \nWe are exposed to financial statement transaction gains and losses as a result of remeasuring our monetary assets and liabilities that are denominated in currencies other than our subsidiaries’ functional currencies. We hedge certain foreign currency exchange rate risks from existing assets and liabilities, as well as forecasted sales. As our international operations grow and we increase purchases and sales in foreign currencies, we will continue to evaluate our hedging strategy and may utilize additional derivative instruments to hedge our foreign currency exchange rate risk. We do not use foreign currency exchange rate forward contracts for speculative trading purposes. \nForeign currency exchange rate fluctuations affect our results of operations and can make comparisons from year to year more difficult. Foreign currency exchange rates, excluding the effect from derivative instruments, to remeasure monetary assets and liabilities using the exchange rate at the end of the reporting period, had a negative impact on our income from operations for the year ended March 31, 2025. \nWe use forward foreign exchange contracts to hedge material exposure to adverse changes in foreign currency exchange rates. A sensitivity analysis technique has been used to evaluate the effect that changes in the market value of foreign exchange currencies will have on our forward foreign exchange contracts. As of March 31, 2025, a hypothetical 10% foreign currency exchange rate fluctuation would have caused the fair value of our financial instruments to change by approximately $34,000. As of March 31, 2025, there are no known factors that we would expect to result in a material change in the near-term in the general nature of our primary foreign currency exchange rate risk exposure. Refer to the section titled “Summary of Significant Accounting Policies” in Note 1, “General,” and Note 9, “Derivative Instruments,” of our consolidated financial statements in Part IV within this Annual Report for further information on our use of derivative contracts and related accounting policies.\n49\nTable of \nContents\nINTEREST RATE RISK\nOur exposure to market risk for interest rates relates to our cash and cash equivalents, including cash invested in highly rated money market funds, and our revolving credit facilities. \nCash and cash equivalents held by us are affected by variable, short-term interest rates. Using our average invested cash equivalents balance as of March 31, 2025, the hypothetical effect of a 100 basis point change in short-term interest rates would result in a change of approximately $14,700 to interest income recorded in our consolidated statements of comprehensive income, along with our operating cash flows, but would not impact the fair market value of the related underlying instruments. Refer to the section titled “Summary of Significant Accounting Policies” in Note 1, “General,” and Note 4, “Fair Value Measurements,” of our consolidated financial statements in Part IV within this Annual Report for further information on our cash and cash equivalents.\nOur revolving credit facilities bear interest at variable rates. As a result, we are exposed to changes in market interest rates that could impact the cost of servicing debt. As there were no outstanding balances under our revolving credit facilities as of March 31, 2025, the hypothetical effect of a 100 basis point change in interest rates for borrowings made under our revolving credit facilities would have resulted in no change to interest expense recorded in our consolidated statements of comprehensive income during the year ended March 31, 2025. Refer to Note 6, “Revolving Credit Facilities,” of our consolidated financial statements in Part IV within this Annual Report for further information on our revolving credit facilities.\nITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe Consolidated Financial Statements, the Financial Statement Schedule, and the Reports of Independent Registered Public Accounting Firm, are filed in a separate section following Part IV, as shown on the index under Item 15, “Exhibits and Financial Statement Schedules,” within this Annual Report.\nITEM 9A. CONTROLS AND PROCEDURES\nDISCLOSURE CONTROLS AND PROCEDURES\nWe maintain a system of disclosure controls and procedures, as defined in Rule 13a-15(e) under the Exchange Act, which are designed to provide reasonable assurance that information required to be disclosed in the reports that we file or submit under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in the SEC’s rules and forms. In designing and evaluating our disclosure controls and procedures, our management recognized that any system of controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives, as ours is designed to do, and management necessarily is required to apply its judgment in evaluating the cost-benefit relationship of possible controls and procedures. In addition, the design of any system of controls is based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions. Over time, controls may become inadequate because of changes in conditions, or the degree of compliance with policies or procedures may deteriorate. Because of the inherent limitations in a cost-effective control system, misstatements due to error or fraud may occur and not be detected.\nUnder the supervision and with the participation of management, we conducted an evaluation of the effectiveness of the design and operation of our disclosure controls and procedures as of March 31, 2025. Based on that evaluation, our PEO and Principal Financial and Accounting Officer (PFAO) concluded that our disclosure controls and procedures are effective at a reasonable assurance level as of March 31, 2025. \n50\nTable of \nContents\nMANAGEMENT’S REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) under the Exchange Act). Our internal control over financial reporting is a process designed under the supervision of our PEO and PFAO to provide reasonable assurance regarding the reliability of financial reporting and the preparation of our financial statements for external reporting purposes in accordance with \nUS GAAP\n. Because of inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. \nAs of March 31, 2025, our management, including our PEO and PFAO, assessed the effectiveness of our internal control over financial reporting using the criteria set forth in \nInternal Control — Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission (commonly referred to as COSO). Based on this assessment, our management concluded that our internal control over financial reporting was effective based on this criteria. The registered public accounting firm that audited our consolidated financial statements in Part IV within this Annual Report has issued an attestation report on our internal control over financial reporting. Refer to Part IV, “Report of Independent Registered Public Accounting Firm - Internal Control Over Financial Reporting,” on page F-4 within this Annual Report.\nCHANGES IN INTERNAL CONTROL OVER FINANCIAL REPORTING\nThere were no changes in our internal control over financial reporting identified in management’s evaluation pursuant to Rule 13a-15(d) of the Exchange Act during the three months ended March 31, 2025, that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nPEO AND PFAO CERTIFICATIONS\nThe certifications of our PEO and PFAO required by Rule 13a-14(a) of the Exchange Act are filed as Exhibit 31.1 and Exhibit 31.2, and furnished as Exhibit 32.1, to this Annual Report. This Part II, Item 9A, should be read in conjunction with such certifications for a more complete understanding of the topics presented.\nITEM 9B. OTHER INFORMATION\nDIRECTOR AND OFFICER TRADING PLANS AND ARRANGEMENTS\nOur directors and officers may enter into trading plans or other arrangements with financial institutions to purchase or sell shares of our common stock. These plans or arrangements may constitute Rule 10b5-1 trading arrangements or non-Rule 10b5-1 trading arrangements, in each case as defined under Item 408(a) of Regulation S-K. \nSet forth below is a summary of the adoption, modification, and \ntermination\n activity of our directors and executive officers with respect to Rule 10b5-1 trading plans during the three months ended March 31, 2025:\nName & Title\nAdoption Date\nTermination Date\nContract End Date\nAggregate Shares Covered\n(in ones) \n(1)\nAngela Ogbechie\n, \nChief Supply Chain Officer\nFebruary 27, 2025\n*\nDecember 31, 2025\n12,570\nBonita Stewart\n, \nDirector\nFebruary 10, 2025\n*\nMay 27, 2026\n9,000\n*Not applicable.\n51\nTable of \nContents\n(1) \nThe actual number of shares sold under the plan may depend on the vesting of certain performance-based equity awards and the number of shares withheld by us to satisfy our income tax withholding obligations and may vary from the number provided herein.\nDuring the three months ended March 31, 2025, no non-Rule 10b5-1 trading arrangements were \nadopted\n, modified, or \nterminated\n by our directors or executive officers. \nPART III\nITEM 10. DIRECTORS, EXECUTIVE OFFICERS, AND CORPORATE GOVERNANCE\nThe information required by this item will be disclosed in our definitive proxy statement on Schedule 14A (Proxy Statement) for our 2025 annual meeting of stockholders and is incorporated herein by reference. Our Proxy Statement will be filed with the SEC within 120 days after the end of the year ended March 31, 2025, pursuant to Regulation 14A under the Exchange Act.\nITEM 11. EXECUTIVE COMPENSATION\nThe information required by this item will be disclosed in the Proxy Statement and is incorporated herein by reference.\nITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by this item will be disclosed in the Proxy Statement and is incorporated herein by reference.\nITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by this item will be disclosed in the Proxy Statement and is incorporated herein by reference.\nITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information required by this item will be disclosed in the Proxy Statement and is incorporated herein by reference.\nPART IV\nITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\nRefer to Part IV, “Index to Consolidated Financial Statements and Financial Statement Schedules,” on page F-1 within this Annual Report for our Consolidated Financial Statements and the Reports of Independent Registered Public Accounting Firm. \nEXHIBIT INDEX\nExhibit\nNumber\nDescription of Exhibit\n3.1\nAmended and Restated Certificate of Incorporation of Deckers Outdoor Corporation, as amended through \nSeptember 13, 202\n4\n (Exhibit 3.1 to the Registrant\n’\ns Form 10-Q filed on \nOctober\n 31, 2024\n, and incorporated by reference herein)\n52\nTable of \nContents\nExhibit\nNumber\nDescription of Exhibit\n3.2\nAmended and Restated Bylaws of Deckers Outdoor Corporation, as amended through \nSeptember 9, 202\n4\n (Exhibit 3.\n2\n to the Registrant’s Form \n10-Q\n filed on \nOctober 31\n, 2024\n, and incorporated by reference herein)\n*4.1\nDescription of the Capital Stock of Deckers Outdoor Corporation\n10.1\nCredit Agreement, dated December 19, 2022, by and among Deckers Outdoor Corporation, Deckers Europe Limited, Deckers UK Ltd., Deckers Benelux B.V., Deckers Outdoor Canada ULC, Deckers Outdoor International Limited, Deckers Coromar, LLC, DBrands SGP Pte. Ltd., Citibank, N.A., as administrative agent, joint lead arranger and joint bookrunner, Comerica Bank, as sole syndication agent, joint lead arranger and joint bookrunner, HSBC Bank USA, National Association, as joint lead arranger and joint bookrunner, and the lenders party thereto (Exhibit 10.1 to the Registrant’s Form 8-K filed on December 21, 2022, and incorporated by reference herein)\n†10.2\nStandard Industrial Lease (Net), dated December 5, 2013, by and between Moreno Knox, LLC, and Deckers Outdoor Corporation for distribution center at 17791 Perris Blvd., Moreno Valley, CA 92551 (Exhibit 10.6 to the Registrant’s Form 10-K filed on March 3, 2014, and incorporated by reference herein)\n†10.3\nFirst Amendment to Standard Industrial Lease (Net), dated June 6, 2017, by and between Moreno Knox, LLC, and Deckers Outdoor Corporation for distribution center at 17791 Perris Blvd., Moreno Valley, CA 92551 (Exhibit 10.6 to the Registrant’s Form 10-K filed on May 30, 2018, and incorporated by reference herein)\n10.4\nSecond Amendment to Standard Industrial Lease (Net), dated July 17, 2017, by and between Moreno Knox, LLC, and Deckers Outdoor Corporation for distribution center at 17791 Perris Blvd., Moreno Valley, CA 92551 (Exhibit 10.7 to the Registrant’s Form 10-K filed on May 30, 2018, and incorporated by reference herein)\n†10.5\nStandard Industrial Lease (Net), dated February 10, 2021, by and between Westpoint Building II, LLC and Deckers Outdoor Corporation for distribution center at 2633 Westpoint Blvd., Mooresville, IN 46158 (Exhibit 10.4 to the Registrant’s Form 10-K filed on May 28, 2021, and incorporated by reference herein)\n†10.6\nStandard Industrial Lease (Net), dated April 20, 2022, by and between Westpoint Building V, LLC, and Deckers Outdoor Corporation for distribution center at 2723 Westpoint Blvd., Mooresville, IN 46158 (Exhibit 10.5 to the Registrant’s Form 10-K filed on May 27, 2022, and incorporated by reference herein)\n#10.7\nForm of Indemnification Agreement (Exhibit 10.1 to the Registrant’s Form 8-K filed on June 2, 2008, and incorporated by reference herein)\n#10.8\nForm of Change in Control and Severance Agreement (Exhibit 10.\n1\n to the Registrant’s Form 10-Q filed on August \n1\n, 202\n4\n, and incorporated by reference herein)\n#10.9\nDeckers Outdoor Corporation 2006 Equity Incentive Plan (Appendix A to the Registrant\n’\ns Definitive Proxy Statement filed on April 21, 2006, and incorporated by reference herein)\n#10.10\nFirst Amendment to Deckers Outdoor Corporation 2006 Equity Incentive Plan, as amended through May 9, 2007 (Appendix A to the Registrant\n’\ns Definitive Proxy Statement filed on April 9, 2007, and incorporated by reference herein)\n#10.11\nDeckers Outdoor Corporation Second Amended and Restated Deferred Stock Unit Compensation Plan, effective December 16, 2015 (Exhibit 10.1 to the Registrant\n’\ns Form 10-Q filed on November 9, 2017, and incorporated by reference herein)\n*#10.12\nDeckers Outdoor Corporation Deferred Stock Unit Compensation Plan, effective September 9, 2024\n#10.13\nDeckers Outdoor Corporation Amended and Restated Deferred Compensation Plan, effective July 1, 2016 (Exhibit 10.2 to the Registrant’s Form 10-Q filed on November 9, 2017, and incorporated by reference herein)\n#10.14\nDeckers Outdoor Corporation Management Incentive Plan (Exhibit 10.1 to the Registrant’s Form 10-Q filed on August 10, 2015, and incorporated by reference herein)\n#10.15\nDeckers Outdoor Corporation 2024 Employee Stock Purchase Plan (Appendix A to the Registrant's Definitive Proxy Statement filed on July 23, 2024, and incorporated by reference herein)\n#10.16\nDeckers Outdoor Corporation 2015 Stock Incentive Plan (Appendix B to the Registrant's Definitive Proxy Statement filed on July 29, 2015, and incorporated by reference herein)\n#10.17\nDeckers Outdoor Corporation 2024 Stock Incentive Plan (Appendix B to the Registrant's Definitive Proxy Statement filed on July 23, 2024, and incorporated by reference herein)\n#10.18\nForm of Stock Unit Award Agreement (2023 Time-Based RSU) under Deckers Outdoor Corporation 2015 Stock Incentive Plan (Exhibit 10.26 to the Registrant’s Form 10-K filed on May 26, 2023, and incorporated by reference herein)\n53\nTable of \nContents\nExhibit\nNumber\nDescription of Exhibit\n†#10.19\nForm of Restricted Stock Unit Award Agreement under Deckers Outdoor Corporation 2015 Stock Incentive Plan FY 2023 LTIP Financial Performance Award (Exhibit 10.27 to the Registrant’s Form 10-K filed on May 26, 2023, and incorporated by reference herein)\n#10.20\nForm of Stock Unit Award Agreement (202\n4\n Time-Based RSU) under Deckers Outdoor Corporation 2015 Stock Incentive Plan\n \n(Exhibit 10.23 to the Registrant’s Form 10-K filed on May 24, 2024, and incorporated by reference herein)\n†#10.21\nForm of Restricted Stock Unit Award Agreement under Deckers Outdoor Corporation 2015 Stock Incentive Plan FY 2024 LTIP Financial Performance Award\n (Exhibit 10.24 to the Registrant’s Form 10-K filed on May 24, 2024, and incorporated by reference herein)\n*#10.22\nForm of Stock Unit Award Agreement (2025 Time-Based RSU) under Deckers Outdoor Corporation 2015 Stock Incentive Plan\n†*#10.23\nForm of Restricted Stock Unit Award Agreement under Deckers Outdoor Corporation 2015 Stock Incentive Plan FY 2025 LTIP Financial Performance Award\n*#10.24\nForm of Stock Unit Award Agreement (Time-Based RSU) under Deckers Outdoor Corporation 2024 Stock Incentive Plan\n†*#10.25\nForm of Restricted Stock Unit Award Agreement under Deckers Outdoor Corporation 2024 Stock Incentive Plan - LTIP Financial Performance Award\n19.1\nInsider Trading Policy\n \n(Exhibit 19.1 to the Registrant’s Form 10-K filed on May 24, 2024, and incorporated by reference herein)\n*21.1\nSubsidiaries of Registrant\n*23.1\nConsent of Independent Registered Public Accounting Firm\n*31.1\nCertification of the Principal Executive Officer pursuant to Rule 13a-14(a) under the Exchange Act, adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002, as amended\n*31.2\nCertification of the Principal Financial and Accounting Officer pursuant to Rule 13a-14(a) under the Exchange Act, adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002, as amended\n**32.1\nCertification \nof the Principal Executive Officer and the Principal Financial and Accounting \nOfficer \npursuant to 18 U.S.C. Section 1350, adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002, as amended\n97.1\nClawback and Forfeiture Policy\n (Exhibit 97.1 to the Registrant’s Form 10-K filed on May 24, 2024, and incorporated by reference herein)\n*101.INS\nInline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document)\n*101.SCH\nInline XBRL Taxonomy Extension Schema Document\n*101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n*101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n*101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n*101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\n*104\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n* Filed herewith.\n** Furnished herewith.\n# Management contract or compensatory plan or arrangement. \n† Certain of the schedules (and similar attachments) to this exhibit have been omitted in accordance with Item 601(a)(5) of Regulation S-K. A copy of any omitted schedule (or similar attachment) will be furnished to the Securities and Exchange Commission upon request. \n54\nTable of \nContents\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\n \nDECKERS OUTDOOR CORPORATION\n(Registrant)\n/s/ STEVEN J. FASCHING\nSteven J. Fasching\nChief Financial Officer\n(Principal Financial and Accounting Officer)\nDate: May 23, 2025 \nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\n/s/ STEFANO CAROTI\nChief Executive Officer, President, and Director\n(Principal Executive Officer) \nMay 23, 2025\nStefano Caroti\n/s/ STEVEN J. FASCHING\nChief Financial Officer\n(Principal Financial and Accounting Officer)\nMay 23, 2025\nSteven J. Fasching\n/s/ CYNTHIA (CINDY) L. DAVIS\nChair of the Board\nMay 23, 2025\nCynthia (Cindy) L. Davis\n/s/ DAVID A. BURWICK\nDirector\nMay 23, 2025\nDavid A. Burwick\n/s/ NELSON C. CHAN\nDirector\nMay 23, 2025\nNelson C. Chan\n/s/ JUAN R. FIGUEREO\nDirector\nMay 23, 2025\nJuan R. Figuereo\n/s/ MAHA S. IBRAHIM\nDirector\nMay 23, 2025\nMaha S. Ibrahim\n/s/ VICTOR LUIS\nDirector\nMay 23, 2025\nVictor Luis\n/s/ DAVE POWERS\nDirector\nMay 23, 2025\nDave Powers\n/s/ LAURI M. SHANAHAN\nDirector\nMay 23, 2025\nLauri M. Shanahan\n/s/ BONITA C. STEWART\nDirector\nMay 23, 2025\nBonita C. Stewart\n55\nTable of \nContents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS \nAND FINANCIAL STATEMENT SCHEDULES\nPage\nConsolidated Financial Statements:\nReport of Independent Registered Public Accounting Firm - Consolidated Financial Statements\n \n(\nKPMG LLP\n, \nLos Angeles, CA\n, Auditor Firm ID: \n185\n)\nF-\n2\nReport of Independent Registered Public Accounting Firm - Internal Control Over Financial Reporting\n(\nKPMG LLP\n, \nLos Angeles, CA\n, Auditor Firm ID: \n185\n)\nF-\n4\nConsolidated Balance Sheets\nF-\n5\nConsolidated Statements of Comprehensive Income\nF-\n6\nConsolidated Statements of Stockholders’ Equity\nF-\n7\nConsolidated Statements of Cash Flows\nF-\n8\nNotes to Consolidated Financial Statements\nF-\n10\nConsolidated Financial Statement Schedule:\nSchedule II - Total Valuation and Qualifying Accounts\nF-\n42\nAll other schedules are omitted because they are not applicable, or the required information is shown in the consolidated financial statements or accompanying notes thereto.\nF-1\nTable of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors \nDeckers Outdoor Corporation:\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Deckers Outdoor Corporation and subsidiaries (the Company) as of March 31, 2025, and 2024, the related consolidated statements of comprehensive income, stockholders’ equity, and cash flows for each of the years in the three-year period ended March 31, 2025, and the related notes and financial statement schedule (collectively, the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of March 31, 2025, and 2024, and the results of its operations and its cash flows for each of the years in the three-year period ended March 31, 2025, in conformity with U.S. generally accepted accounting principles. \nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of March 31, 2025, based on criteria established in \nInternal Control – Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission, and our report dated May 23, 2025 expressed an unqualified opinion on the effectiveness of the Company’s internal control over financial reporting.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on these consolidated financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB. \nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit and risk management committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of a critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nWholesale sales return liability\nAs discussed in Note 1 and Note 2 to the consolidated financial statements, the Company has recorded a sales return liability as of March 31, 2025, of $63,462, of which $47,216 is related to the wholesale channel. The Company records an allowance for anticipated future returns of goods shipped prior to the end of the reporting period. Amounts of these reserves are based on known and actual returns, historical returns, and any recent events that could result in a change from historical return rates.\nWe identified the evaluation of the wholesale sales return liability as a critical audit matter. There was a high degree of auditor judgment required to evaluate recent events that could result in a change from historical return rates used to estimate the wholesale sales return liability.\nThe following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of certain internal controls related to the Company’s process for estimating the wholesale sales return liability, including controls related to the development of estimated return rates. We evaluated the wholesale sales return liability using a combination of Company internal data, known \nF-2\nTable of Contents\nReport of Independent Registered Public Accounting Firm\nrecent trends, and actual and historical known information. We analyzed the Company’s internal data and external correspondence to assess adjustments made by management, if any, to historical return rates based on consideration of recent events. We assessed the Company’s ability to accurately estimate the wholesale sales return liability by comparing the historically recorded sales return liability to actual subsequent product returns. We also analyzed actual product returns received after year-end but prior to the issuance of the consolidated financial statements.\n/s/ KPMG LLP\nWe have served as the Company’s auditor since 1992.\nLos Angeles, California\nMay 23, 2025 \nF-3\nTable of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors\nDeckers Outdoor Corporation:\nOpinion on Internal Control Over Financial Reporting\nWe have audited Deckers Outdoor Corporation and subsidiaries’ (the Company) internal control over financial reporting as of March 31, 2025, based on criteria established in \nInternal Control – Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission. In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of March 31, 2025, based on criteria established in \nInternal Control – Integrated Framework (2013) \nissued by the Committee of Sponsoring Organizations of the Treadway Commission. \nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of March 31, 2025 and 2024, the related consolidated statements of comprehensive income, stockholders’ equity, and cash flows for each of the years in the three-year period ended March 31, 2025, and the related notes and financial statement schedule (collectively, the consolidated financial statements), and our report dated May 23, 2025 expressed an unqualified opinion on those consolidated financial statements.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB. \nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audit also included performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ KPMG LLP\nLos Angeles, California\nMay 23, 2025 \nF-4\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\n(dollar and share data amounts in thousands, except par value)\nAs of March 31,\n2025\n2024\nASSETS\nCash and cash equivalents\n$\n1,889,188\n \n$\n1,502,051\n \nTrade accounts receivable, net of allowances ($\n32,883\n and $\n27,331\n as of March 31, 2025, and March 31, 2024, respectively) (\nNote\n 2 and \nSchedule\n II)\n332,872\n \n296,565\n \nInventories\n495,226\n \n474,311\n \nPrepaid expenses\n39,294\n \n34,284\n \nOther current assets\n67,282\n \n92,713\n \nIncome tax receivable\n36,613\n \n43,559\n \nTotal current assets\n2,860,475\n \n2,443,483\n \nProperty and equipment, net of accumulated depreciation ($\n402,964\n \nand $\n349,138\n as of March 31, 2025, and March 31, 2024, respectively) (\nNote\n 1 and\n \nNote\n 13)\n325,599\n \n302,122\n \nOperating lease assets\n237,352\n \n225,669\n \nGoodwill (\nNote\n 3)\n13,990\n \n13,990\n \nOther intangible assets, net of accumulated amortization ($\n25,014\n and $\n91,314\n as of March 31, 2025, and March 31, 2024, respectively) (\nNote\n 3)\n15,699\n \n27,083\n \nDeferred tax assets, net (\nNote\n 5)\n77,591\n \n72,584\n \nOther assets\n39,546\n \n50,648\n \nTotal assets\n$\n3,570,252\n \n$\n3,135,579\n \nLIABILITIES AND STOCKHOLDERS’ EQUITY\nTrade accounts payable\n$\n417,955\n \n$\n378,503\n \nAccrued payroll\n125,417\n \n123,653\n \nOperating lease liabilities (\nNote\n 7)\n54,453\n \n53,581\n \nOther accrued expenses\n142,120\n \n106,785\n \nIncome tax payable\n23,299\n \n52,338\n \nValue added tax payable\n6,697\n \n5,133\n \nTotal current liabilities\n769,941\n \n719,993\n \nLong-term operating lease liabilities (\nNote\n 7)\n222,522\n \n213,298\n \nIncome tax liability\n13,587\n \n52,470\n \nOther long-term liabilities\n51,189\n \n42,350\n \nTotal long-term liabilities\n287,298\n \n308,118\n \nCommitments and contingencies (\nNote\n 7)\nStockholders’ equity\nCommon stock ($\n0.01\n par value per share; \n750,000\n shares authorized; \n150,201\n and \n153,554\n shares issued and outstanding as of March 31, 2025, and March 31, 2024, respectively)\n1,502\n \n1,536\n \nAdditional paid-in capital\n253,466\n \n243,050\n \nRetained earnings\n2,307,699\n \n1,913,615\n \nAccumulated other comprehensive loss (\nNote\n 10)\n(\n49,654\n)\n(\n50,733\n)\nTotal stockholders’ equity\n2,513,013\n \n2,107,468\n \nTotal liabilities and stockholders’ equity\n$\n3,570,252\n \n$\n3,135,579\n \nSee accompanying notes to the consolidated financial statements.\nF-5\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(dollar and share data amounts in thousands, except per share data)\nYears Ended March 31,\n2025\n2024\n2023\nNet sales \n(\nNote\n 2, \nNote\n 12, and \nNote\n 13)\n$\n4,985,612\n \n$\n4,287,763\n \n$\n3,627,286\n \nCost of sales\n2,099,949\n \n1,902,275\n \n1,801,916\n \nGross profit\n2,885,663\n \n2,385,488\n \n1,825,370\n \nSelling, general, and administrative expenses (\nNote\n 12)\n1,706,571\n \n1,457,974\n \n1,172,619\n \nIncome from operations \n(\nNote\n 12)\n1,179,092\n \n927,514\n \n652,751\n \nInterest income\n(\n68,389\n)\n(\n52,208\n)\n(\n15,563\n)\nInterest expense\n3,517\n \n2,564\n \n3,442\n \nOther expense (income), net\n665\n \n(\n1,783\n)\n(\n1,210\n)\nTotal other income, net\n(\n64,207\n)\n(\n51,427\n)\n(\n13,331\n)\nIncome before income taxes\n1,243,299\n \n978,941\n \n666,082\n \nIncome tax expense (\nNote\n 5)\n277,208\n \n219,378\n \n149,260\n \nNet income\n966,091\n \n759,563\n \n516,822\n \nOther comprehensive income (loss), net of tax\nUnrealized gain on cash flow hedges\n1,584\n \n—\n \n—\n \nForeign currency translation loss\n(\n505\n)\n(\n11,698\n)\n(\n14,080\n)\nTotal other comprehensive income (loss), net of tax\n1,079\n \n(\n11,698\n)\n(\n14,080\n)\nComprehensive income\n$\n967,170\n \n$\n747,865\n \n$\n502,742\n \nNet income per share\nBasic\n$\n6.36\n \n$\n4.89\n \n$\n3.25\n \nDiluted\n$\n6.33\n \n$\n4.86\n \n$\n3.23\n \nWeighted-average common shares outstanding \n(\nNote\n 11)\nBasic\n151,992\n \n155,225\n \n159,023\n \nDiluted\n152,670\n \n156,285\n \n160,111\n \nSee accompanying notes to the consolidated financial statements.\nF-6\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY\n(amounts in thousands)\nCommon Stock\nAdditional Paid-in Capital\nRetained Earnings\nAccumulated Other Comprehensive Income (Loss)\nTotal Stockholders’ Equity\nShares\nAmount\nBalance, March 31, 2022\n161,895\n \n$\n1,619\n \n$\n208,741\n \n$\n1,353,420\n \n$\n(\n24,955\n)\n$\n1,538,825\n \nStock-based compensation\n33\n \n— \n26,858\n \n— \n— \n26,858\n \nShares issued upon vesting\n312\n \n3\n \n2,167\n \n— \n— \n2,170\n \nExercise of stock options\n384\n \n4\n \n4,392\n \n— \n— \n4,396\n \nShares withheld for taxes\n— \n— \n(\n11,317\n)\n— \n— \n(\n11,317\n)\nRepurchases of common stock (\nNote\n 10)\n(\n5,570\n)\n(\n55\n)\n— \n(\n297,317\n)\n— \n(\n297,372\n)\nExcise taxes related to repurchases of common stock\n— \n— \n— \n(\n569\n)\n— \n(\n569\n)\nNet income\n— \n— \n— \n516,822\n \n— \n516,822\n \nTotal other comprehensive loss\n— \n— \n— \n— \n(\n14,080\n)\n(\n14,080\n)\nBalance, March 31, 2023\n157,054\n \n1,571\n \n230,841\n \n1,572,356\n \n(\n39,035\n)\n1,765,733\n \nStock-based compensation\n12\n \n— \n37,248\n \n— \n— \n37,248\n \nShares issued upon vesting\n351\n \n4\n \n2,440\n \n— \n— \n2,444\n \nExercise of stock options\n426\n \n4\n \n4,782\n \n— \n— \n4,786\n \nShares withheld for taxes\n— \n— \n(\n32,261\n)\n— \n— \n(\n32,261\n)\nRepurchases of common stock (\nNote\n 10)\n(\n4,289\n)\n(\n43\n)\n— \n(\n414,888\n)\n— \n(\n414,931\n)\nExcise taxes related to repurchases of common stock\n— \n— \n— \n(\n3,416\n)\n— \n(\n3,416\n)\nNet income\n— \n— \n— \n759,563\n \n— \n759,563\n \nTotal other comprehensive loss\n— \n— \n— \n— \n(\n11,698\n)\n(\n11,698\n)\nBalance, March 31, 2024\n153,554\n \n1,536\n \n243,050\n \n1,913,615\n \n(\n50,733\n)\n2,107,468\n \nStock-based compensation\n11\n \n— \n37,915\n \n— \n— \n37,915\n \nShares issued upon vesting\n347\n \n3\n \n3,801\n \n— \n— \n3,804\n \nExercise of stock options\n89\n \n1\n \n967\n \n— \n— \n968\n \nShares withheld for taxes\n— \n— \n(\n32,267\n)\n— \n— \n(\n32,267\n)\nRepurchases of common stock (\nNote\n 10)\n(\n3,800\n)\n(\n38\n)\n— \n(\n566,964\n)\n— \n(\n567,002\n)\nExcise taxes related to repurchases of common stock\n— \n— \n— \n(\n5,043\n)\n— \n(\n5,043\n)\nNet income\n— \n— \n— \n966,091\n \n— \n966,091\n \nTotal other comprehensive income\n— \n— \n— \n— \n1,079\n \n1,079\n \nBalance, March 31, 2025\n150,201\n \n$\n1,502\n \n$\n253,466\n \n$\n2,307,699\n \n$\n(\n49,654\n)\n$\n2,513,013\n \nSee accompanying notes to the consolidated financial statements.\nF-7\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(amounts in thousands)\nYears Ended March 31,\n2025\n2024\n2023\nOPERATING ACTIVITIES\nNet income\n$\n966,091\n \n$\n759,563\n \n$\n516,822\n \nReconciliation of net income to net cash provided by (used in) operating activities:\nDepreciation, amortization, and accretion\n69,353\n \n57,587\n \n47,858\n \nAmortization on cloud computing arrangements\n2,380\n \n2,075\n \n2,149\n \nLoss on extinguishment of debt\n—\n \n—\n \n226\n \nBad debt expense\n5,032\n \n789\n \n1,983\n \nDeferred tax benefit\n(\n5,545\n)\n(\n1,510\n)\n(\n9,719\n)\nStock-based compensation\n37,943\n \n37,288\n \n26,897\n \nLoss on disposal of assets\n3,183\n \n407\n \n2,691\n \nImpairment of intangible assets\n—\n \n8,164\n \n—\n \nImpairment of cloud computing arrangements, operating lease, and other long-lived assets\n4,290\n \n1,015\n \n2,817\n \nChanges in operating assets and liabilities:\nTrade accounts receivable, net\n(\n41,339\n)\n4,157\n \n(\n806\n)\nInventories\n(\n24,344\n)\n58,541\n \n(\n26,056\n)\nPrepaid expenses and other current assets\n20,946\n \n(\n38,490\n)\n(\n5,609\n)\nIncome tax receivable\n6,945\n \n(\n38,775\n)\n13,459\n \nNet operating lease assets and lease liabilities\n(\n2,583\n)\n(\n567\n)\n(\n8,308\n)\nOther assets\n6,566\n \n(\n9,989\n)\n13,240\n \nTrade accounts payable\n35,636\n \n119,601\n \n(\n74,247\n)\nOther accrued expenses\n22,222\n \n43,534\n \n11,528\n \nIncome tax payable\n(\n29,039\n)\n35,016\n \n4,897\n \nOther long-term liabilities\n(\n33,214\n)\n(\n5,222\n)\n17,600\n \nNet cash provided by operating activities\n1,044,523\n \n1,033,184\n \n537,422\n \nINVESTING ACTIVITIES\nPurchases of property and equipment\n(\n86,171\n)\n(\n89,365\n)\n(\n81,025\n)\nProceeds from sale of assets\n11,168\n \n34\n \n12\n \nNet cash used in investing activities\n(\n75,003\n)\n(\n89,331\n)\n(\n81,013\n)\nFINANCING ACTIVITIES\nLoan origination costs on revolving credit facilities\n—\n \n—\n \n(\n1,537\n)\nProceeds from issuance of stock \n3,804\n \n2,444\n \n2,170\n \nProceeds from exercise of stock options\n968\n \n4,786\n \n4,396\n \nRepurchases of common stock\n(\n567,002\n)\n(\n414,931\n)\n(\n297,372\n)\nCash paid for excise taxes related to repurchases of common stock\n(\n3,985\n)\n—\n \n—\n \nCash paid for shares withheld for taxes\n(\n15,119\n)\n(\n9,974\n)\n(\n16,688\n)\nNet cash used in financing activities\n(\n581,334\n)\n(\n417,675\n)\n(\n309,031\n)\nEffect of foreign currency exchange rates on cash and cash equivalents\n(\n1,049\n)\n(\n5,922\n)\n(\n9,110\n)\nNet change in cash and cash equivalents\n387,137\n \n520,256\n \n138,268\n \nCash and cash equivalents at beginning of period\n1,502,051\n \n981,795\n \n843,527\n \nCash and cash equivalents at end of period\n$\n1,889,188\n \n$\n1,502,051\n \n$\n981,795\n \nF-8\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(amounts in thousands)\n(continued)\nYears Ended March 31,\n2025\n2024\n2023\nSUPPLEMENTAL CASH FLOW DISCLOSURE\nCash paid during the period\nIncome taxes\n$\n345,397\n \n$\n234,062\n \n$\n135,986\n \nInterest\n1,789\n \n1,783\n \n1,880\n \nOperating leases\n70,326\n \n65,672\n \n60,353\n \nNon-cash investing activities\nChanges in trade accounts payable and other accrued expenses for purchases of property and equipment\n3,819\n \n(\n6,705\n)\n5,325\n \nAccrued for asset retirement obligation assets related to leasehold improvements\n2,233\n \n2,278\n \n8,203\n \nLeasehold improvements acquired through tenant allowances\n—\n \n8,127\n \n—\n \nNon-cash financing activities\nAccrued for shares withheld for taxes\n17,148\n \n22,287\n \n5,371\n \nAccrued excise taxes related to repurchases of common stock\n5,043\n \n3,416\n \n569\n \nSee accompanying notes to the consolidated financial statements.\nF-9\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\nNOTE 1. \nGENERAL\nThe Company\n. Deckers Outdoor Corporation and its wholly owned subsidiaries (collectively, the Company) is a global leader in designing, marketing, and distributing innovative footwear, apparel, and accessories developed for both everyday casual lifestyle use and high-performance activities. The Company’s \nfive\n proprietary brands include UGG® (UGG), HOKA® (HOKA), Teva® (Teva), AHNU® (AHNU), and Koolaburra by UGG® (Koolaburra). \nThe Company sells its products through quality domestic and international retailers, international distributors, and directly to global consumers through its Direct-to-Consumer (DTC) channel, which is comprised of an e‑commerce and retail store presence. Independent third-party contractors manufacture all of the Company’s products. \nRecent Developments\n. \nDuring the third quarter of fiscal year 2025, the Company began taking steps to phase out its standalone operations for the Koolaburra brand in order to maintain focus on the Company’s most significant organic opportunities. The Company closed Koolaburra.com as of March 31, 2025, and plans to wind down the Koolaburra brand in the wholesale channel by the end of calendar year 2025. As of March 31, 2025, the Company has not incurred, and does not expect to incur, material exit costs or obligations associated with this plan.\nDuring the second quarter of fiscal year 2025, the Company entered into an agreement pursuant to which the buyer purchased the Sanuk brand and certain related assets, which was completed on August 15, 2024 (Sanuk Brand Sale Date). The Company determined that the divestiture of the Sanuk brand did not represent a strategic shift that had or will have a major effect on the consolidated results of operations, and therefore results of this business were not classified as discontinued operations. The Company’s financial results for its reportable operating segments present the former Sanuk brand within the Other brands reportable operating segment through the Sanuk Brand Sale Date for the year ended March 31, 2025, and full financial results for the years ended March 31, 2024, and 2023.\n Refer to Note 3, “Goodwill and Other Intangible Assets,” for further information on Sanuk brand assets. \nBasis of Presentation. \nThe consolidated financial statements and accompanying notes thereto (referred to herein as consolidated financial statements) as of March 31, 2025, and 2024, and for the years ended March 31, 2025, 2024, and 2023 (referred to herein as “year ended” or “years ended,” or as “fiscal year 2025,” “fiscal year 2024,” and “fiscal year 2023,” respectively)\n \nare prepared in accordance with generally accepted accounting principles in the United States (US GAAP).\n \nReportable Operating Segments. \nAs of March 31, 2025, the Company’s \nthree\n reportable operating segments include the worldwide operations of the UGG brand, HOKA brand, and Other brands (primarily consisting of the Teva brand, AHNU brand, and Koolaburra brand) (collectively, the Company’s reportable operating segments). The various brands within Other brands are aggregated within one reportable operating segment as each brand shares similar economic and qualitative characteristics. Refer to Note 12, “Reportable Operating Segments,” for further information on the Company’s reportable operating segments.\nDuring the fourth quarter of fiscal year 2025, the financial information regularly used by the chief operating decision maker (CODM), who is the Principal Executive Offic\ner, \nto evaluate performance, make operating decisions, and allocate resources was revised. In connection with executive leadership alignment, and the recent divestiture and phase out of certain brands, the CODM shifted resource allocation decisions and performance assessment to a brand focus, rather than a distribution channel focus. This resulted in a change in the Company’s reportable operating segments. The change in reportable operating segments had an impact on segment income from operations, a measure of segment profitability, and the Company clarified unallocated overhead costs excluded from this measure as unallocated enterprise and shared brand expenses. Refer to Note 12, “Reportable Operating Segments,” for further information on the Company’s unallocated enterprise and shared brand expenses. \nF-10\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\nPreviously, the Company’s \nsix\n reportable operating segments included the worldwide wholesale operations of the UGG brand, HOKA brand, Teva brand, Sanuk brand, and Other brands (primarily the AHNU brand and the Koolaburra brand), and DTC. Reportable operating segment results for all prior periods presented in this Annual Report have been recast to reflect the change in reportable operating segments.\nForward Stock Split and Authorized Share Increase. \nOn September 13, 2024, the Company (1) effected a \nsix\n-for-one forward stock split of its common stock and preferred stock (the stock split), and (2) increased the number of authorized shares of its common stock from \n125,000,000\n to \n750,000,000\n, and the number of authorized shares of its capital stock from \n130,000,000\n to \n755,000,000\n (the authorized share increase). The stock split and the authorized share increase were effected through the filing of an amendment to the Company’s Amended and Restated Certificate of Incorporation (Charter Amendment) with the Secretary of State of the State of Delaware, which was approved by the Company’s stockholders at the Annual Meeting of Stockholders held on September 9, 2024 (Annual Meeting). The Charter Amendment did not provide for any increase in the number of authorized shares of preferred stock, which remains at \n5,000,000\n shares. There are \nno\n shares of preferred stock outstanding as of March 31, 2025, and 2024. As a result of the stock split, every one share of common stock outstanding on September 6, 2024, the record date for the stock split, was automatically split into \nsix\n shares of common stock. The common stock commenced t\nrading on a post-stock split adjusted basis on September 17, 2024.\nAll prior period results included in the consolidated financial statements and the related notes within this Annual Report have been retroactively adjusted to reflect the effectiveness of the stock split and the authorized share increase. Specifically, all share and per share amounts have been adjusted, including: (1) the number of shares authorized and outstanding on the consolidated balance sheets; (2) the weighted-average common shares outstanding and the associated earnings per share amounts in the consolidated statements of comprehensive income, as well as the weighted average common shares outstanding disaggregated in Note 11, “Basic and Diluted Shares;” (3) the number of shares underlying stock awards and the weighted-average grant date fair value of annual stock awards in Note 8, “Stock-Based Compensation;” and (4) the total number of shares repurchased and the average price per share paid in Note 10, “Stockholders’ Equity.” Further, as there was no change to par value, an amount equal to the par value of the increased shares resulting from the stock split for shares issued was reclassified to common stock from additional paid-in capital, and for share repurchases was reclassified to retained earnings from common stock, in the consolidated balance sheets and the consolidated statements of stockholders’ equity.\nConsolidation.\n The consolidated financial statements include the accounts of the Company and its wholly owned subsidiaries. All intercompany balances and transactions have been eliminated in consolidation.\nUse of Estimates. \nThe preparation of the Company’s consolidated financial statements in accordance with US GAAP requires management to make estimates and assumptions that affect the amounts reported. Management bases these estimates and assumptions upon historical experience, existing and known circumstances, authoritative accounting pronouncements and other factors that management believes to be reasonable. In addition, the Company has considered the potential impact of macroeconomic factors, including inflation, changes in tariff rates, foreign currency exchange rate volatility, changes in interest rates, changes in commodity pricing, changes in discretionary spending, and recessionary concerns, on its business and operations. Although the full impact of these factors is unknown, the Company believes it has made appropriate accounting estimates and assumptions based on the facts and circumstances available as of the reporting date. However, actual results could differ materially from these estimates and assumptions, which may result in material effects on the Company’s financial condition, results of operations, and liquidity. \nSignificant areas requiring the use of management estimates and assumptions relate to variable consideration for net sales provided to customers, including the sales return liability, and related sales return asset, as well as trade accounts receivable allowances; inventory write-downs; contract assets and liabilities; stock-based compensation; impairment assessments, including goodwill, other intangible assets, and long-lived assets; depreciation and amortization; income tax receivables and liabilities; uncertain tax positions; the fair value of financial instruments; the reasonably certain lease term; lease classification; and the Company’s incremental borrowing rate (IBR) utilized to measure its operating lease assets and lease liabilities.\n \nF-11\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\nForeign Currency Translation\n. The Company considers the United States (US) dollar as its functional currency. The Company’s wholly owned foreign subsidiaries have various assets and liabilities, primarily cash, receivables, and payables, which are denominated in currencies other than its functional currency. The Company remeasures these monetary assets and liabilities using the exchange rate at the end of the reporting period, which results in gains and losses that are recorded in selling, general, and administrative (SG&A) expenses in the consolidated statements of comprehensive income as incurred. In addition, the Company translates assets and liabilities of subsidiaries with reporting currencies other than US dollars into US dollars using the exchange rates at the end of the reporting period, which results in financial statement translation gains and losses recorded in other comprehensive income or loss (OCI), net of tax, in the consolidated statements of comprehensive income.\nSeasonality\n.\n \nA significant part of the UGG brand’s business has historically been seasonal, with the highest percentage of net sales occurring in the third fiscal quarter, which has contributed to variation in results of operations from quarter to quarter. However, the Company has mitigated the impacts of seasonality by diversifying and expanding product offerings with additional year-round styles. In addition, as the HOKA brand’s net sales, which generally occur more evenly throughout the fiscal year, continue to increase as a percentage of the Company’s aggregate net sales, the Company expects to reduce the impacts of seasonality in future periods.\nRecent Accounting Pronouncements. \nThe Financial Accounting Standards Board has issued Accounting Standards Updates (ASUs) that have been adopted and not yet adopted by the Company as stated below.\nRecently Adopted.\n \nThe following is a summary of each ASU adopted by and its impact on the Company upon adoption:\nStandard\nDescription\nImpact upon Adoption\nASU 2022-04 - Supplier Finance Program (SFP)\nThe \nASU\n requires that a buyer in a \nSFP\n disclose qualitative and quantitative information about its program on an interim basis, including the nature of the \nSFP and key terms, \noutstanding amounts as of the end of the reporting period, and presentation in its financial statements. \nThe interim portion of this ASU is effective on a retrospective basis for fiscal years beginning after December 15, 2022, and interim periods within those fiscal years. Early adoption is permitted. \nThe annual requirement that requires a buyer in a SFP disclose an activity roll forward of outstanding balances as of the end of the reporting period is effective on a retrospective basis for fiscal years beginning after December 15, 2023. Early adoption is not permitted.\nThe Company prospectively adopted the annual rollforward requirement of this ASU beginning with this Annual Report and retrospectively adopted the interim requirements of this ASU on April 1, 2023. This ASU did not have a material impact on the recognition, measurement, or presentation of SFPs in the Company’s annual and interim consolidated financial statements. However, it did result in additional disclosures.\nRefer to Note 14, “Supplier Finance Program,” for further information on the Company’s SFPs\n,\n key terms, activity rollforward, and outstanding balances recorded in the consolidated balance sheets.\nASU 2023-07 - Improvements to Reportable Segment Disclosures\nThe ASU requires annual and interim disclosures of significant segment expenses, including an amount and composition description for other segment items, and how reported measures of profit or loss are used by the CODM in assessing segment performance and deciding how to allocate resources. \nThe ASU is effective on a retrospective basis for fiscal years beginning after December 15, 2023, and interim periods within fiscal years beginning after December 15, 2024. Early adoption is permitted.\nThe Company retrospectively adopted this ASU beginning with this Annual Report. This ASU did not have a material impact on the Company’s consolidated financial statements other than additional disclosures under Note 12, “Reportable Operating Segments.”\nF-12\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\nNot Yet Adopted.\n The following is a summary of each ASU that has been issued and is applicable to the Company, but which has not yet been adopted, as well as the planned period of adoption, and the expected impact on the Company upon adoption:\nStandard\nDescription\nPlanned Period of Adoption\nExpected Impact on Adoption\nASU 2023-09 - Improvements to Income Tax Disclosures\nThe ASU requires annual disclosures of prescribed standard categories for the components of the effective tax rate reconciliation, disclosure of income taxes paid disaggregated by jurisdiction, and other income-tax related disclosures. The ASU is effective on a prospective basis, with retrospective application permitted, for fiscal years beginning after December 15, 2024. Early adoption is permitted.\nQ4 FY 2026\nThe Company is currently evaluating the impact of the adoption of this ASU on its disclosures in its annual and interim consolidated financial statements.\nASU 2024-03 - Disaggregation of Income Statement Expenses (as amended by ASU 2025-01)\nThe ASU requires disaggregated disclosure of relevant statement of comprehensive income expense captions including tabular presentation of prescribed expense categories such as purchases of inventory, employee compensation, depreciation, intangible asset amortization, and other specific expense, gains, and losses required by existing US GAAP. The ASU is effective on a prospective basis, with retrospective application permitted, for fiscal years beginning after December 15, 2026, and interim periods within fiscal years beginning after December 15, 2027. Early adoption is permitted.\nQ4 FY 2028\nand\nQ1 FY 2029\nThe Company is currently evaluating the impact of the adoption of this ASU on its disclosures in its annual and interim consolidated financial statements. \nSummary of Significant Accounting Policies. \nThe following is a summary of the Company’s significant accounting policies applied to its consolidated financial statements:\nCash and Cash Equivalents\n. Cash and cash equivalents include cash on hand, demand deposits, and all highly liquid investments, such as money-market funds, with an original maturity of three months or less. The carrying value of money-market funds approximates the fair value as it is considered a highly liquid investment when purchased. Money-market funds are recorded in cash and cash equivalents in the consolidated balance sheets.\n Refer to Note 4, “Fair Value Measurements,” for further information on the fair value of money-market funds. Refer to Note 13, “Concentration of Business,” for further information on credit risks with respect to the cash and cash equivalents balance. \nAllowances for Doubtful Accounts\n. The Company provides an allowance against trade accounts receivable for estimated losses that may result from customers’ inability to pay. The Company determines the amount of the allowance by analyzing known uncollectible accounts, aged trade accounts receivable, economic conditions and forecasts, historical experience, and the customers’ creditworthiness. Trade accounts receivable that are subsequently determined to be uncollectible are charged or written off against this allowance. The allowance includes specific allowances for trade accounts, for which all or a portion are identified as potentially uncollectible based on known or anticipated losses. Additions to the allowance represent bad debt expense estimates which are recorded in SG&A expenses in the consolidated statements of comprehensive income.\nInventories\n. Inventories, which are primarily comprised of finished goods on hand and in transit, are stated at the lower of cost (weighted moving average) or net realizable value at each financial statement date. Net realizable value is the estimated selling price in the ordinary course of business, less reasonably predictable costs to sell. The Company regularly reviews inventory for excess, obsolete, and impaired inventory to evaluate write-downs to the lower of cost or realizable value.\n \nCloud Computing Arrangements (CCAs)\n. The Company enters into various CCAs that are governed by service contracts (hosting arrangements) to support operations. Application development stage implementation costs (implementation costs) of a hosting arrangement are deferred and recorded to prepaid expenses and other assets in the consolidated balance sheets. Implementation costs are expensed on a straight-line basis and recorded in SG&A expenses in the consolidated statements of comprehensive income over the term of the hosting arrangement, including reasonably certain renewals, which are generally \none\n to \nthree years\n.\n \nF-13\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\nAs of March 31, 2025, net capitalized costs for CCAs are $\n6,031\n, with $\n2,167\n recorded in prepaid expenses and $\n3,864\n recorded in other assets in the consolidated balance sheets. As of March 31, 2024, net capitalized costs for CCAs are $\n4,537\n, with $\n1,534\n recorded in prepaid expenses and $\n3,003\n recorded in other assets in the consolidated balance sheets. Refer to the section titled “Recoverability of Definite-Lived Intangible and Other Long-Lived Assets” below, within this footnote, for detail on an impairment of a CCA recorded during the year ended March 31, 2025.\nProperty and Equipment, Depreciation and Amortization\n. Property and equipment are stated at cost less accumulated depreciation and amortization, and generally have a useful life of at least \none year\n. Property and equipment include tangible, non-consumable items owned by the Company. Software implementation costs are capitalized if they are incurred during the application development stage and relate to costs to obtain computer software from third parties, including related consulting expenses, or costs incurred to modify existing software that results in additional upgrades or enhancements that provide additional functionality. \nDepreciation of property and equipment is calculated using the straight-line method based on the estimated useful life. Leasehold improvements are amortized to their residual value, if any, on the straight-line basis over their estimated economic useful lives or the lease term, whichever is shorter. Changes in the estimate of the useful life of an asset may occur after an asset is placed in service. For example, this may occur as a result of the Company incurring costs that prolong the useful life of an asset, which would be recorded as an adjustment to depreciation over the revised remaining useful life. Depreciation and amortization are recorded in SG&A expenses in the consolidated statements of comprehensive income.\n \nProperty and equipment, net, are summarized as follows:\nAs of March 31,\n \nUseful Life (Years)\n2025\n2024\nLand\nIndefinite\n$\n32,864\n \n$\n32,864\n \nBuilding\n39.5\n41,099\n \n40,058\n \nMachinery and equipment\n1\n-\n10\n282,838\n \n263,200\n \nFurniture and fixtures\n3\n-\n7\n \n47,464\n \n41,336\n \nComputer software\n3\n-\n10\n139,412\n \n130,688\n \nLeasehold improvements\n1\n-\n11\n137,806\n \n128,356\n \nConstruction in progress\n47,080\n \n14,758\n \nGross property and equipment\n728,563\n \n651,260\n \nLess accumulated depreciation and amortization\n(\n402,964\n)\n(\n349,138\n)\nTotal\n$\n325,599\n \n$\n302,122\n \nDepreciation was $\n67,579\n, $\n54,958\n, and $\n45,117\n during the years ended March 31, 2025, 2024, and 2023, respectively.\nOperating Lease Assets and Lease Liabilities\n. The Company determines if an arrangement contains a lease at inception of a contract. The Company recognizes operating lease assets and lease liabilities in the consolidated balance sheets on the lease commencement date, based on the present value of the outstanding lease payments over the reasonably certain lease term. The lease term includes the non-cancelable period at the lease commencement date, plus any additional period covered by the Company’s option to extend (or not to terminate) the lease that is reasonably certain to be exercised, or an option to extend (or not to terminate) a lease that is controlled by the lessor.\nOperating lease assets are initially measured at cost, which comprises the initial amount of the associated lease liabilities, adjusted for lease payments made at or before the lease commencement date, plus any initial direct costs incurred, less any lease incentives, such as tenant allowances. Operating lease assets are subsequently \nF-14\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\nmeasured throughout the lease term at the carrying amount of the associated lease liabilities, plus initial direct costs, plus or minus any prepaid or accrued lease payments, less the unamortized balance of lease incentives received. Operating lease assets and lease liabilities are presented separately in the consolidated balance sheets on a discounted basis. The current portion of operating lease liabilities is presented within current liabilities, while the long-term portion is presented separately as long-term operating lease liabilities. Refer to Note 7, “Commitments and Contingencies,” for further information on the discount rate methodology used to measure operating lease assets and lease liabilities.\nRent expense for operating lease payments is recognized on a straight-line basis over the lease term and recorded in SG&A expenses in the consolidated statements of comprehensive income. Lease payments recorded in the operating lease liabilities (1) are fixed payments, including in-substance fixed payments and fixed rate increases, owed over the lease term and (2) exclude any lease prepayments as of the periods presented. Refer to Note 7, “Commitments and Contingencies,” for further information on the nature of variable lease payments and the timing of recognition of rent expense.\nThe Company has elected not to recognize operating lease assets and lease liabilities for short-term leases, which are defined as those operating leases with a term of 12 months or less. Instead, lease payments for short-term leases are recognized on a straight-line basis over the lease term in rent expense and recorded as a component of SG&A expenses in the consolidated statements of comprehensive income.\nThe Company monitors for events that require a change in estimates for its operating lease assets and lease liabilities, such as modifications to the terms of the contract, including the lease term, economic events that may trigger a contractual term contingency, such as minimum lease payments or termination rights, and related changes in discount rates used to measure the operating lease assets and lease liabilities, as well as events or circumstances that result in lease abandonment or operating lease asset impairments. When a change in estimates results in the remeasurement of the operating lease liabilities, a corresponding adjustment is made to the carrying amount of the operating lease assets. The operating lease assets are remeasured and amortized on a straight-line basis over the remaining lease term, with no impact on the related operating lease liabilities. \nRefer to the section titled “Recoverability of Definite-Lived Intangible and Other Long-Lived Assets” below, within this footnote, for further information on the Company’s accounting policy for evaluating the carrying amount of its operating lease assets and related leasehold improvements for indicators of impairment.\nAsset Retirement Obligations (AROs).\n The Company is contractually obligated under certain of its lease agreements to restore certain retail, office, and warehouse facilities back to their original conditions. At lease inception, the present value of the estimated fair value of these liabilities is recorded along with the related asset. The liability is estimated based on assumptions requiring management’s judgment, including facility closing costs and discount rates, and is accreted to its projected future value over the life of the asset.\nThe Company’s AROs are recorded in other long-term liabilities in the consolidated balance sheets and activity was as follows: \nYears Ended March 31,\n2025\n2024\nBeginning balance\n$\n25,686\n \n$\n24,556\n \nAdditions and changes in estimate\n2,192\n \n2,730\n \nLiabilities settled during the period\n(\n732\n)\n(\n1,724\n)\nAccretion expenses\n927\n \n421\n \nForeign currency translation gains\n45\n \n(\n297\n)\nEnding balance\n$\n28,118\n \n$\n25,686\n \nGoodwill and Indefinite-Lived Intangible Assets\n. Goodwill is initially recorded as the excess of the purchase price over the fair value of the net assets acquired in a business combination. Goodwill and indefinite-lived intangible assets are not amortized but are instead tested for impairment annually, or when an event occurs or \nF-15\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\nchanges in circumstances indicate the carrying value may not be recoverable. The Company evaluates goodwill for impairment annually at the reporting unit level, which is the wholesale channel of each of the UGG and HOKA brands as of December 31st of each year. The Company evaluates the Teva brand indefinite-lived trademark for impairment as of October 31st of each year.\nThe Company first assesses qualitative factors to determine whether it is necessary to perform a quantitative assessment of goodwill or indefinite-lived intangible assets. In general, conditions that may indicate impairment include, but are not limited to the following: (1) a significant adverse change in customer demand or business climate that could affect the value of an asset; (2) change in market share, budget-to-actual performance, and consistency of income from operations as a percentage of net sales (operating margins) and capital expenditures; (3) changes in management or key personnel; or (4) changes in general economic conditions. The Company does not calculate the fair value of the assets unless the Company determines, based on a qualitative assessment, that it is more likely than not that its fair value is less than its carrying amount. If the Company concludes that it is more likely than not that its fair value is less than its carrying amount, then the Company prepares a quantitative assessment. \nThe quantitative assessment requires an analysis of several estimates and assumptions, including future sales and results of operations, discount rates, and other factors that could affect fair value or otherwise indicate potential impairment. The goodwill impairment assessment involves valuing the Company’s various reporting units that carry goodwill. This includes considering the reporting units’ projected ability to generate income from operations and positive cash flow in future periods, as well as perceived changes in customer demand and acceptance of products, or other factors impacting the industry. Upon completion of the quantitative assessment, the Company compares the fair value of the asset to its carrying amount, and if the fair value exceeds its carrying amount, no impairment charge is recognized. If the fair value is less than its carrying amount, the Company will record an impairment charge to write down the asset to its fair value.\n Refer to Note 3, “Goodwill and Other Intangible Assets,” for further information on the Company’s goodwill and indefinite-lived intangible assets and annual impairment assessment results. \nRecoverability of Definite-Lived Intangible and Other Long-Lived Assets\n. Definite-lived intangible and other long-lived assets, which include definite-lived trademarks; machinery and equipment; internal-use software, including CCAs; and operating lease assets and related leasehold improvements are amortized to their estimated residual values, if any, on a straight-line basis over the estimated useful life and reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of the asset group may not be recoverable. Amortization or depreciation are recorded in SG&A expenses in the consolidated statements of comprehensive income.\nAt least quarterly, the Company evaluates factors that would necessitate an impairment assessment, which include a significant adverse change in the extent or manner in which an asset group is used, a significant adverse change in legal factors or the business climate that could affect the value of the asset group or a significant decline in the observable market value of the asset group, among others. When an impairment-triggering event has occurred, the Company tests for recoverability of the asset group’s carrying value using estimates of undiscounted future cash flows based on the existing service potential of the applicable asset group. In determining the service potential of a long-lived asset group, the Company considers its remaining useful life, cash-flow generating capacity, and physical output capacity. These estimates include the undiscounted future cash flows associated with future expenditures necessary to maintain the existing service potential. These assets are grouped with other assets and liabilities at the lowest level for which identifiable cash flows are largely independent of the cash flows of other assets and liabilities.\nRecoverability of definite-lived intangible and other long-lived assets is measured by a comparison of the carrying amount to estimated undiscounted future cash flows expected to be generated by the asset group. If the carrying amount of the asset group exceeds the estimated undiscounted future cash flows, an impairment charge is recognized for the amount by which the carrying amount exceeds the estimated fair value of the asset group, which is based on either discounted future cash flows or appraised values. An impairment loss, if any, would only reduce the carrying amount of the long-lived assets in the asset group based on its fair value limitation and is allocated to \nF-16\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\nindividual assets in the asset group, unless doing so would reduce the carrying amount of a long-lived asset in the asset group to an amount less than zero. Impairment charges are recorded in SG&A expenses in the consolidated statements of comprehensive income.\n Refer to Note 3, “Goodwill and Other Intangible Assets,” for discussion on the Sanuk brand impairment charge recorded during the year ended March 31, 2024.\nDuring the year ended March 31, 2025, the Company recorded impairment charges of $\n4,290\n within unallocated enterprise and shared brand expenses in SG&A expenses in the consolidated statements of comprehensive income, primarily for a CCA that was underperforming against the Company’s expectations. During the years ended March 31, 2024, and 2023, the Company recorded impairment charges of $\n1,015\n and $\n2,817\n, respectively, within its UGG and HOKA brand reportable operating segments in SG&A expenses in the consolidated statements of comprehensive income for the underperformance of certain retail store-related operating lease and related leasehold improvements. \nDerivative Instruments and Hedging Activities\n. The Company may use derivative instruments to partially offset its business exposure to foreign currency risk on expected cash flows and certain existing assets and liabilities, primarily intercompany balances. To reduce the volatility in earnings from fluctuations in foreign currency exchange rates, the Company may hedge a portion of forecasted sales denominated in foreign currencies. The Company enters into foreign currency forward or option contracts (derivative contracts), generally with maturities of \n15\n months\n \nor less to manage foreign currency risk and certain of these derivative contracts are designated as cash flow hedges of forecasted sales (Designated Derivative Contracts). The Company may also enter into derivative contracts that are not designated as cash flow hedges (Non-Designated Derivative Contracts), to offset a portion of anticipated gains and losses on certain intercompany balances until the expected time of repayment. The Company does not use derivative contracts for trading purposes.\nThe notional amounts of outstanding Designated and Non-Designated Derivative Contracts are recorded at fair value measured using Level 2 fair value inputs, consisting of quoted forward spot rates from counterparties at the end of the applicable periods, which are corroborated by market-based pricing, with related assets and liabilities recorded in other current assets and other accrued expenses, respectively, in the consolidated balance sheets. The after-tax unrealized gains or losses from changes in fair value of Designated Derivative Contracts are recorded as a component of accumulated other comprehensive loss (AOCL) in the consolidated balance sheets and are reclassified to net sales in the consolidated statements of comprehensive income in the same period or periods as the related sales are recognized. When it is probable that a forecasted transaction will not occur, the Company discontinues hedge accounting and the accumulated gains or losses in AOCL related to the hedging relationship are immediately recorded in OCI in the consolidated statements of comprehensive income. The Company includes all hedge components in its assessment of effectiveness for its derivative contracts. Refer to Note 4, “Fair Value Measurements,” for further information on the fair value of derivative instruments.\nChanges in the fair value of Non-Designated Derivative Contracts are recorded in SG&A expenses in the consolidated statements of comprehensive income. The changes in fair value for these contracts are generally offset by the remeasurement gains or losses associated with the underlying foreign currency-denominated intercompany balances, which are recorded in SG&A expenses in the consolidated statements of comprehensive income.\nThe Company generally enters into over-the-counter derivative contracts with high-credit-quality counterparties, and therefore, considers the risk that counterparties fail to perform according to the terms of the contract as low. The Company factors the nonperformance risk of the counterparties into the fair value measurements of its derivative contracts.\n Refer to Note 9, “Derivative Instruments,” for further information on the impact of derivative instruments and hedging activities. \nStock Repurchase Program. \nRepurchased shares of the Company’s common stock are retired. The par value of repurchased shares is deducted from common stock and the excess repurchase price over par value as well as the portion due for excise taxes, is allocated to retained earnings in the consolidated balance sheets.\n Refer to Note 10, “Stockholders’ Equity,” for further information on the Company’s stock repurchase program. \nF-17\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\nRevenue Recognition\n. Revenue is recognized when a performance obligation is completed at a point in time and when the customer has obtained control. Control passes to the customer when they have the ability to direct the use of and obtain substantially all the remaining benefits from the goods transferred. The amount of revenue recognized is based on the transaction price, which represents the invoiced amount less known actual amounts or estimates of variable consideration. The Company recognizes revenue and measures the transaction price net of taxes, including sales taxes, use taxes, value-added taxes, and some types of excise taxes, collected from customers and remitted to governmental authorities. The Company presents revenue gross of fees and sales commissions. Sales commissions are expensed as incurred and are recorded in SG&A expenses in the consolidated statements of comprehensive income. The Company’s customer contracts do not have a significant financing component due to their short durations, which are typically effective for \none year\n or less and have payment terms that are generally \n30\n to \n60\n days.\nWholesale and international distributor revenue is recognized either when products are shipped or when delivered, depending on the applicable contract terms. Retail store and e-commerce revenue transactions are recognized at the point of sale and upon shipment, respectively. Shipping and handling costs paid to third-party shipping companies are recorded as cost of sales in the consolidated statements of comprehensive income. Shipping and handling costs are a fulfillment service, and, for certain wholesale and all e-commerce transactions, revenue is recognized when the customer is deemed to obtain control upon the date of shipment.\n Refer to Note 2, “Revenue Recognition,” for further information regarding the Company’s components of variable consideration.\nCost of Sales\n. Cost of sales for the Company’s goods are primarily for finished goods, as well as related overhead. Finished goods includes material costs, including commodities, for products; allocation of initial molds; and tooling cost that are amortized based on minimum contractual quantities of related product and recorded in cost of sales in the consolidated statements of comprehensive income when the product is sold.\n \nDistribution Costs.\n Distribution costs include payroll and related costs, rent and occupancy, depreciation and other related costs, and other miscellaneous expenses for owned warehousing, third-party logistics provider (3PL) service fees, and receiving, inspecting, allocating, and packaging product. Distribution costs are expensed as incurred, and primarily included in unallocated enterprise and shared brand expenses.\n Such costs amounted to $\n279,090\n, $\n238,312\n, and $\n206,191\n for the years ended March 31, 2025, 2024, and 2023, respectively, and are recorded in SG&A expenses in the consolidated statements of comprehensive income. Refer to Note 12, “Reportable Operating Segments,” for further information on the Company’s unallocated enterprise and shared brand expenses. \nResearch and Development Costs\n. Research and development costs include payroll and related costs, and other segment items, which are expensed as incurred, and included within each reportable operating segment, as well as unallocated enterprise and shared brand expenses.\n Such costs amounted to $\n56,676\n, $\n49,171\n, and $\n38,657\n for the years ended March 31, 2025, 2024, and 2023, respectively, and are recorded in SG&A expenses in the consolidated statements of comprehensive income. Refer to Note 12, “Reportable Operating Segments,” for further information on the Company’s unallocated enterprise and shared brand expenses. \nAdvertising, Marketing, and Promotion Expenses\n. Advertising, marketing, and promotion expenses include media advertising (television, radio, print, social, digital), tactical advertising (signs, banners, point-of-sale materials) and other promotional costs specific to the Company’s brands, and amounted to\n \n$\n432,198\n, $\n348,852\n, and $\n271,140\n for the years ended March 31, 2025, 2024 and 2023, respectively, which are recorded in SG&A expenses in the consolidated statements of comprehensive income. Advertising costs are expensed the first time the advertisement is run or communicated. All other costs of advertising, marketing, and promotion are expensed as incurred.\n Included in prepaid expenses as of March 31, 2025, and 2024\n \nare $\n4,045\n and $\n1,130\n, respectively, related to prepaid advertising, marketing, and promotion expenses for programs expected to take place after such dates.\nStock-Based Compensation\n. All of the Company’s stock-based compensation is classified within stockholders’ equity. Stock-based compensation expense is measured at the grant date based on the fair value of the award and is recorded, net of forfeitures, in SG&A expenses in the consolidated statements of comprehensive income ratably over the vesting period. The grant date fair value of time-based restricted stock units (RSUs) and of employees’ \nF-18\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\npurchase rights under the employee stock purchase plans is determined based on the closing market price of the Company’s common stock on the date of grant. The grant date fair value of long-term incentive plan performance-based stock units (LTIP PSUs) is estimated as of the grant date using a Monte Carlo simulation.\nDetermining the fair value and related expense of stock-based compensation requires judgment, including estimating the percentage of awards that will be forfeited and probabilities of meeting the awards’ performance criteria, as well as the Company’s reliance on the closing price of its stock on the New York Stock Exchange at or near the time of grant. If actual forfeitures differ significantly from the estimates or if probabilities change during a period, stock-based compensation expense and the Company’s results of operations could be materially impacted.\n Refer to Note 8, “Stock-Based Compensation,” for further information on grant activity, types of awards, and additional disclosure related to stock-based compensation. \nRetirement Plan\n. The Company provides a 401(k) defined contribution plan that eligible US employees may elect to participate in through tax-deferred contributions or other deferrals. The Company matches \n50\n% of each eligible participant’s deferrals on up to \n6\n% of eligible compensation. Internationally, the Company has various defined contribution plans. Certain international locations require mandatory contributions under social programs, and the Company contributes at least the statutory minimums. US 401(k) matching contributions totaled $\n6,528\n, $\n5,129\n, and $\n4,433\n during the years ended March 31, 2025, 2024, and 2023, respectively, and were recorded in SG&A expenses in the consolidated statements of comprehensive income. In addition, the Company may also make discretionary profit-sharing contributions to the plan.\n However, there were \nno\n Company profit-sharing contributions for the years ended March 31, 2025, 2024, and 2023.\nNon-qualified Deferred Compensation\n. The Company sponsors an unfunded, non-qualified deferred compensation plan (NQDC Plan) that provides certain members of its management team the opportunity to defer compensation into the NQDC Plan. The NQDC Plan year is from January 1st to December 31st. Participants may defer up to \n50\n% of their annual base salary and up to \n85\n% of any cash incentive bonus under the NQDC Plan. The Company has established a rabbi trust as a reserve for the benefits payable under the NQDC Plan. Deferred compensation is recognized based on the fair value of the participants’ accounts.\n Refer to Note 4, “Fair Value Measurements,” for further information on the fair value of deferred compensation assets and liabilities.\nSelf-Insurance\n. The Company is self-insured for a significant portion of its employee medical, including pharmacy, and dental liability exposures. Liabilities for self-insured exposures are accrued for the amounts expected to be paid based on historical claims experience and actuarial data for forecasted settlements of claims filed and for incurred but not yet reported claims. Accruals for self-insured exposures are included in accrued payroll in the consolidated balance sheets. Excess liability insurance has been purchased to limit the amount of self-insured risk on claims.\nIncome Taxes\n. Income taxes are accounted for under the asset and liability method. Deferred tax assets and liabilities are recognized for the future tax consequences attributable to net operating loss carryforwards and temporary differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income during the years in which those temporary differences are expected to be recovered or settled. The effect on deferred taxes of a change in tax rates is recorded in the consolidated statements of comprehensive income in the period that includes the enactment date.\nThe Company recognizes the effect of income tax positions in the consolidated financial statements only if those positions are more likely than not to be sustained upon examination. Recognized income tax positions are measured at the largest amount of tax benefit that is more than 50% likely to be realized upon settlement. Changes in recognition or measurement are recorded in the period in which the change in judgment occurs. The Company records interest and penalties accrued for income tax contingencies as interest expense in the consolidated statements of comprehensive income.\n Refer to Note 5, “Income Taxes,” for further information on tax impacts and components of tax balances in the consolidated financial statements. \nF-19\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\nComprehensive Income\n. Comprehensive income or loss is the total of net earnings and all other non-owner changes in equity. Comprehensive income or loss includes net income or loss, foreign currency translation adjustments, and unrealized gains and losses on cash flow hedges.\n Refer to Note 10, “Stockholders’ Equity,” for further information on components of OCI.\nNet Income per Share\n. Basic net income or loss per share represents net income or loss divided by the weighted-average number of common shares outstanding for the period. Diluted net income or loss per share represents net income or loss divided by the weighted-average number of shares outstanding, including the dilutive impact of potential issuances of common stock.\n Refer to Note 11, “Basic and Diluted Shares,” for a reconciliation of basic to diluted weighted-average common shares outstanding.\nNOTE 2. \nREVENUE RECOGNITION\nDisaggregated Revenue\n. Refer to Note 12, “Reportable Operating Segments,” and to Note 13, “Concentration of Business,” for further information on the Company’s disaggregation of revenue by reportable operating segment and by geographic location, respectively.\nNet sales by channel was as follows:\n \nYears Ended March 31,\n2025\n2024\n2023\nWholesale\n$\n2,855,865\n \n$\n2,432,307\n \n$\n2,160,675\n \nDirect-to-Consumer\n2,129,747\n \n1,855,456\n \n1,466,611\n \nTotal\n$\n4,985,612\n \n$\n4,287,763\n \n$\n3,627,286\n \nVariable Consideration\n. Components of variable consideration include estimated allowance for sales discounts, allowance for chargebacks, and sales return asset and liability. Estimates for variable consideration are based on the amounts earned or estimates to be claimed as an adjustment to sales. Estimated variable consideration is included in the transaction price to the extent it is probable that a significant reversal of the cumulative revenue recognized will not occur in a future period. \nAllowance for Sales Discounts. \nThe Company provides a trade accounts receivable allowance for sales discounts for wholesale channel sales, which reflects a discount that customers may take, generally based on meeting certain order, shipment or prompt payment terms. The Company uses the amount of the discounts that are available to be taken against the period end trade accounts receivable to estimate and record a corresponding reserve for sales discounts. Additions to the allowance are recorded against gross sales in the consolidated statements of comprehensive income. \nAllowance for Chargebacks. \nThe Company provides a trade accounts receivable allowance for chargebacks for wholesale channel sales. When customers pay their invoices, they may take deductions against their invoices that can include chargebacks for price differences, markdowns, short shipments, and other reasons. Therefore, the Company records an allowance primarily for known circumstances as well as unknown circumstances based on historical trends related to the timing and amount of chargebacks taken against customer invoices. Additions to the allowance are recorded against gross sales or SG&A expenses in the consolidated statements of comprehensive income. \nSales Return Asset and Liability\n. Reserves are recorded for anticipated future returns of goods shipped prior to the end of the reporting period. In general, the Company accepts returns for damaged or defective products for up to one year. The Company also has a policy whereby returns are generally accepted from customers and end consumers between 30 to 90 days from the point of sale for cash or credit.\nF-20\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\nSales returns are a refund asset for the right to recover the inventory and a refund liability for the stand-ready right of return. Changes to the refund asset for the right to recover the inventory are recorded against cost of sales and changes in the refund liability are recorded against gross sales in the consolidated statements of comprehensive income. The refund asset for the right to recover the inventory is recorded in other current assets and the related refund liability is recorded in other accrued expenses in the consolidated balance sheets. The amounts of these reserves are determined based on several factors, including known and actual returns, historical returns, and any recent events that could result in a change from historical return rates.\nThe following table summarizes changes in the estimated sales returns for the periods presented:\nSales Return Asset\nSales Return Liability\nBalance, March 31, 2023\n$\n15,685\n \n$\n(\n45,322\n)\nNet additions to sales return liability\n (1)\n60,789\n \n(\n276,086\n)\nActual returns\n(\n62,608\n)\n266,081\n \nBalance, March 31, 2024 \n(2)\n13,866\n \n(\n55,327\n)\nNet additions to sales return liability\n (1)\n74,150\n \n(\n306,968\n)\nActual returns\n(\n66,896\n)\n298,833\n \nBalance, March 31, 2025 \n(2)\n$\n21,120\n \n$\n(\n63,462\n)\n(1) \nNet additions to the sales return liability include a provision for anticipated sales returns, which consists of both contractual return rights and discretionary authorized returns.\n(2)\n As of March 31, 2025, and 2024, the sales return liability includes $\n47,216\n and $\n37,458\n, respectively, for the wholesale channel and $\n16,246\n and $\n17,869\n, respectively, for the DTC channel.\nContract Liabilities\n. Contract liabilities are performance obligations that the Company expects to satisfy or relieve within the next 12 months, advance consideration obtained prior to satisfying a performance obligation, or unconditional obligations to provide goods or services under non-cancelable contracts before the transfer of goods or services to the customer has occurred. Contract liabilities are recorded in other accrued expenses in the consolidated balance sheets and include loyalty programs and other deferred revenue. \nLoyalty Programs\n. The Company has a loyalty program for the UGG brand in its DTC channel where consumers can earn rewards from qualifying purchases or activities. The Company defers recognition of revenue for unredeemed awards until one of the following occurs: (1) rewards are redeemed by the consumer, (2) points or certificates expire, or (3) an estimate of the expected unused portion of points or certificates is applied, which is based on historical redemption and expiration patterns. The Company’s contract liability for loyalty programs is recorded in other accrued expenses in the consolidated balance sheets.\n \nActivity related to loyalty programs was as follows: \nYears Ended March 31,\n2025\n2024\nBeginning balance\n$\n(\n17,586\n)\n$\n(\n13,144\n)\nRedemptions and expirations for loyalty certificates and points recognized in net sales\n68,080\n \n52,884\n \nDeferred revenue for loyalty points and certificates issued\n(\n69,060\n)\n(\n57,326\n)\nEnding balance\n$\n(\n18,566\n)\n$\n(\n17,586\n)\nDeferred Revenue\n. Revenue is deferred for wholesale channel transactions when certain conditions outlined within the contract terms, including the transfer of control or delivery of product, has not occurred, such as when a wholesale channel customer prepays for ordered product. The contract liability for deferred revenue is recorded in other accrued expenses in the consolidated balance sheets.\n \nF-21\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\nActivity related to deferred revenue was as follows: \nYears Ended March 31,\n2025\n2024\nBeginning balance\n$\n(\n9,591\n)\n$\n(\n13,448\n)\nAdditions of customer cash payments\n(\n80,732\n)\n(\n61,844\n)\nRevenue recognized\n63,018\n \n65,701\n \nEnding balance\n$\n(\n27,305\n)\n$\n(\n9,591\n)\nNOTE 3. \nGOODWILL AND OTHER INTANGIBLE ASSETS\nGoodwill as well as other intangible assets by major intangible class recorded in the consolidated balance sheets are as follows:\nAs of March 31,\n2025\n2024\nGoodwill\nGross carrying amount \n(1)\n$\n29,821\n \n$\n143,765\n \nAccumulated impairment losses \n(1)\n(\n15,831\n)\n(\n129,775\n)\nTotal goodwill \n(2)\n$\n13,990\n \n$\n13,990\n \nAs of March 31,\n2025\n2024\nOther intangible assets\nIndefinite-lived intangible assets\nTeva brand trademark\n$\n15,454\n \n$\n15,454\n \nDefinite-lived intangible assets\nTrademarks \n(1)\n8,014\n \n51,723\n \nOther \n(1)\n17,245\n \n51,220\n \nTotal gross carrying amount\n25,259\n \n102,943\n \nTrademarks accumulated amortization and impairments \n(1)\n(\n7,982\n)\n(\n40,326\n)\nOther accumulated amortization \n(1)\n(\n17,032\n)\n(\n50,988\n)\nTotal accumulated amortization and impairments\n(\n25,014\n)\n(\n91,314\n)\nDefinite-lived intangible assets, net\n245\n \n11,629\n \nTotal other intangible assets, net\n$\n15,699\n \n$\n27,083\n \n(1)\n The change in the March 31, 2025, balances, when compared to March 31, 2024, is primarily due to the sale of the Sanuk brand during fiscal year 2025.\n(2)\n As of March 31, 2025, and 2024, total goodwill is made up of $\n6,101\n and \n7,889\n of UGG brand and HOKA brand reportable operating segments goodwill, respectively.\nDefinite-lived amortization expense was $\n847\n, $\n2,208\n, and $\n2,228\n for the years ended March 31, 2025, 2024, and 2023, respectively.\nBased on the evaluation of qualitative and quantitative factors, including the asset carrying amounts recorded in the consolidated balance sheets against actual results of operations and long-term forecasts of net sales and operating income, \nno\n impairment loss was recorded for goodwill and indefinite-lived intangible assets during the years ended March 31, 2025, 2024, and 2023.\nF-22\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\nNo\n definite-lived intangible asset triggering events were identified during the years ended March 31, 2025, and 2023. During the year ended March 31, 2024, an impairment loss of $\n8,164\n was recorded within the Other brands reportable operating segment in SG&A expenses in the consolidated statements of comprehensive income for the Sanuk brand definite-lived trademark, driven by lower-than-expected results of operations for the wholesale channel that resulted in the carrying value exceeding the estimated fair value, which was determined based on an estimate of the future discounted cash flows.\n \nNOTE 4. \nFAIR VALUE MEASUREMENTS\nThe accounting standard for fair value measurements provides a framework for measuring fair value, which is defined as the price that would be received for an asset or the exit price that would be paid to transfer a liability in the principal or most advantageous market in an orderly transaction between market participants on the measurement date. The fair value hierarchy under this accounting standard requires an entity to maximize the use of observable inputs, where available. \nThe following summarizes the three levels of inputs required:\n•\nLevel 1: Quoted prices in active markets for identical assets and liabilities.\n•\nLevel 2: Observable inputs other than quoted prices in active markets for identical assets and liabilities.\n•\nLevel 3: Unobservable inputs in which little or no market activity exists, therefore requiring the Company to develop its own assumptions.\nThe carrying amount of the Company’s financial instruments, which principally include cash and cash equivalents, trade accounts receivable, net, trade accounts payable, accrued payroll, and other accrued expenses, approximates fair value due to their short-term nature. When the Company makes short-term borrowings, the carrying amounts, which are considered Level 2 liabilities, approximate fair value based upon current rates and terms available to the Company for similar debt. The Company does not currently have any Level 3 assets or liabilities.\nAssets and liabilities that are measured on a recurring basis at fair value in the consolidated balance sheets are as follows:\nAs of\nMeasured Using\nMarch 31, 2025\nLevel 1\nLevel 2\nLevel 3\nAssets:\nCash equivalents:\nMoney-market funds\n$\n1,485,555\n \n$\n1,485,555\n \n$\n—\n \n$\n—\n \nOther current assets:\nDesignated Derivative Contracts asset\n2,163\n \n—\n \n2,163\n \n—\n \nNon-Designated Derivative Contracts asset\n75\n \n—\n \n75\n \n—\n \nOther assets:\nNon-qualified deferred compensation asset\n16,967\n \n16,967\n \n—\n \n—\n \nTotal assets measured at fair value\n$\n1,504,760\n \n$\n1,502,522\n \n$\n2,238\n \n$\n—\n \nF-23\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\nAs of\nMeasured Using\nMarch 31, 2025\nLevel 1\nLevel 2\nLevel 3\nLiabilities:\nOther accrued expenses:\nNon-qualified deferred compensation liability\n$\n(\n2,345\n)\n$\n(\n2,345\n)\n$\n—\n \n$\n—\n \nDesignated Derivative Contracts liability\n(\n64\n)\n—\n \n(\n64\n)\n—\n \nOther long-term liabilities:\nNon-qualified deferred compensation liability\n(\n22,793\n)\n(\n22,793\n)\n—\n \n—\n \nTotal liabilities measured at fair value\n$\n(\n25,202\n)\n$\n(\n25,138\n)\n$\n(\n64\n)\n$\n—\n \nAs of\nMeasured Using\nMarch 31, 2024\nLevel 1\nLevel 2\nLevel 3\nAssets:\nCash equivalents:\nMoney-market funds\n$\n1,152,083\n \n$\n1,152,083\n \n$\n—\n \n$\n—\n \nOther assets:\nNon-qualified deferred compensation asset\n13,553\n \n13,553\n \n—\n \n—\n \nTotal assets measured at fair value\n$\n1,165,636\n \n$\n1,165,636\n \n$\n—\n \n$\n—\n \nLiabilities:\nOther accrued expenses:\nNon-qualified deferred compensation liability\n$\n(\n408\n)\n$\n(\n408\n)\n$\n—\n \n$\n—\n \nOther long-term liabilities:\nNon-qualified deferred compensation liability\n(\n16,229\n)\n(\n16,229\n)\n—\n \n—\n \nTotal liabilities measured at fair value\n$\n(\n16,637\n)\n$\n(\n16,637\n)\n$\n—\n \n$\n—\n \nThe Company’s non-financial assets, such as other long-lived assets and definite-lived intangible assets, which include operating lease assets, machinery and equipment, leasehold improvements, definite-lived trademarks; as well as indefinite-lived intangible assets and goodwill, are not required to be carried at fair value on a recurring basis and are reported at carrying value. Instead, these assets are tested for impairment annually, or when an event occurs or changes in circumstances indicate the carrying value may not be recoverable. When determining fair value, Level 3 measurements are used for the estimates and assumptions, including undiscounted future cash flows expected to be generated by the asset groups based upon historical experience, expected market conditions, as well and management’s plans.\nF-24\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\nNOTE 5. \nINCOME TAXES\nIncome Before Income Taxes\n. \nComponents of income before income taxes recorded in the consolidated statements of comprehensive income were as follows:\nYears Ended March 31,\n2025\n2024\n2023\nDomestic \n(1)\n$\n1,033,428\n \n$\n688,981\n \n$\n467,231\n \nForeign\n209,871\n \n289,960\n \n198,851\n \nTotal\n$\n1,243,299\n \n$\n978,941\n \n$\n666,082\n \n(1)\n Domestic income before income taxes for the year ended March 31, 2024 is presented net of intercompany dividends (or repatriated cash) of $\n250,000\n. \nNo\n intercompany dividends (or repatriated cash) that were subject to income taxes from a foreign subsidiary were declared during years ended March 31, 2025 and 2023.\nIncome Tax Expense\n. \nComponents of income tax expense (benefit) recorded in the consolidated statements of comprehensive income were as follows:\nYears Ended March 31,\n2025\n2024\n2023\nCurrent\nFederal\n$\n177,652\n \n$\n146,939\n \n$\n115,708\n \nState\n43,847\n \n32,065\n \n18,418\n \nForeign\n61,254\n \n41,884\n \n24,853\n \nTotal\n282,753\n \n220,888\n \n158,979\n \nDeferred\nFederal\n(\n1,134\n)\n(\n3,113\n)\n4,830\n \nState\n219\n \n(\n2,336\n)\n382\n \nForeign\n(\n4,630\n)\n3,939\n \n(\n14,931\n)\nTotal\n(\n5,545\n)\n(\n1,510\n)\n(\n9,719\n)\nTotal\n$\n277,208\n \n$\n219,378\n \n$\n149,260\n \nIncome Tax Expense Reconciliation. \nIncome tax expense (benefit) differed from that obtained by applying the statutory federal income tax rate to income before income taxes as follows:\nYears Ended March 31,\n2025\n2024\n2023\nComputed expected income taxes\n$\n261,093\n \n$\n205,578\n \n$\n139,882\n \nState income taxes, net of federal income tax benefit\n45,991\n \n32,023\n \n15,881\n \nForeign rate differential\n(\n13,078\n)\n(\n15,976\n)\n(\n21,420\n)\nGross unrecognized tax benefits\n(\n1,594\n)\n1,301\n \n20,122\n \nIntercompany transfers of assets\n10,430\n \n(\n1,817\n)\n(\n13,072\n)\nUS tax on foreign earnings\n(\n14,548\n)\n4,750\n \n7,672\n \nOther\n(\n11,086\n)\n(\n6,481\n)\n195\n \nTotal\n$\n277,208\n \n$\n219,378\n \n$\n149,260\n \nF-25\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\nDeferred Taxes\n. \nThe tax effects of temporary differences that give rise to significant portions of deferred tax assets and deferred tax liabilities are as follows:\nAs of March 31,\n2025\n2024\nDeferred tax assets\nAmortization of intangible assets\n$\n12,413\n \n$\n11,416\n \nOperating lease liabilities\n38,051\n \n38,890\n \nUniform capitalization adjustment to inventory\n10,723\n \n11,822\n \nState related taxes and credit carryforwards\n3,107\n \n1,834\n \nReserves and accruals\n69,803\n \n65,817\n \nNet operating loss carry-forwards\n10,421\n \n5,981\n \nOther\n1,188\n \n3,164\n \nGross deferred tax assets\n145,706\n \n138,924\n \nValuation allowances\n(\n5,138\n)\n(\n1,259\n)\nTotal\n140,568\n \n137,665\n \nDeferred tax liabilities\nPrepaid expenses\n(\n8,727\n)\n(\n7,060\n)\nOperating lease assets\n(\n29,189\n)\n(\n29,667\n)\nDepreciation of property and equipment\n(\n23,359\n)\n(\n28,354\n)\nOther\n(\n1,702\n)\n—\n \nTotal\n(\n62,977\n)\n(\n65,081\n)\nDeferred tax assets, net\n$\n77,591\n \n$\n72,584\n \nThe deferred tax assets are currently expected to be realized between fiscal years 2026 and 2031. Based on the level of historical taxable income and projections for future taxable income over the periods in which the deferred tax assets are deductible, management believes it is more likely than not that the results of future operations will generate sufficient taxable income to realize the net deferred tax assets. The Company’s deferred tax valuation allowances are primarily the result of a valuation allowance on tax attributes and foreign losses in jurisdictions in which the Company expects it will have limited future profitability. The changes to the Company’s deferred tax valuation allowances are primarily the result of a valuation allowance on domestic tax attributes.\nUS Taxation of Foreign Earnings\n. The Company is subject to US taxation of its foreign subsidiary earnings, which is considered global intangible low-taxed income (commonly known as GILTI), as well as limitations on the deductions of executive compensation, which are included in income tax expense in the consolidated statements of comprehensive income for the periods presented above. \nThe Company currently anticipates repatriating current and future unremitted earnings of non-US subsidiaries, to the extent they have been and will be subject to US income tax, as long as such cash is not required to fund ongoing foreign operations. Due to the complexities in the laws of foreign jurisdictions, it is not practicable to estimate the amount of foreign withholding taxes associated with such unremitted earnings. \nNo\n intercompany dividends were declared by the Company from a foreign subsidiary with related foreign withholding tax requirements during the year ended March 31, 2025.\nAs of March 31, 2025, the Company has $\n16,346\n of undistributed earnings and $\n481,836\n of cash and cash equivalents from its non-US subsidiaries, a portion of which may be subject to additional foreign withholding taxes if it were to be repatriated. As of March 31, 2025, the Company has $\n1,839\n \nof accumulated deficit from its non-US subsidiaries for which no US federal or state income taxes have been paid.\nF-26\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\nRecent Tax Law Changes. \nThe Organization for Economic Co-operation and Development (commonly known as OECD) has released Pillar Two model rules introducing a 15% global minimum tax rate for large multinational corporations to be effective starting with tax periods ending in 2024. Various jurisdictions in which the Company operates have enacted or plan to enact legislation beginning in calendar year 2024 or in subsequent years. The enactment of Pillar Two legislation did not have a material effect on the Company’s consolidated statements of comprehensive income during the current period. The Company will continue to monitor and reflect the impact of such legislative changes in future periods, as each of the respective jurisdictions enact the legislation and the legislation becomes effective.\nUnrecognized Tax Benefits\n. When tax returns are filed, some positions taken are subject to uncertainty about the merits of the position taken or the amount that would be ultimately sustained upon examination. The benefit of a tax position is recorded in the consolidated financial statements during the period in which the Company believes it is more likely than not that the position will be sustained upon examination by taxing authorities. The recognition threshold is measured as the largest amount of tax benefit that is more than 50% likely to be realized upon settlement. The portion of the benefit that exceeds the amount measured, as described above, is recorded as a liability for unrecognized tax benefits, along with any associated interest and penalties, in the consolidated balance sheets. \nA reconciliation of the beginning and ending amounts of total gross unrecognized tax benefits are as follows:\nYears Ended March 31,\n2025\n2024\n2023\nBeginning balance\n$\n45,620\n \n$\n44,901\n \n$\n24,779\n \nGross increase related to current year tax positions\n4,499\n \n4,318\n \n6,865\n \nGross increase related to prior year tax positions\n4,662\n \n4,629\n \n16,243\n \nGross decrease related to prior year tax positions\n(\n4,309\n)\n(\n4,698\n)\n(\n456\n)\nSettlements with taxing authorities\n(\n22,793\n)\n(\n582\n)\n—\n \nLapse of statute of limitations\n(\n6,446\n)\n(\n2,948\n)\n(\n2,530\n)\nEnding balance\n$\n21,233\n \n$\n45,620\n \n$\n44,901\n \nTotal gross unrecognized tax benefits recorded in the consolidated balance sheets are as follows:\nAs of March 31,\n2025\n2024\nCurrent liability\nIncome tax payable\n$\n5,688\n \n$\n3,998\n \nLong-term liability\nIncome tax liability\n15,545\n \n41,622\n \nTotal\n$\n21,233\n \n$\n45,620\n \nNet unrecognized tax benefits are defined as gross unrecognized tax benefits, less federal benefit for state income taxes, related to uncertain tax positions taken in the Company’s income tax return that would impact the Company’s effective tax rate, if recognized. Management believes it is reasonably possible that the amount of net unrecognized tax benefits, as well as associated interest and penalties, may decrease during the next 12 months by $\n2,858\n, which includes amounts relating to expirations of statute of limitations and settlements of various tax matters. Of this amount, $\n2,649\n would result in an income tax benefit for the Company and $\n209\n would result in a decrease to interest expense in the consolidated statements of comprehensive income.\nAs of March 31, 2025, and 2024, the Company has accrued $\n3,424\n \nand $\n6,314\n for the payment of interest and penalties, respectively, in income tax liability in the consolidated balance sheets. During the years ended March 31, 2025, 2024, and 2023, the Company recorded $(\n2,890\n), $\n486\n, and $\n1,106\n, respectively, of interest and penalties as a (decrease) or increase to interest expense in the consolidated statements of comprehensive income.\nF-27\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\nThe Company has on-going income tax examinations in various state and foreign tax jurisdictions and regularly assesses tax positions taken during years open to examination. The Company files income tax returns in the US federal jurisdiction and various state, local, and foreign jurisdictions. With few exceptions, the Company is no longer subject to US federal, state, local, or foreign income tax examinations by tax authorities before fiscal year 2021. \nAlthough the Company believes its tax estimates are reasonable and prepares its tax filings in accordance with all applicable tax laws, the final determination with respect to any tax audits, and any related litigation, could be materially different from the Company’s estimates or from its historical income tax provisions and accruals. The results of an audit or litigation could have a material impact on results of operations or cash flows in the periods for which that determination is made. In addition, future period earnings may be adversely impacted by litigation costs, settlements, penalties, or interest assessments. However, management does not currently expect any such audits and inquiries to have a material impact on the Company’s consolidated financial statements.\nNOTE 6. \nREVOLVING CREDIT FACILITIES \nPrimary Credit Facility\n. In December 2022, the Company refinanced in full and terminated its prior credit agreement originally entered into in September 2018. The refinanced revolving credit facility agreement is with Citibank, N.A. (Citibank), as administrative agent, Comerica Bank, as sole syndication agent, and the lenders party thereto (Credit Agreement). The Credit Agreement provides for a \nfive-year\n, $\n400,000\n unsecured revolving credit facility (Primary Credit Facility), contains a $\n25,000\n sublimit for the issuance of letters of credit, and matures on December 19, 2027, subject to extension on early termination as described in the Credit Agreement.\nIn addition to allowing borrowings in US dollars, the Primary Credit Facility provides a $\n175,000\n sublimit for borrowings in Euros, Sterling, Canadian dollars, and any other foreign currency that is subsequently approved by Citibank, each lender, and each bank issuing letters of credit. Subject to customary conditions, the Company has the option to increase the maximum principal amount available up to an additional $\n300,000\n, resulting in a maximum available principal amount of $\n700,000\n. However, none of the lenders have committed at this time to provide any such increase in the commitment.\nThe obligations of the Company and each other borrower under the Primary Credit Facility are guaranteed by the Company’s existing and future wholly owned domestic subsidiaries that meet certain materiality thresholds, subject to limited exceptions. All obligations under the Primary Credit Facility and the foregoing guaranty are unsecured, and amounts borrowed may be prepaid at any time without a premium or penalty, subject to limited exceptions. \nCertain of the Company’s foreign subsidiaries may also borrow under the Primary Credit Facility, which permits the Company, subject to customary conditions, to designate one or more additional subsidiaries organized in foreign jurisdictions to borrow. The Company is liable for the obligations of each foreign borrower, but the obligations of the foreign borrowers are several (not joint) in nature. \nInterest Rate Terms. \nAt the Company’s election, revolving loans issued under the Primary Credit Facility will bear interest at the adjusted term SOFR, the adjusted Euro InterBank Offered Rate (EURIBOR), the Sterling Overnight Index Average (SONIA), the Canadian Dollar Offered Rate (CDOR), or the adjusted Alternate Base Rate (ABR), in each case plus the applicable interest rate margin. \nInterest for borrowings in US dollars will fluctuate between SOFR, plus \n1.00\n% and \n0.10\n% based on the Company’s total net leverage ratio, and ABR, plus \n0\n% per annum. The applicable interest rate margin is based on a pricing grid based on the Company’s total net leverage ratio and ranges from \n1.00\n% to \n1.625\n% per annum in the case of loans based on the SOFR, EURIBOR, SONIA, or CDOR, and from \n0.00\n% to \n0.625\n% per annum in the case of loans based on ABR. As of March 31, 2025, the effective interest rates for SOFR and ABR are \n5.40\n% and \n7.50\n%, respectively.\nF-28\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\nCommitment Fees.\n The Company is required to pay a fee rate that fluctuates between \n0.125\n% and \n0.20\n% per annum on the daily unused amount of the Primary Credit Facility, with the exact commitment fee based on the Company’s total net leverage ratio. \nBorrowing Activity. \nDuring the year ended March 31, 2025, the Company made \nno\n borrowings or repayments under the Primary Credit Facility. As of March 31, 2025, the Company has \nno\n outstanding balance, $\n955\n of outstanding letters of credit, and available borrowings of $\n399,045\n under the Primary Credit Facility.\nChina Credit Facility\n. In October 2021, Deckers (Beijing) Trading Co., LTD (DBTC), a wholly owned subsidiary of the Company, entered into a credit agreement in China (as amended, the China Credit Facility) that provides for an uncommitted revolving line of credit of up to CNY\n300,000\n, or\n \n$\n41,338\n, with an overdraft facility sublimit of CNY\n100,000\n, or\n \n$\n13,779\n.\n \nThe China Credit Facility is payable on demand and subject to annual review with a defined aggregate period of borrowing of up to \n24\n months, which was amended to increase from \n12\n months in November 2023. The obligations under the China Credit Facility are guaranteed by the Company for \n108.5\n% of the facility amount in US dollars. \nInterest Rate Terms. \nInterest is based on the People’s Bank of China market rate multiplied by a variable liquidity factor. As of March 31, 2025, the effective interest rate is \n3.40\n%. \nBorrowing Activity. \nDuring the year ended March 31, 2025, the Company made \nno\n borrowings or repayments under the China Credit Facility. As of March 31, 2025, the Company has \nno\n \noutstanding\n \nbalance,\n \noutstanding bank guarantees of $\n455\n, and available borrowings of $\n40,883\n under the China Credit Facility. \nDebt Covenants. \nUnder the Credit Agreement, the Company is subject to usual and customary representations and warranties, and contains usual and customary affirmative and negative covenants, which include limitations on liens, additional indebtedness, investments, restricted payments, indemnification provisions in favor of the lenders and transactions with affiliates. The financial covenant requires the total net leverage ratio to be no greater than \n3.75\n to \n1.00\n.\nUnder the Credit Agreement, the Company is also subject to other customary limitations, as well as usual and customary events of default, which include non-payment of principal, interest, fees and other amounts; breach of a representation or warranty; non-performance of covenants and obligations; default on other material debt; bankruptcy or insolvency; material judgments; incurrence of certain material Employee Retirement Income Security Act of 1974 (ERISA) liabilities; and a change of control of the Company.\nUnder the China Credit Facility, DBTC is subject to usual and customary representations and warranties, and usual and customary affirmative and negative covenants, which include limitations on liens and additional indebtedness.\nAs of March 31, 2025, the Company is in compliance with all financial covenants under the Primary Credit Facility and China Credit Facility.\nNOTE 7. \nCOMMITMENTS AND CONTINGENCIES\nLeases\n. The Company primarily leases retail stores, showrooms, offices, and distribution facilities under operating lease contracts which vary in lease terms but, in the aggregate, continue in effect through calendar year 2035. Some of the Company’s operating leases contain extension options between \none\n to \n15\n years. Historically, the Company has not entered into finance leases and its lease agreements generally do not contain residual value guarantees, options to purchase underlying assets, or material restrictive covenants.\nF-29\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\nVariable Lease Payments.\n Certain leases require additional payments based on (1) actual or forecasted sales volume (either monthly or annually), (2) reimbursement for real estate taxes (tax), (3) common area maintenance (CAM), and (4) insurance (collectively, variable lease payments). Variable lease payments are generally excluded from operating lease assets and lease liabilities and are recorded in rent expense as a component of SG&A expenses in the consolidated statements of comprehensive income. Some leases are dependent upon forecasted annual sales volume, and lease payments are recognized on a straight-line basis as rent expense over each annual period when the achievement of the related sales target is reasonably likely to occur. Other variable lease payments, such as tax, CAM, and insurance, are recognized in rent expense as incurred. Some leases contain one fixed lease payment that include variable lease payments, which are considered non-lease components. The Company has elected to account for these instances as a single lease component and the total of these fixed payments is used to measure the operating lease assets and lease liabilities. \nDiscount Rate\n. The Company discounts its unpaid lease payments using the interest rate implicit in the lease or, if the rate cannot be readily determined, its IBR. Generally, the Company cannot determine the interest rate implicit in the lease because it does not have access to the lessor’s estimated residual value or the amount of the lessor’s deferred initial direct costs. The Company has a centralized treasury function, which enables the Company to use a portfolio approach to discount lease obligations. Therefore, the Company generally derives a discount rate at the lease commencement date by utilizing its IBR, which is based on what the Company would have to pay on a collateralized basis to borrow an amount equal to its lease payments under similar terms. Because the Company does not currently borrow on a collateralized basis under its revolving credit facilities, it uses the interest rate it pays on its non-collateralized borrowings under its Primary Credit Facility as an input for deriving an appropriate IBR, adjusted for the amount of the lease payments, the lease term, and the effect on that rate of designating specific collateral with a value equal to the unpaid lease payments for that lease.\nRent Expense\n. The components of rent expense for operating leases recorded in SG&A expenses in the consolidated statements of comprehensive income were as follows:\nYears Ended March 31,\n2025\n2024\n2023\nOperating\n$\n68,020\n \n$\n64,006\n \n$\n52,961\n \nVariable\n39,284\n \n40,615\n \n30,309\n \nShort-term\n9,912\n \n6,931\n \n5,729\n \nTotal\n$\n117,216\n \n$\n111,552\n \n$\n88,999\n \nOperating Lease Liabilities\n. \nMaturities of undiscounted operating lease liabilities remaining as of March 31, 2025, with a reconciliation to the present value of operating lease liabilities recorded in the consolidated balance sheets, are as follows:\nYears Ending March 31,\nAmount\n2026\n$\n62,445\n \n2027\n67,077\n \n2028\n56,414\n \n2029\n42,019\n \n2030\n29,538\n \nThereafter\n60,330\n \nTotal undiscounted future lease payments\n317,823\n \nLess: Imputed interest\n(\n40,848\n)\nTotal\n$\n276,975\n \nF-30\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\nOperating lease liabilities recorded in the consolidated balance sheets as of March 31, 2025, exclude an aggregate of $\n10,096\n of undiscounted minimum lease payments due pursuant to leases signed, but not yet commenced, primarily for new HOKA brand retail stores and a regional office, for which the leases are expected to commence in the first quarter of fiscal year ending March 31, 2026 (next fiscal year).\nSupplemental Disclosure\n. Key estimates and judgments related to operating lease assets and lease liabilities that are outstanding and presented in the consolidated balance sheets are as follows:\nAs of March 31,\n2025\n2024\nWeighted-average remaining lease term in years\n5.5\n5.9\nWeighted-average discount rate\n4.5\n \n%\n3.9\n \n%\nSupplemental information for amounts presented in the consolidated statements of cash flows related to operating leases, were as follows:\nYears Ended March 31,\n2025\n2024\n2023\nNon-cash operating activities \n(1)\nOperating lease assets obtained in exchange for lease liabilities\n$\n70,179\n \n$\n78,255\n \n$\n84,988\n \nReductions to operating lease assets for reductions to lease liabilities\n(\n2,096\n)\n(\n8,418\n)\n(\n1,903\n)\n(1)\n Amounts disclosed include non-cash additions or reductions resulting from lease remeasurements, as well as reductions for tenant improvement allowances.\nPurchase Obligations. \nThe Company has various types of purchase obligations, as follows:\nProduct\n. As of March 31, 2025, the Company has $\n956,911\n of outstanding purchase orders or other obligations with independent third-party contractors that manufacture all of its products (independent manufacturers). These obligations consist mostly of open purchase orders that are expected to be fulfilled in the ordinary course of business and to be paid in less than one fiscal year. A significant portion of the purchase commitments can be cancelled by the Company under certain circumstances; however, the occurrence of such circumstances is generally limited. As a result, the amount does not necessarily reflect the dollar amount of the Company’s binding commitments or minimum purchase obligations for products, and instead reflects an estimate of its future payment commitments based on information currently available.\nCommodities\n. The Company has entered into fixed purchasing contracts with affiliates, manufacturers, factories, and other agents (designated suppliers) of sheepskin and sugarcane-derived ethylene-vinyl acetate (EVA), requiring its designated suppliers to purchase commodities on or before a specified target date, generally within \none\n to \ntwo years\n (collectively, commodity contracts). The Company’s fixed pricing agreements are non-cancellable and may be subject to fees, including certain sheepskin purchasing contracts requiring deposits when minimum volumes are not fully consumed. \nAs of March 31, 2025, the Company’s aggregated estimated future payment obligations are $\n231,323\n for commitments under these commodity contracts, of which $\n7,412\n is due in less than one fiscal year and the remainder $\n223,911\n is due in one to three fiscal years. As of March 31, 2025, the Company had \nno\n outstanding deposits on supply agreements. As of March 31, 2024, the Company had $\n16,243\n in outstanding deposits on supply agreements, which were refunded and received by the Company during the year ended March 31, 2025. \nF-31\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\nOthe\nr. Other purchase commitments include contracts for information technology (IT) services, 3PL service fees and other supply chain services, promotional expenses, and other commitments under service contracts. As of March 31, 2025, the Company has an aggregate of $\n200,744\n of other purchase commitments, of which $\n118,336\n is due in less than one fiscal year, $\n70,274\n is due in one to three fiscal years, and the remainder of $\n12,134\n is due in three to five fiscal years. \nLitigation\n. From time to time, the Company is involved in various legal proceedings, disputes, and other claims arising in the ordinary course of business, including employment, intellectual property, and product liability claims. Although the results of these matters cannot be predicted with certainty, the Company believes it is not currently a party to any legal proceedings, disputes, or other claims for which a material loss is considered probable and for which the amount (or range) of loss is reasonably estimable. However, regardless of the merit of the claims raised or the outcome, these matters can have an adverse impact on the Company as a result of legal costs, diversion of management’s time and resources, and other factors.\nIndemnification. \nThe Company has agreed to indemnify certain of its licensees, distributors, and promotional partners in connection with claims related to the use of the Company’s intellectual property. The terms of such agreements generally do not provide for a limitation on the maximum potential future payments. From time to time, the Company also agrees to indemnify its licensees, distributors, and promotional partners in connection with claims that the Company’s products infringe on the intellectual property rights of third parties. These agreements may or may not be made pursuant to a written contract. In addition, from time to time, the Company also agrees to standard indemnification provisions in commercial agreements in the ordinary course of business. Management believes the likelihood of any payments under any of these arrangements is remote and would be immaterial. This determination is made based on a prior history of insignificant claims and related payments.\nNOTE 8. \nSTOCK-BASED COMPENSATION\nStock Incentive Plans. \nIn September 2015, the Company’s stockholders approved the 2015 Stock Incentive Plan (2015 SIP), which initially reserved \n7,650,000\n shares of the Company’s common stock for issuance to employees, directors, consultants, independent contractors, and advisors. The 2015 SIP provided for the issuance of a variety of stock-based compensation awards, including RSUs, performance-based restricted stock units (PSUs), LTIP PSUs, stock appreciation rights, stock bonuses, incentive stock options (ISOs), and non-qualified stock options (NQSOs). \nIn September 2024, the Company’s stockholders approved the 2024 Stock Incentive Plan (2024 SIP), which is intended to replace the 2015 SIP. Like the 2015 SIP, the primary purpose of the 2024 SIP is to encourage ownership in the Company by key personnel, whose long-term service is considered essential to the Company’s continued success. \nAs a result of the \nstock split\n, the number of shares of common stock reserved for issuance under the \n2024 SIP\n and the number of shares underlying outstanding equity awards and the exercise price of stock options were adjusted proportionately. \nThe 2024 SIP initially reserves \n7,800,000\n shares of the Company’s common stock for issuance to employees, directors, consultants, independent contractors, and advisors, less \none\n share for every one share granted under the 2015 SIP after March 31, 2024 and prior to September 9, 2024, the effective date of the 2024 SIP, subject to an increase from the return of shares under the 2015 SIP as described below. The terms of the 2024 SIP are substantially similar to the terms of the 2015 SIP. The 2024 SIP provides for the issuance of a variety of stock-based compensation awards, including RSUs, PSUs, LTIP PSUs, stock appreciation rights, stock bonuses, ISOs, and NQSOs. The maximum aggregate number of shares that may be issued to employees under the 2024 SIP through the exercise of ISOs is \n4,500,000\n. \nF-32\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\nThe Company will not grant any further equity awards under the 2015 SIP. Outstanding awards under the 2015 SIP will remain outstanding, unchanged and subject to the terms of the 2015 SIP and their respective award agreements. Shares subject to awards that are forfeited, expire or are otherwise terminated without shares being issued, or shares withheld to pay the exercise price of an award or to satisfy tax withholding obligations, including shares subject to awards granted under the 2015 SIP that are outstanding after March 31, 2024, will be returned to the pool of shares available for grant and issuance under the 2024 SIP. As of March 31, 2025, \n7,793,719\n shares of common stock remained available for future issuance under the 2024 SIP, subject to adjustment for future stock splits, stock dividends, and similar changes in capitalization.\nAnnual Stock Awards. \nDuring the\n \nyears ended March 31, 2025, 2024, and 2023, the Company granted RSU and LTIP PSU awards to certain members of the Company’s management team, which entitle the recipients to receive shares of the Company’s common stock upon vesting. \nNo\n dividends are paid or accumulated on any RSU or LTIP PSU awards. \nA summary of the status and changes of the Company’s nonvested shares is as follows:\nRSUs\nLTIP PSUs\nNumber of\nShares\nWeighted-\nAverage\nGrant-Date\nFair Value \n(3)\nNumber of\nShares\nWeighted-\nAverage\nGrant-Date\nFair Value \n(3)\nNonvested, March 31, 2022\n587,202\n \n$\n47.34\n \n618,192\n \n$\n57.37\n \nGranted \n(1)\n311,730\n \n56.50\n \n392,820\n \n55.12\n \nVested\n (2)\n(\n270,552\n)\n(\n41.61\n)\n(\n180,624\n)\n(\n53.30\n)\nForfeited\n(\n92,634\n)\n(\n50.00\n)\n(\n163,164\n)\n(\n53.99\n)\nNonvested, March 31, 2023\n535,746\n \n55.10\n \n667,224\n \n57.98\n \nGranted \n(1)\n235,788\n \n95.55\n \n277,692\n \n95.13\n \nVested\n (2)\n(\n264,888\n)\n(\n52.19\n)\n(\n301,368\n)\n(\n61.39\n)\nForfeited\n(\n39,864\n)\n(\n77.07\n)\n(\n112,404\n)\n(\n87.15\n)\nNonvested, March 31, 2024\n466,782\n \n75.31\n \n531,144\n \n69.29\n \nGranted \n(1)\n165,988\n \n158.78\n \n148,770\n \n151.19\n \nVested\n (2)\n(\n235,872\n)\n(\n70.69\n)\n(\n327,868\n)\n(\n55.07\n)\nForfeited\n(\n31,026\n)\n(\n96.52\n)\n(\n51,708\n)\n(\n80.76\n)\nNonvested, March 31, 2025\n365,872\n \n$\n114.34\n \n300,338\n \n$\n123.42\n \n(1)\n The amounts granted are the maximum amounts under the terms of the applicable LTIP PSUs.\n(2)\n The amounts vested include shares withheld to cover taxes that are not issued to the recipient.\n(3)\n \nImpact from the stock split may not calculate on rounded numbers disclosed in prior periods.\nRestricted Stock Units.\n RSUs are subject to a time-based vesting condition and typically vest in equal annual installments over \nthree years\n following the date of grant.\nLong-Term Incentive Plan Awards.\n LTIP PSU awards are subject to market, performance, and time-based vesting conditions. The term of LTIP PSU awards is over a multi-fiscal year performance period with metrics established at the beginning of the performance period, which is generally \ntwo\n or \nthree years\n (Measurement Period). The LTIP PSU awards include a market condition tied to the Company’s relative total stockholder return (TSR) in relation to its peer companies (peer market condition), as well as financial performance conditions tied to certain revenue and pre-tax income performance targets (financial performance conditions). Following a determination of the Company’s achievement with respect to the financial performance conditions for the applicable Measurement Period, the vesting of each LTIP PSU award will be subject to adjustment for the peer market condition based on the application of the TSR modifier. The amount of the adjustment is determined based on a \nF-33\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\ncomparison of the Company’s TSR relative to the TSR of a pre-determined set of peer group companies for the Measurement Period.\nThe grant date fair value of LTIP PSUs is determined using a Monte-Carlo model that simulates a range of possible future stock prices for the Company and each member of the peer group over the Measurement Period. For each grant of LTIP PSUs, the Monte-Carlo simulation model factors in key assumptions, such as the market price of the underlying common stock at the beginning and end of the Measurement Period, risk free interest rate, expected dividend yield when simulating a TSR, expected dividend yield when simulating the Company’s stock price, stock price volatility, and correlation coefficients. The Company evaluates the probability of achieving the financial performance conditions against its most current long-range forecast at least quarterly and may adjust stock-based compensation expense for its LTIP PSUs up or down based on its estimated probability outcome over the Measurement Period. The peer market condition is measured as part of the grant date fair value.\nThe actual number of LTIP PSU awards that vest may increase up to a maximum of \n200\n% of the targeted amount for the award based on achievement of the financial performance conditions and the TSR modifier for the peer market condition. No vesting of any portion of the LTIP PSU awards will occur if the Company fails to achieve the minimum threshold financial performance conditions for each reporting period within the Measurement Period. For the LTIP PSUs granted during the fiscal years 2025, 2024, and 2023, the Company expects to exceed the minimum threshold target performance criteria based on the Company’s long-range forecast as of March 31, 2025.\nLong-Term Incentive Plan Options.\n The Company approved the issuance of LTIP NQSOs under the 2015 SIP, including the November 2016 (2017 LTIP NQSOs) and June 2017 (2018 LTIP NQSOs) grants, which were awarded to certain members of the Company’s management team, with a maximum contractual term ending March 31, 2026. As of March 31, 2019, and 2020, the target performance criteria were achieved and all LTIP NQSOs under the 2017 LTIP NQSOs and 2018 LTIP NQSOs, respectively, were fully vested. Each vested LTIP NQSO provides the recipient the right to purchase a specified number of shares of the Company’s common stock at a fixed exercise price per share based on the closing price of the common stock on the date of grant.\n During the years ended March 31, 2025, 2024, and 2023, \nno\n LTIP NQSOs were granted. During the year ended March 31, 2025, \n89,454\n shares were exercised pursuant to LTIP NQSOs at a weighted-average exercise price of $\n10.80\n. As of March 31, 2025, \nno\n LTIP NQSOs were exercisable and as of March 31, 2024, \n89,454\n LTIP NQSOs were exercisable at a weighted average exercise price of $\n10.80\n.\nGrants to Directors. \nEach of the Company’s nonemployee directors was entitled to receive common stock with a total value of $\n170\n for annual service on the Board of Directors (Board) during the year ended March 31, 2025. The shares are issued in equal quarterly installments with the number of shares being determined using the rolling average of the closing price of the Company’s common stock during the last \nten\n trading days leading up to, and including, the grant date, which is in alignment with the Company’s equity grant guidelines. Each of these shares is fully vested and recorded as compensation expense in the consolidated statements of comprehensive income on the date of issuance.\nEmployee Stock Purchase Plans\n.\n In September 2015, the Company’s stockholders approved the 2015 Employee Stock Purchase Plan (2015 ESPP), which authorized \n6,000,000\n shares of the Company’s common stock for sale to eligible employees using after-tax payroll deductions, which are refundable until purchases are made, and are liability-classified. Following the issuance of shares under the 2015 ESPP to employees who participated in the offering period ended February 28, 2025, the 2015 ESPP was terminated, and no new offering periods under the 2015 ESPP will commence.\nIn September 2024, the Company’s stockholders approved the 2024 Employee Stock Purchase Plan (2024 ESPP), which replaced the 2015 ESPP. The 2024 ESPP reserves \n6,000,000\n shares of the Company’s common stock for sale to eligible employees. The terms of the 2024 ESPP are substantially similar to the terms of the 2015 ESPP. Each offering period under the 2024 ESPP is anticipated to run for approximately \nsix months\n with purchases occurring on the last day of each offering period (no look-back provision) at a \n15\n% discount to the closing price on that date. The first offering period commenced on March 1, 2025. \nAs a result of the \nstock split\n, the number of shares of common stock reserved for issuance under the \n2024 ESPP\n were adjusted proportionately.\n \nF-34\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\nStock-Based Compensation\n.\n \nComponents of stock-based compensation recorded, net of estimated forfeitures, in SG&A expenses in the consolidated statements of comprehensive income were as follows:\nYears Ended March 31,\n2025\n2024\n2023\nStock-based compensation \nRSUs\n$\n19,758\n \n$\n15,935\n \n$\n13,249\n \nLTIP PSUs\n15,676\n \n18,941\n \n11,275\n \nGrants to Directors\n1,858\n \n1,907\n \n1,863\n \nSubtotal\n37,292\n \n36,783\n \n26,387\n \nOther stock-based compensation\nEmployee Stock Purchase Plan\n651\n \n505\n \n510\n \nTotal stock-based compensation, pre-tax\n37,943\n \n37,288\n \n26,897\n \nIncome tax benefit \n(\n9,304\n)\n(\n9,097\n)\n(\n6,557\n)\nTotal stock-based compensation, net of tax\n$\n28,639\n \n$\n28,191\n \n$\n20,340\n \nUnrecognized Stock-Based Compensation.\n \nTotal remaining unrecognized stock-based compensation as of March 31, 2025, related to non-vested awards that the Company considers probable to vest and the weighted-average period over which the cost is expected to be recognized in future periods, is as follows:\nUnrecognized\nStock-Based Compensation\nWeighted-Average\nRemaining\nVesting Period (Years)\nRSUs\n$\n21,951\n \n1.0\nLTIP PSUs\n21,225\n \n1.5\nTotal\n$\n43,176\n \nNOTE 9. \nDERIVATIVE INSTRUMENTS\nAs of March 31, 2025, the Company has the following derivative contracts recorded at fair value in the consolidated balance sheets:\nDesignated Derivative Contracts\nNon-Designated Derivative Contracts\nTotal\nNotional value\n$\n367,695\n \n$\n14,018\n \n$\n381,713\n \nFair value recorded in other current assets\n2,163\n \n75\n \n2,238\n \nFair value recorded in other accrued expenses\n(\n64\n)\n—\n \n(\n64\n)\nAs of March 31, 2025, \nfive\n counterparties hold the Company’s outstanding derivative contracts, all of which are expected to mature in the next \ntwelve months\n. As of March 31, 2024, the Company had \nno\n outstanding derivative contracts. \nF-35\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\nThe Company settled derivative contracts with notional values as follows:\nYears Ended March 31,\n2025\n2024\n2023\nDesignated Derivative Contracts\n$\n258,040\n \n$\n179,528\n \n$\n96,345\n \nNon-Designated Derivative Contracts\n18,565\n \n—\n \n31,044\n \nTotal\n$\n276,605\n \n$\n179,528\n \n$\n127,389\n \nThe following table summarizes the effect of Designated Derivative Contracts on unrealized gains or losses recorded in the consolidated statements of comprehensive income for changes in AOCL, net of tax:\nYears Ended March 31,\n2025\n2024\n2023\nGain recorded in OCI\n$\n4,387\n \n$\n4,090\n \n$\n1,504\n \nReclassifications from AOCL into net sales\n(\n2,288\n)\n(\n4,090\n)\n(\n1,504\n)\nIncome tax expense in OCI\n(\n515\n)\n—\n \n—\n \nTotal\n$\n1,584\n \n$\n—\n \n$\n—\n \nThe non-performance risk of the Company and its counterparties did not have a material impact on the fair value of its derivative contracts. As of March 31, 2025, the amount of unrealized gains on derivative contracts recorded in AOCL is expected to be reclassified into net sales within the next \ntwelve months\n. Refer to Note 10, “Stockholders’ Equity,” for further information on the components of AOCL.\nNOTE 10. \nSTOCKHOLDERS’ EQUITY\nStock Repurchase Program. \nThe Board has approved various authorizations under the Company’s stock repurchase program to repurchase shares of its common stock in the open market or in privately negotiated transactions, subject to market conditions, applicable legal requirements, and other factors (collectively, the stock repurchase program). As of March 31, 2025, the Board last approved an authorization of $\n1,200,000\n on July 27, 2022, to repurchase its common stock under the same conditions as the prior stock repurchase program. As of March 31, 2025, the aggregate remaining approved amount under the stock repurchase program is $\n374,701\n. The stock repurchase program does not obligate the Company to acquire any amount of common stock and may be suspended at any time at the Company’s discretion. \nStock repurchase activity under the Company’s stock repurchase program was as follows:\nYears Ended March 31,\n2025\n2024\n2023\nTotal number of shares repurchased \n(1)\n3,800,040\n \n4,289,124\n \n5,569,572\n \nWeighted average price per share\n$\n149.21\n \n$\n96.74\n \n$\n53.39\n \nDollar value of shares repurchased \n(2) (3)\n$\n567,002\n \n$\n414,931\n \n$\n297,372\n \n(1)\n All share repurchases were made pursuant to the Company’s stock repurchase program in open-market transactions.\n(2)\n The dollar value of shares repurchased excludes the cost of broker commissions, excise taxes, and other costs.\n(3) \nMay not calculate on rounded dollars.\nSubsequent to March 31, 2025, through May 9, 2025, the Company repurchased \n765,321\n shares of its common stock at a weighted average price of $\n109.75\n per share for $\n83,998\n. As of May 9, 2025, the Company had $\n290,704\n remaining authorized under the stock repurchase program. Amounts may not calculate on rounded dollars.\nOn May 21, 2025, the Board approved an additional authorization of $\n2,250,000\n, for the Company to repurchase its common stock under the same conditions as the prior stock repurchase program. \nF-36\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\nAccumulated Other Comprehensive Loss\n. \nThe components within AOCL, net of tax, recorded in the consolidated balance sheets, are as follows:\nAs of March 31,\n \n2025\n2024\nUnrealized gain on cash flow hedges\n$\n1,584\n \n$\n—\n \nCumulative foreign currency translation loss\n(\n51,238\n)\n(\n50,733\n)\nTotal \n$\n(\n49,654\n)\n$\n(\n50,733\n)\nNOTE 11. \nBASIC AND DILUTED SHARES\nThe reconciliation of basic to diluted weighted-average common shares outstanding was as follows:\n \nYears Ended March 31,\n \n2025\n2024\n2023\nBasic\n151,992,000\n \n155,225,000\n \n159,023,000\n \nDilutive effect of equity awards\n678,000\n \n1,060,000\n \n1,088,000\n \nDiluted\n152,670,000\n \n156,285,000\n \n160,111,000\n \nExcluded\nRSUs\n9,000\n \n16,000\n \n20,000\n \nLTIP PSUs\n155,000\n \n291,000\n \n453,000\n \nDeferred Non-Employee Director Equity Awards\n2,000\n \n3,000\n \n11,000\n \nExcluded Awards.\n \nThe equity awards excluded from the calculation of the dilutive effect may be excluded due to one of the following: (1) the shares were antidilutive or (2) the necessary conditions had not been satisfied for the shares to be deemed issuable based on the Company’s performance for the relevant performance period. The number of shares stated for each of these excluded awards is the maximum number of shares issuable pursuant to these awards. For those awards subject to the achievement of performance criteria, the actual number of shares to be issued pursuant to such awards will be based on Company performance in future periods, net of forfeitures, and may be materially lower than the number of shares presented, which could result in a lower dilutive effect.\n Refer to Note 8, “Stock-Based Compensation,” for further information on the Company’s equity incentive plans.\nNOTE 12. \nREPORTABLE OPERATING SEGMENTS\nInformation reported to the CODM is organized into the Company’s \nthree\n reportable operating segments, which include the brand operations for the UGG brand, HOKA brand, and Other brands. The operations of each brand within these reportable operating segments are managed separately because each requires different marketing, research and development, design, sourcing, and sales strategies. \nThe Company does not regularly provide total assets or capital expenditures information by reportable operating segment to the CODM because that information is not used to evaluate performance or allocate resources to each reportable operating segment.\nSegment Net Sales, Gross Margin, and Income from Operations.\n The CODM regularly evaluates the performance of each reportable operating segment based on net sales, gross profit as a percentage of net sales (gross margin), and income from operations when making decisions about resource allocations to each reportable operating segment. Income from operations of each reportable operating segment includes certain costs which are specifically related to each reportable operating segment and that are regularly provided to the CODM. These costs consist of cost of sales; payroll and related expenses, including stock-based compensation; advertising, marketing, and promotion expenses; rent and occupancy; depreciation and other related costs; and other segment items. \nF-37\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\nThere are no inter-segment sales for any period presented. The accounting policies of the Company's reportable operating segments are consistent with those described in Note 1, “General.” \nIncome from operations of each reportable operating segment exclude enterprise and shared brand expenses as well as total other income, net, which are not used to assess reportable operating segment performance. Unallocated enterprise and shared brand expenses are costs that are managed centrally and not specific to any one brand. These costs are primarily comprised of certain payroll and related expenses, including stock-based compensation; global IT expenses; 3PL service fees; depreciation, rent, and occupancy for owned warehouses and offices; and other SG&A expenses, such as costs for contract services, materials, supplies, and travel. These costs span multiple functions including owned warehouses and 3PL service fees, along with enterprise costs which include centralized commercial operations, IT, finance, human resources, legal, supply chain, and corporate executives.\n \nReportable operating segment information, with a reconciliation to the consolidated statements of comprehensive income, was as follows:\nYear Ended March 31, 2025\nUGG\nHOKA\nOther Brands\nTotal\nNet sales\n$\n2,531,351\n$\n2,233,090\n$\n221,171\n$\n4,985,612\nLess: Cost of sales \n(1)\n1,023,495\n949,824\n126,630\n2,099,949\nSegment gross profit\n1,507,856\n1,283,266\n94,541\n2,885,663\nSegment gross margin\n59.6\n \n%\n57.5\n \n%\n42.7\n \n%\n57.9\n \n%\nLess: \n(1)\nPayroll and related costs\n146,093\n \n101,056\n \n18,179\n \n265,328\n \nAdvertising, marketing, and promotion expenses\n180,889\n \n226,238\n \n25,071\n \n432,198\n \nRent and occupancy\n75,724\n \n26,467\n \n424\n \n102,615\n \nDepreciation and other related costs \n(2)\n10,026\n \n5,007\n \n4,412\n \n19,445\n \nOther segment items\n (3)\n92,251\n \n75,993\n \n11,877\n \n180,121\n \nSegment SG&A expenses\n504,983\n \n434,761\n \n59,963\n \n999,707\n \nSegment income from operations\n$\n1,002,873\n \n$\n848,505\n \n$\n34,578\n \n$\n1,885,956\n \nSegment operating margin\n39.6\n \n%\n38.0\n \n%\n15.6\n \n%\n37.8\n \n%\nYear Ended March 31, 2024\nUGG\nHOKA\nOther Brands\nTotal\nNet sales\n$\n2,239,132\n$\n1,806,740\n$\n241,891\n$\n4,287,763\nLess: Cost of sales \n(1)\n983,636\n763,673\n154,966\n1,902,275\nSegment gross profit\n1,255,496\n1,043,067\n86,925\n2,385,488\nSegment gross margin\n56.1\n \n%\n57.7\n \n%\n35.9\n \n%\n55.6\n \n%\nLess: \n(1)\nPayroll and related costs\n134,307\n \n74,991\n \n17,628\n \n226,926\n \nAdvertising, marketing, and promotion expenses\n148,809\n \n175,756\n \n24,287\n \n348,852\n \nRent and occupancy\n75,724\n \n16,589\n \n348\n \n92,661\n \nDepreciation and other related costs \n(2)\n9,295\n \n3,389\n \n10,034\n \n22,718\n \nOther segment items\n (3)\n82,534\n \n53,295\n \n10,907\n \n146,736\n \nSegment SG&A expenses\n450,669\n \n324,020\n \n63,204\n \n837,893\n \nSegment income from operations\n$\n804,827\n \n$\n719,047\n \n$\n23,721\n \n$\n1,547,595\n \nSegment operating margin\n35.9\n \n%\n39.8\n \n%\n9.8\n \n%\n36.1\n \n%\nF-38\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\nYear Ended March 31, 2023\nUGG\nHOKA\nOther Brands\nTotal\nNet sales\n$\n1,929,211\n$\n1,412,916\n$\n285,159\n$\n3,627,286\nLess: Cost of sales \n(1)\n975,585\n641,240\n185,091\n1,801,916\nSegment gross profit\n953,626\n771,676\n100,068\n1,825,370\nSegment gross margin\n49.4\n \n%\n54.6\n \n%\n35.1\n \n%\n50.3\n \n%\nLess: \n(1)\nPayroll and related costs\n109,576\n \n57,446\n \n15,266\n \n182,288\n \nAdvertising, marketing, and promotion expenses\n114,652\n \n135,590\n \n20,898\n \n271,140\n \nRent and occupancy\n69,302\n \n9,033\n \n453\n \n78,788\n \nDepreciation and other related costs \n(2)\n10,623\n \n2,272\n \n1,866\n \n14,761\n \nOther segment items \n(3)\n77,004\n \n38,877\n \n12,083\n \n127,964\n \nSegment SG&A expenses\n381,157\n \n243,218\n \n50,566\n \n674,941\n \nSegment income from operations\n$\n572,469\n \n$\n528,458\n \n$\n49,502\n \n$\n1,150,429\n \nSegment operating margin\n29.7\n \n%\n37.4\n \n%\n17.4\n \n%\n31.7\n \n%\n(1)\n The significant expense categories and amounts align with the segment-level information that is regularly provided to the CODM. \n(2)\n Depreciation and other related costs generally includes depreciation of property and equipment, amortization and impairment of intangible assets or other-long lived assets, accretion, loss on disposal of assets, and other miscellaneous costs. During the year ended March 31, 2024, the Company recorded an impairment to intangible assets of $\n8,164\n for the Sanuk brand definite-lived trademark. Refer to Note 3, “Goodwill and Other Intangible Assets,” for further information on the impairment loss.\n(3)\n Other segment items are comprised of other SG&A expenses, which primarily includes credit card fees, commissions, materials and supplies, travel, and certain 3PL service fees.\nA reconciliation of reportable segment income from operations to consolidated statements of comprehensive income was as follows:\nYears Ended March 31,\n2025\n2024\n2023\nSegment income from operations\n$\n1,885,956\n \n$\n1,547,595\n \n$\n1,150,429\n \nUnallocated enterprise and shared brand expenses \n(1)\n(\n706,864\n)\n(\n620,081\n)\n(\n497,678\n)\nTotal other income, net\n64,207\n \n51,427\n \n13,331\n \nConsolidated income before income taxes\n$\n1,243,299\n \n$\n978,941\n \n$\n666,082\n \n(1)\n To the extent that consolidated SG&A expenses exceed reportable operating segment SG&A expenses, the costs are recorded in unallocated enterprise and shared brand expenses, which are costs that are managed centrally and not specific to any one brand. The change in reportable operating segments had an impact on segment income from operations, a measure of segment profitability, and a clarification was made that certain prior unallocated overhead costs are defined as unallocated enterprise and shared brand expenses and are excluded from the measure of segment profitability.\nF-39\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\nNOTE 13. \nCONCENTRATION OF BUSINESS\nRegions and Customers\n. \nThe Company sells its products globally to customers and consumers, with net sales concentrations as follows:\nYears Ended March 31,\n2025\n2024\n2023\nInternational net sales\n$\n1,798,903\n \n$\n1,424,089\n \n$\n1,175,789\n \n% of net sales\n36.1\n \n%\n33.2\n \n%\n32.4\n \n%\nNet sales in foreign currencies\n$\n1,376,782\n \n$\n1,105,057\n \n$\n832,632\n \n% of net sales\n27.6\n \n%\n25.8\n \n%\n23.0\n \n%\nTen largest global customers as % of net sales\n23.7\n \n%\n24.2\n \n%\n25.2\n \n%\nFor the years ended March 31, 2025, 2024, and 2023, no single foreign country and no single global customer comprised 10.0% or more of the Company’s total net sales.\nAs of March 31, 2025, the Company has one customer that represents \n13.6\n% of trade accounts receivable, net, compared to two customers that in total represented \n31.2\n% of trade accounts receivable, net, as of March 31, 2024. Management performs regular evaluations concerning the ability of the Company’s customers to satisfy their obligations to the Company and recognizes an allowance for doubtful accounts based on these evaluations. \nCash and Cash Equivalents.\n \nThe Company maintains a portion of its cash in Federal Deposit Insurance Corporation insured bank deposit accounts which, at times, may exceed federally insured limits. To date, the Company has not experienced any losses in such accounts. Based on the size and strength of the banking institutions used, the Company does not believe it is exposed to any significant credit risks in cash.\nDesignated Suppliers.\n The Company outsources the production of its finished goods to independent manufacturers, which are primarily located in Southeast Asia, predominately in Vietnam. The majority of the raw materials and components used in the production of the Company’s products by its independent manufacturers are purchased from designated suppliers, who work with other subcontractors that extract, process, or convert these raw materials. Sheepskin used to manufacture a significant portion of the Company’s UGG brand products and is sourced primarily from designated suppliers in Australia and processed by \ntwo\n tanneries in China. \nLong-Lived Assets\n. \nLong-lived assets, which consist of property and equipment, net, recorded in the consolidated balance sheets, are as follows:\nAs of March 31,\n \n2025\n2024\nUnited States\n$\n289,672\n \n$\n270,561\n \nForeign\n (1)\n35,927\n \n31,561\n \nTotal\n$\n325,599\n \n$\n302,122\n \n(1)\n As of March 31, 2025, and 2024, no property and equipment, net, associated with any single foreign country represented 10.0% or more of the Company’s total property and equipment, net.\nF-40\nTable of Contents\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Fiscal Years Ended March 31, 2025, 2024, and 2023\n(amounts in thousands, except per share and share data)\nNOTE 14. \nSUPPLIER FINANCE PROGRAM\nThe Company has a voluntary SFP administered through a third-party platform that provides the Company’s independent manufacturers that supply its inventory (inventory suppliers) the opportunity to sell their receivables due from the Company to participating financial institutions in advance of the invoice due date, at the sole discretion of both inventory suppliers and the financial institutions The Company is not party to the agreements between these third parties and has no economic interest in an inventory suppliers’ decision to sell a receivable.\nThe Company’s payment obligations, including the amounts due and payment terms, which generally do not exceed 90 days, are not impacted by the inventory suppliers’ election to participate in the SFP, and the Company provides no guarantees to any third parties under the SFP. Accordingly, amounts due to inventory suppliers that elect to participate in the SFP are recorded in \ntrade accounts payable\n in the consolidated balance sheets.\n \nActivity for the Company’s SFP program is as follows:\nYear Ended March 31, 2025\nBeginning balance\n$\n3,483\n \nObligations added\n29,373\n \nObligations settled\n(\n31,960\n)\nEnding balance\n$\n896\n \nPayments made in connection with the SFP are reported as cash used in operating activities in the trade accounts payable line item of the consolidated statements of cash flows.\nF-41\nTable of Contents\nSchedule II\nDECKERS OUTDOOR CORPORATION AND SUBSIDIARIES\nTOTAL VALUATION AND QUALIFYING ACCOUNTS\n(dollar amounts in thousands)\nAllowances for doubtful accounts, sales discounts, and chargebacks against gross trade accounts receivable related to wholesale channel sales recorded in the consolidated balance sheets, are as follows:\nYears Ended March 31,\n2025\n2024\n2023\nAllowance for doubtful accounts \n(1)\nBeginning balance\n$\n(\n9,109\n)\n$\n(\n10,576\n)\n$\n(\n9,044\n)\nAdditions\n(\n4,869\n)\n(\n658\n)\n(\n1,983\n)\nDeductions\n444\n \n2,125\n \n451\n \nEnding balance\n$\n(\n13,534\n)\n$\n(\n9,109\n)\n$\n(\n10,576\n)\nAllowance for sales discounts \n(2)\nBeginning balance\n$\n(\n3,840\n)\n$\n(\n5,656\n)\n$\n(\n2,831\n)\nAdditions\n(\n19,028\n)\n(\n17,060\n)\n(\n19,745\n)\nDeductions\n21,502\n \n18,876\n \n16,920\n \nEnding balance\n$\n(\n1,366\n)\n$\n(\n3,840\n)\n$\n(\n5,656\n)\nAllowance for chargebacks \n(3)\nBeginning balance\n$\n(\n14,382\n)\n$\n(\n16,272\n)\n$\n(\n18,716\n)\nAdditions\n(\n31,701\n)\n(\n28,845\n)\n(\n27,400\n)\nDeductions\n28,100\n \n30,735\n \n29,844\n \nEnding balance\n$\n(\n17,983\n)\n$\n(\n14,382\n)\n$\n(\n16,272\n)\nTotal\n$\n(\n32,883\n)\n$\n(\n27,331\n)\n$\n(\n32,504\n)\n(1)\n The additions to the allowance for doubtful accounts represent estimates of the Company’s bad debt expense or recovery based on the factors on which the Company evaluates the collectability of its accounts receivable, with actual recoveries netted into additions. Deductions are for the actual amounts written off against outstanding trade accounts receivable.\n(2)\n The additions to the allowance for sales discounts represent estimates of discounts to be taken by the Company’s customers based on the amount of outstanding discounts for meeting shipment or prompt payments terms. Deductions are for the actual discounts taken by the Company’s customers against outstanding trade accounts receivable. \n(3) \nThe additions to the allowance for chargebacks represent chargebacks and markdowns taken in the respective year, as well as an estimate of amounts that will be taken in the future related to sales in the current reporting period. Deductions are for the actual amounts written off against outstanding trade accounts receivable.\nF-42"
  }
}