{
  "ticker": "DG",
  "cik": "0000029534",
  "company_name": "DOLLAR GENERAL CORP",
  "filing_date": "2025-03-21",
  "accession": "0001558370-25-003413",
  "primary_doc": "dg-20250131x10k.htm",
  "item_sections": {
    "item1": "ITEM 1. BUSINESS\n​\nGeneral\n​\nWe are the largest discount retailer in the United States by number of stores, with 20,662 stores located in 48 U.S. states and Mexico as of February 28, 2025, with the greatest concentration of stores in the southern, southwestern, midwestern and eastern United States. Our first stores in Mexico opened in 2023. We offer a broad selection of merchandise, including consumable items, seasonal items, home products and apparel. Our merchandise includes national brands from leading manufacturers, as well as our own private brand selections with prices at substantial discounts to national brands. We offer our customers these national brand and private brand products at everyday low prices (typically $10 or less) in our convenient small-box locations.\n​\nOur History\n​\nJ.L. Turner founded our Company in 1939 as J.L. Turner and Son, Wholesale. We were incorporated as a Kentucky corporation under the name J.L. Turner & Son, Inc. in 1955, when we opened our first Dollar General store. We changed our name to Dollar General Corporation in 1968 and reincorporated in 1998 as a Tennessee corporation. Our common stock was publicly traded from 1968 until July 2007, when we merged with an entity controlled by investment funds affiliated with Kohlberg Kravis Roberts & Co. L.P., or KKR. In November 2009 our common stock again became publicly traded on the New York Stock Exchange under the symbol “DG”, and in December 2013 the entity controlled by investment funds affiliated with KKR sold its remaining shares of our common stock. \n​\nOur Business Model\n​\nOur long history of profitable growth is founded on a commitment to a relatively simple business model: providing a broad base of customers with their basic everyday and household needs, supplemented with a variety of general merchandise items, at everyday low prices in conveniently located, small-box stores. We continually evaluate the needs and demands of our customers and modify our merchandise selections and pricing accordingly, while remaining focused on increasing profitability, cash generation and returns for our shareholders.\n​\nOur long-term operating priorities are: 1) driving profitable sales growth, 2) capturing growth opportunities, 3) enhancing our position as a low-cost operator, and 4) investing in the growth and development of our teams. For more information on these operating priorities, see the “Executive Overview” section of Management’s Discussion and Analysis of Financial Condition and Results of Operations, included in Part II, Item 7 of this report. \n​\nWe have achieved positive same-store sales growth each year since 1990, with the exception of 2021 which followed unusually high sales results in 2020 during the height of the COVID pandemic. We believe that this consistent growth over many years, which has taken place in a variety of economic conditions, is a result of our compelling value and convenience proposition, although no assurances can be given that we will achieve positive same-store sales growth in any given year. \n​\nCompelling Value and Convenience Proposition.\n  Our ability to deliver highly competitive prices in convenient locations and our easy “in and out” shopping format create a compelling shopping experience that we believe distinguishes us from other discount retailers as well as convenience, drug, grocery, online and mass merchant retailers. Our slogan “Save time. Save money. Every day!”\n® summarizes our appeal to customers. We believe our ability to effectively deliver both value and convenience allows us to succeed in small markets with limited shopping alternatives, as well as in larger and more competitive markets. Our value and convenience proposition is evidenced by the following attributes of our business model:\n​\n●\nEveryday Low Prices on Quality Merchandise.  \nOur research indicates that we offer a price advantage over most food and drug retailers and that our prices are competitive with even the \n5\n\n\nTable of Contents\nlargest discount retailers. Our ability to offer everyday low prices on quality merchandise is supported by our low-cost operating approach and our strategy to maintain a limited number of items per merchandise category, which we believe helps us maintain strong purchasing power. We offer nationally advertised brands at these everyday low prices in addition to offering our own private brands, often at substantially lower prices.\n​\n●\nConvenient Locations.  \nOur stores are conveniently located in a variety of rural, suburban and urban communities. We seek to locate our stores in close proximity to our customers, which helps drive customer loyalty and trip frequency and makes us an attractive alternative to large discount and other large-box retail and grocery stores.\n​\n●\nTime-Saving Shopping Experience.  \nWe strive to provide customers with a highly convenient, easy to navigate shopping experience. Our small-box stores are designed to make it easier to get in and out quickly, and our digital tools and offerings help drive even greater convenience and additional access points. Our product offering includes most necessities, such as basic packaged and refrigerated or frozen food products, dairy products, cleaning supplies, paper products, health and beauty care items, greeting cards and other stationery items, basic apparel, housewares, hardware and automotive supplies, among others. Our convenient hours and broad merchandise offering allow our customers to fulfill their requirements for basic goods and minimize their need to shop elsewhere.\n​\nSubstantial Growth Opportunities.\n  We believe we have substantial long-term growth potential in the U.S., and we have identified significant opportunities to add new Dollar General stores in both existing and new markets. In addition, we have opportunities to relocate, remodel or convert locations within our existing store base to better serve our customers. Our attractive store economics, including a relatively low initial investment and simple, low-cost operating approach, and our variety of store formats have allowed us to grow our store base to current levels and provide us significant opportunities to continue our profitable store growth strategy. We recently made the decision to close 45 pOpshelf stores, our unique small-box retail concept that focuses primarily on non-consumables, and to convert an additional six pOpshelf stores to Dollar General stores, and we have paused expansion of this concept while we evaluate and evolve its go-forward strategy and performance. We have also identified international expansion, with an initial focus on Mexico, as an opportunity for growth. We opened our first Mi Súper Dollar General stores in Mexico in 2023 and believe there is additional growth potential in Mexico in the years ahead. \n​\nOur Merchandise\n​\nWe offer a focused assortment of everyday necessities, which we believe helps to drive frequent customer visits, and key items in a broad range of general merchandise categories. Our product assortment provides the opportunity for our customers to address most of their basic shopping needs with one trip. We offer a wide selection of nationally advertised brands from leading manufacturers. Additionally, our private brand products offer even greater value with options to purchase both products that are of comparable quality to national brands as well as opening price point items, each often at substantial discounts to the national brands.\n​\nConsumables is our largest merchandise category and includes paper and cleaning products (such as paper towels, bath tissue, paper dinnerware, trash and storage bags, disinfectants, and laundry); packaged food (such as cereals, pasta, canned soups, canned meats, fruits and vegetables, condiments, spices, sugar and flour); perishables (such as milk, eggs, bread, refrigerated and frozen food, beer, wine and produce); snacks (such as candy, cookies, crackers, salty snacks and carbonated beverages); health and beauty (such as over-the-counter medicines and personal care products including soap, body wash, shampoo, cosmetics, dental hygiene and foot care products); pet (such as pet supplies and pet food); and tobacco products.\n​\nSeasonal products include holiday items, toys, batteries, small electronics, greeting cards, stationery, prepaid phones and accessories, gardening supplies, hardware, automotive and home office supplies.\n​\n6\n\n\nTable of Contents\nHome products include kitchen supplies, cookware, small appliances, light bulbs, storage containers, frames, candles, craft supplies and kitchen, bed and bath soft goods.\n​\nApparel includes basic items for infants, toddlers, girls, boys, women and men, as well as socks, underwear, disposable diapers, shoes and accessories.\n​\nThe percentage of net sales of each of our four categories of merchandise for the fiscal years indicated below was as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \n2024\n    \n2023\n    \n2022\n \nConsumables\n \n 82.2\n%  \n 81.0\n%  \n 79.7\n%\nSeasonal\n \n 10.0\n%  \n 10.6\n%  \n 11.0\n%\nHome products\n \n 5.1\n%  \n 5.6\n%  \n 6.2\n%\nApparel\n \n 2.7\n%  \n 2.8\n%  \n 3.1\n%\n​\nOur seasonal and home products categories typically account for the highest gross profit margins, and the consumables category typically accounts for the lowest gross profit margin.\n​\nThe Dollar General Store\n​\nThe typical Dollar General store staff includes a store manager, one or more assistant store managers, and three or more sales associates. Our stores generally feature a low-cost, no frills building with limited capital requirements, a low operating cost approach, and a focused merchandise offering within a broad range of categories, allowing us to deliver competitive retail prices while generating strong cash flows and capital investment returns. Our stores currently average approximately 7,500 square feet of selling space, and approximately 80% of our stores are located in towns of 20,000 or fewer people. Our primary new store format currently averages selling space of approximately 8,500 square feet. We generally have had good success in locating suitable store sites in the past, and we believe that there is ample opportunity for new store growth in existing and new markets. In addition, we believe we have significant opportunities available for our relocation and remodel programs.\n​\nOur store growth over the past three years is summarized in the following table:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \nStores at\n    \n​\n    \n​\n    \nNet\n    \n​\n \n​\n​\nBeginning\n​\nStores\n​\nStores\n​\nStore\n​\nStores at\n \nYear\n​\nof Year\n​\nOpened\n​\nClosed\n​\nIncrease\n​\nEnd of Year\n \n2022\n \n 18,130\n \n 1,039\n \n 65\n \n 974\n \n 19,104\n​\n2023\n \n 19,104\n \n 987\n \n 105\n \n 882\n \n 19,986\n​\n2024\n \n 19,986\n \n 725\n \n 117\n \n 608\n \n 20,594\n​\n​\nOur Customers\n​\nOur customers seek value and convenience. Depending on their financial situation and geographic proximity, customers’ reliance on Dollar General varies from fill-in shopping, to making periodic trips to stock up on household items, to making weekly or more frequent trips to meet most essential needs. We generally locate our stores and plan our merchandise selections to best serve the needs of our core customers, the low and fixed income households often underserved by other retailers (including grocers), and we are focused on helping them make the most of their spending dollars. At the same time, however, Dollar General shoppers from a wide range of income brackets and life stages appreciate our quality merchandise as well as our attractive value and convenience proposition.\n​\nOur Suppliers\n​\nWe purchase merchandise from a wide variety of suppliers and maintain direct buying relationships with many producers of national brand merchandise. Despite our broad offering, we maintain a relatively limited number of items per category, which supports our low average cost. Our two largest suppliers accounted for approximately \n7\n\n\nTable of Contents\n11% and 8%, respectively, of our purchases in 2024. Our private brands come from a wide variety of suppliers. We directly imported approximately 4% of our purchases at cost in 2024. \n​\nDistribution and Transportation\n​\nOur stores are currently supported by distribution centers for frozen, refrigerated and non-refrigerated merchandise located strategically throughout our geographic footprint. In addition to our traditional distribution centers, we operate multiple temperature-controlled distribution facilities in support of our self-distribution of frozen and refrigerated goods, such as dairy, deli and frozen products. We lease additional temporary warehouse space as necessary to support our distribution needs. We regularly analyze and rebalance the distribution network with a goal of ensuring that it remains efficient and provides the service levels our stores require. See “—Properties” below for additional information pertaining to our distribution centers.\n​\nMost of our merchandise flows through our distribution centers and is delivered to our stores by our private fleet and by third-party trucking firms, utilizing our trailers. In addition, vendors or third-party distributors deliver or ship certain food items and other merchandise directly to our stores.\n​\nSeasonality\n​\nThe nature of our business is somewhat seasonal. Generally, our operating profit is greater in the fourth quarter, which includes the Christmas selling season, as compared with operating profit in each of the first three quarters of our fiscal year. In addition, our quarterly results can be affected by the timing of certain holidays, new store openings, remodels, relocations, store closings, and weather patterns. See “Item 7. Management’s Discussion & Analysis of Financial Condition and Results of Operation” for further discussion of seasonality.\n​\nOur Competition\n​\nWe operate in the basic discount consumer goods market, which is highly competitive with respect to price, customers, store location, merchandise quality, assortment and presentation, service offerings, in-stock consistency, customer service, promotional activity, employees, and market share. We compete with discount stores and many other retailers, including mass merchandise, warehouse club, grocery, drug, convenience, variety, online, and certain specialty stores. These other retail companies operate stores in many of the areas where we operate, and many of them engage in extensive advertising and marketing efforts. Our direct competitors include Family Dollar, Dollar Tree, and various local, independent operators, as well as Walmart, Target, Kroger, Aldi, Costco, Sams Club, BJ’s Wholesale Club, Walgreens, CVS, and Rite Aid, among others. Certain of our competitors have greater financial, distribution, marketing and other resources than we do and may be able to secure better arrangements from suppliers than we can. Competition is intense and we believe it will continue to be so, with certain competitors reducing their store locations while others move into or increase their presence in our geographic and product markets and increase the availability of mobile, web-based and other digital technology to facilitate a more convenient and competitive online and in-store customer shopping experience.\n​\nWe believe that we differentiate ourselves from other forms of retailing by offering competitive prices in a convenient, small-store format. We are able to maintain competitive prices due in part to our low-cost operating approach and the relatively limited assortment of products offered. Purchasing large volumes of merchandise within our focused assortment in each merchandise category allows us to keep our average product costs low, contributing to our ability to offer competitive everyday prices to our customers. See “",
    "item1a": "Item 1A. Risk Factors” for additional information regarding cybersecurity-related risks that could impact our business.\n​\nThe \nAudit Committee\n of our Board of Directors oversees our cybersecurity risks through various means, including but not limited to its oversight of our enterprise risk management program. In connection with its oversight of this program, our Audit Committee discusses with management the process by which risk assessment and risk management is undertaken and our major financial and other risk exposures, including without limitation those relating to information systems, information security, data privacy, business continuity, artificial intelligence, and third-party information security, and the steps management has taken to monitor and control such exposures. Our Audit Committee reviews enterprise risk evaluation results at least annually and high residual risk categories, along with their mitigation strategies, quarterly. \n​\nIn addition to consideration as part of the enterprise risk management program, cybersecurity risk is further evaluated through various internal and external audits and assessments designed to validate the effectiveness of our controls for managing the security of our information assets. \nManagement develops action plans to address select identified opportunities for improvement identified through these assessments. Additionally, our Audit Committee quarterly reviews reports and metrics, including a dashboard, pertaining to cybersecurity risks and prevention, detection, mitigation and remediation efforts with our CIO and CISO to help our Audit Committee understand and evaluate current risks, monitor trends, and track our progress against specific metrics.\n \nOur Audit Committee also has the responsibility to review with management and our outside auditor any unauthorized access to information technology systems that could have a material effect on our financial statements. Further, our Audit Committee receives quarterly updates regarding our business continuity and IT disaster recovery plan, as well as cybersecurity incidents which occurred during the prior quarter.\n​\nThe Audit Committee receives cybersecurity education to assist members in overseeing related risks. This education includes or has included in recent years: an overview of Company-specific cyber-related risks considerations; an overview of various artificial intelligence considerations, including those related to risk management, governance and ethics, and workforce and culture; updates on the state of cybersecurity regulation; updates on the evolving retail landscape’s impact on cyber risk to retail organizations; a cyber threat intelligence update focusing on the global impact of ransomware on the retail sector and trends in retail sector compromises; and an overview of methods to perform cyber risk quantification.\n​\n​\n23\n\n\nTable of Contents",
    "item1b": "ITEM 1B. UNRESOLVED STAFF COMMENTS\n​\nNot applicable.\n​",
    "item1c": "ITEM 1C. CYBERSECURITY\n​\nWe design, \nimplement, and maintain a comprehensive information security program\n consisting of commercially reasonable administrative, organizational, and technical controls, practices, and safeguards which follow applicable laws, regulations, and industry best practices to protect against confidentiality, integrity, and availability threats to our information systems. Such controls, practices, and safeguards include, but are not limited to, published security policies, firewalls, intrusion prevention solutions, anti-malware solutions, data encryption, data loss prevention, security logging and monitoring, security configuration hardening, security patch/update management, remote access security, security risk management, vulnerability and threat management, security training and awareness, security controls testing, identity and access management, secure solutions development, and a comprehensive security incident response plan.\n \nOur \nVice President and Chief Information Security Officer\n (“CISO”), who has approximately 30 years of experience in the information technology field with approximately 25 years of full cybersecurity focus and approximately 20 years as a Certified Information Systems Security Professional, has \nresponsibility\n for assessing and managing our information security program and related risks, which includes information security incident prevention, detection, mitigation and remediation, and leading a department of information security professionals with relevant industry and professional experience. \nOur CISO reports directly to our Executive Vice President and Chief Information Officer (“CIO”)\n, who has approximately 25 \n22\n\n\nTable of Contents\nyears of experience in the information technology field that includes direct interaction with or supervision of cybersecurity functions.\n​\nWe also maintain a third-party security risk management program to identify, oversee, prioritize, assess, and mitigate third party risks\n; however, we rely on our third-party partners to implement effective information security programs commensurate with the risk associated with the nature of their business relationships to us and cannot ensure in all circumstances their efforts will be successful. We and our \nthird-party\n partners have experienced threats to, and incidents involving, data and systems, including by perpetrators of attempted random or targeted malicious attacks; computer malware, ransomware, bots, or other destructive or disruptive hardware and/or software; and attempts to misappropriate our and our customers’ information and cause system failures and disruptions, although to date \nnone have been material to our business\n. See “"
  }
}