{
  "ticker": "DHI",
  "cik": "0000882184",
  "company_name": "HORTON D R INC /DE/",
  "filing_date": "2025-11-19",
  "accession": "0000882184-25-000081",
  "primary_doc": "dhi-20250930.htm",
  "item_sections": {
    "item1": "ITEM 16.\n10-K Summary\n116\nSIGNATURES\n117\nTable of \nContents\nPART I\nITEM 1.    BUSINESS\nD.R. Horton, Inc. is the largest homebuilding company in the United States as measured by number of homes closed. We construct and sell homes through our operating divisions in 126 markets across 36 states. Our common stock is included in the S&P 500 Index and listed on the New York Stock Exchange (NYSE) and NYSE Texas under the ticker symbol “DHI.” Our listing on NYSE Texas became effective in June 2025. Unless the context otherwise requires, the terms “D.R. Horton,” the “Company,” “we” and “our” used herein refer to D.R. Horton, Inc., a Delaware corporation, and its predecessors and subsidiaries.\nOur homebuilding business began in 1978 in Fort Worth, Texas, and our common stock has been publicly traded since 1992. We have expanded and diversified our homebuilding operations geographically over the years by investing capital and building teams of people in our existing markets, starting new operations in additional markets and acquiring other homebuilding companies. We have closed more than 1.2 million homes during our 47-year history, and we have been the largest volume homebuilder in the United States every year since 2002.\nOur business operations consist of homebuilding, rental, a majority-owned residential lot development company, financial services and other activities. Homebuilding is our core business, generating 92% of consolidated revenues of $34.3 billion and $36.8 billion in fiscal 2025 and 2024, respectively, and 90% of consolidated revenues of $35.5 billion in fiscal 2023. Most of our homebuilding revenue is generated from the sale of completed homes and to a lesser extent from the sale of land and lots. Approximately 84% of our home sales revenue in fiscal 2025 was generated from the sale of single-family detached homes, with the remainder from the sale of attached homes, such as townhomes and duplexes. Our product offerings include a broad range of homes for entry-level, move-up, active adult and luxury buyers. Our homes generally range in size from 1,000 to 4,000 square feet and in price from $250,000 to more than $1,000,000. For the year ended September 30, 2025, our homebuilding operations closed 84,863 homes with an average closing price of $370,400.\nOur rental segment consists of single-family and multi-family rental operations. The single-family rental operations construct and lease single-family homes within a community and market each community for a bulk sale of rental homes. The multi-family rental operations develop, construct, lease and sell residential rental properties, the majority of which are apartment communities. For the year ended September 30, 2025, our rental operations closed 3,460 single-family rental homes and 2,947 multi-family rental units.\nAt September 30, 2025, we owned 62% of the outstanding shares of Forestar Group Inc. (Forestar), a publicly traded residential lot development company listed on the NYSE and NYSE Texas under the ticker symbol “FOR.” Forestar operates across many of our homebuilding operating markets and is a key part of our homebuilding strategy to maintain relationships with land developers and control a large portion of our land and lot position through land purchase contracts. For the year ended September 30, 2025, Forestar sold 14,240 lots, of which 83% were sold to D.R. Horton.\nOur financial services operations provide mortgage financing and title agency services to homebuyers in many of our homebuilding markets. DHI Mortgage, our wholly owned subsidiary, provides mortgage financing services primarily to our homebuyers and sells substantially all of the mortgages it originates and the related servicing rights to third-party purchasers after origination. For the year ended September 30, 2025, DHI Mortgage originated or brokered 68,982 mortgage loans. Our wholly owned subsidiary title companies issue title insurance policies and provide examination, underwriting and closing services primarily to our homebuilding customers.\nIn addition to our homebuilding, rental, Forestar and financial services operations, we engage in other business activities through our subsidiaries. We conduct insurance-related operations, own water rights and other water-related assets and own non-residential real estate including ranch land and improvements. The results of these operations are immaterial for separate reporting and therefore are grouped together and presented as other.\n1\nTable of \nContents\nAvailable Information\nWe make available, as soon as reasonably practicable, on our website, www.drhorton.com, all of our reports filed with or furnished to the Securities and Exchange Commission (SEC). These reports can be found on the “Investor Relations” section of our website under “Financial Information” and include our annual and quarterly reports on Form 10-K and 10-Q, current reports on Form 8-K, beneficial ownership reports on Forms 3, 4, and 5, proxy statements and amendments to such reports. Our SEC filings are also available to the public on the SEC’s website at www.sec.gov. In addition to our SEC filings, our corporate governance documents, including our Code of Ethical Conduct for the Chief Executive Officer, Chief Financial Officer and senior financial officers, are available on the “Investor Relations” section of our website under “Corporate Governance.” Our stockholders may also obtain these documents in paper format free of charge upon request made to our Investor Relations department.\nOur principal executive offices are located at 1341 Horton Circle, Arlington, Texas 76011, and our telephone number is (817) 390-8200. Information on or linked to our website is not incorporated by reference into this annual report on Form 10-K unless expressly noted.\nOPERATING STRUCTURE AND PROCESSES\nFollowing is an overview of our company’s operating structure and the significant processes that support our business controls, strategies and performance.\nHomebuilding Markets\nOur homebuilding business operates in 126 markets across 36 states, which provides us with geographic diversification in our homebuilding inventory investments and our sources of revenues and earnings. We believe our geographic diversification lowers our operational risks by mitigating the effects of local and regional economic cycles, and it also enhances our earnings potential by providing more diverse opportunities to invest in our business and provide a strong platform for us to consolidate market share.\n2\nTable of \nContents\nWe conduct our homebuilding operations in the geographic regions, states and markets listed below. Our homebuilding operating divisions are aggregated into six reporting segments, also referred to as reporting regions, which comprise the markets below. Our financial statements and the notes thereto contain additional information regarding segment performance.\nState\nReporting Region/Market\nState\nReporting Region/Market\nState\nReporting Region/Market\nNorthwest Region\nSoutheast Region\nNorth Region\nColorado\nColorado Springs\nAlabama\nBaldwin County\nDelaware\nNorthern Delaware\nDenver\nBirmingham\nSouthern Delaware\nFort Collins\nHuntsville\nIllinois\nChicago\nOregon\nBend\nMobile\nIndiana\nFort Wayne\nEugene/Springfield\nMontgomery\nIndianapolis\nMedford\nTuscaloosa\nNorthwest Indiana\nPortland/Salem\nFlorida\nCape Coral/Fort Myers\nIowa\nDes Moines\nUtah\nSalt Lake City/Provo/Ogden\nDeltona/Daytona Beach\nIowa City/Cedar Rapids\nSt. George\nGainesville\nKansas/Missouri\nKansas City\nWashington\nBremerton\nJacksonville\nKentucky\nLouisville\nCentral Washington\nLakeland\nMaryland\nBaltimore\nKennewick/Pasco/Richland\nMiami/Fort Lauderdale\nEastern Maryland\nSeattle/Tacoma/Everett/Olympia\nOcala\nSuburban Washington, D.C.\nSpokane\nOrlando\nWestern Maryland\nVancouver\nPalm Bay/Melbourne\nMinnesota\nMinneapolis/St. Paul\nPanama City\nNebraska\nOmaha\nSouthwest Region\nPensacola\nNew Jersey\nNorthern New Jersey\nArizona\nPhoenix\nPort St. Lucie\nSouthern New Jersey\nTucson\nTallahassee\nOhio\nCincinnati/Dayton\nCalifornia\nBakersfield\nTampa/Sarasota/Punta Gorda\nColumbus\nBay Area\nWest Palm Beach\nPennsylvania\nCentral Pennsylvania\nFresno/Tulare\nLouisiana\nBaton Rouge\nPhiladelphia\nLos Angeles County\nLake Charles/Lafayette\nPittsburgh\nModesto/Merced/Stockton\nMississippi\nGulf Coast\nVirginia\nNorthern Virginia\nRedding/Chico/Yuba City\nHattiesburg\nRichmond\nRiverside County\nJackson\nVirginia Beach/Williamsburg\nSacramento\nWestern Virginia\nSan Bernardino County\nEast Region\nWest Virginia\nEastern West Virginia\nHawaii\nOahu\nGeorgia\nAtlanta\nNorthern West Virginia\nNevada\nLas Vegas\nAugusta\nWisconsin\nSoutheast Wisconsin\nReno\nCentral Georgia\nNew Mexico\nAlbuquerque\nSavannah/Brunswick\nSanta Fe\nValdosta\nNorth Carolina\nAsheville\nSouth Central Region\nCharlotte\nArkansas\nLittle Rock\nGreensboro/Winston-Salem\nNorthwest Arkansas\nNew Bern/Greenville\nOklahoma\nOklahoma City\nRaleigh/Durham/Fayetteville\nTulsa\nWilmington\nTexas\nAbilene\nSouth Carolina\nCharleston\nAustin\nColumbia\nBeaumont\nGreenville/Spartanburg\nBryan/College Station\nHilton Head\nCorpus Christi\nMyrtle Beach\nDallas\nTennessee\nChattanooga\nEast Texas\nKnoxville\nFort Worth\nMemphis\nHouston\nNashville\nKilleen/Temple/Waco\nNortheast Tennessee\nLubbock\nMidland/Odessa\nNew Braunfels/San Marcos\nSan Antonio\n3\nTable of \nContents\nWhen evaluating new or existing homebuilding markets for purposes of capital allocation, we consider local, market-specific factors, including among others:\n•\nEconomic conditions;\n•\nEmployment levels and job growth;\n•\nIncome level of potential homebuyers;\n•\nLocal housing affordability and typical mortgage products utilized;\n•\nDemand for homes at our targeted price points;\n•\nAvailability of land and lots in desirable locations on acceptable terms;\n•\nLand entitlement and development processes;\n•\nAvailability of qualified subcontractors;\n•\nNew and secondary home sales activity;\n•\nCompetition;\n•\nPrevailing housing products, features, cost and pricing; and\n•\nPerformance capabilities of our local management team.\nEconomies of Scale\nWe are the largest homebuilding company in the United States as measured by number of homes closed in fiscal 2025, and we are also one of the largest builders in most of the markets in which we operate. We believe that our national, regional and local scale provides us with benefits that may not be available to the same degree to some other smaller homebuilders, such as:\n•\nGreater access to and lower cost of capital due to our balance sheet strength and our lending and capital markets relationships;\n•\nVolume discounts and rebates from national, regional and local materials suppliers and lower labor rates from certain subcontractors; and\n•\nEnhanced leverage of our general and administrative activities, which allows us flexibility to adjust to changes in market conditions and compete effectively across our markets.\nDecentralized Homebuilding Operations\nWe view homebuilding as a local business; therefore, most of our direct homebuilding activities are decentralized to provide flexibility to our local managers in making operational decisions. We believe that our local management teams, who are familiar with local market conditions, have the best information to make many decisions regarding their operations. At September 30, 2025, we had 92 separate homebuilding operating divisions, many of which operate in more than one market area. Generally, each operating division consists of a division president; a controller and accounting personnel; land entitlement, acquisition and development personnel; a sales manager and sales and marketing personnel; a construction manager and construction superintendents; customer service personnel; a purchasing manager and office staff. Our division presidents receive performance-based compensation for achieving targeted financial and operating metrics related to their operating divisions. Following is a summary of our homebuilding activities that are decentralized in our local operating divisions and the control and oversight functions that are centralized in our regional and corporate offices.\n4\nTable of \nContents\nOperating Division Responsibilities\nEach homebuilding operating division is responsible for:\n•\nSite selection, which involves\n— A feasibility study;\n— Soil and environmental reviews;\n— Review of existing zoning and other governmental requirements;\n— Review of the need for and extent of offsite work required to obtain project entitlements and to complete necessary infrastructure; and\n— Financial analysis of the potential project;\n•\nNegotiating lot purchase, land acquisition and related contracts;\n•\nObtaining all necessary land development and home construction approvals;\n•\nSelecting subcontractors and ensuring their work meets our contracted scopes;\n•\nSelecting building and architectural plans;\n•\nPlanning and managing home construction schedules;\n•\nDetermining the pricing for each house plan and options in a given community;\n•\nDeveloping and implementing local marketing and sales plans;\n•\nCoordinating all interactions with customers and real estate brokers during the sales, construction and home closing processes; and \n•\nEnsuring the quality and timeliness of post-closing service and warranty repairs provided to customers.\nCentralized Controls\nWe centralize many important risk elements of our homebuilding business through our regional and corporate offices. We have separate homebuilding regional offices, which generally consist of a region president, a chief financial officer, legal counsel and other operational and office support staff. Each of our region presidents and their management teams are responsible for oversight of the operations of a number of homebuilding operating divisions, including:\n•\nReview and approval of division business plans and budgets;\n•\nReview and approval of all land and lot acquisition contracts;\n•\nReview of all business and financial analysis for potential land and lot inventory investments;\n•\nOversight of land and home inventory levels;\n•\nMonitoring division financial and operating performance; and\n•\nReview of major personnel decisions and division incentive compensation plans.\n5\nTable of \nContents\nOur corporate executives and corporate office departments are responsible for establishing our operational policies and internal control standards and for monitoring compliance with established policies and controls throughout our operations. The corporate office also has primary responsibility for direct management of certain key risk elements and initiatives through the following centralized functions:\n•\nCash management;\n•\nFinancing;\n•\nAllocation of capital;\n•\nIssuance and monitoring of inventory investment guidelines;\n•\nApproval and funding of land and lot acquisitions;\n•\nMonitoring and analysis of profitability, returns, costs and inventory levels;\n•\nEnvironmental assessments of land and lot acquisitions;\n•\nRisk and litigation management;\n•\nTechnology systems to support management of operations, marketing and financial information, including preventing, monitoring and reporting of cybersecurity issues;\n•\nAccounting and management reporting;\n•\nIncome taxes;\n•\nInternal audit;\n•\nPublic financial reporting and investor and media relations;\n•\nAdministration of payroll and employee benefits;\n•\nNegotiation of national purchasing contracts;\n•\nAdministration, reporting and monitoring of customer surveys and resolution of homeowner concerns; and\n•\nApproval of major personnel decisions and management incentive compensation plans.\nLand/Lot Acquisition and Inventory Management\nWe acquire land for use in our operations after we have completed due diligence and generally after we have obtained the entitlements to begin development or construction work resulting in an acceptable number of residential lots. Before we acquire lots or tracts of land, we complete a feasibility study, which includes soil tests, independent environmental studies, other engineering work and financial analysis. We also evaluate the status of necessary zoning and other governmental entitlements required to develop and use the property for home construction.\nWe also enter into land/lot contracts, in which we obtain the right, but generally not the obligation, to buy land or lots at predetermined prices on a defined schedule commensurate with anticipated home closings or planned development. These contracts generally are non-recourse, which limits our financial exposure to our earnest money deposited into escrow under the terms of the contract and any pre-acquisition due diligence costs we incur. This enables us to control land and lot positions with limited capital investment, which substantially reduces the risks associated with land ownership.\n6\nTable of \nContents\nWe attempt to mitigate our exposure to real estate inventory risks by:\n•\nControlling our level of inventory investment and managing our supply of land/lots owned and controlled through purchase contracts to match the expected housing demand in each of our operating markets;\n•\nMonitoring local market and demographic trends, housing preferences and related economic developments, including the identification of desirable housing submarkets based on the quality of local schools, new job opportunities, local growth initiatives and personal income trends;\n•\nUtilizing land/lot purchase contracts and seeking to acquire developed lots which are substantially ready for home construction, where possible; and\n•\nMonitoring and managing the number of speculative homes (homes under construction without an executed sales contract) built in each subdivision.\nLand Development and Home Construction\nSubstantially all of our land development and home construction work is performed by subcontractors. Subcontractors typically are selected after a competitive bidding process and are retained for a specific subdivision or series of house plans pursuant to a contract that obligates the subcontractor to complete the scope of work at an agreed-upon price. We employ land development and construction personnel to monitor construction activities, participate in major building decisions, coordinate the activities of subcontractors and suppliers, review the work of subcontractors for quality and cost controls and monitor compliance with zoning and building codes. In addition, our construction personnel interact with our homebuyers during the construction process and instruct buyers on post-closing home maintenance.\nOur home designs are selected or prepared in each of our markets to appeal to local homebuyers’ expectations for affordability, home size and features, and our local management teams adjust product offerings to meet buyer demand as necessary. In some communities, we offer optional interior and exterior features to homebuyers for an additional charge.\nWe typically do not maintain significant inventories of land development or construction materials, except for work in progress materials for active development projects and homes under construction. Generally, the construction materials used in our operations have been readily available from numerous sources, and we have contracts exceeding one year with certain suppliers of building materials that are cancelable at our option. Construction time for our homes depends on the availability of labor, materials and supplies, the weather, the size of the home and other factors. We completed the construction of most homes in two to four months in fiscal 2025.\nWe are subject to governmental regulations that affect our land development and construction operations. We frequently experience delays in receiving the necessary approvals from municipalities or other government agencies, which often delays our anticipated development and construction activities. \nCost Controls\nWe control construction costs by designing our homes efficiently, utilizing common house plans as consistently as possible and obtaining competitive bids for construction materials and labor. We also negotiate pricing from our subcontractors and suppliers based on the volume of services and products we purchase on a local, regional and national basis. We monitor our land development expenditures and construction costs versus budgets for each house and community, and we review our inventory levels, margins, expenses, profitability and returns for each operating market compared to both its business plan and our performance expectations.\nWe control overhead costs by centralizing certain accounting and administrative functions, monitoring staffing and compensation levels and by applying technology to business processes to improve productivity where practical. We review other general and administrative costs to identify efficiencies and savings opportunities in our operating divisions and our regional and corporate offices. We also direct most of our promotional activities toward digital marketing initiatives and local real estate brokers, which we believe are efficient uses of our marketing expenditures.\n7\nTable of \nContents\nMarketing and Sales\nWe primarily use the D.R. Horton brand name to market and sell our homes. We offer various floor plans and product types with a primary focus on the first time and first time move-up homebuyer, which account for the majority of our home closings. We also offer entry-level homes for buyers focused on affordability, higher-end move-up and luxury homes and homes for active adult buyers seeking a low-maintenance lifestyle.\nWe market and sell our homes primarily through commissioned sales employees, and the majority of our home closings also involve an independent real estate broker. We typically conduct home sales from sales offices located in furnished model homes in each subdivision, and we generally do not offer our model homes for sale until the completion of a subdivision. Our sales personnel assist prospective homebuyers by providing available floor plans and pricing information, demonstrating the features and layouts of our homes and assisting with the selection of options, when available. We train and inform our sales personnel regarding construction schedules and marketing and advertising plans. As market conditions warrant, we may provide potential homebuyers with a variety of incentives to be competitive in a particular market or to attain our targeted sales pace.\nWe market our homes and communities to prospective homebuyers and real estate brokers digitally, through email, search engine marketing, social media, our company website and other real estate websites. We also use billboards, radio, television and print media and advertising locally as necessary. We attempt to position our subdivisions in locations that are desirable to potential homebuyers and convenient to or visible from local traffic patterns. Model homes play an important role in our marketing efforts, and we strive to create an attractive atmosphere in our model homes.\nWe build speculative homes in essentially all of our communities, which allow us to compete effectively with existing homes available in the market and improve our returns. These homes enhance our marketing and sales efforts to homebuyers who are currently renting or who are relocating to these markets and require a home within a short time frame, as well as to independent brokers who represent these homebuyers. We determine our speculative homes strategy in each market based on local market factors, such as new job growth and relocations, housing demand and supply, seasonality, current sales contract cancellation trends and our past experience in the market. We attempt to maintain a level of speculative home inventory in each community based on our current and planned sales pace, and we monitor and adjust speculative home inventory on an ongoing basis.\nSales Contracts and Backlog\nOur sales contracts require an earnest money deposit which varies in amount across our markets and communities. Additionally, customers are generally required to pay additional deposits if they select options or upgrade features for their homes. Our sales contracts include a financing contingency which permits customers to cancel and receive a refund of their deposit if they cannot obtain mortgage financing at prevailing or specified interest rates within a defined period. Our contracts may include other contingencies, such as the sale of the customer’s existing home. We either retain or refund customer deposits on cancelled sales contracts, depending upon the applicable provisions of the contract or other circumstances.\nSales order backlog represents homes under contract but not yet closed at the end of the period. At September 30, 2025, the value of our backlog of sales orders was $4.1 billion (10,785 homes), a decrease of 14% from $4.8 billion (12,180 homes) at September 30, 2024. The average sales price of homes in backlog was $382,000 at September 30, 2025, down from the $391,700 average at September 30, 2024. Many of the contracts in our sales order backlog are subject to contingencies, such as those described above, which can result in cancellations. As a percentage of gross sales orders, cancellations of sales contracts were 18% in both fiscal 2025 and 2024.\nThe length of time between the signing of a sales contract for a home and delivery of the home to the buyer (closing) is generally from one to three months; therefore, substantially all of the homes in our sales backlog at September 30, 2025 are scheduled to close in fiscal 2026.\n8\nTable of \nContents\nCustomer Service and Quality Control\nOur homebuilding operating divisions are responsible for pre-closing quality control inspections and responding to customers’ post-closing needs. We believe that a prompt and courteous response to homebuyers’ needs during and after construction reduces post-closing repair costs, enhances our reputation for quality and service and ultimately leads to repeat and referral business from the real estate community and homebuyers. We typically provide our homebuyers with a ten-year limited warranty for major defects in structural elements such as framing components and foundation systems, a two-year limited warranty on major mechanical systems and a one-year limited warranty on other construction components. The subcontractors who perform the actual construction also provide us with warranties on workmanship and are expected to respond to us and the homeowner in a timely manner. In addition, some of our suppliers provide manufacturer’s warranties on specified products installed in the home.\nRental Properties\nOur single-family rental operations construct and lease single-family homes within a community and market each community for a bulk sale of rental homes. We sold 3,460 single-family rental homes in fiscal 2025 compared to 3,970 homes in fiscal 2024. Our multi-family rental operations develop, construct, lease and sell residential rental properties. We primarily focus on constructing garden style apartment communities in high growth suburban markets. We sold 2,947 multi-family rental units in fiscal 2025 compared to 2,202 units in fiscal 2024.\nForestar Residential Lot Development Operations\nWe own approximately 62% of the outstanding shares of Forestar, a publicly traded residential lot development company with operations in 64 markets across 23 states as of September 30, 2025. Forestar is a key part of our strategy to maintain relationships with land developers and to control a large portion of our land and lot position through land purchase contracts. Forestar continues to invest in land acquisition and development to expand its residential lot development business across a geographically diversified national platform and consolidate market share in the fragmented U.S. lot development industry. Our homebuilding operations acquire finished lots from Forestar in accordance with the master supply agreement between the two companies. A shared services agreement is in place whereby we provide Forestar certain administrative, compliance, operational and procurement services. As the controlling shareholder, we have significant influence in guiding the strategic direction and operations of Forestar.\nCustomer Mortgage Financing\nWe provide mortgage financing services primarily to purchasers of our homes in the majority of our homebuilding markets through DHI Mortgage, our wholly owned subsidiary. DHI Mortgage assists in the sales transaction by coordinating the mortgage application, mortgage commitment and home closing processes to facilitate a timely and efficient experience for our homebuyers. During fiscal 2025, DHI Mortgage provided mortgage financing services for 81% of the homes closed by our homebuilding operations, and those loans accounted for substantially all of DHI Mortgage’s total loan volume. Our homebuilding divisions may also work with additional mortgage lenders that offer a range of mortgage financing programs to our homebuyers.\nTo limit the risks associated with our mortgage operations, DHI Mortgage originates loan products that we believe can be sold to third-party purchasers of mortgage loans, the majority of which are eligible for sale to the Federal National Mortgage Association (Fannie Mae), the Federal Home Loan Mortgage Corporation (Freddie Mac) or the Government National Mortgage Association (Ginnie Mae). DHI Mortgage sells substantially all of the loans and the related servicing rights to third-party purchasers after origination. DHI Mortgage centralizes most of its control and oversight functions, including those related to loan underwriting, quality control, regulatory compliance, secondary marketing of loans, hedging activities, accounting and financial reporting.\nTitle Services\nThrough our subsidiary title companies, we issue title insurance policies and provide examination, underwriting and closing services primarily to our homebuilding customers in many of our markets.\n9\nTable of \nContents\nHuman Capital Resources\nPeople and Culture\nAs of September 30, 2025, we employed 14,341 people, of whom 9,972 work in our homebuilding operations, 2,967 in our financial services operations, 586 at our corporate office, 330 in our rental operations, 433 at Forestar and 53 in our other businesses. Of our homebuilding employees, 3,626 are involved in construction, 2,935 are sales and marketing personnel and 3,411 are office personnel.\nWe believe the people who work for our company are our most important resource and are critical to our continued success. We focus significant attention toward attracting and retaining talented and experienced individuals to manage and support our operations. Our people are expected to exhibit and promote honest, ethical and respectful conduct in the workplace. All of our employees must certify annually to their understanding of and adhere to a code of conduct that sets standards for appropriate behavior and includes required internal training on preventing, identifying, reporting and stopping any type of discrimination.\nRecruitment, Development and Retention\nWe are committed to hiring, developing and supporting an energetic workforce and maintaining a productive, positive and inclusive workplace. We believe that when people feel included and have ample opportunities for professional growth, they bring forward a variety of perspectives and ideas that strengthen our company. We have an active recruiting team that partners with college campuses and external organizations to identify promising new talent and established professionals. Through our paid internship program, college students and recent graduates gain valuable experience working alongside some of the most experienced professionals in the homebuilding industry. Our management team also supports a culture of developing future leaders from our existing workforce, enabling us to promote from within for many leadership positions. We believe this provides long-term focus and continuity to our operations while also providing opportunities for the growth and advancement of our employees. We regularly conduct specialized training for employees within key business functions of our homebuilding operations, such as purchasing, construction, sales and financial management. Additionally, our Leadership Development Program provides internal training designed to equip future leaders for roles across all areas of our operations. During fiscal 2025, 18 people were placed into a new homebuilding market leadership position, and 100% of those were promoted from within the company.\nThe long-term retention of our employees provides us with an experienced, cohesive workforce, which has been vital to achieving our goals. Our focus on retention is evident in the length of service of our executive, regional and divisional management teams. The average tenure of our executive team is 28 years, our homebuilding region presidents and vice presidents is 20 years and our homebuilding division presidents and city managers is 15 years. Our Board of Directors (Board) is actively involved in our company’s executive leadership succession planning and is equally committed to our culture of promoting rising talent from within.\nCompensation and Benefits\nWe believe our compensation package and benefits are competitive with others in our industry. In addition to base pay, eligible employees may participate in our incentive bonus and stock compensation plans, which align their compensation to the interests of our shareholders. A substantial portion of our executive and senior operating leadership’s total compensation is variable, at risk pay based on our company’s performance. We also offer our employees a broad range of benefits, including paid vacation, holidays, sick time and parental leave; medical, dental and vision healthcare insurance; and life insurance and disability coverage. Additional benefits offered include a 401(k) savings plan, employee stock purchase plan and access to professional resources to support employees with their mental and physical health, family and financial planning, identity theft protection and legal needs. We host events and challenges, both virtually and in person, to encourage our employees to stay active and healthy. We are committed to supporting our employees in their health, wellness and financial planning goals. Additional information about our compensation and employee benefit plans is included in Note K to the accompanying financial statements.\n10\nTable of \nContents\nWorkplace Safety and Wellness\nThe safety and well-being of our employees is our first priority. We take workplace safety seriously at our construction sites and in our offices. We provide third-party training for our field personnel to become certified by the Occupational Safety and Health Administration. We also provide our teams with many safety resources, including safety checklists, policies, procedures and best practices, and we communicate with all employees through a monthly safety newsletter to inform and reinforce our commitment to and concern for their well-being. Additionally, because substantially all land development and home construction work is performed by subcontractors, we require that our subcontractors maintain safety programs as well.\nAdditional information regarding human capital is available in the “Sustainability” section of our Investor Relations website at investor.drhorton.com.\nSustainability\nWe publish consistent and relevant sustainability information on an annual basis. Our most recent Sustainability Report published in September 2025 includes data aligned with the homebuilders industry reporting standards prepared by the Sustainability Accounting Standards Board, now a part of the International Sustainability Standards Board. Our Sustainability Report is not considered part of or incorporated by reference in this Annual Report. The report also covers topics of importance to our company and our stakeholders, including, but not limited to: \n•\nRisk management;\n•\nBoard oversight, ethics, diversity and independence;\n•\nHome affordability and community impact;\n•\nHome energy efficiency, quality and safety;\n•\nWorkplace health and safety;\n•\nTalent retention and employee well-being;\n•\nResponsible land development;\n•\nWater management and efficiency; and\n•\nGreenhouse gas emissions.\nBusiness Acquisitions\nWe routinely evaluate opportunities to expand our operations, including potential acquisitions of other homebuilding or related businesses. Acquisitions of homebuilding and related businesses usually provide us with immediate land and home inventories and control of additional land and lot positions through purchase contracts. Also, employees of acquired businesses generally have specialized knowledge of local market conditions, including existing relationships with municipalities, land owners, developers, subcontractors and suppliers. These inventory positions and local market knowledge and relationships could take us several years to develop through our own efforts. We seek to limit the risks associated with acquiring other companies by conducting extensive operational, financial and legal due diligence on each acquisition and by performing financial analysis to determine that each acquisition is expected to have a positive impact on our earnings, returns and strategic position.\nCompetition\nWe operate as a provider of residential housing in both the for sale and rental markets, which are highly competitive. We compete not only for homebuyers and renters, but also for desirable properties, raw materials, skilled labor and financing. We compete with local, regional and national homebuilding and rental companies and also with existing home sales and rental properties. We compete based on price, location, quality and design of our homes and on mortgage financing terms.\n11\nTable of \nContents\nCompetition to our financial services businesses includes other mortgage lenders and title companies, including national, regional and local mortgage banks and other financial institutions. Some of these competitors are subject to fewer governmental regulations and have greater access to capital than we do, may operate with different lending criteria and/or may offer a broader or more attractive array of financing and other products and services to potential customers. We strive to provide flexible, fairly priced financing alternatives subject to applicable regulations.\nOur businesses compete with other companies across all industries to attract and retain highly skilled and experienced employees, managers and executives. Competition for the services of these individuals increases as business conditions improve in the industries in which we operate and in the general economy.\nGovernmental Regulations and Environmental Matters\nWe operate in industries that are subject to extensive and complex regulations. We and the subcontractors we use must comply with many federal, state and local laws and regulations. These include zoning, density and development requirements and building, environmental, advertising, labor and real estate sales rules and regulations. These regulations and requirements affect substantially all aspects of our land development and home design, construction and sales processes in varying degrees across our markets. Our homes are inspected by local authorities where required, and homes eligible for insurance or guarantees provided by the Federal Housing Administration (FHA) and the U.S. Department of Veteran Affairs (VA) are subject to inspection by them. These regulations often provide broad discretion to the administering governmental authorities. In addition, our new housing developments may be subject to various assessments for schools, parks, streets, utilities and other public improvements.\nOur construction and land development activities are also subject to an extensive array of local, state and federal statutes, ordinances, rules and regulations concerning protection of health, safety and the environment. The compliance requirements for each site vary greatly according to location, environmental condition and the present and former uses of the site and adjoining properties. We believe that we are in compliance in all material respects with existing environmental regulations applicable to our business. Additionally, our compliance with such regulations has not had, nor is it expected to have, a material adverse effect on our consolidated financial position, results of operations or cash flows. However, changes in regulations, such as the climate-related disclosure legislation recently enacted by the State of California, could increase our costs to comply with such regulations, as discussed in “",
    "item1a": "Item 1A, “Risk Factors.”\nGovernance\nOur Board considers cybersecurity and other information technology risk as part of its risk oversight function. \nThe members of our Board receive reports on our cybersecurity risks and risk management on at least an annual basis from our CIO and CSRO.\n These reports include reviewing current trends, processes and systems used to mitigate the risk of cybersecurity threats. Our internal audit department also conducts cybersecurity reviews as part of its audit procedures and presents any findings to the Board. We have protocols by which certain cybersecurity incidents would be escalated within the Company and, where appropriate, reported to the Board in a timely manner.\nWe invest a considerable amount of resources in training, tools and other resources to manage risks from cybersecurity threats. Our cybersecurity program is led by an experienced team that creates cybersecurity policies and procedures and possesses expert knowledge related to controls and safeguards related to cybersecurity. Led by our CIO, our cybersecurity team is responsible for assessing and managing risks from cybersecurity threats. The CIO receives reports on cybersecurity threats from the cybersecurity team on an ongoing basis and in conjunction with the CSRO, regularly reviews risk management measures implemented by the Company to identify and mitigate data protection and cybersecurity risks. Our CIO and CSRO work closely with our legal team to oversee compliance with legal, regulatory and contractual security requirements.\n \nOur CIO has 36 years of experience working in information technology including roles in the commercial software development, healthcare, industrial and professional services sectors. While in those roles, our CIO has led governance, risk, and compliance technology programs and information security programs. The CIO currently reports to the CFO.\nOur CSRO has 24 years of experience working in information technology and cybersecurity roles including software development, identity and access management projects, privilege account management and multi-factor authentication implementations. While in those roles, our CSRO has led projects and implementations for a variety of organizations that assess and create solutions for security concerns. The CSRO currently reports to the CIO.\nSupporting the CIO and CSRO is a dedicated cybersecurity team that designs and monitors our cybersecurity control framework as well as implements cybersecurity control systems and solutions. Our cybersecurity team collectively holds the following degrees and certifications: Master’s in Cybersecurity, Certified Information Systems Security Professional, Security+, Network+, AQS Certified Cloud Practitioner and Certified Information Systems Auditor.\n27\nTable of \nContents",
    "item1b": "ITEM 1B.    UNRESOLVED STAFF COMMENTS\nNone.\n25\nTable of \nContents",
    "item1c": "ITEM 1C.    CYBERSECURITY\nRisk Management and Strategy\nWe have processes in place for assessing, identifying, and managing risks from cybersecurity threats that may result in material adverse effects to the confidentiality, integrity and availability of our systems, operations and data. These processes are a part of our overall risk assessment process.\n Risks from cybersecurity threats include, among other things, unauthorized access, data theft, computer viruses, ransomware, malicious software and other disruptions. We have implemented systems and processes utilizing a multilayered, proactive approach to identify, evaluate, mitigate and prevent potential cybersecurity threats. Each of these layers contain multiple levels of protection and leverage industry standard framework including the National Institute of Standards and Technology (NIST) Cybersecurity Framework. At the management level, these systems and processes are overseen primarily by our \nChief Information Officer (CIO) and our Cyber Security Risk Officer (CSRO)\n.\nWe have implemented processes to assess, identify, and manage risks from cybersecurity threats, including the following:\n•\nMuti-factor Authentication:\n We secure access to our network and systems through multi-factor authentication.\n•\nLayered Email Protection\n: We have adopted a layered approach to email protection.\n•\nZero-Trust Security Model\n: We are working towards a zero-trust security model, utilizing group-based access controls to manage network resources.\n•\nContinuous Monitoring\n: We continuously monitor our systems for security anomalies, to help enable early detection of issues and facilitating a rapid response.\n•\nRegular Scans\n: We conduct weekly and monthly scans to identify and prioritize the mitigation of the most critical vulnerabilities.\n•\nQuarterly Penetration Testing\n: \nWe engage third-party consultants to perform quarterly penetration testing, examining our environment from various perspectives, including end-user and employee use cases, to thoroughly assess system vulnerabilities.\n•\nCollaborative Evaluation and Remediation\n: In collaboration with our third-party consultants, we evaluate the outcomes of our testing, address and remediate any identified issues, and subsequently re-test the environment to confirm that the mitigations have effectively resolved the vulnerabilities.\n•\nRegular Assessments and Gap Analyses\n: Our cybersecurity team regularly meets with the third-party consultants to assess overall risk and conduct gap analyses, ensuring the effectiveness of our current cybersecurity measures.\n•\nComprehensive Risk Assessment\n: Our comprehensive risk assessment includes evaluating potential security risks associated with the use of external service providers.\n•\nIncident Response Readiness\n: We maintain a documented incident response readiness process that details the procedures to follow in the event of a security incident.\n•\nData Backup\n: We maintain comprehensive backups of all system files to facilitate data recovery during a security incident.\nIn addition to the above-described technology controls, we have implemented mandatory training and awareness programs designed to educate our employees on cybersecurity risks. These include periodic exercises to help employees identify phishing schemes and other social engineering tactics, and we provide various methods for them to report suspicious activity that may give rise to a cybersecurity incident.\n26\nTable of \nContents\nTo date, we have not identified any risks from known cybersecurity threats, including as a result of any previous cybersecurity incidents, that have materially affected or are reasonably likely to materially affect our business strategy, results of operations or financial condition.\n However, because the sophistication of cybersecurity threats continues to increase with rapidly evolving techniques to overcome security measures, the preventative actions we have taken and will continue to take to reduce the risks may not successfully protect our systems against a future cybersecurity incident. For more information on how cybersecurity risk could materially affect our business, please refer to"
  }
}