{
  "ticker": "DHR",
  "cik": "0000313616",
  "company_name": "DANAHER CORP /DE/",
  "filing_date": "2025-02-20",
  "accession": "0000313616-25-000043",
  "primary_doc": "dhr-20241231.htm",
  "item_sections": {
    "item1": "Item 1. Business—General” for a discussion of Danaher’s strategic objectives and methodologies for delivering long-term shareholder value.  Danaher is a multinational business with global operations.  During 2024, approximately 58% of Danaher’s sales were derived from customers outside the United States.  As a diversified, global business, Danaher’s operations are affected by worldwide, regional and industry-specific economic, political and geopolitical factors.  Danaher’s geographic and industry diversity, as well as the range of its products and services, help mitigate the impact of any one industry or the economy of any single country, other than the United States, on its consolidated operating results.  The Company’s individual businesses monitor key competitors and customers, including to the extent possible their sales, to gauge relative performance and the outlook for the future.\nAs a result of the Company’s geographic and industry diversity, the Company faces a variety of opportunities and challenges, including rapid technological development (particularly with respect to computing, automation, artificial intelligence, mobile connectivity and digitization) in most of the Company’s served markets, the expansion and evolution of opportunities in high-growth markets, trends and costs associated with a global labor force, consolidation of the Company’s competitors and regulatory changes.  The Company operates in a highly competitive business environment in most markets, and the Company’s long-term growth and profitability will depend in particular on its ability to expand its business in high-growth geographies and higher-growth market segments, identify, consummate and integrate appropriate acquisitions and identify and consummate appropriate investments and strategic partnerships, develop innovative and differentiated new products and services with higher gross profit margins, expand and improve the effectiveness of the Company’s sales force, continue to reduce costs and improve operating efficiency and quality, and effectively address the demands of an increasingly regulated global environment.  The Company is making significant investments, organically and through acquisitions and investments, to address the rapid pace of technological change in its served markets and to globalize its manufacturing, research and development and customer-facing resources (particularly in high-growth markets) in order to be responsive to the Company’s customers throughout the world and improve the efficiency of the Company’s operations.\nBusiness Performance\nConsolidated revenues for the year ended December 31, 2024 were flat and core sales decreased 1.5% as compared to 2023.  Acquisitions contributed 2.0% to sales in 2024 compared to 2023, and were largely offset by core revenue declines led by the Biotechnology segment, and to a lesser extent the Life Sciences segment, partially offset by higher core sales in the Diagnostics segment.  The impact of currency translation decreased reported sales by 0.5% in 2024 compared to 2023.  For the definition of “core sales” refer to “—Results of Operations” below.\n35\nTable of Contents\nGeographically, the Company’s sales in developed markets in 2024 increased 2% compared to 2023 driven primarily by increased sales in North America.  For the same period, core sales in developed markets were essentially flat, primarily due to increased core sales in North America offset by decreased core sales in Western Europe.  Increased demand in the Diagnostics segment, offset by decreased demand in the Biotechnology and Life Sciences segments, contributed to the year-over-year flat core sales growth in developed markets.  For the same period, sales in high-growth markets decreased year-over-year by 4% and core sales in high-growth markets decreased at a mid-single digit rate, due primarily to low double-digit core revenue declines in China.  The decline in core sales in high-growth markets was primarily driven by lower demand across all segments, due to weakness in capital spending and generally lower underlying activity levels.  High-growth markets represented approximately 29% of the Company’s total sales in 2024.\nThe Company’s net earnings from continuing operations for the year ended December 31, 2024 totaled approximately $3.9 billion, compared to approximately $4.2 billion for the year ended December 31, 2023.  Net earnings attributable to common stockholders for the year ended December 31, 2024 totaled approximately $3.9 billion or $5.29 per diluted common share compared to approximately $4.7 billion or $6.38 per diluted common share for the year ended December 31, 2023.  2024 intangible asset impairments and increased operating expenses, net of increased other income, drove the year-over-year decline in net earnings from continuing operations and diluted net earnings per common share from continuing operations.  In addition to the above factors, net earnings from discontinued operations for 2024 compared with 2023 contributed to the lower net earnings attributable to common stockholders in 2024.  Refer to “—Results of Operations” for further discussion of the year-over-year changes in net earnings and diluted net earnings per common share for the years ended December 31, 2024 and 2023.  In response to current economic conditions, the Company expects to review and adjust its cost structure.  In the first quarter of 2025, the Company commenced an initiative to identify productivity improvement and cost savings opportunities that we anticipate would generate annual pre-tax savings of at least $150 million.  The Company expects these opportunities to be broad-based, including opportunities within China and the Diagnostics segment.\nAcquisitions \nDuring 2024, the Company acquired 3 businesses for total consideration of $558 million in cash, net of cash acquired.  The businesses acquired complement existing units of the Company’s Life Sciences segment.  The Company preliminarily recorded an aggregate of $305 million of goodwill related to these acquisitions.  \nRefer to Note 2 to the Consolidated Financial Statements for discussion regarding the Company’s acquisitions. \nVeralto Corporation Separation\nOn September 30, 2023 (the “Distribution Date”), the Company completed the separation (the “Separation”) of its former Environmental & Applied Solutions business by distributing to Danaher stockholders on a pro rata basis all of the issued and outstanding common stock of Veralto Corporation (“Veralto”), the entity Danaher incorporated to hold such businesses.  To effect the Separation, Danaher distributed to its stockholders one share of Veralto common stock for every three shares of Danaher common stock outstanding as of September 13, 2023, the record date for the distribution.  Fractional shares of Veralto common stock that otherwise would have been distributed were aggregated and sold into the public market and the proceeds distributed to Danaher stockholders who otherwise would have received fractional shares of Veralto common stock.\nThe accounting requirements for reporting the Separation as a discontinued operation were met when the Separation was completed.  Refer to Note 3 to the Consolidated Financial Statements for further discussion.  \nRESULTS OF OPERATIONS\nIn this report, references to the non-GAAP measure of core sales (also referred to as core revenues or sales/revenues from existing businesses) refer to sales from continuing operations calculated according to generally accepted accounting principles in the United States (“GAAP”) but excluding:\n•\nsales from acquired businesses (as defined below); and\n•\nthe impact of currency translation.\nReferences to sales or operating profit attributable to acquisitions or acquired businesses refer to sales or operating profit, as applicable, from acquired businesses recorded prior to the first anniversary of the acquisition less any sales and operating profit, during the applicable period, attributable to divested product lines not considered discontinued operations.  The portion of revenue attributable to currency translation is calculated as the difference between:\n•\nthe period-to-period change in revenue (as defined above); and\n•\nthe period-to-period change in revenue (as defined above) after applying current period foreign exchange rates to the prior year period.\n36\nTable of Contents\nCore sales growth (decline) should be considered in addition to, and not as a replacement for or superior to, sales, and may not be comparable to similarly titled measures reported by other companies.  Management believes that reporting this non-GAAP financial measure provides useful information to investors by helping identify underlying growth trends in Danaher’s business and facilitating comparisons of Danaher’s revenue performance with its performance in prior and future periods and to Danaher’s peers.  Management also uses this non-GAAP financial measure to measure the Company’s operating and financial performance and as one of the performance measures in the Company’s executive short-term cash incentive program.  The Company excludes the effect of currency translation from this measure because currency translation is not under management’s control, is subject to volatility and can obscure underlying business trends, and excludes the effect of acquisitions and divestiture-related items because the nature, size, timing and number of acquisitions and divestitures can vary dramatically from period-to-period and between the Company and its peers and can also obscure underlying business trends and make comparisons of long-term performance difficult.\nThroughout this discussion, references to sales growth or decline refer to the impact of both price and unit sales and references to productivity improvements generally refer to improved cost efficiencies resulting from the ongoing application of DBS.\nThe Company deems acquisition-related transaction costs incurred in a given period to be significant (generally relating to the Company’s larger acquisitions) if it determines that such costs exceed the range of acquisition-related transaction costs typical for Danaher in a given period.\nSales Growth (Decline) and Core Sales Decline \n2024 vs. 2023\n2023 vs. 2022\nTotal sales growth (decline) (GAAP)\n— \n%\n(10.5)\n%\nImpact of:\nAcquisitions\n(2.0)\n%\n(0.5)\n%\nCurrency exchange rates \n0.5 \n%\n1.0 \n%\nCore sales decline (non-GAAP)\n(1.5)\n%\n(10.0)\n%\n2024 Sales Compared to 2023\nTotal sales were flat on a year-over-year basis in 2024 as sales from acquired businesses, which increased reported sales by 2.0%, were largely offset by a 1.5% decrease in core sales resulting from the factors discussed below by segment.  The impact of changes in currency exchange rates decreased reported sales by 0.5% on a year-over-year basis in 2024 primarily due to the impact of the strengthening of the U.S. dollar against most other major currencies in 2024.  Price increases contributed 1.0% to sales growth on a year-over-year basis and are reflected as a component of core sales decline above.\nOperating Profit Performance\nOperating profit margins decreased 140 basis points from 21.8% for the year ended December 31, 2023 to 20.4% for the year ended December 31, 2024.  The following factors impacted year-over-year operating profit margin comparisons.\n2024 vs. 2023 operating profit margin comparisons were unfavorably impacted by:\n•\nThe incremental dilutive effect in 2024 of acquired businesses - 85 basis points\n•\n2024 impairment charges related to a trade name in each of the Life Sciences and Diagnostics segments, net of 2023 impairment charges related to technology-based intangible assets in the Diagnostics segment and technology-based intangible assets and other assets in the Biotechnology segment.  Refer to Note 10 to the accompanying Consolidated Financial Statements for additional information regarding the impairments - 75 basis points\n•\nFull year 2024 loss on the termination of a commercial arrangement in the Diagnostics segment - 25 basis points\n•\n2023 gain from the resolution of a litigation contingency in the Life Sciences segment - 5 basis points\n2024 vs. 2023 operating profit margin comparisons were favorably impacted by:\n•\nAcquisition-related transaction costs deemed significant, settlement of pre-acquisition share-based payment awards and fair value adjustments to inventory in 2023, net of acquisition-related fair value adjustment to inventory in 2024, in each case related to the acquisition of Abcam plc (“Abcam”) - 30 basis points\n•\nIncreased leverage and productivity in the Company’s operational and administrative cost structure, net of lower 2024 core sales and the impact of product mix - 20 basis points\n37\nTable of Contents\nBusiness Segments\nSales by business segment for the years ended December 31 are as follows ($ in millions):\n \n2024\n2023\n2022\nBiotechnology\n$\n6,759 \n$\n7,172 \n$\n8,758 \nLife Sciences\n7,329 \n7,141 \n7,036 \nDiagnostics\n9,787 \n9,577 \n10,849 \nTotal\n$\n23,875 \n$\n23,890 \n$\n26,643 \nFor information regarding the Company’s sales by geographical region, refer to Note 5 to the Consolidated Financial Statements.\nBIOTECHNOLOGY\nThe Biotechnology segment includes the bioprocessing and discovery and medical businesses and offers a broad range of equipment, consumables and services that are primarily used by customers to advance and accelerate the research, development, manufacture and delivery of biological medicines.  The Company’s solutions support a broad range of biotherapeutics including monoclonal antibodies, recombinant proteins, replacement therapies such as insulin and vaccines, as well as novel cell, gene, mRNA and other nucleic acid therapies. \nBiotechnology Selected Financial Data \n \nYear Ended December 31\n($ in millions)\n2024\n2023\n2022\nSales\n$\n6,759 \n$\n7,172 \n$\n8,758 \nOperating profit\n1,685 \n1,909 \n3,008 \nDepreciation \n151 \n162 \n190 \nAmortization of intangible assets\n863 \n864 \n812 \nOperating profit as a % of sales\n24.9 \n%\n26.6 \n%\n34.3 \n%\nDepreciation as a % of sales\n2.2 \n%\n2.3 \n%\n2.2 \n%\nAmortization as a % of sales\n12.8 \n%\n12.0 \n%\n9.3 \n%\nSales Decline and Core Sales Decline\n2024 vs. 2023\n2023 vs. 2022\nTotal sales decline (GAAP)\n(6.0)\n%\n(18.0)\n%\nImpact of:\nCurrency exchange rates \n1.5 \n%\n— \n%\nCore sales decline (non-GAAP)\n(4.5)\n%\n(18.0)\n%\n2024 Sales Compared to 2023 \nPrice increases in the segment contributed 2.5% to sales growth on a year-over-year basis during 2024 as compared with 2023 and are reflected as a component of core sales above. \nDuring 2024, total Biotechnology segment sales decreased 6.0% primarily as a result of decreased core sales in the bioprocessing business, and to a lesser extent the impact of currency exchange rates.  Total segment core sales decreased across most major geographic regions, including weak demand in China as customers were cautious with their investments.  Year-over-year core sales in the bioprocessing business decreased as core sales declines in the first half of the year more than offset core sales growth in the second half.  The revenue decline in the first half of the year was primarily due to lower demand as customers reduced their inventory levels.  The bioprocessing business returned to core growth in the second half of 2024 primarily driven by improved consumables demand, primarily in North America and Europe.  Core sales in the discovery and medical business decreased year-over-year due primarily to lower demand for equipment, partially offset by an increase in demand for consumables.  \n38\nTable of Contents\nOperating Profit Performance\nOperating profit margins declined 170 basis points during 2024 as compared to 2023.  The following factors impacted year-over-year operating profit margin comparisons.\n2024 vs. 2023 operating profit margin comparisons were unfavorably impacted by:\n•\nLower 2024 core sales, reduced leverage in the segment’s operational and administrative cost structure and the impact of product mix, net of 2023 inventory write-offs - 245 basis points\n2024 vs. 2023 operating profit margin comparisons were favorably impacted by:\n•\n2023 impairment charges related to technology-based intangible assets and other assets - 75 basis points\nAmortization of intangible assets as a percentage of sales increased in 2024 as compared with 2023 due to the decrease in sales and relatively consistent amortization expense year-over-year.  \nLIFE SCIENCES\nThe Life Sciences segment offers a broad range of instruments, consumables, services and software that are primarily used by customers to study the basic building blocks of life, including DNA and RNA, nucleic acid, proteins, metabolites and cells, in order to understand the causes of disease, identify new therapies, and test and manufacture new drugs, vaccines and gene editing technologies.  Additionally, the segment provides products and consumables used to filter and remove contaminants from a variety of liquids and gases in many end-market applications. \nLife Sciences Selected Financial Data \n \nYear Ended December 31\n($ in millions)\n2024\n2023\n2022\nSales\n$\n7,329 \n$\n7,141 \n$\n7,036 \nOperating profit\n879 \n1,209 \n1,414 \nDepreciation \n167 \n129 \n112 \nAmortization of intangible assets\n576 \n429 \n419 \nOperating profit as a % of sales\n12.0 \n%\n16.9 \n%\n20.1 \n%\nDepreciation as a % of sales\n2.3 \n%\n1.8 \n%\n1.6 \n%\nAmortization as a % of sales\n7.9 \n%\n6.0 \n%\n6.0 \n%\nSales Growth and Core Sales (Decline) Growth\n2024 vs. 2023\n2023 vs. 2022\nTotal sales growth (GAAP)\n2.5 \n%\n1.5 \n%\nImpact of:\nAcquisitions\n(6.0)\n%\n(1.5)\n%\nCurrency exchange rates \n1.5 \n%\n1.0 \n%\nCore sales (decline) growth (non-GAAP)\n(2.0)\n%\n1.0 \n%\n2024 Sales Compared to 2023 \nPrice increases in the segment contributed 1.0% to sales growth on a year-over-year basis during 2024 as compared with 2023 and are reflected as a component of core sales above. \nDuring 2024, total Life Sciences segment sales increased 2.5% primarily as a result of acquisitions, partially offset by decreased core sales and to a lesser extent the impact of currency exchange rates.  The decrease in core sales was led by China and Western Europe.  Core sales declined year-over-year in the mass spectrometry and flow cytometry and lab automation solutions businesses primarily as a result of weaker demand for equipment, partially offset by increased demand for consumables and service.  Core sales declined year-over-year in the microscopy business across most major end-markets.  Core sales in the filtration business increased year-over-year driven by increased core sales from aerospace customers, partially offset by decreased core sales from food and beverage customers.  Core sales declined year-over-year in the genomics consumables business across most product lines, led by lower core sales in the gene reading and plasmids product lines.\n39\nTable of Contents\nOperating Profit Performance\nOperating profit margins declined 490 basis points during 2024 as compared to 2023.  The following factors impacted year-over-year operating profit margin comparisons.\n2024 vs. 2023 operating profit margin comparisons were unfavorably impacted by:\n•\n2024 impairment charge related to a trade name.  Refer to Note 10 to the accompanying Consolidated Financial Statements for additional information regarding the impairment - 305 basis points\n•\nThe incremental dilutive effect in 2024 of acquired businesses - 245 basis points\n•\nLower 2024 core sales and the impact of product mix, net of improvements in the segment’s operational and administrative cost structure - 25 basis points\n•\n2023 gain from the resolution of a litigation contingency - 15 basis points\n2024 vs. 2023 operating profit margin comparisons were favorably impacted by:\n•\nAcquisition-related transaction costs deemed significant, settlement of pre-acquisition share-based payment awards and fair value adjustments to inventory in 2023, net of acquisition-related fair value adjustment to inventory in 2024, in each case related to the acquisition of Abcam - 100 basis points\nDepreciation and amortization of intangible assets increased as a percentage of sales during 2024 as compared with 2023, primarily as a result of acquisitions.\nDIAGNOSTICS\nThe Diagnostics segment offers clinical instruments, consumables, software and services that hospitals, physicians’ offices, reference laboratories and other critical care settings use to diagnose disease and make treatment decisions. \nDiagnostics Selected Financial Data\n \nYear Ended December 31\n($ in millions)\n2024\n2023\n2022\nSales\n$\n9,787 \n$\n9,577 \n$\n10,849 \nOperating profit\n2,625 \n2,406 \n3,436 \nDepreciation \n394 \n379 \n387 \nAmortization of intangible assets\n192 \n198 \n203 \nOperating profit as a % of sales\n26.8 \n%\n25.1 \n%\n31.7 \n%\nDepreciation as a % of sales\n4.0 \n%\n4.0 \n%\n3.6 \n%\nAmortization as a % of sales\n2.0 \n%\n2.1 \n%\n1.9 \n%\nSales Growth (Decline) and Core Sales Growth (Decline)\n2024 vs. 2023\n2023 vs. 2022\nTotal sales growth (decline) (GAAP)\n2.0 \n%\n(11.5)\n%\nImpact of:\nCurrency exchange rates \n1.0 \n%\n1.0 \n%\nCore sales growth (decline) (non-GAAP)\n3.0 \n%\n(10.5)\n%\n2024 Sales Compared to 2023 \nPrice increases in the segment did not have a significant impact on sales growth on a year-over-year basis during 2024 as compared with 2023.\nDuring 2024, total segment sales increased 2.0% primarily as a result of increased core sales resulting from the factors discussed below.  Changes in currency exchange rates negatively impacted sales year-over-year.  Overall segment core sales growth was driven primarily by North America, partially offset by lower year-over-year demand in high-growth markets.  During the year, core sales in the molecular diagnostics business grew on a year-over-year basis primarily driven by increased sales of both respiratory and non-respiratory disease tests in North America.  In the segment’s clinical diagnostics businesses, core sales grew on a year-over-year basis led by the clinical lab business, and to a lesser extent by the pathology and acute care businesses.  The increased core sales in the clinical diagnostics businesses were driven by core sales growth in developed markets.  \n40\nTable of Contents\nOperating Profit Performance\nOperating profit margins increased 170 basis points during 2024 as compared to 2023.  The following factors impacted year-over-year operating profit margin comparisons.       \n2024 vs. 2023 operating profit margin comparisons were favorably impacted by:\n•\nHigher 2024 core sales, improvements in the segment’s operational and administrative cost structure and the impact of product mix - 250 basis points\n2024 vs. 2023 operating profit margin comparisons were unfavorably impacted by:\n•\n2024 loss on the termination of a commercial arrangement - 60 basis points\n•\n2024 impairment charge related to a trade name, net of a 2023 impairment charge related to a technology-based intangible asset - 20 basis points\nCOST OF SALES AND GROSS PROFIT\n \nYear Ended December 31\n($ in millions)\n2024\n2023\n2022\nSales\n$\n23,875 \n$\n23,890 \n$\n26,643 \nCost of sales\n(9,669)\n(9,856)\n(10,455)\nGross profit\n$\n14,206 \n$\n14,034 \n$\n16,188 \nGross profit margin\n59.5 \n%\n58.7 \n%\n60.8 \n%\nThe year-over-year decrease in cost of sales during 2024 as compared with 2023 was due primarily to the impact of lower year-over-year sales volumes and $87 million of charges incurred in the second quarter of 2023, primarily related to inventory in the Biotechnology segment.  The decrease in cost of sales was partially offset by an acquisition-related charge of $25 million incurred in 2024 associated with the fair value adjustment to inventory recorded in connection with the acquisition of Abcam.\nThe year-over-year increase in gross profit margin during 2024 as compared with 2023 was favorably impacted by the 2023 inventory charges referenced above, the net positive impact from the gross profit margin of recent acquisitions, and incremental year-over-year cost savings associated with productivity improvement actions, net of the impact of product mix and an acquisition-related charge in 2024.\nOPERATING EXPENSES\n \nYear Ended December 31\n($ in millions)\n2024\n2023\n2022\nSales\n$\n23,875 \n$\n23,890 \n$\n26,643 \nSelling, general and administrative (“SG&A”) expenses\n(7,759)\n(7,329)\n(7,124)\nResearch and development (“R&D”) expenses\n(1,584)\n(1,503)\n(1,528)\nSG&A as a % of sales\n32.5 \n%\n30.7 \n%\n26.7 \n%\nR&D as a % of sales\n6.6 \n%\n6.3 \n%\n5.7 \n%\nSG&A expenses as a percentage of sales increased 180 basis points on a year-over-year basis for 2024 compared with 2023.  The year-over-year increase was primarily driven by $265 million of intangible asset impairment charges recorded in 2024 and the impact of recent acquisitions, including the associated amortization expenses, and the 2024 loss on the termination of a commercial arrangement of $56 million.  These increases were partially offset by acquisition-related costs for the acquisition of Abcam of $87 million and intangible asset impairment charges of $64 million in 2023.  Refer to Note 10 to the accompanying Consolidated Financial Statements for additional information regarding the impairments.\nR&D expenses (consisting principally of internal and contract engineering personnel costs) as a percentage of sales increased in 2024 as compared with 2023, primarily due to increased spending on R&D activities, including the impact of recent acquisitions.  \nNONOPERATING INCOME (EXPENSE) \nNonoperating income (expense) consists primarily of net unrealized and realized gains and losses resulting from changes in the fair value of the Company’s investments in equity securities and investments in partnerships, the non-service cost components of net periodic benefit costs, gains on the sale of product lines and impairments of equity method investments.  Refer to Note 8 to the Consolidated Financial Statements. \n41\nTable of Contents\nINTEREST COSTS\nInterest expense of $278 million for 2024 was $8 million lower than in 2023, due to lower balances on borrowings in 2024 compared to 2023, partially offset by higher average interest rates on the Company’s commercial paper borrowings.  Interest income of $117 million for 2024 was $186 million lower than in 2023, due to lower average cash balances in 2024 primarily as a result of the use of cash for share repurchases and acquisitions.\nFor a further description of the Company’s debt and cross-currency swap derivative contracts related to the debt as of December 31, 2024 refer to Notes 13 and 14 to the Consolidated Financial Statements. \nINCOME TAXES\nGeneral\nIncome tax expense and deferred tax assets and liabilities reflect management’s assessment of future taxes expected to be paid on items reflected in the Company’s Consolidated Financial Statements.  The Company records the tax effect of discrete items and items that are reported net of their tax effects in the period in which they occur.\nThe Company’s effective tax rate can be affected by changes in the mix of earnings in countries with different statutory tax rates (including as a result of business acquisitions and dispositions), changes in the valuation of deferred tax assets and liabilities, accruals related to contingent tax liabilities and period-to-period changes in such accruals, the results of audits and examinations of previously filed tax returns (as further discussed below), the expiration of statutes of limitations, the implementation of tax planning strategies, tax rulings, court decisions, settlements with tax authorities, changes in tax laws and regulations, and legislative policy changes that may result from the OECD’s initiative on Base Erosion and Profit Shifting.  For a description of the tax treatment of earnings that are planned to be reinvested indefinitely outside the United States, refer to “—Liquidity and Capital Resources—Cash and Cash Requirements” below.\nThe amount of income taxes the Company pays is subject to ongoing audits by federal, state and non-U.S. tax authorities, which often result in proposed assessments.  Management performs a comprehensive review of its global tax positions on a quarterly basis.  Based on these reviews, which take into account the results of discussions and resolutions of matters with certain tax authorities and the other factors referenced in the prior paragraph, reserves for contingent tax liabilities are accrued or adjusted as necessary.  For a discussion of risks related to these and other tax matters, refer to “",
    "item1a": "Item 1A. Risk Factors” for a further discussion of the risks related to investing in early-stage companies. \nThe Company’s investments in publicly traded securities are measured at fair value based on quotes in active markets.  For investments in non-marketable equity securities where the Company does not have influence over the investee, the Company has elected the measurement alternative and records these investments at cost and adjusts the carrying value for impairments and observable price changes with a same or similar security from the same issuer adjusted to reflect the specific rights and preferences of the securities, if applicable.  Valuations of non-marketable equity securities are complex and require judgment due to the absence of market prices, lack of liquidity and the risks inherent in early-stage companies.  The uncertainty in the process of valuing securities for which a ready market does not exist may cause our estimated values of these securities to differ significantly from the values that would have been derived had a ready market for the securities existed, and those differences could be material.\nThe Company accounts for its investments in the partnerships using the equity method.  Accordingly, the investments are initially recorded at cost and adjusted each period for the Company’s share of the partnership’s income or loss and distributions received.  The partnerships’ investments are recorded by the partnerships on an estimated fair value basis and pose the same risks and require the same valuation judgments discussed above.  As a result, changes in the value of investments in the partnership will have a direct impact on the Company’s earnings.  Impairment losses for the partnerships are recognized to reduce the investment’s carrying value to its fair value if there is a decline in fair value below carrying value that is considered to be other-than-temporary.  To determine whether there is an other-than-temporary impairment, the Company uses qualitative and quantitative valuation methods.\nRealized and unrealized gains and losses for these investments in equity securities and partnerships are recorded in other income (expense), net, in the Consolidated Statements of Earnings.  A 10% decrease in the carrying value of the Company’s investments in equity securities and partnerships as of December 31, 2024 would result in a loss of approximately $156 million.\nNEW ACCOUNTING STANDARDS\nFor a discussion of the new accounting standards impacting the Company, refer to Note 1 to the Consolidated Financial Statements.\nITEM 7A.  QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nThe information required by this item is included under “Item 7.  Management’s Discussion and Analysis of Financial Condition and Results of Operations.”\n51\nTable of Contents\nITEM 8.  FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nReport of Management on Danaher Corporation’s Internal Control Over Financial Reporting \nThe management of the Company is responsible for establishing and maintaining adequate internal control over financial reporting for the Company.  Internal control over financial reporting is defined in Rules 13a-15(f) and 15d-15(f) promulgated under the Securities Exchange Act of 1934.\nThe Company’s management assessed the effectiveness of the Company’s internal control over financial reporting as of December 31, 2024.  In making this assessment, the Company’s management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (“COSO”) in “Internal Control-Integrated Framework” (2013 framework).  Based on this assessment, management concluded that, as of December 31, 2024, the Company’s internal control over financial reporting is effective.\nThe Company’s independent registered public accounting firm has issued an audit report on the effectiveness of the Company’s internal control over financial reporting.  This report dated February 20, 2025 appears on page \n53\n of this Form 10-K.\n52\nTable of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of Danaher Corporation\nOpinion on Internal Control Over Financial Reporting\nWe have audited Danaher Corporation and subsidiaries’ internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria).  In our opinion, Danaher Corporation and subsidiaries (the Company) maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of December 31, 2024 and 2023, the related consolidated statements of earnings, comprehensive income, stockholders’ equity and cash flows for each of the three years in the period ended December 31, 2024, and the related notes and financial statement schedule listed in the Index at Item 15(a) and our report dated February 20, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Report of Management on Danaher Corporation’s Internal Control Over Financial Reporting.  Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit.  We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB.  Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances.  We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles.  A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements.  Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ \nErnst & Young LLP\nTysons, Virginia\nFebruary 20, 2025\n53\nTable of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of Danaher Corporation\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Danaher Corporation and subsidiaries (the Company) as of December 31, 2024 and 2023, the related consolidated statements of earnings, comprehensive income, stockholders’ equity and cash flows for each of the three years in the period ended December 31, 2024, and the related notes and financial statement schedule listed in the Index at Item 15(a) (collectively referred to as the “consolidated financial statements”).  In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework), and our report dated February 20, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management.  Our responsibility is to express an opinion on the Company’s financial statements based on our audits.  We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB.  Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud.  Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks.  Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements.  Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements.  We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments.  The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\n54\nTable of Contents\nUncertain Tax Positions\nDescription of the Matter\nAs discussed in Note 7 to the consolidated financial statements, the Company operates in the U.S. and multiple international tax jurisdictions and as a result files numerous tax returns in those locations.  Uncertainty in a tax position may arise for multiple reasons, including because tax laws are subject to interpretation.  The Company applies the applicable tax law and judgment to (1) determine whether, based on the technical merits, a tax position is more likely than not to be sustained and (2) measure the amount of tax benefit that qualifies for recognition.  As of December 31, 2024, the Company’s gross unrecognized tax benefits related to uncertain tax positions were approximately $1.2 billion.  Auditing the recognition and measurement of certain of the Company’s tax positions including the evaluation of whether such tax position is more likely than not to be sustained, and if applicable the measurement of the benefit, is complex and required the use of tax subject matter resources.\nHow We Addressed the Matter in Our Audit\nWe tested controls over management’s accounting for tax positions, including assessment of the technical merits of tax positions and if applicable, the measurement of the benefit of the tax position. \nTo evaluate whether the technical merits of certain of the Company’s income tax positions are more likely than not sustainable, our audit procedures included, among others, evaluation of applicable tax law, court cases, tax regulations and other regulatory guidance by our tax subject matter resources.  For certain of the income tax positions, we also involved tax subject matter resources in corroborating our understanding of the relevant facts, examining the Company’s analysis, evaluating relevant correspondence with the tax authority and reading third-party advice obtained by management, as applicable.  We also evaluated the adequacy of the Company’s disclosures included in Note 7 to the consolidated financial statements. \n/s/ \nErnst & Young LLP\nWe have served as the Company’s auditor since 2002. \nTysons, Virginia\nFebruary 20, 2025\n55\nTable of Contents\nDANAHER CORPORATION AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\n($ in millions, except per share amount)\n \nAs of December 31\n \n2024\n2023\nASSETS\nCurrent assets:\nCash and equivalents\n$\n2,078\n \n$\n5,864\n \nTrade accounts receivable, less allowance for doubtful accounts of $\n113\n as of December 31, 2024 and $\n120\n as of December 31, 2023\n3,537\n \n3,922\n \nInventories\n2,330\n \n2,594\n \nPrepaid expenses and other current assets\n1,552\n \n1,557\n \nTotal current assets\n9,497\n \n13,937\n \nProperty, plant and equipment, net\n4,990\n \n4,553\n \nOther long-term assets\n3,990\n \n3,644\n \nGoodwill\n40,497\n \n41,608\n \nOther intangible assets, net\n18,568\n \n20,746\n \nTotal assets\n$\n77,542\n \n$\n84,488\n \nLIABILITIES AND STOCKHOLDERS’ EQUITY\nCurrent liabilities:\nNotes payable and current portion of long-term debt\n$\n505\n \n$\n1,695\n \nTrade accounts payable\n1,753\n \n1,766\n \nAccrued expenses and other liabilities\n4,540\n \n4,813\n \nTotal current liabilities\n6,798\n \n8,274\n \nOther long-term liabilities\n5,694\n \n6,017\n \nLong-term debt\n15,500\n \n16,707\n \nStockholders’ equity:\nCommon stock - $\n0.01\n par value, \n2.0\n billion shares authorized; \n884.3\n million issued and \n719.1\n million outstanding as of December 31, 2024; \n880.5\n million issued and \n739.2\n million outstanding as of December 31, 2023\n9\n \n9\n \nAdditional paid-in capital\n16,727\n \n16,170\n \nTreasury stock\n(\n8,163\n)\n(\n2,019\n)\nRetained earnings\n44,188\n \n41,074\n \nAccumulated other comprehensive income (loss)\n(\n3,218\n)\n(\n1,748\n)\nTotal Danaher stockholders’ equity\n49,543\n \n53,486\n \nNoncontrolling interests\n7\n \n4\n \nTotal stockholders’ equity\n49,550\n \n53,490\n \nTotal liabilities and stockholders’ equity\n$\n77,542\n \n$\n84,488\n \nSee the accompanying Notes to the Consolidated Financial Statements.\n56\nTable of Contents\nDANAHER CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF EARNINGS\n($ and shares in millions, except per share amounts)\n \nYear Ended December 31\n2024\n2023\n2022\nSales\n$\n23,875\n \n$\n23,890\n \n$\n26,643\n \nCost of sales\n(\n9,669\n)\n(\n9,856\n)\n(\n10,455\n)\nGross profit\n14,206\n \n14,034\n \n16,188\n \nOperating costs:\nSelling, general and administrative expenses\n(\n7,759\n)\n(\n7,329\n)\n(\n7,124\n)\nResearch and development expenses\n(\n1,584\n)\n(\n1,503\n)\n(\n1,528\n)\nOperating profit\n4,863\n \n5,202\n \n7,536\n \nNonoperating income (expense):\nOther income (expense), net\n(\n56\n)\n(\n175\n)\n(\n227\n)\nInterest expense\n(\n278\n)\n(\n286\n)\n(\n204\n)\nInterest income\n117\n \n303\n \n41\n \nEarnings from continuing operations before income taxes\n4,646\n \n5,044\n \n7,146\n \nIncome taxes\n(\n747\n)\n(\n823\n)\n(\n818\n)\nNet earnings from continuing operations\n3,899\n \n4,221\n \n6,328\n \nEarnings from discontinued operations, net of income taxes\n—\n \n543\n \n881\n \nNet earnings\n3,899\n \n4,764\n \n7,209\n \nMandatory convertible preferred stock dividends\n—\n \n(\n21\n)\n(\n106\n)\nNet earnings attributable to common stockholders\n$\n3,899\n \n$\n4,743\n \n$\n7,103\n \nNet earnings per common share from continuing operations:\nBasic\n$\n5.33\n \n$\n5.70\n \n$\n8.58\n \nDiluted\n$\n5.29\n \n$\n5.65\n \n$\n8.47\n \nNet earnings per common share from discontinued operations:\nBasic\n$\n—\n \n$\n0.74\n \n$\n1.22\n \nDiluted\n$\n—\n \n$\n0.73\n \n$\n1.20\n \nNet earnings per common share:\nBasic\n$\n5.33\n \n$\n6.44\n \n$\n9.80\n \nDiluted\n$\n5.29\n \n$\n6.38\n \n$\n9.66\n \n*\nAverage common stock and common equivalent shares outstanding:\nBasic\n731.0\n \n736.5\n \n725.1\n \nDiluted\n737.2\n \n743.1\n \n737.1\n \n*    Net earnings per common share amount does not add due to rounding.\nSee the accompanying Notes to the Consolidated Financial Statements.\n57\nTable of Contents\nDANAHER CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n($ in millions)\nYear Ended December 31\n2024\n2023\n2022\nNet earnings\n$\n3,899\n \n$\n4,764\n \n$\n7,209\n \nOther comprehensive income (loss), net of income taxes:\nForeign currency translation adjustments\n(\n1,458\n)\n215\n \n(\n2,105\n)\nPension and postretirement plan benefit adjustments\n101\n \n(\n51\n)\n209\n \nCash flow hedge adjustments\n(\n113\n)\n(\n14\n)\n51\n \nTotal other comprehensive income (loss), net of income taxes\n(\n1,470\n)\n150\n \n(\n1,845\n)\nComprehensive income\n$\n2,429\n \n$\n4,914\n \n$\n5,364\n \nSee the accompanying Notes to the Consolidated Financial Statements.\n58\nTable of Contents\nDANAHER CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY\n \n($ in millions)\nYear Ended December 31\n2024\n2023\n2022\nPreferred stock:\nBalance, beginning of period\n$\n—\n \n$\n1,668\n \n$\n3,268\n \nConversion of Mandatory Convertible Preferred Stock to common stock\n—\n \n(\n1,668\n)\n(\n1,600\n)\nBalance, end of period\n$\n—\n \n$\n—\n \n$\n1,668\n \nCommon stock:\nBalance, beginning and end of period\n$\n9\n \n$\n9\n \n$\n9\n \nAdditional paid-in capital:\nBalance, beginning of period\n$\n16,170\n \n$\n14,005\n \n$\n11,924\n \nCommon stock-based award activity \n554\n \n507\n \n495\n \nCommon stock issued in connection with Mandatory Convertible Preferred Stock conversions\n—\n \n1,668\n \n1,600\n \nAcquisition of noncontrolling interests\n3\n \n—\n \n(\n14\n)\nDistribution of Veralto Corporation\n—\n \n(\n10\n)\n—\n \nBalance, end of period\n$\n16,727\n \n$\n16,170\n \n$\n14,005\n \nTreasury stock:\nBalance, beginning of period\n$\n(\n2,019\n)\n$\n(\n1,933\n)\n$\n(\n1,834\n)\nRepurchase of common stock, including excise tax\n(\n6,039\n)\n—\n \n—\n \nCommon stock-based award activity\n(\n105\n)\n(\n86\n)\n(\n99\n)\nBalance, end of period\n$\n(\n8,163\n)\n$\n(\n2,019\n)\n$\n(\n1,933\n)\nRetained earnings:\nBalance, beginning of period\n$\n41,074\n \n$\n39,205\n \n$\n32,827\n \nNet earnings\n3,899\n \n4,764\n \n7,209\n \nCommon stock dividends declared\n(\n785\n)\n(\n773\n)\n(\n725\n)\nMandatory Convertible Preferred Stock dividends declared\n—\n \n(\n21\n)\n(\n106\n)\nDistribution of Veralto Corporation\n—\n \n(\n2,101\n)\n—\n \nBalance, end of period\n$\n44,188\n \n$\n41,074\n \n$\n39,205\n \nAccumulated other comprehensive income (loss):\nBalance, beginning of period\n$\n(\n1,748\n)\n$\n(\n2,872\n)\n$\n(\n1,027\n)\nDistribution of Veralto Corporation\n—\n \n974\n \n—\n \nOther comprehensive income (loss)\n(\n1,470\n)\n150\n \n(\n1,845\n)\nBalance, end of period\n$\n(\n3,218\n)\n$\n(\n1,748\n)\n$\n(\n2,872\n)\nNoncontrolling interests:\nBalance, beginning of period\n$\n4\n \n$\n8\n \n$\n10\n \nDistribution of Veralto Corporation\n—\n \n(\n4\n)\n—\n \nChange in noncontrolling interests\n3\n \n—\n \n(\n2\n)\nBalance, end of period\n$\n7\n \n$\n4\n \n$\n8\n \nTotal stockholders’ equity, end of period\n$\n49,550\n \n$\n53,490\n \n$\n50,090\n \nSee the accompanying Notes to the Consolidated Financial Statements.\n59\nTable of Contents\nDANAHER CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n($ in millions)\nYear Ended December 31\n \n2024\n2023\n2022\nCash flows from operating activities:\nNet earnings\n$\n3,899\n \n$\n4,764\n \n$\n7,209\n \nLess: earnings from discontinued operations, net of income taxes\n—\n \n(\n543\n)\n(\n881\n)\nNet earnings from continuing operations\n3,899\n \n4,221\n \n6,328\n \nNoncash items:\nDepreciation\n721\n \n675\n \n698\n \nAmortization of intangible assets\n1,631\n \n1,491\n \n1,434\n \nAmortization of acquisition-related inventory fair value step-up\n25\n \n8\n \n—\n \nStock-based compensation expense\n288\n \n306\n \n295\n \nInvestment losses\n57\n \n182\n \n271\n \nImpairment charges\n265\n \n77\n \n—\n \nChange in deferred income taxes\n(\n483\n)\n(\n1,204\n)\n(\n582\n)\nChange in trade accounts receivable, net\n331\n \n322\n \n(\n389\n)\nChange in inventories\n147\n \n185\n \n(\n448\n)\nChange in trade accounts payable\n19\n \n(\n149\n)\n(\n18\n)\nChange in prepaid expenses and other assets\n274\n \n419\n \n(\n73\n)\nChange in accrued expenses and other liabilities\n(\n486\n)\n(\n43\n)\n97\n \nTotal operating cash provided by continuing operations\n6,688\n \n6,490\n \n7,613\n \nTotal operating cash provided by discontinued operations\n—\n \n674\n \n906\n \nNet cash provided by operating activities\n6,688\n \n7,164\n \n8,519\n \nCash flows from investing activities:\nCash paid for acquisitions\n(\n558\n)\n(\n5,610\n)\n(\n582\n)\nPayments for additions to property, plant and equipment\n(\n1,392\n)\n(\n1,383\n)\n(\n1,118\n)\nProceeds from sales of property, plant and equipment\n13\n \n12\n \n9\n \nPayments for purchases of investments\n(\n331\n)\n(\n172\n)\n(\n523\n)\nProceeds from sales of investments\n253\n \n61\n \n18\n \nAll other investing activities\n34\n \n44\n \n51\n \nTotal cash used in investing activities from continuing operations\n(\n1,981\n)\n(\n7,048\n)\n(\n2,145\n)\nTotal investing cash used in discontinued operations\n—\n \n(\n33\n)\n(\n89\n)\nNet cash used in investing activities\n(\n1,981\n)\n(\n7,081\n)\n(\n2,234\n)\nCash flows from financing activities:\nProceeds from the issuance of common stock in connection with stock-based compensation\n162\n \n68\n \n31\n \nPayment of dividends\n(\n768\n)\n(\n821\n)\n(\n818\n)\nNet proceeds from (repayments of) borrowings (maturities of 90 days or less)\n5\n \n(\n1,006\n)\n(\n723\n)\nRepayments of borrowings (maturities longer than 90 days)\n(\n1,674\n)\n(\n620\n)\n(\n965\n)\nDistribution from discontinued operations\n—\n \n2,600\n \n—\n \nPayments for repurchase of common stock\n(\n5,979\n)\n—\n \n—\n \nAll other financing activities\n(\n131\n)\n(\n67\n)\n(\n95\n)\nNet cash (used in) provided by financing activities for continuing operations\n(\n8,385\n)\n154\n \n(\n2,570\n)\nCash distributions to Veralto Corporation, net\n—\n \n(\n427\n)\n—\n \nNet cash used in financing activities\n(\n8,385\n)\n(\n273\n)\n(\n2,570\n)\nEffect of exchange rate changes on cash and equivalents\n(\n108\n)\n59\n \n(\n306\n)\nNet change in cash and equivalents\n(\n3,786\n)\n(\n131\n)\n3,409\n \nBeginning balance of cash and equivalents\n5,864\n \n5,995\n \n2,586\n \nEnding balance of cash and equivalents\n$\n2,078\n \n$\n5,864\n \n$\n5,995\n \nSupplemental disclosure:\nDistribution of noncash net assets to Veralto Corporation\n$\n—\n \n$\n(\n1,674\n)\n$\n—\n \nSee the accompanying Notes to the Consolidated Financial Statements.\n60\nTable of Contents\nDANAHER CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 1.  \nBUSINESS AND SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES \nBusiness\n—Danaher Corporation (“Danaher” or the “Company”) designs, manufactures and markets professional, medical, research and industrial products and services, which are typically characterized by strong brand names, innovative technology and major market positions.  As of December 31, 2024, the Company operates in \nthree\n business segments: \n•\nThe Biotechnology segment includes the bioprocessing and discovery and medical businesses and offers a broad range of equipment, consumables and services that are primarily used by customers to advance and accelerate the research, development, manufacture and delivery of biological medicines.  The Company’s solutions support a broad range of biotherapeutics including monoclonal antibodies, recombinant proteins, replacement therapies such as insulin and vaccines, as well as novel cell, gene, mRNA and other nucleic acid therapies. \n•\nThe Life Sciences segment offers a broad range of instruments, consumables, services and software that are primarily used by customers to study the basic building blocks of life, including DNA and RNA, nucleic acid, proteins, metabolites and cells, in order to understand the causes of disease, identify new therapies, and test and manufacture new drugs, vaccines and gene editing technologies.  Additionally, the segment provides products and consumables used to filter and remove contaminants from a variety of liquids and gases in many end-market applications.\n•\nThe Diagnostics segment offers clinical instruments, consumables, software and services that hospitals, physicians’ offices, reference laboratories and other critical care settings use to diagnose disease and make treatment decisions.\nRefer to Notes 2 and 3 for a discussion of acquisitions and discontinued operations, including the disposal of the Company’s former Environmental & Applied Solutions segment.\n \nAccounting Principles\n—The accompanying financial statements have been prepared in accordance with accounting principles generally accepted in the United States (“GAAP”).  The Consolidated Financial Statements include the accounts of the Company and its subsidiaries.  All intercompany balances and transactions have been eliminated upon consolidation.  The Consolidated Financial Statements also reflect the impact of noncontrolling interests.  Noncontrolling interests do not have a significant impact on the Company’s consolidated results of continuing operations; therefore earnings attributable to noncontrolling interests for continuing operations are not presented separately in the Company’s Consolidated Statements of Earnings.  Earnings attributable to noncontrolling interests have been reflected in selling, general and administrative expenses and were insignificant in all periods presented.  Reclassifications of certain prior year amounts have been made to conform to the current year presentation.\nUse of Estimates\n—The preparation of these financial statements in conformity with accounting principles generally accepted in the United States requires management to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of contingent assets and liabilities.  The Company bases these estimates on historical experience, the current economic environment and on various other assumptions that are believed to be reasonable under the circumstances.  However, uncertainties associated with these estimates exist and actual results may differ materially from these estimates.\nCash and Equivalents\n—The Company considers all highly liquid investments with a maturity of three months or less at the date of purchase to be cash equivalents.\nAccounts Receivable and Allowances for Doubtful Accounts\n—All trade accounts, contract and finance receivables are reported on the accompanying Consolidated Balance Sheets adjusted for any write-offs and net of allowances for doubtful accounts.  The allowances for doubtful accounts represent management’s best estimate of the expected future credit losses from the Company’s trade accounts, contract and finance receivable portfolios.  Determination of the allowances requires management to exercise judgment about the timing, frequency and severity of credit losses that could materially affect the provision for credit losses and, therefore, net earnings.  The Company regularly performs detailed reviews of its portfolios to determine if an impairment has occurred and evaluates the collectability of receivables based on a combination of various financial and qualitative factors that may affect customers’ ability to pay, including customers’ financial condition, collateral, debt-servicing ability, past payment experience and credit bureau information.  In circumstances where the Company is aware of a specific customer’s inability to meet its financial obligations, a specific reserve is recorded against amounts due to reduce the recognized receivable to the amount reasonably expected to be collected.  Additions to the allowances for doubtful accounts are charged to current period earnings and amounts determined to be uncollectible are charged directly against the allowances.  If any previously-written off amounts are subsequently recovered, the amounts will increase the allowances.  If the financial condition of the Company’s customers were to deteriorate, resulting in an impairment of their ability to make payments, additional reserves would be required.  The Company does not believe that trade accounts receivable represents significant concentrations of credit risk because \n61\nTable of Contents\nof the diversified portfolio of individual customers and geographical areas.  The Company’s allowance for doubtful accounts as of December 31, 2024 reflects the Company’s best estimate of the expected future losses for its accounts receivables; however, these estimates may change and future actual losses may differ from the Company’s estimates.  The Company will continue to monitor economic conditions and will revise the estimates of the expected future losses for accounts receivable as necessary.  The Company recorded $\n37\n million, $\n43\n million and $\n20\n million of expense associated with doubtful accounts related to continuing operations for the years ended December 31, 2024, 2023 and 2022, respectively. \nIncluded in the Company’s trade accounts receivable and other long-term assets as of December 31, 2024 and 2023 are $\n141\n million and $\n133\n million of net aggregate financing receivables, respectively.  All financing receivables are evaluated for impairment based on individual customer credit profiles.\nInventories\n—Inventories include the costs of material, labor and overhead.  Inventories are stated at the lower of cost and net realizable value primarily using the first-in, first-out method. \nThe classes of inventory as of December 31 are summarized as follows ($ in millions):\n2024\n2023\nFinished goods\n$\n1,145\n \n$\n1,282\n \nWork in process\n465\n \n459\n \nRaw materials\n720\n \n853\n \nTotal\n$\n2,330\n \n$\n2,594\n \nPrepaid Expenses and Other Current Assets\n—Prepaid expenses and other current assets primarily result from advance payments to vendors for goods and services and are capitalized until the related goods are received or services are performed and advance payments to tax authorities.  The Company’s prepaid expenses and other current assets as of December 31, 2024 and 2023 are primarily comprised of prepaid expenses of $\n620\n million and $\n771\n million, respectively, and taxes receivable for income and other taxes of $\n853\n million and $\n715\n million, respectively.\n \nProperty, Plant and Equipment\n—Property, plant and equipment are carried at cost.  \nThe provision for depreciation has been computed principally by the straight-line method based on the estimated useful lives of the depreciable assets as follows:\nCategory\nUseful Life\nBuildings\n30\n years\nLeased assets and leasehold improvements\nAmortized over the lesser of the economic life of the asset or the term of the lease\nMachinery and equipment\n3\n – \n10\n years\nCustomer-leased equipment\n5\n – \n7\n years\nEstimated useful lives are periodically reviewed and, when appropriate, changes to estimates are made prospectively.\nThe classes of property, plant and equipment as of December 31 are summarized as follows ($ in millions):\n2024\n2023\nLand and improvements\n$\n230\n \n$\n210\n \nBuildings\n2,548\n \n2,269\n \nMachinery and equipment\n4,430\n \n4,106\n \nCustomer-leased equipment\n1,883\n \n1,794\n \nGross property, plant and equipment\n9,091\n \n8,379\n \nLess: accumulated depreciation\n(\n4,101\n)\n(\n3,826\n)\nProperty, plant and equipment, net\n$\n4,990\n \n$\n4,553\n \nInvestments\n—Investments over which the Company has a significant influence but not a controlling interest, are accounted for using the equity method of accounting which requires the Company to record its initial investment at cost and adjust the balance each period for the Company’s share of the investee’s income or loss and dividends paid.  The Company also invests in start-up companies where the Company has neither control of nor significant influence over the investee.  The Company measures these non-marketable equity securities at fair value and recognizes changes in fair value in net earnings.  For securities without readily available fair values, the Company has elected the measurement alternative to record these investments at cost and to adjust for impairments and observable price changes with a same or \n62\nTable of Contents\nsimilar security from the same issuer within net earnings (the “Fair Value Alternative”).  Additionally, the Company is a limited partner in partnerships that invest in start-up companies.  While the partnerships record these investments at fair value, the Company’s investment in the partnerships is accounted for under the equity method of accounting.  The Company made minority investments in equity method investments and non-marketable equity securities totaling $\n331\n million, $\n172\n million and $\n523\n million in 2024, 2023 and 2022, respectively, including investments in partnerships of $\n174\n million, $\n71\n million and $\n283\n million in 2024, 2023 and 2022, respectively.  The Company recorded net realized and unrealized gains and losses related to changes in the fair value of these investments, as well as impairments to equity-method investments in other income (expense), net, in the accompanying Consolidated Statements of Earnings.  Refer to Notes 8 and 11 for additional information about the Company’s investments.\n \nOther Assets\n—Other assets principally include operating lease right-of-use (“ROU”) assets, noncurrent deferred tax assets and other investments.\nFair Value of Financial Instruments\n—The Company’s financial instruments consist primarily of cash and cash equivalents, trade accounts receivable, investments in equity securities, available-for-sale debt securities and cross-currency swaps, obligations under trade accounts payable and short and long-term debt.  Due to their short-term nature, the carrying values for cash and cash equivalents, trade accounts receivable and trade accounts payable approximate fair value.  Refer to Note 11 for the fair values of the Company’s investments in equity securities, available-for-sale debt securities and cross-currency swaps and other obligations.\nGoodwill and Other Intangible Assets\n—Goodwill and other intangible assets result from the Company’s acquisition of existing businesses.  In accordance with accounting standards related to business combinations, goodwill is not amortized; however, certain finite-lived identifiable intangible assets, primarily customer relationships and acquired technology, are amortized over their estimated useful lives.  Intangible assets with indefinite lives are not amortized.  In-process research and development (“IPR&D”) is initially capitalized at fair value and when the IPR&D project is complete, the asset is considered a finite-lived intangible asset and amortized over its estimated useful life.  If an IPR&D project is abandoned, an impairment loss equal to the value of the intangible asset is recorded in the period of abandonment.  The Company reviews identified intangible assets and goodwill for impairment whenever events or changes in circumstances indicate that the related carrying amounts may not be recoverable.  The Company also tests intangible assets with indefinite lives and goodwill for impairment at least annually.  Refer to Notes 2 and 10 for additional information about the Company’s goodwill and other intangible assets.\nRevenue Recognition\n—The Company derives revenues primarily from the sale of life sciences research, biopharmaceutical drug production and medical diagnostic products and services.  Revenue is recognized when control of the promised products or services is transferred to the Company’s customers, in an amount that reflects the consideration the Company expects to be entitled to in exchange for those products or services (the transaction price).  A performance obligation is a promise in a contract to transfer a distinct product or service to a customer and is the unit of account under Accounting Standards Codification (“ASC”) 606, \nRevenue from Contracts with Customers\n.  The Company recognizes revenue when the obligations under the terms of a contract are satisfied; generally, this occurs when the customer obtains control of the underlying product or service.  For equipment and consumables sold by the Company, control transfers to the customer at a point in time.  To indicate the transfer of control, the Company must have a present right to payment, legal title must have passed to the customer, the customer must have the significant risks and rewards of ownership, and where acceptance is not a formality, the customer must have accepted the product or service.  Returns for products sold are estimated and recorded as a reduction of revenue at the time of sale.  Customer allowances and rebates, consisting primarily of volume discounts and other short-term incentive programs, are recorded as a reduction of revenue at the time of sale because these allowances reflect a reduction in the transaction price.  Product returns, customer allowances and rebates are estimated based on historical experience and known trends.  For extended warranty and service, control transfers to the customer over the term of the arrangement and revenue is recognized based upon the period of time elapsed under the arrangement.  Revenue for other long-term contracts is generally recognized based upon the cost-to-cost measure of progress, provided that the Company meets the criteria associated with transferring control of the good or service over time.\nCertain of the Company’s revenues relate to operating-type lease (“OTL”) arrangements.  Leases are outside the scope of ASC 606 and are therefore accounted for in accordance with ASC 842, \nLeases\n.  Equipment lease revenue for OTL agreements is recognized on a straight-line basis over the life of the lease, and the cost of customer-leased equipment is recorded within property, plant and equipment in the accompanying Consolidated Balance Sheets and depreciated over the equipment’s estimated useful life.  Depreciation expense associated with the leased equipment under OTL arrangements is reflected in cost of sales in the accompanying Consolidated Statements of Earnings.  The OTLs are generally not cancellable until after an initial term and may or may not require the customer to purchase a minimum number of consumables or tests throughout the contract term.  The Company also enters into sales-type lease (“STL”) arrangements with customers which result in earlier recognition of equipment lease revenue as compared to an OTL.\n63\nTable of Contents\nFor a contract with multiple performance obligations, the Company allocates the contract’s transaction price to each performance obligation on a relative standalone selling price basis using the Company’s best estimate of the standalone selling price of each distinct product or service in the contract.  The primary method used to estimate standalone selling price is the price observed in standalone sales to customers.  Allocation of the transaction price is determined at the contracts’ inception.\n \nShipping and Handling\n—Shipping and handling costs are included as a component of cost of sales.  Revenue derived from shipping and handling costs billed to customers is included in sales.\nAdvertising\n—Advertising costs are expensed as incurred.\nResearch and Development\n—The Company conducts research and development activities for the purpose of developing new products, enhancing the functionality, effectiveness, ease of use and reliability of the Company’s existing products and expanding the applications for which uses of the Company’s products are appropriate.  Research and development costs are expensed as incurred.\nContract Termination\n—The Company has certain contractual relationships with distributors who sell the Company’s products.  During the year ended December 31, 2024 the Company terminated \nthree\n contracts with distributors and incurred $\n56\n million of costs related to the termination of the arrangements, which are recorded within selling, general and administrative expenses in the accompanying Consolidated Statements of Earnings.\nIncome Taxes\n—The Company’s income tax expense represents the tax liability for the current year, the tax benefit or expense for the net change in deferred tax liabilities and assets during the year, as well as reserves for unrecognized tax benefits and return to provision adjustments.  Deferred tax liabilities and assets are determined based on the difference between the financial statement and tax basis of assets and liabilities using enacted rates expected to be in effect during the year in which the differences reverse.  Deferred tax assets generally represent items that can be used as a tax deduction or credit in the Company’s tax return in future years for which the tax benefit has already been reflected on the Company’s Consolidated Statements of Earnings.  The Company establishes valuation allowances for its deferred tax assets if it is more likely than not that some or all of the deferred tax asset will not be realized.  Deferred tax liabilities generally represent items that have already been taken as a deduction on the Company’s tax return but have not yet been recognized as an expense in the Company’s Consolidated Statements of Earnings.  The effect on deferred tax assets and liabilities due to a change in tax rates is recognized in income tax expense in the period that includes the enactment date.  The Company provides for unrecognized tax benefits when, based upon the technical merits, it is “more likely than not” that an uncertain tax position will not be sustained upon examination.  Judgment is required in evaluating tax positions and determining income tax provisions.  The Company re-evaluates the technical merits of its tax positions and may recognize an uncertain tax benefit in certain circumstances, including when: (1) a tax audit is completed; (2) applicable tax laws change, including a tax case ruling or legislative guidance; or (3) the applicable statute of limitations expires.  The Company recognizes potential accrued interest and penalties associated with unrecognized tax positions in income tax expense.  Refer to Note 7 for additional information.\nForeign Currency Translation\n—Exchange rate adjustments resulting from foreign currency transactions are recognized in net earnings, whereas effects resulting from the translation of financial statements are reflected as a component of accumulated other comprehensive income (loss) within stockholders’ equity.  Assets and liabilities of subsidiaries operating outside the United States with a functional currency other than U.S. dollars are translated into U.S. dollars using year end exchange rates and income statement accounts are translated at weighted average rates.  Net foreign currency transaction gains or losses were not material in any of the years presented.  As discussed below, the Company uses its foreign currency-denominated debt and cross-currency swap arrangements whereby existing U.S. dollar-denominated borrowings are effectively converted to foreign currency borrowings to partially hedge its net investments in foreign operations against adverse movements in exchange rates.\nDerivative Financial Instruments\n—The Company is neither a dealer nor a trader in derivative instruments.  The Company has generally accepted the exposure to transactional exchange rate movements without using derivative instruments to manage this risk, although the Company from time to time partially hedges its net investments in foreign operations against adverse movements in exchange rates through foreign currency-denominated debt and cross-currency swaps.  The Company periodically enters into foreign currency forward contracts to mitigate a portion of its foreign currency exchange risk and forward starting swaps to mitigate interest rate risk related to the Company’s debt.  The Company also uses cross-currency swap derivative contracts to hedge long-term debt issuances in a foreign currency other than the functional currency of the borrower.  When utilized, the derivative instruments are recorded on the Consolidated Balance Sheets as either an asset or liability measured at fair value.  To the extent the derivative instrument qualifies as an effective hedge, changes in fair value are recognized in accumulated other comprehensive income (loss) in stockholders’ equity.  Changes in the value of the foreign currency denominated debt and cross-currency swaps designated as hedges of the Company’s net investment in foreign operations based on spot rates are recognized in accumulated other comprehensive income (loss) in stockholders’ equity and offset changes in the value of the Company’s foreign currency denominated operations.  Refer to Note 14 for additional information.\n64\nTable of Contents\nAccumulated Other Comprehensive Income (Loss)\n—Accumulated other comprehensive income (loss) refers to certain gains and losses that under GAAP are included in comprehensive income (loss) but are excluded from net earnings as these amounts are initially recorded as an adjustment to stockholders’ equity.  Foreign currency translation adjustments are generally not adjusted for income taxes as they relate to indefinite investments in non-U.S. subsidiaries.  Cash flow hedge adjustments reflect the gains or losses on the derivative contract designated as the hedging instrument.  Pension and postretirement plan benefit adjustments relate to unrecognized prior service credits and actuarial gains and losses.  Refer to Notes 14, 15 and 18 for additional information.\nAccounting for Stock-Based Compensation\n—The Company accounts for stock-based compensation by measuring the cost of employee services received in exchange for all equity awards granted, including stock options, restricted stock units (“RSUs”) and performance stock units (“PSUs”), based on the fair value of the award as of the grant date.  Equity-based compensation expense is recognized net of an estimated forfeiture rate on a straight-line basis over the requisite service period of the award, except that in the case of RSUs, compensation expense is recognized using an accelerated attribution method.  Refer to Note 18 for additional information on the stock-based compensation plans in which certain employees of the Company participate.\nPension and Postretirement Benefit Plans\n—The Company measures its pension and postretirement plans’ assets and its obligations that determine the respective plan’s funded status as of the end of the Company’s fiscal year, and recognizes an asset for a plan’s overfunded status or a liability for a plan’s underfunded status in its balance sheet.  Changes in the funded status of the plans are recognized in the year in which the changes occur and reported in comprehensive income (loss).  Refer to Note 15 for additional information on the Company’s pension and postretirement plans including a discussion of the actuarial assumptions, the Company’s policy for recognizing the associated gains and losses and the method used to estimate service and interest cost components.\nAccounting Standards Recently Adopted\n—In August 2020, the FASB issued ASU No. 2020-06, \nAccounting for Convertible Instruments and Contracts in an Entity’s Own Equity.\n  The ASU includes amendments to the guidance on convertible instruments and the derivative scope exception for contracts in an entity’s own equity and simplifies the accounting for convertible instruments which include beneficial conversion features or cash conversion features by removing certain separation models in Subtopic 470-20.  Additionally, the ASU requires entities to use the “if-converted” method when calculating diluted earnings per common share for convertible instruments.  On January 1, 2022, the Company adopted the ASU, and the ASU did not have a significant impact on the Company’s financial statements. \nIn November 2021, the FASB issued ASU No. 2021-10, \nGovernment Assistance\n (Topic 832), which requires annual disclosures of transactions with a government that are accounted for by applying a grant or contribution accounting model by analogy.  These required disclosures include information on the nature of transactions and related accounting policies used to account for transactions, detail on the line items on the balance sheet and income statement affected by these transactions including amounts applicable to each line, and significant terms and conditions of the transactions including commitments and contingencies.  The Company prospectively adopted the ASU effective January 1, 2022 and applied the disclosure guidance to all transactions within the scope of the ASU that were reflected in the financial statements at the date of initial application and new transactions that are entered into subsequent to the date of initial application.  The Company accounts for the government assistance transactions by analogy to the grant accounting model in International Accounting Standards 20, \nAccounting for Government Grants and Disclosure of Government Assistance\n.\nThe Company receives various forms of government assistance, primarily through grants related to the development of new products and the expansion of production capacity.  During 2021, certain agencies of the U.S. government, including the Biomedical Advanced Research and Development Authority (“BARDA”) within the U.S. Department of Health and Human Services, agreed to finance an expansion of production capacity related to chromatography, liquid cell culture media, buffers and cell culture powder media and single-use consumables at certain of the Company’s Biotechnology businesses and the development of diagnostics testing technologies and the expansion of testing production capacity at certain of the Company’s Diagnostics businesses.  The Company’s businesses may enter into similar agreements in the future.  In consideration of this financing, the U.S. government has certain rights, including rights with respect to the allocation of certain of the incremental production capacity associated with such expansion and/or rights in intellectual property produced with its financial assistance.  The amount awarded pursuant to these grants in 2021 totaled $\n568\n million and is being paid over periods ranging from \none year\n to \nfour years\n.  In 2024, 2023 and 2022, the Company recorded amounts related to these grants and other government assistance that offset operating expenses of $\n43\n million\n, $\n51\n million\n and $\n49\n million\n, respectively, and purchases of property, plant and equipment of $\n198\n million\n, $\n136\n million\n and $\n87\n million\n, respectively.  Property, plant and equipment purchased using funds provided by governments are recorded net of government assistance. \n65\nTable of Contents\nIn June 2022, the FASB issued ASU No. 2022-03, \nFair Value Measurement of Equity Securities Subject to Contractual Sale Restrictions\n.  The ASU clarifies the guidance in ASC 820, \nFair Value Measurement,\n related to the measurement of the fair value of an equity security subject to contractual sale restrictions and introduces disclosure requirements related to such equity securities.  The Company early adopted the ASU effective July 1, 2022 and the impact of the adoption was not significant.\nIn August 2023, the FASB issued ASU 2023-05, \nBusiness Combinations—Joint Venture Formations (Subtopic 805-60): Recognition and Initial Measurement\n.  The ASU requires that a joint venture apply a new basis of accounting upon formation in which the joint venture will recognize and initially measure its assets and liabilities at fair value (with exceptions to fair value measurement that are consistent with the business combinations guidance).  The ASU is effective prospectively for all joint venture formations with a formation date on or after January 1, 2025, with early adoption permitted.  The Company early adopted the ASU effective September 30, 2023 on a prospective basis. \nIn November 2023, the FASB issued ASU 2023-07, \nImprovements to Reportable Segment Disclosures\n.  The ASU requires additional disclosures about reportable segments’ significant expenses on an interim and annual basis.  The Company adopted the ASU effective January 1, 2024, and interim periods within fiscal years beginning after December 15, 2024 on a retrospective basis.  Refer to Note 6 for additional segment disclosures. \nAccounting Standards Not Yet Adopted\n—In December 2023, the FASB issued ASU 2023-09, \nImprovements to Income Tax Disclosures.  \nThe ASU expands disclosures in the income tax rate reconciliations table and cash taxes paid and is effective for annual periods beginning after December 15, 2024.  This accounting standard will increase disclosures in the Company’s annual reporting but will have no impact on reported income tax expense or related tax assets or liabilities.\nIn November 2024, the FASB issued ASU 2024-03, \nDisaggregation of Income Statement Expenses\n.  The ASU requires disclosure of disaggregated information about certain income statement expenses, including specific expense categories.  The ASU is effective for annual periods beginning after December 15, 2026 and interim periods within fiscal years beginning after December 15, 2027.  This accounting standard will increase disclosures in the Company’s annual and interim reporting but will have no impact on reported income statement expense captions.\nNOTE 2.  \nACQUISITIONS \nThe Company continually evaluates potential acquisitions that either strategically fit with the Company’s existing portfolio or expand the Company’s portfolio into a new and attractive business area.  The Company has completed a number of acquisitions that have been accounted for as purchases and have resulted in the recognition of goodwill in the Company’s Consolidated Financial Statements.  This goodwill arises because the purchase prices for these businesses exceeds the fair value of acquired identifiable net assets due to the purchase prices reflecting a number of factors including the future earnings and cash flow potential of these businesses, the multiple to earnings, cash flow and other factors at which similar businesses have been purchased by other acquirers, the competitive nature of the processes by which the Company acquired the businesses, the avoidance of the time and costs which would be required (and the associated risks that would be encountered) to enhance the Company’s existing product offerings to key target markets and enter into new and profitable businesses and the complementary strategic fit and resulting synergies these businesses bring to existing operations.\nThe Company makes an initial allocation of the purchase price at the date of acquisition based upon its understanding of the fair value of the acquired assets and assumed liabilities.  The Company obtains the information used for the purchase price allocation during due diligence and through other sources.  In the months after closing, as the Company obtains additional information about the acquired assets and liabilities, including through tangible and intangible asset appraisals, and learns more about the newly acquired business, it is able to refine the estimates of fair value and more accurately allocate the purchase price.  The fair values of acquired intangibles are determined based on estimates and assumptions that are deemed reasonable by the Company.  Significant assumptions include the discount rates and certain assumptions that form the basis of the forecasted results of the acquired business including earnings before interest, taxes, depreciation and amortization (“EBITDA”), revenue, revenue growth rates, royalty rates and technology obsolescence rates.  These assumptions are forward looking and could be affected by future economic and market conditions.  The Company engages third-party valuation specialists who review the Company’s critical assumptions and calculations of the fair value of acquired intangible assets in connection with significant acquisitions.  Only facts and circumstances that existed as of the acquisition date are considered for subsequent adjustment.  The Company is continuing to evaluate certain pre-acquisition contingencies associated with its 2024 acquisitions and is also in the process of obtaining valuations of certain acquisition-related assets and liabilities in connection with these acquisitions.  The Company will make appropriate adjustments to the purchase price allocations, if any, prior to completion of the measurement periods, as required.\nThe following briefly describes the Company’s acquisition activity for the three years ended December 31, 2024.\n66\nTable of Contents\nDuring 2024, the Company acquired \nthree\n businesses for total consideration of $\n558\n million in cash, net of cash acquired.  The businesses acquired complement existing units of the Company’s Life Sciences segment.  The Company preliminarily recorded an aggregate of $\n305\n million of goodwill related to these acquisitions.\nOn December 6, 2023, the Company acquired Abcam plc (“Abcam”) for a cash purchase price of approximately $\n5.6\n billion (the “Abcam Acquisition”).  Abcam is a leading global supplier of protein consumables, including highly validated antibodies, reagents, biomarkers and assays to address targets in biological pathways that are critical for advancing drug discovery, life sciences research and diagnostics.  Abcam is now part of the Company’s Life Sciences segment.  Abcam generated revenues of approximately £\n362\n million in 2022.  The acquisition of Abcam has provided and is expected to provide the Company additional sales and earnings opportunities in the proteomics sector.  The Company financed the Abcam Acquisition using cash on hand.  The Company recorded approximately $\n3.9\n billion of goodwill related to the Abcam Acquisition.  \nDuring 2022, the Company acquired \nseven\n businesses for total consideration of $\n582\n million in cash, net of cash acquired.  The businesses acquired complement existing units of each of the Company’s \nthree\n segments.  The Company recorded an aggregate of $\n389\n million of goodwill related to these acquisitions.\nThe following summarizes the estimated fair values of the assets acquired and liabilities assumed at the date of acquisition ($ in millions):\n2024\n2023\n2022\nTrade accounts receivable\n$\n15\n \n$\n86\n \n$\n4\n \nInventories\n1\n \n94\n \n7\n \nProperty, plant and equipment\n13\n \n158\n \n9\n \nGoodwill\n305\n \n3,851\n \n389\n \nOther intangible assets, primarily developed technology, trade names and customer relationships \n419\n \n2,146\n \n200\n \nTrade accounts payable\n(\n2\n)\n(\n32\n)\n(\n1\n)\nDeferred tax liabilities\n(\n59\n)\n(\n519\n)\n(\n10\n)\nOther assets and liabilities, net\n16\n \n(\n49\n)\n(\n16\n)\nNet assets acquired\n708\n \n5,735\n \n582\n \nLess: noncash consideration\n(\n150\n)\n(\n125\n)\n—\n \nNet cash consideration\n$\n558\n \n$\n5,610\n \n$\n582\n \nThe noncash consideration of $\n150\n million and $\n125\n million related to a 2024 and a 2023 acquisition, respectively, and were the result of the Company’s preexisting investments in acquired businesses.  \nTransaction-related costs for the Abcam Acquisition were $\n27\n million for the year ended December 31, 2023.  The Company’s earnings for 2024 and 2023 also reflect the pretax impact of $\n25\n million and $\n68\n million, respectively, of non-recurring acquisition date fair value adjustments to inventory in both periods and the settlement of pre-acquisition share-based payment awards in 2023, both related to the Abcam Acquisition.  Transaction-related costs and acquisition-related fair value adjustments attributable to other acquisitions were not material for the years ended December 31, 2024, 2023 or 2022.\nPro Forma Financial Information (Unaudited)\nThe unaudited pro forma information for the periods set forth below gives effect to the 2024 and 2023 acquisitions as if they had occurred as of the beginning of the comparable prior annual reporting period, including the results from operations for the acquired business as well as the impact of assumed financing of the transaction and the impact of the purchase price allocation (including the amortization of acquired intangible assets).  \nThe pro forma information is presented for informational purposes only and is not necessarily indicative of the results of operations that actually would have been achieved had the acquisitions been consummated as of that time ($ in millions except per share amounts):\n2024\n2023\nSales\n$\n23,933\n \n$\n24,427\n \nNet earnings from continuing operations\n3,892\n \n4,138\n \nDiluted net earnings per common share from continuing operations\n(a)\n5.28\n \n5.54\n \n(a)\n Diluted net earnings from continuing operations for 2023 is calculated by taking net earnings from continuing operations and excluding the anti-dilutive MCPS dividends.\n67\nTable of Contents\nThe 2024 unaudited pro forma net earnings from continuing operations set forth above were adjusted to exclude the pretax impact of a $\n25\n million nonrecurring acquisition date fair value adjustment to inventory.  The 2023 unaudited pro forma net earnings from continuing operations were adjusted to exclude the pretax impact of $\n68\n million of nonrecurring acquisition date fair value adjustments to inventory and the settlement of pre-acquisition share-based payment awards related to the Abcam Acquisition.  In addition, acquisition-related transaction costs of $\n27\n million pretax for the year ended December 31, 2023 associated with the Abcam Acquisition were excluded from pro forma net earnings from continuing operations.\n \nNOTE 3.  \nDISCONTINUED OPERATIONS  \nOn September 30, 2023 (the “Distribution Date”), the Company completed the separation (the “Separation”) of its former Environmental & Applied Solutions business by distributing to Danaher stockholders on a pro rata basis all of the issued and outstanding common stock of Veralto Corporation (“Veralto”), the entity Danaher incorporated to hold such businesses.  To effect the Separation, Danaher distributed to its stockholders one share of Veralto common stock for every three shares of Danaher common stock outstanding as of September 13, 2023, the record date for the distribution.  Fractional shares of Veralto common stock that otherwise would have been distributed were aggregated and sold into the public market and the proceeds distributed to Danaher stockholders who otherwise would have received fractional shares of Veralto common stock.\nIn preparation for the Separation, in September 2023 Veralto issued approximately $\n2.6\n billion in debt securities (refer to Note 13).  The proceeds from these issuances were used to fund the approximately $\n2.6\n billion net cash distributions Veralto made to Danaher prior to the Distribution Date (“Veralto Distribution”).  Danaher used the Veralto Distribution proceeds to redeem approximately $\n1.0\n billion of commercial paper, to satisfy bond maturities and to fund certain of the Company’s regular, quarterly cash dividends to shareholders.\nThe accounting requirements for reporting Veralto as a discontinued operation were met when the Separation was completed.  Accordingly, the accompanying Consolidated Financial Statements for all periods presented reflect this business as a discontinued operation.  The Company allocated a portion of the consolidated interest expense to discontinued operations based on the ratio of the discontinued business’ net assets to the Company’s consolidated net assets.\nAs a result of the Separation, the Company incurred $\n145\n million and $\n9\n million in Separation-related costs during the years ended December 31, 2023 and 2022, respectively, which are reflected in earnings from discontinued operations, net of income taxes in the accompanying Consolidated Statements of Earnings.  These costs primarily relate to professional fees associated with preparation of regulatory filings and activities within finance, tax, legal and information technology functions as well as certain investment banking fees and tax costs incurred upon the Separation.\nIn connection with the Separation, Danaher and Veralto entered into various agreements to effect the Separation and provide a framework for their relationship after the Separation, including a separation and distribution agreement, transition services agreement, an employee matters agreement, a tax matters agreement, an intellectual property matters agreement and a Danaher Business System (“DBS”) license agreement.  These agreements provide for the allocation between Danaher and Veralto of assets, employees, liabilities and obligations (including investments, property, employee benefits and tax-related assets and liabilities) attributable to periods prior to, at and after Veralto’s separation from Danaher and govern certain relationships between Danaher and Veralto after the Separation.  In addition, Danaher is also party to various commercial agreements with Veralto entities.  The amounts paid and received by Danaher for transition services provided under the above agreements as well as sales and purchases to and from Veralto were not material to the Company’s results of operations for the years ended December 31, 2024 and 2023.\nThe key components of income from the Veralto business from discontinued operations for the years ended December 31 were as follows ($ in millions):\n2023\n2022\nSales\n$\n3,712\n \n$\n4,828\n \nCost of sales\n(\n1,556\n)\n(\n2,067\n)\nSelling, general and administrative expenses\n(\n1,236\n)\n(\n1,392\n)\nResearch and development expenses\n(\n168\n)\n(\n217\n)\nOther income (expense)\n(\n14\n)\n1\n \nInterest expense\n(\n7\n)\n(\n7\n)\nIncome from discontinued operations before income taxes\n731\n \n1,146\n \nIncome tax expense\n(\n188\n)\n(\n265\n)\nEarnings from discontinued operations, net of income taxes\n$\n543\n \n$\n881\n \n68\nTable of Contents\nNOTE 4.  \nNET EARNINGS PER COMMON SHARE FROM CONTINUING OPERATIONS\nBasic net earnings per share from continuing operations (“EPS”) is calculated by taking net earnings from continuing operations less the MCPS dividends divided by the weighted average number of common shares outstanding for the applicable period.  Diluted net EPS from continuing operations is computed by taking net earnings from continuing operations less the MCPS dividends divided by the weighted average number of common shares outstanding increased by the number of additional shares that would have been outstanding had the potentially dilutive common shares been issued and reduced by the number of shares the Company could have repurchased with the proceeds from the issuance of the potentially dilutive shares.  For the years ended December 31, 2024, 2023 and 2022, \n1.3\n million, \n3.5\n million and \n1.4\n million options to purchase shares, respectively, were excluded from the diluted earnings per share calculation, as the impact of their inclusion would have been anti-dilutive.  \nBasic and diluted EPS are computed independently for each quarter and annual period, which involves the use of different weighted-average share count figures relating to quarterly and annual periods.  As a result, and after factoring the effect of rounding to the nearest cent per share, the sum of prior quarter-to-date EPS figures may not equal annual EPS.  \nOn April 17, 2023, all outstanding shares of the MCPS Series B converted into \n8.6\n million shares of the Company’s common stock.  The impact of the MCPS Series B calculated under the if-converted method was anti-dilutive for both of the years ended December 31, 2023 and 2022 and as such \n2.5\n million and \n8.6\n million shares, respectively, underlying the MCPS Series B were excluded in the calculation of diluted EPS and the related MCPS Series B dividends of $\n21\n million and $\n86\n million, respectively, were included in the calculation of net earnings for diluted EPS for the period.  \nOn April 15, 2022, all outstanding shares of the MCPS Series A converted into \n11.0\n million shares of the Company’s common stock.  The impact of the MCPS Series A calculated under the if-converted method was dilutive for the year ended December 31, 2022, and as such \n3.0\n million shares underlying the MCPS Series A were included in the calculation of diluted EPS and the related MCPS Series A dividends of $\n20\n million were excluded from the calculation of net earnings for diluted EPS.  Refer to Note 18 for additional information about the MCPS Series A and B conversions. \nInformation related to the calculation of net earnings per common share from continuing operations for the years ended December 31 is summarized as follows ($ and shares in millions, except per share amounts):\n2024\n2023\n2022\nNumerator:\nNet earnings from continuing operations\n$\n3,899\n \n$\n4,221\n \n$\n6,328\n \nMCPS dividends\n—\n \n(\n21\n)\n(\n106\n)\nNet earnings from continuing operations attributable to common stockholders for Basic EPS\n3,899\n \n4,200\n \n6,222\n \nAdjustment for MCPS dividends for dilutive MCPS\n—\n \n—\n \n20\n \nNet earnings from continuing operations attributable to common stockholders after assumed conversions for Diluted EPS\n$\n3,899\n \n$\n4,200\n \n$\n6,242\n \nDenominator:\nWeighted average common shares outstanding used in Basic EPS\n731.0\n \n736.5\n \n725.1\n \nIncremental common shares from:\nAssumed exercise of dilutive options and vesting of dilutive RSUs and PSUs\n6.2\n \n6.6\n \n9.0\n \nWeighted average MCPS converted shares\n—\n \n—\n \n3.0\n \nWeighted average common shares outstanding used in Diluted EPS\n737.2\n \n743.1\n \n737.1\n \nBasic EPS from continuing operations\n$\n5.33\n \n$\n5.70\n \n$\n8.58\n \nDiluted EPS from continuing operations\n$\n5.29\n \n$\n5.65\n \n$\n8.47\n \n69\nTable of Contents\nNOTE 5.  \nREVENUE \nThe following table presents the Company’s revenues disaggregated by geographical region and revenue type ($ in millions).  Sales taxes and other usage-based taxes collected from customers are excluded from revenue.  \nBiotechnology\nLife Sciences\nDiagnostics\nTotal\nYear ended December 31, 2024:\nGeographical region:\nNorth America\n(a)\n$\n2,237\n \n$\n3,199\n \n$\n4,859\n \n$\n10,295\n \nWestern Europe\n2,296\n \n1,574\n \n1,587\n \n5,457\n \nOther developed markets\n(b)\n335\n \n510\n \n408\n \n1,253\n \nHigh-growth markets\n(c)\n1,891\n \n2,046\n \n2,933\n \n6,870\n \nTotal\n$\n6,759\n \n$\n7,329\n \n$\n9,787\n \n$\n23,875\n \nRevenue type:\nRecurring\n$\n5,758\n \n$\n4,889\n \n$\n8,719\n \n$\n19,366\n \nNonrecurring\n1,001\n \n2,440\n \n1,068\n \n4,509\n \nTotal\n$\n6,759\n \n$\n7,329\n \n$\n9,787\n \n$\n23,875\n \nYear ended December 31, 2023:\nGeographical region:\nNorth America\n(a)\n$\n2,454\n \n$\n2,999\n \n$\n4,508\n \n$\n9,961\n \nWestern Europe\n2,407\n \n1,519\n \n1,542\n \n5,468\n \nOther developed markets\n(b)\n329\n \n510\n \n431\n \n1,270\n \nHigh-growth markets\n(c)\n1,982\n \n2,113\n \n3,096\n \n7,191\n \nTotal\n$\n7,172\n \n$\n7,141\n \n$\n9,577\n \n$\n23,890\n \nRevenue type:\nRecurring\n$\n5,897\n \n$\n4,360\n \n$\n8,425\n \n$\n18,682\n \nNonrecurring\n1,275\n \n2,781\n \n1,152\n \n5,208\n \nTotal\n$\n7,172\n \n$\n7,141\n \n$\n9,577\n \n$\n23,890\n \nYear ended December 31, 2022:\nGeographical region:\nNorth America\n(a)\n$\n3,054\n \n$\n3,154\n \n$\n5,522\n \n$\n11,730\n \nWestern Europe\n2,645\n \n1,377\n \n1,837\n \n5,859\n \nOther developed markets\n(b)\n358\n \n506\n \n481\n \n1,345\n \nHigh-growth markets\n(c)\n2,701\n \n1,999\n \n3,009\n \n7,709\n \nTotal\n$\n8,758\n \n$\n7,036\n \n$\n10,849\n \n$\n26,643\n \nRevenue type:\nRecurring\n$\n6,958\n \n$\n4,220\n \n$\n9,698\n \n$\n20,876\n \nNonrecurring\n1,800\n \n2,816\n \n1,151\n \n5,767\n \nTotal\n$\n8,758\n \n$\n7,036\n \n$\n10,849\n \n$\n26,643\n \n(a) \nThe Company defines North America as the United States and Canada.\n(b)\n The Company defines other developed markets as all the markets of the world that are not North America, Western Europe or high-growth markets.\n(c) \nThe Company defines high-growth markets as Eastern Europe, the Middle East, Africa, Latin America (including Mexico) and Asia (with the exception of Japan, Australia and New Zealand).  The Company defines developed markets as all markets of the world that are not high-growth markets.\n \n70\nTable of Contents\nThe Company’s products and services primarily consist of life sciences research, biopharmaceutical drug production and medical diagnostic products and services.  The Company sells equipment to customers as well as consumables, software and services, some of which customers purchase on a recurring basis.  Consumables sold for use with the equipment sold by the Company are typically critical to the use of the equipment and are typically used on a one-time or limited basis, requiring frequent replacement in the customer’s operating cycle.  Examples of these consumables include reagents used in diagnostic tests, chromatography resins used for research and bioprocessing and filters used in filtration, separation and purification processes.  Additionally, some of the Company’s consumables are used on a standalone basis, such as custom nucleic acids, genomics solutions, antibodies and immunoassays.  The Company separates its goods and services between those typically sold to a customer on a recurring basis and those typically sold to a customer on a nonrecurring basis.  Recurring revenue primarily includes revenue from consumables (both used with Company equipment and used on a standalone basis), services and OTLs.  Nonrecurring revenue includes sales of equipment, point in time software licenses and STLs.  OTLs and STLs are included in the above revenue amounts.  For the years ended December 31, 2024, 2023 and 2022, lease revenue was $\n402\n million, $\n410\n million and $\n419\n million, respectively.\nRemaining Performance Obligations\nRemaining performance obligations represent the aggregate transaction price allocated to performance obligations with an original contract term greater than one year which are fully or partially unsatisfied at the end of the period.  Remaining performance obligations include noncancelable purchase orders, the non-lease portion of minimum purchase commitments under long-term consumable supply arrangements, extended warranty and service and other long-term contracts.  These remaining performance obligations do not include revenue from contracts with customers with an original term of one year or less, revenue from long-term consumable supply arrangements with no minimum purchase requirements or revenue expected from purchases made in excess of the minimum purchase requirements or revenue from equipment leased to customers.  While the remaining performance obligation disclosure is similar in concept to backlog, the definition of remaining performance obligations excludes leases and contracts that provide the customer with the right to cancel or terminate for convenience with no substantial penalty, even if historical experience indicates the likelihood of cancellation or termination is remote.  Additionally, the Company has elected to exclude contracts with customers with an original term of one year or less from remaining performance obligations while these contracts are included within backlog.\nAs of December 31, 2024, the aggregate amount of the transaction price allocated to remaining performance obligations was approximately $\n4.3\n billion.  The Company expects to recognize revenue on approximately \n47\n% of the remaining performance obligations over the next \n12\n months, \n27\n% over the subsequent \n12\n months, and the remainder recognized thereafter.\nContract Balances\nThe timing of revenue recognition, billings and cash collections results in billed trade accounts receivable, unbilled receivables (“contract assets”) and deferred revenue, customer deposits and billings in excess of revenue recognized (“contract liabilities”) on the Consolidated Balance Sheets.  In addition, the Company defers certain costs incurred to obtain a contract (“contract costs”).  Contract assets, liabilities and costs are reported on the accompanying Consolidated Balance Sheets on a contract-by-contract basis.  The balances of contract assets and contract costs as of December 31, 2024 and 2023 were not significant and are classified as other current assets and other long-term assets in the Consolidated Balance Sheets.  The balance of contract costs are generally amortized into earnings on a straight-line basis (which is consistent with the transfer of control for the related goods or services).  Amortization expense related to these costs for the years ended December 31, 2024 and 2023 was also not significant.  The costs to obtain a contract where the amortization period for the related asset is one year or less are expensed as incurred and recorded within selling, general and administrative expenses in the accompanying Consolidated Statements of Earnings.\nThe Company often receives cash payments from customers in advance of the Company’s performance resulting in contract liabilities that are classified as either current or long-term in the Consolidated Balance Sheets based on the timing of when the Company expects to recognize revenue.  As of December 31, 2024 and 2023, contract liabilities were approximately $\n1.5\n billion and $\n1.7\n billion, respectively, and are included within accrued expenses and other liabilities and other long-term liabilities in the accompanying Consolidated Balance Sheets.  The decrease in the contract liability balance during the year ended December 31, 2024 was primarily a result of amounts recognized as revenue and the impact of foreign currency, partially offset by cash payments received in advance of satisfying performance obligations.  Revenue recognized during the years ended December 31, 2024 and 2023 that was included in the opening contract liability balance each year was approximately $\n1.3\n billion.\n71\nTable of Contents\nNOTE 6.  \nSEGMENT INFORMATION \nThe Company operates and reports its results in \nthree\n separate business segments consisting of the Biotechnology, Life Sciences and Diagnostics segments.  Operating profit represents total revenues less operating expenses, excluding nonoperating income and expense, interest and income taxes.  The identifiable assets by segment are those used in each segment’s operations.  Intersegment amounts are not significant and are eliminated to arrive at consolidated totals.  \nThe Company’s President and Chief Executive Officer is the chief operating decision maker (“CODM”).  The CODM uses segment sales and operating profit to allocate resources (including employees and financial or capital resources), to assess the performance of the segments and in the determination of the compensation for certain employees for each segment predominantly in the annual budget process.  The CODM reviews forecast-to-actual variances in segment sales and operating profit on a monthly basis when making decisions about allocating capital and personnel to the segments. \nThe table below reconciles segment sales to segment operating profit with the expense categories presented reflecting the expenses that the Company has determined to be significant segment expenses.  Significant segment expenses are the expense category details regularly provided to the CODM to allocate resources to the segments and to evaluate segment performance.  \nDetailed segment data for the years ended December 31 is as follows ($ in millions):\nBiotechnology\nLife Sciences\nDiagnostics\nOther \n(a)\nTotal Company\nYear Ended December 31, 2024\nSales (GAAP)\n$\n6,759\n \n$\n7,329\n \n$\n9,787\n \n$\n—\n \n$\n23,875\n \nLess:\nDepreciation\n(\n151\n)\n(\n167\n)\n(\n394\n)\n(\n9\n)\n(\n721\n)\nAmortization of intangible assets\n(\n863\n)\n(\n576\n)\n(\n192\n)\n—\n \n(\n1,631\n)\nImpairments\n(b)\n—\n \n(\n222\n)\n(\n43\n)\n—\n \n(\n265\n)\nOther segment expenses\n(c)\n(\n4,060\n)\n(\n5,485\n)\n(\n6,533\n)\n(\n317\n)\n(\n16,395\n)\nOperating profit\n$\n1,685\n \n$\n879\n \n$\n2,625\n \n$\n(\n326\n)\n$\n4,863\n \nYear Ended December 31, 2023\nSales (GAAP)\n$\n7,172\n \n$\n7,141\n \n$\n9,577\n \n$\n—\n \n$\n23,890\n \nLess:\nDepreciation\n(\n162\n)\n(\n129\n)\n(\n379\n)\n(\n5\n)\n(\n675\n)\nAmortization of intangible assets\n(\n864\n)\n(\n429\n)\n(\n198\n)\n—\n \n(\n1,491\n)\nImpairments\n(b)\n(\n54\n)\n—\n \n(\n23\n)\n—\n \n(\n77\n)\nOther segment expenses\n(c)\n(\n4,183\n)\n(\n5,374\n)\n(\n6,571\n)\n(\n317\n)\n(\n16,445\n)\nOperating profit\n$\n1,909\n \n$\n1,209\n \n$\n2,406\n \n$\n(\n322\n)\n$\n5,202\n \nYear Ended December 31, 2022\nSales (GAAP)\n$\n8,758\n \n$\n7,036\n \n$\n10,849\n \n$\n—\n \n$\n26,643\n \nLess:\nDepreciation\n(\n190\n)\n(\n112\n)\n(\n387\n)\n(\n9\n)\n(\n698\n)\nAmortization of intangible assets\n(\n812\n)\n(\n419\n)\n(\n203\n)\n—\n \n(\n1,434\n)\nOther segment expenses\n(c)\n(\n4,748\n)\n(\n5,091\n)\n(\n6,823\n)\n(\n313\n)\n(\n16,975\n)\nOperating profit\n$\n3,008\n \n$\n1,414\n \n$\n3,436\n \n$\n(\n322\n)\n$\n7,536\n \n(a)\n Other consists of unallocated corporate costs and other costs not considered part of management’s evaluation of reportable segment operating performance.\n(b)\n For information on the impairments, refer to Note 10. \n(c)\n Other segment expenses for each reportable segment include cost of sales, selling general and administrative expenses, research and development (“R&D”) expenses, excluding depreciation, amortization of intangible assets and impairments.  Included within these categories of expenses are overhead expenses, stock compensation expense, restructuring charges and allocated corporate expenses. \n72\nTable of Contents\nThe following table presents additional detailed segment data for the years ended December 31 ($ in millions):\n2024\n2023\n2022\nIdentifiable assets:\nBiotechnology\n$\n34,605\n \n$\n37,421\n \n$\n37,536\n \nLife Sciences\n23,211\n \n23,730\n \n17,572\n \nDiagnostics\n14,204\n \n14,552\n \n14,722\n \nOther\n5,522\n \n8,785\n \n9,739\n \nDiscontinued operations\n—\n \n—\n \n4,781\n \nTotal\n$\n77,542\n \n$\n84,488\n \n$\n84,350\n \nCapital expenditures, gross:\nBiotechnology\n$\n447\n \n$\n417\n \n$\n405\n \nLife Sciences\n391\n \n320\n \n325\n \nDiagnostics\n550\n \n546\n \n382\n \nOther\n4\n \n100\n \n6\n \nTotal\n$\n1,392\n \n$\n1,383\n \n$\n1,118\n \nOperations in Geographical Areas:\nYear Ended December 31\n($ in millions)\n2024\n2023\n2022\nSales:\nUnited States\n$\n9,927\n \n$\n9,579\n \n$\n11,289\n \nChina\n2,805\n \n3,143\n \n3,611\n \nAll other (each country individually less than \n5\n% of total sales)\n11,143\n \n11,168\n \n11,743\n \nTotal\n$\n23,875\n \n$\n23,890\n \n$\n26,643\n \nProperty, plant and equipment, net:\nUnited States\n$\n2,585\n \n$\n2,304\n \n$\n1,839\n \nUnited Kingdom\n519\n \n371\n \n239\n \nSweden\n384\n \n425\n \n429\n \nGermany\n251\n \n238\n \n204\n \nAll other (each country individually less than \n5\n% of total property, plant and equipment, net)\n1,251\n \n1,215\n \n998\n \nTotal\n$\n4,990\n \n$\n4,553\n \n$\n3,709\n \nNOTE 7.  \nINCOME TAXES \nEarnings from continuing operations before income taxes for the years ended December 31 were as follows ($ in millions):\n2024\n2023\n2022\nUnited States\n$\n1,002\n \n$\n1,310\n \n$\n2,527\n \nNon-U.S.\n3,644\n \n3,734\n \n4,619\n \nTotal\n$\n4,646\n \n$\n5,044\n \n$\n7,146\n \n73\nTable of Contents\nThe provision for income taxes from continuing operations for the years ended December 31 were as follows ($ in millions):\n2024\n2023\n2022\nCurrent:\nFederal U.S.\n$\n239\n \n$\n559\n \n$\n232\n \nNon-U.S.\n929\n \n1,271\n \n1,042\n \nState and local\n62\n \n197\n \n126\n \nDeferred:\nFederal U.S.\n(\n300\n)\n(\n737\n)\n(\n362\n)\nNon-U.S.\n(\n141\n)\n(\n338\n)\n(\n145\n)\nState and local\n(\n42\n)\n(\n129\n)\n(\n75\n)\nIncome tax provision\n$\n747\n \n$\n823\n \n$\n818\n \nNoncurrent deferred tax assets and noncurrent deferred tax liabilities are included in other assets and other long-term liabilities, respectively, in the accompanying Consolidated Balance Sheets.  \nDeferred income tax assets and liabilities as of December 31 were as follows ($ in millions):\n2024\n2023\nDeferred tax assets:\nAllowance for doubtful accounts\n$\n20\n \n$\n18\n \nInventories\n114\n \n120\n \nPension and postretirement benefits\n—\n \n25\n \nEnvironmental and regulatory compliance\n38\n \n37\n \nOther accruals and prepayments\n631\n \n574\n \nStock-based compensation expense\n122\n \n115\n \nOperating lease liabilities\n255\n \n252\n \nResearch and development expense\n584\n \n441\n \nTax credit and loss carryforwards\n760\n \n557\n \nValuation allowances\n(\n232\n)\n(\n234\n)\nTotal deferred tax asset\n2,292\n \n1,905\n \nDeferred tax liabilities:\nPension and postretirement benefits\n(\n9\n)\n—\n \nProperty, plant and equipment\n(\n136\n)\n(\n125\n)\nInsurance, including self-insurance\n(\n400\n)\n(\n315\n)\nOperating lease ROU assets\n(\n238\n)\n(\n228\n)\nGoodwill and other intangibles\n(\n3,300\n)\n(\n3,429\n)\nTotal deferred tax liability\n(\n4,083\n)\n(\n4,097\n)\nNet deferred tax liability\n$\n(\n1,791\n)\n$\n(\n2,192\n)\nThe Company evaluates the future realizability of tax credits and loss carryforwards considering the anticipated future earnings of the Company’s subsidiaries as well as tax planning strategies in the associated jurisdictions.  Deferred taxes associated with U.S. entities consist of net deferred tax liabilities of $\n337\n million and $\n832\n million as of December 31, 2024 and 2023, respectively.  Deferred taxes associated with non-U.S. entities consist of net deferred tax liabilities of approximately $\n1.5\n billion and $\n1.4\n billion as of December 31, 2024 and 2023, respectively.  During 2024, the Company’s valuation allowance decreased by $\n2\n million due to the utilization of tax attributes which were previously not realizable, partially offset by increases related to acquisitions and certain tax benefits recognized in 2024 that are not expected to be realized.  As of December 31, 2024, the total amount of the basis difference in investments indefinitely reinvested outside the United States for which deferred taxes have not been provided is approximately $\n14.2\n billion.  The income taxes applicable to repatriating such earnings are not readily determinable.  As of December 31, 2024, the Company had no plans which would subject these basis differences to income taxes in the United States or elsewhere.\nThe Tax Cuts and Jobs Act (“TCJA”) imposes tax on U.S. shareholders for global intangible low-taxed income (“GILTI”) earned by certain non-U.S. subsidiaries.  The Company has elected the period cost method for its accounting for GILTI.\n74\nTable of Contents\nThe effective income tax rate from continuing operations for the years ended December 31 varies from the U.S. statutory federal income tax rate as follows:\n \nPercentage of Pretax Earnings\n \n2024\n2023\n2022\nStatutory federal income tax rate\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nIncrease (decrease) in tax rate resulting from:\nState income taxes (net of federal income tax benefit)\n0.8\n \n%\n1.2\n \n%\n1.2\n \n%\nNon-U.S. rate differential\n(\n2.9\n)\n%\n(\n3.4\n)\n%\n(\n3.4\n)\n%\nResolution and expiration of statutes of limitation of uncertain tax positions\n(\n0.6\n)\n%\n(\n0.4\n)\n%\n(\n0.3\n)\n%\nRealignment of businesses\n—\n \n%\n0.6\n \n%\n(\n5.7\n)\n%\nResearch credits\n(\n1.5\n)\n%\n(\n1.6\n)\n%\n(\n0.6\n)\n%\nForeign-derived intangible income, uncertain tax positions and other\n0.3\n \n%\n(\n0.8\n)\n%\n(\n0.3\n)\n%\nExcess tax benefits from stock-based compensation\n(\n1.0\n)\n%\n(\n0.3\n)\n%\n(\n0.5\n)\n%\nEffective income tax rate\n16.1\n \n%\n16.3\n \n%\n11.4\n \n%\nThe Company operates globally, including in certain jurisdictions with lower tax rates than the U.S. federal statutory rate.  Therefore, the impact of Danaher’s global operations and benefits from tax credits and incentives contributes to a lower effective tax rate for 2024, 2023 and 2022 compared to the U.S. federal statutory tax rate of \n21.0\n%, as well as the impact of the following: \n•\nThe effective tax rate of \n16.1\n% in 2024 includes the tax effect from intangible asset impairments in a jurisdiction with a higher statutory tax rate than the Company’s effective tax rate and discrete tax benefits from excess tax benefits from stock-based compensation, the release of reserves for uncertain tax positions due to the expiration of statutes of limitation and changes in estimates related to prior year tax filing positions, net of charges related to changes in estimates associated with prior period uncertain tax positions.  These items decreased the reported rate on a net basis by \n1.4\n%.\n•\nThe effective tax rate of \n16.3\n% in 2023 includes net deferred tax benefits from changes in estimates related to prior year tax filing positions, the release of reserves for uncertain tax positions due to the expiration of statutes of limitation and excess tax benefits from stock-based compensation, net of charges related to tax costs related to the Separation, tax costs from legal and operational actions undertaken to realign certain of its businesses and changes in estimates associated with prior period uncertain tax positions.  These items decreased the reported rate on a net basis by \n0.9\n%.\n•\nThe effective tax rate of \n11.4\n% in 2022 includes net deferred tax benefits resulting from legal and operational actions undertaken to realign certain of its businesses, as well as excess tax benefits from stock-based compensation, the release of reserves for uncertain tax positions due to the expiration of statutes of limitation and audit settlements and changes in estimates related to prior year tax filing positions, net of changes in estimates associated with prior period uncertain tax positions.  These items decreased the reported rate on a net basis by \n7.0\n%.  \nThe Company made income tax payments related to both continuing and discontinued operations of approximately $\n1.3\n billion, $\n1.8\n billion and $\n1.8\n billion in 2024, 2023 and 2022, respectively.  Current income taxes payable related to both continuing and discontinued operations has been reduced by $\n107\n million, $\n80\n million and $\n85\n million in 2024, 2023 and 2022, respectively, for tax deductions attributable to stock-based compensation, of which, the excess tax benefit over the amount recorded for financial reporting purposes for both continuing and discontinued operations was $\n70\n million, $\n51\n million and $\n61\n million, respectively.  The excess tax benefits have been recorded as reductions to the current income tax provision and are reflected as operating cash inflows in the accompanying Consolidated Statements of Cash Flows.\nIncluded in deferred income taxes as of December 31, 2024 are tax benefits for U.S. and non-U.S. net operating loss carryforwards totaling $\n315\n million ($\n140\n million of which the Company does not expect to realize and have corresponding valuation allowances).  Certain of the losses can be carried forward indefinitely and others can be carried forward to various dates from 2025 through 2044.  In addition, the Company had general business and non-U.S. tax credit carryforwards of $\n445\n million ($\n91\n million of which the Company does not expect to realize and have corresponding valuation allowances) as of December 31, 2024, which can be carried forward to various dates from 2025 to 2034.  In addition, as of December 31, 2024, the Company had $\n1\n million of valuation allowances related to other deferred tax asset balances that are not more likely than not of being realized.\n75\nTable of Contents\nAs of December 31, 2024, gross unrecognized tax benefits totaled approximately $\n1.2\n billion (approximately $\n1.4\n billion, net of the impact of $\n75\n million of indirect tax benefits offset by $\n231\n million associated with potential interest and penalties).  As of December 31, 2023, gross unrecognized tax benefits totaled approximately $\n1.2\n billion (approximately $\n1.3\n billion, net of the impact of $\n73\n million of indirect tax benefits offset by $\n199\n million associated with potential interest and penalties).  The Company recognized approximately $\n40\n million, $\n32\n million and $\n14\n million of net tax expense from potential interest and penalties during 2024, 2023 and 2022, respectively.  The net tax expense for potential interest and penalties related to discontinued operations were $\n6\n million and $\n2\n million during 2023 and 2022, respectively.  To the extent unrecognized tax benefits (including interest and penalties) are recognized with respect to uncertain tax positions, approximately $\n1.3\n billion as of both December 31, 2024 and 2023 would reduce the tax expense and effective tax rate in future periods.  The Company recognized interest and penalties related to unrecognized tax benefits within income taxes in the accompanying Consolidated Statements of Earnings.  Unrecognized tax benefits and associated accrued interest and penalties are included in taxes, income and other accrued expenses as detailed in Note 12.\nA reconciliation of the beginning and ending amount of unrecognized tax benefits, excluding amounts accrued for potential interest and penalties related to both continuing and discontinued operations, is as follows ($ in millions):\n2024\n2023\n2022\nUnrecognized tax benefits, beginning of year\n$\n1,214\n \n$\n1,139\n \n$\n1,095\n \nAdditions based on tax positions related to the current year\n64\n \n72\n \n44\n \nAdditions for tax positions of prior years\n21\n \n41\n \n49\n \nReductions for tax positions of prior years\n(\n14\n)\n(\n15\n)\n(\n10\n)\nAcquisitions, divestitures and other\n(\n12\n)\n(\n14\n)\n6\n \nLapse of statute of limitations\n(\n14\n)\n(\n11\n)\n(\n16\n)\nSettlements\n(\n9\n)\n(\n8\n)\n(\n7\n)\nEffect of foreign currency translation\n(\n21\n)\n10\n \n(\n22\n)\nUnrecognized tax benefits, end of year\n$\n1,229\n \n$\n1,214\n \n$\n1,139\n \nThe Company conducts business globally and files numerous consolidated and separate income tax returns in the U.S. federal and state and non-U.S. jurisdictions.  The non-U.S. countries in which the Company has a significant presence include China, Denmark, Germany, Singapore, Sweden, Switzerland and the United Kingdom.  Excluding these jurisdictions, the Company believes that a change in the statutory tax rate of any individual non-U.S. country would not have a material effect on the Company’s Consolidated Financial Statements given the geographic dispersion of the Company’s taxable income.\nThe Company and its subsidiaries are routinely examined by various U.S. and non-U.S. taxing authorities.  The Internal Revenue Service (“IRS”) has completed substantially all of the examinations of the Company’s federal income tax returns through 2015 and is currently examining certain of the Company’s federal income tax returns for 2016 through 2022.  In addition, the Company has subsidiaries in Canada, China, Denmark, France, Germany, India, Italy, Switzerland, the United Kingdom and various other countries, states and provinces that are currently under audit for years ranging from 2004 through 2023.\nIn the fourth quarter of 2022, the IRS proposed significant adjustments to the Company’s taxable income for the years 2016 through 2018 with respect to the deferral of tax on certain premium income related to the Company’s self-insurance programs.  For income tax purposes, the recognition of premium income has been deferred in accordance with U.S. tax laws related to insurance.  The proposed adjustments would have increased the Company’s taxable income over the 2016 through 2018 periods by approximately $\n2.5\n billion.  In the first quarter of 2023, the Company settled these proposed adjustments with the IRS, although the audit is still open with respect to other matters for the 2016 through 2018 period.  The impact of the settlement with respect to the Company’s self-insurance policies was not material to the Company’s financial statements, including cash flows and the effective tax rate.  As the settlement with the IRS was specific to the audit period, the settlement does not preclude the IRS from proposing similar adjustments to the Company’s self-insurance programs with respect to periods after 2018.  Management believes the positions the Company has taken in its U.S. tax returns are in accordance with the relevant tax laws. \nTax authorities in Denmark have issued tax assessments related to interest accrued by certain of the Company’s subsidiaries for the years 2004 through 2015, totaling approximately DKK \n2.1\n billion including applicable accrued interest (approximately $\n288\n million based on the exchange rate as of December 31, 2024). Management believes the positions the Company has taken in Denmark are in accordance with the relevant tax laws and is actively defending them under appeal to the Danish National Tax Tribunal.  The Company intends on pursuing this matter to the Danish High Court and Danish Supreme Court should the current appeal be unsuccessful.  While the ultimate resolution is uncertain and may take years to resolve, taking into account the provisions and payments the Company has previously made related to these assessments to mitigate further interest accrual claims, the Company does not expect the resolution of this matter to have a future material adverse impact on the Company’s financial statements, including its cash flow and effective tax rate.\n76\nTable of Contents\nManagement estimates that it is reasonably possible that the amount of unrecognized tax benefits may be reduced by approximately $\n305\n million within 12 months as a result of resolution of worldwide tax matters, net of payments for tax audit settlements and/or statute of limitations expirations.  This includes future resolution of uncertain tax positions related to discontinued operations that may result in additional charges or credits to earnings from discontinued operations in the accompanying Consolidated Statements of Earnings (refer to Note 3).\nThe Company operates in various non-U.S. jurisdictions where income tax incentives and rulings have been granted for specific periods of time.  In Puerto Rico and Singapore, the Company has various tax rulings and tax holiday arrangements which reduce the overall effective tax rate of the Company.  The various rulings and tax holidays expire between 2025 and 2027.  As of December 31, 2024, the Company had satisfied the conditions enumerated in these agreements.  Included in the accompanying Consolidated Financial Statements are tax benefits of $\n33\n million, $\n83\n million and $\n71\n million (or $\n0.04\n, $\n0.11\n and $\n0.10\n per diluted common share) for 2024, 2023 and 2022, respectively, from these rulings and tax holidays.\nNOTE 8.  \nNONOPERATING INCOME (EXPENSE) \nThe following sets forth the components of the Company’s other income (expense), net ($ in millions):\n2024\n2023\n2022\nOther components of net periodic benefit costs\n$\n1\n \n$\n7\n \n$\n44\n \nInvestment gains (losses):\nRealized investment gains (losses)\n156\n \n89\n \n123\n \nUnrealized investment gains (losses)\n(\n213\n)\n(\n271\n)\n(\n394\n)\nTotal investment gains (losses)\n(\n57\n)\n(\n182\n)\n(\n271\n)\nTotal other income (expense), net\n$\n(\n56\n)\n$\n(\n175\n)\n$\n(\n227\n)\nOther Components of Net Period Benefit Costs\nThe Company disaggregates the service cost component of net periodic benefit costs of noncontributory defined benefit pension plans and other postretirement employee benefit plans.  The service cost component is presented in cost of goods sold and selling, general and administrative expenses.  The other components of net periodic benefit costs are presented in other income (expense), net.  These other components of net period benefit costs include the assumed rate of return on plan assets, partially offset by amortization of actuarial losses and interest.  The Company’s net periodic benefit costs for the year ended December 31, 2022 includes a settlement loss of $\n10\n million ($\n9\n million after-tax), as a result of the transfer of a portion of its non-U.S. pension liabilities related to one defined benefit plan to a third-party.  \nInvestment Gains (Losses)\nFor investments in equity securities without readily available fair values, the Company has elected the Fair Value Alternative and records adjustments to fair value within net earnings.  Additionally, the Company is a limited partner in partnerships that invest primarily in early stage companies.  While the partnerships record these investments at fair value, the Company’s investments in the partnerships are accounted for under the equity method of accounting.  The investment gains (losses) include realized and unrealized gains and losses related to changes in the fair value of the Company’s investments in equity securities and the Company’s equity in earnings of the partnerships that reflect the changes in fair value of the investments of the partnerships and related management fees and operating expenses.  During the year ended December 31, 2024 the Company sold a portion of its shares of an equity method investment and recorded a realized investment gain of $\n180\n million ($\n135\n million after-tax).  In addition, during 2023 and 2022 the Company recorded impairments of $\n31\n million and $\n91\n million, respectively, related to equity method investments that are reflected in unrealized investment gains (losses).\n \nNOTE 9. \n \nLEASES\n \nThe Company has operating leases for office space, warehouses, distribution centers, research and development facilities, manufacturing locations and certain equipment, primarily automobiles.  Many leases include one or more options to renew, some of which include options to extend for up to \n30\n years, and some leases include options to terminate within \n30\n days.  In certain of the Company’s lease agreements, the rental payments are adjusted periodically to reflect actual charges incurred for common area maintenance, utilities, inflation and/or changes in other indexes.  The Company’s finance leases were not material as of December 31, 2024 and 2023.  ROU assets arising from finance leases are included in property, plant and equipment, net and the liabilities are included in notes payable and current portion of long-term debt and long-term debt in the accompanying Consolidated Balance Sheets.\n77\nThe Consolidated Financial Statements include the following amounts related to operating leases where the Company is the lessee ($ in millions):\n2024\n2023\n2022\nConsolidated Statements of Earnings\nFixed operating lease expense\n(a)\n$\n239\n \n$\n207\n \n$\n199\n \nVariable operating lease expense\n60\n \n67\n \n60\n \nTotal operating lease expense\n$\n299\n \n$\n274\n \n$\n259\n \nConsolidated Statements of Cash Flows\nCash paid for amounts included in the measurement of operating lease liabilities\n$\n245\n \n$\n214\n \n$\n219\n \nROU assets obtained in exchange for operating lease obligations\n320\n \n182\n \n188\n \nConsolidated Balance Sheets\nDecember 31, 2024\nDecember 31, 2023\nLease Assets and Liabilities\nClassification\nOperating lease ROU assets\nOther long-term assets\n$\n1,084\n \n$\n1,052\n \nOperating lease liabilities - current\nAccrued expenses and other liabilities\n$\n173\n \n$\n180\n \nOperating lease liabilities - long-term\nOther long-term liabilities\n968\n \n954\n \nTotal operating lease liabilities\n$\n1,141\n \n$\n1,134\n \nWeighted average remaining lease term\n9\n years\n9\n years\nWeighted average discount rate\n4.2\n \n%\n3.4\n \n%\n(a) \nIncludes short-term leases and sublease income, both of which were immaterial.\nThe following table presents the maturity of the Company’s operating lease liabilities as of December 31, 2024 ($ in millions):\n2025\n$\n212\n \n2026\n190\n \n2027\n153\n \n2028\n134\n \n2029\n120\n \nThereafter\n584\n \nTotal operating lease payments\n1,393\n \nLess: imputed interest\n(\n252\n)\nTotal operating lease liabilities\n$\n1,141\n \nAs of December 31, 2024, the Company had no additional significant operating or finance leases that had not yet commenced.\nNOTE 10.  \nGOODWILL AND OTHER INTANGIBLE ASSETS \nAs discussed in Note 2, goodwill arises from the purchase price for acquired businesses exceeding the fair value of tangible and intangible assets acquired less assumed liabilities and noncontrolling interests.  Management assesses the goodwill of each of its reporting units for impairment at least annually at the beginning of the fourth quarter and as “triggering” events occur that indicate that it is more likely than not that an impairment exists.  The Company elected to bypass the optional qualitative goodwill assessment allowed by applicable accounting standards and performed a quantitative impairment test for all reporting units as this was determined to be the most effective method to assess for impairment across the reporting units.  \n78\nThe Company estimates the fair value of its reporting units primarily using a market approach, based on current trading multiples of EBITDA for companies operating in businesses similar to each of the Company’s reporting units, in addition to recent available market sale transactions of comparable businesses.  In determining the estimated fair value of each reporting unit, the Company also applies a control premium.  If the estimated fair value of the reporting unit is less than its carrying value, the Company must perform additional analysis to determine if the reporting unit’s goodwill has been impaired.\nAs of December 31, 2024, the Company had \nfive\n reporting units for goodwill impairment testing.  As of the date of the 2024 annual impairment test, the carrying value of the goodwill included in each individual reporting unit ranged from approximately $\n1.2\n billion to $\n22.5\n billion.  \nNo\n goodwill impairment charges were recorded for any of the years ended December 31, 2024, 2023 and 2022 and no “triggering” events have occurred subsequent to the performance of the 2024 annual impairment test.  The factors used by management in its impairment analysis are inherently subject to uncertainty.  If actual results are not consistent with management’s estimates and assumptions, goodwill and other intangible assets may be overstated, and a charge would need to be taken against net earnings.\nThe following is a rollforward of the Company’s goodwill by segment ($ in millions):  \nBiotechnology\nLife Sciences\nDiagnostics\nTotal\nBalance, January 1, 2023\n$\n22,087\n \n$\n8,314\n \n$\n6,875\n \n$\n37,276\n \nAttributable to 2023 acquisitions\n—\n \n3,851\n \n—\n \n3,851\n \nAdjustments due to finalization of purchase price adjustments\n2\n \n5\n \n—\n \n7\n \nForeign currency translation and other\n388\n \n51\n \n35\n \n474\n \nBalance, December 31, 2023\n22,477\n \n12,221\n \n6,910\n \n41,608\n \nAttributable to 2024 acquisitions\n—\n \n305\n \n—\n \n305\n \nAdjustments due to finalization of purchase price allocations\n—\n \n(\n23\n)\n—\n \n(\n23\n)\nForeign currency translation and other\n(\n1,040\n)\n(\n198\n)\n(\n155\n)\n(\n1,393\n)\nBalance, December 31, 2024\n$\n21,437\n \n$\n12,305\n \n$\n6,755\n \n$\n40,497\n \nFinite-lived intangible assets are amortized over their legal or estimated useful life.  \nThe following summarizes the gross carrying value and accumulated amortization for each major category of intangible assets as of December 31 ($ in millions): \n2024\n2023\n \nGross Carrying\nAmount\nAccumulated\nAmortization\nGross Carrying\nAmount\nAccumulated\nAmortization\nFinite-lived intangibles:\nPatents and technology\n$\n14,781\n \n$\n(\n4,641\n)\n$\n15,175\n \n$\n(\n3,832\n)\nCustomer relationships, trade names and other intangibles\n9,972\n \n(\n4,781\n)\n10,131\n \n(\n4,303\n)\nTotal finite-lived intangibles\n24,753\n \n(\n9,422\n)\n25,306\n \n(\n8,135\n)\nIndefinite-lived intangibles:\nTrademarks and trade names\n3,237\n \n— \n3,575\n \n— \nTotal intangibles\n$\n27,990\n \n$\n(\n9,422\n)\n$\n28,881\n \n$\n(\n8,135\n)\nDuring 2024, the Company acquired finite-lived intangible assets, consisting primarily of developed technology, customer relationships and trade names, with a weighted average life of \n11\n years.  Refer to Note 2 for information on the intangible assets acquired.\nThe Company reviews identified intangible assets for impairment whenever events or changes in circumstances indicate that the related carrying amounts may not be recoverable.  Indefinite-lived intangibles are subject to impairment testing at least annually or more frequently if events or changes in circumstances indicate that potential impairment exists.  \nDuring the third quarter of 2024, the Company concluded that it had an impairment indicator for an indefinite-lived trade name within the genomics consumable business included in the Life Sciences segment.  This determination was primarily the result of softness in the genomics market, including but not limited to the discontinuation of drug development programs announced in the third quarter and weaker demand at some of the business’s larger customers as well as reduced demand due to the reprioritization of drug development programs at other customers.  The Company engaged a third-party valuation specialist to assist in the valuation of the trade name using a relief from royalty method of valuation.  The significant assumptions in the relief from royalty method include, but were not limited to, revenue growth rates (including perpetual growth rates), royalty rates and discount rates.  The Company recorded a noncash impairment \n79\ncharge of $\n222\n million pretax ($\n169\n million after-tax) related to the indefinite-lived trade name for the year ended December 31, 2024.  After recognition of the impairment, the net book value of the trade name was $\n508\n million and the Company continues to monitor for any changes to the business performance or key assumptions.  In connection with the trade name impairment, the Company also tested the related asset group and the related reporting unit goodwill for impairment in the third quarter of 2024, and in both cases the Company identified \nno\n impairment.  In the fourth quarter of 2024, the Company identified impairment triggers for a trade name in the Diagnostics segment and recorded an impairment charge of $\n43\n million.      \nAdditionally, the Company identified impairment triggers in the second quarter of 2023 in the Biotechnology segment and the fourth quarter of 2023 in the Diagnostics and Biotechnology segments which resulted in the impairment of certain long-lived assets, including technology and other assets.  In 2023, the Company recorded impairment charges totaling $\n77\n million.  The 2024 and 2023 impairment charges were recorded in selling, general and administrative expenses in the accompanying Consolidated Statements of Earnings.  During 2022 there were \nno\n impairments of intangible assets.\nTotal intangible amortization expense in 2024, 2023 and 2022 was approximately $\n1.6\n billion, $\n1.5\n billion and $\n1.4\n billion, respectively.  Based on the intangible assets recorded as of December 31, 2024, amortization expense is estimated to be approximately $\n1.6\n billion during 2025, $\n1.6\n billion during 2026, $\n1.5\n billion during 2027, $\n1.5\n billion during 2028 and $\n1.4\n billion during 2029.\nNOTE 11.  \nFAIR VALUE MEASUREMENTS \nAccounting standards define fair value based on an exit price model, establish a framework for measuring fair value where the Company’s assets and liabilities are required to be carried at fair value and provide for certain disclosures related to the valuation methods used within a valuation hierarchy as established within the accounting standards.  This hierarchy prioritizes the inputs into three broad levels as follows.  Level 1 inputs are quoted prices (unadjusted) in active markets for identical assets or liabilities.  Level 2 inputs are quoted prices for similar assets and liabilities in active markets, quoted prices for identical or similar assets in markets that are not active, or other observable characteristics for the asset or liability, including interest rates, yield curves and credit risks, or inputs that are derived principally from, or corroborated by, observable market data through correlation.  Level 3 inputs are unobservable inputs based on the Company’s assumptions.  A financial asset or liability’s classification within the hierarchy is determined based on the lowest level input that is significant to the fair value measurement in its entirety.\nA summary of financial assets that are measured at fair value on a recurring basis were as follows ($ in millions):\nYear Ended December 31\nQuoted Prices in\nActive Market\n(Level 1)\nSignificant Other\nObservable Inputs\n(Level 2)\nSignificant\nUnobservable\nInputs (Level 3)\n2024\n2023\n2024\n2023\n2024\n2023\n2024\n2023\nAssets:\nAvailable-for-sale debt securities\n$\n—\n \n$\n5\n \n$\n—\n \n$\n—\n \n$\n—\n \n$\n5\n \n$\n—\n \n$\n—\n \nInvestment in equity securities\n218\n \n234\n \n3\n \n16\n \n—\n \n—\n \n—\n \n—\n \nCross-currency swap derivative contracts\n415\n \n291\n \n—\n \n—\n \n415\n \n291\n \n—\n \n—\n \nAvailable-for-sale debt securities, which are included in other long-term assets in the accompanying Consolidated Balance Sheets, are measured at fair value using quoted prices reported by investment brokers and dealers based on the underlying terms of the security and comparison to similar securities traded on an active market.  As of December 31, 2023 available-for-sale debt securities primarily included U.S. Treasury Notes and corporate debt securities.\nThe Company’s investments in equity securities consist of investments in publicly traded equity securities and investments in non-marketable equity securities.  The publicly traded securities are classified as Level 1 in the fair value hierarchy as they are measured based on quotes in active markets.  For the non-marketable equity securities, the Company estimates the fair value of the investments using the Fair Value Alternative.  The Company’s investments in these equity securities are not classified in the fair value hierarchy due to the use of these measurement methods.  The Company’s investments in partnerships are accounted for under the equity method of accounting and are not subject to fair value measurement disclosures.  As of both December 31, 2024 and 2023, the Company’s equity method investments included investments in partnerships with a carrying value of approximately $\n1.4\n billion.  During the years ended December 31, 2024, 2023 and 2022, the Company recorded net realized and unrealized losses of $\n57\n million, $\n182\n million and $\n271\n million, respectively, related to changes in the fair value of the Company’s investments in equity securities and the Company’s equity in earnings of the partnerships that reflect the changes in fair value of the investments of the partnerships.  Refer to Note 8 for additional information on gains and losses on the Company’s investments, including investments in the partnerships.  \n80\nThe cross-currency swap derivative contracts are classified as Level 2 in the fair value hierarchy as they are measured using the income approach with the relevant interest rates and current foreign currency exchange rates and forward curves as inputs.  Refer to Note 14 for additional information.\nFair Value of Other Financial Instruments\nThe carrying amounts and fair values of the Company’s other financial instruments as of December 31 were as follows ($ in millions):\n2024\n2023\nCarrying Amount\nFair Value\nCarrying Amount\nFair Value\nDebt obligations:\nNotes payable and current portion of long-term debt\n$\n505\n \n$\n502\n \n$\n1,695\n \n$\n1,672\n \nLong-term debt\n15,500\n \n13,109\n \n16,707\n \n14,415\n \nAs of December 31, 2024 and 2023, short and long-term borrowings were categorized as Level 1.  The fair value of long-term borrowings was based on quoted market prices.  The difference between the fair value and the carrying amounts of long-term borrowings is attributable to changes in market interest rates and/or the Company’s credit ratings subsequent to the incurrence of the borrowing.  The fair values of borrowings with original maturities of one year or less, as well as cash and cash equivalents, trade accounts receivable, net and trade accounts payable generally approximate their carrying amounts due to the short-term maturities of these instruments.\nRefer to Note 15 for information related to the fair value of the Company sponsored defined benefit pension plan assets.\nNOTE 12.  \nACCRUED EXPENSES AND OTHER LIABILITIES \nAccrued expenses and other liabilities as of December 31 were as follows ($ in millions):\n \n2024\n2023\n \nCurrent\nNoncurrent\nCurrent\nNoncurrent\nCompensation and benefits\n$\n1,101\n \n$\n289\n \n$\n1,127\n \n$\n254\n \nPension and postretirement benefits\n56\n \n560\n \n57\n \n544\n \nTaxes, income and other\n568\n \n3,138\n \n582\n \n3,428\n \nContract liabilities\n1,299\n \n232\n \n1,465\n \n249\n \nSales and product allowances\n185\n \n6\n \n155\n \n6\n \nOperating lease liabilities\n173\n \n968\n \n180\n \n954\n \nContract settlement financing payable\n75\n \n287\n \n75\n \n354\n \nOther\n1,083\n \n214\n \n1,172\n \n228\n \nTotal\n$\n4,540\n \n$\n5,694\n \n$\n4,813\n \n$\n6,017\n \n81\nNOTE 13.  \nFINANCING \nThe components of the Company’s debt as of December 31 were as follows (amounts in millions):\nOutstanding Amount\nDescription and Aggregate Principal Amount\n2024\n2023\nEuro-denominated commercial paper (€\n931\n million and €\n929\n million, respectively)\n(e)\n$\n965\n \n$\n1,026\n \n1.7\n% senior unsecured notes due 3/30/2024 (€\n900\n million) (the “2024 Euronotes”)\n(f)\n—\n \n993\n \n2.2\n% senior unsecured notes due 11/15/2024 ($\n700\n million) (the “2024 Biopharma Notes”)\n(b)\n—\n \n699\n \n3.35\n% senior unsecured notes due 9/15/2025 ($\n500\n million) (the “2025 U.S. Notes”)\n(f)\n500\n \n499\n \n0.2\n% senior unsecured notes due 3/18/2026 (€\n1.3\n billion) (the “2026 Biopharma Euronotes”)\n(b)\n1,293\n \n1,376\n \n2.1\n% senior unsecured notes due 9/30/2026 (€\n800\n million) (the “2026 Euronotes”)\n(f)\n828\n \n881\n \n0.3\n% senior unsecured notes due 5/11/2027 (¥\n30.8\n billion) (the “2027 Yen Notes”)\n(d)\n195\n \n218\n \n1.2\n% senior unsecured notes due 6/30/2027 (€\n600\n million) (the “2027 Euronotes”)\n(a)\n620\n \n660\n \n0.45\n% senior unsecured notes due 3/18/2028 (€\n1.3\n billion) (the “2028 Biopharma Euronotes”)\n(b)\n1,291\n \n1,374\n \n1.125\n% senior unsecured bonds due 12/08/2028 (CHF \n210\n million) (the “2028 CHF Bonds”)\n(c)\n233\n \n252\n \n2.6\n% senior unsecured notes due 11/15/2029 ($\n800\n million) (the “2029 Biopharma Notes”)\n(b)\n797\n \n797\n \n2.5\n% senior unsecured notes due 3/30/2030 (€\n800\n million) (the “2030 Euronotes”)\n(f)\n829\n \n883\n \n0.75\n% senior unsecured notes due 9/18/2031 (€\n1.8\n billion) (the “2031 Biopharma Euronotes”)\n(b)\n1,805\n \n1,923\n \n0.65\n% senior unsecured notes due 5/11/2032 (¥\n53.2\n billion) (the “2032 Yen Notes”)\n(d)\n337\n \n376\n \n1.35\n% senior unsecured notes due 9/18/2039 (€\n1.3\n billion) (the “2039 Biopharma Euronotes”)\n(b)\n1,282\n \n1,365\n \n3.25\n% senior unsecured notes due 11/15/2039 ($\n900\n million) (the “2039 Biopharma Notes”)\n(b)\n892\n \n891\n \n4.375\n% senior unsecured notes due 9/15/2045 ($\n500\n million) (the “2045 U.S. Notes”)\n(f)\n499\n \n499\n \n1.8\n% senior unsecured notes due 9/18/2049 (€\n750\n million) (the “2049 Biopharma Euronotes”)\n(b)\n769\n \n819\n \n3.4\n% senior unsecured notes due 11/15/2049 ($\n900\n million) (the “2049 Biopharma Notes”)\n(b)\n890\n \n890\n \n2.6\n% senior unsecured notes due 10/01/2050 ($\n1.0\n billion) (the “2050 U.S. Notes”)\n(f)\n982\n \n981\n \n2.8\n% senior unsecured notes due 12/10/2051 ($\n1.0\n billion) (the “2051 U.S. Notes”)\n(f)\n985\n \n984\n \nOther\n13\n \n16\n \nTotal debt\n16,005\n \n18,402\n \nLess: currently payable\n(\n505\n)\n(\n1,695\n)\nLong-term debt\n$\n15,500\n \n$\n16,707\n \n(a)\n Issued by DH Europe Finance S.A. (“Danaher International”). \n(b)\n Issued by DH Europe Finance II S.a.r.l. (“Danaher International II”).\n(c)\n Issued by DH Switzerland Finance S.A. (“Danaher Switzerland”).\n(d) \nIssued by DH Japan Finance S.A. (“Danaher Japan”).\n(e) \nIssued by Danaher Corporation or Danaher International II.\n(f) \nIssued by Danaher Corporation.\nDebt discounts, premiums and debt issuance and other related costs totaled $\n96\n million and $\n107\n million as of December 31, 2024 and 2023, respectively, and have been netted against the aggregate principal amounts of the related debt in the components of debt table above.\nCommercial Paper Programs and Credit Facilities\nOn August 11, 2023, the Company replaced its existing $\n5.0\n billion unsecured, multiyear revolving credit facility with a third amended and restated $\n5.0\n billion unsecured, multiyear revolving credit facility (the “Credit Facility”) with a syndicate of lenders.  The Credit Facility expires on August 11, 2028, subject to a \none-year\n extension option at the request of the Company with the consent of the lenders.  The Credit Facility also contains an expansion option permitting the Company to request up to five increases of up to an aggregate additional $\n2.5\n billion from lenders that elect to make such increase available, upon the satisfaction of certain conditions.  \nNo\n borrowings were outstanding under the superseded credit facility at the time it was replaced with the Credit Facility.\n82\nThe Company expects to limit borrowings under the Credit Facility to amounts that would leave sufficient borrowing capacity under the facility so that it could borrow, if needed, to repay all of the outstanding commercial paper as it matures.\nBorrowings under the Credit Facility bear interest as follows: (i) in the case of borrowings denominated in U.S. dollars, (1) Term Secured Overnight Financing Rate (“SOFR”) Loans (as defined in the Credit Facility) bear interest at a variable rate equal to the Term SOFR (as defined in the Credit Facility) plus a margin of between \n58.5\n and \n101.5\n basis points, depending on Danaher’s long-term debt credit rating; (2) Base Rate Committed Loans and Swing Line Loans (each as defined in the Credit Facility) bear interest at a variable rate equal to the highest of (a) the Federal funds rate (as published by the Federal Reserve Bank of New York from time to time) plus 1/2 of 1%, (b) Bank of America’s “prime rate” as publicly announced from time to time, (c) Term SOFR (based on a one-month interest period) plus \n1\n% and (d) \n1\n%, plus in each case a margin of between \n0\n to \n1.5\n basis points depending on Danaher’s long-term debt credit rating; and (ii) in the case of borrowings denominated in an Alternative Currency (as defined in the Credit Facility), Alternative Currency Loans and Swing Line Loans (each as defined in the Credit Facility) bear interest at the applicable variable benchmark rate plus, in each case, a margin of between \n58.5\n and \n101.5\n basis points, depending on Danaher’s long-term debt credit rating.  In no event will Term SOFR Loans, Swing Line Loans or Alternative Currency Loans bear interest at a rate lower than \n0.0\n%.  In addition, Danaher is required to pay a per annum facility fee of between \n4.0\n and \n11.0\n basis points (depending on Danaher’s long-term debt credit rating) based on the aggregate commitments under the Credit Facility, regardless of usage.\nThe Credit Facility requires the Company to maintain a Consolidated Leverage Ratio (as defined in the Credit Facility) of \n0.65\n to 1.00 or less.  Borrowings under the Credit Facility are prepayable at the Company’s option at any time in whole or in part without premium or penalty.  As of December 31, 2024, \nno\n borrowings were outstanding under the Credit Facility and the Company was in compliance with all covenants under the facility.  The nonperformance by any member of the Credit Facility syndicate would reduce the maximum capacity of the Credit Facility by such member’s commitment amount.\nThe Company’s obligations under the Credit Facility are unsecured.  The Company has unconditionally and irrevocably guaranteed the obligations of each of its subsidiaries in the event a subsidiary is named a borrower under the Credit Facility.  The Credit Facility contains customary representations, warranties, conditions precedent, events of default, indemnities and affirmative and negative covenants.  The Credit Facility is available for liquidity support for Danaher’s U.S. dollar and euro-denominated commercial paper programs, as discussed below, and for general corporate purposes.\nUnder the Company’s U.S. dollar and euro-denominated commercial paper programs, the Company or a subsidiary of the Company, as applicable, may issue and sell unsecured, short-term promissory notes.  The notes are typically issued at a discount from par, generally based on the ratings assigned to the Company by credit rating agencies at the time of the issuance and prevailing market rates.  The Credit Facility provides liquidity support for issuances under the Company’s commercial paper programs, and can also be used for working capital and other general corporate purposes.  The availability of the Credit Facility as a standby liquidity facility to repay maturing commercial paper is an important factor in maintaining the existing credit ratings of the Company’s commercial paper programs.  As commercial paper obligations mature, the Company may issue additional short-term commercial paper obligations to refinance all or part of these borrowings.  As of December 31, 2024, borrowings outstanding under the Company’s euro-denominated commercial paper programs had a weighted average annual interest rate of \n3.3\n% and a weighted average remaining maturity of approximately \n34\n days.  As of  December 31, 2024, the Company has classified $\n965\n million of its borrowings outstanding under the euro-denominated commercial paper programs as long-term debt in the accompanying Consolidated Balance Sheet (even though such borrowings are scheduled to mature within one year of December 31, 2024) as the Company had the intent and ability, as supported by availability under the Credit Facility, to refinance these borrowings for at least one year from the balance sheet date.  \nThe Company’s ability to access the commercial paper market, and the related costs of these borrowings, is affected by the strength of the Company’s credit rating and market conditions.  Any downgrade in the Company’s credit rating would increase the cost of borrowings under the Company’s commercial paper program and the Credit Facility, and could limit or preclude the Company’s ability to issue commercial paper.  If the Company’s access to the commercial paper market is adversely affected due to a credit downgrade, change in market conditions or otherwise, the Company expects it would rely on a combination of available cash, operating cash flow, the Credit Facility and any other available sources of financing to provide short-term funding.  In such event, the cost of borrowings under the Credit Facility or other available sources of financing could be higher than the cost of commercial paper borrowings.\n83\nCovenants and Redemption Provisions Applicable to Notes\nWith respect to the 2027 and 2032 Yen Notes; the 2024 (prior to their repayment in the second quarter of 2024), 2026, 2027 and 2030 Euronotes; the 2025, 2045, 2050 and 2051 U.S. Notes; the 2024 (prior to their repayment in the fourth quarter of 2024), 2029, 2039 and 2049 Biopharma Notes; and the 2026, 2028, 2031, 2039 and 2049 Biopharma Euronotes, at any time prior to the applicable maturity date, the Company may redeem the applicable series of notes in whole or in part, by paying the principal amount, accrued and unpaid interest and, until the par call date specified in the applicable indenture or comparable governing document, the “make-whole” premium specified therein (and in the case of the Yen Notes, net of certain swap-related gains or losses as applicable).  With respect to the 2028 CHF Bonds, at any time after \n85\n% or more of the bonds have been redeemed or purchased and canceled, the Company may redeem some or all of the remaining bonds for their principal amount plus accrued and unpaid interest.  With respect to the 2027 and 2032 Yen Notes; 2026, 2027 and 2030 Euronotes; the 2028 CHF Bonds; and the 2026, 2028, 2031, 2039 and 2049 Biopharma Euronotes, the Company may redeem such notes and bonds upon the occurrence of specified, adverse changes in tax laws, or interpretations under such laws, at a redemption price equal to the principal amount of the bonds to be redeemed.\nIf a change of control triggering event occurs with respect to any of the 2027 and 2032 Yen Notes; the 2026, 2027 and 2030 Euronotes; the 2025, 2045, 2050 and 2051 U.S. Notes; the 2028 CHF Bonds; the 2029, 2039 and 2049 Biopharma Notes; or the 2026, 2028, 2031, 2039 and 2049 Biopharma Euronotes, each holder of such notes may require the Company to repurchase some or all of such notes and bonds at a purchase price equal to \n101\n% (\n100\n% in the case of the 2027 and 2032 Yen Notes) of the principal amount of the notes and bonds, plus accrued and unpaid interest (and in the case of the Yen Notes, certain swap-related losses as applicable).  A change of control triggering event means the occurrence of both a change of control and a rating event, each as defined in the applicable indenture or comparable governing document.  Except in connection with a change of control triggering event, the Company does not have any credit rating downgrade triggers that would accelerate the maturity of a material amount of outstanding debt.  Each holder of the 2027 and 2032 Yen Notes may also require the Company to repurchase some or all of its notes at a purchase price equal to \n100\n% of the principal amount of the notes, plus accrued and unpaid interest and certain swap-related losses as applicable, in certain circumstances whereby such holder comes into violation of economic sanctions laws as a result of holding such notes.\nThe respective indentures or comparable governing documents under which the above-described notes and bonds were issued contain customary covenants including, for example, limits on the incurrence of secured debt and sale-leaseback transactions.  None of these covenants are considered restrictive to the Company’s operations and as of December 31, 2024, the Company was in compliance with all of its debt covenants.\nLong-Term Indebtedness Related to the Veralto Separation\nIn September 2023, the Company received net cash distributions of approximately $\n2.6\n billion from the Veralto Distribution.  Veralto financed these cash payments through the issuance of approximately $\n2.6\n billion of debt, consisting of $\n700\n million aggregate principal amount of \n5.50\n% senior unsecured bonds due 2026, $\n700\n million aggregate principal amount of \n5.35\n% senior unsecured bonds due 2028, $\n700\n million aggregate principal amount of \n5.45\n% senior unsecured bonds due 2033 and €\n500\n million aggregate principal amount of \n4.15\n% senior unsecured bonds due 2031 (collectively, the “Veralto Debt”).  Danaher initially guaranteed the Veralto Debt, and the guarantee automatically terminated effective as of the Distribution Date.  As of September 30, 2023 in connection with the Separation, the Veralto Debt was solely an obligation of Veralto and is no longer reflected in the Company’s Consolidated Financial Statements.\nLong-Term Debt Repayments\nOn November 15, 2024, the Company repaid the $\n700\n million 2024 Biopharma Notes upon their maturity using available cash.  The €\n900\n million aggregate principal amount of the 2024 Euronotes were repaid upon their maturity on April 2, 2024 using cash distributions from Veralto prior to the Separation.  The CHF \n540\n million aggregate principal amount of the 2023 CHF Bonds were repaid upon their maturity on December 8, 2023.  On June 30, 2022, the Company repaid the €\n250\n million aggregate principal amount of the floating rate senior unsecured notes and on November 15, 2022 the Company repaid the €\n700\n million aggregate principal amount of the \n2.05\n% senior unsecured notes upon their maturity using available cash and the proceeds from the issuance of commercial paper.  \nGuarantors of Debt\nThe Company has guaranteed long-term debt and commercial paper issued by certain of its wholly-owned finance subsidiaries: Danaher International, Danaher International II, Danaher Switzerland and Danaher Japan.  All of the outstanding and future securities issued by each of these entities are or will be fully and unconditionally guaranteed by the Company and these guarantees rank on parity with the Company’s unsecured and unsubordinated indebtedness\n.\n84\nOther\nThe Company’s minimum principal payments for the next five years are as follows ($ in millions):\n2025\n$\n505\n \n2026\n2,113\n \n2027\n809\n \n2028\n2,484\n \n2029\n794\n \nThereafter\n9,300\n \nThe Company made interest payments of $\n370\n million, $\n392\n million and $\n347\n million in 2024, 2023 and 2022, respectively.  Interest payments decreased in 2024 due primarily to lower outstanding debt balances, partially offset by higher average interest rates on the Company’s euro denominated commercial paper borrowings in 2024 compared to 2023.\n \nNOTE 14.  \nHEDGING TRANSACTIONS AND DERIVATIVE FINANCIAL INSTRUMENTS \nThe Company uses cross-currency swap derivative contracts to partially hedge its net investments in non-U.S. operations against adverse movements in exchange rates between the U.S. dollar and the Danish kroner, Japanese yen, euro and Swiss franc.  These contracts are agreements to exchange fixed-rate payments in one currency for fixed-rate payments in another currency and effectively convert U.S. dollar-denominated bonds to obligations denominated in the hedged currency.  These contracts also reduce the interest rate from the stated interest rates on the U.S. dollar-denominated debt to the interest rates of the swaps.  The changes in the spot rate of these instruments are recorded in accumulated other comprehensive income (loss) (“OCI”) in stockholders’ equity, partially offsetting the foreign currency translation adjustment of the Company’s related net investment that is also recorded in accumulated OCI.  The interest income or expense from these swaps are recorded in interest expense in the accompanying Consolidated Statements of Earnings consistent with the classification of interest expense attributable to the underlying debt.  These instruments mature on dates ranging from September 2025 to December 2031.\nThe Company also uses cross-currency swap derivative contracts to hedge U.S. dollar-denominated long-term debt issuances in a foreign subsidiary whose functional currency is the euro against adverse movements in exchange rates.  These contracts effectively convert these U.S. dollar-denominated bonds to obligations denominated in euro.  The changes in the fair value of these instruments are recorded in accumulated OCI and are subsequently reclassified to net earnings to offset the remeasurement of the hedged debt that is also recorded in net earnings.  The interest income or expense from these swaps are recorded in interest expense in the accompanying Consolidated Statements of Earnings consistent with the classification of interest expense attributable to the underlying debt.  These instruments mature on dates ranging from November 2029 to November 2049.\nThe Company has also issued foreign currency denominated long-term debt as partial hedges of its net investments in foreign operations against adverse movements in exchange rates between the U.S. dollar and the euro, Japanese yen and Swiss franc.  These debt issuances are designated and qualify as nonderivative hedging instruments.  Accordingly, the foreign currency translation of these debt instruments is recorded in accumulated OCI, offsetting the foreign currency translation adjustment of the Company’s related net investment that is also recorded in accumulated OCI.  These instruments mature on dates ranging from September 2026 to May 2032.\nThe Company used interest rate swap agreements to hedge the variability in cash flows due to changes in benchmark interest rates related to a portion of the debt the Company issued.  These contracts effectively fixed the interest rate for a portion of the Company’s debt equal to the notional amount of the swaps to the rate specified in the interest rate swap agreements and were settled in November 2019 and December 2021.  The changes in the fair value of these instruments were recorded in accumulated OCI prior to the issuance of the debt and are subsequently being reclassified to interest expense over the life of the related debt.\n85\nThe following table summarizes the notional values as of December 31, 2024 and 2023 and pretax impact of changes in the fair values of instruments designated as net investment hedges and cash flow hedges in accumulated OCI for the year then ended ($ in millions):\nOriginal Notional Amount\nNotional Amount Outstanding\nGain (Loss) Recognized in OCI\nAmounts Reclassified from OCI\nYear ended December 31, 2024:\nNet investment hedges:\nCross-currency contracts\n$\n3,875\n \n$\n3,000\n \n$\n128\n \n$\n—\n \nForeign currency denominated debt\n3,042\n \n3,042\n \n249\n \n—\n \nCash flow hedges:\nCross-currency contracts\n4,000\n \n2,600\n \n(\n4\n)\n(\n111\n)\nInterest rate swaps\n1,600\n \n—\n \n—\n \n3\n \nTotal\n$\n12,517\n \n$\n8,642\n \n$\n373\n \n$\n(\n108\n)\nYear ended December 31, 2023:\nNet investment hedges:\nCross-currency contracts\n$\n3,875\n \n$\n3,000\n \n$\n(\n148\n)\n$\n—\n \nForeign currency denominated debt\n4,263\n \n4,263\n \n(\n102\n)\n—\n \nCash flow hedges:\nCross-currency contracts\n4,000\n \n3,300\n \n(\n214\n)\n107\n \nInterest rate swaps\n1,600\n \n—\n \n—\n \n3\n \nTotal\n$\n13,738\n \n$\n10,563\n \n$\n(\n464\n)\n$\n110\n \nGains or losses related to the net investment hedges are classified as foreign currency translation adjustments in the schedule of changes in OCI in Note 18, as these items are attributable to the Company’s hedges of its net investment in foreign operations.  Gains or losses related to the cash flow hedges are classified as cash flow hedge adjustments in the schedule of changes in OCI in Note 18.  The amount reclassified from OCI for the cross-currency swap derivative contracts that are cash flow hedges of the Company’s U.S. dollar-denominated debt was equal to the remeasurement amount recorded in the period on the hedged debt. \nThe Company did not reclassify any other deferred gains or losses related to net investment hedges or cash flow hedges from accumulated OCI to earnings during the years ended December 31, 2024 and 2023.  In addition, the Company did not have any ineffectiveness related to net investment hedges or cash flow hedges during the years ended December 31, 2024 and 2023.  Should any ineffectiveness arise, any ineffective portions of the hedges would be reclassified from accumulated OCI into earnings during the period of change.  The cash inflows and outflows associated with the Company’s derivative contracts designated as net investment hedges are classified in all other investing activities in the accompanying Consolidated Statements of Cash Flows.  The cash inflows and outflows associated with the Company’s derivative contracts designated as cash flow hedges are classified in cash flows from operating activities in the accompanying Consolidated Statements of Cash Flows.\nThe Company’s derivative instruments, as well as its nonderivative debt instruments designated and qualifying as net investment hedges, were classified as of December 31 in the Company’s Consolidated Balance Sheets as follows ($ in millions):\n2024\n2023\nDerivative assets:\nOther long-term assets\n$\n415\n \n$\n291\n \nNonderivative hedging instruments:\nNotes payable and current portion of long-term debt\n—\n \n993\n \nLong-term debt\n3,042\n \n3,270\n \nAmounts related to the Company’s derivatives expected to be reclassified from accumulated OCI to net earnings during the next 12 months, if interest rates and foreign exchange rates remain unchanged, are not significant.\n86\nNOTE 15.  \nPENSION AND OTHER POSTRETIREMENT EMPLOYEE BENEFIT PLANS \nThe Company has noncontributory defined benefit pension plans which cover certain of its U.S. employees.  During 2012, all remaining benefit accruals under the U.S. plans ceased.  Defined benefit plans from acquisitions subsequent to 2012 are ceased as soon as practical.  The Company also has noncontributory defined benefit pension plans which cover certain of its non-U.S. employees, and under certain of these plans, benefit accruals continue.  In general, the Company’s policy is to fund these plans based on considerations relating to legal requirements, underlying asset returns, the plan’s funded status, the anticipated tax deductibility of the contribution, local practices, market conditions, interest rates and other factors.  In addition to providing pension benefits, the Company provides certain healthcare and life insurance benefits for some of its retired employees in the United States.  Certain employees may become eligible for these benefits as they reach normal retirement age while working for the Company.\nThe following sets forth the funded status of the U.S. pension, non-U.S. pension and postretirement benefit plans as of the most recent actuarial valuations using measurement dates of December 31 ($ in millions):\n \nU.S. Pension Benefits\nNon-U.S. Pension Benefits\nPostretirement Benefits\n \n2024\n2023\n2024\n2023\n2024\n2023\nChange in pension benefit obligation:\nBenefit obligation at beginning of year\n$\n(\n1,858\n)\n$\n(\n1,909\n)\n$\n(\n1,349\n)\n$\n(\n1,168\n)\n$\n(\n98\n)\n$\n(\n101\n)\nService cost\n—\n \n—\n \n(\n32\n)\n(\n30\n)\n—\n \n—\n \nInterest cost\n(\n90\n)\n(\n97\n)\n(\n45\n)\n(\n46\n)\n(\n4\n)\n(\n5\n)\nEmployee/retiree contributions\n—\n \n—\n \n(\n8\n)\n(\n7\n)\n(\n2\n)\n(\n1\n)\nBenefits and other expenses paid\n152\n \n155\n \n50\n \n47\n \n12\n \n12\n \nActuarial gain (loss) \n47\n \n(\n52\n)\n29\n \n(\n99\n)\n—\n \n(\n3\n)\nAmendments, settlements and curtailments\n46\n \n45\n \n16\n \n13\n \n—\n \n—\n \nForeign exchange rate impact and other\n—\n \n—\n \n36\n \n(\n59\n)\n—\n \n—\n \nBenefit obligation at end of year\n(\n1,703\n)\n(\n1,858\n)\n(\n1,303\n)\n(\n1,349\n)\n(\n92\n)\n(\n98\n)\nChange in plan assets:\nFair value of plan assets at beginning of year\n1,889\n \n1,857\n \n815\n \n772\n \n—\n \n—\n \nActual return on plan assets\n214\n \n222\n \n(\n14\n)\n24\n \n—\n \n—\n \nEmployer contributions\n8\n \n10\n \n37\n \n36\n \n11\n \n11\n \nEmployee contributions\n—\n \n—\n \n8\n \n7\n \n1\n \n1\n \nAmendments and settlements\n(\n45\n)\n(\n45\n)\n(\n13\n)\n(\n13\n)\n—\n \n—\n \nBenefits and other expenses paid\n(\n152\n)\n(\n155\n)\n(\n50\n)\n(\n47\n)\n(\n12\n)\n(\n12\n)\nForeign exchange rate impact and other\n—\n \n—\n \n(\n4\n)\n36\n \n—\n \n—\n \nFair value of plan assets at end of year\n1,914\n \n1,889\n \n779\n \n815\n \n—\n \n—\n \nFunded status\n$\n211\n \n$\n31\n \n$\n(\n524\n)\n$\n(\n534\n)\n$\n(\n92\n)\n$\n(\n98\n)\nThe largest contributor to the net actuarial gains affecting the benefit obligations in 2024 U.S. pension, non-U.S. pension plans is increases in the discount rates compared to the rates in the prior year.  \nProjected benefit obligation (“PBO”) and fair value of plan assets for pension plans and postretirement benefit plans with PBO’s in excess of plan assets ($ in millions):\nU.S. Pension Benefits\nNon-U.S. Pension Benefits\nPostretirement Benefits\n2024\n2023\n2024\n2023\n2024\n2023\nProjected benefit obligation\n$\n85\n \n$\n92\n \n$\n865\n \n$\n977\n \n$\n92\n \n$\n98\n \nFair value of plan assets\n—\n \n—\n \n276\n \n360\n \n—\n \n—\n \n87\nAccumulated benefit obligation (“ABO”) and fair value of plan assets for pension plans with ABO’s in excess of plan assets ($ in millions):\nU.S. Pension Benefits\nNon-U.S. Pension Benefits\n2024\n2023\n2024\n2023\nAccumulated benefit obligation\n$\n85\n \n$\n92\n \n$\n803\n \n$\n914\n \nFair value of plan assets\n—\n \n—\n \n271\n \n357\n \nWeighted average assumptions used to determine benefit obligations at date of measurement:\n \nU.S. Pension Benefits\nNon-U.S. Pension Benefits\nPostretirement Benefits\n \n2024\n2023\n2024\n2023\n2024\n2023\nDiscount rate\n5.6\n \n%\n5.1\n \n%\n3.5\n \n%\n3.5\n \n%\n5.5\n \n%\n5.1\n \n%\nRate of compensation increase\nN/A\nN/A\n2.9\n \n%\n3.1\n \n%\nN/A\nN/A\nIn 2024, the medical trend rate used to determine the postretirement benefit obligation was \n7.7\n%.  The rate decreases gradually to an ultimate rate of \n4.0\n% by 2049 and remains at that level thereafter.  In 2023, the medical trend rate used to determine the postretirement benefit obligation was \n5.9\n%, gradually decreasing to an ultimate rate of \n4.0\n% by 2048 and remaining at that level thereafter.  The trend rate is a significant factor in determining the amounts reported.\nComponents of net periodic pension and postretirement benefit (cost) ($ in millions):\n \nU.S. Pension Benefits\nNon-U.S. Pension Benefits\nPostretirement Benefits\n2024\n2023\n2024\n2023\n2024\n2023\nService cost\n$\n—\n \n$\n—\n \n$\n(\n32\n)\n$\n(\n30\n)\n$\n—\n \n$\n—\n \nInterest cost\n(\n90\n)\n(\n97\n)\n(\n45\n)\n(\n46\n)\n(\n4\n)\n(\n5\n)\nExpected return on plan assets\n121\n \n124\n \n31\n \n33\n \n—\n \n—\n \nAmortization of prior service (cost) credit\n(\n1\n)\n(\n1\n)\n1\n \n1\n \n2\n \n2\n \nAmortization of net (loss) gain\n(\n13\n)\n(\n12\n)\n—\n \n7\n \n—\n \n—\n \nCurtailment and settlement (losses) gains recognized\n—\n \n—\n \n(\n1\n)\n1\n \n—\n \n—\n \nNet periodic pension benefit (cost)\n$\n17\n \n$\n14\n \n$\n(\n46\n)\n$\n(\n34\n)\n$\n(\n2\n)\n$\n(\n3\n)\nThe components of the net periodic benefit (cost) of the noncontributory defined benefit pension plans and other postretirement employee benefit plans other than service cost are included in other income (expense), net in the accompanying Consolidated Statements of Earnings.  Actuarial gains and losses are amortized using a corridor approach.  The gain/loss corridor is equal to \n10\n% of the greater of the benefit obligation and the market-related value of assets.  Actuarial gains and losses in the pension and postretirement benefits plans in excess of the corridor are amortized over the average remaining life expectancy of the plan participants.\nWeighted average assumptions used to determine net periodic pension benefit (cost) at date of measurement:\n \nU.S. Plans\nNon-U.S. Plans\n \n2024\n2023\n2024\n2023\nDiscount rate\n5.1\n \n%\n5.4\n \n%\n3.5\n \n%\n4.0\n \n%\nExpected long-term return on plan assets\n6.8\n \n%\n6.8\n \n%\n4.2\n \n%\n4.6\n \n%\nRate of compensation increase\nN/A\nN/A\n3.1\n \n%\n3.0\n \n%\nThe discount rate reflects the market rate on December 31 of the prior year for high-quality fixed-income investments with maturities corresponding to the Company’s benefit obligations and is subject to change each year.  For non-U.S. pension plans, rates appropriate for each plan are determined based on investment-grade instruments with maturities approximately equal to the average expected benefit payout under the plan. \nIncluded in accumulated other comprehensive income (loss) as of December 31, 2024 are the following amounts that have not yet been recognized in net periodic pension cost: unrecognized prior service credit of $\n4\n million ($\n3\n million, after-tax) and unrecognized actuarial losses of approximately $\n399\n million ($\n303\n million, after-tax).  The unrecognized losses and prior service cost, net, is calculated as the difference between the actuarially determined projected benefit obligation and the value of the plan assets less accrued pension costs as of December 31, 2024.  \n88\nIncluded in accumulated other comprehensive income (loss) as of December 31, 2024 are the following amounts that have not yet been recognized in net periodic postretirement benefit cost: unrecognized prior service credits of $\n6\n million ($\n4\n million, after-tax) and unrecognized actuarial losses of $\n6\n million ($\n4\n million, after-tax).  The unrecognized losses and prior service credits, net, is calculated as the difference between the actuarially determined projected benefit obligation and the value of the plan assets less accrued benefit costs as of December 31, 2024.  \nSelection of Expected Rate of Return on Assets\nFor the years ended December 31, 2024, 2023 and 2022, the Company used an expected long-term rate of return assumption of \n6.8\n% for its U.S. defined benefit pension plan.  The Company intends to use an expected long-term rate of return assumption of \n6.8\n% for 2025 for such plan.  This expected rate of return reflects the asset allocation of the plan, and is based primarily on broad, publicly-traded equity and fixed-income indices and forward-looking estimates of active portfolio and investment management.  Long-term rate of return on asset assumptions for the non-U.S. plans were determined on a plan-by-plan basis based on the composition of assets and ranged from \n0.8\n% to \n7.0\n% in 2024 and \n0.8\n% to \n6.8\n% in 2023, with a weighted average rate of return assumption of \n4.2\n% in 2024 and \n4.6\n% in 2023.  \nPension Plan Assets\nThe U.S. pension plan’s goal is to maintain between \n60\n% and \n70\n% of its assets in equity portfolios, which are invested in individual equity securities or funds that are expected to mirror broad market returns for equity securities or in assets with characteristics similar to equity investments, such as venture capital funds and partnerships.  Asset holdings are periodically rebalanced when equity holdings are outside this range.  The balance of the U.S. plan asset portfolio is invested in bond funds, real estate funds, various absolute and real return funds and private equity funds.  Non-U.S. plan assets are invested in various insurance contracts, equity and debt securities as determined by the administrator of each plan.  The value of the plan assets directly affects the funded status of the Company’s pension plans recorded in the Consolidated Financial Statements.\nThe Company has certain investments that are valued using Net Asset Value (“NAV”) as the practical expedient.  In addition, certain of the investments valued using NAV as the practical expedient have limits on their redemption to monthly, quarterly, semiannually or annually and require up to \n90\n days prior written notice.  These investments valued using NAV consist of mutual funds, venture capital funds, partnerships, real estate, and other private investments, which allow the Company to allocate investments across a broad array of types of funds and diversify the portfolio.  \nThe fair values of the Company’s pension plan assets for both the U.S. and non-U.S. plans as of December 31, 2024 and 2023, by asset category were as follows ($ in millions):\nQuoted Prices in Active Market (Level 1)\nSignificant Other Observable Inputs (Level 2)\nSignificant Unobservable Inputs (Level 3)\nTotal\n2024\n2023\n2024\n2023\n2024\n2023\n2024\n2023\nCash and equivalents\n$\n209\n \n$\n116\n \n$\n—\n \n$\n—\n \n$\n—\n \n$\n—\n \n$\n209\n \n$\n116\n \nEquity securities:\nCommon stock\n276\n \n410\n \n—\n \n—\n \n—\n \n—\n \n276\n \n410\n \nPreferred stock\n1\n \n—\n \n—\n \n—\n \n—\n \n—\n \n1\n \n—\n \nFixed income securities:\nCorporate bonds\n—\n \n—\n \n252\n \n278\n \n—\n \n—\n \n252\n \n278\n \nGovernment issued\n—\n \n—\n \n24\n \n25\n \n—\n \n—\n \n24\n \n25\n \nMutual funds\n118\n \n112\n \n164\n \n167\n \n—\n \n—\n \n282\n \n279\n \nInsurance contracts\n—\n \n—\n \n268\n \n236\n \n—\n \n—\n \n268\n \n236\n \nTotal\n$\n604\n \n$\n638\n \n$\n708\n \n$\n706\n \n$\n—\n \n$\n—\n \n1,312\n \n1,344\n \nInvestments measured at NAV\n(a)\n:\nCommon/collective trusts\n1,013\n \n906\n \nVenture capital, partnerships and other private investments\n368\n \n454\n \nTotal assets at fair value\n$\n2,693\n \n$\n2,704\n \n(a)    \nThe fair value amounts presented in the table above are intended to permit reconciliation of the fair value hierarchy to the total plan assets.\n89\nCommon stock traded on an active market, as well as mutual funds are valued at the quoted closing price reported on the active market on which the individual securities are traded.  Common stock, corporate bonds, U.S. government securities and mutual funds that are not traded on an active market are valued at quoted prices reported by investment brokers and dealers based on the underlying terms of the security and comparison to similar securities traded on an active market.  Insurance contracts are valued based upon the quoted prices of the underlying investments with the insurance company.\nCommon/collective trusts are valued based on the plan’s interest, represented by investment units, in the underlying investments held within the trust that are traded in an active market by the trustee.  \nVenture capital, partnerships and other private investments are valued using the NAV based on the information provided by the asset fund managers, which reflects the plan’s share of the fair value of the net assets of the investment.  Depending on the nature of the assets, the underlying investments are valued using a combination of either discounted cash flows, earnings and market multiples, third-party appraisals or through reference to the quoted market prices of the underlying investments held by the venture, partnership or private entity where available.  Valuation adjustments reflect changes in operating results, financial condition, or prospects of the applicable portfolio company.\nThe methods described above may produce a fair value estimate that may not be indicative of net realizable value or reflective of future fair values.  Furthermore, while the Company believes the valuation methods are appropriate and consistent with the methods used by other market participants, the use of different methodologies or assumptions to determine the fair value of certain financial instruments could result in a different fair value measurement at the reporting date.\nExpected Contributions\nDuring 2025, the Company’s cash contribution requirements for its U.S. and its non-U.S. defined benefit pension plans are expected to be approximately $\n8\n million and $\n35\n million, respectively.  During 2025, the Company’s cash contribution requirements for its other postretirement benefit plans are expected to be approximately $\n13\n million.  The ultimate amounts to be contributed depend upon, among other things, legal requirements, underlying asset returns, the plan’s funded status, the anticipated tax deductibility of the contributions, local practices, market conditions, interest rates and other factors.\nThe following sets forth benefit payments, which reflect expected future service, as appropriate, expected to be paid by the plans in the periods indicated ($ in millions):\nU.S. Pension Plans\nNon-U.S. Pension Plans\nPostretirement Benefit Plans\nAll Plans\n2025\n$\n170\n \n$\n56\n \n$\n13\n \n$\n239\n \n2026\n171\n \n66\n \n12\n \n249\n \n2027\n170\n \n64\n \n11\n \n245\n \n2028\n167\n \n65\n \n10\n \n242\n \n2029\n164\n \n65\n \n9\n \n238\n \n2030 - 2034\n658\n \n354\n \n36\n \n1,048\n \nOther Matters\nSubstantially all employees not covered by defined benefit plans are covered by defined contribution plans, which generally provide for Company funding based on a percentage of compensation.\nThe Company’s expenses for all defined benefit and defined contribution pension plans amounted to $\n282\n million, $\n219\n million and $\n237\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\nNOTE 16.  \nCOMMITMENTS \nThe Company has entered into agreements to purchase goods or services that are enforceable and legally binding on the Company and that specify all significant terms, including fixed or minimum quantities to be purchased, fixed, minimum or variable price provisions and the approximate timing of the transaction.  Purchase obligations exclude agreements that are cancellable at any time without penalty.  As of December 31, 2024, the aggregate amount of the Company’s purchase obligations totaled approximately $\n1.6\n billion, and the majority of these obligations are expected to be settled during 2025.\n90\nTable of Contents\nNOTE 17.  \nLITIGATION AND CONTINGENCIES \nThe Company is subject to or otherwise responsible for a variety of litigation and other legal and regulatory proceedings in the course of its business (or related to the business operations of previously owned entities), including claims or counterclaims for damages arising out of the use of products or services and claims relating to intellectual property matters, employment matters, tax matters, commercial disputes, breach of contract claims, competition and sales and trading practices, environmental matters, personal injury, insurance coverage, securities matters, fiduciary duties and acquisition or divestiture-related matters, as well as regulatory subpoenas, requests for information, investigations and enforcement.  The Company also from time to time becomes subject to lawsuits as a result of acquisitions or as a result of liabilities retained from, or representations, warranties or indemnities provided in connection with, businesses divested by the Company or its predecessors.  The types of claims made in lawsuits include claims for compensatory damages, punitive and consequential damages (and in some cases, treble damages) and/or injunctive relief. \nWhile the Company maintains general, products, property, workers’ compensation, automobile, cargo, aviation, crime, cyber, fiduciary and directors’ and officers’ liability insurance (and has acquired rights under similar policies in connection with certain acquisitions) up to certain limits that cover certain of these claims, this insurance may be insufficient or unavailable to cover such losses.  For general, products and property liability and most other insured risks, the Company purchases outside insurance coverage only for severe losses and must establish and maintain reserves with respect to amounts within the self-insured retention.  In addition, while the Company believes it is entitled to indemnification from third-parties for some of these claims, these rights may also be insufficient or unavailable to cover such losses.\nThe Company records a liability in the Consolidated Financial Statements for loss contingencies when a loss is known or considered probable and the amount can be reasonably estimated.  If the reasonable estimate of a known or probable loss is a range, and no amount within the range is a better estimate than any other, the minimum amount of the range is accrued.  If a loss does not meet the known or probable level but is reasonably possible it is disclosed and if the loss or range of loss can be reasonably estimated, the estimated loss or range of loss is disclosed.  The Company’s reserves consist of specific reserves for individual claims and additional amounts for anticipated developments of these claims as well as for incurred but not yet reported claims.  The specific reserves for individual known claims are quantified with the assistance of legal counsel and outside risk professionals where appropriate.  In addition, outside risk professionals assist in the determination of reserves for incurred but not yet reported claims through evaluation of the Company’s specific loss history, actual claims reported and industry trends together with statistical and other factors.  Reserve estimates may be adjusted as additional information regarding a claim becomes known.  Because most contingencies are resolved over long periods of time, new developments (including litigation developments, the discovery of new facts, changes in legislation and outcomes of similar cases), changes in assumptions or changes in the Company’s strategy in any given period can require the Company to adjust the loss contingency estimates that have been recorded in the financial statements, record estimates for liabilities or assets previously not susceptible of reasonable estimates or pay cash settlements or judgments.  While the Company actively pursues financial recoveries from insurance providers and indemnifying parties, it does not recognize any recoveries until realized or until such time as a sustained pattern of collections is established related to historical matters of a similar nature and magnitude.  If the Company’s self-insurance and litigation reserves prove inadequate, it would be required to incur an expense equal to the amount of the loss incurred in excess of the reserves, which would adversely affect the Company’s Consolidated Financial Statements.\nIn addition, the Company’s operations, products and services are subject to numerous U.S. federal, state, local and non-U.S. environmental, health and safety laws and regulations concerning, among other things, the health and safety of our employees, the generation, storage, use and transportation of hazardous materials, emissions or discharges of substances into the environment, investigation and remediation of hazardous substances or materials at various sites, chemical constituents in products and end-of-life disposal and take-back programs for products sold.  A number of the Company’s operations involve the handling, manufacturing, use or sale of substances that are or could be classified as hazardous materials within the meaning of applicable laws.  Compliance with these laws and regulations has not had and, based on current information and the applicable laws and regulations currently in effect, is not expected to have a material effect on the Company’s capital expenditures, earnings or competitive position, and the Company does not anticipate material capital expenditures for environmental control facilities.\nIn addition to environmental compliance costs, the Company from time to time incurs costs related to remedial efforts or alleged environmental damage associated with past or current waste disposal practices or other hazardous materials handling practices.  For example, generators of hazardous substances found in disposal sites at which environmental problems are alleged to exist, as well as the current and former owners of those sites and certain other classes of persons, are subject to claims brought by state and federal regulatory agencies pursuant to statutory authority.  The Company has received notification from the U.S. Environmental Protection Agency, and from state and non-U.S. environmental agencies, that conditions at certain sites where the Company and others previously disposed of hazardous wastes and/or are or were property owners require clean-up and other possible remedial action, including sites where the Company has been identified as a potentially responsible party under U.S. federal and state environmental laws.  The Company has projects underway at a number of current and former facilities, in both the United States and abroad, to \n91\nTable of Contents\ninvestigate and remediate environmental contamination resulting from past operations.  Remediation activities generally relate to soil and/or groundwater contamination and may include pre-remedial activities such as fact-finding and investigation, risk assessment, feasibility study and/or design, as well as remediation actions such as contaminant removal, monitoring and/or installation, operation and maintenance of longer-term remediation systems.  The Company is also from time to time party to personal injury, property damage or other claims brought by private parties alleging injury or damage due to the presence of, or exposure to, hazardous substances.  The Company can also become subject to additional remedial, compliance or personal injury costs due to future events such as changes in existing laws or regulations, changes in agency direction or enforcement policies, developments in remediation technologies, changes in the conduct of the Company’s operations and changes in accounting rules.\nThe Company has recorded a provision for environmental investigation and remediation and environmental-related claims with respect to sites owned or formerly owned by the Company and its subsidiaries and third-party sites where the Company has been determined to be a potentially responsible party.  The Company generally makes an assessment of the costs involved for its remediation efforts based on environmental studies, as well as its prior experience with similar sites.  The ultimate cost of site cleanup is difficult to predict given the uncertainties of the Company’s involvement in certain sites, uncertainties regarding the extent of the required cleanup, the availability of alternative cleanup methods, variations in the interpretation of applicable laws and regulations, the possibility of insurance recoveries with respect to certain sites and the fact that imposition of joint and several liability with right of contribution is possible under the Comprehensive Environmental Response, Compensation and Liability Act of 1980 and other environmental laws and regulations.  If the Company determines that potential liability for a particular site or with respect to a personal injury claim is known or considered probable and reasonably estimable, the Company accrues the total estimated loss, including investigation and remediation costs, associated with the site or claim.  As of December 31, 2024, the Company had a reserve of $\n175\n million\n for environmental matters which are known or considered probable and reasonably estimable (of which $\n150\n million\n are noncurrent), which reflects the Company’s best estimate of the costs to be incurred with respect to such matters.\nWhile the Company actively pursues insurance recoveries, as well as recoveries from other potentially responsible parties, it does not recognize any insurance recoveries for environmental liability claims until realized or until such time as a sustained pattern of collections is established related to historical matters of a similar nature and magnitude.\nThe Company’s Restated Certificate of Incorporation requires it to indemnify to the full extent authorized or permitted by law any person made, or threatened to be made a party to any action or proceeding by reason of his or her service as a director or officer of the Company, or by reason of serving at the request of the Company as a director or officer of any other entity, subject to limited exceptions.  Danaher’s Amended and Restated By-laws provide for similar indemnification rights.  In addition, Danaher has executed with each director and executive officer of Danaher Corporation an indemnification agreement which provides for substantially similar indemnification rights and under which Danaher has agreed to pay expenses in advance of the final disposition of any such indemnifiable proceeding.  While the Company maintains insurance for this type of liability, a significant deductible applies to this coverage and any such liability could exceed the amount of the insurance coverage.\nAs of December 31, 2024, the Company had $\n537\n million of guarantees consisting primarily of outstanding standby letters of credit, bank guarantees and performance and bid bonds.  These guarantees have been provided in connection with certain arrangements with vendors, customers, insurance providers, financing counterparties and governmental entities to secure the Company’s obligations and/or performance requirements related to specific transactions.  The Company believes that if the obligations under these instruments were triggered, it would not have a material effect on its Consolidated Financial Statements.\nNOTE 18.  \nSTOCKHOLDERS' EQUITY AND STOCK-BASED COMPENSATION\nStockholders’ Equity\nOn July 16, 2013, the Company’s Board of Directors approved a repurchase program (the “Completed Repurchase Program”) authorizing the repurchase of up to \n20\n million shares of the Company’s common stock from time to time on the open market or in privately negotiated transactions.  During the year ended December 31, 2024, the Company repurchased approximately \n20.0\n million shares of the Company’s common stock for approximately $\n5.2\n billion (which included $\n52\n million of excise taxes which will be paid in 2025) as part of the Completed Repurchase Program.  Included within the shares repurchased under the Completed Repurchase Program in the year ended December 31, 2024 is the repurchase of $\n173\n million of shares from the Danaher Corporation & Subsidiaries Pension Plan, a related party, at fair market value at the time of the purchase.  On July 22, 2022, the Company repurchased approximately \n4\n thousand shares of the Company’s common stock for $\n1\n million as part of the Completed Repurchase Program.  As of December 31, 2024\n, \nno\n shares remained available for repurchase pursuant to the Completed Repurchase Program.  \n92\nTable of Contents\nOn July 22, 2024, the Company’s Board of Directors approved a new repurchase program (the “New Repurchase Program”) authorizing the repurchase of up to \n20\n million shares of the Company’s common stock from time to time on the open market or in privately negotiated transactions.  During the year ended December 31, 2024, the Company repurchased \n3.5\n million shares of the Company’s common stock for $\n817\n million (which included $\n8\n million of excise taxes which will be paid in 2025) as part of the New Repurchase Program.  As of December 31, 2024, \n16.5\n million shares remained available for repurchase pursuant to the New Repurchase Program.  In January 2025, the Company repurchased \n4.5\n million shares of the Company’s common stock for approximately $\n1.1\n billion (which included $\n11\n million of excise taxes which will be paid in 2026) under the New Repurchase Program.  There is no expiration date for the New Repurchase Program, and the timing and amount of any additional shares repurchased under the program will be determined by members of the Company’s management based on its evaluation of market conditions and other factors.  The New Repurchase Program may be suspended or discontinued at any time.  Any repurchased shares will be available for use in connection with the Company’s equity compensation plans (or any successor plans) and for other corporate purposes. \nExcept as discussed above, neither the Company nor any “affiliated purchaser” repurchased any shares of Company common stock during 2024, 2023 or 2022.  \nThe following table summarizes the Company’s share activity for the years ended December 31 (shares in millions):\n2024\n2023\n2022\nPreferred stock - shares issued:\nBalance, beginning of period\n—\n \n1.7\n \n3.4\n \nConversion of MCPS to common stock\n—\n \n(\n1.7\n)\n(\n1.7\n)\nBalance, end of period\n—\n \n—\n \n1.7\n \nCommon stock - shares issued:\nBalance, beginning of period\n880.5\n \n869.3\n \n855.7\n \nIssuance of common stock attributable to stock-based compensation\n3.8\n \n2.6\n \n2.6\n \nConversion of MCPS to common stock\n—\n \n8.6\n \n11.0\n \nBalance, end of period\n884.3\n \n880.5\n \n869.3\n \nAs of April 17, 2023, all outstanding shares of the Company’s \n5.00\n% MCPS Series B converted to common shares at a rate of \n5.0175\n common shares per share of preferred stock into an aggregate of \n8.6\n million shares of the Company’s common stock, pursuant to the terms of the Certificate of Designation governing the Series B Preferred Stock.  Danaher issued cash in lieu of fractional shares of common stock in the conversion.  The final quarterly cash dividend of $\n12.50\n per share was paid on April 17, 2023.  \nOn April 15, 2022, all outstanding shares of the Company’s \n4.75\n% MCPS Series A converted to common shares at a rate of \n6.6632\n common shares per share of preferred stock into an aggregate of \n11.0\n million shares of the Company’s common stock, pursuant to the terms of the Certificate of Designation governing the Series A Preferred Stock.  Danaher issued cash in lieu of fractional shares of common stock in the conversion.  The final quarterly cash dividend of $\n11.875\n per share was paid on April 15, 2022.  \nStock-Based Compensation\nStock options, RSUs and PSUs have been issued to directors, officers and other employees under the Company’s 2007 Omnibus Incentive Plan.  The 2007 Omnibus Incentive Plan provides for the grant of stock options, stock appreciation rights, RSUs, restricted stock, PSUs or any other stock-based award and cash-based awards.  A total of approximately \n135\n million shares of Danaher common stock have been authorized for issuance under the 2007 Omnibus Incentive Plan since the plan’s inception.  As of December 31, 2024, approximately \n47\n million shares of the Company’s common stock remain available for issuance under the 2007 Omnibus Incentive Plan (excluding shares underlying outstanding awards).\nStock options granted prior to 2022 under the 2007 Omnibus Incentive Plan generally vest pro rata over a \nfive-year\n period and terminate \nten years\n from the grant date, although executive officers and certain other employees have been awarded options with different vesting criteria.  Stock options granted subsequent to December 31, 2021 under the 2007 Omnibus Incentive Plan generally vest pro rata over a \nfour-year\n period and terminate \nten years\n from the grant date, although executive officers and certain other employees have been awarded options with different vesting criteria.  Options granted to outside directors under the 2007 Omnibus Incentive Plan are fully vested as of the grant date.  Option exercise prices for options granted by the Company equal the closing price of the Company’s common stock on the New York Stock Exchange on the date of grant.  \n93\nTable of Contents\nRSUs issued under the 2007 Omnibus Incentive Plan provide for the issuance of a share of the Company’s common stock at no cost to the holder.  RSUs granted prior to 2022 to employees under the 2007 Omnibus Incentive Plan generally provide for pro rata time-based vesting over a \nfive-year\n period, although executive officers and certain other employees have been awarded RSUs with different vesting criteria.  RSUs granted subsequent to December 31, 2021 to employees under the 2007 Omnibus Incentive Plan generally vest pro rata over a \nfour-year\n period, although certain employees have been awarded RSUs with different vesting criteria.  The RSUs that have been granted to directors under the 2007 Omnibus Incentive Plan vest on the earlier of the first anniversary of the grant date or the date of, and immediately prior to, the next annual meeting of the Company’s shareholders following the grant date, but the underlying shares are not issued until the earlier of the director’s death or the first day of the seventh month following the director’s retirement from the Board.  Prior to vesting, RSUs granted under the 2007 Omnibus Incentive Plan do not have dividend equivalent rights, do not have voting rights and the shares underlying the RSUs are not considered issued and outstanding.  \nPSUs issued under the 2007 Omnibus Incentive Plan provide for the issuance of a share of the Company’s common stock at no cost to the holder, vest based on specified performance criteria, are subject to an additional holding period following vesting and are entitled to dividend equivalent rights.  The PSU dividend equivalent rights are subject to the same vesting and payment restrictions as the related shares, and the shares underlying the PSUs are not considered issued and outstanding. \nThe equity compensation awards granted by the Company generally vest only if the employee is employed by the Company (or in the case of directors, the director continues to serve on the Company Board) on the vesting date or in other limited circumstances, including following a qualifying retirement.  To cover the exercise of options and vesting of RSUs and PSUs, the Company generally issues new shares from its authorized but unissued share pool, although it may instead issue treasury shares in certain circumstances.\nThe Company accounts for stock-based compensation by measuring the cost of employee services received in exchange for all equity awards granted based on the fair value of the award as of the grant date.  The Company recognizes the compensation expense over the requisite service period (which is generally the vesting period but may be shorter than the vesting period if the employee becomes retirement eligible before the end of the vesting period).  The fair value for RSU awards was calculated using the closing price of the Company’s common stock on the date of grant, adjusted for the fact that RSUs do not accrue dividends.  The fair value of the PSU awards was calculated using a Monte Carlo pricing model.  The fair value of the options granted was calculated using a Black-Scholes Merton option pricing model (“Black-Scholes”).\nIn connection with the Separation and in accordance with the employee matters agreement Danaher and Veralto have entered into, stock-based compensation awards have been converted into awards of the company that employs the employee post-separation.  The Company has made certain adjustments to the exercise price and the number of shares underlying the stock-based compensation awards held by its employees, with the intention of preserving the intrinsic value of the awards immediately prior to the Separation.  \nThe adjustment to the Company’s stock-based compensation awards as a result of the Separation did not have a significant impact to the Company’s stock compensation expense.  Veralto has responsibility for the awards that were converted into Veralto awards.\nThe following summarizes the assumptions used in the Black-Scholes model to value options granted during the years ended December 31:\n \n2024\n2023\n2022\nRisk-free interest rate\n4.1\n – \n4.5\n%\n3.5\n – \n4.5\n%\n1.8\n – \n4.0\n%\nWeighted average volatility\n28.9\n \n%\n27.8\n \n%\n30.3\n \n%\nDividend yield\n0.4\n \n%\n0.5\n \n%\n0.4\n \n%\nExpected years until exercise\n5.0\n – \n7.0\n5.0\n – \n7.0\n5.0\n – \n7.5\nThe Black-Scholes model incorporates assumptions to value stock-based awards.  The risk-free rate of interest for periods within the contractual life of the option is based on a zero-coupon U.S. government instrument whose maturity period equals or approximates the option’s expected term.  Expected volatility is based on implied volatility from traded options on the Company’s stock and historical volatility of the Company’s stock.  The dividend yield is calculated by dividing the Company’s annual common stock dividend, based on the most recent quarterly dividend rate, by the closing stock price on the grant date.  To estimate the option exercise timing used in the valuation model (which impacts the risk-free interest rate and the expected years until exercise), in addition to considering the vesting period and contractual term of the option, the Company analyzes and considers actual historical exercise experience for previously granted options.  The Company stratifies its employee population into multiple groups for option valuation and attribution purposes based upon distinctive patterns of forfeiture rates and option holding periods, as indicated by the ranges set forth in the table above for the risk-free interest rate and the expected years until exercise.\nThe amount of stock-based compensation expense recognized during a period is also based on the portion of the awards that are ultimately expected to vest.  The Company estimates pre-vesting forfeitures at the time of grant by analyzing historical data and revises those estimates in subsequent periods if actual forfeitures differ from those estimates.  Ultimately, the total expense recognized over the vesting period will equal the fair value of awards that actually vest.\n94\nTable of Contents\nThe following summarizes the components of the Company’s continuing operations stock-based compensation expense for the years ended December 31 ($ in millions):\n \n2024\n2023\n2022\nRSUs/PSUs:\nPretax compensation expense\n$\n159\n \n$\n173\n \n$\n172\n \nIncome tax benefit\n(\n33\n)\n(\n38\n)\n(\n36\n)\nRSU/PSU expense, net of income taxes\n126\n \n135\n \n136\n \nStock options:\nPretax compensation expense\n129\n \n133\n \n123\n \nIncome tax benefit\n(\n26\n)\n(\n27\n)\n(\n25\n)\nStock option expense, net of income taxes\n103\n \n106\n \n98\n \nTotal stock-based compensation:\nPretax compensation expense\n288\n \n306\n \n295\n \nIncome tax benefit\n(\n59\n)\n(\n65\n)\n(\n61\n)\nTotal stock-based compensation expense, net of income taxes\n$\n229\n \n$\n241\n \n$\n234\n \nStock-based compensation has been recognized as a component of selling, general and administrative expenses in the accompanying Consolidated Statements of Earnings.  As of December 31, 2024, $\n144\n million of total unrecognized compensation cost related to RSUs/PSUs is expected to be recognized over a weighted average period of approximately \ntwo years\n.  As of December 31, 2024, $\n174\n million of total unrecognized compensation cost related to stock options is expected to be recognized over a weighted average period of approximately \ntwo years\n.  Futur\ne compensation amounts will be adjusted for any changes in estimated forfeitures.\nThe following summarizes option activity under the Company’s stock plans (in millions, except weighted exercise price and number of years):\nOptions\nWeighted Average Exercise Price\nWeighted Average Remaining Contractual Term (in years)\nAggregate Intrinsic Value\nOutstanding as of January 1, 2022\n17.5\n \n$\n112.91\n \nGranted \n2.6\n \n236.68\n \nExercised \n(\n1.8\n)\n77.27\n \nCancelled/forfeited \n(\n0.7\n)\n184.80\n \nOutstanding as of December 31, 2022\n17.6\n \n131.98\n \nGranted\n2.8\n \n218.69\n \nExercised\n(\n1.7\n)\n83.13\n \nCancelled/forfeited\n(\n0.9\n)\n178.71\n \nAdjustment due to Separation\n(a)\n(\n2.1\n)\n154.67\n \nOutstanding as of December 31, 2023\n15.7\n \n147.02\n \nGranted\n1.6\n \n252.97\n \nExercised\n(\n2.7\n)\n99.82\n \nCancelled/forfeited\n(\n0.5\n)\n234.19\n \nOutstanding as of December 31, 2024\n14.1\n \n164.99\n \n5\n$\n973\n \nVested and expected to vest as of December 31, 2024\n(b)\n13.9\n \n$\n164.15\n \n5\n$\n971\n \nVested as of December 31, 2024\n8.7\n \n$\n129.51\n \n4\n$\n893\n \n(a)\n    The “Adjustment due to Separation” reflects the cancellation of stock options which were outstanding as of September 30, 2023 and held by Veralto employees which have been terminated and replaced by Veralto with Veralto equity awards as part of the Separation.\n(b) \nThe “expected to vest” options are the net unvested options that remain after applying the forfeiture rate assumption to total unvested options.\nThe aggregate intrinsic value in the table above represents the total pretax intrinsic value (the difference between the Company’s closing stock price on the last trading day of 2024 and the exercise price, multiplied by the number of in-the-money options) that would have been received by the option holders had all option holders exercised their options on December 31, 2024.  The amount of aggregate intrinsic value will change based on the price of the Company’s common stock. \nThe weighted average per share grant-date fair values of options granted during 2024, 2023 and 2022 were $\n83.12\n, $\n68.92\n and $\n71.35\n, respectively. \n95\nTable of Contents\nOptions outstanding as of December 31, 2024 are summarized below (shares in millions):\n \nOutstanding\nExercisable\nExercise Price\nShares\nAverage Exercise Price\nAverage Remaining Life (in years)\nShares\nAverage Exercise Price\n$\n58.08\n to $\n76.47\n2.0\n \n$\n69.42\n \n2\n2.0\n \n$\n69.42\n \n$\n76.48\n to $\n125.35\n3.2\n \n96.46\n \n4\n3.2\n \n96.46\n \n$\n125.36\n to $\n201.59\n3.3\n \n166.06\n \n5\n2.0\n \n159.52\n \n$\n201.60\n to $\n230.50\n2.4\n \n221.19\n \n8\n0.6\n \n220.63\n \n$\n230.51\n to $\n266.20\n3.2\n \n249.75\n \n8\n0.9\n \n248.88\n \nThe aggr\negate intrinsic value of options exercised during the years ended December 31, 2024, 2023 and 2022 was $\n413\n million, $\n259\n million and $\n288\n million, respectively.  Exercise of options during the years ended December 31, 2024, 2023 and 2022 resulted in cash receipts of $\n259\n million, $\n148\n million and $\n130\n million, respectively.  Upon exercise of the award by the employee, the Company derives a tax deduction measured by the excess of the market value over the grant price at the date of exercise.  The Company realized a tax benefit of $\n79\n million, $\n48\n million and $\n48\n million in 2024, 2023 and 2022, respectively, related to the exercise of employee stock options. \nThe following summarizes information on unvested RSU and PSU activity (in millions, except weighted average grant-date fair value):\nNumber of RSUs/PSUs\nWeighted Average\nGrant-Date Fair Value\nUnvested as of January 1, 2022\n3.5\n \n$\n135.92\n \nGranted\n1.2\n \n235.47\n \nVested\n(\n1.1\n)\n121.04\n \nForfeited\n(\n0.3\n)\n235.47\n \nUnvested as of December 31, 2022\n3.3\n \n168.03\n \nGranted\n1.2\n \n219.29\n \nVested\n(\n0.9\n)\n148.90\n \nForfeited\n(\n0.3\n)\n204.97\n \nAdjustment due to Separation\n(a)\n(\n0.4\n)\n211.14\n \nUnvested as of December 31, 2023\n2.9\n \n185.41\n \nGranted\n0.7\n \n253.55\n \nVested\n(\n1.1\n)\n164.80\n \nForfeited\n(\n0.2\n)\n201.00\n \nUnvested as of December 31, 2024\n2.3\n \n214.65\n \n(a)\n    The “Adjustment due to Separation” reflects the cancellation of RSUs and PSUs which were outstanding as of September 30, 2023 and held by Veralto employees which have been terminated and replaced by Veralto with Veralto equity awards as part of the Separation.\nThe Company realized a tax benefit of $\n28\n million, $\n32\n million and $\n37\n million in the years ended December 31, 2024, 2023 and 2022, respectively, related to the vesting of RSUs and PSUs.  \nThe excess tax benefit of $\n70\n million, $\n51\n million and $\n61\n million related to the exercise of employee stock options and vesting of RSUs and PSUs for the years ended December 31, 2024, 2023 and 2022, respectively, has been recorded as a reduction to the current income tax provision and is reflected as an operating cash inflow in the accompanying Consolidated Statements of Cash Flows. \nIn connection with the exercise of certain stock options and the vesting of RSUs previously issued by the Company, a number of shares sufficient to fund statutory minimum tax withholding requirements has been withheld from the total shares issued or released to the award holder (though under the terms of the applicable plan, the shares are considered to have been issued and are not added back to the pool of shares available for grant).  During the year ended December 31, 2024, \n396\n thousand shares with an aggregate value of $\n97\n million were withheld to satisfy the requirement.  During the year ended December 31, 2023, \n369\n thousand shares with an aggregate value of $\n80\n million were withheld to satisfy the requirement.  The withholding is treated as a reduction in additional paid-in \ncapital in the accompanying Consolidated Statements of Stockholders’ Equity and a reduction in proceeds from the issuance of common stock in connection with stock-based compensation in the \naccompanying\n Consolidated Statements of Cash Flows.\n96\nTable of Contents\nAccumulated Other Comprehensive Income\nThe changes in accumulated other comprehensive income (loss) by component are summarized below ($ in millions).\nForeign Currency Translation Adjustments\nPension and Postretirement Plan Benefit Adjustments\nCash Flow Hedge Adjustments\nAccumulated Comprehensive Income (Loss)\nBalance, January 1, 2022\n$\n(\n539\n)\n$\n(\n550\n)\n$\n62\n \n$\n(\n1,027\n)\nOther comprehensive income (loss) before reclassifications:\nIncrease (decrease)\n(\n2,051\n)\n233\n \n378\n \n(\n1,440\n)\nIncome tax impact\n(\n54\n)\n(\n56\n)\n(\n91\n)\n(\n201\n)\nOther comprehensive income (loss) before reclassifications, net of income taxes\n(\n2,105\n)\n177\n \n287\n \n(\n1,641\n)\nReclassification adjustments\nIncrease (decrease)\n—\n \n42\n \n(a)\n(\n235\n)\n(b)\n(\n193\n)\nIncome tax impact\n—\n \n(\n10\n)\n(\n1\n)\n(\n11\n)\nReclassification adjustments, net of income taxes\n—\n \n32\n \n(\n236\n)\n(\n204\n)\nNet other comprehensive income (loss), net of income taxes\n(\n2,105\n)\n209\n \n51\n \n(\n1,845\n)\nBalance, December 31, 2022\n(\n2,644\n)\n(\n341\n)\n113\n \n(\n2,872\n)\nOther comprehensive income (loss) before reclassifications:\nIncrease (decrease)\n181\n \n(\n70\n)\n(\n214\n)\n(\n103\n)\nIncome tax impact\n34\n \n18\n \n91\n \n143\n \nOther comprehensive income (loss) before reclassifications, net of income taxes\n215\n \n(\n52\n)\n(\n123\n)\n40\n \nReclassification adjustments\nIncrease (decrease)\n—\n \n2\n \n(a)\n110\n \n(b)\n112\n \nIncome tax impact\n—\n \n(\n1\n)\n(\n1\n)\n(\n2\n)\nReclassification adjustments, net of income taxes\n—\n \n1\n \n109\n \n110\n \nNet other comprehensive income (loss), net of income taxes\n215\n \n(\n51\n)\n(\n14\n)\n150\n \nDistribution of Veralto Corporation\n983\n \n(\n9\n)\n(c)\n—\n \n974\n \nBalance, December 31, 2023\n(\n1,446\n)\n(\n401\n)\n99\n \n(\n1,748\n)\nOther comprehensive income (loss) before reclassifications:\nIncrease (decrease)\n(\n1,428\n)\n122\n \n(\n4\n)\n(\n1,310\n)\nIncome tax impact\n(\n30\n)\n(\n30\n)\n—\n \n(\n60\n)\nOther comprehensive income (loss) before reclassifications, net of income taxes\n(\n1,458\n)\n92\n \n(\n4\n)\n(\n1,370\n)\nReclassification adjustments\nIncrease (decrease)\n—\n \n12\n \n(a)\n(\n108\n)\n(b)\n(\n96\n)\nIncome tax impact\n—\n \n(\n3\n)\n(\n1\n)\n(\n4\n)\nReclassification adjustments, net of income taxes\n—\n \n9\n \n(\n109\n)\n(\n100\n)\nNet other comprehensive income (loss), net of income taxes\n(\n1,458\n)\n101\n \n(\n113\n)\n(\n1,470\n)\nBalance, December 31, 2024\n$\n(\n2,904\n)\n$\n(\n300\n)\n$\n(\n14\n)\n$\n(\n3,218\n)\n(a)    \nThis accumulated other comprehensive income (loss) component is included in the computation of net periodic pension and postretirement cost (refer to Note 15 for additional details).\n(b)    \nReflects reclassification to earnings related to remeasurement of certain long-term debt (refer to Note 14 for additional details).\n(c)    \nThis accumulated other comprehensive income (loss) component included an income tax impact of $\n2\n million.\n97\nTable of Contents\nITEM 9.  CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNot applicable.\nITEM 9A.  CONTROLS AND PROCEDURES\nThe Company’s management, with the participation of the Company’s President and Chief Executive Officer, and Executive Vice President and Chief Financial Officer, has evaluated the effectiveness of the Company’s disclosure controls and procedures (as such term is defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the “Exchange Act”)) as of the end of the period covered by this report.  Based on such evaluation, the Company’s President and Chief Executive Officer, and Executive Vice President and Chief Financial Officer, have concluded that, as of the end of such period, the Company’s disclosure controls and procedures were effective.\nManagement’s annual report on its internal control over financial reporting (as such term is defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) and the independent registered public accounting firm’s audit report on the effectiveness of Danaher’s internal control over financial reporting are included in the Company’s financial statements for the year ended December 31, 2024 included in Item 8 of this Annual Report on Form 10-K, under the headings “Report of Management on Danaher Corporation’s Internal Control Over Financial Reporting” and “Report of Independent Registered Public Accounting Firm,” respectively, and are incorporated herein by reference.\nThere have been no changes in the Company’s internal control over financial reporting (as such term is defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) that occurred during the Company’s most recent completed fiscal quarter that have materially affected, or are reasonably likely to materially affect, the Company’s internal control over financial reporting.\nITEM 9B.  OTHER INFORMATION\nProductivity Improvement and Cost Savings Initiative\nIn the first quarter of 2025, the Company commenced an initiative to identify productivity improvement and cost savings opportunities that we anticipate would generate annual pre-tax savings of at least $150 million.  The Company expects these opportunities to be broad-based, including opportunities within China and the Diagnostics segment.\nDirector and Officer Trading Arrangements\nNone of our directors or executive officers \nadopted\n or \nterminated\n a Rule 10b5-1 trading arrangement or a non-Rule 10b5-1 trading arrangement (as defined in Item 408(c) of Regulation S-K) during the fourth quarter of 2024.\nITEM 9C.  DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\n98\nTable of Contents\nPART III\nITEM 10.  DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nOther than the information below, the information required by this Item is incorporated by reference from the sections entitled \nProposal 1–Election of Directors\n, \nCorporate Governance\n and \nOther Information\n in the Proxy Statement for the Company’s 2025 annual meeting of shareholders and from the information under the caption “Information About Our Executive Officers” in Part I hereof.  No nominee for director was selected pursuant to any arrangement or understanding between the nominee and any person other than the Company pursuant to which such person is or was to be selected as a director or nominee.\nCode of Ethics\nDanaher has adopted a code of business conduct and ethics for directors, officers (including Danaher’s principal executive officer, principal financial officer and principal accounting officer) and employees, known as the Code of Conduct.  The Code of Conduct is available in the “Governance” section of Danaher’s website at www.danaher.com.\nDanaher intends to disclose any amendment to the Code of Conduct that relates to any element of the code of ethics definition enumerated in Item 406(b) of Regulation S-K, and any waiver from a provision of the Code of Conduct granted to any director, principal executive officer, principal financial officer, principal accounting officer, or any of its other executive officers, in the “Governance” section of its website, at www.danaher.com, within four business days following the date of such amendment or waiver.\nITEM 11.  EXECUTIVE COMPENSATION\nThe information required by this Item is incorporated by reference from the sections entitled \nDirector Compensation, Compensation Discussion and Analysis, Compensation Committee Report, Compensation Tables and Information \n(other than the Pay Versus Performance disclosure)\n \nand \nSummary of Employment Agreements and Plans\n in the Proxy Statement for the Company’s 2025 annual meeting of shareholders (provided that the Compensation Committee Report shall not be deemed to be “filed” and the Pay-Versus-Performance disclosure shall not be deemed to be incorporated by reference herein).\nITEM 12.  SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by this Item is incorporated by reference from the sections entitled \nBeneficial Ownership of Danaher Common Stock by Directors, Officers and Principal Shareholders, Summary of Employment Agreements and Plans \nand\n Compensation Tables and Information\n in the Proxy Statement for the Company’s 2025 annual meeting of shareholders (provided that the Pay-Versus-Performance disclosure shall not be deemed to be incorporated by reference herein).\nITEM 13.  CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by this Item is incorporated by reference from the section entitled \nDirector Independence and Related Person Transactions\n in the Proxy Statement for the Company’s 2025 annual meeting of shareholders.\nITEM 14.  PRINCIPAL ACCOUNTANT FEES AND SERVICES\nOur independent registered public accounting firm is Ernst & Young LLP, Tysons, Virginia, PCAOB ID: 000\n42\n.\nThe information required by this Item is incorporated by reference from the section entitled \nProposal 2–Ratification of Independent Registered Public Accounting Firm \nin the Proxy Statement for the Company’s 2025 annual meeting of shareholders.\n99\nTable of Contents\nPART IV\nITEM 15.  EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\na)    The following documents are filed as part of this report.\n(1)\nFinancial Statements.  The financial statements are set forth under “Item 8.  Financial Statements and Supplementary Data” of this Annual Report on Form 10-K.\n(2)\nSchedules.  An index of Exhibits and Schedules is on page \n101\n of this report.  Schedules other than those listed below have been omitted from this Annual Report on Form 10-K because they are not required, are not applicable or the required information is included in the financial statements or the notes thereto.\n(3)\nExhibits.  The exhibits listed in the accompanying Exhibit Index are filed or incorporated by reference as part of this Annual Report on Form 10-K.\nITEM 16.  FORM 10-K SUMMARY\nNot applicable.\n100\nTable of Contents\nDANAHER CORPORATION\nINDEX TO FINANCIAL STATEMENTS, SUPPLEMENTARY DATA AND FINANCIAL STATEMENT SCHEDULE\n \nPage Number in\nForm 10-K\nSchedule:\nValuation and Qualifying Accounts\n107\nEXHIBIT INDEX\nExhibit Number\nDescription\n2.1\nSeparation and Distribution Agreement, dated as of September 29, 2023, by and between Danaher Corporation and Veralto Corporation \nIncorporated by reference from Exhibit 2.1 to Danaher Corporation’s Current Report on Form 8-K filed on October 2, 2023\n3.1\nRestated Certificate of Incorporation of Danaher Corporation\nIncorporated by reference from Exhibit 3.1 to Danaher Corporation’s Quarterly Report on Form 10-Q for the quarter ended June 29, 2012\n3.2\nAmended and Restated By-laws of Danaher Corporation\nIncorporated by reference from Exhibit 3.1 to Danaher Corporation’s Current Report on Form 8-K filed December 7, 2022\n4.1\nSenior Indenture dated as of December 11, 2007 by and between Danaher Corporation and The Bank of New York Mellon Trust Company, N.A. as trustee (“Senior Indenture”)\nIncorporated by reference from Exhibit 1.2 to Danaher Corporation’s Current Report on Form 8-K filed on December 11, 2007 \n4.2\nFirst Supplemental Indenture to Senior Indenture, dated as of September 15, 2015, by and between Danaher Corporation and The Bank of New York Mellon Trust Company, N.A. as trustee\nIncorporated by reference from Exhibit 4.1 to Danaher Corporation’s Current Report on Form 8-K filed September 15, 2015 \n4.3\nIndenture dated as of July 8, 2015, by and between Danaher Corporation, as guarantor, DH Europe Finance S.a.r.l., as issuer, and The Bank of New York Mellon Trust Company, N.A. as trustee (“Danaher International Indenture”)\nIncorporated by reference from Exhibit 4.1 to Danaher Corporation’s Current Report on Form 8-K filed on July 8, 2015 \n4.4\nSecond Supplemental Indenture to Danaher International Indenture, dated as of June 30, 2017, by and between Danaher Corporation, as guarantor, DH Europe Finance S.a.r.l., as issuer, and The Bank of New York Mellon Trust Company, N.A. as trustee\nIncorporated by reference from Exhibit 4.2 to Danaher Corporation’s Current Report on Form 8-K filed on June 30, 2017\n4.5\nSecond Supplemental Indenture to Senior Indenture, dated as of July 1, 2019 between Danaher Corporation and The Bank of New York Mellon Trust Company, N.A., as trustee\nIncorporated by reference from Exhibit 4.2 to Danaher Corporation’s Post-Effective Amendment No. 1 to Registration Statement on Form S-3 filed July 10, 2019 \n4.6\nThird Supplemental Indenture to Senior Indenture, dated as of March 30, 2020 between Danaher Corporation and The Bank of New York Mellon Trust Company, N.A., as trustee\nIncorporated by reference from Exhibit 4.3 to Danaher Corporation’s Current Report on Form 8-K filed on March 30, 2020\n4.7\nFourth Supplemental Indenture to Senior Indenture, dated as of October 6, 2020 between Danaher Corporation and The Bank of New York Mellon Trust Company, N.A., as trustee\nIncorporated by reference from Exhibit 4.4 to Danaher Corporation’s Current Report on Form 8-K filed on October 6, 2020\n4.8\nFifth Supplemental Indenture to Senior Indenture, dated as of December 10, 2021 between Danaher Corporation and The Bank of New York Mellon Trust Company, N.A., as trustee\nIncorporated by reference from Exhibit 4.4 to Danaher Corporation’s Current Report on Form 8-K filed on December 10, 2021\n4.9\nThird Supplemental Indenture to Danaher International Indenture, dated as of July 1, 2019 among DH Europe Finance S.à r.l., as issuer, Danaher Corporation, as guarantor and The Bank of New York Mellon Trust Company, N.A., as trustee\nIncorporated by reference from Exhibit 4.5 to Danaher Corporation’s Post-Effective Amendment No. 1 to Registration Statement on Form S-3 filed July 10, 2019 \n101\nTable of Contents\n4.10\nBase Indenture, dated as of September 18, 2019, among DH Europe Finance II S.à r.l., as issuer, Danaher Corporation, as guarantor and The Bank of New York Mellon Trust Company, N.A., as trustee (“Danaher International II Indenture”)\nIncorporated by reference from Exhibit 4.1 to Danaher Corporation’s Current Report on Form 8-K filed September 18, 2019 \n4.11\nFirst Supplemental Indenture to Danaher International II Indenture, dated as of September 18, 2019, among DH Europe Finance II S.à r.l., as issuer, Danaher Corporation, as guarantor and The Bank of New York Mellon Trust Company, N.A., as trustee\nIncorporated by reference from Exhibit 4.2 to Danaher Corporation’s Current Report on Form 8-K filed September 18, 2019 \n4.12\nDescription of Securities Registered Under Section 12 of the Exchange Act\n10.1\nDanaher Corporation 2007 Omnibus Incentive Plan, as amended and restated*\nIncorporated by reference from Exhibit 10.1 to Danaher Corporation’s Current Report on Form 8-K filed December 8, 2021\n10.2\nDanaher Corporation Non-Employee Directors’ Deferred Compensation Plan, as amended, a sub-plan under the 2007 Omnibus Incentive Plan*\nIncorporated by reference from Exhibit 10.2 to Danaher Corporation’s Annual Report on Form 10-K for the year ended December 31, 2008\n10.3\nAmended Form of Election to Defer under the Danaher Corporation Non-Employee Directors’ Deferred Compensation Plan*\nIncorporated by reference from Exhibit 10.3 to Danaher Corporation’s Annual Report on Form 10-K for the year ended December 31, 2008\n10.4\nForm of Danaher Corporation 2007 Omnibus Incentive Plan Stock Option Agreement for Non-Employee Directors*\n10.5\nForm of Danaher Corporation 2007 Omnibus Incentive Plan RSU Agreement for Non-Employee Directors*\n10.6\nForm of Danaher Corporation 2007 Omnibus Incentive Plan Stock Option Agreement*\n10.7\nForm of Danaher Corporation 2007 Omnibus Incentive Plan RSU Agreement*\n10.8\nForm of Danaher Corporation 2007 Omnibus Incentive Plan PSU Agreement*\n10.9\nDanaher Corporation & Subsidiaries Amended and Restated Executive Deferred Incentive Program*\nIncorporated by reference from Exhibit 10.3 to Danaher Corporation’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2023\n10.10\nAmendment to Danaher Executive Deferred Incentive Program*\nIncorporated by reference from Exhibit 10.13 to Danaher Corporation’s Quarterly Report on Form 10-Q for the quarter ended September 29, 2023\n10.11\nDanaher Corporation Excess Contribution Program, a sub-plan under the 2007 Omnibus Incentive Plan, as amended and restated*\nIncorporated by reference from Exhibit 10.1 to Danaher Corporation’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2023\n10.12\nAmendment to Danaher Excess Contribution Program*\nIncorporated by reference from Exhibit 10.14 to Danaher Corporation’s Quarterly Report on Form 10-Q for the quarter ended September 29, 2023\n10.13\nAmended and Restated Danaher Corporation Deferred Compensation Plan*\nIncorporated by reference from Exhibit 10.2 to Danaher Corporation’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2023\n10.14\nAmendment to Amended and Restated Danaher Corporation Deferred Compensation Plan*\nIncorporated by reference from Exhibit 10.12 to Danaher Corporation’s Quarterly Report on Form 10-Q for the quarter ended September 29, 2023\n10.15\nDanaher Corporation Senior Leader Severance Pay Plan*\nIncorporated by reference from Exhibit 10.1 to Danaher Corporation’s Quarterly Report on Form 10-Q for the quarter ended March 29, 2013\n10.16\nAmended and Restated Agreement Regarding Competition and Protection of Proprietary Interests by and between Danaher Corporation and Rainer M. Blair, dated May 6, 2020* \nIncorporated by reference from Exhibit 10.2 to Danaher Corporation’s Current Report on Form 8-K filed May 6, 2020 \n102\nTable of Contents\n10.17\nAgreement Regarding Competition and Protection of Proprietary Interests by and between Danaher Corporation and Joakim Weidemanis, dated as of May 15, 2020*\nIncorporated by reference from Exhibit 10.3 to Danaher Corporation’s Quarterly Report on Form 10-Q for the quarter ended July 3, 2020 \n10.18\nTransition Agreement by and between Danaher Corporation and Joakim Weidemanis, dated as of June 16, 2024*\nIncorporated by referenced from Exhibit 10.1 to Danaher Corporation’s Current Report on Form 8-K filed on June 20, 2024\n10.19\nAgreement Regarding Competition and Protection of Proprietary Interests by and between Danaher Corporation and Matthew McGrew dated November 7, 2018*\nIncorporated by reference from Exhibit 10.2 to Danaher Corporation’s Current Report on Form 8-K filed on November 8, 2018 \n10.20\nAgreement Regarding Competition and Protection of Proprietary Interests by and between Danaher Corporation and Jose-Carlos Gutierrez-Ramos dated February 14, 2023*\nIncorporated by reference from Exhibit 10.20 to Danaher Corporation’s Annual Report on Form 10-K for the year ended December 31, 2022\n10.21\nLetter Agreement by and between Danaher Corporation and Jose-Carlos Gutierrez-Ramos dated November 23, 2020*\nIncorporated by reference from Exhibit 10.21 to Danaher Corporation’s Annual Report on Form 10-K for the year ended December 31, 2022\n10.22\nAgreement Regarding Competition and Protection of Proprietary Interests by and between Danaher Corporation and Georgeann Couchara dated January 29, 2024*\nIncorporated by reference from Exhibit 10.21 to Danaher Corporation’s Annual Report on Form 10-K for the year ended December 31, 2023\n10.23\nAgreement Regarding Competition and Protection of Proprietary Interests by and between Danaher Corporation and Brian W. Ellis dated December 7, 2015*\nIncorporated by reference from Exhibit 10.18 to Danaher Corporation’s Annual Report on Form 10-K for the year ended December 31, 2016\n10.24\nDescription of compensation arrangements for non-management directors*\n \n10.25\nManagement Agreement dated September 29, 2023 by and between FJ900, Inc. and Joust Capital II, LLC \n(1)\nIncorporated by reference from Exhibit 10.15 to Danaher Corporation’s Quarterly Report on Form 10-Q for the quarter ended September 29, 2023 \n10.26\nInterchange Agreement dated September 29, 2023 by and between Danaher Corporation and Joust Capital II, LLC \n(2)\nIncorporated by reference from Exhibit 10.16 to Danaher Corporation’s Quarterly Report on Form 10-Q for the quarter ended September 29, 2023\n10.27\nAircraft Time Sharing Agreement by and between Danaher Corporation and Rainer M. Blair, dated as of November 17, 2023* \n(3)\nIncorporated by reference from Exhibit 10.25 to Danaher Corporation’s Annual Report on Form 10-K for the year ended December 31, 2023\n10.28\nForm of Director and Officer Indemnification Agreement\nIncorporated by reference from Exhibit 10.35 to Danaher Corporation’s Annual Report on Form 10-K for the year ended December 31, 2008 \n10.29\nThird Amended and Restated Credit Agreement, dated as of August 11, 2023, among Danaher Corporation, certain of its subsidiaries party thereto, Bank of America, N.A., as Administrative Agent, and the lenders referred to therein\nIncorporated by reference to Exhibit 10.1 to Danaher Corporation’s Current Report on Form 8-K filed on August 15, 2023\n19.1\nDanaher Corporation Insider Trading Policy\n21.1\nSubsidiaries of Registrant\n22.1\nSubsidiary guarantors and issuers of guaranteed securities and affiliates whose securities collateralize securities of the Registrant\n23.1\nConsent of Independent Registered Public Accounting Firm\n31.1\nCertification of Chief Executive Officer Pursuant to Item 601(b)(31) of Regulation S-K, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n103\nTable of Contents\n31.2\nCertification of Chief Financial Officer Pursuant to Item 601(b)(31) of Regulation S-K, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1\nCertification of Chief Executive Officer, Pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n32.2\nCertification of Chief Financial Officer, Pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n97.1\nDanaher Corporation Clawback Policy\nIncorporated by reference from Exhibit 97.1 to Danaher Corporation’s Annual Report on Form 10-K for the year ended December 31, 2023\n101.INS\nInline XBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n (4)\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n (4)\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n (4)\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n (4)\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n (4)\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\n (4)\n104\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\nDanaher is a party to additional long-term debt instruments under which, in each case, the total amount of debt authorized does not exceed 10% of the total assets of Danaher and its subsidiaries on a consolidated basis.  Pursuant to paragraph 4(iii)(A) of Item 601(b) of Regulation S-K, Danaher agrees to furnish a copy of such instruments to the Securities and Exchange Commission upon request.\n*\nIndicates management contract or compensatory plan, contract or arrangement.\n(1)\nIn accordance with Instruction 2 to Item 601(a)(4) of Regulation S-K, FJ900, Inc. (a subsidiary of Danaher) has entered into a management agreement with Stonehavens Global LLC that is substantially identical in all material respects to the form of agreement referenced as Exhibit 10.25, except as to the referenced aircraft and the name of the counterparty.\n(2)\nIn accordance with Instruction 2 to Item 601(a)(4) of Regulation S-K, Danaher Corporation or a subsidiary thereof has entered into additional interchange agreements with each of Joust Capital II, LLC and Joust Capital III, LLC that are substantially identical in all material respects to the form of agreement attached as Exhibit 10.26, except as to the referenced aircraft and, in certain cases, the name of the counterparty.\n(3)\nIn accordance with Instruction 2 to Item 601(a)(4) of Regulation S-K, Danaher Corporation has entered into an aircraft time sharing agreement with Matthew R. McGrew that is substantially identical in all material respects to the form of agreement referenced as Exhibit 10.27.\n(4)\nAttached as Exhibit 101 to this report are the following documents formatted in Inline XBRL (Inline Extensible Business Reporting Language): (i) Consolidated Balance Sheets as of December 31, 2024 and 2023, (ii) Consolidated Statements of Earnings for the years ended December 31, 2024, 2023 and 2022, (iii) Consolidated Statements of Comprehensive Income for the years ended December 31, 2024, 2023 and 2022, (iv) Consolidated Statements of Stockholders’ Equity for the years ended December 31, 2024, 2023 and 2022, (v) Consolidated Statements of Cash Flows for the years ended December 31, 2024, 2023 and 2022 and (vi) Notes to Consolidated Financial Statements.\n104\nTable of Contents\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nDANAHER CORPORATION\nDate:\nFebruary 20, 2025\nBy:\n \n/s/ RAINER M. BLAIR\n \nRainer M. Blair\n \nPresident and Chief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this annual report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the date indicated:\nName, Title and Signature\nDate\n/s/ STEVEN M. RALES\nFebruary 20, 2025\nSteven M. Rales\nChairman of the Board\n/s/ MITCHELL P. RALES\nFebruary 20, 2025\nMitchell P. Rales\nChairman of the Executive Committee\n/s/ RAINER M. BLAIR\nFebruary 20, 2025\nRainer M. Blair\nPresident, Chief Executive Officer and Director\n/s/ FEROZ DEWAN\nFebruary 20, 2025\nFeroz Dewan\nDirector\n/s/ LINDA FILLER\nFebruary 20, 2025\nLinda Filler\nDirector\n/s/ CHARLES W. LAMANNA\nFebruary 20, 2025\nCharles W. Lamanna\nDirector\n/s/ TERI LIST\nFebruary 20, 2025\nTeri List\nDirector\n/s/ JESSICA L. MEGA, M.D., MPH\nFebruary 20, 2025\nJessica L. Mega, M.D, MPH\nDirector\n105\nTable of Contents\n/s/ A. SHANE SANDERS\nFebruary 20, 2025\nA. Shane Sanders\nDirector\n/s/ JOHN T. SCHWIETERS\nFebruary 20, 2025\nJohn T. Schwieters\nDirector\n/s/ ALAN G. SPOON\nFebruary 20, 2025\nAlan G. Spoon\nDirector\n/s/ RAYMOND C. STEVENS, Ph.D.\nFebruary 20, 2025\nRaymond C. Stevens, Ph.D. \nDirector\n/s/ ELIAS A. ZERHOUNI, M.D.\nFebruary 20, 2025\nElias A. Zerhouni, M.D.\nDirector\n/s/ MATTHEW R. MCGREW\nFebruary 20, 2025\nMatthew R. McGrew\nExecutive Vice President and Chief Financial Officer\n/s/ CHRISTOPHER M. BOUDA\nFebruary 20, 2025\nChristopher M. Bouda\nVice President and Chief Accounting Officer\n106\nTable of Contents\nDANAHER CORPORATION AND SUBSIDIARIES\nSCHEDULE II—VALUATION AND QUALIFYING ACCOUNTS\n($ in millions)\nClassification\nBalance at Beginning of Period \n(a)\nCharged to Costs & Expenses\nImpact of Currency\nCharged to Other Accounts\n (b)\nWrite-Offs, Write-Downs & Deductions\nBalance at End of Period \n(a)\nYear ended December 31, 2024:\nAllowances deducted from asset account\nAllowance for doubtful accounts\n$\n121\n \n37\n \n(\n3\n)\n—\n \n(\n42\n)\n$\n113\n \nYear ended December 31, 2023:\nAllowances deducted from asset account\nAllowance for doubtful accounts\n$\n92\n \n43\n \n—\n \n15\n \n(\n29\n)\n$\n121\n \nYear ended December 31, 2022:\nAllowances deducted from asset account\nAllowance for doubtful accounts\n$\n90\n \n20\n \n(\n4\n)\n—\n \n(\n14\n)\n$\n92\n \n(a)     \nAmounts include allowance for doubtful accounts classified as current and noncurrent.\n(b)    \nAmounts related to businesses acquired.\n107"
  }
}