{
  "ticker": "DIS",
  "cik": "0001744489",
  "company_name": "Walt Disney Co",
  "filing_date": "2025-11-13",
  "accession": "0001744489-25-000155",
  "primary_doc": "dis-20250927.htm",
  "item_sections": {
    "item1": "ITEM 1. Business\nThe Walt Disney Company, together with the subsidiaries through which businesses are conducted (the Company), is a diversified worldwide entertainment company with operations in three segments: Entertainment, Sports and Experiences.\nThe terms “Company”, “we”, “our” and “us” are used in this report to refer collectively to the parent company and the subsidiaries through which businesses are conducted.\nENTERTAINMENT\nThe Entertainment segment generally encompasses the Company’s non-sports focused global film and episodic content production and distribution activities.\nThe lines of business within Entertainment along with their significant business activities include the following: \n•\nLinear Networks\n◦\nDomestic: ABC Television Network (ABC Network); Disney, Freeform, FX and National Geographic (owned 73% by the Company) branded television channels; and eight owned ABC television stations \n◦\nInternational: Disney, FX and National Geographic (owned 73% by the Company) branded television channels\n◦\nA 50% equity investment in A+E Global Media (formerly A+E Television Networks) (A+E), which develops and distributes content globally\n•\nDirect-to-Consumer\n◦\nDisney+: a global direct-to-consumer (DTC) service that primarily offers general entertainment and family programming. Subscribers to both Disney+ and one of the ESPN DTC plans (see Sports segment discussion) have access to certain sports content through Disney+.\n◦\nHulu: a U.S. DTC service that offers general entertainment programming and a virtual multi-channel video programming distributor (vMVPD) service that includes live linear streams of various cable and broadcast networks (Hulu Live TV service). Subscribers to both Hulu and one of the ESPN DTC plans have access to certain sports content through Hulu.\n•\nContent Sales/Licensing\n◦\nTheatrical distribution\n◦\nSale/licensing of film and episodic content to television and video-on-demand (TV/VOD) services\n◦\nHome entertainment distribution: electronic home video licenses, video-on-demand rentals and licensing of physical (DVD/Blu-ray discs) distribution rights  \n◦\nIntersegment allocation of revenues from the Experiences segment, which is meant to reflect royalties on consumer products merchandise licensing revenues generated on intellectual property (IP) created by the Entertainment segment\n◦\nStaging and licensing of live entertainment events on Broadway and around the world (Stage Plays)\n◦\nMusic distribution\n◦\nPost-production services by Industrial Light & Magic and Skywalker Sound\nTheatrical, TV/VOD and home entertainment distribution revenues are collectively referred to as “content sales.”\nEntertainment also includes the following activities that are reported with Content Sales/Licensing:\n•\nNational Geographic magazine and online business (owned 73% by the Company)\n•\nA 30% ownership interest in Tata Play Limited, which operates a direct-to-home satellite distribution platform in India\nThe revenues of Entertainment are as follows:\n•\nSubscription fees - Fees charged to customers/subscribers for our DTC streaming services, including fees charged to multi-channel video programming distributors (i.e. cable, satellite and telecommunications providers and vMVPDs) (MVPDs) and other distributors\n•\nAdvertising - Sales of advertising time/space \n•\nAffiliate fees - Fees charged to MVPDs for the right to deliver our programming to their customers. Linear Networks also generates revenues from fees charged to television stations affiliated with ABC Network.\n•\nTheatrical distribution - Rentals from licensing our films to theaters\n2\nTABLE OF CONTENTS\n•\nTV/VOD and home entertainment distribution\n◦\nLicensing fees for the right to use our film and episodic content\n◦\nElectronic sales and rentals of film and episodic content through distributors\n◦\nFees from the licensing of physical distribution rights \n•\nOther revenue - Revenues from licensing our music, ticket sales from stage play performances, fees from licensing our IP for use in stage plays, sales of post-production services and the allocation of consumer products merchandise licensing revenues\nThe expenses of Entertainment are as follows:\n•\nOperating expenses, consisting of the following:\n◦\nProgramming and production costs, which include:\n▪\nAmortization of capitalized production costs\n▪\nAmortization of the costs of licensed programming rights\n▪\nSubscriber-based fees for programming our Hulu Live TV service, including fees paid by Hulu to ESPN and the Entertainment linear networks business for the right to air their linear networks on Hulu Live TV\n▪\nProduction costs related to live programming (primarily news)\n▪\nParticipations and residual expenses\n▪\nFees paid to ESPN to program certain sports content on ABC Network and Disney+ \n◦\nOther operating expenses, which include technology support costs and distribution costs\n•\nSelling, general and administrative costs, including marketing costs\n•\nDepreciation and amortization\nLinear Networks\nThe majority of Linear Networks revenue is derived from affiliate fees and advertising. The Company’s Linear Networks businesses provide programming under multi-year licensing agreements with MVPDs and/or affiliated television stations that are generally based on contractually specified rates on a per subscriber basis. The amounts that we can charge for our networks are largely dependent on the quality and quantity of programming that we can provide and the competitive market for programming services. The ability to sell advertising time and the rates received are primarily dependent on the size and nature of the audience that the network can deliver to the advertiser as well as overall advertiser demand.\nDomestic Linear Networks\nABC Network\nABC Network programming is aired in the primetime, daytime, late night, news and sports “dayparts”. Primetime programming includes scripted and unscripted programming, movies and specials. ESPN programs the sports daypart on ABC Network, which is branded ESPN on ABC. ABC Network distributes programming to approximately 245 local affiliated television stations and to our eight owned television stations, which collectively reach almost 100% of U.S. television households. \nABC Network produces a variety of unscripted programming, primetime specials, news and daytime programming.\nDisney Channels\nBranded television channels include: Disney Channel; Disney Junior; and Disney XD (collectively Disney Channels). Disney Channels air programming 24 hours a day targeted to kids ages 2 to 14 and generally feature live-action comedy series, animated programming and preschool series as well as original movies and theatrical films.\nFreeform\nFreeform is a channel targeted to viewers ages 18 to 34 that airs original and licensed television series, films and holiday programming events.\nFX Channels\nBranded television channels include: FX; FXM; and FXX (collectively FX Channels), which air a mix of original and licensed television series and films.\nNational Geographic Channels\nBranded television channels include: National Geographic; Nat Geo Wild; and Nat Geo Mundo (collectively National Geographic Channels). National Geographic Channels air programming in genres such as travel, adventure, wildlife, documentary, science and history.\n3\nTABLE OF CONTENTS\nThe number of subscribers (in millions) for the significant domestic branded channels are as follows: \nSubscribers\n(1)\nDisney Channel\n61\nFreeform\n51\nFX\n62\nNational Geographic\n61\n(1)\nBased on Nielsen Media Research estimates as of September 2025. \nDomestic Television Stations\nThe Company owns eight television stations, six of which are located in the top ten television household markets in the U.S. Our television stations collectively reach approximately 20% of U.S. television households.\nThe stations we own are as follows:\nTV Station\nMarket\nTelevision Market\nRanking\n(1)\nWABC\nNew York, NY\n1\nKABC\nLos Angeles, CA\n2\nWLS\nChicago, IL\n3\nWPVI\nPhiladelphia, PA\n5\nKTRK\nHouston, TX\n6\nKGO\nSan Francisco, CA\n10\nWTVD\nRaleigh-Durham, NC\n22\nKFSN\nFresno, CA\n55\n(1)\nBased on Nielsen Media Research, U.S. Television Household Estimates, January 1, 2025\nInternational Linear Networks\nInternational Linear Networks use content from the Company’s various studios, including library titles, as well as content acquired from third parties. The Company operates approximately 180 general entertainment and family channels outside the U.S. in approximately 30 languages and 170 countries/territories.\nGeneral Entertainment \nGeneral Entertainment channels include FX and National Geographic, which air a variety of scripted, reality and documentary programming. As of September 2025, the estimated number of unique subscribers for our general entertainment channels, based on internal management reports, was approximately 145 million. \nFamily \nFamily channels include Disney Channel and Disney Junior, which air a variety of animated and live action original series and movies targeted to kids ages 2 to 14. As of September 2025, the estimated number of unique subscribers for our family channels, based on internal management reports, was approximately 130 million.\nEquity Investments\nThe most significant equity investment at Linear Networks is A+E. The Company’s share of A+E’s financial results are reported as “Equity in the income of investees” in the Company’s Consolidated Statements of Income.\nA+E is owned 50% by the Company and 50% by Hearst. A+E operates a variety of cable channels, the most significant of which are:\n•\nA&E – which offers entertainment programming including original reality and documentary programming\n•\nHISTORY – which offers original unscripted series and event-driven specials\n•\nLifetime  – which offers programming targeted to women\nDirect-to-Consumer\nDisney+ and Hulu are subscription-based DTC services offered individually or in various bundles, which may include one of the ESPN DTC plans and/or third-party DTC services. The majority of Direct-to-Consumer revenue is derived from subscription fees and advertising.\n4\nTABLE OF CONTENTS\nDisney+\nDisney+ offers general entertainment and family programming from the Company’s various studios, including library titles, as well as programming licensed from third parties. Disney, Pixar, Marvel, Star Wars and National Geographic branded programming are all top-level selections or “tiles” within the Disney+ interface. Outside the U.S., Disney+ includes a Star branded tile, which was rebranded as Hulu in October 2025, that features general entertainment programming. Additionally, subscribers to Disney+ have access to certain sports content through an ESPN branded tile on Disney+. In the U.S., subscribers to bundled offerings (e.g. Disney+ along with Hulu, ESPN Unlimited or ESPN Select) have access to certain content from the other services or plans on Disney+. \nDisney+ offers a subscription video-on-demand (SVOD) service without advertising in each of the markets it operates and a SVOD ad-supported service in the U.S., Canada and select Latin American and European markets. \nAs of September 27, 2025, the estimated number of paid Disney+ subscribers, based on internal management reports, was approximately 132 million.\nHulu\nHulu is a domestic DTC service with general entertainment content from the Company’s various studios as well as content licensed from third parties. Hulu offers SVOD services with or without advertising in addition to the Hulu Live TV service. The Live TV service is available with either of Hulu’s SVOD services and includes live linear streams of various cable and broadcast networks. In addition, Hulu offers subscriptions to premium services such as Max, Cinemax, Starz and Paramount+ with Showtime, which can be added to the Hulu service. Certain programming from ABC, Freeform and FX is also available on the Hulu SVOD service one day after the linear airing on these channels. Subscribers to both Hulu and one of the ESPN DTC plans have access to certain sports content through Hulu.\n As of September 27, 2025, the estimated number of paid Hulu subscribers, based on internal management reports, was approximately 64 million.\nOn October 29, 2025, the Company and FuboTV Inc. (Fubo), a publicly traded vMVPD, combined certain of Hulu Live TV assets, including its carriage agreements, subscription agreements and related data, advertising and sponsorship agreements and intellectual property exclusively related to the “Live TV” brand, with Fubo. The Company has a \n70\n% interest in the combined entity, with the remaining \n30\n% interest retained by Fubo shareholders. Hulu Live TV will continue to be available to consumers as a separate offering post-closing. See Note 4 of the Consolidated Financial Statements for further information.\nContent Sales/Licensing and Other\nThe majority of Content Sales/Licensing revenue is derived from distribution in the theatrical, TV/VOD and home entertainment windows. In addition, revenue is generated from music distribution, stage plays and post-production services through Industrial Light & Magic and Skywalker Sound.\nThe Company also publishes National Geographic magazine, which is reported with Content Sales/Licensing.\nTheatrical Distribution\nThe Company licenses full-length live-action and animated films to theaters globally. Cumulatively through fiscal year 2025, the Company has released approximately 1,100 full-length live-action films and 100 full-length animated films. Domestically and in most major international markets, we distribute and market our films directly. In certain international markets our films are distributed by independent companies. In some territories, certain films may be exclusively distributed on our DTC streaming services. During fiscal year 2026, we expect to release approximately 20 films. \nThe Company incurs significant marketing and advertising costs before and throughout the theatrical release of a film in an effort to generate public awareness of the film, to increase the public’s intent to view the film and to help generate consumer interest in the subsequent home entertainment and other ancillary markets. These costs are expensed as incurred, which may result in a loss on the theatrical distribution of a film, including in periods prior to the release of the film.\nTV/VOD Distribution\nWe license our content to third-party television networks, television stations and other video service providers for distribution to viewers on television or a variety of internet-connected devices, including through other DTC services.\nHome Entertainment Distribution\nThe Company’s film and episodic content is sold in both electronic (home video license and video-on-demand rentals) and physical formats. We distribute electronic formats through e-tailers such as Apple and Amazon, and MVPDs, such as Comcast and DirecTV. We have licensed the rights for physical distribution to third parties who generally sell to retailers, such as Walmart and Amazon. \n5\nTABLE OF CONTENTS\nElectronic formats of film content in the home entertainment window are typically available approximately two months after the theatrical release and physical distribution generally starts within three to four months after the theatrical release. \nDisney Theatrical Group\nDisney Theatrical Group develops, produces and licenses live entertainment events on Broadway and around the world. Productions include \nThe Lion King\n, \nAladdin\n, \nBeauty and the Beast\n, \nFrozen\n and \nHercules\n. \nDisney Theatrical Group also licenses the Company’s IP to Feld Entertainment, the producer of \nDisney On Ice\n.\nDisney Music Group\nThe Disney Music Group encompasses all aspects of the Company’s music commercialization and marketing including: recorded music (Walt Disney Records and Hollywood Records); music publishing; and concerts. Disney Music Group distributes music both physically and digitally and also licenses music throughout the world in various forms of media, including: television; print; gaming; and consumer products.\nEquity Investment\nThe Company has a 30% effective interest in Tata Play Limited, which operates a direct-to-home satellite distribution platform in India.\nContent Production and Acquisition\nProduced content primarily consists of original films and episodic programs and network news and daytime/late night programming. Acquired content includes rights to episodic programming, movies and specials. Original content is generally produced under the following banners: Disney Branded Television; FX Productions; Lucasfilm; Marvel; National Geographic Studios; Pixar; Searchlight Pictures; Twentieth Century Studios; 20th Television; and Walt Disney Pictures. Original content is also commissioned from and produced by various third-party studios. Program development is carried out in collaboration with writers, producers and creative teams.\n Costs to produce content are generally capitalized and allocated across Entertainment’s businesses based on the estimated relative value of the distribution windows. \nGenerally, the Company has full production and distribution rights to its IP. However, Sony Pictures Entertainment has the rights to produce and distribute Spider-Man films as a result of licensing these rights from Marvel prior to the Company’s acquisition of Marvel.\nThe Company has a significant library of content spanning approximately 100 years of production history as well as acquired libraries. The library of content includes approximately 5,300 live-action film titles, 460 animated film titles and episodic series (series with four or more seasons include approximately: 80 dramas; 55 comedies; 40 non-scripted series; 15 animated series; and 10 live-action series). In addition, the library includes approximately 150 series and 100 films that were produced for initial distribution on our DTC platforms. \nIn fiscal 2026, the Company will continue to produce or commission a significant number of episodic and film titles, of which the vast majority will initially be distributed on our Linear Networks and/or DTC platforms or theatrically. Programming is also produced for third parties, who typically have exclusive domestic linear distribution rights for a certain time period (after which the rights revert back to the Company) while the Company retains domestic video-on-demand and international distribution rights.  \nCompetition and Seasonality\nLinear Networks and Direct-to-Consumer compete for viewers’ attention and audience share primarily with other television networks, independent television stations and other media, such as other DTC streaming services, social media and video games. With respect to the sale of advertising time, we compete with other television networks, independent television stations, MVPDs, other DTC streaming services and other advertising media such as online search, marketplaces, social media and other digital content, newspapers, magazines, radio and billboards. Our television stations primarily compete for audiences and advertisers in local market areas.\nLinear Networks compete with other networks for carriage by MVPDs. The Company’s contractual agreements with MVPDs are renewed or renegotiated from time to time in the ordinary course of business. Consolidation and other market conditions in the cable, satellite and telecommunication distribution industry, including changes in subscriber levels, the prevalence of streaming services and other factors may adversely affect the Company’s ability to obtain and maintain contractual terms for the distribution of its various programming services that are as favorable as those currently in place.\nContent Sales/Licensing businesses compete with all forms of entertainment and a significant number of companies that produce and/or distribute film and episodic content, distribute products in the home entertainment market, provide pay TV/VOD services, and produce music and live theater. \n6\nTABLE OF CONTENTS\nThe operating results of Content Sales/Licensing fluctuate due to the timing and performance of releases in the theatrical, home entertainment and television markets. Release dates are determined by several factors, including competition and the timing of vacation and holiday periods.\nWe also compete with other media and entertainment companies, independent production companies and video-on-demand services for creative and performing talent, story properties, show concepts, scripted and other programming, advertiser support, production facilities and exhibition outlets that are essential to the success of our Entertainment businesses.\nAdvertising revenues at Linear Networks and Direct-to-Consumer are subject to seasonal and cyclical advertising patterns and changes in viewership levels. In general, domestic advertising revenues are typically somewhat higher during the fall and somewhat lower during the summer months. Affiliate and subscription revenues vary with the subscriber levels of MVPDs and our streaming services.\nSPORTS\nThe Sports segment generally encompasses the Company’s sports-focused global television and DTC video streaming content production and distribution activities. \nThe lines of business within Sports include the following: \n•\nESPN (generally owned 80% by the Company) (See Note 4 of the Consolidated Financial Statements for further information on potential future changes in ESPN ownership)\n◦\nDomestic:\n▪\nESPN-branded television channels\n▪\nESPN DTC\n▪\nESPN on ABC (sports programmed on the ABC Network by ESPN)\n◦\nInternational: ESPN-branded channels outside of the U.S.\nThe revenues of Sports are as follows:\n•\nAffiliate and subscription fees\n•\nAdvertising\n•\nOther revenue - Fees from the following activities: pay-per-view events on the ESPN DTC services, sub-licensing of sports rights, programming ESPN on ABC and licensing the ESPN brand \nThe expenses of Sports are as follows:\n•\nOperating expenses, consisting of programming and production costs and other operating expenses. Programming and production costs include amortization of licensed sports rights and production costs related to live sports and other sports-related programming. Other operating expenses include technology support costs and distribution costs. \n•\nSelling, general and administrative costs, including marketing costs\n•\nDepreciation and amortization\nDomestic ESPN\nBranded television channels include the following 24-hour domestic television sports channels: \n•\nESPN and ESPN2 - both dedicated to professional and college sports as well as sports news and original programming\n•\nESPNU - dedicated to college sports\n•\nESPNEWS - re-airs select ESPN studio shows and airs a variety of other programming\n•\nSEC Network - dedicated to Southeastern Conference college athletics\n•\nACC Network - dedicated to Atlantic Coast Conference college athletics\n•\nESPN Deportes - airs professional and college sports as well as studio shows in Spanish\nESPN offers a U.S. subscription-based DTC service with two plans: ESPN Select and ESPN Unlimited, which started in August 2025. ESPN Select, previously the ESPN+ service through August 2025, offers thousands of live sporting events, on-demand sports content and other original content. ESPN Unlimited includes access to all of ESPN’s branded television channels and ESPN Select content. The ESPN DTC plans are offered individually or in various bundles, including with Disney+ and Hulu. Consumers may also access the service through certain MVPDs.\nESPN programs ESPN on ABC, recognizes the direct revenues and costs for this programming and receives a fee from the ABC Network, which is eliminated in consolidation. \n7\nTABLE OF CONTENTS\nESPN earns advertising and licensing revenues from providing promotional services and licensing the ESPN BET trademark to PENN Entertainment, Inc. in connection with its operation of a sportsbook. In November 2025, this agreement was terminated effective December 1, 2025, and ESPN entered into a promotional services agreement with DraftKings Inc., under which DraftKings Inc. will serve as the exclusive sportsbook and odds provider of ESPN effective December 1, 2025.\nThe Company has various sports programming rights, which are used to produce content, including live events and sports news, aired on ESPN linear and digital platforms. Rights include the National Football League (NFL), college football (including bowl games and the College Football Playoff) and basketball, the National Basketball Association (NBA), mixed martial arts (through the end of calendar 2025), Major League Baseball (MLB), the National Hockey League (NHL), soccer, US Open Tennis, Formula 1 (through the end of calendar 2025), the Wimbledon Championships, the Masters golf tournament, the Women’s National Basketball Association (WNBA) and the Professional Golfers’ Association (PGA) Championship. Beginning in September 2025, ESPN platforms became the exclusive distributor for all World Wrestling Entertainment Premium Live Events.\nThe number of subscribers (in millions) for the significant domestic branded channels are as follows: \nSubscribers\nESPN\n(1)\n61\nESPN2\n(1)\n61\nESPNU\n(1)\n42\nESPNEWS\n(2)\n38\nSEC Network\n(2)\n42\nACC Network\n(2)\n41\n(1)\nBased on Nielsen Media Research estimates as of September 2025. Estimates include traditional MVPD and vMPVD subscriber counts. \n(2)\nBecause Nielsen Media Research does not measure this channel, estimated subscribers are according to SNL Kagan as of December 2024.\nIn October 2025, ESPN and NFL Enterprises LLC reached a binding agreement for ESPN to acquire the NFL Network and certain other media assets owned and controlled by NFL Enterprises LLC, including NFL’s RedZone Channel pay TV distribution and NFL Fantasy, in exchange for a 10% noncontrolling interest of ESPN (the NFL Transaction). The NFL Transaction is expected to close in calendar year 2026, subject to certain regulatory approvals, including from federal and foreign antitrust authorities, and other customary closing conditions. See Note 4 of the Consolidated Financial Statements for further information.\nInternational ESPN\nThe Company operates approximately 45 ESPN branded sports channels outside the U.S. in 4 languages and approximately 110 countries/territories. In the Netherlands, the ESPN branded channels are operated by Eredivisie Media & Marketing CV (EMM) (owned 51% by the Company), which has the media rights to the Dutch Premier League for soccer. Rights include various soccer leagues (including English Premier League, LaLiga, Bundesliga and multiple UEFA leagues). \nEquity Investments\nThe most significant equity investment at Sports is a 30% interest in CTV Specialty Television, Inc. (CTV), which operates primarily sports-related television networks in Canada. The Company’s share of CTV’s financial results is reported as “Equity in the income of investees” in the Company’s Consolidated Statements of Income. \nCompetition and Seasonality\nSports competes for viewers’ attention and audience share primarily with other television networks, independent television stations and other media, such as other DTC streaming services, social media and video games. With respect to the sale of advertising time, we compete with other television networks, independent television stations, MVPDs and other advertising media such as online search, marketplaces, social media and other digital content, newspapers, magazines, radio and billboards. \nThe Sports television networks compete with other networks for carriage by MVPDs. The Company’s contractual agreements with MVPDs are renewed or renegotiated from time to time in the ordinary course of business. Consolidation and other market conditions in the cable, satellite and telecommunication distribution industry and other factors may adversely affect the Company’s ability to obtain and maintain contractual terms for the distribution of its various programming services that are as favorable as those currently in place.\n8\nTABLE OF CONTENTS\nWe also compete with other media and entertainment companies and video-on-demand services for sports rights, creative and performing talent and other programming, advertiser support and production facilities that are essential to the success of our Sports businesses.\nAdvertising revenues are subject to changes in viewership levels and the demand for sports programming. Advertising revenues generated from sports programming are also impacted by the timing of sports seasons and events, which timing may vary throughout the year or may take place periodically (e.g. biannually, quadrennially). Affiliate and subscription revenues vary with the subscriber levels of MVPDs and our streaming services.\nEXPERIENCES \nThe lines of business within Experiences along with their significant business activities include the following:\n•\nParks & Experiences:\n◦\nDomestic:\n▪\nTheme parks and resorts:\n•\nWalt Disney World Resort in Florida\n•\nDisneyland Resort in California\n▪\nExperiences:\n•\nDisney Cruise Line\n•\nDisney Vacation Club, including Aulani, a Disney Resort & Spa in Hawaii\n•\nNational Geographic Expeditions (owned 73% by the Company) and Adventures by Disney\n◦\nInternational:\n▪\nTheme parks and resorts:\n•\nDisneyland Paris\n•\nHong Kong Disneyland Resort (48% ownership interest and consolidated in our financial results)\n•\nShanghai Disney Resort (43% ownership interest and consolidated in our financial results)\n•\nIn addition, the Company licenses its IP to a third party that owns and operates Tokyo Disney Resort\n•\nConsumer Products:\n◦\nLicensing of our trade names, characters, visual, literary and other IP to various manufacturers, game developers, publishers and retailers throughout the world, for use on merchandise, published materials and games\n◦\nSale of branded merchandise through online, retail and wholesale businesses, and development and publishing of books, comic books and magazines (except National Geographic magazine, which is reported in Entertainment)\nThe revenues of Experiences are as follows:\n•\nTheme park admissions - Sales of tickets for admission to our theme parks and for premium access to certain attractions \n•\nResorts and vacations - Sales of room nights at hotels, sales of cruise and other vacations and sales and rentals of vacation club properties\n•\nParks & Experiences merchandise, food and beverage - Sales of merchandise, food and beverages at our theme parks and resorts and cruise ships\n•\nMerchandise licensing and retail:\n◦\nMerchandise licensing - Royalties from licensing our IP for use on consumer goods \n◦\nRetail - Sales of merchandise through internet shopping sites, at The Disney Store and to wholesalers\n•\nParks licensing and other - Revenues from sponsorships and co-branding opportunities, real estate rent and sales and royalties earned on Tokyo Disney Resort revenues\nThe expenses of Experiences are as follows:\n•\nOperating expenses, consisting of operating labor, infrastructure costs, costs of goods sold and distribution costs and other operating expenses. Infrastructure costs include technology support costs, repairs and maintenance, utilities and fuel, property taxes, retail occupancy costs, insurance and transportation. Other operating expenses include costs for such items as supplies, commissions and entertainment offerings. \n•\nSelling, general and administrative costs, including marketing costs\n•\nDepreciation and amortization\n9\nTABLE OF CONTENTS\nCapital investments:\n•\nIn recent years, the majority of the Company’s capital spend has been at our parks and experiences business, principally for theme park and resort expansion, new attractions, cruise ships, capital improvements and systems infrastructure. \nParks & Experiences\nWalt Disney World Resort\nThe Walt Disney World Resort is located approximately 20 miles southwest of Orlando, Florida, on approximately 25,000 acres of land. The resort includes theme parks (the Magic Kingdom, EPCOT, Disney’s Hollywood Studios and Disney’s Animal Kingdom); hotels; vacation club properties; a retail, dining and entertainment complex (Disney Springs); a sports complex; conference centers; campgrounds; golf courses; water parks; and other recreational facilities designed to attract visitors for an extended stay.\nThe Walt Disney World Resort is marketed through a variety of international, national and local advertising and promotional activities. A number of attractions and restaurants in the theme parks are sponsored or operated by other companies under multi-year agreements.\nMagic Kingdom\n — The Magic Kingdom consists of six themed areas: Adventureland, Fantasyland, Frontierland, Liberty Square, Main Street USA and Tomorrowland. Each area provides a unique guest experience featuring themed attractions, restaurants, merchandise shops and entertainment experiences. \nEPCOT \n— EPCOT consists of four major themed areas: World Showcase, World Celebration, World Nature and World Discovery. All areas feature themed attractions, restaurants, merchandise shops and entertainment experiences. Countries represented with pavilions include Canada, China, France, Germany, Italy, Japan, Mexico, Morocco, Norway, the United Kingdom and the U.S. \nDisney’s Hollywood Studios\n — Disney’s Hollywood Studios consists of eight themed areas: Animation Courtyard, Commissary Lane, Echo Lake, Grand Avenue, Hollywood Boulevard, \nStar Wars\n: Galaxy’s Edge, Sunset Boulevard and Toy Story Land. The areas provide behind-the-scenes glimpses of Hollywood-style action through various themed attractions, restaurants, merchandise shops and entertainment experiences.\nDisney’s Animal Kingdom\n — Disney’s Animal Kingdom consists of a 145-foot tall Tree of Life centerpiece surrounded by five themed areas: Africa, Asia, DinoLand USA, Discovery Island and Pandora - The World of Avatar. Each area contains themed attractions, restaurants, merchandise shops and entertainment experiences. The park features more than 300 species of live mammals, birds, reptiles and amphibians and 3,000 varieties of vegetation. DinoLand USA will be rethemed and in 2027, is planned to open as Tropical Americas, which will feature themed attractions, restaurants, merchandise shops and entertainment experiences.\nHotels, Vacation Club Properties and Other Resort Facilities\n — As of September 27, 2025, the Company owned and operated 18 resort hotels and vacation club properties at the Walt Disney World Resort, with approximately 23,000 rooms and 3,900 vacation club units. Resort facilities include 500,000 square feet of conference meeting space and Disney’s Fort Wilderness camping and recreational area, which offers approximately 800 campsites. \nDisney Springs is an approximately 120 acre themed retail, dining and entertainment complex and consists of four areas: Marketplace, The Landing, Town Center and West Side. The areas are home to approximately 150 venues including the World of Disney retail store, which includes approximately 38,000 square feet of retail space. Most of the offerings at Disney Springs are operated by third parties that pay rent to the Company.\nTen independently-operated hotels with approximately 7,000 rooms are situated on property leased from the Company.\nThe ESPN Wide World of Sports Complex is an approximately 230 acre center that hosts professional-caliber training and competitions, festival and tournament events and interactive sports activities. The complex, which welcomes both amateur and professional athletes, accommodates multiple sporting events, including baseball, basketball, football, soccer, softball, tennis and track and field. It also includes a stadium and two venues designed for cheerleading, dance competitions and other indoor sports. \nOther recreational amenities and activities available at the Walt Disney World Resort include three championship golf courses, miniature golf courses, full-service spas, tennis, sailing, swimming, horseback riding and a number of other sports and leisure time activities. The resort also includes two water parks: Disney’s Blizzard Beach and Disney’s Typhoon Lagoon.\n10\nTABLE OF CONTENTS\nDisneyland Resort\nThe Disneyland Resort is located in Anaheim, California on approximately 550 acres of land. The resort includes two theme parks (Disneyland and Disney California Adventure), three hotels and a retail, dining and entertainment complex (Downtown Disney).\nThe Disneyland Resort is marketed through a variety of international, national and local advertising and promotional activities. A number of attractions and restaurants in the theme parks are sponsored or operated by other companies under multi-year agreements.\nDisneyland\n — Disneyland consists of nine themed areas: Adventureland, Bayou Country, Fantasyland, Frontierland, Main Street USA, Mickey’s Toontown, New Orleans Square, \nStar Wars\n: Galaxy’s Edge and Tomorrowland. These areas feature themed attractions, restaurants, merchandise shops and entertainment experiences. \nDisney California Adventure\n — Disney California Adventure includes eight themed areas: Avengers Campus, Buena Vista Street, Cars Land, Grizzly Peak, Hollywood Land, Paradise Gardens Park, Pixar Pier and San Fransokyo Square. These areas include themed attractions, restaurants, merchandise shops and entertainment experiences.\nHotels, Vacation Club Units and Other Resort Facilities\n — As of September 27, 2025, the Company owned and operated three resort hotels and vacation club properties at the Disneyland Resort, with approximately 2,400 rooms and 180 vacation club units. Resort facilities included approximately 170,000 square feet of conference meeting space.\nDowntown Disney is an approximately 15-acre themed retail, dining and entertainment complex with approximately 40 venues including the World of Disney retail store, which includes approximately 25,000 square feet of retail space. Most of the offerings at Downtown Disney are operated by third parties that pay rent to the Company.\nDisneyland Paris\nDisneyland Paris is located approximately 20 miles east of Paris, France in Marne-la-Vallée on a 5,200-acre site that is being developed by Disneyland Paris pursuant to a master agreement with French governmental authorities. To date, approximately two-thirds of the site has been developed including properties owned and operated by third parties and a planned community (Val d’Europe). Disneyland Paris’ operations include two theme parks (Disneyland Park and Walt Disney Studios Park); seven themed resort hotels; two convention centers; and a retail, dining and entertainment complex (Disney Village).\nDisneyland Park\n — Disneyland Park consists of five themed areas: Adventureland, Discoveryland, Fantasyland, Frontierland and Main Street USA. These areas include themed attractions, restaurants, merchandise shops and entertainment experiences.\nWalt Disney Studios Park\n — Walt Disney Studios Park includes four themed areas: Front Lot, World Premiere Plaza, Worlds of Pixar and Avengers Campus. These areas include themed attractions, restaurants, merchandise shops and entertainment experiences. Walt Disney Studios Park is undergoing a multi-year expansion that will include a new themed area based on \nFrozen\n, which is planned to open in 2026 and coincide with the renaming of Walt Disney Studios Park to Disney Adventure World.\nHotels and Other Facilities\n — Disneyland Paris operates seven resort hotels, with approximately 5,750 rooms and 250,000 square feet of conference meeting space.\nDisney Village is an approximately 500,000-square-foot themed retail, dining and entertainment complex. Construction is currently underway on a multi-year transformation of Disney Village. Several of the offerings at Disney Village are operated by third parties that pay rent to the Company.\nVal d’Europe is a planned community near Disneyland Paris that is being developed in phases. Val d’Europe currently includes a regional train station, hotels and a town center consisting of a shopping center as well as office, commercial and residential space. Third parties operate these developments on land leased or purchased from the Company.\nHong Kong Disneyland Resort\nThe Company owns a 48% interest in Hong Kong Disneyland Resort and the Government of the Hong Kong Special Administrative Region (HKSAR) owns a 52% interest. The resort is located on Lantau Island on 310 acres of land and is in close proximity to the Hong Kong International Airport and the Hong Kong-Zhuhai-Macau Bridge. Hong Kong Disneyland Resort includes one theme park and three themed resort hotels. A separate Hong Kong subsidiary of the Company is responsible for managing Hong Kong Disneyland Resort. The Company is entitled to receive royalties and management fees based on the revenues and operating performance, respectively, of Hong Kong Disneyland Resort.\nHong Kong Disneyland \n— Hong Kong Disneyland consists of eight themed areas: Adventureland, Fantasyland, Grizzly Gulch, Main Street USA, Mystic Point, Tomorrowland, Toy Story Land and World of Frozen. These areas feature themed attractions, restaurants, merchandise shops and entertainment experiences. \n11\nTABLE OF CONTENTS\nHotels\n — Hong Kong Disneyland Resort includes three themed hotels with approximately 1,750 rooms and 16,000 square feet of conference meeting space.\nShanghai Disney Resort\nThe Company owns a 43% interest in Shanghai Disney Resort and Shanghai Shendi (Group) Co., Ltd (Shendi) owns a 57% interest. The resort is located in the Pudong district of Shanghai on approximately 1,000 acres of land, which includes the Shanghai Disneyland theme park; two themed resort hotels; a retail, dining and entertainment complex (Disneytown); and an outdoor recreation area. A management company, in which the Company has a 70% interest and Shendi has a 30% interest, is responsible for operating the resort and receives a management fee based on the operating performance of Shanghai Disney Resort. The Company is also entitled to royalties based on the resort’s revenues.\nShanghai Disneyland\n — Shanghai Disneyland consists of eight themed areas: Adventure Isle, Fantasyland, Gardens of Imagination, Mickey Avenue, Tomorrowland, Toy Story Land, Treasure Cove and Zootopia. These areas feature themed attractions, shows, restaurants, merchandise shops and entertainment experiences. \nHotels and Other Facilities\n — Shanghai Disneyland Resort includes two themed hotels with approximately 1,200 rooms. Disneytown is an 11-acre outdoor complex of retail, dining, and entertainment venues located adjacent to Shanghai Disneyland. Most of the offerings at Disneytown are operated by third parties that pay rent to Shanghai Disney Resort. A third themed hotel, which will have approximately 400 rooms, is currently under construction. \nTokyo Disney Resort\nTokyo Disney Resort is located six miles east of downtown Tokyo, Japan, on 494 acres of land. The Company earns royalties on revenues generated by the Tokyo Disney Resort, which is owned and operated by Oriental Land Co., Ltd. (OLC), a third-party Japanese corporation. The resort includes two theme parks (Tokyo Disneyland and Tokyo DisneySea); hotels; a retail, dining and entertainment complex (Ikspiari); and Bon Voyage, a Disney-themed merchandise location.\nTokyo Disneyland \n— Tokyo Disneyland consists of seven themed areas: Adventureland, Critter Country, Fantasyland, Tomorrowland, Toontown, Westernland and World Bazaar.\nTokyo DisneySea\n — Tokyo DisneySea is divided into eight “ports of call,” including American Waterfront, Arabian Coast, Lost River Delta, Mediterranean Harbor, Mermaid Lagoon, Mysterious Island, Port Discovery and Fantasy Springs. \nHotels and Other Resort Facilities\n — Tokyo Disney Resort includes six Disney-branded hotels, with approximately 3,500 rooms and a monorail, which links the theme parks and resort hotels with Ikspiari.\nAbu Dhabi Resort\nIn May 2025, the Company and Miral LLC (Miral) agreed to create a Disney-branded theme park and resort in Abu Dhabi, United Arab Emirates, to be built and operated by Miral. The Company will license its IP for the operation of the resort and provide certain development and management services. The Company will earn royalties based on the resort’s revenues and fees for development and management services. The Company will not provide capital for the development and operation of the resort. The development of the resort is subject to finalizing agreements among the parties.\nDisney Cruise Line\nDisney Cruise Line operates six ships out of ports in North America, Europe and the South Pacific which cater to families, children, teenagers and adults, with themed areas and activities for each group. The \nDisney Magic\n and the \nDisney Wonder\n are 85,000-ton 875-stateroom ships; the \nDisney Dream\n and the \nDisney Fantasy\n are 130,000-ton 1,250-stateroom ships; and the \nDisney Wish\n and the \nDisney Treasure\n are 140,000-ton 1,250-stateroom ships. Many cruises include a visit to Disney Castaway Cay, a 1,000-acre private Bahamian island, and/or Disney Lookout Cay at Lighthouse Point, which is located on approximately 600 acres of land on the island of Eleuthera.\nIn fiscal 2026, Disney Cruise Line will add two new ships, the \nDisney Destiny\n and the \nDisney Adventure.\n The \nDisney Destiny\n will be approximately 140,000 tons with 1,250 staterooms and is scheduled to begin sailing on November 20, 2025 in North America. The \nDisney Adventure\n will be approximately 200,000 tons with approximately 2,100 staterooms and is scheduled to begin sailing in March 2026 in Southeast Asia.\nBetween calendar years 2027 and 2031, Disney Cruise Line plans to launch four additional cruise ships, all of which are currently under contract to be built. \nThe Company has a licensing agreement with OLC, under which OLC will own and operate a Disney-branded cruise ship based in Japan. This ship is currently under construction, with sailings expected to commence by 2029. The Company will earn royalties on revenues generated by OLC. \n12\nTABLE OF CONTENTS\nDisney Vacation Club (DVC)\nDVC offers ownership interests in 17 resort properties located at the Walt Disney World Resort; Disneyland Resort; Aulani, a Disney Resort & Spa in Hawaii; Vero Beach, Florida; and Hilton Head Island, South Carolina. Available units are offered for sale under vacation ownership plans and are operated as hotel rooms when not occupied by DVC members. \nAulani, a Disney Resort & Spa is a family resort on a 21 acre oceanfront property on Oahu, Hawaii featuring approximately 480 vacation club units, 350 hotel rooms, an 18,000-square-foot spa and 12,000 square feet of conference meeting space.\nDVC had a total of approximately 4,700 (two-bedroom equivalent) vacation club units as of fiscal year end 2025. Development is underway at Disney Lakeshore Lodge, which is projected to open in 2027, and will include approximately 430 vacation club units. \nAdventures by Disney and National Geographic Expeditions\nAdventures by Disney and National Geographic Expeditions offer guided tour packages around the world, predominantly at third party locations.\nStoryliving by Disney\nThe Company is collaborating with developers to build \nStoryliving by Disney\n residential communities: \nCotino \nin Rancho Mirage, California; and \nAsteria\n in Pittsboro, North Carolina. The communities are currently under development.\nConsumer Products\nLicensing\nThe Company’s merchandise licensing operations cover a diverse range of product categories, including: toys, apparel, games, home décor and furnishings, accessories, health and beauty, food, stationery, footwear and consumer electronics. The Company licenses characters from its film, television and other properties for use on third-party products in these categories and earns royalties, which are usually based on a fixed percentage of the wholesale or retail selling price of the products and often include minimum guarantee payments from the licensees. Major properties licensed by the Company include: Mickey and Friends, Lilo & Stitch, Star Wars, Spider-Man, Disney Princess, Frozen, Avengers, Winnie the Pooh and Toy Story.\nRetail\nThe Company sells Disney-, Marvel-, Pixar- and Star Wars-branded products through Disney Store internet sites and retail locations. At fiscal year end 2025, the Company operated approximately 40 stores in Japan, 20 stores in North America, two stores in Europe and one store in China. \nThe Company creates, distributes and publishes a variety of products, primarily children’s books and comic books, in multiple countries and languages based on the Company’s branded franchises.\nCompetition and Seasonality\nThe Company’s Parks & Experiences businesses compete with other forms of entertainment, lodging, tourism and recreational activities. The profitability of the leisure-time industry may be influenced by various factors that are not directly controllable, such as economic conditions including business cycle and exchange rate fluctuations, health concerns, the political environment, travel industry trends, amount of available leisure time, oil and transportation prices, weather patterns and natural disasters. The licensing and retail business competes with other licensors, retailers and publishers of character, brand and celebrity names, as well as other licensors, publishers and developers of game software, online video content, websites, other types of home entertainment and retailers of toys and kids merchandise.\nAll of the Parks & Experiences businesses are operated on a year-round basis. Typically, theme park attendance and resort occupancy fluctuate based on the seasonal nature of vacation travel and leisure activities, the opening of new guest offerings and pricing and promotional offers. Peak attendance and resort occupancy generally occur during the summer months when school vacations occur and during early winter and spring holiday periods. In addition, theme park and resort revenues may be higher during significant celebrations such as theme park or character anniversaries and lower in the periods following such celebrations. The licensing, retail and wholesale businesses are influenced by seasonal consumer purchasing behavior, which generally results in higher revenues during the Company’s first and fourth fiscal quarter, and by the timing and performance of theatrical and game releases and direct-to-consumer programming.\nINDIA JOINT VENTURE\nOn November 14, 2024, the Company and Reliance Industries Limited (RIL) formed a joint venture (the India joint venture) that combined the Company’s Star-branded and other general entertainment and sports television channels and Disney+ Hotstar direct-to-consumer service in India (Star India) with certain media and entertainment businesses controlled by \n13\nTABLE OF CONTENTS\nRIL (the Star India Transaction). The Company owns 37% of the India joint venture and recognizes its share of the joint venture’s results in “Equity in the income of investees” in the Company’s Consolidated Statement of Income. Star India results through November 14, 2024 were consolidated in the Company’s financial results. See Note 4 of the Consolidated Financial Statements for additional information.\nHUMAN CAPITAL\nThe Company seeks to attract, retain and develop the highest quality talent. The Company’s human resources programs are designed to develop talent to prepare them for critical roles and leadership positions for the future; reward and support employees through competitive pay, benefit and perquisite programs; enhance the Company’s culture through efforts aimed at making the workplace more engaging and inclusive; acquire talent and facilitate internal talent mobility to create a high-performing workforce; engage employees as brand ambassadors of the Company and evolve and invest in technology, tools and resources to enable employees at work.\nThe Company employed approximately 231,000 people as of fiscal year end 2025, of which approximately 172,000 were employed in the U.S. and approximately 59,000 were employed outside the U.S. Our global workforce comprises approximately 76% full-time and 16% part-time employees, with another 8% being seasonal employees. A significant number of employees in various parts of our businesses, including employees of our theme parks, and writers, directors, actors and production personnel for our productions are covered by collective bargaining agreements. In addition, some of our employees outside the U.S. are represented by works councils, trade unions or other employee associations.\nSome of our key programs and initiatives to attract, develop and retain our workforce include:\n•\nHealth, financial, family resources, well-being and other benefits:\n Disney’s benefit offerings are designed to meet the varied and evolving needs of our employees and their families. These benefit offerings for eligible employees include:\n◦\nHealthcare options aimed at improving quality of care while limiting out-of-pocket costs\n◦\nRetirement and savings programs that help employees adapt to changing needs and unexpected events and drive financial security in the present and the future\n◦\nFamily care resources, such as childcare and senior care programs, long-term care coverage and a family building benefit\n◦\nPaid time-off programs, including vacation and sick and family care leave\n◦\nFree mental health and well-being resources \n◦\nGlobal well-being programs, including in-person offerings through campus health clubs and virtual and onsite events and activities focused on physical, emotional, financial and social well-being\n◦\nTwo Centers for Living Well in the Orlando area that offer convenient, on-demand access to board-certified physicians and counselors\n•\nTalent Development and Education:\n We invest in creating opportunities to help employees grow and build their careers through training, professional development and educational programs. \n◦\nOur professional development programs are designed to support the career aspirations of our employees. In fiscal 2025, we launched new leadership development opportunities, including new professional coaching opportunities.\n◦\nOur education investment program, Disney Aspire, offers assistance for tuition, books and fees to eligible participating employees at a variety of in-network learning providers and universities at levels ranging from high school completion to undergraduate degrees.\n•\nSocial Impact:\n The Company has a longstanding commitment to social impact by supporting children and communities through our philanthropic efforts, including through our support of wish granting and children’s hospitals. We also support communities in which we operate and the contributions of our employees. The Company supports employees who make monetary donations to eligible nonprofits with a generous U.S. matching gifts program. In addition, through the Disney VoluntEARS program, we encourage employees to donate their time and talents to their local communities and provide grants that allow eligible employees to direct donations from the Company to nonprofits of their choosing as a benefit for the time they spend volunteering. \nENVIRONMENTAL SUSTAINABILITY\nThe Company has developed measurable environmental sustainability goals for 2030, based on our assessment of where the Company’s operations have the most significant environmental impacts and where we can most effectively mitigate those impacts. The Company’s goals encompass science-based targets for Scope 1, 2 and 3 emissions, water stewardship, waste reduction, sustainable design in construction and use of more sustainable materials in our products.\n14\nTABLE OF CONTENTS\nINTELLECTUAL PROPERTY PROTECTION\nThe Company’s businesses throughout the world are affected by its ability to exploit and protect against infringement of its IP, including trademarks, trade names, copyrights, patents and trade secrets. Important IP includes rights in the content of motion pictures, television programs, electronic games, sound recordings, character likenesses, theme park attractions, books and magazines and merchandise. Risks related to the protection and exploitation of IP rights and information concerning the expiration of certain of our copyrights are set forth in",
    "item1a": "Item 1A – Risk Factors, the Company faces an increasingly challenging cybersecurity environment, and from time to time the persistent efforts of bad actors to gain unauthorized access to our and our service providers’ information systems and our confidential and proprietary information are successful. \nIn fiscal 2025, we did not identify any cybersecurity threats that have materially affected or are reasonably likely to materially affect our business strategy, results of operations or financial condition.\n However, despite our efforts, we cannot eliminate all risks from cybersecurity threats or provide assurances that we have not experienced undetected cybersecurity incidents or will not discover additional information about previously detected events.\nGovernance\nThe Company’s Board of Directors has delegated to \nthe Audit Committee\n oversight responsibility for information technology risks, including cybersecurity and data security risks and mitigation strategies.\n \nThe Audit Committee at least annually receives reports from the Senior Vice President, Chief Information Security Officer (CISO) concerning the Company’s cybersecurity and data security risks, including ongoing efforts to prevent, detect, monitor, remediate and manage such cybersecurity threats, the threat environment, incident updates and emerging cybersecurity practices and technologies.\n \nThe Chair of the Audit Committee reports on its discussion, including concerning cybersecurity matters, to the full Board.\n In \n27\nTABLE OF CONTENTS\naddition, from time to time, senior management briefs the Audit Committee, the Audit Committee Chair and the Board on cybersecurity matters potentially of interest, including cybersecurity events, regulatory disclosures and regulatory trends.\n \nDay-to-day management of our information security strategy and operations is currently the responsibility of our CISO, who reports to our Chief Information and Data Officer and our Chief Security Officer, both of whom report to our Chief Financial Officer. \nOur CISO has approximately 15 years of experience working in information security positions, including having served as CISO for publicly traded companies. That experience is supplemented by the collective experience and expertise of our dedicated internal teams of cybersecurity personnel.\n \nIn addition, the Company’s RMC, a management level committee that includes, among others, the Chief Financial Officer and Chief Legal and Compliance Officer, oversees and supports the Company’s ongoing efforts to identify, assess and prioritize, manage and monitor the Company’s enterprise risks, including risks related to privacy and cybersecurity, and periodically reports certain discussions to the Company’s Chief Executive Officer and Audit Committee. The RMC’s Cybersecurity Incident Disclosure Subcommittee, whose members include the members of the RMC, the CISO and lead securities counsel, is tasked with assessing significant events for materiality, related timely and accurate disclosure under the securities laws and, as appropriate, escalating such events to the Audit Committee and the Board of Directors.",
    "item1b": "ITEM 1B. Unresolved Staff Comments\nThe Company has received no written comments regarding its periodic or current reports from the staff of the SEC that were issued 180 days or more preceding the end of fiscal 2025 that remain unresolved.",
    "item1c": "ITEM 1C. Cybersecurity\nRisk Management and Strategy\nWe have implemented processes for assessing, identifying and managing material risks from cybersecurity threats as part of our overall risk management program.\n Our cybersecurity program is informed by the National Institute of Standards and Technology Cybersecurity Framework and other applicable globally recognized standards. \nWe use a layered defense model, incorporating a wide range of technologies and practices in an effort to prevent, detect and mitigate threats. These measures include intrusion detection and prevention systems, multi-factor authentication, account management and access controls, encryption and endpoint protection tools. We also implement threat detection and response solutions. To address emerging threats, we employ automated monitoring, vulnerability scans and patch management processes, network monitoring and defenses, antivirus/antimalware protections and network segmentations.\n Regular assessments, such as penetration tests, security audits and table-top exercises, are conducted to identify vulnerabilities and promote incident response and risk mitigation. We also provide privacy and information security trainings for our employees on a recurring basis. \nFrom time to time, we engage auditors, assessors, consultants and other third parties to assist with assessing, identifying and managing cybersecurity risks, including assisting us to conduct some of the foregoing assessments.\n Our cybersecurity risk management processes also are informed by intelligence received from law enforcement and other governmental agencies, private sector intelligence networks, recognized cybersecurity and intelligence firms and other third-party sources, and as appropriate we engage outside counsel to advise on regulatory compliance and other cybersecurity risk management efforts.\nIn addition, we have processes designed to oversee and identify cybersecurity risks associated with our use of third-party service providers. Where appropriate based on the data and intellectual property to which these providers are reasonably expected to have access, we conduct security assessments and due diligence reviews of third-party systems for compliance with our security standards, and we include data protection language in our agreements with these third parties.\nFurther, as part of our cybersecurity risk management processes, we maintain a cybersecurity incident response plan (CIRP) that establishes a set of procedures for reporting and handling cybersecurity events. The CIRP delegates to an internal incident response team the initial assessment, investigation and remediation of the event and includes, among other procedures, guidelines for escalation to senior management and engagement with law enforcement. In certain instances, events are escalated to the Cybersecurity Incident Disclosure Subcommittee, which is a subcommittee of the Company’s Risk Management Committee (RMC) (discussed further below) and is responsible for, among other things, the accurate and timely disclosure of material cybersecurity incidents under the federal securities laws, including making the materiality determination and approving related securities disclosures.\nAs discussed in further detail in"
  }
}