{
  "ticker": "DLR",
  "cik": "0001297996",
  "company_name": "DIGITAL REALTY TRUST, INC.",
  "filing_date": "2025-02-25",
  "accession": "0001558370-25-001424",
  "primary_doc": "dlr-20241231x10k.htm",
  "item_sections": {
    "item1": "ITEM 1.     BUSINESS\nThe Company\nDigital Realty Trust, Inc., through its controlling interest in Digital Realty Trust, L.P. and the subsidiaries of the Operating Partnership, is a leading global provider of data center, colocation and interconnection solutions for customers across a variety of industry verticals. The Parent operates as a REIT for U.S. federal income tax purposes. The Operating Partnership is the entity through which the Parent conducts its business of owning, acquiring, developing and operating data centers. The Parent was incorporated in the state of Maryland on March 9, 2004. The Operating Partnership was organized as a limited partnership in the state of Maryland on July 21, 2004.\nAs of December 31, 2024, our portfolio consisted of 308 data centers (including 78 data centers held as investments in unconsolidated entities), of which 121 are located in the United States, 112 are located in Europe, 36 are located in Latin America, 16 are located in Africa, 16 are located in Asia, six are located in Australia and three are located in Canada.\nOur principal executive offices are located at 2323 Bryan Street, Suite 1800, Dallas, Texas 75201. Our telephone number is (214) 231-1350. Our website is www.digitalrealty.com. The information found on, or otherwise accessible through, our website is not incorporated by reference into, nor does it form a part of, this Annual Report on Form 10-K.\nIndustry Background\nThe digital economy continues to grow and change how enterprises across all industries create and deliver value. Companies increasingly need to operate ubiquitously, on-demand and with real-time intelligence serving customers, partners and employees across multiple channels, business functions and points of business presence. Computational processing power requirements continue to advance, data traffic is growing, and the volume of data that enterprises generate, transmit, process, analyze, monitor and manage is expanding dramatically. The Internet of Things, 5G, autonomous vehicles and artificial intelligence, among other technological advancements, are driving this digital transformation.\nWe believe that enterprise data growth is accelerating due to the growing digital economy and emerging technological advances. As enterprises analyze and process this accelerating data mass, they create more data. As this mass of data continues to grow, it needs to be analyzed and processed: a task which we believe is becoming increasingly challenging to replicate and relocate. This phenomenon is called Data Gravity. We believe that enterprise decisionmakers will need to increasingly consider how Data Gravity impacts their enterprise IT architectures and, accordingly, we have developed the Data Gravity Index: a global forecast that measures the intensity and gravitational force of enterprise data growth.\nAs the largest global provider of cloud- and carrier-neutral data center, colocation and interconnection solutions, we believe the data center industry is poised for sustainable growth. The demand for data center infrastructure is being driven by this digital transformation which is contributing to the explosive growth of data, rapid growth of cloud adoption and greater demand for IT outsourcing. The power requirements and financial costs to support this growth in data, traffic and storage are substantial and growing accordingly. We believe data centers will continue to play a critical role in the digital economy and enabling business transformation strategies.\nWe believe cloud solutions and hybrid cloud solutions will remain significant drivers of demand for data center infrastructure. The hybrid cloud, which combines public and private cloud solutions, has gained traction because it enables corporate enterprises to achieve efficiencies and contain costs, as well as scale and secure their most sensitive information. In addition, the leading cloud service providers are generally mature, well-capitalized technology companies, and cloud platforms are among the fastest-growing business segments. Data center providers that can solve global coverage, capacity and connectivity needs, and coordinate and aggregate diverse customer and application demand, are poised to benefit from these cloud-specific industry drivers.\n1\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nThese diverse and secular industry dynamics are driving greater demand for data center capacity not only from global cloud service providers, but also from businesses across other industries, including IT service firms, social media, content providers and the financial services sector. As companies focus on their core competencies and rely on outsourcing to meet their IT infrastructure needs, they are prioritizing colocation for their data center solutions for various reasons, including to reduce latency in data transfer and increase global presence and connectivity. New technologies need a fast, reliable and flexible foundation to operate, and the importance of offering a full spectrum of power, space and connectivity solutions on a global platform continues to grow.\nOur Business\nWe provide a global data center platform that supports our customers’ digital infrastructure and enables our customers to interconnect with their customers and partners. We solve global coverage, capacity and connectivity needs for companies of all sizes, including the world’s leading enterprises and services providers, through PlatformDIGITAL®, a global data center platform for scaling digital business which enables customers to deploy their critical infrastructure with a global data center provider.\nPlatformDIGITAL® combines our global presence with our Pervasive Data Center Architecture (PDx®) solution methodology for scaling digital business and efficiently managing data gravity challenges. Digital Realty gives its customers access to the connected communities that matter to them with a global data center footprint of over 300 facilities with over 227,000 cross connects in over 50 metros across more than 25 countries on six continents. \nFundamentally, we bring together foundational real estate and innovative technology expertise around the world to deliver a comprehensive, dedicated product suite to meet customers’ data and connectivity needs. We represent an important part of the digital economy that we believe will benefit from powerful, long-term growth drivers.\nWe believe that the growth trends in the data center market, technology, the cloud, internet traffic and internet-based services, combined with cost advantages in outsourcing data center requirements, provide attractive growth opportunities for us as a data center solutions provider. Leveraging deep expertise in technology and real estate, we have an expansive global footprint, impressive scale and a full-spectrum fit-for-purpose product offering in key metropolitan areas around the world. These advantages simplify the contracting process for multinational enterprises, eliminating their need to negotiate with multiple local data center solutions providers. In addition, in areas where high data center construction and operating costs and long time-to-market prohibit many of our customers from building their own data centers, our global footprint and scale allow us to meet our customers’ needs quickly and efficiently.\n2\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nOur Data Center Portfolio\nOur portfolio of high-quality data centers provides secure, highly connected and continuously available environments for the exchange, processing and storage of critical data. Data centers are used for digital communication, disaster recovery purposes, transaction processing and housing mission-critical corporate IT applications. Our internet gateway data centers are highly connected, network-dense facilities that serve as hubs for internet and data communications within and between major metropolitan areas. We believe internet gateways are extremely valuable, and a high-quality, highly interconnected global portfolio such as ours could not be easily replicated today on a cost-competitive basis.\nWe are diversified across major metropolitan areas characterized by a high concentration of connected end-users and technology companies. At December 31, 2024, we owned or had investments in properties, on a wholly-owned basis or through unconsolidated entities, in the following geographies:\n​\nAs of December 31, 2024, our portfolio, including investments in unconsolidated entities, contained a total of approximately 54.9 million rentable square feet, including approximately 8.9 million square feet of space under active development and 4.7 million square feet of space held for development. As of December 31, 2024, the 78 data centers held as investments in unconsolidated entities had an aggregate of approximately 9.2 million rentable square feet. In addition, as of December 31, 2024, we estimate that our land and other space held for, or actively under, construction could accommodate over 3,500 megawatts of additional data center capacity, including more than 1,000 additional megawatts developable in Northern Virginia. From time to time, we may look to sell individual assets or portfolios that we do not consider to be core to our business and growth strategy.\nA significant component of our current and future growth is expected to be generated through the development of our existing space held for future development and acquisition of new properties. As of December 31, 2024, our portfolio, including the 78 data centers held as investments in unconsolidated entities, was approximately 84.1% leased. From time to time, we may look to sell individual assets or portfolios that we do not consider to be core to our business and growth strategy.\n3\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nThrough strategic investments, we have expanded our footprint into Latin America, enhanced our data center offerings in strategic and complementary U.S. metropolitan areas, established our colocation and interconnection platform in the U.S. and expanded our colocation and interconnection platform in Europe and Africa, with each transaction enhancing our presence in top-tier locations throughout North America, Europe, Latin America and Africa. In addition, on August 1, 2022, we completed our acquisition \nof a majority interest in Teraco, the largest and most densely interconnected data center platform in South Africa, with an in-service portfolio of seven state-of-the-art data centers strategically located in the key South African metro areas of Johannesburg, Cape Town and Durban. In addition, we are investing in our consolidated and unconsolidated portfolio to organically expand our capacity. As of December 31, 2024, we had 644 megawatts of projects underway across multiple metropolitan areas around the world, and 70% percent of this data center activity was pre-leased.\nThe locations of and improvements to our data centers, the network density, interconnection infrastructure and connectivity-centric customers in certain of our facilities, and our comprehensive product offerings are critical to our customers’ businesses, which we believe results in high occupancy levels, longer average lease terms and customer relationships, as well as lower turnover. In addition, many of our data centers contain significant improvements that have been installed at our customers’ expense. The tenant improvements in our data centers are generally readily adaptable for use by similar customers.\nOur data centers are physically secure, network-rich and equipped to meet the power and cooling requirements of smaller footprints up to the most demanding IT applications. Many of our data centers are located on major aggregation points formed by the physical presence of multiple major telecommunications service providers, which reduces our customers’ costs and operational risks and enhances the attractiveness of our properties. In addition, our strategically located global data center campuses offer our customers the ability to expand their global footprint as their businesses grow, while our connectivity offerings on our campuses enhance the capabilities and attractiveness of these facilities. Further, the network density, interconnection infrastructure and connectivity-centric customers in certain of our data centers have led to the organic formation of densely connected data communities that are difficult for competitors to replicate and deliver added value to our customers.\nOur Product Offerings\nWe provide a flexible, global data center platform that allows our customers to achieve infrastructure deployments and controls matched to their business needs. Our data centers and comprehensive suite of product offerings are conceived to scale, from a single cabinet up to multi-megawatt data halls, complemented by connectivity and partnered solutions to support their requirements. We strive to provide a product mix that appeals to leading technology companies and enterprises, especially those seeking to support a greater portion of their data center requirements through a single provider. Our Critical Facilities Management® services and team of engineers and data center operations experts provide 24/7 support for these mission-critical facilities.\n​\nPlatformDIGITAL® Solution Model\n.\n The PlatformDIGITAL® solution model is based on our patented Pervasive Data Center Architecture (PDx®) methodology, which brings users, networks, clouds, controls and systems to the data, removing barriers, creating centers of data exchange to accommodate distributed workflows and scaling digital business. PlatformDIGITAL® offers solutions for service providers and enterprises supporting their IT architecture requirements with features such as:\nNetwork \n \nConsolidates and localizes traffic into ingress/egress points to optimize network performance and cost\nControl \n \nHosts adjacent security and IT controls to improve security posture and Hybrid-IT operations\nData \n \nLocalizes data aggregation, staging, analytics, streaming and data management to optimize data exchange and Private AI workloads\n​\nHigh Density\n​\nSupports advances in mechanical cooling for next generation chipsets / infrastructure, maximizing performance of customer data center infrastructure \n4\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nCapacity\n​\nProduct Types \n \nDescription\n0 to 1 MW \n(Colocation)\n​\n \nSmall (one cabinet) to medium (150 cabinets) deployments\nProvides agility to quickly deploy in days\nContract length generally 2-5 years\nConsistent designs, operational environment, power expenses\n> 1 MW\n(Scale & Hyperscale\nPowered Base Building\n®\n)\n \nScale from medium to very large deployments\nSolution can be executed in weeks\nContract length generally 5-10+ years\nCustomized data center environment for specific deployment needs\n​\nThe PlatformDIGITAL\n®\n solution model is available in our colocation and scale data centers, which are move-in ready, physically secure facilities with the power, cooling and interconnection capabilities to support customers requiring a cabinet, cage, suite or entire hall or building. We believe our colocation facilities are effective solutions for customers who may lack the bandwidth, capital budget, expertise or desire to provide their own extensive data center infrastructure, management and security. We believe our offerings are also well-suited for those customers who seek to efficiently exchange data with others in our connected data communities lowering their costs and creating value for their business. For customers who possess the ability to build and operate their own facility, our Powered Base Building® solution provides the physical location, requisite power and network access necessary to support a state-of-the-art data center.\n​\nAdditionally, our data center campuses offer our customers the opportunity to expand in or near their existing deployments within our data center campuses.\n​\nConnectivity\n​\nProduct\n \nDescription\nCross Connect\n \nA physical connection between two customer defined end points in a Digital Realty facility enabling customers to directly exchange data traffic\nCampus Connect\n \nLocal, dedicated connectivity solution within Digital Realty campus environments located in hyperconnected metros around the world enabling multiple facilities on a single campus to exchange data traffic and therefore operate as a virtual single data center\nMetro Connect\n \nDedicated connection between multiple Digital Realty facilities located in the same metro area enabling fast connectivity for data traffic between them\nServiceFabric™\n \nA global open orchestration platform enabling customers to easily provision global connectivity and orchestrate connected services across Digital Realty’s worldwide data center footprint and in third party locations\nIP Bandwidth\n \nDedicated Internet Access using blend of ISPs. Provides customer with highly resilient customer dedicated connections including Fixed and Burstable Service options\nPathway\n \nConduit based access to support bulk fiber interconnection, typically terminating into the POP or Meet Me Room within a given facility\n​\n5\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nThrough investments and strategic partnerships, we have significantly expanded our capabilities as a leading provider of interconnection and cloud-enablement services globally. We believe interconnection is an attractive line of business that would be difficult to build organically and enhances the overall value proposition of our data center product offerings. Through product offerings such as our ServiceFabric™ and partnerships with cloud service providers, we can support our customers’ hybrid cloud architecture requirements.\nOur Global Customers\nOur portfolio has attracted a high-quality, diversified mix of customers. We have more than 5,000 customers, and no single customer represented more than approximately 11.5% of the aggregate annualized recurring revenue of our portfolio as of December 31, 2024.\nGlobal Customer Base across a Wide Variety of Industry Sectors\n. \nWe use our in-depth knowledge of requirements for trends impacting cloud and information technology service providers, content providers, network and communications providers, and other data center users, including enterprise customers, to market our data centers to meet these customers’ specific technology needs. Our customers are increasingly launching multi-regional deployments and growing with us globally. Our largest customer accounted for approximately 11.5% of our aggregate annualized recurring revenue as of December 31, 2024. No other single customer accounted for more than approximately 6.4% of the aggregate annualized recurring revenue of our portfolio. Our customers represent a variety of industry verticals, ranging from cloud and information technology services, communications and social networking to financial services, manufacturing, energy, gaming, life sciences and consumer products.\n​\n​\n​\n​\n​\nCloud and IT Services\n​\nDigital Content Providers and Financial Companies\n​\nNetwork and Mobile Services\nFortune 50 Software Company\n​\nFortune 25 Investment Grade-Rated Company\n​\nAT&T\nGlobal Cloud Provider\n​\nJPMorgan Chase & Co.\n​\nComcast Corporation\nIBM\n​\nLinkedIn Corporation\n​\nLumen Technologies, Inc.\nOracle Corporation\n​\nMeta Platforms, Inc.\n​\nVerizon\n​\nProven Experience Attracting and Retaining Customers\n.\n Our specialized data center salesforce, which is aligned to meet our customers’ needs for global, enterprise and network solutions, provides a robust pipeline of new customers, while existing customers continue to grow and expand their utilization of our technology-enabled services to support a greater portion of their IT needs.\nOur Design, Engineering and Construction Program\nOur extensive development activity, operating scale and process-based approach to data center design and construction result in significant cost savings and added value for our customers. We have leveraged our purchasing power by securing global purchasing agreements and developing relationships with major equipment manufacturers, reducing costs and shortening delivery timeframes on key components, including major mechanical and electrical equipment. See \"We and our customers may experience supply chain or procurement disruptions, or increased supply chain costs, which may lead to delays.\" in",
    "item1a": "Item 1A, Risk Factors. Moreover, we operate in a very competitive and rapidly changing environment. New risk factors emerge from time to time and it is not possible for management to identify all such risk factors, nor can we assess the impact of all such risk factors on the business or the extent to which any factor, or combination of factors, may cause actual results to differ materially from those contained in any forward-looking statements. While forward-looking statements reflect our good faith beliefs, they are not guaranties of future performance. We disclaim any obligation to publicly update or revise any forward-looking statement to reflect changes in underlying assumptions or factors, new information, data or methods, future events or other changes.",
    "item1b": "ITEM 1B.         UNRESOLVED STAFF COMMENTS\nNone.\n​",
    "item1c": "ITEM 1C.         CYBERSECURITY\nCybersecurity Risk Management and Strategy\n​\nWe have developed and implemented cybersecurity risk management processes intended to protect the confidentiality, integrity, and availability of our information systems. \n​\nWe utilize the United States National Institute of Standards and Technology, Cybersecurity Framework (NIST CSF) in considering the design and in assessing our processes.  This does not imply that we meet any particular technical standards, specifications, or requirements, only that we use the NIST CSF as a guide to help us identify, assess, and manage cybersecurity risks relevant to our business.\n​\n47\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​\nWe have \nintegrated\n aspects of our cybersecurity risk management processes into our overall risk management program through, for example, common methodologies, reporting channels and governance processes that apply across the overall risk management program to other risk areas.\n​\nOur cybersecurity risk management processes include, but are not limited to:\n​\n●\nindependent maturity assessments designed to help identify significant cybersecurity risks to our IT environment and systems; \n​\n●\na cyber resilience team jointly responsible for managing (1) our cybersecurity risk assessment processes, (2) our security controls, and (3) our response to cybersecurity incidents;  \n​\n●\nthe use of \nexternal service providers\n, where appropriate, to assess, test or otherwise assist with aspects of our security controls;\n​\n●\ncybersecurity awareness training of our employees, incident response personnel, and senior management; \n​\n●\na cybersecurity incident response plan that includes procedures for responding to cybersecurity incidents; and\n​\n●\na risk management process for service providers, suppliers, and vendors that aligns to our compliance requirements.\n​\nWe have not identified risks from known cybersecurity threats \nas a result of any prior cybersecurity incidents that have materially affected us, including our operations, business strategy, results of operations, or financial condition. We face complex risks from cybersecurity threats that, if realized, are reasonably likely to materially affect us, including our operations, business strategy, results of operations, or financial condition\n. See “Risk Factors—We and our third-party providers are vulnerable to cyberattacks and security breaches that could materially disrupt or compromise our operations, data and results.”\n There can be no assurance that our cybersecurity risk management processes, including our policies, controls or procedures, will be fully implemented as currently anticipated, complied with or effective in protecting our systems and information or in allowing us to recover from a cybersecurity incident.\n​\nCybersecurity Governance\n​\nOur Board considers cybersecurity and other information technology risks as part of its risk management and compliance oversight function. \nThe Board\n oversees management’s implementation of our cybersecurity risk management processes and receives reports from management on our cybersecurity risks at least twice a year. \nIn addition, management updates the Board, as necessary, regarding any material cybersecurity incidents, as well as any incidents with lesser impact potential. The Board receives briefings from management on our cyber risk management processes, and it receives presentations on cybersecurity topics from our Chief Technology Officer, Chief Information Security Officer and Chief Information Officer, internal security staff or external experts as part of the Board’s continuing education on topics that impact public companies.\n​\nOur management team has overall responsibility for assessing and managing material risks from cybersecurity threats, and for executing on our cybersecurity risk management processes.  \nOur\n \nChief Technology Officer, Chief Information Officer and Chief Information Security Officer\n, among others, have decades of combined experience in areas such as information technology, compliance, and cybersecurity program design and management.  Additionally, certain leaders and personnel within the cybersecurity operations team hold industry certifications, such as Certified Information Systems Security Professional or Certified Information Security Manager.\n \nOur management team works closely with our cybersecurity operations team to stay informed about and monitor efforts to prevent, detect, mitigate, and remediate cybersecurity risks and incidents through various means, which may include \nbriefings\n from internal security personnel, threat intelligence and other information obtained from governmental, public or private sources, including external consultants engaged by us, and alerts and reports produced by security tools deployed in the IT, Operational Technology (OT), and products and services environments\n.\n48\n\n\nTable of Contents\n​\nIndex to Financial Statements\n​"
  }
}