{
  "ticker": "DLTR",
  "cik": "0000935703",
  "company_name": "DOLLAR TREE, INC.",
  "filing_date": "2025-03-26",
  "accession": "0000935703-25-000015",
  "primary_doc": "dltr-20250201.htm",
  "item_sections": {
    "item1": "Item 1A. Risk Factors\n”: “\nLegal proceedings may adversely affect our reputation, business, results of operations or financial condition”\n on page 19 and “\nOur failure to comply with applicable law, or to adequately respond to changes to such laws, could increase our expenses, expose us to legal risks or otherwise adversely affect us”\n on page 20.\nItem 4. Mine Safety Disclosures\nNone.\n24\nTable of Contents\nPART II\nItem 5. Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nOur common stock is traded on \nThe Nasdaq Global Select Market\n® under the symbol “DLTR.” As of March 24, 2025, we had 1,909 shareholders of record.\nIssuer Purchases of Equity Securities\nWe periodically repurchase shares of our common stock under share repurchase programs authorized by our Board of Directors. Under the existing Board repurchase authorization, we may repurchase up to $2.5 billion of our common stock in open market or privately negotiated transactions with financial institutions. The repurchase authorization does not have an expiration date. \nWe repurchased 3,283,837, 3,905,599 and 4,613,696 shares of common stock on the open market at a cost of $403.6 million, $504.3 million and $647.5 million, including applicable excise tax, in fiscal 2024, fiscal 2023 and fiscal 2022, respectively. The fiscal 2024 share repurchases occurred prior to the fourth quarter. As of February 1, 2025, we had $952.4 million remaining under our existing $2.5 billion Board repurchase authorization. \nStockholder Matters\nWe anticipate that substantially all of our cash flow from operations in the foreseeable future will be retained for the development and expansion of our business, the repayment of indebtedness and, as authorized by our Board of Directors, the repurchase of stock. We do not anticipate paying cash dividends on our common stock in fiscal 2025. \n25\nTable of Contents\nStock Performance Graph\nThe following graph sets forth the yearly percentage change in the cumulative total shareholder return on our common stock during the five fiscal years ended February 1, 2025, compared with the cumulative total returns of the S&P 500 Index and the S&P 500 Consumer Discretionary Distribution & Retail Index. The comparison assumes that $100 was invested in our common stock and in each of the foregoing indices at the market close on the last trading day of the fiscal year ended February 1, 2020, and that dividends were reinvested. The stock price performance shown in the graph is not necessarily indicative of future price performance.\nYear Ended\nFebruary 1, 2020\nJanuary 30, 2021\nJanuary 29, 2022\nJanuary 28, 2023\nFebruary 3, 2024\nFebruary 1, 2025\nDollar Tree, Inc.\n$100.00 \n$116.76 \n$147.57 \n$172.70 \n$159.31 \n$84.24 \nS&P 500 Index\n100.00 \n117.25 \n144.56 \n132.68 \n160.30 \n202.59 \nS&P 500 Consumer Discretionary Distribution\n    & Retail Index\n100.00 \n141.39 \n153.61 \n125.62 \n162.21 \n227.91 \nItem 6. Reserved\n26\nTable of Contents\nItem 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nIn Management’s Discussion and Analysis, we explain the general financial condition and the results of operations for our company, including, factors that affect our business, analysis of annual changes in certain line items in the consolidated financial statements, expenditures incurred for capital projects and sources of funding for future expenditures. As you read Management’s Discussion and Analysis, please refer to our consolidated financial statements and related notes, included in “\nItem 8. Financial Statements and Supplementary Data\n” of this Form 10-K. \nDuring fiscal 2024, the Family Dollar business met the held for sale and discontinued operations accounting criteria. Accordingly, the results of operations of the Family Dollar business are reported as discontinued operations in the accompanying Consolidated Statements of Operations for all periods presented and the related assets and liabilities are classified as assets and liabilities of discontinued operations in the accompanying Consolidated Balance Sheets. Unless otherwise noted, all amounts, percentages and discussions below reflect only the results of operations and financial condition of our continuing operations. \nOverview\nWe are a leading operator of more than 8,800 retail discount stores, as of February 1, 2025, offering merchandise predominantly at the opening price point of $1.25, with additional offerings at higher price points.\nOur net sales are derived from the sale of merchandise. Two major factors tend to affect our net sales trends. First is our success at opening new stores. Second is the performance of stores once they are open which can be impacted by a number of factors including operational performance, competition, inflation, consumer buying preferences and changes in the product assortment, pricing, or quality. Sales vary at our existing stores from one year to the next. We refer to this as a change in comparable store net sales, because we include only those stores that are open throughout both of the periods being compared, beginning after the first fifteen months of operation. We include sales from stores expanded, relocated or remodeled during the year in the calculation of comparable store net sales, which has the effect of increasing our comparable store net sales. Stores that were converted from Family Dollar stores to Dollar Tree stores are considered to be new stores and are not included in the calculation of the comparable store net sales change until after the first fifteen months of operation under the Dollar Tree brand. Additionally, sales that are excluded from the calculation of comparable store net sales are referred to as non-comparable store sales and consist of sales from new stores open fifteen months or less and stores that are closed permanently or expected to be closed for more than 90 days.\n2024 Financial Highlights\nFinancial highlights for the fiscal year ended February 1, 2025, as compared to the fiscal year ended February 3, 2024, include:\n•\nNet sales increased 4.7% to $17,565.8 million, due to a 1.8% comparable store net sales increase and net sales of $1.1 billion at non-comparable stores. The 53\nrd\n week in fiscal 2023 accounted for $307.0 million of the total net sales.\n•\nGross profit increased 4.5% to $6,281.7 million as a result of our net store growth. Gross profit, as a percentage of net sales, remained unchanged in fiscal 2024 as the cost of sales rate is 64.2% in both fiscal 2024 and 2023.\n•\nSelling, general and administrative expenses, as a percentage of total revenues, increased 220 basis points to 27.5%.\n•\nOperating income, as a percentage of total revenues, decreased 230 basis points to 8.3%. \n•\nThe effective tax rate increased to 24.7% compared to 23.8% in the prior year. \n•\nIncome from continuing operations was $1,042.5 million, or $4.83 per diluted share, compared to $1,265.8 million, or $5.76 per diluted share.\n27\nTable of Contents\nStore Activity & Selected Sales Data\nAt February 1, 2025, we operated stores in 48 states and the District of Columbia, as well as stores in five Canadian provinces. The average size of stores opened in fiscal 2024 was approximately 10,990 selling square feet. A breakdown of the changes in store count and square footage is as follows:\nYear Ended\nFebruary 1, 2025\nFebruary 3, 2024\nJanuary 28, 2023\nStore Count:\nBeginning\n8,415 \n8,134 \n8,061 \nNew stores\n525 \n333 \n131 \nStores converted from or to Family Dollar\n12 \n15 \n(5)\nClosings\n(71)\n(67)\n(53)\nEnding\n8,881 \n8,415 \n8,134 \nRelocations\n22 \n31 \n28 \nSelling Square Feet (in millions):\nBeginning\n73.1 \n70.5 \n69.7 \nNew stores\n5.8 \n3.1 \n1.1 \nStores converted from or to Family Dollar*\n0.1 \n0.1 \n— \nClosings\n(0.6)\n(0.6)\n(0.4)\nRelocations*\n— \n— \n0.1 \nEnding\n78.4 \n73.1 \n70.5 \n*Selling square footage impact of converted or relocated stores is only provided if it equals or exceeds 0.1 million selling square feet.\nThe store counts above do not include new stores until they are opened for sales. Similarly, stores converted from a Family Dollar store to a Dollar Tree store, or vice versa, are reflected in the table above when they opened or closed, respectively.\nFiscal 2024 and fiscal 2022 which ended on February 1, 2025 and January 28, 2023, respectively, each included 52 weeks. Fiscal 2023 ended on February 3, 2024 and included 53 weeks, commensurate with the retail calendar. The 53\nrd\n week in fiscal 2023 added approximately $307.0 million in sales. \nThe percentage change in comparable store net sales, as compared with the preceding year, is as follows:\nYear Ended\nFebruary 1, 2025\nFebruary 3, 2024\nJanuary 28, 2023\nSales Growth\n1.8 \n%\n5.8 \n%\n9.0 \n%\nChange in Customer Traffic\n1.6 \n%\n7.4 \n%\n(3.9)\n%\nChange in Average Ticket\n0.1 \n%\n(1.5)\n%\n13.4 \n%\nComparable store net sales are positively affected by our expanded, relocated and remodeled stores, which we include in the calculation, and are negatively affected when we open new stores or expand stores near existing stores. The comparable store net sales change for the years ended February 1, 2025 and January 28, 2023 is based on a 52-week comparison for both periods included in the calculation. The comparable store net sales change for the year ended February 3, 2024 is based on a 53-week comparison for both periods included in the calculation. \nNet sales per selling square foot is calculated based on total net sales for the preceding 12 months as of the end of the reporting period divided by the average selling square footage during the period. Selling square footage excludes the storage, receiving and office space that generally occupies approximately 20% of the total square footage of our stores. We believe that net sales per selling square foot more accurately depicts the productivity and operating performance of our stores as it reflects the portion of our footprint that is dedicated to selling merchandise. \n28\nTable of Contents\nNet sales per selling square foot for the last three fiscal years is as follows:\n52 Weeks Ended\n53 Weeks Ended\n52 Weeks Ended\nFebruary 1, 2025\nFebruary 3, 2024\nJanuary 28, 2023\nNet sales per selling square foot\n$232\n$234\n$220\nThe 53\nrd\n week in fiscal 2023 contributed $4 to the total net sales per selling square foot. See our “Strategic Initiatives and Recent Developments” below for more information on the initiatives that are driving our comparable store net sales growth and net sales per selling square foot growth.\nStrategic Initiatives and Recent Developments\nWe continue to execute on a number of strategic initiatives to drive productive sales growth, improve operating efficiency, invest in technology, and expand our culture of service to our associates. These initiatives include, among others, and in no particular order, the following:\nDollar Tree Merchandising. \nWe continue to expand our brand assortment at the $1.25 price point to provide greater value to our customers and increase customer traffic and store productivity. We are continuing to expand our multi-price product assortment, which began with the introduction of $3 and $5 products in select discretionary categories, expanded into $3, $4 and $5 frozen and refrigerated product, and now comprises a wide assortment of other consumable and discretionary product at varying price points. As of February 1, 2025, we had approximately 2,900 multi-price format stores, including approximately 2,600 conversions and 300 new stores.\n99 Cents Only Stores Acquisition. \nDuring the second quarter of fiscal 2024, we acquired designation rights for up to 170 leases of 99 Cents Only Stores across Arizona, California, Nevada and Texas. The designation rights were acquired following the bankruptcy of 99 Cents Only Stores, which provided us an attractive opportunity to secure leases in priority markets. We secured the leases for 164 of these stores and substantially all have opened as Dollar Tree stores.\nOur Workforce & Our Workplace. \nWe are investing in our talent, including initiatives to provide competitive pay and benefits, enhanced training, and attractive career opportunities to deliver an enhanced associate experience, reduce turnover, and improve our store standards and efficiencies and ultimately the customer experience. Additional initiatives include projects to optimize and modernize our stores, with a focus on improving the in-store experience through renovations and customer service enhancements. \nSupply Chain Optimization\n. Our supply chain initiatives include expanding and enhancing our distribution and transportation network, including investments in our truck fleet, transportation management systems, a new distribution center with enhanced automation to improve efficiency, and a new RotaCart delivery process to streamline the truck unloading and store delivery process. Significant investments are also underway to improve climate control conditions in our distribution centers. These investments are expected to negatively impact gross margin in the near-to-mid term. \nTechnology Investment.\n We continue our multi-year plan for significant investment in our technology across our business, including our mobile apps, human capital management system and supply chain system. We believe these improvements can promote operational efficiencies and deliver an elevated customer experience.\nMarietta, Oklahoma Distribution Center.\n In the first quarter of fiscal 2024, a tornado destroyed our distribution center in Marietta, Oklahoma. Based on the significant damage sustained by the facility, the inventory contained in the facility and the facility itself are not salvageable. We have pivoted our supply chain network to deliver products to the approximately 600 Marietta-serviced stores, and we believe these efforts have limited and will continue to limit disruption to the Dollar Tree shopping experience. We are incurring additional costs within our supply chain as a result of servicing these impacted stores, including additional stem miles for delivered product and outside storage, and expect such costs to continue negatively impacting gross margin in the near-to-mid term.\nGeneral Liability Claims Development.\n Our self-insured general liability claims related to customer accidents and other incidents at our stores continue to develop unfavorably due to the rising costs to reimburse, settle, or litigate the claims. As a result, our actuarially determined liabilities were increased during the second quarter of fiscal 2024, contributing to a $45.3 million increase in our general liability claim expenses compared to the prior year second quarter. For the full year, fiscal 2024 general liability claim expenses increased $20.4 million compared to fiscal 2023.\nThe liabilities related to our self-insurance programs, which include general liability claims, are estimates that require judgment and the use of assumptions. See the “\nCritical Accounting Estimates and Assumptions\n” later in this “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” for more information on the estimates and assumptions related to these liabilities. Such estimates are inherently uncertain, and future changes in claim trends and assumptions could result in significant adjustments to our liabilities, which could materially and adversely affect our results of operations.\n29\nTable of Contents\nFamily Dollar Store Portfolio Optimization and Strategic Alternatives Reviews.\n During the fourth quarter of fiscal 2023, we announced that we had initiated a comprehensive store portfolio optimization review, which involved identifying stores for closure, relocation or re-bannering based on an evaluation of current market conditions and individual store performance, among other factors. As a result of the portfolio optimization review, we identified approximately 970 underperforming Family Dollar stores, including approximately 600 stores to be closed in the first half of fiscal 2024, and approximately 370 stores to be closed at the end of each store's current lease term. As of February 1, 2025, we had closed approximately 695 stores identified under the portfolio optimization review.\nDuring the second quarter of fiscal 2024, we announced that we had initiated a formal review of strategic alternatives for the Family Dollar business, which could have included among others, a potential sale, spin-off or other disposition of the business. This strategic alternatives review concluded in the fourth quarter of fiscal 2024 and resulted in the decision to sell the Family Dollar business. As a result, we concluded the Family Dollar business met the held for sale and discontinued operations accounting criteria. On March 25, 2025, the Company entered into a definitive agreement to sell the Family Dollar business to Brigade Capital Management, LP and Macellum Capital Management, LLC, for a purchase consideration of $1,007.0 million, subject to a number of adjustments, including with respect to working capital and net indebtedness. The closing of the transaction is subject to satisfaction of customary closing conditions, including receipt of U.S. antitrust approval. Net proceeds are estimated to total approximately $804.0 million. For information on discontinued operations, refer to \nNote 2\n to our consolidated financial statements under the caption “Assets Held for Sale and Discontinued Operations” and \nNote 15\n. \nResults of Operations\nOur results of operations and year-over-year changes are discussed in the following section. Note that the cost of sales rate is calculated by dividing cost of sales by net sales. Gross profit margin is calculated as gross profit (i.e., net sales less cost of sales) divided by net sales. The selling, general and administrative expense rate and operating income margin are calculated by dividing the applicable amount by total revenue. Basis points, as referred to below, are a percentage of net sales for expense categories within gross profit and cost of sales, and are a percentage of total revenue for all other expense categories. A 100 basis point increase equals 1.00% and a 1 basis point increase equals 0.01%.\nThe following table contains results of operations data for the last three fiscal years:\nYear Ended\n(in millions, except percentages)\nFebruary 1, 2025\nFebruary 3, 2024\nJanuary 28, 2023\nRevenues\nNet sales\n$\n17,565.8 \n$\n16,770.3 \n$\n15,405.7 \nOther revenue\n12.7 \n10.8 \n5.8 \nTotal revenue\n17,578.5 \n16,781.1 \n15,411.5 \nExpenses\nCost of sales\n11,284.1 \n10,761.4 \n9,630.2 \nSelling, general and administrative expenses\n4,832.4 \n4,245.2 \n3,682.0 \nOperating income\n1,462.0 \n1,774.5 \n2,099.3 \nInterest expense, net\n107.5 \n112.5 \n127.2 \nOther (income) expense, net\n(29.1)\n0.1 \n0.4 \nIncome from continuing operations before income taxes\n1,383.6 \n1,661.9 \n1,971.7 \nProvision for income taxes\n341.1 \n396.1 \n471.6 \nIncome from continuing operations\n$\n1,042.5 \n$\n1,265.8 \n$\n1,500.1 \nGross profit margin\n35.8 \n%\n35.8 \n%\n37.5 \n%\nSelling, general and administrative expense rate\n27.5 \n%\n25.3 \n%\n23.9 \n%\nOperating income margin\n8.3 \n%\n10.6 \n%\n13.6 \n%\nInterest expense, net as a percentage of total revenue\n0.6 \n%\n0.7 \n%\n0.8 \n%\nIncome from continuing operations before income taxes as a percentage of total revenue\n7.9 \n%\n9.9 \n%\n12.8 \n%\nEffective tax rate\n24.7 \n%\n23.8 \n%\n23.9 \n%\nIncome from continuing operations as a percentage of total revenue\n5.9 \n%\n7.5 \n%\n9.7 \n%\n \n30\nTable of Contents\nNet Sales\nYear Ended\nPercentage Change\n(dollars in millions)\nFebruary 1, 2025\nFebruary 3, 2024\nJanuary 28, 2023\n Fiscal 2024 vs. Fiscal 2023 \n Fiscal 2023 vs. Fiscal 2022 \nNet sales\n$\n17,565.8 \n$\n16,770.3 \n$\n15,405.7 \n4.7 \n%\n8.9 \n%\nComparable store net sales change\n1.8 \n%\n5.8 \n%\n9.0 \n%\nFiscal 2024 compared to Fiscal 2023\nThe increase in net sales from fiscal 2023 to fiscal 2024 was a result of the comparable store net sales increase and net sales of $1.1 billion at non-comparable stores. Comparable store net sales increased 1.8% in fiscal 2024, as a result of a 1.6% increase in customer traffic and a 0.1% increase in average ticket. This increase is based on a 52-week comparison for both periods. The 53\nrd\n week in fiscal 2023 accounted for $307.0 million of the total net sales.\nThe low single-digit comparable store net sales increase was primarily impacted by the macro economic environment which continues to affect our customers due to the impact of inflationary pressures and higher interest rates. We expect these sales trends, and the resulting negative impact on operating income, to continue in the near-to-mid term.\nFiscal 2023 compared to Fiscal 2022\nThe increase in net sales from fiscal 2022 to fiscal 2023 was a result of the comparable store net sales increase and net sales of $467.1 million at non-comparable stores. Comparable store net sales increased 5.8% in fiscal 2023, as a result of a 7.4% increase in customer traffic, partially offset by a 1.5% decrease in average ticket. This increase is based on a 53-week comparison for both periods. The 53\nrd\n week in fiscal 2023 accounted for $307.0 million of the total net sales increase.\nGross Profit\nYear Ended\nPercentage Change\n(dollars in millions)\nFebruary 1, 2025\nFebruary 3, 2024\nJanuary 28, 2023\n Fiscal 2024 vs. Fiscal 2023 \n Fiscal 2023 vs. Fiscal 2022 \nGross profit\n$\n6,281.7 \n$\n6,008.9 \n$\n5,775.5 \n4.5 \n%\n4.0 \n%\nGross profit margin\n35.8 \n%\n35.8 \n%\n37.5 \n%\n— \n%\n(1.7)\n%\nFiscal 2024 compared to Fiscal 2023\nGross profit margin remained unchanged in fiscal 2024 as the cost of sales rate is 64.2% in both fiscal 2024 and 2023. Changes in the cost of sales rates consist of lower freight costs, offset by increased sales of higher cost consumable merchandise, increased occupancy costs resulting from the loss of leverage from the low single-digit comparable store net sales increase and the 53\nrd\n week of sales in 2023, higher distribution costs, increased shrink costs resulting from unfavorable inventory results, and increased markdown costs for slow moving items. Included in freight costs for fiscal 2024 is $25.0 million of duties related to an anti-dumping case for paper plates imported in fiscal 2024.\nFiscal 2023 compared to Fiscal 2022\nGross profit margin decreased in fiscal 2023 due to a 170 basis point increase in cost of sales. The cost of sales rate increased to 64.2% in fiscal 2023 from 62.5% in fiscal 2022 primarily due to re-investment in value-product assortments after transitioning to the $1.25 price point during the prior year, increased sales of higher cost consumable merchandise, higher distribution costs, increased shrink costs resulting from unfavorable inventory results, partially offset by lower freight costs and decreased occupancy costs resulting from the leverage from the comparable store net sales increase and leverage from the 53\nrd\n week of sales in 2023.\nSelling, General and Administrative Expenses\nYear Ended\nPercentage Change\n(dollars in millions)\nFebruary 1, 2025\nFebruary 3, 2024\nJanuary 28, 2023\n Fiscal 2024 vs. Fiscal 2023 \n Fiscal 2023 vs. Fiscal 2022 \nSelling, general and administrative\n   expenses\n$\n4,832.4 \n$\n4,245.2 \n$\n3,682.0 \n13.8 \n%\n15.3 \n%\nSelling, general and administrative\n   expense rate\n27.5 \n%\n25.3 \n%\n23.9 \n%\n2.2 \n%\n1.4 \n%\nFiscal 2024 compared to Fiscal 2023\nThe selling, general and administrative expense rate increased 220 basis points in fiscal 2024 primarily due to higher depreciation expense from store investments, software impairments and related contract termination costs, temporary labor to support our multi-\n31\nTable of Contents\nprice rollout, higher utilities costs, higher stock compensation expense resulting from the accelerated vesting of the former Chief Executive Officer’s option award, the loss of leverage from the low single-digit comparable store net sales increase and the loss of leverage from the 53rd week of sales in the prior year. The software impairments and related contract termination costs totaled $58.0 million and were related to enterprise merchandising and store system projects that were not fully implemented and were cancelled in connection with the decision to sell the Family Dollar business.\nFiscal 2023 compared to Fiscal 2022\nThe selling, general and administrative expense rate increased 140 basis points in fiscal 2023 primarily due to wage investments and minimum wage increases in store payroll, unfavorable development of general liability claims, and higher repairs and maintenance expenses as we focus on store conditions for our customers and associates, partially offset by leverage from the comparable store net sales increase and leverage from the 53rd week of sales at the end of fiscal 2023.\nOperating Income\nYear Ended\nPercentage Change\n(dollars in millions)\nFebruary 1, 2025\nFebruary 3, 2024\nJanuary 28, 2023\n Fiscal 2024 vs. Fiscal 2023 \n Fiscal 2023 vs. Fiscal 2022 \nOperating income\n$\n1,462.0 \n$\n1,774.5 \n$\n2,099.3 \n(17.6)\n%\n(15.5)\n%\nOperating income margin\n8.3 \n%\n10.6 \n%\n13.6 \n%\n(2.3)\n%\n(3.0)\n%\nFiscal 2024 compared to Fiscal 2023\nOperating income margin decreased to 8.3% in fiscal 2024 compared to 10.6% in fiscal 2023, resulting from the increase in the selling, general and administrative expense rate.\nFiscal 2023 compared to Fiscal 2022\nOperating income margin decreased to 10.6% in fiscal 2023 compared to 13.6% in fiscal 2022, resulting from the decrease in gross profit margin and an increase in the selling, general and administrative expense rate.\nInterest Expense, Net\nYear Ended\nPercentage Change\n(dollars in millions)\nFebruary 1, 2025\nFebruary 3, 2024\nJanuary 28, 2023\n Fiscal 2024 vs. Fiscal 2023 \n Fiscal 2023 vs. Fiscal 2022 \nInterest expense, net\n$\n107.5 \n$\n112.5 \n$\n127.2 \n(4.4)\n%\n(11.6)\n%\nFiscal 2024 compared to Fiscal 2023\nInterest expense, net decreased $5.0 million in fiscal 2024 compared to the prior year, primarily due to higher interest income on investments.\nFiscal 2023 compared to Fiscal 2022\nInterest expense, net decreased $14.7 million in fiscal 2023 compared to the prior year, primarily due to higher interest income on investments.\nProvision for Income taxes\nYear Ended\nPercentage Change\n(dollars in millions)\nFebruary 1, 2025\nFebruary 3, 2024\nJanuary 28, 2023\n Fiscal 2024 vs. Fiscal 2023 \n Fiscal 2023 vs. Fiscal 2022 \nProvision for income taxes\n$\n341.1 \n$\n396.1 \n$\n471.6 \n(13.9)\n%\n(16.0)\n%\nEffective tax rate\n24.7 \n%\n23.8 \n%\n23.9 \n%\n0.9 \n%\n(0.1)\n%\nFiscal 2024 compared to Fiscal 2023\nThe effective tax rate for fiscal 2024 was 24.7% compared to 23.8% for fiscal 2023, resulting primarily from higher non-deductible executive compensation, increased tax expense in the current year related to restricted stock vesting and lower Work Opportunity Tax Credits.\nFiscal 2023 compared to Fiscal 2022\nThe effective tax rate for fiscal 2023 was 23.8% compared to 23.9% for fiscal 2022, resulting primarily from higher Work Opportunity Tax Credits, partially offset by higher tax expense in the current year related to restricted stock vesting.\n32\nTable of Contents\nLiquidity and Capital Resources\nWe invest capital to build and open new stores, expand and renovate existing stores, enhance and grow our distribution network, operate our existing stores, maintain and upgrade our technology, and support our other strategic initiatives. Our working capital requirements for existing stores are seasonal in nature and typically reach their peak in the months of September and October. We have satisfied our seasonal working capital requirements for existing and new stores and have funded our distribution network programs and other capital projects from internally generated funds and borrowings under our credit facilities and commercial paper program.\nThe following table compares our cash flows for the last three fiscal years:\n \nYear Ended\n(in millions)\nFebruary 1, 2025\nFebruary 3, 2024\nJanuary 28, 2023\nNet cash provided by (used in):\nOperating activities of continuing operations\n$\n2,193.3 \n$\n2,400.8 \n$\n1,417.9 \nInvesting activities of continuing operations\n(1,249.4)\n(1,194.8)\n(643.7)\nFinancing activities of continuing operations\n(411.3)\n(530.0)\n(686.8)\nOperating Activities\nFiscal 2024 compared to Fiscal 2023\nNet cash provided by operating activities decreased $207.5 million in fiscal 2024 compared to fiscal 2023 primarily due to lower current year earnings and increased inventory levels, partially offset by increases in trade accounts payable. \nThe increase in inventory was the result of an increase in store count and inventory from our multi-price initiative. \nThe increase in trade accounts payable was the result of extensions of payment terms with suppliers implemented in late fiscal 2023.\nFiscal 2023 compared to Fiscal 2022\nNet cash provided by operating activities increased $982.9 million in fiscal 2023 compared to fiscal 2022 primarily due to decreases in inventory levels. Inventory was elevated at the end of fiscal 2022 due to global supply chain issues that resolved in fiscal 2023, resulting in lower payments for inventory.\nInvesting Activities\nFiscal 2024 compared to Fiscal 2023\nNet cash used in investing activities increased $54.6 million in fiscal 2024 compared with fiscal 2023 due to higher capital expenditures in the current year, partially offset by insurance recoveries related to damaged property and equipment at our distribution center in Marietta, Oklahoma as discussed in \nNote \n5\n to our consolidated financial statements.\nFiscal 2023 compared to Fiscal 2022\nNet cash used in investing activities increased $551.1 million in fiscal 2023 compared with fiscal 2022 due to higher capital expenditures in fiscal 2023.\nFinancing Activities\nFiscal 2024 compared to Fiscal 2023\nNet cash used in financing activities decreased $118.7 million in fiscal 2024 compared to fiscal 2023 primarily due to lower payments for stock repurchases in fiscal 2024.\nFiscal 2023 compared to Fiscal 2022\nNet cash used in financing activities decreased $156.8 million in fiscal 2023 compared to fiscal 2022 primarily due to lower payments for stock repurchases in fiscal 2023. \nFor detail on our long-term and short-term borrowings and other commitments, refer to the discussion of “Funding Requirements” below, as well as \nNote 5\n and \nNote 6\n to our consolidated financial statements.\n33\nTable of Contents\nShare Repurchases\nWe repurchased 3,283,837, 3,905,599 and 4,613,696 shares of common stock on the open market at a cost of $403.6 million, $504.3 million and $647.5 million, including applicable excise tax, in fiscal 2024, fiscal 2023 and fiscal 2022, respectively. As of February 1, 2025, we had $952.4 million remaining under our existing $2.5 billion Board repurchase authorization.\nFunding Requirements\nOur total estimated capital expenditures for fiscal 2025 are approximately $1.2 billion to $1.3 billion, including planned expenditures for supply chain investments, our new and expanded stores, store renovations, information technology investments, and other property improvements. We expect our cash needs for opening new stores and expanding existing stores in fiscal 2025 to total approximately $445.0 million, which includes capital expenditures, initial inventory and pre-opening costs. We believe that we can adequately fund our working capital requirements and planned capital expenditures for the next 12 months and the foreseeable future from net cash provided by operations, our commercial paper program and borrowings under our credit facilities.\nOur material contractual obligations consist of long-term and short-term borrowings and related interest payments and operating lease obligations. Additionally, we have commitments related to ocean shipping contracts, software license and support agreements, telecommunication services and store technology assets and maintenance for our stores. Other commitments include letters of credit for imported merchandise, standby letters of credit that serve as collateral for our large-deductible insurance programs and surety bonds that serve as collateral for utility payments at our stores and self-insured insurance programs. For additional information regarding these obligations, including amounts outstanding at February 1, 2025, refer to \nNote 5\n, \nNote 6\n and \nNote 7\n to our consolidated financial statements.\nCritical Accounting Estimates and Assumptions\nOur consolidated financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America (“U.S. GAAP”). To prepare these financial statements, we must make estimates and assumptions that affect the reported amounts of assets, liabilities, revenues and expenses, as well as the disclosures of contingent assets and liabilities. Our estimates are often based on complex judgments, probabilities and assumptions that management believes to be reasonable, but that are inherently uncertain and unpredictable. It is also possible that other professionals, applying reasonable judgment to the same facts and circumstances, could develop and support a range of alternative estimated amounts. Actual results could be significantly different from these estimates. Following is a discussion of the estimates that we consider critical.\nInventory Valuation\nAs discussed in \nNote 2\n to our consolidated financial statements under the caption “Merchandise Inventories,” inventories at the distribution centers are stated at the lower of cost or net realizable value with cost determined on a weighted-average basis. Cost is assigned to store inventories using the retail inventory method on a weighted-average basis. Under the retail inventory method, the valuation of inventories at cost and the resulting gross margins are computed by applying a calculated cost-to-retail ratio to the retail value of inventories. The retail inventory method is an averaging method that is widely used in the retail industry and results in valuing inventories at lower of cost or market when markdowns are taken as a reduction of the retail value of inventories on a timely basis.\nInventory valuation methods require certain management estimates and judgments, including estimates of future merchandise markdowns and shrink, which significantly affect the ending inventory valuation at cost as well as the resulting gross margins. The averaging required in applying the retail inventory method and the estimates of shrink and markdowns could, under certain circumstances, result in costs not being recorded in the proper period.\nWe estimate our markdown reserve based on the consideration of a variety of factors, including, but not limited to, quantities of slow moving or seasonal carryover merchandise on hand, historical markdown statistics and future merchandising plans. The accuracy of our estimates can be affected by many factors, some of which are outside of our control, including changes in economic conditions and consumer buying trends. Historically, we have not experienced significant differences in our estimated reserve for markdowns compared with actual results.\nOur accrual for shrink is based on the shrink results of our most recent physical inventories adjusted, if necessary, for current economic conditions and business trends. These estimates are compared to actual results as physical inventory counts are taken and reconciled to the general ledger. Our physical inventory counts are generally taken between January and October of each year; therefore, the shrink accrual recorded at February 1, 2025 is based on estimated shrink for most of fiscal 2024, including the fourth quarter. We periodically adjust our shrink estimates to reflect our best estimates based on the factors described and, historically, these adjustments have not been material.\nOur management believes that our application of the retail inventory method results in an inventory valuation that reasonably approximates cost and results in carrying inventory at the lower of cost or market each year on a consistent basis.\n34\nTable of Contents\nSelf-Insurance Liabilities\nThe liabilities related to our self-insurance programs for workers’ compensation, general liability and auto are estimates that require judgment and the use of assumptions. Semiannually, we obtain third-party actuarial valuations to aid in valuing these liabilities and in determining the amount to accrue during the year. These actuarial valuations are estimates based on our claims experience for current and prior periods, exposure and severity factors, historical loss development factors, and other actuarial assumptions and the related accruals are adjusted as management’s estimates change.\nManagement’s estimate for self-insurance liabilities could vary from the ultimate loss sustained given the difficulty in predicting future events. Our self-insurance liabilities associated with workers’ compensation, general liability and auto related to continuing operations are recorded within “Other current liabilities” and “Other liabilities” in the accompanying Consolidated Balance Sheets and amounted to $244.3 million and $187.0 million at February 1, 2025 and February 3, 2024, respectively. Self-insurance liabilities related to discontinued operations totaled $185.0 million and $176.5 million at February 1, 2025 and February 3, 2024, respectively. The increases were primarily due to general liability claims developing and paying out at amounts significantly higher than anticipated, resulting in higher actuarially determined accruals.\nGoodwill and Indefinite-Lived Intangible Assets\nGoodwill and indefinite-lived intangible assets are initially recorded at their fair values. These assets are not amortized but are evaluated annually for impairment. A more frequent evaluation is performed if events or circumstances indicate that impairment could have occurred. Such events or circumstances could include, but are not limited to, significant negative industry or economic trends, unanticipated changes in the competitive environment and a significant sustained decline in the market price of our stock.\nFor purposes of our goodwill impairment evaluation, the reporting units are Family Dollar, Dollar Tree and Dollar Tree Canada. Goodwill has been assigned to the reporting units based on prior business combinations related to the brands. We have the option to initially perform a qualitative assessment to determine whether it is more likely than not that the fair value is less than the carrying amount. Alternatively, we may bypass the qualitative assessment and proceed directly to performing the quantitative impairment test. In connection with the fiscal 2024 annual impairment evaluation, management’s qualitative assessment indicated that it was more likely than not that the fair values of the Family Dollar reporting unit and the Family Dollar trade name were less than their carrying values. There were no indicators that the fair value of the Dollar Tree or Dollar Tree Canada reporting units were less than their carrying value. Therefore, management performed a quantitative assessment of both the Family Dollar goodwill and trade name.\n In fiscal 2024, we estimated the fair value of the Family Dollar reporting unit by using market participant assumptions as there was an expected sale price for the business based on negotiations with potential third party buyers. Based on this fair value, we recognized an impairment loss of $490.5 million which represented the remaining carrying amount of goodwill from the Family Dollar business. The fiscal 2024 goodwill impairment was driven primarily by a decrease in enterprise value attributed to the Family Dollar business using the expected sale price compared to our carrying value. Our evaluation of goodwill resulted in an impairment charge of $1,069.0 million in fiscal 2023 related to the Family Dollar reporting unit. Our evaluation of goodwill did not result in impairment charges being recorded in fiscal 2022.\nThe Family Dollar trade name comprises a substantial portion of our indefinite-lived intangible assets and management’s judgment utilized in the Family Dollar trade name impairment evaluations is critical. The computations require management to make estimates and assumptions and actual results may differ significantly, particularly if there are significant adverse changes in the operating environment. Indefinite-lived intangible assets, such as the Family Dollar trade name, are not subject to amortization but are reviewed at least annually for impairment. The indefinite-lived intangible asset impairment evaluations are performed by comparing the fair value of the indefinite-lived intangible assets to their carrying values. We estimate the fair value of our trade name intangible asset based on an income approach using the relief-from-royalty method. This approach is dependent upon a number of factors, including estimates of future growth and trends, royalty rates, discount rates and other variables. Royalty rates are derived using future estimates of earnings before interest, and taxes (“EBIT”), and a profit split analysis that examines how EBIT would be allocated to separate parties in an intellectual property license arrangement.\nWe base our fair value estimates on assumptions we believe to be reasonable, but which are inherently uncertain. Critical assumptions that are used as part of a tradename evaluation include:\n•\nThe potential future revenue, EBIT and cash flows of the reporting unit. \nThe projections use management’s assumptions about economic and market conditions over the projected period as well as our estimates of future performance and reporting unit revenue, gross margin, expenses and other factors. The resulting revenue, EBIT and cash flow estimates are based on our most recent business operating plans, and various growth rates are assumed for years beyond the current business plan period. We believe that the assumptions, estimates and rates used in our impairment evaluations are reasonable; however, variations in the assumptions, estimates and rates could result in significantly different estimates of fair value.\n35\nTable of Contents\n•\nSelection of an appropriate discount rate. \nCalculating the present value of future cash flows requires the selection of an appropriate discount rate, which is based on a weighted-average cost of capital analysis. The discount rate is affected by changes in short-term interest rates and long-term yield as well as variances in the typical capital structure of marketplace participants. Given current economic conditions, it is possible that the discount rate will fluctuate in the near term. We engaged third party experts to assist in the determination of the weighted-average cost of capital used to discount the expected income under the relief of royalty method. The weighted-average cost of capital used to discount the cash flows for our evaluation was 10.5% for our fiscal 2024 analysis. The discount rate includes a premium due to the inherently higher risk profile of intangible assets.\nOur evaluation of the Family Dollar trade name resulted in impairment charges of $1.4 billion in fiscal 2024 and $950.0 million in fiscal 2023. Our evaluation of the Family Dollar trade name did not result in impairment charges being recorded during fiscal 2022. The fiscal 2024 trade name impairment was driven primarily by a decrease in the royalty rate assumption based on lower future growth rates and EBIT margin assumptions for the Family Dollar reporting unit.\nFor additional information related to goodwill and indefinite-lived intangible assets, including the related impairment evaluations, refer to \nNote 2\n to our consolidated financial statements under the caption “Goodwill and Nonamortizing Intangible Assets” and \nNote 15\n. For additional information related to uncertainties associated with the key assumptions and any potential events and/or circumstances that could have a negative effect on the key assumptions, please refer to “",
    "item1a": "Item 1A. Risk Factors\n” and elsewhere within this “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations.” If our assumptions and related estimates change in the future, we may be required to record additional impairment charges against earnings in future periods. Any impairment charges that we may take in the future could be material to our results of operations and financial condition. \nAssets Held for Sale and Discontinued Operations\nA business is classified as held for sale when management having the authority to approve the action commits to a plan to sell the business, the business is available for immediate sale in its present condition and an active program to locate a buyer has been initiated. Additionally, the sale must be probable to occur during the next 12 months at a price that is reasonable in relation to its current fair value and actions required to complete the plan indicate it is unlikely significant changes to the plan will be made or the plan will be withdrawn. A business classified as held for sale is recorded at the lower of (i) its carrying amount and (ii) estimated fair value less costs to sell. When the carrying amount of the business exceeds its estimated fair value less costs to sell, a loss is recognized and updated each reporting period as appropriate. Assets held for sale are not further depreciated or amortized once such a determination is reached.\nThe results of operations of businesses classified as held for sale are reported as discontinued operations if the disposal represents a strategic shift that will have a major effect on the entity’s operations and financial results. When a business is identified for discontinued operations reporting: (i) results for prior periods are retrospectively reclassified as discontinued operations; (ii) results of operations are reported in a single line, net of tax, in the consolidated statement of operations; and (iii) assets and liabilities are reported as held for sale in the consolidated balance sheets in the period in which the business is classified as held for sale.\nAs previously noted, in fiscal 2024 we initiated a formal review of strategic alternatives for the Family Dollar business. This strategic alternatives review concluded in the fourth quarter of fiscal 2024 and resulted in the decision to sell the Family Dollar business. Accordingly, we concluded the assets of the Family Dollar business met the criteria for classification as held for sale. We determined the ultimate disposal will represent a strategic shift that will have a major effect on our operations and financial results. As such, the results of Family Dollar are presented as discontinued operations in the accompanying Consolidated Statements of Operations for all periods presented and the assets and liabilities of Family Dollar have been reflected as assets and liabilities of discontinued operations in the accompanying Consolidated Balance Sheets for all periods presented. The Company has ceased depreciating and amortizing its long-lived assets for Family Dollar which primarily includes right-of-use assets and property and equipment. On March 25, 2025, the Company entered into a definitive agreement to sell the Family Dollar business to Brigade Capital Management, LP and Macellum Capital Management, LLC, for a purchase consideration of $1,007.0 million, subject to a number of adjustments, including with respect to working capital and net indebtedness. The closing of the transaction is subject to satisfaction of customary closing conditions, including receipt of U.S. antitrust approval. Net proceeds are estimated to total approximately $804.0 million.\nWe calculated an estimated loss on classification to held for sale of approximately $3.4 billion, reflecting the write-down of the carrying value of the Family Dollar business to fair value less costs to sell. The fair value was determined by using market participant assumptions as there was an expected sale price for the business based on negotiations with the buyer. Costs to sell included estimated incremental, direct costs incurred to transact the sale of the Family Dollar business. Refer to \nNote 15\n to our consolidated financial statements for additional information.\n36\nTable of Contents\nSummary of Significant Accounting Policies\nRefer to \nNote 2\n to our consolidated financial statements for a summary of our significant accounting policies and our assessment of recently issued accounting standards. \nItem 7A. Quantitative and Qualitative Disclosures About Market Risk\nWe are exposed to various types of market risk in the normal course of our business, including the impact of interest rate changes, diesel fuel cost changes and inflation. We may enter into interest rate or diesel fuel swaps to manage exposure to interest rate and diesel fuel price changes. We do not enter into derivative instruments for any purpose other than cash flow hedging and we do not hold derivative instruments for trading purposes.\nInterest Rate Risk\nOur exposure to interest rate risk primarily relates to our revolving credit facility, our commercial paper program, and any future registered offerings of senior notes to raise new capital or replace existing maturities. At February 1, 2025, there were no borrowings outstanding under the revolving credit facility or the commercial paper program.\nInflation Risk\nThe primary inflationary factors impacting our business include changes to the costs of merchandise, transportation (including the cost of diesel fuel), store construction-related costs, and labor. If these inflationary pressures become significant, we may not be able to fully offset such higher costs through adjustments to our product assortment, improvements in operational efficiencies or increases in our comparable store net sales. Our inability or failure to do so could harm our business, financial condition and results of operations.\n37\nTable of Contents\nItem 8. Financial Statements and Supplementary Data\nINDEX TO THE CONSOLIDATED FINANCIAL STATEMENTS\nPage\n \n \nReport of Independent Registered Public Accounting Firm\n (PCAOB ID: \n185\n)\n39\nConsolidated Statements of Operations\n41\nConsolidated Statements of Comprehensive Income (Loss)\n42\nConsolidated Balance Sheets\n43\nConsolidated Statements of Shareholders’ Equity\n \n44\nConsolidated Statements of Cash Flows\n45\nNotes to Consolidated Financial Statements\n46\nNote 1 - Description of Business and Basis of Presentation\n46\nNote 2 - Summary of Significant Accounting Policies\n46\nNote 3 - Supplemental Balance Sheet Information\n51\nNote 4 - Income Taxes\n52\nNote 5 - Commitments and Contingencies\n54\nNote 6 - Short-Term Borrowings and Long-Term Debt\n56\nNote 7 - Leases\n57\nNote 8 - Fair Value Measurements\n58\nNote 9 - Shareholders’ Equity\n59\nNote 10 - Stock-Based Compensation Plans\n59\nNote 11 - Earnings (Loss) Per Share\n63\nNote 12 - Employee Benefit Plan\n63\nNote 13 - Segments and Disaggregated Revenue\n64\nNote 14 - Supply Chain Finance Program\n66\nNote 15 - Discontinued Operations\n66\nNote 16 - Subsequent Events\n69\nNote 17 – Quarterly Financial Information (Unaudited)\n69\n38\nTable of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and Board of Directors\nDollar Tree, Inc.:\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Dollar Tree, Inc. and subsidiaries (the Company) as of February 1, 2025 and February 3, 2024, the related consolidated statements of operations, comprehensive income (loss), shareholders’ equity, and cash flows for each of the years in the three-year period ended February 1, 2025, and the related notes (collectively, the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of February 1, 2025 and February 3, 2024, and the results of its operations and its cash flows for each of the years in the three-year period ended February 1, 2025, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of February 1, 2025, based on criteria established in \nInternal Control – Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission, and our report dated March 26, 2025 expressed an unqualified opinion on the effectiveness of the Company’s internal control over financial reporting.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on these consolidated financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nEvaluation of estimated self-insurance liability\nAs discussed in Note 2 to the consolidated financial statements, the Company considers actuarial assumptions to estimate its self-insurance liability. As of February 1, 2025, the Company recorded an estimated liability of $244.3 million related to continuing operations and $185.0 million related to discontinued operations.\nWe identified the evaluation of the estimated self-insurance liability as a critical audit matter. The estimation process involves auditor judgment and actuarial expertise to evaluate the actuarial methods and assumptions that are used to estimate future claim payments. Specifically, the evaluation includes the assumptions related to the loss development factors and expected loss rates which are primarily driven by historical claims paid and incurred data.\nThe following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of certain internal controls over the Company’s self-insurance liability estimation process. This included controls related to (1) the selection of the actuarial methods, and the development of the loss development factors and expected loss rates used to calculate the liability, and (2) the completeness and accuracy of historical claims paid and incurred data. We assessed the Company’s estimate of the liability by testing a selection of certain data, including claims data, utilized by the Company’s actuary by comparing it to relevant documentation. We involved actuarial professionals with specialized skills and knowledge, who assisted in:\n39\nTable of Contents\n•\nassessing the Company’s actuarial methods by comparing them to generally accepted actuarial methodologies\n•\nevaluating the Company’s actuarial estimates and assumptions related to the loss development factors and expected loss rates, by comparing them to generally accepted actuarial methodologies and the Company’s historical data and trends.\nTrade name intangible asset impairment\nAs discussed in Notes 2 and 15 to the consolidated financial statements, the Company performs trade name intangible asset impairment testing on an annual basis and when events and changes in circumstances indicate possible impairment of the asset. To estimate the fair value of the Family Dollar trade name intangible asset (Family Dollar trade name), the Company uses the relief-from-royalty method. The impairment charge for the year ended February 1, 2025 was $1,400.0 million for the Family Dollar trade name. \nWe identified the evaluation of the Company’s fair value of the Family Dollar trade name as a critical audit matter. Subjective auditor judgment and specialized skills and knowledge were required to evaluate the key assumptions used to estimate the fair value of the Family Dollar trade name, specifically the revenue growth rates, discount rate, and company-specific royalty rate. Minor changes to certain of these assumptions could have a significant effect on the fair value and the resulting assessment of the carrying value of the Family Dollar trade name.\nThe following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of certain internal controls over the intangible asset impairment process, including controls related to the determination and development of the identified assumptions. We assessed the Company’s ability to forecast by comparing the Company’s historical forecasts to actual results. We evaluated the revenue growth rates by comparing them to historical results and performing sensitivity analyses. We involved valuation professionals with specialized skills and knowledge, who assisted in:\n•\nevaluating the revenue growth rates by comparing them to publicly available market data for comparable companies\n•\nassessing the discount rate by comparing it to a range of discount rates developed using publicly available market data for comparable companies\n•\nassessing the company-specific royalty rate by comparing it to publicly available market data for comparable licensing agreements.\n/s/ \nKPMG LLP\nWe have served as the Company’s auditor since 1987.\nVirginia Beach, Virginia\nMarch 26, 2025 \n40\nTable of Contents\nDOLLAR TREE, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\n \nYear Ended\n(in millions, except per share data)\nFebruary 1, 2025\nFebruary 3, 2024\nJanuary 28, 2023\nNet sales\n$\n17,565.8\n \n$\n16,770.3\n \n$\n15,405.7\n \nOther revenue\n12.7\n \n10.8\n \n5.8\n \nTotal revenue\n17,578.5\n \n16,781.1\n \n15,411.5\n \nCost of sales\n11,284.1\n \n10,761.4\n \n9,630.2\n \nSelling, general and administrative expenses\n4,832.4\n \n4,245.2\n \n3,682.0\n \nOperating income\n1,462.0\n \n1,774.5\n \n2,099.3\n \nInterest expense, net\n107.5\n \n112.5\n \n127.2\n \nOther (income) expense, net\n(\n29.1\n)\n0.1\n \n0.4\n \nIncome from continuing operations before income taxes\n1,383.6\n \n1,661.9\n \n1,971.7\n \nProvision for income taxes\n341.1\n \n396.1\n \n471.6\n \nIncome from continuing operations\n1,042.5\n \n1,265.8\n \n1,500.1\n \nIncome (loss) from discontinued operations, net of tax\n(\n4,072.6\n)\n(\n2,264.2\n)\n115.3\n \nNet income (loss)\n$\n(\n3,030.1\n)\n$\n(\n998.4\n)\n$\n1,615.4\n \nBasic earnings (loss) per share of common stock:\nContinuing operations\n$\n4.83\n \n$\n5.77\n \n$\n6.72\n \nDiscontinued operations\n(\n18.88\n)\n(\n10.32\n)\n0.52\n \nTotal basic earnings (loss) per share of common stock\n$\n(\n14.05\n)\n$\n(\n4.55\n)\n$\n7.24\n \nDiluted earnings (loss) per share of common stock:\nContinuing operations\n$\n4.83\n \n$\n5.76\n \n$\n6.70\n \nDiscontinued operations\n(\n18.86\n)\n(\n10.30\n)\n0.51\n \nTotal diluted earnings (loss) per share of common stock\n$\n(\n14.03\n)\n$\n(\n4.54\n)\n$\n7.21\n \nWeighted average common shares outstanding:\nBasic\n215.7\n219.5\n223.2\nDiluted\n215.9\n219.9\n224.1\nSee accompanying Notes to Consolidated Financial Statements\n41\nTable of Contents\nDOLLAR TREE, INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME (LOSS)\nYear Ended\n(in millions)\nFebruary 1, 2025\nFebruary 3, 2024\nJanuary 28, 2023\nNet income (loss)\n$\n(\n3,030.1\n)\n$\n(\n998.4\n)\n$\n1,615.4\n \nForeign currency translation adjustments\n(\n15.6\n)\n(\n2.4\n)\n(\n6.0\n)\nTotal comprehensive income (loss)\n$\n(\n3,045.7\n)\n$\n(\n1,000.8\n)\n$\n1,609.4\n \nSee accompanying Notes to Consolidated Financial Statements\n42\nTable of Contents\nDOLLAR TREE, INC.\nCONSOLIDATED BALANCE SHEETS\n(in millions, except share and per share data)\nFebruary 1, 2025\nFebruary 3, 2024\nASSETS\n \n \nCurrent assets:\n \n \nCash and cash equivalents\n$\n1,256.5\n \n$\n425.2\n \nMerchandise inventories\n2,672.0\n \n2,495.8\n \nOther current assets\n169.8\n \n141.3\n \nCurrent assets of discontinued operations\n5,008.9\n \n3,070.4\n \nTotal current assets\n9,107.2\n \n6,132.7\n \nRestricted cash\n75.7\n \n72.3\n \nProperty, plant and equipment, net of accumulated depreciation of $\n4,332.3\n    and $\n4,231.4\n, respectively\n4,499.3\n \n3,822.1\n \nOperating lease right-of-use assets\n4,146.4\n \n3,672.7\n \nGoodwill\n421.2\n \n423.3\n \nDeferred income taxes, net\n260.6\n \n9.0\n \nOther assets\n133.6\n \n99.4\n \nNoncurrent assets of discontinued operations\n—\n \n7,792.0\n \nTotal assets\n$\n18,644.0\n \n$\n22,023.5\n \nLIABILITIES AND SHAREHOLDERS’ EQUITY\n \n \nCurrent liabilities:\n \n \nCurrent portion of long-term debt\n$\n1,000.0\n \n$\n—\n \nCurrent portion of operating lease liabilities\n960.7\n \n899.8\n \nAccounts payable\n1,705.8\n \n1,167.1\n \nIncome taxes payable\n120.1\n \n52.7\n \nOther current liabilities\n574.4\n \n578.3\n \nCurrent liabilities of discontinued operations\n4,224.9\n \n1,998.8\n \nTotal current liabilities\n8,585.9\n \n4,696.7\n \nLong-term debt, net, excluding current portion\n2,431.2\n \n3,426.3\n \nOperating lease liabilities, long-term\n3,438.7\n \n3,042.3\n \nDeferred income taxes, net\n—\n \n841.1\n \nIncome taxes payable, long-term\n28.2\n \n22.0\n \nOther liabilities\n182.6\n \n143.5\n \nNoncurrent liabilities of discontinued operations\n—\n \n2,538.5\n \nTotal liabilities\n14,666.6\n \n14,710.4\n \nCommitments and contingencies (Note 5)\nShareholders’ equity:\n \n \nCommon stock, par value $\n0.01\n; \n600,000,000\n shares authorized, \n215,078,018\n  and \n217,907,206\n shares issued and outstanding at February 1, 2025 and\n  February 3, 2024, respectively\n2.2\n \n2.2\n \nAdditional paid-in capital\n92.9\n \n229.9\n \nAccumulated other comprehensive loss\n(\n59.2\n)\n(\n43.6\n)\nRetained earnings\n3,941.5\n \n7,124.6\n \nTotal shareholders’ equity\n3,977.4\n \n7,313.1\n \nTotal liabilities and shareholders’ equity\n$\n18,644.0\n \n$\n22,023.5\n \nSee accompanying Notes to Consolidated Financial Statements\n43\nTable of Contents\nDOLLAR TREE, INC.\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS’ EQUITY\nYEARS ENDED FEBRUARY 1, 2025, FEBRUARY 3, 2024, AND JANUARY 28, 2023 \n(in millions)\nCommon\nStock\nShares\nCommon\nStock\nAdditional\nPaid-in\nCapital\nAccumulated\nOther\nComprehensive\nLoss\nRetained\nEarnings\nShareholders’\nEquity\nBalance at January 29, 2022\n225.1\n \n$\n2.2\n \n$\n1,243.9\n \n$\n(\n35.2\n)\n$\n6,507.6\n \n$\n7,718.5\n \nNet income\n— \n— \n— \n— \n1,615.4\n \n1,615.4\n \nTotal other comprehensive loss\n— \n— \n— \n(\n6.0\n)\n— \n(\n6.0\n)\nIssuance of stock under Employee Stock\n    Purchase Plan\n0.1\n \n— \n9.3\n \n— \n— \n9.3\n \nStock-based compensation, net\n0.6\n \n— \n61.8\n \n— \n— \n61.8\n \nRepurchase of stock\n(\n4.6\n)\n— \n(\n647.5\n)\n— \n— \n(\n647.5\n)\nBalance at January 28, 2023\n221.2\n \n2.2\n \n667.5\n \n(\n41.2\n)\n8,123.0\n \n8,751.5\n \nNet loss\n— \n— \n— \n— \n(\n998.4\n)\n(\n998.4\n)\nTotal other comprehensive loss\n— \n— \n— \n(\n2.4\n)\n— \n(\n2.4\n)\nIssuance of stock under Employee Stock\n    Purchase Plan\n— \n— \n9.9\n \n— \n— \n9.9\n \nExercise of stock options\n— \n— \n0.1\n \n— \n— \n0.1\n \nStock-based compensation, net\n0.6\n \n— \n56.7\n \n— \n— \n56.7\n \nRepurchase of stock\n(\n3.9\n)\n— \n(\n500.0\n)\n— \n— \n(\n500.0\n)\nExcise tax on repurchase of stock\n— \n— \n(\n4.3\n)\n— \n— \n(\n4.3\n)\nBalance at February 3, 2024\n217.9\n \n2.2\n \n229.9\n \n(\n43.6\n)\n7,124.6\n \n7,313.1\n \nNet loss\n— \n— \n— \n— \n(\n3,030.1\n)\n(\n3,030.1\n)\nTotal other comprehensive loss\n— \n— \n— \n(\n15.6\n)\n— \n(\n15.6\n)\nIssuance of stock under Employee Stock\n    Purchase Plan\n0.1\n \n— \n9.7\n \n— \n— \n9.7\n \nExercise of stock options\n— \n— \n0.1\n \n— \n— \n0.1\n \nStock-based compensation, net\n0.4\n \n— \n103.8\n \n— \n— \n103.8\n \nRepurchase of stock\n(\n3.3\n)\n— \n(\n247.0\n)\n— \n(\n153.0\n)\n(\n400.0\n)\nExcise tax on repurchase of stock\n— \n— \n(\n3.6\n)\n— \n— \n(\n3.6\n)\nBalance at February 1, 2025\n215.1\n \n$\n2.2\n \n$\n92.9\n \n$\n(\n59.2\n)\n$\n3,941.5\n \n$\n3,977.4\n \nSee accompanying Notes to Consolidated Financial Statements\n44\nTable of Contents\nDOLLAR TREE, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n \nYear Ended\n(in millions)\nFebruary 1, 2025\nFebruary 3, 2024\nJanuary 28, 2023\nCash flows from operating activities:\n \n \n \nNet income (loss)\n$\n(\n3,030.1\n)\n$\n(\n998.4\n)\n$\n1,615.4\n \nIncome (loss) from discontinued operations, net of tax\n(\n4,072.6\n)\n(\n2,264.2\n)\n115.3\n \nIncome from continuing operations\n$\n1,042.5\n \n$\n1,265.8\n \n$\n1,500.1\n \nAdjustments to reconcile income from continuing operations to net cash provided by operating activities:\n \n \n \nDepreciation and amortization\n526.9\n \n400.5\n \n365.3\n \nProvision for deferred income taxes\n49.3\n \n55.1\n \n55.2\n \nStock-based compensation expense\n106.9\n \n76.3\n \n91.5\n \nImpairments\n52.1\n \n10.9\n \n1.5\n \nOther non-cash adjustments to income from continuing operations\n20.0\n \n8.6\n \n9.6\n \nChanges in operating assets and liabilities:\n \n \n \nMerchandise inventories\n(\n182.6\n)\n488.2\n \n(\n712.1\n)\nOther current assets\n(\n32.8\n)\n(\n37.9\n)\n(\n6.2\n)\nOther assets\n(\n78.1\n)\n(\n54.5\n)\n(\n13.0\n)\nAccounts payable\n541.4\n \n87.9\n \n87.7\n \nIncome taxes payable\n110.6\n \n67.2\n \n19.6\n \nOther current liabilities\n14.4\n \n92.4\n \n15.7\n \nOther liabilities\n45.4\n \n14.5\n \n(\n9.0\n)\nOperating lease right-of-use assets and liabilities, net\n(\n22.7\n)\n(\n74.2\n)\n12.0\n \nNet cash provided by operating activities of continuing operations\n2,193.3\n \n2,400.8\n \n1,417.9\n \nCash flows from investing activities:\n \n \n \nCapital expenditures\n(\n1,300.5\n)\n(\n1,193.8\n)\n(\n639.0\n)\nProceeds from insurance recoveries\n50.0\n \n—\n \n—\n \nProceeds from (payments for) fixed asset disposition\n1.1\n \n(\n1.0\n)\n(\n4.7\n)\nNet cash used in investing activities of continuing operations\n(\n1,249.4\n)\n(\n1,194.8\n)\n(\n643.7\n)\nCash flows from financing activities:\n \n \n \nProceeds from revolving credit facility\n—\n \n—\n \n555.0\n \nRepayments of revolving credit facility\n—\n \n—\n \n(\n555.0\n)\nProceeds from commercial paper notes\n3,206.1\n \n1,067.9\n \n—\n \nRepayments of commercial paper notes\n(\n3,206.1\n)\n(\n1,067.9\n)\n—\n \nProceeds from stock issued pursuant to stock-based compensation plans\n9.8\n \n10.0\n \n9.3\n \nCash paid for taxes on exercises/vesting of stock-based compensation\n(\n21.1\n)\n(\n40.0\n)\n(\n48.6\n)\nPayments for repurchase of stock\n(\n400.0\n)\n(\n500.0\n)\n(\n647.5\n)\nNet cash used in financing activities\n(\n411.3\n)\n(\n530.0\n)\n(\n686.8\n)\nCash flows from discontinued operations:\nNet cash provided by operating activities of discontinued operations\n669.2\n \n283.7\n \n196.9\n \nNet cash used in investing activities of discontinued operations\n(\n446.0\n)\n(\n912.8\n)\n(\n610.1\n)\nNet cash provided by (used in) discontinued operations\n223.2\n \n(\n629.1\n)\n(\n413.2\n)\nEffect of exchange rate changes on cash, cash equivalents and restricted cash\n(\n1.8\n)\n(\n1.0\n)\n(\n1.2\n)\nNet change in cash, cash equivalents and restricted cash\n754.0\n \n45.9\n \n(\n327.0\n)\nCash, cash equivalents and restricted cash at beginning of year\n757.2\n \n711.3\n \n1,038.3\n \nCash, cash equivalents and restricted cash at end of year\n$\n1,511.2\n \n$\n757.2\n \n$\n711.3\n \nSupplemental disclosure of cash flow information\n(1)\n:\n \n \n \nCash paid for:\n \n \n \nInterest, net of amounts capitalized\n$\n132.8\n \n$\n131.4\n \n$\n132.2\n \nIncome taxes\n$\n175.9\n \n$\n274.0\n \n$\n401.3\n \nNon-cash transactions:\nRight-of-use assets obtained in exchange for new operating lease liabilities\n$\n1,753.5\n \n$\n1,893.1\n \n$\n1,538.3\n \nAccrued capital expenditures\n$\n74.5\n \n$\n138.8\n \n$\n86.6\n \n(1)\n Supplemental disclosures are inclusive of activity for both continuing and discontinued operations.\n \nSee accompanying Notes to Consolidated Financial Statements\n45\nTable of Contents\nDOLLAR TREE, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote 1 - \nDescription of Business and Basis of Presentation \nDescription of Business\nDollar Tree, Inc. (“we,” “our,” “us,” or “the Company”) is a leading operator of discount retail stores in the United States and Canada. \nBasis of Presentation \nThe accompanying consolidated financial statements include the financial statements of Dollar Tree, Inc., and its wholly-owned subsidiaries and were prepared in accordance with accounting principles generally accepted in the United States of America (“U.S. GAAP”). All intercompany balances and transactions have been eliminated in consolidation. All amounts stated herein are in U.S. Dollars. Continuing operations consists of the Dollar Tree segment and corporate, support and other.\n \nFiscal Year\nOur fiscal year is a 52-week or 53-week period ending on the Saturday closest to January 31. References to “fiscal 2026,” “fiscal 2025,” “fiscal 2024,” and “fiscal 2022,” relate to the 52-week fiscal years ended January 30, 2027, January 31, 2026, February 1, 2025, and January 28, 2023, respectively.\n References to “fiscal 2023” relate to the 53-week fiscal year ended February 3, 2024.\nNote 2 - \nSummary of Significant Accounting Policies\nAssets Held for Sale and Discontinued Operations\nIn accordance with Accounting Standards Codification (“ASC”) Subtopic 205-20 “Discontinued Operations,” a business is classified as held for sale when management having the authority to approve the action commits to a plan to sell the business, the business is available for immediate sale in its present condition and an active program to locate a buyer has been initiated. Additionally, the sale must be probable to occur during the next 12 months at a price that is reasonable in relation to its current fair value and actions required to complete the plan indicate it is unlikely significant changes to the plan will be made or the plan will be withdrawn. A business classified as held for sale is recorded at the lower of (i) its carrying amount and (ii) estimated fair value less costs to sell. When the carrying amount of the business exceeds its estimated fair value less costs to sell, a loss is recognized and updated each reporting period as appropriate. Assets held for sale are not depreciated or amortized. \nThe results of operations of businesses classified as held for sale are reported as discontinued operations if the disposal represents a strategic shift that will have a major effect on the entity’s operations and financial results. When a business is identified for discontinued operations reporting: (i) results for prior periods are retrospectively reclassified as discontinued operations; (ii) results of operations are reported in a single line, net of tax, in the consolidated statement of operations; and (iii) assets and liabilities are reported as held for sale in the consolidated balance sheets in the period in which the business is classified as held for sale.\nAs previously reported, in fiscal 2024 the Company initiated a formal review of strategic alternatives for the Family Dollar business. This strategic alternatives review concluded in the fourth quarter of fiscal 2024 and resulted in the decision to sell the Family Dollar business. The Company concluded the assets of the Family Dollar business met the criteria for classification as held for sale during the fourth quarter of fiscal 2024. Additionally, the Company determined the ultimate disposal will represent a strategic shift that will have a major effect on our operations and financial results. As such, the results of Family Dollar are presented as discontinued operations in the accompanying Consolidated Statements of Operations for all periods presented. Prior periods have been adjusted to conform to the current presentation. The assets and liabilities of Family Dollar have been reflected as assets and liabilities of discontinued operations in the accompanying Consolidated Balance Sheets for all periods presented. The Company has ceased depreciating and amortizing its long-lived assets for Family Dollar which primarily includes right-of-use assets and property and equipment. On March 25, 2025, the Company entered into a definitive agreement to sell the Family Dollar business to Brigade Capital Management, LP and Macellum Capital Management, LLC, for a purchase consideration of $\n1,007.0\n million, subject to a number of adjustments, including with respect to working capital and net indebtedness. The closing of the transaction is subject to satisfaction of customary closing conditions, including receipt of U.S. antitrust approval. Net proceeds are estimated to total approximately $\n804.0\n million.\nUnless otherwise noted, all amounts and disclosures included in these Notes to Consolidated Financial Statements reflect only our continuing operations. Refer to \nNote 15\n for additional details on discontinued operations.\n \n46\nTable of Contents\nUse of Estimates\nThe preparation of financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosures of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nCash and Cash Equivalents\nCash and cash equivalents at February 1, 2025 and February 3, 2024 includes $\n1,050.9\n million and $\n225.2\n million, respectively, of investments primarily in money market securities which are valued at cost, which approximates fair value. In accordance with ASC Topic 305 “Cash and Cash Equivalents,” we consider all highly-liquid debt instruments with original maturities of three months or less to be cash equivalents. The majority of payments due from financial institutions for the settlement of debit card and credit card transactions process within three business days, and therefore are classified as cash and cash equivalents.\nUnder our cash management system, payments issued but not presented to banks frequently result in book overdraft balances for accounting purposes and are classified within “Accounts payable” in the accompanying Consolidated Balance Sheets. Changes in the book overdraft position are presented within “Net cash provided by operating activities” within the Consolidated Statements of Cash Flows. The amount of these payments included in “Accounts Payable” as of February 1, 2025 and February 3, 2024 was $\n155.5\n million and $\n50.3\n million, respectively. \nThe Consolidated Statements of Cash Flows includes the cash flows of continuing and discontinued operations. \nThe following is a reconciliation between “Cash and cash equivalents” and “Restricted cash” of continuing operations presented in the Consolidated Balance Sheets and the total cash, cash equivalents and restricted cash presented in the Consolidated Statements of Cash Flows:\n(in millions)\nFebruary 1, 2025\nFebruary 3, 2024\nCash and cash equivalents on the Consolidated Balance Sheets\n$\n1,256.5\n \n$\n425.2\n \nRestricted cash on the Consolidated Balance Sheets\n75.7\n \n72.3\n \nCash, cash equivalents and restricted cash of discontinued operations \n    included in current and noncurrent assets of discontinued \n    operations on the Consolidated Balance Sheets \n179.0\n \n259.7\n \nTotal cash, cash equivalents and restricted cash on the Consolidated\n     Statements of Cash Flows\n$\n1,511.2\n \n$\n757.2\n \nMerchandise Inventories\nIn accordance with ASC Topic 330 “Inventory,” merchandise inventories at our distribution centers are stated at the lower of cost or net realizable value, determined on a weighted-average cost basis. Cost is assigned to store inventories using the retail inventory method on a weighted-average basis. Under the retail inventory method, the valuation of inventories at cost and the resulting gross margins are computed by applying a calculated cost-to-retail ratio to the retail value of inventories.\nCosts directly associated with warehousing and distribution are capitalized as merchandise inventories.\n Total warehousing and distribution costs capitalized into inventory amounted to $\n195.3\n million and $\n166.9\n million at February 1, 2025 and February 3, 2024, respectively.\nProperty, Plant and Equipment\nIn accordance with ASC Topic 360 “Property, Plant and Equipment,” property, plant and equipment are stated at cost and depreciated using the straight-line method over the estimated useful lives of the respective assets as follows:\nBuildings\n39\n to \n40\n years\nBuilding improvements\n20\n years\nFurniture, fixtures and equipment, software\n3\n to \n15\n years\nLeasehold improvements\nShorter of remaining lease term or related asset life\nDepreciation is included in “Selling, general and administrative expenses” in the accompanying Consolidated Statements of Operations, with the exception of depreciation related to our merchandising and distribution-related assets which are included in “Cost of sales” in the accompanying Consolidated Statements of Operations.\n47\nTable of Contents\nCapitalized Interest \nWe capitalize interest on borrowed funds during the construction of certain property and equipment based on our weighted average borrowing rates in place while the projects are in progress.\n We capitalized $\n7.6\n million, $\n5.9\n million and $\n3.8\n million of interest costs in the years ended February 1, 2025, February 3, 2024 and January 28, 2023, respectively. \nInsurance Reserves and Restricted Cash\nWe utilize a combination of insurance and self-insurance programs, including a wholly-owned captive insurance entity, to provide for the potential liabilities for certain risks, including workers’ compensation, general liability and auto. Liabilities associated with the risks that are retained by us are not discounted and are estimated, in part, by considering claims experience, exposure and severity factors, historical loss development factors, and other actuarial assumptions. Our self-insurance liabilities associated with workers’ compensation, general liability and auto related to continuing operations are recorded within “Other current liabilities” and “Other liabilities” in the accompanying Consolidated Balance Sheets and amounted to $\n244.3\n million and $\n187.0\n million at February 1, 2025 and February 3, 2024, respectively. Self-insurance liabilities related to discontinued operations totaled $\n185.0\n million and $\n176.5\n million at February 1, 2025 and February 3, 2024, respectively.\nDollar Tree Insurance, Inc., a South Carolina-based wholly-owned captive insurance subsidiary of ours, charges the operating subsidiary companies premiums to insure the retained workers’ compensation, general liability and auto exposures. Pursuant to South Carolina insurance regulations, Dollar Tree Insurance, Inc. maintains certain levels of cash and cash equivalents related to its self-insured exposures.\nWe also maintain certain cash balances related to our insurance programs which are held in trust and restricted as to withdrawal or use. These amounts are reflected in “Restricted cash” in the accompanying Consolidated Balance Sheets and amounted to $\n75.7\n million and $\n72.3\n million at February 1, 2025 and February 3, 2024, respectively.\nLease Accounting\nOur lease portfolio primarily consists of leases for our retail store locations, vehicles and trailers, as well as distribution center space and equipment. In accordance with ASC Topic 842 “Leases,” we determine if an arrangement is a lease at inception by evaluating whether the arrangement conveys the right to use an identified asset and whether we obtain substantially all of the economic benefits from and have the ability to direct the use of the asset. Leases with an initial term of 12 months or less are not recorded on the Consolidated Balance Sheets. We recognize expense for these leases on a straight-line basis over the lease term. For leases with an initial term in excess of 12 months, we determine the initial classification and measurement of the right-of-use (“ROU”) assets and lease liabilities at the lease commencement date and thereafter if modified. ROU assets represent our right to control the underlying assets under lease, over the contractual term. ROU assets and lease liabilities are recognized on the Consolidated Balance Sheets based on the present value of future minimum lease payments to be made over the lease term. \nAs most of our leases do not provide an implicit rate, we use our incremental borrowing rate in determining the present value of future lease payments. Inputs to the calculation of our incremental borrowing rate include the valuations and yields of our outstanding senior notes and their credit spreads over comparable U.S. Treasury rates, adjusted to a collateralized basis by estimating the credit spread improvement that would result from an upgrade of one ratings classification. Most leases include one or more options to renew and the exercise of renewal options is at our sole discretion. We do not include renewal options in our determination of the lease term unless the renewals are deemed to be reasonably certain. Operating lease expense for lease payments not yet paid is recognized on a straight-line basis over the lease term. The operating lease ROU asset is reduced by lease incentives, which has the effect of lowering the operating lease expense. Operating lease ROU assets are periodically reviewed for impairment losses. We use the long-lived assets impairment guidance in ASC Subtopic 360-10 “Property, Plant, and Equipment - Overall,” to determine whether an ROU asset is impaired, and if so, the amount of the impairment loss to recognize.\nWe have real estate leases that typically include payments related to non-lease components, such as common area maintenance, as well as payments for real estate taxes and insurance which are not considered components of the lease. These payments are generally variable and based on actual costs incurred by the lessor. These costs are expensed as incurred as variable lease costs and excluded for the purpose of calculating the ROU asset and lease liability. A smaller number of real estate leases contain fixed payments for common area maintenance, real estate taxes and insurance. These fixed payments are considered part of the lease payment and included in the ROU asset and lease liability. In addition, certain of our lease agreements include rental payments based on a percentage of retail sales over contractual levels and others include rental payments adjusted periodically for inflation. These payments are expensed as incurred as variable lease costs. Our lease agreements do not contain any material residual value guarantees or material restrictive financial covenants.\n48\nTable of Contents\nImpairment of Long-Lived Assets and Long-Lived Assets to be Disposed of\nIn accordance with ASC Topic 360, we review our long-lived assets and certain identifiable intangible assets for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. Recoverability of assets to be held and used is measured by comparing the carrying amount of an asset to future net undiscounted cash flows expected to be generated by the asset. If such assets are considered to be impaired, the impairment to be recognized is measured as the amount by which the carrying amount of the assets exceeds the fair value of the assets based on discounted cash flows or other readily available evidence of fair value, if any. Assets to be disposed of are reported at the lower of the carrying amount or fair value less costs to sell.\n \nIn fiscal 2024, fiscal 2023 and fiscal 2022, we recorded impairment charges related to continuing operations of $\n52.1\n million, $\n10.9\n million and $\n1.4\n million, respectively, to write down certain assets. These charges are recorded as a component of “\nSelling, general and administrative expenses\n” in the accompanying Consolidated Statements of Operations. Of the impairment charges recorded in fiscal 2024, approximately $\n44.0\n million related to capitalized software costs for enterprise merchandising and store system projects that were not fully implemented and were cancelled in connection with the decision to sell the Family Dollar business.\nRefer to \nNote 15\n for discussion of impairment charges recorded related to discontinued operations.\nGoodwill and Nonamortizing Intangible Assets\nGoodwill and nonamortizing intangible assets, including trade names acquired in business combinations, are not amortized, but rather tested for impairment at least annually. In addition, goodwill and nonamortizing intangible assets are tested on an interim basis if an event or circumstance indicates that it is more likely than not that an impairment loss has been incurred. For both goodwill and nonamortizing intangible assets, we have the option to initially perform a qualitative assessment to determine whether it is more likely than not that an impairment exists. Alternatively, we may bypass the qualitative assessment in any given year and proceed directly to performing the quantitative impairment test. We perform our annual impairment testing of goodwill and nonamortizing intangible assets during the fourth quarter of each year. Our reporting units are determined in accordance with the provisions of ASC Topic 350, “Intangibles - Goodwill and Other.” \nWhen a quantitative impairment test is performed for an acquired trade name, we compare the fair value, based on an income approach using the relief-from-royalty method, to its carrying value. If the carrying value of the asset exceeds its estimated fair value, an impairment loss is recognized in an amount equal to that excess. \nWhen a quantitative impairment test is performed for goodwill, we estimate the fair value of the reporting unit using a combination of a market multiple method and a discounted cash flow method. We recognize goodwill impairment for the amount by which the reporting unit’s carrying amount exceeds its estimated fair value, not to exceed the total carrying amount of goodwill allocated to the reporting unit.\nThere were no impairments of goodwill associated with continuing operations in fiscal 2024, fiscal 2023 and fiscal 2022. Refer to \nNote 15\n for information on goodwill and trade name intangible assets from discontinued operations, including the results of the impairment tests.\nRevenue Recognition\nWe recognize revenue in accordance with ASC Topic 606 \"Revenue from Contracts with Customers.\" Net sales consist of the net sales of merchandise in our stores. Revenue transactions associated with the sale of merchandise comprise a single performance obligation, which consists of the sale of products to customers. Revenue is recognized when we satisfy our performance obligations by transferring control of promised products to our customers, which occurs at a point in time. Sales taxes imposed on our revenues from product sales are presented on a net basis in the accompanying Consolidated Statements of Operations. Gift cards that we issue to customers are recorded as contract liabilities until they are redeemed in our stores, at which point revenue is recognized. We record reductions to revenue for discounts.\n \nCost of Sales\nWe include the cost of merchandise, warehousing and distribution costs, and certain occupancy costs in cost of sales.\nVendor Allowances\nWe receive vendor support in the form of cash payments or allowances through various reimbursements such as purchase discounts, markdowns and volume rebates. We have agreements with vendors setting forth the specific conditions for each allowance or payment. In accordance with ASC Subtopic 705-20 “Accounting for Consideration Received from a Vendor,” we either recognize the allowance as a reduction of current costs or defer the payment over the period the related merchandise is sold. If the payment is a reimbursement for costs incurred, it is offset against those related costs; otherwise, it is treated as a reduction to the cost of merchandise.\n49\nTable of Contents\nPre-Opening Costs\nWe capitalize certain internal labor costs related to new, expanded, renovated, relocated and re-bannered stores after the project becomes probable and only when the costs are directly attributable to the preparation of the store-related assets for their intended use. We expense all other pre-opening costs related to our stores and distribution centers, as incurred.\n \nIncome Taxes\nIn accordance with ASC Topic 740 “Income Taxes,” income taxes are accounted for under the asset and liability method. Deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date of such change. Deferred tax assets are reduced by valuation allowances when necessary. Assessing whether deferred tax assets are realizable requires significant judgment. We consider all available positive and negative evidence, including historical operating performance and expectations of future operating performance. The ultimate realization of deferred tax assets is often dependent upon future taxable income and therefore can be uncertain. To the extent we believe it is more likely than not that all or some portion of the asset will not be realized, valuation allowances are established against our deferred tax assets, which increase income tax expense in the period when such a determination is made. Income taxes include the largest amount of tax benefit for an uncertain tax position that is more likely than not to be sustained upon audit based on the technical merits of the tax position. Settlements with tax authorities, the expiration of statutes of limitations for particular tax positions or obtaining new information on particular tax positions may cause a change to the effective tax rate.\nWe have made the policy election to record any liability associated with Global Intangible Low Tax Income (\"GILTI\") in the period in which it is incurred. \nWe include interest and penalties in the provision for income tax expense and income taxes payable. We do not provide for any penalties associated with tax contingencies unless they are considered probable of assessment.\nStock-Based Compensation\nWe account for stock-based compensation in accordance with ASC Topic 718 “Compensation - Stock Compensation,” which requires all stock-based compensation awards granted to be measured at fair value and recognized as an expense in the financial statements over the service period. In addition, this guidance requires that excess tax benefits related to stock-based compensation awards be reflected as operating cash flows. We use the Black-Scholes option pricing model to estimate the fair market value of stock option awards and grant date fair value for restricted stock units. We use the \"simplified method\" to estimate the expected life of options, as permitted by accounting guidance. The \"simplified method\" calculates the expected life of a stock option equal to the time from grant to the midpoint between the vesting date and contractual term, taking into account all vesting tranches. The risk-free interest rate is based on the yield for the U.S. Treasury bill with a maturity equal to the expected life of the stock option. Expected volatility is based on our historical average. Compensation expense is recognized net of forfeitures on a straight-line basis over the total vesting period, which is the implied requisite service period, or a shorter period based on the retirement eligibility of the grantee. Compensation expense for performance-based awards is recorded over the implied requisite service period when achievement of the performance target is deemed probable. We issue new shares upon exercise of stock options and upon vesting of restricted stock units.\n Refer to \nNote 10\n for further details on stock-based compensation.\nEarnings Per Share\nIn accordance with ASC Topic 260 “Earnings Per Share,” basic earnings (loss) per share has been computed by dividing net income (loss) by the weighted average number of shares outstanding. Diluted earnings (loss) per share reflects the potential dilution that could occur assuming the inclusion of dilutive potential shares and has been computed by dividing net income (loss) by the weighted average number of shares and dilutive potential shares outstanding. Dilutive potential shares include all outstanding stock options and unvested restricted stock units after applying the treasury stock method. Diluted earnings per share of common stock from continuing operations, diluted earnings (loss) per share of common stock from discontinued operations and diluted earnings (loss) per share of common stock include the effect of dilutive potential shares based on applying the control number concept in ASC Topic 260. The control number concept requires that the same number of potentially dilutive securities applied in computing diluted earnings per share from continuing operations be applied to all other categories of income or loss, even if the effect is anti-dilutive.\nForeign Currency\nThe functional currencies of certain of our international subsidiaries are the local currencies of the countries in which the subsidiaries are located. In accordance with ASC Topic 830 “Foreign Currency Matters,” foreign currency denominated assets and liabilities are translated into U.S. dollars using the exchange rates in effect at the consolidated balance sheet date. Results of operations \n50\nTable of Contents\nand cash flows are translated using the average exchange rates throughout the period. Capital accounts are translated at historical foreign currency exchange rates. The effect of exchange rate fluctuations on translation of assets and liabilities is included as a component of shareholders’ equity in accumulated other comprehensive loss. Adjustments that arise from foreign currency exchange rate changes on transactions, primarily driven by intercompany transactions, denominated in a currency other than the functional currency are included in “Other (income) expense, net” in the accompanying Consolidated Statements of Operations. These adjustments have not historically been significant.\n \nRecently Adopted Accounting Pronouncements\nIn September 2022, the Financial Accounting Standards Board (“FASB”) issued Accounting Standards Update (“ASU”) 2022-04 \"Liabilities - Supplier Finance Programs (Subtopic 405-50)\" (\"ASU 2022-04\") which requires entities to disclose the key terms of supplier finance programs used in connection with the purchase of goods and services along with information about their obligations under these programs, including a rollforward of those obligations. We adopted ASU 2022-04 in fiscal 2023 on a retrospective basis, except for the amendments relating to the rollforward requirement, which we adopted effective February 1, 2025 on a prospective basis. The adoption did not have a material impact on our consolidated financial statements. Refer to \nNote 14\n for a discussion of our supply chain finance program and the rollforward of our outstanding payment obligations under the program.\nIn November 2023, the FASB issued ASU 2023-07 “Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures” (“ASU 2023-07”) which requires disclosure of incremental segment information on an annual and interim basis, including enhanced disclosures about significant segment expenses that are regularly provided to the chief operating decision maker (“CODM”) and included within each reported measure of segment profit or loss. ASU 2023-07 also requires entities to disclose the title and position of the CODM and explain how the CODM uses the reported measures of segment profit or loss in assessing performance and allocating resources. Further, it requires that all annual disclosures about a reportable segment’s profit or loss and assets currently required by Topic 280 be provided in interim periods. We adopted ASU 2023-07 effective February 1, 2025 on a retrospective basis. Refer to \nNote 13\n for our segment disclosures. \nRecently Issued Accounting Pronouncements\nIn December 2023, the FASB issued ASU 2023-09 “Income Taxes (Topic 740): Improvements to Income Tax Disclosures” (“ASU 2023-09”) which requires entities to disclose specific categories and greater disaggregation of information in the effective tax rate reconciliation, as well as disaggregated disclosure of income taxes paid, pretax income and income tax expense by jurisdiction. The standard also removes certain disclosure requirements that currently exist under Topic 740. ASU 2023-09 is effective on a prospective basis for annual periods beginning in fiscal 2025, with retrospective application permitted. We are currently evaluating the impact of this standard to our consolidated financial statements. \nIn November 2024, the FASB issued ASU 2024-03 “Income Statement–Reporting Comprehensive Income–Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses” (“ASU 2024-03”) which requires disaggregated disclosure of certain costs and expenses, including purchases of inventory, employee compensation, depreciation, amortization and depletion, within relevant income statement captions. ASU 2024-03 is effective on a prospective basis for annual periods beginning in fiscal 2027 and for interim periods beginning in fiscal 2028, with retrospective application permitted. We are currently evaluating the impact of this standard to our consolidated financial statements.\nNote 3 - \nSupplemental Balance Sheet Information\nProperty, Plant and Equipment, Net\nProperty, plant and equipment, net, as of February 1, 2025 and February 3, 2024 consists of the following: \n(in millions)\nFebruary 1, 2025\nFebruary 3, 2024\nLand\n$\n162.7\n \n$\n161.3\n \nBuildings\n1,403.3\n \n1,229.2\n \nLeasehold improvements\n2,766.8\n \n2,396.1\n \nFurniture, fixtures and equipment\n3,589.1\n \n3,242.6\n \nConstruction in progress\n909.7\n \n1,024.3\n \nTotal property, plant and equipment\n8,831.6\n \n8,053.5\n \nLess: accumulated depreciation\n4,332.3\n \n4,231.4\n \nTotal property, plant and equipment, net\n$\n4,499.3\n \n$\n3,822.1\n \n Depreciation expense was $\n524.8\n million, $\n400.6\n million, and $\n365.3\n million for the years ended February 1, 2025, February 3, 2024, and January 28, 2023, respectively.\n51\nTable of Contents\nAccrued capital expenditures were $\n61.1\n million, $\n82.2\n million, and $\n31.7\n million at February 1, 2025, February 3, 2024, and January 28, 2023, respectively.\nOther Current Liabilities\nOther current liabilities as of February 1, 2025 and February 3, 2024 consist of the following:\n(in millions)\nFebruary 1, 2025\nFebruary 3, 2024\nTaxes (other than income taxes)\n$\n120.2\n \n$\n145.8\n \nCompensation and benefits\n157.6\n \n164.5\n \nInsurance\n99.0\n \n77.3\n \nOther\n197.6\n \n190.7\n \nTotal other current liabilities\n$\n574.4\n \n$\n578.3\n \nNote 4 - \nIncome Taxes \nThe provision for income taxes consists of the following: \n \nYear Ended\n(in millions)\nFebruary 1, 2025\nFebruary 3, 2024\nJanuary 28, 2023\nCurrent taxes:\nFederal\n$\n238.0\n \n$\n279.1\n \n$\n342.1\n \nState\n53.6\n \n61.9\n \n74.2\n \nForeign\n0.2\n \n—\n \n0.1\n \nTotal current taxes\n291.8\n \n341.0\n \n416.4\n \nDeferred taxes:\nFederal\n37.7\n \n38.8\n \n42.1\n \nState\n5.8\n \n10.4\n \n8.6\n \nForeign\n5.8\n \n5.9\n \n4.5\n \nTotal deferred taxes\n49.3\n \n55.1\n \n55.2\n \nProvision for income taxes\n$\n341.1\n \n$\n396.1\n \n$\n471.6\n \nCash paid for income taxes related to continuing operations totaled $\n175.9\n million, $\n274.0\n million and $\n401.3\n million in fiscal 2024, fiscal 2023 and fiscal 2022, respectively.\nOn August 16, 2022, the Inflation Reduction Act of 2022 (“2022 Tax Act”) was enacted into law. A key provision of the 2022 Tax Act is a 15% minimum tax on adjusted financial statement income. We do not expect any impact to our effective tax rate as a result of the 15% minimum tax under the 2022 Tax Act. \nA reconciliation of the statutory U.S. federal income tax rate and the effective tax rate follows: \n \nYear Ended\nFebruary 1, 2025\nFebruary 3, 2024\nJanuary 28, 2023\nStatutory U.S. federal income tax rate\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nEffect of:\nState and local income taxes, net of federal income tax benefit\n3.3\n \n3.4\n \n3.6\n \nNon-deductible expenses\n1.4\n \n0.7\n \n0.9\n \nWork Opportunity Tax Credit\n(\n0.8\n)\n(\n1.0\n)\n(\n0.8\n)\nOther, net\n(\n0.2\n)\n(\n0.3\n)\n(\n0.8\n)\nEffective tax rate\n24.7\n \n%\n23.8\n \n%\n23.9\n \n%\n52\nTable of Contents\nReinvestment of Unremitted Earnings\nSubstantially all of our current year foreign cash earnings in excess of working capital and cash needed for strategic investments are not intended to be indefinitely reinvested offshore. Therefore, the tax effects of repatriation for applicable state taxes and foreign withholding taxes of such cash earnings have been provided for in the accompanying Consolidated Statements of Operations. We have the intent and ability to reinvest substantially all of the non-cash unremitted earnings of our non-U.S. subsidiaries indefinitely. Accordingly, no provision for state taxes or foreign withholding taxes was recorded on these unremitted earnings in the accompanying Consolidated Statements of Operations. \nDeferred Income Taxes\nDeferred income taxes reflect the net tax effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes.\nSignificant components of our net deferred tax assets (liabilities) follow:\n(in millions)\nFebruary 1,\n2025\nFebruary 3,\n2024\nDeferred tax assets:\n \n \nOperating lease liabilities\n$\n1,841.3\n \n$\n1,800.4\n \nImpairment of assets held for sale\n870.3\n \n—\n \nNet operating losses, interest expense and credit carryforwards\n55.4\n \n72.8\n \nAccrued expenses\n37.2\n \n35.7\n \nAccrued compensation expense\n39.5\n \n39.3\n \nState tax election\n11.8\n \n13.1\n \nOther\n3.3\n \n4.7\n \nTotal deferred tax assets\n2,858.8\n \n1,966.0\n \nValuation allowance\n(\n11.6\n)\n(\n17.3\n)\nDeferred tax assets, net\n2,847.2\n \n1,948.7\n \nDeferred tax liabilities:\n \n \nOperating lease ROU assets\n(\n1,698.8\n)\n(\n1,639.7\n)\nOther intangibles\n(\n196.1\n)\n(\n529.1\n)\nProperty and equipment\n(\n623.7\n)\n(\n571.8\n)\nPrepaids\n(\n46.1\n)\n(\n35.8\n)\nInventory\n(\n21.9\n)\n(\n4.4\n)\nTotal deferred tax liabilities\n(\n2,586.6\n)\n(\n2,780.8\n)\nDeferred income taxes, net\n$\n260.6\n \n$\n(\n832.1\n)\nAt February 1, 2025, we had certain state tax credit carryforwards, net operating loss carryforwards and capital loss carryforwards totaling $\n55.4\n million. Some of these carryforwards will expire, if not utilized, beginning in fiscal \n2025\n through fiscal \n2044\n.\nA valuation allowance of $\n11.6\n million, net of federal tax benefits, has been provided principally for certain state credit carryforwards and net operating loss carryforwards. In assessing the realizability of deferred tax assets, we consider whether it is more likely than not that some portion or all of the deferred taxes will not be realized. Based upon the availability of carrybacks of future deductible amounts and our projections for future taxable income over the periods in which the deferred tax assets are deductible, we believe it is more likely than not the remaining existing deductible temporary differences will reverse during periods in which carrybacks are available or in which we generate net taxable income. \nUncertain Tax Positions\nWe are participating in the IRS Compliance Assurance Program (“CAP”) for fiscal 2024 and we have been accepted into the program for fiscal 2025. This program accelerates the examination of key transactions with the goal of resolving any issues before the tax return is filed. Our federal tax returns have been examined and all issues have been settled through the fiscal 2022 tax year. In fiscal 2020, we participated in the CAP under the IRS’s bridge year program and as a result, the IRS will not be completing an audit on the fiscal 2020 tax return at this time. Several states completed their examinations during fiscal 2024. In general, fiscal 2021 and forward are within the statute of limitations for state tax purposes. The statute of limitations is still open prior to fiscal 2021 for some states. \n53\nTable of Contents\nThe balance for unrecognized tax benefits at February 1, 2025 was $\n28.2\n million. The total amount of unrecognized tax benefits at February 1, 2025 that, if recognized, would affect the effective tax rate was $\n23.1\n million (net of the federal tax benefit).\nThe following is a reconciliation of our total gross unrecognized tax benefits:\n(in millions)\nFebruary 1, 2025\nFebruary 3, 2024\nBeginning Balance\n$\n22.0\n \n$\n17.4\n \nAdditions for tax positions of prior years\n10.2\n \n5.6\n \nAdditions, based on tax positions related to current year\n4.8\n \n2.3\n \nSettlements\n(\n2.3\n)\n(\n0.3\n)\nLapses in statutes of limitation\n(\n6.5\n)\n(\n3.0\n)\nEnding balance\n$\n28.2\n \n$\n22.0\n \nIt is possible that tax reserves will be reduced for audit settlements and statute expirations within the next 12 months. At this point it is not possible to estimate a range associated with the resolution of these audits. We do not expect any change to have a material impact to our consolidated financial statements.\nAs of February 1, 2025, we have recorded a liability for potential interest and penalties of $\n2.7\n million.\nNote 5 – \nCommitments and Contingencies\nPurchase Obligations\nAt February 1, 2025, we have commitments totaling $\n38.2\n million through fiscal 2025 related to ocean shipping contracts and commitments of $\n299.2\n million through fiscal 2034 related to agreements for software licenses and support, telecommunication services and store technology assets and maintenance for our stores. \nLetters of Credit\nWe have $\n200.0\n million in trade letters of credit with various financial institutions, under which $\n3.6\n million was committed to these letters of credit issued for routine purchases of imported merchandise at February 1, 2025.\nSurety Bonds\nWe have issued various surety bonds that primarily serve as collateral for utility payments at our stores and self-insured insurance programs. These bonds total $\n129.3\n million and are committed through various dates through fiscal 2027.\nContingencies\nInsurance Claims\nOn April 28, 2024, a tornado destroyed our Dollar Tree distribution center in Marietta, Oklahoma. Based on the significant damage sustained by the facility, the inventory contained in the facility and the facility itself are not salvageable. We incurred losses totaling $\n117.0\n million in the first quarter of fiscal 2024, consisting of $\n70.0\n million related to damaged inventory and $\n47.0\n million related to property and equipment. These losses were fully offset by insurance receivables. As of February 1, 2025, we recorded additional insurance receivables of approximately $\n7.0\n million for other property and equipment-related damage recoveries that we expect to be reimbursed under the terms of our insurance policy. As of February 1, 2025, we have received insurance proceeds totaling $\n150.0\n million, including $\n100.0\n million related to damaged inventory and $\n50.0\n million related to damaged property and equipment. For the year ended February 1, 2025, we recorded a gain of $\n30.0\n million for the excess of the insurance proceeds received over the losses incurred for damaged inventory, which is reflected within “\nOther (income) expense, net\n” in the accompanying Consolidated Statements of Operations. \nThe foregoing losses and expected insurance recoveries are based on information currently available to us. We continue to assess these estimates and will recognize any changes to these estimates in the period(s) in which they are determined. The final losses, insurance recoveries and net charges could vary from these estimates.\nLegal Proceedings\nWe are defendants in ordinary, routine litigation or proceedings incidental to our business, including employment-related matters; infringement of intellectual property rights; personal injury/wrongful death claims; real estate matters; environmental and safety issues; and product safety matters. Legal proceedings may also include class, collective, representative and large cases and \n54\nTable of Contents\narbitrations, including those described below. We will vigorously defend ourselves in these matters. We do not believe that any of these matters will, individually or in the aggregate, have a material effect on our business, financial condition, or liquidity. We cannot give assurance, however, that one or more of these matters will not have a material effect on our results of operations for the quarter or year in which they are reserved or resolved.\nWe assess our legal proceedings monthly and reserves are established if a loss is probable and the amount of such loss can be reasonably estimated. Many, if not substantially all, of our legal proceedings are subject to significant uncertainties and, therefore, determining the likelihood of a loss and the measurement of any loss can be complex and subject to judgment. With respect to the matters noted below where we have determined that a loss is reasonably possible but not probable, we are unable to reasonably estimate the amount or range of the possible loss at this time due to the inherent difficulty of predicting the outcome of and uncertainties regarding legal proceedings. Our assessments are based on estimates and assumptions that have been deemed reasonable by management, but that may prove to be incomplete or inaccurate, and unanticipated events and circumstances may occur that might cause us to change those estimates and assumptions. Management’s assessment of legal proceedings could change because of future determinations or the discovery of facts which are not presently known. Accordingly, the ultimate costs of resolving these proceedings may be substantially higher or lower than currently estimated.\nActive Matters\nTalc Product Matters\nMultiple personal injury lawsuits are pending in state court in California, Illinois, Louisiana, New York, Texas, and New Jersey against Dollar Tree, Family Dollar or both alleging that certain talc products that we sold caused cancer. The plaintiffs seek compensatory, punitive and exemplary damages, damages for loss of consortium, and attorneys’ fees and costs. Although we have been able to resolve previous talc lawsuits against us without material loss, given the inherent uncertainties of litigation there can be no assurances regarding the outcome of pending or future cases. Future costs to litigate these cases are not known but may be material, and it is uncertain whether our costs will be covered by insurance. In addition, although we have indemnification rights against our vendors in several of these cases, it is uncertain whether the vendors will have the financial ability to fulfill their obligations to us.\nAcetaminophen Matters\nBeginning in August 2022, more than \n50\n personal injury cases have been filed in federal court against Dollar Tree, Family Dollar, or both, on behalf of minors alleging that their mothers took acetaminophen while pregnant, that the acetaminophen interfered with fetal development such that plaintiffs were born with autism and/or ADHD, and that we knew or should have known of the danger, had a duty to warn and failed to include appropriate warnings on the product labels. The plaintiffs seek compensatory, punitive and/or exemplary damages, restitution and disgorgement, economic damages, and attorneys’ fees and costs. These cases, which originated in Alabama, California, Florida, Georgia, Louisiana, Minnesota, Missouri, North Carolina, Kentucky, Tennessee and Texas, along with other cases against many other defendants, were consolidated into multi-district court litigation in the Southern District of New York. The court disqualified plaintiffs’ experts and, on that basis dismissed all the cases which had been filed at the time of that decision, including all cases currently filed against us. The dismissal has been appealed to the Second Circuit by plaintiffs.\n55\nTable of Contents\nNote 6 - \nShort-Term Borrowings and Long-Term Debt\nShort-term borrowings and long-term debt consist of the following:\n(in millions)\nFebruary 1, 2025\nFebruary 3, 2024\nShort-Term Borrowings:\nUnsecured commercial paper notes\n$\n—\n \n$\n—\n \n$\n1.5\n billion revolving credit facility\n—\n \n—\n \nTotal Short-Term Borrowings\n$\n—\n \n$\n—\n \nLong-Term Debt:\n4.00\n% Senior Notes, due May 2025\n$\n1,000.0\n \n$\n1,000.0\n \n4.20\n% Senior Notes, due May 2028\n1,250.0\n \n1,250.0\n \n2.65\n% Senior Notes, due December 2031\n800.0\n \n800.0\n \n3.375\n% Senior Notes, due December 2051\n400.0\n \n400.0\n \nDebt discount and issuance costs\n(\n18.8\n)\n(\n23.7\n)\nTotal Long-Term Debt\n$\n3,431.2\n \n$\n3,426.3\n \nLess: Current portion\n$\n1,000.0\n \n$\n—\n \nNon-current portion of long-term debt\n$\n2,431.2\n \n$\n3,426.3\n \nShort-Term Borrowings\nCommercial Paper Program\nIn fiscal 2023, the Company established a commercial paper program to issue unsecured commercial paper notes with maturities up to \n397\n days from the date of issue, up to a maximum aggregate face or principal amount outstanding at any time of $\n1.5\n billion. The net proceeds of note issuances are used for general corporate purposes. The Company’s revolving credit facility, which is discussed below, serves as a liquidity backstop for the repayment of notes outstanding under the program. The notes rank equally with all of our other unsecured and unsubordinated debt. We issued and repaid $\n3.2\n billion and $\n1.1\n billion principal amount of notes in fiscal 2024 and fiscal 2023, respectively, and incurred interest expense of $\n3.9\n million and $\n2.6\n million, respectively, related to these notes. At February 1, 2025 and February 3, 2024, \nno\n notes were outstanding under the program.\nRevolving Credit Facility\nThe Company’s $\n1.5\n billion five-year revolving credit facility (the “Revolving Credit Facility”), of which up to $\n350.0\n million is available for letters of credit, is currently set to mature on December 8, 2026. At February 1, 2025 and February 3, 2024, we had letters of credit outstanding under the Revolving Credit Facility of $\n3.8\n million and $\n4.1\n million, respectively. We did not borrow under the Revolving Credit Facility in fiscal 2024 or fiscal 2023. In fiscal 2022, we borrowed and repaid $\n555.0\n million of loans under the Revolving Credit Facility and incurred interest expense of $\n3.6\n million related to these borrowings. We had \nno\n borrowings outstanding under the Revolving Credit Facility at February 1, 2025 and February 3, 2024. Borrowings under the Revolving Credit Facility bear interest at the Adjusted Term SOFR Rate (as defined in the underlying credit agreement) plus \n1.125\n%, subject to adjustment based on (i) our public debt rating and (ii) our leverage ratio. At February 1, 2025, the Revolving Credit Facility bore interest at \n5.54\n%. We pay certain commitment fees in connection with the Revolving Credit Facility. The Revolving Credit Facility allows voluntary repayment of outstanding loans at any time without premium or penalty, other than customary “breakage” costs with respect to Secured Overnight Financing Rate (“SOFR”) loans. \nThe Revolving Credit Facility contains a number of customary affirmative and negative covenants that, among other things, restrict, subject to certain exceptions, the Company’s ability to incur subsidiary indebtedness, incur liens, sell all or substantially all of our (including our subsidiaries’) assets and consummate certain fundamental changes. The Revolving Credit Facility also contains financial covenants, including a maximum leverage ratio covenant and a minimum fixed charge coverage ratio covenant. As of February 1, 2025, we were in compliance with all applicable covenants.\nLong-Term Debt\nSenior Notes\nThe Company’s outstanding senior notes summarized in the table above are unsecured, unsubordinated obligations of the Company, ranking equally in right of payment among themselves and with the Company’s existing and future unsecured and unsubordinated debt. The Company, at its option, may redeem each series of the senior notes at any time, in whole or in part, at  \n56\nTable of Contents\nredemption prices set forth in the respective indentures. Additionally, upon certain events, the holders of the notes have the right to require the Company to repurchase all or a portion of their notes at a price of \n101\n% of the principal amount of the notes, plus accrued and unpaid interest. Interest on all outstanding senior notes is payable semiannually.\nThe senior notes contain covenants that, among other things, limit our ability to incur certain secured debt. As of February 1, 2025, we were in compliance with all applicable covenants. \nMaturities of long-term debt are as follows (in millions): \nFiscal Year\n(in millions)\n2025\n$\n1,000.0\n \n2026\n—\n \n2027\n—\n \n2028\n1,250.0\n \n2029\n—\n \nThereafter\n1,200.0\n \nTotal\n$\n3,450.0\n \nNote 7 - \nLeases\nOur lease portfolio primarily consists of leases for our retail store locations, vehicles and trailers, as well as distribution center space and equipment.\nThe lease cost for operating leases that was recognized in the accompanying Consolidated Statements of Operations was as follows:\nYear Ended\n(in millions)\nFebruary 1, 2025\nFebruary 3, 2024\nJanuary 28, 2023\nOperating lease cost\n$\n1,041.6\n \n$\n948.1\n \n$\n907.2\n \nVariable lease cost\n328.9\n \n296.0\n \n279.7\n \nShort-term lease cost\n21.5\n \n15.6\n \n8.9\n \nTotal lease cost*\n$\n1,392.0\n \n$\n1,259.7\n \n$\n1,195.8\n \n*Excludes sublease income, which is immaterial\nThere are no residual value guarantees that exist, and there are no restrictions or covenants imposed by leases.\nAs of February 1, 2025, maturities of lease liabilities were as follows:\nFiscal Year\n(in millions)\n2025\n$\n1,014.3\n \n2026\n986.6\n \n2027\n826.9\n \n2028\n646.0\n \n2029\n476.5\n \nThereafter\n923.4\n \nTotal undiscounted lease payments\n4,873.7\n \nLess interest\n474.3\n \nPresent value of lease liabilities\n$\n4,399.4\n \nThe future lease payments above exclude $\n154.0\n million of legally binding minimum lease payments for leases signed but not yet commenced as of February 1, 2025.\n57\nTable of Contents\nInformation regarding the weighted-average remaining lease term and the weighted-average discount rate for operating leases is as follows:\nFebruary 1, 2025\nFebruary 3, 2024\nJanuary 28, 2023\nWeighted-average remaining lease term (years)\n5.6\n5.4\n5.2\nWeighted-average discount rate\n4.6\n \n%\n4.0\n \n%\n3.4\n \n%\nThe following represents supplemental information pertaining to our operating lease arrangements:\nYear Ended\n(in millions)\nFebruary 1, 2025\nFebruary 3, 2024\nJanuary 28, 2023\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows from operating leases\n$\n1,047.6\n \n$\n1,038.6\n \n$\n900.4\n \nRight-of-use assets obtained in exchange for new operating lease liabilities\n$\n1,378.5\n \n$\n1,113.0\n \n$\n765.1\n \nNote 8 - \nFair Value Measurements\nFair value is defined as an exit price, representing the amount that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants. As such, fair value is a market-based measurement that should be determined based on assumptions that market participants would use in pricing an asset or liability. As a basis for considering such assumptions, a fair value hierarchy has been established that prioritizes the inputs used to measure fair value. The hierarchy gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (level 1 measurement) and the lowest priority to unobservable inputs (level 3 measurements). The three levels of the fair value hierarchy are as follows:\nLevel 1 - Quoted prices in active markets for identical assets or liabilities;\nLevel 2 - Quoted prices for similar instruments in active markets; quoted prices for identical or similar instruments in markets that are not active; and\nLevel 3 - Unobservable inputs in which there is little or no market data which require the reporting entity to develop its own assumptions.\nFinancial assets and liabilities are classified in the fair value hierarchy in their entirety based on the lowest level of input that is significant to the fair value measurement. Our assessment of the significance of a particular input to the fair value measurement requires judgment and may affect the valuation of fair value assets and liabilities and their placement within the fair value hierarchy levels.\nAssets and Liabilities Measured at Fair Value on a Nonrecurring Basis\nCertain assets and liabilities are measured at fair value on a nonrecurring basis; that is, the assets and liabilities are not measured at fair value on an ongoing basis but are subject to fair value adjustments in certain circumstances (e.g., when there is evidence of impairment). We review certain store assets for evidence of impairment. The fair values are determined based on the income approach, in which we utilize internal cash flow projections over the life of the underlying lease agreements discounted based on our risk-adjusted rate. These measures of fair value, and related inputs, are considered a Level 3 approach under the fair value hierarchy. Refer to \nNote 2\n under the caption “Impairment of Long-Lived Assets and Long-Lived Assets to be Disposed of” and \nNote 15\n for further information regarding the impairment charges recorded in fiscal 2024, fiscal 2023 and fiscal 2022.\nOur indefinite-lived intangible assets are recorded at carrying value, and, if impaired, are adjusted to fair value using Level 3 inputs. Refer to \nNote 2\n under the caption “Goodwill and Nonamortizing Intangible Assets” and \nNote 15\n for further information regarding the process of determining the fair value of these assets and the impairment charges recorded in fiscal 2024, fiscal 2023 and fiscal 2022.\nFair Value of Financial Instruments\nThe carrying amounts of “Cash and cash equivalents,” “Restricted cash” and “Accounts payable” as reported in the accompanying Consolidated Balance Sheets approximate fair value due to their short-term maturities. The carrying values of our Revolving Credit Facility and borrowings under our commercial paper program approximate their fair values. \n58\nTable of Contents\nThe aggregate fair values and carrying values of our long-term borrowings were as follows:\nFebruary 1, 2025\nFebruary 3, 2024\n(in millions)\nFair Value\nCarrying Value\nFair Value\nCarrying Value\nLevel 1\n \n \nSenior Notes\n$\n3,140.9\n \n$\n3,433.6\n \n$\n3,140.0\n \n$\n3,430.1\n \nThe fair values of our Senior Notes were determined using Level 1 inputs as quoted prices in active markets for identical assets or liabilities are available.\nNote 9 - \nShareholders’ Equity\nPreferred Stock\nWe are authorized to issue \n10,000,000\n shares of Preferred Stock, $\n0.01\n par value per share. \nNo\n preferred shares were issued and outstanding at February 1, 2025 and February 3, 2024.\nShare Repurchase Programs\nWe periodically repurchase shares of our common stock under share repurchase programs authorized by our Board of Directors. Under the existing Board repurchase authorization, we may repurchase up to $\n2.5\n billion of our common stock in open market or privately negotiated transactions with financial institutions. The repurchase authorization does not have an expiration date.\nWe repurchased \n3,283,837\n, \n3,905,599\n and \n4,613,696\n shares of common stock on the open market at a cost of $\n403.6\n million, $\n504.3\n million and $\n647.5\n million, including applicable excise tax, in fiscal 2024, fiscal 2023 and fiscal 2022, respectively. As of February 1, 2025, we had $\n952.4\n million remaining under our existing $\n2.5\n billion Board repurchase authorization.\nNote 10 - \nStock-Based Compensation Plans\nFixed Stock-Based Compensation Plans\nThe 2011 Omnibus Incentive Plan permitted us to grant to our employees, consultants and directors up to \n4.0\n million shares of our common stock plus any shares available under former plans which were previously approved by the shareholders. The plan permitted us to grant equity awards in the form of incentive stock options, non-qualified stock options, stock appreciation rights, restricted stock awards, service-based restricted stock units (“RSUs”), performance bonuses, performance-based restricted stock units (“PSUs”), non-employee director stock options and other equity-related awards. As of March 17, 2021, the plan was no longer available for new grants of awards, but all outstanding awards that were granted under the plan prior to March 17, 2021 continue to be governed by the terms and conditions of the plan and applicable award agreements. Effective June 10, 2021, the 2011 Omnibus Incentive Plan was replaced and superseded by the 2021 Omnibus Incentive Plan (“Omnibus Plan”). The Omnibus Plan permits us to grant up to \n6.5\n million shares of our common stock to our employees, consultants and directors. The form of equity awards authorized for grant under the Omnibus Plan are substantially the same as those permitted by the predecessor plan. \nAny restricted stock, RSUs or PSUs awarded are subject to certain general restrictions. The restricted stock shares or units may not be sold, transferred, pledged or disposed of until the restrictions on the shares or units have lapsed or have been removed under the provisions of the Omnibus Plan. In addition, if a holder of restricted shares or units ceases to be employed by us, any shares or units in which the restrictions have not lapsed will be forfeited.\nPrior to July 1, 2023, the 2013 Director Deferred Compensation Plan permitted our directors to defer all or a portion of fees for Board or Board committee service until a future date, at which time they may be paid in cash or shares of our common stock, or receive all or a portion of such fees in non-statutory stock options. Deferred fees that are paid out in cash will earn interest at the 30-year Treasury Bond Rate. Deferred amounts to be paid in common stock are determined by dividing the deferred fee amount by the closing market price of a share of our common stock on the date of deferral. The number of options issued to a director will equal the deferred fee amount divided by \n33\n% of the price of a share of our common stock. The exercise price will equal the fair market value of our common stock at the date the option is issued. The options are fully vested when issued and have a term of \n10\n years. The 2013 plan expired on June 30, 2023. All amounts deferred by directors pursuant to the terms of the 2013 plan on or before June 30, 2023 will continue to be administered in accordance with the terms of the 2013 plan and applicable deferral elections.\nBeginning July 1, 2023, our non-employee directors are permitted to defer all or a part of fees earned for his or her service as a director pursuant to our Non-Employee Director Deferred Compensation Program, which operates in conjunction with, and under the authority of, the Omnibus Plan. Pursuant to this program, cash fees may be deferred into either a cash account or a phantom stock account, and annual equity awards for service as a director may be deferred into the director’s phantom stock account. Deferred fees \n59\nTable of Contents\nthat are paid out in cash will earn interest at the 30-year Treasury Bond Rate. Deferred amounts to be paid in common stock are determined by dividing the deferred fee amount by the closing market price of a share of our common stock on the date of deferral.\nTotal stock-based compensation expense was recorded in the accompanying Consolidated Statements of Operations as follows:\n \nYear Ended\n(in millions)\nFebruary 1, 2025\nFebruary 3, 2024\nJanuary 28, 2023\nCost of sales\n$\n13.9\n \n$\n11.9\n \n$\n10.3\n \nSelling, general and administrative expenses\n93.0\n \n64.4\n \n81.2\n \nIncome (loss) from discontinued operations, net of tax\n18.0\n \n20.4\n \n18.9\n \nTotal stock-based compensation expense\n$\n124.9\n \n$\n96.7\n \n$\n110.4\n \nExcess tax benefit (deficit) on stock-based compensation\n    recognized in the provision for income taxes\n$\n(\n0.9\n)\n$\n3.9\n \n$\n9.8\n \nThe following discussion of our stock-based compensation awards includes awards related to continuing and discontinued operations. \nRestricted Stock\nWe issue RSUs to employees and officers and issue PSUs to certain of our officers. We recognize expense based on the estimated fair value of the RSUs or PSUs granted over the requisite service period, which is generally \nthree years\n, on a straight-line basis or a shorter period based on the retirement eligibility of the grantee. For PSUs, the compensation expense recorded is re-evaluated at each reporting period and adjusted, as necessary, based on the probability of achieving the performance criteria. \nRSUs\nThe fair value of RSUs is determined based on our closing stock price on the grant date. \nThe following table summarizes the status of RSUs as of February 1, 2025 and changes during the year then ended: \nNumber of RSUs\nWeighted Average Grant Date Fair Value\nNonvested at February 3, 2024\n839,186\n \n$\n141.45\n \nGranted\n668,169\n \n131.89\n \nVested\n(\n403,756\n)\n136.95\n \nForfeited\n(\n130,466\n)\n140.71\n \nNonvested at February 1, 2025\n973,133\n \n$\n136.86\n \nThe total fair value of the RSUs vested during the years ended February 1, 2025, February 3, 2024 and January 28, 2023 was $\n55.3\n million, $\n53.8\n million and $\n51.5\n million, respectively. The weighted average grant date fair value of the RSUs granted in fiscal 2024, fiscal 2023 and fiscal 2022 was $\n131.89\n, $\n141.70\n and $\n158.05\n, respectively. As of February 1, 2025, there was $\n73.6\n million of total unrecognized compensation expense related to the outstanding RSUs which is expected to be recognized over a weighted-average period of \n1.5\n years.\nPSUs\nHistorically, we have granted PSUs that have a service and performance condition. The fair value of these awards is determined based on our closing stock price on the grant date. In fiscal 2024 and fiscal 2023, we granted PSUs that cliff vest at the end of \nthree years\n and that contain a market condition modifier, in addition to having a service and performance condition. The market condition modifier can adjust the number of shares that vest under the award based on a comparison of our total shareholder return to that of a designated peer group over the performance period. \n60\nTable of Contents\nThe fair value of these awards incorporating the market condition was estimated on the grant date using a Monte Carlo simulation model with the following weighted average assumptions:\nFiscal 2024\nFiscal 2023\nExpected term (in years)\n2.8\n2.8\nExpected stock price volatility\n34.7\n \n%\n34.5\n \n%\nDividend yield\n—\n \n%\n—\n \n%\nRisk-free interest rate\n4.49\n \n%\n3.82\n \n%\nThe expected stock price volatility is based on the historical and implied volatility of our common stock over a period matching the expected term of the awards granted. The dividend yield reflects that we have never paid cash dividends. The risk-free interest rate represents the yield curve in effect at the time of grant for U.S. Treasury zero-coupon securities with maturities that approximate the expected term of the awards.\nThe following table summarizes the status of PSUs as of February 1, 2025 and changes during the year then ended: \nNumber of PSUs\nWeighted Average Grant Date Fair Value\nNonvested at February 3, 2024\n150,150\n \n$\n147.29\n \nGranted\n178,579\n \n114.98\n \nVested\n(\n70,749\n)\n128.03\n \nForfeited\n(\n40,864\n)\n151.60\n \nNonvested at February 1, 2025\n217,116\n \n$\n128.95\n \nThe total fair value of the PSUs vested during the years ended February 1, 2025, February 3, 2024 and January 28, 2023 was $\n9.1\n million, $\n8.7\n million and $\n44.5\n million, respectively. The weighted average grant date fair value of the PSUs granted in fiscal 2024, fiscal 2023 and fiscal 2022 was $\n114.98\n, $\n129.24\n and $\n159.57\n, respectively. As of February 1, 2025, there was $\n10.1\n million of total unrecognized compensation expense related to these PSUs which is expected to be recognized over a weighted-average period of \n1.4\n years. We assess the probability of the achievement of the remaining performance targets at the end of each reporting period and based on that assessment, cumulative adjustments may be recorded in future periods. \nStock Options\nHistorically, we have not used stock options broadly as part of our compensation strategy. In fiscal 2023, we began to issue stock options to certain key executives. These awards generally have a \nten-year\n term and vest in equal installments on each of the first \nthree\n anniversaries of the grant date, subject to the employees’ continued employment with the company through each vesting date. Stock options granted in fiscal 2024 and fiscal 2023 had a fair value of $\n5.6\n million and $\n4.9\n million, respectively. \nIn addition, in fiscal 2022, we granted a one-time award of options to purchase \n2,252,587\n shares of our common stock at a fair value of $\n135.6\n million to the then Executive Chairman of the Board, who was also appointed Chief Executive Officer of the company effective January 29, 2023. The grant of options was subject to the terms and conditions of a \nfive-year\n Executive Agreement. The option award has a \nten-year\n term and was scheduled to vest in equal installments on each of the first \nfive\n anniversaries of the grant date, subject to the Executive Chairman’s continued employment with the company through each vesting date. In the fourth quarter of fiscal 2024, the Executive Chairman and Chief Executive Officer resigned from the Company. As a result, $\n27.1\n million of expense was recognized in the fourth quarter of fiscal 2024 related to the accelerated vesting of an additional number of options pursuant to the terms of the Executive Agreement. Vested portions of the award remain excercisable through the original \nten-year\n term.\nStock options are valued using the Black-Scholes option pricing model and compensation expense is recognized on a straight-line basis over the requisite service period.\n61\nTable of Contents\nThe weighted average assumptions used in the Black-Scholes option pricing model for the executive stock options granted in fiscal 2024 and fiscal 2023, as well as the assumptions used for the fiscal 2022 award granted to the former Executive Chairman are as follows:\nFiscal 2024\nFiscal 2023\nFiscal 2022\nExpected term (in years)\n6.0\n6.0\n6.5\nExpected stock price volatility\n37.1\n \n%\n36.3\n \n%\n34.1\n \n%\nDividend yield\n—\n \n%\n—\n \n%\n—\n \n%\nRisk-free interest rate\n4.36\n \n%\n3.81\n \n%\n2.15\n \n%\nThe simplified method was used to estimate the expected term of the options due to our lack of historical option exercise experience and the “plain vanilla” characteristics of the option awards. The simplified method results in an expected term equal to the average of the weighted average time-to-vesting and the contractual life of the options. The expected stock price volatility is based on the historical volatility of our common stock over a period matching the expected term of the options granted. The dividend yield reflects that we have never paid cash dividends. The risk-free interest rate represents the yield curve in effect at the time of grant for U.S. Treasury zero-coupon securities with maturities that approximate the expected term of the options.\nPrior to July 1, 2023, certain of our directors elected to defer their compensation into stock options under the 2013 Director Deferred Compensation Plan. These options vested immediately and were expensed on the grant date. \nThe following tables summarize information about options outstanding at February 1, 2025 and changes during the year then ended:\n \nNumber of Shares\nWeighted Average Per Share Exercise Price\nWeighted Average Remaining Term (Years)\nAggregate Intrinsic Value\n(in millions)\nOutstanding at February 3, 2024\n2,360,102\n \n$\n155.84\n \n \n \nGranted\n102,147\n \n125.94\n \n \n \nExercised\n(\n726\n)\n76.97\n \n \n \nForfeited\n(\n661,498\n)\n156.42\n \n \n \nOutstanding at February 1, 2025\n1,800,025\n \n$\n154.49\n \n7.3\n$\n—\n \nExercisable at February 1, 2025\n1,669,653\n \n$\n156.55\n \n7.1\n$\n—\n \nThe intrinsic value of options exercised was less than $\n0.1\n million in each of fiscal 2024, fiscal 2023 and fiscal 2022. As of February 1, 2025, there was $\n3.9\n million of total unrecognized compensation expense related to these options which is expected to be recognized over a weighted-average period of \n1.5\n years.\n62\nTable of Contents\nNote 11 – Earnings \n(Loss) Per Share\nThe following table sets forth the calculations of basic and diluted earnings (loss) per share:\n \nYear Ended\n(in millions, except per share data)\nFebruary 1, 2025\nFebruary 3, 2024\nJanuary 28, 2023\nNumerator:\nIncome from continuing operations\n$\n1,042.5\n \n$\n1,265.8\n \n$\n1,500.1\n \nIncome (loss) from discontinued operations, net of tax\n(\n4,072.6\n)\n(\n2,264.2\n)\n115.3\n \nNet income (loss)\n$\n(\n3,030.1\n)\n$\n(\n998.4\n)\n$\n1,615.4\n \nDenominator:\nWeighted average number of shares outstanding\n215.7\n219.5\n223.2\nDilutive impact of share-based awards (as determined by applying the\n   treasury stock method)\n0.2\n0.4\n0.9\nWeighted average number of shares and dilutive potential shares\n   outstanding\n215.9\n219.9\n224.1\nBasic earnings (loss) per share of common stock:\nContinuing operations\n$\n4.83\n \n$\n5.77\n \n$\n6.72\n \nDiscontinued operations\n(\n18.88\n)\n(\n10.32\n)\n0.52\n \nTotal basic earnings (loss) per share of common stock\n$\n(\n14.05\n)\n$\n(\n4.55\n)\n$\n7.24\n \nDiluted earnings (loss) per share of common stock:\nContinuing operations\n$\n4.83\n \n$\n5.76\n \n$\n6.70\n \nDiscontinued operations\n(\n18.86\n)\n(\n10.30\n)\n0.51\n \nTotal diluted earnings (loss) per share of common stock\n$\n(\n14.03\n)\n$\n(\n4.54\n)\n$\n7.21\n \nFor the years ended February 1, 2025, February 3, 2024 and January 28, 2023, share-based awards of \n3.1\n million shares, \n2.4\n million shares and \n3.0\n million shares, respectively, were excluded from the calculation of diluted earnings per share because their inclusion would be anti-dilutive.\n \nNote 12 – \nEmployee Benefit Plan\nDollar Tree Retirement Savings Plan\nWe maintain a 401(k) plan which is available to all full-time, United States-based employees who are at least \n18\n years of age. Eligible employees may make elective salary deferrals. We make contributions in the form of a dollar-for-dollar match on the first \nfive\n percent of employee contributions to eligible employees who have completed \none year\n of service in which they have worked at least \n1,000\n hours.\nContributions to and reimbursements by us of expenses of the plan were recorded in the accompanying Consolidated Statements of Operations as follows:\n \nYear Ended\n(in millions)\nFebruary 1, 2025\nFebruary 3, 2024\nJanuary 28, 2023\nCost of sales\n$\n6.0\n \n$\n5.7\n \n$\n4.8\n \nSelling, general and administrative expenses\n18.0\n \n15.9\n \n14.3\n \nIncome (loss) from discontinued operations, net of tax\n14.4\n \n14.3\n \n12.6\n \nTotal retirement plan contributions\n$\n38.4\n \n$\n35.9\n \n$\n31.7\n \nAll eligible employees are immediately vested in any company match contributions under the 401(k) plan.\n63\nTable of Contents\nNote 13 – \nSegments and Disaggregated Revenue\nAs described in \nNote \n2\n under the caption “Assets Held for Sale and Discontinued Operations,” as well as \nNote 15\n below, effective as of the fourth quarter of fiscal 2024, the Company no longer reports the Family Dollar segment; it now reports its financial performance based on the Dollar Tree segment and corporate, support and other. The Dollar Tree segment is a leading operator of discount variety stores offering merchandise predominantly at the opening price point of $\n1.25\n, with additional offerings at higher price points. Dollar Tree stores serve customers with a broad range of income levels principally in suburban locations. The Dollar Tree segment includes our operations under the Dollar Tree and Dollar Tree Canada brands, \n15\n distribution centers in the United States and \ntwo\n distribution centers in Canada. Corporate, support and other consists primarily of store support center costs and the results of operations for our Summit Pointe property in Chesapeake, Virginia that are considered shared services and therefore these results are excluded from the Dollar Tree segment. \nOur CODM is our chief executive officer of the enterprise. The CODM evaluates the financial performance of the Dollar Tree segment using segment gross profit and operating income. The CODM reviews these metrics to allocate resources to the segment, primarily in the annual budget and quarterly forecasting process. The CODM considers variances between actual results and internal budgets/forecasts on a monthly basis for both profit measures when making decisions about allocating capital and resources to the segment. The CODM also uses segment gross profit to evaluate our ability to control product and supply chain costs relative to changes in sales between comparable periods. The CODM uses operating income to assess the overall performance for the segment. The CODM is provided asset information on a consolidated basis rather than by segment.\nThe accounting policies of the segments are the same as those described in \nNote 2\n. We may revise the measurement of each segment’s operating income, as determined by the information regularly reviewed by the CODM. If the measurement of a segment changes, prior period amounts and balances are reclassified to be comparable to the current period’s presentation. Corporate, support and other includes costs that were previously incurred in support of the Family Dollar segment but are not directly attributable to it and thus were not recorded in discontinued operations. \nInformation for our segments, as well as for corporate, support and other, including the reconciliation to income from continuing operations before income taxes, is as follows:\n64\nTable of Contents\n(in millions)\nDollar Tree Segment\nCorporate, Support and Other\nTotal\nYear Ended February 1, 2025\nNet sales\n$\n17,565.8\n \n$\n—\n \n$\n17,565.8\n \nCost of sales\n11,284.1\n \n—\n \n11,284.1\n \nGross Profit\n6,281.7\n \n—\n \n6,281.7\n \nOther revenue\n0.1\n \n12.6\n \n12.7\n \nSelling, general and administrative expenses\n4,193.2\n \n639.2\n \n4,832.4\n \nOperating income (loss)\n2,088.6\n \n(\n626.6\n)\n1,462.0\n \nInterest expense, net\n107.5\n \nOther (income) expense, net\n(\n29.1\n)\nIncome from continuing operations before income taxes\n$\n1,383.6\n \nDepreciation and amortization expense\n$\n488.9\n \n$\n38.0\n \n$\n526.9\n \nCapital expenditures\n$\n1,262.2\n \n$\n38.3\n \n$\n1,300.5\n \nYear Ended February 3, 2024\nNet sales\n$\n16,770.3\n \n$\n—\n \n$\n16,770.3\n \nCost of sales\n10,761.4\n \n—\n \n10,761.4\n \nGross Profit\n6,008.9\n \n—\n \n6,008.9\n \nOther revenue\n—\n \n10.8\n \n10.8\n \nSelling, general and administrative expenses\n3,730.3\n \n514.9\n \n4,245.2\n \nOperating income (loss)\n2,278.6\n \n(\n504.1\n)\n1,774.5\n \nInterest expense, net\n112.5\n \nOther expense, net\n0.1\n \nIncome from continuing operations before income taxes\n$\n1,661.9\n \nDepreciation and amortization expense\n$\n370.1\n \n$\n30.4\n \n$\n400.5\n \nCapital expenditures\n$\n1,081.2\n \n$\n112.6\n \n$\n1,193.8\n \nYear Ended January 28, 2023\nNet sales\n$\n15,405.7\n \n$\n—\n \n$\n15,405.7\n \nCost of sales\n9,630.2\n \n—\n \n9,630.2\n \nGross Profit\n5,775.5\n \n—\n \n5,775.5\n \nOther revenue\n—\n \n5.8\n \n5.8\n \nSelling, general and administrative expenses\n3,239.8\n \n442.2\n \n3,682.0\n \nOperating income (loss)\n2,535.7\n \n(\n436.4\n)\n2,099.3\n \nInterest expense, net\n127.2\n \nOther expense, net\n0.4\n \nIncome from continuing operations before income taxes\n$\n1,971.7\n \nDepreciation and amortization expense\n$\n338.5\n \n$\n26.8\n \n$\n365.3\n \nCapital expenditures\n$\n544.4\n \n$\n94.6\n \n$\n639.0\n \n65\nTable of Contents\nDisaggregated Revenue\nThe following table summarizes net sales by merchandise category for our Dollar Tree segment:\n \nYear Ended\n(in millions)\nFebruary 1, 2025\nFebruary 3, 2024\nJanuary 28, 2023\nConsumable\n$\n8,575.3\n \n48.8\n \n%\n$\n7,915.6\n \n47.2\n \n%\n$\n6,978.8\n \n45.3\n \n%\nVariety\n7,944.0\n \n45.2\n \n%\n7,781.4\n \n46.4\n \n%\n7,456.3\n \n48.4\n \n%\nSeasonal\n1,046.5\n \n6.0\n \n%\n1,073.3\n \n6.4\n \n%\n970.6\n \n6.3\n \n%\nTotal Dollar Tree segment net sales\n$\n17,565.8\n \n100.0\n \n%\n$\n16,770.3\n \n100.0\n \n%\n$\n15,405.7\n \n100.0\n \n%\nNote 14 – \nSupply Chain Finance Program\nDuring fiscal 2023, we implemented a supply chain finance program, administered through a financial institution, which provides participating suppliers with the opportunity to finance payments due from us. Participating suppliers may, at their sole discretion, elect to finance one or more invoices of ours prior to their scheduled due dates at a discounted price with the financial institution. \nOur obligations to our suppliers, including amounts due and scheduled payment dates, are not impacted by the supplier’s decision to finance amounts under these arrangements. As such, the outstanding payment obligations under our supply chain financing program are included within “\nAccounts payable\n” in the accompanying Consolidated Balance Sheets and within “Cash flows from operating activities” in the accompanying Consolidated Statements of Cash Flows. \nAs of February 1, 2025 and February 3, 2024, our outstanding payment obligations under this program were $\n346.5\n million and $\n10.0\n million, respectively.\nThe change in our outstanding payment obligations under the supply chain finance program is as follows:\nYear Ended\n(in millions)\nFebruary 1, 2025\nObligations outstanding at February 3, 2024\n$\n10.0\n \nObligations confirmed during the period\n1,063.7\n \nObligations settled during the period\n(\n727.2\n)\nObligations outstanding at February 1, 2025\n$\n346.5\n \nNote 15 – \nDiscontinued Operations\nAs previously reported, in fiscal 2024 the Company initiated a formal review of strategic alternatives for the Family Dollar business. This strategic alternatives review concluded in the fourth quarter of fiscal 2024 and resulted in the decision to sell the Family Dollar business. Accordingly, the Company determined the assets of the Family Dollar business met the criteria for classification as held for sale. Additionally, the Company determined the ultimate disposal will represent a strategic shift that will have a major effect on our operations and financial results. As such, the results of Family Dollar are presented as discontinued operations in the accompanying Consolidated Statements of Operations for all periods presented. The assets and liabilities of Family Dollar have been reflected as assets and liabilities of discontinued operations in the accompanying Consolidated Balance Sheets for all periods presented. On March 25, 2025, the Company entered into a definitive agreement to sell the Family Dollar business to Brigade Capital Management, LP and Macellum Capital Management, LLC, for a purchase consideration of $\n1,007.0\n million, subject to a number of adjustments, including with respect to working capital and net indebtedness. The closing of the transaction is subject to satisfaction of customary closing conditions, including receipt of U.S. antitrust approval. Net proceeds are estimated to total approximately $\n804.0\n million.\nRefer to \nNote 2\n under the caption “Assets Held for Sale and Discontinued Operations”\n \nfor additional details on accounting criteria for held for sale and discontinued operations treatment.\nAt February 1, 2025, the Family Dollar business included the operations of \n7,622\n general merchandise retail discount stores and \nten\n distribution centers. The Company plans to convert the Odessa, Texas Family Dollar distribution center to a Dollar Tree distribution center in the second quarter of fiscal 2025. In addition, the Company intends to reassign approximately \n330\n leases for closed Family Dollar stores to Dollar Tree.\n66\nTable of Contents\nFinancial Information of Discontinued Operations\n“Income (loss) from discontinued operations, net of tax” in the Consolidated Statements of Operations reflects the after-tax results of the Family Dollar business and does not include any allocation of general corporate overhead expense or interest expense of the Company.\n \nThe following table summarizes the results of operations of the Family Dollar business that are being reported as discontinued operations:\n \nYear Ended\n(in millions)\nFebruary 1, 2025\nFebruary 3, 2024\nJanuary 28, 2023\nNet sales\n$\n13,252.1\n \n$\n13,811.3\n \n$\n12,912.5\n \nOther revenue\n15.0\n \n11.4\n \n7.7\n \nTotal revenue\n13,267.1\n \n13,822.7\n \n12,920.2\n \nCost of sales\n9,894.5\n \n10,510.6\n \n9,766.1\n \nSelling, general and administrative expenses,\n    excluding Goodwill impairment\n4,706.9\n \n4,899.4\n \n3,017.1\n \nGoodwill impairment\n490.5\n \n1,069.0\n \n—\n \nSelling, general and administrative expenses\n5,197.4\n \n5,968.4\n \n3,017.1\n \nOperating income (loss)\n(\n1,824.8\n)\n(\n2,656.3\n)\n137.0\n \nInterest income\n5.5\n \n5.7\n \n1.9\n \nLoss from classification to held for sale\n3,438.8\n \n—\n \n—\n \nIncome (loss) from discontinued operations before \n    income taxes\n(\n5,258.1\n)\n(\n2,650.6\n)\n138.9\n \nProvision for income taxes\n(\n1,185.5\n)\n(\n386.4\n)\n23.6\n \nIncome (loss) from discontinued operations, net of tax\n$\n(\n4,072.6\n)\n$\n(\n2,264.2\n)\n$\n115.3\n \nDepreciation expense related to discontinued operations was $\n430.6\n million, $\n418.5\n million, and $\n372.1\n million for the years ended February 1, 2025, February 3, 2024, and January 28, 2023, respectively. The Company has ceased depreciating and amortizing its long-lived assets for Family Dollar which primarily includes right-of-use assets and property and equipment.\nThe following table summarizes the Family Dollar business assets and liabilities classified as discontinued operations in the accompanying Consolidated Balance Sheets: \n(in millions)\nFebruary 1, 2025\nFebruary 3, 2024\nASSETS\n \n \nCash and cash equivalents\n$\n179.0\n \n$\n259.7\n \nMerchandise inventories\n2,456.4\n \n2,617.0\n \nOther current assets\n200.9\n \n193.7\n \nProperty, plant and equipment, net \n2,268.0\n \n2,322.0\n \nOperating lease right-of-use assets\n2,580.6\n \n2,815.6\n \nGoodwill\n—\n \n490.5\n \nTrade name intangible asset\n750.0\n \n2,150.0\n \nOther assets\n12.8\n \n13.9\n \nValuation allowance to adjust assets to estimated fair value, less costs of disposal\n(\n3,438.8\n)\n—\n \nTotal assets of discontinued operations\n$\n5,008.9\n \n$\n10,862.4\n \nLIABILITIES\n \n \nCurrent portion of operating lease liabilities\n$\n598.5\n \n$\n613.2\n \nAccounts payable\n977.5\n \n896.7\n \nOther current liabilities\n378.6\n \n488.9\n \nOperating lease liabilities, long-term\n2,134.5\n \n2,405.3\n \nOther liabilities\n135.8\n \n133.2\n \nTotal liabilities of discontinued operations\n$\n4,224.9\n \n$\n4,537.3\n \n67\nTable of Contents\nAssets and liabilities classified as held for sale are required to be recorded at the lower of carrying value or fair value less costs to sell. As of February 1, 2025, we determined that the fair value of the Family Dollar business, including costs to sell was lower than its carrying value and we recorded a $\n3,438.8\n million valuation allowance against the assets held for sale. The fair value of the Family Dollar business was estimated using the expected sale price as negotiated with the third party buyer. The non-cash valuation allowance was recorded within “Loss from classification to held for sale” in the summarized results of operations of discontinued operations for the year ended February 1, 2025. \nCapital expenditures related to discontinued operations were $\n439.4\n million, $\n907.5\n million, and $\n609.8\n million for the years ended February 1, 2025, February 3, 2024, and January 28, 2023, respectively.\nImpairments\nImpairment of Long-Lived Assets\nIn fiscal 2024, fiscal 2023 and fiscal 2022, we recorded impairment charges related to discontinued operations of $\n80.2\n million, $\n500.6\n million, and $\n38.7\n million, respectively, to write down certain assets. These impairment charges are recorded as a component of “Selling, general and administrative expenses” in the results of discontinued operations above. \nThe fiscal 2024 impairment charges included $\n70.0\n million of operating lease ROU asset impairment charges and $\n10.0\n million of store asset impairment charges recorded in connection with our annual review of events or changes in circumstances that indicate the carrying amount of store-related asset groups may not be recoverable. As a result of this review, we identified underperforming stores within the Family Dollar business that indicated that the carrying amount of their long-lived assets may not be recoverable.\nThe fiscal 2023 impairment charges included $\n343.9\n million of operating lease ROU asset impairment charges and $\n149.2\n million of store asset impairment charges recorded in connection with the store portfolio optimization review. This review was announced during the fourth quarter of fiscal 2023 and involved identifying stores for closure, relocation or re-bannering based on an evaluation of current market conditions and individual store performance, among other factors. As a result of the portfolio optimization review, we identified approximately \n970\n underperforming Family Dollar stores, including approximately \n600\n stores to be closed in the first half of fiscal 2024, and approximately \n370\n stores to be closed at the end of each store's current lease term. As of February 1, 2025, we had closed approximately \n695\n stores identified under the portfolio optimization review. \nFor the fiscal 2024 and fiscal 2023 impairment charges, we performed an undiscounted cash flow analysis on each individual store’s asset group, and determined that certain store asset groups had net carrying values that exceeded their estimated undiscounted future cash flows. We estimated the fair values of the asset groups based on a discounted cash flow method for each store and recorded an impairment for store asset groups where the fair value was lower than its carrying value. For stores that were to close in the first half of fiscal 2024 pursuant to the portfolio optimization review, we estimated the remaining fair value of the asset groups taking into account our ability to generate sublease income or lease termination benefits prior to the end of the lease term. The significant estimates used in the discounted cash flow methodology, which are based on level 3 inputs, include our expectations for future operations and projected cash flows. The valuation date for estimating the fair value of the long-lived assets at the stores for fiscal 2024 and fiscal 2023 was November 30, 2024 and November 25, 2023, respectively.\nIn fiscal 2023, we also recorded $\n80.6\n million of inventory markdowns and $\n5.6\n million of capitalized distribution cost impairment within “Cost of sales” in the results of discontinued operations above related to the store portfolio optimization review. The operating lease ROU asset impairment recorded in connection with the store portfolio optimization review in fiscal 2023 did not relieve us of our monthly cash payment obligations under the leases. We continue to pursue lease terminations or subleases where practicable.\nTrade Name and Goodwill Impairment\nIn connection with our annual impairment testing of goodwill and nonamortizing intangible assets during the fourth quarter of fiscal 2024, and as a result of the decisions made around the strategic review, we determined it was more likely than not that an impairment loss had been incurred with respect to the Family Dollar goodwill and trade name, and proceeded to perform a quantitative impairment test of both assets. We estimated, with the assistance of a third party specialist, the fair value of the Family Dollar trade name based on an income approach using the relief-from-royalty method. The significant estimates used in the relief-from-royalty method, which are level 3 inputs, include estimates of future growth and revenue, a company-specific royalty rate, our weighted average cost of capital adjusted by a company-specific risk premium and trade name premium. The valuation date for the Family Dollar trade name was November 30, 2024. The results of the impairment test showed that the carrying value of the Family Dollar trade name exceeded its estimated fair value resulting in the recognition of a $\n1,400.0\n million impairment charge in the fourth quarter of fiscal 2024, which is recorded as a component of “\nSelling, general and administrative expenses\n” in the results of discontinued operations above.\n68\nTable of Contents\nSubsequent to the Family Dollar trade name and long-lived asset impairment tests, we estimated the fair value of the Family Dollar reporting unit using the expected sale price for the business as negotiated with potential third party buyers. The valuation date for the Family Dollar reporting unit was November 30, 2024. The annual goodwill impairment evaluation in 2024 showed that the fair value of the Family Dollar reporting unit was lower than its carrying value resulting in the recognition of a $\n490.5\n million impairment charge in the fourth quarter of fiscal 2024.\nIn the fourth quarter of fiscal 2023, the annual goodwill and nonamortizing intangible asset impairment evaluations resulted in the recognition of a $\n950.0\n million trade name impairment charge and a $\n1,069.0\n million goodwill impairment charge. The impairments were the result of the anticipated store closures under the store portfolio optimization review described previously. The fair value of the trade name was estimated, with the assistance of a third party specialist, based on an income approach using the relief-from-royalty method. The significant estimates used in the relief-from-royalty method, which are level 3 inputs, include estimates of future growth and revenue, a company-specific royalty rate, our weighted average cost of capital adjusted by a company-specific risk premium and trade name premium. The fair value of the Family Dollar reporting unit was estimated, using the assistance of a third party specialist, using a combination of a market multiple method and a discounted cash flow method. The significant estimates used in the discounted cash flow method, which are level 3 inputs, include our weighted average cost of capital adjusted by a company-specific risk premium, long-term rates of growth and profitability for the Family Dollar reporting unit, working capital effects, and changes in market conditions, consumer trends and strategy. The market multiple method utilized comparable public company revenue and profitability multiples to estimate the fair value of the Family Dollar reporting unit. The valuation date for the fiscal 2023 Family Dollar trade name and reporting unit was November 25, 2023.\nThe annual goodwill and nonamortizing intangible asset impairment evaluations in fiscal 2022 did not result in any impairment charges.\nWe have recorded cumulative goodwill impairment charges totaling $\n4,599.5\n million, all of which relate to the Family Dollar reporting unit and were recorded during the fourth quarters of fiscal 2024 ($\n490.5\n million), fiscal 2023 ($\n1,069.0\n million), fiscal 2019 ($\n313.0\n million), and fiscal 2018 ($\n2,727.0\n million).\n \nNote 16 – \nSubsequent Events\nOn March 21, 2025, the Company entered into a new revolving credit facility (“new Credit Facility”), with JPMorgan Chase Bank, N.A., as agent, the banks and the financial institutions from time to time party thereto, providing for a $\n1.5\n billion revolving credit facility, of which up to $\n350.0\n million is available for letters of credit. The new Credit Facility matures on March 21, 2030, subject to extensions permitted under the new Credit Agreement (“new Credit Agreement”).\nThis new Credit Agreement contains a number of affirmative and negative covenants, similar to the prior Revolving Credit Facility.\nIn connection with entry into this new Credit Facility, we terminated all commitments and fulfilled all obligations under our previous credit agreement dated December 8, 2021.\nAdditionally, on March 21, 2025, the Company also entered into a \n364\n-Day Revolving Credit Facility, with JPMorgan Chase Bank, N.A., as agent, the banks and the financial institutions from time to time party thereto, providing for a $\n1.0\n billion revolving credit facility. The \n364\n-Day Revolving Credit Facility matures on March 20, 2026.\nNote 17 – \nQuarterly Financial Information (Unaudited)\nThe following table sets forth certain items from the Company’s unaudited consolidated statements of operations for each quarter of fiscal year 2024 and 2023. The unaudited information has been prepared on the same basis as the audited consolidated financial statements appearing elsewhere in this report that reflect the results of Family Dollar as discontinued operations and includes all adjustments, consisting only of normal recurring adjustments, which management considers necessary for a fair presentation of the financial data shown. The operating results for any quarter are not necessarily indicative of results for a full year or for any future period.\n69\nTable of Contents\n(in millions, except per share data)\nFirst \nQuarter\nSecond\nQuarter\nThird \nQuarter\nFourth\nQuarter\nFiscal 2024:\nNet sales\n$\n4,165.6\n \n$\n4,065.5\n \n$\n4,338.0\n \n$\n4,996.7\n \nGross profit\n$\n1,476.5\n \n$\n1,391.3\n \n$\n1,534.1\n \n$\n1,879.8\n \nIncome from continuing operations, net of tax\n$\n267.7\n \n$\n142.3\n \n$\n232.3\n \n$\n400.2\n \nIncome (loss) from discontinued operations, net of tax\n(1)\n$\n32.4\n \n$\n(\n9.9\n)\n$\n1.0\n \n$\n(\n4,096.1\n)\nNet income (loss)\n$\n300.1\n \n$\n132.4\n \n$\n233.3\n \n$\n(\n3,695.9\n)\nBasic earnings (loss) per share of common stock:\nContinuing operations\n$\n1.23\n \n$\n0.66\n \n$\n1.09\n \n$\n1.86\n \nDiscontinued operations\n0.15\n \n(\n0.04\n)\n—\n \n(\n19.04\n)\nTotal basic earnings (loss) per share of common stock\n$\n1.38\n \n$\n0.62\n \n$\n1.09\n \n$\n(\n17.18\n)\nDiluted earnings (loss) per share of common stock:\nContinuing operations\n$\n1.23\n \n$\n0.66\n \n$\n1.08\n \n$\n1.86\n \nDiscontinued operations\n0.15\n \n(\n0.04\n)\n—\n \n(\n19.03\n)\nTotal diluted earnings (loss) per share of common stock\n$\n1.38\n \n$\n0.62\n \n$\n1.08\n \n$\n(\n17.17\n)\nFiscal 2023:\nNet sales\n$\n3,931.7\n \n$\n3,873.4\n \n$\n4,003.8\n \n$\n4,961.4\n \nGross profit\n$\n1,388.7\n \n$\n1,293.2\n \n$\n1,393.8\n \n$\n1,933.2\n \nIncome from continuing operations, net of tax\n$\n291.6\n \n$\n186.8\n \n$\n255.0\n \n$\n532.4\n \nIncome (loss) from discontinued operations, net of tax\n(2)\n$\n7.4\n \n$\n13.6\n \n$\n(\n43.0\n)\n$\n(\n2,242.2\n)\nNet income (loss)\n$\n299.0\n \n$\n200.4\n \n$\n212.0\n \n$\n(\n1,709.8\n)\nBasic earnings (loss) per share of common stock:\nContinuing operations\n$\n1.32\n \n$\n0.85\n \n$\n1.16\n \n$\n2.44\n \nDiscontinued operations\n0.03\n \n0.06\n \n(\n0.19\n)\n(\n10.29\n)\nTotal basic earnings (loss) per share of common stock\n$\n1.35\n \n$\n0.91\n \n$\n0.97\n \n$\n(\n7.85\n)\nDiluted earnings (loss) per share of common stock:\nContinuing operations\n$\n1.32\n \n$\n0.85\n \n$\n1.16\n \n$\n2.44\n \nDiscontinued operations\n0.03\n \n0.06\n \n(\n0.19\n)\n(\n10.27\n)\nTotal diluted earnings (loss) per share of common stock\n$\n1.35\n \n$\n0.91\n \n$\n0.97\n \n$\n(\n7.83\n)\n(1) \nIncome (loss) from discontinued operations, net of tax in the fourth quarter of fiscal 2024 includes the following charges: $\n1,400.0\n million trade name impairment, $\n490.5\n million goodwill impairment, $\n80.2\n million of long-lived asset impairments and a $\n3,438.8\n million loss from classification to held for sale. See \nNote 15\n for further detail. \n(2) \nIncome (loss) from discontinued operations, net of tax in the fourth quarter of fiscal 2023 includes the following charges: $\n950.0\n million trade name impairment, $\n1,069.0\n million goodwill impairment, $\n500.6\n million of long-lived asset impairments, and $\n80.6\n million of inventory markdowns and $\n5.6\n million of capitalized distribution costs impairment from store closures. See \nNote 15\n for further detail.\n \n70\nTable of Contents\nItem 9. Changes in and Disagreements With Accountants on Accounting and Financial Disclosure\nNone.\nItem 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nWe maintain disclosure controls and procedures that are designed to ensure that information required to be disclosed in our reports under the Securities Exchange Act of 1934 (“Exchange Act”) is recorded, processed, summarized and reported within the time periods specified in the rules and forms of the Securities and Exchange Commission, and that such information is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure. In designing and evaluating the disclosure controls and procedures, we recognize that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives, and management necessarily is required to apply our judgment in evaluating the cost-benefit relationship of possible controls and procedures.\nOur management has carried out, with the participation of our Chief Executive Officer and Chief Financial Officer, an evaluation of the effectiveness of our disclosure controls and procedures, as defined in Rule 13a-15(e) under the Exchange Act as of the end of the period covered by this report. Based upon this evaluation, our Chief Executive Officer and our Chief Financial Officer concluded that, as of February 1, 2025, our disclosure controls and procedures were designed and functioning effectively to provide reasonable assurance that information required to be disclosed by us in reports that we file or submit under the Exchange Act is (i) recorded, processed, summarized and reported within the time periods specified in Securities and Exchange Commission rules and forms and (ii) accumulated and communicated to our management, including the Chief Executive Officer and Chief Financial Officer, as appropriate to allow timely decisions regarding disclosure.\nManagement’s Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as defined in Exchange Act Rule 13a-15(f). Our management conducted an assessment of our internal control over financial reporting based on the framework established by the Committee of Sponsoring Organizations of the Treadway Commission in \nInternal Control - Integrated Framework (2013)\n. Based on this assessment, our management has concluded that, as of February 1, 2025, our internal control over financial reporting is effective. \nOur independent registered public accounting firm, KPMG LLP, has audited our consolidated financial statements and has issued an attestation report on the effectiveness of our internal control over financial reporting. Their report appears below.\nChanges in Internal Controls\nIn fiscal 2024, we implemented a new warehouse management system in two of our distribution centers and expect to complete a phased implementation of the system to our remaining distribution centers over the next several years. We have made changes to our internal control over financial reporting to align with the functionality and updated processes associated with the new system. We are also updating our human capital management system and expect to implement the new system in fiscal 2025. We will continue to monitor and modify, as needed, the design and operating effectiveness of key control activities to align with the updated business processes and capabilities of the new systems.\nIn fiscal 2024, we initiated a formal review of strategic alternatives for the Family Dollar business. This strategic alternatives review concluded in the fourth quarter of fiscal 2024 and resulted in the decision to sell the Family Dollar business. We determined that the Family Dollar business met the held for sale and discontinued operations accounting criteria. We designed and implemented responsive control procedures related to our financial reporting, which were assessed as of February 1, 2025 during the annual operation of these controls. \nThere were no other changes in our internal control over financial reporting during the fiscal quarter ended February 1, 2025 that materially affected, or are reasonably likely to materially effect, our internal control over financial reporting.\n71\nTable of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and Board of Directors\nDollar Tree, Inc.:\nOpinion on Internal Control Over Financial Reporting\nWe have audited Dollar Tree, Inc. and subsidiaries' (the Company) internal control over financial reporting as of February 1, 2025, based on criteria established in \nInternal Control – Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission. In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of February 1, 2025, based on criteria established in \nInternal Control – Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of February 1, 2025 and February 3, 2024, the related consolidated statements of operations, comprehensive income (loss), shareholders’ equity, and cash flows for each of the years in the three-year period ended February 1, 2025, and the related notes (collectively, the consolidated financial statements), and our report dated March 26, 2025 expressed an unqualified opinion on those consolidated financial statements.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audit also included performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ KPMG LLP\nVirginia Beach, Virginia\nMarch 26, 2025 \n72\nTable of Contents\nItem 9B. Other Information\nRule 10b5-1 Plan and Non-Rule 10b5-1 Trading Arrangement Adoptions, Terminations, and Modifications\nDuring the fiscal quarter ended February 1, 2025, \nnone\n of our directors or officers (as defined in Rule 16a-1(f) of the Securities Exchange Act of 1934) adopted or terminated a Rule 10b5-1 trading arrangement or non-Rule 10b5-1 trading arrangement (as such terms are defined in Item 408(a) of Regulation S-K).\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNot Applicable.\nPART III\nItem 10. Directors, Executive Officers and Corporate Governance\nThe information concerning our directors and executive officers required by this Item is incorporated by reference to Dollar Tree, Inc.’s Proxy Statement relating to our 2025 Annual Meeting (“Proxy Statement”), under the captions “Biographies of Director Nominees” and “Information about our Executive Officers.”\nTo the extent disclosure of any delinquent report under Section 16(a) of the Securities Exchange Act of 1934 is made by us, such disclosure will be set forth under the caption “Delinquent Section 16(a) Reports” in our Proxy Statement, which is incorporated herein by reference.\nThe information concerning our audit committee and audit committee financial experts required by this Item is incorporated herein by reference to the Proxy Statement, under the caption “Corporate Governance and Our Board.”\nThe information concerning our code of ethics required by this Item is incorporated by reference to the Proxy Statement, under the caption “Corporate Governance and Our Board - Code of Business Conduct.”\nThe Company maintains an Insider Trading Policy\n that governs the purchase, sale and/or other transactions in our securities by our directors, officers and all other employees and the Company itself. A copy of our Insider Trading Policy is filed as Exhibit 19.1 to this Annual Report on Form 10-K.\nItem 11. Executive Compensation\nInformation set forth in the Proxy Statement under the captions “Compensation Committee Report on Executive Compensation,” “Compensation Discussion and Analysis,” “Annual Compensation of Executive Officers,” “Pay Ratio Disclosure,” and “Director Compensation” is incorporated herein by reference.\nItem 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nEquity Compensation Plans\nThe following table summarizes information regarding shares issuable as of February 1, 2025, under our equity compensation plans, including the number of shares of common stock subject to options, restricted stock units, deferred shares and other rights granted to employees and members of our Board of Directors; the weighted-average exercise price of outstanding options; and the number of shares remaining available for future award grants under these plans. Additional information regarding our equity compensation plans can be found in \nNote 10\n to our consolidated financial statements.\nEquity compensation plan category\n(a)\nNumber of securities to be issued upon exercise of outstanding options, warrants and rights\n(b)\nWeighted-average exercise price of outstanding options, warrants and rights\n(c)\nNumber of securities remaining available for future issuance under equity compensation plans (excluding securities reflected in column (a))\nPlans approved by security holders\n1\n1,421,114 \n$\n128.16 \n6,417,745 \nPlans not approved by security holders\n2\n1,634,544 \n$\n157.17 \n— \n______________\n(a)\nAmounts represent outstanding options, restricted stock units and deferred (“phantom”) shares as of February 1, 2025.\n(b)\nNot included in the calculation of weighted-average exercise price are (i) 1,193,213 restricted stock units and (ii) 62,807 director deferred shares.\n73\nTable of Contents\n(c)\nThe 6,417,745 shares remaining available for future issuance under our equity-based plans approved by security holders includes 4,126,741 shares remaining under our 2021 Omnibus Incentive Plan and 2,291,004 shares remaining under our 2015 Employee Stock Purchase Plan.\n1\nEquity-based plans approved by our shareholders include: the 2015 Employee Stock Purchase Plan (which replaced a predecessor plan) and the 2021 Omnibus Incentive Plan (which replaced the 2011 Omnibus Incentive Plan). As of March 17, 2021, the 2011 Omnibus Incentive Plan was no longer available for new grants of awards, but all outstanding awards that were granted under the plan prior to March 17, 2021 continue to be governed by the terms and conditions of the plan and applicable award agreements. Effective June 30, 2023, the 2013 Director Deferred Compensation Plan expired. All amounts deferred by directors under the plan on or before June 30, 2023 continue to be administered in accordance with the terms of the plan and applicable deferral elections. Effective July 1, 2023, our directors are permitted to defer all or a portion of fees earned for their service as a director under our Non-Employee Director Deferred Compensation Program, which operates in conjunction with, and under the authority of, the 2021 Omnibus Incentive Plan. \n2\nIn March 2022, a one-time award of options to purchase 2,252,587 shares of company common stock was granted to Richard W. Dreiling, who was the Executive Chairman of the Board at the time of the grant. The grant was an employment inducement grant within the meaning of Rule 5635(c)(4) of the NASDAQ Listing Rules. Mr. Dreiling was subsequently appointed Chief Executive Officer of the company in January 2023. In November 2024, Mr. Dreiling resigned from the Company at which point certain remaining unvested portions of the award were forfeited. At February 1, 2025, 1,634,544 of these options remained outstanding. The amount shown in the table does not include 387 shares to be issued upon the exercise of options with a weighted-average exercise price of $78.10 that were granted under the Family Dollar 2006 Incentive Plan and assumed by us in connection with our merger with Family Dollar.\nInformation set forth in the Proxy Statement under the caption “Ownership of Common Stock,” with respect to security ownership of certain beneficial owners and management, is incorporated herein by reference.\nItem 13. Certain Relationships and Related Transactions, and Director Independence\nInformation set forth in the Proxy Statement under the caption “Certain Relationships and Related Transactions,” is incorporated herein by reference.\nThe information concerning the independence of our directors required by this Item is incorporated by reference to the Proxy Statement under the caption “Board Governance - Independence.”\nItem 14. Principal Accountant Fees and Services\nInformation set forth in the Proxy Statement under the caption “Ratification of Appointment of Independent Auditors,” is incorporated herein by reference.\nPART IV\nItem 15. Exhibit and Financial Statement Schedules\n1.\nDocuments filed as part of this report\n:\n1.\nFinancial Statements. Reference is made to the Index to the Consolidated Financial Statements set forth under Part II, \nItem 8\n of this Form 10-K.\n2.    Financial Statement Schedules. All schedules for which provision is made in the applicable accounting regulations of the Securities and Exchange Commission are not required under the related instructions, are not applicable, or the information is included in the consolidated financial statements and notes thereto, and therefore have been omitted.\n3.\nExhibits. The following exhibits are filed as part of, or incorporated by reference into, this report.\nIncorporated by Reference\nExhibit \nExhibit Description\nForm\nExhibit\nFiling Date\nFiled Herewith\n3.1\nAmended and Restated Articles of Incorporation of Dollar Tree, Inc., effective October 14, 2022\n10-Q\n3.1\n11/22/2022\n3.2\nAmended and Restated By-Laws of Dollar Tree, Inc., effective February 27, 2025\n8-K\n3.1\n2/28/2025\n4.1\nForm of Common Stock Certificate\n8-K\n4.1\n3/13/2008\n74\nTable of Contents\nIncorporated by Reference\nExhibit \nExhibit Description\nForm\nExhibit\nFiling Date\nFiled Herewith\n4.2.1\nIndenture, dated as of April 2, 2018, between Dollar Tree, Inc., as issuer, and U.S. Bank National Association, as trustee\nS-3 ASR\n4.1\n4/2/2018\n4.2.2\nFirst Supplemental Indenture, dated as of April 19, 2018, between Dollar Tree, Inc. and U.S. Bank National Association, as trustee\n8-K\n4.1\n4/20/2018\n4.2.3\nSecond Supplemental Indenture, dated as of December 1, 2021, between Dollar Tree, Inc. and U.S. Bank National Association, as trustee\n8-K\n4.1\n12/1/2021\n4.3\nDescription of Securities Registered under Section 12 of the Securities Exchange Act of 1934\n10-K\n4.3\n3/10/2023\n10.1\n*\nTerms of director compensation (as described under the caption “Director Compensation”)\nDEF 14A\nN/A\n5/7/2024\n10.2\n*\nDescription of Dollar Tree, Inc. Management Incentive Compensation Plan, effective for the fiscal year ending January 29, 2022 and thereafter\n10-Q\n10.1\n5/27/2021\n10.3.1\n*\n2011 Omnibus Incentive Plan effective as of March 17, 2011\n8-K\n10.1\n6/22/2011\n10.3.2\n*\nFirst Amendment to the 2011 Omnibus Incentive Plan dated June 16, 2016\n10-Q\n10.1\n9/2/2016\n10.3.3\n*\n2011 Omnibus Incentive Plan, as amended and restated effective June 12, 2019\n10-Q\n10.1\n8/29/2019\n10.4\n*\nForm of Non-employee Director Option Agreement under the 2011 Omnibus Incentive Plan\n8-K\n10.4\n6/22/2011\n10.5.1\n*\nForm of Restricted Stock Unit Agreement under the 2011 Omnibus Incentive Plan\n8-K\n10.2\n3/21/2012\n10.5.2\n*\nForm of Restricted Stock Unit Agreement under the 2011 Omnibus Incentive Plan\n10-K\n10.34\n3/27/2019\n10.6\n*\nForm of Executive Officer Nonstatutory Stock Option Agreement under the 2011 Omnibus Incentive Plan\n10-K\n10.54\n3/28/2017\n10.7\n*\nForm of Long-Term Performance Plan Award Agreement under the 2011 Omnibus Incentive Plan\n10-Q\n10.1\n5/28/2020\n10.8\n*\nForm of Performance Stock Unit Agreement under the 2011 Omnibus Incentive Plan\n10-K\n10.33\n3/27/2019\n10.9\n*\nDollar Tree, Inc. 2015 Employee Stock Purchase Plan, effective September 1, 2015\nS-8\n4.0\n10/28/2015\n10.10\n*\nDollar Tree and Family Dollar Supplemental Deferred Compensation Plan\n10-Q\n10.1\n8/24/2017\n10.11.1\n*\n2013 Director Deferred Compensation Plan, as amended and restated effective December 31, 2016\n10-K\n10.35\n3/16/2018\n10.11.2\n*\n2013 Director Deferred Compensation Plan, as amended and restated effective June 10, 2021\n8-K\n10.6\n6/11/2021\n10.11.3\n*\nAmendment to the Dollar Tree, Inc. 2013 Director Deferred Compensation Plan, effective March 8, 2023\n10-K\n10.12.3\n3/10/2023\n10.12\n*\nForm of Change in Control Retention Agreement for Executive Officers (portions of the exhibit have been omitted pursuant to a request for confidential treatment)\n10-Q\n10.1\n11/29/2018\n10.13.1\n*\nDollar Tree, Inc. 2021 Omnibus Incentive Plan\n8-K\n10.1\n6/11/2021\n10.13.2\n*\nFirst Amendment to the Dollar Tree, Inc. 2021 Omnibus Incentive Plan, effective November 29, 2022\n10-K\n10.15.2\n3/10/2023\n10.14\n*\nForm of Performance-Based Restricted Stock Unit Agreement under the 2021 Omnibus Incentive Plan\n8-K\n10.2\n6/11/2021\n10.15\n*\nForm of Long-Term Performance Plan Award Agreement under the 2021 Omnibus Incentive Plan\n8-K\n10.3\n6/11/2021\n10.16\n*\nForm of Restricted Stock Unit Agreement (Standard) under the 2021 Omnibus Incentive Plan\n8-K\n10.4\n6/11/2021\n10.17\n*\nForm of Non-Employee Director Nonstatutory Stock Option Agreement under the 2021 Omnibus Incentive Plan\n8-K\n10.5\n6/11/2021\n75\nTable of Contents\nIncorporated by Reference\nExhibit \nExhibit Description\nForm\nExhibit\nFiling Date\nFiled Herewith\n10.18\nCredit Agreement, dated as of December 8, 2021, among Dollar Tree, Inc., JPMorgan Chase Bank, N.A., as agent and the lenders and other parties thereto\n8-K\n10.1\n12/9/2021\n10.19\n*\nForm of Indemnification Agreement for Directors and Executive Officers\n8-K\n10.1\n3/7/2022\n10.20\nStewardship Framework Agreement, by and between Dollar Tree, Inc. and MR Cobalt Advisor LLC, on behalf of itself and its affiliates and associates, dated March 8, 2022\n8-K\n10.1\n3/8/2022\n10.21.1\n*\nExecutive Agreement, effective March 19, 2022, by Richard W. Dreiling and Dollar Tree, Inc. (portions of the exhibit have been omitted pursuant to Item 601(b)(10)(iv) of Regulation S-K)\n8-K\n10.1\n3/21/2022\n10.21.2\n*\nAmendment to Executive Agreement, dated January 25, 2023, by the company and Richard W. Dreiling\n8-K/A\n10.1\n1/27/2023\n10.22\n*\nNonstatutory Stock Option Agreement, effective March 19, 2022, by Richard W. Dreiling and Dollar Tree, Inc.\n8-K\n10.2\n3/21/2022\n10.23\n*\nForm of Performance-Based Restricted Stock Unit Agreement under the 2021 Omnibus Incentive Plan (portions of the exhibit have been omitted pursuant to Item 601(b)(10)(iv) of Regulation S-K)\n10-Q\n10.1\n5/25/2023\n10.24\n*\nForm of Restricted Stock Unit Agreement (Standard) under the 2021 Omnibus Incentive Plan (portions of the exhibit have been omitted pursuant to Item 601(b)(10)(iv) of Regulation S-K)\n10-Q\n10.2\n5/25/2023\n10.25\n*\nForm of Nonstatutory Stock Option Agreement under the 2021 Omnibus Incentive Plan (portions of the exhibit have been omitted pursuant to Item 601(b)(10)(iv) of Regulation S-K)\n10-Q\n10.3\n5/25/2023\n10.26\n*\nNon-Employee Director Deferred Compensation Program, effective July 1, 2023\n10-Q\n10.1\n8/24/2023\n10.27\nForm of Commercial Paper Dealer Agreement between Dollar Tree, Inc., as issuer, and the applicable Dealer party thereto\n8-K\n10.1\n7/7/2023\n10.28\nPlea Agreement, dated February 26, 2024.\n *Schedules and other similar attachments to this exhibit have been omitted pursuant to Item 601(a)(5) of Regulation S-K. We hereby agree to furnish a copy of any omitted schedules or other similar attachments to the U.S. Securities and Exchange Commission upon request.\n8-K\n10.1\n2/26/2024\n10.29\n*\nLetter Agreement, dated May 9, 2024, by and between Dollar Tree, Inc. and Richard McNeely\n8-K\n10.1\n5/10/2024\n10.30\n*\nForm of Executive Agreement (portions of the exhibit have been omitted pursuant to Item 601(b)(10)(iv) of Regulation S-K).\n8-K\n10.1\n11/15/2024\n10.31\n*\nExecutive Agreement with Michael C. Creedon, Jr. (portions of the exhibit have been omitted pursuant to Item 601(b)(10)(iv) of Regulation S-K).\n8-K\n10.1\n1/21/2025\n19.1\nDollar Tree, Inc. Insider Trading Policy\nX\n21.1\nSubsidiaries of the Registrant\nX\n23.1\nConsent of Independent Registered Public Accounting Firm\nX\n24.1\nPower of Attorney (included on the signature page hereto)\nX\n31.1\nCertification of Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\nX\n31.2\nCertification of Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\nX\n32.1\nCertification of Chief Executive Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nX\n32.2\nCertification of Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nX\n97.1\nDollar Tree, Inc. Clawback Policy\n10-K\n97.1\n3/20/2024\n76\nTable of Contents\nIncorporated by Reference\nExhibit \nExhibit Description\nForm\nExhibit\nFiling Date\nFiled Herewith\n101\nThe following financial statements from our Form 10-K for the fiscal year ended February 1, 2025, formatted in Inline XBRL: (i) Consolidated Statements of Operations, (ii) Consolidated Statements of Comprehensive Income (Loss), (iii) Consolidated Balance Sheets, (iv) Consolidated Statements of Shareholders’ Equity, (v) Consolidated Statements of Cash Flows and (vi) Notes to Consolidated Financial Statements\nX\n104\nThe cover page from our Form 10-K for the fiscal year ended February 1, 2025, formatted in Inline XBRL and contained in Exhibit 101\nX\n*Management contract or compensatory plan or arrangement\nItem 16. Form 10-K Summary\nNone.\n77\nTable of Contents\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\n \nDOLLAR TREE, INC.\n(Registrant)\nMarch 26, 2025\nBy: /s/ Michael C. Creedon Jr.\nDate\nMichael C. Creedon Jr.\n \nChief Executive Officer\n(Principal Executive Officer)\nMarch 26, 2025\nBy: /s/ Jeffrey A. Davis\nDate\nJeffrey A. Davis\nChief Financial Officer\n(Principal Financial Officer)\nMarch 26, 2025\nBy: /s/ Aditya Maheshwari\nDate\nAditya Maheshwari\nSenior Vice President - Chief Accounting Officer\n(Principal Accounting Officer)\n78\nTable of Contents\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated. Each of the directors of the registrant whose signature appears below hereby appoints Aditya Maheshwari and Jonathan B. Leiken, and both of them severally, as his or her attorney-in-fact to sign in his or her name and behalf, in any and all capacities stated below, and to file with the Securities and Exchange Commission any and all amendments to this report, making such changes in this report as appropriate, and generally to do all such things on their behalf in their capacities as directors and/or officers to enable the registrant to comply with the provisions of the Securities Exchange Act of 1934, and all requirements of the Securities and Exchange Commission.\n/s/ Michael C. Creedon Jr.\nChief Executive Officer and Director\nMarch 26, 2025\nMichael C. Creedon Jr.\n(Principal Executive Officer)\nDate\n/s/ Edward J. Kelly, III\nChairman of the Board and Lead Independent Director\nMarch 26, 2025\nEdward J. Kelly, III\nDate\n/s/ Paul C. Hilal\nVice Chairman\nMarch 26, 2025\nPaul C. Hilal\nDate\n \n \n \n/s/ William W. Douglas, III \nDirector\nMarch 26, 2025\nWilliam W. Douglas, III \nDate\n \n \n/s/ Cheryl W. Grisé\nDirector\nMarch 26, 2025\nCheryl W. Grisé\nDate\n \n \n \n/s/ Daniel J. Heinrich\nDirector\nMarch 26, 2025\nDaniel J. Heinrich\nDate\n/s/ Timothy A. Johnson\nDirector\nMarch 26, 2025\nTimothy A. Johnson\nDate\n/s/ Mary A. Laschinger\nDirector\nMarch 26, 2025\nMary A. Laschinger\nDate\n/s/ Jeffrey G. Naylor\nDirector\nMarch 26, 2025\nJeffrey G. Naylor\nDate\n/s/ Diane E. Randolph\nDirector\nMarch 26, 2025\nDiane E. Randolph\nDate\n/s/ Bertram L. Scott\nDirector\nMarch 26, 2025\nBertram L. Scott\nDate\n/s/ Stephanie P. Stahl\nDirector\nMarch 26, 2025\nStephanie P. Stahl\nDate\n79"
  }
}