{
  "ticker": "DOC",
  "cik": "0000765880",
  "company_name": "HEALTHPEAK PROPERTIES, INC.",
  "filing_date": "2025-02-04",
  "accession": "0001628280-25-003748",
  "primary_doc": "peak-20241231.htm",
  "item_sections": {
    "item1": "Item 1A, Risk Factors” in this report, principal risks and uncertainties that may affect our business, financial condition, or results of operations include: \n•\nmacroeconomic trends that may increase construction, labor, and other operating costs;\n•\nchanges within the life science industry, and significant regulation, funding requirements, and uncertainty faced by our lab tenants;\n•\nfactors adversely affecting our tenants’, operators’, or borrowers’ ability to meet their financial and other contractual obligations to us;\n•\nthe insolvency or bankruptcy of one or more of our major tenants, operators, or borrowers;\n•\nour concentration of real estate investments in the healthcare property sector, which makes us more vulnerable to a downturn in that specific sector than if we invested across multiple sectors;\n•\nthe illiquidity of real estate investments;\n•\nour ability to identify and secure new or replacement tenants and operators;\n•\nour property development, redevelopment, and tenant improvement risks, which can render a project less profitable or unprofitable and delay or prevent its undertaking or completion;\n•\nthe ability of the hospitals on whose campuses our outpatient medical buildings are located and their affiliated healthcare systems to remain competitive or financially viable;\n•\nour ability to develop, maintain, or expand hospital and health system client relationships;\n•\noperational risks associated with our senior housing properties managed by third parties, including our properties operated through structures permitted by the Housing and Economic Recovery Act of 2008, which includes most of the provisions previously proposed in the REIT Investment Diversification and Empowerment Act of 2007 (commonly referred to as “RIDEA”);\n1\nTable of Contents\n•\neconomic conditions, natural disasters, weather, and other conditions that negatively affect geographic areas where we have concentrated investments;\n•\nuninsured or underinsured losses, which could result in a significant loss of capital invested in a property, lower than expected future revenues, and unanticipated expenses;\n•\nour use of joint ventures may limit our returns on and our flexibility with jointly owned investments; \n•\nour use of rent escalators or contingent rent provisions in our leases;\n•\ncompetition for suitable healthcare properties to grow our investment portfolio;\n•\nour ability to exercise rights on collateral securing our real estate-related loans;\n•\nany requirement that we recognize reserves, allowances, credit losses, or impairment charges;\n•\ninvestment of substantial resources and time in transactions that are not consummated;\n•\nour ability to successfully integrate or operate acquisitions and/or internalize property management;\n•\nthe potential impact of unfavorable resolution of litigation or disputes and resulting rising liability and insurance costs;\n•\nenvironmental compliance costs and liabilities associated with our real estate investments;\n•\nenvironmental, social, and governance (“corporate impact”) and sustainability commitments and requirements, as well as stakeholder expectations;\n•\nepidemics, pandemics, or other infectious diseases, including the coronavirus disease (“Covid”), and health and safety measures intended to reduce their spread;\n•\nhuman capital risks, including the loss or limited availability of our key personnel;\n•\nour reliance on information technology and any material failure, inadequacy, interruption, or security failure of that technology;\n•\nthe use of, or inability to use, artificial intelligence by us, our tenants, our vendors, and our investors;\n•\nvolatility, disruption, or uncertainty in the financial markets;\n•\nincreased borrowing costs, which could impact our ability to refinance existing debt, sell properties, and conduct investment activities; \n•\ncash available for distribution to stockholders and our ability to make dividend distributions at expected levels;\n•\nthe availability of external capital on acceptable terms or at all;\n•\nan increase in our level of indebtedness;\n•\ncovenants in our debt instruments, which may limit our operational flexibility, and breaches of these covenants;\n•\nvolatility in the market price and trading volume of our common stock;\n•\nadverse changes in our credit ratings;\n•\nthe failure of our tenants, operators, and borrowers to comply with federal, state, and local laws and regulations, including resident health and safety requirements, as well as licensure, certification, and inspection requirements;\n•\nrequired regulatory approvals to transfer our senior housing properties;\n•\ncompliance with the Americans with Disabilities Act and fire, safety, and other regulations;\n•\nlaws or regulations prohibiting eviction of our tenants;\n•\nthe requirements of, or changes to, governmental reimbursement programs such as Medicare or Medicaid, and legislation to address federal government operations and administrative decisions affecting the Centers for Medicare and Medicaid Services;\n•\nour participation in the Coronavirus Aid, Relief, and Economic Security Act (“CARES Act”) Provider Relief Fund and other Covid-related stimulus and relief programs;\n•\nchanges in federal, state, or local laws or regulations that may limit our opportunities to participate in the ownership of, or investment in, healthcare real estate;\n2\nTable of Contents\n•\nour ability to successfully integrate our operations with Physicians Realty Trust and realize the anticipated synergies of the Merger (as defined below) and benefits of property management internalization;\n•\nour ability to maintain our qualification as a real estate investment trust (“REIT”);\n•\nour taxable REIT subsidiaries being subject to corporate level tax;\n•\ntax imposed on any net income from “prohibited transactions”;\n•\nchanges to U.S. federal income tax laws, and potential deferred and contingent tax liabilities from corporate acquisitions;\n•\ncalculating non-REIT tax earnings and profits distributions;\n•\ntax protection agreements that may limit our ability to dispose of certain properties and may require us to maintain certain debt levels;\n•\nownership limits in our charter that restrict ownership in our stock, and provisions of Maryland law and our charter that could prevent a transaction that may otherwise be in the interest of our stockholders;\n•\nconflicts of interest between the interests of our stockholders and the interests of holders of Healthpeak OP, LLC (“Healthpeak OP”) common units; \n•\nprovisions in the operating agreement of Healthpeak OP and other agreements that may delay or prevent unsolicited acquisitions and other transactions; and\n•\nour status as a holding company of Healthpeak OP.\nImportant Information Regarding Our Disclosure to Investors\nWe may use our website (www.healthpeak.com) and our LinkedIn account (https://www.linkedin.com/company/healthpeak) to communicate with our investors and disclose company information. The information disclosed through those channels may be considered to be material, so investors should monitor them in addition to our press releases, SEC filings, and public conference calls and webcasts. The contents of our website or social media channels referenced herein are not incorporated by reference into this Annual Report on Form 10-K.\n3\nTable of Contents\nPART I\nITEM 1.    Business\nGeneral Overview\nHealthpeak Properties, Inc. is a Standard & Poor’s (“S&P”) 500 company that owns, operates, and develops high-quality real estate focused on healthcare discovery and delivery in the United States (“U.S.”). Our company was originally founded in 1985. In 2023, we completed our corporate reorganization (the “Reorganization”) into an umbrella partnership REIT (“UPREIT”). We hold substantially all of our assets and conduct our operations through our operating subsidiary, Healthpeak OP, a consolidated subsidiary of which we are the managing member. We are a Maryland corporation and qualify as a self-administered REIT. We are headquartered in Denver, Colorado, with additional corporate offices in California, Tennessee, Wisconsin, and Massachusetts and property management offices in several locations throughout the U.S.\nWe have a diversified portfolio of high-quality healthcare properties across three core asset classes of outpatient medical, lab, and continuing care retirement community (“CCRC”) real estate. Under the outpatient medical and lab segments, we own, operate, and develop outpatient medical buildings, hospitals, and lab buildings. Under the CCRC segment, our properties are operated through RIDEA structures. \nWe have other non-reportable segments that are comprised primarily of: (i) an interest in an unconsolidated joint venture that owns 19 senior housing assets (our “SWF SH JV”) and (ii) loans receivable. These non-reportable segments have been p\nresented on a combined basis herein.\nThe Merger\nOn March 1, 2024 (the “Closing Date”), pursuant to the Agreement and Plan of Merger dated October 29, 2023 (the “Merger Agreement”), by and among us, DOC DR Holdco, LLC, one of our wholly owned subsidiaries (“DOC DR Holdco”), DOC DR, LLC, a wholly owned subsidiary of Healthpeak OP (“DOC DR OP Sub”), Physicians Realty Trust, Physicians Realty L.P. (the “Physicians Partnership”): (i) Physicians Realty Trust merged with and into DOC DR Holdco (the “Company Merger”), with DOC DR Holdco surviving as our wholly owned subsidiary (the “Company Surviving Entity”); (ii) immediately following the effectiveness of the Company Merger, we contributed all of the outstanding equity interests in the Company Surviving Entity to Healthpeak OP (the “Contribution”); and (iii) immediately following the Contribution, Physicians Partnership merged with and into DOC DR OP Sub (the “Partnership Merger” and, together with the Company Merger, the “Merger”), with DOC DR OP Sub surviving as a subsidiary of Healthpeak OP. Subsequent to the Closing Date, the “Combined Company” means Healthpeak and its subsidiaries.\nOn the Closing Date, each outstanding common share of Physicians Realty Trust (other than Physicians Realty Trust common shares that were canceled in accordance with the Merger Agreement) were converted into the right to receive 0.674 (the “Exchange Ratio”) shares of our common stock, and each outstanding common unit of the Physicians Partnership was converted into common units in the successor entity to the Physicians Partnership equal to the Exchange Ratio.\nAs a result of the Merger, we acquired 299 outpatient medical buildings. See Note 3 to the Consolidated Financial Statements for additional information.\nAt December 31, 2024, our portfolio of investments, including properties in certain of our unconsolidated joint ventures, consisted of interests in 697 properties: (i) Outpatient medical – 524 properties; (ii) Lab – 139 properties; (iii) CCRC – 15 properties; and (iv) Other non-reportable – 19 properties. The following table summarizes information for our reportable segments for the year ended December 31, 2024 (dollars in thousands):\nSegment\nAdjusted NOI by Reportable Segment\n(1)\nOutpatient medical\n$\n748,730 \nLab\n590,606 \nCCRC\n136,104 \n_______________________________________\n(1)\nOur Adjusted NOI for our reportable segments, which we also refer to as Total Portfolio Adjusted NOI for our reportable segments, includes results of operations from disposed properties through the disposition date. See Note 16 to the Consolidated Financial Statements for a reconciliation of Adjusted NOI by reportable segment to income (loss) before income taxes and equity income (loss) from unconsolidated joint ventures. See our Segment Analysis below for additional information.\nFor a description of our significant activities during 2024, see “Item 7, Management’s Discussion and Analysis of Financial Condition and Results of Operations—Company Highlights” in this report.\n4\nTable of Contents\nBusiness Strategy\nOur strategy is to own, operate, and develop high-quality real estate focused on healthcare discovery and delivery. We manage our real estate portfolio for the long-term to maximize risk-adjusted returns and support the growth of our dividends. Our strategy consists of four core elements: \n(i)\nOur \nreal estate\n: Our portfolio consists of high-quality properties in desirable locations. Our portfolio is focused on outpatient medical and lab buildings, favorable sectors that benefit from the universal desire for improved health. We have built scale and fostered deep industry relationships, two unique factors that provide us with a competitive advantage.\n(ii)\nOur \nfinancials\n: We maintain a strong investment-grade balance sheet with ample liquidity as well as long-term fixed-rate debt financing with staggered maturities to reduce our exposure to interest rate volatility and refinancing risk.\n(iii)\nOur \npartnerships\n: We work with leading pharmaceutical, biotechnology, and medical device companies, as well as healthcare delivery systems, specialty physician groups, and other healthcare service providers, to meet their real estate needs. We provide high-quality property management services to encourage tenants to renew, expand, and relocate into our properties, which drives increased occupancy, rental rates, and property values.\n(iv)\nOur\n platform\n: We have a people-first culture that we believe attracts, develops, and retains top talent. We continually strive to create and maintain an industry-leading platform, with systems and tools that allow us to effectively and efficiently manage our assets and investment activity.\nInternal Growth Strategies\nWe believe our real estate portfolio holds the potential for increased future cash flows as it is well-maintained and in desirable locations. Our strategy for maximizing the benefits from these opportunities is to: (i) work with new or existing tenants to address their space and capital needs and (ii) provide high-quality property management services in order to motivate tenants to renew, expand, or relocate into our properties.\nWe expect to continue our internal growth as a result of our ability to:\n•\nBuild and maintain long-term leasing and management relationships with quality tenants. In choosing locations for our properties, we focus on the physical environment, adjacency to established businesses (e.g., hospital systems or life science submarkets) and educational centers, proximity to sources of business growth, and other local demographic factors.\n•\nReplace tenants at the best available market terms and lowest possible transaction costs. We believe we are well-positioned to attract new tenants and achieve attractive rental rates and operating cash flow as a result of the location, design, and maintenance of our properties, together with our reputation for high-quality building services, responsiveness to tenants, and our ability to offer space alternatives within our portfolio.\n•\nExtend and modify terms of existing leases prior to expiration. We selectively structure lease extensions, early renewals, or modifications, which reduce the cost associated with lease downtime, while securing the tenancy and relationship of our high-quality tenants on a long-term basis.\nInvestment Strategies\nThe discovery and delivery of healthcare services requires real estate and, as a result, tenants depend on our real estate, in part, to maintain and grow their businesses. We believe the healthcare real estate market provides investment opportunities due to the: (i) compelling long-term demographics driving the demand for healthcare services; (ii) specialized nature of healthcare real estate investing; and (iii) ongoing consolidation of the fragmented healthcare real estate sector.\nWhile we emphasize healthcare real estate ownership, we may also provide real estate secured financing to, or invest in equity or debt securities of, healthcare operators or other entities engaged in healthcare real estate ownership. We may also acquire all or substantially all of the securities or assets of other REITs, operating companies, or similar entities where such investments would be consistent with our investment strategies. We may co-invest alongside institutional or development investors through partnerships or limited liability companies.\n5\nTable of Contents\nWe monitor our investments based on the percentage of our total assets that may be invested in any one property type, investment vehicle, or geographic location, the number of properties that may be leased to a single tenant or operator, or loans that may be made to a single borrower. In allocating capital, we target opportunities with the most attractive risk/reward profile for our portfolio as a whole. We may take additional measures to mitigate risk, including diversifying our investments (by sector, geography, and tenant), structuring transactions as master leases, requiring tenant or operator insurance and indemnifications, and/or obtaining credit enhancements in the form of guarantees, letters of credit, or security deposits.\nWe believe we are well-positioned to achieve external growth through acquisitions, development, and redevelopment. Other factors that contribute to our competitive position include:\n•\nour reputation gained through decades of successful operations and the strength of our existing portfolio of properties;\n•\nour relationships with leading pharmaceutical and biotechnology tenants, healthcare operators and systems, investment banks and other market intermediaries, corporations, private equity firms, not-for-profit organizations, and companies seeking to monetize existing assets or develop new facilities;\n•\nour relationships with institutional buyers and sellers of high-quality healthcare real estate;\n•\nour track record and reputation for executing acquisitions responsively and efficiently, which provides confidence to domestic and foreign institutions and private investors who seek to sell healthcare real estate in our market areas;\n•\nour relationships with nationally recognized financial institutions that provide capital to the healthcare and real estate industries; and\n•\nour control of land sites held for future development.\nFinancing Strategies\nOur REIT qualification requires us to distribute at least 90% of our REIT taxable income (excluding net capital gains); therefore, we do not retain a significant amount of earnings. As a result, we regularly access the public equity and debt markets to raise the funds necessary to finance acquisitions and debt investments, develop and redevelop properties, and refinance maturing debt. \nWe may finance acquisitions and other investments in a variety of ways, including:\n•\ncash flow from operations;\n•\nsale or exchange of ownership interests in properties or other investments;\n•\nborrowings under our credit facility or commercial paper program;\n•\nissuance of additional debt, including unsecured notes, term loans, and mortgage debt; and/or\n•\nissuance of common stock or preferred stock or its equivalent.\nWe maintain a disciplined investment-grade balance sheet by actively managing our debt to equity levels and maintaining access to multiple sources of liquidity. Our debt obligations are primarily long-term fixed rate with staggered maturities.\nWe finance our investments based on our evaluation of available sources of funding. For short-term purposes, we may utilize our revolving line of credit facility or commercial paper program, arrange for other short-term borrowings from banks or other sources, or issue equity securities pursuant to our at-the-market equity offering program. We arrange for longer-term financing by offering debt and equity, placing mortgage debt, and obtaining capital from institutional lenders and joint venture partners.\nIn addition, capital recycling through dispositions and redeployment through acquisitions, developments, and redevelopments is an important facet of our investment and financing strategies. We routinely have multiple transactions involving both individual properties and portfolios under consideration that are in varying stages of evaluation, underwriting, negotiation, and due diligence review, some of which, if consummated or completed, may have a material effect on our liquidity, results of operations, and financial condition.\n6\nTable of Contents\nSegments\nOutpatient Medical\nOur outpatient medical segment includes outpatient medical buildings and hospitals. Outpatient medical buildings typically contain physicians’ offices and examination rooms, and may also include pharmacies, hospital ancillary service space, and outpatient services such as diagnostic centers, rehabilitation clinics, and day-surgery operating rooms. While these facilities have certain similarities to commercial office buildings, they require additional plumbing, electrical, and mechanical systems to accommodate multiple exam rooms that may require sinks in every room and specialized equipment such as x-ray machines and MRIs. Outpatient medical buildings are often built to accommodate higher structural loads for such specialized equipment and may contain vaults or other unique construction. Our outpatient medical buildings are typically multi-tenant properties leased to healthcare providers (hospitals and physician practices), with approximately 78% of our outpatient medical buildings located on or adjacent to hospital campuses and 96% affiliated with hospital systems as of December 31, 2024 (based on total square feet). Occasionally, we invest in outpatient medical buildings located on hospital campuses subject to ground leases. At December 31, 2024, approximately\n \n76% of our outpatient medical buildings were triple-net leased (based on leased square feet) with the remaining leased under gross or modified gross leases.\nThe following table provides information about our most significant outpatient medical tenant concentration for the year ended December 31, 2024:\nTenant\nPercentage of\nSegment Revenues\nPercentage of\nTotal Revenues\nHCA Healthcare, Inc. (HCA)\n15 \n%\n7 \n%\nCommonSpirit Health\n6 \n%\n3 \n%\nDuring the year ended December 31, 2024, we had various other outpatient medical tenants that each represented 1% or less of total revenues. \nOur outpatient medical segment also includes nine\n \nhospitals. Services provided by our tenants and operators in hospitals are paid for by private sources, third-party payors (e.g., insurance and HMOs), or through Medicare and Medicaid programs. Our hospital property types include acute care, long-term acute care, and specialty and rehabilitation hospitals. All of our hospitals are triple-net leased.\nLab\nOur lab properties, which contain laboratory and office space, are leased primarily to biotechnology, medical device and pharmaceutical companies, scientific research institutions, government agencies, and other organizations involved in the life science industry. While these properties have certain characteristics similar to commercial office buildings, they generally accommodate heavier floor loads and contain more advanced electrical, mechanical, heating, ventilating, and air conditioning systems. The facilities generally have specialty equipment including emergency generators, fume hoods, lab bench tops, and related amenities. In addition to improvements funded by us as the landlord, many of our lab tenants make significant investments to improve their leased space to accommodate biology, chemistry, or medical device research initiatives.\nLab properties are primarily configured in business park or campus settings and include multiple buildings. The business park and campus settings allow us the opportunity to provide flexible, contiguous/adjacent expansion to accommodate the growth of existing tenants. Our properties are located in well-established geographical markets known for scientific research and drug discovery, including San Francisco (53%) and San Diego (17%), California, and Boston, Massachusetts (28%) (based on total square feet). At December 31, 2024,\n \n88% of our lab properties were triple-net leased (based on leased square feet).\nDuring the year ended December 31, 2024, we had various lab tenants that each represented 1% or less of total revenues. \nContinuing care retirement community, or CCRC\nCCRCs are retirement communities that include independent living, assisted living, memory care, and skilled nursing units to provide a continuum of care in an integrated campus. Our CCRCs are owned through RIDEA structures, which is permitted by the Housing and Economic Recovery Act of 2008, and includes most of the provisions previously proposed in the REIT Investment Diversification and Empowerment Act of 2007. The services provided by our third-party manager-operators under a RIDEA structure at our properties are primarily paid for by the residents directly or through private insurance and are less reliant on government reimbursement programs such as Medicare and Medicaid.\n7\nTable of Contents\nA RIDEA structure allows us, through a taxable REIT subsidiary (“TRS”), to receive cash flow from the operations of a healthcare facility in compliance with REIT tax requirements. The criteria for operating a healthcare facility through a RIDEA structure require us to lease the facility to an affiliate TRS and for such affiliate TRS to engage an independent qualifying management company (also known as an eligible independent contractor or third-party operator) to manage and operate the day-to-day business of the facility in exchange for a management fee. As a result, under a RIDEA structure, we are required to rely on a third-party operator to hire and train all facility employees, enter into third-party contracts for the benefit of the facility, including resident/patient agreements, comply with laws, including healthcare laws, and provide resident care. We are substantially limited in our ability to control or influence day-to-day operations under a RIDEA structure, and thus rely on the third-party operator to manage and operate the business. \nThrough our TRS entities, we bear all operational risks and liabilities associated with the operation of these properties, with limited exceptions, such as a third-party operator’s gross negligence or willful misconduct. These operational risks and liabilities include those relating to any employment matters of our operator, compliance with healthcare and other laws, liabilities relating to personal injury-tort matters, resident-patient quality of care claims, and any governmental reimbursement matters, even though we have limited ability to control or influence our third-party operators’ management of these risks. \nThe management agreements we have in RIDEA structures related to CCRCs have original terms ranging from 10 to 15 years, with mutual renewal options. There are base management fees and incentive management fees payable to our third-party operators if operating results of the RIDEA properties exceed pre-established thresholds. Conversely, there are also provisions in the management agreements that reduce management fees payable to our third-party operators if operating results do not meet certain pre-established thresholds.\nCCRCs are different from other housing and care options for seniors because they typically provide written agreements or long-term contracts between residents and the communities (frequently lasting the term of the resident’s lifetime), which offer a continuum of housing, services, and healthcare on one campus or site. CCRCs are appealing as they allow residents to “age in place” and typically the individual is independent and in relatively good health upon entry. \nAs third-party operators manage our RIDEA properties in exchange for the receipt of a management fee, we are not directly exposed to the credit risk of these operators in the same manner or to the same extent as a triple-net tenant.\nOther non-reportable segment\nAt December 31, 2024, we had the following investments in our other non-reportable segments: (i) our unconsolidated joint venture with a sovereign wealth fund that owns 19 senior housing assets (which we refer to as our SWF SH JV) and (ii) loans receivable. \nThe properties in our SWF SH JV are owned through RIDEA structures and include independent living facilities and assisted living facilities, which cater to different segments of the elderly population based upon their personal needs. These facilities are often in apartment-like buildings with private residences ranging from single rooms to large apartments.\nCompetition\nInvesting in real estate serving the healthcare industry is highly competitive. We face competition from other REITs, investment companies, pension funds, private equity investors, sovereign funds, healthcare operators, lenders, developers, and other institutional investors, some of whom may have greater flexibility (e.g., non-REIT competitors), greater resources, and lower costs of capital than we do. Increased competition and resulting capitalization rate compression, as well as the impacts of inflation and higher interest rates, make it more challenging for us to identify and successfully capitalize on opportunities that meet our objectives. Our ability to compete may also be impacted by global, national, and local economic trends, availability of investment alternatives, availability and cost of capital, construction and renovation costs, existing laws and regulations, new legislation, and population trends.\nIncome from our investments depends on our tenants’ and operators’ ability to compete with other companies on multiple levels, including: (i) the quality of care provided, (ii) reputation, (iii) success of product or drug development, (iv) price, (v) the range of services offered, (vi) the physical appearance of a property, (vii) alternatives for healthcare delivery, (viii) the supply of competing properties, (ix) physicians, (x) staff, (xi) referral sources, (xii) location, (xiii) the size and demographics of the population in surrounding areas, and (xiv) the financial condition of our tenants and operators. For a discussion of the risks associated with competitive conditions affecting our business, see “",
    "item1a": "Item 1A, Risk Factors” in this report for additional information about certain ongoing risks related to our information technology that, if realized, are reasonably likely to materially affect us, including our operations, business strategy, results of operations, or financial condition.\nCybersecurity Governance\nCybersecurity is an important part of our overall risk management processes and an area of focus for our Board of Directors and management. \nThe Board, in coordination with the Audit Committee, oversees the Company’s enterprise risk management process, including the management of material risks arising from cybersecurity threats.\n The Audit Committee regularly receives updates from management and third-party cybersecurity experts about major cybersecurity risks, their potential impact on our business operations, and management’s processes to identify, monitor, and mitigate such risks, including, as relevant, the results of assessments or audits of our processes.  \nThe Audit Committee periodically provides updates on these matters to the Board of Directors.\n38\nTable of Contents\nOur enterprise risk team consists of cross-functional professionals who collaborate with subject matter specialists, as necessary, including an independent third-party expert we have retained to functionally serve as a virtual chief information security officer (“CISO”), to identify and assess material risks from cybersecurity threats, their severity, and potential mitigation steps. \nThe \nCISO\n is primarily responsible for leading our cybersecurity risk assessment and management processes. This expert has experience having served as the chief information security officer for an international commercial real estate services company and currently serves as chief information security officer of a cybersecurity firm focused on commercial real estate.\n He is supported by an internal cross-functional management team of IT and internal audit personnel who regularly review and assess cybersecurity initiatives, including our incident response plan, as well as cybersecurity compliance, training and risk management efforts.",
    "item1b": "ITEM 1B.    Unresolved Staff Comments\nNone.",
    "item1c": "ITEM 1C.    Cybersecurity\nCybersecurity Risk Management and Strategy\nIn our business operations, we use information technology, enterprise applications, communications tools, cloud network solutions, and related systems to manage our operations, including to manage our building systems, tenant and vendor relationships, accounting and recordkeeping, and communications, among other aspects of our business. \nWe have developed and implemented a cybersecurity risk management program intended to protect our properties, confidential and proprietary data, and information technology and systems, from cybersecurity threats, including unauthorized access or attack. We leverage the National Institute of Standards and Technology (“NIST”) Cybersecurity Framework as a guide to help us identify, assess, and manage cybersecurity risks relevant to the business. This does not imply that we meet any particular technical standards, specifications, or requirements.\nOur processes for assessing, identifying, and managing risks from cybersecurity threats, including operational risks, financial reporting risks, reputational risks, personal data theft, fraud, and other potential risks, are integrated into our overall enterprise risk management process, and share common methodologies, reporting channels, and governance processes that apply across the enterprise risk management process to other legal, compliance, strategic, operational, and financial risk areas.\nOur cybersecurity risk management program includes the following:\n•\na multidisciplinary team comprised of personnel from information technology (“IT”), internal audit, accounting, and legal, as well as third-party cybersecurity experts principally responsible for directing (i) our cybersecurity risk assessment processes, (ii) our security processes, and (iii) our response to cybersecurity incidents;\n•\nrisk assessments designed to help identify material cybersecurity risks to our critical systems, information, services, and our broader enterprise IT environment;\n•\ninternal and third-party security tools to monitor our systems, identify cybersecurity risks, and test our IT environment;\n•\nthe use of third-party cybersecurity experts, where appropriate, to assess, test or otherwise assist with aspects of our security processes;\n•\na cybersecurity incident response plan, business continuity plan, and established policies governing cybersecurity risk management at the corporate and property levels;\n•\ncybersecurity training for employees and key business partners with access to our systems;\n•\na third-party cybersecurity risk management process for service providers and vendors who access our systems; \n•\nrequiring employees, as well as third parties who have access to our systems, to treat confidential and private information and data with care, including performing controls relating to such data; and\n•\ncybersecurity risk insurance. \nWe also seek to engage reputable service providers that maintain cybersecurity programs or controls.\nWe have not identified risks from known cybersecurity threats within the prior fiscal year, including as a result of any prior cybersecurity incident, that have materially affected or are reasonably likely to materially affect us, including our business strategy, results of operations, or financial condition.\n Please refer to “"
  }
}