{
  "ticker": "DRI",
  "cik": "0000940944",
  "company_name": "DARDEN RESTAURANTS INC",
  "filing_date": "2025-07-18",
  "accession": "0000940944-25-000038",
  "primary_doc": "dri-20250525.htm",
  "item_sections": {
    "item1": "Item 1A below under the heading “Risk Factors.”\nPART I\nItem 1.  BUSINESS\nIntroduction \nDarden Restaurants, Inc. is a full-service restaurant company, and as of May 25, 2025, we owned and operated 2,159 restaurants through subsidiaries in the United States and Canada under the Olive Garden\n®\n, LongHorn Steakhouse\n®\n, Cheddar’s Scratch Kitchen\n®\n, Chuy’s\n®\n, Yard House\n®\n, Ruth’s Chris Steak House\n® \n(“Ruth’s Chris”), The Capital Grille\n®\n, Seasons 52\n®\n, Eddie V’s Prime Seafood\n® \n(“Eddie V’s”), Bahama Breeze\n®\n, and The Capital Burger\n®\n trademarks. As of May 25, 2025, we also had 154 restaurants operated by independent third parties pursuant to area development and franchise agreements and 4 restaurants operating under contractual agreements. The following table details the number of company-owned and operated restaurants, as well as those operated under franchise and contractual agreements, as of May 25, 2025:    \nNumber of Restaurants \nOlive\nGarden\nLongHorn\nSteakhouse\nCheddar’s Scratch Kitchen\nChuy’s\nYard House (1)\nRuth’s Chris \nThe\nCapital\nGrille\nSeasons 52\nEddie V’s\nBahama Breeze\nThe Capital Burger\nTotal\nOwned and operated:\nUnited States\n927\n591\n181\n108\n88\n82\n71\n43\n29\n28\n3\n2,151\nCanada\n8\n—\n—\n—\n—\n—\n—\n—\n—\n—\n—\n8\nTotal\n935\n591\n181\n108\n88\n82\n71\n43\n29\n28\n3\n2,159\nFranchised:\nUnited States (2)\n11\n19\n3\n—\n—\n51\n—\n—\n—\n1\n—\n85\nLatin America\n32\n—\n—\n—\n—\n2\n2\n—\n—\n—\n—\n36\nCanada\n—\n—\n—\n—\n—\n6\n—\n—\n—\n—\n—\n6\nAsia\n5\n1\n—\n—\n—\n16\n—\n—\n—\n—\n—\n22\nMiddle East\n3\n—\n—\n—\n—\n—\n—\n—\n—\n—\n—\n3\nThe Caribbean\n1\n—\n—\n—\n—\n1\n—\n—\n—\n—\n—\n2\nTotal\n52\n20\n3\n—\n—\n76\n2\n—\n—\n1\n—\n154\nOperated:\nUnited States\n—\n—\n—\n—\n—\n4\n—\n—\n—\n—\n—\n4\nTotal\n—\n—\n—\n—\n—\n4\n—\n—\n—\n—\n—\n4\nGrand Total\n987\n611\n184\n108\n88\n162\n73\n43\n29\n29\n3\n2,317\n(1)\nIncludes one restaurant that is owned jointly by us and third parties and managed by us.\n(2)\nIncludes Puerto Rico and Guam.\nDarden Restaurants, Inc. is a Florida corporation incorporated in March 1995, and is the parent company of GMRI, Inc., also a Florida corporation. GMRI, Inc. and certain other of our subsidiaries own and operate our restaurants. GMRI, Inc. was originally incorporated in March 1968 as Red Lobster Inns of America, Inc. We were acquired by General Mills, Inc. in 1970 and became a separate publicly held company in 1995 when General Mills distributed all of our outstanding stock to the stockholders of General Mills. Our principal executive offices and restaurant support center are located at 1000 Darden Center Drive, Orlando, Florida 32837, telephone (407) 245-4000. Our corporate website address is \nwww.darden.com\n. We make our reports on Forms 10-K, 10-Q and 8-K, Section 16 reports on Forms 3, 4 and 5, and all amendments to those reports available free of charge on our website the same day as the reports are filed with or furnished to the Securities and Exchange Commission. Information on our website is not deemed to be incorporated by reference into this Form 10-K. Unless the context indicates otherwise, all references to “Darden,” “the Company,” “we,” “our” or “us” include Darden Restaurants, Inc., GMRI, Inc. and our respective subsidiaries.\nOn October 11, 2024, we acquired 100 percent of the equity interest of Chuy’s Holdings, Inc. (Chuy’s Holdings) in an all-cash transaction of $649.1 million in total consideration, $613.7 million in net cash consideration, inclusive of $35.4 million of cash on Chuy’s Holdings balance sheet at closing. We financed the acquisition with a portion of the proceeds from the issuance of a $400.0 million aggregate principal amount of 4.350 percent senior notes due 2027 (2027 Notes) and a $350.0 million aggregate principal amount of 4.550 percent senior notes due 2029 (2029 Notes), which were issued on October 3, 2024. The 2027 Notes will mature on October 15, 2027 and the 2029 Notes will mature on October 15, 2029.  Interest on the Notes will be paid semi-\n1\nannually in arrears on April 15 and October 15 of each year, commencing on April 15, 2025, to holders of record on the preceding March 31 or September 30, as the case may be.\nDuring the fourth quarter of fiscal 2025, we entered into an agreement with Recipe Unlimited, Canada’s largest full-service restaurant company,  pursuant to which Recipe Unlimited will acquire Olive Garden’s eight Canadian restaurants. These restaurants will be franchise-owned and will operate as members of our Olive Garden International family.  Recipe Unlimited is headquartered in Toronto, operating more than 1,200 restaurants in more than 300 communities across Canada.  Subsequent to the end of the quarter, on July 14, 2025, we successfully closed on the sale. \nOn our June 2025 earnings call, we announced the decision to explore strategic alternatives for the Bahama Breeze brand, which includes 28 locations owned and operated by Darden and one franchise location. We will be exploring a sale of the brand or conversions of some or all locations to other Darden brands. \nWe have a 52/53 week fiscal year ending the last Sunday in May. Our fiscal year \n2025\n ended May 25, 2025 and consisted of 52 weeks, fiscal 2024 ended May 26, 2024 and consisted of 52 weeks, and fiscal 2023 ended May 28, 2023 and consisted of 52 weeks.\nThe following description of our business should be read in conjunction with the information in Part II of this report under the caption “Item 7 - Management’s Discussion and Analysis of Financial Condition and Results of Operations” and “Item 8 - Financial Statements and Supplementary Data.” \nSegment Information\nWe manage our restaurant brands in North America as operating segments. The brands operate principally in the U.S. within full-service dining. We aggregate our operating segments into reportable segments based on a combination of the size, economic characteristics and sub-segment of full-service dining within which each brand operates. We have four reportable segments: 1) Olive Garden, 2) LongHorn Steakhouse, 3) Fine Dining (which includes Ruth’s Chris, The Capital Grille and Eddie V’s) and 4) Other Business (which includes Cheddar’s Scratch Kitchen, Chuy’s, Yard House, Bahama Breeze, Seasons 52, The Capital Burger and ongoing royalties and other fees from our franchise operations and contractually managed locations). External sales are derived principally from food and beverage sales, we do not rely on any major customers as a source of sales and the customers and long-lived assets of our reportable segments are predominantly in the U.S. There were no material transactions among reportable segments. \nRestaurant Brands\nOlive Garden\nOlive Garden is an internally-developed brand and is the largest full-service dining Italian restaurant operator in the United States. Olive Garden offers a variety of Italian foods featuring fresh ingredients presented simply with a focus on flavor and quality, and a broad selection of imported Italian wines. In 1982, Olive Garden opened its first restaurant in Orlando, Florida.  \n Most dinner menu entrée prices range from $12.00 to $23.50, and most lunch menu entrée prices range from $9.50 to $11.50. The price of each entrée includes as much fresh salad or soup and breadsticks as a guest desires. During fiscal 2025, the average check per person (defined as total sales divided by number of entrées sold) was approximately $24.00, with alcoholic beverages accounting for 4.7 percent of Olive Garden’s sales. Olive Garden maintains different menus across its trade areas to reflect geographic differences in consumer preferences, prices and selections, as well as a smaller portioned, lower-priced children’s menu. \nLongHorn Steakhouse\nLongHorn Steakhouse is a full-service steakhouse restaurant brand with locations primarily in the eastern United States, operating in an atmosphere inspired by the American West. LongHorn Steakhouse opened its first restaurant in 1981, and we acquired LongHorn Steakhouse in October 2007 as part of the RARE Hospitality International, Inc. (RARE) acquisition. LongHorn Steakhouse restaurants feature a variety of menu items including signature fresh steaks and chicken, as well as salmon, shrimp, ribs, pork chops and burgers.\nMost dinner menu entrée prices range from $14.00 to $41.00, and most lunch menu entrée prices range from $9.00 to $12.00. The price of most entrées includes a side and/or salad and as much freshly baked bread as a guest desires. During fiscal 2025, the average check per person was approximately $28.00, with alcoholic beverages accounting for 8.5 percent of LongHorn Steakhouse’s sales. LongHorn Steakhouse maintains different menus for dinner and lunch and different menus across its trade \n2\nareas to reflect geographic differences in consumer preferences, prices and selections, as well as a smaller portioned, lower-priced children’s menu.\nCheddar’s Scratch Kitchen\nCheddar’s Scratch Kitchen is a full-service restaurant brand operating primarily in Texas and throughout the southern, mid-western and mid-Atlantic regions of the United States. The casual dining menu features modern classics and American favorites cooked from scratch. Each entree includes a honey butter croissant.  Cheddar’s Scratch Kitchen opened its first restaurant in 1979, and we acquired Cheddar’s Scratch Kitchen in April 2017.\nMost dinner menu entrée prices range from $10.00 to $23.00, and most lunch menu entrée prices range from $9.00 to $11.00.  During fiscal 2025, the average check per person was approximately $19.00, with alcoholic beverages accounting for 7.0 percent of Cheddar’s Scratch Kitchen’s sales. Cheddar’s Scratch Kitchen features different menus across its trade areas to reflect geographic differences in consumer preferences, prices and selections, as well as a smaller portioned, lower-priced children’s \nmenu\n.  \nChuy’s\nChuy’s is a full-service restaurant brand offering a distinct menu of authentic, freshly-prepared Mexican and Tex-Mex inspired food. The restaurants have common décor, but each location is unique in format, offering an “unchained” look and feel, as expressed by the motto “If you’ve seen one Chuy’s, you’ve seen one Chuy’s!”  Chuy’s opened its first restaurant in Austin, Texas in 1982, and we acquired Chuy’s in October 2024.  \nMost menu entrée prices range from $11.00 to $21.00.  During fiscal 2025, the average check per person was approximately $19.50, with alcoholic beverages accounting for 12.0 percent of Chuy’s sales. The core menu was established using recipes from family and friends of the founders and has remained relatively unchanged over the years. Chuy’s offers the same menu for both lunch and dinner, which includes enchiladas, fajitas, tacos, burritos, combination platters and salads complemented by a variety of appetizers and desserts.  All meals include free chips and salsa.\nYard House\nYard House is a full-service restaurant brand operating in metropolitan areas across the United States and is known for great food, classic rock and over 100 draft beer offerings. The American menu includes more than 100 chef driven items with a wide range of appetizers, burgers and steaks, street tacos, salads, sandwiches and a generous selection of vegetarian dishes. Yard House opened its first restaurant in 1996, and we acquired Yard House in August 2012.  \nYard House design elements create a contemporary, yet casual, “come as you are” environment.  Most lunch and dinner menu entrée prices range from $10.00 to $54.00. During fiscal 2025, the average check per person was approximately $36.00, with alcoholic beverages accounting for 30.0 percent of Yard House’s sales. Yard House maintains different menus and selections of craft beers across its trade areas to reflect geographic differences in consumer preferences, prices and selections, as well as a smaller portioned, lower-priced children’s menu. \nRuth’s Chris\nRuth’s Chris is one of the largest fine dining steakhouse restaurant brands in the world. The menu features a broad\nselection of high-quality USDA Prime and Choice grade steaks and other premium offerings served in Ruth’s Chris’ signature fashion —“sizzling”— complemented by other traditional menu items inspired by its New Orleans heritage. Ruth’s Chris complements its distinctive food offerings with an award-winning wine list.  Ruth’s Chris opened its first restaurant in 1965, and we acquired Ruth’s Chris in June 2023.\nMost dinner menu entrée prices range from $40.00 to $85.00, and most lunch menu entrée prices range from $16.00 to $65.00. During fiscal 2025, the average check per person was approximately $104.50, with alcoholic beverages accounting for 19.3 percent of Ruth’s Chris’ sales. Ruth’s Chris offers different menus for dinner and lunch and varies its wine list to reflect geographic differences in consumer preferences, prices and selections. \nThe Capital Grille\nThe Capital Grille is a fine dining restaurant brand with locations primarily in major metropolitan cities in the United States featuring relaxed elegance and style. The Capital Grille opened its first restaurant in 1990, and we acquired The Capital Grille in October 2007 as part of the RARE acquisition. Nationally acclaimed for dry aging steaks on the premises, the restaurants feature an award-winning wine list offering over 350 selections, personalized service, a comfortable club-like atmosphere, and premiere private dining rooms.\n3\nMost dinner menu entrée prices range from $40.00 to $95.00, and most lunch menu entrée prices range from $23.00 to $53.00. During fiscal 2025, the average check per person was approximately $104.00, with alcoholic beverages accounting for 26.3 percent of The Capital Grille’s sales. The Capital Grille offers different menus for dinner and lunch and varies its wine list to reflect geographic differences in consumer preferences, prices and selections.\nSeasons 52\nSeasons 52 is an internally-developed full-service restaurant brand with a casually sophisticated, fresh grill and wine bar that offers a seasonally changing menu with all items under 595 calories. The menu includes an international collection of wines, along with exceptional signature handcrafted cocktails. In 2003, Seasons 52 opened its first restaurant in Orlando, Florida.  \nMost lunch and dinner menu entrée prices range from $12.50 to $51.00. During fiscal 2025, the average check per person was approximately $52.00, with alcoholic beverages accounting for 21.8 percent of Seasons 52’s sales. Seasons 52 maintains an all-day menu in addition to different seasonal offerings, a pared-down lunch menu and a happy-hour menu.\nEddie V’s\nEddie V’s is a fine dining restaurant brand with locations in major metropolitan cities in the United States, with a sophisticated and contemporary ambiance, featuring live music nightly in the V Lounge. Dishes are artistically prepared and feature seasonal seafood and critically acclaimed prime steaks, hand cut and broiled to perfection.  The atmosphere provides an alluring dining experience reminiscent of a modern day Gatsby, infusing an indulgent experience with an irresistible vibe.  Eddie V’s opened its first restaurant in 2000, and we acquired Eddie V’s in November 2011.\nMost dinner menu entrée prices range from $41.00 to $116.00. During fiscal 2025, the average check per person was approximately $123.00, with alcoholic beverages accounting for 27.3 percent of Eddie V’s sales. Eddie V’s menu features a premium selection of seafood and hand-cut steaks, and each restaurant offers unique wine and spirit selections that reflect local preferences, in addition to the brand’s core wine & cocktail offerings.\nBahama Breeze\nBahama Breeze is an internally-developed full-service restaurant brand operating primarily in the eastern United States that offers guests the feeling of a Caribbean escape, with food, drinks and atmosphere found in the islands. The menu features distinctive, Caribbean-inspired fresh seafood, chicken and steaks as well as handcrafted tropical cocktails. In 1996, Bahama Breeze opened its first restaurant in Orlando, Florida.  \nMost lunch and dinner menu entrée prices range from $10.50 to $39.00. During fiscal 2025, the average check per person was approximately $35.00, with alcoholic beverages accounting for 20.5 percent of Bahama Breeze’s sales. Bahama Breeze maintains different menus across its trade areas to reflect geographic differences in consumer preferences, prices and selections, as well as a smaller portioned, lower-priced children’s menu.\nThe Capital Burger\nThe Capital Burger is an internally-created, development-stage full-service restaurant concept with locations primarily in major metropolitan cities in the United States that offers guests a luxe burger experience. The Capital Burger opened its first restaurant in 2018. The menu features burgers made with a proprietary beef blend, sandwiches and appetizers. It is a bar-centric concept offering local craft beers, a unique wine list and spiked shakes. Multiple items take from the parentage of The Capital Grille, like the signature Doli, a pineapple-infused martini. \nMost lunch and dinner menu entrée prices range from $18.00 to $36.00. During fiscal 2025, the average check per person was approximately $36.00, with alcoholic beverages accounting for 25.3 percent of The Capital Burger’s sales.  The Capital Burger maintains an all-day menu in addition to a happy hour menu.\nThe following table shows our restaurant growth over the last five years including the number of restaurants owned and operated by each brand and concept as of the end of the respective fiscal years.  The table excludes our restaurants operated by independent third parties pursuant to area development, franchise, and contractual agreements. The final column in the table lists our total sales from continuing operations for the fiscal years indicated.\n4\nFiscal\nYear\nOlive\nGarden\nLongHorn\nSteakhouse\nCheddar’s \nScratch \nKitchen\nChuy’s\nYard\nHouse\nRuth’s\nChris\nThe\nCapital\nGrille\nSeasons\n52\nEddie V’s\nBahama\nBreeze\nThe \nCapital\nBurger\nTotal\nRestaurants\nTotal \nSales\n(in millions) (1)\n2021\n875\n533\n170\n—\n81\n—\n60\n44\n26\n42\n3\n1,834\n$7,196.1\n2022\n884\n546\n172\n—\n85\n—\n62\n45\n28\n42\n3\n1,867\n$9,630.0\n2023\n905\n562\n180\n—\n86\n—\n62\n44\n29\n42\n4\n1,914\n$10,487.8\n2024\n920\n575\n181\n—\n88\n80\n66\n44\n30\n43\n4\n2,031\n$11,390.0\n2025\n935\n591\n181\n108\n88\n82\n71\n43\n29\n28\n3\n2,159\n$12,076.7\n(1) During fiscal 2021, many of our locations experienced restrictions on operations, including the ability to have dine-in operations and were subject to vaccine and/or mask mandates as a result of the COVID-19 pandemic.  \nStrategy\nWe believe that capable operators of strong multi-unit brands have the opportunity to increase their share of the restaurant industry’s full-service segment. Generally, the restaurant industry is considered to be comprised of three segments: quick service, fast casual, and full-service. All of our restaurants fall within the full-service segment, which is highly fragmented and includes many independent operators and small chains. We believe we have strong brands and that the breadth and depth of our experience and expertise sets us apart in the full-service restaurant industry. This collective capability is the product of investments over many years in areas that are critical to success in our business, including restaurant operations excellence, brand management excellence, supply chain, talent management and information technology, among other things.\nOur operating philosophy remains focused on strengthening the core operational fundamentals of the business by providing an outstanding guest experience rooted in culinary innovation, attentive service, and engaging atmosphere enabled by our people. Darden enables each brand to reach its full potential by leveraging its scale, insights, and experience in a way that protects uniqueness and competitive advantages. Additionally, our brands can capitalize on data driven insights to deliver customized one-to-one customer relationship marketing. We hold ourselves accountable for operating our restaurants with a sense of urgency to achieve our commitments to all of our stakeholders.\nRecent and Planned Restaurant Growth \nDuring fiscal 2025, we added 103 company-owned Chuy’s restaurants and 25 other net new restaurants in the United States. Our fiscal 2025 actual restaurant openings and closings, fiscal 2026 projected openings, and approximate capital investment, square footage and dining capacity, by brand, are shown below:\nActual - Fiscal 2025\nProjected - Fiscal 2026 (4)\nPro-Forma New Restaurants (4)\nRestaurant Openings\nAcquired\nRestaurant Closings\nNew Restaurant Openings\nCapital Investment\n Range (1)\n (in millions)\nApproximate Square Feet\n(2)\nApproximate Dining Seats\n(3)\nOlive Garden\n15\n—\n—\n19-22\n$4.5\n-\n$6.2\n7,700\n250\nLongHorn Steakhouse\n16\n—\n—\n23-26\n$3.8\n-\n$5.1\n5,800\n180\nCheddar’s Scratch Kitchen\n3\n—\n3\n2-3\n$4.2\n -\n$5.5\n6,300\n210\nChuy’s\n7\n103\n2\n2-4\n$4.0\n-\n$4.9\n5,700\n160\nYard House \n2\n—\n2\n5-6\n$7.8\n-\n$9.8\n9,000\n330\nRuth’s Chris\n3\n—\n1\n1-2\n$6.0\n-\n$8.0\n7,400\n200\nThe Capital Grille\n7\n—\n2\n3-4\n$7.0\n-\n$9.7\n9,000\n260\nSeasons 52\n1\n—\n2\n1-2\n$6.0\n-\n$7.2\n7,400\n230\nEddie V’s\n1\n—\n2\n2-3\n$8.7\n-\n$10.2\n10,000\n320\nBahama Breeze (5)\n1\n—\n16\n—\n$—\n-\n$—\n—\n—\nTotals\n56\n103\n30\n60-65\n5\n(1)\nIncludes cash investments for building, equipment, furniture and other construction costs; excludes internal capitalized overhead, pre-opening expenses, tenant allowance and future lease obligations. Olive Garden, LongHorn Steakhouse, Cheddar’s Scratch Kitchen and Chuy’s capital investments are based on costs associated with land-only leases; Yard House, Ruth’s Chris, The Capital Grille, Seasons 52 and Eddie V’s capital investments are based on ground and building leases. Actual costs can vary significantly depending on the specific location.\n(2)\nIncludes all space under the roof, including coolers and freezers; based on primary prototypes.\n(3)\nIncludes bar dining seats and patio seating, but excludes bar stools.\n(4)\nThe Capital Burger is a development-stage concept with limited pro-forma information, and as such, it is excluded from this table.\n(5)\nWe are exploring strategic alternatives for the Bahama Breeze brand, and as such, it is excluded from the pro forma section of this table.\nWhile our objective is to continue to expand all of our restaurant brands, the actual number of openings for each of our brands for fiscal 2026 will depend on many factors, including our ability to recruit and train restaurant management and hourly personnel, locate appropriate sites, negotiate acceptable purchase or lease terms, obtain necessary local governmental permits, and complete construction.\nWe consider location to be a critical factor in determining a restaurant’s long-term success, and we devote significant effort to the site selection process. Prior to entering a market, we conduct a thorough study to determine the optimal number and placement of restaurants. Our site selection process incorporates a variety of analytical techniques to evaluate key factors. These factors include trade area demographics, such as target population density and household income levels; competitive influences in the trade area; the site’s visibility, accessibility and traffic volume; and proximity to activity centers such as shopping malls, hotel/motel complexes, offices and universities. Members of senior management evaluate, inspect and approve each restaurant site prior to its acquisition. Constructing and opening a new restaurant typically takes approximately 250 days on average after the site is acquired and permits are obtained.\nWe systematically review the performance of our restaurants to ensure that each one meets our standards. When a restaurant falls below minimum standards, we conduct a thorough analysis to determine the causes, and implement operational and marketing plans to improve that restaurant’s performance. If performance does not improve to acceptable levels, the restaurant is evaluated for relocation, closing or conversion to one of our other brands. Permanent closures are typically due to economic changes in trade areas, the expiration of lease agreements, or site concerns. Accordingly, we continue to evaluate our site locations in order to minimize the risk of future closures or asset impairment charges. \nRestaurant Operations\nWe believe that high-quality restaurant management is critical to our long-term success. Our restaurant management structure varies by brand and restaurant size. We issue detailed operations manuals covering all aspects of restaurant operations, as well as food and beverage manuals which detail the preparation procedures of our recipes. The restaurant management teams are responsible for the day-to-day operation of each restaurant and for ensuring compliance with our operating standards.\nEach Olive Garden restaurant is led by a General Manager, and each LongHorn Steakhouse and Cheddar’s Scratch Kitchen restaurant is led by a Managing Partner. Each also has three to six additional managers, depending on the operating complexity and sales volume of the restaurant. In addition, each restaurant typically employs between 35 to 200 hourly team members, most of whom work part-time. Restaurant General Managers or Managing Partners report to a Director of Operations who is responsible for approximately five to eleven restaurants. Each Director of Operations reports to a Divisional Vice President of Operations who is responsible for between 80 and 120 restaurants. From time to time, we deploy Senior Directors of Operations in our large brands to oversee up to five Directors of Operations and assist with succession planning. Restaurants are visited regularly by operations management, including officer-level executives, to help ensure strict adherence to our standards and to solicit feedback on opportunities for improvement.\n \nEach Yard House, Ruth’s Chris, The Capital Burger and Bahama Breeze restaurant is led by a General Manager, and each The Capital Grille, Seasons 52, Eddie V’s and The Capital Burger restaurant is led by a Managing Partner. Each also has three to ten additional managers. Each Yard House, Ruth’s Chris, The Capital Grille, Seasons 52 and Eddie V’s restaurant has one executive chef, and some have one to two sous chefs. Each Bahama Breeze and The Capital Burger restaurant has one to three culinary managers.  In addition, each restaurant typically employs between 50 to 200 hourly team members, most of whom work part-time. The General Manager or Managing Partner of each restaurant reports directly to a Director of Operations, who has operational responsibility for approximately three to eleven restaurants. Restaurants are visited regularly by operations \n6\nmanagement, including officer-level executives, to help ensure strict adherence to our standards and to solicit feedback on opportunities for improvement.\nEach Chuy’s restaurant is led by a General Manager. Each restaurant has a First Assistant, Kitchen Manager and an additional one to three managers, depending on the operating complexity and sales volume of the restaurant. In addition, each restaurant typically employs between 60 to 120 hourly team members, most of whom work part-time. Restaurant General Managers report to an Area Supervisor who is responsible for approximately four to seven restaurants. Each Area Supervisor reports to a Senior Director of Operations who is responsible for between 30 – 40 restaurants. Restaurants are visited regularly by operations management, including officer-level executives, to help ensure strict adherence to our standards and to solicit feedback on opportunities for improvement.\nOur Learning and Development team in partnership with each brand’s training leader, together with senior operations executives, is responsible for developing and maintaining our operations training programs. These efforts include an eight to twelve-week training program for management trainees and continuing development programs for all levels of leadership. The emphasis of the training and development programs varies by restaurant brand, but includes leadership effectiveness, restaurant business management and culinary skills. We also use a highly structured training program to open new restaurants, including deploying training teams experienced in all aspects of restaurant operations. The opening training teams typically begin work one to two weeks prior to opening and remain at the new restaurant for up to three weeks after the opening. They are re-deployed as appropriate to enable a smooth transition to the restaurant’s operating staff.\nWe maintain performance measurement and incentive compensation programs for our management-level team members. We believe that our leadership position, strong results-oriented culture and various short-term and long-term incentive programs, including stock-based compensation, enhance our ability to attract and retain highly motivated restaurant managers.\nQuality Assurance \nOur Total Quality Department helps ensure that all restaurants provide safe, high-quality food in a clean and safe environment.\nThrough rigorous supplier and risk-based product evaluations, we purchase only products that meet or exceed our product specifications. We rely on independent third parties to inspect and evaluate our suppliers and distributors. Suppliers that produce “high-risk” ready-to-eat products are subject to a food safety evaluation by Darden personnel at least annually. We require our suppliers to maintain sound manufacturing practices and operate with comprehensive Hazard Analysis and Critical Control Point (HACCP) food safety programs and risk-based preventative controls adopted by the U.S. Food and Drug Administration. These programs focus on preventing hazards that could cause food-borne illnesses by applying scientifically-based controls to analyze hazards, identify and monitor critical control points, and establish corrective actions when monitoring shows that a critical limit has not been met.\nThird party auditors inspect each restaurant regularly throughout the year to assess food safety and sanitation practices. Our total quality team verifies the application of preventative controls through on-site support visits ensuring an effective and robust food safety system. Total quality managers provide support to operations staff with education and training in food safety and sanitation. The team also serves as a liaison to regulatory agencies on issues relating to food safety.\nSourcing and Distribution\nEnsuring available, safe, high-quality food and supplies at competitive prices to all our restaurants depends on reliable sources of procurement. Our sourcing staff sources, negotiates, and purchases food and supplies from more than 1,400 suppliers whose products originate in more than 30 countries. Suppliers must meet our strict quality control standards in the development, harvest, catch and production of food products. We leverage competitive bids, long-term contracts and strategic supplier relationships to manage availability and cost of products.\nWe contribute to Darden’s scale advantage, by directly sourcing product utilizing our supplier relationships, product expertise, dedicated distribution network, while prioritizing food safety. Our staff travels routinely within the United States and internationally to source top-quality food and supplies at competitive prices. We actively engage with and monitor our suppliers, both in person and remotely, including hosting virtual visits and audits. We have excellent long-term relationships with key suppliers and usually source our product directly from producers.\n7\nWe enter into long-term agreements with multiple third-party national distribution companies to deliver food and supplies to our restaurants. Under these arrangements we maintain ownership of the food and supplies inventory through our subsidiary Darden Direct Distribution, Inc. (Darden Direct), managed by third-party distribution partners. Because of the rapid turnover of perishable food products, inventories in the restaurants have a modest aggregate dollar value in relation to sales.\nWe continue to drive automation of our supply chain by collaborating with our suppliers, logistics partners and distributors to improve optimization with information visibility and other technological advances. These and other terms of Darden Direct’s long-term supply agreements further enable our sourcing staff to integrate demand forecasts into our purchasing operations, driving efficiencies in our operations.\nIntegrated Marketing\nOur restaurants appeal to a broad spectrum of consumers. To further strengthen our brands, we focus on highlighting what makes each one unique.  Accordingly, our brands evaluate each marketing activity through three filters. The first filter involves elevating brand equity by bringing each brand’s competitive advantages to life. The second filter is simple execution, allowing our teams to deliver consistently memorable guest experiences. And finally, it will not be at a deep discount. We are focused on providing great value to our guests but doing so in a way that drives profitable sales growth.\nIntegrated marketing is key to bringing our brands to life, and our scale enables us to be a leading advertiser in the full-service dining segment of the restaurant industry. Olive Garden leverages the efficiency of national advertising, on both traditional and streaming television, supplemented with targeted digital media investments. LongHorn Steakhouse, Cheddar’s Scratch Kitchen, Yard House, Ruth’s Chris Steak House, The Capital Grille, Chuy’s, Seasons 52, Eddie V’s and Bahama Breeze also use digital marketing to build engagement and loyalty. \nIn fiscal 2025, we continued a multi-year effort to implement new technology platforms that allow us to digitally engage with our guests and team members and strengthen our marketing and analytics capabilities. We also continued making improvements to our online and mobile ordering and payment systems across all our brands. In addition, we continued working on developing sophisticated customer relationship management programs, data analytics and data-driven marketing approaches to effectively and efficiently target our existing and potential guests across our portfolio of brands. This enables us to tailor our messaging and offerings depending on guest visit history, preferences and brand loyalty. Finally, we have developed and consistently use sophisticated consumer marketing research to monitor guest satisfaction and evolving trends and marketplace dynamics.\nHuman Capital\nWe prioritize our team members through our People Strategy that includes four strategic imperatives:\n•\nHire - Attract and select diverse team members that reflect our values and are committed to our results-oriented culture;\n•\nTrain - Teach team members to perform in today’s environment and develop the skills to meet tomorrow’s needs;\n•\nReward - Invest in compelling programs that recognize team members when goals are achieved and further motivate our culture of winning; and \n•\nRetain - Keep team members engaged and motivated, ready to deliver results and grow their careers.\nWe closely track and assess a variety of metrics that help us evaluate our performance on each of these imperatives.\nHire.\n \nWe are committed to attracting, engaging, developing and retaining a workforce that mirrors the diversity of our guests and the communities in which we operate.\n \nWe track a variety of workforce statistics to help us understand the gender, racial and ethnic diversity of our team members.\n \nKey team member statistics as of the end of fiscal 2025 included the following:\nTotal team members (hourly and salaried)\n197,924\nTotal number of hourly team members\n186,993\nPercent of hourly team members – female\n58%\nPercent of hourly team members – members of racial or ethnic minority groups\n57%\nTotal number of new hires of hourly team members during fiscal 2025\n139,210\n8\nPercent of hourly new hires – female\n57%\nPercent of hourly new hires – members of racial or ethnic minority groups\n56%\nIn addition to the gender, racial and ethnic diversity of our workforce, our team members are also very diverse in age; we employ members of five generations of the United States population:  Traditionalists, Baby Boomers, Generation X, Millennials and Centennials.\n \nWe provide our EEO-1 report on our website at www.darden.com.\nTrain.\n \nWe succeed because of our people, and with our success come rewards, recognition and great opportunities for our team members.\n \nWe regularly invest in our team members’ careers by providing the tools they need to succeed in their current roles, to grow personally and professionally, and to deliver exceptional experiences to our guests each day.\n \nWith thousands of leadership positions across our restaurants, we provide a pathway and training for thousands of individuals across the country to advance from entry-level jobs into management roles.\n \nIn fiscal 2025, 61% of the participants in our restaurant Manager In Training program were internal promotions, and 99% of the new General Managers or Managing Partners were internal promotions.\nReward.\n \nWe believe that we provide working conditions and pay and benefits that compare favorably with those of our competitors.  Most team members, other than restaurant management and corporate management, are paid on an hourly basis.\n \nWe offer our team members flexible work schedules and competitive pay and benefits, including paid sick leave and access to free counseling through our employee assistance program for team members and their families.\nWe regularly review our pay and benefits programs to identify and implement enhancements to the ways we reward our team members.\n \nSince fiscal 2022, we have maintained a policy that each hourly restaurant team member company-wide would earn a minimum hourly wage of at least $12 per hour, inclusive of tip income.  For fiscal 2025, across all of our brands, our hourly team members earned, on average, $24 per hour, inclusive of tip income, far exceeding that minimum wage. Since fiscal 2018, we have significantly increased the percentage of medical premium contributions we make on behalf of our team members. In fiscal 2025, we subsidized 75-81% (depending on the plan and tier selected) of the premiums for our team members, representing a 17-28% increase in the percentage of medical premiums we contributed as compared to fiscal 2018. In fiscal 2025, we invested approximately $12 million to continue to maintain competitive premiums for our team members.   \nFurther, in fiscal 2025, the Darden Restaurants Foundation continued the Next Course Scholarship program for children and dependents of our team members that launched during fiscal 2023.\n \nIn its third year, the program awarded scholarships worth $3,000 each to 98 children or dependents of Darden team members.\n \nIn January 2023, we introduced a new benefit for restaurant team members called Fast Fluency. For many of our team members, English is not their first language, and this program provides the opportunity to learn English for free. \nNone of our team members are covered by a collective bargaining agreement.\n \nWe consider our team member relations to be good.\n \nWe conduct engagement surveys with hourly team members and management twice a year through Gallup, and Darden’s overall engagement is well above the average for both U.S. and international companies as measured by Gallup.\nConsistent with our core values of respect, caring and teamwork, in fiscal 1999, we established a program called Darden Dimes to help fellow Darden team members in need.\n \nDarden Dimes provides short-term financial grants to team members experiencing financial need caused by unexpected emergencies or catastrophic natural disasters. Participating team members donate as little as 10 cents from each paycheck to the Darden Dimes fund, which raised over $2.6 million and granted $2.8 million in fiscal 2025.\nRetain.\n \nAs a full-service restaurant company, food is always top of mind, but our team members make the difference: they are at the heart of everything we do.\n \nWe believe the guest experience can never exceed the team member experience, so we strive to hire the best individuals and retain them by fostering an environment of respect and inclusion, where diversity of thought and background is valued and everyone has the opportunity to develop and grow their careers.\n \nIn addition, our geographic footprint often puts us in a position to offer our restaurant team members jobs in their current roles when personal circumstances require relocation.\nDarden’s consolidated turnover rate for hourly team members during fiscal 2025 was 67%, one of the lowest rates in the restaurant industry. Each of our brands experienced a turnover rate during fiscal 2025 that was lower than the most recent relevant \n9\ncasual dining or fine dining turnover rate for their segment of the industry as reported in The People Report\nTM \nby Black Box Intelligence\nTM\n.\n \nDarden’s consolidated restaurant management turnover rate of 16% was also significantly lower than the broader restaurant industry benchmark.\n \nOur executive leadership (vice president and above) has an average of over 20 years of experience with Darden, while our restaurant General Managers and Managing Partners have an average of 15 years of experience with us.\nInformation Technology and Cybersecurity\nWe strive for leadership in the restaurant business by using technology as a competitive advantage and as an enabler of our strategy. We have implemented technology-enabled business solutions to improve financial control, cost management, guest service and employee effectiveness, as well as enable e-commerce. These solutions are designed to be used across restaurant brands, yet are flexible enough to meet the unique needs of each restaurant brand.  Our strategy is to fully integrate systems to drive operational efficiencies and enable restaurant teams to focus on restaurant operations excellence. Restaurant hardware and software support for our restaurant brands is provided or coordinated from our restaurant support center facility in Orlando, Florida. Our data center contains sufficient computing power to process information from restaurants quickly and efficiently.  We leverage public cloud computing where appropriate to enhance our capabilities and to leverage scale.  Our information is processed in a secure environment to protect both our data and the physical computing assets. We guard against business interruption by maintaining a disaster recovery plan, which includes storing critical business information off-site, testing the disaster recovery plan annually and providing on-site power backup. We periodically engage third parties to perform cybersecurity audits utilizing the National Institute of Standards and Technology Cybersecurity Framework. We also engage third parties to conduct security reviews of our network, processes and systems on a regular basis.  We use internally developed proprietary software, cloud-based software as a service (SaaS), as well as purchased software, with proven, non-proprietary hardware.\nOur brands share a secure, robust digital platform with online ordering and other guest-facing capabilities. We also have deployed mobile applications with online ordering and other features for most of our casual dining brands and specialty restaurant brands. We successfully leverage these digital capabilities to address evolving guest needs. We will continue to invest in these platforms and applications to enhance the guest experience.  \nWe maintain a robust system of data protection and cybersecurity resources, technology and processes. We regularly evaluate new and emerging risks and ever-changing legal and compliance requirements. We make strategic investments to address these risks, including maintaining insurance coverage to mitigate the potential financial consequences of cybersecurity incidents, and compliance requirements to keep Company, guest and team member data secure. We monitor risks of sensitive information compromise at our business partners where relevant and reevaluate these risks on a periodic basis. We also perform annual and ongoing cybersecurity awareness training for our restaurant management and restaurant support center team members. In addition, we provide annual credit card handling training following Payment Card Industry (PCI) guidelines to team members who handle guest credit cards.\nOur management believes that our current systems and practice of implementing regular updates position us well to support current needs and future growth. We use a strategic information systems multi-year planning process that involves senior management and is integrated into our overall business planning. We provide data protection and cybersecurity reports to the Audit Committee of the Company’s Board of Directors on a quarterly basis, which has oversight of risks related to cybersecurity threats.  These reports are also provided periodically to the full Board of Directors. Information systems projects are prioritized based upon strategic, financial, regulatory, risk and other business advantage criteria.\nCompetition\nThe restaurant industry is intensely competitive with respect to the type and quality of food, price, service, restaurant location, personnel, brand, attractiveness of facilities, availability of carryout and home delivery, internet and mobile ordering capabilities and effectiveness of advertising and marketing. The restaurant business is often affected by changes in consumer tastes; national, regional or local economic conditions; demographic trends; traffic patterns; the type, number and location of competing restaurants; and consumers’ discretionary purchasing power. We compete within each market with national and regional chains and locally-owned restaurants for guests, management and hourly personnel and suitable real estate sites. In addition, expanding product offerings at fast casual and quick-service restaurants and the convenience of home delivery services, together with negative economic conditions, could cause consumers to choose less expensive alternatives or reduce the frequency of their restaurant visits. We expect intense competition to continue in all of these areas.\n10\nOther factors pertaining to our competitive position in the industry are addressed under the sections entitled “Sourcing and Distribution,” “Integrated Marketing” and “Information Technology and Cybersecurity” in this Item 1 and in our Risk Factors in",
    "item1a": "Item 1A of this Form 10-K.\nGovernance\nOur Board of Directors has ultimate risk oversight responsibility for the Company and administers this responsibility both directly and with assistance from its committees.\n \nEach of the committees periodically reports to the Board of Directors on its specific risk oversight activities. \nThe Audit Committee, comprised solely of independent directors, oversees our overall ERM program and assists the Board of Directors in fulfilling its oversight responsibility with respect to our information security and technology risks (including cybersecurity), all of which are fully integrated into our ERM program.\n \nThe Audit Committee actively reviews and discusses our information security and technology risk management programs and regularly reports out to the full Board of Directors on our relevant strengths and opportunities.\n \nOur cybersecurity program is led by our \nChief Information Officer (CIO)\n, who is responsible for identifying, assessing and managing our collective information security and technology risks.\n \nOur current CIO has served in that role since 2016 and has more than 20 years of experience in the information security and technology fields. Our CIO holds both bachelor’s and master’s degrees in Electrical Engineering from the Massachusetts Institute of Technology.\n \nThe CIO meets regularly with leaders of our various information technology management teams to review and discuss our cybersecurity and other information technology risks and opportunities.\n \nOur global incident response plan sets forth a detailed security incident management and reporting protocol, with escalation timelines and responsibilities. \n26\nThe \nAudit Committee\n receives periodic updates from the CIO, the director of our cybersecurity team and a senior attorney, the three most senior leaders with responsibility for oversight of our key cybersecurity program components.\n \nThese updates include matters such as ongoing changes in our external and internal cybersecurity threat landscape, new technology trends and regulatory developments, evolving internal policies and practices used to manage and mitigate cybersecurity and technology-related risks, and trends in various metrics that are used to help assess our overall cybersecurity program effectiveness.\n \nOur CIO also provides updates to the full Board of Directors on such topics at least annually.",
    "item1b": "Item 1B.  UNRESOLVED STAFF COMMENTS\nNone.",
    "item1c": "Item 1C.  Cybersecurity\nRisk Management and Strategy\nWe have implemented policies and procedures intended to manage and reduce cybersecurity risk that are \nintegrated with the Enterprise Risk Management (“ERM”) framework\n utilized by management and the Audit Committee to oversee our various top enterprise risks.\n We maintain an incident response plan that is designed to protect against, identify, evaluate, respond to and recover from a cybersecurity related incident. The plan provides for the creation of an incident response team in the event of an incident and it is designed to be flexible enough to accommodate a broad array of potential scenarios. The incident response team is a cross-functional group that may be composed of both Company personnel and external service providers, and that is tailored to a particular incident so that individuals with appropriate experience and expertise are available. We conduct regular exercises to help ensure the plan’s effectiveness and our overall response preparedness.\n25\nWe have also invested in various tools to protect our data and information technology. We maintain a robust system of data protection and cybersecurity resources, technology and processes, and we regularly evaluate new and emerging risks and ever-changing legal and compliance requirements. We make ongoing strategic investments to address these risks, including maintaining insurance coverage to mitigate the potential financial consequences of cybersecurity incidents, and compliance requirements and help keep Company, guest and team member data secure. We monitor risks of sensitive information compromise at our business partners, where relevant, and reevaluate these risks on a periodic basis. In addition, we have a cybersecurity training program designed to educate and train employees how to identify and report cybersecurity threats. Training programs are conducted on a periodic\n \nbasis and are focused on giving employees the awareness and tools to manage the most relevant and prevalent cybersecurity risks to us. We also provide specialized training for employees in more sensitive roles.\n \nFor example, we perform annual and ongoing cybersecurity awareness training for our restaurant management and restaurant support center team members. In addition, we provide annual credit card handling training following Payment Card Industry (PCI) guidelines to all team members that handle guest credit cards. We conduct regular drills, such as tabletop exercises led by third party consultants, to support our overall preparedness for a variety of scenarios. \nWe take measures to regularly update and improve our cybersecurity program, including conducting independent program assessments, penetration testing and scanning of our systems for vulnerabilities. \nWe periodically engage third parties to perform cybersecurity audits to measure the maturity of our cybersecurity program against the National Institute of Standards and Technology (NIST) Framework. We also engage third parties to conduct security reviews of our network, processes and systems on a regular basis to identify opportunities and enhancements to strengthen our policies and practices.\n \nWith respect to third-party service providers, our information security program includes conducting due diligence of relevant service providers’ information security programs prior to onboarding and we continue to reassess vendors using a risk-based approach. We also contractually require third-party service providers with access to our information technology systems, sensitive business data or personal information to implement and maintain appropriate security controls and contractually restrict their ability to use our data, including personal information, for purposes other than to provide services to us, except as required by law. To oversee the risks associated with these service providers, we work with them to help ensure that their cybersecurity protocols are appropriate to the risk presented by their access to or use of our systems and/or data, including notification and coordination concerning incidents occurring on third-party systems that may affect us.\n Our service providers are contractually required to notify us promptly of information security incidents occurring on their systems that may affect our systems or data, including personal information.\nAlthough we have invested in the protection of our data and information technology and monitor our systems on an ongoing basis, there can be no assurance that such efforts will prevent material compromises to our information technology systems in the future that could have a material adverse effect on our business.  \nAs of the date of this filing, we are not aware of any current cybersecurity threats or incidents that have materially affected or are reasonably likely to materially affect our business, results of operations or financial condition.\n For further discussion of the risks related to cybersecurity, see the risk factors discussed under “Risks Relating to Information Technology, Cybersecurity and Privacy” in our Risk Factors in"
  }
}