{
  "ticker": "DVA",
  "cik": "0000927066",
  "company_name": "DAVITA INC.",
  "filing_date": "2025-02-13",
  "accession": "0000927066-25-000012",
  "primary_doc": "dva-20241231.htm",
  "item_sections": {
    "item1": "Item 16.\nForm 10-K Summary\n83\nExhibit Index\n1 of 4\nSignatures\nS-1\nPART I\n Item 1.        Business\nUnless otherwise indicated in this report \"DaVita\", \"the Company\" \"we\", \"us\", \"our\" and other similar terms refer to DaVita Inc. and its consolidated subsidiaries. Our annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments to those reports filed or furnished pursuant to section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended, are made available free of charge through our website, located at \nhttp://www.davita.com\n, as soon as reasonably practicable after the reports are filed with or furnished to the Securities and Exchange Commission (SEC). The SEC also maintains a website at \nhttp://www.sec.gov\n where these reports and other information about us can be obtained. The contents of our website are not incorporated by reference into this report.\nOverview of DaVita Inc.\nDaVita is a leading healthcare provider focused on transforming care delivery to improve quality of life for patients globally. As a comprehensive kidney care provider, we have been a leader in clinical quality and innovation for 25 years. We care for patients at every stage and setting along their kidney health journey\n–\nfrom earlier diagnosis and prevention through supporting the transplant process. This includes ensuring they are supported at home, in our dialysis centers, in the hospital and/or skilled nursing facilities. In our unwavering pursuit of a healthier tomorrow, we strive to reimagine what high quality care looks like: more preventative, better integrated, improved outcomes at the lowest total cost, and personalized at scale to deliver a better tomorrow regardless of location, insurance status or other factors. Our caring culture fuels our continuous drive toward achieving our mission to be the provider, partner and employer of choice.\nDefining chronic kidney disease \nThere are five stages of chronic kidney disease (CKD). These stages are generally based on how well the kidneys work to filter waste and extra fluid out of the blood–with higher stages of CKD corresponding to progressing levels of kidney disease. Stage 1 CKD is the closest to healthy kidney function. Stage 5 CKD indicates that a patient has severe kidney damage.\nA patient diagnosed with Stage 5 CKD has kidneys that have lost nearly all functionality or have failed. If an individual's kidneys fail, the person is then diagnosed with end stage renal disease (ESRD), also known as end stage kidney disease (ESKD). Because kidney function is essential for survival and the loss of kidney function is normally irreversible, ESKD patients require continued dialysis treatments or a kidney transplant to sustain life. Dialysis is the removal of toxins, fluids and salt from the blood of patients by artificial means. Patients suffering from ESKD generally require regular life-sustaining dialysis therapy for the rest of their lives or until they receive a kidney transplant. \nThe treatment goal for CKD patients prior to Stage 5 is to manage and slow the progression of the disease to preserve kidney functionality. Because kidney failure is typically caused by one or more comorbidities such as Type I and Type II diabetes, hypertension, polycystic kidney disease, long-term autoimmune attack on the kidneys or prolonged urinary tract obstruction, slowing the progression generally involves working with nephrologists and dieticians to help control blood pressure, monitor blood glucose and maintain healthy diet and exercise routines, among other things. If the kidney disease continues to progress, the goal is to support efforts for kidney transplantation where available and medically appropriate, and in the event transplantation is not possible, to work with the patient and his or her nephrologist to safely transition the patient to the dialysis treatment and modality of their choice.\nOur businesses\nWe are a leading dialysis provider in the United States. Our U.S. dialysis and related lab services (U.S. dialysis) business treats patients with chronic kidney failure, ESKD, in the United States, and is our largest line of business. Our robust platform to deliver kidney care services also includes established nephrology and payor relationships. \nIn addition, as of December 31, 2024, our international operations provided dialysis and administrative services to a total of 509 outpatient dialysis centers located in 13 countries outside of the U.S., serving approximately 80,300 patients.\nFinally, our U.S. integrated kidney care (IKC) business provided integrated care and disease management services to 70,400 patients in risk-based integrated care arrangements and to an additional 11,600 patients in other integrated care arrangements across the United States as of December 31, 2024.\nWe also maintain a few other ancillary services and investments outside of our U.S. dialysis, U.S. IKC, or international operations, which we refer to as our U.S. other ancillary services. We refer to our U.S. integrated kidney care business, U.S. other ancillary services and international operations as, collectively, our \"ancillary services.\" We also have a separate corporate \n2\nadministrative support function that supports our U.S. dialysis business and these ancillary services\n. Each of our businesses are described in greater detail in the sections that follow.\nOur care model\nOur patient-centric care model leverages our platform of kidney care services to maximize patient choice in both models and modalities of care. We believe that the flexibility we offer coupled with a focus on comprehensive kidney care supports our commitments to help improve equitable clinical outcomes and quality of life for our patients. According to the most recently published data, for the ten most recently reported years, we have continued as an industry leader in the Centers for Medicare & Medicaid Services’ (CMS) Quality Incentive Program (QIP), which promotes high quality services in outpatient dialysis facilities treating patients with ESKD. In addition, according to the most recently published data, for the nine most recently reported years, we have also continued as an industry leader under CMS’ Five-Star Quality Rating System (Star Rating), which rates eligible dialysis centers based on the quality of outcomes to help patients, their families, and caregivers make more informed decisions about where patients receive care. Following a pause in refreshed Star Ratings in October 2020 and October 2021 due to the COVID-19 pandemic, CMS reset the baseline with the October 2023 Star Rating release to reflect current performance and provide clinical differentiation through newly defined cutoff values. Under the new baseline, the lowest scoring 10% of facilities receive one star, the next 20% receive two stars, the next 40% receive three stars, the next 20% receive four stars and the highest 10% of facilities receive five stars in the baseline period for each subsequent evaluation period.\nOur clinical outcomes are driven by our experienced and knowledgeable caregivers. We employ registered nurses, licensed practical or vocational nurses, patient care technicians, social workers, registered dietitians, biomedical technicians and other administrative and support teammates who strive to achieve superior clinical outcomes at our dialysis facilities. In addition to our teammates at our dialysis facilities, as of December 31, 2024, our domestic Chief Medical Officer leads a team of 23 nephrologists in our physician leadership team as part of our domestic Office of the Chief Medical Officer (OCMO). Our international Chief Medical Officer leads a team of 11 nephrologists in our physician leadership team as part of our international OCMO as of December 31, 2024. Our OCMO teammates represent a variety of academic, clinical practice, and clinical research backgrounds. We also have a Physician Council that serves as an advisory body to senior management, which was composed of 10 physicians with extensive experience in clinical practice and five Group Medical Directors as of December 31, 2024.\nValue-based care arrangements continue to impact the kidney health space. These arrangements are fostering a much larger degree of \ncollaboration\n between nephrologists and other providers, including transplant programs, resulting in a more complete understanding of each patient’s clinical needs. We believe this more complete understanding allows for better care coordination and earlier intervention, which we believe ultimately leads to improved clinical outcomes, lower overall costs and improved patient experiences. Our IKC business provides comprehensive care management for complex CKD patients nationwide, with payment models that include a variety of structures to advance and encourage integrated and value-based care. Among other arrangements, our IKC business has percent-of-premium arrangements in several Medicare Advantage ESRD Chronic Special Needs Plans and is an active participant in CMMI’s Comprehensive Kidney Care Contracting (CKCC) model that seeks to manage the care of late stage CKD and ESKD patients to delay the progression of kidney disease, promote home dialysis when appropriate, and incentivize transplants. Our IKC business also utilizes other value-based payment methodologies in its care coordination and disease management contracts, which include two-sided shared savings/shared losses and outcomes-based pay-for-performance compensation arrangements.\nU.S. dialysis business\nOur U.S. dialysis business is a leading provider of kidney dialysis services for patients suffering from ESKD. As of December 31, 2024, we provided dialysis, administrative and related laboratory services in the U.S. through a network of 2,657 outpatient dialysis centers in 46 states and the District of Columbia, serving a total of approximately 200,800 patients. We also have contracts to provide hospital inpatient dialysis services in approximately 760 hospitals throughout the U.S. \nBased on the most recent 2024 annual data report from the United States Renal Data System (USRDS), there were over 554,000 ESKD dialysis patients in the U.S. in 2022. The underlying ESKD dialysis patient population grew at an approximate compound annual rate of 3.3% from 2012 to 2022 and 3.4% from 2017 to 2022 as compared to a decline in annual growth of 0.4% from 2021 to 2022. Despite this near term slowdown, which, among other things, included impacts from the COVID-19 pandemic on mortality rates amongst the ESKD dialysis patient population, the rate of growth has been relatively consistent over time. In general, a number of factors may impact ESKD growth rates, including, among others, mortality rates for dialysis patients or CKD patients, the growth and aging of the U.S. population, limitations on immigration in the U.S., transplant rates, incidence rates for diseases that cause kidney failure such as diabetes and hypertension, growth rates of minority populations with higher than average incidence rates of ESKD or other changes in demand for dialysis treatments over time, including for \n3\nexample, as a result of the development and application of certain innovative technologies, drugs or other treatments. Certain of these factors, in particular mortality rates for dialysis or CKD patients, have been impacted by the COVID-19 pandemic.\nTreatment options for ESKD\nTreatment options for ESKD are dialysis and kidney transplantation.\nDialysis options\n•\nHemodialysis\nHemodialysis is the most common form of ESKD treatment. The hemodialysis machine uses a filter, called a dialyzer, to remove toxins, fluids and salt from the patient’s blood. The dialysis process occurs across a semi-permeable membrane that divides the dialyzer into two distinct chambers. While blood is circulated through one chamber, a pre-mixed fluid is circulated through the other chamber. The toxins, salt and excess fluids from the blood cross the membrane into the fluid, allowing cleansed blood to return back into the patient’s body. \nHemodialysis is usually performed at a freestanding outpatient dialysis center, at a hospital-based outpatient center, in a skilled nursing facility or at the patient's home. Our freestanding outpatient dialysis centers are staffed with members of our care team and store the supplies necessary for treatment. Treatments are usually performed three times per week.\nHospital inpatient hemodialysis services are required for patients with acute kidney failure primarily resulting from acute medical illness or trauma, patients in early stages of ESKD and ESKD patients who require hospitalization for other reasons. Hospital inpatient hemodialysis is generally performed at the patient’s bedside or in a dedicated treatment room in the hospital, as needed.\nSome ESKD patients may perform hemodialysis with the help of a care partner in their home or residence through the use of a hemodialysis machine designed specifically for home therapy that is portable, smaller and easier to use. This is referred to as home hemodialysis (HHD). Patients receive training, support and monitoring from registered nurses, usually in our outpatient dialysis centers, in connection with their HHD treatment. HHD is typically performed with greater frequency than dialysis treatments performed in outpatient dialysis centers and on varying schedules.\n•\nPeritoneal dialysis\nPeritoneal dialysis uses the patient’s peritoneal or abdominal cavity to eliminate fluid and toxins and is typically performed at home. The most common methods of peritoneal dialysis are continuous ambulatory peritoneal dialysis (CAPD) and continuous cycling peritoneal dialysis (CCPD). Because it does not involve going to an outpatient dialysis center three times a week for treatment, peritoneal dialysis is generally an alternative to hemodialysis for patients who are healthier, more independent and desire more flexibility in their lifestyle. \nCAPD introduces dialysis solution into the patient’s peritoneal cavity through a surgically placed catheter. Toxins in the blood continuously cross the peritoneal membrane into the dialysis solution. After several hours, the patient drains the used dialysis solution and replaces it with fresh solution. This procedure is usually repeated four times per day.\nCCPD is performed in a manner similar to CAPD, but uses a mechanical device to cycle dialysis solution through the patient’s peritoneal cavity while the patient is sleeping or at rest.\n•\nKidney transplantation\nKidney transplantation, when successful, is considered the most desirable form of therapeutic intervention. However, in light of the shortage of suitable donors, side effects of immunosuppressive pharmaceuticals given to transplant recipients and dangers associated with transplant surgery, some patient populations have generally limited the use of this treatment option. In accordance with an executive order signed in July 2019 (the 2019 Executive Order), the U.S. Department of Health and Human Services (HHS) developed policies addressing, among other things, the goal of making more kidneys available for transplant. CMS, through CMMI, also subsequently released the framework for certain proposed and existing voluntary and mandatory payment models, including ESRD Treatment Choices Model (ETC) model, which would adjust payment incentives to encourage kidney transplants. For more information about these payment models, please see the discussion below under the heading \"—\nIntegrated Kidney Care, Medicare and Medicaid program reforms and Other Healthcare Regulations\n.\"\n•\nHemodiafiltration\nHemodiafiltration (HDF) is a form of augmented hemodialysis that includes a component of convection to remove additional molecules from the blood. Like hemodialysis, HDF can be performed at certain freestanding outpatient dialysis \n4\ncenters and may also be performed in hospital in-patient centers. HDF usage varies by country, and the efficacy of this modality is still being assessed in the U.S.\nU.S. dialysis services we provide\nOutpatient hemodialysis services \nThe majority of services we provide to patients are outpatient hemodialysis treatments. As a condition of our enrollment in Medicare for the provision of dialysis services, we contract with a nephrologist or a group of associated nephrologists to provide medical director services at each of our dialysis centers. In addition, other nephrologists may apply for practice privileges to treat their patients at our centers. Each center has an administrator, often a registered nurse, who supervises the day-to-day operations of the center and its staff. The staff of each center typically consists of registered nurses, licensed practical or vocational nurses, patient care technicians, a social worker, a registered dietician, biomedical technician support and other administrative and support personnel.\nThe overall number of patients to whom we provided services in the U.S. in 2024 was relatively flat compared to 2023, primarily due to growth in new admits partially offset by elevated mortality rates, which continue to be elevated relative to our pre-COVID-19 mortality rates.\nHospital inpatient hemodialysis services\nAs of December 31, 2024, we have contracts to provide hospital inpatient dialysis services to patients in approximately 760 hospitals throughout the U.S. We render these services based on a contracted per-treatment fee that is individually negotiated with each hospital. When a hospital requests our services, we typically administer the dialysis treatment at the patient’s bedside or in a dedicated treatment room in the hospital, as needed. \nHome-based dialysis services \nHome-based dialysis services includes HHD and peritoneal dialysis. Many of our outpatient dialysis centers offer certain support services for dialysis patients who prefer and are able to perform either HHD or peritoneal dialysis in their homes. Home-based hemodialysis support services consist of providing equipment and supplies, training, patient monitoring, on-call support services and follow-up assistance. Registered nurses train patients and their families or other caregivers to perform either HHD or peritoneal dialysis. The 2019 Executive Order and related HHS guidance described above also included a stated goal of increasing the relative number of new ESKD patients that receive dialysis at home.\nAccording to the most recent annual data report from the USRDS, in 2022 approximately 14% of ESKD dialysis patients in the U.S. utilized home-based dialysis.\nTreatments and revenues by modality:\nThe following graph summarizes our U.S. dialysis treatments by modality and U.S. dialysis patient service revenues by modality for the year ended December 31, 2024.\nOther\nESKD laboratory services \nWe operate a separately licensed and highly automated clinical laboratory that specializes in ESKD patient testing. This specialized laboratory provides routine laboratory tests for dialysis and other physician-prescribed laboratory tests for ESKD patients. The vast majority of these tests are performed for our ESKD patients throughout the U.S. These tests are performed for \n5\na variety of reasons, including to monitor a patient’s ESKD condition, including the adequacy of dialysis, as well as other medical conditions of the patient. Our laboratory utilizes information systems that provide information to certain members of the dialysis centers’ staff and medical directors regarding critical outcome indicators.\nManagement services \nWe currently operate or provide management and administrative services pursuant to management and administrative services agreements to 52 outpatient dialysis centers located in the U.S. in which we either own a noncontrolling interest or which are wholly-owned by third parties. Management fees are established by contract and are recognized as earned typically based on a percentage of revenues or cash collections generated by the outpatient dialysis centers.\nSources of revenue—concentrations and risks\nOur U.S. dialysis revenues represent approximately 88% of our consolidated revenues for the year ended December 31, 2024. Our U.S. dialysis revenues are derived primarily from our core business of providing dialysis services and related laboratory services and, to a lesser extent, the administration of pharmaceuticals and management fees generated from providing management and administrative services to certain outpatient dialysis centers, as discussed above.\nThe sources of our U.S. dialysis revenues are principally from government-based programs, including Medicare and Medicare Advantage plans, Medicaid and managed Medicaid plans, other government-based programs including our agreement with the Veterans Administration, and commercial insurance plans. The following table summarizes our U.S. dialysis revenues by payor source for U.S. dialysis patient service revenues for the year ended December 31, 2024:\nMedicare and Medicare Advantage plans\n56 \n%\nMedicaid and managed Medicaid plans\n8 \n%\nOther government-based programs\n3 \n%\nTotal government-based programs\n67 \n%\nCommercial (including hospital dialysis services)\n33 \n%\nTotal U.S. dialysis patient service revenues\n100 \n%\nMedicare revenue\nMedicare fee for service\nSince 1972, the federal government has provided healthcare coverage for qualified ESRD patients under the Medicare ESRD program regardless of age or financial circumstances. ESRD is the first and only disease state eligible for Medicare coverage both for dialysis and dialysis-related services and for all benefits available under the Medicare program. \nGovernment dialysis related payment rates in the U.S. are principally determined by federal Medicare and state Medicaid policy. For patients with Medicare coverage, all ESRD payments for dialysis treatments are made under a single bundled payment rate that provides a fixed payment rate to encompass all goods and services provided during the dialysis treatment that are related to the dialysis treatment, including certain pharmaceuticals, such as erythropoiesis-stimulating agents (ESAs), calcimimetics, vitamin D analogs, oral-only renal phosphate binders and iron supplements, irrespective of the level of pharmaceuticals administered to the patient or additional services performed. Most lab services are also included in the bundled payment. \nAlthough Medicare reimbursement limits the allowable charge per treatment, it provides industry participants with a relatively predictable and recurring revenue stream for dialysis services provided to patients without commercial insurance. For the year ended December 31, 2024, approximately 89% of our total U.S. dialysis patients were covered under some form of government-based program, with approximately 74% of our total U.S. dialysis patients covered under Medicare and Medicare Advantage plans. \nUnder this bundled payment rate system, known as the ESRD Prospective Payment System (PPS), the payments to a dialysis facility may be reduced by as much as 2% based on the facility’s performance in specified quality measures set annually by CMS through its QIP. CMS established QIP through the Medicare Improvements for Patients and Providers Act of 2008 to promote high quality services in outpatient dialysis facilities treating patients with ESRD. QIP associates a portion of Medicare reimbursement directly with a facility’s performance on quality of care measures. Reductions in Medicare reimbursement result when a facility’s overall score on applicable measures does not meet established standards.\n6\nUncertainty about future payment rates remains a material risk to our business, as well as the potential implementation of or changes in coverage determinations or other rules or regulations by CMS or Medicare Administrative Contractors that may impact reimbursement. An important provision in the Medicare ESRD statute is an annual adjustment, or market basket update, to the ESRD PPS base rate. Absent action by Congress, the ESRD PPS base rate is updated annually by an inflation adjustment based on historical data and forecasts that may create a lag between these adjustments and actual inflationary increase. As a result, an inflation adjustment may not always cover the actual inflationary increase experienced. Due in part to continued higher than expected inflation rates, the annual update for the 2024 ESRD PPS base rate did not accurately forecast the cost increase experienced by providers. \nIn November 2024, CMS issued a final rule to update the Medicare ESRD PPS payment rate and policies for calendar year 2025. Among other things, the final rule updated both the ESRD and Acute Kidney Injury (AKI) dialysis payment rate for renal dialysis services furnished by ESRD facilities, extended payment for dialysis in a home setting for AKI, and outlined requirements for the ESRD QIP. CMS estimates that the overall impact of the rule will increase ESRD facilities' average reimbursement by a productivity-adjusted market basket increase of 2.2%. On January 1, 2025, phosphate binders, a drug class taken orally by many ESKD patients to reduce absorption of dietary phosphate, were incorporated into the ESRD PPS bundled payment rate. Phosphate binders are not considered accounted for in the ESRD PPS base rate at this time and will be reimbursed through a Transitional Drug Add-on Payment Adjustment (TDAPA). The TDAPA period is expected to continue for a period of at least two years.\nAs a result of the Budget Control Act of 2011 (BCA) and subsequent activity in Congress, a $1.2 trillion sequester (across-the-board spending cuts) in discretionary programs took effect in 2013 reducing Medicare payments (currently by 2%), which was subsequently extended into fiscal year 2032. \nMost ESRD patients receiving dialysis services become eligible for primary Medicare coverage at various times, depending on their age or disability status, as well as whether they are covered by a commercial insurance plan. Generally, for a patient not covered by a commercial insurance plan, Medicare can become the primary payor for qualified ESRD patients receiving dialysis services either immediately or after a three-month waiting period. In most cases, for a patient covered by a commercial insurance plan, Medicare will either become the primary payor after 33 months, which includes the three-month waiting period, or earlier if the patient’s commercial insurance plan coverage terminates or if the patient chooses Medicare over the commercial plan. When Medicare becomes the primary payor, the payment rates we receive for that patient shift from the commercial insurance plan rates to Medicare payment rates, which are on average significantly lower than commercial insurance rates.\nMedicare pays 80% of the amount set by the Medicare system for each covered dialysis treatment. The patient is responsible for the remaining 20%. In many cases, a secondary payor, such as Medicare supplemental insurance, a state Medicaid program or a commercial health plan, covers all or part of these balances. If a patient does not have secondary insurance coverage, we are generally unsuccessful in our efforts to collect from the patient the remaining 20% portion of the ESRD composite rate that Medicare does not pay. In those instances, however, we are able to recover some portion of this unpaid patient balance from Medicare through an established cost reporting process by identifying these Medicare bad debts on each center’s Medicare cost report. For additional detail on the associated risks, see the risk factor in Part I",
    "item1a": "Item 1A. \"\nRisk Factors\n,\" and are also subject to additional risks, regulations and laws specific to the nature of the particular strategic initiative. We have added, and expect to continue to add additional service offerings to our business and pursue additional strategic initiatives in the future as circumstances warrant, which could include healthcare products or services not directly related to dialysis. Many of these initiatives require or would require investments of both management and financial resources and can generate significant losses for a substantial period of time and may not become profitable in the expected timeframe or at all. There can be no assurance that any such strategic initiative will ultimately be successful. Any significant change in market conditions or business performance, including, without limitation, as a result of the political, legislative or regulatory environment, may impact the performance or economic viability of any of these strategic initiatives. \nIf any of our U.S. integrated kidney care, U.S. other ancillary services or international operations are unsuccessful, it may have a negative impact on our business, results of operations, financial condition and cash flows, and if we determine to exit that line of business we may incur significant termination costs. For discussion of risks and potential impacts specific to our \n44\nintegrated kidney care business and related growth strategy, see the risk factor under the heading \"\nIf we are not able to successfully implement our strategy with respect to our integrated kidney care and value-based care initiatives...\" \nIn addition, we may incur material write-offs or impairments of our investments, including, without limitation, goodwill or other assets, in one or more of our U.S. integrated kidney care, U.S. other ancillary services or international operations. In that regard, we have taken, and may in the future take, impairment and restructuring charges in addition to those described above related to our U.S. integrated kidney care, U.S. other ancillary services and international operations.\nExpansion of our operations to and offering our services in markets outside of the U.S., and utilizing third-party suppliers and service providers operating outside of the U.S., subjects us to political, economic, legal, operational and other risks that could have a material adverse effect on our business, results of operations, financial condition, cash flows and reputation.\nWe are continuing to expand our operations by offering our services and entering new lines of business in certain markets outside of the U.S., and we have increased our utilization of third-party suppliers and service providers operating outside of the U.S., which increases our exposure to the inherent risks of doing business in international markets. Depending on the market, these risks include those relating to:\n•\nchanges in the local economic environment including, among other things, labor cost increases and other general inflationary pressures;\n•\npolitical instability, armed conflicts or terrorism;\n•\npublic health crises, such as pandemics or epidemics;\n•\nsocial changes;\n•\nintellectual property legal protections and remedies;\n•\ntrade regulations;\n•\nprocedures and actions affecting approval, production, pricing, reimbursement and marketing of products and services;\n•\nforeign currency and applicable exchange rates;\n•\nadditional U.S. and foreign taxes;\n•\nexport controls;\n•\nantitrust and competition laws and regulations;\n•\nlack of reliable legal systems which may affect our ability to enforce contractual rights;\n•\nchanges in local laws or regulations, or interpretation or enforcement thereof;\n•\npotentially longer ramp-up times for starting up new operations and for payment and collection cycles;\n•\nfinancial and operational, and information technology systems integration;\n•\nfailure to comply with U.S. laws, such as the FCPA, or local laws that prohibit us, our partners, or our partners' or our agents or intermediaries from making improper payments to foreign officials or any third party for the purpose of obtaining or retaining business; \n•\nlaws, regulations or other guidance that require enhanced disclosures and due diligence surrounding the impacts of our Company and value chain on, and the financial risks and opportunities for our Company from, ESG or other similar sustainability or corporate responsibility matters, as well as enhanced policies, processes and controls designed to appropriately monitor and track such information and enhanced actions to address our Company's impact on these matters; and\n•\ndata and privacy restrictions, among other things.\nIssues relating to the failure to comply with applicable non-U.S. laws, requirements or restrictions may also impact our domestic business and/or raise scrutiny on our domestic practices.\n45\nAdditionally, some factors that will be critical to the success of our international business and operations will be different than those affecting our domestic business and operations. For example, conducting international operations requires us to devote significant management resources to implement our controls and systems in new markets, to comply with local laws and regulations, including to fulfill financial reporting and records retention requirements among other things, and to overcome the numerous new challenges inherent in managing international operations, including, without limitation, challenges based on differing languages and cultures, challenges related to establishing clinical operations in differing regulatory and compliance environments, and challenges related to the timely hiring, integration and retention of a sufficient number of skilled personnel to carry out operations in an environment with which we are not familiar.\nAny expansion of our international operations through acquisitions or through organic growth could increase these risks. Additionally, while we may invest material amounts of capital and incur significant costs in connection with the growth and development of our international operations, including to start up or acquire new operations, we may not be able to operate them profitably on the anticipated timeline, or at all.\nThese risks could have a material adverse effect on our business, results of operations, financial condition and cash flows and could materially harm our reputation.\nFailing to effectively maintain, operate or upgrade our information systems or those of third-party service providers upon which we rely, including, without limitation, our clinical, billing and collections systems, or failure to adhere to federal and state data sharing and access requirements and regulations could materially adversely affect our business, results of operations, financial condition, cash flows and reputation.\nOur business depends significantly on effective information systems. Our information systems require an ongoing commitment of significant resources to maintain, upgrade and enhance existing systems and develop or contract for new systems in order to keep pace with continuing changes in information processing technology, emerging cybersecurity risks and threats, evolving industry, legal and regulatory standards and requirements, new models of care, and other changes in our business, among other things. For example, the provisions related to data interoperability, information blocking, and patient access in the Cures Act and No Surprises Act include, among other things, changes to the Office of the National Coordinator for Health Information Technology’s (ONC's) Health IT Certification Program and requirements that CMS-regulated payors make relevant claims/care data and provider directory information available through standardized patient access and provider directory application programming interfaces (APIs) that connect to provider electronic health records. We have made and expect to continue to make significant investments in updating and integrating our clinical IT systems and continuing to build our data interoperability capabilities. Any failure to adequately comply with these and other provisions related to data interoperability, information blocking, and patient access may, among other things, result in fines and sanctions, adversely impact our Medicare business, our ability to scale our integrated care business and our ability to compete with certain smaller and/or non-traditional providers taking advantage of an asymmetrical environment with respect to data and/or regulatory requirements given our status as an ESRD service provider; or otherwise have a material adverse effect on our business, financial condition, results of operations and cash flows. Rulemaking in these areas is ongoing, and there can be no assurances that the implementation of planned enhancements to our systems, such as our implementation of these data interoperability provisions or our other ongoing efforts to upgrade and better integrate our clinical systems, will be successful once the regulatory environment settles or that we will ultimately realize anticipated benefits from investments in new or existing information systems. In addition, we may from time to time obtain significant portions of our systems-related support, technology or other services from third parties, which may make our operations vulnerable if such third parties fail to perform adequately.\nFailure to successfully implement, operate and maintain effective and efficient information systems with adequate technological capabilities, deficiencies or defects in the systems and related technology, or our failure to efficiently and effectively implement ongoing system upgrades or consolidate our information systems to eliminate redundant or obsolete applications, could result in increased legal and compliance risks and competitive disadvantages, among other things, which could have a material adverse effect on our business, financial condition, results of operations and reputation. For additional information on the risks we face in a highly competitive market, see the risk factor under the heading, \n\"If we are unable to compete successfully...\" \nIf the information we rely upon to run our business was found to be inaccurate or unreliable or if we or third parties on which we rely fail to adequately maintain information systems and data integrity effectively, whether due to software deficiencies, human coding or implementation error or otherwise, we could experience difficulty meeting clinical outcome goals, face regulatory problems, including sanctions and penalties, incur increases in operating expenses or suffer other adverse consequences, any of which could be material. Moreover, failure to adequately protect and maintain the integrity of our information systems (including our networks) and data, or information systems and data hosted by third parties upon which we rely, could subject us to severe consequences as described in the risk factor under the heading \n\"Privacy and information security laws are complex...\"\n46\nOur billing systems, among others, are critical to our billing operations. This includes our systems for our dialysis clinics as well as our systems for our hospital services and our ancillary businesses, including our international business. If there are defects in our billing systems, or billing systems or services of third parties upon which we rely, we may experience difficulties in our ability to successfully bill and collect for services rendered, including, without limitation, a delay in collections, a reduction in the amounts collected, increased risk of retractions from and refunds to commercial and government payors, an increase in our provision for uncollectible accounts receivable and noncompliance with reimbursement laws and related requirements, any or all of which could materially adversely affect our results of operations.\nIn the clinical environment, a failure of our clinical systems, or the systems of our third-party service providers, to operate effectively could have a material adverse effect on our business, the clinical care provided to patients, results of operations, financial condition and cash flows. For example, in connection with claims for which at least part of the government's payments to us is based on clinical performance or patient outcomes or co-morbidities, if relevant clinical systems fail to accurately capture the data we report to CMS or we otherwise have data integrity issues with respect to the reported information, this could impact our payments from government payors.\nAdditionally, we expect the highly competitive environment in which we operate to become increasingly more competitive as the market evolves and new technologies are introduced. This dynamic environment requires continuous investment in new technologies and clinical applications. Machine learning and artificial intelligence are increasingly driving innovations in technology, and parts of our operations may employ new technology and analytics, including artificial intelligence. If these rapidly evolving technologies or applications fail to operate as anticipated or do not perform as specified, including due to potential design defects and defects in the development of algorithms or other technologies, human error or otherwise, our clinical operations, business and reputation may be harmed. If we are unable to successfully maintain, enhance or operate our information systems, including through the implementation of such technologies or applications in our clinical operations and laboratory, or if we are unable to successfully implement adequate governance structures to manage these new technologies, we may be, among other things, unable to efficiently adapt to evolving laws and requirements, unable to remain competitive with others who successfully implement and advance this technology, subject to increased risk under existing laws, regulations and requirements that apply to our business, and our patients' safety may be adversely impacted, any of which could have a material adverse impact on our business, results of operations and financial condition and could materially harm our reputation. For additional detail, see the discussion in the risk factor under the heading \n\"Our business is subject to a complex set of governmental laws, regulations and other requirements...\"\nWe may engage in acquisitions, mergers, joint ventures, noncontrolling interest investments, or dispositions, which may materially affect our results of operations, debt-to-capital ratio, capital expenditures or other aspects of our business, and, under certain circumstances, could have a material adverse effect on our business, results of operations, financial condition and cash flows and could materially harm our reputation.\nOur business strategy includes growth through acquisitions of dialysis centers and other businesses, as well as through entry into joint ventures. We may engage in acquisitions, mergers, joint ventures or dispositions or expand into new business lines or models, which may affect our results of operations, debt-to-capital ratio, capital expenditures or other aspects of our business. See the discussion under \"\nOff-balance sheet arrangements and aggregate contractual obligations\n\" in Part II Item 7. \"\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\n.\"\nThere can be no assurance that we will be able to identify suitable acquisition or joint venture targets or merger partners or buyers for dispositions or that, if identified, we will be able to agree to acceptable terms or on the desired timetable. There can also be no assurance that we will be successful in completing any acquisitions, joint ventures, mergers or dispositions that we announce, executing new business lines or models or integrating any acquired business into our overall operations. There is no guarantee that we will be able to operate acquired businesses successfully as stand-alone businesses, or that any such acquired business will operate profitably or will not otherwise have a material adverse effect on our business, results of operations, financial condition and cash flows or materially harm our reputation. In addition, acquisition, merger or joint venture activity conducted as part of our overall growth strategy is subject to antitrust and competition laws, and antitrust regulators can investigate future (or pending) and consummated transactions. These laws could impact our ability to pursue these transactions or our ability to consummate them on a timely basis; could require us to devote additional resources to potential transactions; and under certain circumstances, could result in mandated divestitures, among other things. If a proposed transaction or series of transactions is subject to challenge under antitrust or competition laws, we may incur substantial legal costs, management’s attention and resources may be diverted, and if we are found to have violated these or other related laws, regulations or requirements, we could suffer severe consequences that could have a material adverse effect on our business, results of operations, financial condition and cash flows and could materially harm our reputation and stock price. For additional detail, see the risk factor under the heading \"\nOur business is subject to a complex set of governmental laws, regulations and other requirements...\"\n Further, we cannot be certain that key talented individuals at the business being acquired will continue to work for us after the acquisition or that they will be able to continue to successfully manage or have adequate \n47\nresources to successfully operate any acquired business. In addition, certain of our acquired dialysis centers and facilities have been in service for many years, which may result in a higher level of maintenance costs. Further, our facilities, equipment and information technology may need to be improved or renovated to maintain or increase operational efficiency, compete for patients and medical directors, or meet changing regulatory requirements. Increases in maintenance costs and/or capital expenditures could have, under certain circumstances, a material adverse effect on our business, results of operations, financial condition and cash flows.\nBusinesses we acquire may have unknown or contingent liabilities or liabilities that are in excess of the amounts that we originally estimated, and may have other issues, including, without limitation, those related to internal control over financial reporting or issues that could affect our ability to comply with healthcare laws and regulations and other laws applicable to our expanded business, which could harm our reputation. As a result, we cannot make any assurances that the acquisitions we consummate will be successful. Although we generally seek indemnification from the sellers of businesses we acquire for matters that are not properly disclosed to us, we are not always successful. In addition, even in cases where we are able to obtain indemnification, we may discover liabilities greater than the contractual limits, the amounts held in escrow for our benefit (if any), or the financial resources of the indemnifying party. In the event that we are responsible for liabilities substantially in excess of any amounts recovered through rights to indemnification or alternative remedies that might be available to us, or any applicable insurance, we could suffer severe consequences that would have a material adverse effect on our business, results of operations, financial condition and cash flows and could materially harm our reputation.\nIn addition, under the terms of the equity purchase agreement for the DaVita Medical Group (DMG) sale (the DMG sale agreement), we agreed to certain indemnification obligations, including claims for taxes or for which we provided the buyer with a special indemnity. As a result, we may become obligated to make payments to the buyer relating to our previous ownership and operation of the DMG business. Any such post-closing liabilities and required payments under the DMG sale agreement, or otherwise, or in connection with any other past or future disposition of material assets or businesses could individually or in the aggregate have a material adverse effect on our business, results of operations, financial condition and cash flows and could materially harm our reputation.\nAdditionally, joint ventures or noncontrolling interest investments inherently involve a lesser degree of control over business operations, thereby potentially increasing the financial, legal, operational and/or compliance risks associated with the joint venture or noncontrolling interest investment. In addition, we may be dependent on joint venture partners, controlling shareholders or management who may have business interests, strategies or goals that are inconsistent with ours. Business decisions or other actions or omissions of the joint venture partner, controlling shareholders or management may require us to make capital contributions or necessitate other payments, result in litigation or regulatory action against us, result in reputational harm to us or adversely affect the value of our investment or partnership, among other things. In addition, we have potential obligations to purchase the interests held by third parties in many of our joint ventures as a result of put provisions that are exercisable at the third party's discretion within specified time periods, pursuant to the applicable agreement. If these put provisions were exercised, we would be required to purchase the third party owner's equity interest, generally at the appraised market value. There can be no assurances that these joint ventures and/or noncontrolling interest investments ultimately will be successful.\nIf our joint ventures were found to violate the law, we could suffer severe consequences that would have a material adverse effect on our business, results of operations, financial condition and cash flows and could materially harm our reputation.\nAs of December 31, 2024, we owned a controlling interest in numerous dialysis-related joint ventures, which represented approximately 30% of our U.S. dialysis revenues for the year ended December 31, 2024. In addition, we also owned noncontrolling equity investments in several other dialysis-related joint ventures. We expect to continue to increase the number of our joint ventures. Many of our joint ventures with physicians or physician groups also have certain physician owners providing medical director services to centers we own and operate. Because our relationships with physicians are governed by the federal and state anti-kickback statutes, we have sought to structure our joint venture arrangements to satisfy as many federal safe harbor requirements as we believe are commercially reasonable. Our joint venture arrangements do not satisfy all of the elements of any safe harbor under the federal Anti-Kickback Statute, however, and therefore are susceptible to government scrutiny. Additionally, our joint ventures and minority investments inherently involve a lesser degree of control over business operations, thereby potentially increasing the financial, legal, operational and/or compliance risks associated with the joint venture or minority investment. If our joint ventures are found to violate applicable laws or regulations, we could suffer severe consequences that would have a material adverse effect on our business, results of operations, financial condition and cash flows and could materially harm our reputation. For additional information on these risks, see the risk factors under the headings \"\nOur business is subject to a complex set of governmental laws, regulations and other requirements...;\"\n and \"\nWe may engage in acquisitions, mergers, joint ventures, noncontrolling interest investments, or dispositions...\"\n48\nOur goals and disclosures related to ESG matters expose us to numerous risks, including without limitation risks to our reputation and stock price.\nWe have a longstanding program relating to environmental, social and governance (ESG) issues and have engaged with key stakeholders to develop ESG focus areas and to set ESG-related goals, many of which are aspirational. We have set and disclosed these focus areas, goals and related objectives as part of our continued commitment to ESG matters, but our goals and objectives reflect our current plans and are not guarantees that we will be able to achieve them. Our efforts to accomplish and accurately report on these goals and objectives present numerous operational, reputational, financial, legal and other risks, certain of which are outside of our control, and could have, under certain circumstances, a material adverse impact on us, including on our reputation and stock price. Examples of such risks include, among others: the availability and cost of low- or non-carbon-based energy sources and technologies for us and our vendors, evolving regulatory requirements affecting ESG standards, frameworks and disclosures, including evolving standards for measuring and reporting on related metrics, the availability of suppliers that can meet our standards, our ability to recruit, develop and retain strong talent in our labor markets, and our ability to grow our home based dialysis business. \nIf our ESG practices do not meet investor or other stakeholder expectations and standards, then our reputation, our ability to attract or retain employees and our attractiveness as an investment, business partner or acquirer could be negatively impacted. In addition, if there are new regulations or orders that proscribe the ability to focus on ESG programs, then there would be a risk if we continued to pursue these goals. In addition, our failure or perceived failure to adequately pursue or fulfill our goals and objectives or to satisfy various reporting standards within the timelines we announce, or at all, could also have similar negative impacts and expose us to other risks, which under certain circumstances could be material. If we are not able to adequately recognize and respond to the rapid and ongoing developments and governmental and social expectations relating to ESG matters, this failure could result in missed corporate opportunities, additional regulatory, social or other scrutiny of us, the imposition of unexpected costs, or damage to our reputation with governments, patients, teammates, third parties and the communities in which we operate, which in turn could have a material adverse effect on our business, financial condition, cash flows and results of operations and could cause the market value of our common stock to decline.\nThere are significant risks associated with estimating the amount of dialysis revenues and related refund liabilities that we recognize, and if our estimates of revenues and related refund liabilities are materially inaccurate, it could impact the timing and the amount of our revenues recognition or have a material adverse effect on our business,\n \nresults\n \nof operations, financial condition and cash flows.\nThere are significant risks associated with estimating the amount of U.S. dialysis patient service revenues and related refund liabilities that we recognize in a reporting period. The billing and collection process is complex due to ongoing insurance coverage changes, geographic coverage differences, differing interpretations of contract coverage and other payor issues, such as ensuring appropriate documentation. Determining applicable primary and secondary coverage for approximately 200,800 U.S. patients at any point in time, together with the changes in patient coverage that occur each month, requires complex, resource-intensive processes. Errors in determining the correct coordination of benefits may result in refunds to payors. Revenues associated with Medicare and Medicaid programs are also subject to estimating risk related to the amounts not paid by the primary government payor that will ultimately be collectible from other government programs paying secondary coverage, the patient's commercial health plan secondary coverage or the patient. Collections, refunds and payor retractions typically continue to occur for up to three years and longer after services are provided. We generally expect our range of U.S. dialysis patient service revenues estimating risk to be within 1% of revenues. If our estimates of U.S. dialysis patient service revenues and related refund liabilities are materially inaccurate, it could impact the timing and the amount of our revenues recognition and have a material adverse impact on our business, results of operations, financial condition and cash flows.\nGeneral Risk Factors\nThe level of our current and future debt could have an adverse impact on our business, and our ability to generate cash to service our indebtedness and for other intended purposes and our ability to maintain compliance with debt covenants depends on many factors beyond our control.\nWe have a substantial amount of indebtedness outstanding and we may incur substantial additional indebtedness in the future, including indebtedness incurred to finance repurchases of our common stock pursuant to our share repurchase authorization discussed under \"\nStock Repurchases\n\" in Part II Item 7. \"\nManagement's Discussion and Analysis of Financial Condition and Results of Operation\ns\n.\" \nAs described in Note 12 to the consolidated financial statements included in this report, we are party to a senior secured credit agreement (as amended, the Credit Agreement), which consists of an up to $1.5 billion secured revolving line of credit, a secured term loan A-1 facility and a secured term loan B-1 facility. Our long-term indebtedness also includes $5.250 billion aggregate principal amount of senior notes.\n49\nOur senior secured credit facilities bear, and other indebtedness we may incur in the future may bear, interest at a variable rate. As a result, at any given time interest rates on the senior secured credit facilities and any other variable rate debt could be higher or lower than current levels. If interest rates increase, our debt service obligations on our variable rate indebtedness will increase even though the amount borrowed remains the same, and therefore net income and associated cash flows, including cash available for servicing our indebtedness, will correspondingly decrease.\nThe variable interest rates payable under our senior secured credit facilities have historically been linked to LIBOR as the benchmark for establishing such rates. The LIBOR rate used in our senior secured credit facilities ceased to be available starting June 30, 2023. Prior to that date, we transitioned all the debt from our senior secured credit facilities from LIBOR to Secured Overnight Financing Rate (SOFR). SOFR is a broad measure of the cost of borrowing cash overnight collateralized by U.S. Treasury securities. The SOFR rate may not perform in a manner similar to LIBOR and may result in interest rates that are higher or lower than those that would have resulted had LIBOR remained in effect, which could impact our cost of capital.\nOur ability to make payments on our indebtedness, to fund planned capital expenditures and expansion efforts, including, without limitation, any strategic acquisitions or investments we may make in the future, to repurchase our stock at the levels intended or announced and to meet our other liquidity needs such as for working capital or capital expenditures, will depend on our ability to generate cash. This depends not only on the success of our business but is also subject to economic, financial, competitive, regulatory and other factors that are beyond our control. We cannot provide assurances that our business will generate sufficient cash flows from operations in the future or that future borrowings will be available to us in amounts sufficient to enable us to service our indebtedness or to fund our working capital and other liquidity needs, including those described above. If we are unable to generate sufficient funds to service our outstanding indebtedness or to meet our working capital or other liquidity needs, including those described above, we would be required to refinance, restructure, or otherwise amend some or all of such indebtedness, sell assets, change or reduce our intended or announced uses or strategy for capital deployment, including, without limitation, for stock repurchases, reduce capital expenditures, planned expansions or other strategic initiatives, or raise additional cash through the sale of our equity or equity-related securities. We cannot make any assurances that any such refinancing, restructurings, amendments, sales of assets, or issuances of equity or equity-related securities can be accomplished or, if accomplished, will be on favorable terms or would raise sufficient funds to meet these obligations or our other liquidity needs. \nIn addition, we may continue to incur indebtedness in the future, and the amount of that additional indebtedness may be substantial. Although the Credit Agreement includes covenants that could limit our indebtedness, we currently have, and expect to continue to have, the ability to incur substantial additional debt. The risks described in this risk factor could intensify as new debt is added to current debt levels or if we incur any new debt obligations that subject us to restrictive covenants that limit our financial and operational flexibility. Any breach or failure to comply with any of these covenants could result in a default under our indebtedness. Other risks related to our ability to generate sufficient cash to service our indebtedness and for other intended purposes, include, for example:\n•\nincrease our vulnerability to general adverse economic and industry conditions;\n•\nlimit our flexibility in planning for, or reacting to, changes in our business and the markets in which we operate;\n•\nexpose us to interest rate volatility that could adversely affect our business, results of operations, financial condition and cash flows, and our ability to service our indebtedness;\n•\nplace us at a competitive disadvantage compared to our competitors that have less debt; and\n•\nlimit our ability to borrow additional funds, or to refinance existing debt on favorable terms when otherwise available or at all.\nAny failure to pay any of our indebtedness when due or any other default under our credit facilities or our other indebtedness could have a material adverse effect on our business, results of operations, financial condition and cash flows, and could trigger cross default or cross acceleration provisions in our other debt instruments, thereby permitting the holders of that other indebtedness to demand immediate repayment or cease to make future extensions of credit, and, in the case of secured indebtedness, to take possession of and sell the collateral securing such indebtedness to satisfy our obligations.\nThe borrowings under our senior secured credit facilities and senior indentures are guaranteed by certain of our domestic subsidiaries, and borrowings under our senior secured credit facilities are secured by substantially all of our and certain of our domestic subsidiaries' assets. Such guarantees and the fact that we have pledged such assets may make it more difficult and expensive for us to make, or under certain circumstances could effectively prevent us from making, additional secured and unsecured borrowings.\n50\nWe could be subject to adverse changes in tax laws, regulations and interpretations or challenges to our tax positions.\nWe are subject to tax laws and regulations of the U.S. federal, state and local governments as well as various foreign jurisdictions. We compute our income tax provision based on enacted tax rates in the jurisdictions in which we operate. As the tax rates vary among jurisdictions, a change in earnings attributable to the various jurisdictions in which we operate could result in a change in our overall tax provision.\nChanges in tax laws or regulations may be proposed or enacted that could adversely affect our overall tax liability. There can be no assurance that changes in tax laws or regulations, both within the domestic and foreign jurisdictions in which we operate, will not materially and adversely affect our effective tax rate, tax payments, results of operations, financial condition and cash flows. Similarly, changes in tax laws and regulations that impact our patients, business partners and counterparties or the economy may also impact our results of operations, financial condition and cash flows.\nIn addition, tax laws and regulations are complex and subject to varying interpretations, and any significant failure to comply with applicable tax laws and regulations in all relevant jurisdictions could give rise to material penalties and liabilities. We are regularly subject to audits by various tax authorities. It is possible that the final determination of any such tax audits and any related litigation could be materially different from our historical income tax provisions and accruals. Any changes in enacted tax laws, rules or regulatory or judicial interpretations; any adverse development or outcome in connection with tax audits in any jurisdiction; or any change in the pronouncements relating to accounting for income taxes could materially and adversely impact our effective tax rate, tax payments, results of operations, financial condition and cash flows.\nThe effects of natural or other disasters, political instability, public health crises or adverse weather events such as hurricanes, earthquakes, fires or flooding could have a material adverse effect on our business, results of operations, financial condition and cash flows.\nSome of our operations, including our clinical laboratory, dialysis centers and other facilities, as well as the operations of our third party suppliers and service providers, may be adversely impacted by the effects of natural or other disasters, political instability, public health crises such as global pandemics or epidemics, or adverse weather events such as hurricanes, earthquakes, fires or flooding. Each of these effects and risks may be further intensified by the potential impact of climate change on a global scale. In addition, these risks are particularly heightened for our patients in part because individuals with chronic illness may be more susceptible to the adverse effects of epidemics or other public health crises and also because any natural or other disaster, political instability or adverse weather event that disrupts or limits the operation of any of our centers or other facilities or services may delay or otherwise impact the critical services we provide to dialysis patients. Further, any such event or other occurrence that results in a failure of the fitness of our clinical laboratory, dialysis centers and related operations and/or other facilities or the operations of our third party suppliers and service providers or otherwise adversely impacts the safety of our teammates or patients at any of those locations could lead us to face adverse consequences, including, without limitation, the potential loss of data, including PHI or PII, compliance or regulatory investigations, any of which could materially impact our business, results of operations and financial condition, and could materially harm our reputation. For example, our clinical laboratory is located in Florida, a state that has in the past experienced and may in the future experience hurricanes. Natural or other disasters or adverse weather events could significantly damage or destroy our facilities, disrupt operations, increase our costs to maintain operations and require substantial expenditures and recovery time to fully resume operations. In addition, if the frequency, intensity and widening potential geographic scope of natural or other disasters or adverse weather events increase or a number of laws or regulations adopted in response to such changes, we may face increased costs associated with operating our clinics, as well as potential interruptions to and changes in our clinical and business operations, including, without limitation, with respect to increasing costs for energy, supplies of water, or pharmaceuticals or other supplies necessary to the operations or our clinics. For additional information regarding the risks to our supply chain and third party service providers, see the discussion in the risk factor under the heading \"\nIf certain of our suppliers and service providers…\"\n \nOur presence in markets outside the U.S. may increase our exposure to these and similar risks related to natural disasters, public health crises, political instability, adverse weather or other catastrophic events outside our control. For additional information regarding the risks related to our international business, see the discussion in the risk factor under the heading \"\nExpansion of our operations to and offering our services in markets outside of the U.S....\n\"\nAny or all of these factors, as well as other consequences of these events, none of which we can currently predict, could have a material adverse effect on our business, results of operations, financial condition and cash flows or materially harm our reputation.\n51\nWe may be subject to liability claims for damages and other expenses that are not covered by insurance or exceed our existing insurance coverage that could have a material adverse effect on our business, results of operations, financial condition and cash flows and could materially harm our reputation.\nOur operations and how we manage our business may subject us, as well as our officers and directors to whom we owe certain defense and indemnity obligations, to litigation and liability. Our business, profitability and growth prospects could suffer if we face negative publicity or we pay damages or defense costs in connection with a claim that is outside the scope or limits of coverage of any applicable insurance coverage, including, without limitation, claims related to adverse patient events, cybersecurity incidents, contractual disputes, antitrust and competition laws and regulations, professional and general liability and directors' and officers' duties. In addition, we have received notices of claims from commercial payors and other third parties, as well as subpoenas and civil investigative demands from the federal government, related to our business practices, including, without limitation, our historical billing practices and the historical billing practices of acquired businesses. Although the ultimate outcome of these claims cannot be predicted, an adverse result with respect to one or more of these claims could have a material adverse effect on our business, results of operations, financial condition and cash flows, and could materially harm our reputation. We maintain insurance coverage for those risks we deem are appropriate to insure against and make determinations about whether to self-insure as to other risks or layers of coverage. However, a successful claim, including, without limitation, a professional liability, malpractice or negligence claim or a claim related to antitrust and competition laws or a cybersecurity incident, which is in excess of any applicable insurance coverage, that is outside the scope or limits of any applicable insurance coverage, or that is subject to our self-insurance retentions, could have a material adverse effect on our business, results of operations, financial condition, cash flows and reputation.\nIn addition, if our costs of insurance and claims increase, then our earnings could decline. Market rates for insurance premiums and deductibles have been steadily increasing. Our business, results of operations, financial condition and cash flows could be materially and adversely affected by any of the following:\n•\nthe collapse or insolvency of our insurance carriers;\n•\nfurther increases in premiums and deductibles;\n•\nincreases in the number of liability claims against us or the cost of settling or trying cases related to those claims; \n•\nobtaining insurance with exclusions for things such as communicable diseases; or\n•\nan inability to obtain one or more types of insurance on acceptable terms, if at all.\nIf we fail to successfully maintain an effective internal control over financial reporting, the integrity of our financial reporting could be compromised, which could have a material adverse effect on our ability to accurately report our financial results, the market's perception of our business and our stock price.\nThe integration of acquisitions and addition of new business lines into our internal control over financial reporting has required and will continue to require significant time and resources from our management and other personnel and has increased, and is expected to continue to increase, our compliance costs. Failure to maintain an effective internal control environment could have a material adverse effect on our ability to accurately report our financial results, the market's perception of our business and our stock price. In addition, we could be required to restate our financial results in the event of a significant failure of our internal control over financial reporting or in the event of inappropriate application of accounting principles.\nProvisions in our organizational documents, our compensation programs and policies and certain requirements under Delaware law may deter changes of control and may make it more difficult for our stockholders to change the composition of our Board of Directors and take other corporate actions that our stockholders would otherwise determine to be in their best interests.\nOur organizational documents include provisions that may deter hostile takeovers, delay or prevent changes of control or changes in our management, or limit the ability of our stockholders to approve transactions that they may otherwise determine to be in their best interests. These include provisions prohibiting our stockholders from acting by written consent, advance notice requirements for director nominations and stockholder proposals and granting our Board of Directors the authority to issue preferred stock and to determine the rights and preferences of the preferred stock without the need for further stockholder approval.\nMost of our outstanding employee stock-based compensation awards include a provision accelerating the vesting of the awards in the event of a change of control under certain circumstances. These and any other change of control provisions may affect the price an acquirer would be willing to pay for our Company.\n52\nWe are also subject to Section 203 of the Delaware General Corporation Law that, subject to exceptions, prohibits us from engaging in any business combinations with any interested stockholder, as defined in that section, for a period of three years following the date on which that stockholder became an interested stockholder.\nThe provisions described above may discourage, delay or prevent an acquisition of our Company at a price that our stockholders may find attractive. These provisions could also make it more difficult for our stockholders to elect directors and take other corporate actions and could limit the price that investors might be willing to pay for shares of our common stock.",
    "item1c": "Item 1C.    Cybersecurity\nRisk Management and Strategy\nInformation security risks have significantly increased in recent years in part because of the proliferation of new technologies, the increasing use of the Internet and telecommunications technologies to conduct our operations, and the increased sophistication and activities of organized crime, hackers, terrorists and other external parties, including, among others, foreign state agents. Our business and operations rely on the secure and continuous processing, transmission and storage of confidential, proprietary and other information in our computer systems and networks, including, but not limited to, sensitive personal information, such as PHI, social security numbers, and/or credit card information of our patients, teammates, physicians, business partners and others. Our business and operations also rely on certain critical IT vendors that support such processing, transmission and storage (which have become more relevant and important given the information security issues and risks that are intensified through our increased use of remote work arrangements).\nTo manage risks to our Company, including information and security risks, our Board oversees our enterprise-wide approach to risk management with a fundamental belief that the key components of risk management are:\n•\nIdentifying potential risks that we face;\n•\nAssessing the likelihood and potential impact of the risks;\n•\nAdopting strategies and controls designed to manage the risks;\n•\nReporting on a regular basis regarding the assessment and management of the risks; \n•\nMonitoring these potential risks on a regular basis; and\n•\nEvaluating whether there are new potential risks to assess.\nUnder our Enterprise Risk Management (ERM) process, the Company evaluates risks to the enterprise on short, intermediate and long-term bases. \nThe ERM Committee, a group comprised of members of senior management, meet on a regular basis to oversee the performance of these risk management functions.\n We assess risks using a probability-magnitude lens, with shorter and intermediate term risks generally given greater weight. We prioritize mitigating activities on shorter and intermediate term risks, but also use risk analyses and oversight to proactively incorporate mitigating activities into our long-term strategy. The ERM process reflects a Company-wide effort designed to identify, assess, manage, report and monitor enterprise risks and risk areas. This effort includes the Company's Enterprise Risk Services (Internal Audit), Sarbanes-Oxley (SOX), Compliance Audit, legal and IT security teams, among others. \nThe identification and evaluation of cybersecurity threats and risks is integrated into this ERM process.\n \nThe ERM process is incorporated into our disclosure controls and procedures. Representatives of each of our ERM, Internal Audit, legal and compliance teams sit on the Company’s management Disclosure Committee, which is responsible for, among other things, the design and establishment of disclosure controls and procedures to help ensure the timeliness, accuracy and completeness of corporate disclosure. Our IT security and privacy teams, who are responsible for assessing cybersecurity threats and risks, in turn maintain policies and procedures designed to ensure appropriate escalation of cybersecurity incidents to meet external disclosure requirements. Our Chief Information Officer (CIO) and Chief Information Security Officer (CISO) regularly meet and coordinate with our Chief Privacy Officer (CPO). Each of the CIO, CISO and CPO also advise members of the Disclosure Committee, including our Chief Legal and Public Affairs Officer (CLO), on disclosure matters on an as-needed basis.\nWith respect to assessing privacy, data and cybersecurity risks, the Company adopts a hybrid approach that primarily aligns with the National Institute of Standards and Technology (NIST) Cybersecurity Framework, including the guidance set \n53\nforth in the NIST HIPAA Security Rule Cybersecurity Guide, while also evaluating against certain elements of the ISO 27001 and 27005 standards that management believes provide additional levels of guidance or structure. We regularly evaluate the Company’s cybersecurity and privacy processes and procedures, both through regular audits by our Internal Audit and IT security teams, as well as regular retention of outside advisors under direction of our IT security team. \nAmong other things, the IT security team oversees an external third party review at least every two years that evaluates the readiness of the entire Company against the NIST Cybersecurity Framework and provides an assessment that measures Capability Maturity Model Integration levels\n. Additionally, our CISO engages in regular consultations, typically monthly, with third-party cybersecurity advisors. Among other things, these sessions provide the Company with a broader review of the external cybersecurity environment, helping us to stay current on emerging or developing security approaches and risks. Among other initiatives, our CISO and the Company’s IT security team actively participate in industry conferences and maintain memberships to resources such as the Health Information Sharing and Analysis Center (Health-ISAC), a trusted community of critical infrastructure owners and operators within the Health Care and Public Health sector which, among other things, allows the Company to monitor email updates and alerts coordinated with the U.S. Department of Homeland Security’s Cybersecurity and Infrastructure Security Agency. In order to maintain awareness of privacy, data and cybersecurity risks, the Company incorporates these topics into its annual compliance training materials that are mandatory for all teammates and new hires, and among other things cover HIPAA privacy and security requirements.\nWe maintain policies and have established processes involving our IT security, privacy and legal teams that assess potential cybersecurity risks associated with our retention and use of third-party service providers. These policies and procedures are generally aligned with the NIST Cybersecurity Framework. Prior to retaining or renewing a third-party vendor, the Company policy requires a risk assessment of such potential new vendor or new engagement through a collaborative process among the Company’s IT security, privacy, insurance and legal teams, among others. Potential vendor engagements also are reviewed to assess a range of other considerations and contractual terms and conditions, including, among other things, a potential vendor’s liability insurance limits, scope and coverage of cyber insurance and privacy data protections. Our IT SOX team also conducts annual SOX reviews for those vendors that are considered in scope for SOX controls. All finalized vendor engagements are considered by Internal Audit as part of our ordinary course risk assessment and audit planning.\nCybersecurity Risks and the Impact on our Company\nDue to the continuously evolving series of laws and regulations related to cybersecurity, data protection and privacy that are applicable to our business, as well as the associated risks from cybersecurity threats, we have expended significant resources in order to protect our information systems and data. \nWe regularly review, monitor and implement multiple layers of security measures through technology, processes and our people. We utilize security technologies designed to protect and maintain the integrity of our information systems and data, and our defenses are monitored and routinely tested internally and by external parties. Despite these efforts, our facilities and systems and those of our third-party service providers may be vulnerable to privacy and security incidents; security attacks and breaches; acts of vandalism or theft; computer viruses and other malicious code; coordinated attacks by a variety of actors, including, among others, activist entities or state sponsored cyberattacks; emerging cybersecurity risks; cyber risk related to connected devices; misplaced or lost data; programming and/or human errors; or other similar events that could impact the security, reliability and availability of our systems. Internal or external parties have attempted to, and will continue to attempt to, circumvent our security systems, and we have in the past, and expect that we will in the future, defend against, experience, and respond to attacks on our network including, without limitation, reconnaissance probes, denial of service attempts, malicious software attacks including ransomware or other attacks intended to render our internal operating systems or data unavailable, and phishing attacks or business email compromise.\n \nWhile we have experienced cybersecurity incidents in the past, to date none have had a material impact on our business, results of operations, financial condition and cash flows.\nCybersecurity requires ongoing investment and diligence against evolving threats and in the context of new or developing technologies. For further information regarding the risks we face from cybersecurity threats and how our business strategy, results of operations, and financial condition could be materially affected by such risks, see Part I Item IA. \"\nRisk Factors\n\" under the heading, \"\nPrivacy and information security laws are complex\n…\".\nGovernance\nBoard Oversight\nAs part of its oversight responsibilities, the Audit Committee monitors privacy, data and cybersecurity as specific risk areas. The Audit Committee also works with the Compliance and Quality Committee to oversee enterprise risks with healthcare and anti-corruption requirements, and those requirements include certain privacy, data and cybersecurity aspects. Both Mr. Schechter, a member of the Audit Committee, and Ms. Schoppert, a member of the Audit Committee, hold a CERT Certificate in Cybersecurity Oversight. \nThe Audit Committee engages in regular discussions with management on privacy, data, and \n54\ncybersecurity risk exposures, receiving quarterly reports from the ERM team and the CIO. \nOn a periodic basis, the full Board of Directors also receives these reports from the ERM team and the CIO. \nThe CPO and/or CLO periodically reports to the Audit Committee about the Company’s privacy program, and Internal Audit reports to the Audit Committee quarterly, providing the Audit Committee with results from any privacy, data, or cybersecurity audits.\nAmong other things, the Company’s privacy team actively develops and implements policies designed to comply with the requirements of privacy laws in the countries where the Company operates. Working with Internal Audit and the CIO, the privacy team assesses the nature and potential severity of privacy risks within DaVita and guides the organization in taking steps to help mitigate such risks. The Audit Committee also oversees the Company's negotiation of any cybersecurity insurance. Currently, the Company maintains a cybersecurity risk insurance policy providing coverage for certain cybersecurity breaches among other specified risks.\nManagement\nAs referenced above, our IT security team, in consultation with our privacy team, is primarily responsible for frontline assessments and management of day-to-day risks from cybersecurity threats, including the monitoring and detection of cybersecurity incidents and the execution of DaVita's cybersecurity and privacy incident response plans, as needed. Pursuant to the plan, the teams are responsible for assessing and classifying cybersecurity incidents and coordinating the response to such incidents, including managing both internal and external reporting obligations and remediation efforts. \nOur key personnel responsible for privacy and cybersecurity expertise include our CIO, CISO and CPO. Their qualifications include expertise in international privacy laws, compliance, global IT strategy, and security responsibilities, helping to ensure a comprehensive approach to risk management. Our CISO has more than two decades of experience in information technology risk and compliance and holds a Certified Chief Information Security Officer certification from EC-Council, a Certified Information Security Manager certification from ISACA and a certification from the Massachusetts Institute of Technology on AI management in healthcare. Our CPO is a Certified Information Privacy Professional and a Certified Compliance and Ethics Professional, and has more than two decades of experience in creating and implementing privacy and data protection programs that enable multinational organizations to respect and protect personal data and execute mission critical business strategies.\nOur IT security team also operates a 24x7 security operations center through a managed service provider. This dedicated center, alongside active monitoring of the dark web for DaVita-related data, and our use of both internal and external tools, is designed to ensure proactive detection, prevention and remediation of cybersecurity incidents. We inform and develop this integrated approach through our ongoing internal and external evaluations and risk assessments of our IT security program as described above.",
    "item1b": "Item 1B.    Unresolved Staff Comments\nNone."
  }
}