{
  "ticker": "EA",
  "cik": "0000712515",
  "company_name": "ELECTRONIC ARTS INC.",
  "filing_date": "2025-05-13",
  "accession": "0000712515-25-000022",
  "primary_doc": "ea-20250331.htm",
  "item_sections": {
    "item1": "Item 1:    \nBusiness\nOverview\nElectronic Arts is a global leader in digital interactive entertainment. We develop, market, publish and deliver games, content and services that can be experienced on game consoles, PCs and mobile devices.\nWhat We Offer\nWe create innovative games and experiences that deliver high-quality interactive entertainment and drive engagement across our global network of hundreds of millions of players. We are focusing on building games and experiences that grow the global online communities around our key franchises; deepening engagement through connecting interactive storytelling to key intellectual property; and harnessing our communities to grow in, around, and beyond our games. We develop and publish games and experiences across diverse genres, such as sports, racing, first-person shooter, action, role-playing and simulation. We believe that our creative talent, production capabilities, broad portfolio of owned and licensed IP, and technological foundation, coupled with our network of hundreds of millions of players, provide us with strategic advantages. \nThrough our live services offerings, we offer high-quality experiences designed to provide value to players and extend and enhance gameplay. These live services include extra content, subscription offerings and other revenue generated outside of the sale of our full games. Our digital live services and other net revenue represented 73 percent of our total net revenue during fiscal year 2025. We offer live services through our global football and American football franchises (which includes EA SPORTS College Football and EA SPORTS Madden NFL) and based on our iconic IP such as The Sims, \nApex Legends\n and Battlefield. Our most popular live services are the extra content in the \nUltimate Team\n mode associated with our sports franchises. \nUltimate Team\n allows players to collect current and former players in order to build and compete as a personalized team. Live services net revenue generated from extra content purchased within \nUltimate Team\n, a substantial portion of which was derived from \nFC Ultimate Team\n,\n \nis material to our business.\nOur players engage with our products and services on consoles, PCs and mobile devices. Players can access our products and services through traditional single-game purchase or through subscription offerings; and certain of our products and services are available through a “free-to-play” model whereby players download the game for free and engage with services provided on an ongoing basis. For example, we develop products and services within the EA SPORTS FC franchise that allow players to engage through multiple business models, distribution channels and devices, including: (1) our annualized console and PC games and associated experiences, which can be purchased through both digital distribution and retail channels and also are available through subscription services; (2) a mobile free-to-play offering; and (3) a PC free-to-play game available in certain countries. Revenue from our EA SPORTS FC franchise, as well as revenue from our American football franchise, is material to our business and will continue to be so.\nDistribution of Products and Services\nConsole\n. We primarily distribute our console products and services through partners, such as Sony and Microsoft. Under the terms of publishing agreements our products and services are developed, marketed, published, and distributed with PlayStation \n3\nTable of Contents\nand Xbox consoles. Our direct sales to Sony and Microsoft represented approximately 39 percent and 17 percent of total net revenue, respectively, in fiscal year 2025.\n \nUnder these agreements, we have the non-exclusive right to use, for a fixed term and in a designated territory, technology that is owned or licensed by them to publish our games on their respective consoles. With respect to our digitally-delivered products and services, the console manufacturers pay us either a wholesale price or a royalty percentage on the revenue they derive from their sales of our products and services. Our transactions for packaged goods products are made pursuant to individual purchase orders, which are accepted on a case-by-case basis. Our packaged goods games are sold directly to mass market retailers, specialty stores and through distribution arrangements. For packaged goods products, we pay the console manufacturers a per-unit royalty for each unit manufactured. Many key commercial terms of our relationships with Sony and Microsoft — such as manufacturing terms, delivery times, policies and approval conditions — are determined unilaterally, and are subject to change by the console manufacturers.\nThe publishing agreements also require us to indemnify the console manufacturers for any loss, liability and expense resulting from any claim against the console manufacturer regarding our products and services, including any claims for patent, copyright or trademark infringement brought against the console manufacturers. Each agreement may be terminated by the console manufacturers if a breach or default by us is not cured after we receive written notice from the console manufacturers, or if we become insolvent. The console manufacturers are not obligated to enter into license agreements with us for any future consoles, products or services.\nPC and Mobile\n. We distribute our mobile applications and additional content through distributors such as Apple and Google. Our applications are downloaded for mobile devices from third party application storefronts. The distributor collects payment from consumers for content purchased within the application or charges consumers a one-time fee to download the application. Our distribution agreements establish the amounts that are retained by the distributor and the amounts passed through to us. These arrangements are typically terminable on short notice. The agreements generally do not obligate the distributors to market or distribute any of our applications.\n \nApplication storefront policies are determined unilaterally by the distributors and are subject to change.\nOur PC products and services can be downloaded directly through the EA app, EA’s digital storefront, as well as through third-party online download stores, such as Steam. We also have agreements with companies, such as Tencent Holdings Limited, Nexon Co., Ltd and Garena Online Private Limited, or their respective affiliates, that allow these companies to publish our mobile and PC free-to-play games in certain countries. Our players access games from the publishers’ online storefronts and are charged for additional content purchased within our game environment. The agreements generally establish the amounts that are retained by the publisher and the amounts passed through to us.\nCompetition\nThe market for interactive entertainment is intensely competitive and changes rapidly as new products, business models and distribution channels are introduced. We also face competition for the right to license certain intellectual property included in our products. In order to remain successful, we are required to anticipate and commit to, sometimes years in advance, the ways in which our products and services will compete in the market. We face significant competition from companies that focus on developing products and services available on consoles, PCs and/or mobile devices. In addition, we compete with large, diversified companies that have strengthened their interactive entertainment capabilities. Their greater financial and other resources may provide larger budgets to develop and market tools, technologies, products and services that gain consumer success and shift player time and engagement away from our products and services. We also continue to expect new entrants to emerge.\nMore broadly, we compete against providers of different sources of entertainment, such as movies, television, social media, online casual entertainment and music that our players could enjoy in their free time. Important competitive factors in our industry include the ability to attract creative and technical talent, game quality and ease of use, innovation, compatibility of products with certain consoles and other distribution channels, brand recognition, reputation, reliability, security, creativity, price, marketing, and quality of customer service.\n \nThe companies with which we compete, as well as competitive factors, may change and evolve as we execute our strategic plan.\nRisks related to competitive factors affecting our business are described in Part I,",
    "item1a": "Item 1A, “Risk Factors,” under the heading “We have and may continue to experience security breaches and cyber threats.”\nOur Board of Directors maintains ultimate oversight over risks associated with cybersecurity and receives updates at least annually from our \nChief Information Security Officer\n.\n \nIn addition, our Audit Committee, which is composed solely of independent directors, receives updates from our Chief Information Security Officer on a quarterly basis, and more frequently as appropriate, that provide additional detail about the steps we take to monitor and mitigate these risks.",
    "item1b": "Item 1B:     \nUnresolved Staff Comments\nNone.",
    "item1c": "Item 1C:     \nCybersecurity\nIn the ordinary course of our business, we collect, use, store, and digitally transmit confidential and personal information. The secure maintenance of this information and our information technology systems is important to our operations, business strategy, and maintaining the trust of our players, employees, and partners. To this end, we have implemented policies, practices and programs designed to assess, identify, and manage risks from potential unauthorized occurrences on or through our information technology systems that may result in adverse effects on the confidentiality, integrity, and availability of these systems and the data residing therein. These processes are managed and monitored by dedicated information technology security teams, which are led by our Chief Information Security Officer. They include mechanisms, controls, technologies, systems, and other processes designed to maintain a stable information technology environment and protect against unauthorized access, use, destruction, modification or disclosure of confidential and personal information, and other information security incidents affecting our operations or the availability of our products and services.\n \nFor example, we invest in tools to detect suspicious activity in accounts, give players the ability to use two-factor authentication and work to prevent the creation of mass user accounts.\n \nWe also regularly test our defenses through penetration and vulnerability testing. \nWe implement controls and procedures designed to mitigate risk with third-party vendors and business partners who have access to confidential and personal information, including by conducting a formalized security risk assessment. Security risks identified in security risk assessments are remediated, and/or formally documented, and in some cases the business relationship may be ended or not pursued.\n Our employees and certain contractors are required to complete mandatory annual security training. These trainings raise awareness of security practices and educate employees to protect information assets and infrastructure. \nWe consult with outside advisors and experts when appropriate to assist in assessing, identifying and managing cybersecurity risks, including providing an independent analysis of our preparedness, assessing and managing the current risk environment and assisting us in preparing for future threats and trends.\nOur \nChief Information Security Officer\n, who reports directly to our Chief Technology Officer, has extensive experience managing information technology and cybersecurity matters and is responsible for assessing and managing cybersecurity risks.\n \nRisks associated with cybersecurity are integrated into our overall enterprise-risk assessment and more closely monitored by our information technology security teams.\n We face ongoing cybersecurity risks that, if realized, could materially impact our business, operations and financial results. \nDuring the reporting period, we did not experience any cybersecurity incident that has had, or is reasonably likely to have, a material impact on our operations or financial results.\n Additional information on cybersecurity risks we face is discussed in Part I,"
  }
}