{
  "ticker": "EBAY",
  "cik": "0001065088",
  "company_name": "EBAY INC",
  "filing_date": "2025-02-27",
  "accession": "0001065088-25-000037",
  "primary_doc": "ebay-20241231.htm",
  "item_sections": {
    "item1": "Item 1 “Business,” Part I,",
    "item1a": "Item 1A: Risk Factors” in Part I of this report.\nKey Operating Metrics\nGMV and take rate are significant factors that we believe affect our net revenues.\nGMV\n consists of the total value of all paid transactions between users on our Marketplace platforms during the applicable period inclusive of shipping fees and taxes. We believe that GMV provides a useful measure of the overall volume of paid transactions that flow through our Marketplace platforms in a given period.\nFX-Neutral GMV is defined as GMV minus the exchange rate effect, which we calculate by applying prior period foreign currency exchange rates to current year transactional currency amounts.\nTake rate\n is defined as net revenues divided by GMV and represents net revenue as a percentage of overall volume on our Marketplace platforms. We believe that take rate provides a useful measure of our ability to monetize volume through services on our Marketplace platforms in a given period. We use take rate to identify key revenue drivers.\n43\nTable of Contents\nThe following table presents net revenues and our key operating metrics of GMV and take rate for the periods indicated. The following table also presents a reconciliation of FX-Neutral net revenues and FX-Neutral GMV (each as defined above) to our reported net revenues and GMV for the periods indicated (in millions, except percentages):\nYear Ended December 31,\n \n2024\n2023\n% Change\n \nAs Reported \n(1)\nExchange Rate Effect\nFX-Neutral\nAs Reported\nAs Reported\nFX-Neutral\nNet revenues\n$\n10,283 \n$\n2 \n$\n10,281 \n$\n10,112 \n2 \n%\n2 \n%\nGMV\n$\n74,667 \n$\n430 \n$\n74,237 \n$\n73,206 \n2 \n%\n1 \n%\nTake rate\n13.77 \n%\n13.81 \n%\n(0.04)\n%\nYear Ended December 31,\n \n2023\n2022\n% Change\n \nAs Reported \n(1)\nExchange Rate Effect\nFX-Neutral\nAs Reported\nAs Reported\nFX-Neutral\nNet revenues\n$\n10,112 \n$\n52 \n$\n10,060 \n$\n9,795 \n3 \n%\n4 \n%\nGMV\n$\n73,206 \n$\n(44)\n$\n73,250 \n$\n73,900 \n(1)\n%\n(1)\n%\nTake rate\n13.81 \n%\n13.25 \n%\n0.56 \n%\n(1)\nNet revenues included $54 million of hedging losses during 2024 compared to $56 million and $140 million of hedging gains during 2023 and 2022, respectively.\nIn 2024, the increase in net revenues was primarily due to higher GMV, the expansion of promoted listings products, the ramp of eBay International Shipping and additional financial services offered to buyers and sellers within our payments system, partially offset by a decline in our take rate driven by fluctuations in foreign currency exchange rates and changes to our fee structure in certain markets.\nGMV grew during 2024 as we executed on our strategy, including across Focus Categories, country-specific investments, and horizontal initiatives. Traffic improvement was driven by cross-category shopping, horizontal innovation, country-specific initiatives and growth in recommerce. The culmination of these effects, combined with consumers looking for value, offset pressure in discretionary spending across our three largest markets primarily resulting from geopolitical events, inflationary pressure, foreign exchange rate volatility, elevated interest rates and lower consumer confidence.\nFocus Categories GMV grew in aggregate, faster than the remainder of our marketplace. This volume growth was primarily driven by Parts & Accessories (“P&A”), Refurbished, Collectibles, and Luxury goods. Traffic and conversion improved in the U.S., which led to a narrower gap to U.S. ecommerce market growth. Collectibles was a key contributor to U.S. growth, including Trading Cards, where traffic and conversion have improved, driven by strategic investments and partnerships. In the United Kingdom and Germany, we continued to experience challenging macroeconomic conditions and lower consumer confidence, with offsetting growth in P&A and consumer-to-consumer volume. Cross-border trade was a key driver of International GMV growth, led by exports from Greater China and Japan into our major markets. Cross-border trade was also a significant contributor to growth in Focus Categories, particularly P&A.\n44\nTable of Contents\nCost of Net Revenues\nCost of net revenues represents costs associated with customer support, site operations and payment processing. Significant components of these costs primarily consist of employee compensation (including stock-based compensation), contractor costs, facilities costs, depreciation of equipment and amortization expense, bank transaction fees, credit card interchange and assessment fees, authentication costs, shipping costs and indirect tax expenses. The following table presents cost of net revenues for the periods indicated (in millions, except percentages): \n \nYear Ended December 31,\n \n2024\n% Change\n  \n2023\n% Change\n  \n2022\nCost of net revenues \n(1)(2)\n$\n2,880 \n2 \n%\n  \n$\n2,833 \n6 \n%\n  \n$\n2,680 \n% of net revenues\n28 \n%\n28 \n%\n27 \n%\n(1)\nCost of net revenues were net of immaterial hedging activity during 2024, 2023 and 2022, respectively.\n(2)\nForeign currency movements relative to the U.S. dollar had an unfavorable impact of $7 million on cost of net revenues during 2024 compared to an unfavorable impact of $2 million and a favorable impact of $81 million during 2023 and 2022, respectively.\nThe increase in cost of net revenues during 2024 compared to 2023 was primarily due to a $53 million increase related to the expansion of promoted listings products, a $50 million increase related to indirect tax expenses, a $32 million increase related to the ramp of eBay International Shipping, and an $11 million disposition of data center equipment, partially offset by a $66 million decrease in depreciation expense due to the change in our estimate of the useful lives for our servers and networking equipment and a $38 million decrease in payment processing costs driven by rate improvements.\nOperating Expenses\nThe following table presents operating expenses for the periods indicated (in millions, except percentages): \n \nYear Ended December 31,\n \n2024\n% Change\n2023\n% Change\n2022\nSales and marketing\n$\n2,319 \n5 \n%\n$\n2,217 \n4 \n%\n$\n2,136 \n% of net revenues\n23 \n%\n22 \n%\n22 \n%\nProduct development\n1,479 \n(4)\n%\n1,544 \n16 \n%\n1,330 \n% of net revenues\n14 \n%\n15 \n%\n14 \n%\nGeneral and administrative\n914 \n(24)\n%\n1,196 \n24 \n%\n963 \n% of net revenues\n9 \n%\n12 \n%\n10 \n%\nProvision for transaction losses\n353 \n(2)\n%\n360 \n8 \n%\n332 \n% of net revenues\n3 \n%\n4 \n%\n3 \n%\nAmortization of acquired intangible assets\n20 \n**\n21 \n**\n4 \nTotal operating expenses \n(1)(2)\n$\n5,085 \n(5)\n%\n$\n5,338 \n12 \n%\n$\n4,765 \n(1)\nOperating expenses were net of immaterial hedging activity during 2024, 2023 and 2022, respectively.\n(2)\nForeign currency movements relative to the U.S. dollar had an unfavorable impact of $9 million on operating expenses during 2024 compared to a favorable impact of $16 million and $193 million during 2023 and 2022, respectively.\n**    Not meaningful\nSales and Marketing\n \nSales and marketing expenses primarily consist of marketing program costs, employee compensation (including stock-based compensation), certain user coupons and rewards, contractor costs, facilities costs and depreciation on equipment. Marketing program costs represent traffic acquisition costs in various channels such as paid search, affiliates marketing and display advertising, as well as brand campaigns and buyer/seller communications.\nThe increase in sales and marketing expenses during 2024 compared to 2023 was primarily due to a $163 million increase in marketing program costs and user coupons, partially offset by a $74 million decrease in employee-related costs.\n45\nTable of Contents\nProduct Development\n \nProduct development expenses primarily consist of employee compensation (including stock-based compensation), contractor costs, facilities costs and depreciation on equipment. Product development expenses are net of required capitalization of major platform and other product development efforts, including the development and maintenance of our technology platform. Our top technology priorities include improving seller tools and buyer experiences across our Marketplace platforms powered by intelligent computing at scale.\nThe decrease in product development expenses during 2024 compared to 2023 was primarily due to a decrease in employee-related costs driven by operational efficiencies. While employee costs are decreasing, we continue to invest in strategic areas such as browsing experience, search optimization and providing relevant recommendations to enhance the experience for our customers around the world.\nCapitalized internal use and platform development costs were $108 million and $115 million in 2024 and 2023, respectively. These costs are primarily reflected as a cost of net revenues when amortized in future periods.\nGeneral and Administrative\n \nGeneral and administrative expenses primarily consist of employee compensation (including stock-based compensation), contractor costs, facilities costs, depreciation of equipment, legal expenses, restructuring, insurance premiums and professional fees. Our legal expenses, including those related to various ongoing legal proceedings, may fluctuate substantially from period to period.\nThe decrease in general and administrative expenses during 2024 compared to 2023 was primarily due to a $56 million legal accrual release during 2024 compared to a $65 million legal expense recognized during 2023 and an $8 million restructuring accrual release during 2024 compared to a $141 million restructuring expense recognized during 2023. See “Note 12 — Commitments and Contingencies” and “Note 18 — Restructuring” to the consolidated financial statements included in this report for additional details regarding our legal matters and the restructuring, respectively.\nProvision for Transaction Losses\nProvision for transaction losses consists primarily of losses resulting from our buyer protection programs, chargebacks for unauthorized credit card use, and merchant related chargebacks due to non-delivery of goods or services. We expect our provision for transaction losses to fluctuate depending on many factors, including changes to our protection programs and macroeconomic conditions.\nThe decrease in provision for transaction losses during 2024 compared to 2023 was primarily due to favorable fluctuations in buyer and seller fraud rates.\n46\nTable of Contents\nGain (loss) on equity investments and warrant, net\nGain (loss) on equity investments and warrant, net primarily consists of gains and losses related to our various types of equity investments, including our equity investments in Adevinta, Adyen, Aurelia and Gmarket, and gains and losses due to changes in fair value of the warrant received from Adyen. The following table presents gain (loss) on equity investments and warrant, net for the periods indicated (in millions, except percentages):\n \nYear Ended December 31,\n \n2024\n% Change\n  \n2023\n% Change\n  \n2022\nUnrealized change in fair value of equity investment in Adevinta\n$\n(234)\n(113)\n%\n$\n1,782 \n166 \n%\n$\n(2,693)\nRealized change in fair value of shares sold in \nAdevinta\n78 \n100 \n%\n— \n(100)\n%\n2 \nUnrealized change in fair value of equity investment in Adyen\n— \n**\n— \n100 \n%\n(118)\nRealized change in fair value of shares sold in Adyen\n(57)\n(100)\n%\n— \n100 \n%\n(143)\nRealized change in fair value of shares sold in Aurelia\n(11)\n(100)\n%\n— \n**\n— \nUnrealized change in fair value of equity investment in Gmarket\n(12)\n88 \n%\n(96)\n67 \n%\n(294)\nRealized change in fair value of shares sold in Gmarket\n(1)\n**\n— \n**\n— \nUnrealized change in fair value of equity investment in KakaoBank\n— \n**\n— \n100 \n%\n(218)\nRealized change in fair value of shares sold in KakaoBank\n— \n(100)\n%\n13 \n117 \n%\n(75)\nGain (loss) on other investments\n3 \n118 \n%\n(17)\n— \n%\n(17)\nChange in fair value of warrant\n158 \n5 \n%\n150 \n165 \n%\n(230)\nTotal gain (loss) on equity investments and warrant, net\n$\n(76)\n(104)\n%\n  \n$\n1,832 \n148 \n%\n  \n$\n(3,786)\n**    Not meaningful\nThe change in gain (loss) on equity investments and warrant, net during 2024 compared to 2023 was driven by the realized and unrealized changes in fair value of our equity investments and the warrant. Refer to “Note 6 — Investments” for further details about our equity investments.\n47\nTable of Contents\nInterest Expense, Interest Income and Other, Net\nInterest expense primarily consists of interest charges on amounts borrowed, commitment fees on unborrowed amounts under our credit agreement and interest expense on our outstanding debt securities and commercial paper, as applicable. Interest income and other, net primarily consists of interest earned on cash, cash equivalents, investments and customer accounts, gains and losses on foreign exchange transactions and transaction costs of acquisitions. The following table presents interest expense and interest income and other, net for the periods indicated (in millions, except percentages):\n \nYear Ended December 31,\n \n2024\n% Change\n  \n2023\n% Change\n  \n2022\nInterest expense\n$\n(259)\n(2)\n%\n$\n(263)\n12 \n%\n$\n(235)\nPercentage of net revenues\n(3)\n%\n(3)\n%\n(2)\n%\nInterest income\n$\n272 \n33 \n%\n  \n$\n204 \n179 \n%\n  \n$\n73 \nForeign exchange and other\n23 \n**\n  \n(7)\n**\n  \n(3)\nTotal interest income and other, net\n$\n295 \n50 \n%\n  \n$\n197 \n181 \n%\n  \n$\n70 \nPercentage of net revenues\n3 \n%\n2 \n%\n1 \n%\n**    Not meaningful\nInterest expense decreased during 2024 compared to 2023 primarily due to a lower average notional amount of outstanding debt.\nInterest income increased during 2024 compared to 2023 primarily due to a higher average notional amount and higher yields on fixed-income investments.\n \nIncome Tax Provision (Benefit)\nThe following table presents provision for income taxes and effective tax rate for the periods indicated (in millions, except percentages):\n \nYear Ended December 31,\n \n2024\n2023\n2022\nIncome tax provision (benefit)\n$\n297 \n$\n932 \n$\n(327)\nEffective tax rate\n13.0 \n%\n  \n25.1 \n%\n  \n20.4 \n%\nThe decrease in our effective tax rate during 2024 compared to 2023 was primarily due to benefits from the sale of Gmarket, research and development tax credits generated, excess tax benefits on stock-based compensation and the 2023 non-recurring remeasurement of deferred tax assets related to a tax rate reduction and an increase in reserves for uncertain tax positions, partially offset by a benefit from the release of a valuation allowance.\nWe are regularly under examination by tax authorities both domestically and internationally. We believe that adequate amounts have been reserved for any adjustments that may ultimately result from these examinations, although there are inherent uncertainties in these examinations. Due to the ongoing tax examinations, it is generally impractical to determine the amount and timing of these adjustments. However, we expect several tax examinations to close within the next 12 months. See “Note 15 — Income Taxes” to the consolidated financial statements included in this report for more information on estimated settlements within the next 12 months.\n48\nTable of Contents\nLiquidity and Capital Resources \nCash Flows\n \n \nYear Ended December 31,\n \n2024\n2023\n2022\n \n(In millions)\nNet cash provided by (used in):\n \n \nContinuing operating activities\n$\n2,414 \n$\n2,431 \n$\n2,627 \nContinuing investing activities\n2,213 \n240 \n2,459 \nContinuing financing activities\n(3,806)\n(2,450)\n(3,792)\nEffect of exchange rates on cash, cash equivalents and restricted cash\n(28)\n5 \n(57)\nNet decrease in cash, cash equivalents and restricted cash - discontinued operations\n— \n(5)\n(371)\nNet increase in cash, cash equivalents and restricted cash\n$\n793 \n$\n221 \n$\n866 \n \nContinuing Operating Activities\nOur operating cash flows arise primarily from cash received from our customers on our Marketplace platforms offset by cash payments for sales and marketing, employee compensation and payment processing expenses.\nCash provided by continuing operating activities of $2.4 billion in 2024 compared to $2.4 billion in 2023 was primarily attributable to a $377 million increase in operating income offset by working capital movements.\nContinuing Investing Activities\nCash provided by continuing investing activities of $2.2 billion in 2024 was primarily attributable to proceeds of $12.3 billion from the maturities and sales of investments, and proceeds of $2.4 billion, $1.0 billion, $573 million and $322 million from the sale of our equity investments in Adevinta, Aurelia, Adyen and Gmarket, respectively, partially offset by cash paid for investments of $13.9 billion and property and equipment of $458 million.\nCash provided by continuing investing activities of $240 million in 2023 was primarily attributable to proceeds of $14.5 billion from the maturities and sales of investments, partially offset by cash paid for investments of $13.9 billion and property and equipment of $456 million.\nThe largely offsetting effects of purchases of investments and maturities and sale of investments results from the management of our investments. As our immediate cash needs change, purchase and sale activity will fluctuate.\nContinuing Financing Activities\nCash used in continuing financing activities of $3.8 billion in 2024 was primarily driven by common stock repurchases of $3.1 billion, debt repayments of $750 million related to the repayment of our 3.450% senior notes due 2024, and $533 million of cash dividends paid, partially offset by borrowing under our commercial paper program of $441 million and net funds receivable and payable activity of $305 million.\nCash used in continuing financing activities of $2.5 billion in 2023 was primarily driven by common stock repurchases of $1.4 billion, debt repayments of $1.2 billion related to the repayment of our floating rate and \n2.750%\n senior notes due 2023, and $528 million of cash dividends paid, partially offset by net funds receivable and payable activity of $717 million driven by changes in payment processors.\nThe negative and positive effects of exchange rate movements on cash, cash equivalents and restricted cash during 2024 and 2023, respectively, was due to the strengthening and weakening, respectively, of the U.S. dollar against other currencies.\n49\nTable of Contents\nLiquidity and Capital Resource Requirements\n \nAs of December 31, 2024 and 2023, we had assets classified as cash and cash equivalents as well as short-term and long-term non-equity investments, in an aggregate amount of $7.2 billion and $5.1 billion, respectively. These amounts do not include cash held on behalf of customers related to marketplace activity of $763 million and $481 million, respectively, which are recognized separately within “Customer accounts and funds receivable” with a corresponding liability within “Customer accounts and funds payable” in our consolidated balance sheet. These amounts also do not include restricted cash related to safeguarding customer funds, our global sabbatical program, and other compensation arrangements held in escrow totaling $90 million and $27 million, respectively. We believe these assets together with cash expected to be generated from operations, borrowings available under our credit agreement and commercial paper program, and our access to capital markets, will be sufficient to satisfy our material cash requirements over the next 12 months and for the foreseeable future. \nGeopolitical events, inflationary pressure, foreign exchange rate volatility, elevated interest rates and global economic uncertainty have caused material disruptions in both the United States and international financial markets and economies and are uncertain in duration. The impact of these events has increased, and may continue to increase, our borrowing costs and other costs of capital and otherwise adversely affect our business, results of operations, financial condition and liquidity. The future impact of these events cannot be predicted with certainty and we cannot assure that we will have access to external financing at times and on terms we consider acceptable, or at all, or that we will not experience other liquidity issues going forward.\nWe have certain fixed contractual obligations and commitments that include future estimated payments for general operating purposes. Changes in our business needs, contractual cancellation provisions, fluctuating interest rates, and other factors may result in actual payments differing from the estimates. We cannot provide certainty regarding the timing and amounts of these payments. The following sections summarizes our fixed contractual obligations and commitments.\nSenior Notes\nIn 2024, we repaid the $750 million aggregate principal amount of our previously outstanding 3.450% senior notes on the date of maturity.\nIn 2023, we repaid the $1.2 billion \naggregate principal amount of our \nfloating rate and 2.750% senior notes on the date of maturity.\nAs of December 31, 2024, we had fixed-rate senior notes outstanding with an aggregate principal amount of $7.0 billion, with $1.2 billion payable within 12 months. Future interest payments associated with the senior notes totaled an aggregate of $2.1 billion, with an aggregate of $223 million payable within 12 months. The net proceeds from the issuances of these senior notes were used for general corporate purposes, including, among other things, capital expenditures, share repurchases, repayment of indebtedness and acquisitions.\nCommercial Paper\nWe have a commercial paper program pursuant to which we may issue commercial paper notes in an aggregate principal amount at maturity of up to $1.5 billion outstanding at any time with maturities of up to 397 days from the date of issue. In 2024, we issued and repaid $180 million of commercial paper notes with original maturities less than 90 days and issued $450 million of commercial paper notes with original maturities greater than 90 days. As of December 31, 2024, we had $450 million aggregate principal amount of commercial paper notes outstanding with a weighted average interest rate of 5.10% per annum, and a weighted average remaining term of 144 days.\nIn January 2025, we repaid the $450 million aggregate principal amount of the previously outstanding commercial paper notes on the date of maturity.\n50\nTable of Contents\nCredit Agreement \nWe have a credit agreement that provides for an unsecured $2.0 billion five-year revolving credit facility. We may also, subject to the agreement of the applicable lenders, increase the commitments under the revolving credit facility by up to $1.0 billion. Funds borrowed under the credit agreement may be used for working capital, capital expenditures, acquisitions and other general corporate purposes and will bear interest at either (i) a customary forward-looking term rate based on the secured overnight financing rate published by CME Group for the relevant interest period plus an adjustment of 0.1% or (ii) a customary base rate formula, plus a margin (based on our public debt ratings) ranging from 0% to 0.375%. The covenants of the credit agreement are discussed in “Note 10 — Debt” to the consolidated financial statements included in this report. As of December 31, 2024, we had $450 million aggregate principal amount of commercial paper notes outstanding; therefore, $1.6 billion of borrowing capacity was available for other purposes permitted by the credit agreement.\nLeases\nWe have operating leases for office space, data centers, as well as other corporate assets that we utilize under lease arrangements. As of December 31, 2024, we had fixed lease payment obligations of $544 million, with $142 million payable within 12 months. For additional details related to our leases, please see “Note 11 — Leases” to the consolidated financial statements included in this report.\nPurchase Obligations\nPurchase obligation amounts include minimum purchase commitments for advertising, capital expenditures (including for computer equipment, software applications, engineering development services, and construction contracts) and other goods and services entered into in the ordinary course of business. As of December 31, 2024, we had purchase obligations of $86 million, with $64 million payable within 12 months.\nIncome Taxes\nThe timing of the resolution and/or closure of audits is highly uncertain. Given the number of years remaining subject to examination and the number of matters being examined, we are unable to estimate the full range of possible adjustments to the balance of gross unrecognized tax benefits. We expect the gross amount of unrecognized tax benefits to be reduced within the next 12 months by at least $170 million.\nAs of December 31, 2024, our assets classified as cash and cash equivalents as well as short-term and long-term non-equity investments included assets held in certain of our foreign operations totaling $1.6 billion. As we repatriate these funds to the United States, we will be required to pay income taxes in certain U.S. states and applicable foreign withholding taxes on those amounts during the period when such repatriation occurs. We have accrued deferred taxes for the tax effect of repatriating the funds to the United States. For additional details related to our income taxes, please see “Income Tax Provision” in our Results of Operations above and “Note 15 — Income Taxes” to the consolidated financial statements included in this report.\nStock Repurchases\nOur stock repurchase programs are intended to programmatically offset the impact of dilution from our equity compensation programs and, subject to market conditions and other factors, to make opportunistic and programmatic repurchases of our common stock to reduce our outstanding share count and return value to stockholders. Any share repurchases under our stock repurchase programs will be funded from our working capital or other financing alternatives.\nWe expect to continue making opportunistic and programmatic repurchases of our common stock, subject to market conditions and other uncertainties. However, our stock repurchase programs may be limited or terminated at any time without prior notice. The timing and actual number of shares repurchased will depend on a variety of factors, including corporate and regulatory requirements, price and other market conditions and management’s determination as to the appropriate use of our cash.\nIn February and December 2024, our Board authorized an incremental $2.0 billion and $3.0 billion, respectively, under our stock repurchase program in addition to the $4.0 billion previously authorized in 2022. Our stock repurchase program has no expiration from the date of authorization.\n51\nTable of Contents\nDuring 2024, we repurchased $3.1 billion of our common stock under our stock repurchase program. As of December 31, 2024, a total of $3.3 billion remained available for future repurchases of our common stock. See “Note 13 — Stockholders’ Equity” to the consolidated financial statements included in this report for more information about our stock repurchase program.\nDividends\nWe paid a total of $533 million and $528 million in cash dividends in 2024 and 2023, respectively. In February 2025, our Board declared a cash dividend of $0.29 per share of common stock to be paid on March 28, 2025 to stockholders of record as of March 14, 2025.\nOther Capital Resource Requirements\nWe actively monitor all counterparties that hold our cash and cash equivalents and non-equity investments, focusing primarily on the safety of principal and secondarily on improving yield on these assets. We diversify our cash and cash equivalents and investments among various counterparties in order to reduce our exposure should any one of these counterparties fail or encounter difficulties. To date, we have not experienced any material loss or lack of access to our invested cash, cash equivalents or short-term investments; however, we can provide no assurances that access to our invested cash, cash equivalents or short-term investments will not be impacted by adverse conditions in the financial markets, including, without limitation, as a result of the impact of geopolitical events, inflationary pressure and foreign exchange rate volatility. At any point in time we have funds in our operating accounts and customer accounts that are deposited and invested with third party financial institutions.\nWe have entered into various indemnification agreements and, in the ordinary course of business, we have included limited indemnification provisions in certain of our agreements with parties with which we have commercial relations. It is not possible to determine the maximum potential loss under these various indemnification provisions due to our limited history of prior indemnification claims and the unique facts and circumstances involved in each particular provision. To date, losses recognized in our consolidated statement of income in connection with our indemnification provisions have not been significant, either individually or collectively. See “Note 12 — Commitments and Contingencies” to the consolidated financial statements included in this report for more information about our indemnification provisions.\n52\nTable of Contents\nCritical Accounting Policies, Judgments and Estimates\nGeneral \nThe preparation of our consolidated financial statements and related notes requires us to make judgments, estimates and assumptions that affect the reported amounts of assets, liabilities, revenue and expenses, and related disclosure of contingent assets and liabilities. We have based our estimates on historical experience and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Our senior management has discussed the development, selection and disclosure of these estimates with the Audit Committee of our Board of Directors. Actual results may differ from these estimates under different assumptions or conditions. \nAn accounting policy is considered to be critical if it requires an accounting estimate to be made based on assumptions about matters that are highly uncertain at the time the estimate is made, and if different estimates that reasonably could have been used, or changes in the accounting estimates that are reasonably likely to occur periodically, could materially impact the consolidated financial statements. We believe the following critical accounting policies reflect the more significant estimates and assumptions used in the preparation of our consolidated financial statements. The following descriptions of critical accounting policies, judgments and estimates should be read in conjunction with our consolidated financial statements and related notes and other disclosures included in this report. \nRevenue Recognition\nWe may enter into certain revenue contracts that include promises to transfer multiple goods or services, including discounts on future services. We also may enter into arrangements to purchase services from certain customers. As a result, significant interpretation and judgment is sometimes required to determine the appropriate accounting for these transactions, including: (1) whether services are considered distinct performance obligations that should be accounted for separately or combined; (2) developing an estimate of the stand-alone selling price of each distinct performance obligation; (3) whether revenue should be reported gross (as eBay is acting as a principal), or net (as eBay is acting as an agent); (4) evaluating whether a promotion or incentive is a payment to a customer; and (5) whether the arrangement would be characterized as revenue or reimbursement of costs incurred. Changes in judgments with respect to these assumptions and estimates could impact the timing or amount of revenue recognition.\nIncome Taxes\nOur annual tax rate is based on our income, statutory tax rates and tax planning opportunities available to us in the various jurisdictions in which we operate. Tax laws are complex and subject to different interpretations by the taxpayer and respective government taxing authorities. Significant judgment is required in determining our tax expense and in evaluating our tax positions, including evaluating uncertainties and the complexity of taxes on foreign earnings. We review our tax positions quarterly and adjust the balances as new information becomes available. Tax positions are evaluated for potential reserves for uncertainty based on the estimated probability of sustaining the position under examination. Our income tax rate is affected by the tax rates that apply to our foreign earnings including U.S. minimum taxes on foreign earnings. The deferred tax benefit derived from the amortization of our intellectual property is based on the fair value, which has been agreed with foreign tax authorities. The deferred tax benefit may from time to time change based on changes in tax rates. Management has no specific plans to indefinitely reinvest the undistributed earnings of our foreign subsidiaries at the balance sheet date. \nDeferred tax assets represent amounts available to reduce income taxes payable on taxable income in future years. Such assets arise because of temporary differences between the financial reporting and tax bases of assets and liabilities, as well as from net operating loss and tax credit carryforwards. We evaluate the recoverability of these future tax deductions and credits by assessing the adequacy of future expected taxable income from all sources, including reversal of taxable temporary differences, forecasted operating earnings and available tax planning strategies. These sources of income rely heavily on estimates that are based on a number of factors, including our historical experience and short-range and long-range business forecasts. As of December 31, 2024, we had a valuation allowance on certain net operating loss and tax credit carryforwards based on our assessment that it is more likely than not that the deferred tax asset will not be realized.\n53\nTable of Contents\nWe recognize and measure uncertain tax positions in accordance with generally accepted accounting principles in the United States, or GAAP, pursuant to which we only recognize the tax benefit from an uncertain tax position if it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position. The tax benefits recognized in the financial statements from such positions are then measured based on the largest benefit that has a greater than 50 percent likelihood of being realized upon ultimate settlement. We report a liability for unrecognized tax benefits resulting from uncertain tax positions taken or expected to be taken in a tax return. GAAP further requires that a change in judgment related to the expected ultimate resolution of uncertain tax positions be recognized in earnings in the quarter in which such change occurs. We recognize interest and penalties, if any, related to unrecognized tax benefits in income tax expense. \nWe file annual income tax returns in multiple taxing jurisdictions around the world. A number of years may elapse before an uncertain tax position is audited by the relevant tax authorities and finally resolved. While it is often difficult to predict the final outcome or the timing of resolution of any particular uncertain tax position, we believe that our reserves for income taxes reflect the most likely outcome. We adjust these reserves, as well as the related interest, where appropriate in light of changing facts and circumstances. Settlement of any particular position could require the use of cash. \nOur future effective tax rates could be adversely affected by earnings being lower than anticipated in countries where we have lower statutory rates and higher than anticipated in countries where we have higher statutory rates, by changes in the valuation of our deferred tax assets or liabilities, or by changes or interpretations in tax laws, regulations or accounting principles. In addition, we are subject to the continuous examination of our income tax returns by the Internal Revenue Service, as well as various state and foreign tax authorities. We regularly assess the likelihood of adverse outcomes resulting from these examinations to determine the adequacy of our provision for income taxes. \nBased on our results for the year ended December 31, 2024, a one-percentage point change in our provision for income taxes as a percentage of income before taxes would have resulted in an increase or decrease in the provision of $23 million, resulting in an approximate $0.05 change in diluted earnings per share. \nGoodwill\nThe purchase price of an acquired company is allocated between intangible assets and the net tangible assets of the acquired business with the residual of the purchase price recognized as goodwill. \nAs of December 31, 2024, our goodwill totaled $4.3 billion. We assess the impairment of goodwill of our reporting unit annually, or more often if events or changes in circumstances indicate that the carrying value may not be recoverable. Goodwill is tested for impairment at the reporting unit level by first performing a qualitative assessment to determine whether it is more likely than not that the fair value of the reporting unit is less than its carrying value. If the reporting unit does not pass the qualitative assessment, then the reporting unit’s carrying value is compared to its fair value. The fair value of the reporting unit is estimated using market and discounted cash flow approaches. Goodwill is considered impaired if the carrying value of the reporting unit exceeds its fair value. The discounted cash flow approach uses expected future operating results. The market approach uses comparable company information to determine revenue and earnings multiples to value our reporting unit. Failure to achieve these expected results or market multiples may cause a future impairment of goodwill at the reporting unit. We conducted our annual impairment test of goodwill as of August 31, 2024 and 2023. As of December 31, 2024, we determined that no impairment of the carrying value of goodwill was required. See “Note 4 — Goodwill and Intangible Assets” to the consolidated financial statements included in this report. \nLegal Contingencies \nIn connection with certain pending litigation and other claims, we have estimated the range of probable loss, net of expected recoveries, and provided for such losses through charges to our consolidated statements of income. These estimates have been based on our assessment of the facts and circumstances at each balance sheet date and are subject to change based upon new information and future events. \n54\nTable of Contents\nFrom time to time, we are involved in disputes and regulatory inquiries that arise in the ordinary course of business. We are currently involved in legal proceedings, some of which are discussed in “Note 12 — Commitments and Contingencies” to the consolidated financial statements included in this report. We believe that we have meritorious defenses to the claims against us, and we intend to defend ourselves vigorously. However, even if successful, our defense against certain actions will be costly and could require significant amounts of management’s time and result in the diversion of significant operational resources. If the plaintiffs were to prevail on certain claims, we might be forced to pay significant damages and licensing fees, modify our business practices or even be prohibited from conducting a significant part of our business. Any such results could materially harm our business and could result in a material adverse impact on the financial position, results of operations or cash flows. \nRecent Accounting Pronouncements\nSee \"Note 1 — The Company and Summary of Significant Accounting Policies\" to the consolidated financial statements included in this report, regarding the impact of certain recent accounting pronouncements in our consolidated financial statements.\n55\nTable of Contents\nITEM 7A:\n  QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nInterest Rate Risk\nWe are exposed to interest rate risk relating to our investments and outstanding debt. In addition, adverse economic conditions and events (including volatility or distress in the equity and/or debt or credit markets) may impact regional and global financial markets. These events and conditions could cause us to write down our assets or investments. We seek to reduce earnings volatility that may result from adverse economic conditions and events or changes in interest rates.\nThe primary objective of our investment activities is to preserve principal while at the same time improving yields without significantly increasing risk. To achieve this objective, we maintain our cash equivalents, customer accounts and short-term and long-term investments in a variety of asset types, including bank deposits, government bonds and corporate debt securities. As of December 31, 2024, approximately 35% of our total cash and investments was held in “Cash and cash equivalents” and “Customer accounts.” As such, changes in interest rates will impact interest income. As discussed below, the fair market values of our fixed rate securities may be adversely affected due to a rise in interest rates, and we may suffer losses in principal if we are forced to sell securities that have declined in market value due to changes in interest rates. \n \nAs of December 31, 2024, the balance of our corporate debt and government bond securities was $4.8 billion, which represented approximately 52% of our total cash and investments. Investments in both fixed-rate and floating-rate interest-earning instruments carry varying degrees of interest rate risk. The fair market value of our fixed-rate investment securities may be adversely impacted due to a rise in interest rates. In general, fixed-rate securities with longer maturities are subject to greater interest rate risk than those with shorter maturities. While floating rate securities generally are subject to less interest rate risk than fixed-rate securities, floating-rate securities may produce less income than expected if interest rates decrease and may also suffer a decline in market value if interest rates increase. Due in part to these factors, our investment income may fall short of expectations or we may suffer losses in principal if we sell securities that have declined in market value due to changes in interest rates. A hypothetical 1% (100 basis point) increase in interest rates would have resulted in a decrease in the fair value of our investments of $49 million and $20 million as of December 31, 2024 and 2023, respectively.\nFurther changes in interest rates will impact “Interest expense” on any borrowings under our revolving credit facility, which bear interest at floating rates, and the interest rate on any commercial paper borrowings we make and any debt securities we may issue in the future and, accordingly, will impact “Interest expense.” For additional details related to our debt, see “Note 10 — Debt” to our consolidated financial statements included in this report. \n \nEquity Price Risk\nEquity Investments\nOur equity investments are primarily investments in privately-held companies. Our consolidated results of operations include, as a component of “Interest income and other, net,” our share of the net income or loss of the equity investments accounted for under the equity method of accounting, and as a component of “Gain (loss) on equity investments and warrant, net,” the change in fair value of the equity method investments accounted for under the fair value option. Equity investments without readily determinable fair values are accounted for at cost, less impairment and adjusted for subsequent observable price changes obtained from orderly transactions for identical or similar investments issued by the same investee. Such changes in the basis of the equity investment are recognized in “Gain (loss) on equity investments and warrant, net.” \nEquity investments under the fair value option are measured at fair value based on a quarterly valuation analysis and\n are classified within Level 3 in the fair value hierarchy as the valuation reflects management’s estimate of assumptions that market participants would use in pricing the equity investment. \nS\nubsequent changes in fair value are recognized in “Gain (loss) on equity investments and warrant, net.”\nAs of December 31, 2024, our equity investments totaled $1.1 billion, which represented approximately 12% of our total cash and investments, and primarily related to our equity investment in Adevinta. \nFor additional details related to our investments, please see “Note 6 — Investments” to our consolidated financial statements included in this report.\n56\nTable of Contents\nForeign Currency Risk\nOur Marketplace platforms operate globally, resulting in certain revenues and costs that are denominated in foreign currencies, primarily the British pound and euro, subjecting us to foreign currency risk, which may adversely impact our financial results. We transact business in various foreign currencies and have significant international revenues as well as costs. In addition, we charge our international subsidiaries for their use of intellectual property and technology and for certain corporate services we provide. Our cash flow and results of operations that are exposed to foreign exchange rate fluctuations may differ materially from expectations and we may record significant gains or losses due to foreign currency fluctuations and related hedging activities.\nWe have a foreign exchange exposure management program designed to identify material foreign currency exposures, manage these exposures and reduce the potential effects of currency fluctuations in our reported consolidated statement of cash flows and results of operations through the purchase of foreign currency exchange contracts. The effectiveness of the program and resulting usage of foreign exchange derivative contracts is at times limited by our ability to achieve cash flow hedge accounting. For additional details related to our derivative instruments, please see “Note 7 — Derivative Instruments” to our consolidated financial statements included in this report. \nWe use foreign exchange derivative contracts to help protect our forecasted U.S. dollar-equivalent earnings from adverse changes in foreign currency exchange rates. These hedging contracts reduce, but do not entirely eliminate, the impact of adverse currency exchange rate movements. Most of these contracts are designated as cash flow hedges for accounting purposes. For qualifying cash flow hedges, the derivative’s gain or loss is initially reported as a component of “Accumulated other comprehensive income” and subsequently reclassified into earnings in the same period the forecasted transaction affects earnings. For contracts not designated as cash flow hedges for accounting purposes, the derivative’s gain or loss is recognized immediately in earnings in our consolidated statement of income. However, only certain revenue and costs are eligible for cash flow hedge accounting. \nThe following table illustrates the fair values of outstanding foreign exchange contracts designated as cash flow hedges and foreign exchange contracts not designated for hedge accounting and the before-tax effect on fair values of a hypothetical adverse change in the foreign exchange rates that existed as of December 31, 2024. The sensitivity for foreign currency contracts is based on a 20% adverse change in foreign exchange rates, against relevant functional currencies.\n \nFair Value Asset/(Liability)\nFair Value Sensitivity\n(In millions)\nForeign exchange contracts - Cash flow hedges\n$\n55 \n$\n(89)\nForeign exchange contracts - Not designated for hedge accounting\n$\n2 \n$\n(72)\nSince our risk management programs are highly effective, the potential loss in value described above would be largely offset by changes in the value of the underlying exposure.\nWe also use foreign exchange contracts to offset the foreign exchange risk on our assets and liabilities denominated in currencies other than the functional currency of our subsidiaries. These contracts reduce, but do not entirely eliminate, the impact of currency exchange rate movements on our assets and liabilities. The foreign currency gains and losses on our assets and liabilities are recognized in “Interest income and other, net,” which are offset by the gains and losses on the foreign exchange contracts.\nWe considered the historical trends in currency exchange rates and determined that it was reasonably possible that adverse changes in exchange rates of 20% for all currencies could be experienced in the near term. Taking into consideration the offsetting effect of foreign exchange forwards in place, these changes would have resulted in an immaterial adverse impact on income before income taxes as of December 31, 2024.\n57\nTable of Contents\nITEM 8:  \nFINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe consolidated financial statements and accompanying notes listed in Part IV, Item 15(a)(1) of this Annual Report on Form 10-K are included elsewhere in this Annual Report on Form 10-K. \nITEM 9: \nCHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. \nITEM 9A:  \nCONTROLS AND PROCEDURES\nEvaluation of disclosure controls and procedures:\n Based on the evaluation of our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended, or the Exchange Act) required by Exchange Act Rules 13a-15(b) or 15d-15(b), our principal executive officer and our principal financial officer have concluded that our disclosure controls and procedures were effective as of December 31, 2024. \nChanges in internal controls:\n There were no changes in our internal control over financial reporting (as defined in Exchange Act Rule 13a-15(f)) identified in connection with the evaluation required by Exchange Act Rules 13a-15(d) or 15d-15(d) that occurred during our most recently completed fiscal quarter that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nManagement’s annual report on internal control over financial reporting:\n Our management is responsible for establishing and maintaining adequate internal control over financial reporting. Our management, including our principal executive officer and principal financial officer, conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework in \nInternal Control - Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on its evaluation under the framework in \nInternal Control - Integrated Framework\n, our management concluded that our internal control over financial reporting was effective as of December 31, 2024.\nThe effectiveness of our internal control over financial reporting as of December 31, 2024 has been audited by PricewaterhouseCoopers LLP, an independent registered public accounting firm, as stated in their report which appears in Item 15(a)1 of this Annual Report on Form 10-K.\n58\nTable of Contents\nITEM 9B:  \nOTHER INFORMATION\nOn \nDecember 12, 2024\n, \nSteve Priest\n, our \nChief Financial Officer\n, \nadopted\n a written trading plan intended to satisfy the affirmative defense conditions of Rule 10b5-1(c) under the Exchange Act (a “10b5-1 Plan”), which is designed to be in effect until \nDecember 18, 2025\n, subject to customary exceptions. His 10b5-1 Plan provides for the sale from time to time of certain shares of eBay common stock that he could receive upon the future vesting of certain outstanding equity awards, net of any shares withheld by us to satisfy applicable taxes. The number of shares to be withheld, and the number of shares available to be sold pursuant to Mr. Priest’s 10b5-1 Plan, can only be determined upon the occurrence of future vesting events. For purposes of this disclosure, without subtracting any shares to be withheld upon future vesting events, and assuming maximum achievement level on the remaining components of certain outstanding performance-based equity awards, the maximum aggregate number of shares to be sold pursuant to Mr. Priest’s 10b5-1 Plan is \n182,412\n.\nOn \nDecember 12, 2024\n, \nEddie Garcia\n, our \nSenior Vice President, Chief Product Officer,\n \nadopted\n a 10b5-1 Plan, which is designed to be in effect until \nFebruary 19, 2026\n, subject to customary exceptions. His 10b5-1 Plan calls for potential exercise and sale from time to time of (1) a portion of the shares underlying his options and additional options that he could receive upon future vesting of certain other performance-based option awards, and (2) shares of eBay common stock that he could receive upon the future vesting of certain outstanding equity awards that he could receive upon the future vesting of certain other outstanding equity awards, in each case, net of any shares withheld by us to satisfy applicable taxes and payment of the aggregate exercise price (if applicable). The number of shares to be withheld, and the number of shares available to be sold pursuant to Mr. Garcia’s 10b5-1 Plan, can only be determined upon the occurrence of future vesting events. For purposes of this disclosure, without subtracting any shares to be withheld upon future vesting events or payment of the aggregate exercise price, and assuming maximum achievement level on the remaining components of certain outstanding performance-based equity awards, the maximum aggregate number of shares to be sold pursuant to Mr. Garcia’s 10b5-1 Plan is \n322,534\n.\nITEM 9C:  \nDISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable. \nTable of Contents\nPART III \nITEM 10:  \nDIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nIncorporated by reference from our Proxy Statement for our 2025 Annual Meeting of Stockholders to be filed with the SEC within 120 days after the end of the year ended December 31, 2024. \nInsider Trading Policy, Code of Ethics, Governance Guidelines and Committee Charters \nWe have \nadopted\n an \nInsider Trading Policy\n governing the purchase, sale, and other dispositions of our securities that applies to our directors, officers, employees, consultants, and contractors. We also follow certain procedures for the repurchase of our securities. We believe that our \nInsider Trading Policy\n and repurchase procedures are reasonably designed to promote compliance with insider trading laws, rules and regulations, and listing standards applicable to us. A copy of our \nInsider Trading Policy\n is filed as Exhibit 19.01 to this Annual Report on Form 10-K.\nWe have also adopted a \nCode of Business Conduct and Ethics \nthat applies to all of our employees and directors. The \nCode of Business Conduct and Ethics \nis posted on our website at \nhttps://investors.ebayinc.com/corporate-governance/governance-documents/. \nWe will post any amendments to or waivers from the \nCode of Business Conduct and Ethics \nat that location. \nWe have also adopted \nGovernance Guidelines for the Board of Directors \nand a written committee charter for each of our Audit Committee, Compensation and Human Capital Committee and Corporate Governance and Nominating Committee. Each of these documents is available on our website at \nhttps://investors.ebayinc.com/corporate-governance/governance-documents/.\n \nITEM 11:  \nEXECUTIVE COMPENSATION\nIncorporated by reference from our Proxy Statement for our 2025 Annual Meeting of Stockholders to be filed with the SEC within 120 days after the end of the year ended December 31, 2024. \nITEM 12:  \nSECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nIncorporated by reference from our Proxy Statement for our 2025 Annual Meeting of Stockholders to be filed with the SEC within 120 days after the end of the year ended December 31, 2024. \nITEM 13:  \nCERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nIncorporated by reference from our Proxy Statement for our 2025 Annual Meeting of Stockholders to be filed with the SEC within 120 days after the end of the year ended December 31, 2024. \nITEM 14:  \nPRINCIPAL ACCOUNTANT FEES AND SERVICES\nIncorporated by reference from our Proxy Statement for our 2025 Annual Meeting of Stockholders to be filed with the SEC within 120 days after the end of the year ended December 31, 2024. \n60\nTable of Contents\nPART IV \nITEM 15:\n  EXHIBITS AND FINANCIAL STATEMENT SCHEDULE\n \na.\nThe following documents are filed as part of this report: \nPage Number\n1. Consolidated Financial Statements:\nReport of Independent Registered Public Accounting Firm (PCAOB ID \n238\n)\n62\nConsolidated Balance Sheet\n64\nConsolidated Statement of Income\n65\nConsolidated Statement of Comprehensive Income\n66\nConsolidated Statement of Stockholders’ Equity\n67\nConsolidated Statement of Cash Flows\n68\nNotes to Consolidated Financial Statements\n70\n2. Financial Statement Schedule\nSchedule II - Valuation and Qualifying Accounts\n114\nAll other schedules have been omitted because the information required to be set forth therein is not applicable or is shown in the financial statements or notes thereto. \n3. Exhibits Required by Item 601 of Regulation S-K\nThe information required by this Item is set forth in the Index to Exhibits that precedes the signature page of this Annual Report.\n115\nb.\nThe information required by this Item is set forth in the Index to Exhibits that precedes the signature page of this Annual Report.\nc.\nFinancial Statement Schedule and Separate Financial Statements of Subsidiaries Not Consolidated and\nFifty Percent or Less Owned Persons\nAdevinta was deemed a significant equity investee under Rule 3-09 of Regulation S-X for the fiscal year ended December 31, 2023 (though not for the fiscal years ended December 31, 2022 or 2024). As such, pursuant to Rule 3-09 of Regulation S-X, separate financial statements of Adevinta for the fiscal years ended December 31, 2023 and 2022, as well as for the portion of the fiscal year ended December 31, 2024 in which eBay’s investment in Adevinta was accounted for by eBay pursuant to the equity method, are required to be filed by amendment to this Annual Report on Form 10-K within six months of Adevinta’s fiscal year end.  Accordingly, financial statements of Adevinta for a certain period of the fiscal year ended December 31, 2024 will be filed via an amendment to this Annual Report on Form 10-K on or before June 30, 2025.\nITEM 16:\n  FORM 10-K SUMMARY\n \nNone.\n61\nTable of Contents\nReport of Independent Registered Public Accounting Firm \nTo the\n \nBoard of Directors and Stockholders of eBay Inc.\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheet of eBay Inc. and its subsidiaries\n \n(the “Company”) as of December 31, 2024\n \nand 2023,\n \nand the related consolidated statements of income, of comprehensive income, of stockholders’ equity and of cash flows for each of the three years in the period ended December 31, 2024, including the related notes and schedule of valuation and qualifying accounts for each of the three years in the period ended December 31, 2024 appearing under Item 15a.2. (collectively referred to as the “consolidated financial statements”).\n \nWe also have audited the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control - Integrated Framework\n \n(2013)\n \nissued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated\n \nfinancial statements referred to above present fairly, in all material respects, the financial position of the Company as of December 31, 2024\n \nand 2023\n, \nand the results of its\n \noperations and its\n \ncash flows for each of the three years in the period ended December 31, 2024\n \nin conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control - Integrated Framework\n \n(2013)\n \nissued by the COSO.\nBasis for Opinions\nThe Company's management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in Management’s annual report on internal control over financial reporting appearing under Item 9A. Our responsibility is to express opinions on the Company’s consolidated\n \nfinancial statements and on the Company's internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated\n \nfinancial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated\n \nfinancial statements included performing procedures to assess the risks of material misstatement of the consolidated\n \nfinancial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated\n \nfinancial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated\n \nfinancial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n62\nTable of Contents\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that (i) relates to accounts or disclosures that are material to the\n \nconsolidated financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated\n \nfinancial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nIncome Taxes – Unrecognized Tax Benefits and Taxes on Foreign Earnings\nAs described in Notes 1 and 15 to the consolidated financial statements, significant judgment is required in determining the Company’s tax expense and in evaluating management’s tax positions, including evaluating uncertainties and the complexity of taxes on foreign earnings. As disclosed by management, the Company’s income tax rate is affected by the tax rates that apply to their foreign earnings including U.S. minimum taxes on foreign earnings. The deferred tax benefit derived from the amortization of the Company’s intellectual property is based on the fair value, which has been agreed with foreign tax authorities. The deferred tax benefit may from time to time change based on changes in tax rates. Management recognizes and measures uncertain tax positions in accordance with generally accepted accounting principles in the U.S., or GAAP, pursuant to which management only recognizes the tax benefit from an uncertain tax position if it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position. Tax positions are evaluated for potential reserves for uncertainty based on the estimated probability of sustaining the position under examination. The total income tax expense for the year ended December 31, 2024 was $297 million and gross amounts of unrecognized tax benefits were $674 million as of December 31, 2024.\nThe principal considerations for our determination that performing procedures relating to income taxes - unrecognized tax benefits and taxes on foreign earnings is a critical audit matter are the significant judgment by management when evaluating tax positions relating to unrecognized tax benefits and taxes on foreign earnings, which in turn led to a high degree of auditor judgment, effort, and subjectivity in performing audit procedures and evaluating audit evidence relating to unrecognized tax benefits and taxes on foreign earnings. The audit effort also involved the use of professionals with specialized skill and knowledge.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to income taxes, including controls over unrecognized tax benefits and taxes on foreign earnings. These procedures also included, among others, evaluating tax positions taken by management, including evaluating the reasonableness of management’s determination of the probability of sustaining the position under tax examination and identification of changes to tax positions, evaluating communications with the relevant tax authorities, testing applicable tax rates applied by management, and evaluating the impact of taxes on foreign earnings, including the calculation of U.S. minimum taxes on foreign earnings and the deferred tax benefit derived from the amortization of the Company’s intellectual property. Professionals with specialized skill and knowledge were used to assist in testing the calculation of taxes on foreign earnings.\n/s/ \nPricewaterhouseCoopers LLP\nSan Jose, California\nFebruary 27, 2025\nWe have served as the Company’s auditor since 1997.\n63\nTable of Contents\neBay Inc. \nCONSOLIDATED BALANCE SHEET \nDecember 31,\n \n2024\n \n2023\n \n(In millions, except par value)\nASSETS\nCurrent assets:\n \n \nCash and cash equivalents\n$\n2,433\n \n$\n1,985\n \nShort-term investments\n3,457\n \n2,533\n \nEquity investment in Adevinta\n—\n \n4,474\n \nCustomer accounts and funds receivable\n962\n \n1,013\n \nOther current assets\n715\n \n1,011\n \nTotal current assets\n7,567\n \n11,016\n \nLong-term investments\n2,439\n \n1,129\n \nProperty and equipment, net\n1,263\n \n1,243\n \nGoodwill\n4,269\n \n4,267\n \nOperating lease right-of-use assets\n427\n \n493\n \nDeferred tax assets\n2,936\n \n3,089\n \nOther assets\n464\n \n383\n \nTotal assets\n$\n19,365\n \n$\n21,620\n \nLIABILITIES AND STOCKHOLDERS’ EQUITY\nCurrent liabilities:\n \n \nShort-term debt\n$\n1,673\n \n$\n750\n \nAccounts payable\n257\n \n267\n \nCustomer accounts and funds payable\n1,018\n \n1,054\n \nAccrued expenses and other current liabilities\n2,184\n \n2,196\n \nIncome taxes payable\n966\n \n253\n \nTotal current liabilities\n6,098\n \n4,520\n \nOperating lease liabilities \n320\n \n387\n \nDeferred tax liabilities\n1,405\n \n2,408\n \nLong-term debt\n5,752\n \n6,973\n \nOther liabilities\n632\n \n936\n \nTotal liabilities\n14,207\n \n15,224\n \nCommitments and contingencies (Note 12)\nStockholders’ equity:\nCommon stock, $\n0.001\n par value; \n3,580\n shares authorized; \n471\n and \n517\n shares outstanding\n2\n \n2\n \nAdditional paid-in capital\n18,289\n \n17,792\n \nTreasury stock at cost, \n1,274\n and \n1,218\n shares\n(\n51,290\n)\n(\n48,114\n)\nRetained earnings\n37,951\n \n36,531\n \nAccumulated other comprehensive income\n206\n \n185\n \nTotal stockholders’ equity\n5,158\n \n6,396\n \nTotal liabilities and stockholders’ equity\n$\n19,365\n \n$\n21,620\n \nThe accompanying notes are an integral part of these consolidated financial statements. \n64\nTable of Contents\neBay Inc. \nCONSOLIDATED STATEMENT OF INCOME \n \nYear Ended December 31,\n \n2024\n2023\n2022\n \n(In millions, except per share amounts)\nNet revenues\n$\n10,283\n \n$\n10,112\n \n$\n9,795\n \nCost of net revenues\n2,880\n \n2,833\n \n2,680\n \nGross profit\n7,403\n \n7,279\n \n7,115\n \nOperating expenses:\n \nSales and marketing\n2,319\n \n2,217\n \n2,136\n \nProduct development\n1,479\n \n1,544\n \n1,330\n \nGeneral and administrative\n914\n \n1,196\n \n963\n \nProvision for transaction losses\n353\n \n360\n \n332\n \nAmortization of acquired intangible assets\n20\n \n21\n \n4\n \nTotal operating expenses\n5,085\n \n5,338\n \n4,765\n \nIncome from operations\n2,318\n \n1,941\n \n2,350\n \nInterest and other:\nGain (loss) on equity investments and warrant, net\n(\n76\n)\n1,832\n \n(\n3,786\n)\nInterest expense\n(\n259\n)\n(\n263\n)\n(\n235\n)\nInterest income and other, net\n295\n \n197\n \n70\n \nIncome (loss) from continuing operations before income taxes\n2,278\n \n3,707\n \n(\n1,601\n)\nIncome tax benefit (provision)\n(\n297\n)\n(\n932\n)\n327\n \nIncome (loss) from continuing operations\n$\n1,981\n \n$\n2,775\n \n$\n(\n1,274\n)\nIncome (loss) from discontinued operations, net of income taxes\n(\n6\n)\n(\n8\n)\n5\n \nNet income (loss)\n$\n1,975\n \n$\n2,767\n \n$\n(\n1,269\n)\nIncome (loss) per share - basic:\n \n \nContinuing operations\n$\n4.00\n \n$\n5.24\n \n$\n(\n2.28\n)\nDiscontinued operations\n(\n0.01\n)\n(\n0.02\n)\n0.01\n \nNet income (loss) per share - basic\n$\n3.99\n \n$\n5.22\n \n$\n(\n2.27\n)\nIncome (loss) per share - diluted:\nContinuing operations\n$\n3.95\n \n$\n5.21\n \n$\n(\n2.28\n)\nDiscontinued operations\n(\n0.01\n)\n(\n0.02\n)\n0.01\n \nNet income (loss) per share - diluted\n$\n3.94\n \n$\n5.19\n \n$\n(\n2.27\n)\nWeighted average shares:\n \n \nBasic\n496\n \n530\n \n558\n \nDiluted\n501\n \n533\n \n558\n \nThe accompanying notes are an integral part of these consolidated financial statements. \n65\nTable of Contents\neBay Inc.\nCONSOLIDATED STATEMENT OF COMPREHENSIVE INCOME\nYear Ended December 31,\n \n2024\n2023\n2022\n \n(In millions)\nNet income (loss)\n$\n1,975\n \n$\n2,767\n \n$\n(\n1,269\n)\nOther comprehensive income (loss), net of reclassification adjustments:\n \n \n \nForeign currency translation adjustment\n(\n76\n)\n(\n16\n)\n(\n106\n)\nUnrealized gains (losses) on investments, net\n38\n \n53\n \n(\n91\n)\nTax benefit (expense) on unrealized gains (losses) on investments, net\n(\n9\n)\n(\n11\n)\n20\n \nUnrealized gains (losses) on hedging activities, net\n88\n \n(\n127\n)\n49\n \nTax benefit (expense) on unrealized gains (losses) on hedging activities, net\n(\n20\n)\n27\n \n(\n11\n)\nOther comprehensive income (loss), net of tax\n21\n \n(\n74\n)\n(\n139\n)\nComprehensive income (loss)\n$\n1,996\n \n$\n2,693\n \n$\n(\n1,408\n)\nThe accompanying notes are an integral part of these consolidated financial statements. \n66\nTable of Contents\neBay Inc. \nCONSOLIDATED STATEMENT OF STOCKHOLDERS’ EQUITY \n \nYear Ended December 31,\n \n2024\n \n2023\n \n2022\n \n(In millions, except per share amounts)\nCommon stock:\n \n \nBalance, beginning of year\n$\n2\n \n \n$\n2\n \n \n$\n2\n \nCommon stock issued\n— \n \n— \n \n— \nCommon stock repurchased\n— \n— \n— \nBalance, end of year\n2\n \n \n2\n \n \n2\n \nAdditional paid-in-capital:\n \n \nBalance, beginning of year\n17,792\n \n \n17,279\n \n \n16,659\n \nCommon stock and stock-based awards issued\n87\n \n \n83\n \n \n87\n \nTax withholdings related to net share settlements of restricted stock awards and units\n(\n199\n)\n(\n161\n)\n(\n160\n)\nStock-based compensation\n590\n \n \n575\n \n \n494\n \nForward contract for share repurchase\n— \n— \n188\n \nOther\n19\n \n16\n \n11\n \nBalance, end of year\n18,289\n \n \n17,792\n \n \n17,279\n \nTreasury stock at cost:\n \n \nBalance, beginning of year\n(\n48,114\n)\n \n(\n46,702\n)\n \n(\n43,371\n)\nCommon stock repurchased\n(\n3,176\n)\n \n(\n1,412\n)\n \n(\n3,331\n)\nBalance, end of year\n(\n51,290\n)\n \n(\n48,114\n)\n \n(\n46,702\n)\nRetained earnings:\n \n \nBalance, beginning of year\n36,531\n \n \n34,315\n \n \n36,090\n \nNet income (loss)\n1,975\n \n \n2,767\n \n \n(\n1,269\n)\nDividends and dividend equivalents declared\n(\n555\n)\n(\n551\n)\n(\n506\n)\nBalance, end of year\n37,951\n \n \n36,531\n \n \n34,315\n \nAccumulated other comprehensive income:\n \n \nBalance, beginning of year\n185\n \n \n259\n \n \n398\n \nChange in unrealized gains (losses) on investments\n38\n \n \n53\n \n \n(\n91\n)\nChange in unrealized gains (losses) on derivative instruments\n88\n \n \n(\n127\n)\n \n49\n \nForeign currency translation adjustment\n(\n76\n)\n \n(\n16\n)\n \n(\n106\n)\nTax benefit (provision) on above items\n(\n29\n)\n16\n \n9\n \nBalance, end of year\n206\n \n \n185\n \n \n259\n \nTotal stockholders’ equity\n$\n5,158\n \n$\n6,396\n \n \n$\n5,153\n \nNumber of shares:\n \n \nCommon stock - shares outstanding:\n \n \nBalance, beginning of year\n517\n \n \n539\n \n \n594\n \nCommon stock issued\n10\n \n \n10\n \n \n10\n \nCommon stock repurchased\n(\n56\n)\n \n(\n32\n)\n \n(\n65\n)\nBalance, end of year\n471\n \n \n517\n \n \n539\n \nDividends and dividend equivalents declared per share or restricted stock unit\n$\n1.08\n \n$\n1.00\n \n$\n0.88\n \nThe accompanying notes are an integral part of these consolidated financial statements. \n67\nTable of Contents\neBay Inc. \nCONSOLIDATED STATEMENT OF CASH FLOWS\n \nYear Ended December 31,\n \n2024\n2023\n2022\n \n(In millions)\nCash flows from operating activities:\n \n \nNet income (loss)\n$\n1,975\n \n$\n2,767\n \n$\n(\n1,269\n)\n(Income) loss from discontinued operations, net of income taxes\n6\n \n8\n \n(\n5\n)\nAdjustments:\n \n \nProvision for transaction losses\n353\n \n360\n \n332\n \nDepreciation and amortization\n324\n \n403\n \n442\n \nStock-based compensation\n588\n \n575\n \n494\n \nLoss on investments and other, net\n8\n \n(\n5\n)\n21\n \nDeferred income taxes\n(\n874\n)\n255\n \n(\n780\n)\nChange in fair value of warrant\n(\n158\n)\n(\n150\n)\n230\n \nChange in fair value of equity investment in Adevinta\n156\n \n(\n1,782\n)\n2,691\n \nChange in fair value of equity investment in Adyen\n57\n \n—\n \n261\n \nChange in fair value of equity investment in Gmarket\n13\n \n96\n \n294\n \nChange in fair value of equity investment in KakaoBank\n—\n \n(\n2\n)\n293\n \nChanges in assets and liabilities, net of acquisition effects\nOther current assets\n67\n \n(\n319\n)\n(\n33\n)\nOther non-current assets\n37\n \n474\n \n20\n \nAccounts payable\n(\n8\n)\n15\n \n6\n \nAccrued expenses and other liabilities\n(\n644\n)\n(\n212\n)\n(\n410\n)\nIncome taxes payable and other tax liabilities\n514\n \n(\n52\n)\n40\n \nNet cash provided by continuing operating activities\n2,414\n \n2,431\n \n2,627\n \nNet cash used in discontinued operating activities\n—\n \n(\n5\n)\n(\n373\n)\nNet cash provided by operating activities\n2,414\n \n2,426\n \n2,254\n \nCash flows from investing activities:\n \n \n \nPurchases of property and equipment\n(\n458\n)\n(\n456\n)\n(\n449\n)\nPurchases of investments\n(\n13,855\n)\n(\n13,874\n)\n(\n18,534\n)\nMaturities of investments\n12,306\n \n14,502\n \n20,626\n \nExercise of options under warrant\n(\n108\n)\n—\n \n—\n \nProceeds from sale of shares in Adevinta, net\n2,410\n \n—\n \n8\n \nProceeds from sale of shares in Adyen, net\n573\n \n—\n \n800\n \nProceeds from sale of shares in Aurelia, net\n1,036\n \n—\n \n—\n \nProceeds from sale of shares in Gmarket, net\n322\n \n—\n \n—\n \nProceeds from sale of shares in KakaoBank, net\n—\n \n106\n \n287\n \nAcquisition of TCGplayer, net of cash acquired\n—\n \n—\n \n(\n208\n)\nOther\n(\n13\n)\n(\n38\n)\n(\n71\n)\nNet cash provided by continuing investing activities\n2,213\n \n240\n \n2,459\n \nNet cash provided by discontinued investing activities\n—\n \n—\n \n2\n \nNet cash provided by investing activities\n2,213\n \n240\n \n2,461\n \nCash flows from financing activities:\n \n \n \nProceeds from issuance of common stock\n92\n \n83\n \n87\n \nRepurchases of common stock\n(\n3,149\n)\n(\n1,401\n)\n(\n3,143\n)\nPayments for taxes related to net share settlements of restricted stock units and awards\n(\n188\n)\n(\n171\n)\n(\n160\n)\nPayments for dividends\n(\n533\n)\n(\n528\n)\n(\n489\n)\nProceeds from issuance of long-term debt, net\n—\n \n—\n \n1,143\n \nRepayment of debt\n(\n750\n)\n(\n1,150\n)\n(\n1,355\n)\nBorrowings under commercial paper program\n441\n \n—\n \n—\n \nNet funds receivable and payable activity\n305\n \n717\n \n125\n \nOther\n(\n24\n)\n—\n \n—\n \n68\nTable of Contents\n \nYear Ended December 31,\n \n2024\n2023\n2022\n \n(In millions)\nNet cash used in financing activities\n(\n3,806\n)\n(\n2,450\n)\n(\n3,792\n)\nEffect of exchange rate changes on cash, cash equivalents and restricted cash\n(\n28\n)\n5\n \n(\n57\n)\nNet increase in cash, cash equivalents and restricted cash\n793\n \n221\n \n866\n \nCash, cash equivalents and restricted cash at beginning of period\n2,493\n \n2,272\n \n1,406\n \nCash, cash equivalents and restricted cash at end of period\n$\n3,286\n \n$\n2,493\n \n$\n2,272\n \nSupplemental cash flow disclosures of continuing operations:\n \n \n \nCash paid for:\nInterest\n$\n264\n \n$\n275\n \n$\n244\n \nIncome taxes\n$\n722\n \n$\n746\n \n$\n540\n \nThe following table reconciles cash, cash equivalents and restricted cash as reported in the consolidated balance sheet to the total of the same amounts presented in the consolidated statement of cash flows as of the dates indicated:\nDecember 31,\n2024\n2023\n2022\n(In millions)\nCash and cash equivalents\n$\n2,433\n \n$\n1,985\n \n$\n2,154\n \nCustomer accounts (including restricted cash of $\n238\n, $\n0\n and $\n0\n, respectively)\n763\n \n481\n \n69\n \nRestricted cash included in other current assets\n88\n \n23\n \n36\n \nRestricted cash included in other assets\n2\n \n4\n \n13\n \nCash, cash equivalents and restricted cash\n$\n3,286\n \n$\n2,493\n \n$\n2,272\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n69\nTable of Contents\neBay Inc. \nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nNote 1 — \nThe Company and Summary of Significant Accounting Policies\nThe Company \neBay Inc. is a global commerce leader that connects people and builds communities to create economic opportunity for all. Our technology empowers millions of buyers and sellers in more than 190 markets around the world, providing everyone the opportunity to grow and thrive. Our Marketplace platforms, including our online marketplace located at www.ebay.com and its localized counterparts, our off-platform marketplaces and our suite of mobile apps, together, create one of the world's largest and most vibrant marketplaces for discovering great value and unique selection.\nWhen we refer to “we,” “our,” “us,” the “Company” or “eBay” in this Annual Report on Form 10-K, we mean the current Delaware corporation (eBay Inc.) and its consolidated subsidiaries, unless otherwise expressly stated or the context otherwise requires.\nUse of Estimates \nThe preparation of consolidated financial statements in conformity with U.S. generally accepted accounting principles (“GAAP”) requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses during the reporting period. On an ongoing basis, we evaluate our estimates, including but not limited to those related to provisions for transaction losses, legal contingencies, income taxes, revenue recognition, stock-based compensation, investments, including Level 3 investments, warrants and the recoverability of goodwill and intangible assets. We base our estimates on historical experience and on various other assumptions that we believe to be reasonable under the circumstances. Actual results could differ from those estimates.\nWe review the useful lives of equipment on an ongoing basis, and effective January 1, 2024, we changed our estimate of the useful lives for our servers and networking equipment from \nthree years\n to \nfour years\n. The longer useful lives are due to continuous improvements in our hardware, software, and data center designs. The effect of this change in estimate in 2024, based on servers and network equipment that were included in “Property and equipment, net” as of December 31, 2023 and those acquired during 2024, was a reduction in depreciation expense of $\n66\n million and an increase in net income of $\n58\n million, or $\n0.12\n per basic and diluted share.\nPrinciples of Consolidation and Basis of Presentation \nThe accompanying financial statements are consolidated and include the financial statements of eBay Inc. and our wholly and majority-owned subsidiaries. All intercompany balances and transactions have been eliminated in consolidation. Minority interests are recognized as a noncontrolling interest. A qualitative approach is applied to assess the consolidation requirement for variable interest entities. Generally, investments in entities where we hold at least a 20% ownership interest and have the ability to exercise significant influence, but not control, over the investee are accounted for using the equity method of accounting, including those in which the fair value option has been elected.\nFor equity method investments, our share of the investees’ results of operations is included in “Interest income and other, net” and investment balances are included in “Long-term investments.” For equity method investments under the fair value option, the change in fair value of the investment is included in “Gain (loss) on equity investments and warrant, net” and investment balances are included in “Long-term investments,” other than our equity interest in Adevinta ASA (“Adevinta”), which was included in the “Current assets” section on the consolidated balance sheet as of December 31, 2023 as discussed in “Note 6 — Investments.” Investments in entities where we hold less than a 20% ownership interest are generally accounted for as equity investments to be measured at fair value, under an election, or at cost if it does not have readily determinable fair value, in which case the carrying value would be adjusted upon the occurrence of an observable price change in an orderly transaction for identical or similar instruments or impairment.\n70\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nEffective January 1, 2024, certain immaterial prior period balances have been reclassified to conform to the current period presentation in the consolidated financial statements and the accompanying notes. Specifically, immaterial restricted cash balances previously reported as components of “Short-term investments” and “Long-term investments” are now reported within the “Other current assets” and “Other assets” sections, respectively, in our consolidated balance sheet.\nSignificant Accounting Policies \nRevenue recognition\nWe recognize revenue when we transfer control of promised goods or services to customers in an amount that reflects the consideration to which we expect to be entitled in exchange for those goods or services. Revenue is recognized net of any taxes collected, which are subsequently remitted to governmental authorities. As part of our revenue recognition analysis, we are required to identify each distinct performance obligation.\nMarketplace revenues\nMarketplace revenues primarily consist of commissions related to the connection service including final value fees, listing fees, feature fees, and foreign exchange fees. Marketplace revenues also include store subscription fees, shipping fees, and certain other fees. Marketplace revenues are reduced by customer incentive programs, including discounts, coupons, and rewards.\nThe connection service represents a single distinct performance obligation, which is to connect buyers and sellers on our secure and trusted Marketplace platforms. Revenue is recognized at the point in time an item is paid for, satisfying the performance obligation.\nStore subscription and other nonstandard pricing contracts may contain multiple performance obligations, including discounts on future services. Determining whether performance obligations should be accounted for separately or combined may require significant judgment. The transaction price is allocated to each performance obligation based on its stand-alone selling price (“SSP”). In instances where SSP is not directly observable, we generally estimate selling prices based on when they are sold to customers of a similar nature and geography. These estimates are generally based on pricing strategies, market factors, strategic objectives and observable inputs. Store subscription revenues are recognized over the subscription period, and discounts offered through store subscription or nonstandard pricing contracts are recognized when the options are exercised or when the options expire.\nRevenues related to shipping services are recognized based on whether we are the principal and are responsible for fulfilling the promise to provide the specified services or whether we are an agent arranging for those services to be provided by our partners. Determining whether we are a principal or agent in these contracts may require significant judgment. If we are the principal, we recognize revenue in the gross amount of consideration received from the customer, whereas if we are an agent, we recognize revenue net of the consideration due to our partners at a point in time when the services are provided. Our most significant revenue share arrangements are with shipping service providers. We are primarily acting as an agent in these contracts and revenues are recognized at a point in time when we have satisfied our promise of connecting the shipping service provider to our customer. In the first quarter of 2023, we launched an international shipping program, a service designed to simplify and reduce the cost of international exports in the United States. Under this program, eBay acts as principal as we are primarily responsible for providing these international shipping services in exchange for a fee charged to the buyer. Revenue is recognized over time from the point of checkout to the point of delivery.\n71\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nFurther, to drive traffic to our Marketplace platforms, we provide incentives to buyers and sellers in various forms including discounts on fees, discounts on items sold, coupons and rewards. Evaluating whether a promotion or incentive is a payment to a customer may require significant judgment. Promotions and incentives that are consideration payable to a customer are recognized as a reduction of revenue at the later of when revenue is recognized or when we pay or promise to pay the incentive. Promotions and incentives to most buyers on our Marketplace platforms, to whom we have no performance obligation, are recognized as sales and marketing expense. In addition, we may provide credits to customers when we refund certain fees. Credits are accounted for as variable consideration at contract inception when estimating the amount of revenue to be recognized when a performance obligation is satisfied to the extent that it is probable that a significant reversal of revenue will not occur and updated as additional information becomes available.\nAdvertising revenues\nAdvertising revenues primarily consist of first-party fees paid to promote listings on our Marketplace platforms, as well as third-party advertising fees. First-party advertising services are provided to sellers to promote their listings through on-site or off-site sponsored ads and are a distinct performance obligation for which revenue is recognized when (or over the period) these services are performed. Third-party advertising revenues are derived principally from the sale of online advertisements that are based on impressions or clicks delivered to advertisers. We recognize revenue in the contracted period in which the ads are clicked and the impressions are displayed.\nInternal use software and platform development costs \nDirect costs incurred to develop software for internal use and platform development costs are capitalized and amortized over an estimated useful life of \none\n to \nfive years\n. During the years ended December 31, 2024 and 2023, we capitalized costs, primarily related to labor and stock-based compensation, of $\n108\n million and $\n115\n million, respectively. Amortization of previously capitalized amounts was $\n114\n million, $\n123\n million and $\n129\n million for 2024, 2023 and 2022, respectively. Costs related to the design or maintenance of internal use software and platform development are expensed as incurred.\n \nMarketing expense \nWe expense marketing costs according to the terms of each agreement, typically when incurred or over the period during which the advertising space or airtime is used, in each case as sales and marketing expense.\n Marketing expense totaled $\n1.4\n billion, $\n1.2\n billion and $\n1.2\n billion for the years ended December 31, 2024, 2023 and 2022, respectively. \nStock-based compensation \nWe have equity incentive plans under which we grant equity awards, including stock options, restricted stock units (“RSUs”), and performance-based restricted stock units (“PBRSUs”), to our directors, officers and employees. We primarily issue RSUs. We determine compensation expense associated with RSUs based on the fair value of our common stock on the date of grant. We determine compensation expense associated with stock options based on the estimated grant date fair value method using the Black-Scholes valuation model. We generally recognize compensation expense using a straight-line amortization method over the respective vesting period for awards that are ultimately expected to vest. Accordingly, stock-based compensation expense for 2024, 2023 and 2022 has been reduced for estimated forfeitures. When estimating forfeitures, we consider voluntary termination behaviors as well as trends of actual option forfeitures. We recognize a benefit or provision from stock-based compensation in earnings as a component of “Income tax benefit (provision)” to the extent that an incremental tax benefit or deficiency is realized by following the ordering provisions of the tax law.\n \nProvision for transaction losses\nProvision for transaction losses consists primarily of losses resulting from our buyer protection programs, chargebacks for unauthorized credit card use, and merchant related chargebacks due to non-delivery of goods or services.\n72\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nProvision for transaction losses represents our estimate of actual losses based on our historical experience and many other factors including changes to our protection programs and macroeconomic conditions.\n \nCustomer accounts and funds receivable\nCustomer accounts represent \ncash received from buyers that is \nheld by financial institutions. Due to safeguarding requirements in certain regions, a portion of this balance is considered restricted. Funds receivable represents customer cash in transit and held by payment processors. These balances are associated with marketplace activity and are awaiting payment to sellers.\nWe are exposed to credit losses from customer accounts and funds receivable balances held by third party financial institutions and payment processors. We assess these balances for credit loss based on a review of the average period for which the funds are held, current credit ratings and our assessment of the probability of default and loss given default models.\n \nIn 2024, 2023, and 2022,\n \nno\n credit-related losses were recognized.\nCustomer accounts and funds payable\nThese balances primarily represent the Company’s liability towards its customers to settle funds from the completed transactions on our Marketplace platforms associated with marketplace activity.\nIncome taxes\nSignificant judgment is required in determining our tax expense and in evaluating our tax positions, including evaluating uncertainties and the complexity of taxes on foreign earnings. We review our tax positions quarterly and adjust the balances as new information becomes available. Tax positions are evaluated for potential reserves for uncertainty based on the estimated probability of sustaining the position under examination. Our income tax rate is affected by the tax rates that apply to our foreign earnings including U.S. minimum taxes on foreign earnings. The deferred tax benefit derived from the amortization of our intellectual property is based on the fair value, which has been agreed with foreign tax authorities. The deferred tax benefit may from time to time change based on changes in tax rates. \nWe account for income taxes using an asset and liability approach, which requires the recognition of taxes payable or refundable for the current year and deferred tax liabilities and assets for the future tax consequences of events that have been recognized in our financial statements or tax returns. The measurement of current and deferred tax assets and liabilities is based on provisions of enacted tax laws; the effects of future changes in tax laws or rates are not anticipated. If necessary, the measurement of deferred tax assets is reduced by the amount of any tax benefits that are not expected to be realized based on available evidence. \nWe report a liability for unrecognized tax benefits resulting from uncertain tax positions taken or expected to be taken in a tax return. We recognize interest and penalties, if any, related to unrecognized tax benefits in income tax expense.\n \nCash, cash equivalents and restricted cash\nCash and cash equivalents are short-term, highly liquid investments with original maturities of three months or less when purchased, which may include bank deposits, U.S. Treasury securities, time deposits, and certificates of deposit.\nWe consider cash to be restricted when withdrawal or general use is legally restricted. Restricted cash is held in interest bearing accounts for letters of credit related to our global sabbatical program and for certain amounts related to other compensation arrangements held in escrow. We also hold restricted cash in segregated bank accounts for purposes of safeguarding customer funds.\n73\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nInvestments\n“Short-term investments” are primarily comprised of corporate debt securities, commercial paper and government and agency securities. “Short-term investments” are investments with maturities of less than one year, are classified as available-for-sale and are reported at fair value using the specific identification method. Short-term investments also include equity securities with readily determinable fair values that can be sold in active markets. \n“Long-term investments” are primarily comprised of corporate debt securities, government and agency securities, equity investments under the fair value option (other than our equity interest in Adevinta which was reported within the “Current assets” section in our consolidated balance sheet), equity investments under the equity method of accounting and equity investments without readily determinable fair values. Debt securities are classified as available-for-sale and are reported at fair value using the specific identification method. \nUnrealized gains and losses on our available-for-sale debt securities are excluded from earnings and reported as a component of “Other comprehensive income (loss),” net of related estimated income tax provisions or benefits. \nWe periodically assess our portfolio of debt investments for impairment. For debt securities in an unrealized loss position, this assessment first takes into account our intent to sell, or whether it is more likely than not that we will be required to sell the security before recovery of its amortized cost basis. If either of these criteria are met, the debt security’s amortized cost basis is written down to fair value through “Interest income and other, net.” For debt securities in an unrealized loss position that do not meet the aforementioned criteria, we assess whether the decline in fair value has resulted from credit losses or other factors. In making this assessment, we consider the extent to which fair value is less than amortized cost, any changes to the rating of the security by a rating agency, and any adverse conditions specifically related to the security, among other factors. If this assessment indicates that a credit loss may exist, the present value of cash flows expected to be collected from the security are compared to the amortized cost basis of the security. If the present value of cash flows expected to be collected is less than the amortized cost basis, a credit loss exists and an allowance for credit losses will be recognized through “Interest income and other, net,” limited by the amount that the fair value is less than the amortized cost basis. Any additional impairment not recognized through an allowance for credit losses is recognized in other comprehensive income. Changes in the allowance for credit losses are recognized as provision for (or reversal of) credit loss expense. Losses are charged against the allowance when management believes the uncollectability of an available-for-sale security is confirmed or when either of the criteria regarding intent or requirement to sell is met. These changes are recognized in “Gain (loss) on equity investments and warrant, net.”\nOur equity investments include equity investments with readily determinable fair values, equity investments without readily determinable fair values and equity investments under the equity method of accounting, including those in which the fair value option has been elected. Our equity investment in Adevinta is described in a separate section under “Equity investment in Adevinta” in this Note.\nEquity investments with readily determinable fair values are investments in publicly-traded companies for which we do not exercise significant influence and are measured at fair value based on the respective closing stock price and prevailing foreign exchange rate, as applicable, at the period end date. Equity investments with readily determinable fair values are classified within Level 1 in the fair value hierarchy as the valuation can be obtained from real time quotes in active markets. Subsequent changes in fair value are recognized in “\nGain (loss) on equity investments and warrant\n, net.”\nEquity investments \nwithout readily determinable fair values \nare non-marketable equity securities, which are investments in privately-held companies for which we do not exercise significant influence and are accounted for under the measurement alternative. Under the measurement alternative, the carrying value is measured at cost minus impairment, if any, plus or minus changes resulting from observable price changes in orderly transactions for the identical or a similar investment of the same issuer. \nWe perform a qualitative fair value assessment on a quarterly basis over our equity investments without readily determinable fair values to identify any changes in basis or impairments. Equity investments without readily determinable fair values are considered impaired when there is an indication that the fair value of our interest is less than the carrying amount. Changes in value and impairments of equity investments without readily determinable fair values are recognized in “G\nain (loss) on equity investments and warrant\n, net.”\n74\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nWe account for equity investments through which we exercise significant influence but do not have control over the investee under the equity method or under the fair value option. For equity method investments, our consolidated results of operations include, as a component of \n“G\nain (loss) on equity investments and warrant\n, net,”\n our share of the net income or loss of the equity investments accounted for under the equity method of accounting. Our share of equity method investees’ results of operations was not material for any period presented. We perform a qualitative impairment assessment on a quarterly basis over our equity method investments. Equity method investments are considered impaired when there is an indication of an other-than-temporary decline in value below the carrying amount. Impairments and \nany other adjustments to\n equity method investments are recognized in “Gain (loss) on equity investments and warrant, net.”\nEquity investments under the fair value option are measured at fair value based on a quarterly valuation analysis or\n using the net asset value per share (or its equivalent) practical expedient. Equity investments \nmeasured at fair value based on a quarterly valuation analysis \nare classified within Level 3 in the fair value hierarchy, as the valuation reflects management’s estimate of assumptions that market participants would use in pricing the equity investment. Equity investments measured at fair value using the net asset value per share (or its equivalent) practical expedient are not classified in the fair value hierarchy. \nS\nubsequent changes in fair value are recognized in “G\nain (loss) on equity investments and warrant\n, net.”\nRefer to “Note 6 — Investments” and “Note 8 — Fair Value Measurement of Assets and Liabilities” for additional details.\nEquity investment in Adevinta\nAt the initial recognition of our equity investment in Adevinta, we elected the fair value option where subsequent changes in fair value were recognized in “G\nain (loss) on equity investments and warrant\n, net” in our consolidated statement of income. The investment was reported within the “Current assets” section in our consolidated balance sheet as of December 31, 2023 and was classified within Level 1 in the fair value hierarchy as the valuation could be obtained from real time quotes in active markets based on Adevinta’s closing stock price and prevailing foreign exchange rate. On May 29, 2024, we completed the previously announced sale of our stake in Adevinta in exchange for cash and shares of a new entity, Aurelia.\nRefer to “Note 6 — Investments” and “Note 8 — Fair Value Measurement of Assets and Liabilities” for additional details.\nLeases\nWe determine if an arrangement is a lease or contains a lease at inception. Operating lease liabilities are recognized based on the present value of the remaining lease payments, discounted using the discount rate for the lease at the commencement date. As the rate implicit in the lease is not readily determinable for our operating leases, we generally use an incremental borrowing rate based on information available at the commencement date to determine the present value of future lease payments. Operating right-of-use (“ROU”) assets are generally recognized based on the amount of the initial measurement of the lease liability. Our leases have remaining lease terms of up to \nten years\n, some of which include options to extend the leases for up to \nfive years\n, and some of which include options to terminate the leases within \none year\n. Lease expense is recognized on a straight-line basis over the lease term. We account for lease and fixed non-lease components as a single lease component for our data center leases. Lease and non-lease components for all other leases are accounted for separately.\nOperating leases are included in operating lease right-of-use assets, other current liabilities and operating lease liabilities in our consolidated balance sheets.\n75\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nProperty and equipment \nProperty and equipment are stated at historical cost less accumulated depreciation. Depreciation for equipment, buildings and leasehold improvements commences once they are ready for our intended use. Depreciation is computed using the straight-line method over the estimated useful lives of the assets, generally, \none\n to \nfour years\n for computer equipment and software, up to \nthirty years\n for buildings and building improvements, the shorter of \nfive years\n or the term of the lease for leasehold improvements and \nthree years\n for furniture, fixtures and vehicles. Land is not depreciated.\n \nGoodwill and intangible assets \nGoodwill is tested for impairment at a minimum on an annual basis at the reporting unit level. A qualitative assessment can be performed to determine whether it is more likely than not that the fair value of the reporting unit is less than its carrying value. If the reporting unit does not pass the qualitative assessment, then the reporting unit’s carrying value is compared to its fair value. The fair value of the reporting unit is estimated using income and market approaches. Goodwill is considered impaired if the carrying value of the reporting unit exceeds its fair value. The discounted cash flow method, a form of the income approach, uses expected future operating results and a market participant discount rate. The market approach uses comparable company prices and other relevant information generated by market transactions (either publicly traded entities or mergers and acquisitions) to develop pricing metrics to be applied to historical and expected future operating results of our reporting unit. Failure to achieve these expected results, changes in the discount rate or market pricing metrics may cause a future impairment of goodwill at the reporting unit. We conducted our annual impairment test of goodwill as of August 31, 2024 and 2023 and determined that no adjustment to the carrying value of goodwill for any reporting unit was required. \nIntangible assets consist of purchased customer lists and user base, marketing related, developed technologies and other intangible assets, including patents and contractual agreements. Intangible assets are amortized over the period of estimated benefit using the straight-line method and estimated useful lives ranging from \nthree\n to \neight years\n. No significant residual value is estimated for intangible assets.\nImpairment of long-lived assets \nWe evaluate long-lived assets (including leases and intangible assets) for impairment whenever events or changes in circumstances indicate that the carrying amount of a long-lived asset may not be recoverable. An asset is considered impaired if its carrying amount exceeds the undiscounted future net cash flow the asset is expected to generate.\n In 2024, 2023, and 2022, \nno\n impairment was recognized.\nForeign currency\nMost of our foreign subsidiaries use the local currency of their respective countries as their functional currency. Assets and liabilities are translated into U.S. dollars using exchange rates prevailing at the balance sheet date, while revenues and expenses are translated at average exchange rates during the year. Gains and losses resulting from the translation of our consolidated balance sheet are recognized as a component of “Accumulated other comprehensive income.” \nGains and losses from foreign currency transactions are recognized as “Interest income and other, net.”\n \nDerivative instruments\nWe use derivative financial instruments, primarily forwards, options and swaps, to hedge certain foreign currency and interest rate exposures. We may also use other derivative instruments not designated as hedges, such as forwards to hedge foreign currency balance sheet exposures. We do not use derivative financial instruments for trading purposes. \n76\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nWe also entered into a warrant agreement in addition to a commercial agreement with Adyen N.V. (“Adyen”) that, subject to meeting certain conditions, entitled us to acquire a fixed number of shares up to \n5\n% of Adyen’s fully diluted issued and outstanding share capital at a specific date. The warrant was accounted for as a derivative instrument under Accounting Standards Codification (“ASC”) Topic 815, \nDerivatives and Hedging\n. The warrant expired on January 31, 2025.\nSee “Note 7 — Derivative Instruments” for a full description of our derivative instrument activities and related accounting policies.\nConcentration of credit risk\nOur cash, cash equivalents, accounts receivable, customer accounts and funds receivable, available-for-sale debt securities and derivative instruments are potentially subject to concentration of credit risk. Cash and cash equivalents are placed with financial institutions that management believes are of high credit quality. In each of the years ended December 31, 2024, 2023 and 2022, no customer accounted for more than 10% of net revenues. Our derivative instruments expose us to credit risk to the extent that our counterparties may be unable to meet the terms of the agreements.\nRecently Adopted Accounting Pronouncements\nIn 2021, the Financial Accounting Standards Board (“FASB”) issued Accounting Standards Update (“ASU”) 2021-08—Business Combinations (Topic 805): Accounting for Contract Assets and Contract Liabilities from Contracts with Customers. The guidance requires the recognition and measurement of contract assets and contract liabilities from revenue contracts by an acquirer in a business combination and clarifies that an acquirer should account for the related revenue contracts at the acquisition date as if it had originated the contracts in accordance with existing revenue guidance. The standard is effective for annual reporting periods beginning after December 15, 2022, including interim reporting periods within those fiscal years. We adopted this guidance in the fourth quarter of 2022 with no material impact in our consolidated financial statements and related disclosures.\nIn 2022, the FASB issued ASU 2022-01—Derivatives and Hedging (Topic 815): Fair Value Hedging—Portfolio Layer Method. The guidance expands the scope of financial assets that can be included in a closed portfolio hedged using the portfolio layer method to allow consistent accounting for similar hedges. The expanded scope permits the application of the same portfolio hedging method to both prepayable and nonprepayable financial assets. The standard is effective for annual reporting periods beginning after December 15, 2022, including interim reporting periods within those fiscal years. We adopted this guidance in the fourth quarter of 2022 with no material impact in our consolidated financial statements and related disclosures.\nIn 2022, the FASB issued ASU 2022-03-Fair Value Measurement (Topic 820): Fair Value Measurement of Equity Securities Subject to Contractual Sale Restrictions. The guidance clarifies the fair value measurement guidance for equity securities subject to contractual restrictions that prohibit the sale of an equity security. Further, the guidance introduces new disclosure requirements for equity securities subject to contractual sale restrictions that are measured at fair value. The standard is effective for annual reporting periods beginning after December 15, 2023, including interim reporting periods within those fiscal years. We adopted this guidance in the fourth quarter of 2023 with no material impact in our consolidated financial statements and related disclosures.\nIn 2023, the FASB issued ASU 2023-07—Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures. The guidance is intended to improve reportable segment disclosure requirements, primarily through enhanced disclosures about significant segment expenses enabling investors to better understand an entity’s overall performance and assess potential future cash flows. In addition, the amendments enhance interim disclosure requirements, clarify circumstances in which an entity can disclose multiple segment measures of profit or loss, provide new segment disclosure requirements for entities with a single reportable segment, and contain other disclosure requirements. The standard is effective for annual reporting periods beginning after December 15, 2023 and interim periods within fiscal years beginning after December 15, 2024. We adopted this guidance in the fourth quarter of 2024 with no material impact in our consolidated financial statements and related disclosures.\n77\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nRecent Accounting Pronouncements Not Yet Adopted\nIn December 2023, the FASB issued ASU 2023-08—Intangibles—Goodwill and Other—Crypto Assets (Subtopic 350-60): Accounting for and Disclosure of Crypto Assets. The guidance addresses the accounting and disclosure requirements for certain crypto assets and requires entities to subsequently measure certain crypto assets at fair value, with changes in fair value recognized in net income in each reporting period. In addition, entities are required to provide additional disclosures about the holdings of certain crypto assets. The standard is effective for annual reporting periods beginning after December 15, 2024, including interim reporting periods within those fiscal years. We do not expect the adoption of this standard to have a material impact in our consolidated financial statements and related disclosures.\nIn December 2023, the FASB issued ASU 2023-09—Income Taxes (Topic 740): Improvements to Income Tax Disclosures. The guidance is intended to further standardize income tax disclosures primarily related to the presentation of the effective tax rate reconciliation and income taxes paid information in our financial statements and disclosures. The standard is effective for annual reporting periods beginning after December 15, 2024. We are evaluating the effect that this standard may have in our consolidated financial statements and related disclosures.\nIn November 2024, the FASB issued ASU 2024-03—Income Statement—Reporting Comprehensive Income—Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses. The guidance is intended to improve disclosures about expenses and address requests from investors for more transparent expense information through disaggregation of relevant expense captions in the notes to the financial statements. The standard is effective for annual reporting periods beginning after December 15, 2026, and interim reporting periods within annual reporting periods beginning after December 15, 2027. We are evaluating the effect that this standard may have in our consolidated financial statements and related disclosures.\n78\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nNote 2 — \nNet Income (Loss) Per Share\nBasic net income (loss) per share is computed by dividing net income (loss) for the period by the weighted average number of common shares outstanding during the period. Diluted net income (loss) per share is computed by dividing net income (loss) for the period by the weighted average number of shares of common stock and potentially dilutive common stock outstanding during the period. The dilutive effect of outstanding options and equity incentive awards is reflected in diluted net income (loss) per share by application of the treasury stock method. The calculation of diluted net income (loss) per share excludes all anti-dilutive common shares. \nThe following table presents the computation of basic and diluted net income (loss) per share (in millions, except per share amounts):\n \nYear Ended December 31,\n \n2024\n2023\n2022\nNumerator:\nIncome (loss) from continuing operations\n$\n1,981\n \n$\n2,775\n \n$\n(\n1,274\n)\nIncome (loss) from discontinued operations, net of income taxes\n(\n6\n)\n(\n8\n)\n5\n \nNet income (loss)\n$\n1,975\n \n$\n2,767\n \n$\n(\n1,269\n)\nDenominator:\nWeighted average shares of common stock - basic\n496\n \n530\n \n558\n \nDilutive effect of equity incentive awards\n5\n \n3\n \n—\n \nWeighted average shares of common stock - diluted\n501\n \n533\n \n558\n \nIncome (loss) per share - basic:\nContinuing operations\n$\n4.00\n \n$\n5.24\n \n$\n(\n2.28\n)\nDiscontinued operations\n(\n0.01\n)\n(\n0.02\n)\n0.01\n \nNet income (loss) per share - basic\n$\n3.99\n \n$\n5.22\n \n$\n(\n2.27\n)\nIncome (loss) per share - diluted:\nContinuing operations\n$\n3.95\n \n$\n5.21\n \n$\n(\n2.28\n)\nDiscontinued operations\n(\n0.01\n)\n(\n0.02\n)\n0.01\n \nNet income (loss) per share - diluted\n$\n3.94\n \n$\n5.19\n \n$\n(\n2.27\n)\nCommon stock equivalents excluded from income (loss) per diluted share because their effect would have been anti-dilutive\n4\n \n20\n \n13\n \n79\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nNote 3 — \nBusiness Combinations\nAcquisition of TCGplayer\nIn the first quarter of 2023, we recognized measurement period adjustments related to the revised valuation of the intangible assets associated with the acquisition of TCGplayer, a trusted marketplace for collectible card game enthusiasts. \nThe following table presents the revised allocation of the aggregate purchase consideration (in millions):\nTCGplayer\nGoodwill\n$\n144\n \nPurchased intangible assets\n109\n \nDeferred taxes\n(\n18\n)\nTotal\n$\n235\n \nThe goodwill recognized is primarily attributable to expected synergies and the assembled workforce of TCGplayer. We generally do not expect goodwill to be deductible for income tax purposes.\nOur consolidated financial statements include the operating results of the acquired business from the date of acquisition. Separate operating results and pro forma results of operations for the acquisition above have not been presented as the effect of this acquisition is not material to our financial results.\n80\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nNote 4 — \nGoodwill and Intangible Assets \nGoodwill\nThe following table presents goodwill activity for the periods indicated (in millions):\n \nDecember 31,\n2022\nGoodwill\nAcquired\n \nAdjustments\n \nDecember 31,\n2023\nGoodwill\nAcquired\n \nAdjustments\n \nDecember 31,\n2024\nGoodwill\n$\n4,262\n \n$\n31\n \n$\n(\n26\n)\n$\n4,267\n \n$\n56\n \n$\n(\n54\n)\n$\n4,269\n \nGoodwill acquired during the year ended December 31, 2024 relates to the acquisition of Goldin, a leading U.S.-based auction house for high-value trading cards and collectibles. The adjustments to goodwill during the years ended December 31, 2024 and 2023 were primarily due to foreign currency translation. There were \nno\n impairments to goodwill in 2024, 2023 or 2022.\nIntangible Assets\nIntangible assets are reported within “Other assets” in our consolidated balance sheet. \nThe following table presents components of identifiable intangible assets as of the dates indicated (in millions, except years):\n \nDecember 31, 2024\nDecember 31, 2023\nGross Carrying Amount\nAccumulated Amortization\nNet Carrying Amount\nWeighted Average Useful Life (Years)\nGross Carrying Amount\nAccumulated Amortization\nNet Carrying Amount\nWeighted Average Useful Life (Years)\nIntangible assets:\n \n \n \n \n \n \n \n \nCustomer lists and user base\n$\n246\n \n$\n(\n200\n)\n$\n46\n \n8\n$\n245\n \n$\n(\n203\n)\n$\n42\n \n8\nMarketing related\n101\n \n(\n63\n)\n38\n \n7\n79\n \n(\n58\n)\n21\n \n6\nDeveloped technologies\n239\n \n(\n205\n)\n34\n \n4\n240\n \n(\n191\n)\n49\n \n4\nAll other\n158\n \n(\n157\n)\n1\n \n3\n159\n \n(\n157\n)\n2\n \n3\nTotal\n$\n744\n \n$\n(\n625\n)\n$\n119\n \n \n$\n723\n \n$\n(\n609\n)\n$\n114\n \nAmortization expense for intangible assets was $\n37\n million, $\n35\n million and $\n9\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\nThe following table presents expected future intangible asset amortization as of the date indicated (in millions):\nDecember 31, 2024\n2025\n$\n39\n \n2026\n29\n \n2027\n24\n \n2028\n7\n \n2029\n7\n \nThereafter\n13\n \nTotal future intangible asset amortization\n$\n119\n \n81\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nNote 5 — \nSegments\nWe have \none\n reportable segment, which reflects how the chief operating decision maker (“CODM”), President and Chief Executive Officer, reviews and assesses performance of the business. The CODM assesses the performance of the Company and decides how to allocate resources based on consolidated net income reported in the consolidated statement of income. The CODM uses consolidated net income in deciding whether to reinvest profits into certain parts of the business or return a portion of such profits to shareholders through dividends and stock repurchases. Significant expense categories regularly provided to and reviewed by the CODM are those presented in the consolidated statement of income. The measure of segment assets is reported on the consolidated balance sheet as total assets, although the CODM does not evaluate asset information for purposes of allocating resources or evaluating performance.\nNet Revenues\nThe following table summarizes net revenues by activity for the periods indicated (in millions):\n \nYear Ended December 31,\n \n2024\n2023\n2022\nMarketplace revenues\n$\n8,648\n \n$\n8,669\n \n$\n8,644\n \nAdvertising revenues\n1,635\n \n1,443\n \n1,151\n \nTotal net revenues\n$\n10,283\n \n$\n10,112\n \n$\n9,795\n \nNet Revenues by Geography\nNet revenues, inclusive of the effects of foreign exchange during each period, are attributed to the United States and international geographies primarily based upon the country in which the seller, platform that displays advertising, other service provider, or customer, as the case may be, is located.\nThe following table summarizes the allocation of net revenues based on geography for the periods indicated (in millions):\n \nYear Ended December 31,\n \n2024\n  \n2023\n  \n2022\nUnited States\n$\n5,238\n \n  \n$\n5,073\n \n  \n$\n4,842\n \nUnited Kingdom\n1,508\n \n  \n1,609\n \n  \n1,579\n \nChina\n1,169\n \n1,029\n \n882\n \nGermany\n972\n \n  \n971\n \n  \n1,023\n \nRest of world\n1,396\n \n  \n1,430\n \n  \n1,469\n \nTotal net revenues\n$\n10,283\n \n$\n10,112\n \n$\n9,795\n \nLong-Lived Tangible Assets by Geography\nLong-lived tangible assets consisting of property and equipment, net and lease right-of-use assets are attributed to the United States and international geographies based upon the country in which the asset is located, leased or owned.\nThe following table summarizes the allocation of long-lived tangible assets based on geography as of the dates indicated (in millions):\nDecember 31,\n2024\n2023\nUnited States\n$\n1,598\n \n$\n1,580\n \nInternational\n92\n \n156\n \nTotal long-lived tangible assets\n$\n1,690\n \n$\n1,736\n \n82\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nNote 6 — \nInvestments \nThe following tables summarize the unrealized gains and losses and estimated fair value of our investments classified as available-for-sale debt securities as of the dates indicated (in millions):\n \nDecember 31, 2024\n \nGross\nAmortized\nCost\n  \nGross\nUnrealized\nGains\n  \nGross\nUnrealized\nLosses\n \nEstimated\nFair Value\nShort-term investments:\n  \n  \n \nCorporate debt securities\n$\n3,095\n \n  \n$\n1\n \n  \n$\n(\n2\n)\n \n$\n3,094\n \nGovernment and agency securities\n367\n \n  \n—\n \n  \n(\n4\n)\n \n363\n \n$\n3,462\n \n  \n$\n1\n \n  \n$\n(\n6\n)\n \n$\n3,457\n \nLong-term investments:\n  \n  \n \nCorporate debt securities\n$\n1,117\n \n  \n$\n4\n \n  \n$\n(\n2\n)\n \n$\n1,119\n \nGovernment and agency securities\n194\n \n  \n—\n \n  \n(\n4\n)\n \n190\n \n$\n1,311\n \n  \n$\n4\n \n  \n$\n(\n6\n)\n \n$\n1,309\n \n \n \nDecember 31, 2023\n \nGross\nAmortized\nCost\n  \nGross\nUnrealized\nGains\n  \nGross\nUnrealized\nLosses\n \nEstimated\nFair Value\nShort-term investments:\n  \n  \n \nCorporate debt securities\n$\n2,170\n \n  \n$\n—\n \n  \n$\n(\n8\n)\n \n$\n2,162\n \nGovernment and agency securities\n382\n \n  \n—\n \n  \n(\n11\n)\n \n371\n \n$\n2,552\n \n$\n—\n \n$\n(\n19\n)\n$\n2,533\n \nLong-term investments:\n  \n  \n \nCorporate debt securities\n$\n338\n \n  \n$\n—\n \n  \n$\n(\n10\n)\n \n$\n328\n \nGovernment and agency securities\n287\n \n  \n—\n \n  \n(\n16\n)\n \n271\n \n$\n625\n \n  \n$\n—\n \n  \n$\n(\n26\n)\n \n$\n599\n \nOur fixed-income investments consist of predominantly investment grade corporate debt securities and government and agency securities. The corporate debt and government and agency securities that we invest in are generally deemed to be low risk based on their credit ratings from the major rating agencies. \nThe longer the duration of these securities, the more susceptible they are to changes in market interest rates and bond yields. As interest rates increase, those securities purchased at a lower yield show a mark-to-market unrealized loss. The unrealized losses are due primarily to changes in credit spreads and interest rates. We regularly review investment securities for other-than-temporary impairment using both qualitative and quantitative criteria. Investments classified as available-for-sale debt securities are carried at fair value with changes reflected in other comprehensive income. Where there is an intention or a requirement to sell an impaired available-for-sale debt security, the entire impairment is recognized in earnings with a corresponding adjustment to the amortized cost basis of the security. From time to time, we sell available-for-sale debt securities in an unrealized loss position and recognize an immaterial loss.\nWe regularly review investment securities for credit impairment using both qualitative and quantitative criteria. In making this assessment, we consider the extent to which fair value is less than amortized cost, any changes to the rating of the security by a rating agency, any adverse conditions specifically related to the security, among other factors. If this assessment indicates that a credit loss exists, the present value of cash flows expected to be collected from the security are compared to the amortized cost basis of the security. If the present value of cash flows expected to be collected is less than the amortized cost basis, a credit loss exists and an allowance for credit losses will be recognized through “Interest income and other, net” for the credit loss, limited by the amount that the fair value is less than the amortized cost basis. Any impairment that has not been recognized through an allowance for credit losses is recognized in other comprehensive income. We did not recognize any credit-related impairment through an allowance for credit losses as of December 31, 2024.\n83\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nThe following table presents estimated fair values of our short-term and long-term investments classified as available-for-sale debt securities by date of contractual maturity as of the date indicated (in millions): \n \nDecember 31, 2024\nOne year or less\n$\n3,457\n \nOne year through two years\n477\n \nTwo years through three years\n546\n \nThree years through four years\n266\n \nFour years through five years\n15\n \nThereafter\n5\n \nTotal\n$\n4,766\n \nEquity Investments \nThe following table summarizes our equity investments as of the dates indicated (in millions):\nDecember 31,\n \nBalance Sheet Location\n2024\n2023\nEquity investment in Adevinta\nEquity investment in Adevinta\n$\n—\n \n$\n4,474\n \nEquity investments without readily determinable fair values\nLong-term investments\n1,011\n \n93\n \nEquity investments under the equity method of accounting\nLong-term investments\n65\n \n55\n \nOther equity investments under the fair value option\nLong-term investments\n54\n \n382\n \nTotal equity investments\n$\n1,130\n \n$\n5,004\n \nEquity investments under the fair value option\nEquity investment in Adevinta\nUpon completion of the transfer of our Classifieds business to Adevinta in 2021, we received an equity investment of \n44\n% in Adevinta valued at $\n10.8\n billion at the close of the transfer. In the fourth quarter of 2021, we completed the sale of approximately \n135\n million of our voting shares in Adevinta to Permira, inclusive of the option exercised by Permira to purchase additional voting shares, for total cash consideration of $\n2.3\n billion which reduced our ownership in Adevinta to \n33\n%.\nAt the initial recognition of this equity investment in Adevinta, we elected the fair value option where subsequent changes in fair value were recognized in “Gain (loss) on equity investments and warrant, net” in our consolidated statement of income. The investment was reported within the “Current assets” section in our consolidated balance sheet as of December 31, 2023 and was classified within Level 1 in the fair value hierarchy as the fair value could be obtained from real time quotes in active markets based on Adevinta’s closing stock price and prevailing foreign exchange rate.\nOn May 29, 2024, we completed the previously announced sale of (1) \n227\n million Adevinta shares in exchange for $\n2.4\n billion in cash and (2) the exchange of \n177\n million Adevinta shares for \n177\n million shares of the new entity, Aurelia (collectively, the “Transactions”), valued at $\n1.9\n billion and representing approximately \n18.3\n% ownership of the outstanding equity of Aurelia. The equity investment in Aurelia is accounted for under the measurement alternative as we are not able to exercise significant influence based on the governance structure defined in the terms of the Transaction Completion Agreement and the Aurelia Shareholder Agreement. Refer to \"Equity investments without readily determinable fair values” below for additional information. Cash proceeds, net of transaction costs, related to the sale of Adevinta shares were classified as an investing activity in our consolidated statement of cash flows.\n84\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nIn connection with the Transactions, we recognized an unrealized loss of $\n234\n million and a realized gain of $\n78\n million in “Gain (loss) on equity investments and warrant, net” in our consolidated statement of income. We concurrently reduced “Deferred tax liabilities” by $\n456\n million and increased “Income taxes payable” by $\n458\n million in our consolidated balance sheet related to the taxable gain on disposition of Adevinta shares.\nIn 2023, we recognized an unrealized gain of $\n1,782\n million in “Gain (loss) on equity investments and warrant, net” in our consolidated statement of income related to the change in fair value of the investment in Adevinta. The fair value of the investment was $\n4,474\n million as of December 31, 2023.\nEquity investments without readily determinable fair values\nEquity investments without readily determinable fair values are non-marketable equity securities, which are investments in privately-held companies for which we do not exercise significant influence and are accounted for under the measurement alternative. Under the measurement alternative, the carrying value is measured at cost minus impairment, if any, plus or minus changes resulting from observable price changes in orderly transactions for the identical or a similar investment of the same issuer. Changes in value and impairments of equity investments without readily determinable fair values are recognized in “Gain (loss) on equity investments and warrant, net” in our consolidated statement of income. Equity investments without readily determinable fair values are presented within “Long-term investments” in our consolidated balance sheet.\nEquity investment in Aurelia\nAs discussed in the “Equity Investment in Adevinta” section above, our equity investment in Aurelia is accounted for under the measurement alternative as we are not able to exercise significant influence over Aurelia.\nConcurrently with the Transactions discussed above, we granted Aurelia UK Feederco Limited, the buyer, a \nsix-month\n option to purchase Aurelia shares (the “Aurelia Option”). In November 2024, the Aurelia Option was exercised, upon which we sold \n97\n million shares in Aurelia in exchange for $\n1.0\n billion in cash, and recognized an $\n11\n million loss in “Gain (loss) on equity investments and warrant, net” in our consolidated statement of income. We concurrently reduced “Deferred tax liabilities” by $\n202\n million and increased “Income taxes payable” by $\n198\n million in our consolidated balance sheet related to the taxable gain on our disposition of Aurelia shares. Cash proceeds, net of transaction costs, related to the sale of Aurelia shares were classified as an investing activity in our consolidated statement of cash flows. The fair value of the investment was $\n867\n million as of December 31, 2024, representing approximately \n8.3\n% of the outstanding equity of Aurelia.\nOther equity investments without readily determinable fair values\nIn 2024, we recognized $\n51\n million of additions compared to $\n33\n million of additions during 2023 and $\n11\n million of additions in 2022. The change in value of our other equity investments without readily determinable fair values in 2024, 2023 and 2022 was immaterial both individually and in the aggregate.\nOther equity method investments\nWe account for certain other individually immaterial equity investments through which we exercise significant influence but do not have control over the investee under the equity method. Our consolidated results of operations include, as a component of “Interest income and other, net,” our share of the net income or loss of the equity investments. Equity method investments are presented within “Long-term investments” in our consolidated balance sheet. Our share of the net income or loss of equity method investments in 2024, 2023 and 2022 was immaterial both individually and in the aggregate.\n85\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nOther equity investments under the fair value option\nEquity investment in Gmarket\nIn 2021, we completed the sale of \n80.01\n% of the outstanding equity interests of eBay Korea to Emart. Upon completion of the sale, we retained \n19.99\n% of the outstanding equity interest of the new entity, Gmarket, over which we are able to exercise significant influence based on the terms of the securities purchase agreement, including through our board representation. Our equity investment in Gmarket was valued at $\n728\n million as of the transaction close date.\nAt the initial recognition of this equity investment, we elected the fair value option where subsequent changes in fair value were recognized in “Gain (loss) on equity investments and warrant, net” in the consolidated statement of income. The investment was reported within “Long-term investments” in our consolidated balance sheet and was classified within Level 3 in the fair value hierarchy as the valuation reflected management’s estimate of assumptions that market participants would use in pricing the equity investment. Refer to “Note 8 — Fair Value Measurement of Assets and Liabilities” for more information.\nIn December 2024, we sold our remaining stake in Gmarket valued at $\n323\n million in exchange for $\n322\n million in cash, net of transaction costs, and recognized a realized loss of $\n1\n million and an unrealized loss of $\n12\n million related to the change in fair value of the investment in “Gain (loss) on equity investments and warrant, net” in our consolidated statement of income. We concurrently reduced “Income taxes payable” by $\n119\n million in our consolidated balance sheet related to the taxable loss on our disposition of Gmarket. Cash proceeds, net of transaction costs, related to the sale of Gmarket shares were classified as an investing activity in our consolidated statement of cash flows.\nIn 2023, an unrealized loss of $\n96\n million was recognized in “Gain (loss) on equity investments and warrant, net” in our consolidated statement of income related to the change in fair value of the investment. The fair value of the investment was $\n335\n million as of December 31, 2023.\nOther investments\nCertain other individually immaterial equity investments aggregating to $\n54\n million and $\n47\n million as of December 31, 2024 and December 31, 2023, respectively, are measured at fair value using the net asset value per share (or its equivalent) practical expedient, and have not been classified in the fair value hierarchy. Refer to “Note 8 — Fair Value Measurement of Assets and Liabilities” for more information.\nEquity investments with readily determinable fair values\nEquity investment in Adyen\nWe entered into a warrant agreement in conjunction with a commercial agreement with Adyen that, subject to meeting certain conditions, entitled us to acquire a fixed number of shares up to \n5\n% of Adyen’s fully diluted issued and outstanding share capital at a specific date. The warrant had a term of \nseven years\n and vested in a series of \nfour\n tranches at a specified price per share (fixed for the first \ntwo\n tranches) upon meeting processing volume milestone targets on a calendar year basis. When a relevant milestone was reached, the warrant became exercisable with respect to the corresponding tranche of warrant shares. The warrant expired on January 31, 2025. Refer to “Note 7 —\n \nDerivative Instruments” for more information about the warrant.\nIn 2021, we met the processing volume milestone target to vest the first tranche of the warrant and exercised the option to purchase shares of Adyen. During 2022, we sold our shares in Adyen stemming from the exercise of the first tranche of the warrant for $\n800\n million and recognized realized losses of $\n143\n million on the change in fair value of shares sold and unrealized losses of $\n118\n million in “Gain (loss) on equity investments and warrant, net” in our consolidated statement of income. Cash proceeds, net of transaction costs, related to the sale of Adyen shares were classified as an investing activity in our consolidated statement of cash flows.\n86\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nIn the fourth quarter of 2024, we met the processing volume milestone required to vest in the second tranche of the Adyen warrant. Upon vesting, we exercised the option to purchase shares of Adyen valued at $\n630\n million in exchange for $\n108\n million in cash. We subsequently sold the remainder of our shares in Adyen for $\n573\n million and recognized a realized loss of $\n57\n million in “Gain (loss) on equity investments and warrant, net” in our consolidated statement of income. We concurrently reduced “Deferred tax liabilities” by $\n114\n million and increased “Income taxes payable” by $\n105\n million in our consolidated balance sheet related to the taxable gain on disposition of Adyen shares. Cash paid related to the exercise of the second tranche of the warrant and cash proceeds, net of transaction costs, related to the sale of Adyen shares was classified as an investing activity in our consolidated statement of cash flows.\nGains and losses on equity investments\nThe following table summarizes unrealized gains and losses related to equity investments held as of  \nDecember 31, 2024\n, 2023 and 2022 and presented within “Gain (loss) on equity investments and warrant, net” for the periods indicated (in millions):\nYear Ended December 31,\n \n2024\n2023\n2022\nNet gains (losses) recognized during the period on equity investments\n$\n(\n234\n)\n$\n1,670\n \n$\n(\n4,152\n)\nLess: Net gains (losses) recognized on equity investments sold during the period\n9\n \n13\n \n(\n812\n)\nTotal unrealized gains (losses) on equity investments held, end of period\n$\n(\n243\n)\n$\n1,657\n \n$\n(\n3,340\n)\nSummarized financial information of equity investments under the equity method and fair value option\nEquity investment in Adevinta\nAdevinta’s financial information was prepared on the basis of International Financial Reporting Standards (“IFRS”). We have made certain adjustments to Adevinta’s summarized financial information to address differences between IFRS and GAAP that materially impact the summarized financial information presented below. Any other differences between IFRS and GAAP did not have a material impact on Adevinta’s summarized financial information.\nOn May 29, 2024, we completed the sale of Adevinta. As a result, the 2024 summarized income statement information includes the stub period of October 1, 2023 to May 29, 2024. \nThe following tables present Adevinta’s summarized financial information on a one-quarter lag (in millions):\nEight months ended \nMay 29, 2024\nTwelve months ended \nSeptember 30, 2023\nTwelve months ended \nSeptember 30, 2022\nRevenue\n$\n1,398\n \n$\n1,912\n \n$\n1,742\n \nGross profit\n$\n494\n \n$\n683\n \n$\n571\n \nIncome (loss) from continuing operations\n$\n(\n318\n)\n$\n(\n1,731\n)\n$\n65\n \nNet income (loss)\n$\n(\n327\n)\n$\n(\n1,780\n)\n$\n56\n \nNet income (loss) attributable to Adevinta\n$\n(\n333\n)\n$\n93\n \n$\n49\n \nSeptember 30, 2023\nCurrent assets\n$\n399\n \nNoncurrent assets\n$\n12,065\n \nCurrent liabilities\n$\n499\n \nNoncurrent liabilities\n$\n2,815\n \nNoncontrolling interests\n$\n18\n \n87\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nOther equity investments accounted for under the equity method and fair value option\nThe following tables present summarized financial information of our equity investments accounted for under the equity method and the fair value option in the aggregate on a one-quarter lag. The tables below exclude the summarized financial information of our equity investment in Adevinta which is separately disclosed above.\nFinancial information of certain of these equity investments is prepared on the basis of local generally accepted accounting principles or IFRS. We have made certain adjustments as applicable to address differences between local generally accepted accounting principles or IFRS and GAAP that materially impact the summarized financial information. Any other differences between GAAP and local generally accepted accounting principles or IFRS did not have a material impact on the summarized financial information of the equity investments presented below in the aggregate. \nDuring the period in which we recognize an equity investment, the summarized financial information reflects activity from the date of recognition.\nTwelve months ended September 30,\n2024\n2023\n2022\n(In millions)\nRevenue\n$\n1,369\n \n$\n1,468\n \n$\n1,346\n \nGross profit\n$\n852\n \n$\n947\n \n$\n478\n \nLoss from continuing operations\n$\n(\n30\n)\n$\n(\n124\n)\n$\n(\n56\n)\nNet income (loss)\n$\n10\n \n$\n(\n107\n)\n$\n(\n55\n)\nSeptember 30,\n2024\n2023\n(In millions)\nCurrent assets\n$\n658\n \n$\n798\n \nNoncurrent assets\n$\n573\n \n$\n468\n \nCurrent liabilities\n$\n514\n \n$\n670\n \nNoncurrent liabilities\n$\n38\n \n$\n59\n \n88\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nNote 7 — \nDerivative Instruments \nOur primary objective in holding derivatives is to reduce the volatility of earnings and cash flows associated with changes in foreign currency exchange rates and interest rates. These hedging contracts reduce, but do not entirely eliminate, the impact of adverse foreign exchange rate and interest rate movements. We do not use any of our derivative instruments for trading purposes.\nWe use foreign currency exchange contracts to reduce the volatility of cash flows related to forecasted revenues, expenses, assets and liabilities, including intercompany balances denominated in foreign currencies. These contracts are generally \none month\n to \none year\n in duration, but with maturities up to \n24\n months. The objective of the foreign exchange contracts is to ensure that ultimately the U.S. dollar-equivalent cash flows are not adversely affected by changes in the applicable U.S. dollar/foreign currency exchange rate. We evaluate the effectiveness of our foreign exchange contracts designated as cash flow or net investment hedges on a quarterly basis. \nCash Flow Hedges\nFor derivative instruments that are designated as cash flow hedges, the derivative’s gain or loss is initially reported as a component of AOCI and subsequently reclassified into earnings in the same period the forecasted hedged transaction affects earnings. Derivative instruments designated as cash flow hedges must be de-designated as hedges when it is probable the forecasted hedged transaction will not occur in the initially identified time period or within a subsequent two-month time period. Unrealized gains and losses in AOCI associated with such derivative instruments are immediately reclassified into earnings\n. \nAs of December 31, 2024, we have estimated that $\n18\n million of net derivative gains related to our foreign exchange cash flow hedges and $\n8\n million net derivative gains related to our interest rate cash flow hedges included in accumulated other comprehensive income will be reclassified into earnings within the next 12 months. We classify cash flows related to our cash flow hedges as operating activities in our consolidated statement of cash flows.\nNon-Designated Hedges\nOur derivatives not designated as hedging instruments consist of foreign currency forward contracts that we primarily use to hedge monetary assets or liabilities, including intercompany balances and equity investments denominated in non-functional currencies. The gains and losses on our derivatives not designated as hedging instruments are recognized in “Interest income and other, net,” which are offset by the foreign currency gains and losses on the related assets and liabilities that are also recognized in “Interest income and other, net.” We classify cash flows related to our non-designated hedging instruments in the same line item as the cash flows of the related assets or liabilities, which is generally within operating activities in our consolidated statement of cash flows. Cash flows related to the settlement of non-designated hedging instruments related to equity investments are classified within investing activities in our consolidated statement of cash flows.\nWarrant\nWe entered into a warrant agreement in conjunction with a commercial agreement with Adyen that, subject to meeting certain conditions, entitled us to acquire a fixed number of shares up to \n5\n% of Adyen’s fully diluted issued and outstanding share capital at a specific date. The warrant had a term of \nseven years\n and vested in a series of \nfour\n tranches, at a specified price per share (fixed for the first \ntwo\n tranches) upon meeting processing volume milestone targets on a calendar year basis. When a relevant milestone was reached, the warrant became exercisable with respect to the corresponding tranche of warrant shares. The warrant expired on January 31, 2025. \nIn 2021, we met the processing volume milestone required to vest in the first tranche of the warrant and exercised the option to purchase shares of Adyen.\nIn the fourth quarter of 2024, we met the processing volume milestone required to vest in the second tranche of our warrant to purchase shares of Adyen. Upon vesting, we exercised the option to purchase shares of Adyen valued at $\n630\n million in exchange for $\n108\n million in cash. Cash paid related to the exercise of the second tranche of the warrant was classified as an investing activity in our consolidated statement of cash flows. As of December 31, 2024, the probability of meeting the processing volume milestone targets for remaining \ntwo\n tranches of the Adyen warrant was zero.\n89\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nRefer to “Note 6 —\n \nInvestments” for more information about our equity investments.\nThe warrant was accounted for as a derivative under ASC Topic 815, \nDerivatives and Hedging\n. As of December 31, 2023, the warrant was reported as a component of other current assets on the consolidated balance sheet. Changes in the fair value of the warrant were recognized in “Gain (loss) on equity investments and warrant, net” in our consolidated statement of income. The day-one value attributable to the other side of the warrant, which was recognized as a deferred credit, was reported within “Accrued expenses and other current liabilities” in our consolidated balance sheet and was amortized over the life of the initial commercial arrangement. See “Note 8 — Fair Value Measurements” for information about the fair value measurement of the warrant.\nFair Value of Derivative Contracts\nThe following table presents the fair values of our outstanding derivative instruments as of the dates indicated (in millions):\nDecember 31,\n \nBalance Sheet Location\n2024\n2023\nDerivative Assets:\nForeign exchange contracts designated as cash flow hedges\nOther current assets\n$\n41\n \n$\n10\n \nForeign exchange contracts not designated as hedging instruments\nOther current assets\n20\n \n13\n \nInterest rate contracts designated as cash flow hedges\nOther current assets\n7\n \n—\n \nWarrant\nOther current assets\n—\n \n364\n \nForeign exchange contracts designated as cash flow hedges\nOther assets\n14\n \n9\n \nOther\nOther assets\n15\n \n—\n \nTotal derivative assets\n$\n97\n \n$\n396\n \nDerivative Liabilities:\nForeign exchange contracts designated as cash flow hedges\nOther current liabilities\n$\n—\n \n$\n14\n \nForeign exchange contracts not designated as hedging instruments\nOther current liabilities\n18\n \n19\n \nTotal derivative liabilities\n$\n18\n \n$\n33\n \nTotal fair value of derivative instruments\n$\n79\n \n$\n363\n \nUnder the master netting agreements with the respective counterparties to our derivative contracts, subject to applicable requirements, we are allowed to net settle transactions of the same type with a single net amount payable by one party to the other. However, we have elected to present the derivative assets and derivative liabilities on a gross basis in our consolidated balance sheet. As of December 31, 2024, the potential effect of rights of set-off associated with the foreign exchange contracts would be an offset to both assets and liabilities by $\n17\n million, resulting in net derivative assets of $\n58\n million. As of December 31, 2024, there was \nno\n potential effect of rights of set-off associated with the interest rate contracts as there were no liability positions.\n90\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nEffect of Derivative Contracts on Accumulated Other Comprehensive Income\nThe following tables present the activity of derivative instruments designated as cash flow hedges as of December 31, 2024 and 2023, and the impact of these derivative contracts on AOCI for the periods indicated (in millions):\n \nDecember 31, 2023\nAmount of Gain Recognized in Other Comprehensive Income\nLess: Amount of Gain (Loss) Reclassified From AOCI to Earnings\nDecember 31, 2024\nForeign exchange contracts designated as cash flow hedges\n$\n(\n64\n)\n$\n33\n \n$\n(\n56\n)\n$\n25\n \nInterest rate contracts designated as cash flow hedges\n51\n \n7\n \n8\n \n50\n \nTotal\n$\n(\n13\n)\n$\n40\n \n$\n(\n48\n)\n$\n75\n \n \nDecember 31, 2022\nAmount of Loss Recognized in Other Comprehensive Income\nLess: Amount of Gain Reclassified From AOCI to Earnings\nDecember 31, 2023\nForeign exchange contracts designated as cash flow hedges\n$\n52\n \n$\n(\n63\n)\n$\n53\n \n$\n(\n64\n)\nInterest rate contracts designated as cash flow hedges\n62\n \n—\n \n11\n \n51\n \nTotal\n$\n114\n \n$\n(\n63\n)\n$\n64\n \n$\n(\n13\n)\nEffect of Derivative Contracts on Consolidated Statement of Income\nThe following table summarizes the total gain (loss) recognized in the consolidated statement of income from our foreign exchange derivative contracts by location for the periods indicated (in millions):\nYear Ended December 31,\n \n2024\n2023\n2022\nForeign exchange contracts designated as cash flow hedges recognized in net revenues\n$\n(\n54\n)\n$\n56\n \n$\n140\n \nForeign exchange contracts designated as cash flow hedges recognized in cost of net revenues\n \n(\n2\n)\n(\n3\n)\n(\n2\n)\nForeign exchange contracts not designated as hedging instruments recognized in interest income and other, net\n22\n \n4\n \n20\n \nTotal gain (loss) recognized from foreign exchange derivative contracts in the consolidated statement of income\n$\n(\n34\n)\n$\n57\n \n$\n158\n \nThe following table summarizes the total gain recognized in the consolidated statement of income from our interest rate derivative contracts by location for the periods indicated (in millions):\nYear Ended December 31,\n \n2024\n2023\n2022\nInterest rate contracts designated as cash flow hedges recognized in interest income and other, net\n$\n8\n \n$\n11\n \n$\n9\n \nInterest rate contracts designated as fair value hedges recognized in interest income and other, net\n2\n \n—\n \n—\n \nTotal gain recognized from interest rate derivative contracts in the consolidated statement of income\n$\n10\n \n$\n11\n \n$\n9\n \n91\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nThe following table summarizes the total gain (loss) recognized in the consolidated statement of income due to changes in the fair value of the warrant for the periods indicated (in millions): \nYear Ended December 31,\n \n2024\n2023\n2022\nGain (loss) attributable to changes in the fair value of warrant recognized in gain (loss) on equity investments and warrant, net\n$\n158\n \n$\n150\n \n$\n(\n230\n)\nNotional Amounts of Derivative Contracts\nDerivative transactions are measured in terms of the notional amount, but this amount is not recognized in our consolidated balance sheet and is not, when viewed in isolation, a meaningful measure of the risk profile of the instruments. The notional amount is generally not exchanged, but is used only as the basis on which the value of foreign exchange payments under these contracts are determined. \nThe following table presents the notional amounts of our outstanding derivatives as of the dates indicated (in millions):\nDecember 31,\n2024\n2023\nForeign exchange contracts designated as cash flow hedges\n$\n1,329\n \n$\n1,699\n \nForeign exchange contracts not designated as hedging instruments\n1,667\n \n2,225\n \nInterest rate contracts designated as cash flow hedges\n150\n \n—\n \nTotal\n$\n3,146\n \n$\n3,924\n \nCredit Risk \nOur derivatives expose us to credit risk to the extent that the counterparties may be unable to meet the terms of the arrangement. We seek to mitigate such risk by limiting our counterparties to, and by spreading the risk across, major financial institutions. In addition, the potential risk of loss with any one counterparty resulting from this type of credit risk is monitored on an ongoing basis.\n92\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nNote 8 — \nFair Value Measurement of Assets and Liabilities\nThe following tables present our financial assets and liabilities measured at fair value on a recurring basis as of the dates indicated (in millions):\nDecember 31, 2024\nQuoted Prices in Active Markets for Identical Assets\n(Level 1) \nSignificant Other Observable Inputs\n(Level 2)\nSignificant Unobservable Inputs\n(Level 3)\nAssets:\n \n \n \nCash, cash equivalents and restricted cash\nCash and cash equivalents\n$\n2,433\n \n$\n2,433\n \n$\n—\n \n$\n—\n \nCustomer accounts\n763\n \n763\n \n—\n \n—\n \nRestricted cash included in other current assets\n88\n \n88\n \n—\n \n—\n \nRestricted cash included in other assets\n2\n \n2\n \n—\n \n—\n \nTotal cash, cash equivalents and restricted cash\n3,286\n \n3,286\n \n—\n \n—\n \nDerivatives\n97\n \n—\n \n82\n \n15\n \nShort-term investments:\nCorporate debt securities\n3,094\n \n—\n \n3,094\n \n—\n \nGovernment and agency securities\n363\n \n—\n \n363\n \n—\n \nTotal short-term investments\n3,457\n \n—\n \n3,457\n \n—\n \nLong-term investments:\nCorporate debt securities\n1,119\n \n—\n \n1,119\n \n—\n \nGovernment and agency securities\n190\n \n—\n \n190\n \n—\n \nTotal long-term investments\n1,309\n \n—\n \n1,309\n \n—\n \nTotal financial assets\n$\n8,149\n \n$\n3,286\n \n$\n4,848\n \n$\n15\n \nLiabilities:\nDerivatives\n$\n18\n \n$\n—\n \n$\n18\n \n$\n—\n \n93\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nDecember 31, 2023\nQuoted Prices in Active Markets for Identical Assets\n(Level 1)\n \nSignificant Other Observable Inputs\n(Level 2)\nSignificant Unobservable Inputs\n(Level 3)\nAssets:\n \n \n \nCash, cash equivalents and restricted cash\nCash and cash equivalents\n$\n1,985\n \n$\n1,985\n \n$\n—\n \n$\n—\n \nCustomer accounts\n481\n \n481\n \n—\n \n—\n \nRestricted cash included in other current assets\n23\n \n23\n \n—\n \n—\n \nRestricted cash included in other assets\n4\n \n4\n \n—\n \n—\n \nTotal cash, cash equivalents and restricted cash\n2,493\n \n2,493\n \n—\n \n—\n \nEquity investment in Adevinta\n4,474\n \n4,474\n \n—\n \n—\n \nDerivatives\n396\n \n—\n \n32\n \n364\n \nShort-term investments:\nCorporate debt securities\n2,162\n \n—\n \n2,162\n \n—\n \nGovernment and agency securities\n371\n \n—\n \n371\n \n—\n \nTotal short-term investments\n2,533\n \n—\n \n2,533\n \n—\n \nLong-term investments:\nCorporate debt securities\n328\n \n—\n \n328\n \n—\n \nGovernment and agency securities\n271\n \n—\n \n271\n \n—\n \nEquity investment under the fair value option\n335\n \n—\n \n—\n \n335\n \nTotal long-term investments\n934\n \n—\n \n599\n \n335\n \nTotal financial assets\n$\n10,830\n \n$\n6,967\n \n$\n3,164\n \n$\n699\n \nLiabilities:\nOther liabilities\n$\n10\n \n$\n—\n \n$\n—\n \n$\n10\n \nDerivatives\n$\n33\n \n$\n—\n \n$\n33\n \n$\n—\n \nOur financial assets and liabilities are valued using market prices on both active markets (Level 1), less active markets (Level 2) and little or no market activity (Level 3). Level 1 instrument valuations are obtained from real-time quotes for transactions in active exchange markets involving identical assets. Level 2 instrument valuations are obtained from readily available pricing sources for comparable instruments, identical instruments in less active markets, or models using market observable inputs. Level 3 instrument valuations typically reflect management’s estimate of assumptions that market participants would use in pricing the asset or liability. We did not have any transfers of financial instruments between valuation levels during 2024 or 2023.\nOther financial instruments, including accounts receivable, funds receivable, accounts payable and funds payable, are carried at cost, which approximates their fair value because of the short-term nature of these instruments.\n94\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nFair value measurement of derivative instruments \nThe majority of our derivative instruments are valued using pricing models that take into account the contract terms as well as multiple inputs where applicable, such as equity prices, interest rate yield curves, option volatility and currency rates. \nThe Adyen warrant, which was accounted for as a derivative instrument, was valued using a Black-Scholes model. Key assumptions used in the valuation included risk-free interest rates; Adyen’s common stock price, equity volatility and common stock outstanding; exercise price; and details specific to the warrant. The value was also probability adjusted for management’s assumptions with respect to vesting of the remaining tranches which were each subject to meeting processing volume milestone targets. In the fourth quarter of 2024, we met the processing volume milestone required to vest in the second tranche of the Adyen warrant. As of December 31, 2024, the probability of meeting the processing volume milestone requirements for the remaining \ntwo\n tranches of the Adyen warrant was zero. The Adyen warrant expired on January 31, 2025. Refer to “Note 7 — Derivative Instruments” for further details on our derivative instruments.\nThe following table presents a reconciliation of the opening to closing balance of the Adyen warrant measured using significant unobservable inputs (Level 3) as of the dates indicated (in millions):\nDecember 31,\n2024\n2023\nOpening balance at beginning of period\n$\n364\n \n$\n214\n \nChange in fair value\n158\n \n150\n \nExercise of options under warrant\n(\n522\n)\n—\n \nClosing balance at end of period\n$\n—\n \n$\n364\n \n \nFair value measurement of equity investments\nCertain equity investments are measured at fair value on a recurring basis, including our equity investment in Adevinta and equity investments under the fair value option. \nOur equity investment in Adevinta was accounted for under the fair value option and classified within Level 1 in the fair value hierarchy as the fair value was measured based on Adevinta’s closing stock price and prevailing foreign exchange rate at each balance sheet date.\nOur equity investment in Gmarket was accounted for under the fair value option and classified within Level 3 in the fair value hierarchy as valuation of the investment reflected management’s estimate of assumptions that market participants would use in pricing the asset. In December 2024, we sold our remaining stake in Gmarket valued at $\n323\n million.\nThe following table presents a reconciliation of the opening to closing balance of the equity investment in Gmarket measured using significant unobservable inputs (Level 3) as of the dates indicated (in millions):\nDecember 31, 2024\nDecember 31, 2023\nOpening balance at beginning of period\n$\n335\n \n$\n431\n \nChange in fair value\n(\n12\n)\n(\n96\n)\nFair value of shares sold\n(\n323\n)\n—\n \nClosing balance at end of period\n$\n—\n \n$\n335\n \nCertain other immaterial equity investments under the fair value option aggregating to $\n54\n million and $\n47\n million as of December 31, 2024 and December 31, 2023, respectively, are measured at fair value using the net asset value per share (or its equivalent) practical expedient, and have not been classified in the fair value hierarchy. \nRefer to “Note 6 — Investments” for further details about our equity investments.\n95\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nNote 9 — \nSupplemental Consolidated Financial Information\n \nContract Balances\nTiming of revenue recognition may differ from the timing of invoicing to customers. Accounts receivable represents amounts invoiced and revenue recognized prior to invoicing when we have satisfied our performance obligation and have the unconditional right to payment. The allowance for doubtful accounts and authorized credits is estimated based upon our assessment of various factors including historical experience, the age of the accounts receivable balances, current economic conditions,\n reasonable and supportable forecasts\n and other factors that may affect our customers’ ability to pay. The allowance for doubtful accounts and authorized credits was $\n37\n million and $\n49\n million as of December 31, 2024 and December 31, 2023, respectively. As of December 31, 2024, we reported allowances for doubtful accounts of $\n13\n million, reflecting a decrease of $\n10\n million, net of write-offs of $\n29\n million, for the year ended December 31, 2024. As of December 31, 2024, we reported allowances for authorized credits of $\n24\n million, reflecting a decrease of $\n2\n million, net of write-offs of $\n4\n million, for the year ended December 31, 2024. As of December 31, 2023, we reported an allowance for doubtful accounts of $\n23\n million and an allowance for authorized credits of $\n26\n million.\nDeferred revenue consists of fees received related to unsatisfied performance obligations at the end of the period. Due to the generally short-term duration of contracts, the majority of the performance obligations are satisfied in the following reporting period. The amount of revenue recognized during the year ended December 31, 2024 that was included in the deferred revenue balance at the beginning of the period was $\n32\n million. The amount of revenue recognized during the year ended December 31, 2023 that was included in the deferred revenue balance at the beginning of the period was $\n33\n million.\nCustomer accounts and funds receivable\nDecember 31,\n2024\n2023\n(In millions)\nCustomer accounts\n$\n763\n \n$\n481\n \nFunds receivable\n199\n \n532\n \nCustomer accounts and funds receivable\n$\n962\n \n$\n1,013\n \nOther current assets\n \nDecember 31,\n2024\n \n2023\n(In millions)\nPrepaid expenses\n$\n136\n \n$\n116\n \nIncome and other tax receivable\n115\n \n99\n \nAccounts receivable, net\n108\n \n94\n \nRestricted cash\n88\n \n23\n \nShort-term derivative assets\n68\n \n23\n \nWarrant\n—\n \n364\n \nOther\n200\n \n292\n \nOther current assets\n$\n715\n \n$\n1,011\n \n96\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nProperty and equipment, net\n \nDecember 31,\n2024\n \n2023\nEstimated useful lives\n(In millions)\nComputer equipment and software\n$\n4,685\n \n \n$\n4,905\n \n1\n - \n4\n years\nLand and buildings, including building improvements\n810\n \n \n829\n \nUp to \n30\n years\nLeasehold improvements\n428\n \n \n418\n \nShorter of \n5\n years or lease term\nFurniture and fixtures\n133\n \n \n141\n \n3\n years\nConstruction in progress and other\n76\n \n \n153\n \nNot applicable\nProperty and equipment, gross\n6,132\n \n \n6,446\n \nAccumulated depreciation\n(\n4,869\n)\n \n(\n5,203\n)\nProperty and equipment, net\n$\n1,263\n \n \n$\n1,243\n \nTotal depreciation expense on our property and equipment for the years ended December 31, 2024, 2023 and 2022 totaled $\n370\n million, $\n441\n million and $\n442\n million, respectively.\nAccrued expenses and other current liabilities\n \nDecember 31,\n2024\n \n2023\n(In millions)\nAccrued sales and use tax and VAT\n$\n515\n \n$\n424\n \nCompensation and related benefits\n498\n \n581\n \nAccrued marketing expenses\n222\n \n181\n \nOther current tax liabilities\n173\n \n15\n \nTransaction loss reserve\n118\n \n125\n \nOperating lease liabilities\n118\n \n118\n \nAccrued general and administrative expenses\n68\n \n79\n \nAccrued interest expense\n45\n \n56\n \nDeferred revenue\n32\n \n34\n \nAccrued restructuring\n10\n \n102\n \nOther\n385\n \n481\n \nAccrued expenses and other current liabilities\n$\n2,184\n \n$\n2,196\n \n97\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nNote 10 — \nDebt\nThe following table summarizes the carrying value of our outstanding debt (in millions, except percentages):\nCoupon\nAs of\nEffective\nAs of\nEffective\n Rate\nDecember 31, 2024\n Interest Rate\nDecember 31, 2023\n Interest Rate\nLong-Term Debt\nSenior notes:\nSenior notes due 2024\n3.450\n \n%\n$\n—\n \n—\n \n%\n$\n750\n \n3.531\n \n%\nSenior notes due 2025\n1.900\n \n%\n800\n \n1.803\n \n%\n800\n \n1.803\n \n%\nSenior notes due 2025\n5.900\n \n%\n425\n \n6.036\n \n%\n425\n \n6.036\n \n%\nSenior notes due 2026\n1.400\n \n%\n750\n \n1.252\n \n%\n750\n \n1.252\n \n%\nSenior notes due 2027\n3.600\n \n%\n850\n \n3.689\n \n%\n850\n \n3.689\n \n%\nSenior notes due 2027\n5.950\n \n%\n300\n \n6.064\n \n%\n300\n \n6.064\n \n%\nSenior notes due 2030\n2.700\n \n%\n950\n \n2.623\n \n%\n950\n \n2.623\n \n%\nSenior notes due 2031\n2.600\n \n%\n750\n \n2.186\n \n%\n750\n \n2.186\n \n%\nSenior notes due 2032\n6.300\n \n%\n425\n \n6.371\n \n%\n425\n \n6.371\n \n%\nSenior notes due 2042\n4.000\n \n%\n750\n \n4.114\n \n%\n750\n \n4.114\n \n%\nSenior notes due 2051\n3.650\n \n%\n1,000\n \n2.517\n \n%\n1,000\n \n2.517\n \n%\nTotal senior notes\n7,000\n \n7,750\n \nHedge accounting fair value adjustments \n(1)\n—\n \n2\n \nUnamortized discount and debt issuance costs\n(\n23\n)\n(\n29\n)\nLess: Current portion of long-term debt\n(\n1,225\n)\n(\n750\n)\nTotal long-term debt\n5,752\n \n6,973\n \nShort-Term Debt\nCurrent portion of long-term debt\n1,225\n \n750\n \nCommercial paper\n450\n \n—\n \nUnamortized discount and debt issuance costs\n(\n2\n)\n—\n \nTotal short-term debt\n1,673\n \n750\n \nTotal Debt\n$\n7,425\n \n$\n7,723\n \n(1)\n    \nIncludes the fair value adjustments to debt associated with terminated interest rate swaps which are being recognized as a reduction to “Interest expense” over the remaining term of the related notes.\nSenior Notes \nIn 2024, we repaid the $\n750\n million aggregate principal amount of our previously outstanding \n3.450\n% senior notes on the date of maturity. Cash paid related to the repayment was classified as a financing activity in our consolidated statement of cash flows.\nIn 2023, we repaid the $\n1.2\n billion \naggregate principal amount of our previously outstanding \nfloating rate and \n2.750\n% senior notes \non the date of maturity\n. \nCash paid related to the repayment was classified as a financing activity in our consolidated statement of cash flows.\nIn 2022, we repaid the $\n1.4\n billion aggregate principal amount of our previously outstanding \n2.600\n% and \n3.800\n% senior notes on the date of maturity. Cash paid related to the repayment was classified as a financing activity in our consolidated statement of cash flows.\nIn 2022, we issued senior notes of $\n1.2\n billion aggregate principal amount, which consisted of $\n425\n million aggregate principal amount of \n5.900\n% fixed rate notes due 2025, $\n300\n million aggregate principal amount of \n5.950\n% fixed rate notes due to 2027 and $\n425\n million aggregate principal amount of \n6.300\n% fixed rate notes due 2032. Cash proceeds related to the issuance of our \n5.900\n%, \n5.950\n%, and \n6.300\n% senior notes were classified as a financing activity in our consolidated statement of cash flows.\n98\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nWe may redeem some or all of the other fixed rate notes of each series at any time and from time to time prior to their maturity, generally at a make-whole redemption price, plus accrued and unpaid interest. \nIf a change of control triggering event (as defined in the applicable series of notes) occurs with respect to the \n1.900\n% notes due 2025, the \n5.900\n% notes due 2025, the \n1.400\n% notes due 2026, the \n3.600\n% notes due 2027, the \n5.950\n% notes due 2027, the \n2.700\n% notes due 2030, the \n2.600\n% notes due 2031, the \n6.300\n% notes due 2032, the \n4.000\n% notes due 2042, or the \n3.650\n% notes due 2051, we must, subject to certain exceptions, offer to repurchase all of the notes of the applicable series at a price equal to \n101\n% of the principal amount, plus accrued and unpaid interest.\nThe indenture pursuant to which the senior notes were issued includes customary covenants that, among other things and subject to exceptions, limit our ability to incur, assume or guarantee debt secured by liens on specified assets or enter into sale and lease-back transactions with respect to specified properties, and also includes customary events of default with customary grace periods in certain circumstances, including payment defaults and bankruptcy-related defaults.\nThe effective interest rates for our senior notes include the interest payable, the amortization of debt issuance costs and the amortization of any original issue discount and premium on these senior notes. Interest on these senior notes is payable either quarterly or semiannually. Interest expense associated with these senior notes, including amortization of debt issuance costs, during the years ended December 31, 2024, 2023 and 2022 was $\n247\n million, $\n260\n million and $\n231\n million, respectively. As of December 31, 2024 and 2023, the estimated fair value of these senior notes, using Level 2 inputs, was $\n6.3\n billion and $\n7.1\n billion, respectively.\nCommercial Paper\nWe have a commercial paper program pursuant to which we may issue commercial paper notes in an aggregate principal amount at maturity of up to $\n1.5\n billion outstanding at any time with maturities of up to \n397\n days from the date of issue. In 2024, we issued and repaid $\n180\n million of commercial paper notes with original maturities less than 90 days and issued $\n450\n million of commercial paper notes with original maturities greater than 90 days. As of December 31, 2024, we had $\n450\n million of commercial paper notes outstanding with a weighted average interest rate of \n5.10\n% per annum, and a weighted average remaining term of \n144\n days. As of December 31, 2023, there were \nno\n commercial paper notes outstanding. Cash proceeds related to the issuance of commercial paper and cash used to repay commercial paper were classified as financing activities in our consolidated statement of cash flows.\nIn January 2025, we repaid the $\n450\n million aggregate principal amount of the previously outstanding commercial paper notes on the date of maturity.\n99\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nCredit Agreement \nIn March 2020, we entered into a credit agreement that provided for an unsecured $\n2\n billion \nfive-year\n credit facility (the “Prior Credit Agreement”).\nIn January 2024, we terminated the Prior Credit Agreement and entered into a new credit agreement (the “Credit Agreement”) that provides for an unsecured $\n2.0\n billion \nfive-year\n revolving credit facility. We may also, subject to the agreement of the applicable lenders, increase the commitments under the revolving credit facility by up to $\n1.0\n billion. Funds borrowed under the Credit Agreement may be used for working capital, capital expenditures, acquisitions and other general corporate purposes and will bear interest at either (i) a customary forward-looking term rate based on the secured overnight financing rate published by CME Group for the relevant interest period plus an adjustment of \n0.1\n% or (ii) a customary base rate formula, plus a margin (based on our public debt ratings) ranging from \n0\n% to \n0.375\n%.\nAs of December 31, 2024, \nno\n borrowings were outstanding under our $\n2.0\n billion Credit Agreement. However, as described above, we have an up to $\n1.5\n billion commercial paper program and are required to maintain available borrowing capacity under our Credit Agreement in order to repay commercial paper borrowings in the event we are unable to repay those borrowings from other sources when they become due, in an aggregate amount of $\n1.5\n billion. As of December 31, 2024, we had $\n450\n million of commercial paper notes outstanding; therefore, $\n1.6\n billion of borrowing capacity was available for other purposes permitted by the Credit Agreement, subject to customary conditions to borrowing. The Credit Agreement includes a covenant limiting our consolidated leverage ratio to no more than \n4.0\n:1.0, subject to, upon the occurrence of a qualified material acquisition, if so elected by us, a step-up to \n4.5\n:1.0 for the four fiscal quarters completed following such qualified material acquisition. The Credit Agreement includes customary events of default, with corresponding grace periods in certain circumstances, including payment defaults, cross-defaults and bankruptcy-related defaults.\n \nIn addition, the Credit Agreement contains customary affirmative and negative covenants, including restrictions regarding the incurrence of liens and subsidiary indebtedness, in each case, subject to customary exceptions. The Credit Agreement also contains customary representations and warranties.\nWe were in compliance with all financial covenants in our outstanding debt instruments for the period ended December 31, 2024.\nFuture Maturities \nThe following table presents expected future principal maturities as of the date indicated (in millions):\nDecember 31, 2024\n2025\n$\n1,225\n \n2026\n750\n \n2027\n1,150\n \n2028\n—\n \n2029\n—\n \nThereafter\n3,875\n \nTotal future maturities\n$\n7,000\n \n100\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nNote 11 — \nLeases\nWe have operating leases for office space, data centers and other corporate assets that we utilize under lease arrangements. \nThe following table presents a summary of leases by balance sheet location as of the dates indicated (in millions):\n \nDecember 31,\nBalance Sheet Location\n2024\n2023\nAssets\nOperating\nOperating lease right-of-use (“ROU”) assets\n$\n427\n \n$\n493\n \nLiabilities\nOperating - current\nAccrued expenses and other current liabilities\n$\n118\n \n$\n118\n \nOperating - noncurrent\nOperating lease liabilities\n320\n \n387\n \nTotal lease liabilities\n$\n438\n \n$\n505\n \nThe following table presents components of lease expense for the periods indicated (in millions):\nYear Ended December 31,\nStatement of Income Location\n2024\n2023\n2022\nOperating lease costs \n(1)\nCost of net revenues, Sales and marketing, Product development and General and administrative expenses\n$\n147\n \n$\n128\n \n$\n132\n \n(1)\nIncludes variable lease payments and sublease income that were immaterial for the years ended December 31, 2024, 2023 and 2022.\n \n \nThe following table presents the maturity of lease liabilities under our non-cancelable operating leases as of the date indicated (in millions): \nDecember 31, 2024\n2025\n$\n137\n \n2026\n117\n \n2027\n97\n \n2028\n67\n \n2029\n18\n \nThereafter\n57\n \nTotal lease payments\n493\n \nLess interest\n(\n55\n)\nPresent value of lease liabilities\n$\n438\n \nAs of December 31, 2024, we have non-cancellable operating leases for offices and data centers that have not commenced with fixed lease payment obligations of $\n51\n million, with $\n5\n million payable within 12 months. We are not involved in the construction or design of underlying assets.\nRent expense for the years ended December 31, 2024, 2023 and 2022 totaled $\n153\n million, $\n137\n million and $\n144\n million, respectively. Rent expense includes operating lease costs as well as expense for non-lease components such as common area maintenance.\n101\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nThe following table presents supplemental information related to our leases included in the consolidated balance sheet as of the dates indicated:\nDecember 31,\n2024\n2023\nWeighted average remaining lease term\nOperating leases\n4.40\n years\n4.80\n years\nWeighted average discount rate\nOperating leases\n4.91\n \n%\n4.00\n \n%\nThe following table presents supplemental information related to our leases for the periods indicated (in millions):\nYear Ended December 31,\n \n2024\n2023\n2022\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows from operating leases\n$\n147\n \n$\n154\n \n$\n159\n \nROU assets obtained in exchange for new lease obligations:\nOperating leases\n$\n64\n \n$\n102\n \n$\n354\n \n102\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nNote 12 — \nCommitments and Contingencies \nOff-Balance Sheet Arrangements\nAs of December 31, 2024, we had no off-balance sheet arrangements that have, or are reasonably likely to have, a current or future material effect on our consolidated financial condition, results of operations, liquidity, capital expenditures or capital resources. \nLitigation and Other Legal Matters\n \nWe are involved in legal and regulatory proceedings on an ongoing basis. If we believe that a loss arising from such matters is probable and can be reasonably estimated, we accrue the estimated liability in our financial statements. If only a range of estimated losses can be determined, we accrue an amount within the range that, in our judgment, reflects the most likely outcome; if none of the estimates within that range is a better estimate than any other amount, we accrue the low end of the range. For those proceedings in which an unfavorable outcome is reasonably possible but not probable, we have disclosed an estimate of the reasonably possible loss or range of losses or we have concluded that an estimate of the reasonably possible loss or range of losses arising directly from the proceeding (i.e., monetary damages or amounts paid in judgment or settlement) is not material. If we cannot estimate the probable or reasonably possible loss or range of losses arising from a proceeding, we have disclosed that fact. In assessing the materiality of a proceeding, we evaluate, among other factors, the amount of monetary damages claimed, as well as the potential impact of non-monetary remedies sought by plaintiffs (e.g., injunctive relief) that may require us to change our business practices in a manner that could have a material adverse impact on our business. Legal fees are expensed as incurred.\nOn January 31, 2024, the Drug Enforcement Administration, U.S. Department of Justice (the “DOJ”) and the Company entered into a settlement agreement (the “DEA Settlement Agreement”), which fully resolved DOJ’s allegations of noncompliance arising under the Controlled Substances Act. Pursuant to the DEA Settlement Agreement, the Company paid $\n59\n million and agreed to implement enhanced processes regarding its monitoring and reporting of listings that violate the Company’s policies.\nIn January 2024, the Company also entered into a deferred prosecution agreement (the “DPA”) with the United States Attorney for the District of Massachusetts (the “U.S. Attorney”) regarding potential criminal liability of the Company arising from the stalking and harassment in 2019 of the editor and publisher of Ecommercebytes, a website that publishes ecommerce news and information. \nSix\n former Company employees and \none\n former contractor have pleaded guilty to crimes arising from the conduct. Pursuant to the terms of the DPA, the U.S. Attorney filed a six-count criminal Information in the United States District Court for the District of Massachusetts in January 2024 and agreed to defer any prosecution of the Company on those counts. Additionally, during the \nthree-year\n term of the DPA, the Company is subject to an independent compliance monitor to assess its compliance program and, where appropriate, to modify that program. The Company also paid a $\n3\n million penalty. If the Company successfully meets its obligations under the DPA, after \nthree years\n, the DPA will expire, and the U.S. Attorney has agreed to dismiss the criminal Information against the Company. The editor and publisher also have a pending civil action against the Company arising from the above-described conduct.\nOn September 27, 2023, the DOJ, on behalf of the Environmental Protection Agency (collectively, the “Government”), filed a civil complaint in the United States District Court for the Eastern District of New York (the “District Court”) alleging that we are liable for the sale of regulated or illicit products manufactured and sold by third parties who listed such products on the Marketplace platforms in a manner that evaded and/or was designed to evade detection in violation of the Clean Air Act, Federal Insecticide, Fungicide, and Rodenticide Act and the Toxic Substances Control Act. On September 30, 2024, the District Court issued an order dismissing the Government’s claims in their entirety. On November 26, 2024, the Government filed a Notice of Appeal with the Second Circuit, seeking review of the District Court’s decision. If the Government were to successfully appeal the decision and we were subsequently found to be liable for such activities on the Marketplace, we likely would be subject to monetary damages, compulsory changes in our business practices, or other remedies that could have a material adverse impact on our business. During the year ended December 31, 2024, we released amounts previously accrued for estimated losses in connection with the Government’s claims, for which we previously believed a loss was probable.\n103\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nAmounts accrued for legal and regulatory proceedings for which we believe a loss is probable were \nnot\n material as of and for the year ended December 31, 2024 compared to $\n132\n million as of December 31, 2023. We have concluded, based on currently available information, that reasonably possible losses arising directly from the proceedings (i.e., monetary damages or amounts paid in judgment or settlement) in excess of our recognized accruals are also not material. However, legal and regulatory proceedings are inherently unpredictable and subject to uncertainties. If one or more matters were resolved against us in a reporting period for amounts in excess of management’s expectations, the impact on our operating results or financial condition for that reporting period could be material.\nIndemnification Provisions\nWe entered into a separation and distribution agreement and various other agreements with PayPal to govern the separation and relationship of the \ntwo\n companies. These agreements provide for specific indemnity and liability obligations and could lead to disputes between us and PayPal, which may be significant. In addition, the indemnity rights we have against PayPal under the agreements may not be sufficient to protect us and our indemnity obligations to PayPal may be significant.\nIn addition, we have entered into indemnification agreements with each of our directors and executive officers. These agreements require us to indemnify such individuals, to the fullest extent permitted by Delaware law, for certain liabilities to which they may become subject as a result of their affiliation with us.\nIn the ordinary course of business, we have included limited indemnification provisions in certain of our agreements with parties with which we have commercial relations, including our standard marketing, promotions and application programming interface license agreements. Under these contracts, we may indemnify, hold harmless and agree to reimburse the indemnified party for losses suffered or incurred by the indemnified party in connection with claims by a third party with respect to intellectual property infringement, including to our trademarks, logos and proprietary software, and other branding elements, such as domain names, to the extent that such are applicable to our performance under the subject agreement. In certain cases, we have agreed to provide indemnification for gross negligence, willful misconduct, fraud and breach of representations, warranties and applicable law. It is not possible to determine the maximum potential loss under these indemnification provisions due to our limited history of prior indemnification claims and the unique facts and circumstances involved in each particular provision. To date, losses recognized in our consolidated statement of income in connection with our indemnification provisions have not been significant, either individually or collectively.\n104\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nNote 13 — \nStockholders’ Equity \nPreferred Stock\nWe are authorized, subject to limitations prescribed by Delaware law, to issue preferred stock in one or more series; to establish the number of shares included within each series; to fix the rights, preferences and privileges of the shares of each wholly unissued series and any related qualifications, limitations or restrictions; and to increase or decrease the number of shares of any series (but not below the number of shares of a series then outstanding) without any further vote or action by our stockholders. As of December 31, 2024 and 2023, there were \n10\n million shares of $\n0.001\n par value preferred stock authorized for issuance, and \nno\n shares issued or outstanding. \nCommon Stock\nOur Amended and Restated Certificate of Incorporation authorizes us to issue \n3.6\n billion shares of common stock. \nStock Repurchase Program\nOur stock repurchase programs are intended to programmatically offset the impact of dilution from our equity compensation programs and, subject to market conditions and other factors, to make opportunistic and programmatic repurchases of our common stock to reduce our outstanding share count and return value to stockholders. Any share repurchases under our stock repurchase programs may be made through open market transactions, block trades, privately negotiated transactions (including accelerated share repurchase transactions) or other means at times and in such amounts as management deems appropriate and will be funded from our working capital or other financing alternatives. Our stock repurchase programs may be limited or terminated at any time without prior notice. The timing and actual number of shares repurchased will depend on a variety of factors, including corporate and regulatory requirements, price and other market conditions and management’s determination as to the appropriate use of our cash. Cash paid related to the repurchase of common stock was classified as a financing activity in our consolidated statement of cash flows.\nIn February and December 2024, our Board authorized an incremental $\n2.0\n billion and $\n3.0\n billion, respectively, under our stock repurchase program in addition to the $\n4.0\n billion previously authorized in 2022. Our stock repurchase program has no expiration from the date of authorization.\nThe following table summarizes repurchase activity under our stock repurchase programs during 2024 (in millions, except per share amounts):\nShares Repurchased \n(1)\nAverage Price per Share \n(2)\nValue of Shares \nRepurchased \n(2)\nRemaining Amount Authorized\nBalance as of January 1, 2024\n$\n1,447\n \nAuthorization of additional repurchases in February 2024\n2,000\n \nAuthorization of additional repurchases in December 2024\n3,000\n \nRepurchase of shares of common stock\n56\n \n$\n56.05\n \n$\n3,149\n \n(\n3,149\n)\nBalance as of December 31, 2024\n$\n3,298\n \n(1)\nThese repurchased shares of common stock were recognized as “Treasury stock” and were accounted for under the cost method. \nNone\n of the repurchased shares of common stock have been retired. \n(2)\nExcludes broker commissions and excise tax accruals.\n \nDividends\nWe paid a total of $\n533\n million, $\n528\n million and $\n489\n million in cash dividends during the years ended December 31, 2024, 2023 and 2022, respectively. In February 2025, our Board declared a cash dividend of $\n0.29\n per share of common stock to be paid on March 28, 2025 to stockholders of record as of March 14, 2025. Cash paid related to the payment of dividends was classified as a financing activity in our consolidated statement of cash flows.\n105\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nNote 14 — \nEmployee Benefit Plans\nEquity Incentive Plans\nWe have equity incentive plans under which we grant equity awards inclusive of restricted stock units (“RSUs”), and performance-based restricted stock units (“PBRSUs”) to our directors, officers and employees. As of December 31, 2024, \n785\n million shares were authorized under our equity incentive plans and \n34\n million shares were available for future grant.\nRSU awards granted to eligible employees under our equity incentive plans generally vest in annual or quarterly installments over a period of \nfour\n years and are subject to continued employment.\nIn 2024, 2023 and 2022, certain executives were eligible to receive PBRSUs. Each PBRSU cycle has a \nthree-year\n performance period (consisting of the average performance each year relative to the financial performance goals for that year), along with a total shareholder return modifier based on the Company’s stock performance relative to the S&P 500 over a \nthree-year\n performance period. The financial performance goals for each year of the performance period are approved by the Compensation and Human Capital Committee at the beginning of that year. The target number of shares subject to the PBRSU award are adjusted based on the Company’s actual performance in relation to the target financial performance and then adjusted by the total shareholder return modifier at the end of the applicable performance period. Any earned PBRSUs vest, if at all, in March following the end of the applicable \nthree-year\n performance period.\nEmployee Stock Purchase Plan\nWe have an Employee Stock Purchase Plan (“ESPP”) for eligible employees. Under the ESPP, shares of our common stock may be purchased over an offering period with a maximum duration of \ntwo years\n at \n85\n% of the lower of the fair market value on the first day of the applicable offering period or on the last day of the \nsix-month\n purchase period. Employees may purchase shares having a value not exceeding \n10\n% of their eligible compensation during an offering period and subject to statutory limits. During 2024, employees purchased approximately \n3\n million shares under this plan compared to \n2\n million shares in both 2023 and 2022 at average prices of $\n33.14\n, $\n33.63\n and $\n38.04\n per share, respectively. As of December 31, 2024, approximately \n26\n million shares of common stock were reserved for future issuance.\nRestricted Stock Unit Activity\nThe following table presents RSU activity (including PBRSUs that have been earned) under our equity incentive plans as of and for the year ended December 31, 2024 (in millions, except per share amounts):\n \nUnits\nWeighted Average Grant-Date Fair Value\n(per share)\nOutstanding as of January 1, 2024\n24\n \n$\n48.80\n \nAwarded and assumed\n12\n \n$\n52.62\n \nVested\n(\n11\n)\n$\n50.87\n \nForfeited\n(\n4\n)\n$\n49.05\n \nOutstanding as of December 31, 2024\n21\n \n$\n49.81\n \nExpected to vest as of December 31, 2024\n18\n \n \nDuring 2024, 2023 and 2022, the aggregate intrinsic value of RSUs vested under our equity incentive plans was $\n600\n million, $\n455\n million and $\n448\n million, respectively.\n106\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nStock-Based Compensation Expense\nThe following table presents stock-based compensation expense for the periods indicated (in millions): \nYear Ended December 31,\n \n2024\n2023\n2022\nCost of net revenues\n$\n54\n \n$\n53\n \n$\n51\n \nSales and marketing\n91\n \n92\n \n73\n \nProduct development\n281\n \n272\n \n222\n \nGeneral and administrative\n162\n \n158\n \n148\n \nTotal stock-based compensation expense\n$\n588\n \n$\n575\n \n$\n494\n \nCapitalized in product development\n$\n20\n \n$\n16\n \n$\n14\n \nAs of December 31, 2024, there was $\n810\n million of unearned stock-based compensation that will be expensed from 2025 through 2029. If there are any modifications or cancellations of the underlying unvested awards, we may be required to accelerate, increase or cancel all or a portion of the remaining unearned stock-based compensation expense. Future unearned stock-based compensation will increase to the extent we grant additional equity awards, change the mix of grants between stock options and restricted stock units or assume unvested equity awards in connection with acquisitions.\nEmployee Savings Plans \nWe have a defined contribution plan, which is qualified under Section 401(k) of the Internal Revenue Code. Participating employees may contribute up to \n50\n% of their eligible earned compensation, but not more than statutory limits. During the years ended December 31, 2024, 2023 and 2022, we contributed one dollar for each dollar a participant contributed, with a maximum contribution of \n4\n% of each employee’s eligible earned compensation, subject to a maximum employer contribution of $\n13,800\n, $\n13,200\n and $\n12,200\n per employee for each period, respectively. Our non-U.S. employees are covered by various other savings plans. Total expense for these plans was $\n70\n million, $\n61\n million and $\n58\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\n107\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nNote 15 — \nIncome Taxes \nThe following table presents the components of income (loss) from continuing operations before taxes for the periods indicated (in millions):\n \nYear Ended December 31,\n \n2024\n  \n2023\n  \n2022\nUnited States\n$\n1,286\n \n  \n$\n704\n \n  \n$\n123\n \nInternational\n992\n \n  \n3,003\n \n  \n(\n1,724\n)\n$\n2,278\n \n$\n3,707\n \n$\n(\n1,601\n)\nThe following table summarizes the income tax provision (benefit) for the periods indicated (in millions):\n \nYear Ended December 31,\n \n2024\n \n2023\n \n2022\nCurrent:\n \n \nFederal\n$\n985\n \n \n$\n488\n \n \n$\n350\n \nState and local\n89\n \n \n94\n \n \n36\n \nForeign\n97\n \n \n95\n \n \n67\n \n$\n1,171\n \n \n$\n677\n \n \n$\n453\n \nDeferred:\n \n \nFederal\n$\n(\n993\n)\n \n$\n112\n \n \n$\n(\n847\n)\nState and local\n(\n46\n)\n \n(\n41\n)\n \n(\n50\n)\nForeign\n165\n \n \n184\n \n \n117\n \n(\n874\n)\n \n255\n \n \n(\n780\n)\n$\n297\n \n \n$\n932\n \n \n$\n(\n327\n)\nThe following table presents a reconciliation of the difference between the actual provision for income taxes and the provision computed by applying the federal statutory rate of \n21\n% to income (loss) before income taxes for the periods indicated (in millions): \n \nYear Ended December 31,\n \n2024\n \n2023\n \n2022\nProvision (benefit) at statutory rate\n$\n478\n \n \n$\n778\n \n \n$\n(\n337\n)\nForeign income taxed at different rates\n5\n \n \n8\n \n \n7\n \nOther taxes on foreign operations\n(\n157\n)\n72\n \n13\n \nChange in valuation allowance\n—\n \n \n(\n62\n)\n \n—\n \nStock-based compensation\n7\n \n \n33\n \n \n17\n \nState taxes, net of federal benefit\n43\n \n \n53\n \n \n(\n14\n)\nResearch and other tax credits\n(\n83\n)\n \n(\n44\n)\n \n(\n45\n)\nPenalties\n(\n13\n)\n14\n \n11\n \nImpact of tax rate change\n—\n \n73\n \n—\n \nOther\n17\n \n \n7\n \n \n21\n \n$\n297\n \n$\n932\n \n$\n(\n327\n)\n108\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nDeferred tax assets and liabilities are recognized for the future tax consequences of differences between the carrying amounts of assets and liabilities and their respective tax bases using enacted tax rates in effect for the year in which the differences are expected to be reversed. \nThe following table summarizes significant deferred tax assets and liabilities as of the dates indicated (in millions):\n \nAs of December 31,\n \n2024\n \n2023\nDeferred tax assets:\n \nNet operating loss, capital loss and credits\n$\n181\n \n \n$\n200\n \nAccruals and allowances\n554\n \n \n560\n \nCapitalized research expense\n475\n \n334\n \nStock-based compensation\n10\n \n \n12\n \nAmortizable tax basis in intangibles\n2,701\n \n2,872\n \nNet deferred tax assets\n3,921\n \n \n3,978\n \nValuation allowance\n(\n163\n)\n \n(\n143\n)\n3,758\n \n \n3,835\n \nDeferred tax liabilities:\n \nOutside basis differences\n(\n1,970\n)\n(\n2,817\n)\nAcquisition-related intangibles\n(\n57\n)\n \n(\n65\n)\nDepreciation and amortization\n(\n197\n)\n \n(\n213\n)\nNet unrealized gain on investments\n(\n3\n)\n(\n60\n)\n(\n2,227\n)\n \n(\n3,155\n)\n$\n1,531\n \n \n$\n680\n \nAs of December 31, 2024, our federal, state and foreign net operating loss carryforwards for income tax purposes were $\n27\n million, $\n34\n million and $\n126\n million, respectively. The federal and state net operating loss carryforwards are subject to various limitations under Section 382 of the Internal Revenue Code and applicable state tax laws. If not utilized, the federal and state net operating loss carryforwards will begin to expire in 2027 and 2025, respectively. The carryforward periods on our foreign net operating loss carryforwards are as follows: $\n4\n million do not expire and $\n122\n million are subject to valuation allowance and begin to expire in 2025. As of December 31, 2024, state tax credit carryforwards for income tax purposes were $\n205\n million. Most of the state tax credits carry forward indefinitely.\nAs of December 31, 2024 and 2023, we maintained a valuation allowance with respect to certain of our deferred tax assets relating primarily to operating losses in certain non-U.S. jurisdictions and certain state tax credits and capital losses that we believe are not likely to be realized. \nWe have recognized the tax consequences of all foreign unremitted earnings and management has no specific plans to indefinitely reinvest the unremitted earnings of our foreign subsidiaries as of the balance sheet date. As of December 31, 2024, $\n292\n million of our liability for deemed repatriation of foreign earnings was included in “Income taxes payable” in our consolidated balance sheet. As of December 31, 2023, $\n292\n million of our liability for deemed repatriation of foreign earnings was included in “Other liabilities” in our consolidated balance sheet. We have not provided for deferred taxes on outside basis differences in our investments in our foreign subsidiaries that are unrelated to unremitted earnings. These basis differences will be indefinitely reinvested. A determination of the unrecognized deferred taxes related to these other components of our outside basis difference is not practicable.\n109\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nThe following table presents changes in unrecognized tax benefits for the periods indicated (in millions):\nYear Ended December 31,\n2024\n2023\n2022\nGross amounts of unrecognized tax benefits as of the beginning of the period\n$\n613\n \n$\n493\n \n$\n461\n \nIncreases related to prior period tax positions\n22\n \n120\n \n4\n \nDecreases related to prior period tax positions\n(\n23\n)\n(\n45\n)\n(\n7\n)\nIncreases related to current period tax positions\n67\n \n53\n \n40\n \nSettlements\n(\n5\n)\n(\n8\n)\n(\n5\n)\nGross amounts of unrecognized tax benefits as of the end of the period\n$\n674\n \n$\n613\n \n$\n493\n \nAs of December 31, 2024, gross amounts of unrecognized tax benefits of $\n674\n million included $\n45\n million of unrecognized tax benefits indemnified by PayPal. As of December 31, 2023, gross amounts of unrecognized tax benefits of $\n613\n million included $\n51\n million of unrecognized tax benefits indemnified by PayPal. If total unrecognized tax benefits were realized in a future period, it would result in a tax benefit of $\n499\n million. Of this amount, $\n41\n million of unrecognized tax benefit is indemnified by PayPal and a corresponding receivable would be reduced upon a future realization. As of December 31, 2024, our liabilities for unrecognized tax benefits were included in “Accrued expenses and other current liabilities” and “Other liabilities” in our consolidated balance sheet.\nAs of December 31, 2024, and 2023 we had accrued interest and penalty expense related to uncertain tax positions of $\n130\n million and $\n94\n million, respectively, net of income tax benefits. The “Income tax (benefit) provision” for 2024 and 2023 included interest expense related to uncertain tax positions of $\n31\n million and $\n30\n million, respectively, net of tax benefits. The “Income (loss) from discontinued operations, net of income taxes,” for 2024 and 2023 included interest expense related to uncertain tax positions of $\n1\n million and $\n7\n million, respectively, net of tax benefits.\n \nWe are subject to both direct and indirect taxation in the United States and various states and foreign jurisdictions. We are under examination by certain tax authorities for the 2010 to 2022 tax years. We believe that adequate amounts have been reserved for any adjustments that may ultimately result from these or other examinations. The material jurisdictions where we are subject to potential examination by tax authorities for tax years after 2009 include, among others, the United States (Federal and California), Germany, India, Israel, Switzerland and the United Kingdom.\n \nThe timing of the resolution and/or closure of audits is highly uncertain. Given the number of years remaining subject to examination and the number of matters being examined, we are unable to estimate the full range of possible adjustments to the balance of gross unrecognized tax benefits. We expect the gross amount of unrecognized tax benefits to be reduced within the next 12 months by at least $\n170\n million.\n110\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nNote 16 — \nGain (Loss) on Equity Investments and Warrant, Net and Interest Income and Other, Net\nThe following table presents components of “Gain (loss) on equity investments and warrant, net” for the periods indicated (in millions): \n \nYear Ended December 31,\n \n2024\n  \n2023\n  \n2022\nUnrealized change in fair value of equity investment in Adevinta\n$\n(\n234\n)\n$\n1,782\n \n$\n(\n2,693\n)\nRealized change in fair value of shares sold in Adevinta\n78\n \n—\n \n2\n \nUnrealized change in fair value of equity investment in Adyen\n—\n \n—\n \n(\n118\n)\nRealized change in fair value of shares sold in Adyen\n(\n57\n)\n—\n \n(\n143\n)\nRealized change in fair value of shares sold in Aurelia\n(\n11\n)\n—\n \n—\n \nUnrealized change in fair value of equity investment in Gmarket\n(\n12\n)\n(\n96\n)\n(\n294\n)\nRealized change in fair value of shares sold in Gmarket\n(\n1\n)\n—\n \n—\n \nUnrealized change in fair value of equity investment in KakaoBank\n—\n \n(\n11\n)\n(\n218\n)\nRealized change in fair value of shares sold in KakaoBank\n—\n \n13\n \n(\n75\n)\nGain (loss) on other investments\n3\n \n(\n6\n)\n(\n17\n)\nChange in fair value of warrant\n158\n \n150\n \n(\n230\n)\nTotal gain (loss) on equity investments and warrant, net\n$\n(\n76\n)\n  \n$\n1,832\n \n  \n$\n(\n3,786\n)\nThe following table presents components of “Interest income and other, net” for the periods indicated (in millions):\n \nYear Ended December 31,\n \n2024\n2023\n2022\nInterest income\n$\n272\n \n$\n204\n \n$\n73\n \nForeign exchange and other\n23\n \n(\n7\n)\n(\n3\n)\nTotal interest income and other, net\n$\n295\n \n$\n197\n \n$\n70\n \n111\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nNote 17 — \nAccumulated Other Comprehensive Income\nThe following tables summarize the changes in AOCI for the periods indicated (in millions):\nUnrealized Gains (Losses) on Derivative Instruments\nUnrealized\nGains (Losses) \non Investments\nForeign\nCurrency\nTranslation\nEstimated Tax (Expense) Benefit\nTotal\nBalance as of December 31, 2023\n$\n(\n13\n)\n$\n(\n45\n)\n$\n206\n \n$\n37\n \n$\n185\n \nOther comprehensive income (loss) before reclassifications\n40\n \n38\n \n(\n76\n)\n(\n19\n)\n(\n17\n)\nLess: Amount of gain (loss) reclassified from AOCI\n(\n48\n)\n—\n \n—\n \n10\n \n(\n38\n)\nNet current period other comprehensive income (loss)\n88\n \n38\n \n(\n76\n)\n(\n29\n)\n21\n \nBalance as of December 31, 2024\n$\n75\n \n$\n(\n7\n)\n$\n130\n \n$\n8\n \n$\n206\n \nUnrealized Gains (Losses) on Derivative Instruments\nUnrealized\nGains (Losses) \non Investments\nForeign\nCurrency\nTranslation\nEstimated Tax (Expense) Benefit\nTotal\nBalance as of December 31, 2022\n$\n114\n \n$\n(\n98\n)\n$\n222\n \n$\n21\n \n$\n259\n \nOther comprehensive income (loss) before reclassifications\n(\n63\n)\n53\n \n(\n16\n)\n3\n \n(\n23\n)\nLess: Amount of gain (loss) reclassified from AOCI\n64\n \n—\n \n—\n \n(\n13\n)\n51\n \nNet current period other comprehensive income (loss)\n(\n127\n)\n53\n \n(\n16\n)\n16\n \n(\n74\n)\nBalance as of December 31, 2023\n$\n(\n13\n)\n$\n(\n45\n)\n$\n206\n \n$\n37\n \n$\n185\n \nThe following table summarizes reclassifications out of AOCI for periods indicated (in millions):\nDetails about AOCI Components\n \nAffected Line Item in the Statement of Income\nAmount of Gain (Loss)\nReclassified from AOCI for the\nYear Ended December 31,\n2024\n2023\nGains (losses) on cash flow hedges:\nForeign exchange contracts\nNet revenues\n$\n(\n54\n)\n$\n56\n \nForeign exchange contracts\nCost of net revenues\n(\n2\n)\n(\n3\n)\nInterest rate contracts\nInterest income and other, net\n8\n \n11\n \nIncome (loss) from continuing operations before income taxes\n(\n48\n)\n64\n \nIncome tax benefit (provision)\n10\n \n(\n13\n)\nTotal reclassifications for the period\nNet income (loss)\n$\n(\n38\n)\n$\n51\n \n112\nTable of Contents\neBay Inc.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS—(Continued)\nNote 18 — \nRestructuring \nThe following table summarizes restructuring reserve activity for the period indicated (in millions):\nYear Ended December 31,\n \n2024\n2023\nAccrued liability, beginning of period\n$\n102\n \n$\n—\n \nCharges\n—\n \n141\n \nPayments\n(\n84\n)\n(\n39\n)\nAdjustments\n(\n8\n)\n—\n \nAccrued liability, end of period\n$\n10\n \n$\n102\n \nDuring the first quarter of 2023, management approved plans to drive operational improvement that included the reduction of workforce. The reduction was substantially completed in the first quarter of 2023 and resulted in a pre-tax charge of $\n42\n million.\nDuring the fourth quarter of 2023, management approved plans to drive operational improvement that included the reduction of workforce that resulted in a pre-tax charge of $\n99\n million. The reduction was substantially completed in the second quarter of 2024.\nThe restructuring charges incurred in 2024, 2023 and 2022 are included in “\nGeneral and administrative” expenses\n in the consolidated statement of income.\n113\neBay Inc. \nFINANCIAL STATEMENT SCHEDULE \nThe Financial Statement Schedule II — VALUATION AND QUALIFYING ACCOUNTS for continuing operations as of and for the years ended December 31, 2024, 2023 and 2022. \nBalance at Beginning of Period\nCharged/ Credited to Net Income\nCharged to Other Account\nCharges Utilized/ Write-offs\nBalance at End of Period\n(In millions)\nAllowances for Doubtful Accounts\nYear Ended December 31, 2022\n$\n42\n \n$\n16\n \n$\n—\n \n$\n(\n42\n)\n$\n16\n \nYear Ended December 31, 2023\n$\n16\n \n$\n16\n \n$\n—\n \n$\n(\n9\n)\n$\n23\n \nYear Ended December 31, 2024\n$\n23\n \n$\n19\n \n$\n—\n \n$\n(\n29\n)\n$\n13\n \nAllowance for Authorized Credits\nYear Ended December 31, 2022\n$\n32\n \n$\n(\n6\n)\n$\n—\n \n$\n—\n \n$\n26\n \nYear Ended December 31, 2023\n$\n26\n \n$\n1\n \n$\n—\n \n$\n(\n1\n)\n$\n26\n \nYear Ended December 31, 2024\n$\n26\n \n$\n2\n \n$\n—\n \n$\n(\n4\n)\n$\n24\n \nAllowance for Transaction Losses\nYear Ended December 31, 2022\n$\n88\n \n$\n316\n \n$\n—\n \n$\n(\n334\n)\n$\n70\n \nYear Ended December 31, 2023\n$\n70\n \n$\n344\n \n$\n—\n \n$\n(\n330\n)\n$\n84\n \nYear Ended December 31, 2024\n$\n84\n \n$\n334\n \n$\n—\n \n$\n(\n347\n)\n$\n71\n \nTax Valuation Allowance\nYear Ended December 31, 2022\n$\n136\n \n$\n97\n \n$\n(\n2\n)\n$\n—\n \n$\n231\n \nYear Ended December 31, 2023\n$\n231\n \n$\n(\n73\n)\n$\n(\n8\n)\n$\n(\n7\n)\n$\n143\n \nYear Ended December 31, 2024\n$\n143\n \n$\n32\n \n$\n(\n5\n)\n$\n(\n7\n)\n$\n163\n \n114\nINDEX TO EXHIBITS \nNo.\n  \nExhibit Description\n \nFiled or Furnished with\nthis 10-K\n \nIncorporated by Reference\n  \n \n \nForm\n \nFile No.\n \nDate Filed\n2.01\nSeparation and Distribution Agreement by and between Registrant and PayPal Holdings, Inc. dated as of June 26, 2015.\n8-K\n000-24821\n6/30/2015\n2.02\nTransaction Agreement, dated as of July 20, 2020 by and between eBay Inc., and Adevinta ASA.\n8-K\n001-37713\n7/22/2020\n2.03\nLetter Agreement, dated as of October 16, 2020, amending Transaction Agreement, dated as of July 20, 2020, by and between eBay Inc., and Adevinta ASA.\n10-K\n001-37713\n2/4/2021\n2.04\nShare Purchase Agreement, dated as of July 14, 2021, by and among eBay Inc., eBay International Management B.V. and Astinlux Finco S.à r.l.\n10-Q\n001-37713\n10/28/2021\n2.05*\nBid Conduct Agreement, dated as of November 21, 2023, by and among eBay Inc., eBay International Holding GmbH, eBay International Management B.V., BCP Aurelia Luxco S.a r.l., Aurelia UK Feederco Limited, Aurelia Netherlands TopCo B.V., Aurelia BidCo Norway AS and Aurelia BidCo 1 Norway AS.\n8-K\n001-37713\n11/21/2023\n2.06*\nTransaction Completion Agreement, dated as of November 21, 2023, by and among eBay Inc., eBay International Holding GmbH, eBay International Management B.V., BCP Aurelia Luxco S.a r.l., Aurelia UK Feederco Limited, Aurelia Netherlands TopCo B.V., Aurelia BidCo Norway AS and Aurelia BidCo 1 Norway AS.\n8-K\n001-37713\n11/21/2023\n2.07*\nAmendment Agreement to Bid Conduct Agreement, dated as of May 10, 2024, by and among eBay Inc., eBay International Holding GmbH, eBay International Management B.V., BCP Aurelia Luxco S.à r.l., Aurelia UK Feederco Limited, Aurelia Netherlands TopCo B.V., Aurelia BidCo Norway AS and Aurelia BidCo 1 Norway AS.\n8-K\n001-37713\n5/10/2024\n2.08*\nAmendment Agreement to Transaction Completion Agreement, dated as of May 10, 2024, by and among eBay Inc., eBay International Holding GmbH, eBay International Management B.V., BCP Aurelia Luxco S.à r.l., Aurelia UK Feederco Limited, Aurelia Netherlands TopCo B.V., Aurelia BidCo Norway AS and Aurelia BidCo 1 Norway AS.\n8-K\n001-37713\n5/10/2024\n3.01\n  \nRegistrant’s Amended and Restated Certificate of Incorporation, as amended.\n \n \n8-K\n \n001-37713\n6/23/2023\n3.02\n  \nRegistrant’s Amended and Restated Bylaws.\n \n \n8-K\n001-37713\n9/19/2024\n4.01\n  \nForm of Specimen Certificate for Registrant’s Common Stock.\n \n \nS-1\n \n333-59097\n \n8/19/1998\n4.02\nIndenture dated as of October 28, 2010 between Registrant and Computershare Trust Company, N.A. (as successor to Wells Fargo Bank, National Association), as trustee.\n8-K\n \n000-24821\n \n10/28/2010\n4.03\nSupplemental Indenture dated as of October 28, 2010 between Registrant and Computershare Trust Company, N.A. (as successor to Wells Fargo Bank, National Association), as trustee.\n8-K\n \n000-24821\n \n10/28/2010\n4.04\nOfficer’s Certificate dated July 24, 2012.\n8-K\n000-24821\n7/24/2012\n4.05\nForm of 4.000% Note due 2042 (included in Exhibit 4.04).\n8-K\n000-24821\n7/24/2012\n4.06\nOfficer’s Certificate dated June 6, 2017.\n8-K\n001-37713\n6/6/2017\n4.07\nForm of 3.600% Note due 2027 (included in Exhibit 4.0\n6\n).\n8-K\n001-37713\n6/6/2017\n4.08\nOfficer’s Certificate dated March 11, 2020.\n8-K\n001-37713\n3/11/2020\n115\nNo.\n  \nExhibit Description\n \nFiled or Furnished with\nthis 10-K\n \nIncorporated by Reference\n  \n \n \nForm\n \nFile No.\n \nDate Filed\n4.09\nForms of 1.900% Note due 2025 and 2.700% Note due 2030 (included in Exhibit 4.\n8\n).\n8-K\n001-37713\n3/11/2020\n4.10\nOfficer’s Certificate dated June 15, 2020.\n8-K\n001-37713\n6/15/2020\n4.11\nForms of 1.900% Note due 2025 and 2.700% Note due 2030 (included in Exhibit 4.1\n0\n).\n8-K\n001-37713\n6/15/2020\n4.12\nOfficers’ Certificate dated May 10, 2021\n8-K\n001-37713\n5/10/2021\n4.13\nForms of 1.400% Note Due 2026, 2.600% Note due 2031 and 3.650% Note due 2051 (included in Exhibit 4.1\n2\n)\n8-K\n001-37713\n5/10/2021\n4.14\nOfficers’ Certificate dated November 22, 2022\n8-K\n001-37713\n11/22/2022\n4.15\nForms of 5.900% Note Due 2025, 5.950% Note due 2027 and 6.300% Note due 2032 (included in Exhibit 4.1\n4\n)\n8-K\n001-37713\n11/22/2022\n4.16\nDescription of Securities.\n10-K\n001-37713\n2/23/2023\n10.01+\n  \nForm of Indemnity Agreement entered into by Registrant with each of its directors and executive officers.\n \nX\n \n10.02+\n  \nRegistrant’s 2003 Deferred Stock Unit Plan, as amended.\n \n \n10-K\n \n000-24821\n \n2/28/2007\n10.03+\nAmendment to Registrant’s 2003 Deferred Stock Unit Plan, effective April 2, 2012.\n10-Q\n \n000-24821\n7/19/2012\n10.04+\nForm of Director Award Agreement under Registrant’s 2003 Deferred Stock Unit Plan.\n10-Q\n000-24821\n7/19/2012\n10.05+\n  \nForm of Electing Director Award Agreement under Registrant’s 2003 Deferred Stock Unit Plan.\n \n \n10-Q\n \n000-24821\n \n7/19/2012\n10.06+\n  \nForm of New Director Award Agreement under Registrant’s 2003 Deferred Stock Unit Plan.\n \n \n10-Q\n \n000-24821\n \n7/19/2012\n10.07+\n  \nForm of 2003 Deferred Stock Unit Plan Restricted Stock Unit Grant Notice and Agreement.\n \n \n10-Q/A\n \n000-24821\n \n4/24/2008\n10.08+\n  \nRegistrant’s Equity Incentive Award Plan, as amended and restated.\n \n \n8-K\n \n001-37713\n6/23/2023\n10.09+\nForm of Restricted Stock Unit Award Agreement under Registrant’s 2003 Deferred Stock Unit Plan and Registrant’s Equity Incentive Plan.\n10-Q\n000-24821\n7/19/2012\n10.10+\nForm of Restricted Stock Unit Award Agreement (with Modified Vesting) under Registrant’s Equity Incentive Award Plan.\n10-Q\n \n000-24821\n \n7/19/2012\n10.11+\nForm of Stock Option Agreement under Registrant’s Equity Incentive Award Plan.\n10-Q\n000-24821\n7/19/2012\n10.12+\nForm of Stock Option Agreement (with Modified Vesting) under Registrant’s Equity Incentive Award Plan.\n10-Q\n \n000-24821\n \n7/19/2012\n10.13+\nForm of Director Deferred Stock Unit Award Agreement under Registrant’s Equity Incentive Award Plan.\n10-Q\n \n000-24821\n \n7/19/2012\n10.14+\n  \nAmended and Restated eBay Incentive Plan.\n \n \n10-K\n001-37713\n2/4/2020\n10.15+\n  \neBay Inc. Deferred Compensation Plan, as amended and restated effective January 1, 2022.\n \n \n10-K\n001-37713\n2/24/2022\n10.16+\neBay Inc. Employee Stock Purchase Plan.\nDEF 14A\n001-37713\n4/21/2022\n10.17+\nForm of New Director Award Agreement under Registrant’s Equity Incentive Award Plan.\n10-Q\n000-24821\n4/19/2013\n10.18+\nForm of Director Annual Award Agreement under Registrant’s Equity Incentive Award Plan.\n10-Q\n000-24821\n4/19/2013\n10.19+\nForm of Electing Director Quarterly Award Agreement under Registrant’s Equity Incentive Award Plan.\n10-Q\n000-24821\n4/19/2013\n116\nNo.\n  \nExhibit Description\n \nFiled or Furnished with\nthis 10-K\n \nIncorporated by Reference\n  \n \n \nForm\n \nFile No.\n \nDate Filed\n10.20+\nForm of Global Stock Option Agreement under Registrant’s Equity Incentive Award Plan.\n10-Q\n000-24821\n7/18/2014\n10.21+\nForm of Global Restricted Stock Unit Agreement (and Performance-Based Restricted Stock Unit Agreement) under Registrant’s Equity Incentive Award Plan.\n10-Q\n000-24821\n7/18/2014\n10.22+\nForm of Performance Based Restricted Stock Unit Award Agreement under Registrant’s Equity Incentive Award Plan.\n10-Q\n001-37713\n4/27/2016\n10.23+\nForm of Stock Payment Award Agreement under Registrant’s Equity Incentive Award Plan.\n10-Q\n001-37713\n7/21/2016\n10.24+\nForm of Director Restricted Stock Unit Award Agreement under Registrant’s Equity Incentive Award Plan.\n10-Q\n001-37713\n7/21/2016\n10.25+\nForm of Performance Based Restricted Stock Unit Award Grant Notice and Performance Based Restricted Stock Unit Award Agreement under Registrant’s Equity Incentive Award Plan.\n10-K\n001-37713\n1/30/2019\n10.26+\nForm of Restricted Stock Unit Award Grant Notice and Restricted Stock Unit Award Agreement under Registrant’s Equity Incentive Award Plan.\n10-K\n001-37713\n1/30/2019\n10.27+\nNotice Regarding Payment of Dividend Equivalents on Restricted Stock Units and Performance-Based Restricted Stock Units under Registrant’s Equity Incentive Award Plan.\n10-K\n001-37713\n1/30/2019\n10.28\nTax Matters Agreement, dated as of July 17, 2015, by and between Registrant and PayPal Holdings, Inc.\n8-K\n000-24821\n7/20/2015\n10.29+\nOffer Letter dated April 2, 2015 between Registrant and Marie Oh Huber.\n10-Q\n001-37713\n4/27/2016\n10.30\nCredit Agreement, dated as of January 25, 2024, by and among the Company, JPMorgan Chase Bank, N.A., as Administrative Agent, and the other parties thereto.\n8-K\n001-37713\n1/25/2024\n10.31+\nLetter Agreement between Jamie Iannone and eBay Inc., dated April 12, 2020.\n10-Q\n001-37713\n7/29/2020\n10.32+\nAmended and Restated eBay Inc. SVP and Above Standard Severance Plan, effective April 11, 2020, as amended October 2, 2024.\nX\n10.33+\nAmended and Restated eBay Inc. Change in Control Severance Plan, effective April 11, 2020, as amended October 2, 2024.\nX\n10.34+\nOffer Letter dated May \n1\n7, 2021 between Registrant and Stephen Priest\n.\n10-Q\n001-37713\n8/12/2021\n10.35+\nForm of Performance Based Restricted Stock Unit Award Grant Notice and Performance Based Restricted Stock Unit Award Agreement (with TSR Modifier) under Registrant’s Equity Incentive Award Plan.\n10-Q\n001-37713\n5/5/2022\n10.36+\nForm of Stock Option Agreement (with Performance Vesting) under Registrant’s Equity Incentive Award Plan.\n10-Q\n001-37713\n5/5/2022\n10.37+\nOffer Letter dated January \n7\n, 2021, as amended August 5, 2022, between Registrant and Cornelius Boone.\n10-Q\n001-37713\n11/3/2022\n10.38+\nOffer Letter dated April \n7\n, 2022 between Registrant and Eddie Garcia.\n10-Q\n001-37713\n4/27/2023\n10.39+\nOffer Letter dated November 16, 2020, as amended August 5, 2022 and November 10, 2023, between Registrant and Julie Loeger.\n10-K\n001-37713\n2/28/2024\n117\nNo.\n  \nExhibit Description\n \nFiled or Furnished with\nthis 10-K\n \nIncorporated by Reference\n  \n \n \nForm\n \nFile No.\n \nDate Filed\n10.40+\nOffer Letter dated September 4, 2024 between Registrant and Samantha Wellington.\n10-Q\n001-37713\n10/31/2024\n19.01\nR\neg\nistrant\n’\ns Insider Trading \nPolicy.\nX\n21.01\n  \nList of Subsidiaries.\n \nX\n \n \n \n23.01\n  \nPricewaterhouseCoopers LLP consent.\n \nX\n \n \n \n24.01\n  \nPower of Attorney (see signature page).\n \nX\n \n \n \n31.01\n  \nCertification of Registrant’s Chief Executive Officer, as required by Section 302 of the Sarbanes-Oxley Act of 2002.\n \nX\n \n \n \n31.02\n  \nCertification of Registrant’s Chief Financial Officer, as required by Section 302 of the Sarbanes-Oxley Act of 2002.\n \nX\n \n \n \n32.01\n  \nCertification of Registrant’s Chief Executive Officer, as required by Section 906 of the Sarbanes-Oxley Act of 2002.\n \nX\n \n \n \n32.02\n  \nCertification of Registrant’s Chief Financial Officer, as required by Section 906 of the Sarbanes-Oxley Act of 2002.\n \nX\n \n \n \n97.01\nRegistrant’s Incentive-Based Compensation Recovery Policy\n10-K\n001-37713\n2/28/2024\n101\n  \nThe following materials from the Annual Report on Form 10-K of eBay Inc. for the year ended December 31, 2024, were formatted in Inline XBRL (Extensible Business Reporting Language): (i) eBay Inc. Consolidated Balance Sheets, (ii) eBay Inc. Consolidated Statements of Income, (iii) eBay Inc. Consolidated Statements of Comprehensive Income, (iv) eBay Inc. Consolidated Statements of Stockholders’ Equity and (v) eBay Inc. Consolidated Statements of Cash Flows. The instance document does not appear in the Interactive Data File because its XBRL tags are imbedded within the Inline XBRL document. \n \nX\n \n \n \n104\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101). \nX\n*    Schedules have been omitted pursuant to Item 601(b)(2) of Regulation S-K. The Registrant hereby undertakes to furnish supplementally copies of any of the omitted schedules upon request by the United States Securities and Exchange Commission; provided, however, that the parties may request confidential treatment pursuant to Rule 24b-2 of the Exchange Act for any document so furnished.\n+    Indicates a management contract or compensatory plan or arrangement.\n118\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, as amended, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized on February 27, 2025. \neBay Inc.\nBy:\n/s/ Jamie Iannone\nJamie Iannone\nChief Executive Officer\nPOWER OF ATTORNEY\nKNOW ALL PERSONS BY THESE PRESENTS, that each person whose signature appears below constitutes and appoints Jamie Iannone, Steve Priest, Rebecca Spencer and Samantha Wellington and each or any one of them, each with the power of substitution, his or her attorney-in-fact, to sign any amendments to this report, with exhibits thereto and other documents in connection therewith, with the Securities and Exchange Commission, hereby ratifying and confirming all that each of said attorneys-in-fact, or his substitute or substitutes, may do or cause to be done by virtue hereof. \nPursuant to the requirements of the Securities Exchange Act of 1934, as amended, this report has been signed below by the following persons on behalf of the registrant and in the capacities indicated on February 27, 2025. \nPrincipal Executive Officer and Director:\nPrincipal Financial Officer:\nBy:\n/s/ Jamie Iannone\nBy:\n/s/ Steve Priest\nJamie Iannone\nSteve Priest\nChief Executive Officer and Director\nChief Financial Officer\nPrincipal Accounting Officer:\nBy:\n/s/ Rebecca Spencer\nRebecca Spencer\nVice President, Chief Accounting Officer\n119\nAdditional Directors\nBy:\n/s/ Paul S. Pressler\nBy:\n/s/ Adriane M. Brown\nPaul S. Pressler\nAdriane M. Brown\nChair of the Board and Director\nDirector\nBy:\n/s/ Aparna Chennapragada\nBy:\n/s/ Logan D. Green\nAparna Chennapragada\nLogan D. Green\nDirector\nDirector\nBy:\n/s/ E. Carol Hayles\nBy:\n/s/ Shripriya Mahesh\nE. Carol Hayles\nShripriya Mahesh\nDirector\nDirector\nBy:\n/s/ William D. Nash\nBy:\n/s/ Zane Rowe\nWilliam D. Nash\nZane Rowe\nDirector\nDirector\nBy:\n/s/ Mohak Shroff\nBy:\n/s/ Perry M. Traquina\nMohak Shroff\nPerry M. Traquina\nDirector\nDirector\n120"
  }
}