{
  "ticker": "ECL",
  "cik": "0000031462",
  "company_name": "ECOLAB INC.",
  "filing_date": "2025-02-21",
  "accession": "0001558370-25-001263",
  "primary_doc": "ecl-20241231x10k.htm",
  "item_sections": {
    "item1": "Item 1, entitled “Business,” and the MD&A within Part II, Item 7, contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These statements include expectations concerning items such as:\n​\n●\namount, funding and timing of cash expenditures relating to our restructuring and other initiatives, as well as savings from such initiatives \n●\nfuture cash flows, access to capital, targeted credit rating metrics and impact of credit rating downgrade\n●\nadequacy of cash reserves\n●\nuses for cash, including dividends, share repurchases, debt repayments, capital investments and strategic business acquisitions\n●\nglobal economic and political environment\n●\nlong-term potential of our business\n●\nimpact of changes in exchange rates and interest rates, including the assessment and management of associated risks\n●\ncustomer retention rate\n●\nbad debt experience, non-performance of counterparties and losses due to concentration of credit risk\n●\ndisputes, claims and litigation\n●\nenvironmental contingencies\n●\nimpact and cost of complying with laws and regulations\n●\nsustainability targets\n●\nreturns on pension plan assets\n●\ncontributions to pension and postretirement healthcare plans\n●\namortization expense\n●\nimpact of new accounting pronouncements\n●\nincome taxes, including tax attributes, valuation allowances, unrecognized tax benefits, permanent reinvestment assertions and goodwill deductibility\n●\nrecognition of share-based compensation expense\n●\npayments under operating leases\n●\nfuture benefit plan payments\n●\nmarket position\n​\nWithout limiting the foregoing, words or phrases such as “will likely result,” “are expected to,” “will be,” “will continue,” “is anticipated,” “we believe,” “we expect,” “estimate,” “project” (including the negative or variations thereof), “intends,” “could,” or similar terminology, generally identify forward-looking statements. Forward-looking statements may also represent challenging goals for us. These statements, which represent our expectations or beliefs concerning various future events, are based on current expectations that involve a number of risks and uncertainties that could cause actual results to differ materially from those of such forward-looking statements. We caution that undue reliance should not be placed on such forward-looking statements, which speak only as of the date made. For a further discussion of these and other factors which could cause results to differ from those expressed in any forward-looking statement, see",
    "item1a": "Item 1A. Risk Factors” of this Form 10-K.\n \n​\nCybersecurity Governance\n​\nEcolab’s ISSC, chaired by our CISO, meets as needed. The Committee is comprised of executive leaders including the Executive Vice President and General Manager - Ecolab Digital (“EVP & GM Digital”), the Senior Vice President IT Enterprise Operations, the Chief Operating Officer, the Chief Financial Officer, the Chief Technical Officer, the General Counsel, the Executive Vice Presidents of our commercial divisions, the Executive Vice President Global Supply Chain, the Executive Vice President Human Resources, the Vice President of Global Business Transformation, and the Vice President Internal Audit.\n​\nThe ISSC assists \nthe CISO in fulfilling our responsibilities regarding our information security program\n to protect the confidentiality, integrity and availability of our information assets, financial assets, and information systems. ISSC responsibilities include, but are not limited to, evaluation of relevant information security risks, prioritization of information security initiatives, determination of, and advocacy for, appropriate investments, review of related legal and regulatory compliance initiatives, review of effective security communication initiatives, establishing specific requirements of the program in documented policies which all Ecolab associates, customers, and partners are obligated to follow, partner with Ecolab’s business, functional and regional leaders to ensure effective, risk-based security controls and practices are in place to achieve the program’s intent, and assist in monitoring the integrity and evaluating the effectiveness of the program.\n​\nThe Board, in coordination with the \nAudit Committee\n, provides oversight of our ERM program, including the management of risks arising from cybersecurity threats. The Board receives an overview from our EVP & GM Digital and the Audit Committee receives reports from our CISO regarding our cybersecurity threat risk management and strategy processes. These reports cover a wide range of topics, and may include current and emerging cybersecurity threat risks, third-party assessments, risk-mitigation tactics and programs, information security considerations arising with respect to our peers and third parties, and our incident response plan.\n​\nThrough a risk-based approach consistent with Ecolab’s ERM framework, the CISO identifies cyber incidents that are brought forward to a cross-functional cyber-incident response team including our CEO, CFO, EVP & GM Digital, General Counsel, CISO and Executive Vice President Supply Chain. This cyber incident response team, or, in the event of more minor incidents, the CISO and his team, takes steps to promptly assess and address the incident, including engaging third parties according to pre-established guidelines. \nThe Board and the Audit Committee also receive prompt and timely information regarding any cybersecurity incident that meets established reporting thresholds, including ongoing updates regarding any such incident until it has been addressed.\n​\n​\n23\n\n\nTable of Contents",
    "item1b": "Item 1B. Unresolved\n Staff Comments.\n​\nNone.\n​\n​",
    "item1c": "Item 1C. Cybersecurity.\n​\nSince 2014, when the Ecolab Cybersecurity program was established, we have continuously matured our cybersecurity program to proactively address evolving cybersecurity trends and risks. Ecolab has an Information Security Steering Committee (“ISSC”), a cross-functional team chaired by our \nChief Information Security Officer (“CISO”).\n​\nOur CISO, who holds a CISO certification, has been our CISO since 2024 and has more than 25 years of information systems experience in total, including in the financial services and defense sectors and the U.S. military, as well as serving in information security and other information technology leadership positions at Ecolab since 2017.\n​\nSenior management provides in-depth reviews of cybersecurity matters to the Board and the Audit Committee. Cybersecurity is also considered in the annual enterprise risk assessment presented to the Board by management as part of the Board’s oversight of our enterprise risk management (“ERM”) program.\n​\nEcolab’s cybersecurity policies, standards, processes, and practices are \nintegrated into our ERM program\n and are based on recognized frameworks established by the National Institute of Standards and Technology (“NIST”) Cybersecurity Framework (“CSF”), the International Organization for Standardization and other applicable industry standards. We are formally assessed by an independent third party against NIST CSF and industry standards, including peer benchmarking.\n​\nRisk Management and Strategy\n​\nCybersecurity presents strategic and operating risks and is an area of continued focus for our Board and management under its ERM program. Ecolab’s cybersecurity program addresses the following key areas:\n​\n●\nGovernance:\n As discussed in more detail under the heading “Cybersecurity Governance,” the Audit Committee and the Board of Directors provide oversight of cybersecurity risk management.\n​\n●\nTechnical Safeguards:\n \nWe have implemented multi-layer controls designed to protect our information systems from cybersecurity threats, including general, backup, recovery, resiliency, processing, access, change and risk controls. These controls are evaluated by Ecolab’s cybersecurity team and enhanced through controls audits and assessments, internal testing, and third-party cybersecurity threat intelligence.\n​\n●\nIncident Response and Recovery Planning:\n We have established and maintain comprehensive cybersecurity incident response and recovery plans that coordinate multidisciplinary internal teams and cybersecurity partners to assess, triage, escalate, contain, mitigate, investigate, remediate, and recover from a potential cybersecurity incident. Through ongoing communications with these teams, management monitors the incidents and reports incidents to the Audit Committee when appropriate. Management is responsible for timely disclosure of cybersecurity incidents as required by law.\n​\n22\n\n\nTable of Contents\n●\nThird-Party Risk Management:\n \nWe maintain a risk-based approach to identify, monitor, and manage third-party cybersecurity risks\n associated with our use of third-party service providers who have access to our systems, data or are critical to our continued business operations. \nAdditionally, cybersecurity considerations affect the selection and oversight of our third-party service providers.\n We require certain third-party vendors to agree to manage their cybersecurity risks in specified ways, and to agree to be subject to cybersecurity audits, which we conduct as appropriate.\n​\n●\nEducation and Awareness:\n We provide training for personnel regarding cybersecurity trends and threats to equip them with the knowledge to recognize and tools to report suspected cybersecurity threats. We also conduct simulations for employees and contractors to enhance awareness and responsiveness to such possible threats. In addition, we send global cybersecurity awareness communications to our personnel.\n​\n●\nAssessment:\n We engage in the periodic assessment, testing and updating of our policies, standards, processes, and practices that are designed to address cybersecurity threats and incidents. These efforts include a wide range of activities, including audits, assessments, tabletop exercises, threat modeling, vulnerability testing and other exercises focused on evaluating the effectiveness of our cybersecurity measures, and planning. We engage third parties to perform assessments on our cybersecurity measures, including information security maturity assessments, audits and independent reviews of our information security control environment and operating effectiveness. Additionally, we leverage third party cybersecurity rating agency data to inform our assessment of risk. The results of such assessments, audits and reviews are reported to the Audit Committee and the Board.\n​\nWhile we have continually matured our security program and capabilities and have \nhad no material incidents to date, cyber threats continue to evolve and there can be no assurance that our efforts will prevent cybersecurity attacks or breaches in our systems such as those described in the risk factor\n entitled, “We are subject to information technology system failures, network disruptions and breaches in data security” under “"
  }
}