{
  "ticker": "EG",
  "cik": "0001095073",
  "company_name": "EVEREST GROUP, LTD.",
  "filing_date": "2025-02-27",
  "accession": "0001095073-25-000015",
  "primary_doc": "eg-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1, Business - “Financial Strength Ratings”.\nWe maintain our own economic capital models to monitor and project our overall capital, as well as the capital at our operating subsidiaries.  A key input to the economic models is projected income, and this input is continually compared to actual results, which may require a change in the capital strategy.\nIn 2024, we repurchased 536,469 of our common shares at a cost of $200 million in the open market and paid $334 million in common share dividends to adjust our capital position and enhance long-term expected returns to our shareholders.  During 2023, we repurchased no shares in the open market and paid $288 million in dividends.  We may at times enter into a Rule 10b5-1 repurchase plan agreement to facilitate the repurchase of shares. On November 7, 2024, our existing Board authorization to purchase up to 32 million of our shares was increased by 10 million shares to authorize the purchase of up to 42 million shares.  As of December 31, 2024, we had repurchased 31.3 million shares under this authorization.  During the fourth quarter of 2024, the Company’s Board of Directors declared a quarterly \n56\nTable of Contents\ncommon stock dividend of $2.00 per share.  The common stock dividend was paid on December 13, 2024 for holders of record as of November 27, 2024.\nOn May 19, 2023, the Company completed the public offering of 4,140,000 common shares, which included full exercise of the underwriters’ option to purchase an additional 540,000 common shares, at a public offering price of $360.00 per share. Total net proceeds from the public offering were $1,445 million, after underwriting discount and expenses. The Company’s intent was to use the net proceeds from this offering for long-term reinsurance opportunity and continued build out of the global insurance business.\nLiquidity.\n  Our liquidity requirements are generally met from positive cash flow from operations.  Positive cash flow results from reinsurance and insurance premiums being collected prior to disbursements for claims, with disbursements generally taking place over an extended period after the collection of premiums, sometimes a period of many years.  Collected premiums are generally invested, prior to their use in such disbursements, and investment income provides additional funding for loss payments.  Our net cash flows from operating activities were $5.0 billion and $4.6 billion for the years ended December 31, 2024 and 2023, respectively.  Additionally, these cash flows reflected net catastrophe loss payments of $693 million and $858 million for the years ended December 31, 2024 and 2023, respectively, and net tax payments of $397 million and $196 million for the years ended December 31, 2024 and 2023, respectively.\nIf disbursements for losses and LAE, policy acquisition costs and other operating expenses were to exceed premium inflows, cash flow from reinsurance and insurance operations would be negative.  The effect on cash flow from operations would be partially offset by cash flow from investment income. Additionally, cash inflows from investment maturities of both short-term investments and longer-term maturities are available to supplement other operating cash flows.  We do not expect to supplement negative operations cash flows with investment dispositions.\nAs the timing of payments for losses and LAE cannot be predicted with certainty, we maintain portfolios of long-term invested assets with varying maturities, along with short-term investments that provide additional liquidity for payment of claims.  At December 31, 2024 and December 31, 2023, we held cash and short-term investments of $6.3 billion and $3.6 billion, respectively.  Our short-term investments are generally readily marketable and can be converted to cash.  In addition to these cash and short-term investments, we had $1.1 billion of fixed maturity securities - available for sale maturing within one year or less, $8.5 billion maturing within one to five years and $6.2 billion maturing after five years at December 31, 2024.  We believe that these fixed maturity securities, in conjunction with the short-term investments and positive cash flow from operations, provide ample sources of liquidity for the expected payment of losses and LAE in the near future.  We do not anticipate selling a significant amount of securities to pay losses and LAE.  At December 31, 2024, we had $990 million of net pre-tax unrealized depreciation related to fixed maturity - available for sale securities, comprised of $1.2 billion of pre-tax unrealized depreciation and $167 million of pre-tax unrealized appreciation.\nManagement generally expects annual positive cash flow from operations.  However, given catastrophic events observed in recent periods, cash flow from operations may decline and could become negative in the near term as significant claim payments are made related to the catastrophes.  However, as indicated above, the Company has access to ample liquidity to settle its catastrophe claims and also may receive payments under the catastrophe bond program and the Mt. Logan Re collateralized reinsurance arrangement.\nIn addition to our cash flows from operations and liquid investments, Everest Re is a member of the FHLBNY, which allows Everest Re to borrow up to 10% of its statutory admitted assets.  As of December 31, 2024, Everest Re had statutory admitted assets of approximately $30.8 billion which provides borrowing capacity of up to approximately $3.1 billion.  As of December 31, 2024, Everest Re had $1.0 billion of borrowings outstanding, which begin to expire in 2025.  See Note 7 - Credit Facilities to the Notes to the Consolidated Financial Statements in Part IV, Item 15 of this Form 10-K for further details.\nExposure to Catastrophes.\n  Like other insurance and reinsurance companies, we are exposed to multiple insured losses arising out of a single occurrence, whether a natural event, such as a hurricane or an earthquake, or other catastrophe, such as an explosion at a major factory. A large catastrophic event can be expected to generate insured losses to multiple reinsurance treaties, facultative certificates and direct insurance policies across various lines of business.\nWe focus on potential losses that could result from any single event, or series of events as part of our evaluation and monitoring of our aggregate exposures to catastrophic events. Accordingly, we employ various techniques to estimate the amount of loss we could sustain from any single catastrophic event or series of events in various geographic areas. These techniques range from deterministic approaches, such as tracking aggregate limits exposed in catastrophe-prone \n57\nTable of Contents\nzones and applying reasonable damage factors, to modeled approaches that attempt to scientifically measure catastrophe loss exposure using sophisticated Monte Carlo simulation techniques that forecast frequency and severity of potential losses on a probabilistic basis.\nNo single computer model or group of models is currently capable of projecting the amount and probability of loss in all global geographic regions in which we conduct business. In addition, the form, quality and granularity of underwriting exposure data furnished by (re)insureds is not uniformly compatible with the data requirements for our licensed models, which adds to the inherent imprecision in the potential loss projections. Further, the results from multiple models and analytical methods must be combined to estimate potential losses by and across business units.  Also, while most models have been updated to incorporate claims information from recent catastrophic events, catastrophe model projections are still inherently imprecise.  In addition, uncertainties with respect to future climatic patterns and cycles could add further uncertainty to loss projections from models based on historical data.\nNevertheless, when combined with traditional risk management techniques and sound underwriting judgment, catastrophe models are a useful tool for underwriters to price catastrophe exposed risks and for providing management with quantitative analyses with which to monitor and manage catastrophic risk exposures by zone and across zones for individual and multiple events.\nProjected catastrophe losses are generally summarized in terms of the probable maximum loss (“PML”).  We define PML as our anticipated loss, taking into account contract terms and limits, caused by a single catastrophe affecting a broad contiguous geographic area, such as that caused by a hurricane or earthquake.  The PML will vary depending upon the modeled simulated losses and the make-up of the in-force book of business.  The projected severity levels are described in terms of “return periods”, such as “100-year events” and “250-year events”. For example, a 100-year PML is the estimated loss to the current in-force portfolio from a single event which has a 1% probability of being exceeded in a twelve-month period.  In other words, it corresponds to a 99% probability that the loss from a single event will fall below the indicated PML.  It is important to note that PMLs are estimates.  Modeled events are hypothetical events produced by a stochastic model.  As a result, there can be no assurance that any actual event will align with the modeled event or that actual losses from events similar to the modeled events will not vary materially from the modeled event PML.\nFrom an enterprise risk management perspective, management sets limits on the levels of catastrophe loss exposure we may underwrite.  The limits are revised periodically based on a variety of factors, including but not limited to our financial resources and expected earnings and risk/reward analyses of the business being underwritten.\nEconomic loss is the PML exposure, net of third-party reinsurance including catastrophe industry loss warranty cover, reduced by estimated reinstatement premiums to renew coverage and estimated income taxes.  The impact of income taxes on the PML depends on the distribution of the losses by corporate entity, which is also affected by inter-affiliate reinsurance.  Management also monitors and controls its largest PMLs at multiple points along the loss distribution curve, such as loss amounts at the 20, 50, 100, 250 and 500-year return periods.  This process enables management to identify and control exposure accumulations and to integrate such exposures into enterprise risk, underwriting and capital management decisions.\nOur catastrophe loss projections, segmented by risk zones, are updated quarterly and reviewed as part of a formal risk management review process.  Each segment and business unit manages its underwriting risk in accordance with established guidelines. These guidelines place dollar limits on the amount of business that can be written based on a variety of factors, including (re)insured company profile, line of business, geographic location and risk hazards. In each case, the guidelines permit limited exceptions, which must be authorized by the Company’s senior management. Management regularly reviews and revises these guidelines in response to changes in business unit product offerings, market conditions, risk versus reward analyses and our enterprise and underwriting risk management processes. \nOur operating results and financial condition can be adversely affected by catastrophe and other large losses. We manage our exposure to catastrophes and other large losses by: \n•\nselective underwriting practices;\n•\ndiversifying our risk portfolio by geographic area and by types and classes of business;\n•\nlimiting our aggregate catastrophe loss exposure in any particular geographic zone and contiguous zones;\n58\nTable of Contents\n•\npurchasing reinsurance and/or retrocessional protection to the extent that such coverage can be secured cost-effectively. See “Reinsurance and Retrocession Arrangements”. \nWe believe that our methods of monitoring, analyzing and managing catastrophe exposures provide a credible risk management framework, which is integrated with our enterprise risk management, underwriting and capital management plans.\n \nHowever, there is much uncertainty and imprecision inherent in the catastrophe models and the catastrophe loss estimation process generally.\n \nAs a result, there can be no assurance that we will not experience losses from individual events that exceed the PML or other return period projections, perhaps by a material amount.\n \nNor can there be assurance that we will not experience events impacting multiple zones, or multiple severe events that could, in the aggregate, exceed our PML expectations by a significant amount.\nThe table below reflects our PML exposure, net of third-party reinsurance including catastrophe industry loss warranty cover, at various return periods for our top zones/perils (as ranked by the largest 1 in 100-year economic loss) based on loss projection data as of January 1, 2025:\nReturn Periods (in years)\n1 in 20\n1 in 50\n1 in 100\n1 in 250\n1 in 500\nExceeding Probability\n5.0%\n2.0%\n1.0%\n0.4%\n0.2%\n(Dollars in millions)\nZone\nPeril\nSoutheast U.S.\nWind\n$\n920 \n$\n1,509 \n$\n2,174 \n$\n2,661 \n$\n2,873 \nCalifornia\nEarthquake\n227 \n1,038 \n1,791 \n2,535 \n2,829 \nTexas\nWind\n205 \n508 \n921 \n1,717 \n2,432 \nThe projected net economic losses, defined as PML exposures, net of third-party reinsurance including catastrophe industry loss warranty cover, reinstatement premiums and estimated income taxes, for the top zones/perils scheduled above are as follows:\nReturn Periods (in years)\n1 in 20\n1 in 50\n1 in 100\n1 in 250\n1 in 500\nExceeding Probability\n5.0%\n2.0%\n1.0%\n0.4%\n0.2%\n(Dollars in millions)\nZone\nPeril\nSoutheast U.S.\nWind\n$\n640 \n$\n1,029 \n$\n1,523 \n$\n1,866 \n$\n2,049 \nCalifornia\nEarthquake\n176 \n742 \n1,322 \n1,842 \n2,073 \nTexas\nWind\n153 \n375 \n665 \n1,219 \n1,740 \nWe believe that our greatest worldwide 1 in 100-year exposure to a single catastrophic event is to a wind event affecting the Southeast U.S., where we estimate we have a PML exposure, net of third party reinsurance including catastrophe industry loss warranty cover, of $2.2 billion which represents approximately 11.0% of its December 31, 2024 shareholders’ equity.\nIf such a single catastrophe loss were to occur, management estimates that the net economic loss to us would be approximately $1.5 billion.  The estimate involves multiple variables, including which Everest entity would experience the loss, and as a result there can be no assurance that this amount would not be exceeded.\nWe may purchase reinsurance to cover specific business written or the potential accumulation or aggregation of exposures across some or all of our operations.  Reinsurance purchasing decisions consider both the potential coverage and market conditions including the pricing, terms, conditions, availability and collectability of coverage, with the aim of securing cost-effective protection from financially secure counterparts.  The amount of reinsurance purchased has varied over time, reflecting our view of our exposures and the cost of reinsurance.  In recent years, we have increased our use of reinsurance offered through capital market facilities.\nWe participate in “common account” retrocessional arrangements for certain reinsurance treaties whereby a ceding company purchases reinsurance for the benefit of itself and its reinsurers under one or more of its reinsurance treaties.\n \n59\nTable of Contents\nCommon account retrocessional arrangements reduce the effect of individual or aggregate losses to all participating companies, including the ceding company, with respect to the involved treaties.\nInformation Technology.\n  Everest’s information technology is a key component of its business operations.  Information technology systems and services are hosted at public and private cloud service providers across multiple data centers with processing performed at the office locations of our operating subsidiaries and branches.  We have implemented security procedures, and regularly assess and enhance our security protocols, to ensure that our key business systems are protected, secured and backed up at off-site locations so that they can be restored promptly if necessary.  We have business continuity plans and disaster recovery plans along with periodic testing of those plans to ensure we are capable of providing uninterrupted technology services in the event of major systems outages with alternative secure data centers available in case of broader outages.\nOur business operations depend on the proper functioning and availability of our information technology platform, which includes data processing and related electronic communications.  We communicate electronically internally and externally with our brokers, program managers, clients, third-party vendors, regulators and others.  These communications and the data we handle may include personal, confidential or proprietary information.  We ensure that all our systems, data and electronic transmissions are appropriately protected with the latest technology safeguards and meet regulatory standards.\nDespite these safeguards, a significant cyber incident, including system failure, security breach and disruption by malware or other damage could interrupt or delay our operations and possibly our results.  This type of incident may result in a violation of applicable data security, privacy, or other laws, damage our reputation, cause a loss of customers or give rise to regulatory scrutiny as well as monetary fines and other penalties.  Management is not aware of a cybersecurity incident that has had a material impact on our operations.  See also",
    "item1c": "ITEM 1C, “Cybersecurity”.\nExpected Cash Outflows.\n  The following table shows our significant expected cash outflows for the period indicated.\nPayments due by period\n(Dollars in millions)\nTotal\nLess than\n1 year\n1-3 years\n3-5 years\nMore than\n5 years\nSenior notes\n$\n2,400 \n$\n— \n$\n— \n$\n— \n$\n2,400 \nLong term notes\n219 \n— \n— \n— \n219 \nFederal Home Loan Bank of New York\n1,019 \n719 \n300 \n— \n— \nInterest expense\n (1)\n2,833 \n101 \n203 \n203 \n2,325 \nOperating lease agreements\n152 \n21 \n37 \n27 \n67 \nGross reserve for losses and LAE \n(2)\n29,889 \n3,486 \n8,951 \n7,764 \n9,689 \nTotal\n$\n36,512 \n$\n4,327 \n$\n9,491 \n$\n7,994 \n$\n14,700 \n(Some amounts may not reconcile due to rounding.)\n(1)\nInterest expense on long-term notes is calculated at the variable floating rate of 7.17%, as of December 31, 2024.  \n(2)\nLoss and LAE reserves represent management’s best estimate of losses from claim and related settlement costs.  Both the amounts and timing of such payments are estimates, and the inherent variability of resolving claims as well as changes in market conditions make the timing of cash flows uncertain.  Therefore, the ultimate amount and timing of loss and LAE payments could differ from our estimates.  \nThe cash outflows for senior notes and long-term notes are the responsibility of Holdings.  We strive to ensure that we have sufficient cash flow, liquidity, investments and access to capital markets to satisfy these obligations.  Holdings generally depends upon dividends from Everest Re, its operating insurance subsidiary for its funding, capital contributions from Group or access to the capital markets.  Our various operating insurance and reinsurance subsidiaries have sufficient cash flow, liquidity and investments to settle outstanding reserves for losses and LAE.  Management believes that we, and each of our entities, have sufficient financial resources or ready access thereto, to meet all obligations.\nDividends.\nDuring 2024 and 2023, we declared and paid common shareholder dividends of $334 million and $288 million, respectively.  As an insurance holding company, we are partially dependent on dividends and other permitted payments from our subsidiaries to pay cash dividends to our shareholders.  The payment of dividends to Group by Holdings Ireland and Everest Dublin Holdings is subject to Irish corporate and regulatory restrictions; the payment of dividends to Holdings Ireland by Holdings and to Holdings by Everest Re is subject to Delaware regulatory restrictions; and the payment of dividends to Group by Bermuda Re, Everest International, Everest Preferred International Holdings (“Preferred \n60\nTable of Contents\nHoldings”), Everest Re Advisors Ltd. (“Advisors Re”) or Mt. Logan Re is subject to Bermuda insurance regulatory restrictions.  Management expects that, absent extraordinary catastrophe losses, such restrictions should not affect Everest Re’s ability to declare and pay dividends sufficient to support Holdings’ general corporate needs and that Holdings Ireland, Everest Dublin Holdings, Bermuda Re and Everest International will have the ability to declare and pay dividends sufficient to support Group’s general corporate needs.  For the years ended December 31, 2024 and 2023, Everest Re paid no cash dividends to Holdings.   For the years ended December 31, 2024 and 2023, Bermuda Re paid cash dividends to Group of $750 million and $235 million, respectively; Everest International paid cash dividends to Group of $100 million and $0 million, respectively; Preferred Holdings paid cash dividends to Group of $46 million and $48 million, respectively; Advisors Re paid cash dividends to Group of $74 million and $67 million, respectively; and Mt. Logan Re paid cash dividends to Group of $0 million and $15 million, respectively.  See ITEM 1, “Business - Regulatory Matters - Dividends” and ITEM 8, “Financial Statements and Supplementary Data” - Note 17 of Notes to Consolidated Financial Statements.\nMarket Sensitive Instruments.\nSEC Registrants are required to clarify and expand upon the existing financial statement disclosure requirements for derivative financial instruments, derivative commodity instruments and other financial instruments (collectively, “Market Sensitive Instruments”).  We do not generally enter into Market Sensitive Instruments for trading purposes.\nOur current investment strategy seeks to maximize after-tax income through a high quality, diversified, fixed maturity portfolio, while maintaining an adequate level of liquidity.  Our mix of investments is adjusted periodically, consistent with our current and projected operating results and market conditions.  The fixed maturity securities in the investment portfolio are comprised of available for sale and held to maturity securities.  Additionally, we have invested in equity securities.\nThe overall investment strategy considers the scope of present and anticipated Company operations.  In particular, estimates of the financial impact resulting from non-investment asset and liability transactions, together with our capital structure and other factors, are used to develop a net liability analysis.  This analysis includes estimated payout characteristics for which our investments provide liquidity.  This analysis is considered in the development of specific investment strategies for asset allocation, duration and credit quality.  The change in overall market sensitive risk exposure principally reflects the asset changes that took place during the period.\nOur $41.5 billion investment portfolio at December 31, 2024, is principally comprised of fixed maturity securities, which are generally subject to interest rate risk and some foreign currency exchange rate risk, and some equity securities, which are subject to price fluctuations and some foreign exchange rate risk.  The overall economic impact of the foreign exchange risks on the investment portfolio is partially mitigated by changes in the dollar value of foreign currency denominated liabilities and their associated income statement impact. \nInterest Rate Risk.\n  Interest rate risk is the potential change in value of the fixed maturity securities portfolio from a change in market interest rates.  In a declining interest rate environment, interest rate risk includes prepayment risk on the $7.1 billion of mortgage-backed securities in the $29.7 billion fixed maturity portfolio.  Prepayment risk results from potential accelerated principal payments that shorten the average life and thus the expected yield of the security.\nThe tables below display the potential impact of fair value fluctuations and after-tax unrealized appreciation on our fixed maturity portfolio (including $4.7 billion of short-term investments) for the period indicated based on upward and downward parallel and immediate 100 and 200 basis point shifts in interest rates.  For legal entities with a U.S. dollar functional currency, this modeling was performed on each security individually.  To generate appropriate price estimates on mortgage-backed securities, changes in prepayment expectations under different interest rate environments were taken into account.  For legal entities with a non-U.S. dollar functional currency, the effective duration of the involved portfolio of securities was used as a proxy for the fair value change under the various interest rate change scenarios.  \n61\nTable of Contents\nImpact of Interest Rate Shift in Basis Points\nAt December 31, 2024\n-200\n-100\n0\n100\n200\n(Dollars in millions)\nTotal Fair Value\n$\n36,514 \n$\n35,443 \n$\n34,372 \n$\n33,302 \n$\n32,231 \nFair Value Change from Base (%)\n6.2 \n%\n3.1 \n%\n— \n%\n(3.1)\n%\n(6.2)\n%\nChange in Unrealized Appreciation\nAfter-tax from Base ($)\n$\n1,834 \n$\n917 \n$\n— \n$\n(917)\n$\n(1,834)\nImpact of Interest Rate Shift in Basis Points\nAt December 31, 2023\n-200\n-100\n0\n100\n200\n(Dollars in millions)\nTotal Fair Value\n$\n32,813 \n$\n31,768 \n$\n30,722 \n$\n29,677 \n$\n28,631 \nFair Value Change from Base (%)\n6.8 \n%\n3.4 \n%\n— \n%\n(3.4)\n%\n(6.8)\n%\nChange in Unrealized Appreciation\nAfter-tax from Base ($)\n$\n1,811 \n$\n905 \n$\n— \n$\n(905)\n$\n(1,811)\nWe had $29.9 billion and $24.6 billion of gross reserves for losses and LAE as of December 31, 2024 and 2023, respectively.  These amounts are recorded at their nominal value, as opposed to present value, which would reflect a discount adjustment to reflect the time value of money.  Since losses are paid out over a period of time, the present value of the reserves is less than the nominal value.  As interest rates rise, the present value of the reserves decreases and, conversely, as interest rates decline, the present value increases.  These movements are similar to the interest rate impacts on the fair value of investments held.  While the difference between present value and nominal value is not reflected in our financial statements, our financial results will include investment income over time from the investment portfolio until the claims are paid.  Our loss and loss reserve obligations have an expected duration of approximately 4.0 years, which is reasonably consistent with our fixed income portfolio.  If we were to discount our loss and LAE reserves, net of ceded reserves, the discount would be approximately $4.9 billion resulting in a discounted reserve balance of approximately $22.1 billion, representing approximately 64.4% of the value of the fixed maturity investment portfolio funds.  \nForeign Currency Risk.\n  Foreign currency risk is the potential change in value, income and cash flow arising from adverse changes in foreign currency exchange rates.  Each of our non-U.S./Bermuda operations maintains capital in the currency of the country of its geographic location consistent with local regulatory guidelines.  Each non-U.S. operation may conduct business in its local currency, as well as the currency of other countries in which it operates.  The primary foreign currency exposures for these non-U.S. operations are the Canadian Dollar, the Singapore Dollar, the British Pound Sterling and the Euro.  We mitigate foreign exchange exposure by generally matching the currency and duration of our assets to our corresponding operating liabilities.  In accordance with GAAP guidance, the impact on the fair value of available for sale fixed maturities due to changes in foreign currency exchange rates, in relation to functional currency, is reflected as part of other comprehensive income.  Conversely, the impact of changes in foreign currency exchange rates, in relation to functional currency, on other assets and liabilities is reflected through net income as a component of other income (expense).  In addition, we translate the assets, liabilities and income of non-U.S. dollar functional currency legal entities to the U.S. dollar.  This translation amount is reported as a component of other comprehensive income.  \nThe tables below display the potential impact of a parallel and immediate 10% and 20% increase and decrease in foreign exchange rates on the valuation of invested assets subject to foreign currency exposure for the periods indicated.  This analysis includes the after-tax impact of translation from transactional currency to functional currency as well as the after-tax impact of translation from functional currency to the U.S. dollar reporting currency. \nChange in Foreign Exchange Rates in Percent\nAt December 31, 2024\n(Dollars in millions)\n-20%\n-10%\n0%\n10%\n20%\nTotal After-tax Foreign Exchange Exposure\n$\n(1,426)\n$\n(713)\n$\n— \n$\n713 \n$\n1,426 \n62\nTable of Contents\nChange in Foreign Exchange Rates in Percent\nAt December 31, 2023\n(Dollars in millions)\n-20%\n-10%\n0%\n10%\n20%\nTotal After-tax Foreign Exchange Exposure\n$\n(1,022)\n$\n(511)\n$\n— \n$\n511 \n$\n1,022 \nITEM 7A.    QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nSee “Market Sensitive Instruments” in ITEM 7.\nITEM 8.    FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe financial statements and schedules listed in the accompanying Index to Financial Statements and Schedules on page F-1 are filed as part of this report.\nITEM 9.    CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.\nITEM 9A.    CONTROLS AND PROCEDURES\nDisclosure Controls and Procedures.\nAs required by Rule 13a-15(b) of the Exchange Act, our management, including our Chief Executive Officer and Chief Financial Officer, has evaluated the effectiveness of our disclosure controls and procedures (as defined in Rule 13a-15(e) under the Exchange Act).  Based on that evaluation, the Chief Executive Officer and Chief Financial Officer have concluded that our disclosure controls and procedures were effective as of the end of the period covered by this annual report.\nManagement’s Report on Internal Control Over Financial Reporting.\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting.  Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of our financial statements for external purposes in accordance with generally accepted accounting principles.  \nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements.  Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.  \nManagement has assessed the effectiveness of our internal control over financial reporting as of December 31, 2024.  In making this assessment, we used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission in \nInternal Control - Integrated Framework (2013)\n.  Based on our assessment we concluded that, as of December 31, 2024, our internal control over financial reporting is effective based on those criteria.  \nThe effectiveness of the Company’s internal control over financial reporting as of December 31, 2024, has been audited by KPMG LLP, an independent registered public accounting firm, as stated in their report, which appears herein.  \nChanges in Internal Control over Financial Reporting.\nAs required by Rule 13a-15(d) of the Exchange Act, our management, including our Chief Executive Officer and Chief Financial Officer, has evaluated our internal control over financial reporting to determine whether any changes occurred during the fourth fiscal quarter covered by this annual report that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.  Based on that evaluation, we have determined that there has been no such change during the fourth quarter.  \n63\nTable of Contents\nITEM 9B.    OTHER INFORMATION\nDuring the fiscal quarter ended December 31, 2024, none of our directors or officers \nadopted\n, modified or \nterminated\n a “Rule 10b5-1 trading arrangement” or “non-Rule 10b5-1 trading arrangement,” as those terms are defined in Regulation S-K, Item 408.\nAdditionally, as part of Everest’s commitment to ethical standards of business and compliance with applicable laws, rules and regulations, we have an \nInsider Trading Policy\n governing the purchase, sale, and/or other dispositions of our securities by our directors, officers, employees and third-party contractors that we believe is reasonably designed to promote compliance with insider trading laws, rules and regulations, and the exchange listing standards applicable to us. A copy of our Insider Trading Policy is included in the Ethics and Guidelines and Index to Compliance Policies and Procedures filed as Exhibit 14.1 to the Annual Report on Form 10-K for the period ended December 31, 2023 and incorporated by reference in “ITEM 15 - Exhibits and Financial Statement Schedules” below.\nITEM 9C.    DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot Applicable.\n64\nTable of Contents\nPART III\nITEM 10.    DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nReference is made to the sections captioned “Information Concerning Director Nominees”, “Information Concerning Executive Officers”, “Audit Committee”, “Nominating and Governance Committee”, “Ethics Guidelines and Code of Ethics for CEO and Senior Financial Officers” and “Delinquent Section 16(a) Reports” in our proxy statement for the 2025 Annual General Meeting of Shareholders, which will be filed with the Commission within 120 days of the close of our fiscal year ended December 31, 2024 (the “Proxy Statement”), which sections are incorporated herein by reference.\nITEM 11.    EXECUTIVE COMPENSATION\nReference is made to the sections captioned “Compensation Committee Report”, “Directors’ Compensation”,  “Compensation of Executive Officers”, “Compensation Committee Interlocks and Insider Participation” and to all other applicable sections in the Proxy Statement, which are incorporated herein by reference.  \nOn November 1, 2023, the Company’s Board adopted an updated Clawback Policy (the “Clawback Policy”) in order to comply with Section 10D of the Exchange Act, Rule 10D-1 of the Exchange Act and the listing standards adopted by the NYSE.\nThe Clawback Policy provides for the mandatory recovery of erroneously awarded incentive-based compensation from current and former executive officers (as defined in the Clawback Policy) of the Company (“Section 16 Officers”) in the event that the Company is required to prepare an accounting restatement.\nThe foregoing description of the Clawback Policy is a summary only and is qualified in its entirety by reference to the full text of the Clawback Policy and the form of Acknowledgment, copies of which are filed in Exhibit 97 to the Annual Report on Form 10-K for the period ended December 31, 2023 and are incorporated by reference in “ITEM 15 - Exhibits and Financial Statement Schedules” below.\nITEM 12.    SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED SHAREHOLDER MATTERS\nReference is made to the applicable sections in the Proxy Statement, which are incorporated herein by reference.\nITEM 13.    CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nReference is made to the applicable sections in the Proxy Statement, which are incorporated herein by reference.\nITEM 14.    PRINCIPAL ACCOUNTANT FEES AND SERVICES\nReference is made to the section captioned “Audit Committee Report” in the Proxy Statement, which is incorporated herein by reference.\nPART IV\nITEM 15.    EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\nFinancial Statements and Schedules.\nThe financial statements and schedules listed in the accompanying Index to Financial Statements and Schedules on page F-1 are filed as part of this report.\nExhibits.\nThe exhibits listed on the accompanying Index to Exhibits on page E-1 are filed as part of this report except that the certifications in Exhibit 32 are being furnished to the SEC, rather than filed with the SEC, as permitted under applicable SEC rules.  \n65\nTable of Contents\nINDEX TO EXHIBITS\nExhibit No.\n2.1\nAgreement and Plan of Merger among Everest Reinsurance Holdings, Inc., Everest Group, Ltd. and Everest Re Merger Corporation, incorporated herein by reference to Exhibit 2.1 to the Registration Statement on Form S-4 (No. 333-87361)\n3.1\nMemorandum of Association of Everest Group, Ltd., incorporated herein by reference to Exhibit 3.1 to the Registration Statement on Form S-4 (No. 333-87361)\n3.2\nBye-Laws of Everest Group, Ltd., incorporated herein by reference to exhibit 3.2 to the Everest Group, Ltd., Quarterly Report for Form 10-Q for the quarter ended June 30, 2011 (the “second quarter 2011 10-Q”) \n \n4.1\nSpecimen Everest Group, Ltd. common share certificate, incorporated herein by reference to Exhibit 4.1 of the Registration Statement on Form S-4 (No. 333-87361)\n4.2\nIndenture, dated March 14, 2000, between Everest Reinsurance Holdings, Inc. and The Chase Manhattan Bank (now known as JPMorgan Chase Bank), as Trustee, incorporated herein by reference to Exhibit 4.1 to Everest Reinsurance Holdings, Inc. Form 8-K filed on March 15, 2000\n4.3\nFourth Supplemental Indenture relating to Holdings $400.0 million 4.868% Senior Notes due June 1, 2044, dated June 5, 2014, between Holdings and The Bank of New York Mellon, as Trustee, incorporated herein by reference to Exhibit 4.1 to Everest Reinsurance Holdings, Inc. Form 8-K filed on June 5, 2014 \n \n4.4\nFifth Supplemental Indenture relating to Holdings $1.0 billion 3.5% Senior Notes due October 15, 2050, dated October 7, 2020, between Holdings and The Bank of New York Mellon, as Trustee, incorporated herein by reference to Exhibit 4.1 to Everest Reinsurance Holdings, Inc. Form 8-K filed on October 7, 2020\n4.5\nSixth Supplemental Indenture relating to Holdings $1.0 billion 3.125% Senior Notes due October 15, 2052, dated October 4, 2021, between Holdings and The Bank of New York Mellon, as Trustee, incorporated herein by reference to Exhibit 4.1 to Everest Reinsurance Holdings, Inc. Form 8-K filed on October 4, 2021\n*10.1\nEverest Group, Ltd. Annual Incentive Plan effective January 1, 1999, incorporated herein by reference to Exhibit 10.1 to Everest Reinsurance Holdings, Inc. Annual Report on Form 10-K for the year ended December 31, 1998 (the “1998 10-K”)\n*10.2\nEverest Group, Ltd. 2003 Non-Employee Director Equity Compensation Plan, incorporated herein by reference to Exhibit 4.1 to the Registration Statement on Form S-8 (No. 333-105483)\n*10.3\nForm of Non-Qualified Stock Option Award Agreement under the Everest Group, Ltd. 2003 Non-Employee Director Equity Compensation Plan, incorporated herein by reference to Exhibit 10.47 to Everest Group, Ltd., Report on Form 10-K for the year ended December 31, 2004\n*10.4\nAmendment of Everest Group, Ltd. 2003 Non-Employee Director Equity Compensation Plan adopted by shareholders at the annual general meeting on May 25, 2005, incorporated herein by reference to Appendix B to the 2005 Proxy Statement filed on April 14, 2005\n \nE-1\nTable of Contents\n*10.5\nForm of Restricted Stock Award Agreement under the Everest Group, Ltd. 2003 Non-Employee Director Equity Compensation Plan, incorporated by reference to Exhibit 10.1 to Everest Group, Ltd. Form 8-K filed on September 22, 2005\n10.6\nCompletion of Tender Offer relating to Everest Reinsurance Holdings, Inc. 6.60% Fixed to Floating Rate Long Term Subordinated Notes (LoTSSM) dated March 19, 2009, incorporated herein by reference to Exhibit 99.1 to Everest Group, Ltd. Form 8-K filed on March 31, 2009\n*10.7\nEverest Group, Ltd. 2009 Stock Option and Restricted Stock Plan for Non-Employee Directors\n,\n incorporated herein by reference to Exhibit 10.1 to Everest Group, Ltd. second quarter 2009 10-Q \n \n*10.8\nEverest Group, Ltd. 2010 Stock Incentive Plan for employees is incorporated herein by reference to exhibit 10.2 to Everest Group, Ltd.  Form S-8 filed on September 30, 2010 \n \n*10.9\nAmendment of Executive Performance Annual Incentive Plan adopted by shareholders at the annual general meeting on May 18, 2011, incorporated herein by reference to Appendix B to the 2011 Proxy Statement filed on April 15, 2011\n*10.10\nAmendment of Everest Group, Ltd. 2010 Stock Incentive Plan adopted by shareholders at the annual general meeting on May 13, 2015, incorporated herein by reference to Appendix A to the 2015 Proxy Statement filed on April 10, 2015\n*10.11\nAmendment of Everest Group, Ltd. 2003 Non-Employee Director Equity Compensation Plan adopted by shareholders at the annual general meeting on May 13, 2015, incorporated herein by reference to Appendix B to the 2015 Proxy Statement filed on April 10, 2015\n*10.12\nAmendment of employment agreement between Everest Global Services, Inc. and Sanjoy Mukherjee, dated February 12, 2016, incorporated herein by reference to Exhibit 10.1 to Everest Group, Ltd. Form 8-K filed on February 17, 2016\n10.13\nCredit Agreement, dated May 26, 2016, between Everest Group, Ltd., Everest Reinsurance (Bermuda), Ltd. and Everest International Reinsurance, Ltd., certain lenders party thereto and Wells Fargo Bank, N.A. as administrative agent, providing for an $800.0 million four year senior credit facility, incorporated herein by reference to Exhibit 10.31 to Everest Group, Ltd. Form 10-Q filed on August 9, 2016.  This new agreement replaces the June 22, 2012 four year, $800.0 million senior credit facility\n \n*10.14\nEmployment agreement between Everest Global Services, Inc., and John P. Doucette, dated October 21, 2016, incorporated herein by reference to Exhibit 10.1 to Everest Group, Ltd. Form 8-K filed on October 26, 2016\n*10.15\nEmployment agreement between Everest Global Services, Inc., and Sanjoy Mukherjee, dated January 3, 2017, incorporated herein by reference to Exhibit 10.1 to Everest Group, Ltd. Form 8-K filed on January 6, 2017\n10.16\nBye-Law waiver agreement between Everest Group, Ltd., and BlackRock, Inc. dated December 1, 2017, incorporated herein by reference to exhibit 10.1 to the Everest Group, Ltd., Form 8-K filed on December 4, 2017 \n \nE-2\nTable of Contents\n10.17\nAmendment of Standby Letter of Credit, dated December 29, 2017, between Everest Reinsurance (Bermuda), Ltd. and Citibank Europe plc providing $250.0 million four year credit facility, incorporated herein by reference to exhibit 10.26 to the Everest Group, Ltd., Form 10-K filed on March 1, 2018 \n \n10.18\nAmendment of Committed Facility Letter, dated December 10, 2018, between Everest Reinsurance (Bermuda), Ltd. and Citibank Europe plc providing $200.0 million annually, incorporated herein by reference to exhibit 10.34 to the Everest Group, Ltd., Form 10-K filed on March 1, 2019 \n \n*10.19\nEmployment agreement between Everest Group, Ltd. and Juan Andrade dated August 1, 2019, incorporated herein by reference to Exhibit 10.1 to Everest Group Ltd. Form 8-K filed on August 8, 2019.\n10.20\nAmendment of Committed Facility Letter, dated December 31, 2019, between Everest Reinsurance (Bermuda), Ltd. and Citibank Europe plc providing $200.0 million annually, incorporated herein by reference to Exhibit 10.31 to the Everest Group, Ltd. Form 10-K filed on March 2, 2020 \n \n*10.21\nEverest Group, Ltd. 2020 Stock Incentive Plan for employees is incorporated herein by reference to Appendix A of the 2021 Proxy Statement filed on April 9, 2021\n*10.22\nEmployment agreement between Everest Global Services, Inc. and Mark Kociancic, incorporated herein by reference to Exhibit 10.1 to Everest Group, Ltd. Form 8-K filed on October 1, 2020\n \n*10.23\nEmployment agreement between Everest Global Services, Inc. and James Williamson, incorporated herein by reference to Exhibit 10.2 to Everest Group, Ltd. Form 8-K filed on October 1, 2020\n10.24\nAmendment of Committed Facility Letter, dated December 9, 2020 between Everest Reinsurance (Bermuda), Ltd. and Citibank Europe plc providing $200.0 million annually, incorporated herein by reference to Exhibit 10.34 to Everest Group, Ltd. Form 10-K filed on March 1, 2021\n \n10.25\nCredit facility agreement dated February 23, 3021 between Everest Reinsurance (Bermuda), Ltd. and Wells Fargo Bank, N.A. providing up to $50.0 million of committed credit facility, incorporated herein by reference to Exhibit 10.1 to Everest Group, Ltd. Form 10-Q filed on May 10, 2021\n10.26\nAmendment of Credit Facility agreement, dated May 5, 2021 between Everest Reinsurance (Bermuda), Ltd. and Wells Fargo Bank, N.A. providing up to $500.0 million of committed credit facility, incorporated herein by reference to Exhibit 10.1 to Everest Group, Ltd. Form 10-Q filed on August 5, 2021\n10.27\nCredit Facility agreement, dated August 9, 2021 between Everest Reinsurance (Bermuda), Ltd. and Citibank Europe plc providing up to $230.0 million committed credit facility and $140.0 million of additional uncommitted credit facility, incorporated herein by reference to Exhibit 10.1 to Everest Group, Ltd. Form 10-Q filed on November 4, 2021\n \n10.28\nCredit Facility agreement, dated August 27, 2021 between Everest Reinsurance (Bermuda), Ltd. and Bayerische Landesbank providing up to $200.0 million of committed credit facility, incorporated herein by reference to Exhibit 10.2 to Everest Group, Ltd. Form 10-Q filed on November 4, 2021\n10.29\nCredit Facility agreement, dated November 3, 2021 between Everest Reinsurance (Bermuda), Ltd. and Barclays Bank Plc providing up to $200.0 million of committed credit facility, incorporated herein by reference to Exhibit 10.40 to Everest Group, Ltd. Form 10-K filed on February 28, 2022\nE-3\nTable of Contents\n10.30\nCredit Facility agreement, dated November 21, 2022 between Everest Reinsurance (Bermuda), Ltd. and Nordea Bank ABP, New York Branch providing up to $200.0 million of committed credit facility and $100.0 million of additional uncommitted credit facility, incorporated herein by reference to Exhibit 10.41 to Everest Group, Ltd. Form 10-K filed on February 24, 2023\n10.31\nAmendment of Credit Facility agreement, dated December 30, 2022, between Everest Reinsurance (Bermuda), Ltd. and Bayerische Landesbank, New York Branch, providing up to $150.0 million of committed, unsecured credit facility, incorporated herein by reference to Exhibit 10.42 to Everest Group, Ltd. Form 10-K filed on February 24, 2023\n*10.32\nEmployment agreement between Everest Global Services, Inc. and \nJoseph V. Taranto\n, incorporated herein by reference to Exhibit 10.1 to Everest Group, Ltd. Form 10-Q filed on May 4, 2023\n*10.33\nDeparture of Sanjoy Mukherjee, Executive Vice President, General Counsel and Secretary of Everest Group, Ltd. effective July 3, 2023, herein by reference to Exhibit 10.2 to Everest Group, Ltd. Form 10-Q filed on May 4, 2023\n10.34\nStandby Letter of Credit, dated August 18, 2023 between Everest Reinsurance (Bermuda), Ltd. and Lloyd’s Bank Corporate Markets Plc providing up to $250.0 million of unsecured letters of credit, incorporated herein by reference to Exhibit 10.3 to Everest Group, Ltd. Form 10-Q filed on November 1, 2023\n10.35\nAmended and restated standby letter of credit agreement between Everest Reinsurance (Bermuda), Ltd. and Lloyd’s Bank Corporate Markets Plc to add Everest Insurance (Ireland), dac (the new account party) as an account party with $15.0 million sublimit for the issuance of letters of credit, \nincorporated herein by reference to Exhibit 10.44 to Everest Group, L\ntd. Form 10-K fil\ned on Fe\nbruary 2\n8\n, 2024\n*10.36\nEmployment agreement made effective as of June 12, 2023, between Everest Global Services, Inc. and Ricardo A. Anzaldua, \nincorporated herein by reference to Exhibit 10.4\n5\n to Everest Group, Ltd. Form 10-K filed on February 28, 2024\n*10.37\nAmendment to Employment Agreement between Everest Global Services, Inc., Everest Group, Ltd., Everest Reinsurance Holdings Inc. and Juan C. Andrade dated April 22, 2024\n,\n incorporated herein by reference to Exhibit 10.1 to Everest Group, Ltd. Form 10-Q filed on May 3, 2024\n*10.38\nAmended and Restated Employment Agreement between Everest Global Services, Inc. and Mark Kociancic dated April 25, 2024\n,\n  incorporated herein by reference to Exhibit 10.2 to Everest Group, Ltd. Form 10-Q filed on May 3, 2024\n*10.39\nAmended and Restated Employment Agreement between Everest Global Services, Inc. and James Williamson dated April 26, 2024\n,\n  incorporated herein by reference to Exhibit 10.3 to Everest Group, Ltd. Form 10-Q filed on May 3, 2024\n*10.40\nAmended and Restated Employment Agreement between Everest National Insurance Company and Michael Karmilowicz dated March 24, 2024\n,\n \nincorpo\nr\na\nted herein by reference to Exhibit 10.4 to Everest Group, Ltd. Form \n10-Q filed on May 3, 2024\n*10.41\nAmended and Restated Employment Agreement between Everest Global Services, Inc. and Ricardo Anzaldua dated April 22, 2024\n,\n  incorporated herein by reference to Exhibit 10.5 to Everest Group, Ltd. Form 10-Q filed on May 3, 2024\n10.42\nEverest Reinsurance Group, Ltd. Senior Executive Change of Control Plan, as amended and restated effective November 17, 2015, incorporated herein by reference to Exhibit 10.6 to Everest Group, Ltd. Form 10-Q filed on May 3, 2024\nE-4\nTable of Contents\n10.43\nAmendment of Bilateral Letter of Credit Facility Agreement, dated June 2024, between Everest Reinsurance (Bermuda), Ltd. and Wells Fargo Bank N.A.,\n incorporated herein by reference to Exhibit 10.\n5\n to Everest Group, Ltd. Form 10-Q filed on \nAugust\n \n2\n, 2024\n10.44\nAmendment of \nCredit Facility agreement, dated \nOctober\n 3\n0\n, 202\n4\n between Everest Reinsurance (Bermuda), Ltd. and Barclays Bank Plc\n, \nfiled herewith\n10.45\nStandby Letter of Credit Facility Agreement, dated October 30, 2024 between Everest\n International\n Reinsurance\n, Ltd.\n and \nLloyds Bank P\nlc\n, \nproviding up to \n£113 million\n of unsecured letters of credit, filed herewith\n10.46\nAmendment of Credit Facility agreement, dated December \n2\n0, 202\n4\n, between Everest Reinsurance (Bermuda), Ltd. and Bayerische Landesbank, New York Branch, \nfiled herewith\n10.47\nStandby Letter of Credit\n Facility Agreement\n, dated\n December\n \n30\n, 202\n4\n between Everest Reinsurance \nCompany \n(\nIreland\n), \ndac\n and\n Commerzbank AG,\n New York Branch\n providing up to\n \n€75 million\n \nof unsecured letters of credit, \nfiled herewith\n14.1\nEthics Guidelines and Index to Compliance Policies\n, incorporated herein by reference to Exhibit 14.1 to Everest Group, Ltd. Form 10-K filed on February 28, 2024\n21.1\nSubsidiaries of the registrant, filed herewith\n23.1\nConsent of KPMG LLP, filed herewith\n23.2\nC\nonse\nnt of Pricewaterhouse\nC\noo\npers \nLLP, filed herewith\n31.1\nSection 302 Certification of J\names\n Williamson, filed herewith\n31.2\nSection 302 Certification of Mark Kociancic, filed herewith\n32.1\nSection 906 Certification of J\names\n Williamson and Mark Kociancic, furnished herewith\n97.1\nEverest Group, Ltd. Clawback Policy\n,\n \nincorporated herein by reference to Exhibit 97.1 to Everest Group, Ltd. Form 10-K filed on February 28, 2024\n101.INS\nXBRL Instance Document\n101.SCH\nXBRL Taxonomy Extension Schema\n101.CAL\nXBRL Taxonomy Extension Calculation Linkbase\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase\n101.LAB\nXBRL Taxonomy Extension Label Linkbase\n101.PRE\nXBRL Taxonomy Extension Presentation Linkbase\n104\nCover Page Interactive Data File (embedded within the Inline XBRL document)\n_________________\n*\nManagement contract or compensatory plan or arrangement.\nE-5\nTable of Contents\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized on February 27, 2025.\nEVEREST GROUP, LTD.\nBy:\n/S/ JAMES WILLIAMSON\nJames Williamson\n(President and Chief Executive Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/S/ JAMES WILLIAMSON\nPresident and Chief Executive Officer\n(Principal Executive Officer) \nFebruary 27, 2025\nJames Williamson\n/S/ MARK KOCIANCIC\nExecutive Vice President and Chief Financial Officer\nFebruary 27, 2025\nMark Kociancic\n/S/ ROBERT J. FREILING\nSenior Vice President and Chief Accounting Officer\nFebruary 27, 2025\nRobert J. Freiling\n/S/ JOSEPH V. TARANTO\nChairman\nFebruary 27, 2025\nJoseph V. Taranto\n/S/ JOHN J. AMORE\nDirector\nFebruary 27, 2025\nJohn J. Amore\n/S/ WILLIAM F. GALTNEY, JR.\nDirector\nFebruary 27, 2025\nWilliam F. Galtney, Jr.\n/S/ JOHN A. GRAF\nDirector\nFebruary 27, 2025\nJohn A. Graf\n/S/ MERYL HARTZBAND\nDirector\nFebruary 27, 2025\nMeryl Hartzband\n/S/ GERALDINE LOSQUADRO\nDirector\nFebruary 27, 2025\nGeraldine Losquadro\n/S/ HAZEL McNEILAGE\nDirector\nFebruary 27, 2025\nHazel McNeilage\n/S/ ROGER M. SINGER\nDirector\nFebruary 27, 2025\nRoger M. Singer\nE-6\nTable of Contents\nEVEREST GROUP, LTD.\nINDEX TO FINANCIAL STATEMENTS AND SCHEDULES\nPages\nReport of Independent Registered Public Accounting Firm \n(PCAOB FIRM ID \n185\n, \n238\n)\nF-\n2\nConsolidated Balance Sheets at \nDecember 31, 2024\n and \n2023\nF-\n6\nConsolidated Statements of Operations and Comprehensive Income (Loss) for the Years Ended \nDecember 31, 2024\n, \n2023\n and \n2022\nF-\n7\nConsolidated Statements of Changes in Shareholders’ Equity for the Years Ended\n December 31, 2024\n, \n2023\n and \n2022\nF-\n8\nConsolidated Statements of Cash Flows for the Years Ended  \nDecember 31, 2024\n, \n2023\n and \n2022\nF-\n9\nNotes to Consolidated Financial Statements\nF-\n10\nSchedules\nI\nSummary of Investments Other Than Investments in Related Parties at \nDecember 31, 2024\nS-\n1\nII\nCondensed Financial Information of Registrant:\nBalance Sheets as of \nDecember 31, 2024\n and \n2023\nS-\n2\nStatements of Operations for the Years Ended \nDecember 31, 2024\n, \n2023\n and \n2022\nS-\n3\nStatements of Cash Flows for the Years Ended \nDecember 31, 2024\n, \n2023\n and \n2022\nS-\n4\nNotes to Condensed Financial Information\nS-\n5\nIII\nSupplementary Insurance Information as of and for the Years Ended \nDecember 31, 2024\n, \n2023 and 2022\nS-\n7\nIV\nReinsurance for the Years Ended \nDecember 31, 2024\n, \n2023 and 2022\nS-\n8\nSchedules other than those listed above are omitted for the reason that they are not applicable or the information is otherwise contained in the Financial Statements.\nF-1\nTable of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Shareholders\nEverest Group, Ltd.:\nOpinions on the Consolidated Financial Statements and Internal Control Over Financial Reporting\nWe have audited the accompanying consolidated balance sheet of Everest Group, Ltd. and subsidiaries (the Company) as of December 31, 2024, the related consolidated statements of operations and comprehensive income (loss), changes in shareholders’ equity, and cash flows for the year then ended, and the related notes and financial statement schedules listed in the index appearing on page F-1 (collectively, the consolidated financial statements). We also have audited the Company’s internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control – Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of December 31, 2024, and the results of its operations and its cash flows for the year then ended in conformity with U.S. generally accepted accounting principles. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024 based on criteria established in Internal Control – Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nBasis for Opinions\nThe Company’s management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management's Report on Internal Control over Financial Reporting appearing under Item 9A. Our responsibility is to express an opinion on the Company’s consolidated financial statements and an opinion on the Company’s internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audit of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of \nF-2\nTable of Contents\nmanagement and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of a critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nEstimate of the reserve for losses and loss adjustment expenses\nAs discussed in Notes 1E and 4 to the consolidated financial statements, the reserve for losses and loss adjustment expenses represents the Company’s best estimate of the ultimate liability for reported and unreported claims for both its insurance and reinsurance businesses. The Company uses a variety of statistical and actuarial techniques to develop estimates of ultimate losses and loss adjustment expenses by underwriting or accident year, sorted by exposure groupings. The Company considers many factors when setting reserves including: (1) exposure base and projected ultimate premium; (2) expected loss ratios; (3) actuarial methodologies and assumptions; (4) current legal interpretations of coverage and liability; and (5) economic conditions. The Company’s reserve for losses and loss adjustment expenses as of December 31, 2024 was $29,889 million.\nWe identified the evaluation of the estimate of the reserve for losses and loss adjustment expenses as a critical audit matter. Evaluation of the estimate required subjective auditor judgment and the involvement of actuarial professionals with specialized skills and knowledge to assess the methods and assumptions used to estimate the reserve for losses and loss adjustment expenses.\nThe following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of certain internal controls related to the Company’s process for estimating the reserve for losses and loss adjustment expenses. This included controls related to the selection of methodologies and certain assumptions used to derive the Company’s estimate. We involved actuarial professionals with specialized skills and knowledge who assisted in:\n•\nassessing the Company’s actuarial methodologies and assumptions used in estimating the reserve for losses and loss adjustment expenses by comparing the Company’s methodologies to generally accepted actuarial methods and evaluating the assumptions used based on actuarial judgment, company history, and industry practices\n•\nevaluating the Company’s estimated reserve for losses and loss adjustment expenses for certain lines of business by comparing each one to an independently developed range of reasonable estimates \n•\nevaluating the Company’s estimated reserve for losses and loss adjustment expenses for certain lines of business by assessing management’s methods and assumptions used to derive their loss estimates\n•\nevaluating the Company’s process for estimating the reserve for losses and loss adjustment expenses for catastrophic events\n•\ndeveloping an overall range of reserve estimates to assess the position of the Company’s recorded reserve for losses and loss adjustment expenses relative to the range\nF-3\nTable of Contents\n/s/ \nKPMG LLP\nWe have served as the Company’s auditor since 2024.\nNew York, New York\nFebruary 27, 2025\nF-4\nTable of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Shareholders of Everest Group, Ltd.\nOpinion on the Financial Statements\nWe have audited the consolidated balance sheet of Everest Group, Ltd. and its subsidiaries (the \"Company\") as of December 31, 2023, and the related consolidated statements of operations and comprehensive income (loss), of changes in shareholders' equity and of cash flows for each of the two years in the period ended December 31, 2023, including the related notes and financial statement schedules listed in the index appearing on page F-1 (collectively referred to as the \"consolidated financial statements\"). \nIn our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2023, and the results of its operations and its cash flows for each of the two years in the period ended December 31, 2023 in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits of these consolidated financial statements in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\n/s/ \nPricewaterhouseCoopers LLP\n \nNew York, New York\nFebruary 28, 2024, except for the changes in segment presentation discussed in Note 6 to the consolidated financial statements, as to which the date is February 27, 2025\nWe served as the Company’s auditor from 1996 to 2024.\nF-5\nTable of Contents\nEVEREST GROUP, LTD.\nCONSOLIDATED BALANCE SHEETS\nDecember 31,\n(In millions of U.S. dollars, except par value per share)\n2024\n2023\nASSETS:\nFixed maturities - available for sale, at fair value\n$\n28,908\n \n$\n27,740\n \n(amortized cost: 2024, $\n29,934\n; 2023, $\n28,568\n, credit allowances: 2024, $(\n36\n); 2023, $(\n48\n))\nFixed maturities - held to maturity, at amortized cost\n(fair value: 2024, $\n759\n; 2023, $\n854\n, net of credit allowances: 2024, $(\n8\n); 2023, $(\n8\n))\n757\n \n855\n \nEquity securities, at fair value\n217\n \n188\n \nOther invested assets\n5,392\n \n4,794\n \nShort-term investments\n4,707\n \n2,127\n \nCash\n1,549\n \n1,437\n \nTotal investments and cash\n41,531\n \n37,142\n \nAccrued investment income\n368\n \n324\n \nPremiums receivable (net of credit allowances: 2024, $(\n54\n); 2023, $(\n41\n))\n5,378\n \n4,768\n \nReinsurance paid loss recoverables (net of credit allowances: 2024, $(\n41\n); 2023, $(\n26\n))\n207\n \n164\n \nReinsurance unpaid loss recoverables\n2,915\n \n2,098\n \nFunds held by reinsureds\n1,218\n \n1,135\n \nDeferred acquisition costs\n1,461\n \n1,247\n \nPrepaid reinsurance premiums\n869\n \n713\n \nIncome tax asset, net\n1,223\n \n868\n \nOther assets (net of credit allowances: 2024, $(\n9\n); 2023, $(\n9\n))\n1,171\n \n941\n \nTOTAL ASSETS\n$\n56,341\n \n$\n49,399\n \nLIABILITIES:\nReserve for losses and loss adjustment expenses\n$\n29,889\n \n$\n24,604\n \nUnearned premium reserve\n7,324\n \n6,622\n \nFunds held under reinsurance treaties\n27\n \n24\n \nAmounts due to reinsurers\n701\n \n650\n \nLosses in course of payment\n241\n \n171\n \nSenior notes\n2,350\n \n2,349\n \nLong-term notes\n218\n \n218\n \nBorrowings from FHLB\n1,019\n \n819\n \nAccrued interest on debt and borrowings\n22\n \n22\n \nUnsettled securities payable\n84\n \n137\n \nOther liabilities\n590\n \n582\n \nTOTAL LIABILITIES\n42,466\n \n36,197\n \nCommitments and contingencies (Note 11)\nSHAREHOLDERS' EQUITY:\nPreferred shares, par value: $\n0.01\n; \n50.0\n shares authorized; \nno\n shares issued and outstanding\n—\n \n—\n \nCommon shares, par value: $\n0.01\n; \n200.0\n shares authorized; \n74.3\n (2024) and \n74.2\n (2023)\noutstanding before treasury shares\n1\n \n1\n \nAdditional paid-in capital\n3,812\n \n3,773\n \nAccumulated other comprehensive income (loss), net of deferred income tax expense (benefit)\nof $(\n177\n) at 2024 and $(\n99\n) at 2023\n(\n1,138\n)\n(\n934\n)\nTreasury shares, at cost: \n31.3\n shares (2024) and \n30.8\n shares (2023)\n(\n4,108\n)\n(\n3,908\n)\nRetained earnings\n15,309\n \n14,270\n \nTotal shareholders' equity\n13,875\n \n13,202\n \nTOTAL LIABILITIES AND SHAREHOLDERS' EQUITY\n$\n56,341\n \n$\n49,399\n \nThe accompanying notes are an integral part of the consolidated financial statements.\nF-6\nTable of Contents\nEVEREST GROUP, LTD.\nCONSOLIDATED STATEMENTS OF OPERATIONS \nAND COMPREHENSIVE INCOME (LOSS)\nYears Ended December 31,\n(In millions of U.S. dollars, except per share amounts)\n2024\n2023\n2022\nREVENUES:\nPremiums earned\n$\n15,187\n \n$\n13,443\n \n$\n11,787\n \nNet investment income\n1,954\n \n1,434\n \n830\n \nTotal net gains (losses) on investments\n19\n \n(\n276\n)\n(\n455\n)\nOther income (expense)\n121\n \n(\n14\n)\n(\n102\n)\nTotal revenues\n17,281\n \n14,587\n \n12,060\n \nCLAIMS AND EXPENSES:\nIncurred losses and loss adjustment expenses\n11,305\n \n8,427\n \n8,100\n \nCommission, brokerage, taxes and fees\n3,300\n \n2,952\n \n2,528\n \nOther underwriting expenses\n938\n \n846\n \n682\n \nCorporate expenses\n95\n \n73\n \n61\n \nInterest, fees and bond issue cost amortization expense\n149\n \n134\n \n101\n \nTotal claims and expenses\n15,787\n \n12,432\n \n11,472\n \nINCOME (LOSS) BEFORE TAXES\n1,493\n \n2,154\n \n588\n \nIncome tax expense (benefit)\n120\n \n(\n363\n)\n(\n9\n)\nNET INCOME (LOSS)\n$\n1,373\n \n$\n2,517\n \n$\n597\n \nOther comprehensive income (loss), net of tax:\nUnrealized appreciation (depreciation) (\"URA(D)\") on securities arising during the period\n(\n97\n)\n743\n \n(\n2,037\n)\nReclassification adjustment for realized losses (gains) included in net income (loss)\n(\n12\n)\n244\n \n89\n \nTotal URA(D) on securities arising during the period\n(\n109\n)\n986\n \n(\n1,948\n)\nForeign currency translation and other adjustments\n(\n128\n)\n59\n \n(\n77\n)\nBenefit plan actuarial net gain (loss) for the period\n34\n \n15\n \n15\n \nReclassification adjustment for amortization of net (gain) loss included in net income (loss)\n(\n1\n)\n2\n \n2\n \nTotal benefit plan net gain (loss) for the period\n33\n \n17\n \n17\n \nTotal other comprehensive income (loss), net of tax\n(\n204\n)\n1,063\n \n(\n2,008\n)\nCOMPREHENSIVE INCOME (LOSS)\n$\n1,169\n \n$\n3,580\n \n$\n(\n1,411\n)\nEARNINGS PER COMMON SHARE:\nBasic\n$\n31.78\n \n$\n60.19\n \n$\n15.19\n \nDiluted\n31.78\n \n60.19\n \n15.19\n \nThe accompanying notes are an integral part of the consolidated financial statements.\nF-7\nTable of Contents\nEVEREST GROUP, LTD.\nCONSOLIDATED STATEMENTS OF \nCHANGES IN SHAREHOLDERS’ EQUITY\nYears Ended December 31,\n(In millions of U.S. dollars, except dividends per share amounts)\n2024\n2023\n2022\nCOMMON SHARES (shares outstanding):\nBalance beginning of period\n43.4\n \n39.2\n \n39.3\n \nIssued (redeemed) during the period, net\n0.1\n \n4.2\n \n0.1\n \nTreasury shares acquired\n(\n0.5\n)\n— \n(\n0.2\n)\nBalance end of period\n43.0\n \n43.4\n \n39.2\n \nCOMMON SHARES (par value):\nBalance beginning of period\n$\n1\n \n$\n1\n \n$\n1\n \nIssued during the period, net\n— \n— \n— \nBalance end of period\n1\n \n1\n \n1\n \nADDITIONAL PAID-IN CAPITAL:\nBalance beginning of period\n3,773\n \n2,302\n \n2,274\n \nPublic offering of shares\n— \n1,445\n \n— \nShare-based compensation plans\n39\n \n26\n \n28\n \nBalance end of period\n3,812\n \n3,773\n \n2,302\n \nACCUMULATED OTHER COMPREHENSIVE INCOME (LOSS),\nNET OF DEFERRED INCOME TAXES:\nBalance beginning of period\n(\n934\n)\n(\n1,996\n)\n12\n \nNet increase (decrease) during the period\n(\n204\n)\n1,063\n \n(\n2,008\n)\nBalance end of period\n(\n1,138\n)\n(\n934\n)\n(\n1,996\n)\nRETAINED EARNINGS:\nBalance beginning of period\n14,270\n \n12,042\n \n11,700\n \nNet income (loss)\n1,373\n \n2,517\n \n597\n \nDividends declared ($\n7.75\n per share 2024, $\n6.80\n per share 2023 and $\n6.50\n per share 2022)\n(\n334\n)\n(\n288\n)\n(\n255\n)\nBalance end of period\n15,309\n \n14,270\n \n12,042\n \nTREASURY SHARES AT COST:\nBalance beginning of period\n(\n3,908\n)\n(\n3,908\n)\n(\n3,847\n)\nPurchase of treasury shares\n(\n200\n)\n— \n(\n61\n)\nBalance end of period\n(\n4,108\n)\n(\n3,908\n)\n(\n3,908\n)\nTOTAL SHAREHOLDERS' EQUITY, END OF PERIOD\n$\n13,875\n \n$\n13,202\n \n$\n8,441\n \nThe accompanying notes are an integral part of the consolidated financial statements.\nF-8\nTable of Contents\nEVEREST GROUP, LTD.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYears Ended December 31,\n(In millions of U.S. dollars)\n2024\n2023\n2022\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet income (loss)\n$\n1,373\n \n$\n2,517\n \n$\n597\n \nAdjustments to reconcile net income to net cash provided by operating activities:\nDecrease (increase) in premiums receivable\n(\n715\n)\n(\n1,064\n)\n(\n435\n)\nDecrease (increase) in funds held by reinsureds, net\n(\n81\n)\n(\n66\n)\n(\n197\n)\nDecrease (increase) in reinsurance recoverables\n(\n1,091\n)\n143\n \n(\n413\n)\nDecrease (increase) in income taxes\n(\n277\n)\n(\n559\n)\n(\n181\n)\nDecrease (increase) in prepaid reinsurance premiums\n(\n232\n)\n(\n46\n)\n(\n166\n)\nIncrease (decrease) in reserve for losses and loss adjustment expenses\n5,612\n \n2,256\n \n3,477\n \nIncrease (decrease) in unearned premiums\n809\n \n1,387\n \n655\n \nIncrease (decrease) in amounts due to reinsurers\n135\n \n18\n \n201\n \nIncrease (decrease) in losses in course of payment\n75\n \n93\n \n(\n186\n)\nChange in equity adjustments in limited partnerships\n(\n261\n)\n(\n168\n)\n(\n94\n)\nDistribution of limited partnership income\n163\n \n120\n \n180\n \nChange in other assets and liabilities, net\n(\n431\n)\n(\n339\n)\n(\n297\n)\nNon-cash compensation expense\n63\n \n49\n \n45\n \nAmortization of bond premium (accrual of bond discount)\n(\n167\n)\n(\n64\n)\n55\n \nNet (gains) losses on investments\n(\n19\n)\n276\n \n455\n \nNet cash provided by (used in) operating activities\n4,957\n \n4,553\n \n3,695\n \nCASH FLOWS FROM INVESTING ACTIVITIES:\nProceeds from fixed maturities matured/called/repaid - available for sale\n3,783\n \n2,310\n \n2,626\n \nProceeds from fixed maturities sold - available for sale\n6,257\n \n3,849\n \n1,403\n \nProceeds from fixed maturities matured/called/repaid - held to maturity\n157\n \n105\n \n39\n \nProceeds from equity securities sold\n37\n \n126\n \n2,217\n \nDistributions from other invested assets\n409\n \n245\n \n266\n \nCost of fixed maturities acquired - available for sale\n(\n11,563\n)\n(\n10,653\n)\n(\n7,344\n)\nCost of fixed maturities acquired - held to maturity\n(\n49\n)\n(\n112\n)\n(\n153\n)\nCost of equity securities acquired\n(\n50\n)\n(\n17\n)\n(\n1,003\n)\nCost of other invested assets acquired\n(\n936\n)\n(\n902\n)\n(\n1,547\n)\nNet change in short-term investments\n(\n2,494\n)\n(\n1,034\n)\n149\n \nNet change in unsettled securities transactions\n(\n27\n)\n181\n \n(\n71\n)\nNet cash provided by (used in) investing activities\n(\n4,478\n)\n(\n5,902\n)\n(\n3,418\n)\nCASH FLOWS FROM FINANCING ACTIVITIES:\nCommon shares issued (redeemed) during the period for share-based compensation, net of expense\n(\n24\n)\n(\n23\n)\n(\n17\n)\nProceeds from public offering of common shares\n—\n \n1,445\n \n—\n \nPurchase of treasury shares\n(\n200\n)\n—\n \n(\n61\n)\nDividends paid to shareholders\n(\n334\n)\n(\n288\n)\n(\n255\n)\nProceeds from issuance of senior notes\n—\n \n—\n \n—\n \nCost of debt repurchase\n—\n \n—\n \n(\n6\n)\nNet FHLB borrowings (repayments)\n200\n \n300\n \n—\n \nCost of shares withheld on settlements of share-based compensation awards\n(\n25\n)\n(\n24\n)\n(\n20\n)\nNet cash provided by (used in) financing activities\n(\n383\n)\n1,409\n \n(\n359\n)\nEFFECT OF EXCHANGE RATE CHANGES ON CASH\n16\n \n(\n23\n)\n39\n \nNet increase (decrease) in cash\n112\n \n38\n \n(\n42\n)\nCash, beginning of period\n1,437\n \n1,398\n \n1,441\n \nCash, end of period\n$\n1,549\n \n$\n1,437\n \n$\n1,398\n \nSUPPLEMENTAL CASH FLOW INFORMATION:\nIncome taxes paid (recovered)\n$\n397\n \n$\n196\n \n$\n171\n \nInterest paid\n147\n \n130\n \n98\n \nNON-CASH TRANSACTIONS:\nReclassification of specific investments from fixed maturity securities, available for sale at fair value\n to fixed maturity securities, held to maturity at amortized cost net of credit allowances\n$\n—\n \n$\n—\n \n$\n722\n \nNon-cash limited partnership distribution\n23\n \n—\n \n—\n \nThe accompanying notes are an integral part of the consolidated financial statements.\nF-9\nTable of Contents\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nYears Ended December 31, 2024, 2023 and 2022\n1.    \nSUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nA.\nBusiness and Basis of Presentation.\nEverest Group, Ltd. (“Group”), a Bermuda company, through its subsidiaries, principally provides reinsurance and insurance in the U.S., Bermuda and international markets.  As used in this document, “Company” means Group and its subsidiaries.\nEffective July 10, 2023, the Company changed Group’s name to Everest Group, Ltd. from Everest Re Group, Ltd. and started trading under a new ticker symbol (NYSE: EG) to reflect the evolution, global growth and diversification strategy of the Company.\nThe accompanying consolidated financial statements have been prepared in conformity with accounting principles generally accepted in the United States of America (“GAAP”).  The statements include all of the following domestic and foreign direct and indirect subsidiaries of Group:  Everest International Reinsurance, Ltd. (“Everest International”), Everest Compañia de Seguros Generales Colombia S.A., Mt. Logan Insurance Managers, Ltd., Mt. Logan Management, Ltd., Everest International Holdings (Bermuda), Ltd. (“International Holdings”), Everest Corporate Member Limited, Everest Service Company (U.K.), Ltd., Everest Preferred International Holdings, Ltd. (“Preferred International”), Everest Reinsurance (Bermuda), Ltd. (“Bermuda Re”), Everest Re Advisors, Ltd., Everest Advisors (U.K.), Ltd., Everest Compañia de Seguros Generales Chile S.A. (“Everest Chile”), Compañia de Seguros Generales Everest Mexico S.A. de C.V., Everest Underwriting Group (Ireland), Limited (“Holdings Ireland”), Everest Global Services, Inc. (“Global Services”), Everest Insurance Company of Canada (“Everest Canada”), Premiere Insurance Underwriting Services (“Premiere”), Everest Dublin Insurance Holdings Limited (Ireland) (“Everest Dublin Holdings”), Everest Insurance (Ireland), dac (“Ireland Insurance”), Everest Reinsurance Company (Ireland), dac (“Ireland Re”), Everest Reinsurance Holdings, Inc. (“Holdings”), Salus Systems, LLC (“Salus”), Everest International Assurance, Ltd. (Bermuda) (“Everest Assurance”), Specialty Insurance Group, Inc. (“Specialty”), Specialty Insurance Group - Leisure and Entertainment Risk Purchasing Group LLC (“Specialty RPG”), Mt. McKinley Managers, L.L.C., Everest Specialty Underwriters Services, LLC, Everest Reinsurance Company (“Everest Re”), Everest National Insurance Company (“Everest National”), Everest Reinsurance Company Ltda. (Brazil), Mt. Whitney Securities, Inc., Everest Indemnity Insurance Company (“Everest Indemnity”), Everest Denali Insurance Company (“Everest Denali”), Everest Premier Insurance Company (“Everest Premier”), Everest Security Insurance Company (“Everest Security”),  Everest, Consultoría, Administración y Back Office, Sociedad de Responsabilidad Limitada de Capital Variable and Everest Servicios Colombia S.A.S.\n  \nAll intercompany accounts and transactions have been eliminated.  All amounts are reported in United States (“U.S.”) dollars.\nThe Company consolidates the results of operations and financial position of all voting interest entities (\"VOE\") in which the Company has a controlling financial interest and all variable interest entities (\"VIE\") in which the Company is considered to be the primary beneficiary. The consolidation assessment, including the determination as to whether an entity qualifies as a VIE or VOE, depends on the facts and circumstances surrounding each entity.\n \nThe preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities (and disclosure of contingent assets and liabilities) at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period.  Ultimate actual results could differ, possibly materially, from those estimates.  See ITEM 7, “Management’s Discussion and Analysis of Critical Accounting Estimates”.\nCertain reclassifications and format changes have been made to prior years’ amounts to conform to the 2024 presentation.\nB.\nInvestments and Cash.  \nFixed maturity securities designated as available for sale reflect unrealized appreciation and depreciation, as a result of changes in fair value during the period, in shareholders’ equity, net of income taxes in “accumulated other comprehensive income (loss)” in the consolidated balance sheets. The Company reviews all of its fixed maturity, available for sale securities whose fair value has fallen below their amortized cost at the time of review.  The Company then assesses whether the decline in value is due to non-credit related or credit related factors.  In making its assessment, the Company evaluates the current market and interest rate environment as well as specific issuer information.  Generally, a \nF-10\nTable of Contents\nchange in a security’s value caused by a change in the market, interest rate or foreign exchange environment does not constitute a credit impairment, but rather a non-credit related decline in fair value.  Non-credit related declines in fair value are recorded as unrealized losses in accumulated other comprehensive income (loss).  If the Company intends to sell the impaired security or is more likely than not to be required to sell the security before an anticipated recovery in value, the Company records the entire impairment in net gains (losses) on investments in the Company’s consolidated statements of operations and comprehensive income (loss).  If the Company determines that the decline is credit related and the Company does not have the intent to sell the security; and it is more likely than not that the Company will not have to sell the security before recovery of its cost basis, the Company establishes a credit allowance equal to the estimated credit loss and is recorded in net gains (losses) on investments in the Company’s consolidated statements of operations and comprehensive income (loss).  The determination of credit related or non-credit related impairment is first based on an assessment of qualitative factors, which may determine that a qualitative analysis is sufficient to support the conclusion that the present value of expected cash flows equals or exceeds the security’s amortized cost basis.  However, if the qualitative assessment suggests a credit loss may exist, a quantitative assessment is performed, and the amount of the allowance for a given security will generally be the difference between a discounted cash flow model and the Company’s carrying value.  The Company will adjust the credit allowance account for future changes in credit loss estimates for a security and record this adjustment through net gains (losses) on investments in the Company’s consolidated statements of operations and comprehensive income (loss). \nFixed maturity securities designated as held to maturity consist of debt securities for which the Company has both the positive intent and ability to hold to maturity or redemption and are reported at amortized cost, net of the current expected credit loss allowance.  Interest income for fixed maturity securities held to maturity is determined in the same manner as interest income for fixed maturity securities available for sale.  The Company evaluates fixed maturity securities classified as held to maturity for current expected credit losses utilizing risk characteristics of each security, including credit rating, remaining time to maturity, adjusted for prepayment considerations, and subordination level, and applying default and recovery rates, which include the incorporation of historical credit loss experience and macroeconomic forecasts, to develop an estimate of current expected credit losses.  The majority of these fixed maturities classified as held to maturity are of a high credit quality and are rated investment grade as of December 31, 2024.\nInterest, dividend income and amortization of fixed maturity market premium and discounts, related to securities are recorded in net investment income, net of investment management and custody fees in the Company’s consolidated statements of operations and comprehensive income (loss).  The Company does not create an allowance for uncollectible interest.  If interest is not received when due, the interest receivable is immediately reversed and no additional interest is accrued. If future interest is received that has not been accrued, it is recorded as income at that time.  The Company’s assessments are based on the issuers’ current and expected future financial position, timeliness with respect to interest and/or principal payments, speed of repayments and any applicable credit enhancements or breakeven constant default rates on mortgage-backed and asset-backed securities, as well as relevant information provided by rating agencies, investment advisors and analysts.  \nRetrospective adjustments are employed to recalculate the values of asset-backed securities.  All of the Company’s asset-backed and mortgage-backed securities have a pass-through structure.  Each acquisition lot is reviewed to recalculate the effective yield.  The recalculated effective yield is used to derive a book value as if the new yield were applied at the time of acquisition.  Outstanding principal factors from the time of acquisition to the adjustment date are used to calculate the prepayment history for all applicable securities.  Conditional prepayment rates, computed with life to date factor histories and weighted average maturities, are used in the calculation of projected prepayments for pass-through security types.  \nFor equity securities, the Company reflects changes in fair value as net gains (losses) on investments.  Interest income on all fixed maturities and dividend income on all equity securities are included as part of net investment income in the consolidated statements of operations and comprehensive income (loss).  \nShort-term investments comprise securities due to mature within one year from the date of purchase and are stated at cost, which approximates fair value.\nRealized gains or losses on sales of investments are determined on the basis of identified cost.  \nFor some non-publicly traded securities, market prices are determined through the use of pricing models that evaluate securities relative to the U.S. Treasury yield curve, taking into account the issue type, credit quality and cash flow \nF-11\nTable of Contents\ncharacteristics of each security.  For other non-publicly traded securities, investment managers’ valuation committees will estimate fair value, and in many instances, these fair values are supported with opinions from qualified independent third parties.  All fair value estimates from investment managers are reviewed by the Company for reasonableness.  For publicly traded securities, fair value is based on quoted market prices or valuation models that use observable market inputs.  When a sector of the financial markets is inactive or illiquid, the Company may use its own assumptions about future cash flows and risk-adjusted discount rates to determine fair value.\n  \nOther invested assets include limited partnerships, corporate-owned life insurance (“COLI”), rabbi trusts and other investments.  Limited partnerships are accounted for under the equity method of accounting, which can be recorded on a monthly or quarterly lag and are included within net investment income.  COLI policies are carried at policy cash surrender value and changes in the policy cash surrender value are included within net investment income.  \nCash includes cash on hand. Restricted cash is included within cash in the consolidated balance sheets and represents amounts held for the benefit of third parties that is legally or contractually restricted as to its withdrawal or usage. Amounts include cash in trust funds set up for the benefit of ceding companies.\nC.\nAllowance for Premium Receivable and Reinsurance Recoverables.\nThe Company applies the Current Expected Credit Losses methodology for estimating allowances for credit losses.  The Company evaluates the recoverability of its premiums and reinsurance recoverable balances and establishes an allowance for estimated uncollectible amounts.  \nPremiums receivable, excluding receivables for losses within a deductible and retrospectively-rated policy premiums, are primarily comprised of premiums due from policyholders/cedents.  Balances are considered past due when amounts that have been billed are not collected within contractually stipulated time periods. For these balances, the allowance is estimated based on recent historical credit loss and collection experience, adjusted for current economic conditions and reasonable and supportable forecasts, when appropriate. \nA portion of the Company's commercial lines business is written with large deductibles or under retrospectively-rated plans. Under some commercial insurance contracts with a large deductible, the Company is obligated to pay the claimant the full amount of the claim and the Company is subsequently reimbursed by the policyholder for the deductible amount. As such, the Company is subject to credit risk until reimbursement is made. Retrospectively-rated policies are policies whereby the ultimate premium is adjusted based on actual losses incurred.  Although the premium adjustment feature of a retrospectively-rated policy substantially reduces insurance risk for the Company, it presents credit risk to the Company.  The Company’s results of operations could be adversely affected if a significant portion of such policyholders failed to reimburse the Company for the deductible amount or the amount of additional premium owed under retrospectively-rated policies.  The Company manages these credit risks through credit analysis, collateral requirements and oversight.  The allowance for receivables for loss within a deductible and retrospectively-rated policy premiums is recorded within other assets in the consolidated balance sheets.  The allowance is estimated as the amount of the receivable exposed to loss multiplied by estimated factors for probability of default. The probability of default is assigned based on each policyholder's credit rating, or a rating is estimated if no external rating is available. Credit ratings are reviewed and updated at least annually.  The exposure amount is estimated net of collateral and other offsets, considering the nature of the collateral, potential future changes in collateral values and historical loss information for the type of collateral obtained.  The probability of default factors are historical corporate defaults for receivables with similar durations estimated through multiple economic cycles. Credit ratings are forward-looking and consider a variety of economic outcomes.  The Company's evaluation of the required allowance for receivables for loss within a deductible and retrospectively-rated policy premiums considers the current economic environment as well as the probability-weighted macroeconomic scenarios.\nThe Company records total credit loss expenses related to premiums receivable in other underwriting expenses and records credit loss expenses related to deductibles in incurred losses and loss adjustment expenses (“LAE”) in the Company’s consolidated statements of operations and comprehensive income (loss).\nThe allowance for uncollectible reinsurance recoverable reflects management’s best estimate of reinsurance cessions that may be uncollectible in the future due to reinsurers’ unwillingness or inability to pay. The allowance for uncollectible reinsurance recoverable includes an allowance for disputed balances. Based on this analysis, the Company may adjust the allowance for uncollectible reinsurance recoverable or charge off reinsurer balances that are determined to be uncollectible. \nF-12\nTable of Contents\nDue to the inherent uncertainties as to collection and the length of time before reinsurance recoverable become due, it is possible that future adjustments to the Company’s reinsurance recoverable, net of the allowance, could be required, which could have a material adverse effect on the Company’s consolidated results of operations or cash flows in a particular quarter or annual period.  \nThe allowance is estimated as the amount of reinsurance recoverable exposed to loss multiplied by estimated factors for the probability of default. The reinsurance recoverable exposed is the amount of reinsurance recoverable net of collateral and other offsets, considering the nature of the collateral, potential future changes in collateral values and historical loss information for the type of collateral obtained.  The probability of default factors are historical insurer and reinsurer defaults for liabilities with similar durations to the reinsured liabilities as estimated through multiple economic cycles. Credit ratings are forward-looking and consider a variety of economic outcomes. The Company's evaluation of the required allowance for reinsurance recoverable considers the current economic environment as well as macroeconomic scenarios. \nThe Company records credit loss expenses related to reinsurance recoverable in incurred losses and loss adjustment expenses in the Company’s consolidated statements of operations and comprehensive income (loss).  Write-offs of reinsurance recoverable and any related allowance are recorded in the period in which the balance is deemed uncollectible.\n \nD.\nDeferred Acquisition Costs.\nAcquisition costs, consisting principally of commissions and brokerage expenses and certain premium taxes and fees incurred at the time a contract or policy is issued and that vary with and are directly related to the Company’s reinsurance and insurance business, are deferred and amortized over the period in which the related premiums are earned.  Deferred acquisition costs are limited to their estimated realizable value by line of business based on the related unearned premiums, anticipated claims and claim expenses and anticipated investment income.\n  \nE.\nReserve for Losses and LAE.\nThe reserve for losses and LAE is based on individual case estimates and reports received from ceding companies.  A provision is included for losses and LAE incurred but not reported (“IBNR”) based on past experience.  Provisions are also included for certain potential liabilities, including those relating to asbestos and environmental (“A&E”) exposures, catastrophe exposures, COVID-19 and other exposures, for which liabilities cannot be estimated using traditional reserving techniques.  See also Note 4 of the Notes to these Consolidated Financial Statements.  The reserves are reviewed periodically and any changes in estimates are reflected in earnings in the period the adjustment is made.  The Company’s loss and LAE reserves represent management’s best estimate of the ultimate liability.  Loss and LAE reserves are presented gross of reinsurance recoverable and incurred losses and LAE are presented net of reinsurance.\nAccruals for commissions are established for reinsurance contracts that provide for the stated commission percentage to increase or decrease based on the loss experience of the contract.  Changes in estimates for such arrangements are recorded as commission expense.  Commission accruals for contracts with adjustable features are estimated based on expected loss and LAE.\nF.\nPremium Revenues.\nWritten premiums are earned ratably over the periods of the related insurance and reinsurance contracts.  Unearned premium reserves are established relative to the unexpired contract period.  For reinsurance contracts, such reserves are established based upon reports received from ceding companies or estimated using pro rata methods based on statistical data.  Reinstatement premiums represent additional premium recognized and earned at the time a loss event occurs and losses are recorded, most prevalently catastrophe related, when limits have been depleted under the original reinsurance contract and additional coverage is granted.  The recognition of reinstatement premiums is based on estimates of loss and LAE, which reflects management’s judgement.  Written and earned premiums and the related costs, which have not yet been reported to the Company, are estimated and accrued.  Premiums are net of ceded reinsurance.\nDuring 2023, the Company refined its premium estimation methodology for its risk attaching reinsurance contracts within its Reinsurance segment to continue to recognize gross written premium over the term of the treaty, albeit over a different pattern than what was previously used. The refined estimate resulted in an increase of gross written premium for the twelve months ended December 31, 2023, and has further aligned the estimation methodology across the reinsurance division globally. This change had no impact on the total written premium to be recognized over the term of the treaty.  There was no impact on net earned premium and therefore, no impact on income from continuing operations, net income or any related per-share amounts.\nF-13\nTable of Contents\nG.\nPrepaid Reinsurance Premiums.\nPrepaid reinsurance premiums represent unearned premium reserves ceded to other reinsurers.  Prepaid reinsurance premiums for any foreign reinsurers comprising more than 10% of the outstanding balance at December 31, 2024 were secured either through collateralized trust arrangements, rights of offset or letters of credit, thereby limiting the credit risk to the Company.\nH.\nIncome Taxes.\nHoldings and its wholly owned subsidiaries file a consolidated U.S. federal income tax return.  Foreign subsidiaries and branches of subsidiaries file local tax returns as required.  Group and subsidiaries not included in Holdings’ consolidated tax return file separate company U.S. federal income tax returns as required.  Deferred income taxes have been recorded to recognize the tax effect of temporary differences between the financial reporting and income tax bases of assets and liabilities, which arise because of differences between GAAP and income tax accounting rules.\nAs a result of Bermuda enacting a corporate income tax effective January 1, 2025, Group subsidiaries in Bermuda will file and pay income taxes subsequent to that date.\nAs an accounting policy, the Company has adopted the aggregate portfolio approach for releasing disproportionate income tax effects from Accumulated Other Comprehensive Income.\nI.\nForeign Currency.\nThe Company transacts business in numerous currencies through business units located around the world.  The functional currency for each business unit is determined by the local currency used for most economic activity in that area.  Movements in exchange rates related to transactions in currencies other than a business unit’s functional currency for  monetary assets and liabilities are remeasured through the consolidated statements of operations and comprehensive income (loss) in other income (expense), except for currency movements related to available for sale fixed maturities securities, which are excluded from net income (loss) and accumulated in shareholders’ equity, net of deferred taxes.\nThe business units’ functional currency financial statements are translated to the Company’s reporting currency, U.S. dollars, using the exchange rates at the end of period for the balance sheets and the average exchange rates in effect for the reporting period for the statements of operations and comprehensive income (loss).  Gains and losses resulting from translating the foreign currency financial statements, net of deferred income taxes, are excluded from net income (loss) and accumulated as a separate component of other comprehensive income (loss) in shareholders’ equity.\nJ.\nTreasury Shares.\nTreasury shares are the Company’s common shares repurchased on the open market, by the Company. The cost of treasury shares includes the purchase price of shares acquired and direct costs to acquire shares, including commissions.\n \nK.\nEarnings Per Common Share.\nBasic earnings per share are calculated by dividing net income by the weighted average number of common shares outstanding.  Diluted earnings per share reflect the potential dilution that would occur if options granted under various share-based compensation plans were exercised resulting in the issuance of common shares that would participate in the earnings of the entity.\nF-14\nTable of Contents\nNet income (loss) per common share has been computed as per below, based upon weighted average common basic and dilutive shares outstanding.\nYears Ended December 31,\n(Amounts in millions, except per share amounts)\n2024\n2023\n2022\nNet income (loss) per share:\nNumerator\nNet income (loss)\n$\n1,373\n \n$\n2,517\n \n$\n597\n \nLess:  dividends declared-common shares and unvested common shares\n(\n334\n)\n(\n288\n)\n(\n255\n)\nUndistributed earnings\n1,039\n \n2,229\n \n342\n \nPercentage allocated to common shareholders\n (1)\n98.8\n \n%\n98.8\n \n%\n98.7\n \n%\n1,027\n \n2,203\n \n337\n \nAdd:  dividends declared-common shareholders\n331\n \n285\n \n252\n \nNumerator for basic and diluted earnings per common share\n$\n1,358\n \n$\n2,488\n \n$\n589\n \nDenominator\nDenominator for basic earnings per weighted-average common shares\n42.7\n \n41.3\n \n38.8\n \nEffect of dilutive securities:\nOptions\n—\n \n—\n \n—\n \nDenominator for diluted earnings per adjusted weighted-average common shares\n42.7\n \n41.3\n \n38.8\n \nPer common share net income (loss)\nBasic\n$\n31.78\n \n$\n60.19\n \n$\n15.19\n \nDiluted\n$\n31.78\n \n$\n60.19\n \n$\n15.19\n \n(1)\nBasic weighted-average common shares outstanding\n42.7\n \n41.3\n \n38.8\n \nBasic weighted-average common shares outstanding and unvested common shares expected to vest\n43.2\n \n41.8\n \n39.3\n \nPercentage allocated to common shareholders\n98.8\n \n%\n98.8\n \n%\n98.7\n \n%\n(Some amounts may not reconcile due to rounding.)\nThere were \nno\n options outstanding as of December 31, 2024 and 2023, respectively.\nOptions granted under share-based compensation plans have all expired as of September 19, 2022.  There were \nno\n anti-diluted options outstanding as of December 31, 2023 or 2022.\nL.\nSegmentation.\nThe Company, through its subsidiaries, conducts business through \ntwo\n reportable segments: Reinsurance and Insurance.  During the fourth quarter of 2024, the Company revised the classification and presentation of certain run-off business, previously included within the Reinsurance and Insurance reportable segments, as part of a new operating segment called \"Other\".  The new Other segment includes the results of our sports and leisure business sold in October 2024, consisting of policies written prior to the sale and polices renewed and certain new business written on the Company’s paper post-sale. It also includes run-off A&E exposures, certain discontinued insurance programs primarily written prior to 2012 and certain discontinued insurance and reinsurance coverage classes.  The Other segment does not generally sell insurance or reinsurance products but is responsible for the management of existing policies and settlement of related losses.  Additionally, during the fourth quarter of 2023, the Company revised the classification and presentation of certain products related to its accident and health business within the reportable segment groupings. These products have been realigned from within the Reinsurance segment to the Insurance segment to appropriately reflect how the business segments are now managed due to changes in management beginning in the fourth quarter of 2023.  These segment presentation changes have been reflected retrospectively.\n  See also Note 6 of the Notes to these Consolidated Financial Statements.  \nM.\nShare-Based Compensation.\nShare-based compensation stock option, restricted share and performance share unit awards are fair valued at the grant date and expensed over the vesting period of the award.  The tax benefit on the recorded expense is deferred until the \nF-15\nTable of Contents\ntime the award is exercised or vests (becomes unrestricted).\n  See Note 14 of the Notes to these Consolidated Financial Statements.\nN.\nRecent Accounting Pronouncements.\nAdoption of New Accounting Standards\nOn November 27, 2023, the Financial Accounting Standards Board (“FASB”) issued Accounting Standard Update No. 2023-07, \nSegment Reporting—Improvements to Reportable Segment Disclosures\n, which requires enhanced disclosures related to a public entity’s reportable segments. The Company adopted the accounting standard effective year end 2024. Adoption of the standard did not have a material impact on the Company’s consolidated financial statements. The Company did not adopt any other new accounting standards that had a material impact in 2024. \nFuture Adoption of Recently Issued Accounting Standards\nThe Company assessed the adoption impacts of recently issued accounting standards that are effective after 2024 by the FASB on the Company’s consolidated financial statements. Additionally, the Company assessed whether there have been material updates to previously issued accounting standards that are effective after 2024.  There were no accounting standards identified, other than those directly referenced below, that are expected to have a material impact to Group.\nImprovements to Income Tax Disclosures. \nIn\n \nDecember 2023, the FASB issued Accounting Standard Update No. 2023-09, which requires expanded income tax disclosures, including the disaggregation of existing disclosures related to the tax rate reconciliation and income taxes paid. The guidance is effective for annual periods beginning after December 15, 2024. Prospective application is required, with retrospective application permitted. The Company is currently evaluating the effect the updated guidance will have on the Company's financial statement disclosures.\nDisaggregation of Income Statement Expenses.  \nIn November 2024, the FASB issued Accounting Standard Update No. 2024-03, which requires additional disclosure about specific expense categories included in the income statement. The guidance is effective for annual reporting periods beginning after December 15, 2026 and interim reporting periods beginning after December 15, 2027.  Prospective application is required, with retrospective application permitted. The Company is currently evaluating the effect the updated guidance will have on the Company's financial statement disclosures.\n2.    \nINVESTMENTS\nThe tables below present the amortized cost, allowance for credit losses, gross unrealized appreciation/(depreciation) (“URA(D)”) and fair value of fixed maturity securities - available for sale for the periods indicated: \nAt December 31, 2024\n(Dollars in millions)\nAmortized\nCost\nAllowance for\nCredit Losses\nUnrealized\nAppreciation\nUnrealized\nDepreciation\nFair\nValue\nFixed maturity securities - available for sale\nU.S. Treasury securities and obligations of \nU.S. government agencies and corporations\n$\n688\n \n$\n—\n \n$\n5\n \n$\n(\n24\n)\n$\n669\n \nObligations of U.S. states and political subdivisions\n75\n \n—\n \n—\n \n(\n5\n)\n70\n \nCorporate securities\n7,288\n \n(\n35\n)\n57\n \n(\n299\n)\n7,010\n \nAsset-backed securities\n5,994\n \n—\n \n28\n \n(\n39\n)\n5,982\n \nMortgage-backed securities\nCommercial\n965\n \n—\n \n1\n \n(\n66\n)\n900\n \nAgency residential\n5,205\n \n—\n \n13\n \n(\n287\n)\n4,931\n \nNon-agency residential\n1,291\n \n—\n \n9\n \n(\n11\n)\n1,289\n \nForeign government securities\n2,330\n \n—\n \n13\n \n(\n147\n)\n2,196\n \nForeign corporate securities\n6,099\n \n—\n \n42\n \n(\n279\n)\n5,861\n \nTotal fixed maturity securities - available for sale\n$\n29,934\n \n$\n(\n36\n)\n$\n167\n \n$\n(\n1,157\n)\n$\n28,908\n \n(Some amounts may not reconcile due to rounding.)\nF-16\nTable of Contents\nAt December 31, 2023\n(Dollars in millions)\nAmortized\nCost\nAllowance for\nCredit Losses\nUnrealized\nAppreciation\nUnrealized\nDepreciation\nFair\nValue\nFixed maturity securities - available for sale\nU.S. Treasury securities and obligations of \nU.S. government agencies and corporations\n$\n1,045\n \n$\n—\n \n$\n3\n \n$\n(\n52\n)\n$\n996\n \nObligations of U.S. states and political subdivisions\n138\n \n—\n \n1\n \n(\n11\n)\n128\n \nCorporate securities\n7,587\n \n(\n47\n)\n135\n \n(\n322\n)\n7,353\n \nAsset-backed securities\n5,644\n \n—\n \n25\n \n(\n51\n)\n5,618\n \nMortgage-backed securities\nCommercial\n1,091\n \n—\n \n1\n \n(\n92\n)\n1,000\n \nAgency residential\n4,869\n \n—\n \n55\n \n(\n229\n)\n4,695\n \nNon-agency residential\n431\n \n—\n \n14\n \n(\n2\n)\n443\n \nForeign government securities\n2,042\n \n—\n \n33\n \n(\n108\n)\n1,967\n \nForeign corporate securities\n5,720\n \n(\n1\n)\n92\n \n(\n271\n)\n5,540\n \nTotal fixed maturity securities - available for sale\n$\n28,568\n \n$\n(\n48\n)\n$\n358\n \n$\n(\n1,137\n)\n$\n27,740\n \n(Some amounts may not reconcile due to rounding.)\nThe following tables show amortized cost, allowance for credit losses, gross URA(D) and fair value of fixed maturity securities - held to maturity for the periods indicated:\nAt December 31, 2024\n(Dollars in millions)\nAmortized\nCost\nAllowance for\nCredit Losses\nUnrealized\nAppreciation\nUnrealized\nDepreciation\nFair\nValue\nFixed maturity securities - held to maturity\nCorporate securities\n$\n177\n \n$\n(\n2\n)\n$\n5\n \n$\n(\n4\n)\n$\n175\n \nAsset-backed securities\n484\n \n(\n4\n)\n5\n \n(\n8\n)\n477\n \nMortgage-backed securities\nCommercial\n21\n \n—\n \n—\n \n—\n \n21\n \nForeign corporate securities\n84\n \n(\n1\n)\n4\n \n—\n \n86\n \nTotal fixed maturity securities - held to maturity\n$\n765\n \n$\n(\n8\n)\n$\n14\n \n$\n(\n12\n)\n$\n759\n \n(Some amounts may not reconcile due to rounding.)\nAt December 31, 2023\n(Dollars in millions)\nAmortized\nCost\nAllowance for\nCredit Losses\nUnrealized\nAppreciation\nUnrealized\nDepreciation\nFair\nValue\nFixed maturity securities - held to maturity\nCorporate securities\n$\n150\n \n$\n(\n2\n)\n$\n1\n \n$\n(\n3\n)\n$\n146\n \nAsset-backed securities\n609\n \n(\n5\n)\n4\n \n(\n10\n)\n597\n \nMortgage-backed securities\nCommercial\n21\n \n—\n \n—\n \n—\n \n21\n \nForeign corporate securities\n84\n \n(\n1\n)\n7\n \n—\n \n90\n \nTotal fixed maturity securities - held to maturity\n$\n864\n \n$\n(\n8\n)\n$\n12\n \n$\n(\n13\n)\n$\n854\n \n(Some amounts may not reconcile due to rounding.)\nF-17\nTable of Contents\nThe amortized cost and fair value of fixed maturity securities - available for sale are shown in the following table by contractual maturity.  As the stated maturity of such securities may not be indicative of actual maturities, the totals for mortgage-backed and asset-backed securities are shown separately.  \nAt December 31, 2024\nAt December 31, 2023\n(Dollars in millions)\nAmortized\nCost\nFair\nValue\nAmortized\nCost\nFair\nValue\nFixed maturity securities - available for sale\nDue in one year or less\n$\n1,116\n \n$\n1,080\n \n$\n1,289\n \n$\n1,261\n \nDue after one year through five years\n8,774\n \n8,480\n \n7,094\n \n6,858\n \nDue after five years through ten years\n4,764\n \n4,523\n \n5,613\n \n5,405\n \nDue after ten years\n1,826\n \n1,723\n \n2,537\n \n2,460\n \nAsset-backed securities\n5,994\n \n5,982\n \n5,644\n \n5,618\n \nMortgage-backed securities\nCommercial\n965\n \n900\n \n1,091\n \n1,000\n \nAgency residential\n5,205\n \n4,931\n \n4,869\n \n4,695\n \nNon-agency residential\n1,291\n \n1,289\n \n431\n \n443\n \nTotal fixed maturity securities -available for sale\n$\n29,934\n \n$\n28,908\n \n$\n28,568\n \n$\n27,740\n \n(Some amounts may not reconcile due to rounding.)\nThe amortized cost and fair value of fixed maturity securities - held to maturity are shown in the following table by contractual maturity.  As the stated maturity of such securities may not be indicative of actual maturities, the totals for mortgage-backed and asset-backed securities are shown separately.\nAt December 31, 2024\nAt December 31, 2023\n(Dollars in millions)\nAmortized\nCost\nFair\nValue\nAmortized\nCost\nFair\nValue\nFixed maturity securities - held to maturity\nDue in one year or less\n$\n7\n \n$\n7\n \n$\n5\n \n$\n5\n \nDue after one year through five years\n67\n \n67\n \n59\n \n58\n \nDue after five years through ten years\n37\n \n35\n \n43\n \n42\n \nDue after ten years\n150\n \n152\n \n127\n \n131\n \nAsset-backed securities\n484\n \n477\n \n609\n \n597\n \nMortgage-backed securities\nCommercial\n21\n \n21\n \n21\n \n21\n \nTotal fixed maturity securities - held to maturity\n$\n765\n \n$\n759\n \n$\n864\n \n$\n854\n \n(Some amounts may not reconcile due to rounding.)\nDuring 2022, the Company re-designated a portion of its fixed maturity securities from its fixed maturity - available for sale portfolio to its fixed maturity - held to maturity portfolio.  The fair value of the securities reclassified at the date of transfer was $\n722\n million, net of allowance for current expected credit losses, which was subsequently recognized as the new amortized cost basis.  As of December 31, 2024, $\n34\n million of unrealized loss from the date of the re-designation remained in accumulated other comprehensive income on the balance sheet and will be amortized into income through an adjustment to the yields of the underlying securities over the remaining life of the securities.  The fair values of these securities incorporate the use of significant unobservable inputs and therefore are classified as Level 3 within the fair value hierarchy.\nF-18\nTable of Contents\nThe changes in net URA(D) for the Company’s investments are as follows:\nYears Ended December 31,\n(Dollars in millions)\n2024\n2023\nIncrease (decrease) during the period between the fair value and cost\nof investments carried at fair value, and deferred taxes thereon:\nFixed maturity securities - available for sale and short-term investments\n$\n(\n203\n)\n$\n1,129\n \nEquity method investments\n18\n \n—\n \nChange in URA(D), pre-tax\n(\n185\n)\n1,129\n \nDeferred tax benefit (expense)\n76\n \n(\n142\n)\nChange in URA(D), net of deferred taxes, included in shareholders’ equity\n$\n(\n109\n)\n$\n986\n \n(Some amounts may not reconcile due to rounding.)\nThe tables below display the aggregate fair value and gross unrealized depreciation of fixed maturity securities - available for sale by security type and contractual maturity, in each case subdivided according to length of time that the individual securities had been in a continuous unrealized loss position for the periods indicated:\nDuration of Unrealized Loss at December 31, 2024 by Security Type\nLess than 12 months\nGreater than 12 months\nTotal\n(Dollars in millions)\nFair Value\nGross\nUnrealized\nDepreciation\nFair Value\nGross\nUnrealized\nDepreciation\nFair Value\nGross\nUnrealized\nDepreciation\nFixed maturity securities - available for sale\nU.S. Treasury securities and obligations of \nU.S. government agencies and corporations\n$\n80\n \n$\n(\n1\n)\n$\n398\n \n$\n(\n23\n)\n$\n478\n \n$\n(\n24\n)\nObligations of U.S. states and political subdivisions\n9\n \n—\n \n40\n \n(\n5\n)\n48\n \n(\n5\n)\nCorporate securities\n2,744\n \n(\n76\n)\n2,132\n \n(\n221\n)\n4,876\n \n(\n297\n)\nAsset-backed securities\n958\n \n(\n20\n)\n537\n \n(\n19\n)\n1,495\n \n(\n39\n)\nMortgage-backed securities\nCommercial\n53\n \n(\n3\n)\n757\n \n(\n63\n)\n810\n \n(\n66\n)\nAgency residential\n2,754\n \n(\n115\n)\n1,226\n \n(\n172\n)\n3,980\n \n(\n287\n)\nNon-agency residential\n654\n \n(\n11\n)\n25\n \n—\n \n678\n \n(\n11\n)\nForeign government securities\n851\n \n(\n35\n)\n828\n \n(\n112\n)\n1,679\n \n(\n147\n)\nForeign corporate securities\n2,484\n \n(\n61\n)\n1,785\n \n(\n218\n)\n4,269\n \n(\n279\n)\nTotal\n$\n10,587\n \n$\n(\n323\n)\n$\n7,728\n \n$\n(\n833\n)\n$\n18,315\n \n$\n(\n1,156\n)\nSecurities where an allowance for credit loss was recorded\n17\n \n(\n1\n)\n—\n \n—\n \n17\n \n(\n1\n)\nTotal fixed maturity securities - available for sale\n$\n10,604\n \n$\n(\n324\n)\n$\n7,728\n \n$\n(\n833\n)\n$\n18,332\n \n$\n(\n1,157\n)\n(Some amounts may not reconcile due to rounding.)\nDuration of Unrealized Loss at December 31, 2024 by Maturity\nLess than 12 months\nGreater than 12 months\nTotal\n(Dollars in millions)\nFair Value\nGross\nUnrealized\nDepreciation\nFair Value\nGross\nUnrealized\nDepreciation\nFair Value\nGross\nUnrealized\nDepreciation\nFixed maturity securities - available for sale\nDue in one year or less\n$\n138\n \n$\n(\n5\n)\n$\n544\n \n$\n(\n34\n)\n$\n682\n \n$\n(\n39\n)\nDue in one year through five years\n3,503\n \n(\n87\n)\n2,770\n \n(\n249\n)\n6,273\n \n(\n335\n)\nDue in five years through ten years\n1,850\n \n(\n50\n)\n1,382\n \n(\n220\n)\n3,232\n \n(\n271\n)\nDue after ten years\n677\n \n(\n32\n)\n487\n \n(\n76\n)\n1,164\n \n(\n107\n)\nAsset-backed securities\n958\n \n(\n20\n)\n537\n \n(\n19\n)\n1,495\n \n(\n39\n)\nMortgage-backed securities\n3,461\n \n(\n129\n)\n2,008\n \n(\n235\n)\n5,469\n \n(\n364\n)\nTotal\n$\n10,587\n \n$\n(\n323\n)\n$\n7,728\n \n$\n(\n833\n)\n$\n18,315\n \n$\n(\n1,156\n)\nSecurities where an allowance for credit loss was recorded\n17\n \n(\n1\n)\n—\n \n—\n \n17\n \n(\n1\n)\nTotal fixed maturity securities - available for sale\n$\n10,604\n \n$\n(\n324\n)\n$\n7,728\n \n$\n(\n833\n)\n$\n18,332\n \n$\n(\n1,157\n)\n(Some amounts may not reconcile due to rounding.)\nThe aggregate fair value and gross unrealized losses related to fixed maturity securities - available for sale in an unrealized loss position at December 31, 2024 were $\n18.3\n billion and $\n1.2\n billion, respectively.  The fair value of securities \nF-19\nTable of Contents\nfor the single issuer (the U.S. government) whose securities comprised the largest unrealized loss position at December 31, 2024, amounted to less than \n1.6\n% of the overall fair value of the Company’s fixed maturity securities - available for sale.  The fair value of the securities for the issuer with the second largest unrealized loss position at December 31, 2024 comprised less than \n0.9\n% of the Company’s fixed maturity securities - available for sale.  In addition, as indicated on the above table, there was no significant concentration of unrealized losses in any one market sector.  The $\n324\n million of unrealized losses related to fixed maturity securities - available for sale that have been in an unrealized loss position for less than one year were generally comprised of domestic and foreign corporate securities, asset-backed securities, agency residential mortgage-backed securities and foreign government securities.  Of these unrealized losses, $\n319\n million were related to securities that were rated investment grade by at least one nationally recognized rating agency.  The $\n833\n million of unrealized losses related to fixed maturity securities - available for sale in an unrealized loss position for more than one year related primarily to domestic and foreign corporate securities, agency residential mortgage-backed securities and foreign government securities.  Of these unrealized losses, $\n810\n million were related to securities that were rated investment grade by at least one nationally recognized rating agency.  In all instances, there were no projected cash flow shortfalls to recover the full book value of the investments and the related interest obligations.  The mortgage-backed securities still have excess credit coverage and are current on interest and principal payments.  Based upon the Company’s current evaluation of securities in an unrealized loss position as of December 31, 2024, the unrealized losses are due to changes in interest rates and non-issuer-specific credit spreads and are not credit-related.  In addition, the contractual terms of these securities do not permit these securities to be settled at a price less than their amortized cost.\nThe tables below display the aggregate fair value and gross unrealized depreciation of fixed maturity securities - available for sale by security type and contractual maturity, in each case subdivided according to length of time that the individual securities had been in a continuous unrealized loss position for the periods indicated:\nDuration of Unrealized Loss at December 31, 2023 by Security Type\nLess than 12 months\nGreater than 12 months\nTotal\n(Dollars in millions)\nFair Value\nGross\nUnrealized\nDepreciation\nFair Value\nGross\nUnrealized\nDepreciation\nFair Value\nGross\nUnrealized\nDepreciation\nFixed maturity securities - available for sale\nU.S. Treasury securities and obligations of\nU.S. government agencies and corporations\n$\n122\n \n$\n(\n3\n)\n$\n772\n \n$\n(\n49\n)\n$\n893\n \n$\n(\n52\n)\nObligations of U.S. states and political subdivisions\n3\n \n—\n \n74\n \n(\n11\n)\n77\n \n(\n11\n)\nCorporate securities\n1,019\n \n(\n58\n)\n2,780\n \n(\n263\n)\n3,799\n \n(\n321\n)\nAsset-backed securities\n196\n \n(\n2\n)\n2,014\n \n(\n49\n)\n2,210\n \n(\n51\n)\nMortgage-backed securities\nCommercial\n181\n \n(\n19\n)\n742\n \n(\n73\n)\n923\n \n(\n92\n)\nAgency residential\n423\n \n(\n4\n)\n2,126\n \n(\n225\n)\n2,549\n \n(\n229\n)\nNon-agency residential\n126\n \n(\n1\n)\n4\n \n—\n \n130\n \n—\n \nForeign government securities\n172\n \n(\n7\n)\n985\n \n(\n101\n)\n1,156\n \n(\n108\n)\nForeign corporate securities\n324\n \n(\n6\n)\n2,726\n \n(\n265\n)\n3,050\n \n(\n271\n)\nTotal\n$\n2,564\n \n$\n(\n101\n)\n$\n12,222\n \n$\n(\n1,035\n)\n$\n14,787\n \n$\n(\n1,136\n)\nSecurities where an allowance for credit loss was recorded\n2\n \n(\n1\n)\n—\n \n—\n \n2\n \n(\n1\n)\nTotal fixed maturity securities - available for sale\n$\n2,566\n \n$\n(\n102\n)\n$\n12,222\n \n$\n(\n1,035\n)\n$\n14,789\n \n$\n(\n1,137\n)\n(Some amounts may not reconcile due to rounding.)\nF-20\nTable of Contents\nDuration of Unrealized Loss at December 31, 2023 by Maturity\nLess than 12 months\nGreater than 12 months\nTotal\n(Dollars in millions)\nFair Value\nGross\nUnrealized\nDepreciation\nFair Value\nGross\nUnrealized\nDepreciation\nFair Value\nGross\nUnrealized\nDepreciation\nFixed maturity securities - available for sale\nDue in one year or less\n$\n184\n \n$\n(\n3\n)\n$\n773\n \n$\n(\n30\n)\n$\n958\n \n$\n(\n33\n)\nDue in one year through five years\n699\n \n(\n18\n)\n3,841\n \n(\n271\n)\n4,540\n \n(\n289\n)\nDue in five years through ten years\n328\n \n(\n15\n)\n2,306\n \n(\n310\n)\n2,633\n \n(\n325\n)\nDue after ten years\n429\n \n(\n39\n)\n417\n \n(\n77\n)\n845\n \n(\n116\n)\nAsset-backed securities\n196\n \n(\n2\n)\n2,014\n \n(\n49\n)\n2,210\n \n(\n51\n)\nMortgage-backed securities\n729\n \n(\n24\n)\n2,872\n \n(\n298\n)\n3,601\n \n(\n323\n)\nTotal\n$\n2,564\n \n$\n(\n101\n)\n$\n12,222\n \n$\n(\n1,035\n)\n$\n14,787\n \n$\n(\n1,136\n)\nSecurities where an allowance for credit loss was recorded\n2\n \n(\n1\n)\n—\n \n—\n \n2\n \n(\n1\n)\nTotal fixed maturity securities - available for sale\n$\n2,566\n \n$\n(\n102\n)\n$\n12,222\n \n$\n(\n1,035\n)\n$\n14,789\n \n$\n(\n1,137\n)\n(Some amounts may not reconcile due to rounding.)\nThe aggregate fair value and gross unrealized losses related to fixed maturity securities - available for sale in an unrealized loss position at December 31, 2023 were $\n14.8\n billion and $\n1.1\n billion, respectively.  The fair value of securities for the single issuer (the U.S. government) whose securities comprised the largest unrealized loss position at December 31, 2023, amounted to less than \n3.0\n% of the overall fair value of the Company’s fixed maturity securities - available for sale.  The fair value of the securities for the issuer with the second largest unrealized loss comprised less than \n0.7\n% of the Company’s fixed maturity securities - available for sale.  In addition, as indicated on the above table, there was no significant concentration of unrealized losses in any one market sector.  The $\n102\n million of unrealized losses related to fixed maturity securities - available for sale that have been in an unrealized loss position for less than one year were generally comprised of domestic and foreign corporate securities, asset-backed securities, agency residential mortgage-backed securities and foreign government securities.  Of these unrealized losses, $\n86\n million were related to securities that were rated investment grade by at least one nationally recognized rating agency.  The $\n1.0\n billion of unrealized losses related to fixed maturity securities - available for sale in an unrealized loss position for more than one year related primarily to domestic and foreign corporate securities, agency residential mortgage-backed securities and foreign government securities.  Of these unrealized losses, $\n1.0\n billion were related to securities that were rated investment grade by at least one nationally recognized rating agency.  In all instances, there were no projected cash flow shortfalls to recover the full book value of the investments and the related interest obligations.  The mortgage-backed securities still have excess credit coverage and are current on interest and principal payments.  \nThe components of net investment income are presented in the table below for the periods indicated:\nYears Ended December 31,\n(Dollars in millions)\n2024\n2023\n2022\nFixed maturities\n$\n1,481\n \n$\n1,153\n \n$\n742\n \nEquity securities\n3\n \n3\n \n16\n \nShort-term investments and cash\n195\n \n140\n \n28\n \nOther invested assets\nLimited partnerships\n206\n \n122\n \n75\n \nOther\n104\n \n59\n \n29\n \nGross investment income before adjustments\n1,989\n \n1,477\n \n890\n \nFunds held interest income (expense)\n26\n \n10\n \n2\n \nFuture policy benefit reserve income (expense)\n(\n1\n)\n(\n1\n)\n—\n \nGross investment income\n2,013\n \n1,486\n \n892\n \nInvestment expenses\n59\n \n53\n \n62\n \nNet investment income\n$\n1,954\n \n$\n1,434\n \n$\n830\n \n(Some amounts may not reconcile due to rounding.)\nThe Company records results from limited partnership investments on the equity method of accounting with changes in value reported through net investment income.  The net investment income from limited partnerships is dependent upon the Company’s share of the net asset values (“NAV”) of interests underlying each limited partnership.  Due to the timing of receiving financial information from these partnerships, the results are generally reported on a one month or quarter \nF-21\nTable of Contents\nlag.  If the Company determines there has been a significant decline in value of a limited partnership during this lag period, a loss will be recorded in the period in which the Company identifies the decline.  \nThe Company had contractual commitments to invest up to an additional $\n3.3\n billion in limited partnerships and private placement loan securities at December 31, 2024.  These commitments will be funded when called in accordance with the partnership and loan agreements, which have investment periods that expire, unless extended, through 2034.\nIn 2022, the Company entered into COLI policies, which are invested in\n private debt and private equity securities. \nThe COLI policies are carried within other invested assets at the policy cash surrender value of $\n1.7\n billion  and  $\n1.3\n billion as of December 31, 2024 and December 31, 2023, respectively.  \nVariable Interest Entities\nThe Company is engaged with various special purpose entities and other entities that are deemed to be VIEs primarily as an investor through normal investment activities but also as an investment manager.  A VIE is an entity that either has investors that lack certain essential characteristics of a controlling financial interest, such as simple majority kick-out rights, or lacks sufficient funds to finance its own activities without financial support provided by other entities.  The Company performs ongoing qualitative assessments of its VIEs to determine whether the Company has a controlling financial interest in the VIE and therefore is the primary beneficiary.  The Company is deemed to have a controlling financial interest when it has both the ability to direct the activities that most significantly impact the economic performance of the VIE and the obligation to absorb losses or the right to receive benefits from the VIE that could potentially be significant to the VIE.  Based on the Company’s assessment, if it determines it is the primary beneficiary, the Company consolidates the VIE in the Company’s consolidated financial statements.  As of December 31, 2024 and 2023, the Company did \nnot\n hold any securities for which it is the primary beneficiary.\nThe Company, through normal investment activities, makes passive investments in general and limited partnerships and other alternative investments. For these non-consolidated VIEs, the Company has determined it is not the primary beneficiary as it has no ability to direct activities that could significantly affect the economic performance of the investments.  The Company’s maximum exposure to loss as of December 31, 2024 and 2023 is limited to the total carrying value of $\n5.4\n billion and $\n4.8\n billion, respectively, which are included in general and limited partnerships, COLI policies and other alternative investments in other invested assets in the Company's consolidated balance sheets.  Exposure relating specifically to general and limited partnerships as of December 31, 2024 and December 31, 2023 is limited to the total carrying value of $\n3.6\n billion and $\n3.4\n billion.  \nAs of December 31, 2024, the Company has outstanding commitments totaling $\n2.0\n billion whereby the Company is committed to fund these investments and may be called by the partnership during the commitment period to fund the purchase of new investments and partnership expenses.  These investments are generally of a passive nature in that the Company does not take an active role in management.\nIn addition, the Company makes passive investments in structured securities issued by VIEs for which the Company is not the manager.  These investments are included in asset-backed securities, which includes collateralized loan obligations and are classified as fixed maturities - available for sale.  The Company has not provided financial or other support with respect to these investments other than its original investment.  For these investments, the Company determined it is not the primary beneficiary due to the relative size of the Company’s investment in comparison to the principal amount of the structured securities issued by the VIEs, the level of credit subordination which reduces the Company’s obligation to absorb losses or right to receive benefits or the Company’s inability to direct the activities that most significantly impact the economic performance of the VIEs.  The Company’s maximum exposure to loss on these investments is limited to the amount of the Company’s investment.\nF-22\nTable of Contents\nThe components of net gains (losses) on investments are presented in the table below for the periods indicated:\nYears Ended December 31,\n(Dollars in millions)\n2024\n2023\n2022\nFixed maturity securities\nAllowance for credit losses\n$\n13\n \n$\n7\n \n$\n(\n33\n)\nNet realized gains (losses) from dispositions\n6\n \n(\n292\n)\n(\n87\n)\nEquity securities, fair value\nNet realized gains (losses) from dispositions\n1\n \n8\n \n112\n \nGains (losses) from fair value adjustments\n(\n1\n)\n—\n \n(\n460\n)\nOther invested assets\n(\n1\n)\n—\n \n13\n \nShort-term investments gain (loss)\n1\n \n—\n \n—\n \nTotal net gains (losses) on investments\n$\n19\n \n$\n(\n276\n)\n$\n(\n455\n)\n(Some amounts may not reconcile due to rounding.)\nThe following tables provide a roll forward of the Company’s beginning and ending balance of allowance for credit losses for the periods indicated:  \nRoll Forward of Allowance for Credit Losses - Fixed Maturities - Available for Sale\nTwelve Months Ended December 31, 2024\nCorporate\nSecurities\nForeign\nCorporate\nSecurities\nTotal\n(Dollars in millions)\nBeginning balance\n$\n(\n47\n)\n$\n(\n1\n)\n$\n(\n48\n)\nCredit losses on securities where credit losses were not previously recorded\n(\n9\n)\n—\n \n(\n9\n)\nIncreases in allowance on previously impaired securities\n—\n \n—\n \n—\n \nDecreases in allowance on previously impaired securities\n—\n \n—\n \n—\n \nReduction in allowance due to disposals\n20\n \n1\n \n21\n \nBalance, end of period\n$\n(\n35\n)\n$\n—\n \n$\n(\n36\n)\n(Some amounts may not reconcile due to rounding.)\nRoll Forward of Allowance for Credit Losses - Fixed Maturities - Available for Sale\nTwelve Months Ended December 31, 2023\nCorporate\nSecurities\nForeign\nCorporate\nSecurities\nTotal\n(Dollars in millions)\nBeginning balance\n$\n(\n45\n)\n$\n(\n10\n)\n$\n(\n54\n)\nCredit losses on securities where credit losses were not previously recorded\n(\n23\n)\n—\n \n(\n24\n)\nIncreases in allowance on previously impaired securities\n(\n1\n)\n—\n \n(\n1\n)\nDecreases in allowance on previously impaired securities\n—\n \n—\n \n—\n \nReduction in allowance due to disposals\n22\n \n8\n \n30\n \nBalance, end of period\n$\n(\n47\n)\n$\n(\n1\n)\n$\n(\n48\n)\n(Some amounts may not reconcile due to rounding.)\nF-23\nTable of Contents\nRoll Forward of Allowance for Credit Losses - Fixed Maturities - Held to Maturity\nTwelve Months Ended December 31, 2024\nCorporate\nSecurities\nAsset-Backed\nSecurities\nForeign\nCorporate\nSecurities\nTotal\n(Dollars in millions)\nBeginning balance\n$\n(\n2\n)\n$\n(\n5\n)\n$\n(\n1\n)\n$\n(\n8\n)\nCredit losses on securities where credit losses were not previously recorded\n—\n \n—\n \n(\n1\n)\n(\n1\n)\nIncreases in allowance on previously impaired securities\n—\n \n—\n \n—\n \n—\n \nDecreases in allowance on previously impaired securities\n—\n \n—\n \n—\n \n—\n \nReduction in allowance due to disposals\n—\n \n1\n \n—\n \n1\n \nBalance, end of period\n$\n(\n2\n)\n$\n(\n4\n)\n$\n(\n1\n)\n$\n(\n8\n)\n(Some amounts may not reconcile due to rounding.)\nRoll Forward of Allowance for Credit Losses - Fixed Maturities - Held to Maturity\nTwelve Months Ended December 31, 2023\nCorporate\nSecurities\nAsset-Backed\nSecurities\nForeign\nCorporate\nSecurities\nTotal\n(Dollars in millions)\nBeginning balance\n$\n(\n2\n)\n$\n(\n6\n)\n$\n(\n1\n)\n$\n(\n9\n)\nCredit losses on securities where credit losses were not previously recorded\n—\n \n—\n \n—\n \n—\n \nIncreases in allowance on previously impaired securities\n—\n \n—\n \n—\n \n—\n \nDecreases in allowance on previously impaired securities\nReduction in allowance due to disposals\n—\n \n1\n \n—\n \n1\n \nBalance, end of period\n$\n(\n2\n)\n$\n(\n5\n)\n$\n(\n1\n)\n$\n(\n8\n)\n(Some amounts may not reconcile due to rounding.)\nThe proceeds and split between gross gains and losses, from sales of fixed maturity securities - available for sale and equity securities, are presented in the table below for the periods indicated:  \nYears Ended December 31,\n(Dollars in millions)\n2024\n2023\n2022\nProceeds from sales of fixed maturity securities - available for sale\n$\n6,257\n \n$\n3,849\n \n$\n1,403\n \nGross gains from sales\n166\n \n35\n \n40\n \nGross losses from sales\n(\n160\n)\n(\n327\n)\n(\n127\n)\nProceeds from sales of equity securities\n$\n37\n \n$\n126\n \n$\n2,217\n \nGross gains from sales\n2\n \n8\n \n165\n \nGross losses from sales\n(\n1\n)\n—\n \n(\n53\n)\nSecurities with a carrying value amount of $\n1.4\n billion at December 31, 2024 were on deposit with or regulated by various state or governmental insurance departments in compliance with insurance laws.  See Note 10 of the Notes to these Consolidated Financial Statements.\n3.    \nFAIR VALUE\nGAAP guidance regarding fair value measurements addresses how companies should measure fair value when they are required to use fair value measures for recognition or disclosure purposes under GAAP and provides a common definition of fair value to be used throughout GAAP.  It defines fair value as the price that would be received to sell an asset or paid to transfer a liability in an orderly fashion between market participants at the measurement date.  In addition, it establishes a three-level valuation hierarchy for the disclosure of fair value measurements.  The valuation hierarchy is based on the transparency of inputs to the valuation of an asset or liability.  The level in the hierarchy within which a \nF-24\nTable of Contents\ngiven fair value measurement falls is determined based on the lowest level input that is significant to the measurement, with Level 1 being the highest priority and Level 3 being the lowest priority.  \nThe levels in the hierarchy are defined as follows:\nLevel 1:\nInputs to the valuation methodology are observable inputs that reflect unadjusted quoted prices for identical assets or liabilities in an active market;\nLevel 2:\nInputs to the valuation methodology include quoted prices for similar assets and liabilities in active markets, and inputs that are observable for the asset or liability, either directly or indirectly, for substantially the full term of the financial instrument;\nLevel 3:\nInputs to the valuation methodology are unobservable and significant to the fair value measurement.\nThe Company’s fixed maturity and equity securities are managed both internally and on an external basis by independent, professional investment managers using portfolio guidelines approved by the Company.  The Company obtains prices from nationally recognized pricing services.  These services seek to utilize market data and observations in their evaluation process.  These services use pricing applications that vary by asset class and incorporate available market information. When fixed maturity securities do not trade on a daily basis, the services will apply available information through processes such as benchmark curves, benchmarking of like securities, sector groupings and matrix pricing.  In addition, they use model processes, such as the Option Adjusted Spread model to develop prepayment and interest rate scenarios for securities that have prepayment features.\nThe Company does not make any changes to prices received from the pricing services.  In addition, the Company has procedures in place to review the reasonableness of the prices from the service providers and may request verification of the prices.  The Company also continually performs quantitative and qualitative analysis of prices, including but not limited to initial and ongoing review of pricing methodologies, review of prices obtained from pricing services and third-party investment asset managers, review of pricing statistics and trends and comparison of prices for certain securities with a secondary price source for reasonableness.  No material variances were noted during these price validation procedures.  In limited situations, where financial markets are inactive or illiquid, the Company may use its own assumptions about future cash flows and risk-adjusted discount rates to determine fair value.\nAt December 31, 2024 and 2023, $\n2.2\n billion and $\n2.0\n billion, respectively, of fixed maturities were fair valued using unobservable inputs.  The majority of these fixed maturities were valued by investment managers’ valuation committees and many of these fair values were substantiated by valuations from independent third parties.  The Company has procedures in place to evaluate these independent third-party valuations.\nEquity securities denominated in U.S. currency with quoted prices in active markets for identical assets are categorized as Level 1 since the quoted prices are directly observable.  Equity securities traded on foreign exchanges are categorized as Level 2 due to the added input of a foreign exchange conversion rate to determine fair value.  The Company uses foreign currency exchange rates published by nationally recognized sources.  \nFixed maturity securities listed in the tables have been categorized as Level 2, since a particular security may not have traded but the pricing services are able to use valuation models with observable market inputs such as interest rate yield curves and prices for similar fixed maturity securities in terms of issuer, maturity and seniority.  For foreign government securities and foreign corporate securities, the fair values provided by the third-party pricing services are in local currencies, and where applicable, are converted to U.S. dollars using currency exchange rates from nationally recognized sources.  \nIn addition, some of the fixed maturities with fair values categorized as Level 3 result when prices are not available from the nationally recognized pricing services and are obtained from investment managers and are derived using unobservable inputs. The Company will value the securities with unobservable inputs using comparable market information or receive fair values from investment managers.  The investment managers may obtain non-binding price quotes for the securities from brokers.  The single broker quotes are provided by market makers or broker-dealers who are recognized as market participants in the markets in which they are providing the quotes.  The prices received from brokers are reviewed for reasonableness by the third-party asset managers and the Company.  If the broker quotes are \nF-25\nTable of Contents\nfor foreign denominated securities, the quotes are converted to U.S. dollars using currency exchange rates from nationally recognized sources.  \nThe composition and valuation inputs for the presented fixed maturities categories Level 1 and Level 2 are as follows:\n•\nU.S. Treasury securities and obligations of U.S. government agencies and corporations are primarily comprised of U.S. Treasury bonds, and the fair value is based on observable market inputs such as quoted prices, reported trades, quoted prices for similar issuances or benchmark yields;\n•\nObligations of U.S. states and political subdivisions are comprised of state and municipal bond issuances and the fair values are based on observable market inputs such as quoted market prices, quoted prices for similar securities, benchmark yields and credit spreads;\n•\nCorporate securities are primarily comprised of U.S. corporate and public utility bond issuances and the fair values are based on observable market inputs such as quoted market prices, quoted prices for similar securities, benchmark yields and credit spreads; \n•\nAsset-backed and mortgage-backed securities fair values are based on observable inputs such as quoted prices, reported trades, quoted prices for similar issuances or benchmark yields and cash flow models using observable inputs such as prepayment speeds, collateral performance and default spreads;\n•\nForeign government securities are comprised of global non-U.S. sovereign bond issuances and the fair values are based on observable market inputs such as quoted market prices, quoted prices for similar securities and models with observable inputs such as benchmark yields and credit spreads and then, where applicable, are converted to U.S. dollars using an exchange rate from a nationally recognized source; and\n•\nForeign corporate securities are comprised of global non-U.S. corporate bond issuances and the fair values are based on observable market inputs such as quoted market prices, quoted prices for similar securities and models with observable inputs such as benchmark yields and credit spreads and then, where applicable, are converted to U.S. dollars using an exchange rate from a nationally recognized source.\nThe following tables present the fair value measurement levels for all assets and liabilities, which the Company has recorded at fair value as of the periods indicated: \nFair Value Measurement Using:\n(Dollars in millions)\nDecember 31, 2024\nQuoted Prices\nin Active\nMarkets for\nIdentical\nAssets\n(Level 1)\nSignificant\nOther\nObservable\nInputs\n(Level 2)\nSignificant\nUnobservable\nInputs\n(Level 3)\nAssets:\nFixed maturities - available for sale\nU.S. Treasury securities and obligations of\nU.S. government agencies and corporations\n$\n669\n \n$\n—\n \n$\n669\n \n$\n—\n \nObligations of U.S. States and political subdivisions\n70\n \n—\n \n70\n \n—\n \nCorporate securities\n7,010\n \n—\n \n6,492\n \n518\n \nAsset-backed securities\n5,982\n \n—\n \n4,325\n \n1,657\n \nMortgage-backed securities\nCommercial\n900\n \n—\n \n900\n \n—\n \nAgency residential\n4,931\n \n—\n \n4,931\n \n—\n \nNon-agency residential\n1,289\n \n—\n \n1,289\n \n—\n \nForeign government securities\n2,196\n \n—\n \n2,196\n \n—\n \nForeign corporate securities\n5,861\n \n—\n \n5,847\n \n14\n \nTotal fixed maturities - available for sale\n28,908\n \n—\n \n26,719\n \n2,189\n \nEquity securities, fair value\n217\n \n79\n \n133\n \n5\n \n(Some amounts may not reconcile  due to rounding.)\nF-26\nTable of Contents\nFair Value Measurement Using:\n(Dollars in millions)\nDecember 31, 2023\nQuoted Prices\nin Active\nMarkets for\nIdentical\nAssets\n(Level 1)\nSignificant\nOther\nObservable\nInputs\n(Level 2)\nSignificant\nUnobservable\nInputs\n(Level 3)\nAssets:\nFixed maturities - available for sale\nU.S. Treasury securities and obligations of\nU.S. government agencies and corporations\n$\n996\n \n$\n—\n \n$\n996\n \n$\n—\n \nObligations of U.S. States and political subdivisions\n128\n \n—\n \n128\n \n—\n \nCorporate securities\n7,353\n \n—\n \n6,681\n \n672\n \nAsset-backed securities\n5,618\n \n—\n \n4,313\n \n1,305\n \nMortgage-backed securities\nCommercial\n1,000\n \n—\n \n1,000\n \n—\n \nAgency residential\n4,695\n \n—\n \n4,695\n \n—\n \nNon-agency residential\n443\n \n—\n \n443\n \n—\n \nForeign government securities\n1,967\n \n—\n \n1,967\n \n—\n \nForeign corporate securities\n5,540\n \n—\n \n5,524\n \n16\n \nTotal fixed maturities - available for sale\n27,740\n \n—\n \n25,747\n \n1,993\n \nEquity securities, fair value\n188\n \n70\n \n118\n \n—\n \n(Some amounts may not reconcile due to rounding.)\nThe following table presents the activity under Level 3, fair value measurements using significant unobservable inputs for fixed maturities - available for sale, for the periods indicated:\nTotal Fixed Maturities -  Available for Sale\nDecember 31, 2024\nDecember 31, 2023\n(Dollars in millions)\nCorporate\nSecurities\nAsset-Backed\nSecurities\nForeign\nCorporate\nTotal\nCorporate\nSecurities\nAsset-Backed\nSecurities\nForeign\nCorporate\nTotal\nBeginning balance fixed maturities\n$\n672\n \n$\n1,305\n \n$\n16\n \n$\n1,993\n \n$\n715\n \n$\n994\n \n$\n16\n \n$\n1,725\n \nTotal gains or (losses) (realized/unrealized)\nIncluded in earnings (or changes in net assets)\n(\n1\n)\n—\n \n1\n \n—\n \n4\n \n—\n \n—\n \n4\n \nIncluded in other comprehensive income (loss)\n1\n \n12\n \n—\n \n13\n \n(\n2\n)\n6\n \n—\n \n4\n \nPurchases, issuances and settlements\n(\n154\n)\n339\n \n(\n2\n)\n183\n \n(\n45\n)\n305\n \n—\n \n260\n \nTransfers in and/or (out) of Level 3 and reclassification\nof securities in/(out) of investment categories\n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \nEnding balance\n$\n518\n \n$\n1,657\n \n$\n14\n \n$\n2,189\n \n$\n672\n \n$\n1,305\n \n$\n16\n \n$\n1,993\n \nThe amount of total gains or losses for the period \nincluded in earnings (or changes in net assets) \nattributable to the change in unrealized gains \nor losses relating to assets still held \nat the reporting date\n$\n(\n3\n)\n$\n—\n \n$\n—\n \n$\n(\n3\n)\n$\n9\n \n$\n—\n \n$\n—\n \n$\n9\n \n(Some amounts may not reconcile due to rounding.)\nThere were \nno\n transfers of assets in/(out) of Level 3 during 2024 or 2023.\nFinancial Instruments Disclosed, But Not Reported, at Fair Value\nCertain financial instruments disclosed, but not reported, at fair value are excluded from the fair value hierarchy tables above. Fair values and valuation hierarchy of fixed maturity securities - held to maturity, senior notes and long-term subordinated notes can be found within Notes 2, 8 and 9 of the Notes to these Consolidated Financial Statements, respectively. Short-term investments are stated at cost, which approximates fair value.  See Note 1 of the Notes to these Consolidated Financial Statements. \nF-27\nTable of Contents\nExempt from Fair Value Disclosure Requirements\nCertain financial instruments are exempt from the requirements for fair value disclosure, such as limited partnerships accounted for under the equity method and pension and other postretirement obligations. The Company’s investments in COLI policies are recorded at their cash surrender value and are therefore not required to be included in the tables above. See Note 1 of the Notes to these Consolidated Financial Statements for details of investments in COLI policies. \nIn addition, $\n239\n million and $\n274\n million of investments within other invested assets on the consolidated balance sheets as of December 31, 2024 and 2023, respectively, are not included within the fair value hierarchy tables, as the assets are measured at NAV as a practical expedient to determine fair value.\n4.    \nRESERVE FOR LOSSES AND LAE\nReserve for losses and LAE.\nThe following table provides a roll forward of the Company’s beginning and ending reserve for losses and LAE and is summarized for the periods indicated:\nYears Ended December 31,\n(Dollars in millions)\n2024\n2023\n2022\nGross reserves beginning of period\n$\n24,604\n \n$\n22,065\n \n$\n19,009\n \nLess reinsurance recoverables on unpaid losses\n(\n2,098\n)\n(\n2,105\n)\n(\n1,946\n)\nNet reserves beginning of period\n22,506\n \n19,960\n \n17,063\n \nIncurred related to:\nCurrent year\n9,967\n \n8,432\n \n8,102\n \nPrior years\n1,337\n \n(\n5\n)\n(\n2\n)\nTotal incurred losses and LAE\n11,305\n \n8,427\n \n8,100\n \nPaid related to:\nCurrent year\n1,258\n \n1,379\n \n1,220\n \nPrior years\n5,279\n \n4,731\n \n3,740\n \nTotal paid losses and LAE\n6,537\n \n6,110\n \n4,960\n \nForeign exchange/translation adjustment\n(\n298\n)\n229\n \n(\n243\n)\nNet reserves end of period\n26,975\n \n22,506\n \n19,960\n \nPlus reinsurance recoverables on unpaid losses\n2,915\n \n2,098\n \n2,105\n \nGross reserves end of period\n$\n29,889\n \n$\n24,604\n \n$\n22,065\n \n(Some amounts may not reconcile due to rounding.)\nCurrent year incurred losses were $\n10.0\n billion, $\n8.4\n billion and $\n8.1\n billion in 2024, 2023 and 2022, respectively.  The increase in current year incurred losses from 2023 to 2024 was primarily related to an increase of $\n1.1\n billion in current year attritional losses, resulting from the impact of the increase in premiums earned and changes in the mix of business, as well as an increase of $\n423\n million in current year catastrophe losses.\nGross and net reserves increased in 2023, reflecting an increase in underlying exposure due to premium growth, year over year and changes in the mix of business, partially offset by a decrease of $\n585\n million in 2023 current year catastrophe losses compared to 2022.  \nIncurred prior years unfavorable development in losses was $\n1.3\n billion in 2024. Incurred prior years favorable development in losses was $\n5\n million in 2023 and $\n2\n million in 2022. The net unfavorable development on prior year reserves of $\n1.3\n billion in 2024 is primarily comprised of $\n1.1\n billion of unfavorable development on prior years attritional losses for the Insurance segment, mainly driven by a combination of social inflation and portfolio concentrations in certain U.S. casualty lines and $\n403\n million of unfavorable development on prior years attritional losses for Other segment, mainly related to certain sports and leisure lines for accident years 2019 through 2023, including A&E reserve strengthening of $\n54\n million resulting in a 3-year net asbestos survival ratio of 7 years. In addition, the Reinsurance segment recorded $\n684\n million of unfavorable development on prior year casualty reserves. This unfavorable development in the Reinsurance segment was largely offset by favorable development booked on property and mortgage lines. The net favorable development on prior year reserves of $\n5\n million in 2023 is comprised of $\n401\n million of \nF-28\nTable of Contents\nfavorable development on prior years attritional losses for reinsurance lines, mainly related to mortgage and short-tail lines of business, mostly offset by $\n285\n million of unfavorable development on prior years attritional losses for insurance lines, mainly related to casualty lines for accident years from 2016 through 2019 as well as $\n110\n million of unfavorable development on prior years attritional losses for other lines.  The favorable development on prior year reserves of $\n2\n million in 2022 is primarily driven by better than expected loss emergence in workers’ compensation and surety lines of business, as well as attritional property.\nThe following is information about incurred and paid claims development as of December 31, 2024, net of reinsurance, as well as cumulative claim frequency and the total of IBNR liabilities plus expected development on reported claims included within the net incurred claims amounts.  Each of the Company’s financial reporting segments has been disaggregated into casualty and property business.  The casualty and property segregation results in groups that have homogeneous loss development characteristics and are large enough to represent credible trends.  Generally, casualty claims take longer to be reported and settled, resulting in longer payout patterns and increased volatility.  Property claims on the other hand, tend to be reported and settled quicker and therefore tend to exhibit less volatility.  The property business is more exposed to catastrophe losses, which can result in year over year fluctuations in incurred claims depending on the frequency and severity of catastrophes claims in any one accident year.\nThe information about incurred and paid claims development for the years ended December 31, 2015 to December 31, 2023 is presented as supplementary information.\nThe Cumulative Number of Reported Claims is shown only for Insurance Casualty as it is impractical to provide the information for the remaining groups.  The reinsurance groups each include pro rata contracts for which ceding companies provide only summary information via a bordereau.  This summary information does not include the number of reported claims underlying the paid and reported losses.  Therefore, it is not possible to provide this information.  The Insurance Property group includes Accident and Health insurance business.  This business is written via a master contract and individual claim counts are not provided.  This business represents a significant enough portion of the business in the Insurance Property group so that including the number of reported claims for the remaining business would distort any analytics performed on the group.\nThe Cumulative Number of Reported Claims shown for the Insurance Casualty is determined by claim and line of business.  For example, a claim event with three claimants in the same line of business is a single claim.  However, a claim event with a single claimant that spans two lines of business contributes two claims.\nF-29\nTable of Contents\nReconciliation of the Disclosure of Incurred and Paid Claims Development to the Liability for Unpaid Claims and Claim Adjustment Expenses\nThe reconciliation of the net incurred and paid claims development tables to the liability for claims and claim adjustment expenses in the consolidated statement of financial position is as follows:\nDecember 31, 2024\n(Dollars in millions)\nNet outstanding liabilities\nReinsurance Casualty\n$\n12,810\n \nReinsurance Property\n6,028\n \nInsurance Casualty\n5,891\n \nInsurance Property\n762\n \nLiabilities for unpaid claims and claim adjustment expenses, net of reinsurance\n (1)\n25,491\n \nReinsurance recoverable on unpaid claims\nReinsurance Casualty\n73\n \nReinsurance Property\n624\n \nInsurance Casualty\n1,750\n \nInsurance Property\n237\n \nTotal reinsurance recoverable on unpaid claims \n(1)\n2,683\n \nInsurance lines other than short-duration\n—\n \nUnallocated claims adjustment expenses\n316\n \nOther \n(2)\n1,400\n \n1,716\n \nTotal gross liability for unpaid claims and claim adjustment expense\n$\n29,889\n \n(Some amounts may not reco\nncile due to rounding.)\n(1)\n Amounts disclosed are for reinsurance and insurance reportable segments.\n(2)\n The other amount is primarily comprised of the new Other segment, which includes the results of our sports and leisure business sold in October 2024, consisting of policies written prior to the sale and polices renewed and certain new business written on the Company’s paper post-sale. It also includes run-off A&E exposures, certain discontinued insurance programs primarily written prior to 2012 and certain discontinued insurance and reinsurance coverage classes.  The Other segment does not generally sell insurance or reinsurance products but is responsible for the management of existing policies and settlement of related losses.\nThe following tables present the ultimate loss and allocated LAE and the paid loss and allocated LAE, net of reinsurance for casualty and property, as well as the average annual percentage payout of incurred claims by age, net of reinsurance for each of our disclosed lines of business.\nReinsurance - Casualty Business\nAt December 31, 2024\nUltimate Incurred Loss and Allocated Loss Adjustment Expenses, Net of reinsurance\nYears Ended December 31,\nTotal of\nIBNR Liabilities\nPlus Expected\nDevelopment\non Reported\nClaims\nCumulative\nNumber of\nReported\nClaims\nAccident Year\n2015\n(unaudited)\n2016\n(unaudited)\n2017\n(unaudited)\n2018\n(unaudited)\n2019\n(unaudited)\n2020\n(unaudited)\n2021\n(unaudited)\n2022\n(unaudited)\n2023\n(unaudited)\n2024\n(Dollars in millions)\n2015\n$\n777\n \n$\n821\n \n$\n818\n \n$\n815\n \n$\n799\n \n$\n835\n \n$\n835\n \n$\n833\n \n$\n832\n \n$\n845\n \n$\n45\n \n N/A \n2016\n792\n \n870\n \n867\n \n862\n \n938\n \n940\n \n970\n \n1,000\n \n1,022\n \n52\n \n N/A \n2017\n875\n \n834\n \n841\n \n922\n \n931\n \n986\n \n1,051\n \n1,079\n \n24\n \n N/A \n2018\n1,447\n \n1,445\n \n1,522\n \n1,553\n \n1,621\n \n1,718\n \n1,775\n \n246\n \n N/A \n2019\n1,761\n \n1,826\n \n1,828\n \n1,853\n \n1,893\n \n1,954\n \n346\n \n N/A \n2020\n1,957\n \n1,928\n \n1,907\n \n1,869\n \n1,911\n \n588\n \n N/A \n2021\n2,491\n \n2,487\n \n2,427\n \n2,518\n \n1,229\n \n N/A \n2022\n2,730\n \n2,688\n \n2,739\n \n1,658\n \n N/A \n2023\n2,958\n \n3,123\n \n2,315\n \n N/A \n2024\n3,275\n \n2,756\n \n N/A \n$\n20,240\n \n(Some amounts may not reconcile due to rounding.)\nF-30\nTable of Contents\nCumulative Paid Loss and Allocated Loss Adjustment Expenses, Net of Reinsurance\nYears Ended December 31,\nAccident Year\n2015\n(unaudited)\n2016\n(unaudited)\n2017\n(unaudited)\n2018\n(unaudited)\n2019\n(unaudited)\n2020\n(unaudited)\n2021\n(unaudited)\n2022\n(unaudited)\n2023\n(unaudited)\n2024\n(Dollars in millions)\n2015\n$\n56\n \n$\n158\n \n$\n265\n \n$\n410\n \n$\n499\n \n$\n567\n \n$\n613\n \n$\n650\n \n$\n677\n \n$\n702\n \n2016\n89\n \n189\n \n323\n \n429\n \n542\n \n618\n \n693\n \n762\n \n826\n \n2017\n80\n \n186\n \n317\n \n458\n \n582\n \n681\n \n790\n \n917\n \n2018\n188\n \n296\n \n497\n \n652\n \n828\n \n1,008\n \n1,214\n \n2019\n239\n \n364\n \n533\n \n735\n \n963\n \n1,234\n \n2020\n205\n \n307\n \n486\n \n720\n \n987\n \n2021\n206\n \n319\n \n542\n \n845\n \n2022\n184\n \n345\n \n646\n \n2023\n201\n \n422\n \n2024\n256\n \n$\n8,048\n \nAll outstanding liabilities prior to 2015, net of reinsurance\n617\n \nLiabilities for claims and claim adjustment expenses, net of reinsurance\n$\n12,810\n \n(Some amounts may not reconcile due to rounding.)\nAverage Annual Percentage Payout of Incurred Loss by Age, Net of Reinsurance (unaudited)\nYears\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\nCasualty\n8.4\n \n%\n6.7\n \n%\n10.4\n \n%\n11.6\n \n%\n11.6\n \n%\n10.4\n \n%\n9.2\n \n%\n7.9\n \n%\n4.9\n \n%\n2.9\n \n%\nReinsurance - Property Business\nAt December 31, 2024\nUltimate Incurred Loss and Allocated Loss Adjustment Expenses, Net of reinsurance\nYears Ended December 31,\nTotal of\nIBNR Liabilities\nPlus Expected\nDevelopment\non Reported\nClaims\nCumulative\nNumber of\nReported\nClaims\nAccident Year\n2015\n(unaudited)\n2016\n(unaudited)\n2017\n(unaudited)\n2018\n(unaudited)\n2019\n(unaudited)\n2020\n(unaudited)\n2021\n(unaudited)\n2022\n(unaudited)\n2023\n(unaudited)\n2024\n(Dollars in millions)\n2015\n$\n1,378\n \n$\n1,037\n \n$\n956\n \n$\n930\n \n$\n933\n \n$\n925\n \n$\n927\n \n$\n924\n \n$\n921\n \n$\n911\n \n$\n—\n \n N/A \n2016\n1,681\n \n1,502\n \n1,538\n \n1,532\n \n1,510\n \n1,511\n \n1,507\n \n1,509\n \n1,502\n \n1\n \n N/A \n2017\n2,773\n \n3,396\n \n3,507\n \n3,636\n \n3,681\n \n3,692\n \n3,705\n \n3,724\n \n3\n \n N/A \n2018\n2,594\n \n2,469\n \n2,471\n \n2,409\n \n2,362\n \n2,347\n \n2,382\n \n3\n \n N/A \n2019\n2,005\n \n2,036\n \n1,981\n \n1,866\n \n1,869\n \n1,920\n \n2\n \n N/A \n2020\n2,388\n \n2,461\n \n2,405\n \n2,377\n \n2,379\n \n3\n \n N/A \n2021\n2,745\n \n2,770\n \n2,692\n \n2,582\n \n14\n \n N/A \n2022\n3,202\n \n2,880\n \n2,586\n \n261\n \n N/A \n2023\n2,788\n \n2,411\n \n662\n \n N/A \n2024\n3,940\n \n2,214\n \n N/A \n$\n24,337\n \n(Some amounts may not reconcile due to rounding.)\nF-31\nTable of Contents\nCumulative Paid Loss and Allocated Loss Adjustment Expenses, Net of Reinsurance\nYears Ended December 31,\nAccident Year\n2015\n(unaudited)\n2016\n(unaudited)\n2017\n(unaudited)\n2018\n(unaudited)\n2019\n(unaudited)\n2020\n(unaudited)\n2021\n(unaudited)\n2022\n(unaudited)\n2023\n(unaudited)\n2024\n(Dollars in millions)\n2015\n$\n369\n \n$\n591\n \n$\n740\n \n$\n823\n \n$\n850\n \n$\n871\n \n$\n879\n \n$\n884\n \n$\n888\n \n$\n889\n \n2016\n459\n \n946\n \n1,056\n \n1,080\n \n1,089\n \n1,081\n \n1,082\n \n1,084\n \n1,128\n \n2017\n810\n \n2,170\n \n2,733\n \n3,117\n \n3,313\n \n3,407\n \n3,482\n \n3,590\n \n2018\n534\n \n1,509\n \n1,857\n \n2,047\n \n2,121\n \n2,184\n \n2,307\n \n2019\n714\n \n1,159\n \n1,482\n \n1,645\n \n1,771\n \n1,934\n \n2020\n571\n \n1,302\n \n1,706\n \n1,989\n \n2,251\n \n2021\n679\n \n1,523\n \n2,014\n \n2,420\n \n2022\n619\n \n1,364\n \n1,896\n \n2023\n600\n \n1,165\n \n2024\n774\n \n$\n18,355\n \nAll outstanding liabilities prior to 2015, net of reinsurance\n46\n \nLiabilities for claims and claim adjustment expenses, net of reinsurance\n$\n6,028\n \n(Some amounts may not reconcile due to rounding.)\nAverage Annual Percentage Payout of Incurred Loss by Age, Net of Reinsurance (unaudited)\nYears\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\nProperty\n25.2\n \n%\n31.2\n \n%\n16.2\n \n%\n10.0\n \n%\n5.4\n \n%\n3.2\n \n%\n2.4\n \n%\n1.9\n \n%\n2.0\n \n%\n0.2\n \n%\nInsurance - Casualty Business\nAt December 31, 2024\nUltimate Incurred Loss and Allocated Loss Adjustment Expenses, Net of reinsurance\nYears Ended December 31,\nTotal of\nIBNR Liabilities\nPlus Expected\nDevelopment\non Reported\nClaims\nCumulative\nNumber of\nReported\nClaims\nAccident Year\n2015\n(unaudited)\n2016\n(unaudited)\n2017\n(unaudited)\n2018\n(unaudited)\n2019\n(unaudited)\n2020\n(unaudited)\n2021\n(unaudited)\n2022\n(unaudited)\n2023\n(unaudited)\n2024\n(Dollars in millions)\n2015\n$\n487\n \n$\n492\n \n$\n500\n \n$\n503\n \n$\n427\n \n$\n426\n \n$\n427\n \n$\n434\n \n$\n426\n \n$\n445\n \n$\n11\n \n27,331\n \n2016\n504\n \n510\n \n538\n \n557\n \n489\n \n474\n \n478\n \n488\n \n494\n \n17\n \n31,267\n \n2017\n559\n \n557\n \n567\n \n585\n \n559\n \n559\n \n584\n \n580\n \n32\n \n34,793\n \n2018\n643\n \n648\n \n679\n \n685\n \n697\n \n772\n \n811\n \n64\n \n34,838\n \n2019\n774\n \n777\n \n797\n \n804\n \n953\n \n1,089\n \n145\n \n37,837\n \n2020\n912\n \n989\n \n977\n \n975\n \n1,096\n \n273\n \n39,675\n \n2021\n1,117\n \n1,159\n \n1,153\n \n1,353\n \n464\n \n44,458\n \n2022\n1,241\n \n1,239\n \n1,597\n \n739\n \n46,433\n \n2023\n1,424\n \n1,740\n \n1,125\n \n44,372\n \n2024\n1,788\n \n1,546\n \n33,512\n \n$\n10,993\n \n(Some amounts may not reconcile due to rounding.)\nF-32\nTable of Contents\nCumulative Paid Loss and Allocated Loss Adjustment Expenses, Net of Reinsurance\nYears Ended December 31,\nAccident Year\n2015\n(unaudited)\n2016\n(unaudited)\n2017\n(unaudited)\n2018\n(unaudited)\n2019\n(unaudited)\n2020\n(unaudited)\n2021\n(unaudited)\n2022\n(unaudited)\n2023\n(unaudited)\n2024\n(Dollars in millions)\n2015\n$\n43\n \n$\n127\n \n$\n208\n \n$\n270\n \n$\n325\n \n$\n351\n \n$\n379\n \n$\n397\n \n$\n409\n \n$\n417\n \n2016\n51\n \n156\n \n253\n \n314\n \n362\n \n398\n \n430\n \n448\n \n460\n \n2017\n52\n \n165\n \n263\n \n343\n \n404\n \n467\n \n493\n \n527\n \n2018\n61\n \n196\n \n296\n \n407\n \n539\n \n623\n \n678\n \n2019\n69\n \n218\n \n364\n \n498\n \n646\n \n828\n \n2020\n63\n \n229\n \n372\n \n531\n \n659\n \n2021\n105\n \n246\n \n428\n \n655\n \n2022\n79\n \n282\n \n578\n \n2023\n93\n \n311\n \n2024\n85\n \n$\n5,200\n \nAll outstanding liabilities prior to 2015, net of reinsurance\n97\n \nLiabilities for claims and claim adjustment expenses, net of reinsurance\n$\n5,891\n \n(Some amounts may not reconcile due to rounding.)\nAverage Annual Percentage Payout of Incurred Loss by Age, Net of Reinsurance (unaudited)\nYears\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\nCasualty\n6.4\n \n%\n14.3\n \n%\n15.3\n \n%\n14.2\n \n%\n12.7\n \n%\n11.5\n \n%\n6.1\n \n%\n4.6\n \n%\n2.6\n \n%\n1.9\n \n%\nInsurance - Property Business\nAt December 31, 2024\nUltimate Incurred Loss and Allocated Loss Adjustment Expenses, Net of reinsurance\nYears Ended December 31,\nTotal of\nIBNR Liabilities\nPlus Expected\nDevelopment\non Reported\nClaims\nCumulative\nNumber of\nReported\nClaims\nAccident Year\n2015\n(unaudited)\n2016\n(unaudited)\n2017\n(unaudited)\n2018\n(unaudited)\n2019\n(unaudited)\n2020\n(unaudited)\n2021\n(unaudited)\n2022\n(unaudited)\n2023\n(unaudited)\n2024\n(Dollars in millions)\n2015\n$\n179\n \n$\n169\n \n$\n159\n \n$\n160\n \n$\n161\n \n$\n162\n \n$\n163\n \n$\n165\n \n$\n164\n \n$\n165\n \n$\n1\n \n N/A \n2016\n289\n \n281\n \n284\n \n292\n \n297\n \n299\n \n300\n \n302\n \n301\n \n2\n \n N/A \n2017\n486\n \n494\n \n486\n \n494\n \n496\n \n508\n \n509\n \n506\n \n1\n \n N/A \n2018\n403\n \n399\n \n401\n \n410\n \n428\n \n436\n \n435\n \n3\n \n N/A \n2019\n347\n \n352\n \n350\n \n365\n \n380\n \n375\n \n6\n \n N/A \n2020\n601\n \n508\n \n498\n \n503\n \n492\n \n10\n \n N/A \n2021\n646\n \n585\n \n602\n \n628\n \n37\n \n N/A \n2022\n770\n \n796\n \n698\n \n42\n \n N/A \n2023\n717\n \n669\n \n94\n \n N/A \n2024\n597\n \n192\n \n N/A \n$\n4,864\n \n(Some amounts may not reconcile due to rounding.)\nF-33\nTable of Contents\nCumulative Paid Loss and Allocated Loss Adjustment Expenses, Net of Reinsurance\nYears Ended December 31,\nAccident Year\n2015\n(unaudited)\n2016\n(unaudited)\n2017\n(unaudited)\n2018\n(unaudited)\n2019\n(unaudited)\n2020\n(unaudited)\n2021\n(unaudited)\n2022\n(unaudited)\n2023\n(unaudited)\n2024\n(Dollars in millions)\n2015\n$\n107\n \n$\n153\n \n$\n155\n \n$\n158\n \n$\n160\n \n$\n161\n \n$\n162\n \n$\n163\n \n$\n163\n \n$\n164\n \n2016\n167\n \n249\n \n272\n \n290\n \n296\n \n297\n \n299\n \n299\n \n299\n \n2017\n176\n \n416\n \n452\n \n477\n \n493\n \n505\n \n504\n \n505\n \n2018\n240\n \n356\n \n376\n \n407\n \n424\n \n429\n \n431\n \n2019\n226\n \n313\n \n335\n \n355\n \n363\n \n368\n \n2020\n292\n \n413\n \n450\n \n465\n \n473\n \n2021\n325\n \n482\n \n544\n \n565\n \n2022\n377\n \n567\n \n594\n \n2023\n400\n \n503\n \n2024\n200\n \n$\n4,102\n \nAll outstanding liabilities prior to 2015, net of reinsurance\n—\n \nLiabilities for claims and claim adjustment expenses, net of reinsurance\n762\n \n(Some amounts may not reconcile due to rounding.)\nAverage Annual Percentage Payout of Incurred Loss by Age, Net of Reinsurance (unaudited)\nYears\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\nProperty\n54.0\n \n%\n30.4\n \n%\n6.3\n \n%\n4.6\n \n%\n2.5\n \n%\n1.4\n \n%\n0.3\n \n%\n0.1\n \n%\n—\n \n%\n0.3\n \n%\nReserving Methodology\nThe Company maintains reserves equal to management’s estimated ultimate liability for losses and LAE for reported and unreported claims for our insurance and reinsurance businesses.  Because reserves are based on estimates of ultimate losses and LAE by underwriting or accident year, the Company uses a variety of statistical and actuarial techniques to monitor reserve adequacy over time, evaluate new information as it becomes known and adjust reserves whenever an adjustment appears warranted.  The Company considers many factors when setting reserves including:  (1) exposure base and projected ultimate premium; (2) expected loss ratios by product and class of business, which are developed collaboratively by underwriters and actuaries; (3) actuarial methodologies and assumptions which analyze loss reporting and payment experience, reports from ceding companies and historical trends, such as reserving patterns, loss payments and product mix; (4) current legal interpretations of coverage and liability; and (5) economic conditions.  Management’s best estimate is developed through collaboration with actuarial, underwriting, claims, legal and finance departments and culminates with the input of reserve committees. Each segment reserve committee includes the participation of the relevant parties from actuarial, finance, claims and segment senior management.  Reserves are further reviewed by Everest’s Chief Reserving Actuary and senior management.  The objective of such process is to determine a single best estimate viewed by management to be the best estimate of its ultimate loss liability.   Actual loss and LAE ultimately paid may deviate, perhaps substantially, from such reserves.  Net income will be impacted in a period in which the change in estimated ultimate loss and LAE is recorded.\nThe detailed data required to evaluate ultimate losses for the Company’s insurance business is accumulated from its underwriting and claim systems.  Reserving for reinsurance requires evaluation of loss information received from ceding companies.  Ceding companies report losses in many forms depending on the type of contract and the agreed or contractual reporting requirements.  Generally, pro rata contracts require the submission of a monthly/quarterly account, which includes premium and loss activity for the period with corresponding reserves as established by the ceding company.  This information is recorded in the Company’s records.  For certain pro rata contracts, the Company may require a detailed loss report for claims that exceed a certain dollar threshold or relate to a particular type of loss.  Excess of loss and facultative contracts generally require individual loss reporting with precautionary notices provided when a loss reaches a significant percentage of the attachment point of the contract or when certain causes of loss or types of injury occur.  Experienced Claims staff handle individual loss reports and supporting claim information.  Based on evaluation of a claim, the Company may establish additional case reserves in addition to the case reserves reported by the ceding company.  To ensure ceding companies are submitting required and accurate data, Everest’s Underwriting, Claim, Reinsurance Accounting and Internal Audit departments perform various reviews of ceding companies, particularly larger ceding companies, including on-site audits.\nThe Company segments both reinsurance and insurance reserves into exposure groupings for actuarial analysis.  The Company assigns business to exposure groupings so that the underlying exposures have reasonably homogeneous loss \nF-34\nTable of Contents\ndevelopment characteristics and are large enough to facilitate credible estimation of ultimate losses.  The Company periodically reviews its exposure groupings and may change groupings over time as business changes.  The Company currently uses approximately \n250\n exposure groupings to develop reserve estimates.  One of the key selection characteristics for the exposure groupings is the historical duration of the claims settlement process.  Business in which claims are reported and settled relatively quickly are commonly referred to as short tail lines, principally property lines.  Casualty claims tend to take longer to be reported and settled and casualty lines are generally referred to as long tail lines. Estimates of ultimate losses for shorter tail lines, with the exception of loss estimates for large catastrophic events, generally exhibit less uncertainty than those for the longer tail lines.\nThe Company uses a variety of actuarial methodologies, such as the expected loss ratio method, chain ladder methods and Bornhuetter-Ferguson methods, supplemented by judgment where appropriate, to estimate ultimate loss and LAE for each exposure group.\nExpected Loss Ratio Method:  The expected loss ratio method uses earned premium times an expected loss ratio to calculate ultimate losses for a given underwriting or accident year.  This method relies entirely on expectation to project ultimate losses with no consideration given to actual losses.  As such, it may be appropriate for an immature underwriting or accident year where few, if any, losses have been reported or paid, but less appropriate for a more mature year.\nChain Ladder Method:  Chain ladder methods use a standard loss development triangle to project ultimate losses.  Age-to-age development factors are selected for each development period and combined to calculate age-to-ultimate development factors which are then applied to paid or reported losses to project ultimate losses.  This method relies entirely on actual paid or reported losses to project ultimate losses.  No other factors such as changes in pricing or other expectations are taken into account.  It is most appropriate for groups with homogeneous, stable experience where past development patterns are expected to continue in the future.  It is least appropriate for groups which have changed significantly over time, or which are more volatile.\nBornhuetter-Ferguson Method:  The Bornhuetter-Ferguson method is a combination of the expected loss ratio method and the chain ladder method.  Ultimate losses are projected based partly on actual paid or reported losses and partly on expectation.  IBNR reserves are calculated using earned premium, an a priori loss ratio and selected age-to-age development factors and added to actual reported (paid) losses to determine ultimate losses.  It is more responsive to actual reported or paid development than the expected loss ratio method but less responsive than the chain ladder method.  \nFor both short and long tail lines, the Company supplements these general approaches with analytically based judgments.  Although the Company uses similar actuarial methods for both short tail and long tail lines, the faster reporting of experience for the short tail lines allows the Company to have greater confidence in its estimates of ultimate losses at an earlier stage than for long tail lines.  For immature underwriting or accident years, the initial expected loss ratios are key inputs that involve management’s judgment and are based on a variety of factors, including: (1) expected loss ratios developed during the Company’s pricing process; (2) historical loss ratios adjusted for rate change and trend; and (3) industry benchmarks for similar business. These judgments take into account management’s view of past, current and future factors that may influence ultimate losses, including: (1) market conditions; (2) changes in the business underwritten; (3) changes in timing of the emergence of claims; and (4) other factors. The determination of when reported losses are sufficient and credible to warrant selection of an ultimate loss ratio different from the initial expected loss ratio also requires judgment.\nCarried reserves at each reporting date are the management’s best estimate of ultimate unpaid losses and LAE at that date.  The Company completes detailed reserve studies for each exposure group annually for both reinsurance and insurance operations.  The completed annual reserve studies are “rolled-forward” for each accounting period until the subsequent reserve study is completed.  Analyzing the roll-forward process involves comparing actual reported losses to expected losses based on the most recent reserve study.  The Company analyzes significant variances between actual and expected losses and post adjustments to its reserves as warranted.\nCertain reserves, including losses from widespread catastrophic events and COVID-19 related losses, cannot be estimated using traditional actuarial methods. Rather, loss and LAE reserves are estimated by management by completing an in-depth analysis of the individual contracts which may potentially be impacted by the loss. The analysis uses inputs from various sources and methodology, to build up a comprehensive perspective.  Such analysis generally involves: (1) estimating the size of insured industry losses; (2) reviewing portfolios to identify contracts which are exposed; (3) reviewing information reported or otherwise provided by customers and brokers; (4) discussing the loss with customers \nF-35\nTable of Contents\nand brokers; and (5) estimating the ultimate expected cost to settle all claims and administrative costs arising from the loss on a contract-by-contract basis and in aggregate for the event. Due to the inherent uniqueness or specific nature of a catastrophic event, each event has its own unique assessment, and different weights may be applied to various inputs based on management’s judgment.  Once a loss has occurred, during the then current reporting period, the Company records its best estimate of the ultimate expected cost to settle all claims arising from the loss. The Company’s estimate of loss and LAE reserves is then determined by deducting cumulative paid losses from its estimate of the ultimate expected loss. The Company’s estimate of IBNR is determined by deducting cumulative paid losses, case reserves and additional case reserves from its estimate of the ultimate expected loss.  \nBecause catastrophe losses are typically due to prominent, public events such as hurricanes and earthquakes, the Company is often able to use independent reports as part of its loss reserve estimation process. The Company also reviews catastrophe bulletins published by various statistical modeling agencies to assist in determining the size of the industry loss, although these reports may not be available for some time after an event. For smaller events including localized severe weather events such as windstorms, hail, ice, snow, flooding, freezing and tornadoes, which are not necessarily prominent, public occurrences, the Company initially places greater reliance on catastrophe bulletins published by statistical modeling agencies to assist in determining what events occurred during the reporting period than the Company does for large events. This includes reviewing catastrophe bulletins published by Property Claim Services for U.S. catastrophes. The Company sets its initial estimates of reserves for loss and LAE for these smaller events based on a combination of its historical market share for these types of losses and the estimate of the total insured industry property losses as reported by statistical modeling agencies, although management may make significant adjustments based on the Company’s current exposure to the geographic region involved as well as the size of the loss and the peril involved. \nIn general, reserves for the Company’s more recent large losses are subject to greater uncertainty and, therefore, greater potential variability, and are likely to experience material changes from one period to the next. This is due to the uncertainty as to the size of the industry losses, uncertainty as to which contracts have been exposed, uncertainty due to complex legal and coverage issues that can arise out of large or complex losses and uncertainty as to the magnitude of losses and LAE incurred by the Company’s customers. As the Company’s losses age, more information becomes available, and the Company believes its estimates become more certain.\nThe Company continues to receive claims under expired insurance and reinsurance contracts asserting injuries and/or damages relating to or resulting from environmental pollution and hazardous substances, including asbestos.  Environmental claims typically assert liability for (a) the mitigation or remediation of environmental contamination or (b) bodily injury or property damage caused by the release of hazardous substances into the land, air or water.  Asbestos claims typically assert liability for bodily injury from exposure to asbestos or for property damage resulting from asbestos or products containing asbestos.\nThe Company’s reserves include an estimate of the Company’s ultimate liability for A&E claims.  The Company’s A&E liabilities emanate from Mt. McKinley Insurance Company’s (“Mt. McKinley”), a former wholly owned subsidiary that was sold in 2015, direct insurance business and Everest Re’s assumed reinsurance business.  All of the contracts of insurance and reinsurance, under which the Company has received claims during the past three years, expired more than \n20\n years ago.  There are significant uncertainties surrounding the Company’s reserves for its A&E losses.\nF-36\nTable of Contents\nA&E exposures represent a separate exposure group for monitoring and evaluating reserve adequacy.  \nThe following table summarizes incurred losses with respect to A&E reserves on both a gross and net of reinsurance basis for the periods indicated:\nAt December 31,\n(Dollars in millions)\n2024\n2023\n2022\nGross basis:\nBeginning of period reserves\n$\n247\n \n$\n278\n \n$\n175\n \nIncurred losses\n62\n \n—\n \n144\n \nPaid losses\n(\n49\n)\n(\n31\n)\n(\n42\n)\nEnd of period reserves\n$\n260\n \n$\n247\n \n$\n278\n \nNet basis:\nBeginning of period reserves\n$\n232\n \n$\n257\n \n$\n156\n \nIncurred losses\n54\n \n—\n \n138\n \nPaid losses\n(\n43\n)\n(\n25\n)\n(\n37\n)\nEnd of period reserves\n$\n242\n \n$\n232\n \n$\n257\n \n(Some amounts may not reconcile due to rounding.)\nIn 2015, the Company sold Mt. McKinley to Clearwater Insurance Company (“Clearwater”), a subsidiary of Fairfax Financial. Concurrently with the closing, the Company entered into a retrocession treaty with an affiliate of Clearwater.  Per the retrocession treaty, the Company retroceded \n100\n% of the liabilities associated with certain Mt. McKinley policies, which related entirely to A&E business and had been reinsured by Bermuda Re.  As consideration for entering into the retrocession treaty, Everest Re Bermuda transferred cash of $\n140\n million, an amount equal to the net loss reserves as of the closing date.  The maximum liability retroceded under the retrocession treaty will be $\n440\n million, equal to the retrocession payment plus $\n300\n million.  The Company will retain liability for any amounts exceeding the maximum liability retroceded under the retrocession treaty.\nOn December 20, 2019, the retrocession treaty was amended and included a partial commutation.  As a result of this amendment and partial commutation, gross A&E reserves and correspondingly reinsurance receivable were reduced by $\n43\n million.  In addition, the maximum liability permitted to be retroceded increased to $\n450\n million.  \nReinsurance Recoverables.\nReinsurance recoverables for both paid and unpaid losses totaled $\n3.1\n billion and $\n2.3\n billion at December 31, 2024 and December 31, 2023, respectively.  At December 31, 2024, $\n395\n million, or \n12.6\n%, was receivable from Mt. Logan Re, Ltd. (“Mt. Logan Re”) collateralized segregated accounts; $\n316\n million, or \n10.1\n%, was receivable from Munich Reinsurance America, Inc. and $\n187\n million, or \n6.0\n%, was recoverable from Endurance Reinsurance Corporation of America.  No other retrocessionaire accounted for more than \n5\n% of our receivables.\n5.    \nREINSURANCE\nThe Company utilizes reinsurance agreements to reduce its exposure to large claims and catastrophic loss occurrences.  These agreements provide for recovery from reinsurers of a portion of losses and LAE under certain circumstances without relieving the Company of its underlying obligations to the policyholders.  Losses and LAE incurred and premiums earned are reported after deduction for reinsurance.  In the event that one or more of the reinsurers were unable to meet their obligations under these reinsurance agreements, the Company would not realize the full value of the reinsurance recoverable balances.  The Company's procedures include carefully selecting its reinsurers, structuring agreements to provide collateral funds where necessary and regularly monitoring the financial condition and ratings of its reinsurers. Reinsurance recoverables include balances due from reinsurance companies and are presented net of an allowance for uncollectible reinsurance.  Reinsurance recoverables include an estimate of the amount of gross losses and LAE reserves that may be ceded under the terms of the reinsurance agreements, including IBNR unpaid losses. The Company’s estimate of losses and LAE reserves ceded to reinsurers is based on assumptions that are consistent with those used in establishing the gross reserves for amounts the Company owes to its claimants. The Company estimates its ceded reinsurance receivable based on the terms of any applicable facultative and treaty reinsurance, including an estimate of how IBNR losses will ultimately be ceded under reinsurance agreements. Accordingly, the Company’s estimate of reinsurance recoverables is subject to similar risks and uncertainties as the estimate of the gross reserve for unpaid losses and LAE. The Company may hold partial collateral, including letters of credit and funds held, under these agreements.  See also Note 1C, Note 4 and Note 10 of the Notes to these Consolidated Financial Statements.\nF-37\nTable of Contents\nBalances are considered past due when amounts that have been billed are not collected within contractually stipulated time periods, generally 30, 60 or 90 days.  To manage reinsurer credit risk, a reinsurance security review committee evaluates the credit standing, financial performance, management and operational quality of each potential reinsurer. In placing reinsurance, the Company considers the nature of the risk reinsured, including the expected liability payout duration and establishes limits tiered by reinsurer credit rating. \nWhere its contracts permit, the Company secures future claim obligations with various forms of collateral or other credit enhancement, including irrevocable letters of credit, secured trusts, funds held accounts and group wide offsets.  \nSee Note 1C of the Notes to these Consolidated Financial Statements for discussion of allowance on reinsurance recoverables.\nInsurance companies, including reinsurers, are regulated and hold risk-based capital to mitigate the risk of loss due to economic factors and other risks. Non-U.S. reinsurers are either subject to a capital regime substantively equivalent to domestic insurers or we hold collateral to support collection of reinsurance receivable.  As a result, there is limited history of losses from insurer defaults. \nPremiums written and earned and incurred losses and LAE are comprised of the following for the periods indicated:\nYears Ended December 31,\n(Dollars in millions)\n2024\n2023\n2022\nWritten premiums:\nDirect\n$\n5,115\n \n$\n5,031\n \n$\n4,602\n \nAssumed\n13,117\n \n11,606\n \n9,350\n \nCeded\n(\n2,418\n)\n(\n1,907\n)\n(\n1,608\n)\nNet written premiums\n$\n15,814\n \n$\n14,730\n \n$\n12,344\n \nPremiums earned:\nDirect\n$\n4,977\n \n$\n4,733\n \n$\n4,218\n \nAssumed\n12,458\n \n10,518\n \n9,082\n \nCeded\n(\n2,248\n)\n(\n1,807\n)\n(\n1,513\n)\nNet premiums earned\n$\n15,187\n \n$\n13,443\n \n$\n11,787\n \nIncurred losses and LAE:\nDirect\n$\n5,465\n \n$\n3,209\n \n$\n2,804\n \nAssumed\n7,464\n \n5,870\n \n6,285\n \nCeded\n(\n1,624\n)\n(\n651\n)\n(\n988\n)\nNet incurred losses and LAE\n$\n11,305\n \n$\n8,427\n \n$\n8,100\n \n6.    \nSEGMENT REPORTING\nThe Company conducts business through \ntwo\n reportable segments: Reinsurance and Insurance. The Reinsurance operation writes worldwide property and casualty reinsurance and specialty lines of business, on both a treaty and facultative basis, through reinsurance brokers, as well as directly with ceding companies.  Business is written in the U.S., Bermuda, and Ireland offices, as well as, through branches in Canada, Singapore, the United Kingdom (“U.K.”) and Switzerland.  The Insurance operation writes property and casualty insurance directly and through brokers, including for surplus lines, and general agents within the U.S., Bermuda, Canada, Europe, Singapore and South America through its offices in the U.S., Bermuda, Canada, Chile, Colombia, Mexico, Singapore, the U.K., Ireland, and branches located in Australia, the U.K., the Netherlands, France, Germany, Italy and Spain. The \ntwo\n segments are managed independently, but conform with corporate guidelines with respect to pricing, risk management, control of aggregate catastrophe exposures, capital, investments and support operations.  \nOur \ntwo\n reportable segments each have executive leaders who are responsible for the overall performance of their respective segments and who are directly accountable to our chief operating decision maker (“CODM”), the Chief Executive Officer of Everest Group, Ltd., who is ultimately responsible for reviewing the business to assess performance, make operating decisions and allocate resources. We report the results of our operations consistent with the manner in which our CODM reviews the business.\nF-38\nTable of Contents\nDuring the fourth quarter of 2024, the Company revised its classification and presentation of certain run-off business, previously included within the Reinsurance and Insurance reportable segments, as part of a new segment called \"Other\".  The new Other segment includes the results of our sports and leisure business sold in October 2024, consisting of policies written prior to the sale and polices renewed and certain new business written on the Company’s paper post-sale. It also includes run-off A&E exposures, certain discontinued insurance programs primarily written prior to 2012 and certain discontinued insurance and reinsurance coverage classes.   The Other segment does not generally sell insurance or reinsurance products but is responsible for the management of existing policies and settlement of related losses.  Additionally, during the fourth quarter of 2023, the Company revised the classification and presentation of certain products related to its accident and health business within the reportable segment groupings. These products have been realigned from within the Reinsurance segment to the Insurance segment to appropriately reflect how the business segments are managed due to changes in management implemented during the fourth quarter of 2023.  These segment presentation changes have been reflected retrospectively within this Form 10-K, including Schedule III - Supplementary Insurance Information. The Company will continue to have two reportable segments that actively sell products, Reinsurance and Insurance, consistent with how the on-going business is managed. \nThe Company does not review and evaluate the financial results of its segments based upon balance sheet data.  Management generally monitors and evaluates the financial performance of these segments based upon their underwriting results.  Underwriting results include earned premium less losses and LAE incurred, commission and brokerage expenses and other underwriting expenses.  The Company measures its underwriting results using ratios, in particular, loss, commission and brokerage and other underwriting expense ratios, which, respectively, divide incurred losses, commissions and brokerage and other underwriting expenses by premiums earned.\n  Management has determined that these measures are appropriate and align with how the business is managed. We continue to evaluate our segments as our business evolves and may further refine our segments and financial performance measures.\nThe following tables present segment underwriting results for the periods indicated:\nYear Ended December 31, 2024\n(Dollars in millions)\nReinsurance\nInsurance\nOther\nTotal\nGross written premiums\n$\n12,941\n \n$\n5,078\n \n$\n212\n \n$\n18,232\n \nNet written premiums\n11,969\n \n3,678\n \n167\n \n15,814\n \nPremiums earned\n$\n11,412\n \n$\n3,579\n \n$\n197\n \n$\n15,187\n \nIncurred losses and LAE\n7,103\n \n3,622\n \n580\n \n11,305\n \nCommission and brokerage\n2,837\n \n439\n \n24\n \n3,300\n \nOther underwriting expenses\n290\n \n615\n \n33\n \n938\n \nUnderwriting gain (loss)\n$\n1,181\n \n$\n(\n1,097\n)\n$\n(\n440\n)\n$\n(\n356\n)\nNet investment income\n1,954\n \nNet gains (losses) on investments\n19\n \nCorporate expenses\n(\n95\n)\nInterest, fee and bond issue cost amortization expense\n(\n149\n)\nOther income (expense)\n121\n \nIncome (loss) before taxes\n$\n1,493\n \nF-39\nTable of Contents\nYear Ended December 31, 2023\n(Dollars in millions)\nReinsurance\nInsurance\nOther\nTotal\nGross written premiums\n$\n11,460\n \n$\n4,888\n \n$\n289\n \n$\n16,637\n \nNet written premiums\n10,802\n \n3,704\n \n225\n \n14,730\n \nPremiums earned\n$\n9,799\n \n$\n3,420\n \n$\n225\n \n$\n13,443\n \nIncurred losses and LAE\n5,690\n \n2,471\n \n266\n \n8,427\n \nCommission and brokerage\n2,520\n \n410\n \n22\n \n2,952\n \nOther underwriting expenses\n254\n \n556\n \n35\n \n846\n \nUnderwriting gain (loss)\n$\n1,334\n \n$\n(\n18\n)\n$\n(\n98\n)\n$\n1,219\n \nNet investment income\n1,434\n \nNet gains (losses) on investments\n(\n276\n)\nCorporate expenses\n(\n73\n)\nInterest, fee and bond issue cost amortization expense\n(\n134\n)\nOther income (expense)\n(\n14\n)\nIncome (loss) before taxes\n$\n2,154\n \nYear Ended December 31, 2022\n(Dollars in millions)\nReinsurance\nInsurance\nOther\nTotal\nGross written premiums\n$\n9,246\n \n$\n4,426\n \n$\n279\n \n$\n13,952\n \nNet written premiums\n8,917\n \n3,223\n \n204\n \n12,344\n \nPremiums earned\n$\n8,596\n \n$\n2,998\n \n$\n194\n \n$\n11,787\n \nIncurred losses and LAE\n5,962\n \n2,040\n \n98\n \n8,100\n \nCommission and brokerage\n2,116\n \n399\n \n14\n \n2,528\n \nOther underwriting expenses\n216\n \n438\n \n28\n \n682\n \nUnderwriting gain (loss)\n$\n302\n \n$\n121\n \n$\n54\n \n$\n477\n \nNet investment income\n830\n \nNet gains (losses) on investments\n(\n455\n)\nCorporate expenses\n(\n61\n)\nInterest, fee and bond issue cost amortization expense\n(\n101\n)\nOther income (expense)\n(\n102\n)\nIncome (loss) before taxes\n$\n588\n \nThe following table below presents gross written premiums by geographic region.  Allocations have been made on the basis of location of risk.  \nUnited States\nEurope\nAll other\n2024\n57\n \n%\n25\n \n%\n18\n \n%\n2023\n58\n \n%\n24\n \n%\n18\n \n%\n2022\n63\n \n%\n22\n \n%\n15\n \n%\nApproximately \n21.9\n%, \n20.4\n% and \n20.0\n% of the Company’s gross written premiums in 2024, 2023 and 2022, respectively, were sourced through the Company’s largest intermediary.\n \n7.    \nCREDIT FACILITIES\nAs of December 31, 2024, the Company has multiple active committed letter of credit facilities with a total commitment of up to $\n1.7\n billion, as well as two additional credit facilities denominated in British Pound Sterling and Euros, with total commitments of up to £\n113\n million and €\n75\n million, respectively.  The Company also has additional uncommitted letter of \nF-40\nTable of Contents\ncredit facilities of up to $\n240\n million which may be accessible via written request and corresponding authorization from the applicable lender.  There is no guarantee the uncommitted capacity will be available to us on a future date.  \nThe terms and outstanding amounts for each facility are discussed below.  See Note 10 of the Notes to these Consolidated Financial Statements for collateral posted related to secured letters of credit.\nBermuda Re Wells Fargo Bilateral Letter of Credit Facility\nEffective February 23, 2021, Bermuda Re entered into a letter of credit issuance facility with Wells Fargo, referred to as the “Bermuda Re Wells Fargo Bilateral Letter of Credit Facility.” The Bermuda Re Wells Fargo Bilateral Letter of Credit Facility originally provided for the issuance of up to $\n50\n million of secured letters of credit.  Effective May 5, 2021, the agreement was amended to provide for the issuance of up to $\n500\n million of secured letters of credit.  Effective June 10, 2024, the agreement was amended to extend the availability of committed issuance for one year. \nThe following table summarizes the outstanding letters of credit for the periods indicated:\n(Dollars in millions)\nAt December 31, 2024\nAt December 31, 2023\nLetter of Credit Facility\nCommitment\nIn Use\nDate of Expiry\nCommitment\nIn Use\nDate of Expiry\nBermuda Re Wells Fargo Bank Bilateral LOC Facility\n$\n500\n \n$\n455\n \n12/31/2025\n$\n500\n \n$\n97\n \n6/24/2024\n71\n \n6/28/2024\n318\n \n12/31/2024\n$\n500\n \n$\n455\n \n$\n500\n \n$\n486\n \n(Some amounts may not reconcile due to rounding.)\nBermuda Re Citibank Letter of Credit Facility\nEffective August 9, 2021, Bermuda Re entered into a letter of credit issuance facility with Citibank N.A. referred to as the “Bermuda Re Citibank Letter of Credit Facility”.  The Bermuda Re Citibank Letter of Credit Facility provides for the committed issuance of up to $\n230\n million of secured letters of credit.  In addition, the facility provided for the uncommitted issuance of up to $\n140\n million, which may be accessible via written request by the Company and corresponding authorization from Citibank N.A.  Effective December 13, 2023, the agreement was amended to extend the availability of committed issuance for an additional \ntwo years\n.\nThe following table summarizes the outstanding letters of credit for the periods indicated:\n(Dollars in millions)\nAt December 31, 2024\nAt December 31, 2023\nLetter of Credit Facility\nCommitment\nIn Use\nDate of Expiry\nCommitment\nIn Use\nDate of Expiry\nBermuda Re Citibank LOC Facility- Committed\n$\n230\n \n$\n—\n \n1/21/2025\n$\n230\n \n$\n—\n \n01/21/2024\n4\n \n2/28/2025\n4\n \n02/29/2024\n2\n \n3/1/2025\n1\n \n3/1/2024\n1\n \n3/15/2025\n3\n \n9/23/2024\n3\n \n9/23/2025\n1\n \n12/1/2024\n1\n \n12/1/2025\n—\n \n12/16/2024\n—\n \n12/16/2025\n—\n \n12/20/2024\n—\n \n12/20/2025\n217\n \n12/31/2024\n197\n \n12/31/2025\n1\n \n8/15/2025\n1\n \n8/15/2026\nBermuda Re Citibank LOC Facility - Uncommitted\n140\n \n75\n \n12/31/2025\n140\n \n105\n \n12/31/2024\n7\n \n12/30/2028\n7\n \n12/30/2027\nTotal Citibank Bilateral Agreement\n$\n370\n \n$\n293\n \n$\n370\n \n$\n340\n \n(Some amounts may not reconcile due to rounding.)\nBermuda Re Bayerische Landesbank Bilateral Secured Credit Facility\nEffective August 27, 2021, Bermuda Re entered into a letter of credit issuance facility with Bayerische Landesbank, an agreement referred to as the “Bermuda Re Bayerische Landesbank Bilateral Secured Credit Facility”.  The Bermuda Re \nF-41\nTable of Contents\nBayerische Landesbank Bilateral Secured Credit Facility provides for the committed issuance of up to $\n200\n million of secured letters of credit.  Effective August 16, 2024, the Bermuda Re Bayerische Landesbank Bilateral Secured Credit Facility was amended to extend the availability of committed issuance for \nthree years\n. \nThe following table summarizes the outstanding letters of credit for the periods indicated:  \n(Dollars in millions)\nAt December 31, 2024\nAt December 31, 2023\nLetter of Credit Facility\nCommitment\nIn Use\nDate of Expiry\nCommitment\nIn Use\nDate of Expiry\nBermuda Re Bayerische Landesbank Bilateral Secured Credit Facility - Committed\n$\n200\n \n$\n193\n \n12/31/2025\n$\n200\n \n$\n192\n \n12/31/2024\n(Some amounts may not reconcile due to rounding.)\nBermuda Re Bayerische Landesbank Bilateral Unsecured Letter of Credit Facility\nEffective December 30, 2022, Bermuda Re entered into a new additional letter of credit issuance facility with Bayerische Landesbank, New York Branch, referred to as the “Bermuda Re Bayerische Landesbank Bilateral Unsecured Letter of Credit Facility”.  The Bermuda Re Bayerische Landesbank Bilateral Unsecured Letter of Credit Facility provides for the committed issuance of up to $\n150\n million of unsecured letters of credit and is fully and unconditionally guaranteed by Group, as Parent Guarantor.\nThe following table summarizes the outstanding letters of credit for the periods indicated:  \n(Dollars in millions)\nAt December 31, 2024\nAt December 31, 2023\nLetter of Credit Facility\nCommitment\nIn Use\nDate of Expiry\nCommitment\nIn Use\nDate of Expiry\nBermuda Re Bayerische Landesbank Bilateral Unsecured Credit Facility - Committed\n$\n150\n \n$\n150\n \n12/31/2025\n$\n150\n \n$\n150\n \n12/31/2024\n(Some amounts may not reconcile due to rounding.)\nBermuda Re Lloyd’s Bank Letter of Credit Facility.\nEffective December 27, 2023, Bermuda Re entered into an amended and restated letter of credit issuance facility with Lloyd’s Bank Corporate Markets PLC, to add Ireland Insurance as an account party with access to a $\n15\n million sub-limit for the issuance of letters of credit, an agreement referred to as the “Bermuda Re Lloyd’s Bank Letter of Credit Facility”, which superseded the previous letter of credit issuance facility with Lloyd’s Bank that was effective August 18, 2023.  The Bermuda Re Lloyd’s Bank Letter of Credit Facility provides for the committed issuance of up to $\n250\n million of unsecured letters of credit and is fully and unconditionally guaranteed by Group, as Parent Guarantor.  \nThe following table summarizes the outstanding letters of credit for the periods indicated:  \n(Dollars in millions)\nAt December 31, 2024\nAt December 31, 2023\nLetter of Credit Facility\nCommitment\nIn Use\nDate of Expiry\nCommitment\nIn Use\nDate of Expiry\nBermuda Re Lloyd's Bank Credit Facility-Committed\n$\n250\n \n$\n244\n \n12/31/2025\n$\n250\n \n$\n235\n \n12/31/2024\n(Some amounts may not reconcile due to rounding.)\nBermuda Re Barclays Bank Credit Facility\nEffective November 3, 2021, Bermuda Re entered into a letter of credit issuance facility with Barclays Bank PLC, an agreement referred to as the “Bermuda Re Barclays Credit Facility”.  The Bermuda Re Barclays Credit Facility provides for the committed issuance of up to $\n200\n million of secured letters of credit.  Effective October 30, 2024, the agreement was amended to extend the availability of the committed issuance for \nthree years\n. \nF-42\nTable of Contents\nThe following table summarizes the outstanding letters of credit for the periods indicated: \n(Dollars in millions)\nAt December 31, 2024\nAt December 31, 2023\nLetter of Credit Facility\nCommitment\nIn Use\nDate of Expiry\nCommitment\nIn Use\nDate of Expiry\nBermuda Re Barclays Bilateral Letter of Credit Facility\n$\n200\n \n$\n150\n \n12/30/2025\n$\n200\n \n$\n168\n \n12/30/2024\n—\n \n14\n \n12/31/2025\n—\n \n14\n \n12/31/2024\nTotal Bermuda Re Barclays Bilateral Letter of Credit Facility\n$\n200\n \n$\n164\n \n$\n200\n \n$\n182\n \n(Some amounts may not reconcile due to rounding.)\nBermuda Re Nordea Bank Letter of Credit Facility\nEffective November 21, 2022, Bermuda Re entered into a letter of credit issuance facility with Nordea Bank ABP, New York Branch, referred to as the “Nordea Bank Letter of Credit Facility”.  The Bermuda Re Nordea Bank Letter of Credit Facility provides for the committed issuance of up to $\n200\n million of unsecured letters of credit, and subject to credit approval, uncommitted issuance of $\n100\n million for a maximum total facility amount of $\n300\n million.  \nThe following table summarizes the outstanding letters of credit for the periods indicated:  \n(Dollars in millions)\nAt December 31, 2024\nAt December 31, 2023\nLetter of Credit Facility\nCommitment\nIn Use\nDate of Expiry\nCommitment\nIn Use\nDate of Expiry\nNordea Bank Letter of Credit Facility - Committed\n$\n200\n \n$\n200\n \n12/31/2025\n$\n200\n \n$\n200\n \n12/31/2024\nNordea Bank Letter of Credit Facility - Uncommitted\n100\n \n100\n \n12/31/2025\n100\n \n100\n \n12/31/2024\nTotal Nordea Bank ABP, NY LOC Facility\n$\n300\n \n$\n300\n \n$\n300\n \n$\n300\n \n(Some amounts may not reconcile due to rounding.)\nEverest International Reinsurance, Ltd. Funds at Lloyds Syndicated Letter of Credit Facility\nEffective October 30, 2024, Everest International entered into a letter of credit issuance facility with a syndicate of banks including Lloyds Bank plc, Commerzbank AG, London Branch and ING Bank N.V., London Branch, referred to as the “Funds at Lloyds Syndicated Letter of Credit Facility”. The Everest International Reinsurance Funds at Lloyds Syndicated Letter of Credit Facility provides for the committed issuance of up to £\n113\n million of unsecured letters of credit to support Everest Corporate Member Limited’s Funds at Lloyds requirements.\nThe following table summarizes the outstanding letters of credit for the periods indicated:\n(Dollars in millions)\nAt December 31, 2024\nLetter of Credit Facility\nCommitment\nIn Use\nDate of Expiry\nEverest International Reinsurance, Ltd. Funds at Lloyds Syndicated Letter of Credit Facility\n£\n113\n \n£\n107\n \n11/1/2028\n(Some amounts may not reconcile due to rounding.)\nEverest Reinsurance Company (Ireland), dac Commerzbank Letter of Credit Facility\nEffective December 30, 2024, Ireland Re entered into a letter of credit issuance facility with Commerzbank AG, New York Branch, referred to as the “Commerzbank Letter of Credit Facility”. The Ireland Re Commerzbank Letter of Credit Facility provides for the committed issuance of up to  €\n75\n million of unsecured letters of credit.\nThe following table summarizes the outstanding letters of credit for the periods indicated:\n(Dollars in millions)\nAt December 31, 2024\nLetter of Credit Facility\nCommitment\nIn Use\nDate of Expiry\nEverest Reinsurance Company (Ireland), dac Commerzbank Letter of Credit Facility\n€\n75\n \n€\n20\n \n12/31/2025\n(Some amounts may not reconcile due to rounding.)\nF-43\nTable of Contents\nFederal Home Loan Bank Membership\nEverest Re is a member of the Federal Home Loan Bank of New York (“FHLBNY”), which allows Everest Re to borrow up to \n10\n% of its statutory admitted assets.  As of December 31, 2024, Everest Re had statutory admitted assets of approximately $\n30.8\n billion which provides borrowing capacity of up to approximately $\n3.1\n billion.  As of December 31, 2024, Everest Re had $\n1.0\n billion of borrowings outstanding, which begin to expire in 2025.  Everest Re incurred interest expense of $\n45\n million and $\n30\n million for the years ended December 31, 2024 and 2023, respectively.  The FHLBNY membership agreement requires that \n4.5\n% of borrowed funds be used to acquire additional membership stock. Additionally, the FHLBNY membership agreement requires that members must have sufficient qualifying collateral pledged. As of December 31, 2024, Everest Re had $\n1.3\n billion of collateral pledged.\n \n8.    \nSENIOR NOTES\nThe table below displays Holdings’ outstanding senior notes (the “Senior Notes”).  Fair value is based on quoted market prices, but due to limited trading activity, the Senior Notes are considered Level 2 in the fair value hierarchy.  \nDecember 31, 2024\nDecember 31, 2023\n(Dollars in millions)\nDate Issued\nDate Due\nPrincipal\nAmounts\nConsolidated\nBalance Sheet\nAmount\nFair Value\nConsolidated\nBalance Sheet\nAmount\nFair Value\n4.868\n% Senior notes\n6/5/2014\n6/1/2044\n$\n400\n \n$\n398\n \n$\n347\n \n$\n398\n \n$\n369\n \n3.5\n% Senior notes\n10/7/2020\n10/15/2050\n1,000\n \n982\n \n681\n \n981\n \n742\n \n3.125\n% Senior notes\n10/4/2021\n10/15/2052\n1,000\n \n971\n \n620\n \n970\n \n688\n \n$\n2,400\n \n$\n2,350\n \n$\n1,648\n \n$\n2,349\n \n$\n1,799\n \n(Some amounts may not reconcile due to rounding.)\nInterest expense incurred in connection with the Senior Notes is as follows for the periods indicated: \nYears Ended December 31,\n(Dollars in millions)\nInterest Paid\nPayable Dates\n2024\n2023\n2022\n4.868\n% Senior Notes\nsemi-annually\nJune 1/December 1\n$\n19\n \n$\n19\n \n$\n19\n \n3.5\n% Senior Notes\nsemi-annually\nApril 15/October 15\n35\n \n35\n \n35\n \n3.125\n% Senior Notes\nsemi-annually\nApril 15/October 15\n32\n \n32\n \n32\n \n$\n86\n \n$\n86\n \n$\n86\n \n(Some amounts may not reconcile due to rounding.)\n9.    \nLONG-TERM SUBORDINATED NOTES \nThe table below displays Holdings’ outstanding fixed to floating rate long-term subordinated notes (“Subordinated Notes Issued 2007”).  Fair value is based on quoted market prices, but due to limited trading activity, these Subordinated Notes Issued 2007 are considered Level 2 in the fair value hierarchy.  \nMaturity Date\nDecember 31, 2024\nDecember 31, 2023\n(Dollars in millions)\nDate Issued\nOriginal\nPrincipal\nAmount\nScheduled\nFinal\nConsolidated\nBalance Sheet\nAmount\nFair Value\nConsolidated\nBalance Sheet\nAmount\nFair Value\nSubordinated Notes Issued 2007\n4/26/2007\n$\n400\n \n5/15/2037\n5/1/2067\n$\n218\n \n$\n215\n \n$\n218\n \n$\n187\n \nDuring the fixed rate interest period from May 3, 2007 through May 14, 2017, interest was at the annual rate of \n6.6\n%, payable semi-annually in arrears on November 15 and May 15 of each year, commencing on November 15, 2007.  During the floating rate interest period from May 15, 2017 through maturity, interest was initially on the 3-month London Interbank Offered Rate (“LIBOR”) plus \n238.5\n basis points, reset quarterly, payable quarterly in arrears on February 15, May 15, August 15 and November 15 of each year, subject to Holdings’ right to defer interest on one or more occasions for up to \nten\n consecutive years.  Deferred interest will accumulate interest at the applicable rate compounded quarterly for periods from and including May 15, 2017.  The reset quarterly interest rate for November 15, 2024 to February 18, \nF-44\nTable of Contents\n2025 is \n7.17\n%.  Following the cessation of LIBOR, for periods from and including August 15, 2023, interest will be based on the 3-month Chicago Mercantile Exchange Term Secured Overnight Financing Rate plus a spread.\nHoldings may redeem the Subordinated Notes Issued 2007 on or after May 15, 2017, in whole or in part at \n100\n% of the principal amount plus accrued and unpaid interest; however, redemption on or after the scheduled maturity date and prior to May 1, 2047 is subject to a replacement capital covenant.  This covenant is for the benefit of the Senior Note holders and it mandates that Holdings receive proceeds from the sale of another subordinated debt issue, of at least similar size, before it may redeem the Subordinated Notes Issued 2007.  The Company’s Senior Notes are the Company’s long-term indebtedness that rank senior to the Subordinated Notes Issued 2007.  \nIn 2009, the Company had reduced its outstanding amount of long-term subordinated notes through the initiation of a cash tender offer for any and all of the long-term subordinated notes.  In addition, the Company repurchased and retired $\n6\n million of the outstanding long-term subordinated notes for the year ended December 31, 2022.  The Company realized a gain of $\n1\n million on the repurchases made during 2022.\nInterest expense incurred in connection with these long-term Subordinated Notes Issued 2007 is as follows for the periods indicated:\nYears Ended December 31,\n(Dollars in millions)\n2024\n2023\n2022\nInterest expense incurred\n$\n17\n \n$\n17\n \n$\n9\n \n10.    \nCOLLATERALIZED REINSURANCE, TRUST AGREEMENTS AND OTHER RESTRICTED ASSETS\nThe Company maintains certain restricted assets as security for potential future obligations, primarily to support its underwriting operations.  \nThe following table summarizes the Company’s restricted assets:\nAt December 31,\n(Dollars in millions)\n2024\n2023\nCollateral in trust for non-affiliated agreements\n$\n3,241\n \n$\n3,208\n \nCollateral for secured letter of credit facilities \n1,386\n \n1,438\n \nCollateral for FHLB borrowings\n1,294\n \n1,077\n \nSecurities on deposit with or regulated by government authorities\n1,406\n \n1,447\n \nFunds at Lloyd's\n341\n \n538\n \nFunds held by reinsureds\n1,218\n \n1,135\n \nTotal restricted assets\n$\n8,885\n \n$\n8,843\n \nRestricted cash is included in cash on the consolidated balance sheets. At December 31, 2024 and December 31, 2023, the Company had restricted cash of $\n397\n million and $\n243\n million, respectively.  Total restricted cash includes amounts on deposit in trust accounts for non-affiliated agreements and secured letter of credit facilities.\nThe Company reinsures some of its catastrophe exposures with the segregated accounts of a subsidiary, Mt. Logan Re.  Mt. Logan Re is a collateralized insurer registered in Bermuda and \n100\n% of the voting common shares are owned by Group.  Each segregated account invests predominantly in a diversified set of catastrophe exposures, diversified by risk/peril and across different geographic regions globally.  \nF-45\nTable of Contents\nThe following table summarizes the premiums and losses that are ceded by the Company to Mt. Logan Re segregated accounts and assumed by the Company from Mt. Logan Re segregated accounts.  \nYears Ended December 31,\nMt. Logan Re Segregated Accounts\n2024\n2023\n2022\n(Dollars in millions)\nCeded written premiums\n433\n \n246\n \n201\n \nCeded earned premiums\n376\n \n242\n \n206\n \nCeded losses and LAE\n188\n \n64\n \n191\n \nAssumed written premiums\n10\n \n6\n \n5\n \nAssumed earned premiums\n10\n \n6\n \n5\n \nEffective April 1, 2018, the Company entered into a retroactive reinsurance transaction with one of the Mt. Logan Re segregated accounts to retrocede $\n269\n million of casualty reserves held by Bermuda Re related to accident years 2002 through 2015.  As consideration for entering the agreement, the Company transferred cash of $\n252\n million to the Mt. Logan Re segregated account.  The maximum liability to be retroceded under the agreement will be $\n319\n million. The Company will retain liability for any amounts exceeding the maximum liability.  Effective July 1, 2022, the Company commuted this reinsurance agreement with Mt. Logan segregated account.  \nThe Company entered into various collateralized reinsurance agreements with Kilimanjaro Re Limited (“Kilimanjaro”), a Bermuda-based special purpose reinsurer, to provide the Company with catastrophe reinsurance coverage.  These agreements are multi-year reinsurance contracts which cover named storm and earthquake events.  \nThe table below summarizes the various agreements.  \n(Dollars in millions)\nClass\nDescription\nEffective Date\nExpiration\nDate\nLimit\nCoverage Basis\nSeries 2021-1 Class A-1\nUS, Canada, Puerto Rico – Named Storm and Earthquake Events\n4/8/2021\n4/21/2025\n150\n \nOccurrence\nSeries 2021-1 Class B-1\nUS, Canada, Puerto Rico – Named Storm and Earthquake Events\n4/8/2021\n4/21/2025\n85\n \nAggregate\nSeries 2021-1 Class C-1\nUS, Canada, Puerto Rico – Named Storm and Earthquake Events\n4/8/2021\n4/21/2025\n85\n \nAggregate\nSeries 2021-1 Class A-2\nUS, Canada, Puerto Rico – Named Storm and Earthquake Events\n4/8/2021\n4/20/2026\n150\n \nOccurrence\nSeries 2021-1 Class B-2\nUS, Canada, Puerto Rico – Named Storm and Earthquake Events\n4/8/2021\n4/20/2026\n90\n \nAggregate\nSeries 2021-1 Class C-2\nUS, Canada, Puerto Rico – Named Storm and Earthquake Events\n4/8/2021\n4/20/2026\n90\n \nAggregate\nSeries 2022-1 Class A\nUS, Canada, Puerto Rico – Named Storm and Earthquake Events\n6/22/2022\n6/25/2025\n300\n \nAggregate\nSeries 2024-1 Class A\nUS, Canada, Puerto Rico – Named Storm and Earthquake Events\n6/27/2024\n6/30/2028\n75\n \nOccurrence\nSeries 2024-1 Class B\nUS, Canada, Puerto Rico – Named Storm and Earthquake Events\n6/27/2024\n6/30/2028\n125\n \nOccurrence\nTotal available limit as of December 31, 2024\n$\n1,150\n \nRecoveries under these collateralized reinsurance agreements with Kilimanjaro are primarily dependent on estimated industry level insured losses from covered events, as well as the geographic location of the events.  The estimated industry level of insured losses is obtained from published estimates by an independent recognized authority on insured property losses.  \nKilimanjaro has financed the various property catastrophe reinsurance coverages by issuing catastrophe bonds to unrelated, external investors.  The proceeds from the issuance of the catastrophe bonds are held in reinsurance trusts throughout the duration of the applicable reinsurance agreements and invested solely in U.S. government money market funds with a rating of at least “AAAm” by Standard & Poor’s. The catastrophe bonds’ issue dates, maturity dates and amounts correspond to the reinsurance agreements listed above.\n11.    \nCOMMITMENTS AND CONTINGENCIES\nIn the ordinary course of business, the Company is involved in lawsuits, arbitrations and other formal and informal dispute resolution procedures, the outcomes of which will determine the Company’s rights and obligations under insurance and reinsurance agreements.  In some disputes, the Company seeks to enforce its rights under an agreement or to collect funds owing to it.  In other matters, the Company is resisting attempts by others to collect funds or enforce alleged rights.  These disputes arise from time to time and are ultimately resolved through both informal and formal means, including negotiated resolution, arbitration and litigation.  In all such matters, the Company believes that its \nF-46\nTable of Contents\npositions are legally and commercially reasonable.  The Company considers the statuses of these proceedings when determining its reserves for unpaid loss and LAE. \nAside from litigation and arbitrations related to these insurance and reinsurance agreements, the Company is not a party to any other material litigation or arbitration. \nThe Company has entered into separate annuity agreements with The Prudential Insurance of America (“The Prudential”), an unaffiliated life insurance company, as well as an additional unaffiliated life insurance company in which the Company has either purchased annuity contracts or become the assignee of annuity proceeds that are meant to settle claim payment obligations in the future.  In both instances, the Company would become contingently liable if either The Prudential or the unaffiliated life insurance company was unable to make payments related to the respective annuity contract.\nThe table below presents the estimated cost to replace all such annuities for which the Company was contingently liable for the periods indicated:\nAt December 31,\n(Dollars in millions)\n2024\n2023\nThe Prudential\n$\n136\n \n$\n136\n \nOther unaffiliated life insurance company\n$\n32\n \n$\n34\n \n12.    \nLEASES\nThe Company enters into lease agreements for real estate that is primarily used for office space in the ordinary course of business.  These leases are accounted for as operating leases, whereby lease expense is recognized on a straight-line basis over the term of the lease.  Most leases include an option to extend or renew the lease term.  The exercise of the renewal is at the Company’s discretion.  The operating lease liability includes lease payments related to options to extend or renew the lease term if the Company is reasonably certain of exercise those options.  The Company, in determining the present value of lease payments utilizes either the rate implicit in the lease if that rate is readily determinable or the Company’s incremental secured borrowing rate commensurate with terms of the underlying lease.\nSupplemental information related to operating leases is as follows for the periods indicated:\n \nYear Ended December 31,\n(Dollars in millions)\n2024\n2023\nLease expense incurred:\nOperating lease cost\n$\n32\n \n$\n30\n \nAt December 31,\n(Dollars in millions)\n2024\n2023\nOperating lease right of use assets \n(1)\n$\n108\n \n$\n123\n \nOperating lease liabilities \n(1)\n126\n \n143\n \n(1)\n Operating lease right of use assets and operating lease liabilities are included within other assets and other liabilities on the Company’s consolidated balance sheets, respectively.\nYear Ended December 31,\n(Dollars in millions)\n2024\n2023\nOperating cash flows from operating leases\n$\n(\n24\n)\n$\n(\n22\n)\nAt December 31,\n2024\n2023\nWeighted average remaining operating lease term\n9.2\n years\n9.8\n years\nWeighted average discount rate on operating leases\n4.14\n \n%\n4.03\n \n%\nF-47\nTable of Contents\nMaturities of the existing lease liabilities are expected to occur as follows:  \n(Dollars in millions)\nAs of December 31,\n2025\n$\n21\n \n2026\n20\n \n2027\n17\n \n2028\n14\n \n2029\n13\n \nThereafter\n67\n \nUndiscounted lease payments\n152\n \nLess:  present value adjustment\n25\n \nTotal operating lease liability\n$\n126\n \n(Some amounts may not reconcile due to rounding.)\n13.    \nOTHER COMPREHENSIVE INCOME (LOSS)\nThe following table presents the components of other comprehensive income (loss) in the consolidated statements of operations for the periods indicated: \nYears Ended December 31,\n2024\n2023\n2022\n(Dollars in millions)\nBefore Tax\nTax Effect\nNet of Tax\nBefore Tax\nTax Effect\nNet of Tax\nBefore Tax\nTax Effect\nNet of Tax\nURA(D) of securities\n (1)\n$\n(\n167\n)\n$\n70\n \n$\n(\n97\n)\n$\n843\n \n$\n(\n101\n)\n$\n743\n \n$\n(\n2,332\n)\n$\n295\n \n$\n(\n2,037\n)\nReclassification of net realized losses (gains)\n  included in net income (loss) \n(1)\n(\n18\n)\n6\n \n(\n12\n)\n285\n \n(\n41\n)\n244\n \n107\n \n(\n18\n)\n89\n \nForeign currency translation and other adjustments\n(\n139\n)\n11\n \n(\n128\n)\n64\n \n(\n5\n)\n59\n \n(\n82\n)\n5\n \n(\n77\n)\nBenefit plan actuarial net gain (loss)\n43\n \n(\n9\n)\n34\n \n19\n \n(\n4\n)\n15\n \n18\n \n(\n4\n)\n15\n \nReclassification of benefit plan liability amortization\n included in net income (loss)\n(\n2\n)\n—\n \n(\n1\n)\n2\n \n—\n \n2\n \n3\n \n(\n1\n)\n2\n \nTotal other comprehensive income (loss)\n$\n(\n283\n)\n$\n79\n \n$\n(\n204\n)\n$\n1,214\n \n$\n(\n151\n)\n$\n1,063\n \n$\n(\n2,285\n)\n$\n277\n \n$\n(\n2,008\n)\n(Some amounts may not reconcile due to rounding.)\n(1) \n    URA(D) of securities and Reclassification of net realized losses (gains) included in net income (loss) include URA(D) of fixed maturity, available for sale securities and equity method investments.\nThe following table presents details of the amounts reclassified from accumulated other comprehensive income (loss) (“AOCI”) for the periods indicated:\nYears Ended\nDecember 31,\nAffected line item within the statements of \noperations and comprehensive income (loss)\nAOCI component\n2024\n2023\n(Dollars in millions)\nURA(D) of securities\n (1)\n$\n(\n18\n)\n$\n285\n \nNet gains (losses) on investments\n6\n \n(\n41\n)\nIncome tax expense (benefit)\n$\n(\n12\n)\n$\n244\n \nNet income (loss)\nBenefit plan net gain (loss)\n$\n(\n2\n)\n$\n2\n \nOther underwriting expenses\n—\n \n—\n \nIncome tax expense (benefit)\n$\n(\n1\n)\n$\n2\n \nNet income (loss)\n(Some amounts may not reconcile due to rounding.)\n(1)  \n   URA(D) of securities includes URA(D) of fixed maturity, available for sale securities and equity method investments.\nF-48\nTable of Contents\nThe following table presents the components of accumulated other comprehensive income (loss), net of tax, in the consolidated balance sheets for the periods indicated:\nYears Ended\nDecember 31,\n(Dollars in millions)\n2024\n2023\nBeginning balance of URA(D) of securities \n(1)\n$\n(\n723\n)\n$\n(\n1,709\n)\nCurrent period change in URA(D) of securities\n(\n109\n)\n986\n \nEnding balance of URA(D) of securities\n(\n831\n)\n(\n723\n)\nBeginning balance of foreign currency translation and other adjustments\n(\n195\n)\n(\n254\n)\nCurrent period change in foreign currency translation and other adjustments\n(\n128\n)\n59\n \nEnding balance of foreign currency translation and other adjustments\n(\n323\n)\n(\n195\n)\nBeginning balance of benefit plan net gain (loss)\n(\n16\n)\n(\n33\n)\nCurrent period change in benefit plan net gain (loss)\n33\n \n17\n \nEnding balance of benefit plan net gain (loss)\n16\n \n(\n16\n)\nEnding balance of accumulated other comprehensive income (loss)\n$\n(\n1,138\n)\n$\n(\n934\n)\n(Some amounts may not reconcile due to rounding.)\n(1) \n    URA(D) of securities includes URA(D) of fixed maturity, available for sale securities and equity method investments.\n14.    \nSHARE-BASED COMPENSATION PLANS\nThe Company has a 2020 Stock Incentive Plan (“2020 Employee Plan”), a 2009 Non-Employee Director Stock Option and Restricted Stock Plan (“2009 Director Plan”) and a 2003 Non-Employee Director Equity Compensation Plan (“2003 Director Plan”).\nThe 2020 Employee Plan was established in June 2020.  Under the 2020 Employee Plan, \n1,400,000\n common shares have been authorized to be granted as non-qualified share options, share appreciation rights, restricted share awards or performance share unit (“PSU”) awards to officers and key employees of the Company.  At December 31, 2024, there were \n554,882\n remaining shares available to be granted under the 2020 Employee Plan.  Through December 31, 2024, only non-qualified share options, restricted share awards and PSU awards had been granted under the employee plans. Under the 2009 Director Plan, \n37,439\n common shares have been authorized to be granted as share options or restricted share awards to non-employee directors of the Company.  At December 31, 2024, there were \n34,617\n remaining shares available to be granted under the 2009 Director Plan.  Under the 2003 Director Plan, \n500,000\n common shares have been authorized to be granted as share options or share awards to non-employee directors of the Company.  At December 31, 2024, there were \n264,704\n remaining shares available to be granted under the 2003 Director Plan.  \nOptions and restricted shares granted under the 2020 Employee Plan prior to January 1, 2024 vest at the earliest of \n20\n% per year over \nfive years\n or in accordance with any applicable employment agreement.  Restricted shares granted under the 2020 Employee Plan after January 1, 2024 vest at the earliest of \n33.3\n% per year over \nthree years\n or in accordance with any applicable employment agreement. Options and restricted shares granted under the 2003 Director Plan generally vest at \n33\n% per year over \nthree years\n, unless an alternate vesting period is authorized by the Board. Options and restricted shares granted under the 2009 Director Plan will vest as provided in the award agreement.  All options are exercisable at fair market value of the stock at the date of grant and expire \nten years\n after the date of grant.\nPSU awards granted under the 2020 Employee Plan will vest \n100\n% after \nthree years\n. The PSU awards represent the right to receive between \n0\n and \n1.75\n shares of stock for each unit awarded depending upon performance in relation to certain metrics. The PSU valuation will be based partly on growth in book value per share over the \nthree year\n vesting period, compared to designated peer companies.  The remaining portion of the PSU valuation will be based upon operating return on equity for each of the separate operating years within the vesting period.\nFor share options, restricted shares and PSU awards granted under the 2020 Employee Plan, the 2009 Director Plan and the 2003 Director Plan, share-based compensation expense recognized in the consolidated statements of operations and comprehensive income (loss) was $\n63\n million, $\n49\n million and $\n45\n million for the years ended December 31, 2024, 2023 \nF-49\nTable of Contents\nand 2022, respectively.  The corresponding income tax benefit recorded in the consolidated statements of operations and comprehensive income (loss) for share-based compensation was $\n8\n million, $\n7\n million and $\n4\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\nFor the year ended December 31, 2024, a total of \n222,196\n shares of restricted stock were granted on February 28, 2024, February 29, 2024, May 15, 2024, September 12, 2024 and November 7, 2024, with a fair value of $\n369.52\n, $\n367.04\n, $\n377.80\n, $\n376.58\n and $\n365.61\n per share, respectively.  Additionally, \n18,713\n PSU awards were granted on February 28, 2024, with a fair value of $\n369.52\n per unit.  \nNo\n share options were granted during the year ended December 31, 2024.  For share options granted during previous years, the fair value per option was calculated on the date of the grant using the Black-Scholes option valuation model.\nThe Company recognizes, as an increase to additional paid-in capital, a realized income tax benefit from dividends, charged to retained earnings and paid to employees on equity classified non-vested equity shares.  In addition, the amount recognized in additional paid-in capital for the realized income tax benefit from dividends on those awards is included in the pool of excess tax benefits available to absorb tax deficiencies on share-based payment awards.  For the years ended December 31, 2024, 2023 and 2022, the Company recognized $\n0.6\n million, $\n0.5\n million and $\n0.6\n million, respectively, of additional paid-in capital due to tax benefits from dividends on restricted shares.\nThere have been \nno\n stock options granted since 2012.  As of December 31, 2024, there were \nno\n stock options outstanding.  Any remaining stock options were exercised in 2022.  The aggregate intrinsic value (market price less exercise price) of options exercised during 2022 was $\n10\n million.  The cash received from the exercised share options during 2022 was $\n4\n million.  The tax benefit realized from the options exercised during 2022 was $\n2\n million.  \nThe following table summarizes the status of the Company’s restricted non-vested shares and changes for the periods indicated:\nYears Ended December 31,\n2024\n2023\n2022\nRestricted (non-vested) Shares\nShares\nWeighted-\nAverage\nGrant Date\nFair Value\nShares\nWeighted-\nAverage\nGrant Date\nFair Value\nShares\nWeighted-\nAverage\nGrant Date\nFair Value\nOutstanding at January 1,\n461,537\n$\n313.05\n \n479,630\n$\n268.82\n \n496,094\n$\n247.76\n \nGranted\n222,196\n369.62\n \n181,646\n382.01\n \n203,598\n300.38\n \nVested\n147,655\n292.15\n \n155,110\n261.60\n \n162,579\n246.41\n \nForfeited\n68,893\n333.54\n \n44,629\n297.23\n \n57,483\n262.28\n \nOutstanding at December 31,\n467,185\n343.53\n \n461,537\n313.05\n \n479,630\n268.82\n \nAs of December 31, 2024, there was $\n113\n million of total unrecognized compensation cost related to non-vested share-based compensation expense.  That cost is expected to be recognized over a weighted-average period of \n2.4\n years. The total fair value of shares vested during the years ended December 31, 2024, 2023 and 2022, was $\n43\n million, $\n41\n million and $\n40\n million, respectively.  The tax benefit realized from the shares vested for the years ended December 31, 2024, 2023 and 2022 were $\n9\n million, $\n11\n million and $\n9\n million, respectively. \nIn addition to the 2020 Employee Plan, the 2009 Director Plan and the 2003 Director Plan, Group issued \n324\n common shares in 2024, \n447\n common shares in 2023 and \n774\n common shares in 2022 to the Company’s non-employee directors as compensation for their service as directors.  These issuances had aggregate values of $\n0.1\n million, $\n0.2\n million and $\n0.2\n million in 2024, 2023 and 2022.\nThe Company acquired \n54,537\n, \n56,832\n and \n69,833\n common shares at a cost of $\n20\n million, $\n22\n million and $\n21\n million in 2024, 2023 and 2022, respectively, from employees who chose to pay required withholding taxes and/or the exercise cost on option exercises or restricted share vestings by withholding shares.\nF-50\nTable of Contents\nThe following table summarizes the status of the Company’s non-vested PSU awards and changes for the period indicated:\nYears Ended December 31,\n2024\n2023\n2022\nPerformance Share Unit Awards\nShares\nWeighted-\nAverage\nGrant Date\nFair Value\nShares\nWeighted-\nAverage\nGrant Date\nFair Value\nShares\nWeighted-\nAverage\nGrant Date\nFair Value\nOutstanding at January 1,\n51,000\n$\n—\n \n54,861\n$\n—\n \n50,495\n$\n—\n \nGranted\n18,713\n369.52\n \n14,975\n382.39\n \n18,340\n301.54\n \nIncrease/(Decrease) on vesting units due to performance\n8,354\n—\n \n(\n4,063\n)\n—\n \n3,028\n—\n \nVested\n24,053\n386.81\n \n14,023\n340.44\n \n15,919\n274.37\n \nForfeited\n1,332\n—\n \n750\n—\n \n1,083\n—\n \nOutstanding at December 31,\n52,682\n—\n \n51,000\n—\n \n54,861\n—\n \nThe Company acquired \n11,336\n, \n6,117\n and \n6,175\n common shares at a cost of $\n4\n million, $\n2\n million and $\n2\n million in 2024, 2023 and 2022, respectively, from employees who chose to pay required withholding taxes on PSU settlements by withholding shares.\n15.    \nEMPLOYEE BENEFIT PLANS\nDefined Benefit Pension Plans.\nThe Company maintains both qualified and non-qualified defined benefit pension plans for its U.S. employees employed prior to April 1, 2010.  Generally, the Company computes the benefits based on average earnings over a period prescribed by the plans and credited length of service.  The Company’s non-qualified defined benefit pension plan provided compensating pension benefits for participants whose benefits have been curtailed under the qualified plan due to the U.S. Internal Revenue Code (the “IRC”) limitations.  Effective January 1, 2018, participants of the Company’s non-qualified defined benefit pension plan no longer accrue additional service benefits. Additionally, on November 15, 2023, the Company's Board approved the termination of the qualified defined benefit pension plan. In June 2024, the Company amended the qualified defined benefit pension plan to freeze all benefits accruals and terminate the plan effective June 30, 2024.  Plan participants no longer accrue future plan benefits after June 30, 2024.\nPlan assets consist primarily of shares in investment trusts with \n100\n% of the underlying assets consisting of short-term investments.  The Company manages the qualified plan investments for U.S. employees.\nAlthough not required to make contributions under U.S. Internal Revenue Service (the “IRS”) regulations, the following table summarizes the Company’s contributions to the defined benefit pension plans for the periods indicated:\nYears Ended December 31,\n(Dollars in millions)\n2024\n2023\n2022\nCompany contributions\n$\n3\n \n$\n1\n \n$\n6\n \nThe following table summarizes the Company’s pension expense for the periods indicated:\nYears Ended December 31,\n(Dollars in millions)\n2024\n2023\n2022\nPension expense\n$\n(\n15\n)\n$\n5\n \n$\n(\n2\n)\nF-51\nTable of Contents\nThe following table summarizes the status of these defined benefit plans for U.S. employees for the periods indicated:\nYears Ended December 31,\n(Dollars in millions)\n2024\n2023\nChange in projected benefit obligation:\nBenefit obligation at beginning of year\n$\n295\n \n$\n291\n \nService cost\n3\n \n5\n \nInterest cost\n14\n \n14\n \nActuarial (gain)/loss\n(\n17\n)\n9\n \nCurtailment\n(\n21\n)\n—\n \nBenefits paid\n(\n15\n)\n(\n25\n)\nProjected benefit obligation at end of year\n259\n \n295\n \nChange in plan assets:\nFair value of plan assets at beginning of year\n308\n \n285\n \nActual return on plan assets\n35\n \n48\n \nActual contributions during the year\n3\n \n1\n \nBenefits paid\n(\n15\n)\n(\n25\n)\nFair value of plan assets at end of year\n331\n \n308\n \nFunded status at end of year\n$\n73\n \n$\n13\n \n(Some amounts may not reconcile due to rounding.)\nAmounts recognized in the consolidated balance sheets for the periods indicated:\nAt December 31,\n(Dollars in millions)\n2024\n2023\nOther assets (due beyond one year)\n$\n76\n \n$\n19\n \nOther liabilities (due within one year)\n(\n1\n)\n(\n3\n)\nOther liabilities (due beyond one year)\n(\n3\n)\n(\n3\n)\nNet amount recognized in the consolidated balance sheets\n$\n73\n \n$\n13\n \n(Some amounts may not reconcile due to rounding.)\nAmounts not yet reflected in net periodic benefit cost and included in accumulated other comprehensive income (loss) for the periods indicated:\nAt December 31,\n(Dollars in millions)\n2024\n2023\nAccumulated income (loss)\n$\n9\n \n$\n(\n33\n)\nAccumulated other comprehensive income (loss)\n$\n9\n \n$\n(\n33\n)\n(Some amounts may not reconcile due to rounding.)\nF-52\nTable of Contents\nOther changes in other comprehensive income (loss) for the periods indicated are as follows:\nYears Ended December 31,\n(Dollars in millions)\n2024\n2023\nOther comprehensive income (loss) at December 31, prior year\n$\n(\n33\n)\n$\n(\n56\n)\nNet gain (loss) arising during period\n51\n \n19\n \nRecognition of amortizations in net periodic benefit cost:\nActuarial loss\n(\n9\n)\n4\n \nCurtailment loss recognized\n—\n \n—\n \nOther comprehensive income (loss) at December 31, current year\n$\n9\n \n$\n(\n33\n)\n(Some amounts may not reconcile due to rounding.)\nNet periodic benefit cost for U.S. employees included the following components for the periods indicated:\nYears Ended December 31,\n(Dollars in millions)\n2024\n2023\n2022\nService cost\n$\n3\n \n$\n5\n \n$\n9\n \nInterest cost\n14\n \n14\n \n10\n \nExpected return on assets\n(\n22\n)\n(\n19\n)\n(\n25\n)\nAmortization of actuarial loss from earlier periods\n—\n \n4\n \n4\n \nSettlement\n(\n9\n)\n—\n \n1\n \nNet periodic benefit cost\n$\n(\n15\n)\n$\n5\n \n$\n(\n2\n)\nOther changes recognized in other comprehensive income (loss):\nOther comprehensive income (loss) attributable to change from prior year\n(\n42\n)\n(\n23\n)\nTotal recognized in net periodic benefit cost and other\ncomprehensive income (loss)\n$\n(\n57\n)\n$\n(\n18\n)\n(Some amounts may not reconcile due to rounding.)\nThe weighted average discount rates used to determine net periodic benefit cost for 2024, 2023 and 2022 were \n5.00\n%, \n5.25\n% and \n2.86\n%, respectively.  The rate of compensation increase used to determine the net periodic benefit cost for January 2024 through April 2024 was \n4.00\n%. The net periodic benefit cost was remeasured at May 1, 2024 due to plan curtailment. Rate of compensation increase is not applicable to calculate the net periodic benefit cost for May 2024 through December 2024.  The rate of compensation increase used to determine the net periodic benefit cost for 2023 and 2022 was \n4.00\n%.  The expected long-term rate of return on plan assets for 2024, 2023 and 2022 was \n7.25\n%, \n7.00\n% and \n6.75\n% respectively.\nThe weighted average discount rates used to determine the actuarial present value of the projected benefit obligation for 2023 and 2022 were \n5.00\n% and \n5.25\n%, respectively.  In 2024, the weighted average discount rate used to determine the actuarial present value of the projected benefit obligation, based on plan termination rates, was \n4.75\n% for annuities and ranged from \n4.66\n% to \n5.57\n% for lump sums.\nThe following table summarizes the accumulated benefit obligation for the periods indicated:\nAt December 31,\n(Dollars in millions)\n2024\n2023\nQualified Plan\n$\n255\n \n$\n263\n \nNon-qualified Plan\n3\n \n6\n \nTotal\n$\n259\n \n$\n269\n \n(Some amounts may not reconcile due to rounding.)\nF-53\nTable of Contents\nThe following table displays the plans with projected benefit obligations in excess of plan assets for the periods indicated:\nAt December 31,\n(Dollars in millions)\n2024\n2023\nNon-qualified Plan\nProjected benefit obligation\n$\n3\n \n$\n6\n \nFair value of plan assets\n—\n \n—\n \nThe following table displays the plans with accumulated benefit obligations in excess of plan assets for the periods indicated:\nAt December 31,\n(Dollars in millions)\n2024\n2023\nNon-qualified Plan\nAccumulated benefit obligation\n$\n3\n \n$\n6\n \nFair value of plan assets\n—\n \n—\n \nThe following table displays the expected benefit payments in the periods indicated:\n(Dollars in millions)\n2025\n$\n256\n \n2026\n1\n \n2027\n1\n \n2028\n—\n \n2029\n—\n \nNext 5 years\n1\n \nF-54\nTable of Contents\nThe following tables present the fair value measurement levels for the qualified plan assets at fair value for the periods indicated:\nFair Value Measurement Using:\n(Dollars in millions)\nDecember 31, 2024\nQuoted Prices\nin Active\nMarkets for\nIdentical\nAssets\n(Level 1)\nSignificant\nOther\nObservable\nInputs\n(Level 2)\nSignificant\nUnobservable\nInputs\n(Level 3)\nAssets:\nShort-term investments, which approximates fair value (a)\n$\n331\n \n$\n331\n \n$\n—\n \n$\n—\n \nTotal\n$\n331\n \n$\n331\n \n$\n—\n \n$\n—\n \n(Some amounts may not reconcile due to rounding.)\n(a)\nThis category includes high quality, short-term money market instruments, which are issued and payable in U.S. dollars.\nFair Value Measurement Using:\n(Dollars in millions)\nDecember 31, 2023\nQuoted Prices\nin Active\nMarkets for\nIdentical\nAssets\n(Level 1)\nSignificant\nOther\nObservable\nInputs\n(Level 2)\nSignificant\nUnobservable\nInputs\n(Level 3)\nAssets:\nShort-term investments, which approximates fair value (a)\n$\n2\n \n$\n2\n \n$\n—\n \n$\n—\n \nMutual funds, fair value\nFixed income (b)\n73\n \n73\n \n—\n \n—\n \nEquities (c)\n232\n \n232\n \n—\n \n—\n \nTotal\n$\n308\n \n$\n308\n \n$\n—\n \n$\n—\n \n(Some amounts may not reconcile due to rounding.)\n(a)\nThis category includes high quality, short-term money market instruments, which are issued and payable in U.S. dollars.\n(b)\nThis category includes fixed income funds, which invest in investment grade securities of corporations, governments and government agencies with approximately \n90\n% in U.S. securities and \n10\n% in international securities.\n(c)\nThis category includes funds, which invest in small, mid and multi-cap equity securities including common stocks, securities convertible into common stock and securities with common stock characteristics, such as rights and warrants, with approximately \n100\n% in U.S. equities.\nNo\n contributions were made to the qualified pension benefit plan for the years ended December 31, 2024 and 2023.\nDefined Contribution Plans.\nThe Company also maintains both qualified and non-qualified defined contribution plans (“Savings Plan” and “Non-Qualified Savings Plan”, respectively) covering U.S. employees.  Under the plans, the Company contributes up to a maximum \n3\n% of the participants’ compensation based on the contribution percentage of the employee.  The Non-Qualified Savings Plan provides compensating savings plan benefits for participants whose benefits have been curtailed under the Savings Plan due to IRC limitations.  In addition, effective for new hires (and rehires) on or after April 1, 2010, the Company will contribute between \n3\n% and \n8\n% of an employee’s earnings for each payroll period based on the employee’s age.  These contributions will be \n100\n% vested after \nthree years\n.  The Company incurred expenses related to these plans of $\n26\n million, $\n22\n million and $\n18\n million for the years ended December 31, 2024, 2023 and 2022, respectively. \nIn addition, the Company maintains several defined contribution pension plans covering non-U.S. employees.  Each international office maintains a separate plan for the non-U.S. employees working in that location.  The Company contributes various amounts based on salary, age and/or years of service.  In the current year, the contributions as a percentage of salary for the international offices ranged from \n5.3\n% to \n33.5\n%.  The contributions are generally used to purchase pension benefits from local insurance providers.  The Company incurred expenses related to these plans of $\n9\n million, $\n6\n million and $\n4\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\nPost-Retirement Plan.\nThe Company sponsors a Retiree Health Plan for employees employed prior to April 1, 2010.  This plan provides healthcare benefits for eligible retired employees (and their eligible dependents), who have elected coverage.  The Company anticipates that most covered employees will become eligible for these benefits if they retire while working for \nF-55\nTable of Contents\nthe Company.  The cost of these benefits is shared with the retiree.  The Company accrues the post-retirement benefit expense during the period of the employee’s service.  A medical cost trend rate of \n6.75\n% in 2024 was assumed to decrease gradually to \n4.75\n% in 2030 and then remain at that level.  The Company incurred expenses of $(\n0.4\n) million, $(\n1\n) million and $\n1\n million for the years ended December 31, 2024, 2023 and 2022, respectively.  \nThe following table summarizes the status of this plan for the periods indicated:\nAt December 31,\n(Dollars in millions)\n2024\n2023\nChange in projected benefit obligation:\nBenefit obligation at beginning of year\n$\n22\n \n$\n21\n \nService cost\n—\n \n1\n \nInterest cost\n1\n \n1\n \nAmendments\n—\n \n—\n \nActuarial (gain)/loss\n(\n1\n)\n(\n1\n)\nBenefits paid\n(\n1\n)\n—\n \nBenefit obligation at end of year\n21\n \n22\n \nChange in plan assets:\nFair value of plan assets at beginning of year\n—\n \n—\n \nEmployer contributions\n1\n \n—\n \nBenefits paid\n(\n1\n)\n—\n \nFair value of plan assets at end of year\n—\n \n—\n \nFunded status at end of year\n$\n(\n21\n)\n$\n(\n22\n)\nAmounts recognized in the consolidated balance sheets for the periods indicated:\nAt December 31,\n(Dollars in millions)\n2024\n2023\nOther liabilities (due within one year)\n$\n(\n1\n)\n$\n(\n1\n)\nOther liabilities (due beyond one year)\n(\n21\n)\n(\n21\n)\nNet amount recognized in the consolidated balance sheets\n$\n(\n21\n)\n$\n(\n22\n)\n(Some amounts may not reconcile due to rounding.)\nAmounts not yet reflected in net periodic benefit cost and included in accumulated other comprehensive income (loss) for the periods indicated:\nAt December 31,\n(Dollars in millions)\n2024\n2023\nAccumulated income (loss)\n$\n11\n \n$\n11\n \nAccumulated prior service credit (cost)\n—\n \n1\n \nAccumulated other comprehensive income (loss)\n$\n12\n \n$\n12\n \nF-56\nTable of Contents\nOther changes in other comprehensive income (loss) for the periods indicated are as follows:\nYears Ended December 31,\n(Dollars in millions)\n2024\n2023\nOther comprehensive income (loss) at December 31, prior year\n$\n12\n \n$\n14\n \nNet gain (loss) arising during period\n1\n \n1\n \nPrior Service credit (cost) arising during period\n—\n \n—\n \nRecognition of amortizations in net periodic benefit cost:\nActuarial loss (gain)\n(\n1\n)\n(\n2\n)\nPrior service cost\n—\n \n—\n \nOther comprehensive income (loss) at December 31, current year\n$\n12\n \n$\n12\n \nNet periodic benefit cost included the following components for the periods indicated:\nYears Ended December 31,\n(Dollars in millions)\n2024\n2023\n2022\nService cost\n$\n—\n \n$\n1\n \n$\n1\n \nInterest cost\n1\n \n1\n \n1\n \nPrior service credit recognition\n—\n \n—\n \n—\n \nNet gain recognition\n(\n1\n)\n(\n2\n)\n—\n \nNet periodic cost\n$\n—\n \n$\n(\n1\n)\n$\n1\n \nOther changes recognized in other comprehensive income (loss):\nOther comprehensive gain (loss) attributable to change from prior year\n1\n \n2\n \nTotal recognized in net periodic benefit cost and\nother comprehensive income (loss)\n$\n—\n \n$\n1\n \n(Some amounts may not reconcile due to rounding.)\nThe weighted average discount rates used to determine net periodic benefit cost for 2024, 2023 and 2022 were \n5.00\n%, \n5.25\n% and \n2.86\n%, respectively.\nThe weighted average discount rates used to determine the actuarial present value of the projected benefit obligation at year-end 2024, 2023 and 2022 were \n5.64\n%, \n5.00\n% and \n5.25\n%, respectively.\nThe following table displays the expected benefit payments in the years indicated:\n(Dollars in millions)\n2025\n$\n1\n \n2026\n1\n \n2027\n1\n \n2028\n1\n \n2029\n1\n \nNext 5 years\n7\n \n16.    \nINCOME TAXES\nOn December 27, 2023, the Government of Bermuda enacted the Corporate Income Tax Act 2023 (“The 2023 Act”), which will apply a 15% corporate income tax to certain Bermuda businesses in fiscal years beginning on or after January 1, 2025. The 2023 Act includes a provision referred to as “The Economic Transition Adjustment” (the “ETA”), which is intended to provide a fair and equitable transition into the new tax regime, and results in a deferred tax benefit for the Company. However, on January 15, 2025, the OECD issued Guidance related to “deferred tax assets arising from tax benefits provided by General Government” whereby it has restricted the utilization of those deferred tax benefits against the computation of its Pillar Two Global Minimum Taxes to approximately 20% of the originally calculated amounts and only for a grace period of two years through 2026.  If the Bermuda Ministry of Finance amends The 2023 Act in response \nF-57\nTable of Contents\nto this Guidance, the exact impact of any such amendments is uncertain but there is a risk that it results in a reduction in the Company's Deferred Tax Assets.\nAll of the income of Group's non-Bermuda subsidiaries is subject to the applicable federal, foreign, state and local taxes on corporations. Additionally, the income of the foreign branches of the Company's insurance operating companies is subject to various rates of income tax. Group's U.S. subsidiaries conduct business in and are subject to taxation in the U.S. Should the U.S. subsidiaries distribute current or accumulated earnings and profits in the form of dividends or otherwise, the Company would be subject to an accrual of \n5\n% U.S. withholding tax. Currently, however, no withholding tax has been accrued with respect to such un-remitted earnings as management has no intention of remitting them. The cumulative amount that would be subject to withholding tax, if distributed, is not practicable to compute. The provision for income taxes in the consolidated statement of operations and comprehensive income (loss) has been determined in accordance with the individual income of each entity and the respective applicable tax laws. The provision reflects the permanent differences between financial and taxable income relevant to each entity.\nThe significant components of the provision are as follows for the periods indicated:\nYears Ended December 31,\n(Dollars in millions)\n2024\n2023\n2022\nCurrent tax expense (benefit):\nU.S.\n$\n152\n \n$\n284\n \n$\n76\n \nNon-U.S.\n19\n \n7\n \n5\n \nTotal current tax expense (benefit)\n171\n \n291\n \n81\n \nDeferred tax expense (benefit):\nU.S.\n(\n52\n)\n(\n76\n)\n(\n90\n)\nNon-U.S.\n1\n \n(\n578\n)\n—\n \nTotal deferred tax expense (benefit)\n(\n51\n)\n(\n654\n)\n(\n90\n)\nTotal income tax expense (benefit)\n$\n120\n \n$\n(\n363\n)\n$\n(\n9\n)\n(Some amounts may not reconcile due to rounding.)\nF-58\nTable of Contents\nThe weighted average expected tax provision has been calculated using the pre-tax income (loss) in each jurisdiction multiplied by that jurisdiction's applicable statutory tax rate. \nReconciliation of the difference between the provision for income taxes and the expected tax provision at the weighted average tax rate for the periods indicated is provided below:\nYears Ended December 31,\n2024\n2023\n2022\n(Dollars in millions)\nU.S.\nNon-U.S.\nU.S.\nNon-U.S.\nU.S.\nNon-U.S.\nUnderwriting gain (loss)\n$\n(\n891\n)\n$\n536\n \n$\n533\n \n$\n686\n \n$\n(\n81\n)\n$\n558\n \nNet investment income\n1,219\n \n734\n \n954\n \n479\n \n607\n \n223\n \nNet realized capital gains (losses)\n34\n \n(\n15\n)\n(\n190\n)\n(\n86\n)\n(\n426\n)\n(\n29\n)\nNet derivative gain (loss)\n—\n \n—\n \n—\n \n1\n \n—\n \n—\n \nCorporate expenses\n(\n19\n)\n(\n76\n)\n(\n18\n)\n(\n55\n)\n(\n26\n)\n(\n35\n)\nInterest, fee and bond issue cost amortization expense\n(\n150\n)\n1\n \n(\n134\n)\n—\n \n(\n101\n)\n—\n \nOther income (expense)\n64\n \n57\n \n(\n13\n)\n(\n3\n)\n(\n6\n)\n(\n96\n)\nPre-tax income (loss)\n$\n257\n \n$\n1,237\n \n$\n1,132\n \n$\n1,022\n \n$\n(\n32\n)\n$\n620\n \nExpected tax provision at the applicable statutory rate(s)\n54\n \n19\n \n238\n \n26\n \n(\n9\n)\n—\n \nIncrease (decrease) in taxes resulting from:\nTax exempt income\n(\n1\n)\n—\n \n(\n3\n)\n—\n \n(\n4\n)\n—\n \nDividend received deduction\n(\n3\n)\n—\n \n(\n2\n)\n—\n \n(\n3\n)\n—\n \nProration\n1\n \n—\n \n1\n \n—\n \n1\n \n—\n \nAffiliated preferred stock dividends\n7\n \n—\n \n7\n \n—\n \n7\n \n—\n \nCreditable foreign premium tax\n(\n14\n)\n—\n \n(\n14\n)\n—\n \n(\n11\n)\n—\n \nShare-based compensation tax benefits formerly in APIC\n(\n1\n)\n—\n \n(\n3\n)\n—\n \n(\n3\n)\n—\n \nBEAT Tax\n66\n \n—\n \n—\n \n—\n \n—\n \n—\n \nValuation allowance\n—\n \n—\n \n—\n \n(\n13\n)\n—\n \n5\n \nBermuda corporate income tax\n—\n \n—\n \n—\n \n(\n578\n)\n—\n \n5\n \nInsurance corporate-owned life insurance\n(\n18\n)\n—\n \n(\n13\n)\n—\n \n(\n1\n)\n—\n \nOther\n9\n \n1\n \n(\n3\n)\n(\n6\n)\n6\n \n—\n \nTotal income tax provision\n$\n100\n \n$\n20\n \n$\n208\n \n$\n(\n571\n)\n$\n(\n14\n)\n$\n5\n \n(Some amounts may not reconcile due to rounding.)\nAt December 31, 2024, 2023 and 2022, the Company had \nno\n Uncertain Tax Positions.\n \nThe Company’s 2014 through 2018 U.S. Federal tax returns are under audit by the IRS. Over several years, the Company had received and responded to a substantial number of Information Document Requests. In 2023, the IRS issued several insignificant Notice(s) of Proposed Adjustment and then a final Revenue Agent Report (“RAR”). In 2024, the Company responded to the RAR with substantial additional information which the IRS has been processing. The IRS requested, and we have signed, an extension of the audit to December 31, 2025.\nFor tax years 2019 and 2020, the Statute of Limitations has expired and, thus, the Federal income tax return for those years is no longer subject to IRS examination except to the extent the Company files an amended return.\nTax years 2021, 2022, and 2023 are open for examination by the U.S. Federal income tax jurisdiction.\nF-59\nTable of Contents\nDeferred income taxes reflect the tax effect of the temporary differences between the value of assets and liabilities for financial statement purposes and such values are measured by the U.S. tax laws and regulations. \nThe principal items making up the net deferred income tax assets/(liabilities) are as follows for the periods indicated:\nYears Ended December 31,\n(Dollars in millions)\n2024\n2023\nDeferred tax assets:\nBermuda economic transition adjustment\n$\n536\n \n$\n536\n \nLoss reserves\n313\n \n270\n \nUnearned premium reserves\n152\n \n143\n \nNet unrealized investment losses\n138\n \n67\n \nDepreciation\n55\n \n44\n \nUnrealized foreign currency losses\n35\n \n15\n \nNet operating loss carryforward\n24\n \n18\n \nLease liability\n23\n \n27\n \nForeign tax credits\n16\n \n—\n \nCapital loss carryforward\n14\n \n—\n \nEquity compensation\n10\n \n8\n \nInvestment impairments\n10\n \n12\n \nUncollectible reinsurance reserves\n—\n \n3\n \nNet unrealized losses on benefit plans\n—\n \n4\n \nOther assets\n21\n \n22\n \nTotal deferred tax assets\n1,347\n \n1,169\n \nDeferred tax liabilities:\nDeferred acquisition costs\n171\n \n139\n \nNet fair value income\n74\n \n74\n \nPartnership investments\n43\n \n49\n \nRight of use asset\n19\n \n23\n \nDeferred investment income\n12\n \n—\n \nBenefit plan asset\n—\n \n3\n \nOther liabilities\n13\n \n11\n \nTotal deferred tax liabilities\n332\n \n299\n \nNet deferred tax assets\n1,015\n \n870\n \nLess:  Valuation allowance\n(\n25\n)\n(\n15\n)\nTotal net deferred tax assets/(liabilities)\n$\n990\n \n$\n855\n \n(Some amounts may not reconcile due to rounding.)\n \nAt December 31, 2024 and 2023, the Company had $\n25\n million and $\n15\n million of Valuation Allowances (“VA”), respectively. The VA is a result of our conclusion under U.S. GAAP accounting principles that the Australia, Colombia, Netherlands, Ireland, Italy, Switzerland, France, Germany, Singapore, Mexico, U.K., and U.S. jurisdictions could not demonstrate that it was more likely than not that the related deferred tax assets will be realized. This was primarily due to factors such as cumulative operating losses in recent years, cumulative capital losses and, therefore, an inability to demonstrate overall profitability within the specific jurisdiction. During the year ended December 31, 2024, the Company recorded an overall increase in its VA of $\n10\n million. Tax effected U.K. Net Operating Losses (“NOLs”) of $\n11\n million do not expire. Tax effected Irish NOLs of $\n4\n million do not expire. Tax effected Spanish NOLs of $\n2\n million do not expire. The remaining tax effected NOLs of $\n8\n million arose in various jurisdictions and do not expire. Note that not all NOLs had a VA up against them.\nAt December 31, 2024 and 2023, the Company had $\n16\n million and $\n0 million\n respectively of foreign tax credit (“FTC”) carryforwards. In 2024, there were approximately $\n9\n million of U.S. FTCs and $\n7\n million of non-US FTCs. The U.S. FTCs expire in 2034. The non-U.S. FTCs do not expire. \nF-60\nTable of Contents\nAt December 31, 2024, $\n138\n million of the Company’s deferred tax asset relates primarily to unrealized losses on available for sale fixed maturity securities. The unrealized losses on available for sale fixed maturity securities, primarily occurring in 2022, were the result of market conditions, including rising interest rates. Ultimate realization of these deferred tax assets depends on the Company’s ability and intent to hold the available for sale securities until they recover their value or mature. As of December 31, 2024, based on all the available evidence, the Company has concluded that the deferred tax asset related to the unrealized losses on the available for sale fixed maturity portfolio are, more likely than not, expected to be realized.\nThe Company follows ASU 2016-09 regarding the treatment of the tax effects of share-based compensation transactions.  ASU 2016-09 required that the income tax effects of restricted stock vestings and stock option exercises resulting from the change in value of share-based compensation awards between the grant date and settlement (vesting/exercise) date be recorded as part of income tax expense (benefit) within the consolidated statements of operations and comprehensive income (loss). Per ASU 2016-09, the Company recorded excess tax benefits of $\n1\n million, $\n2\n million and $\n2\n million related to restricted stock vestings and stock option exercises as part of income tax expense (benefit) within the consolidated statements of operations and comprehensive income (loss) in 2024, 2023 and, 2022, respectively.  \nASU 2016-09 does not impact the accounting treatment of tax benefits related to dividends on restricted stock. The tax benefits related to the payment of dividends on restricted stock have been recorded as part of additional paid-in capital in the shareholders' equity section of the consolidated balance sheets in all years. The tax benefits related to the payment of dividends on restricted stock were\n $\n0.7\n million\n, $\n0.6\n million and $\n0.6\n million in 2024, 2023 and 2022, respectively.\n17.    \nDIVIDEND RESTRICTIONS AND STATUTORY FINANCIAL INFORMATION\nGroup and its operating subsidiaries are subject to various regulatory restrictions, including the amount of dividends that may be paid and the level of capital that the operating entities must maintain.  These regulatory restrictions are based upon statutory capital as opposed to GAAP basis equity or net assets.  Group and one of its primary operating subsidiaries, Bermuda Re, are regulated by Bermuda law and its other primary operating subsidiary, Everest Re, is regulated by Delaware law.   Bermuda Re is subject to the Bermuda Solvency Capital Requirement (“BSCR”) administered by the Bermuda Monetary Authority (the “BMA”) and Everest Re is subject to the Risk-Based Capital Model (“RBC”) developed by the U.S. National Association of Insurance Commissioners (“NAIC”).  These models represent the aggregate regulatory restrictions on net assets and statutory capital and surplus.\nDividend Restrictions.\nUnder Bermuda law, Group is prohibited from declaring or paying a dividend if such payment would reduce the realizable value of its assets to an amount less than the aggregate value of its liabilities and its issued share capital and share premium (additional paid-in capital) accounts.  Group’s ability to pay dividends and its operating expenses is dependent upon dividends from its subsidiaries.\nUnder Bermuda law, Bermuda Re is prohibited from declaring or making payment of a dividend if it fails to meet its minimum solvency margin or minimum liquidity ratio.  As a long-term insurer, Bermuda Re is also unable to declare or pay a dividend to anyone who is not a policyholder unless, after payment of the dividend, the value of the assets in their long-term business fund, as certified by their approved actuary, exceeds their liabilities for long term business by at least the $\n0.3\n million minimum solvency margin.  \nPrior approval of the BMA is required if Bermuda Re’s dividend payments would exceed \n25\n% of their prior year-end total statutory capital and surplus.\nBermuda Re prepares its statutory financial statements in conformity with the accounting principles set forth in Bermuda in The Insurance Act 1978, amendments thereto and related regulations.  The statutory capital and surplus of Bermuda Re was $\n4.3\n billion and $\n3.7\n billion at December 31, 2024 and 2023, respectively.  The statutory net income of Bermuda Re was $\n1.4\n billion, $\n1.5\n billion and $\n603\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\nDelaware law provides that an insurance company which is a member of an insurance holding company system and is domiciled in the state shall not pay dividends without giving prior notice to the Insurance Commissioner of Delaware and may not pay dividends without the approval of the Insurance Commissioner if the value of the proposed dividend, together with all other dividends and distributions made in the preceding \ntwelve months\n, exceeds the greater of (1) \n10\n% of statutory surplus or (2) net income, not including realized capital gains, each as reported in the prior year’s statutory annual statement.  In addition, no dividend may be paid in excess of unassigned earned surplus.  Accordingly, as of \nF-61\nTable of Contents\nDecember 31, 2024, the maximum amount that will be available for the payment of dividends by Everest Re without triggering the requirement for prior approval of regulatory authorities in connection with a dividend is $\n813\n million.\nStatutory Financial Information.\nEverest Re prepares its statutory financial statements in accordance with accounting practices prescribed or permitted by the NAIC and the Delaware Insurance Department.  Prescribed statutory accounting practices are set forth in the NAIC Accounting Practices and Procedures Manual.  The capital and statutory surplus of Everest Re was $\n8.1\n billion and $\n7.0\n billion at December 31, 2024 and 2023, respectively.  The statutory net income of Everest Re was $\n74\n million, $\n877\n million and $\n294\n million for the years ended December 31, 2024, 2023 and 2022.\nThere are certain regulatory and contractual restrictions on the ability of Holdings’ operating subsidiaries to transfer funds to Holdings in the form of cash dividends, loans or advances.  The insurance laws of the State of Delaware, where Holdings’ direct insurance subsidiaries are domiciled, require regulatory approval before those subsidiaries can pay dividends or make loans or advances to Holdings that exceed certain statutory thresholds.\nCapital Restrictions.\nIn Bermuda, Bermuda Re is subject to the BSCR administered by the BMA.  No regulatory action is taken if an insurer’s capital and surplus is equal to or in excess of their enhanced capital requirement determined by the BSCR model.  In addition, the BMA has established a target capital level for each insurer, which is 120% of the enhanced capital requirement.\nIn the United States, Everest Re is subject to the RBC developed by the NAIC which determines an authorized control level risk-based capital.  As long as the total adjusted capital is 200% or more of the authorized control level capital, no action is required by the Company.\nThe regulatory targeted capital and the actual statutory capital for Bermuda Re and Everest Re were as follows:\nBermuda Re \n(1)\nEverest Re \n(2)\nAt December 31,\nAt December 31,\n(Dollars in millions)\n2024⁽³⁾\n2023\n2024\n2023\nRegulatory targeted capital\n$\n—\n \n$\n2,669\n \n$\n4,799\n \n$\n4,242\n \nActual capital\n$\n4,323\n \n$\n3,711\n \n$\n8,126\n \n$\n6,963\n \n(1)\nRegulatory targeted capital represents the target capital level from the applicable year's BSCR calculation.\n(2)\nRegulatory targeted capital represents 200% of the RBC authorized control level calculation for the applicable year.\n(3)\nThe 2024 BSCR calculation is not yet due to be completed; however, the Company anticipates that Bermuda Re's December 31, 2024 actual capital will exceed the targeted capital level. In accordance with guidance issued by the BMA in 2025, Bermuda Re has reflected the impacts of the ETA recognized in response to The 2023 Act in its 2024 regulatory targeted capital and actual capital.\n18.    \nSUBSEQUENT EVENTS\nThe Company has evaluated known recognized and non-recognized subsequent events. In January 2025, wildfires impacted Southern California. The Company is estimating pre-tax net catastrophe losses to be in the range of $\n350\n to $\n450\n million for the first quarter 2025, net of any estimated recoveries or reinstatement premiums. The Company does not have any other subsequent events to report.\n \nF-62\nTable of Contents\nSCHEDULE I — SUMMARY OF INVESTMENTS —\nOTHER THAN INVESTMENTS IN RELATED PARTIES\nDecember 31, 2024\nColumn A\nColumn B\nColumn C\nColumn D\n(Dollars in millions)\nCost\nFair\nValue\nAmount\nShown in\nBalance\nSheet\nFixed maturities - available for sale\nBonds:\nU.S. government and government agencies\n$\n688\n \n$\n669\n \n$\n669\n \nState, municipalities and political subdivisions\n75\n \n70\n \n70\n \nForeign government securities\n2,330\n \n2,196\n \n2,196\n \nForeign corporate securities\n6,099\n \n5,861\n \n5,861\n \nPublic utilities\n449\n \n424\n \n424\n \nAll other corporate bonds\n12,369\n \n12,105\n \n12,105\n \nMortgage - backed securities:\nCommercial\n965\n \n900\n \n900\n \nAgency residential\n5,205\n \n4,931\n \n4,931\n \nNon-agency residential\n1,291\n \n1,289\n \n1,289\n \nRedeemable preferred stock\n464\n \n464\n \n464\n \nTotal fixed maturities-available for sale\n29,934\n \n28,908\n \n28,908\n \nFixed maturities - held to maturity\nBonds:\nForeign corporate securities\n84\n \n86\n \n83\n \nPublic utilities\n4\n \n5\n \n4\n \nAll other corporate bonds\n656\n \n647\n \n650\n \nMortgage - backed securities:\nCommercial\n21\n \n21\n \n20\n \nTotal fixed maturities-held to maturity\n765\n \n759\n \n757\n \nEquity securities - at fair value\n (1)\n212\n \n217\n \n217\n \nShort-term investments\n4,707\n \n4,707\n \n4,707\n \nOther invested assets\n5,392\n \n5,392\n \n5,392\n \nCash\n1,549\n \n1,549\n \n1,549\n \nTotal investments and cash\n$\n42,560\n \n$\n41,533\n \n$\n41,531\n \n(Some amounts may not reconcile due to rounding.)\n(1)\nOriginal cost does not reflect fair value adjustments, which have been realized through the statements of operations and comprehensive income (loss).\nS-1\nSCHEDULE II — CONDENSED FINANCIAL INFORMATION OF THE REGISTRAN\nT\nCONDENSED BALANCE SHEETS\nDecember 31,\n(Dollars and share amounts in millions, except par value per share)\n2024\n2023\nASSETS:\nOther invested assets (cost: 2024, $\n63\n; 2023, $\n38\n)\n$\n63\n \n$\n38\n \nShort-term investments\n8\n \n—\n \nCash\n5\n \n9\n \nInvestment in subsidiaries, at equity in the underlying net assets\n15,329\n \n14,832\n \nLong-term notes receivable, affiliated\n600\n \n50\n \nAccrued investment income\n—\n \n2\n \nReceivable from subsidiaries\n17\n \n13\n \nOther assets\n37\n \n46\n \nTOTAL ASSETS\n$\n16,059\n \n$\n14,989\n \nLIABILITIES:\nLong-term notes payable, affiliated\n$\n2,173\n \n$\n1,773\n \nDue to subsidiaries\n9\n \n8\n \nOther liabilities\n2\n \n6\n \nTotal liabilities\n2,184\n \n1,787\n \nSHAREHOLDERS' EQUITY:\nPreferred shares, par value: $\n0.01\n; \n50.0\n shares authorized; \nno\n shares issued and outstanding\n—\n \n—\n \nCommon shares, par value: $\n0.01\n; \n200.0\n shares authorized; (2024) \n74.3\n and (2023) \n74.2\n outstanding before treasury shares\n1\n \n1\n \nAdditional paid-in capital\n3,812\n \n3,773\n \nAccumulated other comprehensive income (loss), net of deferred income tax expense (benefit) of ($\n177\n) at 2024 and $(\n99\n) at 2023\n(\n1,138\n)\n(\n934\n)\nTreasury shares, at cost; \n31.3\n shares (2024) and \n30.8\n shares (2023)\n(\n4,108\n)\n(\n3,908\n)\nRetained earnings\n15,309\n \n14,270\n \nTotal shareholders' equity\n13,875\n \n13,202\n \nTOTAL LIABILITIES AND SHAREHOLDERS' EQUITY\n$\n16,059\n \n$\n14,989\n \n(Some amounts may not reconcile due to rounding.)\nSee notes to consolidated financial statements.\nS-2\nSCHEDULE II — CONDENSED FINANCIAL INFORMATION OF THE REGISTRANT\nCONDENSED STATEMENTS OF OPERATIONS \nYears Ended December 31,\n2024\n2023\n2022\n(Dollars in millions)\nREVENUES:\nNet investment income\n$\n5\n \n$\n4\n \n$\n—\n \nOther income (expense)\n7\n \n8\n \n—\n \nNet income (loss) of subsidiaries\n1,510\n \n2,641\n \n648\n \nTotal revenues\n1,522\n \n2,653\n \n648\n \nEXPENSES:\nInterest expense - affiliated\n77\n \n87\n \n13\n \nOther expenses\n71\n \n49\n \n38\n \nTotal expenses\n148\n \n136\n \n51\n \nINCOME (LOSS) BEFORE TAXES\n1,373\n \n2,517\n \n597\n \nNET INCOME (LOSS)\n$\n1,373\n \n$\n2,517\n \n$\n597\n \nOther comprehensive income (loss) of subsidiaries, net of tax\n(\n204\n)\n1,063\n \n(\n2,008\n)\nCOMPREHENSIVE INCOME (LOSS)\n$\n1,169\n \n$\n3,580\n \n$\n(\n1,411\n)\n(Some amounts may not reconcile due to rounding.)\nSee notes to consolidated financial statements.\nS-3\nSCHEDULE II — CONDENSED FINANCIAL INFORMATION OF THE REGISTRANT\nCONDENSED STATEMENTS OF CASH FLOWS \nYears Ended December 31,\n(Dollars in millions, except share amounts)\n2024\n2023\n2022\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet income (loss)\n$\n1,373\n \n$\n2,517\n \n$\n597\n \nAdjustments to reconcile net income to net cash provided by operating activities:\nEquity in retained (earnings) deficit of subsidiaries\n(\n1,510\n)\n(\n2,641\n)\n(\n648\n)\nCash dividends received from subsidiaries\n969\n \n365\n \n476\n \nChange in other assets and liabilities, net\n7\n \n(\n8\n)\n28\n \nIncrease (decrease) in due to/from affiliates\n(\n3\n)\n2\n \n2\n \nNon-cash compensation expense\n2\n \n3\n \n2\n \nNet cash provided by (used in) operating activities\n839\n \n238\n \n457\n \nCASH FLOWS FROM INVESTING ACTIVITIES:\nAdditional investment in subsidiaries\n(\n161\n)\n(\n377\n)\n(\n824\n)\nProceeds from fixed maturities sold - available for sale\n—\n \n23\n \n—\n \nDistribution from other invested assets\n826\n \n441\n \n237\n \nCost of fixed maturities acquired - available for sale\n—\n \n(\n23\n)\n—\n \nCost of other invested assets acquired\n(\n852\n)\n(\n479\n)\n(\n26\n)\nNet change in short-term investments\n(\n8\n)\n—\n \n—\n \nProceeds from repayment of long term notes receivable - affiliated\n50\n \n50\n \n—\n \n(Issuance) of long term notes receivable - affiliated\n(\n600\n)\n(\n100\n)\n—\n \nNet cash provided by (used in) investing activities\n(\n745\n)\n(\n465\n)\n(\n613\n)\nCASH FLOWS FROM FINANCING ACTIVITIES:\nCommon shares issued during the period, net\n36\n \n23\n \n26\n \nProceeds from public offering of common shares\n—\n \n1,445\n \n—\n \nPurchase of treasury shares\n(\n200\n)\n—\n \n(\n61\n)\nDividends paid to shareholders\n(\n334\n)\n(\n288\n)\n(\n255\n)\nProceeds from issuance (cost of repayment) of long term notes payable - affiliated\n400\n \n(\n965\n)\n465\n \nNet cash provided by (used in) financing activities\n(\n98\n)\n215\n \n175\n \nEFFECT OF EXCHANGE RATE CHANGES ON CASH\n—\n \n—\n \n—\n \nNet increase (decrease) in cash\n(\n4\n)\n(\n13\n)\n19\n \nCash, beginning of period\n9\n \n22\n \n3\n \nCash, end of period\n$\n5\n \n$\n9\n \n$\n22\n \nNon-Cash Transactions:\nDividend of \n4,297,463\n shares of Everest Group, Ltd. (“Group”) common stock received by Group from Everest Preferred International Holdings (“Preferred Holdings”), a direct subsidiary\n$\n—\n \n$\n—\n \n$\n1,405\n \nIssuance of $\n1,773\n million promissory note payable by Group to Preferred Holdings in exchange for \n5,422,508\n shares of Group common stock received by Group from Preferred Holdings\n—\n \n—\n \n1,773\n \nCapital contribution of \n9,719,971\n shares of Group common stock provided from Group to Everest Re Advisors, Ltd.\n—\n \n—\n \n3,178\n \n(Some amounts may not reconcile due to rounding.)\nSee notes to consolidated financial statements.\nS-4\nSCHEDULE II - CONDENSED FINANCIAL INFORMATION OF THE REGISTRANT\nNOTES TO CONDENSED FINANCIAL INFORMATION\n1.)\nThe accompanying condensed financial information should be read in conjunction with the consolidated financial statements and related notes of Everest Group, Ltd. and its subsidiaries.\n2.)\nEverest Group, Ltd. entered into a $\n300\n million long-term note agreement with Everest Reinsurance Company, an affiliated company, as of December, 2019. The note was scheduled to pay interest annually at a rate of \n1.69\n% and was scheduled to mature in December 2028. However, the note was paid off in full in May 2023 and is \nno\n longer outstanding as of  December 31, 2023.  \n3.)\nEverest Group, Ltd. entered into a $\n200\n million long-term note agreement with Everest Reinsurance Company, an affiliated company, as of August 2021. The note was scheduled to pay interest annually at a rate of \n1.00\n% and was scheduled to mature in August 2030.  However, the note was paid off in full in May 2023 and is \nno\n longer outstanding as of  December 31, 2023.  \n4.)\nEverest Group, Ltd. entered into a $\n215\n million long-term note agreement with Everest Reinsurance Holdings, Inc., an affiliated company, as of June 2022. The note was scheduled to pay interest annually at a rate of \n3.11\n% and was scheduled to mature in June 2052.  However, the note was paid off in full in May 2023 and is \nno\n longer outstanding as of  December 31, 2023.  \n5.)\nEverest Group, Ltd. entered into a $\n125\n million long-term note agreement with Everest Reinsurance Holdings, Inc., an affiliated company, as of December 2022. The note was scheduled to pay interest annually at a rate of \n4.34\n% and was scheduled to mature in June 2052.  However, the note was paid off in full in May 2023 and is \nno\n longer outstanding as of  December 31, 2023.  \n6.)\nEverest Group, Ltd. entered into a $\n125\n million long-term note agreement with Everest International Reinsurance, an affiliated company, as of December 2022. The note was scheduled to pay interest annually at a rate of \n4.34\n% and was scheduled to mature in December 2052.  However, the note was paid off in full in May 2023 and is \nno\n longer outstanding as of December 31, 2023.  \n7.)\nEverest Group, Ltd. entered into a $\n1.8\n billion long-term note agreement with Everest Preferred International Holdings, an affiliated company, as of December 2022. The note will pay interest annually at a rate of \n4.34\n% and is scheduled to mature in December 2052.  At December 31, 2024, this transaction was included within long-term notes payable, affiliated in the condensed balance sheets of Everest Group, Ltd.\n8.)\nEverest Group, Ltd. issued a $\n100\n million long-term note agreement to Everest Reinsurance Bermuda, an affiliated company, as of May 2023.  The note will pay interest annually at a rate of \n3.72\n% and is scheduled to mature in May 2053.  Everest Reinsurance Bermuda repaid $\n50\n million to Everest Group, Ltd. in September 2023 and $\n50\n million in May 2024 and the note is no longer outstanding as of December 31, 2024.\n9.)\nEverest Group, Ltd. issued a $\n600\n million long-term note agreement to Everest Reinsurance Holdings, Inc., an affiliated company, as of December 2024. The note will pay interest annually at a rate of \n4.30\n% and is scheduled to mature in December 2027.  At  December 31, 2024, this transaction was included within long-term notes receivable, affiliated in the condensed balance sheets of Everest Group, Ltd.\n10.)\nEverest Group, Ltd. entered into a $\n100\n million long-term note agreement with Everest International Reinsurance, an affiliated company, as of December 2024. The note will pay interest annually at a rate of \n4.30\n% and is scheduled to mature in December 2027.  At December 31, 2024, this transaction was included within long-term notes payable, affiliated in the condensed balance sheets of Everest Group, Ltd.\n11.)\nEverest Group, Ltd. entered into a $\n300\n million long-term note agreement with Everest Reinsurance Bermuda, an affiliated company, as of December 2024. The note will pay interest annually at a rate of \n4.30\n% and is scheduled to mature in December 2027.  At December 31, 2024, this transaction was included within long-term notes payable, affiliated in the condensed balance sheets of Everest Group, Ltd.\n12.)\nEverest Group, Ltd. has invested funds in the segregated accounts of Mt. Logan Re, an affiliated entity. On the condensed balance sheets, investments in Mt. Logan Re valued at $\n39\n million and $\n46\n million as of December 31, \nS-5\n2024 and 2023, respectively, have been recorded within other assets.  On the condensed statements of operations, income (expense) of $\n8\n million, $\n8\n million and $(\n1\n) million for the years ended December 31, 2024, 2023 and 2022, respectively, have been recorded in other income (expense).\nS-6\nSCHEDULE  III — SUPPLEMENTARY INSURANCE INFORMATION\nColumn A\nColumn B\nColumn C\nColumn D\nColumn E\nColumn F\nColumn G\nColumn H\nColumn I\nColumn J\nDeferred\nAcquisition\nCosts\nReserve\nfor Losses\nand Loss\nAdjustment\nExpenses\nUnearned\nPremium\nReserves\nPremiums\nEarned\nNet\nInvestment\nIncome\nIncurred\nLoss and\nLoss\nAdjustment\nExpenses\nAmortization\nof  Deferred\nAcquisition\nCosts\nOther\nOperating\nExpenses\nNet\nWritten\nPremium\nSegment\n(Dollars in millions)\nAs of and Year Ended December 31, 2024\nReinsurance\n$\n1,185\n \n$\n19,708\n \n$\n4,621\n \n$\n11,412\n \n$\n1,255\n \n$\n7,103\n \n$\n2,837\n \n$\n290\n \n$\n11,969\n \nInsurance\n270\n \n8,841\n \n2,635\n \n3,579\n \n605\n \n3,622\n \n439\n \n615\n \n3,678\n \nOther\n6\n \n1,340\n \n68\n \n197\n \n94\n \n580\n \n24\n \n33\n \n167\n \nTotal\n$\n1,461\n \n$\n29,889\n \n$\n7,324\n \n$\n15,187\n \n$\n1,954\n \n$\n11,305\n \n$\n3,300\n \n$\n938\n \n$\n15,814\n \nAs of and Year Ended December 31, 2023\nReinsurance\n$\n967\n \n$\n17,327\n \n$\n4,009\n \n$\n9,799\n \n$\n984\n \n$\n5,690\n \n$\n2,520\n \n$\n254\n \n$\n10,802\n \nInsurance\n271\n \n6,338\n \n2,504\n \n3,420\n \n391\n \n2,471\n \n410\n \n556\n \n3,704\n \nOther\n9\n \n939\n \n109\n \n225\n \n59\n \n266\n \n22\n \n35\n \n225\n \nTotal\n$\n1,247\n \n$\n24,604\n \n$\n6,622\n \n$\n13,443\n \n$\n1,434\n \n$\n8,427\n \n$\n2,952\n \n$\n846\n \n$\n14,730\n \nAs of and Year Ended December 31, 2022\nReinsurance\n$\n708\n \n$\n15,756\n \n$\n2,881\n \n$\n8,596\n \n$\n574\n \n$\n5,962\n \n$\n2,116\n \n$\n216\n \n$\n8,917\n \nInsurance\n243\n \n5,438\n \n2,153\n \n2,998\n \n219\n \n2,040\n \n399\n \n438\n \n3,223\n \nOther\n11\n \n871\n \n113\n \n194\n \n37\n \n98\n \n14\n \n28\n \n204\n \nTotal\n$\n962\n \n$\n22,065\n \n$\n5,147\n \n$\n11,787\n \n$\n830\n \n$\n8,100\n \n$\n2,528\n \n$\n682\n \n$\n12,344\n \n(Some amounts may not reconcile due to rounding.)\nS-7\nSCHEDULE IV — REINSURANCE\nColumn A\nColumn B\nColumn C\nColumn D\nColumn E\nColumn F\n(Dollars in millions)\nGross\nAmount\nCeded to\nOther\nCompanies\nAssumed\nfrom Other\nCompanies\nNet\nAmount\nAssumed\nto Net\nDecember 31, 2024\nTotal property and liability insurance premiums earned\n$\n4,977\n \n$\n2,248\n \n$\n12,458\n \n$\n15,187\n \n82.0\n \n%\nDecember 31, 2023\nTotal property and liability insurance premiums earned\n$\n4,733\n \n$\n1,807\n \n$\n10,518\n \n$\n13,443\n \n78.2\n \n%\nDecember 31, 2022\nTotal property and liability insurance premiums earned\n$\n4,218\n \n$\n1,513\n \n$\n9,082\n \n$\n11,787\n \n77.1\n \n%\nS-8"
  }
}