{
  "ticker": "EME",
  "cik": "0000105634",
  "company_name": "EMCOR Group, Inc.",
  "filing_date": "2025-02-26",
  "accession": "0000105634-25-000015",
  "primary_doc": "eme-20241231.htm",
  "item_sections": {
    "item1": "Item 1. Business.\n2024 versus 2023\nOverview \nThe following table presents selected financial data for the fiscal years ended December 31, 2024 and 2023 (in thousands, except percentages and per share data):  \n \n2024\n2023\nRevenues\n$\n14,566,116 \n$\n12,582,873 \nRevenues increase from prior year\n15.8 \n%\n13.6 \n%\nGross profit\n$\n2,765,051 \n$\n2,089,339 \nGross profit as a percentage of revenues\n19.0 \n%\n16.6 \n%\nOperating income\n$\n1,344,863 \n$\n875,756 \nOperating income as a percentage of revenues\n9.2 \n%\n7.0 \n%\nNet income attributable to EMCOR Group, Inc.\n$\n1,007,145 \n$\n632,994 \nDiluted earnings per common share\n$\n21.52 \n$\n13.31 \nRevenues of $14.57 billion for the year ended December 31, 2024 set a new annual record for the Company and represent an increase of 15.8% from revenues of $12.58 billion for the year ended December 31, 2023. Demand for our services continues to be strong across most of the market sectors we serve and, as described in further detail below, we experienced revenue growth within the majority of our reportable segments. Revenues for the year ended December 31, 2024 included incremental acquisition contribution of approximately $251.5 million.\nOperating income for 2024 was $1,344.9 million, or 9.2% of revenues, establishing new annual records for the Company with respect to both operating income and operating margin. This compares to operating income of $875.8 million, or 7.0% of revenues, in 2023. The $469.1 million increase in operating income, and corresponding 220 basis point expansion in operating margin, were predominantly a result of improved operating performance within our United States construction segments, as described in further detail below. Operating income for the year ended December 31, 2024 included incremental acquisition contribution of $13.4 million, net of amortization expense attributable to identifiable intangible assets of $15.3 million.\nNet income of $1,007.1 million, or $21.52 per diluted share, for the year ended December 31, 2024, compares favorably to net income of $633.0 million, or $13.31 per diluted share, for the year ended December 31, 2023. While the majority of the increase in our net income and diluted earnings per share was a result of the increased operating income referenced above, these amounts additionally benefited from greater interest income and a reduction in interest expense in 2024. Further, our diluted earnings per share for the year ended December 31, 2024 was positively impacted by a reduced weighted average share count due to common stock repurchases made by us throughout 2023 and 2024.\n23\nTable of Contents\nImpact of Acquisitions\nIn order to provide a more meaningful period-over-period discussion of our operating results, we may discuss amounts generated or incurred (revenues, gross profit, selling, general and administrative expenses, and operating income) from companies acquired. The amounts discussed reflect the acquired companies’ operating results in the current reported period only for the time period these entities were not owned by EMCOR in the comparable prior reported period. For further discussion regarding our acquisitions, refer to Note 4 - Acquisitions of Businesses of the notes to consolidated financial statements included in Item 8. Financial Statements and Supplementary Data.\nDuring 2024, we acquired seven companies for upfront consideration of $231.1 million, inclusive of customary working capital adjustments. These acquisitions are comprised of: (a) an electrical contractor in the Southeast region of the United States, that has been included in our United States electrical construction and facilities services segment, (b) two companies that have been included within our United States mechanical construction and facilities services segment, including: (i) a leading plumbing services provider in the Southeast region of the United States and (ii) a full service provider of mechanical construction and maintenance services in Central Texas, (c) three companies that have been included in our United States building services segment, including: (i) a provider of building automation and controls solutions in the Northeast region of the United States, (ii) a mechanical services company in the Western region of the United States, and (iii) a mechanical services company in the Eastern region of the United States, and (d) an instrumentation and electrical contractor, that has been included in our United States industrial services segment, which provides electrical, automation, digital integration, and fabrication services to various energy sector and process equipment customers.\nDuring 2023, we acquired eight companies for total consideration of $99.6 million. Such acquisitions include: (a) a national energy efficiency specialty services firm, the results of operations of which have been included in our United States building services segment, and (b) seven companies, the results of operations of which were de minimis, consisting of: (i) three companies that have been included within our United States mechanical construction and facilities services segment, one of which provides mechanical and pipe fabrication services in the Midwestern region of the United States, and two of which add capabilities to our national fire protection services, and (ii) four mechanical services companies in the Western and Midwestern regions of the United States that have been included within our United States building services segment and enhance our presence in geographies where we have existing operations.\nDuring 2022, we acquired six companies for total consideration of $100.8 million. Such acquisitions include: (a) a company that provides electrical construction services in the Greater Boston area, the results of operations of which have been included in our United States electrical construction and facilities services segment, and (b) five companies that enhance our presence in geographies where we have existing operations, the results of operations of which were de minimis, consisting of: (i) two companies that provide fire protection services in the Northeastern and Southern regions of the United States, respectively, and that have been included within our United States mechanical construction and facilities services segment, (ii) two companies that specialize in either building automation and controls or mechanical services in the Southwestern and Southern regions of the United States, respectively, and that have been included within our United States building services segment, and (iii) a company that provides electrical construction services in the Midwestern region of the United States and that has been included within our United States electrical construction and facilities services segment. \nDiscussion and Analysis of Results of Operations \nRevenues \nThe following table presents our revenues for each of our operating segments and the approximate percentages that each segment’s revenues were of total revenues for the years ended December 31, 2024 and 2023 (in thousands, except for percentages): \n \n2024\n% of\nTotal\n \n2023\n% of\nTotal\n \nRevenues from unrelated entities:\n \n \n \n \nUnited States electrical construction and facilities services\n$\n3,342,927 \n23 \n%\n$\n2,783,723 \n22 \n%\nUnited States mechanical construction and facilities services\n6,405,657 \n44 \n%\n5,074,803 \n41 \n%\nUnited States building services\n3,114,817 \n21 \n%\n3,120,134 \n25 \n%\nUnited States industrial services\n1,277,190 \n9 \n%\n1,167,790 \n9 \n%\nTotal United States operations\n14,140,591 \n97 \n%\n12,146,450 \n97 \n%\nUnited Kingdom building services\n425,525 \n3 \n%\n436,423 \n3 \n%\nConsolidated revenues\n$\n14,566,116 \n100 \n%\n$\n12,582,873 \n100 \n%\n \n \n \n \n \n24\nTable of Contents\nAs a result of strong demand for our services across most of the market sectors we serve, revenues for the year ended December 31, 2024 increased to $14.57 billion compared to revenues of $12.58 billion for the year ended December 31, 2023. As described in more detail below, we experienced increases in revenues from the majority of our reportable segments. Additionally, revenues for 2024 included incremental acquisition contribution of approximately $251.5 million.\nRevenues of our United States electrical construction and facilities services segment were $3,342.9 million for the year ended December 31, 2024, a $559.2 million increase compared to revenues of $2,783.7 million for the year ended December 31, 2023. This segment’s results for 2024 included $2.7 million of incremental acquisition revenues. Excluding the impact of acquisitions, the increase in this segment’s revenues was primarily a result of growth within the network and communications market sector, predominantly due to data center construction projects. Increased demand for cloud computing and data storage, driven in part by the emergence of artificial intelligence, has resulted in a greater number of project opportunities for us in several of the geographies in which we operate. In addition, this segment benefited from revenue growth within a number of the other market sectors we serve, such as: (a) the high-tech manufacturing market sector, inclusive of construction projects for customers engaged in the design and manufacturing of semiconductors, (b) the manufacturing and industrial market sector, driven by increased activity with various energy sector customers, (c) the transportation market sector, due to certain infrastructure projects currently underway, and (d) the institutional market sector, given increased project revenues from certain schools and universities. These increases were partially offset by a reduction in revenues within the commercial market sector due in part to reduced demand across the commercial real estate industry.\nOur United States mechanical construction and facilities services segment revenues for the year ended December 31, 2024 were $6,405.7 million, a $1,330.9 million increase compared to revenues of $5,074.8 million for the year ended December 31, 2023. This segment’s results included $172.5 million of incremental acquisition revenues for the year ended December 31, 2024. Excluding the impact of acquisitions, the increase in this segment’s revenues was attributable to revenue growth within the majority of the market sectors in which we operate, as well as greater levels of service work. This segment experienced notable increases in revenues within: (a) the high-tech manufacturing market sector, as a result of stronger demand for our mechanical construction and/or fire protection services by certain customers: (i) engaged in either the design and manufacturing of semiconductors or the production and development of electric vehicles and/or lithium batteries and (ii) within the biotech, life-sciences, and pharmaceutical industries, (b) the network and communications market sector, due to increased data center project activity as this segment benefited from the same market demand described above within our United States electrical construction and facilities services segment, (c) the institutional market sector, given several public sector or university projects which were active during 2024, (d) the manufacturing and industrial market sector largely as a result of the re-shoring of critical supply chain by certain of our customers, (e) the water and wastewater market sector, driven by several projects within the Southeast region of the United States, and (f) the healthcare market sector, due to an increase in projects throughout several of the regions in which we operate. Partially offsetting these increases was a reduction in revenues within the commercial market sector, largely as a result of the completion of various warehouse and distribution projects, that were active in 2023.\nRevenues of our United States building services segment were $3,114.8 million for the year ended December 31, 2024 compared to $3,120.1 million for the year ended December 31, 2023. Excluding incremental acquisition contribution of $31.0 million, this segment’s revenues decreased by $36.3 million as the strength of its mechanical services division was more than offset by revenue declines within its commercial site-based services and government site-based services divisions due to the loss of certain facilities maintenance contracts not renewed pursuant to rebid. With respect to this segment’s mechanical services division, revenue growth was experienced from: (a) HVAC project and retrofit work, as a result of greater: (i) project execution stemming from the increased availability of materials and equipment when compared to the prior year, which experienced greater supply chain disruptions and delays, and (ii) demand for system upgrades and replacements, partially as our customers continue to seek ways to improve the energy efficiency or indoor air quality of their facilities, (b) service repair and maintenance volumes, given growth in our service contract base, and (c) building automation and controls projects, as we continue to expand our service offerings in this area.\nRevenues of our United States industrial services segment for the year ended December 31, 2024 were $1,277.2 million, a $109.4 million increase compared to revenues of $1,167.8 million for the year ended December 31, 2023. This segment’s results included $45.3 million of incremental revenues from an acquired company. Excluding such acquisition contribution, the increase in this segment’s revenues resulted from greater demand, including turnarounds of a larger size and scope growth on certain projects, in its field services division.\nOur United Kingdom building services segment revenues were $425.5 million for the year ended December 31, 2024 compared to $436.4 million for the year ended December 31, 2023. The decrease in this segment’s revenues for 2024 was primarily a result of the loss of certain facilities maintenance contracts not renewed pursuant to rebid. Revenues of this segment for 2024 were positively impacted by $11.4 million as a result of favorable exchange rate movements for the British pound versus the United States dollar.\n25\nTable of Contents\nCost of sales and gross profit \nThe following table presents cost of sales, gross profit (revenues less cost of sales), and gross profit as a percentage of revenues (“gross profit margin”) for the years ended December 31, 2024 and 2023 (in thousands, except for percentages):  \n \n2024\n2023\nCost of sales\n$\n11,801,065 \n$\n10,493,534 \nGross profit\n$\n2,765,051 \n$\n2,089,339 \nGross profit margin\n19.0 \n%\n16.6 \n%\nOur gross profit for the year ended December 31, 2024 was $2,765.1 million, or 19.0% of revenues, compared to gross profit of $2,089.3 million, or 16.6% of revenues, for the year ended December 31, 2023. The increase in gross profit and the expansion in gross profit margin were driven by each of our domestic reportable segments due to an improved revenue mix, excellent project execution, and/or favorable pricing. Our gross profit for 2024 included incremental acquisition contribution of $46.2 million net of amortization expense attributable to identifiable intangible assets of $8.6 million. Refer to the operating income section below for further discussion regarding the operating performance of each of our reportable segments.\nSelling, general and administrative expenses \nThe following table presents selling, general and administrative expenses (“SG&A”) and selling, general and administrative expenses as a percentage of revenues (“SG&A margin”) for the years ended December 31, 2024 and 2023 (in thousands, except for percentages):  \n \n2024\n2023\nSelling, general and administrative expenses\n$\n1,420,188 \n$\n1,211,233 \nSG&A margin\n9.7 \n%\n9.6 \n%\nOur selling, general and administrative expenses for the year ended December 31, 2024 were $1,420.2 million, or 9.7% of revenues, compared to selling, general and administrative expenses of $1,211.2 million, or 9.6% of revenues, for the year ended December 31, 2023. Selling, general and administrative expenses for 2024 included $32.8 million of incremental expenses directly related to companies acquired in 2024 and 2023, including amortization expense attributable to identifiable intangible assets of $6.7 million. Excluding incremental expenses from businesses acquired, the increase in selling, general and administrative expenses was predominantly attributable to greater: (a) salaries and related employment expenses, largely as a result of additional headcount to support our organic revenue growth as well as annual cost of living adjustments, and (b) incentive compensation expense at certain of our operating subsidiaries, due to higher operating results than in the prior year.\nOperating income (loss) \nThe following table presents by segment our operating income (loss) and each segment’s operating income (loss) as a percentage of such segment’s revenues (“operating margin”) for the years ended December 31, 2024 and 2023 (in thousands, except for percentages): \n \n \n2024\n% of\nSegment\nRevenues \n2023\n% of\nSegment\nRevenues \nOperating income (loss):\n \n \n \n \nUnited States electrical construction and facilities services\n$\n447,186 \n13.4 \n%\n$\n230,640 \n8.3 \n%\nUnited States mechanical construction and facilities services\n799,613 \n12.5 \n%\n530,644 \n10.5 \n%\nUnited States building services\n176,720 \n5.7 \n%\n182,995 \n5.9 \n%\nUnited States industrial services\n44,213 \n3.5 \n%\n35,375 \n3.0 \n%\nTotal United States operations\n1,467,732 \n10.4 \n%\n979,654 \n8.1 \n%\nUnited Kingdom building services\n21,485 \n5.0 \n%\n25,681 \n5.9 \n%\nCorporate administration\n(144,354)\n— \n(127,229)\n— \nImpairment loss on long-lived assets\n— \n— \n(2,350)\n— \nConsolidated operating income\n1,344,863 \n9.2 \n%\n875,756 \n7.0 \n%\nOther items:\n \n \n \n \nNet periodic pension income (cost)\n894 \n(1,119)\nInterest expense\n(3,779)\n(17,199)\nInterest income\n35,404 \n \n15,415 \n \nIncome before income taxes\n$\n1,377,382 \n \n$\n872,853 \n \n26\nTable of Contents\nOperating income for the year ended December 31, 2024 was $1,344.9 million, an increase of $469.1 million compared to operating income of $875.8 million for the year ended December 31, 2023. Operating margin was 9.2% and 7.0% in 2024 and 2023, respectively. As described in more detail below, these increases in profitability were predominantly a result of improved operating performance within our United States construction segments, due to a more favorable mix of work and better project execution, including enhanced productivity, due in part to investments in virtual design and construction, prefabrication, and automation. Operating income for 2024 included incremental acquisition contribution of $13.4 million net of amortization expense attributable to identifiable intangible assets of $15.3 million.\nOperating income of our United States electrical construction and facilities services segment for the year ended December 31, 2024 was $447.2 million, or 13.4% of revenues, compared to operating income for the year ended December 31, 2023 of $230.6 million, or 8.3% of revenues. The $216.5 million increase in operating income and 510 basis point improvement in operating margin of this segment were a result of greater gross profit and gross profit margin from projects within the majority of the market sectors in which we operate, due to both an increase in revenues as well as a more favorable mix of work. While the most significant increase in gross profit was experienced within the network and communications market sector, this segment additionally benefited from greater gross profit recognized on projects within the manufacturing and industrial, transportation, institutional, and high-tech manufacturing market sectors.\nOur United States mechanical construction and facilities services segment’s operating income for the year ended December 31, 2024 was $799.6 million, a $269.0 million increase compared to operating income of $530.6 million for the year ended December 31, 2023. Operating margin of this segment for the year ended December 31, 2024 was 12.5%, a 200 basis point improvement over its operating margin for the year ended December 31, 2023 of 10.5%. This segment’s operating income for 2024 included incremental acquisition contribution of $14.4 million net of amortization expense attributable to identifiable intangible assets of $10.3 million. Excluding the impact of acquisitions, the increases in operating income and operating margin of this segment were primarily a result of contribution from projects within: (a) the high-tech manufacturing market sector, including certain mechanical construction or fire protection projects for customers engaged in either the design or manufacturing of semiconductors or the production and development of electric vehicles and/or lithium batteries, and (b) the network and communications market sector. While the most significant increases in gross profit were seen within the above referenced market sectors, this segment also experienced increases in gross profit across all of the other market sectors in which we operate, with notable increases generated within institutional, manufacturing and industrial, and commercial.\nOperating income of our United States building services segment for the year ended December 31, 2024 was $176.7 million, or 5.7% of revenues, compared to operating income of $183.0 million, or 5.9% of revenues, for the year ended December 31, 2023. Increased gross profit from this segment’s mechanical services division, due primarily to greater profitability across its portfolio of HVAC and building automation and controls projects and retrofits, was partially offset by reductions in gross profit from its commercial site-based services and government site-based services divisions, given the loss of certain facilities maintenance contracts not renewed pursuant to rebid. In addition, operating income and operating margin for the year ended December 31, 2024 were negatively impacted by an $11.0 million reserve recorded during the first quarter for a specific customer bankruptcy within this segment’s commercial site-based services division. Such reserve negatively impacted the operating margin of this segment for 2024 by approximately 30 basis points. \nOur United States industrial services segment’s operating income for the year ended December 31, 2024 was $44.2 million, or 3.5% of revenues, compared to operating income of $35.4 million, or 3.0% of revenues, for the year ended December 31, 2023. Operating income of this segment benefited from greater gross profit generated within its: (a) field services division due to the increase in revenues referenced above, and (b) shop services division as a result of an improvement in gross profit margin given favorable pricing. The increase in operating margin of this segment was attributable to the increased gross profit margin within the shop services division.\nOperating income of our United Kingdom building services segment for the year ended December 31, 2024 was $21.5 million, or 5.0% of revenues, compared to operating income of $25.7 million, or 5.9% of revenues, for the year ended December 31, 2023. The decrease in operating income and operating margin was due to a decline in gross profit and gross profit margin. In addition to the impact of lower facilities maintenance revenues, gross profit and gross profit margin were negatively affected by a less favorable mix of work when compared to the prior year, which included a greater number of higher margin projects. Operating income of this segment for 2024 was positively impacted by $0.5 million as a result of favorable exchange rate movements for the British pound versus the United States dollar.\nOur corporate administration expenses were $144.4 million for 2024 compared to $127.2 million in 2023. The increase in corporate expenses was primarily due to: (a) greater employment compensation and related costs, including salaries and benefits, incentive compensation, and share-based compensation, (b) certain severance expenses which were recorded during the first quarter of the year, and (c) higher computer hardware and software costs, due to various information technology and cybersecurity initiatives currently in process.\n27\nTable of Contents\nOther items \nInterest expense was $3.8 million and $17.2 million for the years ended December 31, 2024 and 2023, respectively. The year-over-year decrease in interest expense was a result of the repayment, in December of 2023, of all previously outstanding direct borrowings under our credit facility. Interest income was $35.4 million and $15.4 million for the years ended December 31, 2024 and 2023, respectively. The increase in annual interest income resulted from greater returns on our invested cash, due to an increase in our average daily invested cash balance.\nOur income tax provision for the year ended December 31, 2024 was $370.2 million, based on an income tax rate of 26.9%, compared to an income tax provision and an income tax rate of $239.5 million and 27.5%, respectively, for the year ended December 31, 2023. Refer to Note 11 - Income Taxes of the notes to consolidated financial statements included in Item 8. Financial Statements and Supplementary Data for further discussion regarding our income tax provision and effective income tax rate.\nRemaining Unsatisfied Performance Obligations    \nThe following table presents the transaction price allocated to remaining unsatisfied performance obligations (“remaining performance obligations”) for each of our reportable segments and their respective percentage of total remaining performance obligations (in thousands, except for percentages):\nDecember 31, 2024\n% of Total\nDecember 31, 2023\n% of Total\nRemaining performance obligations:\nUnited States electrical construction and facilities services\n$\n3,068,396 \n31 \n%\n$\n2,387,844 \n27 \n%\nUnited States mechanical construction and facilities services\n5,463,096 \n54 \n%\n4,940,519 \n56 \n%\nUnited States building services\n1,246,642 \n12 \n%\n1,264,818 \n14 \n%\nUnited States industrial services\n138,599 \n1 \n%\n113,291 \n1 \n%\nTotal United States operations\n9,916,733 \n98 \n%\n8,706,472 \n98 \n%\nUnited Kingdom building services\n185,466 \n2 \n%\n140,949 \n2 \n%\nTotal operations\n$\n10,102,199 \n100 \n%\n$\n8,847,421 \n100 \n%\nOur remaining performance obligations at December 31, 2024 were $10.10 billion compared to $8.85 billion at December 31, 2023. Remaining performance obligations increased within all of our reportable segments, with the exception of our United States building services segment, which experienced a modest decline. The most significant growth was experienced within our United States construction segments, largely as a result of the award of several data center construction contracts within the network and communications market sector. These segments also experienced increases in remaining performance obligations across a number of the other sectors we serve, most notably within healthcare. Remaining performance obligations increased by $178.8 million as a result of acquisitions made by us during 2024. Partially offsetting these increases was a decrease in remaining performance obligations within the high-tech manufacturing market sector primarily as a result of progress made on certain semiconductor and electric vehicle manufacturing construction projects within our United States mechanical construction and facilities services segment.\nSee Note 3 - Revenue from Contracts with Customers of the notes to consolidated financial statements included in Item 8. Financial Statements and Supplementary Data for further disclosure regarding our remaining performance obligations.\n2023 versus 2022\nFor discussion and analysis of results of operations for the year ended December 31, 2023 compared to the year ended December 31, 2022, refer to Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations of our Form 10-K for the year ended December 31, 2023.\n28\nTable of Contents\nLiquidity and Capital Resources\nThe following section discusses our principal liquidity and capital resources, as well as our primary liquidity requirements and sources and uses of cash. \nWe are focused on the efficient conversion of operating income into cash to provide for the Company’s material cash requirements, including working capital needs, investment in our growth strategies through business acquisitions and capital expenditures, satisfaction of contractual commitments, including principal and interest payments on any outstanding indebtedness, and shareholder return through dividend payments and share repurchases. We strive to maintain a balanced approach to capital allocation in order to achieve growth, deliver value, and minimize risk. \nManagement monitors financial markets and overall economic conditions for factors that may affect our liquidity and capital resources and adjusts our capital allocation strategy as necessary. Negative macroeconomic trends could have an adverse effect on future liquidity if we experience delays in the payment of outstanding receivables beyond normal payment terms, an increase in credit losses, or significant increases in the price of commodities or the materials and equipment utilized for our project and service work, beyond those experienced to date. In addition, during economic downturns, there have typically been fewer small discretionary projects from the private sector and our competitors have aggressively bid larger long-term infrastructure and public sector contracts. Our liquidity is also impacted by: (a) the type and length of construction contracts in place, as performance of long duration contracts typically requires greater amounts of working capital, (b) the level of turnaround activities within our United States industrial services segment, as such projects are billed in arrears pursuant to contractual terms that are standard within the industry, and (c) the billing terms of our maintenance contracts, including those within our United States and United Kingdom building services segments. While we strive to negotiate favorable billing terms, which allow us to invoice in advance of costs incurred on certain of our contracts, there can be no assurance that such terms will be agreed to by our customers.\nAs of December 31, 2024, we had cash and cash equivalents, excluding restricted cash, of $1,339.6 million, which are maintained in depository accounts and highly liquid investments with original maturity dates of three months or less. Both our short-term and long-term liquidity requirements are expected to be met through our cash and cash equivalent balances, cash generated from our operations, and, as necessary, the borrowing capacity under our revolving credit facility. Our credit agreement provides for a $1.30 billion revolving credit facility, for which there was $1.23 billion of available capacity as of December 31, 2024. \nRefer to Note 9 - Debt of the notes to consolidated financial statements included in Item 8. Financial Statements and Supplementary Data for further information regarding our credit agreement. Based upon our current credit rating and financial position, we can also reasonably expect to be able to secure long-term debt financing if required to achieve our strategic objectives; however, no assurances can be made that such debt financing will be available on favorable terms. We believe that we have sufficient financial resources available to meet our short-term and foreseeable long-term liquidity requirements.\nCash Flows\nThe following table presents a summary of our operating, investing, and financing cash flows (in thousands):\n \n \n2024\n2023\nNet cash provided by operating activities\n$\n1,407,894 \n$\n899,655 \nNet cash used in investing activities\n$\n(299,284)\n$\n(161,291)\nNet cash used in financing activities\n$\n(555,365)\n$\n(412,054)\nEffect of exchange rate changes on cash, cash equivalents, and restricted cash\n$\n(2,600)\n$\n6,372 \nIncrease in cash, cash equivalents, and restricted cash\n$\n550,645 \n$\n332,682 \nDuring the year ended December 31, 2024, our cash balance, including cash equivalents and restricted cash, increased by $550.6 million from $789.8 million at December 31, 2023 to $1,340.4 million at December 31, 2024. Changes in our cash position from December 31, 2023 to December 31, 2024 are described in further detail below. For a discussion of the changes in our cash position from December 31, 2022 to December 31, 2023, refer to the Liquidity and Capital Resources section included in Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations of our Form 10-K for the year ended December 31, 2023. \nOperating Activities\n – Operating cash flows generally represent our net income as adjusted for certain non-cash items and changes in assets and liabilities. For 2024, net cash provided by operating activities was approximately $1,407.9 million compared to approximately $899.7 million in 2023. The $508.2 million year-over-year increase in operating cash flows was primarily a result of: (a) our improved operating performance and the corresponding increase in our net income and (b) the timing of cash receipts from our customers.\n29\nTable of Contents\nInvesting Activities\n – Investing cash flows consist primarily of payments for acquisition of businesses, capital expenditures, and proceeds from the sale or disposal of property, plant, and equipment. Net cash used in investing activities for 2024 increased by approximately $138.0 million compared to 2023, primarily due to an increase in payments for acquisitions.\nFinancing Activities\n – Financing cash flows consist primarily of the issuance and repayment of short-term and long-term debt, repurchases of common stock, payments of dividends to stockholders, and the issuance of common stock through certain equity plans. Net cash used in financing activities during 2024 was $555.4 million compared to $412.1 million during 2023. The $143.3 million variance was primarily due to an increase in common stock repurchases made by us during 2024, partially offset by the impact of repayments on our outstanding debt in the prior year period. The timing of common stock repurchases is at management’s discretion subject to securities laws and other legal requirements and depends upon several factors, including market and business conditions, current and anticipated future liquidity, share price, and share availability, among others. For additional detail regarding our share repurchase program, refer to Note 12 - Common Stock of the notes to consolidated financial statements included in Item 8. Financial Statements and Supplementary Data.\nWe currently pay a regular quarterly dividend of $0.25 per share. For the years ended December 31, 2024 and 2023, cash payments related to dividends were $43.4 million and $32.7 million, respectively. Our credit agreement places limitations on the payment of dividends on our common stock. However, we do not believe that the terms of such agreement currently materially limit our ability to pay such quarterly dividends for the foreseeable future. \nEffect of Exchange Rate Changes on Cash, Cash Equivalents, and Restricted Cash \n–\n \nWe are exposed to fluctuations in foreign currency exchange rates, almost entirely with respect to the British pound. Therefore, the $9.0 million variance between the years ended December 31, 2024 and 2023 was a direct result of exchange rate movements for the British pound versus the United States dollar.\nMaterial Cash Requirements from Contractual and Other Obligations\nAs of December 31, 2024, our short-term and long-term material cash requirements for known contractual and other obligations were as follows: \nOutstanding Debt and Interest Payments\n – As of December 31, 2024, there were no direct borrowings outstanding under our revolving credit facility. Interest payments on any future borrowings will be determined based on prevailing interest rates at that time. Refer to Note 9 - Debt of the notes to consolidated financial statements included in Item 8. Financial Statements and Supplementary Data for further detail of our debt obligations, including our revolving credit facility.\nOperating and Finance Leases\n – In the normal course of business, we lease real estate, vehicles, and equipment under various arrangements which are classified as either operating or finance leases. Future payments for such leases, excluding leases with initial terms of one year or less, were $390.1 million at December 31, 2024, with $96.9 million payable within the next 12 months. Refer to Note 16 - Leases of the notes to consolidated financial statements included in Item 8. Financial Statements and Supplementary Data for further detail surrounding our lease obligations and the timing of expected future payments.\nOpen Purchase Obligations\n – As of December 31, 2024, we had $2.33 billion of open purchase obligations, of which payments totaling approximately $2.01 billion are expected to become due within the next 12 months. These obligations represent open purchase orders to suppliers and subcontractors related to our construction and services contracts. These purchase orders are not reflected in the Consolidated Balance Sheets and are not expected to impact future liquidity as amounts should be recovered through customer billings. \nInsurance Obligations\n – As described in further detail in Note 2 - Summary of Significant Accounting Policies of the notes to consolidated financial statements included in Item 8. Financial Statements and Supplementary Data, we have loss payment deductibles and/or self-insured retentions for certain insurance matters. As of December 31, 2024, our insurance liabilities, net of estimated recoveries, were $240.1 million. Of this net amount, approximately $41.6 million is estimated to be payable within the next 12 months. Due to many uncertainties inherent in resolving these matters, it is not practical to estimate these payments beyond such period. To the extent that the amount required to settle claims covered by insurance continues to increase, the cost of our insurance coverage, including premiums and deductibles, is likely to increase.\nContingent Consideration Liabilities\n – We have incurred liabilities related to contingent consideration arrangements associated with certain acquisitions, payable in the event discrete performance objectives are achieved by the acquired businesses during designated post-acquisition periods. The aggregate amount of these liabilities can change due to additional business acquisitions, settlement of outstanding liabilities, changes in the fair value of amounts owed based on performance during such post-acquisition periods, and accretion in present value. As of December 31, 2024, the present value of expected future payments relating to these contingent consideration arrangements was $29.7 million. Of this amount, $20.4 million is estimated as being payable during 2025, with the remainder due pursuant to the terms of our contractual agreements, some of which extend into 2027.\n30\nTable of Contents\nIn addition, material cash requirements for other potential obligations, for which we cannot reasonably estimate future payments, include the following:\nLegal Proceedings\n – We are involved in several legal proceedings in which damages and claims have been asserted against us. While litigation is subject to many uncertainties and the outcome of litigation is not predictable with assurance, we do not believe that any such matters will have a material adverse effect on our financial position, results of operations, or liquidity. Refer to Note 15 - Commitments and Contingencies of the notes to consolidated financial statements included in Item 8. Financial Statements and Supplementary Data for more information regarding legal proceedings\n.\nMultiemployer Benefit Plans\n – In addition to our Company sponsored benefit plans, we participate in certain multiemployer pension and other post-retirement plans. The cost of these plans is equal to the annual required contributions determined in accordance with the provisions of negotiated collective bargaining agreements. During 2024, 2023, and 2022, contributions made to these plans were $577.0 million, $502.3 million, and $449.9 million, respectively; however, our future contributions to the multiemployer plans are dependent upon a number of factors. Amounts of future contributions that we would be contractually obligated to make pursuant to these plans cannot be reasonably estimated. Refer to Note 14 - Retirement Plans of the notes to consolidated financial statements included in Item 8. Financial Statements and Supplementary Data for more information regarding multiemployer benefit plans.\nOff-Balance Sheet Arrangements and Other Commercial Commitments\nThe terms of our construction contracts frequently require that we obtain from surety companies, and provide to our customers, surety bonds as a condition to the award of such contracts. These surety bonds are issued in return for premiums, which vary depending on the size and type of the bond, and secure our payment and performance obligations under such contracts. We have agreed to indemnify the surety companies for amounts, if any, paid by them in respect of surety bonds issued on our behalf. As of December 31, 2024, based on the percentage-of-completion of our projects covered by surety bonds, our aggregate estimated exposure, assuming defaults on all our then existing contractual obligations, was approximately $2.5 billion, which represents approximately 25% of our total remaining performance obligations. \nSurety bonds expire at various times ranging from final completion of a project to a period extending beyond contract completion in certain circumstances. Such amounts can also fluctuate from period to period based upon the mix and level of our bonded operating activity. For example, public sector contracts require surety bonds more frequently than private sector contracts and, accordingly, our bonding requirements typically increase as the amount of our public sector work increases. Our estimated maximum exposure as it relates to the value of the surety bonds outstanding is lowered on each bonded project as the cost to complete is reduced, and each commitment under a surety bond generally extinguishes concurrently with the expiration of its related contractual obligation.\nSurety bonds are sometimes provided to secure obligations for wages and benefits payable to or for certain of our employees, at the request of labor unions representing such employees. In addition, surety bonds or letters of credit may be issued as collateral for certain insurance obligations. As of December 31, 2024, we satisfied approximately $61.7 million and $71.1 million of the collateral requirements of our insurance programs by utilizing surety bonds and letters of credit, respectively. All such letters of credit were issued under our revolving credit facility, therefore reducing the available capacity of such facility.\nWe are not aware of any losses in connection with surety bonds that have been posted on our behalf, and we do not expect to incur significant losses in the foreseeable future.\nFrom time to time, we discuss with our current and other surety bond providers the amounts of surety bonds that may be available to us based on our financial strength and the absence of any default by us on any surety bond issued on our behalf and believe those amounts are currently adequate for our needs. However, if we experience changes in our bonding relationships or if there are adverse changes in the surety industry, we may: (a) seek to satisfy certain customer requests for surety bonds by posting other forms of collateral in lieu of surety bonds, such as letters of credit, parent company guarantees, or cash, in order to convince customers to forego the requirement for surety bonds, (b) increase our activities in our businesses that rarely require surety bonds, and/or (c) refrain from bidding for certain projects that require surety bonds. \nThere can be no assurance that we would be able to effectuate alternatives to providing surety bonds to our customers or to obtain, on favorable terms, sufficient additional work that does not require surety bonds. Accordingly, a reduction in the availability of surety bonds could have a material adverse effect on our financial position, results of operations, and/or cash flows.\nIn the ordinary course of business, we, at times, guarantee obligations of our subsidiaries under certain contracts. Generally, we are liable under such an arrangement only if our subsidiary fails to perform its obligations under the contract. Historically, we have not incurred any substantial liabilities as a consequence of these guarantees. \nWe do not have any other material financial guarantees or off-balance sheet arrangements other than those disclosed herein. \n31\nTable of Contents\nOther Items\nTo help mitigate the impacts of greenhouse gas emissions on climate change, EMCOR has established initial carbon-based fuel consumption and greenhouse gas emission reduction targets. Although to date we have not incurred any material costs or capital expenditures associated with achieving our targets, we could be required to expend amounts in future periods as we continue to work towards our goals. It is not possible, at this time, to estimate the impact that future costs and/or capital expenditures may have on our business, financial condition, results of operations, or liquidity.\nNew Accounting Pronouncements \nWe review new accounting standards to determine the expected impact, if any, that the adoption of such standards will have on our financial position and/or results of operations. See Note 2 - Summary of Significant Accounting Policies of the notes to consolidated financial statements included in Item 8. Financial Statements and Supplementary Data for further information regarding new accounting standards, including the anticipated dates of adoption and the effects on our consolidated financial position, results of operations, or liquidity. \nCritical Accounting Policies and Estimates \nThe preparation of our consolidated financial statements is based on the application of significant accounting policies, which require management to make estimates and assumptions. Our significant accounting policies are described further in Note 2 - Summary of Significant Accounting Policies of the notes to consolidated financial statements included in Item 8. Financial Statements and Supplementary Data. We base our estimates on historical experience, known or expected trends, third-party valuations, and various other assumptions that we believe to be reasonable under the circumstances. As future events and their effects cannot be determined with precision, actual results could differ significantly from these estimates. There have been no significant changes to our critical accounting policies or methods for the year ended December 31, 2024. We believe the following critical accounting policies govern the more significant judgments and estimates used in the preparation of our financial statements.\nRevenue Recognition from Contracts with Customers \nThe Company recognizes revenue when it transfers promised goods or services to customers in an amount that reflects the consideration to which we expect to be entitled in exchange for those goods or services by applying the following five step model: (1) identify the contract with a customer; (2) identify the performance obligations in the contract; (3) determine the transaction price; (4) allocate the transaction price to the performance obligations in the contract; (5) recognize revenue as performance obligations are satisfied.\nThe nature of our contracts gives rise to several types of variable consideration, including pending change orders and claims; contract bonuses and incentive fees; and liquidated damages and penalties. We recognize revenue for such variable consideration when it is probable, in our judgment, that a significant future reversal in the amount of cumulative revenue recognized under the contract will not occur when the uncertainty associated with the variable consideration is subsequently resolved. The Company estimates the amount of variable consideration to be included in the transaction price utilizing one of two prescribed methods, depending on which method better predicts the amount of consideration to which the entity will be entitled. \nDue to uncertainties inherent in the estimation process, as well as the significant judgment involved in determining variable consideration, it is possible that estimates of costs to complete a performance obligation, and/or our estimates of transaction prices, will be revised in the near term. For those performance obligations for which revenue is recognized using a cost-to-cost input method, changes in total estimated costs, and related progress towards complete satisfaction of the performance obligation, or changes in the estimate of transaction prices, are recognized on a cumulative catch-up basis in the period in which the revisions to the estimates are made. \nBased on an evaluation of individual projects that were substantially complete in prior periods but had revisions to total estimated costs or anticipated contract value (inclusive of the settlement of previously outstanding change orders and claims) that resulted in an increase to profitability in excess of $1.0 million, we recognized revenue during the years ended December 31, 2024 and 2023, as summarized in the following table (in thousands):\n \n2024\n2023\nUnited States electrical construction and facilities services\n$\n14,006 \n$\n3,350 \nUnited States mechanical construction and facilities services\n10,551 \n13,114 \nTotal impact\n$\n24,557 \n$\n16,464 \nThere were no significant amounts of revenue recognized during the year ended December 31, 2022 related to performance obligations satisfied in prior periods.\n32\nTable of Contents\nIncluded in our results for the year ended December 31, 2024 was $12.3 million of gross profit recognized on two contracts, which are currently in process, as a result of favorable developments on certain claims. Of this amount, $8.4 million was reported within our United States electrical construction and facilities services segment and $3.9 million was reported within our United States mechanical construction and facilities services segment.\nBased on an evaluation of individual projects that had revisions to total estimated costs or anticipated contract value that resulted in a reduction of profitability in excess of $1.0 million, our operating results were negatively impacted during the years ended December 31, 2024, 2023, and 2022, as summarized in the following table (in thousands): \n \n2024\n2023\n2022\nUnited States electrical construction and facilities services\n$\n27,977 \n$\n12,535 \n$\n33,463 \nUnited States mechanical construction and facilities services\n38,342 \n10,864 \n13,679 \nUnited States building services\n— \n5,658 \n1,261 \nTotal impact\n$\n66,319 \n$\n29,057 \n$\n48,403 \nDue to the significant judgments utilized in the estimation process described above, if subsequent actual results and/or updated assumptions, estimates, or projections related to our underlying project positions were to change from those utilized at December 31, 2024, it could result in a material impact to our results of operations. For example, a 50 basis point increase or decrease in the estimated gross profit margin on our uncompleted construction projects, in the aggregate, as a result of a revision in estimated costs to complete a performance obligation or a revision in estimated transaction price, would have resulted in an increase or decrease to operating income of approximately $130 million for the year ended December 31, 2024. \nSee Note 3 - Revenue from Contracts with Customers of the notes to consolidated financial statements included in Item 8. Financial Statements and Supplementary Data for further disclosure regarding revenue recognition.\nInsurance Liabilities \nWe have loss payment deductibles for certain workers’ compensation, automobile liability, general liability, and property claims, have self-insured retentions for certain other casualty claims, and are self-insured for employee-related healthcare claims. In addition, we maintain a wholly-owned captive insurance subsidiary to manage certain of our insurance liabilities. Losses are recorded based upon estimates of our liability for claims incurred and for claims incurred but not reported. The liabilities are derived from known facts, historical trends, and industry averages, utilizing the assistance of an independent third-party actuary to determine the best estimate for the majority of these obligations. We believe the liabilities recognized on the Consolidated Balance Sheets for these obligations are adequate. However, such obligations are difficult to assess and estimate due to numerous factors, including severity of injury, determination of liability in proportion to other parties, timely reporting of occurrences, and effectiveness of safety and risk management programs. Therefore, if our actual experience differs from the assumptions and estimates used for recording the liabilities, adjustments may be required and will be recorded in the period that the experience becomes known. In addition, an increase in the cost to settle insurance claims could result in higher insurance costs and deductibles. Our estimated net insurance liabilities for workers’ compensation, automobile liability, general liability, and property claims increased by $20.0 million for the year ended December 31, 2024 compared to the year ended December 31, 2023, partially as a result of greater potential exposures and an increase in certain of our deductibles or self-insured retentions. If our estimated insurance liabilities for workers’ compensation, automobile liability, general liability, and property claims were to increase by 10%, it would have resulted in $24.0 million of additional expense for the year ended December 31, 2024.\nGoodwill, Identifiable Intangible Assets, and Other Long-Lived Assets\nGoodwill\nAs of December 31, 2024 and 2023, we had goodwill of $1,018.4 million and $956.5 million, respectively, arising out of the acquisition of businesses. Goodwill is not amortized but instead allocated to its respective reporting unit and evaluated for impairment annually, or more frequently if events or circumstances indicate that the carrying amount of goodwill may be impaired. We have determined that our reporting units are consistent with the reportable segments identified in Note 18 - Segment Information of the notes to consolidated financial statements included in Item 8. Financial Statements and Supplementary Data. As of December 31, 2024, approximately 18.8% of our goodwill related to our United States electrical construction and facilities services segment, approximately 33.8% related to our United States mechanical construction and facilities services segment, approximately 35.2% related to our United States building services segment, and approximately 12.2% related to our United States industrial services segment. \n33\nTable of Contents\nAbsent any earlier identified impairment indicators, we perform our annual goodwill impairment assessment on October 1 each fiscal year. Qualitative indicators that may trigger the need for interim quantitative impairment testing include, among others, a deterioration in macroeconomic conditions, declining financial performance, deterioration in the operational environment, or an expectation of selling or disposing of a portion of a reporting unit. Additionally, an interim impairment test may be triggered by a significant change in business climate, a loss of a significant customer, increased competition, or a sustained decrease in share price. In assessing whether our goodwill is impaired, we compare the fair value of the reporting unit to its carrying amount, including goodwill. If the fair value exceeds the carrying amount, no impairment is recognized. However, if the carrying amount of the reporting unit exceeds the fair value, the goodwill of the reporting unit is impaired and an impairment loss in the amount of the excess is recognized and charged to operations.\nWe performed our annual impairment assessment of all reporting units as of October 1, 2024 and determined there was no impairment of goodwill. Based on these impairment assessments, the fair values of our United States electrical construction and facilities services segment, our United States mechanical construction and facilities services segment, our United States building services segment, and our United States industrial services segment exceeded their carrying values by approximately $3,940.5 million, $6,852.3 million, $1,143.8 million, and $163.1 million, respectively. As part of such annual testing, we compared the aggregate fair value of our reporting units to our market capitalization, noting that such comparison supported the reasonableness of the key assumptions utilized in determining the fair value of each of our reporting units. \nIn completing our annual impairment assessment, we determined the fair value of each of our reporting units using an income approach whereby fair value was calculated utilizing discounted estimated future cash flows, assuming a risk-adjusted industry weighted average cost of capital. The weighted average cost of capital used in our annual impairment testing was 10.6% for our United States construction segments, 10.9% for our United States building services segment, and 10.5% for our United States industrial services segment. These weighted average cost of capital estimates were developed with the assistance of an independent third-party valuation specialist and reflect the overall level of inherent risk within the respective reporting unit and the rate of return a market participant would expect to earn. \nOur cash flow projections were derived from our most recent internal forecasts of anticipated revenue growth rates and operating margins, with cash flows beyond the discrete forecast period estimated using a terminal value calculation which incorporated historical and forecasted trends, an estimate of long-term growth rates, and assumptions about the future demand for our services. The perpetual growth rate used for our annual testing was 2.5% for all of our reporting units.\nDue to the inherent uncertainties involved in making estimates, our assumptions may change in future periods. Estimates and assumptions made for purposes of our goodwill impairment testing may prove to be inaccurate predictions of the future, and other factors used in assessing fair value, such as the weighted average cost of capital, are outside the control of management. Unfavorable changes in certain of these key assumptions may affect future testing results. For example, keeping all other assumptions constant, a 50 basis point increase in the weighted average cost of capital would cause the estimated fair values of our United States electrical construction and facilities services segment, our United States mechanical construction and facilities services segment, our United States building services segment, and our United States industrial services segment to decrease by approximately $226.5 million, $383.7 million, $93.5 million, and $32.5 million, respectively. In addition, keeping all other assumptions constant, a 50 basis point reduction in the perpetual growth rate would cause the estimated fair values of our United States electrical construction and facilities services segment, our United States mechanical construction and facilities services segment, our United States building services segment, and our United States industrial services segment to decrease by approximately $123.2 million, $210.1 million, $46.0 million, and $13.0 million, respectively. Given the amounts by which the fair value exceeds the carrying value for each of our reporting units, the decreases in estimated fair values described above would not have significantly impacted the results of our 2024 impairment tests. Further, for each of our reporting units, a 10% decline in the estimated fair value of such reporting unit, due to other changes in our assumptions, including forecasted future cash flows, would not have significantly impacted the results of our 2024 impairment tests.\nIdentifiable Intangible Assets and Other Long-Lived Assets\nAs of December 31, 2024 and 2023, net identifiable intangible assets (primarily consisting of our customer relationships, subsidiary trade names, developed technology/vendor network, and contract backlog) arising out of the acquisition of businesses were $648.2 million and $586.0 million, respectively. The determination of related estimated useful lives for identifiable intangible assets and whether those assets are impaired involves significant judgments based upon short- and long-term projections of future performance. These forecasts reflect assumptions regarding anticipated macroeconomic conditions as well as our ability to successfully integrate acquired businesses.\nAbsent earlier indicators of impairment, we test for impairment of subsidiary trade names that are not subject to amortization on an annual basis (October 1). In addition, we review for impairment of identifiable intangible assets that are being amortized as well as other long-lived assets whenever facts and circumstances indicate that their carrying values may not be fully recoverable. \n34\nTable of Contents\nAs of October 1, 2024, we performed our annual impairment testing of all subsidiary trade names that are not subject to amortization and determined that there was no impairment of these assets. In performing this impairment assessment, we considered the sensitivity of the reported amounts to the methods, assumptions, and estimates underlying our testing. For example, we performed sensitivity analyses and concluded that, individually, none of the following changes in estimates or assumptions would have significantly impacted the results of our testing or resulted in a material impairment of our subsidiary trade names: (a) a 50 basis point increase in the discount rate utilized in our testing, (b) a 50 basis point decline in the perpetual growth rate utilized in our testing, or (c) a 10% decrease in the estimated fair value of each trade name.\nWith respect to identifiable intangible assets that are being amortized as well as other long-lived assets, we did not identify any circumstances indicating that their carrying values may not be fully recoverable and, therefore, no impairment testing was required for these assets during the year ended December 31, 2024.\nDuring 2023, we identified facts and circumstances that indicated the carrying values of certain long-lived assets within our United States mechanical construction and facilities services segment may not be fully recoverable, necessitating a comparison of their carrying values to the undiscounted pre-tax cash flows estimated to result from the use of such assets. As a result of this test, we determined that these assets were impaired, and recognized a $2.4 million impairment charge as calculated using a discounted cash flow model.\nOther Considerations\n \nAs referenced above, impairment testing is based upon assumptions and estimates determined by management from a review of our operating results and business plans as well as forecasts of anticipated growth rates and margins, among other considerations. In addition, estimates of weighted average costs of capital are developed with the assistance of an independent third-party valuation specialist. These assumptions and estimates may change in future periods. Significant adverse changes to external market conditions or our internal forecasts, if any, could result in future impairment charges. It is not possible at this time to determine if any future impairment charge will result or, if it does, whether such a charge would be material to our results of operations. \nRefer to Note 8 - Goodwill, Identifiable Intangible Assets, and Other Long-Lived Assets of the notes to consolidated financial statements included in Item 8. Financial Statements and Supplementary Data for further information about our goodwill and identifiable intangible assets as well as our impairment testing. No impairment of our goodwill or identifiable intangible assets was recognized during the years ended December 31, 2024, 2023, or 2022.\n35\nTable of Contents\nITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK \nWe have not used any derivative financial instruments during the years ended December 31, 2024 and 2023, including trading or speculating on changes in interest rates or commodity prices of materials used in our business. \nWe are exposed to market risk for changes in interest rates for any borrowings under our revolving credit facility, which bear interest at variable rates. Although the Federal Reserve Board began to decrease the federal funds rate in 2024 after increases in 2022 and much of 2023, the pace and extent of additional decreases are uncertain. For further information regarding our credit facility and associated borrowing rates, refer to Note 9 - Debt of the notes to consolidated financial statements included in Item 8. Financial Statements and Supplementary Data. \nWe are exposed to construction market risk and its potential related impact on accounts receivable or contract assets on uncompleted contracts. The amounts recorded may be at risk if our customers’ ability to pay these obligations is negatively impacted by economic conditions. We continually monitor the creditworthiness of our customers and maintain on-going discussions with customers regarding contract status with respect to change orders and billing terms. Therefore, we believe we take appropriate action to manage market and other risks, but there is no assurance that we will be able to reasonably identify all risks with respect to the collectability of these assets. For further discussion regarding the collectability of our outstanding accounts receivable, refer to Note 2 - Summary of Significant Accounting Policies of the notes to consolidated financial statements included in Item 8. Financial Statements and Supplementary Data.\nAmounts invested in our foreign operations are translated into U.S. dollars at the exchange rates in effect at the end of the period. The resulting translation adjustments are recorded as accumulated other comprehensive (loss) income, a component of equity, in the Consolidated Balance Sheets. We believe our exposure to the effects that fluctuating foreign currencies may have on our consolidated results of operations is limited because our foreign operations primarily invoice customers and collect obligations in their respective local currencies. Additionally, expenses associated with these transactions are generally contracted and paid for in their same local currencies. \nIn addition, we are exposed to market risk of fluctuations in certain commodity prices of materials, such as copper and steel, which are used as components of supplies or materials utilized in our construction, building services, and industrial services operations. We are also exposed to increases in energy prices, particularly as they relate to gasoline prices for our fleet of approximately 14,000 vehicles. While we believe we can increase our contract prices to adjust for some price increases in commodities, there can be no assurance that such price increases, if they were to occur, would be recoverable. Additionally, our fixed price contracts generally do not allow us to adjust our prices and, as a result, increases in material costs could reduce our profitability with respect to projects in progress.\n36\nTable of Contents\nITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nEMCOR Group, Inc. and Subsidiaries\nCONSOLIDATED BALANCE SHEETS\n(In thousands, except share and per share data)\n \nDecember 31,\n2024\nDecember 31,\n2023\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n1,339,550\n \n$\n789,750\n \nAccounts receivable, less allowance for credit losses of $\n34,957\n and $\n22,502\n, respectively\n3,577,537\n \n3,203,490\n \nContract assets\n284,791\n \n269,885\n \nInventories\n95,667\n \n110,774\n \nPrepaid expenses and other\n91,644\n \n73,072\n \nTotal current assets\n5,389,189\n \n4,446,971\n \nProperty, plant, and equipment, net\n207,489\n \n179,378\n \nOperating lease right-of-use assets\n316,128\n \n310,498\n \nGoodwill\n1,018,415\n \n956,549\n \nIdentifiable intangible assets, net\n648,180\n \n586,032\n \nOther assets\n137,072\n \n130,293\n \nTotal assets\n$\n7,716,473\n \n$\n6,609,721\n \nLIABILITIES AND EQUITY\nCurrent liabilities:\nAccounts payable\n$\n937,087\n \n$\n935,967\n \nContract liabilities\n2,047,540\n \n1,595,109\n \nAccrued payroll and benefits\n751,434\n \n596,936\n \nOther accrued expenses and liabilities\n336,555\n \n315,107\n \nOperating lease liabilities, current\n81,247\n \n75,236\n \nTotal current liabilities\n4,153,863\n \n3,518,355\n \nOperating lease liabilities, long-term\n261,575\n \n259,430\n \nOther long-term obligations\n362,341\n \n361,121\n \nTotal liabilities\n4,777,779\n \n4,138,906\n \nEquity:\nEMCOR Group, Inc. stockholders’ equity:\nPreferred stock, $\n0.10\n par value, \n1,000,000\n shares authorized, \nzero\n issued and outstanding\n—\n \n—\n \nCommon stock, $\n0.01\n par value, \n200,000,000\n shares authorized, \n61,186,088\n and \n61,094,042\n shares issued, respectively\n612\n \n611\n \nCapital surplus\n97,475\n \n91,813\n \nAccumulated other comprehensive loss\n(\n85,527\n)\n(\n85,704\n)\nRetained earnings\n4,778,061\n \n3,814,439\n \nTreasury stock, at cost \n15,375,963\n and \n14,046,777\n shares, respectively\n(\n1,852,964\n)\n(\n1,351,381\n)\nTotal EMCOR Group, Inc. stockholders’ equity\n2,937,657\n \n2,469,778\n \nNoncontrolling interests\n1,037\n \n1,037\n \nTotal equity\n2,938,694\n \n2,470,815\n \nTotal liabilities and equity\n$\n7,716,473\n \n$\n6,609,721\n \nThe accompanying notes to consolidated financial statements are an integral part of these statements.\n37\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFor The Years Ended December 31,\n(In thousands, except per share data)\n2024\n2023\n2022\nRevenues\n$\n14,566,116\n \n$\n12,582,873\n \n$\n11,076,120\n \nCost of sales\n11,801,065\n \n10,493,534\n \n9,472,526\n \nGross profit\n2,765,051\n \n2,089,339\n \n1,603,594\n \nSelling, general and administrative expenses\n1,420,188\n \n1,211,233\n \n1,038,717\n \nImpairment loss on long-lived assets\n—\n \n2,350\n \n—\n \nOperating income\n1,344,863\n \n875,756\n \n564,877\n \nNet periodic pension income (cost)\n894\n \n(\n1,119\n)\n4,311\n \nInterest expense\n(\n3,779\n)\n(\n17,199\n)\n(\n13,199\n)\nInterest income\n35,404\n \n15,415\n \n2,761\n \nIncome before income taxes\n1,377,382\n \n872,853\n \n558,750\n \nIncome tax provision\n370,237\n \n239,524\n \n152,628\n \nNet income including noncontrolling interests\n1,007,145\n \n633,329\n \n406,122\n \nNet income attributable to noncontrolling interests\n—\n \n335\n \n—\n \nNet income attributable to EMCOR Group, Inc.\n$\n1,007,145\n \n$\n632,994\n \n$\n406,122\n \nBasic earnings per common share\n$\n21.61\n \n$\n13.37\n \n$\n8.13\n \nDiluted earnings per common share\n$\n21.52\n \n$\n13.31\n \n$\n8.10\n \nDividends declared per common share\n$\n0.93\n \n$\n0.69\n \n$\n0.54\n \nThe accompanying notes to consolidated financial statements are an integral part of these statements.\n38\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\nFor The Years Ended December 31,\n(In thousands)\n2024\n2023\n2022\nNet income including noncontrolling interests\n$\n1,007,145\n \n$\n633,329\n \n$\n406,122\n \nOther comprehensive income (loss), net of tax:\nForeign currency translation adjustments \n(\n2,900\n)\n6,417\n \n(\n10,786\n)\nChanges in post-retirement plans \n(1)\n3,077\n \n1,330\n \n897\n \nOther comprehensive income (loss) \n177\n \n7,747\n \n(\n9,889\n)\nComprehensive income\n1,007,322\n \n641,076\n \n396,233\n \nComprehensive income attributable to noncontrolling interests\n—\n \n335\n \n—\n \nComprehensive income attributable to EMCOR Group, Inc.\n$\n1,007,322\n \n$\n640,741\n \n$\n396,233\n \n_________________\n(1)    \nNet of tax provision of $\n1.0\n million, $\n0.5\n million, and $\n0.3\n million for the years ended December 31, 2024, 2023, and 2022, respectively.\nThe accompanying notes to consolidated financial statements are an integral part of these statements.\n39\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor The Years Ended December 31,\n(In thousands)\n2024\n2023\n2022\nCash flows - operating activities:\nNet income including noncontrolling interests\n$\n1,007,145\n \n$\n633,329\n \n$\n406,122\n \nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization\n56,678\n \n51,822\n \n47,296\n \nAmortization of identifiable intangible assets\n77,002\n \n67,143\n \n61,315\n \nProvision for credit losses\n17,303\n \n7,859\n \n5,166\n \nDeferred income taxes\n(\n29,115\n)\n(\n16,651\n)\n10,483\n \nGain on sale or disposal of property, plant, and equipment\n(\n1,012\n)\n(\n2,057\n)\n(\n6,393\n)\nExcess tax benefits from share-based compensation\n(\n3,978\n)\n(\n1,719\n)\n(\n1,654\n)\nEquity income from unconsolidated entities\n(\n98\n)\n(\n1,660\n)\n(\n391\n)\nNon-cash expense for amortization of debt issuance costs\n822\n \n960\n \n960\n \nNon-cash expense from contingent consideration arrangements\n8,892\n \n2,287\n \n1,610\n \nNon-cash expense for impairment of long-lived assets\n—\n \n2,350\n \n—\n \nNon-cash share-based compensation expense\n19,978\n \n13,739\n \n12,125\n \nDistributions from unconsolidated entities\n1,554\n \n400\n \n400\n \nChanges in operating assets and liabilities, excluding the effect of businesses acquired:\nIncrease in accounts receivable\n(\n311,504\n)\n(\n626,494\n)\n(\n340,091\n)\nDecrease (increase) in inventories\n17,982\n \n(\n23,442\n)\n(\n31,541\n)\n(Increase) decrease in contract assets\n(\n13,318\n)\n5,733\n \n(\n44,725\n)\n(Decrease) increase in accounts payable\n(\n15,362\n)\n82,192\n \n111,488\n \nIncrease in contract liabilities\n426,628\n \n489,728\n \n299,897\n \nIncrease (decrease) in accrued payroll and benefits and other accrued expenses and liabilities\n148,490\n \n189,268\n \n(\n30,025\n)\nChanges in other assets and liabilities, net\n(\n193\n)\n24,868\n \n(\n4,109\n)\nNet cash provided by operating activities\n1,407,894\n \n899,655\n \n497,933\n \nCash flows - investing activities:\nPayments for acquisitions of businesses, net of cash acquired\n(\n228,173\n)\n(\n96,491\n)\n(\n98,656\n)\nProceeds from sale or disposal of property, plant, and equipment\n3,839\n \n13,604\n \n7,145\n \nPurchases of property, plant, and equipment\n(\n74,950\n)\n(\n78,404\n)\n(\n49,289\n)\nNet cash used in investing activities\n(\n299,284\n)\n(\n161,291\n)\n(\n140,800\n)\nCash flows - financing activities:\nProceeds from revolving credit facility\n—\n \n200,000\n \n270,000\n \nRepayments of revolving credit facility\n—\n \n(\n200,000\n)\n(\n270,000\n)\nRepayments of long-term debt and debt issuance costs\n—\n \n(\n246,171\n)\n(\n13,875\n)\nRepayments of finance lease liabilities\n(\n2,855\n)\n(\n2,776\n)\n(\n3,551\n)\nDividends paid to stockholders\n(\n43,384\n)\n(\n32,684\n)\n(\n27,187\n)\nRepurchases of common stock\n(\n489,820\n)\n(\n127,713\n)\n(\n660,609\n)\nTaxes paid related to net share settlements of equity awards\n(\n15,397\n)\n(\n6,060\n)\n(\n7,539\n)\nIssuances of common stock under employee stock purchase plan\n943\n \n9,189\n \n8,177\n \nPayments for contingent consideration arrangements\n(\n4,852\n)\n(\n5,839\n)\n(\n5,534\n)\nNet cash used in financing activities\n(\n555,365\n)\n(\n412,054\n)\n(\n710,118\n)\nEffect of exchange rate changes on cash, cash equivalents, and restricted cash\n(\n2,600\n)\n6,372\n \n(\n12,515\n)\nIncrease (decrease) in cash, cash equivalents, and restricted cash\n550,645\n \n332,682\n \n(\n365,500\n)\nCash, cash equivalents, and restricted cash at beginning of year \n(1)\n789,750\n \n457,068\n \n822,568\n \nCash, cash equivalents, and restricted cash at end of period \n(1)\n$\n1,340,395\n \n$\n789,750\n \n$\n457,068\n \n_________________\n(1)\nIncludes $\n0.8\n million, $\n0.6\n million, and $\n1.2\n million of restricted cash classified as “Prepaid expenses and other” in the Consolidated Balance Sheets as of December 31, 2024, 2022, and 2021, respectively.\nThe accompanying notes to consolidated financial statements are an integral part of these statements.\n40\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nCONSOLIDATED STATEMENTS OF EQUITY\nFor The Years Ended December 31,\n(In thousands) \n \n \nEMCOR Group, Inc. Stockholders\n \n \nTotal\nCommon\nstock\nCapital\nsurplus\nAccumulated other comprehensive loss \n(1)\nRetained\nearnings\nTreasury\nstock\nNoncontrolling\ninterests\nBalance, December 31, 2021\n$\n2,253,089\n \n$\n607\n \n$\n61,874\n \n$\n(\n83,562\n)\n$\n2,835,504\n \n$\n(\n562,036\n)\n$\n702\n \nNet income including noncontrolling interests\n406,122\n \n— \n— \n— \n406,122\n \n— \n— \nOther comprehensive loss\n(\n9,889\n)\n— \n— \n(\n9,889\n)\n— \n— \n— \nCommon stock issued under share-based compensation plans\n2\n \n2\n \n— \n— \n— \n— \n— \nTax withholding for common stock issued under share-based compensation plans\n(\n7,539\n)\n— \n(\n7,539\n)\n— \n— \n— \n— \nCommon stock issued under employee stock purchase plan\n8,177\n \n— \n8,177\n \n— \n— \n— \n— \nCommon stock dividends\n(\n27,187\n)\n— \n158\n \n— \n(\n27,345\n)\n— \n— \nRepurchases of common stock\n(\n660,609\n)\n— \n— \n— \n— \n(\n660,609\n)\n— \nShare-based compensation expense\n12,125\n \n— \n12,125\n \n— \n— \n— \n— \nBalance, December 31, 2022\n$\n1,974,291\n \n$\n609\n \n$\n74,795\n \n$\n(\n93,451\n)\n$\n3,214,281\n \n$\n(\n1,222,645\n)\n$\n702\n \nNet income including noncontrolling interests\n633,329\n \n— \n— \n— \n632,994\n \n— \n335\n \nOther comprehensive income\n7,747\n \n— \n— \n7,747\n \n— \n— \n— \nCommon stock issued under share-based compensation plans\n—\n \n2\n \n(\n2\n)\n— \n— \n— \n— \nTax withholding for common stock issued under share-based compensation plans\n(\n6,060\n)\n— \n(\n6,060\n)\n— \n— \n— \n— \nCommon stock issued under employee stock purchase plan\n9,189\n \n— \n9,189\n \n— \n— \n— \n— \nCommon stock dividends\n(\n32,684\n)\n— \n152\n \n— \n(\n32,836\n)\n— \n— \nRepurchases of common stock\n(\n128,736\n)\n— \n— \n— \n— \n(\n128,736\n)\n— \nShare-based compensation expense\n13,739\n \n— \n13,739\n \n— \n— \n— \n— \nBalance, December 31, 2023\n$\n2,470,815\n \n$\n611\n \n$\n91,813\n \n$\n(\n85,704\n)\n$\n3,814,439\n \n$\n(\n1,351,381\n)\n$\n1,037\n \nNet income including noncontrolling interests\n1,007,145\n \n— \n— \n— \n1,007,145\n \n— \n— \nOther comprehensive income\n177\n \n— \n— \n177\n \n— \n— \n— \nCommon stock issued under share-based compensation plans\n—\n \n1\n \n(\n1\n)\n— \n— \n— \n— \nTax withholding for common stock issued under share-based compensation plans\n(\n15,397\n)\n— \n(\n15,397\n)\n— \n— \n— \n— \nCommon stock issued under employee stock purchase plan\n943\n \n— \n943\n \n— \n— \n— \n— \nCommon stock dividends\n(\n43,384\n)\n— \n139\n \n— \n(\n43,523\n)\n— \n— \nRepurchases of common stock\n(\n501,583\n)\n— \n— \n— \n— \n(\n501,583\n)\n— \nShare-based compensation expense\n19,978\n \n— \n19,978\n \n— \n— \n— \n— \nBalance, December 31, 2024\n$\n2,938,694\n \n$\n612\n \n$\n97,475\n \n$\n(\n85,527\n)\n$\n4,778,061\n \n$\n(\n1,852,964\n)\n$\n1,037\n \n_________________\n(1)\nRepresents cumulative foreign currency translation and post-retirement liability adjustments of $(\n4.7\n) million and $(\n80.8\n) million, respectively, as of December 31, 2024, $(\n1.8\n) million and $(\n83.9\n) million, respectively, as of December 31, 2023, and $(\n8.3\n) million and $(\n85.2\n) million, respectively, as of December 31, 2022. \nThe accompanying notes to consolidated financial statements are an integral part of these statements.\n41\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 1 - \nNATURE OF OPERATIONS \nReferences to the “Company,” “EMCOR,” “we,” “us,” “our” and similar words refer to EMCOR Group, Inc. and its consolidated subsidiaries unless the context indicates otherwise. \nWe are one of the largest specialty contractors in the United States and a leading provider of electrical and mechanical construction and facilities services, building services, and industrial services. Our services are provided to a broad range of commercial, technology, manufacturing, industrial, healthcare, utility, and institutional customers through approximately 100 operating subsidiaries, which specialize principally in providing construction services relating to electrical and mechanical systems in all types of facilities and in providing various services relating to the operation, maintenance, and management of those facilities.\n \nNOTE 2 - \nSUMMARY OF SIGNIFICANT ACCOUNTING POLICIES \nPrinciples of Consolidation \nThe consolidated financial statements include the accounts of the Company and the subsidiaries and joint ventures it controls. All intercompany accounts and transactions have been eliminated. Investments over which we exercise significant influence, but do not control, are accounted for using the equity method of accounting. For joint ventures that have been accounted for using the consolidation method of accounting, noncontrolling interests represent the allocation of earnings to our joint venture partners who either have a minority-ownership interest in the joint venture or are not the primary beneficiary of the joint venture. \nThe results of operations of companies acquired have been included in the results of operations from the date of the respective acquisition.\n \nPrinciples of Preparation \nThe preparation of the consolidated financial statements, in conformity with accounting principles generally accepted in the United States, requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could materially differ from those estimates.\n \nRevenue Recognition \nRevenue is recognized when promised goods or services are transferred to customers in an amount that reflects the consideration to which the Company expects to be entitled in exchange for those goods or services. Refer to Note 3 - Revenue from Contracts with Customers of the notes to consolidated financial statements for additional information.\nCash and Cash Equivalents \nFor purposes of the consolidated financial statements, we consider all highly liquid instruments with original maturities of three months or less to be cash equivalents. We maintain a centralized cash management system whereby our excess cash balances are invested in high quality short-term money market instruments, which are considered cash equivalents. We have cash balances in certain of our domestic bank accounts that exceed federally insured limits.\nAccounts Receivable and Allowance for Credit Losses \nAccounts receivable are recognized in the period we deliver goods and services to our customers or when our right to consideration is unconditional. The Company maintains an allowance for credit losses to reduce outstanding receivables to their net realizable value. Judgment is required when determining expected credit losses. Estimates of such losses are recorded when we believe a customer, or group of customers, may not be able to meet their financial obligations due to deterioration in financial condition or credit rating. Factors relevant to our assessment include our prior collection history with our customers, the related aging of past due balances, projections of credit losses based on historical trends in credit quality indicators or past events, and forecasts of future economic conditions. In addition to monitoring delinquent accounts, management reviews the credit quality of its receivables by, among other things, obtaining credit ratings of significant customers, assessing economic and market conditions, and evaluating material changes to a customer’s business, cash flows, and financial condition.\n42\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (Continued)\nAt December 31, 2024 and 2023, our accounts receivable of $\n3,577.5\n million and $\n3,203.5\n million, respectively, were recorded net of allowances for credit losses of $\n35.0\n million and $\n22.5\n million, respectively. Allowances for credit losses are based on the best facts available and are reassessed and adjusted on a regular basis as additional information is received. Should anticipated collections fail to materialize, or if future economic conditions compare unfavorably to our forecasts, we could experience an increase in our credit losses. The provision for credit losses during 2024, 2023, and 2022 amounted to approximately $\n17.3\n million, $\n7.9\n million, and $\n5.2\n million, respectively. \nThe change in the allowance for credit losses for the year ended December 31, 2024 was as follows (in thousands):\nBalance at December 31, 2023\n$\n22,502\n \nProvision for credit losses\n17,303\n \nAmounts written off against the allowance, net of recoveries\n(\n4,848\n)\nBalance at December 31, 2024\n$\n34,957\n \nThe increase in our allowance for credit losses was primarily due to a reserve taken in the first quarter of 2024 for a specific customer bankruptcy within the commercial site-based services division of our United States building services segment.\nInventories \nInventories are stated at the lower of cost or net realizable value. Cost is determined principally using the average cost method. Refer to Note 6 - Inventories of the notes to consolidated financial statements for additional information.\nLeases\nAt the inception of a contract, we determine whether the arrangement is or contains a lease. Leases are classified as either operating or finance, based on our evaluation of certain criteria. With the exception of short-term leases (leases with an initial term of 12 months or less), we record right-of-use assets and corresponding lease liabilities on the Consolidated Balance Sheets for all leases with contractual fixed payments. Lease liabilities are measured at the present value of remaining lease payments, while right-of-use assets are initially set equal to the lease liability, as adjusted for any payments made prior to lease commencement, lease incentives, and any initial direct costs incurred by us. For operating leases, rent expense is recognized on a straight-line basis over the term of the lease, and right-of-use assets are subsequently re-measured to reflect the effect of uneven lease payments. For finance leases, right-of-use assets are amortized on a straight-line basis over the shorter of the lease term or the useful life of the underlying asset. Expenses for finance leases include the amortization of right-of-use assets, which is recorded as depreciation and amortization expense, and interest expense, which reflects interest accrued on the lease liability.\nShort-term leases are not recorded on the Consolidated Balance Sheets but are expensed on a straight-line basis over the lease term. The majority of the Company’s short-term leases relate to equipment used on construction projects. Such equipment leases are considered short-term in nature unless it is reasonably certain that the equipment will be leased for a period greater than 12 months.\nRefer to Note 16 - Leases of the notes to consolidated financial statements for additional information.\nProperty, Plant, and Equipment \nProperty, plant, and equipment is stated at cost. Depreciation, including amortization of assets under finance leases, is recorded using the straight-line method over estimated useful lives of \n3\n to \n10\n years for machinery and equipment, \n3\n to \n7\n years for vehicles, furniture and fixtures, and computer hardware/software, and \n25\n years for buildings. Leasehold improvements are amortized over the shorter of the remaining lease term or the expected useful life of the improvement. \nThe carrying values of property, plant, and equipment are reviewed for impairment whenever facts and circumstances indicate that the carrying amount may not be fully recoverable. In performing this review for recoverability, property, plant, and equipment is assessed for possible impairment by comparing their carrying values to the undiscounted net pre-tax cash flows expected to result from the use of the asset. Impaired assets are written down to their fair values, generally determined based on their estimated future discounted cash flows.\n \n43\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (Continued)\nGoodwill, Identifiable Intangible Assets, and Other Long-Lived Assets \nGoodwill and indefinite-lived intangible assets, such as trade names, are evaluated at least annually for impairment (each October 1, absent any earlier identified impairment indicators) and are written down if impaired. Identifiable intangible assets with finite lives are amortized over their useful lives and, along with certain other long-lived assets, are reviewed for impairment whenever facts and circumstances indicate that their carrying values may not be fully recoverable. See Note 8 - Goodwill, Identifiable Intangible Assets, and Other Long-Lived Assets of the notes to consolidated financial statements for additional information.\n \nInsurance Liabilities     \nWe have loss payment deductibles for certain workers’ compensation, automobile liability, general liability, and property claims, have self-insured retentions for certain other casualty claims, and are self-insured for employee-related healthcare claims. In addition, we maintain a wholly-owned captive insurance subsidiary to manage certain of our insurance liabilities. Losses are recorded based upon estimates of our liability for claims incurred and for claims incurred but not reported. The liabilities are derived from known facts, historical trends, and industry averages, utilizing the assistance of an independent third-party actuary to determine the best estimate for the majority of these obligations. To the extent that the amount required to settle claims covered by insurance continues to increase, the cost of our insurance coverage, including premiums and deductibles, is likely to increase.\n As of December 31, 2024 and 2023, the estimated current portion of such undiscounted insurance liabilities, included in “Other accrued expenses and liabilities” in the accompanying Consolidated Balance Sheets, were $\n50.8\n million and $\n51.0\n million, respectively. The estimated non-current portion of such undiscounted insurance liabilities included in “Other long-term obligations” as of December 31, 2024 and 2023 were $\n237.3\n million and $\n229.8\n million, respectively. The current portion of anticipated insurance recoveries of $\n9.2\n million and $\n11.9\n million as of December 31, 2024 and 2023, respectively, were included in “Prepaid expenses and other” and the non-current portion of anticipated insurance recoveries of $\n38.7\n million and $\n48.8\n million as of December 31, 2024 and 2023, respectively, were included in “Other assets” in the accompanying Consolidated Balance Sheets.\nForeign Operations \nThe financial statements and transactions of our foreign subsidiaries are maintained in their functional currency and translated into U.S. dollars when preparing our consolidated financial statements. Statements of operations, comprehensive income, and cash flows are translated using weighted average monthly exchange rates, while balance sheets are translated at month-end exchange rates. Translation adjustments are recorded as “Accumulated other comprehensive loss,” a separate component of “Equity.”\n \nIncome Taxes \nThe Company follows the liability method of accounting for income taxes. Under this method, deferred income tax assets and liabilities are recognized for the expected future tax consequences of temporary differences between the financial statement and income tax bases of assets and liabilities as well as for net operating loss and tax credit carryforwards. Deferred income taxes are valued using enacted tax rates expected to be in effect when income taxes are paid or recovered, with the effect of a change in tax laws or rates recognized in the statement of operations in the periods in which such change is enacted. The ultimate realization of deferred income tax assets is dependent upon the generation of future taxable income during the period in which those temporary differences become deductible. Deferred income taxes are recorded net of a valuation allowance when it is more likely than not that all or a portion of a deferred tax asset will not be realized. In making such determination, we consider all available evidence, including projections of future taxable income, tax-planning strategies, and recent results of operations.\nTax benefits associated with uncertain tax positions are recognized only if it is more likely than not that the tax position would be sustained on its technical merits. For positions not meeting the “more likely than not” test, no tax benefit is recognized. To the extent interest and penalties may be assessed related to unrecognized tax benefits, we record accruals for such amounts as a component of the income tax provision.\n We had \nno\n unrecognized income tax benefits as of December 31, 2024 and 2023. \n44\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (Continued)\nValuation of Share-Based Compensation \nOur share-based compensation plans and programs are administered by our Board of Directors or its Compensation and Personnel Committee. See Note 13 - Share-Based Compensation Plans of the notes to consolidated financial statements for additional information regarding these share-based compensation plans and programs. \nWe recognize expense for all share-based payments issued to acquire goods or services based on the fair value of such payments. Compensation expense related to share-based awards is generally recognized on a straight-line basis over the requisite service period, which is the vesting period. The benefits of tax deductions in excess of recognized compensation expense are recognized in the Consolidated Statements of Operations when the underlying awards vest or are settled.\nNew Accounting Pronouncements \nIn November 2023, the Financial Accounting Standards Board (the “FASB”) issued an Accounting Standards Update (“ASU”), which expands the required disclosure for reportable segments. This guidance requires entities to disclose significant segment expenses and other segment items on an annual and interim basis and to provide in interim periods all segment disclosures which are currently required annually. This ASU additionally requires entities to disclose the title and position of the individual or the name of the group or committee identified as its chief operating decision-maker. Such guidance, which is required to be applied retrospectively, is effective for fiscal years beginning after December 15, 2023, and interim periods within fiscal years beginning after December 15, 2024. While the adoption of this ASU did not have an impact on our financial position and/or results of operations, we have provided the additional required disclosures within Note 18 - Segment Information of the notes to consolidated financial statements.\nIn December 2023, the FASB issued an ASU intended to enhance the transparency and decision-usefulness of income tax disclosures. Such guidance requires entities to provide additional information within their income tax rate reconciliation, including further disclosure of federal, state, and foreign income taxes and to provide more details about these reconciling items if a quantitative threshold is met. This guidance additionally requires expanded disclosure of income taxes paid, including amounts paid for federal, state, and foreign taxes. This ASU, which is required to be applied prospectively, is effective for fiscal years beginning after December 15, 2024, although early adoption and retrospective application is permitted. While the adoption of this ASU will not have an impact on our financial position and/or results of operations, we are currently evaluating the impact on our income tax disclosures, including the processes and controls around the collection of this information.\nIn November 2024, the FASB issued an ASU, which requires disaggregated disclosures, in the notes to the financial statements, about certain income statement expense line items on an interim and annual basis. This guidance requires entities to provide more detailed information about purchases of inventory, employee compensation, depreciation expense, intangible asset amortization, and selling expenses. Such guidance, which is required to be applied prospectively, is effective for fiscal years beginning after December 15, 2026, and interim periods within fiscal years beginning after December 15, 2027, although early adoption and retrospective application is permitted. While the adoption of this ASU will not have an impact on our financial position and/or results of operations, we are currently evaluating the impact on our financial statement disclosures, including the processes and controls around the collection of this information.\nNOTE 3 - \nREVENUE FROM CONTRACTS WITH CUSTOMERS\nThe Company recognizes revenue when it transfers promised goods or services to customers in an amount that reflects the consideration to which we expect to be entitled in exchange for those goods or services by applying the following five step model:\n(1)  Identify the contract with a customer\nA contract with a customer exists when: (a) the parties have approved the contract and are committed to perform their respective obligations, (b) the rights of the parties can be identified, (c) payment terms can be identified, (d) the arrangement has commercial substance, and (e) collectability of consideration is probable. Judgment is required when determining if the contractual criteria are met, specifically in the earlier stages of a project when a formally executed contract may not yet exist. In these situations, the Company evaluates all relevant facts and circumstances, including the existence of other forms of documentation or historical experience with our customers that may indicate a contractual agreement is in place and revenue should be recognized. In determining if the collectability of consideration is probable, the Company considers the customer’s ability and intention to pay such consideration through an evaluation of several factors, including an assessment of the creditworthiness of the customer and our prior collection history with such customer.\n45\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 3 - REVENUE FROM CONTRACTS WITH CUSTOMERS (Continued)\n(2)  Identify the performance obligations in the contract\nAt contract inception, the Company assesses the goods or services promised in a contract and identifies, as a separate performance obligation, each distinct promise to transfer goods or services to the customer. The identified performance obligations represent the “unit of account” for purposes of determining revenue recognition. In order to properly identify separate performance obligations, the Company applies judgment in determining whether each good or service provided is: (a) capable of being distinct, whereby the customer can benefit from the good or service either on its own or together with other resources that are readily available to the customer, and (b) distinct within the context of the contract, whereby the transfer of the good or service to the customer is separately identifiable from other promises in the contract.\nIn addition, when assessing performance obligations within a contract, the Company considers the warranty provisions included within such contract. To the extent the warranty terms provide the customer with an additional service, other than assurance that the promised good or service complies with agreed upon specifications, such warranty is accounted for as a separate performance obligation. In determining whether a warranty provides an additional service, the Company considers each warranty provision in comparison to warranty terms which are standard in the industry. \nOur contracts are often modified through change orders to account for changes in the scope and price of the goods or services we are providing. Although the Company evaluates each change order to determine whether such modification creates a separate performance obligation, the majority of our change orders are for goods or services that are not distinct within the context of our original contract and, therefore, are not treated as separate performance obligations.\n(3)  Determine the transaction price\nThe transaction price represents the amount of consideration to which the Company expects to be entitled in exchange for transferring promised goods or services to our customers. The consideration promised within a contract may include fixed amounts, variable amounts, or both. To the extent the performance obligation includes variable consideration, including contract bonuses and penalties that can either increase or decrease the transaction price, the Company estimates the amount of variable consideration to be included in the transaction price utilizing one of two prescribed methods, depending on which method better predicts the amount of consideration to which the entity will be entitled. Such methods include: (a) the expected value method, whereby the amount of variable consideration to be recognized represents the sum of probability-weighted amounts in a range of possible consideration amounts, and (b) the most likely amount method, whereby the amount of variable consideration to be recognized represents the single most likely amount in a range of possible consideration amounts. When applying these methods, the Company considers all information that is reasonably available, including historical, current, and estimates of future performance. The expected value method is typically utilized in situations where a contract contains a large number of possible outcomes while the most likely amount method is typically utilized in situations where a contract has only two possible outcomes.\nVariable consideration is included in the transaction price only to the extent it is probable, in the Company’s judgment, that a significant future reversal in the amount of cumulative revenue recognized under the contract will not occur when the uncertainty associated with the variable consideration is subsequently resolved. This threshold is referred to as the variable consideration constraint. In assessing whether to apply the variable consideration constraint, the Company considers if factors exist that could increase the likelihood or the magnitude of a potential reversal of revenue, including, but not limited to, whether: (a) the amount of consideration is highly susceptible to factors outside of the Company’s influence, such as the actions of third parties, (b) the uncertainty surrounding the amount of consideration is not expected to be resolved for a long period of time, (c) the Company’s experience with similar types of contracts is limited or that experience has limited predictive value, (d) the Company has a practice of either offering a broad range of price concessions or changing the payment terms and conditions of similar contracts in similar circumstances, and (e) the contract has a large number and broad range of possible consideration amounts.\nPending change orders represent one of the most common forms of variable consideration included within contract value and typically represent contract modifications for which a change in scope has been authorized or acknowledged by our customer but the final adjustment to contract price is yet to be negotiated. In estimating the transaction price for pending change orders, the Company considers all relevant facts, including documented correspondence with the customer regarding acknowledgment of and/or agreement with the modification, as well as historical experience with the customer or similar contractual circumstances. Based upon this assessment, the Company estimates the transaction price, including whether the variable consideration constraint should be applied.\n46\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 3 - REVENUE FROM CONTRACTS WITH CUSTOMERS (Continued)\nContract claims are another form of variable consideration which is common within our industry. Claim amounts represent revenue that has been recognized for contract modifications that are not submitted or are in dispute as to both scope and price. In estimating the transaction price for claims, the Company considers all relevant facts available. However, given the uncertainty surrounding claims, including the potential long-term nature of dispute resolution and the broad range of possible consideration amounts, there is an increased likelihood that any additional contract revenue associated with contract claims is constrained. The resolution of claims involves negotiations and, in certain cases, litigation. In the event litigation costs are incurred by us in connection with claims, such litigation costs are expensed as incurred, although we may seek to recover these costs.\nFor some transactions, the receipt of consideration does not match the timing of the transfer of goods or services to the customer. For such contracts, the Company evaluates whether this timing difference represents a financing arrangement within the contract. Although rare, if a contract is determined to contain a significant financing component, the Company adjusts the promised amount of consideration for the effects of the time value of money when determining the transaction price of such contract. Although our customers may retain a portion of the contract price until completion of the project and final contract settlement, these retainage amounts are not considered a significant financing component as the intent of the withheld amounts is to provide the customer with assurance that we will complete our obligations under the contract rather than to provide financing to the customer. In addition, although we may be entitled to advanced payments from our customers on certain contracts, these advanced payments generally do not represent a significant financing component as the payments are used to meet working capital demands that can be higher in the early stages of a contract, as well as to protect us from our customer failing to meet its obligations under the contract.\nChanges in the estimates of transaction prices are recognized on a cumulative catch-up basis in the period in which the revisions to the estimates are made. Such changes in estimates can result in the recognition of revenue in a current period for performance obligations which were satisfied or partially satisfied in prior periods. Such changes in estimates may also result in the reversal of previously recognized revenue if the ultimate outcome differs from the Company’s previous estimate.\n(4)  Allocate the transaction price to the performance obligations in the contract\nFor contracts that contain multiple performance obligations, the Company allocates the transaction price to each performance obligation based on a relative standalone selling price. The Company determines the standalone selling price based on the price at which the performance obligation would have been sold separately in similar circumstances to similar customers. If the standalone selling price is not observable, the Company estimates the standalone selling price taking into account all available information such as market conditions and internal pricing guidelines. In certain circumstances, the standalone selling price is determined using an expected profit margin on anticipated costs related to the performance obligation.\n(5)  Recognize revenue as performance obligations are satisfied\nThe Company recognizes revenue at the time the related performance obligation is satisfied by transferring a promised good or service to its customers. A good or service is considered to be transferred when the customer obtains control. The Company can transfer control of a good or service and satisfy its performance obligations either over time or at a point in time. The Company transfers control of a good or service over time and, therefore, satisfies a performance obligation and recognizes revenue over time if one of the following three criteria are met: (a) the customer simultaneously receives and consumes the benefits provided by the Company’s performance as we perform, (b) the Company’s performance creates or enhances an asset that the customer controls as the asset is created or enhanced, or (c) the Company’s performance does not create an asset with an alternative use to us, and we have an enforceable right to payment for performance completed to date.\nFor our performance obligations satisfied over time, we recognize revenue by measuring the progress toward complete satisfaction of that performance obligation. The selection of the method to measure progress towards completion can be either an input method or an output method and requires judgment based on the nature of the goods or services to be provided.\nFor our construction contracts, revenue is generally recognized over time as our performance creates or enhances an asset that the customer controls as it is created or enhanced. Our fixed price construction projects generally use a cost-to-cost input method to measure our progress towards complete satisfaction of the performance obligation as we believe it best depicts the transfer of control to the customer which occurs as we incur costs on our contracts. Under the cost-to-cost measure of progress, the extent of progress towards completion is measured based on the ratio of costs incurred to date to the total estimated costs at completion of the performance obligation. \n47\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 3 - REVENUE FROM CONTRACTS WITH CUSTOMERS (Continued)\nFor our unit price construction contracts, progress towards complete satisfaction is measured through an output method, such as the number of units produced or delivered, when our performance does not produce significant amounts of work in process or finished goods prior to complete satisfaction of such performance obligations. \nFor our services contracts, revenue is also generally recognized over time as the customer simultaneously receives and consumes the benefits of our performance as we perform the service. For our fixed price service contracts with specified service periods, revenue is generally recognized on a straight-line basis over such service period when our inputs are expended evenly and the customer receives and consumes the benefits of our performance throughout the contract term.  \nThe timing of revenue recognition for the manufacturing of new build heat exchangers within our United States industrial services segment depends on the payment terms of the contract, as our performance does not create an asset with an alternative use to us. For those contracts for which we have a right to payment for performance completed to date at all times throughout our performance, inclusive of a cancellation, we recognize revenue over time. For these performance obligations, we use a cost-to-cost input method to measure our progress towards complete satisfaction of the performance obligation as we believe it best depicts the transfer of control to the customer which occurs as we incur costs on our contracts. However, for those contracts for which we do not have a right, at all times, to payment for performance completed to date, we recognize revenue at the point in time when control is transferred to the customer. For bill-and-hold arrangements, revenue is recognized when the customer obtains control of the heat exchanger, which may be prior to shipping if certain recognition criteria are met. \nFor certain of our revenue streams, such as call-out repair and service work, outage services, refinery turnarounds, and specialty welding services that are performed under time and materials contracts, our progress towards complete satisfaction of such performance obligations is measured using an output method as the customer receives and consumes the benefits of our performance completed to date.\nChanges in Estimates\nDue to uncertainties inherent in the estimation process, as well as the significant judgment involved in determining variable consideration, it is possible that estimates of costs to complete a performance obligation, and/or our estimates of transaction prices, will be revised in the near term. For those performance obligations for which revenue is recognized using a cost-to-cost input method, changes in total estimated costs, and related progress towards complete satisfaction of the performance obligation, or changes in the estimate of transaction prices, are recognized on a cumulative catch-up basis in the period in which the revisions to the estimates are made. When the current estimate of total costs for a performance obligation indicates a loss, a provision for the entire estimated loss on the unsatisfied performance obligation is made in the period in which the loss becomes evident.\n \nBased on an evaluation of individual projects that were substantially complete in prior periods but had revisions to total estimated costs or anticipated contract value (inclusive of the settlement of previously outstanding change orders and claims) that resulted in an increase to profitability in excess of $\n1.0\n million, we recognized revenue during the years ended December 31, 2024 and 2023, as summarized in the following table (in thousands):\n \n2024\n2023\nUnited States electrical construction and facilities services\n$\n14,006\n \n$\n3,350\n \nUnited States mechanical construction and facilities services\n10,551\n \n13,114\n \nTotal impact\n$\n24,557\n \n$\n16,464\n \nThere were \nno\n significant amounts of revenue recognized during the year ended December 31, 2022 related to performance obligations satisfied in prior periods.\nIncluded in our results for the year ended December 31, 2024 was $\n12.3\n million of gross profit, recognized in the second quarter of the year, on two contracts, which are currently in process, as a result of favorable developments on certain claims. Of this amount, $\n8.4\n million was reported within our United States electrical construction and facilities services segment and $\n3.9\n million was reported within our United States mechanical construction and facilities services segment.\n48\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 3 - REVENUE FROM CONTRACTS WITH CUSTOMERS (Continued)\nBased on an evaluation of individual projects that had revisions to total estimated costs or anticipated contract value that resulted in a reduction of profitability in excess of $\n1.0\n million, our operating results were negatively impacted during the years ended December 31, 2024, 2023, and 2022, as summarized in the following table (in thousands): \n \n2024\n2023\n2022\nUnited States electrical construction and facilities services\n$\n27,977\n \n$\n12,535\n \n$\n33,463\n \nUnited States mechanical construction and facilities services\n38,342\n \n10,864\n \n13,679\n \nUnited States building services\n—\n \n5,658\n \n1,261\n \nTotal impact\n$\n66,319\n \n$\n29,057\n \n$\n48,403\n \nDisaggregation of Revenues\nOur revenues are principally derived from contracts to provide construction services relating to electrical and mechanical systems, as well as to provide a number of building services and industrial services to our customers. Our contracts are with many different customers in numerous industries.\nThe following tables provide further disaggregation of our revenues by categories we use to evaluate our financial performance within each of our reportable segments (in thousands, except for percentages). \nRefer to Note 18 - Segment Information of the notes to consolidated financial statements for additional information on how we disaggregate our revenues by reportable segment.\n2024\n% of\nTotal\n2023\n% of\nTotal\n2022\n% of\nTotal\nUnited States electrical construction and facilities services:\nNetwork and communications market sector\n$\n1,442,877\n \n43\n \n%\n$\n934,455\n \n34\n \n%\n$\n801,052\n \n33\n \n%\nCommercial market sector\n310,730\n \n9\n \n%\n402,886\n \n14\n \n%\n414,539\n \n17\n \n%\nManufacturing and industrial market sector\n439,450\n \n13\n \n%\n394,804\n \n14\n \n%\n301,606\n \n12\n \n%\nHealthcare market sector\n242,458\n \n7\n \n%\n242,931\n \n9\n \n%\n178,348\n \n7\n \n%\nHigh-tech manufacturing market sector\n190,992\n \n6\n \n%\n140,471\n \n5\n \n%\n88,544\n \n4\n \n%\nInstitutional market sector\n174,073\n \n5\n \n%\n147,375\n \n5\n \n%\n154,077\n \n6\n \n%\nTransportation market sector\n210,835\n \n6\n \n%\n167,976\n \n6\n \n%\n166,563\n \n7\n \n%\nWater and wastewater market sector\n27,751\n \n1\n \n%\n21,234\n \n1\n \n%\n21,251\n \n1\n \n%\nHospitality and entertainment market sector\n66,982\n \n2\n \n%\n81,815\n \n3\n \n%\n33,818\n \n1\n \n%\nShort duration projects \n(1)\n180,020\n \n6\n \n%\n186,722\n \n7\n \n%\n211,797\n \n9\n \n%\nService work\n62,947\n \n2\n \n%\n65,338\n \n2\n \n%\n65,709\n \n3\n \n%\n3,349,115\n \n2,786,007\n \n2,437,304\n \nLess intersegment revenues\n(\n6,188\n)\n(\n2,284\n)\n(\n4,190\n)\nTotal segment revenues\n$\n3,342,927\n \n$\n2,783,723\n \n$\n2,433,114\n \n_________________\n(1)\nRepresents those projects which generally are completed within three months or less.\n49\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 3 - REVENUE FROM CONTRACTS WITH CUSTOMERS (Continued)\n2024\n% of\nTotal\n2023\n% of\nTotal\n2022\n% of\nTotal\nUnited States mechanical construction and facilities services:\nNetwork and communications market sector\n$\n818,991\n \n13\n \n%\n$\n410,397\n \n8\n \n%\n$\n295,261\n \n7\n \n%\nCommercial market sector\n989,012\n \n15\n \n%\n1,115,993\n \n22\n \n%\n1,079,872\n \n25\n \n%\nManufacturing and industrial market sector\n736,775\n \n12\n \n%\n698,993\n \n14\n \n%\n632,332\n \n15\n \n%\nHealthcare market sector\n580,676\n \n9\n \n%\n489,485\n \n10\n \n%\n479,937\n \n11\n \n%\nHigh-tech manufacturing market sector\n1,453,384\n \n23\n \n%\n845,251\n \n16\n \n%\n320,597\n \n7\n \n%\nInstitutional market sector\n455,940\n \n7\n \n%\n316,255\n \n6\n \n%\n331,727\n \n8\n \n%\nTransportation market sector\n55,622\n \n1\n \n%\n42,789\n \n1\n \n%\n57,026\n \n1\n \n%\nWater and wastewater market sector\n308,329\n \n5\n \n%\n286,912\n \n6\n \n%\n261,501\n \n6\n \n%\nHospitality and entertainment market sector\n70,707\n \n1\n \n%\n52,919\n \n1\n \n%\n44,615\n \n1\n \n%\nShort duration projects \n(1)\n335,900\n \n5\n \n%\n324,056\n \n6\n \n%\n333,066\n \n8\n \n%\nService work\n606,551\n \n9\n \n%\n500,853\n \n10\n \n%\n467,156\n \n11\n \n%\n6,411,887\n \n5,083,903\n \n4,303,090\n \nLess intersegment revenues\n(\n6,230\n)\n(\n9,100\n)\n(\n10,882\n)\nTotal segment revenues\n$\n6,405,657\n \n$\n5,074,803\n \n$\n4,292,208\n \n_________________\n(1)\nRepresents those projects which generally are completed within three months or less.\n2024\n% of\nTotal\n2023\n% of\nTotal\n2022\n% of\nTotal\nUnited States building services:\nMechanical services\n$\n2,260,607\n \n73\n \n%\n$\n2,042,244\n \n65\n \n%\n$\n1,748,455\n \n64\n \n%\nCommercial site-based services\n669,584\n \n21\n \n%\n865,232\n \n28\n \n%\n810,210\n \n29\n \n%\nGovernment site-based services\n184,626\n \n6\n \n%\n212,658\n \n7\n \n%\n196,288\n \n7\n \n%\nTotal segment revenues\n$\n3,114,817\n \n$\n3,120,134\n \n$\n2,754,953\n \n2024\n% of\nTotal\n2023\n% of\nTotal\n2022\n% of\nTotal\nUnited States industrial services:\nField services\n$\n1,113,613\n \n87\n \n%\n$\n991,466\n \n85\n \n%\n$\n972,894\n \n87\n \n%\nShop services\n163,577\n \n13\n \n%\n176,324\n \n15\n \n%\n145,873\n \n13\n \n%\nTotal segment revenues\n$\n1,277,190\n \n$\n1,167,790\n \n$\n1,118,767\n \nTotal United States operations\n$\n14,140,591\n \n$\n12,146,450\n \n$\n10,599,042\n \n2024\n% of\nTotal\n2023\n% of\nTotal\n2022\n% of\nTotal\nUnited Kingdom building services:\nService work\n$\n199,658\n \n47\n \n%\n$\n210,414\n \n48\n \n%\n$\n221,123\n \n46\n \n%\nProject work\n225,867\n \n53\n \n%\n226,009\n \n52\n \n%\n255,955\n \n54\n \n%\nTotal segment revenues\n$\n425,525\n \n$\n436,423\n \n$\n477,078\n \nConsolidated revenues\n$\n14,566,116\n \n$\n12,582,873\n \n$\n11,076,120\n \n50\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 3 - REVENUE FROM CONTRACTS WITH CUSTOMERS (Continued)\nContract Assets and Contract Liabilities \nThe timing of revenue recognition may differ from the timing of invoicing to customers. Contract assets include unbilled amounts from our construction projects when revenues recognized under the cost-to-cost measure of progress exceed the amounts invoiced to our customers, as the amounts are not yet billable under the terms of our contracts. Such amounts are recoverable from our customers based upon various measures of performance, including achievement of certain milestones, completion of specified units, or completion of a contract. In addition, many of our time and materials arrangements, as well as our contracts to perform turnaround services within the United States industrial services segment, are billed in arrears pursuant to contract terms that are standard within the industry, resulting in contract assets and/or unbilled receivables being recorded as revenue is recognized in advance of billings. \nAlso included in contract assets are amounts we seek or will seek to collect from customers or others for errors or changes in contract specifications or design, contract change orders or modifications in dispute or unapproved as to scope and/or price, or other customer-related causes of unanticipated additional contract costs (claims and unapproved change orders). Our contract assets do not include capitalized costs to obtain and fulfill a contract. Contract assets are generally classified as current within the Consolidated Balance Sheets.\nAs of December 31, 2024 and 2023, contract assets included unbilled revenues for unapproved change orders of approximately $\n25.1\n million and $\n29.8\n million, respectively. There were \nno\n claim amounts included in contract assets as of December 31, 2024; however, contract assets as of December 31, 2023 included $\n6.7\n million associated with claims. There were $\n6.9\n million and $\n15.4\n million of claims included within accounts receivable as of December 31, 2024 and 2023, respectively. There were contractually billed amounts and retention related to contracts with unapproved change orders and claims of approximately $\n172.4\n million and $\n157.7\n million as of December 31, 2024 and 2023, respectively. For contracts in claim status, contractually billed amounts will generally not be paid by the customer to us until final resolution of the related claims.\nContract liabilities from our construction contracts arise when amounts invoiced to our customers exceed revenues recognized under the cost-to-cost measure of progress. Contract liabilities additionally include advanced payments from our customers on certain contracts. Contract liabilities decrease as we recognize revenue from the satisfaction of the related performance obligation and are recorded as either current or long-term, depending upon when we expect to recognize such revenue. The long-term portion of contract liabilities is included in “Other long-term obligations” in the Consolidated Balance Sheets. \nNet contract liabilities in the accompanying Consolidated Balance Sheets consisted of the following amounts as of December 31, 2024 and 2023 (in thousands):\nDecember 31, 2024\nDecember 31, 2023\nContract assets, current\n$\n284,791\n \n$\n269,885\n \nContract assets, non-current\n—\n \n—\n \nContract liabilities, current\n(\n2,047,540\n)\n(\n1,595,109\n)\nContract liabilities, non-current\n(\n1,526\n)\n(\n1,812\n)\nNet contract liabilities\n$\n(\n1,764,275\n)\n$\n(\n1,327,036\n)\nIncluded within net contract liabilities were $\n1,691.0\n million and $\n1,261.1\n million of net contract liabilities on uncompleted construction projects as of December 31, 2024 and 2023, respectively, as follows (in thousands):\n \nDecember 31, 2024\nDecember 31, 2023\nCosts incurred on uncompleted construction contracts\n$\n18,093,285\n \n$\n15,100,829\n \nEstimated earnings, thereon\n3,562,012\n \n2,381,049\n \n \n21,655,297\n \n17,481,878\n \nLess: billings to date\n23,346,291\n \n18,742,934\n \n \n$\n(\n1,690,994\n)\n$\n(\n1,261,056\n)\n51\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 3 - REVENUE FROM CONTRACTS WITH CUSTOMERS (Continued)\nContract assets and contract liabilities increased by approximately $\n2.3\n million and $\n24.3\n million, respectively, as a result of acquisitions made by us in 2024. Excluding the impact of acquisitions, net contract liabilities increased by approximately $\n415.2\n million for the year ended December 31, 2024, primarily due to an increase in net contract liabilities on our uncompleted construction projects, partially as a result of the timing of invoicing to our customers as we continue to effectively manage our working capital. There was \nno\n significant impairment of contract assets recognized during the periods presented.\nContract Retentions\nAs of December 31, 2024 and 2023, accounts receivable included $\n703.2\n million and $\n555.9\n million, respectively, of retainage billed under terms of our contracts. These retainage amounts represent amounts which have been contractually invoiced to customers where payments have been partially withheld pending the completion of the project. We estimate that approximately \n86\n% of the retainage outstanding as of December 31, 2024 will be collected during 2025.\nAs of December 31, 2024 and 2023, accounts payable included $\n121.5\n million and $\n93.6\n million, respectively, of retainage withheld under terms of our subcontracts. These retainage amounts represent amounts invoiced to the Company by our subcontractors where payments have been partially withheld pending the completion of their scope of work. We estimate that approximately \n89\n% of the retainage outstanding as of December 31, 2024 will be paid during 2025.\nTransaction Price Allocated to Remaining Unsatisfied Performance Obligations \n    \nThe following table presents the transaction price allocated to remaining unsatisfied performance obligations (“remaining performance obligations”) for each of our reportable segments and their respective percentages of total remaining performance obligations as of December 31, 2024 (in thousands, except for percentages):\nDecember 31, 2024\n% of Total\nRemaining performance obligations:\nUnited States electrical construction and facilities services\n$\n3,068,396\n \n31\n \n%\nUnited States mechanical construction and facilities services\n5,463,096\n \n54\n \n%\nUnited States building services\n1,246,642\n \n12\n \n%\nUnited States industrial services\n138,599\n \n1\n \n%\nTotal United States operations\n9,916,733\n \n98\n \n%\nUnited Kingdom building services\n185,466\n \n2\n \n%\nTotal operations\n$\n10,102,199\n \n100\n \n%\nOur remaining performance obligations at December 31, 2024 were approximately $\n10.10\n billion. Remaining performance obligations increase with awards of new contracts and decrease as we perform work and recognize revenue on existing contracts. We include a project within our remaining performance obligations at such time the project is awarded and agreement on contract terms has been reached. Our remaining performance obligations include amounts related to contracts for which a fixed price contract value is not assigned when a reasonable estimate of the total transaction price can be made.\nRemaining performance obligations include unrecognized revenues to be realized from uncompleted construction contracts. Although many of our construction contracts are subject to cancellation at the election of our customers, in accordance with industry practice, we do not limit the amount of unrecognized revenue included within remaining performance obligations for these contracts as the risk of cancellation is very low due to the inherent substantial economic penalty that our customers would incur upon cancellation or termination. We believe our reported remaining performance obligations for our construction contracts are firm and contract cancellations have not had a material adverse effect on us.\nRemaining performance obligations also include unrecognized revenues expected to be realized over the remaining term of service contracts. However, to the extent a service contract includes a cancellation clause which allows for the termination of such contract by either party without a substantive penalty, the remaining contract term, and therefore, the amount of unrecognized revenues included within remaining performance obligations, is limited to the notice period required for the termination. \n52\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 3 - REVENUE FROM CONTRACTS WITH CUSTOMERS (Continued)\nOur remaining performance obligations are comprised of: (a) original contract amounts, (b) change orders for which we have received written confirmations from our customers, (c) pending change orders for which we expect to receive confirmations in the ordinary course of business, (d) claim amounts that we have made against customers for which we have determined we have a legal basis under existing contractual arrangements and as to which the variable consideration constraint does not apply, and (e) other forms of variable consideration to the extent that such variable consideration has been included within the transaction price of our contracts. Such claim and other variable consideration amounts were immaterial for all periods presented.  \nRefer to the table below for additional information regarding our remaining performance obligations, including an estimate of when we expect to recognize such remaining performance obligations as revenue (in thousands): \nWithin\none year\nGreater than one year\nRemaining performance obligations:\n        United States electrical construction and facilities services\n$\n2,507,400\n \n$\n560,996\n \n        United States mechanical construction and facilities services\n4,214,636\n \n1,248,460\n \n        United States building services\n1,155,351\n \n91,291\n \n        United States industrial services\n138,599\n \n—\n \n        Total United States operations\n8,015,986\n \n1,900,747\n \n        United Kingdom building services\n137,415\n \n48,051\n \n        Total operations\n$\n8,153,401\n \n$\n1,948,798\n \nNOTE 4 - \nACQUISITIONS OF BUSINESSES\nAcquisitions are accounted for utilizing the acquisition method of accounting and the prices paid for them are allocated to their respective assets and liabilities based upon the estimated fair value of such assets and liabilities at the dates of their respective acquisition by us.\nDuring 2024, we acquired \nseven\n companies for upfront consideration of $\n231.1\n million, inclusive of customary working capital adjustments. These acquisitions are comprised of: (a) an electrical contractor in the Southeast region of the United States, that has been included in our United States electrical construction and facilities services segment, (b) two companies that have been included within our United States mechanical construction and facilities services segment, including: (i) a leading plumbing services provider in the Southeast region of the United States and (ii) a full service provider of mechanical construction and maintenance services in Central Texas, (c) three companies that have been included in our United States building services segment, including: (i) a provider of building automation and controls solutions in the Northeast region of the United States, (ii) a mechanical services company in the Western region of the United States, and (iii) a mechanical services company in the Eastern region of the United States, and (d) an instrumentation and electrical contractor, that has been included in our United States industrial services segment, which provides electrical, automation, digital integration, and fabrication services to various energy sector and process equipment customers. In connection with these acquisitions, we acquired working capital of $\n29.0\n million and other net assets of $\n1.1\n million, and have preliminarily ascribed $\n61.9\n million to goodwill and $\n139.1\n million to identifiable intangible assets. We expect that all of the goodwill and identifiable intangible assets acquired in connection with these 2024 acquisitions will be deductible for tax purposes. \nDuring 2023, we acquired \neight\n companies for total consideration of $\n99.6\n million. Such acquisitions include: (a) a national energy efficiency specialty services firm, the results of operations of which have been included in our United States building services segment, and (b) seven companies, the results of operations of which were de minimis, consisting of: (i) three companies that have been included within our United States mechanical construction and facilities services segment, one of which provides mechanical and pipe fabrication services in the Midwestern region of the United States, and two of which add capabilities to our national fire protection services, and (ii) four mechanical services companies in the Western and Midwestern regions of the United States that have been included within our United States building services segment and enhance our presence in geographies where we have existing operations. In connection with these acquisitions, we acquired working capital of $\n9.1\n million and other net liabilities of $\n6.1\n million, including certain deferred tax liabilities, and have ascribed $\n37.4\n million to goodwill and $\n59.2\n million to identifiable intangible assets. We expect that $\n29.6\n million of the goodwill and identifiable intangible assets acquired in connection with these 2023 acquisitions will be deductible for tax purposes.\n53\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 4 - ACQUISITIONS OF BUSINESSES (Continued)\nDuring 2022, we acquired \nsix\n companies for total consideration of $\n100.8\n million. Such acquisitions include: (a) a company that provides electrical construction services in the Greater Boston area, the results of operations of which have been included in our United States electrical construction and facilities services segment, and (b) five companies that enhance our presence in geographies where we have existing operations, the results of operations of which were de minimis, consisting of: (i) two companies that provide fire protection services in the Northeastern and Southern regions of the United States, respectively, and that have been included within our United States mechanical construction and facilities services segment, (ii) two companies that specialize in either building automation and controls or mechanical services in the Southwestern and Southern regions of the United States, respectively, and that have been included within our United States building services segment, and (iii) a company that provides electrical construction services in the Midwestern region of the United States and that has been included within our United States electrical construction and facilities services segment. In connection with these acquisitions, we acquired working capital of $\n7.1\n million and other net liabilities of $\n1.1\n million, and have ascribed $\n28.9\n million to goodwill and $\n65.9\n million to identifiable intangible assets. We expect that all of the goodwill and identifiable intangible assets acquired in connection with these 2022 acquisitions will be deductible for tax purposes. \nThe purchase price allocations for the businesses acquired in 2024 are preliminary and subject to change during their respective measurement periods. As we finalize such purchase price allocations, adjustments may be recorded relating to finalization of intangible asset valuations, tax matters, or other items. Although not expected to be significant, such adjustments may result in changes in the valuation of assets and liabilities acquired. The purchase price allocations for the businesses acquired in 2023 and 2022 have been finalized during their respective measurement periods with an insignificant impact.\nNOTE 5 - \nEARNINGS PER SHARE\nThe following table summarizes our calculation of Basic and Diluted Earnings per Common Share (“EPS”) for the years ended December 31, 2024, 2023, and 2022 (in thousands, except share and per share data):\n \n2024\n2023\n2022\nNumerator:\nNet income attributable to EMCOR Group, Inc.\n$\n1,007,145\n \n$\n632,994\n \n$\n406,122\n \nDenominator:\nWeighted average shares outstanding used to compute basic earnings \nper common share\n46,616,079\n \n47,358,467\n \n49,931,940\n \nEffect of dilutive securities—Share-based awards\n192,214\n \n205,791\n \n204,322\n \nShares used to compute diluted earnings per common share\n46,808,293\n \n47,564,258\n \n50,136,262\n \nBasic earnings per common share\n$\n21.61\n \n$\n13.37\n \n$\n8.13\n \nDiluted earnings per common share\n$\n21.52\n \n$\n13.31\n \n$\n8.10\n \nThe number of outstanding share-based awards excluded from the computation of diluted EPS for the years ended December 31, 2024, 2023, and 2022 because they would be anti-dilutive were \n14,393\n, \n8,700\n, and \n4,926\n, respectively.\nNOTE 6 - \nINVENTORIES\nInventories in the accompanying Consolidated Balance Sheets consisted of the following amounts as of December 31, 2024 and 2023 (in thousands):\nDecember 31, 2024\nDecember 31, 2023\nRaw materials and construction materials\n$\n83,935\n \n$\n94,447\n \nWork in process\n11,732\n \n16,327\n \nInventories\n$\n95,667\n \n$\n110,774\n \n54\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 7 - \nPROPERTY, PLANT, AND EQUIPMENT \nProperty, plant, and equipment in the accompanying Consolidated Balance Sheets consisted of the following amounts as of December 31, 2024 and 2023 (in thousands): \n \nDecember 31, 2024\nDecember 31, 2023\nMachinery and equipment\n$\n243,354\n \n$\n224,456\n \nVehicles\n83,422\n \n76,489\n \nFurniture and fixtures\n29,150\n \n27,415\n \nComputer hardware/software\n107,376\n \n102,682\n \nLand, buildings, and leasehold improvements\n162,336\n \n142,114\n \nConstruction in progress\n13,059\n \n13,514\n \nFinance lease right-of-use assets \n(1)\n6,009\n \n4,932\n \n \n644,706\n \n591,602\n \nAccumulated depreciation and amortization\n(\n437,217\n)\n(\n412,224\n)\n \n$\n207,489\n \n$\n179,378\n \n____________________________________________  \n(1)\nFinance lease right-of-use assets are recorded net of accumulated amortization.\nDepreciation and amortization expense related to property, plant, and equipment, including finance leases, was $\n56.7\n million, $\n51.8\n million, and $\n47.3\n million for the years ended December 31, 2024, 2023, and 2022, respectively.\n \nNOTE 8 - \nGOODWILL, IDENTIFIABLE INTANGIBLE ASSETS, AND OTHER LONG-LIVED ASSETS    \nGoodwill \nIn connection with our acquisition of businesses, we have recorded goodwill, which represents the excess of the consideration transferred over the fair value of the net tangible and identifiable intangible assets acquired. Our goodwill balance at December 31, 2024 and 2023 was $\n1,018.4\n million and $\n956.5\n million, respectively, with goodwill attributable to companies acquired in 2024 and 2023 valued at $\n61.9\n million and $\n37.4\n million, respectively. Goodwill is not amortized but instead allocated to its respective reporting unit and evaluated for impairment annually, or more frequently if events or circumstances indicate that the carrying amount of goodwill may be impaired. We have determined that our reporting units are consistent with the reportable segments identified in Note 18 - Segment Information of the notes to consolidated financial statements. As of December 31, 2024, approximately \n18.8\n% of our goodwill related to our United States electrical construction and facilities services segment, approximately \n33.8\n% of our goodwill related to our United States mechanical construction and facilities services segment, approximately \n35.2\n% of our goodwill related to our United States building services segment and approximately \n12.2\n% of our goodwill related to our United States industrial services segment. \nAbsent any earlier identified impairment indicators, we perform our annual goodwill impairment assessment on October 1 each fiscal year. Qualitative indicators that may trigger the need for interim quantitative impairment testing include, among others, deterioration in macroeconomic conditions, declining financial performance, deterioration in the operational environment, or an expectation of selling or disposing of a portion of a reporting unit. Additionally, an interim impairment test may be triggered by a significant change in business climate, a loss of a significant customer, increased competition, or a sustained decrease in share price. In assessing whether our goodwill is impaired, we compare the fair value of the reporting unit to its carrying amount, including goodwill. If the fair value exceeds the carrying amount, no impairment is recognized. However, if the carrying amount of the reporting unit exceeds the fair value, the goodwill of the reporting unit is impaired and an impairment loss in the amount of the excess is recognized and charged to operations.\nWe performed our annual impairment assessment of all reporting units as of October 1, 2024 and determined there was \nno\n impairment of goodwill. In completing our annual impairment assessment, we determined the fair value of each of our reporting units using an income approach whereby fair value was calculated utilizing discounted estimated future cash flows, assuming a risk-adjusted industry weighted average cost of capital. The weighted average cost of capital used in our annual impairment testing was \n10.6\n% for our United States construction segments, \n10.9\n% for our United States building services segment, and \n10.5\n% for our United States industrial services segment. These weighted average cost of capital estimates were developed with the assistance of an independent third-party valuation specialist and reflect the overall level of inherent risk within the respective reporting unit and the rate of return a market participant would expect to earn. Our cash flow projections were derived from our most recent internal forecasts of anticipated revenue growth rates and operating margins, with cash flows beyond the discrete forecast period estimated using a terminal value calculation which incorporated historical and forecasted trends, an estimate of long-term growth rates, and assumptions about the future demand for our services. The perpetual growth rate used for our annual testing was \n2.5\n% for all of our reporting units.\n55\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 8 - GOODWILL, IDENTIFIABLE INTANGIBLE ASSETS, AND OTHER LONG-LIVED ASSETS (Continued)\nFor each of the years ended December 31, 2024, 2023 and 2022, \nno\n impairment of our goodwill was recognized.\nDue to the inherent uncertainties involved in making estimates, our assumptions may change in future periods. Estimates and assumptions made for purposes of our goodwill impairment testing may prove to be inaccurate predictions of the future, and other factors used in assessing fair value, such as the weighted average cost of capital, are outside the control of management. Unfavorable changes in certain of these key assumptions may affect future testing results. For example, keeping all other assumptions constant, a 50 basis point increase in the weighted average cost of capital would cause the estimated fair values of our United States electrical construction and facilities services segment, our United States mechanical construction and facilities services segment, our United States building services segment, and our United States industrial services segment to decrease by approximately $\n226.5\n million, $\n383.7\n million, $\n93.5\n million, and $\n32.5\n million, respectively. In addition, keeping all other assumptions constant, a 50 basis point reduction in the perpetual growth rate would cause the estimated fair values of our United States electrical construction and facilities services segment, our United States mechanical construction and facilities services segment, our United States building services segment, and our United States industrial services segment to decrease by approximately $\n123.2\n million, $\n210.1\n million, $\n46.0\n million, and $\n13.0\n million, respectively. Given the amounts by which the fair value exceeds the carrying value for each of our reporting units, the decreases in estimated fair values described above would not have significantly impacted the results of our 2024 impairment tests. Further, for each of our reporting units, a 10% decline in the estimated fair value of such reporting unit, due to other changes in our assumptions, including forecasted future cash flows, would not have significantly impacted the results of our 2024 impairment tests. \nThe changes in the carrying amount of goodwill by reportable segment during the years ended December 31, 2024 and 2023 were as follows (in thousands):  \n \nUnited States\nelectrical\nconstruction\nand facilities\nservices segment\nUnited States\nmechanical\nconstruction\nand facilities\nservices segment\nUnited States\nbuilding\nservices \nsegment\nUnited States\nindustrial services \nsegment\nTotal\nBalance at December 31, 2022\n$\n178,013\n \n$\n315,329\n \n$\n311,721\n \n$\n114,088\n \n$\n919,151\n \nAcquisitions\n—\n \n4,524\n \n32,874\n \n—\n \n37,398\n \nIntersegment transfers\n—\n \n(\n1,500\n)\n1,500\n \n—\n \n—\n \nBalance at December 31, 2023\n178,013\n \n318,353\n \n346,095\n \n114,088\n \n956,549\n \nAcquisitions\n13,739\n \n26,111\n \n12,210\n \n9,806\n \n61,866\n \nBalance at December 31, 2024\n$\n191,752\n \n$\n344,464\n \n$\n358,305\n \n$\n123,894\n \n$\n1,018,415\n \nThe aggregate goodwill balance as of December 31, 2022 included $\n493.6\n million of accumulated impairment charges, which were comprised of $\n139.5\n million within our United States building services segment and $\n354.1\n million within our United States industrial services segment.\nIdentifiable Intangible Assets and Other Long-Lived Assets\nOur identifiable intangible assets, arising out of the acquisition of businesses, include customer relationships, subsidiary trade names, developed technology/vendor network, and contract backlog, all of which are subject to amortization. In addition, our identifiable intangible assets include certain other subsidiary trade names, which are indefinite-lived and therefore not subject to amortization.\nAbsent earlier indicators of impairment, we test for impairment of subsidiary trade names that are not subject to amortization on an annual basis (October 1). In performing this test, we calculate the fair value of each trade name using the “relief from royalty payments” methodology. This approach involves two steps: (a) estimating reasonable royalty rates for each trade name and (b) applying these royalty rates to a net revenue stream and discounting the resulting cash flows to determine fair value. This fair value is then compared with the carrying value of each trade name. If the carrying amount of the trade name is greater than the implied fair value of the trade name, an impairment in the amount of the excess is recognized and charged to operations. For each of the years ended December 31, 2024, 2023, and 2022, \nno\n impairment of our indefinite-lived trade name intangible assets was recognized.\n56\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 8 - GOODWILL, IDENTIFIABLE INTANGIBLE ASSETS, AND OTHER LONG-LIVED ASSETS (Continued)\nWe review for impairment of identifiable intangible assets that are being amortized as well as other long-lived assets whenever facts and circumstances indicate that their carrying values may not be fully recoverable. This test compares their carrying values to the undiscounted pre-tax cash flows expected to result from the use of the assets. If the assets are impaired, the assets are written down to their fair values, generally determined based on their discounted estimated future cash flows. In 2023, we identified facts and circumstances that indicated the carrying values of certain long-lived assets within our United States mechanical construction and facilities services segment may not be fully recoverable. As a result, we determined that these assets were impaired, and recognized a $\n2.4\n million impairment charge. For the years ended December 31, 2024, 2023, and 2022, there were \nno\n other indicators of impairment with respect to identifiable intangible assets that are being amortized as well as other long-lived assets.\n \nIdentifiable intangible assets as of December 31, 2024 and 2023 consisted of the following (in thousands):  \n \nDecember 31, 2024\n \nGross\nCarrying\nAmount\nAccumulated\nAmortization\nAccumulated\nImpairment\nCharge\n \nTotal\nCustomer relationships\n$\n902,216\n \n$\n(\n543,913\n)\n$\n(\n4,834\n)\n$\n353,469\n \nTrade names (indefinite-lived)\n330,271\n \n— \n(\n58,933\n)\n271,338\n \nDeveloped technology/Vendor network\n95,661\n \n(\n83,338\n)\n—\n \n12,323\n \nTrade names (finite-lived)\n38,491\n \n(\n30,026\n)\n—\n \n8,465\n \nContract backlog\n96,045\n \n(\n93,460\n)\n—\n \n2,585\n \nTotal\n$\n1,462,684\n \n$\n(\n750,737\n)\n$\n(\n63,767\n)\n$\n648,180\n \n \nDecember 31, 2023\n \nGross\nCarrying\nAmount\nAccumulated\nAmortization\nAccumulated\nImpairment\nCharge\nTotal\nCustomer relationships\n$\n807,766\n \n$\n(\n482,594\n)\n$\n(\n4,834\n)\n$\n320,338\n \nTrade names (indefinite-lived)\n299,271\n \n— \n(\n58,933\n)\n240,338\n \nDeveloped technology/Vendor network\n95,661\n \n(\n78,788\n)\n—\n \n16,873\n \nTrade names (finite-lived)\n35,991\n \n(\n27,800\n)\n—\n \n8,191\n \nContract backlog\n84,845\n \n(\n84,553\n)\n—\n \n292\n \nTotal\n$\n1,323,534\n \n$\n(\n673,735\n)\n$\n(\n63,767\n)\n$\n586,032\n \nIdentifiable intangible assets attributable to businesses acquired in 2024 and 2023 have been valued at $\n139.1\n million and $\n59.2\n million, respectively, and consist of customer relationships, trade names, and contract backlog. See Note 4 - Acquisitions of Businesses of the notes to consolidated financial statements for additional information with respect to acquisitions. \nIdentifiable intangible assets are amortized in a manner that best approximates the pattern in which the economic benefits of such assets are consumed, which is generally on a straight-line basis. The weighted average amortization periods for the unamortized balances remaining are, in the aggregate, approximately \n7.75\n years, which are comprised of the following: \n8.25\n years for customer relationships, \n4.50\n years for trade names, \n2.75\n years for developed technology/vendor network, and \n0.75\n years for contract backlog. \nAmortization expense related to identifiable intangible assets with finite lives was $\n77.0\n million, $\n67.1\n million, and $\n61.3\n million for the years ended December 31, 2024, 2023, and 2022, respectively.\n57\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 8 - GOODWILL, IDENTIFIABLE INTANGIBLE ASSETS, AND OTHER LONG-LIVED ASSETS (Continued)\n \nThe following table presents the estimated future amortization expense of identifiable intangible assets in the following years (in thousands):  \n2025\n$\n73,449\n \n2026\n63,594\n \n2027\n50,067\n \n2028\n40,996\n \n2029\n35,115\n \nThereafter\n113,621\n \n \n$\n376,842\n \nOther Considerations \nAs referenced above, impairment testing is based upon assumptions and estimates determined by management from a review of our operating results and business plans as well as forecasts of anticipated growth rates and margins, among other considerations. In addition, estimates of weighted average costs of capital are developed with the assistance of an independent third-party valuation specialist. These assumptions and estimates may change in future periods. Significant adverse changes to external market conditions or our internal forecasts, if any, could result in future impairment charges. It is not possible at this time to determine if any future impairment charge will result or, if it does, whether such a charge would be material to our results of operations.\nNOTE 9 - \nDEBT\nExcluding finance lease liabilities, we had no outstanding debt as of December 31, 2024 and 2023. Refer to Note 16 - Leases of the notes to consolidated financial statements for additional information regarding our finance leases, including outstanding balances. \nCredit Agreement\nWe have a credit agreement dated \nDecember 20, 2023\n (the “2023 Credit Agreement”), which provides for a $\n1.3\n billion revolving credit facility (the “2023 Revolving Credit Facility”) expiring \nDecember 20, 2028\n. If additional lenders are identified and/or existing lenders are willing to increase their current commitments, we may increase the 2023 Revolving Credit Facility by an amount equal to the greater of: (a) $\n900\n million or (b) the Company’s Adjusted EBITDA (as such term is defined in the 2023 Credit Agreement) for the twelve-month period ending immediately prior to the increase in commitment. We may allocate up to $\n600.0\n million of available capacity under the 2023 Revolving Credit Facility to letters of credit for our account or for the account of any of our subsidiaries.\nThere were \nno\n direct borrowings outstanding under the 2023 Revolving Credit Facility as of December 31, 2024 and 2023. However, outstanding letters of credit reduce the available capacity under this facility and, as of December 31, 2024 and 2023, we had $\n71.2\n million and $\n116.7\n million of letters of credit outstanding, respectively. \nAt the Company’s election, borrowings under the 2023 Revolving Credit Facility bear interest at either: (1) a base rate plus a margin of \n0.125\n% to \n0.875\n%, depending on the Company’s Leverage Ratio (as such term is defined in the 2023 Credit Agreement), or (2) a rate equal to the secured overnight financing rate as administered by the Federal Reserve Bank of New York for the applicable tenor plus \n0.10\n% (“Adjusted Term SOFR”) plus a margin of \n1.125\n% to \n1.875\n%, depending on the Company’s Leverage Ratio. The base rate is determined by the greater of: (a) the prime commercial lending rate announced by Bank of Montreal from time to time, (b) the federal funds effective rate, plus ½ of 1.00%, (c) Adjusted Term SOFR for a one-month tenor, plus \n1.00\n%, or (d) \n0.00\n%.\n58\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 9 - DEBT (Continued)\nA commitment fee is payable on the average daily unused amount of the 2023 Revolving Credit Facility, which ranges from \n0.125\n% to \n0.25\n%, depending on the Company’s Leverage Ratio. The fee was \n0.125\n% of the unused amount as of December 31, 2024 and 2023. Fees for letters of credit issued under the 2023 Revolving Credit Facility range from \n0.85\n% to \n1.875\n% of the respective face amounts of outstanding letters of credit, depending on the nature of the letter of credit, and are computed depending on the Company’s Leverage Ratio. \nObligations under the 2023 Credit Agreement are guaranteed by most of our direct and indirect subsidiaries and are secured by substantially all of our assets. The 2023 Credit Agreement contains customary covenants providing for, among other things, the maintenance of certain financial ratios and certain limitations on the payment of dividends, common stock repurchases, investments, acquisitions, indebtedness, and capital expenditures. We were in compliance with all such covenants as of December 31, 2024 and 2023.\nNOTE 10 - \nFAIR VALUE MEASUREMENTS\nFor disclosure purposes, we utilize a fair value hierarchy to categorize qualifying assets and liabilities into three broad levels based on the priority of the inputs used to determine their fair values. The hierarchy, which gives the highest priority to unadjusted quoted prices in active markets for identical assets and liabilities and the lowest priority to unobservable inputs, is comprised of the following three levels:\nLevel 1 – Unadjusted quoted prices in active markets for identical assets and liabilities.\nLevel 2 – Observable inputs, other than Level 1 inputs, that are directly or indirectly observable for the asset or liability, including quoted prices for similar assets and liabilities in active markets; quoted prices for identical or similar assets or liabilities in markets that are not active; and model-derived valuations whose inputs are observable or whose significant value drivers are observable.\nLevel 3 – Significant unobservable inputs that reflect the reporting entity’s own assumptions.\nRecurring Fair Value Measurements\nThe following tables summarize the assets and liabilities carried at fair value measured on a recurring basis as of December 31, 2024 and 2023 (in thousands):\n \nAssets at Fair Value as of December 31, 2024\nAsset Category\nLevel 1\nLevel 2\nLevel 3\nTotal\nCash and cash equivalents \n(1)\n$\n1,339,550\n \n$\n—\n \n$\n—\n \n$\n1,339,550\n \nDeferred compensation plan assets \n(2)\n61,242\n \n—\n \n—\n \n61,242\n \nRestricted cash \n(3)\n845\n \n—\n \n—\n \n845\n \nTotal\n$\n1,401,637\n \n$\n—\n \n$\n—\n \n$\n1,401,637\n \n_________________\n(1)\nCash and cash equivalents consist of deposit accounts and money market funds with original maturity dates of three months or less, which are Level 1 assets. At December 31, 2024, we had $\n1,088.0\n million in money market funds. From time to time, we have cash balances in certain of our domestic bank accounts that exceed federally insured limits. \n(2)\nDeferred compensation plan assets are classified as “Other assets” in the Consolidated Balance Sheets.\n(3)\nRestricted cash is classified as “Prepaid expenses and other” in the Consolidated Balance Sheets. Restricted cash represents cash held in account for use on customer contracts.\n59\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 10 - FAIR VALUE MEASUREMENTS (Continued)\n \nAssets at Fair Value as of December 31, 2023\nAsset Category\nLevel 1\nLevel 2\nLevel 3\nTotal\nCash and cash equivalents \n(1)\n$\n789,750\n \n$\n—\n \n$\n—\n \n$\n789,750\n \nDeferred compensation plan assets \n(2)\n47,315\n \n—\n \n—\n \n47,315\n \nTotal\n$\n837,065\n \n$\n—\n \n$\n—\n \n$\n837,065\n \n_________________\n(1)\nCash and cash equivalents consist of deposit accounts and money market funds with original maturity dates of three months or less, which are Level 1 assets. At December 31, 2023, we had $\n497.3\n million in money market funds. From time to time, we have cash balances in certain of our domestic bank accounts that exceed federally insured limits. \n(2)\nDeferred compensation plan assets are classified as “Other assets” in the Consolidated Balance Sheets.\nNonrecurring Fair Value Measurements\nWe have recorded goodwill and identifiable intangible assets in connection with our business acquisitions. Such assets are measured at fair value at the time of acquisition based on valuation techniques that appropriately represent the methods which would be used by other market participants in determining fair value. In addition, goodwill, intangible assets, and certain other long-lived assets are tested for impairment using similar valuation methodologies to determine the fair value of such assets. Periodically, we engage an independent third-party valuation specialist to assist with the valuation process, including the selection of appropriate methodologies and the development of market-based assumptions. The inputs used for these nonrecurring fair value measurements represent Level 3 inputs.\nFair Value of Financial Instruments\nWe believe that the carrying values of our financial instruments, which include accounts receivable and other financing commitments, approximate their fair values due primarily to their short-term maturities and low risk of counterparty default. Although there were no outstanding direct borrowings under our 2023 Credit Agreement as of December 31, 2024 and 2023, the carrying value of any debt associated with this agreement would approximate its fair value due to the variable rate on such debt.\nNOTE 11 - \nINCOME TAXES\nFor the years ended December 31, 2024, 2023, and 2022, our income tax provision was calculated based on income before income taxes as follows (in thousands): \n \n2024\n2023\n2022\nUnited States\n$\n1,349,469\n \n$\n844,002\n \n$\n523,273\n \nForeign\n27,913\n \n28,851\n \n35,477\n \n \n$\n1,377,382\n \n$\n872,853\n \n$\n558,750\n \nForeign income for each of the years ended December 31, 2024, 2023, and 2022 was predominantly earned in the United Kingdom.\nThe income tax provision for the years ended December 31, 2024, 2023, and 2022 consisted of the following (in thousands): \n \n2024\n2023\n2022\nCurrent provision:\n \n \n \nFederal\n$\n299,203\n \n$\n187,463\n \n$\n100,707\n \nState and local\n94,647\n \n62,316\n \n36,547\n \nForeign\n5,502\n \n6,396\n \n4,891\n \n \n399,352\n \n256,175\n \n142,145\n \nDeferred (benefit) provision\n(\n29,115\n)\n(\n16,651\n)\n10,483\n \n \n$\n370,237\n \n$\n239,524\n \n$\n152,628\n \n60\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 11 - INCOME TAXES (Continued)\nFor the year ended December 31, 2024, our income tax provision was $\n370.2\n million compared to $\n239.5\n million for the year ended December 31, 2023 and $\n152.6\n million for the year ended December 31, 2022. The increase in the income tax provision year-over-year was primarily due to increased income before income taxes. \nThe income tax rates on income before income taxes for the years ended December 31, 2024, 2023, and 2022 were \n26.9\n%, \n27.5\n%, and \n27.3\n%, respectively.\nItems accounting for the differences between income taxes computed at the federal statutory rate and the income tax provision for the years ended December 31, 2024, 2023, and 2022 were as follows (in thousands): \n \n2024\n2023\n2022\nFederal income taxes at the statutory rate\n$\n289,250\n \n$\n183,230\n \n$\n117,338\n \nState and local income taxes, net of federal tax benefits\n69,202\n \n46,752\n \n29,519\n \nPermanent differences\n12,221\n \n9,513\n \n5,261\n \nForeign income taxes (including UK statutory rate changes)\n1,032\n \n640\n \n(\n155\n)\nOther\n(\n1,468\n)\n(\n611\n)\n665\n \n \n$\n370,237\n \n$\n239,524\n \n$\n152,628\n \nAs of December 31, 2024, we had undistributed foreign earnings from certain foreign subsidiaries of approximately $\n188.3\n million. Based on our evaluation, and given that a significant portion of such earnings were subject to tax in prior periods, or are indefinitely reinvested, we have concluded that any taxes associated with the repatriation of such foreign earnings would be immaterial. As of December 31, 2024, the amount of cash held by these foreign subsidiaries was approximately $\n143.5\n million which, if repatriated, should not result in any material federal or state income taxes.\nWe file a consolidated federal income tax return including all of our U.S. subsidiaries with the Internal Revenue Service. We additionally file income tax returns with various state, local, and foreign tax agencies. Our income tax returns are subject to audit by various taxing authorities and are currently under examination for the years 2020 through 2023. \nOn March 11, 2021, the American Rescue Plan Act was signed into law. Such act includes certain tax provisions that could have an impact on the Company in future periods, including expanded limits on compensation deductions under Section 162(m) of the Internal Revenue Code for tax years beginning after December 31, 2026. We are currently evaluating the impact that this act may have on our financial position and/or results of operations; however, we anticipate that the expanded provisions of Section 162(m) will result in an increase in our effective income tax rate for years beginning after December 31, 2026.\nOn August 16, 2022, the Inflation Reduction Act of 2022 (the “Inflation Reduction Act”) was signed into law. For tax years beginning after December 31, 2022, the Inflation Reduction Act creates a 15% corporate alternative minimum tax on profits of corporations whose average annual adjusted financial statement income exceeds $1.0 billion for any consecutive three-tax-year period preceding the then current tax year. Based on our average annual income for the preceding three years, which was below the aforementioned $1.0 billion threshold, as well as the fact that our effective federal income tax rate is in excess of the 15% alternative minimum tax rate, this alternative minimum tax did not have an impact on our financial position and/or results of operations for the years ended December 31, 2024 and 2023. \nLegislation has been enacted in the United Kingdom to implement measures in concert with the Base Erosion and Profit Shifting Pillar Two framework for international taxation developed by the member countries of the Organization for Economic Co-operation and Development (the “Pillar Two Model Rules”). The Pillar Two Model Rules are intended to ensure that multinational enterprises pay a minimum 15% effective tax rate in every jurisdiction in which they operate. Given that our effective income tax rate in all jurisdictions in which we operate is in excess of such 15% minimum rate, we do not anticipate that these rules will have a material effect on our tax provision or effective income tax rate; however, we continue to monitor evolving tax legislation in the jurisdictions in which we operate.\n61\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 11 - INCOME TAXES (Continued)\nDeferred income tax assets and liabilities are recognized for the expected future tax consequences of temporary differences between the financial statement and income tax bases of assets and liabilities. \nThe deferred income tax assets and deferred income tax liabilities recorded as of December 31, 2024 and 2023 were as follows (in thousands): \n \nDecember 31, 2024\nDecember 31, 2023\nDeferred income tax assets:\n \n \nExcess of amounts expensed for financial statement purposes over amounts deducted for income tax purposes:\nInsurance liabilities\n$\n69,664\n \n$\n59,667\n \nOperating lease liabilities\n102,667\n \n92,410\n \nDeferred compensation\n76,042\n \n54,313\n \nOther (including liabilities and reserves)\n49,715\n \n40,110\n \nTotal deferred income tax assets\n298,088\n \n246,500\n \nValuation allowance for deferred tax assets\n(\n5,076\n)\n(\n4,385\n)\nNet deferred income tax assets\n293,012\n \n242,115\n \nDeferred income tax liabilities:\n \n \nCosts capitalized for financial statement purposes and deducted for income tax purposes:\n \n \nGoodwill and identifiable intangible assets\n(\n172,613\n)\n(\n165,073\n)\nOperating lease right-of-use assets\n(\n94,800\n)\n(\n85,883\n)\nDepreciation of property, plant, and equipment\n(\n33,284\n)\n(\n30,075\n)\nPension asset\n(\n6,082\n)\n(\n4,660\n)\nOther\n(\n14,664\n)\n(\n13,063\n)\nTotal deferred income tax liabilities\n(\n321,443\n)\n(\n298,754\n)\nNet deferred income tax liabilities\n$\n(\n28,431\n)\n$\n(\n56,639\n)\nOur net deferred income tax liabilities of $\n28.4\n million and $\n56.6\n million as of December 31, 2024 and 2023, respectively, were included in “Other long-term obligations” in the accompanying Consolidated Balance Sheet.\nValuation allowances are established when necessary to reduce deferred income tax assets when it is more likely than not that a tax benefit will not be realized. As of December 31, 2024 and 2023, the total valuation allowance on deferred income tax assets, related to state and local net operating losses, foreign net operating losses, and foreign income tax credit carryovers, was approximately $\n5.1\n million and $\n4.4\n million, respectively. The increase in our valuation allowances at December 31, 2024 was a result of the recognition of allowances for additional state net operating loss carryovers that we determined we would likely not be able to utilize. \nRealization of our deferred income tax assets is dependent on our generating sufficient taxable income in the jurisdictions in which such deferred tax assets will reverse. Although realization is not assured, based on current projections of future taxable income, we believe it is more likely than not that the deferred income tax assets, net of the valuation allowances discussed above, will be realized. However, revisions to our forecasts or declining macroeconomic conditions could result in changes to our assessment of the realization of these deferred income tax assets.\n \n62\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 12 - \nCOMMON STOCK\nAs of December 31, 2024 and 2023, there were \n45,810,125\n and \n47,047,265\n shares of our common stock outstanding, respectively.\nWe have paid quarterly dividends since October 25, 2011. We currently pay a regular quarterly dividend of $\n0.25\n per share. \nIn September 2011, our Board of Directors (the “Board”) authorized a share repurchase program allowing us to begin repurchasing shares of our outstanding common stock. Subsequently, the Board has from time to time increased the amount authorized for repurchases under such program. Since the inception of the repurchase program, through December 31, 2024, the Board has authorized us to repurchase up to $\n2.65\n billion of our outstanding common stock. During the year ended December 31, 2024, we repurchased approximately \n1.3\n million shares of our common stock for approximately $\n501.6\n million, inclusive of the applicable excise tax. Since the inception of the repurchase program through December 31, 2024, we have repurchased approximately \n27.1\n million shares of our common stock for approximately $\n2.39\n billion. As of December 31, 2024, there remained authorization for us to repurchase approximately $\n259.5\n million of our shares. The repurchase program has no expiration date, does not obligate the Company to acquire any particular amount of common stock, and may be suspended, recommenced, or discontinued at any time or from time to time without prior notice. We may repurchase our shares from time to time to the extent permitted by securities laws and other legal requirements, including provisions in our 2023 Credit Agreement placing limitations on such repurchases.\n \nNOTE 13 - \nSHARE-BASED COMPENSATION PLANS \nWe have an incentive plan under which stock awards, stock units, and other share-based compensation may be granted to officers, non-employee directors, and key employees of the Company. Under the terms of this plan, \n3,250,000\n shares were authorized, and \n599,493\n shares remain available for grant or issuance as of December 31, 2024. Any issuances under this plan are valued at the fair market value of our common stock on the grant date. Forfeitures are recognized as they occur. \nThe following table summarizes activity regarding restricted stock units since December 31, 2021: \n \nShares\nWeighted\nAverage\nPrice\nBalance, December 31, 2021\n404,468\n \n$\n79.16\n \nGranted\n107,621\n \n$\n123.52\n \nForfeited\n(\n4,665\n)\n$\n105.88\n \nVested\n(\n189,830\n)\n$\n67.40\n \nBalance, December 31, 2022\n317,594\n \n$\n100.83\n \nGranted\n103,024\n \n$\n156.06\n \nForfeited\n(\n3,018\n)\n$\n118.59\n \nVested\n(\n122,751\n)\n$\n90.38\n \nBalance, December 31, 2023\n294,849\n \n$\n124.30\n \nGranted\n93,636\n \n$\n279.05\n \nForfeited\n(\n409\n)\n$\n185.51\n \nVested\n(\n139,262\n)\n$\n105.65\n \nBalance, December 31, 2024\n248,814\n \n$\n192.87\n \nAn aggregate of \n30,879\n restricted stock units granted to current non-employee directors vested as of December 31, 2024, but, at the election of such directors, issuance has been deferred for up to \n10\n years from the date of vest. In addition, an aggregate of \n13,087\n restricted stock units granted to a former employee vested as of April 1, 2024 but, in accordance with plan documents, were not issued until January 2025.\nWe recognized approximately $\n20.0\n million, $\n13.7\n million, and $\n12.1\n million of compensation expense for stock units awarded to non-employee directors and employees pursuant to our incentive plan for the years ended December 31, 2024, 2023, and 2022, respectively.\n \nWe have approximately $\n15.9\n million of compensation expense, net of income taxes, which will be recognized over the remaining vesting periods of up to \n3\n years. \n63\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 13 - SHARE-BASED COMPENSATION PLANS (Continued)\nThe income tax benefit derived in 2024, 2023, and 2022 as a result of share-based compensation was approximately $\n5.7\n million, $\n3.3\n million, and $\n3.9\n million, respectively, of which approximately $\n4.0\n million, $\n1.7\n million, and $\n1.7\n million, respectively, represented excess tax benefits.\nNOTE 14 - \nRETIREMENT PLANS\nDefined Benefit Plans \nThe funded status of our defined benefit plans, which represents the difference between the fair value of plan assets and the projected benefit obligations, is recognized in the Consolidated Balance Sheets with a corresponding adjustment to accumulated other comprehensive income (loss). Gains and losses for the differences between actuarial assumptions and actual results are recognized through accumulated other comprehensive income (loss). These amounts will be subsequently recognized as net periodic pension (income) cost within the Consolidated Statement of Operations, as described further below.\nUnited Kingdom Retirement Plan\nOur United Kingdom subsidiary has a defined benefit pension plan covering all eligible employees (the “UK Plan”); however, no individual joining the company after October 31, 2001 may participate in the UK Plan. On May 31, 2010, we curtailed the future accrual of benefits for active employees under such plan.\nThe change in benefit obligations and assets of the UK Plan for the years ended December 31, 2024 and 2023 consisted of the following components (in thousands): \n \n2024\n2023\nChange in pension benefit obligation\n \n \nBenefit obligation at beginning of year\n$\n204,097\n \n$\n193,956\n \nInterest cost\n9,569\n \n9,722\n \nActuarial (gain) loss\n(\n19,602\n)\n651\n \nBenefits paid\n(\n11,522\n)\n(\n10,411\n)\nForeign currency exchange rate changes\n(\n3,075\n)\n10,179\n \nBenefit obligation at end of year\n179,467\n \n204,097\n \nChange in pension plan assets\n \n \nFair value of plan assets at beginning of year\n223,077\n \n210,284\n \nActual (loss) return on plan assets\n(\n5,240\n)\n10,563\n \nEmployer contributions\n816\n \n1,564\n \nBenefits paid\n(\n11,522\n)\n(\n10,411\n)\nForeign currency exchange rate changes\n(\n3,514\n)\n11,077\n \nFair value of plan assets at end of year\n203,617\n \n223,077\n \nFunded status at end of year\n$\n24,150\n \n$\n18,980\n \nThe funded status of the UK Plan of $\n24.2\n million and $\n19.0\n million as of December 31, 2024 and 2023, respectively, is included in “Other assets” in the accompanying Consolidated Balance Sheets. No plan assets are expected to be returned to us during the year ending December 31, 2025. \n64\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 14 - RETIREMENT PLANS (Continued)\nThe assumptions used to determine benefit obligations of the UK Plan as of December 31, 2024 and 2023 were as follows: \n \n2024\n2023\nDiscount rate\n5.5\n \n%\n4.8\n \n%\nThe components of net periodic pension (income) cost of the UK Plan for the years ended December 31, 2024, 2023, and 2022 were as follows (in thousands):\n \n2024\n2023\n2022\nInterest cost\n$\n9,569\n \n$\n9,722\n \n$\n5,693\n \nExpected return on plan assets\n(\n13,010\n)\n(\n11,417\n)\n(\n12,088\n)\nAmortization of unrecognized loss\n2,625\n \n2,611\n \n2,073\n \nNet periodic pension (income) cost\n$\n(\n816\n)\n$\n916\n \n$\n(\n4,322\n)\nThe assumptions used to determine net periodic pension (income) cost of the UK Plan for the years ended December 31, 2024, 2023, and 2022 were as follows: \n \n2024\n2023\n2022\nDiscount rate\n4.8\n \n%\n5.0\n \n%\n1.8\n \n%\nAnnual rate of return on plan assets\n6.3\n \n%\n5.7\n \n%\n3.9\n \n%\nThe annual rate of return on plan assets has been determined by modeling possible returns using the actuary’s portfolio return calculator and the fair value of plan assets. This approach models the long term expected returns of the various asset classes held in the portfolio and takes into account the additional benefits of holding a diversified portfolio. For measurement purposes of the liability, the annual rates of inflation of covered pension benefits assumed for 2024 and 2023 were \n2.9\n% and \n2.8\n%, respectively.\nAmounts pertaining to the UK Plan not yet reflected in net periodic pension (income) cost and included in accumulated other comprehensive loss were as follows (in thousands): \n \nDecember 31, 2024\nDecember 31, 2023\nUnrecognized actuarial losses\n$\n77,031\n \n$\n82,344\n \nActuarial gains and losses are amortized using a corridor approach whereby cumulative gains and losses in excess of the greater of 10% of the pension benefit obligation or the fair value of plan assets are amortized over the average life expectancy of plan participants. The amortization period for 2024 was \n22\n years. \nThe reclassification adjustment, net of income taxes, for the UK Plan from accumulated other comprehensive loss into net periodic pension (income) cost was approximately $\n2.0\n million for each of the years ended December 31, 2024 and 2023, and approximately $\n1.6\n million for the year ended December 31, 2022. The estimated unrecognized loss for the UK Plan that will be amortized from accumulated other comprehensive loss into net periodic pension (income) cost over the next year is approximately $\n1.9\n million, net of income taxes. \n65\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 14 - RETIREMENT PLANS (Continued)\nPlan Assets\nThe investment policies and strategies for the assets of the UK Plan are established by its trustees (who are independent of the Company) to achieve a reasonable balance between risk, likely return, and administration expense, as well as to maintain investment balances at a level to meet minimum funding requirements. In order to ensure that an appropriate investment strategy is in place, an analysis of the UK Plan’s assets and liabilities is completed periodically. Target allocation percentages may vary over time depending on the perceived risk and return potential of various asset classes and market conditions. \nThe weighted average asset allocations and weighted average target allocations at December 31, 2024 and 2023 were as follows: \n \nAsset Category\nTarget Asset\nAllocation\n 2024\nActual \nDecember 31, 2024\nTarget Asset Allocation \n2023\nActual \nDecember 31, 2023\nDebt\n91.0\n \n%\n82.6\n \n%\n90.0\n \n%\n87.1\n \n%\nCash and cash equivalents\n—\n \n%\n7.7\n \n%\n—\n \n%\n3.9\n \n%\nReal estate\n9.0\n \n%\n9.7\n \n%\n10.0\n \n%\n9.0\n \n%\nTotal\n100.0\n \n%\n100.0\n \n%\n100.0\n \n%\n100.0\n \n%\nPlan assets of our UK Plan are invested through third-party fund managers in various investments with underlying holdings which, as of December 31, 2024 and 2023, consisted of: (a) cash and cash equivalents, primarily held as collateral for other financial instruments, (b) debt securities, which include: (i) United Kingdom government debt, (ii) United States, United Kingdom, other European, and emerging market corporate debt, and (iii) real estate debt, and (c) real estate assets, which represent trusts which invest directly or indirectly in various properties throughout the United Kingdom.\nThe following tables set forth the fair value of assets of the UK Plan as of December 31, 2024 and 2023 (in thousands): \n \nAssets at Fair Value as of December 31, 2024\nAsset Category\n    Level 1\nLevel 2\nLevel 3\nTotal\nCorporate debt funds\n$\n—\n \n$\n39,972\n \n$\n—\n \n$\n39,972\n \nGovernment bond funds\n—\n \n48,959\n \n—\n \n48,959\n \nCash and cash equivalents\n15,697\n \n—\n \n—\n \n15,697\n \nTotal plan assets in fair value hierarchy\n$\n15,697\n \n$\n88,931\n \n$\n—\n \n104,628\n \nPlan assets measured using NAV as a practical expedient: \n(1)\nDebt funds\n79,152\n \nReal estate funds\n19,837\n \nTotal plan assets at fair value\n$\n203,617\n \n \nAssets at Fair Value as of December 31, 2023\nAsset Category\n    Level 1\nLevel 2\nLevel 3\nTotal\nCorporate debt funds\n$\n—\n \n$\n44,504\n \n$\n—\n \n$\n44,504\n \nGovernment bond funds\n—\n \n63,934\n \n—\n \n63,934\n \nCash and cash equivalents\n8,797\n \n—\n \n—\n \n8,797\n \nTotal plan assets in fair value hierarchy\n$\n8,797\n \n$\n108,438\n \n$\n—\n \n117,235\n \nPlan assets measured using NAV as a practical expedient: \n(1)\nDebt funds\n85,786\n \nReal estate funds\n20,056\n \nTotal plan assets at fair value\n$\n223,077\n \n_________________\n(1)\nCertain investments measured using net asset value (“NAV”) as a practical expedient have not been classified in the fair value hierarchy. The fair value amounts presented in the table are intended to permit reconciliation of the fair value hierarchy to the total fair value of plan assets. NAV is determined by the respective fund manager based on the fair value of the underlying assets held by the fund, less its liabilities, divided by the number of units outstanding.\n66\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 14 - RETIREMENT PLANS (Continued)\nAssets of the UK Plan are allocated within the fair value hierarchy discussed in Note 10 - Fair Value Measurements, based on the nature of the investment. Level 1 assets represent cash and cash equivalents. Level 2 assets consist of corporate debt funds and government bond funds whose underlying investments are valued using observable marketplace inputs. The fair value of the Level 2 assets are generally determined under a market approach using valuation models that incorporate observable inputs such as interest rates, bond yields, and quoted prices. \nInvestments valued using NAV as a practical expedient are excluded from the fair value hierarchy. These investments include: (a) funds which invest predominantly in senior secured debt instruments, targeting diversity across regions and sectors, as well as funds which invest in diversified credit vehicles that seek higher returns than traditional fixed income investments, primarily through U.S. corporate debt, global credit, and other structured debt instruments, and (b) funds which aim to provide long-term income through investment in UK property assets. These investments are redeemable at NAV, which is generally determined on a quarterly basis, and have redemption notice periods of up to 180 days.\nThe methods described above may produce fair values that may not be indicative of net realizable value or reflective of future fair values. Furthermore, while the Company believes the valuation methodologies are appropriate and consistent with other market participants, the use of different methodologies or assumptions to determine fair value of certain financial instruments could result in a different fair value measurement at the reporting date.\nContributions \nOur United Kingdom subsidiary expects to contribute approximately $\n0.6\n million to the UK Plan in 2025. \nEstimated Future Benefit Payments \nThe following estimated benefit payments are expected to be made from the UK Plan in the following years (in thousands): \n \nPension\nBenefit Payments\n2025\n$\n11,587\n \n2026\n$\n11,773\n \n2027\n$\n12,478\n \n2028\n$\n13,170\n \n2029\n$\n13,115\n \nSucceeding five years\n$\n69,771\n \nOther Retirement Plans \nWe also sponsor \nthree\n domestic retirement plans in which participation by new individuals is frozen. The aggregate benefit obligation associated with these plans as of December 31, 2024 and 2023 was approximately $\n6.1\n million and $\n6.3\n million, respectively. The estimated fair value of the plan assets as of December 31, 2024 and 2023 was approximately $\n5.2\n million and $\n5.1\n million, respectively. The plan assets are predominantly invested in cash, equity securities, and equity and bond funds, which have quoted market prices in active markets, and as such are considered Level 1 assets within the fair value hierarchy. The net liability associated with these plans as of December 31, 2024 and 2023 is classified as “Other long-term obligations” in the accompanying Consolidated Balance Sheets. The measurement date for these plans is December 31 of each year. The major assumptions used in the actuarial valuations to determine benefit obligations included discount rates of \n5.00\n% as of December 31, 2024, and \n4.75\n% to \n5.20\n% as of December 31, 2023. In addition, key assumptions included an expected rate of return of \n7.00\n% in order to determine net periodic pension (income) cost for both 2024 and 2023. The net periodic pension (income) cost associated with the domestic plans, as well as the reclassification adjustment from accumulated other comprehensive loss to net periodic pension (income) cost, were insignificant for all periods presented. \n67\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 14 - RETIREMENT PLANS (Continued)\nDefined Contribution Plans\n We have defined contribution retirement and savings plans that cover eligible employees in the United States. Contributions to these plans are based on a percentage of the employee’s base compensation. The expenses recognized for employer contributions to these plans were approximately $\n44.0\n million for the year ended December 31, 2024, $\n36.7\n million for the year ended December 31, 2023, and $\n35.0\n million for the year ended December 31, 2022. At our discretion and subject to applicable plan documents, we may make additional supplemental matching contributions to one of our defined contribution retirement and savings plans. The expenses recognized related to additional supplemental matching contributions for the years ended December 31, 2024, 2023, and 2022 were approximately $\n13.2\n million, $\n10.2\n million, and $\n9.2\n million, respectively. \nOur United Kingdom subsidiary also has defined contribution retirement plans. The expenses recognized related to employer matching contributions were approximately $\n7.4\n million for each of the years ended December 31, 2024 and 2023, and $\n7.3\n million for the year ended December 31, 2022. \nMultiemployer Plans\nWe participate in approximately \n200\n multiemployer pension plans (“MEPPs”) that provide retirement benefits to certain union employees in accordance with various collective bargaining agreements (“CBAs”). As one of many participating employers in an MEPP, we are potentially liable with the other participating employers for any plan underfunding, either through an increase in our required contributions or, in the case of our withdrawal from the plan, a payment based upon our proportionate share of the plan's unfunded benefits, in each case, as described below. Our contributions to a particular MEPP are established by the applicable CBAs; however, our required contributions may increase based on the funded status of an MEPP and legal requirements of the Pension Protection Act of 2006 (the “PPA”), which requires substantially underfunded MEPPs to implement a funding improvement plan (“FIP”) or a rehabilitation plan (“RP”) to improve their funded status. Factors that could impact the funded status of an MEPP include, without limitation, investment performance, changes in the participant demographics, decline in the number of contributing employers, changes in actuarial assumptions, and the utilization of extended amortization provisions. \nAn FIP or RP requires a particular MEPP to adopt measures to correct its underfunding status. These measures may include, but are not limited to: (a) an increase in our contribution rate as a signatory to the applicable CBA, (b) a reallocation of the contributions already being made by participating employers for various benefits to individuals participating in the MEPP, and/or (c) a reduction in the benefits to be paid to future and/or current retirees. In addition, the PPA requires that a 5% surcharge be levied on employer contributions for the first year commencing after the date the employer receives notice that the MEPP is in critical status and a 10% surcharge on each succeeding year until a CBA is in place with terms and conditions consistent with the RP. \nWe could also be obligated to make payments to MEPPs if we either cease to have an obligation to contribute to the MEPP or significantly reduce our contributions to the MEPP because we reduce our number of employees who are covered by the relevant MEPP for various reasons, including, but not limited to, layoffs or closure of a subsidiary assuming the MEPP has unfunded vested benefits. The amount of such payments (known as a complete or partial withdrawal liability) would equal our proportionate share of the MEPPs’ unfunded vested benefits. We believe that certain of the MEPPs in which we participate may have unfunded vested benefits. Due to uncertainty regarding future factors that could trigger withdrawal liability, as well as the absence of specific information regarding the MEPP’s current financial situation, we are unable to determine: (a) the amount and timing of a future withdrawal liability, if any, and (b) whether our participation in these MEPPs could have a material adverse impact on our financial position, results of operations, or liquidity. We did \nnot\n record any material withdrawal liabilities for the years ended December 31, 2024, 2023, and 2022.\n68\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 14 - RETIREMENT PLANS (Continued)\nThe following table lists all MEPPs to which our contributions exceeded $\n2.0\n million in 2024. This table also lists all MEPPs to which we contributed in 2024 in excess of $\n0.5\n million for MEPPs in the critical status, “red zone,” and $\n1.0\n million for MEPPs in the endangered status, “orange or yellow zones,” as defined by the PPA (in thousands): \n \nPension Fund\nEIN/Pension Plan Number\nPPA Zone Status \n(1)\nFIP/RP\nStatus\nContributions\n \nContributions greater than 5% of total plan contributions \n(2)\nExpiration\ndate or range of expiration dates of CBA(s)\n2024\n2023\n2024\n2023\n2022\nNational Automatic Sprinkler Industry Pension Fund\n52-6054620\n001\nGreen\nGreen\nNA\n$\n30,719\n \n$\n25,559\n \n$\n21,583\n \nYes\nMarch 2025 to\nJuly 2027\nNational Electrical Benefit Fund\n53-0181657\n001\nGreen\nGreen\nNA\n23,255\n \n18,128\n \n15,192\n \nYes\nApril 2025 to August 2028\nUnited Association National Pension Fund\n52-6152779\n001\nGreen\nGreen\nNA\n21,839\n \n16,815\n \n15,288\n \nNo\nFebruary 2025 to May 2029\nSheet Metal Workers National Pension Fund\n52-6112463\n001\nGreen\nGreen\nNA\n12,795\n \n10,797\n \n9,505\n \nNo\nMay 2025 to\nJune 2029\nElectrical Workers Local No. 26 Pension Trust Fund\n52-6117919\n001\nGreen\nGreen\nNA\n12,472\n \n8,283\n \n7,844\n \nYes\nMay 2025 to August 2028\nCentral Pension Fund of the IUOE & Participating Employers\n36-6052390\n001\nGreen\nGreen\nNA\n9,433\n \n8,573\n \n7,651\n \nNo\nMarch 2025 to December 2028\nEdison Pension Plan\n93-6061681\n001\nGreen\nGreen\nNA\n7,982\n \n5,840\n \n5,325\n \nYes\nDecember 2026\nPlumbers Pipefitters & Mechanical Equipment Service Local Union 392 Pension Plan\n31-0655223\n001\nYellow\nRed\nPending\n7,728\n \n7,010\n \n7,674\n \nYes\nMay 2025\nSan Diego Electrical Pension Plan\n95-6101801\n001\nGreen\nGreen\nNA\n7,039\n \n5,511\n \n4,258\n \nYes\nMay 2028\nPension, Hospitalization & Benefit Plan of the Electrical Industry-Pension Trust Account\n13-6123601\n001\nGreen\nGreen\nNA\n6,982\n \n7,198\n \n8,122\n \nYes\nJanuary 2025 to April 2025\nPipefitters Union Local 537 Pension Fund\n51-6030859\n001\nGreen\nGreen\nNA\n6,656\n \n5,179\n \n5,039\n \nYes\nAugust 2025\nHeating, Piping & Refrigeration Pension Fund\n52-1058013\n001\nGreen\nGreen\nNA\n5,710\n \n5,315\n \n4,625\n \nYes\nJuly 2025\nSouthern California Pipe Trades Retirement Fund\n51-6108443\n001\nGreen\nGreen\nNA\n5,447\n \n4,657\n \n4,650\n \nYes\nJune 2026 to August 2026\nSheet Metal Workers Pension Plan of Northern California\n51-6115939\n001\nRed\nRed\nImplemented\n5,245\n \n5,738\n \n6,074\n \nYes\nMay 2025 to June 2026\nElectrical Workers Pension Plan Local 103 IBEW\n04-6063734\n001\nGreen\nGreen\nNA\n5,133\n \n6,537\n \n2,900\n \nYes\nAugust 2028\nEighth District Electrical Pension Fund\n84-6100393\n001\nGreen\nGreen\nNA\n4,476\n \n3,844\n \n3,339\n \nYes\nMay 2025 to August 2027\nElectrical Contractors Association of the City of Chicago Local Union 134, IBEW Joint Pension Trust of Chicago Pension Plan 2\n51-6030753\n002\nGreen\nGreen\nNA\n4,341\n \n4,432\n \n3,516\n \nYes\nJune 2025\nSouthern California IBEW-NECA Pension Trust Fund\n95-6392774\n001\nYellow\nYellow\nImplemented\n4,279\n \n3,801\n \n4,287\n \nYes\nNovember 2025 to\nJune 2026\nAtlanta Plumbers and Steamfitters Pension Fund\n58-1233396\n001\nGreen\nGreen\nNA\n4,133\n \n1,691\n \n1,434\n \nYes\nJanuary 2025 to August 2028\nArizona Pipe Trades Pension Trust Fund\n86-6025734\n001\nGreen\nGreen\nNA\n4,038\n \n3,048\n \n2,940\n \nYes\nJune 2025 to June 2027\nIBEW Local 701 Pension Fund\n36-6455509\n001\nGreen\nGreen\nNA\n3,849\n \n3,989\n \n2,625\n \nYes\nJune 2025 to August 2026\nSheet Metal Workers Pension Plan of Southern California, Arizona & Nevada\n95-6052257\n001\nGreen\nGreen\nNA\n3,783\n \n3,399\n \n2,921\n \nNo\nJune 2026 to June 2029\nU.A. Local 393 Pension Trust Fund Defined Benefit\n94-6359772\n002\nGreen\nGreen\nNA\n3,734\n \n3,263\n \n3,517\n \nYes\nMay 2025 to June 2027\nIBEW Local No. 82 Pension Plan\n31-6127268\n001\nGreen\nGreen\nNA\n3,325\n \n3,701\n \n2,549\n \nYes\nDecember 2026\nNorthern California Pipe Trades Pension Plan\n94-3190386\n001\nGreen\nGreen\nNA\n3,310\n \n6,317\n \n3,238\n \nYes\nMay 2025 to June 2027\n69\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 14 - RETIREMENT PLANS (Continued)\nPension Fund\nEIN/Pension Plan Number\nPPA Zone Status \n(1)\nFIP/RP\nStatus\nContributions\n \nContributions greater than 5% of total plan contributions \n(2)\nExpiration\ndate or range of expiration dates of CBA(s)\n2024\n2023\n2024\n2023\n2022\nNECA-IBEW Pension Trust Fund\n51-6029903\n001\nGreen\nGreen\nNA\n3,242\n \n2,228\n \n3,034\n \nNo\nMay 2025 to December 2025\nPlumbers & Steamfitters Local 486 Pension Fund\n52-6124449\n001\nGreen\nGreen\nNA\n2,796\n \n2,828\n \n1,599\n \nYes\nDecember 2025\nIBEW Local 456 Pension Plan\n22-6238995\n001\nGreen\nGreen\nNA\n2,792\n \n1,390\n \n417\n \nYes\nJune 2025\nPlumbers & Pipefitters Local No. 189 Pension Plan\n31-0894807\n001\nGreen\nGreen\nNA\n2,744\n \n2,557\n \n1,272\n \nYes\nMay 2025 to June 2025\nKern County Electrical Workers Pension Fund\n95-6123049\n001\nGreen\nGreen\nNA\n2,499\n \n3,299\n \n1,542\n \nYes\nNovember 2027\nU.A. Plumbers Local 24 Pension Fund\n22-6042823\n001\nGreen\nGreen\nNA\n2,231\n \n2,295\n \n1,819\n \nYes\nApril 2025\nBuilding Trades United Pension Trust Fund Milwaukee and Vicinity\n51-6049409\n001\nGreen\nGreen\nNA\n2,182\n \n1,622\n \n1,560\n \nNo\nMay 2025 to May 2026\nIBEW Local No. 683 Pension Fund Pension Plan\n34-1442087\n001\nGreen\nGreen\nNA\n2,146\n \n905\n \n893\n \nYes\nJune 2025 to May 2027\nPension and Retirement Plan of Plumbers and Pipefitters Union, Local No. 525\n88-6003864\n001\nGreen\nGreen\nNA\n2,099\n \n1,970\n \n1,858\n \nNo\nJanuary 2025 to September 2028\nPlumbers and Steamfitters Local No. 166 AFL - CIO Pension Plan\n51-6132690\n001\nGreen\nGreen\nNA\n2,046\n \n1,773\n \n1,838\n \nYes\nMay 2025\nIBEW Local No. 640 & Arizona Chapter NECA Defined Benefit Pension Plan\n86-0323980\n001\nGreen\nGreen\nNA\n2,044\n \n390\n \n52\n \nNo\nJune 2025 to June 2027\nPlumbers & Pipefitters Local 162 Pension Fund\n31-6125999\n001\nYellow\nYellow\nImplemented\n1,390\n \n1,243\n \n1,132\n \nYes\nMay 2025 to May 2026\nPlumbing & Pipe Fitting Local 219 Pension Fund\n34-6682376\n001\nRed\nRed\nImplemented\n1,098\n \n919\n \n1,172\n \nYes\nMay 2026\nBoilermaker-Blacksmith National Pension Trust\n48-6168020\n001\nRed\nRed\nImplemented\n825\n \n1,140\n \n6,434\n \nNo\nApril 2025 to \nApril 2027\nCarpenters Pension Trust Fund for Northern California\n94-6050970\n001\nRed\nRed\nImplemented\n627\n \n610\n \n532\n \nNo\nJune 2027\nOther Multiemployer Pension Plans\n \n \n \n \n58,586\n \n55,035\n \n54,915\n \n \nVarious\nTotal Contributions\n \n \n \n \n$\n297,050\n \n$\n258,829\n \n$\n236,165\n \n \n \n _________________\n(1)    \nThe zone status represents the most recent available information for the respective MEPP, which may be from 2023 or earlier for the 2024 year and from 2022 or earlier for the 2023 year. In general, plans with a “green” zone status have a funding ratio of at least 80%, plans with an “orange” or “yellow” zone status have a funding ratio of between 65% and less than 80%, and plans with a “red” zone status are less than 65% funded or are projected to have a funding deficiency in any of the next ten years.\n(2)    \nThis information was obtained from the respective plan’s Form 5500 (“Forms”) for the most current available filing. These dates may not correspond with our fiscal year contributions. The percentages of contributions are based upon disclosures contained in the plans’ Forms. Those Forms, among other things, disclose the names of individual participating employers whose annual contributions account for more than 5% of the aggregate annual amount contributed by all participating employers for a plan year. Accordingly, if the annual contribution of two or more of our subsidiaries each accounted for less than 5% of such contributions, but in the aggregate accounted for in excess of 5% of such contributions, that greater percentage is not available and therefore is not disclosed.\n \nThe nature and diversity of our operations may result in volatility in the amount of our contributions to a particular MEPP for any given period. That is because, in any given market, a change in the mix, volume of, or size of our projects could result in a change in our direct labor force and a corresponding change in our contributions to the MEPP(s) dictated by the applicable CBA. Additionally, the amount of contributions to a particular MEPP could also be affected by the terms of the CBA, which could require at a particular time, an increase in the contribution rate and/or surcharges. Acquisitions made by us since 2022 have resulted in incremental contributions to various MEPPs of approximately $\n3.3\n million.\n \nAdditionally, we contribute to certain multiemployer plans that provide post-retirement benefits such as health and welfare benefits and/or defined contribution/annuity plans, among others. Our contributions to these plans were approximately $\n279.9\n million, $\n243.5\n million, and $\n213.7\n million for the years ended December 31, 2024, 2023, and 2022, respectively. Acquisitions made by us since 2022 have resulted in incremental contributions to such other post-retirement benefit plans of approximately $\n6.4\n million. The amount of contributions to these plans is also subject, for the most part, to the factors discussed above in conjunction with the MEPPs.\n \n70\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 15 - \nCOMMITMENTS AND CONTINGENCIES\nSeverance Agreements \nWe have agreements with our executive officers and certain other key management personnel providing for severance benefits for such employees upon termination of their employment under certain circumstances. \nGuarantees\nIn the ordinary course of business, we, at times, guarantee obligations of our subsidiaries under certain contracts. Generally, we are liable under such an arrangement only if our subsidiary fails to perform its obligations under the contract. Historically, we have not incurred any substantial liabilities as a consequence of these guarantees. \nSurety Bonds\nThe terms of our construction contracts frequently require that we obtain from surety companies, and provide to our customers, surety bonds as a condition to the award of such contracts. These surety bonds are issued in return for premiums, which vary depending on the size and type of the bond, and secure our payment and performance obligations under such contracts. We have agreed to indemnify the surety companies for amounts, if any, paid by them in respect of surety bonds issued on our behalf. As of December 31, 2024, based on the percentage-of-completion of our projects covered by surety bonds, our aggregate estimated exposure, assuming defaults on all our then existing contractual obligations, was approximately $\n2.5\n billion, which represents approximately \n25\n% of our total remaining performance obligations. \nSurety bonds are sometimes provided to secure obligations for wages and benefits payable to or for certain of our employees, at the request of labor unions representing such employees. In addition, surety bonds may be issued as collateral for certain insurance obligations. As of December 31, 2024, we satisfied approximately $\n61.7\n million of the collateral requirements of our insurance programs by utilizing surety bonds. \nWe are not aware of any losses in connection with surety bonds that have been posted on our behalf, and we do not expect to incur significant losses in the foreseeable future.\nHazardous Materials\nWe are subject to regulation with respect to the handling or disposal of certain materials used in the performance of our services, which are classified as hazardous or toxic by federal, state, and local agencies. Our practice is to avoid participation in projects principally involving the remediation or removal of such materials. However, when remediation is required as part of our contract performance, we believe we comply with all applicable regulations governing the discharge of hazardous materials into the environment or otherwise relating to the protection of the environment. \nCollective Bargaining Agreements\nAt December 31, 2024, we employed approximately \n40,400\n people, approximately \n63\n% of whom are represented by various unions pursuant to approximately \n425\n collective bargaining agreements between our individual subsidiaries or trade associations and local unions, as well as \ntwo\n collective bargaining agreements that are national or regional in scope. We believe that our relations with our labor unions are generally positive.\nGovernment Contracts\nWhen we perform work as a federal government contractor/subcontractor or when we perform work on a project that has received federal government funding, we are subject to U.S. government audits and investigations relating to our operations, which such audits may result in fines, penalties and compensatory and treble damages, and possible suspension or debarment from doing business with the government. Based on currently available information, we believe the outcome of ongoing government disputes and investigations will not have a material impact on our financial position, results of operations, or liquidity.\nLegal Proceedings     \nWe face potential exposure in several legal proceedings in which damages or claims (including, without limitation, indemnification claims by named defendants in legal proceedings in which we are not a party) have been asserted against us. We believe that we have valid defenses to such proceedings and claims, but litigation is inherently uncertain. We additionally maintain insurance coverage for certain of these matters, although these policies do not cover all possible claims and certain of the policies are subject to large deductibles and retentions. We do not believe that any such matters will have a material adverse effect on our financial position, results of operations, or liquidity. We record a loss contingency if we consider the potential loss from a proceeding or claim probable, and we are able to reasonably estimate the amount or can reasonably determine a range of loss. We provide disclosure when we believe a loss in excess of any recorded provision is reasonably possible.\n71\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 15 - COMMITMENTS AND CONTINGENCIES (Continued)\nSignificant judgment is required in these determinations. As additional information becomes available, we reassess prior determinations and may change our estimates. Additional claims may be asserted against us in the future. Litigation is subject to many uncertainties, and the outcome of litigation is not predictable with assurance. A litigation matter for which liabilities have not been recorded could be decided unfavorably to us, and any such unfavorable decision could have a material adverse effect on our financial position, results of operations, or liquidity.\nNOTE 16 - \nLEASES \nWe lease real estate, vehicles, and equipment under various arrangements which are classified as either operating or finance leases. A lease exists when a contract or part of a contract conveys the right to control the use of an identified asset for a period of time in exchange for consideration. In determining whether a lease exists, we consider whether a contract provides us with both: (a) the right to obtain substantially all of the economic benefits from the use of the identified asset and (b) the right to direct the use of the identified asset. \nMany of our leases include base rental periods coupled with options to renew or terminate the lease, generally at our discretion. Certain leases additionally include options to purchase the leased asset. In evaluating the lease term, we consider whether we are reasonably certain to exercise such options. To the extent a significant economic incentive exists to exercise an option, that option is included within the lease term. However, based on the nature of our lease arrangements, options generally do not provide us with a significant economic incentive and are therefore excluded from the lease term for the majority of our arrangements.\nOur leases typically include a combination of fixed and variable payments. Fixed payments are generally included when measuring the right-of-use asset and lease liability. Variable payments, which primarily represent payments based on usage of the underlying asset, are generally excluded from such measurement and expensed as incurred. In addition, certain of our lease arrangements may contain a lease coupled with an arrangement to provide other services, such as maintenance, or may require us to make other payments on behalf of the lessor related to the leased asset, such as payments for taxes or insurance. We account for these non-lease components together with the associated lease component for each of our asset classes.\nThe measurement of right-of-use assets and lease liabilities requires us to estimate appropriate discount rates. To the extent the rate implicit in the lease is readily determinable, such rate is utilized. However, based on information available at lease commencement for the majority of our leases, the rate implicit in the lease is not known. In these instances, we utilize an incremental borrowing rate, which represents the rate of interest that we would pay to borrow on a collateralized basis, over a similar term, an amount equal to the lease payments.\nOur lease arrangements generally do not contain significant restrictions or covenants; however, certain of our vehicle and equipment leases include residual value guarantees, whereby we provide a guarantee to the lessor that the value of the underlying asset will be at least a specified amount at the end of the lease. Amounts probable of being owed under these guarantees are included within the measurement of the right-of-use asset and lease liability.\n \nLease Position \nThe following table presents our lease-related assets and liabilities as of December 31, 2024 and 2023 (in thousands):\nClassification on the Consolidated Balance Sheet\nDecember 31,\n2024\nDecember 31,\n2023\nAssets\nOperating lease assets\nOperating lease right-of-use assets\n$\n316,128\n \n$\n310,498\n \nFinance lease assets\nProperty, plant, and equipment, net\n6,009\n \n4,932\n \nTotal lease assets\n$\n322,137\n \n$\n315,430\n \nLiabilities\nCurrent\nOperating\nOperating lease liabilities, current\n$\n81,247\n \n$\n75,236\n \nFinance\nOther accrued expenses and liabilities\n2,246\n \n2,465\n \nNoncurrent\nOperating\nOperating lease liabilities, long-term\n261,575\n \n259,430\n \nFinance\nOther long-term obligations\n3,849\n \n2,838\n \nTotal lease liabilities\n$\n348,917\n \n$\n339,969\n \n72\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 16 - LEASES (Continued)\nLease Costs\nThe following table presents information related to our lease expense for the years ended December 31, 2024, 2023, and 2022 (in thousands):\n2024\n2023\n2022\nFinance lease expense:\nAmortization expense\n$\n2,604\n \n$\n2,816\n \n$\n3,550\n \nInterest expense\n254\n \n175\n \n178\n \nOperating lease expense\n103,261\n \n93,158\n \n77,143\n \nShort-term lease expense \n(1)\n290,267\n \n224,047\n \n185,061\n \nVariable lease expense\n7,137\n \n9,482\n \n6,782\n \nTotal lease expense\n$\n403,523\n \n$\n329,678\n \n$\n272,714\n \n_________________\n(1)\nShort-term lease expense includes both leases and rentals with initial terms of one year or less and predominantly represents equipment used on construction projects.\nSublease rental income was approximately $\n4.6\n million, $\n6.7\n million, and $\n3.8\n million for the years ended December 31, 2024, 2023, and 2022, respectively.\nLease Term and Discount Rate \nThe following table presents certain information related to the lease terms and discount rates for our leases as of December 31, 2024 and 2023:\nDecember 31,\n2024\nDecember 31,\n2023\nWeighted-average remaining lease term:\nOperating leases\n5.1\n years\n5.7\n years\nFinance leases\n3.4\n years\n2.9\n years\nWeighted-average discount rate:\nOperating leases\n4.43\n \n%\n4.11\n \n%\nFinance leases\n4.67\n \n%\n3.57\n \n%\nOther Information\nThe following table presents supplemental cash flow information related to our leases for the years ended December 31, 2024, 2023, and 2022 (in thousands):\n2024\n2023\n2022\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows used for operating leases\n$\n101,611\n \n$\n90,412\n \n$\n74,927\n \nOperating cash flows used for finance leases\n$\n254\n \n$\n175\n \n$\n178\n \nFinancing cash flows used for finance leases\n$\n2,855\n \n$\n2,776\n \n$\n3,551\n \nRight-of-use assets obtained in exchange for new operating lease liabilities\n$\n94,538\n \n$\n125,417\n \n$\n75,027\n \nRight-of-use assets obtained in exchange for new finance lease liabilities\n$\n3,412\n \n$\n1,427\n \n$\n2,209\n \n73\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 16 - LEASES (Continued)\nMaturity of Lease Liabilities\nThe following table reconciles our future minimum lease payments on an undiscounted cash flow basis to our lease liabilities reported in the Consolidated Balance Sheet as of December 31, 2024 (in thousands):\nOperating Leases\nFinance   Leases\n2025\n$\n94,462\n \n$\n2,475\n \n2026\n79,015\n \n1,760\n \n2027\n64,443\n \n1,157\n \n2028\n50,760\n \n759\n \n2029\n39,646\n \n325\n \nThereafter\n55,218\n \n125\n \nTotal minimum lease payments\n383,544\n \n6,601\n \nLess: Amount of lease payments representing interest\n(\n40,722\n)\n(\n506\n)\nPresent value of future minimum lease payments\n$\n342,822\n \n$\n6,095\n \nCurrent portion of lease liabilities\n$\n81,247\n \n$\n2,246\n \nNoncurrent portion of lease liabilities\n261,575\n \n3,849\n \nPresent value of future minimum lease payments\n$\n342,822\n \n$\n6,095\n \nNOTE 17 - \nADDITIONAL CASH FLOW INFORMATION \nThe following table presents information about cash paid for interest and income taxes for the years ended December 31, 2024, 2023, and 2022 (in thousands): \n \n \n2024\n2023\n2022\nCash paid during the year for:\n \n \n \nInterest\n$\n2,850\n \n$\n16,246\n \n$\n11,653\n \nIncome taxes\n$\n409,362\n \n$\n230,496\n \n$\n168,732\n \nNOTE 18 - \nSEGMENT INFORMATION\nWe are one of the largest specialty contractors in the United States and a leading provider of electrical and mechanical construction and facilities services, building services, and industrial services. Our services are provided to a broad range of commercial, technology, manufacturing, industrial, healthcare, utility, and institutional customers through approximately \n100\n operating subsidiaries. Such operating subsidiaries are organized into the following reportable segments, which additionally reflect the nature of the services offered and their geographical location:\n•\nUnited States electrical construction and facilities services;\n•\nUnited States mechanical construction and facilities services;\n•\nUnited States building services;\n•\nUnited States industrial services; and\n•\nUnited Kingdom building services. \nOur chief operating decision maker (“CODM”) is our Chairman, President, and Chief Executive Officer. Our CODM is responsible for assessing performance of the Company and each of our reportable segments as well as allocating resources, including personnel and capital resources. The measure of segment profit or loss utilized by our CODM is operating income. Our CODM evaluates segment performance by comparing historical, actual, and forecasted operating income on a regular basis. The accounting policies of our reportable segments are the same as those applied at the consolidated financial statement level as described in Note 2 - Summary of Significant Accounting Policies of the notes to consolidated financial statements.\n74\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 18 - SEGMENT INFORMATION (Continued)\nThe following tables present the revenues and operating income for each of our reportable segments for the years ended December 31, 2024, 2023, and 2022 (in thousands):\n \n \n2024\n2023\n2022\nRevenues from unrelated entities:\nUnited States electrical construction and facilities services\n$\n3,342,927\n \n$\n2,783,723\n \n$\n2,433,114\n \nUnited States mechanical construction and facilities services\n6,405,657\n \n5,074,803\n \n4,292,208\n \nUnited States building services\n3,114,817\n \n3,120,134\n \n2,754,953\n \nUnited States industrial services\n1,277,190\n \n1,167,790\n \n1,118,767\n \nTotal United States operations\n14,140,591\n \n12,146,450\n \n10,599,042\n \nUnited Kingdom building services\n425,525\n \n436,423\n \n477,078\n \nConsolidated revenues\n$\n14,566,116\n \n$\n12,582,873\n \n$\n11,076,120\n \n2024\n2023\n2022\nTotal revenues:\nUnited States electrical construction and facilities services\n$\n3,370,506\n \n$\n2,786,895\n \n$\n2,438,916\n \nUnited States mechanical construction and facilities services\n6,458,776\n \n5,134,686\n \n4,338,584\n \nUnited States building services\n3,166,680\n \n3,228,056\n \n2,856,115\n \nUnited States industrial services\n1,284,327\n \n1,179,321\n \n1,175,469\n \nLess intersegment revenues\n(\n139,698\n)\n(\n182,508\n)\n(\n210,042\n)\nTotal United States operations\n14,140,591\n \n12,146,450\n \n10,599,042\n \nUnited Kingdom building services\n425,525\n \n436,423\n \n477,078\n \nConsolidated revenues\n$\n14,566,116\n \n$\n12,582,873\n \n$\n11,076,120\n \n2024\n2023\n2022\nOperating income (loss):\nUnited States electrical construction and facilities services\n$\n447,186\n \n$\n230,640\n \n$\n148,728\n \nUnited States mechanical construction and facilities services\n799,613\n \n530,644\n \n330,325\n \nUnited States building services\n176,720\n \n182,995\n \n146,639\n \nUnited States industrial services\n44,213\n \n35,375\n \n19,787\n \nTotal United States operations\n1,467,732\n \n979,654\n \n645,479\n \nUnited Kingdom building services\n21,485\n \n25,681\n \n29,838\n \nCorporate administration\n(\n144,354\n)\n(\n127,229\n)\n(\n110,440\n)\nImpairment loss on long-lived assets\n—\n \n(\n2,350\n)\n—\n \nConsolidated operating income\n1,344,863\n \n875,756\n \n564,877\n \nOther items:\nNet periodic pension income (cost)\n894\n \n(\n1,119\n)\n4,311\n \nInterest expense\n(\n3,779\n)\n(\n17,199\n)\n(\n13,199\n)\nInterest income\n35,404\n \n15,415\n \n2,761\n \nIncome before income taxes\n$\n1,377,382\n \n$\n872,853\n \n$\n558,750\n \n75\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 18 - SEGMENT INFORMATION (Continued)\nThe following tables provide the significant expenses that are regularly provided to and reviewed by our CODM for each of our reportable segments for the years ended December 31, 2024, 2023, and 2022 (in thousands):\n \n2024\n2023\n2022\nCost of sales:\nUnited States electrical construction and facilities services\n$\n2,673,491\n \n$\n2,359,816\n \n$\n2,129,405\n \nUnited States mechanical construction and facilities services\n5,147,903\n \n4,188,707\n \n3,666,428\n \nUnited States building services\n2,516,745\n \n2,567,993\n \n2,286,526\n \nUnited States industrial services\n1,086,503\n \n997,951\n \n972,627\n \nTotal United States operations\n11,424,642\n \n10,114,467\n \n9,054,986\n \nUnited Kingdom building services\n376,423\n \n379,067\n \n417,540\n \nConsolidated cost of sales\n$\n11,801,065\n \n$\n10,493,534\n \n9,472,526\n \n \n2024\n2023\n2022\nSelling, general and administrative expenses:\nUnited States electrical construction and facilities services\n$\n222,250\n \n$\n193,267\n \n$\n154,981\n \nUnited States mechanical construction and facilities services\n458,141\n \n355,452\n \n295,455\n \nUnited States building services\n421,353\n \n369,146\n \n321,788\n \nUnited States industrial services\n146,474\n \n134,464\n \n126,353\n \nTotal United States operations\n1,248,218\n \n1,052,329\n \n898,577\n \nUnited Kingdom building services\n27,616\n \n31,675\n \n29,700\n \nCorporate administration\n144,354\n \n127,229\n \n110,440\n \nConsolidated selling, general and administrative expenses\n$\n1,420,188\n \n$\n1,211,233\n \n1,038,717\n \nThe following tables present other financial information for each of our reportable segments as of or for the years ended December 31, 2024, 2023, and 2022 (in thousands):\n2024\n2023\n2022\nDepreciation and amortization of property, plant, and equipment:\n \n \n \nUnited States electrical construction and facilities services\n$\n7,928\n \n$\n8,402\n \n$\n7,543\n \nUnited States mechanical construction and facilities services\n16,133\n \n12,503\n \n11,492\n \nUnited States building services\n15,716\n \n15,672\n \n12,964\n \nUnited States industrial services\n12,265\n \n11,146\n \n10,888\n \nTotal United States operations\n52,042\n \n47,723\n \n42,887\n \nUnited Kingdom building services\n3,750\n \n3,116\n \n2,752\n \nCorporate administration\n886\n \n983\n \n1,657\n \nTotal depreciation and amortization of property, plant, and equipment\n$\n56,678\n \n$\n51,822\n \n$\n47,296\n \n2024\n2023\n2022\nAmortization of identifiable intangible assets:\n \n \n \nUnited States electrical construction and facilities services\n$\n6,773\n \n$\n9,583\n \n$\n7,298\n \nUnited States mechanical construction and facilities services\n25,320\n \n15,302\n \n14,955\n \nUnited States building services\n21,606\n \n19,621\n \n16,008\n \nUnited States industrial services\n23,303\n \n22,637\n \n23,054\n \nTotal United States operations\n77,002\n \n67,143\n \n61,315\n \nUnited Kingdom building services\n—\n \n—\n \n—\n \nTotal amortization of identifiable intangible assets\n$\n77,002\n \n$\n67,143\n \n$\n61,315\n \n76\nTable of Contents\nEMCOR Group, Inc. and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 18 - SEGMENT INFORMATION (Continued)\n2024\n2023\n2022\nCapital expenditures:\n \n \n \nUnited States electrical construction and facilities services\n$\n9,467\n \n$\n6,929\n \n$\n11,228\n \nUnited States mechanical construction and facilities services\n31,057\n \n37,543\n \n11,930\n \nUnited States building services\n18,314\n \n19,843\n \n13,303\n \nUnited States industrial services\n9,341\n \n10,433\n \n9,905\n \nTotal United States operations\n68,179\n \n74,748\n \n46,366\n \nUnited Kingdom building services\n5,643\n \n1,984\n \n2,816\n \nCorporate administration\n1,128\n \n1,672\n \n107\n \nTotal capital expenditures\n$\n74,950\n \n$\n78,404\n \n49,289\n \nDecember 31, 2024\nDecember 31, 2023\nDecember 31, 2022\nTotal assets:\nUnited States electrical construction and facilities services\n$\n1,314,577\n \n$\n1,243,707\n \n$\n1,078,405\n \nUnited States mechanical construction and facilities services\n2,659,184\n \n2,242,833\n \n1,835,001\n \nUnited States building services\n1,396,236\n \n1,382,664\n \n1,206,518\n \nUnited States industrial services\n606,861\n \n571,658\n \n552,545\n \nTotal United States operations\n5,976,858\n \n5,440,862\n \n4,672,469\n \nUnited Kingdom building services\n283,897\n \n277,066\n \n255,547\n \nCorporate administration\n1,455,718\n \n891,793\n \n596,591\n \nTotal assets\n$\n7,716,473\n \n$\n6,609,721\n \n$\n5,524,607\n \nThe following table presents geographical information about certain tangible long-lived assets, including property, plant, and equipment and right-of-use lease assets as of December 31, 2024, 2023, and 2022 (in thousands):\nDecember 31, 2024\nDecember 31, 2023\nDecember 31, 2022\nLong-lived assets:\nUnited States\n$\n509,181\n \n$\n476,595\n \n$\n411,581\n \nUnited Kingdom\n14,436\n \n13,281\n \n14,301\n \nTotal long-lived assets\n$\n523,617\n \n$\n489,876\n \n$\n425,882\n \nNOTE 19 - \nSUBSEQUENT EVENTS\nOn February 3, 2025, we completed the acquisition of Miller Electric Company (“Miller Electric”), a leading electrical contractor operating across the Southeastern United States, for $\n865\n million in cash, subject to customary adjustments. The results of operations of Miller Electric will be included as part of our United States electrical construction and facilities services segment.\nOn February 25, 2025, our Board of Directors authorized an additional $\n500\n million for the repurchase of shares of the Company’s outstanding common stock under our existing share repurchase program.\n77\nTable of Contents\nReport of Independent Registered Public Accounting Firm \nTo the Stockholders and Board of Directors of EMCOR Group, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of EMCOR Group, Inc. and subsidiaries (the Company) as of December 31, 2024 and 2023, the related consolidated statements of operations, comprehensive income, equity, and cash flows for each of the three years in the period ended December 31, 2024, and the related notes and financial statement schedule listed in the Index at Item 15(a)(2) (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with U.S. generally accepted accounting principles. \nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated February 26, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion. \nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\n78\nTable of Contents\nRevenue Recognition from Construction Contracts\nDescription of the Matter\nAs described in Note 3 to the consolidated financial statements, the Company generally recognizes revenue from construction contracts over time using a cost-to-cost input method in which the extent of progress is measured based on the ratio of costs incurred to date to the total estimated costs at completion. In addition, the revenue recognition process requires the Company to determine the transaction price that represents the amount of consideration to which the Company expects to be entitled. A significant portion of the Company’s revenues for the year ended December 31, 2024 were derived from construction contracts. \nThe determination of revenue recognized from construction contracts commonly requires the Company to estimate variable consideration that arises from pending change orders, contract claims, contract bonuses, and penalties, as well as to prepare estimates of the costs to complete contracts. Factors inherent in the estimation processes include, among others, historical experience with customers, the potential long-term nature of dispute resolutions, actions of third parties as well as the Company’s experience with similar types of contracts. Due to uncertainties attributed to such factors, auditing revenue recognized from construction contracts involved especially challenging, subjective, and complex judgments.\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design, and tested the operating effectiveness of the Company’s controls related to revenue recognition from construction contracts. For example, we tested controls over the Company’s determination and review of estimates of variable consideration, costs to complete, and the completeness and accuracy of data utilized in conjunction with such estimation processes. \nTo test the amount of revenue recognized from construction contracts in the current period, we selected a sample of contracts and performed procedures to test the project revenue and cost forecasts. For example, we obtained and inspected the related contract agreements, amendments, and change orders to test the existence of customer arrangements and understand the scope and pricing of the related projects; performed inquiries of management and project personnel regarding facts and circumstances relevant to the accounting for such contracts; tested key components of the estimated costs to complete, including materials, labor, and subcontractors costs; agreed actual costs incurred to supporting documentation; and recalculated revenues recognized based on the project's percentage of completion and management's estimate of transaction price. In addition, we performed certain retrospective review procedures to assess management’s historical ability to accurately estimate the transaction price and costs to complete contracts as well as to identify any significant or unusual changes in project revenue and cost forecasts during the period.\n/s/\nErnst & Young LLP\nWe have served as the Company’s auditor since 2002.\nStamford, Connecticut\nFebruary 26, 2025\n \n79\nTable of Contents\nReport of Independent Registered Public Accounting Firm \nTo the Stockholders and Board of Directors of EMCOR Group, Inc. \nOpinion on Internal Control Over Financial Reporting\nWe have audited EMCOR Group, Inc. and subsidiaries’ internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 Framework) (the COSO criteria). In our opinion, EMCOR Group, Inc. and subsidiaries (the Company) maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on the COSO criteria. \nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the 2024 consolidated financial statements of the Company and our report dated February 26, 2025 expressed an unqualified opinion thereon. \nBasis For Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. \nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion. \nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements. \nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. \n/s/  Ernst & Young LLP\nStamford, Connecticut\nFebruary 26, 2025\n \n \n80\nTable of Contents\nITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE \nNot applicable. \nITEM 9A. CONTROLS AND PROCEDURES \nBased on an evaluation of our disclosure controls and procedures (as required by Rule 13a-15(b) of the Securities Exchange Act of 1934), our Chairman, President, and Chief Executive Officer, Anthony J. Guzzi, and our Senior Vice President, Chief Financial Officer and Chief Accounting Officer, Jason R. Nalbandian, have concluded that our disclosure controls and procedures (as defined in Rule 13a-15(e) of the Securities Exchange Act of 1934) are effective as of the end of the period covered by this report. \nManagement’s Report on Internal Control over Financial Reporting \nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act of 1934). Our internal control over financial reporting is a process designed with the participation of our principal executive officer and principal financial officer or persons performing similar functions to provide reasonable assurance regarding the reliability of financial reporting and the preparation of our financial statements for external reporting purposes in accordance with U.S. generally accepted accounting principles. \nOur internal control over financial reporting includes policies and procedures that: (a) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect our transactions and dispositions of assets, (b) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with U.S. generally accepted accounting principles, and that our receipts and expenditures are being made only in accordance with authorizations of our management and Board of Directors, and (c) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of our assets that could have a material effect on our financial statements. \nBecause of its inherent limitations, our disclosure controls and procedures may not prevent or detect misstatements. A control system, no matter how well conceived and operated, can only provide reasonable, not absolute, assurance that the objectives of the control system are met. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, have been detected. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions or that the degree of compliance with the policies or procedures may deteriorate. \nAs of December 31, 2024, our management conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework established in \nInternal Control\n-\nIntegrated Framework (2013) \nissued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this evaluation, management has determined that EMCOR’s internal control over financial reporting was effective as of December 31, 2024. \nThe effectiveness of our internal control over financial reporting as of December 31, 2024 has been audited by Ernst & Young LLP, an independent registered public accounting firm, as stated in its report appearing in Item 8 of this Form 10-K, which such report expressed an unqualified opinion on the effectiveness of our internal control over financial reporting as of December 31, 2024. \nChanges in Internal Control over Financial Reporting \nIn addition, our management with the participation of our principal executive officer and principal financial officer or persons performing similar functions has determined that no change in our internal control over financial reporting (as that term is defined in Rules 13(a)-15(f) and 15(d)-15(f) of the Securities Exchange Act of 1934) occurred during the fourth quarter of our fiscal year ended December 31, 2024 that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.\nITEM 9B. OTHER INFORMATION \nDuring the quarter ended December 31, 2024, \nnone\n of the Company’s directors or executive officers adopted or terminated any: (a) contract, instruction, or written plan for the purchase or sale of Company securities intended to satisfy the affirmative defense conditions of Rule 10b5-1 or (b) non 10b5-1 trading arrangement, each as defined in Item 408(a) of Regulation S-K.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable. \n81\nTable of Contents\nPART III\nITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE \nThe information required by this Item 10 with respect to directors is incorporated herein by reference to the section of our definitive Proxy Statement for the 2025 Annual Meeting of Stockholders entitled “Election of Directors,” which Proxy Statement is to be filed with the Securities and Exchange Commission pursuant to Regulation 14A not later than 120 days after the end of the fiscal year to which this Form 10-K relates (the “Proxy Statement”). The information, if any, required by this Item 10 concerning compliance with Section 16(a) of the Securities Exchange Act of 1934 is incorporated herein by reference to the section of the Proxy Statement entitled “Delinquent Section 16(a) Reports.” The information required by this Item 10 concerning the Audit Committee of our Board of Directors and Audit Committee financial experts is incorporated by reference to the section of the Proxy Statement entitled “Meetings and Committees of the Board of Directors” and “Corporate Governance.” The information required by this Item 10 regarding stockholder recommendations for director candidates is incorporated by reference to the section of the Proxy Statement entitled “Recommendations for Director Candidates.” The information required by this Item 10 with respect to insider trading policies and procedures is incorporated by reference to the section of the Proxy Statement entitled “Insider Trading Policies and Procedures.” Information regarding our executive officers is contained in Part I of this Form 10-K following Item 4 under the heading “Executive Officers of the Registrant.” We have adopted a Code of Ethics that applies to our Chief Executive Officer and our Senior Financial Officers, which is listed on the Exhibit Index. \nITEM 11. EXECUTIVE COMPENSATION \nThe information required by this Item 11 is incorporated herein by reference to the sections of the Proxy Statement entitled “Compensation Discussion and Analysis,” “Executive Compensation and Related Information,” “Potential Post Employment Payments,” “Director Compensation,” “Compensation Committee Interlocks and Insider Participation” and “Compensation Committee Report.” \nITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS \nThe information required by this Item 12 (other than the information required by Section 201(d) of Regulation S-K, which is set forth below) is incorporated herein by reference to the sections of the Proxy Statement entitled “Security Ownership of Certain Beneficial Owners” and “Security Ownership of Management.” \nSecurities Authorized for Issuance Under Equity Compensation Plans.\n The following table summarizes, as of December 31, 2024, certain information regarding equity compensation plans that were approved by stockholders and equity compensation plans that were not approved by stockholders. \nEquity Compensation Plan Information\nA\nB\nC\nPlan Category\nNumber of Securities to be Issued upon Exercise of Outstanding Options, Warrants and Rights\nWeighted Average Exercise Price of Outstanding Options, Warrants and Rights\nNumber of Securities Remaining Available for Future Issuance under Equity Compensation Plans (Excluding Securities Reflected in Column A)\nEquity Compensation Plans Approved by Security Holders\n292,780 \n$\n— \n599,493 \n(1)\nEquity Compensation Plans Not Approved by Security Holders\n— \n— \n— \nTotal\n292,780 \n$\n— \n599,493 \n(1)\n______________\n \n(1)    Represents shares of our common stock available for future issuance under our 2010 Incentive Plan, which may be issued pursuant to the award of restricted stock, unrestricted stock and/or awards that are valued in whole or in part by reference to, or are otherwise based on the fair market value of, our common stock. \nITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE \nThe information required by this Item 13 is incorporated herein by reference to the sections of the Proxy Statement entitled “Compensation Committee Interlocks and Insider Participation” and “Corporate Governance.” \nITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES \nThe information required by this Item 14 is incorporated herein by reference to the section of the Proxy Statement entitled “Ratification of Appointment of Independent Auditors.” \n82\nTable of Contents\nPART IV\nITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES \n \n(a)(1)\nThe following consolidated financial statements of EMCOR Group, Inc. and Subsidiaries are filed as part of this report under Part II, Item 8. Financial Statements and Supplementary Data:\n \nFinancial Statements:\n \nConsolidated Balance Sheets - December 31, 2024 and 2023\n \nConsolidated Statements of Operations - Years Ended December 31, 2024, 2023, and 2022\nConsolidated Statements Comprehensive Income - Years Ended December 31, 2024, 2023, and 2022\n \nConsolidated Statements of Cash Flows - Years Ended December 31, 2024, 2023, and 2022\n \nConsolidated Statements of Equity - Years Ended December 31, 2024, 2023, and 2022\n \nNotes to Consolidated Financial Statements\n Reports of Independent Registered Public Accounting Firm (PCAOB ID: \n42\n)\n(a)(2)\nThe following financial statement schedule is included in this Form 10-K: Schedule II - Valuation and Qualifying Accounts\n \nAll other schedules are omitted because they are not required, are inapplicable, or the information is otherwise shown in the consolidated financial statements or notes thereto.\n(a)(3)\nThe exhibits filed in response to Item 601 of Regulation S-K are listed in the Exhibit Index.\n(b)\nExhibit Index\n83\nTable of Contents\nEXHIBIT INDEX\nExhibit\nNo.\nDescription\nIncorporated By Reference to or\nFiled Herewith, as Indicated Below\n3(a-1)\nRestated Certificate of Incorporation of EMCOR filed December 15, 1994\nExhibit 3(a-5) to EMCOR’s Registration Statement on Form 10 as originally filed March 17, 1995 (“Form 10”)\n3(a-2)\nAmendment dated November 28, 1995 to the Restated Certificate of Incorporation of EMCOR\nExhibit 3(a-2) to EMCOR’s Annual Report on Form 10-K for the year ended December 31, 1995 (“1995 Form 10-K”)\n3(a-3)\nAmendment dated February 12, 1998 to the Restated Certificate of Incorporation of EMCOR\nExhibit 3(a-3) to EMCOR’s Annual Report on Form 10-K for the year ended December 31, 1997 (“1997 Form 10-K”)\n3(a-4)\nAmendment dated January 27, 2006 to the Restated Certificate of Incorporation of EMCOR\nExhibit 3(a-4) to EMCOR’s Annual Report on Form 10-K for the year ended December 31, 2005 (“2005 Form 10-K”)\n3(a-5)\nAmendment dated September 18, 2007 to the Restated Certificate of Incorporation of EMCOR\nExhibit A to EMCOR’s Proxy Statement dated August 17, 2007 for Special Meeting of Stockholders held September 18, 2007\n3(a-6)\nCertificate of Amendment of Restated Certificate of Incorporation of EMCOR\nExhibit 3.1 to EMCOR’s Report on Form 8-K (Date of Report June 8, 2023)\n3(b)\nSecond Amended and Restated By-Laws of EMCOR\nExhibit 3.1 to EMCOR’s Report on Form 8-K (Date of Report October 25, 2022)\n4(a)\nSeventh Amended and Restated Credit Agreement dated as of December 20, 2023 by and among EMCOR and certain subsidiaries and Bank of Montreal, as Agent and the lenders listed on the signature pages thereof\nExhibit 4(a) to EMCOR’s Annual Report on Form  10-K for the year ended December 31, 2023 (“2023 Form 10-K”)\n4(b)\nDescription of Registrant’s Securities\nExhibit 4(e) to EMCOR’s Annual Report on Form  10-K for the year ended December 31, 2020 (“2020 Form 10-K”)\n10(a)\nForm of Severance Agreement (“Severance Agreement”) between EMCOR and each of R. Kevin Matz and Mark A. Pompa\nExhibit 10.1 to EMCOR's Report on Form 8-K (Date of Report April 25, 2005)\n10(b)\nForm of Amendment to Severance Agreement between EMCOR and each of R. Kevin Matz and Mark A. Pompa\nExhibit 10(c) to EMCOR’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2007 (“March 2007 Form 10-Q”)\n10(c)\nLetter Agreement dated October 12, 2004 between Anthony Guzzi and EMCOR (the “Guzzi Letter Agreement”)\nExhibit 10.1 to EMCOR’s Report on Form 8-K (Date of Report October 12, 2004)\n10(d)\nForm of Confidentiality Agreement between Anthony Guzzi and EMCOR\nExhibit C to the Guzzi Letter Agreement\n10(e)\nForm of Indemnification Agreement between EMCOR and each of its officers and directors\nExhibit F to the Guzzi Letter Agreement\n10(f-1)\nSeverance Agreement (“Guzzi Severance Agreement”) dated October 25, 2004 between Anthony Guzzi and EMCOR\nExhibit D to the Guzzi Letter Agreement\n10(f-2)\nAmendment to Guzzi Severance Agreement\nExhibit 10(g-2) to the March 2007 Form 10-Q\n10(g-1)\nChange of Control Agreement dated as of October 25, 2004 between Anthony Guzzi (“Guzzi”) and EMCOR (“Guzzi Continuity Agreement”)\nExhibit E to the Guzzi Letter Agreement\n10(g-2)\nAmendment dated as of March 1, 2007 to Guzzi Continuity Agreement\nExhibit 10(p-2) to the March 2007 Form 10-Q\n10(g-3)\nAmendment to Continuity Agreements and Severance Agreements with Anthony J. Guzzi, R. Kevin Matz and Mark A. Pompa\nExhibit 10(Q) to EMCOR’s Annual Report on Form 10-K for the year ended December 31, 2008 (“2008 Form 10-K”)\n84\nTable of Contents\nEXHIBIT INDEX\nExhibit\nNo.\nDescription\nIncorporated By Reference to or\nFiled Herewith, as Indicated Below\n10(h)\nAmendment dated as of March 29, 2010 to Severance Agreement with Anthony J. Guzzi, R. Kevin Matz and Mark A. Pompa\nExhibit 10.1 to Form 8-K (Date of Report March 29, 2010) (“March 2010 Form 8-K”)\n10(i-1)\nSeverance Agreement dated as of October 26, 2016 between EMCOR and Maxine L. Mauricio\nExhibit 10(l-1) to EMCOR's Quarterly Report on Form 10-Q for the quarter ended September 30, 2016 (\"September 2016 Form 10-Q\")\n10(i-2)\nContinuity Agreement dated as of October 26, 2016 between EMCOR and Maxine L. Mauricio (“Mauricio Continuity Agreement”)\nExhibit 10(l-2) to the September 2016 Form 10-Q\n10(i-3)\nAmendment dated April 10, 2017 to Mauricio Continuity Agreement\nExhibit 10(l-3) to EMCOR’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2017\n10(j-1)\nSeverance Agreement dated as of May 8, 2024 between EMCOR and Jason R. Nalbandian\nE\nxhibit \n10(a-1) to E\nMCOR\n’\ns Quarterly Report on Form 10-Q \nfor the quarter ended June 30, 2024 (\n“\nJune 2024 Fo\nrm 10-Q\n”\n)\n10(j-2)\nContinuity Agreement dated as of May 8, 2024 between EMCOR and Jason R. Nalbandian\nE\nxhibit 10(a-2) to \nthe Ju\nne 2024 Form 10-Q\n10(k-1)\nEMCOR Group, Inc. Long-Term Incentive Plan (“LTIP”)\nExhibit 10 to Form 8-K (Date of Report December 15, 2005)\n10(k-2)\nFirst Amendment to LTIP and updated Schedule A to LTIP\nExhibit 10(S-2) to 2008 Form 10-K \n10(k-3)\nSecond Amendment to LTIP\nExhibit 10.2 to March 2010 Form 8-K\n10(k-4)\nThird Amendment to LTIP\nExhibit 10(q-4) to EMCOR’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2012 (“March 2012 Form 10-Q”)\n10(k-5)\nFourth Amendment to LTIP\nExhibit 10(l-5) to EMCOR’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2013\n10(k-6)\nForm of Certificate Representing Stock Units issued under LTIP\nExhibit 10(T-2) to EMCOR’s Annual Report on Form 10-K for the year ended December 31, 2007 (“2007 Form 10-K”)\n10(k-7)\nFifth Amendment to LTIP\nExhibit 10(l-7) to EMCOR’s Annual Report on Form 10-K for the year ended December 31, 2015 (“2015 Form 10-K”)\n10(k-8)\nSixth Amendment to LTIP\nExhibit 10(l-8) to 2015 Form 10-K\n10(k-9)\nSeventh Amendment to LTIP\nExhibit 10(l-9) to EMCOR's Annual Report on Form 10-K for the year ended December 31, 2021\n10(k-10)\nEighth Amendment to LTIP\nExhibit 10(l-10) to 2023 Form 10-K\n10(l)\nKey Executive Incentive Bonus Plan, as amended and restated\nExhibit B to EMCOR’s Proxy Statement for its Annual Meeting held June 13, 2013\n10(m)\nAmended and Restated 2010 Incentive Plan\nExhibit 10.1 to Form 8-K (Date of Report June 11, 2020)\n10(n)\nForm of Non-LTIP Stock Unit Certificate\nExhibit 10(p)(p) to the March 2012 Form 10-Q\n10(o)\nForm of Director Restricted Stock Unit Agreement\nExhibit 10(k)(k) to EMCOR’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2012 (“June 2012 Form 10-Q”)\n10(p)\nDirector Award Program, as Amended and Restated December 16, 2014\nExhibit 10(z) to EMCOR’s Annual Report on Form 10-K for the year ended December 31, 2014\n85\nTable of Contents\nEXHIBIT INDEX\nExhibit\nNo.\nDescription\nIncorporated By Reference to or\nFiled Herewith, as Indicated Below\n10(q-1)\nEMCOR Group, Inc. Voluntary Deferral Plan\nExhibit 10(E)(E) to EMCOR's Annual Report on Form 10-K for the year ended December 31, 2012 (“2012 Form 10-K”)\n10(q-2)\nFirst Amendment to EMCOR Group, Inc. Voluntary Deferral Plan\nExhibit 10(e)(e) to EMCOR's Annual Report on Form 10-K for the year ended December 31, 2013\n10(r)\nForm of Executive Restricted Stock Unit Agreement\nExhibit 10(F)(F) to 2012 Form 10-K\n14\nCode of Ethics of EMCOR for Chief Executive Officer and Senior Financial Officers\nExhibit 14 to EMCOR's Annual Report on Form 10-K for the year ended December 31, 2003\n19\nInsider Trading Policies and Procedures\nF\niled \nherewith\n21\nList of Significant Subsidiaries\nFiled herewith\n23.1\nConsent of Ernst & Young LLP\nFiled herewith\n31.1\nCertification Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 by Anthony J. Guzzi, the Chairman, President, and Chief Executive Officer\nFiled herewith\n31.2\nCertification Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 by Jason R. Nalbandian, the Senior Vice President, Chief Financial Officer and Chief Accounting Officer\nFiled herewith\n32.1\nCertification Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 by the Chairman, President, and Chief Executive Officer\nFurnished\n32.2\nCertification Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 by the Senior Vice President, Chief Financial Officer and Chief Accounting Officer\nFurnished\n95.1\nInformation concerning mine safety violations or other regulatory matters\nFiled herewith\n97\nPolicy Relating to Recovery of Erroneously Awarded Compensation\nExhibit \n97\n to 2023 Form 10-K\n101\nThe following materials from EMCOR Group, Inc.’s Annual Report on Form 10-K for the year ended December 31, 2024, formatted in iXBRL (Inline eXtensible Business Reporting Language): (i) the Consolidated Balance Sheets, (ii) the Consolidated Statements of Operations, (iii) the Consolidated Statements of Comprehensive Income, (iv) the Consolidated Statements of Cash Flows, (v) the Consolidated Statements of Equity and (vi) the Notes to Consolidated Financial Statements.\nFiled\n104\nCover Page Interactive Data File (formatted in Inline XBRL and contained in Exhibit 101)\nFiled\nPursuant to Item 601(b)(4)(iii) of Regulation S-K, upon request of the Securities and Exchange Commission, the Registrant hereby undertakes to furnish a copy of any unfiled instrument which defines the rights of holders of long-term debt of the Registrant’s subsidiaries. \nITEM 16. FORM 10-K SUMMARY\nNone.\n86\nTable of Contents\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized. \nDate: February 26, 2025 \n \nEMCOR GROUP, INC.\n(Registrant)\nB\nY\n:\n/s/ ANTHONY J. GUZZI\nAnthony J. Guzzi\nChairman, President, and Chief Executive Officer\n \nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities indicated on February 26, 2025. \n \n/\nS\n/  A\nNTHONY\n J. G\nUZZI\nChairman, President, and Chief Executive Officer\nAnthony J. Guzzi\n(Principal Executive Officer)\n/S/  \nJ\nASON \nR.\n \nN\nALBANDIAN\nSenior Vice President, Chief Financial Officer\nand Chief Accounting Officer\nJason R. Nalbandian\n(Principal Financial and Accounting Officer)\n/\nS\n/\n  \nJ\nOHN \nW\n. \nA\nLTMEYER\nDirector\nJohn W. Altmeyer\n/s/  A\nMY\n E. D\nAHL\nDirector\nAmy E. Dahl\n/\nS\n/  R\nONALD\n L. J\nOHNSON\nDirector\nRonald L. Johnson\n/\nS\n/  C\nAROL\n P. L\nOWE\nDirector\nCarol P. Lowe\n/\nS\n/  M. K\nEVIN\n M\nC\nE\nVOY\nDirector\nM. Kevin McEvoy\n/\nS\n/  W\nILLIAM\n P. R\nEID\nDirector\nWilliam P. Reid\n/s/  S\nTEVEN\n B. S\nCHWARZWAELDER\nDirector\nSteven B. Schwarzwaelder\n/\nS\n/  R\nOBIN\n W\nALKER-\nL\nEE\nDirector\nRobin Walker-Lee\n \n87\nTable of Contents\nSCHEDULE II - VALUATION AND QUALIFYING ACCOUNTS \n(In thousands) \n \nDescription\nBalance at\nBeginning\nof Year\n \nCosts and\nExpenses\nDeductions \n(1)\nBalance at\nEnd of Year\nAllowance for credit losses\n \n \n \n \nYear Ended December 31, 2024\n$\n22,502\n \n17,303\n \n(\n4,848\n)\n$\n34,957\n \nYear Ended December 31, 2023\n$\n22,382\n \n7,859\n \n(\n7,739\n)\n$\n22,502\n \nYear Ended December 31, 2022\n$\n23,534\n \n5,166\n \n(\n6,318\n)\n$\n22,382\n \n_________________\n(1)     \nDeductions primarily represent uncollectible balances of accounts receivable written off, net of recoveries.\n \n88"
  }
}