{
  "ticker": "EMR",
  "cik": "0000032604",
  "company_name": "EMERSON ELECTRIC CO",
  "filing_date": "2025-11-10",
  "accession": "0000032604-25-000087",
  "primary_doc": "emr-20250930.htm",
  "item_sections": {
    "item1": "ITEM 1 - BUSINESS\nEmerson Electric Co. (\"Emerson\", \"we\", \"us\", \"our\" or the \"Company”) is a global technology and software company that provides innovative solutions for customers in a wide range of end markets around the world. Through its leading automation portfolio, Emerson helps process, hybrid and discrete manufacturers optimize operations, protect personnel, reduce emissions and achieve their sustainability goals. Sales by geographic destination in 2025 were: the Americas,\n 51 percent; Asia, Middle East & Africa, 30 percent (China, 10 percent); and Europe, 19 percent\n. \nPortfolio management is an integral component of Emerson's growth and value creation strategy. Over the past three years, the Company has taken significant actions to accelerate the transformation of its portfolio through the completion of strategic acquisitions and divestitures of non-core businesses. These actions were undertaken to create a cohesive, higher growth, higher margin industrial technology portfolio, and the Company is now a global automation leader serving a diversified set of end markets. The Company’s recent portfolio actions include the following transactions (note that all d\nollars in Item 1 are in millions, except where noted)\n:\n•\nOn March 12, 2025, Emerson completed its purchase of the remaining outstanding shares of common stock of AspenTech not already owned by the Company for approximately $7.2 billion. As a result of the transaction, AspenTech is now a wholly owned subsidiary of the Company. AspenTech was reorganized upon completion of the transaction and now reports to Control Systems & Software leadership. AspenTech's results, which were previously reported as a separate segment, are now consolidated into the Control Systems & Software segment for all periods presented.\n•\nOn October 11, 2023, the Company completed the acquisition of National Instruments Corporation (\"NI\") at an equity value of $8.2 billion. NI, which provides software-connected automated test and measurement systems that enable enterprises to bring products to market faster and at a lower cost, had revenues of approximately $1.7 billion and pretax earnings of approximately \n$170\n for the 12 months ended September 30, 2023.\n•\nOn May 31, 2023, the Company completed the sale of a majority stake in its Climate Technologies business (which constitutes the former Climate Technologies segment, excluding Therm-O-Disc which was divested earlier in 2022; the new standalone business is named Copeland) to private equity funds managed by Blackstone in a $14.0 billion transaction. Emerson received upfront, pre-tax cash proceeds of approximately $9.7 billion and a note receivable with a face value of $2.25 billion, while retaining a 40 percent non-controlling common equity interest in a new standalone joint venture between Emerson and Blackstone. Subsequently, in August 2024, Emerson sold its 40 percent non-controlling common equity interest in Copeland to private equity funds managed by Blackstone for $1.5 billion and sold the note receivable to Copeland for $1.9 billion.\n•\nOn October 31, 2022, the Company completed the divestiture of its InSinkErator business, which manufactures food waste disposers, to Whirlpool Corporation for $3.0 billion.\nFurther information regarding acquisition and divestiture activity is set forth in Notes 4 and 5.\nAs a result of its portfolio transformation discussed above, the Company now reports six segments and two business groups, which are highlighted in the table below (see Note 20 for further details).\nINTELLIGENT DEVICES\nSOFTWARE AND CONTROL \n•\nFinal Control\n•\nControl Systems & Software\n•\nMeasurement & Analytical\n•\nTest & Measurement\n•\nDiscrete Automation\n•\nSafety & Productivity\n1\nThe Company's comprehensive automation portfolio includes intelligent devices, control systems and design and optimization software solutions to support a diverse set of industries and infrastructure, including process industries (such as chemical, power & renewables and energy), hybrid industries (life sciences, metals & mining, food & beverage, pulp & paper, and others), discrete industries (including automotive, medical, packaging and semiconductor) and more.\nEmerson was incorporated in Missouri in 1890 and has evolved through internal growth and strategic acquisitions. Management has a well-established set of operating mechanisms to manage its business performance and set strategy. The Company also has processes undertaken by management with oversight from the Board of Directors to specifically focus on risks in areas such as cybersecurity, compliance, legal, sustainability, financial and reputational, among others. The Company periodically updates, assesses, and monitors its risk exposures, provides timely updates to the Board, and takes actions to mitigate these risks.\nAll Note references in this document refer to Notes to Consolidated Financial Statements set forth in Item 8 of this Annual Report on Form 10-K, which notes are hereby incorporated by reference. See also",
    "item1a": "Item 1A - \"Risk Factors\" for additional information.",
    "item1b": "ITEM 1B - UNRESOLVED STAFF COMMENTS\nNone.",
    "item1c": "ITEM 1C - CYBERSECURITY\nEmerson has a cybersecurity risk management program that is designed to assess, identify, manage, and govern material risks from cybersecurity threats.\n \nEmerson maintains oversight of its cybersecurity risk management program through a governance structure that includes senior management, the Audit Committee and the Board of Directors (the “Board”). Emerson’s cybersecurity risk management program leverages multiple layers of security controls across the Company’s systems designed to establish risk treatment plans and regularly monitor risks.  Emerson maintains cybersecurity policies and standards aligned with industry standard control frameworks and applicable regulations, laws and standards, and a global incident response plan.\nEmerson’s Board directly, or through its appropriate committees, provides oversight of management’s efforts to mitigate cybersecurity risk and response to cyber incidents. The \nBoard\n and/or its appropriate committees receive regular updates on cybersecurity from management and engage in discussions throughout the year, including with subject-matter experts as appropriate, on the function of the Company’s overall cybersecurity program, cybersecurity risks, strategies for addressing these risks and the implementation thereof. The Audit Committee has oversight responsibility for the Company’s enterprise cybersecurity risks.  The Board also receives reports on cyber events, as appropriate, including response efforts, legal obligations and outreach and notification to regulators and/or customers when needed, as well as provide guidance to management as appropriate.\nEmerson’s Chief Information Security Officer, who has over twenty-five years’ experience in information technology within the engineering and technology industries, with the last fourteen years dedicated to cybersecurity, oversees the Company’s enterprise cybersecurity risk management program.\n \nThe \nChief Information Security Officer\n leads the global enterprise security team responsible for leading enterprise-wide information security strategy, architecture, processes, as well as assessing, identifying, and managing cybersecurity risks, which is an integrated aspect of our overall enterprise risk management program.\n \nThe Chief Information Security Officer provides regular updates to senior management on key security performance indicators of our enterprise cybersecurity program. The Chief Information Security Officer also provides quarterly briefings on cybersecurity to the Audit Committee.\nEmerson maintains a centralized 24x7x365 global incident response operation, managed by the global enterprise security team, supported by leading cybersecurity tools that detect and respond to threats as they occur. Every detected cyber incident is reviewed and assessed by Emerson’s Computer Incident Response Team in accordance with our incident response plan, which contains documented escalation paths and is regularly tested.\nEmerson engages independent third-party cybersecurity experts to evaluate our cybersecurity maturity and test effectiveness of overall cybersecurity controls.\n To test and reinforce Emerson’s internal cybersecurity processes, the Company utilizes an accredited and independent third party to audit and certify key elements of our primary data centers, cloud environments and our enterprise IT organization. The audits are conducted according to International Organization for Standardization (ISO) 27001 Framework, although this is not meant to imply that we meet all technical standards, specifications or requirements under ISO 27001. In addition to performing periodic, internal security reviews, the Company also conducts cybersecurity tabletop exercises led by third party cybersecurity consulting firms from time to time, with the last such engagement occurring in 2023.\nEmerson relies on third-party service providers for certain critical or key infrastructure, solutions, and services across our operations. Emerson has an internal vendor management team that assesses risks from vendors and suppliers that provide, amongst other things, key information and supply chain services to Emerson.\n11\nEmerson maintains a Cybersecurity Awareness Team, within the global enterprise security team, responsible for driving a global information security culture through awareness and education programs. It has created company-wide information security policies and procedures, reviews these regularly and makes them electronically available to our employees. The team works closely with subject matter experts to create educational material and communicate best practices to the company through online training, custom video content, simulated phishing attacks and a variety of other targeted touchpoints.\n \nTo date, no risks from cybersecurity threats, including as a result of any previous cybersecurity incidents, have materially affected or are reasonably likely to materially affect our business, our business strategy, our results of operations or financial condition.\n In the event an attack or other intrusion were to be successful, we have a response team of internal and external resources engaged and prepared to respond. See"
  }
}