{
  "ticker": "EOG",
  "cik": "0000821189",
  "company_name": "EOG RESOURCES INC",
  "filing_date": "2025-02-27",
  "accession": "0000821189-25-000011",
  "primary_doc": "eog-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1A, Risk Factors, and the related discussion in ITEM 1, Business – Regulation.  EOG will continue to monitor and assess any climate change-related developments that could impact EOG and the oil and gas industry, to determine the impact on its business and operations, and take appropriate actions where necessary.\nOperations\nSeveral important developments have occurred since January 1, 2024.\nUnited States.  \nEOG's efforts to identify plays with large reserve potential have proven to be successful.  EOG continues to drill numerous wells in large acreage plays, which in the aggregate have contributed substantially to, and are expected to continue to contribute substantially to, EOG's crude oil and condensate, NGLs and natural gas production.  EOG has placed an emphasis on applying its horizontal drilling and completion expertise to unconventional crude oil and natural gas plays.\nIn 2024, EOG continued to focus on initiatives to increase its drilling, completion and operating efficiencies and improve well performance and, in turn, mitigate the inflationary pressures on its operating costs and capital expenditures experienced in prior periods. In addition, EOG continued to evaluate certain potential crude oil and condensate, NGLs and natural gas exploration and development prospects and to look for opportunities to add drilling inventory through leasehold acquisitions, farm-ins, exchanges or tactical or bolt-on acquisitions. On a volumetric basis, as calculated using a ratio of 1.0 barrel of crude oil and condensate or NGLs to 6.0 thousand cubic feet of natural gas, crude oil and condensate and NGLs production accounted for approximately 72% and 73% of EOG's United States production during 2024 and 2023, respectively. During 2024, EOG's drilling and completion activities occurred primarily in the Delaware Basin play, Eagle Ford play and Rocky Mountain area. EOG's major producing areas in the United States are in New Mexico and Texas.  See ITEM 1, Business - Exploration and Production for further discussion regarding EOG's 2024 United States operations.\nTrinidad.\n  In Trinidad, EOG continues to deliver natural gas under existing supply contracts.  Several fields in the South East Coast Consortium (SECC) Block, Modified U(a) Block, Block 4(a) and Banyan and Sercan Areas have been developed and are producing natural gas which is sold to the National Gas Company of Trinidad and Tobago Limited and its subsidiary, and crude oil and condensate which is sold to Heritage Petroleum Company Limited.\nDuring 2024, EOG completed one net developmental well and one net exploratory well from the Osprey B platform in the Modified U(a) Block.  EOG also completed two net exploratory wells from the Oilbird platform in the SECC Block, drilled a deep Teak, Saaman and Poui (TSP Deep) exploratory well which allowed EOG to retain a 50% working interest in the TSP Deep Area and recompleted one net well in the Sercan Area.  EOG also completed construction and installation of the Mento platform in the Ska, Mento and Reggae Area and commenced pipeline and associated tie-in installations that will connect the Mento platform to the Pelican platform.  In 2024, EOG relinquished its rights to a portion of the contract area governed by the Trinidad Northern Area License located offshore the southwest coast of Trinidad and signed a farmout agreement with BP Trinidad and Tobago LLC, which allows EOG to earn a 50% working interest to develop the Coconut field in the Coconut Area located within the East Mayaro and South East Galeota exploration and production licenses.  Additionally, EOG was selected as the preferred bidder in the Lower Reverse L and North Coast Marine Area 4(a) Blocks in respect of the 2023 shallow water offshore bid round.  \n36\nOther International.\n  In February 2025, a subsidiary of EOG signed an exploration participation agreement with Bapco Energies B.S.C. (Closed) to evaluate a gas exploration project in the Kingdom of Bahrain, with drilling anticipated to commence in the second half of 2025.  The transaction, which includes a concession agreement with the Kingdom of Bahrain, is subject to further government approvals, which the parties anticipate receiving in the second half of 2025.\nIn November 2021, a subsidiary of EOG was granted an exploration permit for the WA-488-P Block, located offshore Western Australia.  The company has deferred drilling plans to further evaluate the prospect.  \nEOG continues to evaluate other select exploration, development and exploitation opportunities outside the United States, primarily by pursuing opportunities in countries where crude oil and natural gas reserves have been identified.\nCapital Structure\nOne of management's key strategies is to maintain a strong balance sheet with a consistently below average debt-to-total capitalization ratio as compared to those in EOG's peer group.  EOG's debt-to-total capitalization ratio was 14% at December 31, 2024 and 12% at December 31, 2023.  As used in this calculation, total capitalization represents the sum of total current and long-term debt and total stockholders' equity.  \nAt December 31, 2024, EOG maintained a strong financial and liquidity position, including $7.1 billion of cash and cash equivalents on hand and $1.9 billion of availability under its senior unsecured revolving credit facility (discussed below).    \nOn November 21, 2024, EOG closed on its offering of $1.0 billion aggregate principal amount of its 5.650% Senior Notes due 2054 (the Notes).  EOG received net proceeds of $985 million from the issuance of the Notes, which will be used for general corporate purposes, including (i) the repayment of the $500 million aggregate principal amount of 3.15% Senior Notes due 2025 and (ii) the funding of future capital expenditures.\nThe Internal Revenue Service previously announced tax relief related to 2024 severe weather events occurring in various Texas counties, including Harris County, where EOG's corporate offices are located.  The tax relief permitted eligible taxpayers to postpone certain tax filings and payments.  In February 2025, EOG paid approximately $700 million of such federal tax payments related to the 2024 tax year.\nDuring 2024, EOG funded $6.7 billion ($109 million of which was non-cash) in exploration and development and other property, plant and equipment expenditures (excluding asset retirement obligations), paid $2.1 billion in dividends to common stockholders and paid $3.2 billion to repurchase shares of common stock, primarily by utilizing net cash provided by its operating activities and cash on hand.\nTotal anticipated 2025 capital expenditures are estimated to range from approximately $6.0 billion to $6.4 billion, including exploration and development drilling, facilities, leasehold acquisitions, capitalized interest, dry hole costs and other property, plant and equipment and excluding property acquisitions, asset retirement costs, non-cash exchanges and transactions and exploration costs incurred as operating expenses.  The majority of 2025 expenditures will be focused on United States crude oil drilling activities.  EOG has significant flexibility with respect to financing alternatives, including borrowings under its commercial paper program, bank borrowings, borrowings under its senior unsecured revolving credit facility, joint development agreements and similar agreements and equity and debt offerings.\nManagement continues to believe EOG has one of the strongest prospect inventories in EOG's history.  When it fits EOG's strategy, EOG will make acquisitions that bolster existing drilling programs or offer incremental exploration and/or production opportunities.  \nCash Return Framework.\n  In November 2023, EOG announced an increase in its cash return commitment - specifically, a commitment, effective beginning with fiscal year 2024, to return a minimum of 70% of annual net cash provided by operating activities before certain balance sheet-related changes, less total capital expenditures, to stockholders through a combination of quarterly dividends, special dividends and share repurchases.  For discussion regarding EOG's payment of dividends and share repurchases, see",
    "item1a": "ITEM 1A, Risk Factors of this Annual Report on Form 10-K and any updates to those factors set forth in EOG's subsequent Quarterly Reports on Form 10-Q or Current Reports on Form 8-K. \nIn light of these risks, uncertainties and assumptions, the events anticipated by EOG's forward-looking statements may not occur, and, if any of such events do, we may not have anticipated the timing of their occurrence or the duration or extent of their impact on our actual results.  Accordingly, you should not place any undue reliance on any of EOG's forward-looking statements.  EOG's forward-looking statements speak only as of the date made, and EOG undertakes no obligation, other than as required by applicable law, to update or revise its forward-looking statements, whether as a result of new information, subsequent events, anticipated or unanticipated circumstances or otherwise.\n50\nITEM 7A.  \nQuantitative and Qualitative Disclosures About Market Risk\nThe information required by this Item is incorporated by reference from Item 7 of this report, specifically the information set forth under the captions \"Recent Developments,\" \"Financial Commodity and Other Derivative Transactions,\" \"Financing\" and \"Outlook\" in \"Management's Discussion and Analysis of Financial Condition and Results of Operations.\"\nITEM 8.  \nFinancial Statements and Supplementary Data\nThe information required by this Item is included in this report as set forth in the \"Index to Financial Statements\" on page F-1 and is incorporated by reference herein.\nITEM 9.  \nChanges in and\n \nDisagreements with Accountants on Accounting and Financial Disclosure\nNone.\nITEM 9A.  \nControls and Procedures\nDisclosure Controls and Procedures. \n EOG's management, with the participation of EOG's principal executive officer and principal financial officer, evaluated the effectiveness of EOG's disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) promulgated under the Securities Exchange Act of 1934, as amended (Exchange Act)) as of December 31, 2024.  EOG's disclosure controls and procedures are designed to provide reasonable assurance that information that is required to be disclosed in the reports EOG files or submits under the Exchange Act is accumulated and communicated to EOG's management, as appropriate, to allow timely decisions regarding required disclosure and is recorded, processed, summarized and reported within the time periods specified in the rules and forms of the United States Securities and Exchange Commission.  Based on that evaluation, EOG's principal executive officer and principal financial officer have concluded that EOG's disclosure controls and procedures were effective as of December 31, 2024.  \nManagement's Annual Report on Internal Control over Financial Reporting.  \nEOG's management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) promulgated under the Exchange Act).  Even an effective system of internal control over financial reporting, no matter how well designed, has inherent limitations, including the possibility of human error, circumvention of controls or overriding of controls and, therefore, can provide only reasonable assurance with respect to reliable financial reporting.  Furthermore, the effectiveness of a system of internal control over financial reporting in future periods can change as conditions change.  See \"Management's Responsibility for Financial Reporting\" appearing on page F-2 of this report, which is incorporated herein by reference.\nThe report of EOG's independent registered public accounting firm relating to the consolidated financial statements and effectiveness of internal control over financial reporting is set forth on page F-3 of this report.\nThere were no changes in EOG's internal control over financial reporting that occurred during the quarter ended December 31, 2024, that have materially affected, or are reasonably likely to materially affect, EOG's internal control over financial reporting.\nITEM 9B.  \nOther Information\nTrading Plans/Arrangements.\n  During the quarter ended December 31, 2024, no Section 16 officer of EOG, and no director of EOG, \nadopted\n or \nterminated\n any Rule 10b5-1 trading arrangement or non-Rule 10b5-1 trading arrangement (in each case, as defined in Item 408(a) of Regulation S-K).\nITEM 9C.  \nDisclosure Regarding Foreign Jurisdictions that Prevent Inspection\nNone.\n51\nPART III\nITEM 10. \n \nDirectors, Executive Officers and Corporate Governance\nInsider Trading Policies\n.  EOG has insider trading policies and procedures governing the purchase, sale and other disposition of EOG securities by EOG’s directors, officers and employees, and by EOG itself (e.g., EOG's periodic repurchases of its common stock).  EOG believes such policies and procedures are reasonably designed to promote compliance with insider trading laws, rules and regulations and the listing standards of the New York Stock Exchange (NYSE) (on which EOG's common stock is listed).\nEOG's policies and procedures, which are set forth in the EOG Resources, Inc. Code of Business Conduct and Ethics for Directors, Officers and Employees (Code of Conduct) and EOG's Insider Trading Policy, are attached as Exhibit 19 to this Annual Report on Form 10-K and incorporated herein by reference.\n_______________\nThe other information required by this Item is incorporated by reference from (i) EOG's Definitive Proxy Statement with respect to its 2025 Annual Meeting of Stockholders to be filed not later than April 30, 2025 and (ii) Item 1 of this report, specifically the information therein set forth under the caption \"Information About Our Executive Officers.\"\nPursuant to Rule 303A.10 of the NYSE and Item 406 of Regulation S-K promulgated under the Securities Exchange Act of 1934, as amended, EOG has adopted the Code of Conduct, which applies to all EOG directors, officers and employees, including EOG's principal executive officer, principal financial officer and principal accounting officer.  EOG has also adopted a Code of Ethics for Senior Financial Officers (Code of Ethics) that, along with EOG's Code of Conduct, applies to EOG's principal executive officer, principal financial officer, principal accounting officer and controllers.\nYou can access the Code of Conduct and Code of Ethics on the \"Governance\" page under \"Investors\" on EOG's website at www.eogresources.com, and any EOG stockholder who so requests may obtain a printed copy of the Code of Conduct and Code of Ethics by submitting a written request to EOG's Corporate Secretary.\nEOG intends to disclose any amendments to the Code of Conduct or Code of Ethics, and any waivers with respect to the Code of Conduct or Code of Ethics granted to EOG's principal executive officer, principal financial officer, principal accounting officer, any of our controllers or any of our other employees performing similar functions, on its website at www.eogresources.com within four business days after the amendment or waiver.  In such case, the disclosure regarding the amendment or waiver will remain available on EOG's website for at least 12 months after the initial disclosure.  There have been no waivers granted with respect to EOG's Code of Conduct or Code of Ethics.\nITEM 11.  \nExecutive Compensation\nThe information required by this Item is incorporated by reference from EOG's Definitive Proxy Statement with respect to its 2025 Annual Meeting of Stockholders to be filed not later than April 30, 2025.  The Compensation and Human Resources Committee Report and related information incorporated by reference herein shall not be deemed \"soliciting material\" or to be \"filed\" with the United States Securities and Exchange Commission, nor shall such information be incorporated by reference into any future filing under the Securities Act of 1933, as amended, or Securities Exchange Act of 1934, as amended, except to the extent that EOG specifically incorporates such information by reference into such a filing.\n52\nITEM 12.  \nSecurity Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by this Item with respect to security ownership of certain beneficial owners and management is incorporated by reference from EOG's Definitive Proxy Statement with respect to its 2025 Annual Meeting of Stockholders to be filed not later than April 30, 2025.\nEquity Compensation Plan Information\nStock Plans Approved by EOG Stockholders. \n EOG's stockholders approved the EOG Resources, Inc. 2021 Omnibus Equity Compensation Plan (2021 Plan) at the 2021 Annual Meeting of Stockholders in April 2021.  From and after the April 29, 2021 effective date of the 2021 Plan, no further grants have been (or will be) made from the Amended and Restated EOG Resources, Inc. 2008 Omnibus Equity Compensation Plan (Amended and Restated 2008 Plan).  The Amended and Restated 2008 Plan was approved by EOG's stockholders at the 2013 Annual Meeting of Stockholders in May 2013.\n \nThe 2021 Plan provides for grants of stock options, stock appreciation rights (SARs), restricted stock, restricted stock units (which may include performance-based conditions) and other stock-based awards, up to an aggregate maximum of 20 million shares of EOG common stock, plus any shares that were subject to outstanding awards under the Amended and Restated 2008 Plan as of April 29, 2021 that subsequently are canceled or forfeited, expire or are otherwise not issued or are settled in cash.  Under the 2021 Plan, grants may be made to employees and non-employee members of EOG's Board of Directors (Board).\nAt the 2018 Annual Meeting of Stockholders in April 2018, stockholders approved an amendment and restatement of the EOG Resources, Inc. Employee Stock Purchase Plan (ESPP) to (among other changes) increase the number of shares available for grant by 2.5 million shares and further extend the term of the ESPP to December 31, 2027, unless terminated earlier by its terms or by EOG.\nStock Plans Not Approved by EOG Stockholders.\n  In December 2008, the Board approved the amendment and continuation of the 1996 Deferral Plan as the \"EOG Resources, Inc. 409A Deferred Compensation Plan\" (Deferral Plan).  Under the Deferral Plan (as subsequently amended), payment of up to 50% of base salary and 100% of annual cash bonus, director's fees, vestings of restricted stock units granted to non-employee directors (and dividends credited thereon) under the Amended and Restated 2008 Plan and the 2021 Plan and 401(k) refunds (as defined in the Deferral Plan) may be deferred into a phantom stock account.  In the phantom stock account, deferrals are treated as if shares of EOG common stock were purchased at the closing stock price on the date of deferral.  Dividends are credited quarterly and treated as if reinvested in EOG common stock.  Payment of the phantom stock account is made in actual shares of EOG common stock in accordance with the Deferral Plan and the individual's deferral election.  A total of 540,000 shares of EOG common stock have been authorized by the Board and registered for issuance under the Deferral Plan.  As of December 31, 2024, 461,673 phantom shares had been issued.  The Deferral Plan is currently EOG's only stock plan that has not been approved by EOG's stockholders.\n53\nThe following table sets forth data for EOG's equity compensation plans aggregated by the various plans approved by EOG's stockholders and those plans not approved by EOG's stockholders, in each case as of December 31, 2024.\n \n \n \n \n \n \nPlan Category\n(a)\nNumber of Securities to be\nIssued Upon Exercise of\nOutstanding Options,\nWarrants and Rights\n \n(b)\nWeighted-Average\nExercise Price of\nOutstanding Options,\nWarrants and Rights \n(1)\n(c)\nNumber of Securities\nRemaining Available\nfor Future Issuance Under\nEquity Compensation\nPlans (Excluding Securities\nReflected in Column (a))\n \nEquity Compensation Plans Approved by EOG Stockholders\n2,642,192 \n(2)\n$\n79.93 \n14,413,459 \n(3)\nEquity Compensation Plans Not Approved by EOG Stockholders\n358,846 \n(4)\nN/A\n78,327 \n(5)\nTotal\n3,001,038\n \n \n14,491,786\n \n \n(1)\nThe weighted-average exercise price is calculated based solely on the exercise prices of the outstanding stock option and SAR grants and does not reflect (i) shares that will be issued upon the vesting of outstanding grants of restricted stock units or the vesting of outstanding grants of performance units and restricted stock units with performance-based conditions (collectively, performance units) or (ii) shares that will be issued in respect of issued and outstanding Deferral Plan phantom shares, all of which have no exercise price.\n(2)\nAmount includes (i) 1,427,293 outstanding stock option and SAR grants, (ii) 655,656 outstanding restricted stock units, for which shares of EOG common stock will be issued, on a one-for-one basis, upon the vesting of such grants, and (iii) 559,243 outstanding performance units and assumes, for purposes of this table, (A) the application of a 100% performance multiple upon the completion of each of the remaining performance periods in respect of such grants and (B) accordingly, the issuance, on a one-for-one basis, of an aggregate 559,243 shares of EOG common stock upon the vesting of such grants.  As more fully discussed in Note 7 to Consolidated Financial Statements, upon the application of the relevant performance multiple at the completion of each of the remaining performance periods in respect of such grants, (A) a minimum of 0 and a maximum of 1,118,486 performance units could be outstanding and (B) accordingly, a minimum of 0 and a maximum of 1,118,486 shares of EOG common stock could be issued upon the vesting of such grants.\n(3)\nConsists of (i) 13,419,099 shares remaining available for issuance under the 2021 Plan and (ii) 994,360 shares remaining available for purchase under the ESPP.  As noted above, from and after the April 29, 2021 effective date of the 2021 Plan, no further grants have been (or will be) made from the Amended and Restated 2008 Plan.\n(4)\nConsists of shares of EOG common stock to be issued in accordance with the Deferral Plan and participant deferral elections (i.e., in respect of the 358,846 phantom shares issued and outstanding under the Deferral Plan as of December 31, 2024).  \n(5)\nRepresents phantom shares that remain available for issuance under the Deferral Plan.\nITEM 13.  \nCertain Relationships and Related Transactions, and Director Independence\nThe information required by this Item is incorporated by reference from EOG's Definitive Proxy Statement with respect to its 2025 Annual Meeting of Stockholders to be filed not later than April 30, 2025.\nITEM 14.  \nPrincipal Accountant Fees and Services\nThe information required by this Item is incorporated by reference from EOG's Definitive Proxy Statement with respect to its 2025 Annual Meeting of Stockholders to be filed not later than April 30, 2025.\n54\nPART IV\nITEM 15.  \nExhibit and Financial Statement Schedules\n(a)(1) and (a)(2) Financial Statements and Financial Statement Schedule\nSee \"Index to Financial Statements\" set forth on page F-1.\n(a)(3), (b)\n      \nExhibits\nSee pages E-1 through E-6 for a listing of the exhibits.\nITEM 16.  \nForm 10-K Summary\nNone.\n55\nEOG RESOURCES, INC.\nINDEX TO FINANCIAL STATEMENTS\n \nPage\nConsolidated Financial Statements:\n \nManagement's Responsibility for Financial Reporting\nF-\n2\nReport of Independent Registered Public Accounting Firm (PCAOB ID No. \n34\n)\nF-\n3\nConsolidated Statements of Income and Comprehensive Income for Each of the Three Years in the Period Ended December 31, 2024\nF-\n5\nConsolidated Balance Sheets - December 31, 2024 and 2023\nF-\n6\nConsolidated Statements of Stockholders' Equity for Each of the Three Years in the Period Ended December 31, 2024\nF-\n7\nConsolidated Statements of Cash Flows for Each of the Three Years in the Period Ended December 31, 2024\nF-\n8\nNotes to Consolidated Financial Statements\nF-\n9\nSupplemental Information to Consolidated Financial Statements\nF-\n34\nF-1\nMANAGEMENT'S RESPONSIBILITY FOR FINANCIAL REPORTING\nThe following consolidated financial statements of EOG Resources, Inc., together with its subsidiaries (collectively, EOG), were prepared by management, which is responsible for the integrity, objectivity and fair presentation of such financial statements.  The statements have been prepared in conformity with generally accepted accounting principles in the United States of America and, accordingly, include some amounts that are based on the best estimates and judgments of management.\nEOG's management is also responsible for establishing and maintaining adequate internal control over financial reporting as well as designing and implementing programs and controls to prevent and detect fraud.  The system of internal control of EOG is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles in the United States of America.  This system consists of 1) entity level controls, including written policies and guidelines relating to the ethical conduct of business affairs, 2) general computer controls and 3) process controls over initiating, authorizing, recording, processing and reporting transactions.  Even an effective internal control system, no matter how well designed, has inherent limitations, including the possibility of human error, circumvention of controls or overriding of controls and, therefore, can provide only reasonable assurance with respect to reliable financial reporting.  Furthermore, the effectiveness of a system of internal control over financial reporting in future periods can change as conditions change.\nThe adequacy of EOG's financial controls and the accounting principles employed by EOG in its financial reporting are under the general oversight of the Audit Committee of the Board of Directors.  No member of this committee is an officer or employee of EOG.  Moreover, EOG's independent registered public accounting firm and internal auditors have full, free, separate and direct access to the Audit Committee and meet with the committee periodically to discuss accounting, auditing and financial reporting matters.\nEOG's management assessed the effectiveness of EOG's internal control over financial reporting as of December 31, 2024.  In making this assessment, EOG used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in \nInternal Control - Integrated Framework (2013)\n.  These criteria cover the control environment, risk assessment process, control activities, information and communication systems, and monitoring activities.  Based on this assessment and those criteria, management believes that EOG maintained effective internal control over financial reporting as of December 31, 2024.\nDeloitte & Touche LLP, independent registered public accounting firm, was engaged to audit the consolidated financial statements of EOG and audit EOG's internal control over financial reporting and issue a report thereon.  In the conduct of the audits, Deloitte & Touche LLP was given unrestricted access to all financial records and related data, including all minutes of meetings of stockholders, the Board of Directors and committees of the Board of Directors.  Management believes that all representations made to Deloitte & Touche LLP during the audits were valid and appropriate.  Their audits were made in accordance with the standards of the Public Company Accounting Oversight Board (United States).  Their report appears on page F-3.\nEZRA Y. YACOB\n \nANN D. JANSSEN\nChairman of the Board and Chief Executive Officer\nExecutive Vice President and Chief Financial Officer\n \n \n \nHouston, Texas\n \n \nFebruary 27, 2025\n \n \nF-2\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the stockholders and the Board of Directors of EOG Resources, Inc. \nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of EOG Resources, Inc. and subsidiaries (the \"Company\") as of December 31, 2024 and 2023, the related consolidated statements of income and comprehensive income, stockholders' equity, and cash flows, for each of the three years in the period ended December 31, 2024, and the related notes (collectively referred to as the \"financial statements\"). We also have audited the Company’s internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control — Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the financial statements referred to above present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with accounting principles generally accepted in the United States of America. Also, in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control — Integrated Framework (2013)\n issued by COSO.\nBasis for Opinions\nThe Company’s management is responsible for these financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying \nManagement’s Responsibility for Financial Reporting\n. Our responsibility is to express an opinion on these financial statements and an opinion on the Company’s internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the financial statements included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures to respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nF-3\nCritical Audit Matter \nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nProved Oil and Gas Properties and Depletion — Crude Oil, NGL and Natural Gas Reserves — Refer to Note 1 to the Financial Statements\nCritical Audit Matter Description\nThe Company’s proved oil and gas properties are depleted using the units of production method based on estimated proved crude oil, natural gas liquids (NGLs), and natural gas reserves (proved reserves). The development of the Company’s estimated proved reserves volumes requires management to make significant estimates including the Company’s ability to convert proved undeveloped reserves to producing properties within five years of their initial reporting to the Securities and Exchange Commission. The Company’s reserve engineers estimate proved reserves quantities using these estimates along with estimates and assumptions related to engineering data. Changes in these estimates and assumptions could materially affect the estimated quantities of the Company’s proved reserves, which in turn could have a significant impact on the amount of depletion expense. The proved oil and gas properties balance, net was $26.2 billion as of December 31, 2024, and depletion expense was $3.8 billion for the year then ended.\nGiven the significant judgments made by management, performing audit procedures to evaluate the Company’s estimated proved reserve quantities, including management’s estimates and assumptions related to converting proved undeveloped reserves to producing properties within five years, required a high degree of auditor judgment and an increased extent of effort.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to management’s significant judgments and assumptions related to proved reserve quantities and converting proved undeveloped reserves to producing properties within five years included the following, among others:\n•\nWe tested the design, implementation, and operating effectiveness of controls related to the Company’s estimation of proved reserves, including controls relating to the five-year development plan.\n•\nWe evaluated the Company’s estimated proved reserves and reasonableness of management’s five-year development plan by:\n◦\nComparing the Company’s estimated future production to historical production volumes\n◦\nAssessing the reasonableness of the production volume decline curves by comparing to historical decline curve estimates\n◦\nComparing the forecasts for proved undeveloped reserves to producing properties to evaluate historical conversion rates\n◦\nComparing the conversion plan for proved undeveloped reserves to the Company’s drill plan and the availability of capital relative to the drill plan\n◦\nReviewing internal communications to management and the Board of Directors\n◦\nComparing the forecasts to information included in Company press releases as well as in analyst and industry reports for the Company and certain of its peer companies\n◦\nComparing the Company’s proved reserve volumes to those independently developed by management’s expert, an independent reserve engineering firm\n•\nWe evaluated the experience, qualifications and objectivity of management’s expert, an independent reserve engineering firm, including the methodologies used to independently audit the proved reserve quantities of the Company.\n/s/ \nDELOITTE & TOUCHE LLP\nHouston, Texas\nFebruary 27, 2025\nWe have served as the Company's auditor since 2002.\nF-4\nEOG RESOURCES, INC.\nCONSOLIDATED STATEMENTS OF INCOME AND COMPREHENSIVE INCOME\n(In Millions, Except Per Share Data)\nYear Ended December 31\n2024\n2023\n2022\nOperating Revenues and Other\nCrude Oil and Condensate\n$\n13,921\n \n$\n13,748\n \n$\n16,367\n \nNatural Gas Liquids\n2,106\n \n1,884\n \n2,648\n \nNatural Gas\n1,551\n \n1,744\n \n3,781\n \nGains (Losses) on Mark-to-Market Financial Commodity and Other Derivative Contracts, Net\n204\n \n818\n \n(\n3,982\n)\nGathering, Processing and Marketing\n5,800\n \n5,806\n \n6,696\n \nGains on Asset Dispositions, Net\n16\n \n95\n \n74\n \nOther, Net\n100\n \n91\n \n118\n \nTotal\n23,698\n \n24,186\n \n25,702\n \nOperating Expenses\n \n \n \nLease and Well\n1,572\n \n1,454\n \n1,331\n \nGathering, Processing and Transportation Costs\n1,722\n \n1,620\n \n1,587\n \nExploration Costs\n174\n \n181\n \n159\n \nDry Hole Costs\n14\n \n1\n \n45\n \nImpairments\n391\n \n202\n \n382\n \nMarketing Costs\n5,717\n \n5,709\n \n6,535\n \nDepreciation, Depletion and Amortization\n4,108\n \n3,492\n \n3,542\n \nGeneral and Administrative\n669\n \n640\n \n570\n \nTaxes Other Than Income\n1,249\n \n1,284\n \n1,585\n \nTotal\n15,616\n \n14,583\n \n15,736\n \nOperating Income\n8,082\n \n9,603\n \n9,966\n \nOther Income, Net\n274\n \n234\n \n114\n \nIncome Before Interest Expense and Income Taxes\n8,356\n \n9,837\n \n10,080\n \nInterest Expense\n \n \n \nIncurred\n183\n \n181\n \n215\n \nCapitalized\n(\n45\n)\n(\n33\n)\n(\n36\n)\nInterest Expense, Net\n138\n \n148\n \n179\n \nIncome Before Income Taxes\n8,218\n \n9,689\n \n9,901\n \nIncome Tax Provision\n1,815\n \n2,095\n \n2,142\n \nNet Income\n$\n6,403\n \n$\n7,594\n \n$\n7,759\n \nNet Income Per Share\n \n \n \nBasic\n$\n11.31\n \n$\n13.07\n \n$\n13.31\n \nDiluted\n$\n11.25\n \n$\n13.00\n \n$\n13.22\n \nAverage Number of Common Shares\n \n \n \nBasic\n566\n \n581\n \n583\n \nDiluted\n569\n \n584\n \n587\n \nComprehensive Income\n \n \n \nNet Income\n$\n6,403\n \n$\n7,594\n \n$\n7,759\n \nOther Comprehensive Income (Loss)\n \n \n \nForeign Currency Translation Adjustments\n4\n \n(\n1\n)\n4\n \nDeferred Postretirement Plan\n1\n \n—\n \n—\n \nOther Comprehensive Income (Loss)\n5\n \n(\n1\n)\n4\n \nComprehensive Income\n$\n6,408\n \n$\n7,593\n \n$\n7,763\n \nThe accompanying notes are an integral part of these consolidated financial statements.\nF-5\nEOG RESOURCES, INC.\nCONSOLIDATED BALANCE SHEETS\n(In Millions, Except Share Data)\nAt December 31\n2024\n2023\nASSETS\nCurrent Assets\nCash and Cash Equivalents\n$\n7,092\n \n$\n5,278\n \nAccounts Receivable, Net\n2,650\n \n2,716\n \nInventories\n985\n \n1,275\n \nAssets from Price Risk Management Activities\n—\n \n106\n \nOther\n503\n \n560\n \nTotal\n11,230\n \n9,935\n \nProperty, Plant and Equipment\n \n \nOil and Gas Properties (Successful Efforts Method)\n77,091\n \n72,090\n \nOther Property, Plant and Equipment\n6,418\n \n5,497\n \nTotal Property, Plant and Equipment\n83,509\n \n77,587\n \nLess: Accumulated Depreciation, Depletion and Amortization\n(\n49,297\n)\n(\n45,290\n)\nTotal Property, Plant and Equipment, Net\n34,212\n \n32,297\n \nDeferred Income Taxes\n39\n \n42\n \nOther Assets\n1,705\n \n1,583\n \nTotal Assets\n$\n47,186\n \n$\n43,857\n \nLIABILITIES AND STOCKHOLDERS' EQUITY\nCurrent Liabilities\n \n \nAccounts Payable\n$\n2,464\n \n$\n2,437\n \nAccrued Taxes Payable\n1,007\n \n466\n \nDividends Payable\n539\n \n526\n \nLiabilities from Price Risk Management Activities\n116\n \n—\n \nCurrent Portion of Long-Term Debt\n532\n \n34\n \nCurrent Portion of Operating Lease Liabilities\n315\n \n325\n \nOther\n381\n \n286\n \nTotal\n5,354\n \n4,074\n \nLong-Term Debt\n4,220\n \n3,765\n \nOther Liabilities\n2,395\n \n2,526\n \nDeferred Income Taxes\n5,866\n \n5,402\n \nCommitments and Contingencies (Note 8)\nStockholders' Equity\n \n \nCommon Stock, $\n0.01\n Par, \n1,280,000,000\n Shares Authorized and \n588,939,584\n Shares and \n588,748,473\n Shares Issued at December 31, 2024 and 2023, respectively\n206\n \n206\n \nAdditional Paid in Capital\n6,090\n \n6,166\n \nAccumulated Other Comprehensive Loss\n(\n4\n)\n(\n9\n)\nRetained Earnings\n26,941\n \n22,634\n \nCommon Stock Held in Treasury, \n31,731,107\n Shares and \n7,888,105\n Shares at December 31, 2024 and 2023, respectively\n(\n3,882\n)\n(\n907\n)\nTotal Stockholders' Equity\n29,351\n \n28,090\n \nTotal Liabilities and Stockholders' Equity\n$\n47,186\n \n$\n43,857\n \nThe accompanying notes are an integral part of these consolidated financial statements.\nF-6\nEOG RESOURCES, INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS' EQUITY\n(In Millions, Except Per Share Data)\n \nCommon\nStock\nAdditional\nPaid In\nCapital\nAccumulated\nOther\nComprehensive\nLoss\nRetained\nEarnings\nCommon\nStock\nHeld In\nTreasury\nTotal\nStockholders'\nEquity\nBalance at December 31, 2021\n$\n206\n \n$\n6,087\n \n$\n(\n12\n)\n$\n15,919\n \n$\n(\n20\n)\n$\n22,180\n \nNet Income\n— \n— \n— \n7,759\n \n— \n7,759\n \nCommon Stock Issued Under Stock Plans\n— \n24\n \n— \n— \n— \n24\n \nCommon Stock Dividends Declared, $\n8.875\n Per Share\n— \n— \n— \n(\n5,206\n)\n— \n(\n5,206\n)\nOther Comprehensive Income\n— \n— \n4\n \n— \n— \n4\n \nChange in Treasury Stock - Stock Compensation Plans, Net\n— \n(\n55\n)\n— \n— \n(\n61\n)\n(\n116\n)\nRestricted Stock and Restricted Stock Units, Net\n— \n(\n2\n)\n— \n— \n2\n \n—\n \nStock-Based Compensation Expenses\n— \n133\n \n— \n— \n— \n133\n \nTreasury Stock Issued as Compensation\n— \n— \n— \n— \n1\n \n1\n \nBalance at December 31, 2022\n206\n \n6,187\n \n(\n8\n)\n18,472\n \n(\n78\n)\n24,779\n \nNet Income\n— \n— \n— \n7,594\n \n— \n7,594\n \nCommon Stock Dividends Declared, $\n5.885\n Per Share\n— \n— \n— \n(\n3,432\n)\n— \n(\n3,432\n)\nOther Comprehensive Loss\n— \n— \n(\n1\n)\n— \n— \n(\n1\n)\nTreasury Stock Repurchased\n— \n— \n— \n— \n(\n979\n)\n(\n979\n)\nChange in Treasury Stock - Stock Compensation Plans, Net\n— \n(\n36\n)\n— \n— \n(\n12\n)\n(\n48\n)\nRestricted Stock and Restricted Stock Units, Net\n— \n(\n162\n)\n— \n— \n162\n \n—\n \nStock-Based Compensation Expenses\n— \n177\n \n— \n— \n— \n177\n \nBalance at December 31, 2023\n206\n \n6,166\n \n(\n9\n)\n22,634\n \n(\n907\n)\n28,090\n \nNet Income\n— \n— \n— \n6,403\n \n— \n6,403\n \nCommon Stock Dividends Declared, $\n3.705\n Per Share\n— \n— \n— \n(\n2,096\n)\n— \n(\n2,096\n)\nOther Comprehensive Income\n— \n— \n5\n \n— \n— \n5\n \nTreasury Stock Repurchased\n— \n— \n— \n— \n(\n3,209\n)\n(\n3,209\n)\nChange in Treasury Stock - Stock Compensation Plans, Net\n— \n(\n43\n)\n— \n— \n2\n \n(\n41\n)\nRestricted Stock and Restricted Stock Units, Net\n— \n(\n232\n)\n— \n— \n232\n \n—\n \nStock-Based Compensation Expenses\n— \n199\n \n— \n— \n— \n199\n \nBalance at December 31, 2024\n$\n206\n \n$\n6,090\n \n$\n(\n4\n)\n$\n26,941\n \n$\n(\n3,882\n)\n$\n29,351\n \nThe accompanying notes are an integral part of these consolidated financial statements.\nF-7\nEOG RESOURCES, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(In Millions)\nYear Ended December 31\n2024\n2023\n2022\nCash Flows from Operating Activities\nReconciliation of Net Income to Net Cash Provided by Operating Activities:\nNet Income\n$\n6,403\n \n$\n7,594\n \n$\n7,759\n \nItems Not Requiring (Providing) Cash\n \n \n \nDepreciation, Depletion and Amortization\n4,108\n \n3,492\n \n3,542\n \nImpairments\n391\n \n202\n \n382\n \nStock-Based Compensation Expenses\n199\n \n177\n \n133\n \nDeferred Income Taxes\n467\n \n683\n \n(\n61\n)\nGains on Asset Dispositions, Net\n(\n16\n)\n(\n95\n)\n(\n74\n)\nOther, Net\n17\n \n27\n \n—\n \nDry Hole Costs\n14\n \n1\n \n45\n \nMark-to-Market Financial Commodity and Other Derivative Contracts\n \n \n \n(Gains) Losses, Net\n(\n204\n)\n(\n818\n)\n3,982\n \nNet Cash Received from (Payments for) Settlements of Financial Commodity Derivative Contracts\n214\n \n(\n112\n)\n(\n3,501\n)\nOther, Net\n—\n \n(\n2\n)\n45\n \nChanges in Components of Working Capital and Other Assets and Liabilities\n \n \n \nAccounts Receivable\n101\n \n(\n38\n)\n(\n347\n)\nInventories\n259\n \n(\n231\n)\n(\n534\n)\nAccounts Payable\n(\n36\n)\n(\n119\n)\n90\n \nAccrued Taxes Payable\n541\n \n61\n \n(\n113\n)\nOther Assets\n44\n \n39\n \n(\n364\n)\nOther Liabilities\n23\n \n184\n \n(\n266\n)\nChanges in Components of Working Capital Associated with Investing Activities\n(\n382\n)\n295\n \n375\n \nNet Cash Provided by Operating Activities\n12,143\n \n11,340\n \n11,093\n \nInvesting Cash Flows\n \n \n \nAdditions to Oil and Gas Properties\n(\n5,353\n)\n(\n5,385\n)\n(\n4,619\n)\nAdditions to Other Property, Plant and Equipment\n(\n1,019\n)\n(\n800\n)\n(\n381\n)\nProceeds from Sales of Assets\n23\n \n140\n \n349\n \nOther Investing Activities\n—\n \n—\n \n(\n30\n)\nChanges in Components of Working Capital Associated with Investing Activities\n382\n \n(\n295\n)\n(\n375\n)\nNet Cash Used in Investing Activities\n(\n5,967\n)\n(\n6,340\n)\n(\n5,056\n)\nFinancing Cash Flows\n \n \n \nLong-Term Debt Borrowings\n985\n \n—\n \n—\n \nLong-Term Debt Repayments\n—\n \n(\n1,250\n)\n—\n \nDividends Paid\n(\n2,087\n)\n(\n3,386\n)\n(\n5,148\n)\nTreasury Stock Purchased\n(\n3,246\n)\n(\n1,038\n)\n(\n118\n)\nProceeds from Stock Options Exercised and Employee Stock Purchase Plan\n22\n \n20\n \n28\n \nDebt Issuance Costs\n(\n2\n)\n(\n8\n)\n—\n \nRepayment of Finance Lease Liabilities\n(\n33\n)\n(\n32\n)\n(\n35\n)\nNet Cash Used in Financing Activities\n(\n4,361\n)\n(\n5,694\n)\n(\n5,273\n)\nEffect of Exchange Rate Changes on Cash\n(\n1\n)\n—\n \n(\n1\n)\nIncrease (Decrease) in Cash and Cash Equivalents\n1,814\n \n(\n694\n)\n763\n \nCash and Cash Equivalents at Beginning of Year\n5,278\n \n5,972\n \n5,209\n \nCash and Cash Equivalents at End of Year\n$\n7,092\n \n$\n5,278\n \n$\n5,972\n \nThe accompanying notes are an integral part of these consolidated financial statements.\nF-8\nEOG RESOURCES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1.  \nSummary of Significant Accounting Policies\nNature of Business.  \nEOG Resources, Inc., a Delaware corporation organized in 1985, together with its subsidiaries (collectively, EOG), explores for, develops, produces and markets crude oil, natural gas liquids (NGLs) and natural gas primarily in major producing basins in the United States of America (United States or U.S.) and the Republic of Trinidad and Tobago (Trinidad).  EOG is evaluating additional exploration, development and exploitation opportunities in other select international areas.  In addition, EOG is executing an abandonment and reclamation program in Canada.  EOG completed the exit of Block 36 and Block 49 located in the Sultanate of Oman (Oman) in 2023.   \nPrinciples of Consolidation.  \nThe consolidated financial statements of EOG include the accounts of all domestic and foreign subsidiaries.  Any investments in unconsolidated affiliates, in which EOG is able to exercise significant influence, are accounted for using the equity method.  All intercompany accounts and transactions have been eliminated.\nThe preparation of financial statements in conformity with accounting principles generally accepted in the U.S. (U.S. GAAP) requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period.  Actual results could differ from those estimates.\nFinancial Instruments.  \nEOG's financial instruments consist of cash and cash equivalents, financial commodity and other derivative contracts, accounts receivable, accounts payable and current and long-term debt.  The carrying values of cash and cash equivalents, financial commodity and other derivative contracts, accounts receivable and accounts payable approximate fair value.  See Notes 2, 12 and 13.\nCash and Cash Equivalents.  \n EOG records as cash equivalents all highly liquid short-term investments with original maturities of three months or less.\nOil and Gas Operations.  \nEOG accounts for its crude oil and natural gas exploration and production activities under the successful efforts method of accounting.\nOil and gas lease acquisition costs are capitalized when incurred.  Unproved properties with acquisition costs that are not individually significant are aggregated, and the portion of such costs estimated to be nonproductive is amortized over the remaining lease term.  Unproved properties with individually significant acquisition costs are reviewed individually for impairment.  If the unproved properties are determined to be productive, the appropriate related costs are transferred to proved oil and gas properties.  \nOil and gas exploration costs, other than the costs of drilling exploratory wells, are expensed as incurred.  The costs of drilling exploratory wells are capitalized pending determination of whether EOG has discovered commercial quantities of proved reserves.  If commercial quantities of proved reserves are not discovered, such drilling costs are expensed.  In some circumstances, it may be uncertain whether commercial quantities of proved reserves have been discovered when drilling has been completed.  Such exploratory well drilling costs may continue to be capitalized if the estimated reserve quantity is sufficient to justify its completion as a producing well and sufficient progress in assessing the reserves and the economic and operating viability of the project is being made.  The capitalized exploratory well costs that have been capitalized for a period of one year or greater were $\n0\n million, $\n3\n million and $\n0 million\n as of December 31, 2024, 2023 and 2022, respectively.  In 2023, such costs related to \ntwo\n projects in the United States.  Costs to develop proved reserves, including the costs of all development wells and related equipment used in the production of crude oil and natural gas, are capitalized.  \nF-9\nDepreciation, depletion and amortization of the cost of proved oil and gas properties is calculated using the unit-of-production method.  The reserve base used to calculate depreciation, depletion and amortization for leasehold acquisition costs and the cost to acquire proved properties is the sum of proved developed reserves and proved undeveloped reserves.  With respect to lease and well equipment costs, which include development costs and successful exploration drilling costs, the reserve base used includes only proved developed reserves.  Estimated future dismantlement, restoration and abandonment costs, net of salvage values, are taken into account.\nOil and gas properties are grouped in accordance with the provisions of the Extractive Industries - Oil and Gas Topic of the Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC).  The basis for grouping is a reasonable aggregation of properties with a common geological structural feature or stratigraphic condition, such as a reservoir or field.\nAmortization rates are updated quarterly to reflect: 1) the addition of capital expenditures, 2) reserve revisions (upwards or downwards) and additions, 3) property acquisitions and/or property dispositions and 4) impairments.\nWhen circumstances indicate that proved oil and gas properties may be impaired, EOG compares expected undiscounted future cash flows at a depreciation, depletion and amortization group level to the unamortized capitalized cost of the group.  If the expected undiscounted future cash flows, based on EOG's estimate of (and assumptions regarding) future crude oil, NGLs and natural gas prices, operating costs, development expenditures, anticipated production from proved reserves and other relevant data (all Level 3 inputs as defined by the FASB's Fair Value Measurement Topic of the ASC (ASC 820)), are lower than the unamortized capitalized cost, the capitalized cost is reduced to fair value.  Fair value is generally calculated using the Income Approach described in ASC 820.  In certain instances, EOG utilizes accepted offers from third-party purchasers as the basis for determining fair value.\nOther Property, Plant and Equipment\n.  Other property, plant and equipment consists of gathering and processing assets, compressors, carbon capture and storage assets, buildings and leasehold improvements, computer hardware and software, vehicles, and furniture and fixtures.  Other property, plant and equipment is generally depreciated on a straight-line basis over the estimated useful lives of the property, plant and equipment, which range from \n3\n years to \n45\n years.\nInventories.\n  Inventories consist primarily of tubular goods, materials for completion operations, well equipment and gathering lines held for use in the exploration for, and development and production of, crude oil, NGLs and natural gas reserves.  EOG accounts for inventories at the lower of cost and net realizable value with adjustments made, as appropriate, to recognize any reductions in value.\nRevenue Recognition.  \nEOG presents disaggregated revenues by type of commodity within its Consolidated Statements of Income and Comprehensive Income and by geographic areas defined as operating segments. See Note 11.\nRevenues are recognized for the sale of crude oil and condensate, NGLs and natural gas at the point control of the product is transferred to the customer, typically when production is delivered and title or risk of loss transfers to the customer.  Arrangements for such sales are evidenced by signed contracts with prices typically based on stated market indices, with certain adjustments for product quality and geographic location.  As EOG transfers control of the product shortly after production and after performance obligations have been fulfilled, contract assets and contract liabilities are not recognized.  The balances of accounts receivable from contracts with customers as of December 31, 2024 and 2023, were $\n2,184\n million and $\n2,237\n million, respectively, and are included in Accounts Receivable, Net on the Consolidated Balance Sheets.  Losses incurred on receivables from contracts with customers are infrequent and have been immaterial.  Certain arrangements provide for the sale of fixed quantities of commodities in future years with pricing mechanisms based on future market prices of the commodity at time of delivery.  EOG does not disclose the value of these obligations given the uncertainty of the future realized transaction price.\nCrude Oil and Condensate.  EOG sells its crude oil and condensate production at the wellhead or further downstream at a contractually-specified delivery point.  Revenue is recognized when control transfers to the customer based on contract terms which reflect prevailing market prices.  Any costs incurred prior to the transfer of control, such as gathering and transportation, are recognized as Gathering, Processing and Transportation Costs.\nF-10\nNatural Gas Liquids.  EOG delivers certain of its natural gas production to either EOG-owned processing facilities or third-party processing facilities, where extraction of NGLs occurs.  For EOG-owned facilities, revenue is recognized after processing upon transfer of NGLs to the customer.  For third-party facilities, extracted NGLs are sold to the owner of the processing facility at the tailgate, or EOG takes possession and sells the extracted NGLs at the tailgate or exercises its option to sell further downstream to various customers.  Under typical arrangements for third-party facilities, revenue is recognized after processing upon the transfer of control of the NGLs to the customer, either at the tailgate of the processing plant or further downstream.  EOG recognizes revenues based on contract terms which reflect prevailing market prices, with any costs incurred prior to the transfer of control, such as processing, transportation and fractionation fees, recognized as Gathering, Processing and Transportation Costs.\nNatural Gas.  EOG sells its natural gas production either at the wellhead or further downstream at a contractually-specified delivery point.  In connection with the extraction of NGLs, EOG sells residue gas under separate agreements.  Typically, EOG takes possession of the natural gas at the tailgate of the processing facility and sells it at the tailgate or further downstream.  In each case, EOG recognizes revenues when control transfers to the customer, based on contract terms which reflect prevailing market prices.\nGathering, Processing and Marketing.  Gathering, processing and marketing revenues represent sales of third-party crude oil and condensate, NGLs and natural gas, as well as fees associated with gathering and processing third-party natural gas and revenues from sales of EOG-owned sand.  EOG evaluates whether it is the principal or agent under these transactions.  As control of the underlying commodity is transferred to EOG prior to the gathering, processing and marketing activities, EOG considers itself the principal of these arrangements.  Accordingly, EOG recognizes these transactions on a gross basis.  Purchases of third-party commodities are recorded as Marketing Costs, with sales of third-party commodities and fees received for gathering and processing recorded as Gathering, Processing and Marketing revenues.\nCapitalized Interest Costs.  \nInterest costs have been capitalized as a part of the historical cost of unproved oil and gas properties.  The amount capitalized is an allocation of the interest cost incurred during the reporting period.  Capitalized interest is computed only during the exploration and development phases and ceases once production begins.  The interest rate used for capitalization purposes is based on the interest rates on EOG's outstanding borrowings.\n \nAccounting for Risk Management Activities.  \nFinancial commodity and other derivative instruments are recorded on the balance sheet as either an asset or liability measured at fair value, and changes in the instrument's fair value are recognized currently in earnings unless specific hedge accounting criteria are met.  During the three-year period ended December 31, 2024, EOG elected not to designate any of its financial commodity and other derivative instruments as accounting hedges and, accordingly, changes in the fair value of these outstanding derivative instruments are recognized as gains or losses in the period of change.  The gains or losses are recorded as Gains (Losses) on Mark-to-Market Financial Commodity and Other Derivative Contracts on the Consolidated Statements of Income and Comprehensive Income.  The related cash flow impact of settled contracts is reflected as cash flows from operating activities.  EOG employs net presentation of financial commodity and other derivative assets and liabilities for financial reporting purposes when such assets and liabilities are with the same counterparty and subject to a master netting arrangement.  See Note 12.\nIncome Taxes.  \nIncome taxes are accounted for using the asset and liability approach.  Under this approach, deferred tax assets and liabilities are recognized based on anticipated future tax consequences attributable to differences between financial statement carrying amounts of assets and liabilities and their respective tax basis.  EOG assesses the realizability of deferred tax assets and recognizes valuation allowances as appropriate.  See Note 6.\nForeign Currency Translation.  \nThe United States dollar is the functional currency for all of EOG's consolidated subsidiaries except for its Canadian subsidiaries, for which the functional currency is the Canadian dollar.  For its Canadian subsidiaries, asset and liability accounts are translated at year-end exchange rates and revenues and expenses are translated at average exchange rates prevailing during the year.  Translation adjustments are included in Accumulated Other Comprehensive Loss on the Consolidated Balance Sheets.  Any gains or losses on transactions or monetary assets or liabilities in currencies other than the functional currency are included in net income in the current period.  See Note 4.\nNet Income Per Share.  \nBasic net income per share is computed on the basis of the weighted-average number of common shares outstanding during the period.  Diluted net income per share is computed based upon the weighted-average number of common shares outstanding during the period plus the assumed issuance of common shares for all potentially dilutive securities.  See Note 9.\nStock-Based Compensation\n.  EOG measures the cost of employee services received in exchange for an award of equity instruments based on the grant-date fair value of the award.  See Note 7.\nF-11\nLeases.\n  In the ordinary course of business, EOG enters into contracts for drilling, fracturing, compression, real estate and other services which contain equipment and other assets and that meet the definition of a lease under ASC \"Leases (Topic 842).\"  The lease term for these contracts, which includes the noncancellable period of the lease plus any renewals at EOG's option that are reasonably certain to be exercised, ranges from \none month\n to \n30\n years.  \nRight of use (ROU) assets and related liabilities are recognized on the commencement date on the Consolidated Balance Sheets based on future lease payments, discounted based on the rate implicit in the contract, if readily determinable, or EOG's incremental borrowing rate commensurate with the lease term of the contract.  EOG estimates its incremental borrowing rate based on the approximate rate required to borrow on a collateralized basis.  Contracts with lease terms of 12 months or less are not recorded on the Consolidated Balance Sheets, but instead are disclosed as short-term lease cost.  EOG has elected not to separate non-lease components for most asset classes, except for those asset classes where the non-lease (i.e., service) components comprise a material amount of the minimum lease payments.  See Note 17.\nSegment Reporting.\n  Effective January 1, 2024, EOG adopted the provisions of Accounting Standards Update (ASU) 2023-07 \"Segment Reporting (Topic 820),\" which updates reportable segment disclosure requirements, primarily through enhanced disclosures about significant segment expenses.\nChange in Presentation.\n  Effective January 1, 2024, EOG combined Transportation Costs and Gathering and Processing Costs into one line item titled Gathering, Processing and Transportation Costs within the Consolidated Statements of Income and Comprehensive Income.  This presentation has been conformed for all periods presented and had no impact on previously reported Net Income.\nRecently Issued Accounting Standards.  \nIn October 2023, the FASB issued ASU 2023-06, \"Disclosure Improvements.\"  The ASU incorporates several disclosure and presentation requirements currently residing in SEC Regulations S-X and S-K.  The amendments will be applied prospectively and are effective when the SEC removes the related requirements from Regulations S-X or S-K (as the case may be).  Any amendments the SEC does not remove by June 30, 2027, will not be effective.  As EOG is currently subject to these SEC requirements, this ASU is not expected to have a material impact on EOG's consolidated financial statements or related disclosures.\nIn December 2023, the FASB issued ASU 2023-09, \"Income Taxes (Topic 740): Improvements to Income Tax Disclosures\" (ASU 2023-09).  ASU 2023-09 requires companies to disclose, on an annual basis, specific categories in the effective tax rate reconciliation and provide additional information for reconciling items that meet a quantitative threshold.  In addition, ASU 2023-09 requires companies to disclose additional information about income taxes paid.  The new standard is effective for annual periods beginning after December 15, 2024.  EOG will adopt ASU 2023-09 on a retrospective basis in the fourth quarter of 2025, and does not expect there to be a material impact on its consolidated financial statements; however, additional income tax disclosures may be required.\nIn March 2024, the SEC adopted final rules under SEC Release No. 33-11275, The Enhancement and Standardization of Climate-Related Disclosures for Investors.  The rules amending Regulation S-X will require public entities to provide certain climate-related information in their annual reports and registration statements.  The rules were scheduled to be effective for large accelerated filers commencing with the fiscal period beginning January 1, 2025.  In April 2024, however, the SEC voluntarily issued an administrative stay of the implementation of the rules, pending judicial review, and, in February 2025, requested the court to pause further judicial proceedings regarding the rules, pending the SEC's determination of the appropriate next steps.\nIn November 2024, the FASB issued ASU 2024-03, \"Income Statement—Reporting Comprehensive Income—Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses\" (ASU 2024-03), which requires disaggregated disclosure of income statement expenses for public business entities (PBEs).  ASU 2024-03 requires PBEs to disaggregate certain expense captions from the face of the income statement.  The ASU does not change or remove any existing expense disclosure requirements.  The ASU is effective for PBEs for fiscal years beginning after December 15, 2026 and interim periods within fiscal years beginning after December 15, 2027.  Although permitted, EOG does not intend to early adopt.  EOG is currently evaluating the impact of the standard on its financial statement disclosures.\nF-12\n2.  \nLong-Term Debt\nLong-Term Debt at December 31, 2024 and 2023 consisted of the following (in millions):\n \n2024\n2023\n3.15\n% Senior Notes due 2025\n$\n500\n \n$\n500\n \n4.15\n% Senior Notes due 2026\n750\n \n750\n \n6.65\n% Senior Notes due 2028\n140\n \n140\n \n4.375\n% Senior Notes due 2030\n750\n \n750\n \n3.90\n% Senior Notes due 2035\n500\n \n500\n \n5.10\n% Senior Notes due 2036\n250\n \n250\n \n4.950\n% Senior Notes due 2050\n750\n \n750\n \n5.650\n% Senior Notes due 2054\n1,000\n \n—\n \nLong-Term Debt\n4,640\n \n3,640\n \nFinance Leases (see Note 17)\n150\n \n183\n \nLess: Current Portion of Long-Term Debt\n532\n \n34\n \nUnamortized Debt Discount\n33\n \n21\n \nDebt Issuance Costs\n5\n \n3\n \nTotal Long-Term Debt\n$\n4,220\n \n$\n3,765\n \nThe senior notes in the table above are senior, unsecured obligations that rank equally in right of payment with all of EOG's other unsecured and unsubordinated outstanding debt.  At December 31, 2024, the aggregate annual maturities of current and long-term debt (excluding finance lease obligations) were $\n500\n million in 2025, $\n750\n million in 2026, \nzero\n in 2027, $\n140\n million in 2028 and \nzero\n in 2029.\nAt December 31, 2024 and 2023, EOG had \nno\n outstanding commercial paper borrowings and did not utilize any commercial paper borrowings during 2024 or 2023.  \nOn March 15, 2023, EOG repaid upon maturity the $\n1,250\n million aggregate principal amount of its \n2.625\n% Senior Notes due 2023.\nOn November 21, 2024, EOG closed on its offering of $\n1.0\n billion aggregate principal amount of its \n5.650\n% Senior Notes due 2054 (the Notes).  Interest on the Notes is payable semi-annually in arrears on June 1 and December 1 of each year, beginning on June 1, 2025.  EOG received net proceeds of $\n985\n million from the issuance of the Notes,  which will be used for general corporate purposes, including (i) the repayment of the $\n500\n million aggregate principal amount of \n3.15\n% Senior Notes due 2025 and (ii) the funding of future capital expenditures.\nOn June 7, 2023, EOG entered into a new $\n1.9\n billion senior unsecured Revolving Credit Agreement (Agreement) with domestic and foreign lenders (Banks).  The Agreement replaced EOG's $\n2.0\n billion senior unsecured Revolving Credit Agreement, dated as of June 27, 2019, with domestic and foreign lenders, which had a scheduled maturity date of June 27, 2024, and which was terminated by EOG (without penalty), effective as of June 7, 2023, in connection with the completion of the Agreement.\nF-13\nThe Agreement has a scheduled maturity date of June 7, 2028, and includes an option for EOG to extend, on up to \ntwo\n occasions, the term for successive \none-year\n periods subject to certain terms and conditions.  The Agreement (i) commits the Banks to provide advances up to an aggregate principal amount of $\n1.9\n billion at any one time outstanding, with an option for EOG to request increases in the aggregate commitments to an amount not to exceed $\n3.0\n billion, subject to certain terms and conditions, and (ii) includes a swingline subfacility and a letter of credit subfacility.  Advances under the Agreement will accrue interest based, at EOG's option, on either the Secured Overnight Financing Rate (SOFR) plus \n0.1\n% plus an applicable margin or the Base Rate (as defined in the Agreement) plus an applicable margin.  The applicable margin used in connection with interest rates and fees will be based on EOG's credit rating for its senior unsecured long-term debt at the applicable time.  The Agreement contains representations, warranties, covenants and events of default that EOG believes are customary for investment-grade, senior unsecured commercial bank credit agreements, including a financial covenant for the maintenance of a ratio of Total Debt-to-Total Capitalization (as such terms are defined in the Agreement) of no greater than \n65\n%.  At December 31, 2024, EOG was in compliance with this financial covenant.  At December 31, 2024 and December 31, 2023, there were no borrowings or letters of credit outstanding under the Agreement.  The SOFR and Base Rate (inclusive of the applicable margins), had there been any amounts borrowed under the Agreement at December 31, 2024, would have been \n5.33\n% and \n7.50\n%, respectively.\n3.  \nStockholders' Equity\nCommon Stock.\n  In November 2021, EOG's Board of Directors (Board) established a share repurchase authorization allowing for the repurchase by EOG of up to $\n5\n billion of its common stock and, in November 2024, increased such share repurchase authorization from $\n5\n billion to $\n10\n billion, effective November 7, 2024 (Share Repurchase Authorization).\nUnder the Share Repurchase Authorization, EOG may repurchase shares from time to time, at management's discretion, in accordance with applicable securities laws, including through open market transactions, privately negotiated transactions or any combination thereof.  The timing and amount of repurchases is at the discretion of EOG's management and depends on a variety of factors, including the trading price of EOG's common stock, corporate and regulatory requirements, other market and economic conditions, the availability of cash to effect repurchases and EOG's anticipated future capital expenditures and other commitments requiring cash.  Repurchased shares are held as treasury shares and are available for general corporate purposes.  The Share Repurchase Authorization has no time limit, does not require EOG to repurchase a specific number of shares and may be modified, suspended, or terminated by the Board at any time.  During the year ended December 31, 2024, EOG repurchased \n25.8\n million shares of common stock for approximately $\n3.2\n billion (inclusive of transaction fees and commissions) pursuant to the Share Repurchase Authorization.  As of December 31, 2024, approximately $\n5.8\n billion remained available for repurchases under the Share Repurchase Authorization.  Included in the Treasury Stock Repurchased amounts on the Consolidated Statements of Stockholders' Equity for the year ended December 31, 2024, is $\n30\n million of estimated federal excise tax.\nShares of common stock are from time to time withheld by, or returned to, EOG in satisfaction of tax withholding obligations arising upon the exercise of employee stock options or stock-settled stock appreciation rights (SARs), the vesting of restricted stock, restricted stock unit or performance unit grants or in payment of the exercise price of employee stock options.  Such shares withheld or returned have not counted, and will not count, against the Share Repurchase Authorization.  Shares purchased, withheld and returned are held in treasury for, among other purposes, fulfilling any obligations arising under EOG's stock-based compensation plans and any other approved transactions or activities for which such shares of common stock may be required.\nOn February 27, 2025, the Board declared a quarterly cash dividend on the common stock of $\n0.975\n per share to be paid on April 30, 2025, to stockholders of record as of April 16, 2025.\nF-14\nThe following summarizes Common Stock activity for each of the years ended December 31, 2024, 2023 and 2022 (in thousands):\n \nCommon Shares\n \nIssued\nTreasury\nOutstanding\nBalance at December 31, 2021\n585,522\n \n(\n257\n)\n585,265\n \nCommon Stock Issued Under Stock-Based Compensation Plans\n2,674\n \n—\n \n2,674\n \nTreasury Stock Purchased \n(1)\n—\n \n(\n997\n)\n(\n997\n)\nCommon Stock Issued Under Employee Stock Purchase Plan\n201\n \n—\n \n201\n \nTreasury Stock Issued Under Stock-Based Compensation Plans\n—\n \n554\n \n554\n \nBalance at December 31, 2022\n588,397\n \n(\n700\n)\n587,697\n \nCommon Stock Issued Under Stock-Based Compensation Plans\n159\n \n—\n \n159\n \nTreasury Stock Purchased \n(2)\n—\n \n(\n9,177\n)\n(\n9,177\n)\nCommon Stock Issued Under Employee Stock Purchase Plan\n193\n \n—\n \n193\n \nTreasury Stock Issued Under Stock-Based Compensation Plans\n—\n \n1,989\n \n1,989\n \nBalance at December 31, 2023\n588,749\n \n(\n7,888\n)\n580,861\n \nCommon Stock Issued Under Stock-Based Compensation Plans\n—\n \n—\n \n—\n \nTreasury Stock Purchased \n(2)\n—\n \n(\n26,350\n)\n(\n26,350\n)\nCommon Stock Issued Under Employee Stock Purchase Plan\n191\n \n—\n \n191\n \nTreasury Stock Issued Under Stock-Based Compensation Plans\n—\n \n2,507\n \n2,507\n \nBalance at December 31, 2024\n588,940\n \n(\n31,731\n)\n557,209\n \n(1)    Represents shares that were withheld by or returned to EOG (i) in satisfaction of tax withholding obligations that arose upon the exercise of employee stock options or SARs or the vesting of restricted stock, restricted stock unit or performance unit grants or (ii) in payment of the exercise price of employee stock options.  \n(2)    Represents shares that were repurchased under the Share Repurchase Authorization and/or that were withheld by or returned to EOG (i) in satisfaction of tax withholding obligations that arose upon the exercise of employee stock options or SARs or the vesting of restricted stock, restricted stock unit or performance unit grants or (ii) in payment of the exercise price of employee stock options.\nPreferred Stock\n.  EOG currently has one authorized series of preferred stock - its Series E junior participating preferred stock (Series E Preferred Stock), of which \n3,000,000\n shares have been designated and authorized.  As of December 31, 2024, \nno\n shares of Series E Preferred Stock have been issued or are outstanding.\nF-15\n4.  \nAccumulated Other Comprehensive Loss\nAccumulated other comprehensive loss includes certain transactions that have been reported in the Consolidated Statements of Stockholders' Equity.  \nThe components of Accumulated Other Comprehensive Loss at December 31, 2024 and 2023 consisted of the following (in millions):\nForeign Currency Translation Adjustment\nOther\nTotal\nDecember 31, 2022\n$\n(\n7\n)\n$\n(\n1\n)\n$\n(\n8\n)\nOther comprehensive loss before taxes\n(\n1\n)\n—\n \n(\n1\n)\nTax effects\n—\n \n—\n \n—\n \nOther comprehensive loss\n(\n1\n)\n—\n \n(\n1\n)\nDecember 31, 2023\n(\n8\n)\n(\n1\n)\n(\n9\n)\nOther comprehensive income before taxes\n4\n \n1\n \n5\n \nTax effects\n—\n \n—\n \n—\n \nOther comprehensive income\n4\n \n1\n \n5\n \nDecember 31, 2024\n$\n(\n4\n)\n$\n—\n \n$\n(\n4\n)\nNo\n significant amount was reclassified out of Accumulated Other Comprehensive Loss during the years ended December 31, 2024 and 2023.\n5.  \nOther Income, Net\nOther income, net for 2024 included interest income ($\n277\n million), partially offset by an upward adjustment to deferred compensation expense ($\n5\n million).  Other income, net for 2023 included interest income ($\n240\n million), partially offset by an upward adjustment to deferred compensation expense ($\n7\n million).  Other income, net for 2022 included interest income ($\n85\n million) and equity income from investments in ammonia plants in Trinidad ($\n46\n million), partially offset by an upward adjustment to deferred compensation expense ($\n15\n million).\n \nF-16\n6.  \nIncome Taxes\nThe principal components of EOG's total net deferred income tax liabilities at December 31, 2024 and 2023 were as follows (in millions):\n \n2024\n2023\nDeferred Income Tax Assets (Liabilities)\n \n \nForeign Oil and Gas Exploration and Development Costs Deducted for Tax Under Book Depreciation, Depletion and Amortization\n$\n(\n56\n)\n$\n(\n26\n)\nForeign Asset Retirement Obligations\n89\n \n84\n \nForeign Accrued Expenses and Liabilities\n10\n \n12\n \nForeign Net Operating Loss\n127\n \n97\n \nForeign Valuation Allowances\n(\n131\n)\n(\n126\n)\nForeign Other\n—\n \n1\n \nTotal Net Deferred Income Tax Assets\n$\n39\n \n$\n42\n \nDeferred Income Tax (Assets) Liabilities\n \n \nOil and Gas Exploration and Development Costs Deducted for Tax Over Book Depreciation, Depletion and Amortization\n$\n6,040\n \n$\n5,778\n \nDeferred Compensation Plans\n(\n65\n)\n(\n61\n)\nEquity Awards\n(\n65\n)\n(\n59\n)\nCorporate Alternative Minimum Tax\n—\n \n(\n212\n)\nOther\n(\n44\n)\n(\n44\n)\nTotal Net Deferred Income Tax Liabilities\n$\n5,866\n \n$\n5,402\n \nTotal Net Deferred Income Tax Liabilities\n$\n5,827\n \n$\n5,360\n \nThe components of Income Before Income Taxes for the years indicated below were as follows (in millions):\n \n2024\n2023\n2022\nUnited States\n$\n8,157\n \n$\n9,576\n \n$\n9,752\n \nForeign\n61\n \n113\n \n149\n \nTotal\n$\n8,218\n \n$\n9,689\n \n$\n9,901\n \nThe principal components of EOG's Income Tax Provision (Benefit) for the years indicated below were as follows (in millions):\n \n2024\n2023\n2022\nCurrent:\nFederal\n$\n1,244\n \n$\n1,334\n \n$\n2,020\n \nState\n102\n \n76\n \n126\n \nForeign\n2\n \n5\n \n62\n \nTotal\n1,348\n \n1,415\n \n2,208\n \nDeferred:\n \n \n \nFederal\n425\n \n628\n \n(\n2\n)\nState\n40\n \n55\n \n(\n37\n)\nForeign\n2\n \n—\n \n(\n22\n)\nTotal\n467\n \n683\n \n(\n61\n)\nOther Non-Current:\nForeign\n—\n \n(\n3\n)\n(\n5\n)\nTotal\n—\n \n(\n3\n)\n(\n5\n)\nIncome Tax Provision\n$\n1,815\n \n$\n2,095\n \n$\n2,142\n \nF-17\nThe differences between taxes computed at the U.S. federal statutory tax rate and EOG's effective tax rate for the years indicated below were as follows:\n \n2024\n2023\n2022\nStatutory Federal Income Tax Rate\n21\n \n%\n21\n \n%\n21\n \n%\nState Income Tax, Net of Federal Benefit\n1\n \n1\n \n1\n \nEffective Income Tax Rate\n22\n \n%\n22\n \n%\n22\n \n%\nDeferred tax assets are recorded for future deductible amounts and certain other tax benefits, such as tax net operating losses (NOLs) and tax credit carryforwards, provided that management assesses the utilization of such assets to be \"more likely than not.\"  Management assesses the available positive and negative evidence to estimate if sufficient future taxable income will be generated to use the existing deferred tax assets.  On the basis of this evaluation, EOG has recorded valuation allowances for the portion of certain foreign and state deferred tax assets that management does not believe are more likely than not to be realized.  \nThe principal components of EOG's rollforward of valuation allowances for deferred income tax assets for the years indicated below were as follows (in millions):\n \n2024\n2023\n2022\nBeginning Balance\n$\n216\n \n$\n207\n \n$\n219\n \nIncrease \n(1)\n15\n \n8\n \n27\n \nDecrease \n(2)\n—\n \n—\n \n(\n33\n)\nOther \n(3)\n(\n30\n)\n1\n \n(\n6\n)\nEnding Balance\n$\n201\n \n$\n216\n \n$\n207\n \n(1)    Increase in valuation allowance related to the generation of tax NOLs and other deferred tax assets.\n(2)    Decrease in valuation allowance associated with adjustments to certain deferred tax assets and their related allowances.\n(3)    Represents dispositions, revisions and/or foreign exchange rate variances and the effect of statutory income tax rate changes.\n \nAs of December 31, 2024, EOG has state income tax NOLs of approximately $\n1.8\n billion.  Certain state income tax NOLs have an indefinite carryforward and all others expire between 2025 and 2041.  EOG also has foreign income tax NOLs of approximately $\n430\n million.  Certain foreign income tax NOLs can be carried forward up to 20 years and all others have an indefinite carryforward.  As described previously, these NOLs and other less significant tax benefits have been evaluated for the likelihood of utilization, and valuation allowances have been established for the portion of these deferred income tax assets that do not meet the \"more likely than not\" threshold.  \n EOG accrued corporate alternative minimum tax (CAMT) of $\n212\n million in 2023 which resulted in a tax credit that could be carried forward indefinitely to offset future regular federal income taxes.  Prior to EOG filing its consolidated 2023 U.S. federal income tax return, the Internal Revenue Service issued additional guidance in the form of proposed CAMT regulations.  EOG relied on this guidance and, as a result, the 2023 CAMT liability and associated tax credit carryforward decreased by $\n136\n million.  EOG utilized the remaining $\n76\n million of the CAMT credit carryforward to reduce its regular federal income tax liability in 2024.\nThe Inflation Reduction Act of 2022, among other things, allows a taxpayer to purchase transferable tax credits.  In 2024, EOG purchased approximately $\n200\n million of renewable energy tax credits from a third party which were used to offset tax year 2024 estimated tax payments.  The cash payments made to the third party were included in income taxes, net of refunds received, as disclosed in Note 10.\nAs of December 31, 2024, EOG does not have any unrecognized tax benefits.  Consequently, no interest or penalties have been recognized in the Consolidated Statements of Income and Comprehensive Income.  EOG does not expect its unrecognized tax benefits to change significantly in the next twelve months.\n \nEOG and its subsidiaries file income tax returns and are subject to tax audits in the U.S. and various state, local and foreign jurisdictions.\n \nEOG's earliest open tax years in its principal jurisdictions are generally as follows: U.S. federal (2021), Trinidad (2016), Canada (2020), Oman (2021) and Australia (2021).\nF-18\nEOG's foreign subsidiaries' undistributed earnings are not considered to be permanently reinvested outside of the U.S. and, when appropriate, deferred income taxes have been accrued on any such outside basis differences.  Additionally, EOG's foreign earnings may be subject to the U.S. federal \"global intangible low-taxed income\" (GILTI) inclusion.  EOG records any GILTI tax as a period expense.\n7.  \nEmployee Benefit Plans\nStock-Based Compensation\nDuring 2024, EOG maintained various stock-based compensation plans as discussed below.  EOG recognizes compensation expense on grants of stock options, SARs, restricted stock, restricted stock units and restricted stock units with performance-based conditions (together with the performance units granted under the 2008 Plan (as defined below), Performance Units) and grants made under the EOG Resources, Inc. Employee Stock Purchase Plan (ESPP).  Stock-based compensation expense is calculated based upon the grant date estimated fair value of the awards, net of forfeitures, based upon EOG's historical employee turnover rate.  Compensation expense is amortized over the shorter of the vesting period or the period from the grant date to the date the employee becomes eligible for retirement without requiring company approval, with a minimum amortization period of one year.\nStock-based compensation expense is included on the Consolidated Statements of Income and Comprehensive Income based upon the job functions of the employees receiving the grants.  Compensation expense related to EOG's stock-based compensation plans for the years ended December 31, 2024, 2023 and 2022 was as follows (in millions):\n \n2024\n2023\n2022\nLease and Well\n$\n68\n \n$\n54\n \n$\n40\n \nGathering, Processing and Transportation Costs\n6\n \n4\n \n4\n \nExploration Costs\n27\n \n24\n \n15\n \nGeneral and Administrative\n98\n \n95\n \n74\n \nTotal\n$\n199\n \n$\n177\n \n$\n133\n \nThe Amended and Restated EOG Resources, Inc. 2008 Omnibus Equity Compensation Plan (2008 Plan) provided for grants of stock options, SARs, restricted stock and restricted stock units, Performance Units, and other stock-based awards.  \nEOG's stockholders approved the EOG Resources, Inc. 2021 Omnibus Equity Compensation Plan (2021 Plan) at the 2021 Annual Meeting of Stockholders.  Therefore, no further grants were made from the 2008 Plan from and after the April 29, 2021 effective date of the 2021 Plan.  The 2021 Plan provides for grants of stock options, SARs, restricted stock and restricted stock units, Performance Units and other stock-based awards, up to an aggregate maximum of \n20\n million shares of common stock, plus any shares that were subject to outstanding awards under the 2008 Plan as of April 29, 2021, that are subsequently canceled or forfeited, expire or are otherwise not issued or are settled in cash.  Under the 2021 Plan, grants may be made to employees and non-employee members of EOG's Board.\nThe vesting schedules for grants of stock options, SARs, restricted stock and restricted stock units, and Performance Units are generally as follows:\nGrant Type\nVesting Schedule\nStock Options/SARs\nVesting in increments of one-third on each of the first three anniversaries, respectively, of the date of grant\nRestricted Stock/Restricted Stock Units\n\"Cliff\" vesting \nthree years\n from the date of grant\nPerformance Units\n\"Cliff\" vesting on the February 28th following the \nthree\n-year performance period and the Compensation and Human Resources Committee's certification of the applicable performance multiple\nF-19\nAt December 31, 2024, approximately \n13\n million common shares remained available for grant under the 2021 Plan.  EOG's policy is to issue shares related to the 2021 Plan from previously authorized unissued shares or treasury shares to the extent treasury shares are available.\nDuring 2024, 2023 and 2022, EOG issued shares in connection with stock option/SAR exercises, restricted stock grants, restricted stock unit and Performance Unit releases and ESPP purchases.  Excess net tax benefits / (deficiencies) recognized within the income tax provision were $\n19\n million, $\n32\n million and $\n22\n million for the years ended December 31, 2024, 2023 and 2022, respectively. \nStock Options and Stock-Settled Stock Appreciation Rights and Employee Stock Purchase Plan. \n Participants in EOG's stock-based compensation plans (including the 2008 Plan and 2021 Plan) have been or may be granted options to purchase shares of Common Stock.  In addition, participants in EOG's stock-based compensation plans (including the 2008 Plan and 2021 Plan) have been or may be granted SARs, representing the right to receive shares of Common Stock based on the appreciation in the stock price from the date of grant on the number of SARs granted.  EOG did not grant any stock options or SARs in 2024 and 2023.  EOG's ESPP allows eligible employees to semi-annually purchase, through payroll deductions, shares of Common Stock at \n85\n percent of the fair market value at specified dates.  Contributions to the ESPP are limited to \n10\n percent of the employee's pay (subject to certain ESPP limits) during each of the \ntwo\n \nsix-month\n offering periods each year.  Stock-based compensation expense related to stock option, SAR and ESPP grants totaled $\n18\n million, $\n24\n million and $\n34\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\nRestricted Stock and Restricted Stock Units. \n Employees may be granted restricted (non-vested) stock and/or restricted stock units without cost to them.  Upon vesting of restricted stock, shares of Common Stock are released to the employee.  Upon vesting, restricted stock units are converted into shares of Common Stock and released to the employee.  Stock-based compensation expense related to restricted stock and restricted stock units totaled $\n160\n million, $\n137\n million and $\n88\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\nThe following table sets forth the restricted stock and restricted stock unit transactions for the years ended December 31, 2024, 2023 and 2022 (shares and units in thousands):\n \n2024\n2023\n2022\n \nNumber of Shares and Units\nWeighted Average Grant Date Fair Value\nNumber of Shares and Units\nWeighted Average Grant Date Fair Value\nNumber of Shares and Units\nWeighted Average Grant Date Fair Value\nOutstanding at January 1\n4,364\n \n$\n111.24\n \n4,113\n \n$\n80.77\n \n4,680\n \n$\n69.37\n \nGranted\n1,871\n \n122.45\n \n1,680\n \n131.10\n \n1,637\n \n113.21\n \nReleased \n(1)\n(\n1,343\n)\n86.27\n \n(\n1,295\n)\n42.03\n \n(\n2,019\n)\n81.76\n \nForfeited\n(\n193\n)\n116.18\n \n(\n134\n)\n93.54\n \n(\n185\n)\n68.89\n \nOutstanding at December 31 \n(2)\n4,699\n \n122.64\n \n4,364\n \n111.24\n \n4,113\n \n80.77\n \n(1)\n(1)\nThe total intrinsic value of restricted stock and restricted stock units released during the years ended December 31, 2024, 2023 and 2022 was $\n166\n million, $\n166\n million and $\n223\n million, respectively.  The intrinsic value is based upon the closing price of EOG's common stock on the date restricted stock and restricted stock units are released.\n(2)\n(2)\nThe total intrinsic value of restricted stock and restricted stock units outstanding at December 31, 2024, 2023 and 2022 was $\n576\n million, $\n528\n million and $\n533\n million, respectively.  The intrinsic value is based on the closing market price of the Common Stock on the last trading day of the year.\nAt December 31, 2024, unrecognized compensation expense related to restricted stock and restricted stock units totaled $\n349\n million.  Such unrecognized expense will be recognized on a straight-line basis over a weighted average period of \n1.8\n years.\nPerformance Units.\n \n EOG has granted Performance Units to its executive officers annually since 2012.  For the grants made prior to September 2022, as more fully discussed in the grant agreements, the applicable performance metric is EOG's total shareholder return (TSR) over a \nthree-year\n performance period relative to the TSR over the same period of a designated group of peer companies.  Upon the application of the applicable performance multiple at the completion of the \nthree-year\n performance period, a minimum of \n0\n% and a maximum of \n200\n% of the Performance Units granted could be outstanding.  \nF-20\nFor the grants made beginning in September 2022, as more fully discussed in the grant agreements, the applicable performance metrics are 1) EOG's TSR over a \nthree-year\n performance period relative to the TSR over the same period of a designated group of peer companies and 2) EOG's average return on capital employed (ROCE) over the \nthree-year\n performance period.  At the end of the \nthree-year\n performance period, a performance multiple based on EOG's relative TSR ranking will be determined, with a minimum performance multiple of \n0\n% and a maximum performance multiple of \n200\n%.  A specified modifier ranging from -\n70\n% to \n+70\n% will then be applied to the performance multiple based on EOG's average ROCE over the \nthree-year\n performance period, provided that in no event shall the performance multiple, after applying the ROCE modifier, be less than \n0\n% or exceed \n200\n%.  Furthermore, if EOG's TSR over the \nthree-year\n performance period is negative (i.e., less than \n0\n%), the performance multiple will be capped at \n100\n%, regardless of EOG's relative TSR ranking or \nthree-year\n average ROCE.\nThe fair value of the Performance Units is estimated using a Monte Carlo simulation.  Stock-based compensation expense related to the Performance Unit grants totaled $\n12\n million, $\n16\n million and $\n11\n million for the years ended December 31, 2024, 2023 and 2022, respectively. \n  \nWeighted average fair values and valuation assumptions used to value Performance Units during the years ended December 31, 2024, 2023 and 2022 were as follows:\n \n2024\n2023\n2022\nWeighted Average Fair Value of Grants\n$\n130.31\n \n$\n142.20\n \n$\n126.55\n \nExpected Volatility\n35.20\n \n%\n44.76\n \n%\n56.11\n \n%\nRisk-Free Interest Rate\n3.46\n \n%\n4.53\n \n%\n4.01\n \n%\nExpected volatility is based on the term-matched historical volatility over the simulated term, which is calculated as the time between the grant date and the end of the performance period.  The risk-free interest rate is derived from the Treasury Constant Maturities yield curve on the grant date.\nThe following table sets forth the Performance Unit transactions for the years ended December 31, 2024, 2023 and 2022 (units in thousands):\n \n2024\n2023\n2022\n \nNumber of Units\nWeighted Average  Grant Date Fair Value\nNumber of Units\nWeighted Average Grant Date Fair Value\nNumber of Units\nWeighted Average Grant Date Fair Value\nOutstanding at January 1\n630\n \n$\n95.49\n \n688\n \n$\n83.82\n \n679\n \n$\n84.97\n \nGranted\n109\n \n130.31\n \n114\n \n142.20\n \n122\n \n126.55\n \nReleased \n(1)\n(\n45\n)\n43.33\n \n(\n86\n)\n79.98\n \n(\n57\n)\n136.74\n \nForfeited for Performance Multiple \n(2)\n(\n135\n)\n43.33\n \n(\n86\n)\n79.98\n \n(\n56\n)\n136.74\n \nOutstanding at December 31 \n(3)\n559\n \n(4)\n119.05\n \n630\n \n95.49\n \n688\n \n83.82\n \n(1)\nThe total intrinsic value of Performance Units released during the years ended December 31, 2024, 2023 and 2022 was $\n5\n million, $\n10\n million and $\n7\n million, respectively.  The intrinsic value is based upon the closing price of the Common Stock on the date the Performance Units are released.\n(2)\nUpon completion of the Performance Period for the Performance Units granted in 2020, 2019 and 2018, a performance multiple of \n25\n%, \n50\n% and \n50\n%, respectively, was applied to each of the grants resulting in a forfeiture of Performance Units in February 2024, February 2023 and February 2022.\n(3)\nThe total intrinsic value of Performance Units outstanding at December 31, 2024, 2023 and 2022 was $\n69\n million, $\n76\n million and $\n89\n million, respectively.  \n(4)\nUpon the application of the relevant performance multiple at the completion of each of the remaining Performance Periods, a minimum of \nzero\n and a maximum of \n1,118\n Performance Units could be outstanding.\n \nAt December 31, 2024, unrecognized compensation expense related to Performance Units totaled $\n21\n million.  Such unrecognized expense will be amortized on a straight-line basis over a weighted average period of \n1.3\n years.\nF-21\nUpon completion of the Performance Period for the Performance Units granted in September 2021, a performance multiple of \n125\n% was applied to the grants resulting in an additional grant of \n53,410\n Performance Units in February 2025.\nOther Stock Awards.\n  In August 2024, and in recognition of EOG's 25th anniversary as an independent public company, EOG awarded \n25\n shares of EOG common stock to each of its non-executive officer employees.  Stock-based compensation expense related to the awards totaled $\n9\n million for the year ended December 31, 2024, and the intrinsic value of the awards was $\n9\n million (based upon the closing price of EOG's common stock on the August 16, 2024 award date).  A gross-up to account for income taxes was also recognized.\nPension Plans.\n  EOG has a defined contribution pension plan in place for most of its employees in the United States.  EOG's contributions to the pension plan are based on various percentages of compensation and, in some instances, are based upon the amount of the employees' contributions.  EOG's total costs recognized for the plan were $\n66\n million, $\n61\n million and $\n56\n million for 2024, 2023 and 2022, respectively.  \nIn addition, EOG's Trinidadian subsidiary maintains a contributory defined benefit pension plan and a matched savings plan.  These pension plans are available to most employees of the Trinidadian subsidiary.  EOG's combined contributions to these plans were $\n1\n million, for each of 2024, 2023 and 2022, respectively.\nFor the Trinidadian defined benefit pension plan, the benefit obligation, fair value of plan assets and (prepaid)/accrued benefit cost totaled $\n16\n million, $\n17\n million and $(\n1.4\n) million, respectively, at December 31, 2024, and $\n16\n million, $\n16\n million and $(\n0.9\n) million, respectively, at December 31, 2023. \nPostretirement Health Care. \n EOG has postretirement medical and dental benefits in place for eligible United States and Trinidad employees and their eligible dependents, the costs of which are not material.\n8.  \nCommitments and Contingencies\nLetters of Credit and Guarantees. \n At December 31, 2024 and 2023, respectively, EOG had standby letters of credit and guarantees outstanding totaling $\n825\n million and $\n907\n million, primarily representing guarantees of payment or performance obligations on behalf of subsidiaries.  As of February 21, 2025, EOG had received \nno\n demands for payment under these guarantees. \nMinimum Commitments.  \nAt December 31, 2024, total minimum commitments from purchase and service obligations and transportation and storage service commitments not qualifying as leases, based on current transportation and storage rates and the foreign currency exchange rates used to convert Canadian dollars into United States dollars at December 31, 2024, were as follows (in millions):  \nTotal Minimum\nCommitments\n2025\n$\n1,520\n \n2026\n1,062\n \n2027\n933\n \n2028\n691\n \n2029\n581\n \n2030 and beyond\n1,379\n \n \n$\n6,166\n \nDelivery Commitments.  \nEOG sells crude oil, natural gas and purity products from its producing operations under a variety of contractual arrangements.  At December 31, 2024, EOG was committed to deliver to multiple parties aggregate fixed quantities of crude oil of \n2\n million barrels (MMBbls) in 2025.  At December 31, 2024, EOG was committed to deliver to multiple parties aggregate fixed quantities of natural gas of \n342\n billion cubic feet (Bcf) in 2025, \n318\n Bcf in 2026, \n359\n Bcf in 2027, \n328\n Bcf in 2028, \n328\n Bcf in 2029 and \n3,474\n Bcf thereafter.  Additionally at December 31, 2024, EOG was committed to deliver to multiple parties aggregate fixed quantities of purity products of \n15\n MMBbls in 2025.  All delivery commitments are expected to be sourced from future production of available reserves.\nF-22\nContingencies. \n There are currently various suits and claims pending against EOG that have arisen in the ordinary course of EOG's business, including contract disputes, personal injury and property damage claims and title disputes.  While the ultimate outcome and impact on EOG cannot be predicted, management believes that the resolution of these suits and claims will not, individually or in the aggregate, have a material adverse effect on EOG's consolidated financial position, results of operations or cash flow.  EOG records reserves for contingencies when information available indicates that a loss is probable and the amount of the loss can be reasonably estimated.\n9.  \nNet Income Per Share\nThe following table sets forth the computation of Net Income Per Share for the years ended December 31, 2024, 2023 and 2022 (in millions, except per share data):\n \n2024\n2023\n2022\nNumerator for Basic and Diluted Earnings per Share -\nNet Income\n$\n6,403\n \n$\n7,594\n \n$\n7,759\n \nDenominator for Basic Earnings per Share -\n \n \n \nWeighted Average Shares\n566\n \n581\n \n583\n \nPotential Dilutive Common Shares -\n \n \n \nStock Options/SARs\n1\n \n1\n \n2\n \nRestricted Stock/Units and Performance Units\n2\n \n2\n \n2\n \nDenominator for Diluted Earnings per Share -\n \n \n \nAdjusted Diluted Weighted Average Shares\n569\n \n584\n \n587\n \nNet Income Per Share\n \n \n \nBasic\n$\n11.31\n \n$\n13.07\n \n$\n13.31\n \nDiluted\n$\n11.25\n \n$\n13.00\n \n$\n13.22\n \nThe diluted earnings per share calculation excludes stock option, SAR, restricted stock, restricted stock unit, Performance Unit and ESPP grants that were anti-dilutive.  Shares underlying the excluded stock option, SAR and ESPP grants were \nzero\n, \n1\n million and \n1\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\n \n10.  \nSupplemental Cash Flow Information\nNet cash paid for interest and income taxes was as follows for the years ended December 31, 2024, 2023 and 2022 (in millions):\n \n2024\n2023\n2022\nInterest, Net of Capitalized Interest\n$\n140\n \n$\n161\n \n$\n173\n \nIncome Taxes, Net of Refunds Received\n$\n779\n \n$\n1,229\n \n$\n2,475\n \nEOG's accrued capital expenditures and amounts recorded within accounts payable at December 31, 2024, 2023 and 2022 were $\n725\n million, $\n631\n million and $\n713\n million, respectively.\nNon-cash investing activities for the year ended December 31, 2024, included additions of $\n109\n million to EOG's oil and gas properties as a result of property exchanges. \nNon-cash investing activities for the year ended December 31, 2023, included additions of $\n195\n million to EOG's oil and gas properties as a result of property exchanges.\nNon-cash investing activities for the year ended December 31, 2022, included additions of $\n153\n million to EOG's oil and gas properties as a result of property exchanges.\nCash paid for leases for the years ended December 31, 2024, 2023 and 2022, is disclosed in Note 17.\nF-23\n11.  \nBusiness Segment Information\nEOG's operations are all crude oil, NGLs and natural gas exploration and production-related.  The Segment Reporting Topic of the ASC establishes standards for reporting information about operating segments in annual and interim financial statements.  Operating segments are defined as components of an enterprise about which separate financial information is available and evaluated regularly by the chief operating decision maker, or decision-making group, in deciding how to allocate resources and in assessing performance.  EOG's chief operating decision makers (CODM) are the Chairman of the Board and Chief Executive Officer, the Executive Vice President and Chief Operating Officer, the Executive Vice President and Chief Financial Officer, the Executive Vice President, General Counsel and Corporate Secretary, and the Senior Vice Presidents of Exploration and Production.  \nThe CODM routinely review and make operating decisions related to significant issues associated with each of EOG's major producing areas (including in the United States and in Trinidad) and its exploration programs both inside and outside the United States.  For segment reporting purposes, the CODM consider the major United States producing areas to be one operating segment.  The CODM use operating income (loss) to assess performance and allocate resources.  \nFinancial information by reportable segment is presented below as of and for the years ended December 31, 2024, 2023 and 2022 (in millions):\nUnited\nStates\nTrinidad\nOther\nInternational \n(1)\nTotal\n2024\nCrude Oil and Condensate\n$\n13,901\n \n$\n20\n \n$\n— \n$\n13,921\n \nNatural Gas Liquids\n2,106\n \n— \n— \n2,106\n \nNatural Gas\n1,256\n \n295\n \n— \n1,551\n \nGains on Mark-to-Market Financial Commodity and Other Derivative Contracts, Net\n204\n \n— \n— \n204\n \nGathering, Processing and Marketing\n5,799\n \n1\n \n— \n5,800\n \nGains (Losses) on Asset Dispositions, Net\n21\n \n(\n5\n)\n— \n16\n \nOther, Net\n100\n \n— \n— \n100\n \nOperating Revenues and Other \n(2)\n23,387\n \n311\n \n— \n23,698\n \nLease and Well\n1,532\n \n40\n \n— \nGathering, Processing and Transportation Costs\n1,722\n \n— \n— \nMarketing Costs\n5,717\n \n— \n— \nDepreciation, Depletion and Amortization\n3,968\n \n139\n \n1\n \nGeneral and Administrative\n639\n \n15\n \n15\n \nTaxes Other Than Income\n1,245\n \n3\n \n1\n \nOther Segment Items \n(3) (4)\n509\n \n19\n \n51\n \nOperating Income (Loss)\n8,055\n \n95\n \n(\n68\n)\n8,082\n \nInterest Income\n277\n \nOther Expense\n(\n3\n)\nInterest Expense, Net\n138\n \nIncome Before Income Taxes\n8,218\n \nOther Segment Disclosures:\nAdditions to Oil and Gas Properties, Excluding Dry Hole Costs\n5,213\n \n223\n \n12\n \n5,448\n \nTotal Property, Plant and Equipment, Net\n33,690\n \n497\n \n25\n \n34,212\n \nTotal Assets\n45,776\n \n1,220\n \n190\n \n47,186\n \nInterest Expense, Net\n138\n \n— \n— \n138\n \nInterest Income\n257\n \n15\n \n5\n \n277\n \nF-24\nUnited\nStates\nTrinidad\nOther\nInternational \n(1)\nTotal\n2023\nCrude Oil and Condensate\n$\n13,734\n \n$\n14\n \n$\n— \n$\n13,748\n \nNatural Gas Liquids\n1,884\n \n— \n— \n1,884\n \nNatural Gas\n1,530\n \n214\n \n— \n1,744\n \nGains on Mark-to-Market Financial Commodity and Other Derivative Contracts, Net\n818\n \n— \n— \n818\n \nGathering, Processing and Marketing\n5,806\n \n— \n— \n5,806\n \nGains on Asset Dispositions, Net\n53\n \n42\n \n— \n95\n \nOther, Net\n91\n \n— \n— \n91\n \nOperating Revenues and Other \n(5)\n23,916\n \n270\n \n— \n24,186\n \nLease and Well\n1,410\n \n43\n \n1\n \nGathering, Processing and Transportation Costs\n1,620\n \n— \n— \nMarketing Costs\n5,709\n \n— \n— \nDepreciation, Depletion and Amortization\n3,414\n \n78\n \n— \nGeneral and Administrative\n618\n \n15\n \n7\n \nTaxes Other Than Income\n1,278\n \n6\n \n— \nOther Segment Items \n(3) (6)\n351\n \n4\n \n29\n \nOperating Income (Loss)\n9,516\n \n124\n \n(\n37\n)\n9,603\n \nInterest Income\n240\n \nOther Expense\n(\n6\n)\nInterest Expense, Net\n148\n \nIncome Before Income Taxes\n9,689\n \nOther Segment Disclosures:\nAdditions to Oil and Gas Properties, Excluding Dry Hole Costs\n5,413\n \n162\n \n4\n \n5,579\n \nTotal Property, Plant and Equipment, Net\n31,876\n \n404\n \n17\n \n32,297\n \nTotal Assets\n42,674\n \n1,063\n \n120\n \n43,857\n \nInterest Expense, Net\n148\n \n— \n— \n148\n \nInterest Income\n223\n \n12\n \n5\n \n240\n \nF-25\nUnited\nStates\nTrinidad\nOther\nInternational \n(1)\nTotal\n2022\n \n \n \n \nCrude Oil and Condensate\n$\n16,349\n \n$\n18\n \n$\n— \n$\n16,367\n \nNatural Gas Liquids\n2,648\n \n— \n— \n2,648\n \nNatural Gas\n3,489\n \n292\n \n— \n3,781\n \nLosses on Mark-to-Market Financial Commodity and Other Derivative Contracts, Net\n(\n3,982\n)\n— \n— \n(\n3,982\n)\nGathering, Processing and Marketing\n6,695\n \n1\n \n— \n6,696\n \nGains (Losses) on Asset Dispositions, Net\n77\n \n(\n4\n)\n1\n \n74\n \nOther, Net\n118\n \n— \n— \n118\n \nOperating Revenues and Other \n(7)\n25,394\n \n307\n \n1\n \n25,702\n \nLease and Well\n1,294\n \n36\n \n1\n \nGathering, Processing and Transportation Costs\n1,587\n \n— \n— \nMarketing Costs\n6,535\n \n— \n— \nDepreciation, Depletion and Amortization\n3,469\n \n73\n \n— \nGeneral and Administrative\n548\n \n13\n \n9\n \nTaxes Other Than Income\n1,575\n \n10\n \n— \nOther Segment Items \n(3) (8)\n506\n \n53\n \n27\n \nOperating Income (Loss)\n9,880\n \n122\n \n(\n36\n)\n9,966\n \nInterest Income\n85\n \nOther Income\n29\n \nInterest Expense, Net\n179\n \nIncome Before Income Taxes\n9,901\n \nOther Segment Disclosures:\nAdditions to Oil and Gas Properties, Excluding Dry Hole Costs\n4,599\n \n122\n \n6\n \n4,727\n \nTotal Property, Plant and Equipment, Net\n29,109\n \n307\n \n13\n \n29,429\n \nTotal Assets\n40,349\n \n879\n \n143\n \n41,371\n \nInterest Expense, Net\n179\n \n— \n— \n179\n \nInterest Income\n81\n \n2\n \n2\n \n85\n \n(1)\nOther International primarily consists of EOG's Australia and Canada operations.  EOG is continuing the process of exiting its Canada operations.  EOG exited Block 36 and Block 49 in Oman in 2023.\n(2)\nEOG had sales activity with \nthree\n significant purchasers in 2024, \none\n totaling $\n2.9\n billion, another totaling $\n2.6\n billion and a third totaling $\n2.5\n billion of consolidated Operating Revenues and Other in the United States segment.\n(3)\nOther Segment Items includes Exploration Costs, Dry Hole Costs and Impairments.\n(4)\nEOG recorded pretax impairment charges of $\n31\n million in 2024 for proved oil and gas properties and firm commitment contracts related to its decision to exit the Horn River Basin in British Columbia, Canada, in the Other International segment.  See Note 14.\n(5)\nEOG had sales activity with \nthree\n significant purchasers in 2023, \none\n totaling $\n3.3\n billion and \ntwo\n others totaling $\n2.6\n billion each of consolidated Operating Revenues and Other in the United States segment.\n(6)\nEOG recorded pretax impairment charges of $\n18\n million in 2023 for proved oil and gas properties and firm commitment contracts related to its decision to exit the Horn River Basin in British Columbia, Canada, in the Other International segment.  See Note 14.\n(7)\nEOG had sales activity with \nthree\n significant purchasers in 2022, \none\n totaling $\n3.3\n billion, another totaling $\n3.1\n billion and a third totaling $\n3.0\n billion of consolidated Operating Revenues and Other in the United States segment.\n(8)\nEOG recorded pretax impairment charges of $\n15\n million in 2022 for proved oil and gas properties and firm commitment contracts related to its decision to exit the Horn River Basin in British Columbia, Canada, in the Other International segment.  See Note 14.\nF-26\n12.  \nRisk Management Activities\nCommodity\n \nPrice Transactions. \n EOG engages in price risk management activities from time to time.  These activities are intended to manage EOG's exposure to fluctuations in commodity prices for crude oil, NGLs and natural gas.  EOG utilizes financial commodity derivative instruments, primarily price swap, option, swaption, collar and basis swap contracts, as a means to manage this price risk.  \nDuring 2024, 2023 and 2022, EOG elected not to designate any of its financial commodity and other derivative contracts as accounting hedges and, accordingly, accounted for these financial commodity and other derivative contracts using the mark-to-market accounting method.  Under this accounting method, changes in the fair value of outstanding financial instruments are recognized as gains or losses in the period of change and are recorded as Gains (Losses) on Mark-to-Market Financial Commodity and Other Derivative Contracts, Net on the Consolidated Statements of Income and Comprehensive Income.  The related cash flow impact is reflected in Cash Flows from Operating Activities.  During 2024, 2023 and 2022, EOG recognized net gains (losses) on the mark-to-market of financial commodity and other derivative contracts of $\n204\n million, $\n818\n million and $(\n3,982\n) million, respectively, which included net cash received from (payments for) settlements of crude oil, NGLs and natural gas financial derivative contracts of $\n214\n million, $(\n112\n) million and $(\n3,501\n) million, respectively. \nPresented below is a comprehensive summary of EOG's financial commodity derivative contracts settled during the year ended December 31, 2024 (closed) and remaining for 2025 and thereafter, as of December 31, 2024.  Natural gas volumes are presented in MMBtu per day (MMBtud) and prices are presented in dollars per MMBtu ($/MMBtu).\nNatural Gas Financial Price Swap Contracts\nContracts Sold\nPeriod\nSettlement Index\nVolume\n(MMBtud in thousands)\nWeighted Average\nPrice ($/MMBtu)\nJanuary - December 2024 (closed)\nNYMEX Henry Hub\n725\n \n$\n3.07\n \nJanuary 2025 (closed)\nNYMEX Henry Hub\n725\n \n3.07\n \nFebruary - December 2025\nNYMEX Henry Hub\n725\n \n3.07\n \nNatural Gas Basis Swap Contracts\nContracts Sold\nPeriod\nSettlement Index\nVolume\n(MMBtud in thousands)\nWeighted Average Price Differential\n($/MMBtu)\nJanuary - December 2024 (closed)\nNYMEX Henry Hub Houston Ship Channel (HSC) Differential \n(1)\n10\n \n$\n0.00\n \nJanuary - December 2025\nNYMEX Henry Hub HSC Differential\n10\n \n0.00\n \n_________________\n(1)    This settlement index is used to fix the differential between pricing at the Houston Ship Channel and NYMEX Henry Hub prices.\nF-27\nFinancial\n \nCommodity and Other Derivatives Location on Balance Sheet.  \nThe following table sets forth the amounts and classification of EOG's outstanding financial commodity and other derivative instruments at December 31, 2024 and 2023, respectively.  Certain amounts may be presented on a net basis on the consolidated financial statements when such amounts are with the same counterparty and subject to a master netting arrangement (in millions):\n \n  \nFair Value at December 31,\nDescription\nLocation on Balance Sheet\n2024\n2023\nAsset Derivatives\n \nCrude oil, NGLs and natural gas financial derivative contracts -\n \nCurrent portion\nAssets from Price Risk Management Activities\n$\n—\n \n$\n106\n \nBrent Crude Oil (Brent) Linked Gas Sales Contract -\nNoncurrent Portion\nOther Assets \n(1)\n110\n \n—\n \nLiability Derivatives\n \n \n \nCrude oil, NGLs and natural gas financial derivative contracts -\n \n \n \nCurrent portion\nLiabilities from Price Risk Management Activities \n(2)\n$\n116\n \n$\n—\n \nNoncurrent Portion\nOther Liabilities\n—\n \n103\n \n(1)    The noncurrent portion related to the Brent Linked Gas Sales Contract consists of gross assets of $\n110\n million at December 31, 2024.\n(2)    The current portion of Liabilities from Price Risk Management Activities consists of gross liabilities of $\n117\n million, partially offset by gross assets of $\n1\n million at December 31, 2024.\nNatural Gas Sales Linked to Brent Crude Oil\n.  In February 2024, EOG entered into a \n10\n-year agreement, commencing in 2027, to sell \n180,000\n MMBtud of its domestic natural gas production, with \n140,000\n MMBtud to be sold at a price indexed to Brent and the remaining volumes to be sold at a price indexed to Brent or a U.S. Gulf Coast gas index.  It was determined that this agreement meets the definition of a derivative under the Derivatives and Hedging Topic of the ASC and does not qualify for the normal purchases and normal sales scope exception.  As such, this agreement is accounted for as a derivative using the mark-to-market accounting method.  Changes in the fair value are recognized as gains or losses in the period of change on the Consolidated Statements of Income and Comprehensive Income.\nCredit Risk.\n  Notional contract amounts are used to express the magnitude of a derivative.  The amounts potentially subject to credit risk, in the event of nonperformance by the counterparties, are equal to the fair value of such contracts (see Note 13).  EOG evaluates its exposure to significant counterparties on an ongoing basis, including those arising from physical and financial transactions.  In some instances, EOG renegotiates payment terms and/or requires collateral, parent guarantees or letters of credit to minimize credit risk.  \nAt December 31, 2024, EOG's net accounts receivable balance related to United States hydrocarbon sales included one receivable balance which accounted for more than 10% of the total balance.  The receivable was due from a petroleum refining company.  The related amount was collected during early 2025.  At December 31, 2023, EOG's net accounts receivable balance related to United States hydrocarbon sales included three receivable balances, each of which accounted for more than 10% of the total balance.  The receivables were due from three petroleum refining companies.  The related amounts were collected during early 2024.  \nIn 2024 and 2023, all natural gas from EOG's Trinidad operations was sold to the National Gas Company of Trinidad and Tobago Limited and its subsidiary.  In 2024 and 2023, all crude oil and condensate from EOG's Trinidad operations was sold to Heritage Petroleum Company Limited.  \nF-28\nAll of EOG's financial commodity derivative instruments are covered by International Swap Dealers Association Master Agreements (ISDAs) with counterparties.  The ISDAs may contain provisions that (i) require EOG, if it is the party in a net liability position, to post collateral with the counterparty when the amount of the net liability exceeds the threshold level specified for EOG's then-current credit ratings or (ii) require the counterparty, if it is in a net liability position, to post collateral with EOG when the amount of the net liability exceeds the threshold level specified for the counterparty's then-current credit ratings.  In addition, the ISDAs may also provide that as a result of certain circumstances, including certain events that cause EOG's credit ratings to become materially weaker than its then-current ratings, the counterparty may require all outstanding financial derivatives under the ISDA to be settled immediately.  See Note 13 for the aggregate fair value of all financial derivative instruments that were in a net liability position at December 31, 2024 and 2023.  EOG had \nno\n collateral posted and held \nno\n collateral at December 31, 2024 and 2023.  \nSubstantially all of EOG's accounts receivable at December 31, 2024 and 2023 resulted from hydrocarbon sales and/or joint interest billings to third-party companies, including foreign state-owned entities in the oil and gas industry.  This concentration of customers and joint interest owners may impact EOG's overall credit risk, either positively or negatively, in that these entities may be similarly affected by changes in economic or other conditions.  In determining whether or not to require collateral or other credit enhancements from a customer, EOG typically analyzes the entity's net worth, cash flows, earnings and credit ratings.  Receivables are generally not collateralized.  During the three-year period ended December 31, 2024, credit losses incurred on receivables by EOG have been immaterial.\n \n13.  \nFair Value Measurements\nCertain of EOG's financial and nonfinancial assets and liabilities are reported at fair value on the Consolidated Balance Sheets.  An established fair value hierarchy prioritizes the relative reliability of inputs used in fair value measurements.  The hierarchy gives highest priority to Level 1 inputs that represent unadjusted quoted market prices in active markets for identical assets and liabilities that the reporting entity has the ability to access at the measurement date.  Level 2 inputs are directly or indirectly observable inputs other than quoted prices included within Level 1.  Level 3 inputs are unobservable inputs and have the lowest priority in the hierarchy.  EOG gives consideration to the credit risk of its counterparties, as well as its own credit risk, when measuring financial assets and liabilities at fair value.\nRecurring Fair Value Measurements.  \nThe following table provides fair value measurement information within the fair value hierarchy for certain of EOG's financial assets and liabilities carried at fair value on a recurring basis at December 31, 2024 and 2023 (in millions):\n \nFair Value Measurements Using:\n \nQuoted\nPrices in\nActive\nMarkets\n(Level 1)\nSignificant\nOther\nObservable\nInputs\n(Level 2)\nSignificant\nUnobservable\nInputs\n(Level 3)\nTotal\nAt December 31, 2024\nFinancial Assets:\nNatural Gas Basis Swaps\n$\n—\n \n$\n1\n \n$\n—\n \n$\n1\n \nBrent Linked Gas Sales Contract\n—\n \n—\n \n110\n \n110\n \nFinancial Liabilities:\nNatural Gas Swaps\n—\n \n117\n \n—\n \n117\n \nAt December 31, 2023\n \n \n \n \nFinancial Assets:\n \n \n \n \nNatural Gas Swaps\n$\n—\n \n$\n105\n \n$\n—\n \n$\n105\n \nNatural Gas Basis Swaps\n—\n \n2\n \n—\n \n2\n \nFinancial Liabilities:\nNatural Gas Swaps\n—\n \n104\n \n—\n \n104\n \nSee Note 12 for a description of the Brent Linked Gas Sales Contract and for the balance sheet amounts and classification of EOG's financial commodity and other derivative instruments at December 31, 2024 and 2023.\nF-29\nThe estimated fair value of financial commodity and other derivative contracts was based upon forward commodity price curves based on quoted market prices.  For the Brent Linked Gas Sales Contract, the estimated fair value was based on EOG's estimates of (and assumptions regarding) significant Level 3 inputs, as defined by FASB's Fair Value Measurement Topic of the ASC (ASC 820), including future crude oil and natural gas prices.  These Level 3 inputs are immaterial to the financial statements.  Financial commodity and other derivative contracts were valued by utilizing an independent third-party derivative valuation provider who uses various types of valuation models, as applicable.\nNon-Recurring Fair Value Measurements.  \nThe initial measurement of asset retirement obligations at fair value is calculated using discounted cash flow techniques and based on internal estimates of future retirement costs associated with property, plant and equipment.  Significant Level 3 inputs used in the calculation of asset retirement obligations include plugging costs and reserve lives.  A reconciliation of EOG's asset retirement obligations is presented in Note 15.\nWhen circumstances indicate that proved oil and gas properties may be impaired, EOG compares expected undiscounted future cash flows at a depreciation, depletion and amortization group level to the unamortized capitalized cost of the group.  If the expected undiscounted future cash flows, based on EOG's estimate of (and assumptions regarding) future crude oil, NGLs and natural gas prices, operating costs, development expenditures, anticipated production from proved reserves and other relevant data (all Level 3 inputs as defined by ASC 820) are lower than the unamortized capitalized cost, the capitalized cost is reduced to fair value.  Fair value is generally calculated using the Income Approach described in ASC 820.  In certain instances, EOG utilizes accepted offers from third-party purchasers as the basis for determining fair value.\nDuring 2024, proved oil and gas properties with a carrying amount of $\n619\n million were written down to their fair value of $\n324\n million, resulting in pretax impairment charges of $\n295\n million.\nDuring 2023, proved oil and gas properties with a carrying amount of $\n59\n million were written down to their fair value of $\n15\n million, resulting in pretax impairment charges of $\n44\n million.\nDuring 2022, proved oil and gas properties with a carrying amount of $\n146\n million were written down to their fair value of $\n26\n million, resulting in pretax impairment charges of $\n120\n million. \nEOG utilized average prices per acre from comparable market transactions and estimated discounted cash flows as the basis for determining the fair value of unproved and proved properties, respectively, received in non-cash property exchanges.  See Note 10.\nFair Value of Debt.  \nAt December 31, 2024 and 2023, respectively, EOG had outstanding $\n4,640\n million and $\n3,640\n million aggregate principal amount of senior notes, which had estimated fair values of $\n4,441\n million and $\n3,574\n million, respectively.  The estimated fair value of debt was based upon quoted market prices and, where such prices were not available, other observable (Level 2) inputs regarding interest rates available to EOG at year-end.\n14.  \nImpairment Expense \nImpairment expense was as follows for the years ended December 31, 2024, 2023 and 2022 (in millions):\n \n2024\n2023\n2022\nProved properties \n(1)\n$\n295\n \n$\n44\n \n$\n120\n \nUnproved properties \n(2)\n63\n \n125\n \n206\n \nOther assets\n31\n \n31\n \n29\n \nInventories\n—\n \n—\n \n25\n \nFirm commitment contracts\n2\n \n2\n \n2\n \nTotal\n$\n391\n \n$\n202\n \n$\n382\n \n(1)    Impairments of proved properties for the year ended December 31, 2024, were primarily due to the write-down to fair value of natural gas and crude oil assets in the Rocky Mountain area.\n(2)    Unproved properties with acquisition costs that are not individually significant are aggregated, and the portion of such costs estimated to be nonproductive is amortized over the remaining lease term.  Unproved properties with individually significant acquisition costs are reviewed individually for impairment.  See Note 1.\nF-30\n15.  \nAsset Retirement Obligations\nThe following table presents the reconciliation of the beginning and ending aggregate carrying amounts of short-term and long-term legal obligations associated with the retirement of property, plant and equipment for the years ended December 31, 2024 and 2023 (in millions):\n \n2024\n2023\nCarrying Amount at Beginning of Period\n$\n1,506\n \n$\n1,328\n \nLiabilities Incurred\n48\n \n71\n \nLiabilities Settled \n(1)\n(\n62\n)\n(\n114\n)\nAccretion\n59\n \n53\n \nRevisions\n(\n83\n)\n166\n \nForeign Currency Translations\n(\n8\n)\n2\n \nCarrying Amount at End of Period\n$\n1,460\n \n$\n1,506\n \nCurrent Portion\n$\n69\n \n$\n37\n \nNoncurrent Portion\n$\n1,391\n \n$\n1,469\n \n(1)    Includes settlements related to asset sales and property exchanges.\nThe current and noncurrent portions of EOG's asset retirement obligations are included in Current Liabilities - Other and Other Liabilities, respectively, on the Consolidated Balance Sheets.\n16.  \nAcquisitions and Divestitures\nDuring 2024, EOG paid cash for property acquisitions of $\n146\n million, primarily to acquire a gathering system in South Texas, as well as producing properties in the Utica.  Additionally during 2024, EOG recognized net gains on asset dispositions of $\n16\n million and received proceeds of $\n23\n million primarily due to lease exchanges and dispositions in the Delaware Basin and the Eagle Ford as well as the sale of certain other assets.\nDuring 2023, EOG paid cash for property acquisitions of $\n144\n million, primarily to acquire a gathering and processing system in the Powder River Basin.  Additionally during 2023, EOG recognized net gains on asset dispositions of $\n95\n million and received proceeds of $\n140\n million primarily due to the sale of EOG's equity interest in ammonia plant investments in Trinidad, the sale of certain legacy assets in the Texas Panhandle, the sale of certain gathering and processing assets and the sale of certain other assets.  \nDuring 2022, EOG paid cash for property acquisitions of $\n393\n million in the United States.  Additionally during 2022, EOG recognized net gains on asset dispositions of $\n74\n million and received proceeds of $\n349\n million primarily due to the sale of certain legacy natural gas assets in the Rocky Mountain area, unproved leasehold in Texas and producing properties in the Mid-Continent area.\n \nF-31\n17.  \nLeases\nLease costs are classified by the function of the ROU asset.  The lease costs related to exploration and development activities are initially included in the Oil and Gas Properties line on the Consolidated Balance Sheets and subsequently accounted for in accordance with the Extractive Industries - Oil and Gas Topic of the ASC.  Variable lease cost represents costs incurred above the contractual minimum payments and other charges associated with leased equipment, primarily for drilling and fracturing contracts classified as operating leases.  \nThe components of lease cost for the years ended December 31, 2024, 2023 and 2022 were as follows (in millions):\n2024\n2023\n2022\nOperating Lease Cost\n$\n419\n \n$\n387\n \n$\n282\n \nFinance Lease Cost:\nAmortization of Lease Assets\n33\n \n33\n \n36\n \nInterest on Lease Liabilities\n4\n \n5\n \n6\n \nVariable Lease Cost\n122\n \n91\n \n71\n \nShort-Term Lease Cost\n535\n \n567\n \n425\n \nTotal Lease Cost\n$\n1,113\n \n$\n1,083\n \n$\n820\n \nThe following table sets forth the amounts and classification of EOG's outstanding ROU assets and related lease liabilities at December 31, 2024 and 2023 and supplemental information for the years ended December 31, 2024 and 2023 (in millions, except lease terms and discount rates):\nDescription\nLocation on Balance Sheet\n2024\n2023\nAssets\nOperating Leases\nOther Assets\n$\n1,005\n \n$\n974\n \nFinance Leases\nProperty, Plant and Equipment, Net \n(1)\n141\n \n170\n \nTotal\n$\n1,146\n \n$\n1,144\n \nLiabilities\nCurrent\nOperating Leases\nCurrent Portion of Operating Lease Liabilities\n$\n315\n \n$\n325\n \nFinance Leases\nCurrent Portion of Long-Term Debt\n32\n \n34\n \nLong-Term\nOperating Leases\nOther Liabilities\n725\n \n676\n \nFinance Leases\nLong-Term Debt\n118\n \n149\n \nTotal\n$\n1,190\n \n$\n1,184\n \n(1)    Finance lease assets are recorded net of accumulated amortization of $\n219\n million and $\n190\n million at December 31, 2024 and 2023, respectively.\n2024\n2023\nWeighted Average Remaining Lease Term (in years):\nOperating Leases\n5.0\n5.3\nFinance Leases\n4.5\n5.5\nWeighted Average Discount Rate:\nOperating Leases\n4.6\n \n%\n4.3\n \n%\nFinance Leases\n2.6\n \n%\n2.6\n \n%\nF-32\nCash paid for leases for the years ended December 31, 2024, 2023 and 2022 was as follows (in millions):\n2024\n2023\n2022\nRepayment of Operating Lease Liabilities Associated with Operating Activities\n$\n226\n \n$\n226\n \n$\n199\n \nRepayment of Operating Lease Liabilities Associated with Investing Activities\n202\n \n172\n \n95\n \nRepayment of Finance Lease Liabilities\n33\n \n32\n \n35\n \nNon-cash leasing activities for the year ended December 31, 2024, included the additions of $\n403\n million of operating leases and \nno\n finance leases.  Non-cash leasing activities for the year ended December 31, 2023, included the additions of $\n727\n million of operating leases and \nno\n finance leases.  Non-cash leasing activities for the year ended December 31, 2022, included the additions of $\n511\n million of operating leases and \nno\n finance leases.  \nAt December 31, 2024, the future minimum lease payments under non-cancellable leases were as follows (in millions):\nOperating Leases\nFinance Leases\n2025\n$\n355\n \n$\n35\n \n2026\n240\n \n30\n \n2027\n152\n \n30\n \n2028\n131\n \n30\n \n2029\n117\n \n30\n \n2030 and beyond\n171\n \n4\n \nTotal Lease Payments\n1,166\n \n159\n \nLess: Discount to Present Value\n126\n \n9\n \nTotal Lease Liabilities\n1,040\n \n150\n \nLess: Current Portion of Lease Liabilities\n315\n \n32\n \nLong-Term Lease Liabilities\n$\n725\n \n$\n118\n \nAt December 31, 2024, EOG had additional minimum lease payments of $\n117\n million, which are expected to commence beginning in 2025 with lease terms of \ntwo\n to \nten years\n.\nF-33\nEOG RESOURCES, INC.\nSUPPLEMENTAL INFORMATION TO CONSOLIDATED FINANCIAL STATEMENTS\n(In Millions, Except Per Share Data, Unless Otherwise Indicated)\n(Unaudited)\nOil and Gas Producing Activities\nThe following disclosures are made in accordance with Financial Accounting Standards Board Accounting Standards Update No. 2010-03 \"Oil and Gas Reserve Estimation and Disclosures\" and the United States Securities and Exchange Commission's (SEC) final rule on \"Modernization of Oil and Gas Reporting.\" \nOil and Gas Reserves. \n Users of this information should be aware that the process of estimating quantities of \"proved,\" \"proved developed\" and \"proved undeveloped\" crude oil, natural gas liquids (NGLs) and natural gas reserves is complex, requiring significant subjective decisions in the evaluation of available geological, engineering and economic data for each reservoir.  The data for a given reservoir may also change substantially over time as a result of numerous factors, including, but not limited to, additional development activity; evolving production history; crude oil and condensate, NGLs and natural gas prices; continual reassessment of the viability of production under varying economic conditions; and improvements and other changes in geological, geophysical and engineering evaluation methods.  Consequently, material revisions (upward or downward) to existing reserve estimates may occur from time to time.  Although reasonable effort is made to ensure that reserve estimates reported represent the most accurate assessments possible, the significance of the subjective decisions required and variances in available data for various reservoirs make these estimates generally less precise than other estimates presented in connection with financial statement disclosures.  \nProved reserves represent estimated quantities of crude oil, NGLs and natural gas, which, by analysis of geoscience and engineering data, can be estimated, with reasonable certainty, to be economically producible from a given date forward from known reservoirs under then-existing economic conditions, operating methods and government regulations before the time at which contracts providing the right to operate expire, unless evidence indicates that renewal is reasonably certain, regardless of whether deterministic or probabilistic methods are used for the estimation.  The proved natural gas reserves reported are inclusive of natural gas consumed in operations.  \nProved developed reserves are proved reserves expected to be recovered under operating methods being utilized at the time the estimates were made, through wells and equipment in place or if the cost of any required equipment is relatively minor compared to the cost of a new well.\nProved undeveloped reserves (PUDs) are reserves that are expected to be recovered from new wells on undrilled acreage, or from existing wells where a relatively major expenditure is required for completion or recompletion.  Reserves on undrilled acreage are limited to those directly offsetting development spacing areas that are reasonably certain of production when drilled, unless evidence using reliable technology exists that establishes reasonable certainty of economic producibility at greater distances. PUDs can be recorded in respect of a particular undeveloped undrilled location only if the location is scheduled, under the then-current drilling and development plan, to be drilled within five years from the date that the PUDs were recorded, unless specific factors (such as those described in interpretative guidance issued by the Staff of the SEC) justify a longer timeframe.  Likewise, absent any such specific factors, PUDs associated with a particular undeveloped drilling location shall be removed from the estimates of proved reserves if the location is scheduled, under the then-current drilling and development plan, to be drilled on a date that is beyond five years from the date that the PUDs were recorded.  EOG has formulated development plans for all drilling locations associated with its PUDs at December 31, 2024.  Under these plans, each location will be drilled within five years from the date the associated PUDs were recorded.  Estimates for PUDs are not attributed to any acreage for which an application of fluid injection or other improved recovery technique is contemplated, unless such techniques have been proved effective by actual projects in the same reservoir or an analogous reservoir, or by other evidence using reliable technology establishing reasonable certainty.\nF-34\nEOG RESOURCES, INC.\nSUPPLEMENTAL INFORMATION TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nTo generate PUD estimates, EOG technical staff, including engineering and geological staff, perform a detailed technical analysis of each potential drilling location within its inventory of prospects.  To determine which of these locations would penetrate undrained portions of the reservoir that can be judged, with reasonable certainty, to be continuous and contain economically producible crude oil, NGLs, and natural gas, studies are conducted using numerous analysis techniques containing both static and dynamic data.\n \nThe geoscientists map the entire reservoir in question employing two-dimensional and three-dimensional seismic along with well logs and core data of existing penetrations.  The maps are integrated with other static data, including, but not limited to, petrophysical and mechanical properties of the formation plus thermal maturity indicators.  Often, highly specialized equipment is utilized to prepare and evaluate rock samples in assessing microstructures which contribute to porosity and permeability.\n \nIn addition, analysis of dynamic data is incorporated from offsets and analog wells to arrive at recoverable hydrocarbons.  Dynamic analysis methods employed include, but are not limited to, proprietary rate transient and pressure transient analysis techniques incorporating static and flowing pressures and production data.  These proprietary techniques in low permeability reservoirs quantify estimates of production contribution from hydraulic fractures, natural fractures, and rock matrix. \nThe impact of optimal completion techniques is a key factor in determining if the PUDs reflected in prospective locations are reasonably certain of being economically producible.  EOG's technical staff estimates the recovery improvement that might be achieved when completing horizontal wells with multi-stage fracture stimulation.  In the early stages of development of a play, EOG determines the optimal horizontal lateral spacing and multi-stage fracture stimulation using the aforementioned analysis techniques along with pilot drilling programs and gathering of microseismic data.\nThe process of analyzing static and dynamic data, well completion optimization data and the results of early development activities provides the appropriate level of certainty as well as support for the economic producibility of the plays in which PUDs are reflected.  EOG has found this approach to be effective based on successful application in analogous reservoirs in low permeability resource plays.\nCertain of EOG's Trinidad reserves are held under production sharing contracts where EOG's interest varies with prices and production volumes.  Trinidad reserves, as presented on a net basis, assume prices in existence at the time the estimates were made and EOG's estimate of future production volumes.  Future fluctuations in prices, production rates or changes in political or regulatory environments could cause EOG's share of future production from Trinidadian reserves to be materially different from that presented.\nEstimates of proved reserves at December 31, 2024, 2023 and 2022 were based on studies performed by the engineering staff of EOG.  The Engineering and Acquisitions Department is directly responsible for EOG's reserve evaluation process and consists of 17 engineers, all of whom hold, at a minimum, bachelor's degrees in engineering, and five of whom are Registered Professional Engineers.  The Vice President, Engineering and Acquisitions is the manager of this department and is the primary technical person responsible for this process.  The Vice President, Engineering and Acquisitions holds a Bachelor of Science degree in Petroleum Engineering, has 39 years of experience in reserve evaluations and is a Registered Professional Engineer.\nEOG's reserves estimation process is a collaborative effort coordinated by the Engineering and Acquisitions Department in compliance with EOG's internal controls for such process.  Reserve information as well as models used to estimate such reserves are stored on secured databases.  Non-technical inputs used in reserve estimation models, including crude oil, NGLs and natural gas prices, production costs, transportation costs, processing and applicable fractionation costs, future capital expenditures and EOG's net ownership percentages, are obtained from other departments within EOG.  EOG's Internal Audit Department conducts testing with respect to such non-technical inputs.  Additionally, EOG engages DeGolyer and MacNaughton (D&M), independent petroleum consultants, to perform independent reserves evaluation of select EOG properties comprising not less than 75% of EOG's estimates of proved reserves.  Pursuant to EOG's internal controls applicable to its reserves estimation process, EOG's reserve values for the properties evaluated must be within 5% of the values calculated by D&M in the aggregate.  Once completed, EOG's year-end reserves are presented to senior management, including the Chairman of the Board and Chief Executive Officer; the Executive Vice President and Chief Operating Officer; and the Executive Vice President and Chief Financial Officer, for approval.\nF-35\nEOG RESOURCES, INC.\nSUPPLEMENTAL INFORMATION TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nOpinions by D&M for the years ended December 31, 2024, 2023 and 2022 covered producing areas containing 85%, 83% and 80%, respectively, of proved reserves of EOG on a net-equivalent-barrel-of-oil basis.  D&M's opinions indicate that the estimates of proved reserves prepared by EOG's Engineering and Acquisitions Department for the properties reviewed by D&M, when compared in total on a net-equivalent-barrel-of-oil basis, do not differ materially from the estimates prepared by D&M.  Specifically, such estimates by D&M in the aggregate varied by not more than 5% from those prepared by the Engineering and Acquisitions Department of EOG.  All reports by D&M were developed utilizing geological and engineering data provided by EOG.  The report of D&M dated January 21, 2025, which contains further discussion of the reserve estimates and evaluations prepared by D&M, as well as the qualifications of D&M's technical person primarily responsible for overseeing such estimates and evaluations, is attached as Exhibit 99.1 to this Annual Report on Form 10-K and incorporated herein by reference.\nNo major discovery or other favorable or adverse event subsequent to December 31, 2024, is believed to have caused a material change in the estimates of net proved reserves as of that date.\nThe following tables set forth EOG's net proved reserves at December 31 for each of the four years in the period ended December 31, 2024, and the changes in the net proved reserves for each of the three years in the period ended December 31, 2024, as estimated by the Engineering and Acquisitions Department of EOG:\nF-36\nEOG RESOURCES, INC.\nSUPPLEMENTAL INFORMATION TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nNET PROVED RESERVE SUMMARY\n \nUnited\nStates\nTrinidad\nTotal\nNET PROVED RESERVES\nCrude Oil (MMBbl) \n(1)\nNet proved reserves at December 31, 2021\n1,546 \n2 \n1,548 \nRevisions of previous estimates\n120 \n— \n120 \nPurchases in place\n7 \n— \n7 \nExtensions, discoveries and other additions\n175 \n— \n175 \nSales in place\n(21)\n— \n(21)\nProduction\n(168)\n— \n(168)\nNet proved reserves at December 31, 2022\n1,659 \n2 \n1,661 \nRevisions of previous estimates\n56 \n— \n56 \nPurchases in place\n1 \n— \n1 \nExtensions, discoveries and other additions\n219 \n— \n219 \nSales in place\n(7)\n— \n(7)\nProduction\n(174)\n— \n(174)\nNet proved reserves at December 31, 2023\n1,754 \n2 \n1,756 \nRevisions of previous estimates\n71 \n— \n71 \nPurchases in place\n3 \n— \n3 \nExtensions, discoveries and other additions\n228 \n— \n228 \nSales in place\n(8)\n— \n(8)\nProduction\n(180)\n— \n(180)\nNet proved reserves at December 31, 2024\n1,868\n \n2\n \n1,870\n \nNatural Gas Liquids (MMBbl) \n(1)\n \n \n \nNet proved reserves at December 31, 2021\n829 \n— \n829 \nRevisions of previous estimates\n258 \n— \n258 \nPurchases in place\n4 \n— \n4 \nExtensions, discoveries and other additions\n140 \n— \n140 \nSales in place\n(14)\n— \n(14)\nProduction\n(72)\n— \n(72)\nNet proved reserves at December 31, 2022\n1,145 \n— \n1,145 \nRevisions of previous estimates\n26 \n— \n26 \nPurchases in place\n1 \n— \n1 \nExtensions, discoveries and other additions\n169 \n— \n169 \nSales in place\n(5)\n— \n(5)\nProduction\n(82)\n— \n(82)\nNet proved reserves at December 31, 2023\n1,254 \n— \n1,254 \nRevisions of previous estimates\n31 \n— \n31 \nPurchases in place\n2 \n— \n2 \nExtensions, discoveries and other additions\n164 \n— \n164 \nSales in place\n(3)\n— \n(3)\nProduction\n(90)\n— \n(90)\nNet proved reserves at December 31, 2024\n1,358\n \n—\n \n1,358\n \nF-37\nEOG RESOURCES, INC.\nSUPPLEMENTAL INFORMATION TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n \nUnited\nStates\nTrinidad\nTotal\nNatural Gas (Bcf) \n(2)\nNet proved reserves at December 31, 2021\n7,907 \n315 \n8,222 \nRevisions of previous estimates\n(271)\n18 \n(253)\nPurchases in place\n32 \n— \n32 \nExtensions, discoveries and other additions\n1,414 \n51 \n1,465 \nSales in place\n(316)\n— \n(316)\nProduction\n(493)\n(66)\n(559)\nNet proved reserves at December 31, 2022\n8,273 \n318 \n8,591 \nRevisions of previous estimates\n(327)\n12 \n(315)\nPurchases in place\n3 \n— \n3 \nExtensions, discoveries and other additions\n1,287 \n29 \n1,316 \nSales in place\n(28)\n— \n(28)\nProduction\n(578)\n(59)\n(637)\nNet proved reserves at December 31, 2023\n8,630 \n300 \n8,930 \nRevisions of previous estimates\n(202)\n2 \n(200)\nPurchases in place\n10 \n— \n10 \nExtensions, discoveries and other additions\n1,098 \n23 \n1,121 \nSales in place\n(14)\n— \n(14)\nProduction\n(644)\n(81)\n(725)\nNet proved reserves at December 31, 2024\n8,878\n \n244\n \n9,122\n \nF-38\nEOG RESOURCES, INC.\nSUPPLEMENTAL INFORMATION TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nUnited States\nTrinidad\nTotal\nOil Equivalents (MMBoe) \n(1)\nNet proved reserves at December 31, 2021\n3,693 \n54 \n3,747 \nRevisions of previous estimates \n(3)\n333 \n3 \n336 \nPurchases in place\n16 \n— \n16 \nExtensions, discoveries and other additions \n(4)\n551 \n9 \n560 \nSales in place\n(88)\n— \n(88)\nProduction\n(322)\n(11)\n(333)\nNet proved reserves at December 31, 2022\n4,183 \n55 \n4,238 \nRevisions of previous estimates \n(3)\n28 \n1 \n29 \nPurchases in place\n2 \n— \n2 \nExtensions, discoveries and other additions \n(5)\n602 \n5 \n607 \nSales in place\n(17)\n— \n(17)\nProduction\n(351)\n(10)\n(361)\nNet proved reserves at December 31, 2023\n4,447 \n51 \n4,498 \nRevisions of previous estimates \n(3)\n68 \n1 \n69 \nPurchases in place\n6 \n— \n6 \nExtensions, discoveries and other additions \n(6)\n576 \n4 \n580 \nSales in place\n(14)\n— \n(14)\nProduction\n(377)\n(14)\n(391)\nNet proved reserves at December 31, 2024\n4,706\n \n42\n \n4,748\n \n(1)\nMillion barrels or million barrels of oil equivalent, as applicable; oil equivalents include crude oil and condensate, NGLs and natural gas. Oil equivalents are determined using a ratio of 1.0 barrel of crude oil and condensate or NGLs to 6.0 thousand cubic feet of natural gas.\n(2)\nBillion cubic feet.\n(3)\nSee \"Reconciliation of Revisions of Previous Estimates\" below for additional discussion.\n(4)\nChange in net proved reserves for the year ended December 31, 2022, attributable to extensions, discoveries and other additions was 150 MMBoe greater than the corresponding change in PUDs for such year.  Such difference represents new proved developed reserves attributable to wells drilled during 2022, primarily in the Permian Basin and Gulf Coast Basin, that did not have any associated PUDs recorded at the beginning of 2022.  The reserves added as new PUDs for the year ended December 31, 2022, attributable to extensions and discoveries were 410 MMBoe and were primarily in the Permian Basin.  See \"Net Proved Undeveloped Reserves\" below.\n(5)\nChange in net proved reserves for the year ended December 31, 2023, attributable to extensions, discoveries and other additions was 91 MMBoe greater than the corresponding change in PUDs for such year.  Such difference represents new proved developed reserves attributable to wells drilled during 2023, primarily in the Permian Basin, that did not have any associated PUDs recorded at the beginning of 2023.  The reserves added as new PUDs for the year ended December 31, 2023, attributable to extensions and discoveries were 516 MMBoe and were primarily in the Permian Basin.  See \"Net Proved Undeveloped Reserves\" below.\n(6)\nChange in net proved reserves for the year ended December 31, 2024, attributable to extensions, discoveries and other additions was 101 MMBoe greater than the corresponding change in PUDs for such year.  Such difference represents new proved developed reserves attributable to wells drilled during 2024, primarily in the Permian Basin, that did not have any associated PUDs recorded at the beginning of 2024.  The reserves added as new PUDs for the year ended December 31, 2024, attributable to extensions and discoveries were 479 MMBoe and were primarily in the Permian Basin.  See \"Net Proved Undeveloped Reserves\" below.\nF-39\nEOG RESOURCES, INC.\nSUPPLEMENTAL INFORMATION TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nDuring 2024, EOG added 580 million barrels of oil equivalent (MMBoe) of proved reserves from drilling activities and technical evaluation of major proved areas, primarily in the Permian Basin and Utica.  Approximately 68% of the 2024 reserve additions were crude oil and condensate and NGLs, and substantially all were in the United States.  Sales in place of 14 MMBoe were primarily related to the exchange of assets in the Gulf Coast Basin.  Refer to \"Reconciliation of Revisions of Previous Estimates\" below for factors impacting revisions of previous estimates.  Purchases in place of 6 MMBoe were primarily related to the Permian Basin and the purchase or exchange of other assets.\nDuring 2023, EOG added 607 MMBoe of proved reserves from drilling activities and technical evaluation of major proved areas, primarily in the Permian Basin and Gulf Coast Basin.  Approximately 64% of the 2023 reserve additions were crude oil and condensate and NGLs, and substantially all were in the United States.  Sales in place of 17 MMBoe were primarily related to the sale of assets in the Permian Basin and the Anadarko Basin and the sale or exchange of other producing assets.  Refer to \"Reconciliation of Revisions of Previous Estimates\" below for factors impacting revisions of previous estimates.  Purchases in place of 2 MMBoe were primarily related to the Permian Basin and the purchase or exchange of other producing assets.\nDuring 2022, EOG added 560 MMBoe of proved reserves from drilling activities and technical evaluation of major proved areas, primarily in the Permian Basin and Gulf Coast Basin.  Approximately 56% of the 2022 reserve additions were crude oil and condensate and NGLs, and substantially all were in the United States.  Sales in place of 88 MMBoe were primarily related to the sale of assets in the Rocky Mountain area and the Anadarko Basin and the sale or exchange of other producing assets.  Refer to \"Reconciliation of Revisions of Previous Estimates\" below for factors impacting revisions of previous estimates.  Purchases in place of 16 MMBoe were primarily related to the Permian Basin and the purchase or exchange of other producing assets.\nF-40\nEOG RESOURCES, INC.\nSUPPLEMENTAL INFORMATION TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\n \nUnited\nStates\nTrinidad\nTotal\nNET PROVED DEVELOPED RESERVES\nCrude Oil (MMBbl)\nDecember 31, 2021\n886 \n— \n886 \nDecember 31, 2022\n948 \n— \n948 \nDecember 31, 2023\n983 \n— \n983 \nDecember 31, 2024\n1,033 \n— \n1,033 \nNatural Gas Liquids (MMBbl)\n \n \n \nDecember 31, 2021\n416 \n— \n416 \nDecember 31, 2022\n561 \n— \n561 \nDecember 31, 2023\n625 \n— \n625 \nDecember 31, 2024\n700 \n— \n700 \nNatural Gas (Bcf)\n \n \n \nDecember 31, 2021\n3,743 \n131 \n3,874 \nDecember 31, 2022\n3,920 \n137 \n4,057 \nDecember 31, 2023\n4,283 \n161 \n4,444 \nDecember 31, 2024\n4,850 \n144 \n4,994 \nOil Equivalents (MMBoe)\n \n \n \nDecember 31, 2021\n1,926 \n22 \n1,948 \nDecember 31, 2022\n2,162 \n23 \n2,185 \nDecember 31, 2023\n2,322 \n27 \n2,349 \nDecember 31, 2024\n2,542 \n24 \n2,566 \nNET PROVED UNDEVELOPED RESERVES\n \n \n \nCrude Oil (MMBbl)\n \n \n \nDecember 31, 2021\n660 \n2 \n662 \nDecember 31, 2022\n711 \n2 \n713 \nDecember 31, 2023\n771 \n2 \n773 \nDecember 31, 2024\n835 \n2 \n837 \nNatural Gas Liquids (MMBbl)\n \n \n \nDecember 31, 2021\n413 \n— \n413 \nDecember 31, 2022\n584 \n— \n584 \nDecember 31, 2023\n629 \n— \n629 \nDecember 31, 2024\n658 \n— \n658 \nNatural Gas (Bcf)\n \n \n \nDecember 31, 2021\n4,164 \n184 \n4,348 \nDecember 31, 2022\n4,353 \n181 \n4,534 \nDecember 31, 2023\n4,347 \n139 \n4,486 \nDecember 31, 2024\n4,028 \n100 \n4,128 \nOil Equivalents (MMBoe)\n \n \n \nDecember 31, 2021\n1,767 \n32 \n1,799 \nDecember 31, 2022\n2,021 \n32 \n2,053 \nDecember 31, 2023\n2,125 \n24 \n2,149 \nDecember 31, 2024\n2,164 \n18 \n2,182 \nF-41\nEOG RESOURCES, INC.\nSUPPLEMENTAL INFORMATION TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nNet Proved Undeveloped Reserves.\n  The following table presents the changes in EOG's total PUDs during 2024, 2023 and 2022 (in MMBoe):\n \n2024\n2023\n2022\nBalance at January 1\n2,149 \n2,053 \n1,799 \nExtensions and Discoveries \n(1)\n479 \n516 \n410 \nRevisions \n(2)\n(66)\n(51)\n141 \nAcquisition of Reserves\n3 \n— \n10 \nSale of Reserves\n(13)\n(9)\n(14)\nConversion to Proved Developed Reserves\n(370)\n(360)\n(293)\nBalance at December 31\n2,182 \n2,149 \n2,053 \n(1)\nSee \"Net Proved Reserves\" table and accompanying notes above for additional discussion regarding changes in reserves attributable to extensions, discoveries and other additions.\n(2)\nSee \"Reconciliation of Revisions of Previous Estimates\" below for additional discussion.\nFor the twelve-month period ended December 31, 2024, total PUDs increased by 33 MMBoe to 2,182 MMBoe.  EOG added approximately 25 MMBoe of PUDs through drilling activities where the wells were drilled but significant expenditures remained for completion.  Based on the technology employed by EOG to identify and record PUDs (see discussion of technology employed on pages F-34 - F-36 of this Annual Report on Form 10-K), EOG added 454 MMBoe of PUDs.  The PUD additions were primarily in the Permian Basin and 68% of the additions were crude oil and condensate and NGLs.  During 2024, EOG drilled and transferred 370 MMBoe of PUDs to proved developed reserves at a total capital cost of $2,609 million.  Refer to \"Reconciliation of Revisions of Previous Estimates\" below for factors impacting revisions of previous estimates. All PUDs, including drilled but uncompleted wells (DUCs), are scheduled for completion within five years of the original reserve booking.\nFor the twelve-month period ended December 31, 2023, total PUDs increased by 96 MMBoe to 2,149 MMBoe.  EOG added approximately 44 MMBoe of PUDs through drilling activities where the wells were drilled but significant expenditures remained for completion.  Based on the technology employed by EOG to identify and record PUDs, EOG added 472 MMBoe of PUDs.  The PUD additions were primarily in the Permian Basin and 65% of the additions were crude oil and condensate and NGLs.  During 2023, EOG drilled and transferred 360 MMBoe of PUDs to proved developed reserves at a total capital cost of $2,801 million.  Refer to \"Reconciliation of Revisions of Previous Estimates\" below for factors impacting revisions of previous estimates. All PUDs, including drilled but uncompleted wells (DUCs), are scheduled for completion within five years of the original reserve booking.\nFor the twelve-month period ended December 31, 2022, total PUDs increased by 254 MMBoe to 2,053 MMBoe.  EOG added approximately 25 MMBoe of PUDs through drilling activities where the wells were drilled but significant expenditures remained for completion.  Based on the technology employed by EOG to identify and record PUDs, EOG added 385 MMBoe of PUDs.  The PUD additions were primarily in the Permian Basin and 57% of the additions were crude oil and condensate and NGLs.  During 2022, EOG drilled and transferred 293 MMBoe of PUDs to proved developed reserves at a total capital cost of $2,286 million.  Refer to \"Reconciliation of Revisions of Previous Estimates\" below for factors impacting revisions of previous estimates. All PUDs, including DUCs, are scheduled for completion within five years of the original reserve booking.\nF-42\nEOG RESOURCES, INC.\nSUPPLEMENTAL INFORMATION TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nReconciliation of Revisions of Previous Estimates\n.  As an initial step in determining the revisions to be made to EOG's net proved reserves estimates for the prior year-end, EOG's technical staff reviews its updated drilling and development plan.  As discussed above, if under such plan an undeveloped drilling location for which PUD reserves were previously recorded will not be drilled within five years from the date that the PUD reserves were recorded, such PUD reserves are removed from EOG's estimates of net proved reserves.  To the extent EOG's updated drilling and development plan includes new proved locations, the proved reserves associated with such locations are incorporated into EOG's estimates of net proved reserves.\nPursuant to such process, EOG's technical staff included a net negative revision of 83 MMBoe of PUD reserves to its net proved reserves for the year ended December 31, 2024 and a net positive revision of 45 MMBoe and 79 MMBoe of PUD reserves from its net proved reserves for the years ended December 31, 2023 and 2022, respectively.\nEOG's technical staff then evaluates the following six inter-related factors (in the order indicated below) in respect of the net proved reserves associated with each of its well locations:\n•\ncrude oil, NGLs and natural gas prices; \n•\nEOG's well performance forecasts; \n•\nmarketing-related changes (i.e., relating to the sale of EOG's production); \n•\nchanges in EOG's ownership interests (in its well locations); \n•\nproduction costs, gathering, processing and transportation costs (collectively, operating costs) and changes therein; and\n•\ninvestments in future wells and/or recompletions and changes therein.\nEOG's evaluation of such inter-related factors resulted in the following revisions to its net proved reserves and net PUD reserves for the years ended December 31, 2024, 2023 and 2022.\nF-43\nEOG RESOURCES, INC.\nSUPPLEMENTAL INFORMATION TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nYear Ended December 31, 2024\nReview of Updated Plan\nRevision to Net Proved Reserves (MMBoe)\nRevision to Net PUD Reserves (MMBoe)\nExplanation\nRevision related to addition of PUD reserves pursuant to review of updated drilling and development plan\n(83)\n(83)\nSee above related discussion.\nEvaluation of Inter-Related Factors\nPrices for crude oil, NGLs and natural gas\n(146)\n(105)\nDownward revisions attributable to a decrease in the average prices used in EOG's year-end 2024 reserves estimates as compared to the average prices used in EOG's year-end 2023 reserves estimates.\nWell performance forecasts\n248 \n93 \nRevisions attributable to EOG's forecasted changes in well performance in certain locations, including the increase in lateral lengths in the 2024 development program and on existing PUDs.\nMarketing-related changes (e.g., ethane recovery elections) relating to the sale of production\n(2)\n2 \nRevisions attributable to changes in production mix processed in 2024 vs 2023.\nOwnership interest changes\n(6)\n(4)\nRevisions attributable to ownership interest changes.\nChanges in operating costs\n32 \n16 \nUpward revision attributable to decreased gathering, processing and transportation costs, resulting in an increase in reserves that are economically producible.\nInvestments\n26 \n15 \nReduced investments for certain PUDs and proved developed non-producing reserves that resulted in them becoming economic for 2024 compared to 2023 investments.\nNet Revisions Attributable to Inter-Related Factors\n152\n17\nTotal Revisions\n69\n(66)\nF-44\nEOG RESOURCES, INC.\nSUPPLEMENTAL INFORMATION TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nYear Ended December 31, 2023\nReview of Updated Plan\nRevision to Net Proved Reserves (MMBoe)\nRevision to Net PUD Reserves (MMBoe)\nExplanation\nRevision related to addition of PUD reserves pursuant to review of updated drilling and development plan\n45\n45\nSee above related discussion.\nEvaluation of Inter-Related Factors\nPrices for crude oil, NGLs and natural gas\n(110)\n(68)\nDownward revisions attributable to a decrease in the average prices used in EOG's year-end 2023 reserves estimates as compared to the average prices used in EOG's year-end 2022 reserves estimates.\nWell performance forecasts\n12 \n(97)\nRevisions attributable to EOG's forecasted changes in well performance in certain locations.\nMarketing-related changes (e.g., ethane recovery elections) relating to the sale of production\n— \n— \nImmaterial\nOwnership interest changes\n4 \n8 \nRevisions attributable to ownership interest changes.\nChanges in operating costs\n66 \n50 \nUpward revision attributable to decreased operating costs, resulting in an increase in reserves that are economically producible.\nInvestments\n12 \n11 \nReduced investments for certain PUDs and proved developed non-producing reserves that resulted in them becoming economic for 2023 compared to 2022 investments\nNet Revisions Attributable to Inter-Related Factors\n(16)\n(96)\nTotal Revisions\n29\n(51)\nF-45\nEOG RESOURCES, INC.\nSUPPLEMENTAL INFORMATION TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nYear Ended December 31, 2022\nReview of Updated Plan\nRevision to Net Proved Reserves (MMBoe)\nRevision to Net PUD Reserves (MMBoe)\nExplanation\nRevision related to addition of PUD reserves pursuant to review of updated drilling and development plan\n79\n79\nSee above related discussion.\nEvaluation of Inter-Related Factors\nPrices for crude oil, NGLs and natural gas\n11\n2\nUpward revisions attributable to an increase in the average prices used in EOG's year-end 2022 reserves estimates as compared to the average prices used in EOG's year-end 2021 reserves estimates.\nWell performance forecasts\n104\n(9)\nRevisions attributable to EOG's forecasted changes in well performance in certain locations.\nMarketing-related changes (e.g., ethane recovery elections) relating to the sale of production\n151\n68\nUpward revisions attributable to EOG's \"ethane recovery\" elections during 2022 - that is, EOG's elections to increase receipt of ethane (an NGL) from the natural gas stream and reduce the total volume of residue natural gas at the tailgate of the processing plant.  The additional NGL reserves attributable to such elections outweigh the lower natural gas reserves.\nOwnership interest changes\n(2)\n1\nRevisions attributable to ownership interest changes.\nChanges in operating costs\n(7)\n— \nDownward revision attributable to increased operating costs, resulting in a decrease in reserves that are economically producible.\nNet Revisions Attributable to Inter-Related Factors\n257\n62\nTotal Revisions\n336\n141\nF-46\nEOG RESOURCES, INC.\nSUPPLEMENTAL INFORMATION TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nCapitalized Costs Relating to Oil and Gas Producing Activities.\n  The following table sets forth the capitalized costs relating to EOG's crude oil, NGLs and natural gas producing activities at December 31, 2024 and 2023 (in millions):\n \n2024\n2023\nProved properties\n$\n74,789 \n$\n69,618 \nUnproved properties\n2,302 \n2,472 \nTotal\n77,091 \n72,090 \nAccumulated depreciation, depletion and amortization\n(47,155)\n(43,323)\nNet capitalized costs\n$\n29,936\n \n$\n28,767\n \nCosts Incurred in Oil and Gas Property Acquisition, Exploration and Development Activities.\n  The acquisition, exploration and development costs disclosed in the following tables are in accordance with definitions in the Extractive Industries - Oil and Gas Topic of the Accounting Standards Codification (ASC).\nAcquisition costs include costs incurred to purchase, lease or otherwise acquire property.\nExploration costs include additions to exploratory wells, including those in progress, and exploration expenses.\nDevelopment costs include additions to production facilities and equipment and additions to development wells, including those in progress.\nF-47\nEOG RESOURCES, INC.\nSUPPLEMENTAL INFORMATION TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe following table sets forth costs incurred related to EOG's oil and gas activities for the years ended December 31, 2024, 2023 and 2022 (in millions):\n \nUnited\nStates\nTrinidad\nOther\nInternational \n(1)\nTotal\n2024\nAcquisition Costs of Properties\nUnproved \n(2)\n$\n229 \n$\n— \n$\n1 \n$\n230 \nProved \n(3)\n33 \n— \n— \n33 \nSubtotal\n262 \n— \n1 \n263 \nExploration Costs\n286 \n115 \n28 \n429 \nDevelopment Costs \n(4)\n4,783 \n132 \n27 \n4,942 \nTotal\n$\n5,331 \n$\n247 \n$\n56 \n$\n5,634 \n2023\n \n \n \n \nAcquisition Costs of Properties\n \n \n \n \nUnproved \n(5)\n$\n207 \n$\n— \n$\n— \n$\n207 \nProved \n(6)\n16 \n— \n— \n16 \nSubtotal\n223 \n— \n— \n223 \nExploration Costs\n370 \n53 \n14 \n437 \nDevelopment Costs \n(7)\n5,228 \n117 \n13 \n5,358 \nTotal\n$\n5,821 \n$\n170 \n$\n27 \n$\n6,018 \n2022\n \n \n \n \nAcquisition Costs of Properties\n \n \n \n \nUnproved \n(8)\n$\n186 \n$\n— \n$\n— \n$\n186 \nProved \n(9)\n419 \n— \n— \n419 \nSubtotal\n605 \n— \n— \n605 \nExploration Costs\n263 \n84 \n17 \n364 \nDevelopment Costs \n(10)\n4,106 \n145 \n9 \n4,260 \nTotal\n$\n4,974 \n$\n229 \n$\n26 \n$\n5,229 \n(1)\nOther International primarily consists of EOG's Australia and Canada Operations.  EOG is continuing the process of exiting its Canada operations.  EOG exited Block 36 and Block 49 in Oman in 2023.\n(2)\nIncludes non-cash unproved leasehold acquisition costs of $85 million related to property exchanges.\n(3)\nIncludes non-cash proved property acquisition costs of $24 million related to property exchanges.\n(4)\nIncludes Asset Retirement Costs of $(37) million, $8 million and $27 million for the United States, Trinidad and Other International, respectively.  Excludes other property, plant and equipment.\n(5)\nIncludes non-cash unproved leasehold acquisition costs of $99 million related to property exchanges.\n(6)\nIncludes non-cash proved property acquisition costs of $6 million related to property exchanges.\n(7)\nIncludes Asset Retirement Costs of $241 million, $3 million and $13 million for the United States, Trinidad and Other International, respectively.  Includes non-cash development drilling costs of $90 million.  Excludes other property, plant and equipment.\n(8)\nIncludes non-cash unproved leasehold acquisition costs of $127 million related to property exchanges.\n(9)\nIncludes non-cash proved property acquisition costs of $26 million related to property exchanges.\n(10)\nIncludes Asset Retirement Costs of $208 million, $81 million and $9 million for the United States, Trinidad and Other International, respectively.  Excludes other property, plant and equipment.\nF-48\nEOG RESOURCES, INC.\nSUPPLEMENTAL INFORMATION TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nResults of Operations for Oil and Gas Producing Activities\n \n(1)\n. The following table sets forth results of operations for oil and gas producing activities for the years ended December 31, 2024, 2023 and 2022 (in millions):\nUnited\nStates\nTrinidad\nOther\nInternational \n(2)\nTotal\n2024\nCrude Oil and Condensate, Natural Gas Liquids and Natural Gas Revenues\n$\n17,263 \n$\n315 \n$\n— \n$\n17,578 \nOther\n99 \n— \n— \n99 \nTotal\n17,362 \n315 \n— \n17,677 \nExploration Costs\n154 \n4 \n16 \n174 \nDry Hole Costs\n1 \n13 \n— \n14 \nGathering, Processing and Transportation Costs \n(3)\n1,722 \n— \n— \n1,722 \nProduction Costs\n2,741 \n40 \n1 \n2,782 \nImpairments\n354 \n2 \n35 \n391 \nDepreciation, Depletion and Amortization\n3,765 \n138 \n1 \n3,904 \nIncome (Loss) Before Income Taxes\n8,625 \n118 \n(53)\n8,690 \nIncome Tax Provision\n1,887 \n6 \n(3)\n1,890 \nResults of Operations\n$\n6,738 \n$\n112 \n$\n(50)\n$\n6,800 \n2023\n \n \n \n \nCrude Oil and Condensate, Natural Gas Liquids and Natural Gas Revenues\n$\n17,148 \n$\n228 \n$\n— \n$\n17,376 \nOther\n91 \n— \n— \n91 \nTotal\n17,239 \n228 \n— \n17,467 \nExploration Costs\n166 \n4 \n11 \n181 \nDry Hole Costs\n1 \n— \n— \n1 \nGathering, Processing and Transportation Costs \n(3)\n1,620 \n— \n— \n1,620 \nProduction Costs\n2,657 \n45 \n1 \n2,703 \nImpairments\n184 \n— \n18 \n202 \nDepreciation, Depletion and Amortization\n3,244 \n78 \n— \n3,322 \nIncome (Loss) Before Income Taxes\n9,367 \n101 \n(30)\n9,438 \nIncome Tax Provision\n2,056 \n8 \n(2)\n2,062 \nResults of Operations\n$\n7,311 \n$\n93 \n$\n(28)\n$\n7,376 \n2022\n \n \n \n \nCrude Oil and Condensate, Natural Gas Liquids and Natural Gas Revenues\n$\n22,486 \n$\n310 \n$\n— \n$\n22,796 \nOther\n118 \n— \n— \n118 \nTotal\n22,604 \n310 \n— \n22,914 \nExploration Costs\n145 \n4 \n10 \n159 \nDry Hole Costs\n22 \n21 \n2 \n45 \nGathering, Processing and Transportation Costs \n(3)\n1,587 \n— \n— \n1,587 \nProduction Costs\n2,833 \n41 \n2 \n2,876 \nImpairments\n340 \n28 \n14 \n382 \nDepreciation, Depletion and Amortization\n3,314 \n72 \n— \n3,386 \nIncome (Loss) Before Income Taxes\n14,363 \n144 \n(28)\n14,479 \nIncome Tax Provision\n3,129 \n60 \n(2)\n3,187 \nResults of Operations\n$\n11,234 \n$\n84 \n$\n(26)\n$\n11,292 \n(1)\nExcludes gains or losses on the mark-to-market of financial commodity and other derivative contracts, gains or losses on sales of reserves and related assets, interest charges and general corporate expenses for each of the three years in the period ended December 31, 2024.\n(2)\nOther International primarily consists of EOG's Australia and Canada Operations.  EOG is continuing the process of exiting its Canada operations.  EOG exited Block 36 and Block 49 in Oman in 2023.\n(3)\nEffective January 1, 2024, EOG combined Transportation Costs and Gathering and Processing Costs into one line item titled Gathering, Processing and Transportation Costs.\nF-49\nEOG RESOURCES, INC.\nSUPPLEMENTAL INFORMATION TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe following table sets forth production costs per barrel of oil equivalent, excluding severance/production and ad valorem taxes, for the years ended December 31, 2024, 2023 and 2022:\n \nUnited\nStates\nTrinidad\nComposite\nYear Ended December 31, 2024\n$\n4.06 \n$\n2.90 \n$\n4.02 \nYear Ended December 31, 2023\n$\n4.01 \n$\n4.19 \n$\n4.02 \nYear Ended December 31, 2022\n$\n4.02 \n$\n3.11 \n$\n3.99 \nStandardized Measure of Discounted Future Net Cash Flows Relating to Proved Oil and Gas Reserves.\n  The following information has been developed utilizing procedures prescribed by the Extractive Industries - Oil and Gas Topic of the ASC and based on crude oil, NGL and natural gas reserves and production volumes estimated by the Engineering and Acquisitions Department of EOG.  The estimates were based on a 12-month average for commodity prices for the years 2024, 2023 and 2022.  The following information may be useful for certain comparative purposes, but should not be solely relied upon in evaluating EOG or its performance.  Further, information contained in the following table should not be considered as representative of realistic assessments of future cash flows, nor should the Standardized Measure of Discounted Future Net Cash Flows be viewed as representative of the current value of EOG.\nThe future cash flows presented below are based on sales prices, cost rates and statutory income tax rates in existence as of the date of the projections.  It is expected that material revisions to some estimates of crude oil, NGL and natural gas reserves may occur in the future, development and production of the reserves may occur in periods other than those assumed, and actual prices realized and costs incurred may vary significantly from those used.\nManagement does not rely upon the following information in making investment and operating decisions.  Such decisions are based upon a wide range of factors, including estimates of probable and possible reserves as well as proved reserves, and varying price and cost assumptions considered more representative of a range of possible economic conditions that may be anticipated.\nF-50\nEOG RESOURCES, INC.\nSUPPLEMENTAL INFORMATION TO CONSOLIDATED FINANCIAL STATEMENTS (Continued)\nThe following table sets forth the standardized measure of discounted future net cash flows from projected production of EOG's oil and gas reserves for the years ended December 31, 2024, 2023 and 2022 (in millions):\n \nUnited\nStates\nTrinidad\nTotal\n2024\nFuture cash inflows \n(1)\n$\n187,008 \n$\n941 \n$\n187,949 \nFuture production costs\n(62,755)\n(269)\n(63,024)\nFuture development costs \n(2)\n(19,228)\n(282)\n(19,510)\nFuture income taxes\n(22,137)\n(20)\n(22,157)\nFuture net cash flows\n82,888 \n370 \n83,258 \nDiscount to present value at 10% annual rate\n(39,584)\n(47)\n(39,631)\nStandardized measure of discounted future net cash flows relating to proved oil and gas reserves\n$\n43,304 \n$\n323 \n$\n43,627 \n2023\n \n \n \nFuture cash inflows \n(3)\n$\n188,585 \n$\n1,101 \n$\n189,686 \nFuture production costs\n(65,349)\n(245)\n(65,594)\nFuture development costs \n(4)\n(20,070)\n(406)\n(20,476)\nFuture income taxes\n(21,632)\n(40)\n(21,672)\nFuture net cash flows\n81,534 \n410 \n81,944 \nDiscount to present value at 10% annual rate\n(38,879)\n(73)\n(38,952)\nStandardized measure of discounted future net cash flows relating to proved oil and gas reserves\n$\n42,655 \n$\n337 \n$\n42,992 \n2022\n \n \n \nFuture cash inflows \n(5)\n$\n259,217 \n$\n1,189 \n$\n260,406 \nFuture production costs\n(58,021)\n(248)\n(58,269)\nFuture development costs \n(6)\n(17,837)\n(471)\n(18,308)\nFuture income taxes\n(39,560)\n(31)\n(39,591)\nFuture net cash flows\n143,799 \n439 \n144,238 \nDiscount to present value at 10% annual rate\n(69,587)\n(79)\n(69,666)\nStandardized measure of discounted future net cash flows relating to proved oil and gas reserves\n$\n74,212 \n$\n360 \n$\n74,572 \n(1)\nEstimated crude oil prices used to calculate 2024 future cash inflows for the United States and Trinidad were $77.37 and $63.95, respectively.  Estimated NGL price used to calculate 2024 future cash inflows for the United States was $20.24.  Estimated natural gas prices used to calculate 2024 future cash inflows for the United States and Trinidad were $1.69 and $3.41, respectively.\n(2)\nFuture abandonment costs included in 2024 future development costs for the United States and Trinidad were $1,989 million and $192 million, respectively.  \n(3)\nEstimated crude oil prices used to calculate 2023 future cash inflows for the United States and Trinidad were $80.00 and $68.59, respectively.  Estimated NGL price used to calculate 2023 future cash inflows for the United States was $19.94.  Estimated natural gas prices used to calculate 2023 future cash inflows for the United States and Trinidad were $2.69 and $3.33, respectively.\n(4)\nFuture abandonment costs included in 2023 future development costs for the United States and Trinidad were $2,104 million and $193 million, respectively.\n(5)\nEstimated crude oil prices used to calculate 2022 future cash inflows for the United States and Trinidad were $96.44 and $85.90, respectively.  Estimated NGLs price used to calculate 2022 future cash inflows for the United States was $36.35.  Estimated natural gas prices used to calculate 2022 future cash inflows for the United States and Trinidad were $6.96 and $3.28, respectively.\n(6)\nFuture abandonment costs included in 2022 future development costs for the United States and Trinidad were $1,578 million and $188 million, respectively.\nF-51\nEOG RESOURCES, INC.\nSUPPLEMENTAL INFORMATION TO CONSOLIDATED FINANCIAL STATEMENTS (Concluded)\nChanges in Standardized Measure of Discounted Future Net Cash Flows.  \nThe following table sets forth the changes in the standardized measure of discounted future net cash flows at December 31, for each of the three years in the period ended December 31, 2024 (in millions):\n \nUnited\nStates\nTrinidad\nOther\nInternational \n(1)\nTotal\nDecember 31, 2021\n$\n45,861 \n$\n325 \n$\n— \n$\n46,186 \nSales and transfers of oil and gas produced, net of production costs\n(18,064)\n(269)\n1 \n(18,332)\nNet changes in prices and production costs\n30,987 \n86 \n— \n31,073 \nExtensions, discoveries, additions and improved recovery, net of related costs\n10,422 \n128 \n— \n10,550 \nDevelopment costs incurred\n2,286 \n— \n— \n2,286 \nRevisions of estimated development cost\n(2,290)\n(70)\n— \n(2,360)\nRevisions of previous quantity estimates\n8,324 \n40 \n— \n8,364 \nAccretion of discount\n5,771 \n38 \n— \n5,809 \nNet change in income taxes\n(8,059)\n50 \n— \n(8,009)\nPurchases of reserves in place\n400 \n— \n— \n400 \nSales of reserves in place\n(760)\n— \n— \n(760)\nChanges in timing and other\n(666)\n32 \n(1)\n(635)\nDecember 31, 2022\n$\n74,212 \n$\n360 \n$\n— \n$\n74,572 \nSales and transfers of oil and gas produced, net of production costs\n(12,872)\n(182)\n— \n(13,054)\nNet changes in prices and production costs\n(41,377)\n8 \n— \n(41,369)\nExtensions, discoveries, additions and improved recovery, net of related costs\n4,825 \n42 \n— \n4,867 \nDevelopment costs incurred\n2,801 \n48 \n— \n2,849 \nRevisions of estimated development cost\n(644)\n13 \n— \n(631)\nRevisions of previous quantity estimates\n381 \n27 \n— \n408 \nAccretion of discount\n9,411 \n37 \n— \n9,448 \nNet change in income taxes\n9,250 \n(18)\n— \n9,232 \nPurchases of reserves in place\n31 \n— \n— \n31 \nSales of reserves in place\n(294)\n— \n— \n(294)\nChanges in timing and other\n(3,069)\n2 \n— \n(3,067)\nDecember 31, 2023\n$\n42,655 \n$\n337 \n$\n— \n$\n42,992 \nSales and transfers of oil and gas produced, net of production costs\n(12,800)\n(274)\n— \n(13,074)\nNet changes in prices and production costs\n(1,695)\n33 \n— \n(1,662)\nExtensions, discoveries, additions and improved recovery, net of related costs\n5,442 \n34 \n— \n5,476 \nDevelopment costs incurred\n2,609 \n28 \n— \n2,637 \nRevisions of estimated development cost\n1,197 \n74 \n— \n1,271 \nRevisions of previous quantity estimates\n899 \n7 \n— \n906 \nAccretion of discount\n5,331 \n36 \n— \n5,367 \nNet change in income taxes\n(253)\n9 \n— \n(244)\nPurchases of reserves in place\n75 \n— \n— \n75 \nSales of reserves in place\n(102)\n— \n— \n(102)\nChanges in timing and other\n(54)\n38 \n— \n(16)\nDecember 31, 2024\n$\n43,304\n \n$\n322\n \n$\n—\n \n$\n43,626\n \n(1)    Other International primarily consists of EOG's Australia and Canada Operations.  EOG is continuing the process of exiting its Canada operations.  EOG exited Block 36 and Block 49 in Oman in 2023.\nF-52\nEXHIBITS\nExhibits not incorporated herein by reference to a prior filing are designated by (i) an asterisk (*) and are filed herewith; or (ii) a pound sign (#) and are not filed herewith, and, pursuant to Item 601(b)(4)(iii)(A) of Regulation S-K, the registrant hereby agrees to furnish a copy of such exhibit to the United States Securities and Exchange Commission (SEC) upon request.\nExhibit\nNumber\n \n \nDescription\n    3.1(a)\n-\nRestated Certificate of Incorporation, dated September 3, 1987 (Exhibit 3.1(a) to EOG's Annual Report on Form 10-K for the year ended December 31, 2008) (SEC File No. 001-09743).\n    3.1(b)\n-\nCertificate of Amendment of Restated Certificate of Incorporation, dated May 5, 1993 (Exhibit 4.1(b) to EOG's Registration Statement on Form S-8, SEC File No. 33-52201, filed February 8, 1994).\n    3.1(c)\n-\nCertificate of Amendment of Restated Certificate of Incorporation, dated June 14, 1994 (Exhibit 4.1(c) to EOG's Registration Statement on Form S-8, SEC File No. 33-58103, filed March 15, 1995).\n    3.1(d)\n-\nCertificate of Amendment of Restated Certificate of Incorporation, dated June 11, 1996 (Exhibit 3(d) to EOG's Registration Statement on Form S-3, SEC File No. 333-09919, filed August 9, 1996).\n    3.1(e)\n-\nCertificate of Amendment of Restated Certificate of Incorporation, dated May 7, 1997 (Exhibit 3(e) to EOG's Registration Statement on Form S-3, SEC File No. 333-44785, filed January 23, 1998).\n    3.1(f)\n-\nCertificate of Ownership and Merger Merging EOG Resources, Inc. into Enron Oil & Gas Company, dated August 26, 1999 (Exhibit 3.1(f) to EOG's Annual Report on Form 10-K for the year ended December 31, 1999) (SEC File No. 001-09743).\n    3.1(g)\n-\nCertificate of Designations of Series E Junior Participating Preferred Stock, dated February 14, 2000 (Exhibit 2 to EOG's Registration Statement on Form 8-A, SEC File No. 001-09743, filed February 18, 2000).\n    3.1(h)\n-\nCertificate of Elimination of the Fixed Rate Cumulative Perpetual Senior Preferred Stock, Series A, dated September 13, 2000 (Exhibit 3.1(j) to EOG's Registration Statement on Form S-3, SEC File No. 333-46858, filed September 28, 2000).\n    3.1(i)\n-\nCertificate of Elimination of the Flexible Money Market Cumulative Preferred Stock, Series C, dated September 13, 2000 (Exhibit 3.1(k) to EOG's Registration Statement on Form S-3, SEC File No. 333-46858, filed September 28, 2000).\n    3.1(j)\n-\nCertificate of Elimination of the Flexible Money Market Cumulative Preferred Stock, Series D, dated February 24, 2005 (Exhibit 3.1(k) to EOG's Annual Report on Form 10-K for the year ended December 31, 2004) (SEC File No. 001-09743).\n    3.1(k)\n-\nAmended Certificate of Designations of Series E Junior Participating Preferred Stock, dated March 7, 2005 (Exhibit 3.1(m) to EOG's Annual Report on Form 10-K for the year ended December 31, 2007) (SEC File No. 001-09743).\n    3.1(l)\n-\nCertificate of Amendment of Restated Certificate of Incorporation, dated May 3, 2005 (Exhibit 3.1(l) to EOG's Quarterly Report on Form 10-Q for the quarter ended June 30, 2005) (SEC File No. 001-09743).\n    3.1(m)\n-\nCertificate of Elimination of Fixed Rate Cumulative Perpetual Senior Preferred Stock, Series B, dated March 6, 2008 (Exhibit 3.1 to EOG's Current Report on Form 8-K, filed March 6, 2008) (SEC File No. 001-09743).\n    3.1(n)\n-\nCertificate of Amendment of Restated Certificate of Incorporation, dated April 28, 2017 (Exhibit 3.1 to EOG's Current Report on Form 8-K, filed May 2, 2017) (SEC File No. 001-09743).\n    3.2\n-\nBylaws, dated August 23, 1989, as amended and restated effective as of February 23, 2023 (Exhibit 3.2(b) to  EOG's Annual Report on Form 10-K for the year ended December 31, 2022) (SEC File No. 001-09743).\n    4.1\n-\nDescription of Securities Registered Under Section 12 of the Securities Exchange Act of 1934 (Exhibit 4.1 to EOG's Annual Report on Form 10-K for the year ended December 31, 2019) (SEC File No. 001-09743).\n    4.2\n-\nIndenture, dated as of September 1, 1991, between Enron Oil & Gas Company (predecessor to EOG) and The Bank of New York Mellon Trust Company, N.A. (as successor in interest to JPMorgan Chase Bank, N.A. (formerly, Texas Commerce Bank National Association)), as Trustee (Exhibit 4(a) to EOG's Registration Statement on Form S-3, SEC File No. 33-42640, filed in paper format on September 6, 1991).\nE-1\nExhibit\nNumber\nDescription\n#4.3(a)\n-\nCertificate, dated April 3, 1998, of the Senior Vice President and Chief Financial Officer of Enron Oil & Gas Company (predecessor to EOG) establishing the terms of the 6.65% Notes due April 1, 2028 of Enron Oil & Gas Company.\n#4.3(b)\n-\nGlobal Note with respect to the 6.65% Notes due April 1, 2028 of Enron Oil & Gas Company (predecessor to EOG).\n  4.4\n-\nIndenture, dated as of May 18, 2009, between EOG and Computershare Trust Company, N.A. (as successor to Wells Fargo Bank, National Association), as Trustee (Exhibit 4.9 to EOG's Registration Statement on Form S-3, SEC File No. 333-159301, filed May 18, 2009).\n  4.5(a)\n-\nOfficers' Certificate Establishing 3.15% Senior Notes due 2025 and 3.90% Senior Notes due 2035 of EOG, dated March 17, 2015 (Exhibit 4.2 to EOG's Current Report on Form 8-K, filed March 19, 2015) (SEC File No. 001-09743).\n  4.5(b)\n-\nForm of Global Note with respect to the 3.15% Senior Notes due 2025 of EOG (Exhibit 4.3 to EOG's Current Report on Form 8-K, filed March 19, 2015) (SEC File No. 001-09743).\n  4.5(c)\n-\nForm of Global Note with respect to the 3.90% Senior Notes due 2035 of EOG (Exhibit 4.4 to EOG's Current Report on Form 8-K, filed March 19, 2015) (SEC File No. 001-09743).\n  4.6(a)\n-\nOfficers' Certificate Establishing 4.15% Senior Notes due 2026 and 5.10% Senior Notes due 2036 of EOG, dated January 14, 2016 (Exhibit 4.2 to EOG's Current Report on Form 8-K, filed January 15, 2016) (SEC File No. 001-09743).\n  4.6(b)\n-\nForm of Global Note with respect to the 4.15% Senior Notes due 2026 of EOG (Exhibit 4.3 to EOG's Current Report on Form 8-K, filed January 15, 2016) (SEC File No. 001-09743).\n  4.6(c)\n-\nForm of Global Note with respect to the 5.10% Senior Notes due 2036 of EOG (Exhibit 4.4 to EOG's Current Report on Form 8-K, filed January 15, 2016) (SEC File No. 001-09743).\n  4.7(a)\n-\nOfficers' Certificate Establishing 4.375% Senior Notes due 2030 and 4.950% Senior Notes due 2050 of EOG, dated April 14, 2020 (Exhibit 4.2 to EOG's Current Report on Form 8-K, filed April 14, 2020) (SEC File No. 001-09743).\n  4.7(b)\n-\nForm of Global Note with respect to the 4.375% Senior Notes due 2030 of EOG (included in Exhibit 4.\n7\n(a)).\n  4.7(c)\n-\nForm of Global Note with respect to the 4.950% Senior Notes due 2050 of EOG (included in Exhibit 4.\n7\n(a)).\n  4.8(a)\n-\nOfficers' Certificate Establishing 5.650% Senior Notes due 2054 (Exhibit 4.2 to EOG's Current Report on Form 8-K, filed November 21, 2024) (SEC File No. 001-09743).\n  4.8(b)\n-\nForm of Global Note with respect to the 5.650% Senior Notes due 2054 (included in Exhibit 4.8(a)).\n10.1(a)+\n-\nAmended and Restated EOG Resources, Inc. 2008 Omnibus Equity Compensation Plan, effective as of May 2, 2013 (Exhibit 4.4 to EOG's Registration Statement on Form S-8, SEC File No. 333-188352, filed May 3, 2013).\n10.1(b)+\n-\nForm of Restricted Stock Award Agreement for Amended and Restated EOG Resources, Inc. 2008 Omnibus Equity Compensation Plan (applicable to grants made on or after September 28, 2020) (Exhibit 10.1 to EOG's Quarterly Report on Form 10-Q for the quarter ended September 30, 2020) (SEC File No. 001-09743).\n10.1(c)+\n-\nForm of Restricted Stock Unit Award Agreement for Amended and Restated EOG Resources, Inc. 2008 Omnibus Equity Compensation Plan (applicable to grants made on or after September 28, 2020) (Exhibit 10.2 to EOG's Quarterly Report on Form 10-Q for the quarter ended September 30, 2020) (SEC File No. 001-09743).\n10.1(d)+\n-\nForm of Stock-Settled Stock Appreciation Right Agreement for Amended and Restated EOG Resources, Inc. 2008 Omnibus Equity Compensation Plan (applicable to grants made on or after September 25, 2017 and prior to September 28, 2020) (Exhibit 10.4 to EOG's Current Report on Form 8-K, filed September 29, 2017) (SEC File No. 001-09743).\n10.1(e)+\n-\nForm of Stock-Settled Stock Appreciation Right Agreement for Amended and Restated EOG Resources, Inc. 2008 Omnibus Equity Compensation Plan (applicable to grants made on or after September 28, 2020) (Exhibit 10.3 to EOG's Quarterly Report on Form 10-Q for the quarter ended September 30, 2020) (SEC File No. 001-09743).\nE-2\nExhibit\nNumber\nDescription\n  10.1(f)+\n-\nForm of Performance Unit Award Agreement for Amended and Restated EOG Resources, Inc. 2008 Omnibus Equity Compensation Plan (applicable to grants made on or after September 28, 2020) (Exhibit 10.4 to EOG's Quarterly Report on Form 10-Q for the quarter ended September 30, 2020) (SEC File No. 001-09743).\n  10.1(g)+\n-\nForm of Performance Unit Award Agreement for Amended and Restated EOG Resources, Inc. 2008 Omnibus Equity Compensation Plan (applicable solely to grant made to Ezra Y. Yacob effective January 4, 2021) (Exhibit 10.1(u) to EOG's Annual Report on Form 10-K for the year ended December 31, 2020) (SEC File No. 001-09743).\n  10.2(a)+\n-\nEOG Resources, Inc. 2021 Omnibus Equity Compensation Plan, dated effective as of April 29, 2021 (Exhibit 4.4 to EOG's Registration Statement on Form S-8, SEC File No. 333-255691, filed April 30, 2021).\n  10.2(b)+\n-\nForm of Restricted Stock Award Agreement for EOG Resources, Inc. 2021 Omnibus Equity Compensation Plan (applicable to grants made prior to September 15, 2023) (Exhibit 10.1 to EOG's Quarterly Report on Form 10-Q for the quarter ended September 30, 2021) (SEC File No. 001-09743).\n  10.2(c)+\n-\nForm of Restricted Stock Award Agreement for EOG Resources, Inc. 2021 Omnibus Equity Compensation Plan (applicable to grants made on or after September 15, 2023 and prior to December 18, 2023) (Exhibit 10.1 to EOG's Quarterly Report on Form 10-Q for the quarter ended September 30, 2023 (SEC File No. 001-09743).\n  10.2(d)+\n-\nForm of Restricted Stock Award Agree\nment for EOG Resources, Inc. 2021 Omnibus Equity Compensation Plan (applicable to grants made on or after December 18, 2023) (Exhibit 10.2(d) to EOG's Annual Report on Form 10-K for the year ended December 31, 2023) (SEC File No. 001-09743).\n  10.2(e)+\n-\nForm of Restricted Stock Unit Award Agreement for EOG Resources, Inc. 2021 Omnibus Equity Compensation Plan (applicable to grants made prior to September 15, 2023) (Exhibit 10.2 to EOG's Quarterly Report on Form 10-Q for the quarter ended September 30, 2021) (SEC File No. 001-09743).\n  10.2(f)+\n-\nForm of Restricted Stock Unit Award Agreement for EOG Resources, Inc. 2021 Omnibus Equity Compensation Plan (applicable to grants made on or after September 15, 2023 and prior to December 18, 2023) (Exhibit 10.2 to EOG's Quarterly Report on Form 10-Q for the quarter ended September 30, 2023) (SEC File No. 001-09743).\n  10.2(g)+\n-\nForm of Restricted Stock Unit Award Agreement for EOG Resources, Inc. 2021 Omnibus Equity Compensation Plan (applicable to grants made on or after December 18, 2023) (Exhibit 10.2(g) to EOG's Annual Report on Form 10-K for the year ended December 31, 2023) (SEC File No. 001-09743).\n  10.2(h)+\n-\nForm of Stock-Settled Stock Appreciation Right Agreement for EOG Resources, Inc. 2021 Omnibus Equity Compensation Plan (Exhibit 10.3 to EOG's Quarterly Report on Form 10-Q for the quarter ended September 30, 2021) (SEC File No. 001-09743).\n  10.2(i)+\n-\nForm of Restricted Stock Unit with Performance-Based Conditions (\"Performance Unit\") Award Agreement for EOG Resources, Inc. 2021 Omnibus Equity Compensation Plan (applicable to grants made prior to September 29, 2022) (Exhibit 10.4 to EOG's Quarterly Report on Form 10-Q for the quarter ended September 30, 2021) (SEC File No. 001-09743).\n  10.2(j)+\n-\nRestricted Stock Unit with Performance-Based Conditions (\"Performance Unit\") Award Agreement for EOG Resources, Inc. 2021 Omnibus Equity Compensation Plan, by and between EOG and William R. Thomas, effective September 27, 2021 (Exhibit 10.5 to EOG's Quarterly Report on Form 10-Q for the quarter ended September 30, 2021) (SEC File No. 001-09743).\n  10.2(k)+\n-\nForm of Restricted Stock Unit with Performance-Based Conditions (\"Performance Unit\") Award Agreement for EOG Resources, Inc. 2021 Omnibus Equity Compensation Plan (applicable to grants made on or after September 29, 2022 and prior to September 15, 2023) (Exhibit 10.1 to EOG's Current Report on Form 8-K, filed October 4, 2022) (SEC File No. 001-09743).\n  10.2(l)+\n-\nForm of Restricted Stock Unit with Performance-Based Conditions (\"Performance Unit\") Award Agreement for EOG Resources, Inc. 2021 Omnibus Equity Compensation Plan (applicable to grants made on or after September 15, 2023 and prior to December 18, 2023) (Exhibit 10.3 to EOG's Quarterly Report on Form 10-Q for the quarter ended September 30, 2023) (SEC File No. 001-09743).\n  10.2(m)+\n-\nForm of Restricted Stock Unit with Performance-Based Conditions (\"Performance Unit\") Award Agreement for EOG Resources, Inc. 2021 Omnibus Equity Compensation Plan (amended and restated award agreement applicable solely to grants made effective September 15, 2023) (Exhibit 10.2(m) to EOG's Annual Report on Form 10-K for the year ended December 31, 2023) (SEC File No. 001-09743).\nE-3\nExhibit\nNumber\nDescription\n  10.2(n)+\n-\nForm of Restricted Stock Unit with Performance-Based Conditions (\"Performance Unit\") Award Agreement for EOG Resources, Inc. 2021 Omnibus Equity Compensation Plan (applicable to grants made on or after December 18, 2023 and prior to September 27, 2024) (Exhibit 10.2(n) to EOG's Annual Report on Form 10-K for the year ended December 31, 2023) (SEC File No. 001-09743).\n  10.2(o)+\n-\nForm of Restricted Stock Unit with Performance-Based Conditions (\"Performance Unit\") Award Agreement for EOG Resources, Inc. 2021 Omnibus Equity Compensation Plan (applicable to grants made on or after September 27, 2024) (Exhibit 10.1 to EOG's Quarterly Report on Form 10-Q for the quarter ended September 30, 2024) (SEC File No. 001-09743).\n  10.2(p)+\n-\nForm of Restricted Stock Unit with Performance-Based Conditions (\"Performance Unit\") Award Agreement for EOG Resources, Inc. 2021 Omnibus Equity Compensation Plan (applicable solely to grant made to Ann D. Janssen effective January 2, 2024) (Exhibit 10.2(o) to EOG's Annual Report on Form 10-K for the year ended December 31, 2023) (SEC File No. 001-09743).\n  10.2(q)\n-\nForm of Non-Employee Director Restricted Stock Unit Award Agreement for EOG Resources, Inc. 2021 Omnibus Equity Compensation Plan\n (applicable to grants made prior to May 28, 2024)\n (Exhibit 10.6 to EOG's Quarterly Report on Form 10-Q for the quarter ended September 30, 2021) (SEC File No. 001-09743).\n  10.2(r)\n-\nForm of Non-Employee Director Restricted Stock Unit Award Agreement for EOG Resources, Inc. 2021 Omnibus Equity Compensation Plan (applicable to grants made on or after May \n2\n8, 2024) (Exhibit 10.1 to EOG's Quarterly Report on Form 10-Q for the quarter ended June 30, 2024) (SEC File No. 001-09743).\n  10.3(a)+\n-\nEOG Resources, Inc. 409A Deferred Compensation Plan - Nonqualified Supplemental Deferred Compensation Plan - Plan Document, effective as of December 16, 2008 (Exhibit 10.2(a) to EOG's Annual Report on Form 10-K for the year ended December 31, 2008) (SEC File No. 001-09743).\n  10.3(b)+\n-\nEOG Resources, Inc. 409A Deferred Compensation Plan - Nonqualified Supplemental Deferred Compensation Plan - Adoption Agreement, originally dated as of December 16, 2008 (and as amended through February 24, 2012 (including an amendment to Item 7 thereof, effective January 1, 2012, with respect to the deferral of restricted stock units)) (Exhibit 10.2(b) to EOG's Annual Report on Form 10-K for the year ended December 31, 2011) (originally filed as Exhibit 10.2(b) to EOG's Annual Report on Form 10-K for the year ended December 31, 2008) (SEC File No. 001-09743).\n  10.3(c)+\n-\nFirst Amendment to the EOG Resources, Inc. 409A Deferred Compensation Plan, effective as of January 1, 2013 (Exhibit 10.8 to EOG's Quarterly Report on Form 10-Q for the quarter ended September 30, 2013) (SEC File No. 001-09743).\n  10.3(d)+\n-\nAmendment 2 to the EOG Resources, Inc. 409A Deferred Compensation Plan, effective as of January 1, 2018 (Exhibit 10.3(d) to EOG's Annual Report on Form 10-K for the year ended December 31, 2018) (SEC File No. 001-09743).\n  10.3(e)+\n-\nThird Amendment to the EOG Resources, Inc. 409A Deferred Compensation Plan, effective as of December 17, 2020 (Exhibit 10.2(e) to EOG's Annual Report on Form 10-K for the year ended December 31, 2020) (SEC File No. 001-09743).\n  10.4(a)+\n-\nAmended and Restated Change of Control Agreement between EOG and Timothy K. Driggers, effective as of June 15, 2005 (Exhibit 99.11 to EOG's Current Report on Form 8-K, filed June 21, 2005) (SEC File No. 001-09743).\n  10.4(b)+\n-\nFirst Amendment to Amended and Restated Change of Control Agreement between EOG and Timothy K. Driggers, effective as of April 30, 2009 (Exhibit 10.5 to EOG's Quarterly Report on Form 10-Q for the quarter ended March 31, 2009) (SEC File No. 001-09743).\n  10.4(c)+\n-\nSecond Amendment to Amended and Restated Change of Control Agreement between EOG and Timothy K. Driggers, effective as of September 13, 2011 (Exhibit 10.4 to EOG's Current Report on Form 8-K, filed September 13, 2011) (SEC File No. 001-09743).\n  10.4(d)+\n-\nThird Amendment to Amended and Restated Change of Control Agreement between EOG and Timothy K. Driggers, effective as of September 4, 2013 (Exhibit 10.6 to EOG's Quarterly Report on Form 10-Q for the quarter ended September 30, 2013) (SEC File No. 001-09743).\n  10.5(a)+\n-\nChange of Control Agreement by and between EOG and Michael P. Donaldson, effective as of May 3, 2012 (Exhibit 10.1 to EOG's Quarterly Report on Form 10-Q for the quarter ended June 30, 2012) (SEC File No. 001-09743).\nE-4\nExhibit\nNumber\nDescription\n       10.5(b)+\n-\nFirst Amendment to Change of Control Agreement between EOG and Michael P. Donaldson, effective as of September 4, 2013 (Exhibit 10.7 to EOG's Quarterly Report on Form 10-Q for the quarter ended September 30, 2013) (SEC File No. 001-09743).\n       10.6(a)+\n-\nChange of Control Agreement by and between EOG and Lloyd W. Helms, effective as of June 27, 2013 (Exhibit 10.9 to EOG's Quarterly Report on Form 10-Q for the quarter ended June 30, 2013) (SEC File No. 001-09743).\n       10.6(b)+\n-\nFirst Amendment to Change of Control Agreement between EOG and Lloyd W. Helms, Jr., effective as of September 4, 2013 (Exhibit 10.4 to EOG's Quarterly Report on Form 10-Q for the quarter ended September 30, 2013) (SEC File No. 001-09743).\n       10.7+\n-\nChange of Control Agreement by and between EOG and Ezra Y. Yacob, effective as of January 26, 2018 (Exhibit 10.10 to EOG's Annual Report on Form 10-K for the year ended December 31, 2017) (SEC File No. 001-09743).\n       10.8+\n-\nChange of Control Agreement by and between EOG and Jeffrey R. Leitzell, effective as of June 17, 2021 (Exhibit 10.2 to EOG's Quarterly Report on Form 10-Q for the quarter ended June 30, 2021 (SEC File No. 001-09743).\n       10.9+\n-\nChange of Control Agreement by and between EOG and Ann D. Janssen, effective as of February 2, 2024 (Exhibit 10.10 to EOG's Annual Report on Form 10-K for the year ended December 31, 2023) (SEC File No. 001-09743).\n       10.10(a)+\n-\nEOG Resources, Inc. Change of Control Severance Plan, as amended and restated effective as of June 15, 2005 (Exhibit 99.12 to EOG's Current Report on Form 8-K, filed June 21, 2005) (SEC File No. 001-09743).\n       10.10(b)+\n-\nFirst Amendment to the EOG Resources, Inc. Change of Control Severance Plan, effective as of April 30, 2009 (Exhibit 10.6 to EOG's Quarterly Report on Form 10-Q for the quarter ended March 31, 2009) (SEC File No. 001-09743).\n       10.11(a)+\n-\nEOG Resources, Inc. Amended and Restated Annual Bonus Plan (effective as of January 1, 2022) (Exhibit 10.2 to EOG's Current Report on Form 8-K, filed October 4, 2022) (SEC File No. 001-09743).\n       10.11(b)+\n-\nEOG Resources, Inc. Second Amended and Restated Annual Bonus Plan (effective as of January 1, 2024) (Exhibit 10.12(c) to EOG's Annual Report on Form 10-K for the year ended December 31, 2023) (SEC File No. 001-09743).\n       10.12+\n-\nEOG Resources, Inc. Employee Stock Purchase Plan (As Amended and Restated Effective January 1, 2018) (Exhibit 4.4(a) to EOG's Registration Statement on Form S-8, SEC File No. 333-224466, filed April 26, 2018).\n      10.13\n-\nRevolving Credit Agreement, dated as of June 7, 2023, among EOG, JPMorgan Chase Bank, N.A., as Administrative Agent, the financial institutions as bank parties thereto, and the other parties thereto (Exhibit 10.1 to EOG's Current Report on Form 8-K, filed June 12, 2023) (SEC File No. 001-09743).\n     *19\n-\nEOG Resources, Inc. Insider Trading Policy (as updated effective February 6, 2025).\n     *21\n-\nSubsidiaries of EOG, as of December 31, 2024.\n     *23.1\n-\nConsent of DeGolyer and MacNaughton.\n     *23.2\n-\nConsent of Deloitte & Touche LLP.\n     *24\n-\nPowers of Attorney.\n     *31.1\n-\nSection 302 Certification of Annual Report of Principal Executive Officer.\n     *31.2\n-\nSection 302 Certification of Annual Report of Principal Financial Officer.\n     *32.1\n-\nSection 906 Certification of Annual Report of Principal Executive Officer.\n     *32.2\n-\nSection 906 Certification of Annual Report of Principal Financial Officer.\n       97+\n-\nEOG Resources, Inc. Policy for the Recovery of Erroneously Awarded Compensation, adopted September 13, 2023 (Exhibit 97 to EOG's Annual Report on Form 10-K for the year ended December 31, 2023) (SEC File No. 001-09743).\n     *99.1\n-\nOpinion of DeGolyer and MacNaughton, dated January \n21\n, 2025.\nE-5\nExhibit\nNumber\nDescription\n        101.INS\nInline XBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n*  **101.SCH\n-\nInline XBRL Schema Document.\n*  **101.CAL\n-\nInline XBRL Calculation Linkbase Document.\n*  **101.DEF\n-\nInline XBRL Definition Linkbase Document.\n*  **101.LAB\n-\nInline XBRL Label Linkbase Document.\n*  **101.PRE\n-\nInline XBRL Presentation Linkbase Document.\n        104\n-\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).\n*Exhibits filed herewith\n**Attached as Exhibit 101 to this report are the following documents formatted in XBRL (Extensible Business Reporting Language):  (i) the Consolidated Statements of Income and Comprehensive Income for Each of the Three Years in the Period Ended December 31, 2024, (ii) the Consolidated Balance Sheets - December 31, 2024 and 2023, (iii) the Consolidated Statements of Stockholders' Equity for Each of the Three Years in the Period Ended December 31, 2024, (iv) the Consolidated Statements of Cash Flows for Each of the Three Years in the Period Ended December 31, 2024 and (v) the Notes to Consolidated Financial Statements. \n+ Management contract, compensatory plan or arrangement\nE-6\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, as amended, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\n \n \nEOG RESOURCES, INC.\n \n \n(Registrant)\nDate: \nFebruary 27, 2025\nBy:\n/s/ ANN D. JANSSEN\n                                                                       \nAnn D. Janssen\nExecutive Vice President and Chief Financial Officer\n(Principal Financial Officer and Duly Authorized Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, as amended, this report has been signed below by the following persons on behalf of the registrant and in the capacities with EOG Resources, Inc. indicated and on the 27\nth\n day of February, 2025.\n \nSignature\nTitle\n \n/s/ EZRA Y. YACOB\nChairman of the Board and Chief Executive Officer \nand Director\n \n(Ezra Y. Yacob)\n(Principal Executive Officer)\n \n/s/ ANN D. JANSSEN\nExecutive Vice President and Chief Financial Officer\n \n(Ann D. Janssen)\n(Principal Financial Officer)\n \n/s/ LAURA B. DISTEFANO\nVice President and Chief Accounting Officer\n \n(Laura B. Distefano)\n(Principal Accounting Officer)\n \n*\nDirector\n \n(Janet F. Clark)\n \n \n*\nDirector\n \n(Charles R. Crisp)\n \n*\nDirector\n(Robert P. Daniels)\n \n*\nDirector\n \n(Lynn A. Dugle)\n \n \n*\nDirector\n \n(C. Christopher Gaut)\n \n*\nDirector\n(Michael T. Kerr)\n \n*\nDirector\n \n(Julie J. Robertson)\n \n \n*\nDirector\n(Donald F. Textor)\n*By:\n/s/ MICHAEL P. DONALDSON\n \n \n(Michael P. Donaldson)\n \n \n(Attorney-in-fact for persons indicated)"
  }
}