{
  "ticker": "EQIX",
  "cik": "0001101239",
  "company_name": "EQUINIX INC",
  "filing_date": "2025-02-12",
  "accession": "0001628280-25-005126",
  "primary_doc": "eqix-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1.\n    \nBusiness\nOverview: Enabling Innovation for the Digital World\nEquinix (Nasdaq: EQIX) is the world's digital infrastructure company\n®\n. Digital leaders harness our trusted platform to bring together and interconnect the foundational infrastructure that powers their success. Equinix enables organizations to access all the right places, partners and possibilities they need to accelerate their advantage. Platform Equinix combines a global footprint of International Business Exchange\nTM \n(IBX\n®\n) and xScale\n® \ndata centers in the Americas, Asia-Pacific, and Europe, the Middle East and Africa (\"EMEA\") regions, infrastructure and interconnection offerings, unique business and digital ecosystems and expert consulting and support. \nEquinix was incorporated on June 22, 1998 as a Delaware corporation and operates as a REIT for federal income tax purposes. Al Avery and Jay Adelson founded Equinix as a network-neutral, multi-tenant data center (\"MTDC\") provider, where competing networks could connect and share data traffic to help scale the rapid growth of the early internet. The company’s name, Equinix (composed from the words \"equality,\" \"neutrality\" and \"internet exchange\"), reflects that vision. The founders believed they not only had the opportunity, but also the responsibility to create a company that would be the steward of some of the most important digital infrastructure assets in the world. Over two and a half decades later, we have expanded upon that vision to build Platform Equinix\n®\n, which we believe is unmatched in scale and reach. \nOur data centers around the world allow our customers to bring together and interconnect the infrastructure they need to fast-track their digital advantage. With Equinix, they can scale with agility, accelerate the launch of digital offerings, deliver world-class experiences and multiply their value. We enable them to differentiate by distributing infrastructure and removing the distance between clouds, users and applications in order to reduce latency and deliver a superior customer, partner and employee experience. The Equinix global platform, and the quality of our offerings, have enabled us to establish a critical mass of customers. As more customers choose Platform Equinix for bandwidth cost and performance reasons, it benefits their suppliers and business partners to colocate in the same data centers and connect directly with each other. This adjacency creates a network effect that attracts new customers, continuously enhances our existing customers' value and enables them to capture further economic and performance benefits from our offerings.\n5\nTable of \nContents\nIn 2024, we opened 16 new data centers, inclusive of new xScale sites via our joint ventures. Our new data center openings included sites in the following metros: Barcelona, Istanbul, Johannesburg, Johor, Kuala Lumpur, Madrid, Mumbai, New York, Osaka, Paris, Rio de Janeiro, Seoul, Silicon Valley, Tokyo and Warsaw. When including an additional data center which opened in February 2025, this results in an increase in our total number of data center facilities to 268. Additional 2024 highlights include:\n•\nIn April, we sold the Silicon Valley 12 (“SV12”) data center site in connection with the formation of a new joint venture (\"JV\") to develop and operate the first xScale data center in the U.S. The facility will be built out in two phases and is expected to provide more than 28 MW of power capacity when completed.\n•\nIn July, we announced our entry into the Philippines with the planned acquisition of three data centers in Manila for a stated purchase price of $180 million, subject to certain adjustments. The transaction is expected to close in the first half of 2025, subject to customary closing conditions, and is expected to add more than 1,000 cabinets of capacity. This follows our recent expansions into Indonesia and Malaysia, enabling us to help businesses expand and capitalize on the digital opportunity of the fast-growing Southeast Asia region. \n•\nIn October, we entered into an agreement to form a joint venture to develop and operate data centers in the Americas region, subject to regulatory approval and other closing conditions which were satisfied on October 30, 2024. With the $15.0 billion of capital expected to be raised through this joint venture, we expect to accelerate xScale deployment in the U.S., eventually adding more than 1.5 gigawatts of new capacity for hyperscale customers.\n•\nIn November, we announced plans to build our sixth data center in Singapore. This new high performance data center will feature a design built to efficiently compute intensive workloads like artificial intelligence (\"AI\"), supported by capabilities such as advanced liquid cooling. Expected to open in Q1 2027, the 9-story facility was awarded as part of Singapore's pilot Data Centre - Call for Application and will provide 20MW of power capacity when fully built.\nIndustry Trends: The rise of intelligent ecosystems\nThe digital economy is advancing rapidly, driven by exponential data growth, ecosystem collaboration and edge-to-cloud innovations. Interconnected networks are transforming business operations and enabling organizations to scale, innovate and thrive. Emerging trends shaping this landscape include:\n•\nThe digital shift: \nIndustries are becoming smarter, faster and more adaptable as AI enhances decision-making and automates tasks. Businesses are shifting from traditional, siloed models to interconnected ecosystems, where collaboration and seamless integration of services drive value at scale. Digital-first strategies are empowering businesses to transition from static product offerings to dynamic, outcome-based services, harnessing real-time data and ecosystem interconnections as competitive advantages.\n•\nThe interconnection imperative: \nThis digital shift is fostering collaboration and data sharing, forming tightly connected networks of businesses and partners. These networks are reshaping supply and value chains into intelligent, service-based systems, with rapidly growing data and participant ecosystems driving efficiency and innovation. Interconnection is becoming the backbone of the digital economy, enabling real-time collaboration, operational scale and faster decision-making. Businesses investing in high-speed, low-latency connections are leading in adapting to these complex, data-driven demands.\n6\nTable of \nContents\n•\nEcosystem scalability:\n Organizations are leveraging interconnected ecosystems to expand market reach, streamline service delivery and unlock new revenue streams. Revenue is increasingly tied to participation in electronic ecosystems rather than standalone transactions. The emergence of dynamic producer-consumer relationships, where businesses act as service providers, consumers and intermediaries is gaining traction. This adaptability enables businesses to meet evolving market demands while optimizing resource allocation and driving growth.\n•\nEdge-to-cloud transformation:\n Built upon the foundation of connectivity, edge-to-cloud workflows are enabling businesses to move data and compute closer to where value is created. This layered strategy supports efficient data flows, reduces latency, and optimizes costs. By introducing an authoritative data core distributed across areas of digital density—with low latency access to multiple clouds and SaaS platforms—businesses can achieve scalability and compliance. This approach, paired with a data edge for Retrieval-Augmented Generation (\"RAG\") inference models, enables efficient AI and real-time applications in proximity to customers, business operations and endpoints of value delivery and revenue generation.\n•\nSustainability by design:\n Sustainability is a key priority for global organizations, as market expectations and regulations demand greener practices. Interconnection and efficient digital infrastructures are critical in supporting net-zero goals. By adopting innovative, energy-efficient technologies, businesses are not only reducing carbon footprints, but also building long-term resilience and value.\nInterconnection remains the foundation of the digital economy, facilitating seamless data exchange and collaboration. Our research estimates that private interconnection capacity will grow at a compound annual growth rate (\"CAGR\") of 29% by 2027, potentially nearing 40,000 terabits per second of data exchanged annually. The growth reflects the increasing demand for scalable, high-performance networks to support AI, edge computing and distributed ecosystem business models.\nWorldwide Interconnection Bandwidth Capacity CAGR (2023-2027) in Terabits per Second (Tbps)\nEquinix Business Proposition: To Be the Platform Where the World Comes Together\nIn 2024, we continued to build new offerings to further our mission to make digital infrastructure more powerful, accessible and sustainable. On Platform Equinix, businesses can reach the most strategic markets with scalable, navigable infrastructure that blends physical and virtual options on our one-of-a-kind global ecosystem. We enable competitive advantage for our customers and partners by creating the foundational infrastructure capabilities that harness innovation and create value. We offer a comprehensive, integrated suite of infrastructure and interconnection solutions and products to over 10,000 enterprise and service provider customers worldwide.\n7\nTable of \nContents\nOur global, state-of-the-art data centers meet strict standards of security, reliability, certification and sustainability. Our footprint consists of 268 data centers worldwide:\n•\nIBX\n \nData Centers\n are our carrier-neutral colocation data centers, providing our customers with the secure, reliable and robust environments (including space and power) necessary to aggregate and distribute information and connect digital and business ecosystems globally. IBX data centers provide access to vital ecosystems where enterprises, network, cloud and SaaS providers, and business partners, can directly and securely interconnect to each other.\n•\nxScale Data Centers \nare designed to serve the unique core workload deployment needs of a targeted group of hyperscale companies, which include the world's largest cloud service providers. Hyperscalers require infrastructure to support demanding workload requirements for cloud and AI initiatives. With xScale data centers, which are developed and operated through our joint venture partnership arrangements, hyperscale customers add to their core hyperscale data center deployments and existing customer access points at Equinix, allowing streamlined expansion with a single global vendor.\nThe following are the leading revenue-generating products and other offerings that collectively make up Platform Equinix:\nInfrastructure Offerings\nEquinix infrastructure offerings include a suite of comprehensive solutions that provide all the components required by a customer to house its IT infrastructure or equipment. These offerings are designed to speed and streamline data center deployments for our customers. These offerings are typically billed based on the space and power a customer consumes in our IBX data centers, are delivered under a fixed duration contract and generate monthly recurring revenue (\"MRR\"). \n•\nPrivate Cages\n are typically designed and built to order for a single customer, with space assigned based on purchased power allocations and planned cabinet quantity. A cage typically includes steel mesh walls with a locking door, interconnection provision such as a demarcation rack with patch panels, and cabling systems such as a ladder rack and fiber raceway. Available security accessories include dedicated cameras, biometric hand scanners and more.\n•\nSecure Cabinets\n are steel-framed cabinets sized to industry standards and typically configured to order, with lockable, fully ventilated doors. Secure cabinets provide a private, secure, smaller-footprint alternative to a Private Cage. Each cabinet includes an integrated, interconnection-ready demarcation panel and power circuitry sufficient to support planned utilization requirements. Secure cabinets are typically housed in a shared, secured cage within the data center facility.\n•\nSecure Cabinet Express\n are ready for service secure cabinets that are preconfigured to fit Equinix recommendations and most modern IT deployment requirements, providing a simplified and globally consistent colocation module for cabinet-sized deployments. \nEquinix offers a variety of enabling solutions that support a customer's need to implement, operate and maintain its colocated deployments. These solutions include both on-consumption and subscription services that may generate MRR as well as non-recurring revenue (\"NRR\").\n8\nTable of \nContents\n•\nEquinix Smart View\n®\n is a fully integrated monitoring software that provides customers visibility into the operating data relevant to their specific Equinix footprint as if they were in-house. The software provides online access to real-time environmental and operating data through the Equinix Customer Portal or via either REST (application programming interfaces (\"APIs\") that provide customers the ability to retrieve information about their assets from every IBX location) or streaming API integrations. With real-time alerts and configurable reporting, Equinix SmartView allows customers to maintain their IBX operations and plan for future growth.\n•\nEquinix Smart Hands\n®\n provides around-the-clock, on-site operational support service for remote management, installation and troubleshooting of customer data center equipment. Using Equinix IBX data center technicians, Smart Hands allows customers to manage their Platform Equinix data center operations from anywhere in the world.\n•\nEquinix Smart Build (\"ESB\")\n provides customers with an easy way to accelerate and simplify world-class data center deployments with expert support. ESBs are repeatable, proven processes that address larger, more complex data center jobs, including installation and implementation of new builds and planned migrations. ESB practices deliver Equinix expertise in colocation design to optimize our customers’ data center needs, including structured cabling, labeling and documentation, procurement recommendations and coordination, and secure de-installation.\n•\nEquinix Managed Solutions and Enablement Services\n offer flexible and easy-to-consume managed platforms for cloud, storage, backup and firewall, built on top of neutral, leading technology. Combined with simplified implementation of Equinix Fabric and Network Edge, these managed services leverage customer hybrid and multicloud experiences, allowing organizations to prioritize their core business functions. \nInterconnection Offerings\nOur interconnection solutions connect businesses directly, securely and dynamically within and between our data centers across our global platform. These solutions are typically billed based on the outbound connections from a customer and generate MRR.\n•\nEquinix Fabric\n®\n \nprovides secure, on-demand, software-defined interconnection. Built specifically for digital infrastructure, Equinix Fabric enables businesses to connect globally to their choice of thousands of networking, storage, compute and application service providers in the industry’s largest infrastructure ecosystem. As the foundation of Platform Equinix’s interconnection capability, Equinix Fabric also enables customers to quickly and easily connect between the physical and virtual digital infrastructures they have deployed in Equinix data centers globally.\n•\nEquinix Fabric Cloud Router \nmakes it easy to connect applications and data across different clouds. With high-performance and secure private connections, protecting data from exposure to the public internet, these enterprise-grade connections offer virtually unlimited bandwidth and built-in resiliency. Fabric Cloud Router also reduces networking costs, lowers cloud egress charges and enables elastic bandwidth consumption so customers pay for only what they need.\n•\nEquinix Cross Connects \nprovide a point-to-point cable link between two Equinix customers in the same data center. Cross connects deliver fast, convenient, affordable and highly reliable connectivity and data exchange with business partners and service providers within the Equinix ecosystem.\n•\nEquinix Internet Exchange \nenables networks, content providers and large enterprises to exchange internet traffic through the largest global peering solution. Service providers can aggregate traffic to multiple counterparties, called peers, on one physical port and handle multiple small peers while moving high-traffic peers to private interconnections. This reduces latency for end users when accessing content and applications.\n•\nEquinix Internet Access\n is an agile, scalable, resilient and high-performing managed internet access solution. Offering multiple upstream Tier 1 providers per metro and connections to all Equinix and major third-party internet exchanges, with over 300 private peering relationships, it delivers superior availability and performance. Internet Access serves as a one-stop shop for businesses, offering both physical and virtual connection options with Equinix Fabric and Network Edge to deliver primary and secondary internet access solutions. Available in 60+ markets, Internet Access allows scalable bandwidth to meet growing usage needs, empowering businesses to innovate in the digital age.\n•\nFiber Connect\n provides dark fiber links between customers and partners between multiple Equinix data centers. Fiber Connect enables fast, convenient and affordable integration with partners, customers and \n9\nTable of \nContents\nservice providers across the global Equinix digital ecosystem. It supports highly reliable, extremely low-latency communication, system integration and data exchange.\n•\nMetro Connect\n®\n \nprovides direct, dedicated, carrier-grade network links between customers in one IBX and partners in another IBX within the same metro. Metro Connect provides integration with customers, partners and service providers within the Equinix digital ecosystem, supplying highly reliable, extremely low-latency communication, system integration and data exchange.\n•\nEquinix Network Edge \nallows customers to modernize networks within minutes, by deploying network functions virtualization (\"NFV\") from multiple vendors across Equinix metros. Companies can select, deploy and connect virtual network solutions at the edge quickly, with no additional hardware requirements.\nCompetition\nWhile a large number of enterprises and service providers, such as hyperscale cloud service providers, own their own data centers, we believe the industry is shifting away from single-tenant solutions to customers outsourcing some or all of their IT housing and interconnection requirements to third-party facilities, such as those operated by Equinix. This shift is being accelerated by the increasing adoption of hybrid multi-cloud architectures and the adoption of AI.\nHistorically, the outsourcing market was served by large telecommunications carriers that bundled their products and services with their colocation offerings. The data center market landscape has evolved to include private and carrier-neutral multi-tenant data centers, public and private cloud providers, managed infrastructure and application hosting providers, large hyperscale cloud providers and systems integrators. It is estimated that Equinix is one of more than 2,400 companies that provide MTDC offerings around the world. The global MTDC market is highly fragmented. Each of these data center solution providers can bundle various colocation, interconnection and network offerings, outsourced IT infrastructure solutions and managed services. We believe that this outsourcing trend has accelerated and is likely to continue to accelerate in the coming years, especially in light of the movement to digital business, the use of multiple cloud service providers and the adoption of AI.\nEquinix is differentiated in this market by offering customers a global platform that reaches over 30 countries and contains the industry’s largest and most active ecosystem of partners in our sites, including access to a leading share of cloud on-ramps and an increasingly diverse ecosystem of networks and cloud and IT service providers. This ecosystem creates a network effect, which improves performance and lowers the cost for our customers, enabling them to innovate and fast-track their digital success. This is a significant source of competitive advantage for Equinix. Additionally, as AI and cloud innovations fuel workload demands for hyperscale infrastructure and optimization across enterprises, our scalable, neutral, global platform offers one-of-a-kind solutions to the most pressing digital challenges in today’s market. Our platform enables customers to bring together physical and programmable technologies like compute, storage, network and applications to build the foundation for their company's digital success.\nCustomers\nOur customers include telecommunications carriers, mobile and other network services providers, cloud and IT services providers, digital media and content providers, financial services companies, and global enterprise ecosystems in various industries. We provide each company with access to a choice of business partners and solutions based on their colocation, interconnection and managed IT service needs, and we delivered 99.999%+ operational uptime across our global data centers in the previous fiscal year. As of December 31, 2024, we had over 10,000 customers worldwide. No one customer made up 10% or more of our total business revenues for the year ended December 31, 2024.\n10\nTable of \nContents\nThe following companies represent some of our leading customers and partners:\nWe serve our customers with a direct sales force and channel marketing program. We organize our sales force by customer type, as well as by establishing a sales presence in diverse geographic regions, which enables efficient servicing of the customer base from a network of regional offices. We also support our customers with a global customer care organization. \nHuman Capital\nAs of December 31, 2024, we had 13,606 employees worldwide with 5,952 based in the Americas, 4,653 based in EMEA and 3,001 based in Asia-Pacific. Of those employees, 43% of employees were in engineering and operations, 15% of employees were in sales and marketing and 42% of employees were in management, finance and administration. As of December 31, 2024, approximately 71% of our workforce identified as men, 28% identified as women and less than 1% declined to identify. \nEquinix remains steadfast in its commitment to create a thriving workplace where we foster belonging for all— where every one of our colleagues is valued and respected for who they are and what they contribute. Our objective is to continue to make our culture a critical competitive advantage, engaging every leader and every employee in the process. \nOur talent strategies focus on attracting, developing and retaining a diverse, global workforce; building leadership capability and accountability; and empowering employees to do the best work of their lives. We continue to leverage and expand our recruiting pathways to attract qualified talent from adjacent industries and reach emerging talent pools. For example, in 2024, we welcomed our second neurodiverse intern cohort in partnership with Disability:IN and the Global Military Pathways program continues to hire military candidates across all regions. Developing and retaining talent is vital to our continued success and in 2024, we focused on leadership development, starting with our VP+ leaders, by offering programs that feature external experts to speak on topics ranging from strategic alignment, team leadership, and industry relevant topics. We also evolved our performance management approach, increasing simplicity and clarity through consistent feedback between employees and their managers.\nWe believe in equal pay and equal opportunity for everyone. Equinix remains committed to ensuring we have consistent practices in place to recognize, reward and promote all employees, regardless of gender, ethnicity, sexual orientation, or other protected class. Equinix operates a rigorous governance framework to manage pay and other compensation elements to ensure that all reward decisions are made equitably and without discrimination or bias. All roles are mapped and graded to one consistent global organizational framework. Each grade has a specific pay range informed by benchmarking against the external market in the country in which the role is located. This global framework is also used to determine target levels for annual bonuses and long-term incentives. We strive to update annually our global market data where information is available.\nOur employee engagement efforts differentiate Equinix's culture and accelerate our competitive advantage as they lead to more inclusive and high performing teams, higher employee satisfaction and overall organizational innovation and success. In 2024, employee satisfaction scores resulted in an average score of 81 for Equinix, followed by our average belonging score of 83 and average well-being score of 86. Our Employee Connection \n11\nTable of \nContents\nNetworks (\"EECNs\") are a strategic cornerstone of our inclusive culture, fostering a sense of belonging that drives engagement and business impact. Open to all employees, our nine EECNs are designed to provide meaningful learning opportunities, raise awareness of diverse perspectives, and strengthen connections across the organization. \nWe recognize that creating the best workplace and culture requires a global effort with localized approaches. As of 2024, we have 40 global WeAreEquinix teams, led by employee volunteers, who are empowered to create and promote belonging in locations across the world. Through both virtual and in-person connection, and in collaboration with the business and their local communities, these volunteer leaders create opportunities to support Wellbeing, Sustainability, and Community engagement. Across our EECNs and WeAreEquinix teams, we currently have 853 volunteer leaders who are working on strengthening community and belonging for our workforce.\nThe Equinix Foundation and Equinix Community Impact program promote connection and belonging by enabling employees to give back through volunteer services, donations and more, to the communities in which we work and live. In 2024, our employees volunteered over 37,500 hours, representing an increase of approximately 50% year-over-year. Since the launch of the Equinix Foundation in 2022, we have continued to focus on the advancement of digital inclusion— from access to technology and connectivity to the skills needed to thrive in today's digitally-driven world. \nWe believe our commitment to the highest standards of honesty, integrity and ethical behavior differentiates our business as much as our technology. We promote these high standards through a number of policies including the Equinix Code of Business Conduct. All employees are required to complete training in ethics and the company’s anti-bribery and corruption policies. In addition, we maintain a confidential ethics helpline where employees are encouraged to speak up if they have any questions or concerns that our code of conduct is being violated. We have a zero-tolerance, non-retaliation policy that protects our employees when they speak up.\nOur comprehensive approach to health and safety combines global policies, rigorous inspections and targeted training to foster a safe and supportive work environment. This approach upholds our commitment to employee well-being across all our operations and limits service disruptions, ensuring we meet customer needs. Well-being is weaved into our employee experience and benefit offerings, driven globally through health programs, ergonomic support, technology reimbursements, and a company-wide wellness day.\nOur investment in furthering our human capital efforts aligns with our business strategy and enables Equinix's impact and success. We are committed to creating a workplace that allows individuals to contribute their unique strengths, share their varied perspectives, and grow their skills leading to meaningful and fulfilling careers.\nSustainability\nAt Equinix, our Future First sustainability strategy rallies our people and partners to envision a better future and then do what it takes to make it happen. As the world’s digital infrastructure leader, we have the responsibility to harness the power of technology to create a more connected and sustainable future. The sustainability initiatives comprising our Future First strategy focus on material issues that have the greatest impact on our stakeholders and our business. We continue to progress on our sustainability goals and look to build a business and world that reflects our purpose to bring the world together on our platform to create innovations that will enrich our work, life and planet. We document our sustainability progress in our Annual Report and in our annual Corporate Sustainability Report located on our corporate website.\nIn 2021, we set a validated near-term science-based target (“SBT”) for emissions reduction across our global operations and supply chain. Our climate commitments are a critical step to ensure that we continue to advance investments and innovations to reduce greenhouse gas (\"GHG\") emissions and keep global warming to 1.5 degrees Celsius in alignment with the Paris Climate Agreement. In addition, we published an Environmental Sustainability and Global Climate Change Policy to detail our approach and practices related to the environment, climate change, resource efficiency and reporting. \nIn 2022, we undertook a climate-related scenario analysis based on the Task Force on Climate Related Financial Disclosures (\"TCFD\") recommendations. The analysis modeled physical risks across multiple climate change scenarios and time horizons. In 2023, we completed a transition risk scenario analysis across several global decarbonization scenarios. The analysis indicated that our climate commitments directly reduce our risk exposure to different future carbon policy environments that are aligned with the Paris Climate Agreement. We are continuing our work to embed climate change risk management into our business where relevant. \n12\nTable of \nContents\nEnvironmental Performance\nEquinix was the first data center company to set a long-term goal of 100% clean and renewable energy coverage across our global portfolio of IBXs. Our purchasing principles include the use of clean and renewable energy, securing local renewable energy sources where possible, advocating for favorable renewable energy policies, and considering renewable energy availability when locating new data centers. Since 2017, we have covered 100% of our U.S. load annually from a portfolio of renewable energy projects, utility green tariffs, and Renewable Energy Certificates (\"RECs\"), including 225 MW of wind power under long-term power purchase agreements (\"PPAs\") located in Oklahoma and Texas. As of December 31, 2024, we have executed 25 PPAs in 10 countries, which brings our total portfolio to 1,289 MW of new wind and solar capacity in Australia, Finland, France, India, Italy, Portugal, Singapore, Spain, Sweden, and the United States. In 2023, 96% of our global electricity consumption, and 100% of U.S. and European electricity consumption, was covered by renewable energy sources.\nWe are committed to measuring and reporting our global Greenhouse Gas (\"GHG\") footprint across direct (\"Scope 1\"), indirect energy (\"Scope 2\") and indirect value chain (\"Scope 3\") emission. As of 2023, we have achieved a 24% absolute reduction in operational GHG emissions from a 2019 baseline year (Scope 1 and Scope 2 market-based metric tons of carbon dioxide-equivalent (\"mtCO2e\")), even as the company increased its electricity consumption by 43% over the same period. In 2024, Equinix achieved an 'A' leadership score within the CDP Climate Change Survey for the third consecutive year. CDP is a global non-governmental organization dedicated to helping investors and companies measure and manage their climate risks.\nWe are leveraging technology and innovation to encourage commercialization of solutions that will enable the “Data Center of the Future”. Since 2020, we have issued 10 tranches of green bonds approximating $6.9 billion to support our sustainability initiatives. In 2024, we updated our Green Finance Framework, refreshing our eligibility criteria and introducing new categories, such as climate change adaptation. Our Green Finance Framework aligns our sustainability commitments with our long-term financing needs and highlights our pipeline of sustainability projects and data center innovations. As of December 31, 2023, we have allocated the net proceeds from $4.9 billion in issued green bonds to finance or refinance projects in categories of green buildings, renewable energy and energy efficiency. \nWe are also advancing environmental progress across other areas of our operations. In 2024, to address the growing importance of water and following the launch of the Sustainable Water Management Program in 2021, we launched a Water Focus Program. This program is driving the collaboration of engineering functions to identify and implement best practices in water management for cooling purposes. In 2023, Equinix started reporting on its Water Usage Effectiveness (\"WUE\") annually. \nSustainability Accounting Standards Board (\"SASB\") Disclosures\nThe following metrics are aligned with SASB Real Estate Standard version 2023-06 and represent the performance of our colocation facilities in the calendar years specified. Energy, renewable energy and GHG emissions are independently assured to ISO 14064-3:2019 Standards for the quantification and reporting of GHG emissions (Scope 1, 2 and 3). Calendar year data for 2024 will become available in Q2 2025 and will be published in our annual Corporate Sustainability Report located on our corporate website.\n13\nTable of \nContents\nEnergy Management: Energy Consumption\nYear\nEnergy Consumption Data as a % of Floor Area\nTotal Energy Consumed by Portfolio Area with Data Coverage (MWh) \n(1)\nLike-for-Like Change in Energy Consumption of Portfolio Area with Data Coverage (MWh) \n(2)\nGrid Electricity Consumption as a % of Energy Consumption\nEnergy Consumption from Renewable Sources (MWh)\n (3)\nRenewable Energy as a % of Energy Consumption \nLike-for-Like Change in Energy Consumption from Renewable Sources of Portfolio Area with Data Coverage\n \n(MWh) \n(2) (3)\nRenewable Energy as a % of Electricity Consumption\n2022\n(4)(5)\n96.3%\n7,820,000\n29.1%\n94.2%\n6,995,000\n90%\n32.1%\n91%\n2023\n(6)(7)\n92.2%\n8,217,000\n4.9%\n94.7%\n7,770,000\n95%\n5.2%\n96%\n(1)\nThe scope of energy includes energy used onsite and energy procured.\n(2)\nLike-for-like computed for stabilized asset list for the overlapping list of sites designated as stabilized in 2022 and 2023.\n(3)\nEquinix procures renewable energy to cover for the entire electricity consumption of sites. \n(4)\nRecently constructed or acquired sites for which no utility data is available are excluded, including LM1, ST1, ST2, ST3, ST4, AB1, AC1, LG1, LG2, PA10. Reseller sites are also excluded in the energy metrics (DA99, OS99, SH1).\n(5)\n2022 portfolio coverage excludes xScale\nTM\n sites: DB5x, SY9x.\n(6)\nRecently constructed or acquired sites for which no utility data is available are excluded. These include BG2, DC16, NY3, JH1, KL1, MB4, SL4, TY15, FR13, IL4, JN1, MD6. Reseller sites are also excluded in both the gross floor area and the energy metrics (DA99, OS99, SH1).\n(7)\n2023 portfolio coverage excludes xScale\nTM\n sites: DB6x, FR9x, OS4x, SL2x, SV12x.\nEnergy Management: Green Building Ratings \nOur data centers are designed with high operational excellence standards and energy efficiency in mind. Our data centers are planned holistically to incorporate the needs of our customers and communities, while minimizing the use of natural resources in our operations. \nOur Energy Efficiency Center of Excellence is driving a global approach to improving operational efficiency across our IBX locations from lighting and airflow management to efficient cooling innovations. The program also engages customers to manage their implementations more sustainably at our facilities, leading to overall improved site efficiencies.\nWe certify our data centers to green buildings and energy management certifications and schemes. These include USGBC LEED green buildings certifications, ISO 14001:2015 Environmental Management Standard, ISO 50001:2011 Energy Management Standard, BCA Green Mark, U.S. EPA Energy Star for Data Centers and others. In 2021, Equinix became a U.S. Green Building Council (\"USGBC\") Gold member, aligning with the developer of the LEED rating system and furthering our commitment to green buildings. Data centers receiving green building ratings in 2024 covered 696,390 gross sq. ft across Bogotá, Dublin, Osaka, Seoul, Warsaw and Zurich. \nIn 2024, we had 31.3 million gross sq. ft., or 95.9% of our global footprint, in operation with green buildings and energy management certifications. Within the U.S., we had 11.1 million gross sq. ft., or 100% of our footprint, under certification, including 1.8 million gross sq. ft., or 16.1% of U.S. footprint, having achieved U.S. EPA Energy Star for Data Centers. We disclose these and other site-level details about our data centers on our sustainability website.\nYear\nTotal Gross sq. ft. (million)\n(1)\nArea of Eligible Portfolio with Green Building Rating (million sq. ft.)\n(2)\nEligible Portfolio with Green Building Rating (%)\nGlobal Total through 2024\n32.6\n31.3\n95.9%\nU.S. Total through 2024\n11.1\n11.1\n1.8 (Energy Star)\n100%\n16.1% (Energy Star)\n(1)\nRatings included in our totals: ISO 50001 Energy Management, ISO 14001 Environmental Management, LEED green buildings certifications, U.S. Environmental Protection Agency Energy Star for Data Centers, BCA Green Mark, NABERS and Green Globes.\n(2)\nAs of December 2024, ten sites received Energy Star for Data Centers recognition, representing 16.1% of our U.S. portfolio. In contrast, our U.S. portfolio has 22 LEED-certified data centers or 46.7% of the U.S. portfolio by gross square footage.\n14\nTable of \nContents\nOur Business Segment Financial Information\nWe currently operate in three reportable segments comprised of our Americas, EMEA and Asia-Pacific geographic regions. Information attributable to each of our reportable segments is set forth in Note 18 within the Consolidated Financial Statements.\nAvailable Information\nEquinix owns and maintains intellectual property in the form of trademarks, patents, application programming interfaces, customer portals and a variety of products and other offerings. \nWe were incorporated in Delaware in June 1998. We are required to file reports under the Securities Exchange Act of 1934, as amended, with the Securities and Exchange Commission (\"SEC\"). The SEC maintains an internet website at http://www.sec.gov that contains reports, proxy and information statements and other information.\nYou may also obtain copies of our annual reports on Form 10-K, our quarterly reports on Form 10-Q and our current reports on Form 8-K, and any amendments to such reports, free of charge by visiting the Investor Relations page on our website, www.equinix.com. These reports are available as soon as reasonably practical after we file them with the SEC. Information contained on or accessible through our website is not part of this Annual Report on Form 10-K.\n15\nTable of \nContents",
    "item1a": "Item 1A. “Risk Factors” for further discussion of cybersecurity risks. \n44\nTable of Contents",
    "item1b": "Item 1B.",
    "item1c": "ITEM 1C.    Cybersecurity\nEquinix Risk Management and Strategy\nEquinix has processes for assessing, identifying, and managing material risks from cybersecurity threats, both integrated into our Governance, Risk and Compliance Program (the “GRC Program”) and existing within our Information Security function (“InfoSec”) led by a Chief Information Security Officer (“CISO”).\n Our prior CISO departed Equinix in the fourth quarter of 2024, at which time we appointed a tenured Equinix Information Technology senior leader to the role in an interim capacity. To assist our interim CISO, we have engaged a technology risk consultant in an advisory role.\nThe foundation of risk oversight at Equinix is our Governance, Risk and Compliance Committee (“GRCC”), overseen by the Nominating and Governance Committee of our Board. The GRCC is a global, cross-functional group currently comprised of global senior leaders, across functions such as Legal, Compliance and Risk Management. The GRCC considers enterprise and emerging risks via Equinix’s Enterprise Risk Management Program (the “ERM Program”). Our ERM Program focuses on the identification, assessment, management, monitoring and reporting of key business risks. Risk identification involves periodic risk surveys and/or risk interviews with key business process owners and executives to identify key strategic, operational, financial, regulatory, compliance and external risks at the enterprise level. Our next global risk assessment to identify enterprise risks will be conducted in the first half of 2025. In addition, the ERM Program also includes an Emerging Risks Team of business leaders at Equinix, representing a majority of business functions, that meets monthly to identify fast-moving, potentially impactful risks.\nThe GRCC prioritizes top enterprise and emerging risks for reporting to and dialoguing with our executive staff at least quarterly, and from this discussion, risks are presented to the Nominating and Governance Committee to consider for further assessment and report-out either to a committee or the full Board as appropriate. \nThe ERM Program works with risk owners to gather, evaluate, and prioritize risk information through the completion of a risk assessment and creation of a risk profile document. Top risks, including those related to cybersecurity, are evaluated through a detailed risk assessment, and the risks are reexamined periodically as needed. InfoSec performs an annual refresh of an information security risk profile document as required by this process, and the results of such assessment are reported out for escalation, prioritization and reporting on an annual basis.\nCybersecurity Risk Management and Strategy\nEquinix cybersecurity risk management activities and outcomes are guided by the National Institute of Standards and Technology (“NIST”) Cybersecurity Framework (“CSF”) and assessed by a third party. In addition, our cybersecurity program is certified globally against the International Organization for Standardization (“ISO”) 27001 standards. Currently, our cybersecurity program includes the following key categories of security controls with many security capabilities serving under each category: Governance, Access Control, Awareness and Training, Audit and Accountability, Configuration Management, Contingency Planning, Incident Response, Data Security, Continuous Monitoring, Maintenance Controls, Media Protection, Physical Protections, Risk Assessment, Third-Party Risk Management, System and Communications Projection, and System and Information Integrity. \nEquinix has also implemented controls designed to identify and mitigate cybersecurity risk associated with our use of third-party service providers, such as security risk assessments. We use a variety of inputs in such assessments, including information supplied by the third parties and regular monitoring.\nEquinix conducts regular employee training on how to spot suspicious activity, educates employees on potential security risks, and periodically runs simulations of cyber incidents for employees across various functions to assess and refine response capabilities. Equinix also offers a role-based security certification for its software engineering employees.\n43\nEquinix’s cybersecurity risk management processes are carried out in the context of broader business objectives and are integrated into Equinix’s broader risk management processes as described above in “Equinix Risk Management and Strategy”.\nEquinix does not generally engage any consultants, auditors, or other third parties in connection with processes for assessing, identifying and managing risks from cybersecurity threats other than the technology risk consultant identified above.\nBoard of Directors’ Oversight of Risks from Cybersecurity Threats\nThe Nominating and Governance Committee oversees our GRC Program per its charter, reviewing and considering developments related to the GRC Program and reporting on the GRC Program’s activities and recommendations to the full Board. \nInformation security risks have been deemed by our Board to be of critical importance to Equinix, and thus the Nominating and Governance Committee receives quarterly updates on cybersecurity and the full Board receives a briefing on cybersecurity at least annually. These briefings are conducted by our \nCISO and members of the InfoSec leadership team\n and cover topics such as key risk indicators, the status of strategic programs, operational updates and key initiatives, past and future action plans, and InfoSec functional updates.\n \nIn the event of a material cybersecurity incident, the full Board would be convened on a frequent basis to receive updates and provide oversight.\nManagement’s Role in Assessing and Managing Material Risks\n \nfrom Cybersecurity Threats\nThe Information Security Steering Committee (“ISSC”)\n is a key element of our cybersecurity strategy. The ISSC is chaired by the CISO and comprises of a cross-functional group of senior leaders from various functions in the company. The ISSC aims to align our security and compliance programs with business objectives. Specifically, the ISSC (i) facilitates identification of risk-based priorities and trade-offs; (ii) aims to ensure economies of scale and consistency of information security and compliance across IT assets at the company; (iii) reviews and approves information security policies; (iv) reviews requests for policy and risk exceptions to provide a “Risk Acceptance Authorization”; and (v) serves as a communications channel and steward to cultivate a culture of trust across the enterprise.\nThe ISSC currently meets quarterly. In addition, various subcommittees meet on an as-needed basis to address business needs. At the ISSC, topics such as changes to the InfoSec risk register, notable issues, and information security projects are discussed.\n \nOur interim CISO brings over 20 years of experience in information technology, which enables him to ensure alignment of our cybersecurity program with our critical infrastructure strategies.\n He has experience in implementing and operating a governance framework and core controls in information technology. Further, he oversaw the building of our application disaster recovery infrastructure for all production applications at Equinix, and since that time has been responsible for operating this infrastructure and ongoing disaster recovery testing. All of this experience is applicable and relevant to our cybersecurity program at Equinix.\n \nAdditionally, team members supporting our program have relevant education and information security experience.\n \nRisks From Cybersecurity Threats\nAlthough we believe we have a robust program to protect against cybersecurity risks, we may not be able to prevent a cybersecurity incident that \ncould\n have a material adverse effect on us.\n While we maintain cybersecurity insurance, the costs related to cybersecurity threats or disruptions may not be fully insured. See"
  }
}