{
  "ticker": "ERIE",
  "cik": "0000922621",
  "company_name": "ERIE INDEMNITY CO",
  "filing_date": "2025-02-27",
  "accession": "0000922621-25-000004",
  "primary_doc": "erie-20241231.htm",
  "item_sections": {
    "item1": "Item 16.\nForm 10-K Summary\n79\n \n \n \n \n \n \nSignatures\n83\n2\nTable of Contents\nPART I\nITEM 1.     BUSINESS\n \nGeneral\nErie Indemnity Company (\"Indemnity\", \"we\", \"us\", \"our\") is a publicly held Pennsylvania business corporation that has since its incorporation in 1925 served as the attorney-in-fact for the subscribers (policyholders) at the Erie Insurance Exchange (\"Exchange\").  The Exchange, which also commenced business in 1925, is a Pennsylvania-domiciled reciprocal insurer that writes property and casualty insurance.  The Exchange has wholly owned property and casualty insurance subsidiaries including:  Erie Insurance Company, Erie Insurance Company of New York, Erie Insurance Property & Casualty Company and Flagship City Insurance Company, and a wholly owned life insurance company, Erie Family Life Insurance Company (\"EFL\"). \nOur primary function as attorney-in-fact is to perform policy issuance and renewal services on behalf of the subscribers at the Exchange.  We also act as attorney-in-fact on behalf of the subscribers at the Exchange with respect to all claims handling and investment management services, as well as the service provider for all claims handling, life insurance, and investment management services for the Exchange's insurance subsidiaries, collectively referred to as \"administrative services\".  Acting as attorney-in-fact in these two capacities is done in accordance with a subscriber's agreement (a limited power of attorney) executed individually by each subscriber (policyholder), which appoints Indemnity as each subscriber's attorney-in-fact to transact certain business on their behalf.  In accordance with the subscriber’s agreement for acting as attorney-in-fact in these two capacities, we retain a management fee calculated as a percentage, not to exceed 25%, of the direct and affiliated assumed premiums written by the Exchange.  The management fee rate is set at least annually by our Board of Directors.  The process of setting the management fee rate includes, but is not limited to, the evaluation of current year operating results compared to both prior year and industry estimated results for both Indemnity and the Exchange, and consideration of several factors for both entities including, but not limited to: their relative financial strength and capital position; projected revenue, expense and earnings for the subsequent year; future capital needs; as well as competitive position.\nBusiness Segments\nWe operate under a single reportable segment: management operations.  Financial information about this segment is set forth in and referenced to Item 8. “Financial Statements and Supplementary Data - Note 4, Segment Information, of Notes to Consolidated Financial Statements” contained within this report.  Further discussion of financial results for our single operating segment is provided in and referenced to Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of Operations” contained within this report.\nServices\nThe policy issuance and renewal services we provide on behalf of the subscribers at the Exchange are related to the sales, underwriting and issuance of policies.  The sales related services we provide include agent compensation and certain sales and advertising support services.  Agent compensation includes scheduled commissions to agents based upon premiums written as well as incentive compensation, which is earned by achieving targeted measures.  Agent compensation comprised approximately 69% of our 2024 policy issuance and renewal expenses.  The underwriting services we provide include underwriting and policy processing and comprised approximately 9% of our 2024 policy issuance and renewal expenses.  The remaining services we provide include customer service and administrative support.  We also provide information technology services that support all the functions listed above that comprised approximately 9% of our 2024 policy issuance and renewal expenses.  Included in these expenses are allocations of costs for departments that support these policy issuance and renewal functions.\nConsistent with its legal structure as a reciprocal insurer, the Exchange does not have any employees or officers.  Therefore, it enters into contractual relationships by and through the subscribers' attorney-in-fact.  Indemnity serves as the attorney-in-fact on behalf of the subscribers at the Exchange with respect to its administrative services as enumerated in the subscriber's agreement.  The Exchange's insurance subsidiaries also utilize Indemnity for these services in accordance with the service agreements between each of the subsidiaries and Indemnity.  Claims handling services include costs incurred in the claims process, including the adjustment, investigation, defense, recording and payment functions.  Life insurance management services include costs incurred in the management and processing of life insurance business.  Investment management services are related to investment trading activity, accounting and all other functions attributable to the investment of funds.  Included in these expenses are allocations of costs for departments that support these administrative functions.  The subscriber's agreement and service agreements provide for reimbursement of amounts incurred for these services to Indemnity.  Reimbursements are settled at cost.  State insurance regulations require that intercompany service agreements and any material amendments be approved in advance by the state insurance department. \n3\nTable of Contents\nErie Insurance Exchange\nAs our primary purpose is to manage the affairs at the Exchange for the benefit of the subscribers (policyholders) through the policy issuance and renewal services and administrative services, the Exchange is our sole customer.  Our earnings are largely generated from management fees based on the direct and affiliated assumed premiums written by the Exchange.  We have no direct competition in providing these services to the Exchange.  \nThe Exchange generates revenue by insuring preferred and standard risks, with personal lines comprising 71% of the 2024 direct and affiliated assumed written premiums and commercial lines comprising the remaining 29%.  The principal personal lines products are private passenger automobile and homeowners.  The principal commercial lines products are commercial multi-peril, commercial automobile and workers compensation.  Historically, due to policy renewal and sales patterns, the Exchange's direct and affiliated assumed written premiums tend to be greater in the second and third quarters than in the first and fourth quarters of the calendar year.\nThe Exchange is represented by independent agencies that serve as its sole distribution channel.  In addition to their principal role as salespersons, the independent agents play a significant role as underwriting and service providers and are an integral part of the Exchange's success.\nOur results of operations are tied to the growth and financial condition of the Exchange.  If any events occurred that impaired the Exchange's ability to grow or sustain its financial condition, including but not limited to reduced financial strength ratings, disruption in the independent agency relationships, significant catastrophe losses, or products not meeting customer demands, the Exchange could find it more difficult to retain its existing business and attract new business.  A decline in the business of the Exchange almost certainly could have as a consequence a decline in the total premiums paid and a correspondingly adverse effect on the amount of the management fees we receive.  We also have an exposure to a concentration of credit risk related to the unsecured receivables due from the Exchange for net management fee and other reimbursements.  See Part II, Item 8. \"Financial Statements and Supplementary Data - Note 16, Concentrations of Credit Risk, of Notes to Consolidated Financial Statements\" contained within this report.  See the risk factors related to our dependency on the growth and financial condition of the Exchange in",
    "item1a": "Item 1A. \"Risk Factors\" for a discussion of cybersecurity risks.",
    "item1b": "ITEM 1B.     UNRESOLVED STAFF COMMENTS\n \nNone\n13\nTable of Contents",
    "item1c": "ITEM 1C.     CYBERSECURITY\nCybersecurity Risk Management\nWe maintain a cybersecurity program in alignment with our overall Enterprise Risk Management (\"ERM\") program. \n \nSee Part II, Item 7. \"Management’s Discussion and Analysis of Financial Condition and Results of Operations\" contained within this report for additional information on the ERM function.  Our Privacy and Information Security Committee, comprised of officers and senior leaders, is responsible for overseeing the development and maintenance of information privacy and security policies and effective operation of our corporate information security and cybersecurity program in compliance with applicable state insurance regulations and other legal and regulatory requirements.  This committee is sponsored by and reports directly to our Executive Council, which includes our Chief Executive Officer (\"CEO\"), Chief Financial Officer, executive vice presidents and certain senior vice presidents reporting directly to the CEO as applicable.\nOur cybersecurity program of technical, administrative, and physical controls is intended to reduce the risk of cyber threats and protect our information, as well as document processes to determine and make appropriate disclosures regarding potential material threats and incidents.\n  Our cybersecurity philosophy and approach align to the National Institute of Standards and Technology Cybersecurity Framework and its core elements to govern, identify, protect, detect, respond, and recover from the various forms of cyber threats.  Our practices include, but are not limited to, cybersecurity protocols and controls, system monitoring and detection, communication of incidents to appropriate management, \nthird-party risk management\n, including assessments of emerging threats and vulnerabilities, and ongoing privacy and cybersecurity training for employees and contractors concerning cyber risk.\n  A foundational element of our cybersecurity risk management processes is the annual Cybersecurity and Information Security Risk Assessment (CSRA), which includes an analysis of cybersecurity risks facing us and associated recommendations and action items to mitigate identified risks.  \nWe periodically utilize third parties to assess the effectiveness of our cybersecurity efforts through independent validations, verifications, and security assessments.\n \nOur Board of Directors has a process in place to monitor management’s oversight of cybersecurity.  This is done primarily through regular reports to its Risk Committee as well as the full \nBoard of Directors\n.  Management provides reports on the emerging cybersecurity threat landscape and our cybersecurity risk management program, including our risk evaluation, the results of independent third-party security assessments, and our efforts to manage cyber related risks.\nWe have a core incident response team (Core Team) consisting of dedicated, skilled leadership representatives from our Information Security, Privacy and Law teams, responsible for analyzing and assessing cyber incidents and leading response efforts.  Our \nChief Information Security Officer (CISO)\n, responsible for overseeing and managing information security incidents, has over 25 years of experience in information technology (IT), including over 20 years dedicated to practicing or leading cybersecurity functions.  Our CISO is also a Certified Information Systems Security Professional (CISSP).  Our Privacy leader, responsible for managing privacy incidents, has over 20 years of experience in IT risk management, including over 10 years in IT risk and control functions and the remaining time focused on privacy and cybersecurity related functions and holds several information privacy and risk certifications.  Our Legal leader, responsible for providing guidance on legal and other regulatory obligations in the areas of privacy, cybersecurity, technology, data use and third-party risk management, holds a Juris Doctor degree, is licensed to practice law, and has over 20 years of legal experience, including 10 years focused on privacy and cybersecurity and holds several information security and privacy certifications, including the CISSP.  The Core Team leaders are members of various organizations that support cybersecurity or privacy intelligence, education, information sharing and networking, including among others the Financial Services Information Sharing and Analysis Center (FS-ISAC), Domestic Security Alliance Council (DSAC), InfraGard, and International Association of Privacy Professionals (IAPP).\nThe Core Team members are augmented as needed by representatives from other internal groups, including subject matter experts from Information Security, Privacy, Finance and Law, as well as certain third parties that may need to participate in the incident response process.  Depending on the severity and impact of the incident, third parties engaged may include outside counsel, forensics investigators, public relation firms, data breach resolution providers, and cyber insurance brokers and carriers.  In conjunction with legal counsel, the Core Team evaluates notification requirements and as necessary will notify stakeholders depending on the nature and severity of the incident, including law enforcement, state attorneys general, regulators, external auditors, third party providers, and impacted individuals.\nThe Core Team is informed of cyber incidents from diverse sources, including for example, internal monitoring systems, information sharing organizations, employees, and other external information sources.  Depending upon the levels of access to our information and/or information systems, third party service providers are contractually obligated to report cybersecurity incidents within their environments.  The Core Team performs incident analysis and triage to determine scope, severity, prioritization and required response plans to address an incident in a manner that is intended to minimize the impact to us, our assets, and our operations.  In accordance with applicable legal and regulatory requirements, this analysis and triage step \n14\nTable of Contents\nincludes an assessment of the potential for material impact to us from a cybersecurity incident or a series of individually immaterial related incidents that are material when aggregated.\nTo date, we are not aware of any cybersecurity breach or other incident with respect to our systems or data that would have a material impact to our business strategy, results of operations or financial condition.\n  Additionally, we are not aware of any cybersecurity breach or other incident experienced by anyone with whom we have a third-party relationship that has had a material impact on our systems or data.  However, there can be no guarantee that we will not experience any such incidents in the future.  See"
  }
}