{
  "ticker": "ETN",
  "cik": "0001551182",
  "company_name": "Eaton Corp plc",
  "filing_date": "2025-02-27",
  "accession": "0001551182-25-000006",
  "primary_doc": "etn-20241231.htm",
  "item_sections": {
    "item1": "Item 16.\nForm 10-K Summary\n18\nSIGNATURES\n19\nTable of Contents\nPart I\nItem 1. Business.\nEaton Corporation plc (Eaton or the Company) is an intelligent power management company dedicated to protecting the environment and improving the quality of life for people everywhere. We make products for the data center, utility, industrial, commercial, machine building, residential, aerospace and mobility markets. We are capitalizing on the megatrends of the energy transition, electrification, and digitalization. The reindustrialization of and growth of megaprojects in North America and increased global infrastructure spending focused on clean energy programs are expanding our end markets and positioning Eaton for growth for years to come. We are strengthening our participation across the entire electrical power value chain and benefiting from momentum in the data center and utility end markets as well as a growth cycle in the commercial aerospace and defense markets. We are guided by our commitment to operate sustainably and with the highest ethical standards. Our work is accelerating the planet’s transition to renewable energy sources, helping to solve the world’s most urgent power management challenges, and building a more sustainable society for people today and for future generations.\nFounded in 1911, Eaton has continuously evolved to meet the changing and expanding needs of our stakeholders. With revenues of nearly $25 billion in 2024, the Company serves customers in more than 160 countries.\nEaton electronically files or furnishes reports pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934 (Exchange Act) to the United States Securities and Exchange Commission (SEC), including annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and proxy and information statements, as well as any amendments to those reports. As soon as reasonably practicable, these reports are available free of charge through the Company's website at www.eaton.com. These filings are also accessible on the SEC's website at www.sec.gov.\nAcquisitions and Divestitures of Businesses\nInformation regarding the Company's acquisitions and divestitures is presented in Note 2 of the Notes to the consolidated financial statements.\nBusiness Segment Information\nInformation by business segment regarding principal products, principal markets, methods of distribution and net sales is presented in Note 19 of the Notes to the consolidated financial statements. Additional information regarding Eaton's segments and business is presented below.\nElectrical Americas and Electrical Global\nPrincipal methods of competition in these segments are performance of products and systems, technology, customer service and support, and price. Eaton has a strong competitive position in these segments and, with respect to many products, is considered among the market leaders. In normal economic cycles, sales of these segments are historically lower in the first quarter and higher in the third and fourth quarters of a specific year. In 2024, 26% of these segments' sales were made to eight large customers of electrical products and electrical systems and services.\nAerospace\nPrincipal methods of competition in this segment are total cost of ownership, product and system performance, quality, design engineering capabilities, and timely delivery. Eaton has a strong competitive position in this segment and, with respect to many products and platforms, is considered among the market leaders. In 2024, 23% of this segment's sales were made to four large original equipment manufacturers of aircraft.\nVehicle\nPrincipal methods of competition in this segment are product performance, technology, global service, and price. Eaton is considered among the market leaders in this segment. In 2024, 28% of this segment's sales were made to two large original equipment manufacturers of vehicles and related components.\neMobility\nPrincipal methods of competition in this segment are product performance, technology, global service, and price. In 2024, 27% of this segment's sales were made to three large original equipment manufacturers of vehicles, construction equipment and related components.\n2\nTable of Contents\nInformation Concerning Eaton's Business in General\n \nRaw Materials\nEaton's major requirements for raw materials include iron, steel, copper, nickel, aluminum, lead, silver, gold, titanium, rubber, plastic, electronic components, chemicals, and fluids. Materials are purchased in various forms, such as coils, sheets, strips, ingots, bars, extrusions, castings, forgings, stampings, powder metal, plastic resins, and pellets. Raw materials, as well as parts and other components, are purchased from many suppliers. Under normal circumstances, the Company has no difficulty obtaining its raw materials. To mitigate the impact of supply chain risk events we continue to invest in supply chain resiliency and work closely with our partners.\nIntellectual Property\nEaton considers its intellectual property, including without limitation patents, trade names, domain names, trademarks, confidential information, and trade secrets to be of significant value to its business as a whole. The Company's products may be manufactured, marketed and sold using a portfolio of patents, trademarks, licenses, and other forms of intellectual property, some of which expire in the future. Eaton develops and acquires new intellectual property on an ongoing basis and considers all of its intellectual property to be valuable. Based on the broad scope of the Company's product lines, management believes that the loss or expiration of any single intellectual property right would not in and of itself have a material effect on Eaton's consolidated financial statements or its business segments. The Company works diligently to protect its intellectual property, including innovations, through various legal means.\nEnvironmental Contingencies\nOur comprehensive sustainability strategy is driven by our mission to improve the quality of life and the environment. We are committed to reducing our footprint, eliminating waste, and making the best use of natural resources. None-the-less, operations of the Company involve emissions, as well as the use and disposal of certain substances regulated under environmental protection laws. Eaton continues to modify processes on an ongoing, regular basis in order to reduce the impact on the environment, including the reduction or elimination of certain chemicals used in, and wastes generated from, operations. Compliance with laws that have been enacted or adopted regulating the discharge of materials into the environment, or otherwise relating to the protection of the environment, are not expected to have a material adverse effect upon capital expenditures, including expenditures for environmental control facilities, earnings or the competitive position of the Company. Compliance with future environmental protection laws may require an increase in capital expenditures. Information regarding the Company's liabilities related to environmental matters is presented in Note 11 of the Notes to the consolidated financial statements.\nHuman Capital Management\nEaton has approximately 94,000 employees globally. The number of persons employed by our reportable segments and corporate at December 31, 2024 are as follows:\n(In thousands)\n2024\nElectrical Americas\n33 \nElectrical Global\n25 \nAerospace\n12 \nVehicle\n13 \neMobility\n2 \nCorporate\n9 \nTotal number of persons employed \n94 \n3\nTable of Contents\nEaton uses and monitors a variety of metrics to ensure our objectives related to employee attraction, development, and retention are met. Most notably, Eaton tracks the following:\nInclusion and Diversity\nEaton is committed to having a workforce that is diverse and inclusive at all levels. Our success depends on our ability to attract and retain the best employees without regard to race, color, social or economic status, religion, national origin, marital status, age, veteran status, sexual orientation, gender identity, or any protected status. It is the policy of the Company to make all decisions regarding employment based on the principle of equal employment opportunity and without discrimination. \nAt December 31, 2024, Eaton’s distribution by gender, and United States distribution by minority status, is as follows: \nTotal Global\nNumber of women\n(Global)\nPercentage of women\n(Global)\nU.S. total\nNumber of minorities (U.S. only)\n1\nPercentage of minorities (U.S. only)\n1\nBoard of directors\n12 \n4 \n33.3 \n%\n10 \n5 \n50.0 \n%\nGlobal leadership team\n24 \n4 \n16.7 \n%\n22 \n9 \n40.9 \n%\nExecutives\n690 \n177 \n25.7 \n%\n495 \n109 \n22.0 \n%\nManagers\n8,780 \n2,186 \n24.9 \n%\n4,545 \n1,036 \n22.8 \n%\nAll other employees\n84,949 \n26,531 \n31.2 \n%\n24,901 \n8,959 \n36.0 \n%\nAll employees\n94,443 \n31,898 \n33.8 \n%\n29,963 \n10,113 \n33.8 \n%\n1 \nExcluding Puerto Rico\nAt Eaton, one of our aspirations is to be a model of inclusion and diversity among our peers. Our plan to achieve this encompasses a number of actions, including an examination into our programs, practices, processes, and policies to look for opportunities to strengthen our workforce. \nCompensation\nA key component of Eaton’s attraction and retention strategy is providing a competitive total rewards package which includes items such as salaries, wages, short- and long-term incentive compensation, in addition to health, welfare, retirement, and other benefits. Eaton regularly benchmarks its compensation and benefits practices against those of our industry peers and in the markets in which we operate to ensure our plans and programs are aligned with external practices in effort to maintain a high performing workforce. Eaton's 2024 total employee costs were $6.5 billion including salaries, wages, equity-based compensation, pension and other benefits. The total compensation of our median employee on October 1, 2023, as reported in our 2024 Proxy Statement filed on March 15, 2024, and as calculated in accordance with Item 402(u) of Regulation S-K, was $50,683. \nSafety\nThroughout our operations, our goal is to have no safety incidents and we continue to make progress towards that goal. Our 2023 Total Recordable Case Rate (TRCR) was 0.43 and our Days Away Case Rate (DACR) was 0.20. We have improved our TRCR 38% since 2018 and consider our 2030 target of 0.25 to be a world-leading safety rating. Our 2024 TRCR will be provided in our annual Sustainability Report to be issued in 2025.\nAchieving work-life balance\nAchieving work-life balance is a common concern of today's employees. Flexible work solutions and inclusive programs will help us remain competitive in attracting and retaining the best talent and make it possible for employees in varied situations to be able to remain at Eaton. Flexible solutions include compressed work weeks, remote working, job sharing, part-time work, flextime, and telework. \nEngagement\nFully engaged employees are more productive, innovative, and satisfied in their work. Examples of how we engage our employees include enterprise-wide town halls, hosting informal listening meetings and surveying groups of employees on specific subjects. In addition, we have programs focused on career development of employees at all levels and we are committed to a wide range of strategies designed to improve and sustain employee engagement over the long-term. Our most recent engagement survey of all employees was completed in 2023. Of those who responded to the survey, 84% had favorable engagement indicating they were proud to work at Eaton, felt personal accomplishment from their work, and would recommend Eaton as a place to work. We will perform another survey of all employees in 2025. \n4\nTable of Contents",
    "item1a": "Item 1A. Risk Factors.), our robust risk mitigation strategies have been effective. \nAccordingly, no such threats have materially affected or are reasonably likely to materially affect the company, our business strategy, results of operations or our financial condition.\nGovernance. \nEaton's Board of Directors is trained annually regarding incident response and risk management. \nWhile our \nBoard of Directors\n as a whole has oversight of risk management generally, cybersecurity risks fall to the Board’s Audit Committee\n. \nThe Company’s Chief Information Officer (CIO) and CISO report quarterly to the Audit Committee on any significant cybersecurity incidents, threats, mitigation strategies and controls.\n The Audit Committee then updates the full board on significant matters raised and discussed during these sessions. The Audit Committee also participates in risk management training related to cybersecurity risk management specifically.\n \nThe \nAudit Committee\n delegates day-to-day management of cybersecurity risks to the Company’s senior management, which includes our CISO, who reports to the Company’s CIO. Our CIO reports directly to the Chief Executive Officer\n. \nOur CISO leads a robust team of dedicated professionals that are responsible for a wide range of risk assessment and management and leads at least ten specialized teams of internal and external experts focusing on distinct categories of threats.",
    "item1b": "Item 1B. Unresolved Staff Comments.\n \nNone.\n7\nTable of Contents",
    "item1c": "Item 1C. Cybersecurity.\nRisk Management and Strategy.\nEaton follows the U.S. National Institute of Standards and Technology (NIST) Cyber Security Framework to structure protocols for identifying, assessing and managing cybersecurity risks. In accordance with NIST guidance, \nEaton maintains documented information security policies and standards to protect operations, assets, data and services and to defend against, respond to and recover from potential cyberattacks.\n These policies and standards include both preventive measures and reactive processes.\n Preventive measures include, but are not limited to, protective and detective cybersecurity systems, security monitoring, threat hunting and mandatory, enterprise-wide employee training. Eaton’s reactive processes are captured primarily by a cyber incident response plan (the IRP), which is comprised of an evolving set of procedures developed by cross-functional experts, and external consultants, who draw upon technical proficiency and learnings from past experiences. All of these procedures and practices are tailored to Eaton’s technology environment and are refined iteratively. Further, \nEaton has an information risk management program that includes a vendor risk assessment process, whereby Eaton systematically oversees and identifies risks from cybersecurity threats related to its \nuse of third-party service providers\n.\nThe IRP is executed by an Incident Response Team (IRT), led by our Chief Information Security Officer (CISO). The exact composition of the IRT varies depending on the severity and potential impact of an incident, and will typically include stakeholders across corporate and business functions. The team collaborates with internal experts and may engage external resources to assess and contain a threat if deemed necessary. Such external resources may potentially include forensic investigation and response firms, law firms, external auditors, forensic accountants, and consultants who are on retainer contracts for expedited availability.\n \nWhile cybersecurity threats remain a risk to the Company’s business operations (see discussion in"
  }
}