{
  "ticker": "EW",
  "cik": "0001099800",
  "company_name": "Edwards Lifesciences Corp",
  "filing_date": "2025-02-28",
  "accession": "0001099800-25-000005",
  "primary_doc": "ew-20241231.htm",
  "item_sections": {
    "item1": "Item 1.    Business\n       \nOverview\nEdwards Lifesciences Corporation is the leading global structural heart innovation company, driven by a passion to improve patient lives. Through breakthrough technologies, world-class evidence and partnerships with clinicians and healthcare stakeholders, our employees are inspired by our patient-focused culture to deliver life-changing innovations to structural heart patients who need them most.\n \nEdwards Lifesciences has been a leader in our field for over six decades.\n \nSince our founder, Miles Lowell Edwards, first dreamed of using engineering to address diseases of the human heart, we have steadily built a company on the premise of imagining, building, and realizing a better future for patients.\nOur innovative work encompasses both surgical and transcatheter therapies. In addition, our unique portfolio of repair and replacement technologies for both mitral and tricuspid heart valves provides a broad set of treatment options to serve the many diverse and complex patients in need. Edwards remains committed to its strategy of transformative product innovation, robust and expanding clinical evidence to support approvals and adoption, as well as comprehensive support to ensure excellent real-world patient outcomes.    \nCardiovascular disease is the number-one cause of death in the world and is the top disease in terms of health care spending in nearly every country. In the U.S. alone, one cardiovascular patient dies every 33 seconds. Cardiovascular disease is progressive in that it tends to worsen over time and often affects the structure of\n \nan individual's heart. Our vision is to transform patient care where patients are diagnosed earlier, treated in a routine fashion, live longer, and enjoy a better quality of life. Our future growth opportunities include offering solutions for treating patients with both valvular and non-valvular structural heart disease, such as heart failure, which is a natural progression of the disease for many patients suffering from aortic stenosis and mitral and tricuspid regurgitation\nPatients undergoing treatment for cardiovascular disease can be treated with a number of our medical technologies, which are designed to address individual patient needs with respect to disease process, comorbidities, and health status. For example, an individual with a heart valve disorder may have a faulty valve that is affecting the function of his or her heart or blood flow throughout his or her body. A cardiac surgeon may elect to remove the valve and replace it with one of our bioprosthetic surgical tissue heart valves or surgically re-shape and repair the faulty valve with an Edwards annuloplasty ring. Alternatively, a clinician (typically an interventional cardiologist) may implant an Edwards transcatheter valve or repair system via a catheter-based approach that does not require traditional open-heart surgery and can be done while the heart continues to beat. \nCorporate Background\nOur principal executive offices are located at One Edwards Way, Irvine, California 92614. The telephone number at that address is (949) 250-2500. We make available, free of charge on our website located at www.edwards.com, our annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and any amendments to those reports, as soon as reasonably practicable after filing such reports with the Securities and Exchange Commission (\"SEC\"). The contents of our website are not incorporated by reference into this report.\nEdwards Lifesciences' Product and Technology Offerings\nThe following discussion summarizes the main groups of products and technologies we offer to treat advanced cardiovascular disease. Our products are categorized into the following groups: Transcatheter Aortic Valve Replacement (\"TAVR\"), Transcatheter Mitral and Tricuspid Therapies (\"TMTT\"), and Surgical Structural Heart (\"Surgical\"). For more information on net sales from these three main groups, see \"\nNet Sales by Product Group\n\" in Part II, Item 7 \"\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\n.\" \nTranscatheter Aortic Valve Replacement \nWe are the global leader in transcatheter heart valve replacement technologies designed for the minimally-invasive replacement of aortic heart valves. The \nEdwards SAPIEN\n family of valves, including the \nEdwards SAPIEN 3\n, the \nEdwards SAPIEN 3 Ultra\n, and the\n Edwards SAPIEN 3 Ultra RESILIA\n systems, are catheter-based approaches for treating patients who have severe aortic stenosis. The \nSAPIEN 3 \nvalves are delivered while the heart is still beating. The majority of these procedures are conducted without the use of general anesthesia and patients are discharged home within one to two days. Transcatheter aortic valve replacement with the \nSAPIEN 3\n family of valves enables patients to recover more quickly and return to a better quality of life sooner than patients receiving traditional open heart surgical therapies. Edwards' transcatheter aortic heart valves \n2\nTable of Contents\nwere first commercialized in Europe in 2007, in the United States in 2011, and in Japan in 2013.\n \nEdwards has partnered with the physician community to generate optimistic data that has expanded access to patients of all risk profiles. In 2024, \nEARLY TAVR\n trial data were presented, demonstrating the superiority of early TAVR intervention in severe asymptomatic aortic stenosis patients with the \nSAPIEN 3\n platform versus clinical surveillance. The \nSAPIEN 3 \nplatform remains the only transcatheter heart valve with a THV-in-THV indication for patients assessed at high-risk for surgical replacement, offering patients the ability to have a second minimally invasive procedure. The \nSAPIEN\n family of valves are the most widely implanted transcatheter heart valves in the world with over one million patient lives impacted since launch. Additionally, the \nEdwards\n \nSAPIEN 3\n system and \nAlterra\n system offer a minimally invasive option for pulmonary valve replacement for patients with congenital heart disease.\nSales of our TAVR products represented 75%, 77%, and 79% of our net sales in 2024, 2023, and 2022, respectively.\nTranscatheter Mitral and Tricuspid Therapies\nWe continue to make significant investments in the development of transcatheter heart valve repair and replacement technologies designed to treat mitral and tricuspid valve diseases. While several technologies are in the development and clinical phases, the \nPASCAL Precision \ntranscatheter repair system (in Europe, the United States, and Japan), \nEVOQUE \ntricuspid valve replacement system (in Europe and the United States), and \nCardioband \ntricuspid valve reconstruction system (in Europe) are commercially available. The \nPASCAL Precision\n system addresses the needs of patients with mitral or tricuspid regurgitation through leaflet approximation, while the \nCardioband\n system enables clinicians to reduce the size of a valve's annulus to lower regurgitation. The \nEVOQUE\n system, the world's first transcatheter tricuspid valve replacement therapy to receive regulatory approval, addresses tricuspid valve regurgitation by replacing the native valve with a bioprosthetic valve. In addition to these therapies, we are pursuing a transcatheter mitral replacement strategy which we believe would position us for leadership in the mid-to-long term. The \nSAPIEN M3\n transcatheter mitral valve replacement system is based on the proven \nSAPIEN\n valve and is designed specifically for mitral patients. We believe both transcatheter repair and replacement are necessary to unlock the full mitral and tricuspid opportunity. \nSurgical Structural Heart\nWe continue to invest in bringing innovations to cardiac surgery patients. Our \nRESILIA\n tissue, with published clinical data showing 99% freedom from structural valve deterioration through seven years\n1\n, has set the new standard for tissue valve durability. Our flagship \nINSPIRIS RESILIA\n aortic valve, offers \nRESILIA\n tissue and \nVFit\n technology. \nINSPIRIS\n is the leading aortic surgical valve in the world. Sales of our surgical therapies in the United States also continue to gain traction with \nKONECT RESILIA\n, the first pre-assembled, ready to implant, tissue valved conduit for complex combined procedures. \nOur latest innovation, the \nMITRIS RESILIA\n valve, is commercially available in the United States, Europe, and Japan, as well as other geographies, where it has been widely adopted by surgeons as the leading product in our mitral valve portfolio. We believe the demand for surgical structural heart therapies is growing worldwide, and that our innovation strategy will continue to strengthen our leadership and positive impact on patients.\nSales of our surgical tissue heart valve products represented 18%, 19%, and 19% of our net sales in 2024, 2023, and 2022, respectively.\nCompetition\nThe medical technology industry is highly competitive. We compete with divisions of larger companies as well as smaller companies that offer competitive product lines in certain geographies in which we operate. We also compete with both established and newer technologies that target the patients served by our products. New product development and technological change characterize the areas in which we compete. Our present or future products could be rendered obsolete or uneconomical as a result of technological advances by one or more of our present or future competitors or by other therapies, including drug therapies. Our strategy is to develop and produce safe and effective therapies supported by rigorous clinical studies with extensive data and with innovative features that can enhance patient benefits and product performance and reliability, as well as benefit healthcare systems. The benefits associated with our products are in part due to the level of customer and clinical support we provide. \n1\n \nBeaver T, Bavaria JE, Griffith B, et al. Seven-year outcomes following aortic valve replacement with a novel tissue bioprosthesis. Presented at the 103rd Annual Meeting of the American Association for Thoracic Surgery, May 2023. \n3\nTable of Contents\nThe cardiovascular segment of the medical technology industry is dynamic and subject to significant change due to cost-of-care considerations, regulatory reform, industry and customer consolidation, and evolving patient needs. The ability to provide products and technologies that demonstrate value and improve clinical outcomes is becoming increasingly important for medical technology manufacturers.\n    \nWe believe that we are a leading global competitor in each of our product lines. In TAVR, our primary competitors include Medtronic plc (\"Medtronic\"), Abbott Laboratories (\"Abbott\"), and Boston Scientific Corporation. In TMTT, our primary competitor is Abbott, and there are a considerable number of large and small companies with development efforts in these fields. In Surgical, our primary competitors include Medtronic, Abbott, and Artivion, Inc (formerly CryoLife). \nSales and Marketing\nOur portfolio includes some of the most recognizable cardiovascular device product brands in treating structural heart disease today. We have a number of product lines that require sales and marketing strategies that are tailored to deliver high-quality, cost-effective products and technologies to customers worldwide. Because of the diverse global needs of the population that we serve, our distribution system consists of several direct sales forces as well as independent distributors. We are not dependent on any single customer and no single customer accounted for 10% or more of our net sales in 2024.\nTo achieve optimal outcomes for patients, we conduct educational symposia and best practices training for our physician, hospital executive, service line leadership, nursing, and clinical-based customers. We rely extensively on our sales and field clinical specialist personnel who work closely with our customers in hospitals. Field clinical specialists routinely attend procedures where Edwards' products are being used in order to provide guidance on the use of our devices, thereby enabling physicians and staff to reach expert proficiency and deliver positive patient outcomes. In addition to working closely with physicians, nurses, and other clinical personnel, our customers include decision makers such as service line leaders, material managers, biomedical staff, hospital administrators and executives, purchasing managers, and ministries of health. Also, for certain of our product lines and where appropriate, our corporate sales team actively pursues approval of Edwards Lifesciences as a qualified supplier for hospital group purchasing organizations (\"GPOs\") that negotiate contracts with suppliers of medical products. Additionally, we have contracts with a number of United States and European national and regional buying groups, including healthcare systems and Integrated Delivery Networks. Where we choose to market our products is also influenced by the existence of, or potential for, adequate reimbursement to hospitals and other providers by national healthcare systems. \nUnited States.\n In the United States, we sell substantially all of our products through our direct sales forces. In 2024, 59% of our net sales were derived from sales to customers in the United States.\nOutside of the United States.\n In 2024, 41% of our net sales were derived outside of the United States through our direct sales forces and independent distributors. Of the total sales outside of the United States, 59% were in Europe, 15% were in Japan, and 26% were in Rest of World. We sell our products in approximately 100 countries, including Germany, Japan, France, United Kingdom, Italy, Canada, and China. A majority of the sales and marketing approach outside of the United States is direct sales, although it varies depending on each country's size and state of development.\nRaw Materials and Manufacturing\nWe operate manufacturing facilities in various geographies around the world. We manufacture our TAVR, TMTT, and Surgical products primarily in the United States, Singapore, Costa Rica, and Ireland. \nWe use a diverse and broad range of raw and organic materials in the design, development, and manufacture of our products. We manufacture our non-implantable products from fabricated raw materials including resins, chemicals, electronics, and metals. Most of our replacement heart valves are manufactured from natural tissues harvested from animal tissue as well as fabricated materials. We purchase certain materials and components used in manufacturing our products from external suppliers. In addition, we purchase certain supplies from single sources for reasons of sole source availability or constraints resulting from regulatory requirements.\nWe work with our suppliers to mitigate risk and seek continuity of supply while maintaining quality and reliability. Alternative supplier options are generally considered, identified, and approved for materials deemed critical to our products, although we do not typically pursue immediate regulatory qualification of alternative sources due to the strength of our existing supplier relationships and the time and expense associated with the regulatory validation process.\nWe comply with all current global guidelines regarding risks for products incorporating animal tissue intended to be implanted in humans. We follow rigorous sourcing and manufacturing procedures intended to safeguard humans from potential \n4\nTable of Contents\nrisks associated with diseases such as bovine spongiform encephalopathy (\"BSE\"). We obtain bovine tissue used in our pericardial tissue valve products only from sources within the United States and Australia, where strong control measures and surveillance programs exist. In addition, bovine tissue used in our pericardial tissue valve products is from tissue types considered by global health and regulatory organizations to have shown no risk of infectibility. Our manufacturing and sterilization processes are designed to render tissue biologically safe from all known infectious agents and viruses.\nQuality Assurance\nWe are committed to providing quality products to patients and have implemented modern quality systems and concepts throughout the organization. The quality system starts with the initial design concept, risk management, and product specification, and continues through the design of the product, packaging and labeling, and the manufacturing, sales, support, and servicing of the product. The quality system is intended to design quality into the products and uses continuous improvement concepts, including Lean/Six Sigma principles, throughout the product lifecycle.\nOur operations are frequently inspected by the many regulators that oversee medical device manufacturing, including the United States Food and Drug Administration (\"FDA\"), European Notified Bodies, and other regulatory entities. The medical technology industry is highly regulated and our facilities and operations are designed to comply with all applicable quality systems standards, including the International Organization for Standardization (\"ISO\") 13485:2016. These standards require, among other items, quality system controls that are applied to product design, component material, suppliers, and manufacturing operations. These regulatory approvals and ISO certifications can be obtained only after a successful audit of a company's quality system has been conducted by regulatory or independent outside auditors. Periodic reexamination by an independent outside auditor is required to maintain these certifications.\nEnvironmental, Health, and Safety\nWe are committed to providing a safe and healthy workplace and complying with all relevant regulations and medical technology industry standards. Through our corporate and site level Environmental, Health, and Safety functions, we establish and monitor programs to reduce pollution, prevent injuries, and maintain compliance with applicable regulations. In order to measure performance, we monitor and report on a number of metrics, including regulated and non-regulated waste disposal, energy usage, water consumption, air emissions, and injuries from our production activities. Each of our manufacturing sites is evaluated regularly with respect to a broad range of Environmental, Health, and Safety criteria.\nResearch and Development\nIn 2024, we made significant investments in research and development, both internally and through acquisitions, as we worked to develop therapies that we believe have the potential to change the practice of medicine. Research and development spending increased 9% year over year, representing 19% of 2024 sales. This increase was primarily the result of significant investments in our transcatheter structural heart programs, including an increase in clinical research for our mitral, aortic, and tricuspid therapies. We are engaged in ongoing research and development to deliver clinically advanced new products, to enhance the effectiveness, ease of use, safety, and reliability of our current leading products, and to expand the applications of our products as appropriate. We focus on opportunities within specific areas of structural heart disease.\nA considerable portion of our research and development investment includes clinical trials and the collection of evidence that provide data for use in regulatory submissions, and required post-market approval studies involving applications of our products. Our investment in clinical studies also includes outcomes and cost-effectiveness data for payers, clinicians, and healthcare systems.\nIn TAVR, we are developing new products to further improve and streamline transcatheter aortic heart valve replacement procedures. \nIn TMTT, we are making significant investments in innovation and clinical evidence to develop technologies designed to treat mitral and tricuspid valve diseases.  \nOur Surgical development programs include innovative platforms for patients who are best treated surgically, specifically active patients and patients with more complex combined procedures. \nOur future growth opportunities include offering solutions for treating patients with both valvular and non-valvular structural heart disease, such as heart failure, which is a natural progression of the disease for many patients suffering from aortic stenosis and mitral and tricuspid regurgitation.\n5\nTable of Contents\nOverview\nEdwards Lifesciences Corporation is the leading global structural heart innovation company, driven by a passion to improve patient lives. Through breakthrough technologies, world-class evidence and partnerships with clinicians and healthcare stakeholders, our employees are inspired by our patient-focused culture to deliver life-changing innovations to structural heart patients who need them most.\n \nEdwards Lifesciences has been a leader in our field for over six decades.\n \nSince our founder, Miles Lowell Edwards, first dreamed of using engineering to address diseases of the human heart, we have steadily built a company on the premise of imagining, building, and realizing a better future for patients.\nOur innovative work encompasses both surgical and transcatheter therapies. In addition, our unique portfolio of repair and replacement technologies for both mitral and tricuspid heart valves provides a broad set of treatment options to serve the many diverse and complex patients in need. Edwards remains committed to its strategy of transformative product innovation, robust and expanding clinical evidence to support approvals and adoption, as well as comprehensive support to ensure excellent real-world patient outcomes.    \nCardiovascular disease is the number-one cause of death in the world and is the top disease in terms of health care spending in nearly every country. In the U.S. alone, one cardiovascular patient dies every 33 seconds. Cardiovascular disease is progressive in that it tends to worsen over time and often affects the structure of\n \nan individual's heart. Our vision is to transform patient care where patients are diagnosed earlier, treated in a routine fashion, live longer, and enjoy a better quality of life. Our future growth opportunities include offering solutions for treating patients with both valvular and non-valvular structural heart disease, such as heart failure, which is a natural progression of the disease for many patients suffering from aortic stenosis and mitral and tricuspid regurgitation.\nPatients undergoing treatment for cardiovascular disease can be treated with a number of our medical technologies, which are designed to address individual patient needs with respect to disease process, comorbidities, and health status. For example, an individual with a heart valve disorder may have a faulty valve that is affecting the function of his or her heart or blood flow throughout his or her body. A cardiac surgeon may elect to remove the valve and replace it with one of our bioprosthetic surgical tissue heart valves or surgically re-shape and repair the faulty valve with an Edwards annuloplasty ring. Alternatively, a clinician (typically an interventional cardiologist) may implant an Edwards transcatheter valve or repair system via a catheter-based approach that does not require traditional open-heart surgery and can be done while the heart continues to beat. \nOur research and development activities are conducted primarily in facilities located in the United States and Israel. Our experienced research and development staff are focused on product design and development, quality, clinical research, and regulatory compliance. To pursue primary research efforts, we have developed alliances with several leading research institutions and universities, and also work with leading clinicians around the world in conducting scientific studies on our existing and developing products.\nProprietary Technology\nPatents, trademarks, and other proprietary rights are important to the success of our business. We also rely upon trade secrets, know-how, continuing innovations, licensing opportunities, and non-disclosure agreements to develop and maintain our competitive position.\nWe own or have rights to a substantial number of patents and have patent applications pending both in the United States and in foreign countries. We continue to innovate and file new patent applications to protect our new products and technologies.\nAdditionally, we are a party to license agreements and other arrangements with various third parties pursuant to which we have obtained, for varying terms, the exclusive or non-exclusive rights to certain patents held by such third parties in consideration for cross-licensing rights and/or royalty payments. We have also licensed certain patent rights to others.\nWe undertake reasonable measures to protect our intellectual property rights. Litigation has been necessary to enforce certain patent rights held by us, and we plan to continue to defend and prosecute our rights with respect to such patents.\nMoreover, we own certain United States registered trademarks used in our business. Many of our trademarks have also been registered for use in certain foreign countries where registration is available and where we have determined it is commercially advantageous to do so.\n6\nTable of Contents\nGovernment Regulation and Other Matters\nOur products and facilities are subject to regulation by numerous government agencies, including the FDA, European Union (\"EU\") member states competent authorities, and the Japanese Pharmaceuticals and Medical Devices Agency. These entities confirm our compliance with the various laws and regulations governing the development, testing, manufacturing, labeling, marketing, and distribution of our products. \nWe are also governed by federal, state, local, and international laws of general applicability, including, but not limited to, those regulating employee health and safety, labor, competition, governance and securities, privacy, anti-corruption, trade secret, commercial, trade, and the protection of the environment. Overall, the amount and scope of domestic and foreign laws and regulations applicable to our business has increased over time. Compliance with these regulations has not had a material effect on our capital expenditures, earnings, or competitive position to date, but new regulations, amendments to existing regulations, or new interpretations of existing regulations could have such an effect in the future. We cannot estimate the expenses we may incur to comply with potential new laws or changes to existing laws, or the other potential effects these laws may have on our business.\nUnited States Regulation.\n    In the United States, the FDA has responsibility for regulating medical devices. The FDA regulates the design, development, testing, clinical studies, manufacturing, labeling, promotion, and record keeping for medical devices, and reporting of adverse events, recalls, or other field actions by manufacturers and users to identify potential problems with marketed medical devices. Many of our devices that we develop and market are in a category for which the FDA has implemented stringent clinical investigation and pre-market clearance or approval requirements. The process of obtaining FDA clearance or approval to market a product is resource intensive, lengthy, and costly. A number of our products are pending regulatory clearance or approval to begin commercial sales. Ultimately, the FDA may not authorize the commercial release of a medical device if it determines the device is not safe and effective or does not meet other regulatory standards. Additionally, even if a product is cleared or approved, the FDA may impose restrictions or require testing and surveillance programs to monitor the effects of these products once commercialized.\nThe FDA has the authority to halt the distribution of certain medical devices, detain or seize adulterated or misbranded medical devices, order the repair, replacement, or refund of the costs of such devices, or preclude the importation of devices that are or appear to be violative of its regulations. The FDA also conducts inspections to determine compliance with the quality system regulations concerning the manufacturing and design of devices and current medical device reporting regulations, recall regulations, clinical testing regulations, and other requirements. The FDA may withdraw product clearances or approvals due to failure to comply with regulatory standards, or the occurrence of unforeseen problems following initial approval, and require notification of health professionals and others with regard to medical devices that present unreasonable risks of substantial harm to the public health. Additionally, the failure to comply with FDA regulatory standards or the discovery of previously unknown product problems could result in fines, delays, suspensions or withdrawals of regulatory clearances or approvals, seizures, injunctions, recalls, refunds, civil money penalties, or criminal prosecution. Our compliance with applicable regulatory requirements is subject to continual review. Moreover, the FDA and several other United States agencies administer controls over the export of medical devices from the United States and the import of medical devices into the United States, which could also subject us to sanctions for noncompliance.\nWe are also subject to additional laws and regulations that govern our business operations, products, and technologies, including:\n•\nfederal, state, and foreign anti-kickback laws and regulations, which generally prohibit payments to anyone, including physicians, as an inducement to purchase or recommend a product;\n•\nthe Stark law, which prohibits physicians from referring Medicare or Medicaid patients to a provider that bills these programs for the provision of certain designated health services if the physician (or a member of the physician's immediate family) has a financial relationship with that provider;\n•\nfederal and state laws and regulations that protect the confidentiality of certain patient health information, including patient records, and restrict the use and disclosure of such information, in particular, the Health Insurance Portability and Accountability Act of 1996;\n•\nthe Physician Payments Sunshine Act, which requires public disclosure of the financial relationships of United States physicians and teaching hospitals with applicable manufacturers, including medical device, pharmaceutical, and biologics companies;\n7\nTable of Contents\n•\nthe False Claims Act, which prohibits the submission of false or otherwise improper claims for payment to a federally funded health care program, and health care fraud statutes that prohibit false statements and improper claims to any third-party payor; and\n•\nthe United States Foreign Corrupt Practices Act, which can be used to prosecute United States companies for arrangements with foreign government officials or other parties, or for not keeping accurate financial records or maintaining adequate internal controls to prevent and detect arrangements with foreign government officials or other parties. \nFailure to comply with these laws and regulations could result in criminal liability, significant fines or penalties, negative publicity, and substantial costs and expenses associated with investigation and enforcement activities. To assist in our compliance efforts, we work to adhere to our many codes of ethics and conduct regarding our business activities in the United States and other countries in which we operate. In addition, we have in place a dedicated team to improve our internal business compliance programs and policies.\nRegulation Outside of the United States.\n    Outside of the United States, the regulation of medical devices is also complex. In Europe, our products are subject to extensive regulatory requirements. The regulatory regime in the EU for medical devices became mandatory in June 1998. It requires that medical devices may only be placed on the market if they do not compromise safety and health when properly installed, maintained, and used in accordance with their intended purpose. National laws conforming to the EU's legislation regulate our products under the medical devices regulatory system. Although the more variable national requirements under which medical devices were formerly regulated have been substantially replaced by the European Union Medical Devices Directive, individual nations can still impose unique requirements that may require supplemental submissions. The EU medical device laws require manufacturers to declare that their products conform to the essential regulatory requirements after which the products may be placed on the market bearing the CE Mark. Manufacturers' quality systems for products in all but the lowest risk classification are also subject to certification and audit by an independent notified body. In Europe, particular emphasis is being placed on more sophisticated and faster procedures for the reporting of adverse events to the competent authorities.\nIn May 2017, the EU implemented a new regulatory scheme for medical devices under the Medical Device Regulation (\"MDR\"). The MDR became effective on May 26, 2021, and brought significant new requirements for many medical devices, including enhanced requirements for clinical evidence and documentation, increased focus on device identification and traceability, new definitions and registration of economic operators throughout the distribution chain, and additional post-market surveillance and vigilance. Compliance with the MDR requires re-certification of many of our products to the enhanced standards, and has resulted in and will continue to result in substantial additional expense. In addition, in the European Economic Area, we import some of our devices to supply product to Switzerland. Switzerland is not a member state of the EU, but is linked to the EU through bilateral treaties; therefore, the free movement of goods, including medical devices, between the EU and Switzerland after implementation of the MDR required a revised Mutual Recognition Agreement (\"MRA\") that had not been agreed to until recently and which requires additional regulatory steps on registration and labeling.  \nIn Japan, pre-market approval and clinical studies are required as is governmental pricing approval for medical devices. Clinical studies are subject to a stringent Japanese \"Good Clinical Practices\" standard. Approval time frames from the Japanese Ministry of Health, Labour and Welfare vary from simple notifications to review periods of one or more years, depending on the complexity and risk level of the device. In addition, importation of medical devices into Japan is subject to the \"Good Import Practices\" regulations. As with any highly regulated market, significant changes in the regulatory environment could adversely affect future sales.\nIn many of the other foreign countries in which we market our products, we may be subject to regulations affecting, among other things:\n•\nproduct standards and specifications;\n•\npackaging requirements;\n•\nlabeling requirements;\n•\nproduct collection and disposal requirements;\n•\nquality system requirements;\n8\nTable of Contents\n•\nimport restrictions;\n•\ntariffs;\n•\nduties; and\n•\ntax requirements.\nMany of the regulations applicable to our devices and products in these countries are similar to those of the FDA. In some regions, the level of government regulation of medical devices is increasing, which can lengthen time to market and increase registration and approval costs. In many countries, the national health or social security organizations require our products to be qualified before they can be marketed and considered eligible for reimbursement.\nHealth Care Initiatives.\n    Government and private sector initiatives to limit the growth of health care costs, including price regulation and competitive pricing, coverage and payment policies, comparative effectiveness reviews, technology assessments, increasing evidentiary demands, and managed-care arrangements, are continuing in many countries where we do business, including the United States, Europe, and Japan. As a result of these changes, the marketplace has placed increased emphasis on the delivery of more cost-effective medical therapies. For example, government programs, private health care insurance, and managed-care plans have attempted to control costs by restricting coverage and limiting the level of reimbursement for procedures or treatments, and some third-party payors require their pre-approval before covering payment of new or innovative devices or therapies that are used by patients. These various initiatives have created increased price sensitivity over medical products generally and may impact demand for our products and technologies.\nThe delivery of our products is subject to regulation by the United States Department of Health and Human Services (\"HHS\") and comparable state and foreign agencies responsible for reimbursement and regulation of health care items and services. Foreign governments also impose regulations in connection with their health care reimbursement programs and the delivery of health care items and services. Reimbursement schedules regulate the amount the United States government will reimburse hospitals and doctors for the inpatient care of persons covered by Medicare. HHS' Centers for Medicare & Medicaid Services (\"CMS\") may also review whether and/or under what circumstances a procedure or technology is reimbursable for Medicare beneficiaries. Changes in current coverage and reimbursement levels could have an adverse effect on market demand and our pricing flexibility.  \nHealth care cost containment efforts have also prompted domestic hospitals and other customers of medical device manufacturers to consolidate into larger purchasing groups to enhance purchasing power. The medical technology industry has also experienced some consolidation, partly in order to offer a broader range of products to large purchasers. As a result, transactions with customers are larger, more complex, and tend to involve more long-term contracts than in the past. These larger customers, due to their enhanced purchasing power, may have a material impact on product pricing.\nThese laws or any future legislation, including deficit reduction legislation, could impact medical procedure volumes, reimbursement for our products, and demand for our products or the prices at which we sell our products.\nSeasonality\nOur quarterly sales are influenced by many factors, including new product introductions, acquisitions, regulatory approvals, patient and physician holiday schedules, and other factors. Sales in the third quarter are typically lower than other quarters of the year due to the seasonality of the United States and European markets, where summer vacation schedules normally result in fewer medical procedures.\nHuman Capital Management Strategy\nHuman Capital Management (\"HCM\") Governance\nThe primary goals of our talent management strategy are to attract, develop and retain a motivated, professional workforce and to strive for alignment on our patient-focused innovation strategy.\nOur Board of Directors routinely engages with leadership to review and discuss our human capital management (\"HCM\"), with time dedicated at each regularly scheduled meeting to discuss talent management, which includes topics such as talent strategy, succession planning, employee development, critical role talent acquisition, employee health, safety, and welfare, results of employee surveys, and compensation. Our Board of Directors also annually approves the strategic talent imperatives \n9\nTable of Contents\nthat are tied to our Key Operating Drivers (\"KODs\"). Our KODs are tracked using a point system across our entire organization that focus the Company and management toward short-, medium-, and long-term goals. The strategic talent imperatives are developed to identify talent related initiatives that support achievement of the KODs.  \nIn addition, the Chief Executive Officer (\"CEO\") and his leadership team have talent management related performance goals tied to their compensation; these Performance Management Objectives are reviewed on an annual basis, tracked, and then reported to and evaluated by our Board of Directors.\nAs we scale to reach more patients around the world, we have integrated our Talent & Organization (“T&O”) Strategy with our Edwards Strategic Planning process. The purpose of our T&O Strategy is to anticipate global trends related to our workforce, develop our talent to meet future organizational needs, and enable us to be well-poised to meet these needs. Our T&O Strategy enables us to explore external workforce signals, share insights, and identify and build emerging capabilities across our organization. We have also developed a comprehensive succession planning process that allows us to build strong talent from within while we pursue an aggressive recruiting process to fill any gaps with highly qualified external talent. This consistent and scalable approach looks across all our product groups, regions, and significant functions to align and elevate priorities, critical capabilities, and organizational evolutions in line with our strategic plan. This integrated approach informs our yearly objectives and fuels our talent roadmap across the strategic horizon.\nOur HCM governance includes a global talent development review (\"TDR\") process to align our talent strategies with our business strategy, assess talent against future organizational needs, evaluate critical talent populations, and enhance the strength of our succession planning. We track our performance regularly.\nCulture\nInvesting in our workforce means our employees can stay focused on our patient-focused innovation strategy and the development of life-saving therapies for the patients we serve. We are committed to maintaining an ethical culture where we celebrate diversity, promote good health and safety, empower employees to speak up, and ensure that employees' voices are heard. We strive to offer competitive employee well-being packages and are committed to fair and equitable pay practices. We track compensation patterns in all geographies where we operate, and we regularly look for ways to ensure fair and equitable pay.\nWe are proud of our patient-focused culture, and the way we work together globally to bring life-saving innovations to patients in need. We recognize the need for diverse perspectives and experiences, and we foster inclusion, belonging, and collaboration across Edwards. We are committed to fostering an environment where all employees can grow and thrive, understanding that diverse perspectives enable our commitment to innovation. We believe this commitment can be best achieved by always selecting the best candidate and building a culture that celebrates excellence. We aim to deliver this by centering our decisions on the following focus areas whose overriding priority is \"The Patient\" - Business, People, Communication, and Community. As a practice, all employees receive global business practice standards and unconscious bias training as a foundational aspect of our culture, and we include a non-discrimination clause in our Global Business Practice Standards and Third Party Code of Conduct.\nEmployee Listening\nWe believe in empowering our employees and providing avenues that enable their voices to be heard. We conduct a multilingual global employee survey, called \nmy\nVoice, to gain employees' feedback in a confidential manner. The CEO and Executive Leadership Team hold themselves accountable to consider and act on the results of the survey, and these results are reviewed by management with our Board of Directors. This initiative helps us gain insights on various topics including patient focus, diversity, inclusion and belonging, quality, innovation, engagement, as well as a sense of support at all levels of the organization. Speak-Up is a resource available to all employees to bring forth compliance-related concerns; a key element of our compliance program is that each employee is accountable for maintaining ethical business practices. In addition, during each quarterly global employee meeting, our CEO answers questions that have been submitted to him by employees. Answers to questions that are not covered in the townhall meeting are posted online internally.  \n10\nTable of Contents\nTotal Benefits and Well-being\nWe understand that good health leads to better performance. We offer competitive employee benefits and well-being packages that include, among other things, health and wellness insurance, health savings accounts, family support services, and a variety of site-specific programs. We regularly evaluate our benefits package to make modifications that are aligned with the competitive landscape, legislative changes, and the unique needs of our population. We also provide robust well-being programs that address prevention, nutrition, mental health, physical activity, financial fitness, and community service. As part of our regular evaluation and commitment to putting employees first, we determined our employees could benefit from support in four main areas related to health: Mind+, metabolic, heart, and musculoskeletal health. We offer a variety of programs and education to support employees in these areas. In recent years, mental well-being has become a central topic for organizations worldwide. Mind+ offers a wide variety of mental well-being programs for our employees. This commitment extends to creating a work environment where employees can feel confident speaking about mental well-being with their managers and know how best to access the tools and resources available to support them. We believe there are strong benefits when employees are feeling their best. Employees who are mentally healthy are more innovative, resilient, better decision-makers, and able to build stronger relationships. We also believe that prioritizing and promoting Mind+ allows us to help patients around the world to live longer, healthier, and more productive lives and supports employees to be their best self at home and at work.\nTalent Development\nDeveloping talent around the globe is critical to achieving our mission at Edwards. We believe in developing talent from within and have a long-term commitment to building the leadership and technical skills for the present and future needs of the business. Edwards provides in-depth learning and development resources for employees at all levels, including blended learning opportunities such as in-person, virtual, and online courses, capability assessments, coaching, and developmental experiences. We are committed to enabling our employees to have long-term careers at Edwards by encouraging each employee to take ownership of their professional development, engage in the significant resources available, and leverage the performance management and feedback process to be on a journey of continuous growth. We also encourage managers to be involved in helping their employees develop enhanced personal, professional, and leadership skills. Our learning and development strategy aims to have a balanced focus on building leadership and technical capabilities, with resources dedicated to building learning and development for global leaders, such as our course on ethical decision making for managers, and developing technical skills and capabilities for unique talent segments. Our learning and development initiatives are designed to support and sustain Edwards’ values and unique culture, inspiring our employees to collaborate, innovate, and grow, ultimately enabling us to better serve our patients.\nHeadcount and Labor Representation\nAs of December 31, 2024, we had approximately 15,800 employees worldwide, the majority of whom were located in the United States, Singapore, and Costa Rica. None of our North American employees are represented by a labor union. In various countries outside of North America, we interact with trade unions and works councils that represent employees.\nAdditional details regarding talent development, compensation, and employee health and safety can be found in our Corporate Impact Report posted on our website at www.edwards.com under \"Investors — Governance & Corporate Impact.\"\nReferences to our website in this Annual Report on Form 10-K are provided for convenience only and the content on our website is not being incorporated by reference herein and does not constitute a part of this Report.\n11\nTable of Contents",
    "item1a": "Item 1A in this report.\n \n21\nTable of Contents\nGovernance\nOur \nBoard of Directors and our Audit Committee\n oversee our enterprise-wide risk management, including with respect to cybersecurity. \nOur Chief Financial Officer presents information on our enterprise-wide risks to the Board of Directors at each of its regularly scheduled meetings.\n Our Senior Vice President (\"SVP\"), Enterprise Risk Management presents to our Board of Directors and our Audit Committee at least once a year on our significant enterprise-wide risks as well as our enterprise-wide risk program. In addition, our Chief Information Security Officer (“CISO”) meets regularly with the Audit Committee on risks related to cybersecurity and information security.\nThe oversight of our cybersecurity program at the management level rests with the Executive Leadership Team (“ELT”) who has designated the CISO to lead and execute on the cybersecurity program. The CISO provides regular updates to the executive leadership team, including the CEO, on our cybersecurity program and cybersecurity risks.\n \nOur cybersecurity leaders have extensive experience in cybersecurity, including in consulting and corporate roles at Forbes 100 companies and experience leading security incident detection and response, security architecture, and strategy programs.\n \nFinally, management has instituted our Information Security Council and Enterprise Risk Management Council both of which are made up of senior leaders of the Company. The Information Security Council is tasked with overseeing information security matters at Edwards, including cybersecurity. This council serves as an escalation point for issues requiring concerted action, and in turn, informs executive management regarding information security and cybersecurity risks and issues. The Enterprise Risk Management Council is tasked with proactive management of our enterprise-wide risks, including information security risks that also include cybersecurity. This council is responsible for assessing and providing input into the enterprise risks that are presented to the Board of Directors.",
    "item1b": "Item 1B.    Unresolved Staff Comments\nNone.",
    "item1c": "Item 1C.    Cybersecurity\nRisk Management and Strategy\nOur Information Security team manages Edwards’ Information Security Program, which is focused on assessing, identifying, and managing cybersecurity risk and information security threats.\n We evaluate cybersecurity risk on an ongoing basis, and it is a risk monitored through our overall enterprise risk management program, including by the executive leadership and the Board of Directors, described below under \nGovernance\n.\n \nTo proactively manage cybersecurity risk in our organization, our management team has instituted an Edwards Information Technology Security Policy that is available to all employees through the employee handbook and on our intranet. We also conduct regular cybersecurity awareness and training campaigns for existing employees. Internal and external stakeholders can access the Edwards Integrity Helpline 24/7 online or by phone, to report any security incidents for escalation. We also disclose information about our product security and provide relevant contact information for our stakeholders to report any product vulnerabilities.   \nTo proactively identify, mitigate, and prepare for potential cybersecurity incidents, we maintain both a business continuity plan and cyber incident response plan with formalized workflows and playbooks. We periodically conduct simulation exercises involving employees at various levels of the organization. We also periodically engage external partners to conduct annual audits of our systems and test our IT infrastructure. Through these channels and others, we work to proactively identify potential vulnerabilities in our information security system. We recognize that we are exposed to cybersecurity threats associated with our use of third-party service providers. To minimize the risk and vulnerabilities to our own systems stemming from such use, our Information Security team identifies and addresses known cybersecurity threats and incidents at \nthird-party service providers\n on a continuous basis. In addition, we strive to minimize cybersecurity risks when we first select or renew a vendor by including cybersecurity risk as part of our overall vendor evaluation and due diligence process.\n \nBased on information known to us, we do not believe any risks from cybersecurity threats, including as a result of previous cybersecurity incidents, have materially affected or are reasonably likely to materially affect us, including our business strategy, results of operations, or financial condition.\n Our risks associated with cybersecurity threats are set forth under \"\nRisk Factors\"\n in Part I,"
  }
}