{
  "ticker": "EXC",
  "cik": "0001109357",
  "company_name": "EXELON CORP",
  "filing_date": "2025-02-12",
  "accession": "0001109357-25-000043",
  "primary_doc": "exc-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1.\n \nGeneral\nCorporate Structure and Business and Other Information\nExelon is a utility services holding company engaged in the energy transmission and distribution businesses through its subsidiaries, ComEd, PECO, BGE, Pepco, DPL, and ACE. \nName of Registrant\n  \nBusiness\n  \nService Territories\nCommonwealth Edison Company\nPurchase and regulated retail sale of electricity\nNorthern Illinois, including the City of Chicago\nTransmission and distribution of electricity to retail customers\nPECO Energy Company\nPurchase and regulated retail sale of electricity and natural gas\nSoutheastern Pennsylvania, including the City of Philadelphia (electricity)\nTransmission and distribution of electricity and distribution of natural gas to retail customers\nPennsylvania counties surrounding the City of Philadelphia (natural gas)\nBaltimore Gas and Electric Company\nPurchase and regulated retail sale of electricity and natural gas\nCentral Maryland, including the City of Baltimore (electricity and natural gas)\nTransmission and distribution of electricity and distribution of natural gas to retail customers\nPepco Holdings LLC\nUtility services holding company engaged, through its reportable segments: Pepco, DPL, and ACE\nService Territories of Pepco, DPL, and ACE\nPotomac Electric Power Company\n  \nPurchase and regulated retail sale of electricity\n  \nDistrict of Columbia and Major portions of Montgomery and Prince George’s Counties, Maryland\nTransmission and distribution of electricity to retail customers\nDelmarva Power & Light Company\nPurchase and regulated retail sale of electricity and natural gas\nPortions of Delaware and Maryland (electricity)\nTransmission and distribution of electricity and distribution of natural gas to retail customers\nPortions of New Castle County, Delaware (natural gas)\nAtlantic City Electric Company\nPurchase and regulated retail sale of electricity\nPortions of Southern New Jersey\nTransmission and distribution of electricity to retail customers\nOn February 21, 2021, Exelon’s Board of Directors approved a plan to separate the Utility Registrants and Generation. The separation was completed on February 1, 2022, creating two publicly traded companies, Exelon and Constellation. See Note 2 – Discontinued Operations of the Combined Notes to Consolidated Financial Statements for additional information. \nBusiness Services\nThrough its business services subsidiary, BSC, Exelon provides its subsidiaries with a variety of support services at cost, including legal, human resources, finance, information technology, and supply management services. PHI also has a business services subsidiary, PHISCO, which provides a variety of support services at cost, including legal, finance, engineering, customer operations, transmission and distribution planning, asset management, system operations, and power procurement, to PHI operating Registrants. The costs of BSC and PHISCO are directly charged or allocated to the applicable subsidiaries. The results of Exelon’s corporate operations are presented as “Other” within the consolidated financial statements and include intercompany eliminations unless otherwise disclosed.\n7\nTable of Contents\nUtility Registrants\nUtility Operations\nService Territories and Franchise Agreements\nThe following table presents the size of service territories, populations of each service territory, and the number of customers within each service territory for the Utility Registrants as of December 31, 2024:\nComEd\nPECO\nBGE\nPepco\nDPL\nACE\nService Territories (in square miles)\nElectric\n11,450 \n1,900 \n2,300 \n650 \n5,400 \n2,700 \nNatural Gas\nN/A\n1,900 \n3,050 \nN/A\n250 \nN/A\nTotal\n(a)\n11,450 \n2,100 \n3,250 \n650 \n5,400 \n2,700 \nService Territory Population (in millions)\nElectric\n9.1 \n4.2 \n3.0 \n2.4 \n1.5 \n1.2 \nNatural Gas\nN/A\n2.6 \n2.9 \nN/A\n0.6 \nN/A\nTotal\n(b)\n9.1 \n4.2 \n3.2 \n2.4 \n1.5 \n1.2 \nMain City\nChicago\nPhiladelphia\nBaltimore\nDistrict of Columbia\nWilmington\nAtlantic City\nMain City Population\n2.6 \n1.6 \n0.6 \n0.7 \n0.1 \n0.1 \nNumber of Customers (in millions)\nElectric\n4.1 \n1.7 \n1.3 \n1.0 \n0.6 \n0.6 \nNatural Gas\nN/A\n0.6 \n0.7 \nN/A\n0.1 \nN/A\nTotal\n(c)\n4.1 \n1.7 \n1.3 \n1.0 \n0.6 \n0.6 \n___________\n(a)\nThe number of total service territory square miles counts once only a square mile that includes both electric and natural gas services, and thus does not represent the combined total square mileage of electric and natural gas service territories.\n(b)\nThe total service territory population counts once only an individual who lives in a region that includes both electric and natural gas services, and thus does not represent the combined total population of electric and natural gas service territories. \n(c)\nThe number of total customers counts once only a customer who is both an electric and a natural gas customer, and thus does not represent the combined total of electric customers and natural gas customers.\nThe Utility Registrants have the necessary authorizations to perform their current business of providing regulated electric and natural gas distribution services in the various municipalities and territories in which they now supply such services. These authorizations include charters, franchises, permits, and certificates of public convenience issued by local and state governments and state utility commissions. ComEd's, BGE's (gas), Pepco DC's, and ACE's rights are generally non-exclusive while PECO's, BGE's (electric), Pepco MD's, and DPL's rights are generally exclusive. Certain authorizations are perpetual while others have varying expiration dates. The Utility Registrants anticipate working with the appropriate governmental bodies to extend or replace the authorizations prior to their expirations. The current ComEd Franchise Agreement with the City of Chicago (the City) has been in force since 1992. The Franchise Agreement became terminable on one year notice as of December 31, 2020.  It now continues in effect indefinitely unless and until either party issues a notice of termination, effective one year later, or it is replaced by mutual agreement with a new franchise agreement between ComEd and the City. If either party terminates and no new agreement is reached between the parties, the parties could continue with ComEd providing electric services within the City with no franchise agreement in place. The City also has an option to terminate and purchase the ComEd system (“municipalize”), which also requires one year notice. Neither party has issued a notice of termination at this time, the City has not exercised its municipalization option, and no new agreement has become effective. ComEd is in the process of pursuing a new agreement with the City.\n8\nTable of Contents\nWhile Exelon and ComEd cannot predict the ultimate outcome, fundamental changes in the agreement or other adverse actions affecting ComEd’s business in the City would require changes in their business planning models and operations and could have a material adverse impact on Exelon’s and ComEd’s consolidated financial statements. If the City were to disconnect from the ComEd system, ComEd would seek full compensation for the business and its associated property taken by the City, as well as for all damages resulting to ComEd and its system. ComEd would also seek appropriate compensation for stranded costs with FERC.\nUtility Regulations\nState utility commissions regulate the Utility Registrants' electric and gas distribution rates and service, issuances of certain securities, and certain other aspects of the business. The following table outlines the state commissions responsible for utility oversight:\nRegistrant\nCommission\nComEd\nICC\nPECO\nPAPUC\nBGE\nMDPSC\nPepco\nDCPSC/MDPSC\nDPL\nDEPSC/MDPSC\nACE\nNJBPU\nThe Utility Registrants are public utilities under the Federal Power Act subject to regulation by FERC related to transmission rates and certain other aspects of the utilities' business. The U.S. Department of Transportation also regulates pipeline safety and other areas of gas operations for PECO, BGE, and DPL. The U.S. Department of Homeland Security (Transportation Security Administration) provided new security directives in 2021 that regulate cyber risks for certain gas distribution operators. Additionally, the Utility Registrants are subject to NERC mandatory reliability standards, which protect the nation's bulk power system against potential disruptions from cyber and physical security breaches.\nSeasonality Impacts on Delivery Volumes\nThe Utility Registrants' electric distribution volumes are generally higher during the summer and winter months when temperature extremes create demand for either summer cooling or winter heating. For PECO, BGE, and DPL, natural gas distribution volumes are generally higher during the winter months when cold temperatures create demand for winter heating. \nComEd, BGE, Pepco, DPL Maryland, and ACE have electric distribution decoupling mechanisms and BGE has a natural gas decoupling mechanism that eliminate the favorable and unfavorable impacts of weather and customer usage patterns on electric distribution and natural gas delivery volumes. As a result, ComEd's, BGE's, Pepco's, DPL Maryland's, and ACE's electric distribution revenues and BGE's natural gas distribution revenues are not intended to be impacted by delivery volumes. PECO's and DPL Delaware's electric distribution revenues and natural gas distribution revenues are impacted by delivery volumes.\nElectric and Natural Gas Distribution Services\nThe Utility Registrants are allowed to recover reasonable costs and fair and prudent capital expenditures associated with electric and natural gas distribution services and earn a return on those capital expenditures, subject to commission approval. Beginning in 2024 through 2027, ComEd's electric distribution costs are recovered through a multi-year rate plan with case proceedings as filed with the ICC. PECO's and DPL's electric and gas distribution costs and ACE’s electric distribution costs have generally been recovered through base rate case proceedings, with PECO utilizing a fully projected future test year, DPL Delaware's electric and gas distribution services utilizing either a partial actual and partial forecast test year or a fully historical test year, and ACE utilizing a fully historical test year. BGE’s electric and gas distribution costs and Pepco’s and DPL Maryland's electric distribution costs are currently recovered through multi-year rate case proceedings, as the MDPSC and the DCPSC allow utilities to file multi-year rate plans. In certain instances, the Utility Registrants use specific recovery mechanisms as approved by their respective regulatory agencies. See Note 3 — Regulatory Matters of the Combined Notes to Consolidated Financial Statements for additional information. \n9\nTable of Contents\nComEd, Pepco, DPL and ACE customers have the choice to purchase electricity, and PECO and BGE customers have the choice to purchase electricity and natural gas from competitive electric generation and natural gas suppliers. DPL customers, with the exception of certain commercial and industrial customers, do not have the choice to purchase natural gas from competitive natural gas suppliers. The Utility Registrants remain the distribution service providers for all customers and are obligated to deliver electricity and natural gas to customers in their respective service territories while charging a regulated rate for distribution service. In addition, the Utility Registrants also retain significant default service obligations to provide electricity to certain groups of customers in their respective service areas who do not choose a competitive electric generation supplier. PECO, BGE, and DPL also retain significant default service obligations to provide natural gas to certain groups of customers in their respective service areas who do not choose a competitive natural gas supplier. \nFor customers that choose to purchase electric generation or natural gas from competitive suppliers, the Utility Registrants act as the billing agent and therefore do not record Operating revenues or Purchased power and fuel expense related to the electricity and/or natural gas. For customers that choose to purchase electric generation or natural gas from a Utility Registrant, the Utility Registrants are permitted to recover the electricity and natural gas procurement costs from customers without mark-up or with a slight mark-up and therefore record the amounts in Operating revenues and Purchased power and fuel expense. As a result, fluctuations in electricity or natural gas sales and procurement costs have no significant impact on the Utility Registrants’ Net income.\nSee ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS, Results of Operations and Note 3 — Regulatory Matters of the Combined Notes to Consolidated Financial Statements for additional information regarding electric and natural gas distribution services. \nProcurement of Electricity and Natural Gas\nExelon does not generate the electricity it delivers. The Utility Registrants' electric supply for its customers is primarily procured through contracts as directed by their respective state laws and regulatory commission actions. The Utility Registrants procure electricity supply from various approved bidders or from purchases on the PJM operated markets.\nPECO's, BGE’s, and DPL's natural gas supplies are purchased from a number of suppliers for terms that currently do not exceed three years. PECO, BGE, and DPL each have annual firm transportation contracts of 437,000 mmcf, 283,000 mmcf, and 44,000 mmcf, respectively, for delivery of gas. To supplement gas transportation and supply at times of heavy winter demands and in the event of temporary emergencies, PECO, BGE, and DPL have available storage capacity from the following sources:\nPeak Natural Gas Sources (in mmcf)\nLNG Facility\nPropane-Air Plant\nUnderground Storage Service Agreements\n(a)\nPECO\n1,200 \n150 \n19,400 \nBGE\n1,056 \n550 \n22,000 \nDPL\n250 \nN/A\n3,900 \n___________\n(a)\nNatural gas from underground storage represents approximately 27%, 40%, and 33% of PECO's, BGE’s, and DPL's 2024-2025 heating season pipeline capacity, respectively.\nPECO, BGE, and DPL have long-term interstate pipeline contracts and also participate in the interstate markets by releasing pipeline capacity or bundling pipeline capacity with gas for off-system sales. Off-system gas sales are low-margin direct sales of gas to wholesale suppliers of natural gas. Earnings from these activities are shared between the utilities and customers. PECO, BGE, and DPL make these sales as part of a program to balance its supply and cost of natural gas. The off-system gas sales are not material to PECO, BGE, and DPL.\nSee ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK, Commodity Price Risk (All Registrants), for additional information regarding Utility Registrants' contracts to procure electric supply and natural gas.\n10\nTable of Contents\nEnergy Efficiency Programs\nThe Utility Registrants are generally allowed to recover costs associated with energy efficiency and demand response programs they offer. Each commission approved program seeks to meet mandated electric consumption reduction targets and implement demand response measures to reduce peak demand. The programs are designed to meet standards required by each respective regulatory agency.\nComEd, with limited exceptions, earns a return on its energy efficiency costs through a regulatory asset. ACE earns a return on most of its energy efficiency and demand response program costs through a regulatory asset. Historically, BGE, Pepco Maryland, and DPL Maryland deferred most of their energy efficiency program costs to a regulatory asset and either deferred most of their demand response program costs to a regulatory asset or capitalized them. In 2024, BGE, Pepco, and DPL began deferring less energy efficiency and demand response program costs to a regulatory asset. See Note 3 — Regulatory Matters of the Combined Notes to Consolidated Financial Statements for additional information.\nCapital Investment\nThe Utility Registrants' businesses are capital intensive and require significant investments, primarily in electric transmission and distribution and natural gas transportation and distribution facilities, to ensure the adequate capacity, reliability, and efficiency of their systems. See ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS, Liquidity and Capital Resources, for additional information regarding projected 2025 capital expenditures.\nTransmission Services\nThe Utility Registrants, as owners of transmission facilities, are required to provide open access to their transmission facilities at cost-based rates pursuant to tariffs approved by FERC. The Utility Registrants and their affiliates are required to comply with FERC’s Standards of Conduct regulation governing the communication of non-public transmission information between the transmission owner’s employees and wholesale merchant employees.\nPJM is the regional grid operator and operates pursuant to its FERC-approved tariffs. PJM is the transmission provider under, and the administrator of, the PJM Tariff. PJM operates the PJM energy, capacity, and other wholesale markets. PJM controls the day-to-day operations of the bulk power system for the region. The Utility Registrants are members of PJM and provide regional transmission service pursuant to the PJM Tariff. The Utility Registrants and the other transmission owners in PJM have turned over control of certain of their transmission facilities to PJM, and their transmission systems are under the dispatch control of PJM. Under the PJM Tariff, transmission service is provided on a region-wide, open-access basis through the transmission facilities of the PJM transmission owners.\nThe Utility Registrants' transmission rates are based on a FERC approved formula. The rates are updated on an annual basis.\nExelon’s Strategy and Outlook\nExelon is a transmission and distribution company that delivers electricity and natural gas service to our customers and communities. Exelon's businesses remain focused on maintaining industry leading operational excellence, meeting or exceeding their financial commitments, ensuring timely recovery on investments to enable customer benefits, supporting clean energy policies including those that advance our jurisdictions' clean energy targets, and continued commitment to corporate responsibility. \nExelon’s strategy is to improve reliability and operations, enhance the customer experience, and advance clean and affordable energy choices, while ensuring ratemaking mechanisms provide the utilities fair financial returns. The jurisdictions in which Exelon has operations have set some of the nation's leading clean energy targets and our strategy is to enable that future for all our stakeholders. The Utility Registrants invest in rate base that supports service to our customers and the community, including investments that sustain and improve reliability and resiliency and that enhance the service experience of our customers. The Utility Registrants make these investments prudently at a reasonable cost to customers. Exelon seeks to leverage its scale and expertise across the utilities platform through enhanced standardization and sharing of resources and best practices to achieve improved operational and financial results. \n11\nTable of Contents\nManagement continually evaluates growth opportunities aligned with Exelon’s businesses, assets, and markets, leveraging Exelon’s expertise in those areas and offering sustainable returns.\nThe Utility Registrants anticipate investing approximately $38 billion over the next four years in electric and natural gas infrastructure improvements and modernization projects, including smart grid technology, storm hardening, advanced reliability technologies, new business, and transmission projects, which is projected to result in an increase to current rate base of approximately $20 billion by the end of 2028. These investments provide greater reliability, improved service for our customers, increased capacity to accommodate new technologies and support a cleaner grid, and a stable return for the company.\nIn August 2021, Exelon announced its Path to Clean goal to collectively reduce its operations-driven GHG emissions 50% by 2030 against a 2015 baseline and to reach net-zero operations-driven GHG emissions by 2050, while supporting customers and communities in achieving their GHG reduction goals (Path to Clean). Exelon's quantitative goals include its Scope 1 and 2 GHG emissions, with the exception of Scope 2 emissions associated with system losses of electric power delivered to customers (\"line losses\"), and build upon Exelon's long-standing commitment to reducing our GHG emissions. Exelon's Path to Clean efforts extend beyond these quantitative goals to include efforts such as customer energy efficiency programs, which support reductions in customers' direct emissions and have the potential to reduce Exelon's Scope 3 emissions and Scope 2 line losses as well. See ITEM 1. BUSINESS — Environmental Matters and Regulation — Climate Change for additional information.\nVarious regulatory, legislative, operational, market, and financial factors could affect Exelon's success in pursuing its strategies.  Exelon continues to assess infrastructure, operational, policy, and legal solutions to these issues.  See",
    "item1a": "ITEM 1A. of this report.\n33\nTable of Contents",
    "item1b": "ITEM 1B.\nUNRESOLVED STAFF COMMENTS\nAll Registrants\nNone.",
    "item1c": "ITEM 1C.\nCYBERSECURITY\nRisk management and strategy\nCybersecurity risk for all Registrants is managed at the enterprise-level. Management of material risks from cybersecurity threats is integrated into the Registrants' overall risk management processes and is monitored as \n31\nTable of Contents\nan enterprise risk. Exelon's Chief Information Security Officer (CISO) and cybersecurity management team regularly hold meetings with senior management of each Registrant, facilitated by Exelon’s enterprise risk management team, to discuss issues pertaining to cybersecurity risk management, including changes in the nature and origin of threats, threat actor and risk mitigation activities, and regulatory developments. Exelon Legal and compliance professionals engage with the CISO and cybersecurity management team to address tactical and strategic cybersecurity risks. Exelon monitors cybersecurity risks through key risk indicators to identify potential changes in risk exposure and provide the Board of Directors with information about the monitoring of key risks in connection with its oversight of the Registrants' enterprise risk management system.\nThe CISO, through Exelon’s Cyber Information and Security Services (CISS), reviews external and internal sources to obtain cyber threat intelligence to develop strategic and tactical threat assessments that inform the enterprise-wide cyber risk mitigation programs and actions. Exelon uses a wide range of tools, including endpoint, anomaly and network detection, logging and monitoring of security events, network segmentation, firewalls, hardening and securing devices, cyber vulnerability detection and patch management, cyber threat hunting, malware forensic analysis, industry-specific reports, and tabletop exercises to inform the cybersecurity management team. Exelon protects assets critical to grid reliability and national security through the implementation of the North American Electric Reliability Corporation’s Critical Infrastructure Protection requirements, and gas pipeline security under the U.S. Department of Homeland Security’s Transportation Safety Administration’s Security Directives. Exelon maintains security relationships with law enforcement and U.S. intelligence agencies, coordinates with the Electricity Information Sharing and Analysis Center (E-ISAC) and participates in the Department of Energy’s Cybersecurity Risk Information Sharing Program (CRISP) to strengthen the security of the energy grid, share information, design and participate in drills and exercises such as the bi-annual Grid Security Exercises and facilitate cross-sector coordination. Exelon applies stringent employee and contractor screening, and advances security awareness through training and monitoring programs that address both cyber and physical threats. Exelon employees are subject to annual mandatory training addressing security awareness, including cybersecurity and phishing.  Exelon maintains cyber insurance coverage at limits consistent with the utility industry and reviews policy coverage and limits on an annual basis.\nIn assessing the effectiveness of its cybersecurity risk management program, the CISO makes use of external perspectives from regulatory compliance audits and inspections, external audits of the Registrants' financial systems, and third-party incident response and detection analytics. Cybersecurity risks associated with the Registrants’ use of certain third-party service providers are evaluated and managed through CISS' Third Party Security team that leverages security risk assessments, contractual terms and conditions, and security awareness training for such providers. Additionally, those providers are required to report cybersecurity incidents, including the unauthorized use or disclosure of Registrants’ confidential information to Exelon’s security operations center.  Third Party Security investigates certain third-party cybersecurity events as part of Exelon’s incident response program.\nGovernance\nThe Exelon Board of Directors is responsible for oversight of risks from cybersecurity threats. As part of its responsibility and as documented in the Cybersecurity Oversight Policy, the Board of Directors oversees Exelon's cybersecurity program and Exelon’s enterprise-wide risk related to cybersecurity, including management’s identification, assessment, and mitigation of cybersecurity risks. At each regular quarterly meeting, the Board of Directors engages with the CISO and a cross-functional management team regarding the risks from cybersecurity threats. The CISO and professionals from the legal and compliance departments brief the Board of Directors on relevant topics, including information security and operational security, legislative and regulatory developments, and notable external cyber events relevant to Exelon and the industry more broadly. Management engages with the Board of Directors on risks from cybersecurity threats as appropriate outside of the quarterly meetings. \nThe CISO manages Exelon's enterprise-wide cybersecurity programs and reports to Exelon’s Chief Information Officer. The CISO has been responsible for assessing and managing material risks from cybersecurity threats at Exelon since 2018 and was named to the current role in 2022. The CISO has 26 years of information technology and cybersecurity experience in the critical infrastructure sector, of which 24 years have been in the utility industry.  The CISO leads CISS, which manages centralized information technology and operational technology security programs for the Registrants. The programs are aligned to the National Institute of Standards and Technology Cyber Security Framework (NIST CSF) and integrate cyber asset identification; threat assessment; \n32\nTable of Contents\nrisk assessment; risk management; and risk monitoring. CISS operates a security operations center for monitoring, identifying, and mitigating potential cybersecurity events or incidents.\nExelon maintains a single, centralized cybersecurity incident response program and plan that aligns with NIST CSF by integrating the identify, determine/classify, escalate and respond functions (which track the lifecycle of an event or incident). Security threats and incidents are identified and assessed to determine potential impact and escalated to senior cybersecurity management and the CISO. The CISO directs the security incident response team to contain, eradicate, and recover from an active threat. Exelon leverages the expertise of dedicated incident response vendors that can provide timely and specialized support to respond and recover from an event. The CISO and a cross-functional team convene as needed to evaluate cybersecurity events, including third-party events. The legal and compliance departments provide incident response support to the CISO, manage cybersecurity-related legal and compliance issues, and direct materiality evaluations using both qualitative and quantitative factors for each Registrant.\nAlthough the Registrants have not experienced any material cybersecurity events to date, cybersecurity threats could materially affect each Registrant’s business strategy, results of operations, or financial condition, as further discussed in the risk factor entitled “The Registrants are subject to physical and cybersecurity risks\" in"
  }
}