{
  "ticker": "EXE",
  "cik": "0000895126",
  "company_name": "EXPAND ENERGY Corp",
  "filing_date": "2025-02-26",
  "accession": "0000895126-25-000021",
  "primary_doc": "exe-20241231.htm",
  "item_sections": {
    "item1": "Item 1. Business of Part I of this report and in the Supplementary Information included in \nItem 8 of Part II\n of this report. \n51\nTABLE OF CONTENTS\nItem 3.\nLegal Proceedings\nLitigation and Regulatory Proceedings \nWe are involved in various regulatory proceedings, lawsuits and disputes arising in the ordinary course of our business operations, including commercial disputes, personal injury claims, royalty claims, property damage claims and contract actions. We are also party to the consolidated Chapter 11 Cases pending for the Debtors in the Bankruptcy Court. Legal proceedings that were in existence prior to the Petition Date and have not yet been settled as part of the Chapter 11 Cases will be resolved in connection with the claims reconciliation process before the Bankruptcy Court. Any allowed claim related to such prepetition litigation will be treated in accordance with the Plan. Any legal proceeding pending against Southwestern and assumed by us in connection with the Southwestern Merger is not subject to discharge or resolution as part of the Chapter 11 Cases.\nSee \nNote \n5\n of the notes to our consolidated financial statements included in Item 8 of Part II of this report for information regarding our estimation and provision for potential losses related to litigation and regulatory proceedings. Based on management’s current assessment, we are of the opinion that no pending or threatened lawsuit or dispute relating to our business operations is likely to have a material adverse effect on our future consolidated financial position, results of operations or cash flows. The final resolution of such matters could exceed amounts accrued, however, and actual results could differ materially from management’s estimates.\nEnvironmental Contingencies\nThe nature of the natural gas and oil business carries with it certain environmental risks for us and our subsidiaries. We have implemented various policies, programs, procedures, training and audits to reduce and mitigate such environmental risks. We conduct periodic reviews, on a company-wide basis, to assess changes in our environmental risk profile. Environmental reserves are established for environmental liabilities for which economic losses are probable and reasonably estimable. We manage our exposure to environmental liabilities in acquisitions by using an evaluation process that seeks to identify pre-existing contamination or compliance concerns and address the potential liability. Depending on the extent of an identified environmental concern, we may, among other things, exclude a property from the transaction, require the seller to remediate the property to our satisfaction in an acquisition or agree to assume liability for the remediation of the property.\nItem 4.\nMine Safety Disclosures\nNot applicable.\n52\nTABLE OF CONTENTS\nPART II\nItem 5.\nMarket for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nCommon Stock\nSubsequent to the completion of the Southwestern Merger on October 1, 2024, we changed our company name to Expand Energy Corporation and changed the NASDAQ trading symbol for our common stock from “CHK” to “EXE”. Additionally, our Class A Warrants, Class B Warrants and Class C Warrants trading symbols changed from “CHKEW”, “CHKEZ”, and “CHKEL”, respectively, to “EXEEW”, “EXEEZ” and “EXEEL”, respectively, following the completion of the Southwestern Merger. Our common shares and Warrants have been trading under the updated trading symbols on NASDAQ since October 2, 2024. The Warrants are immediately exercisable and will expire on February 9, 2026. More information on our common stock and Warrants can be found in \nNote 1\n0\n of the notes to our consolidated financial statements included in Item 8 of Part II of this report.\nDividends\nIn March 2022, we adopted a variable return program that resulted in the payment of an additional variable dividend equal to the sum of Adjusted Free Cash Flow from the prior quarter less the base quarterly dividend, multiplied by 50%. Effective January 1, 2025, we updated our enhanced returns framework which prioritizes paying a base dividend per share and provides for annual net debt reduction prior to additional shareholder returns such as additional dividend payments or share repurchases. The declaration and payment of any future dividend is subject to the approval of our Board of Directors in its discretion. For additional information on our dividends, see \nNote 1\n0\n of the notes to our consolidated financial statements included in Item 8 of Part II of this report. \nRepurchases of Equity Securities; Unregistered Sales of Equity Securities and Use of Proceeds\nOn October 22, 2024 our Board of Directors authorized repurchases of up to $1.0 billion, in the aggregate, of the Company’s common stock and/or warrants under a share repurchase program. The repurchase authorization permits repurchases on a discretionary basis subject to market conditions, required internal approvals, applicable legal requirements, available liquidity, compliance with the Company’s debt agreements and other appropriate factors. \nWe did not repurchase any shares of our common stock during the quarter ended December 31, 2024. As of December 31, 2024, approximately $1.0 billion may yet be purchased under the share repurchase program described above.\nStockholders\nAs of February 19, 2025, there were approximately 1,226 holders of record of our common stock.\nItem 6.\nReserved\n \n53\nTABLE OF CONTENTS\nItem 7.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nThis Management’s Discussion and Analysis of Financial Condition and Results of Operations is intended to provide a reader of our financial statements with management’s perspective on our financial condition, liquidity, results of operations and certain other factors that may affect our future results. This information is intended to provide investors with an understanding of our past performance, current financial condition and outlook for the future and should be read in conjunction with \nItem 8 of Part II\n of this report.\nIntroduction\nOn October 1, 2024, we completed the Southwestern Merger, creating a premier energy company that we believe is underpinned by a leading natural gas portfolio adjacent to the highest demand markets, premium inventory, a resilient financial foundation and an investment grade balance sheet. We believe that this new company is uniquely positioned to deliver affordable, lower-carbon energy to meet growing domestic and international demand while creating sustainable value for stakeholders. In conjunction with the closing of the Southwestern Merger, Chesapeake Energy Corporation changed its name to Expand Energy Corporation.\nExpand Energy is the largest independent natural gas producer in the U.S., based on net daily production, and is focused on responsibly developing an abundant supply of natural gas, oil and NGL to expand energy access for all. Our operations are located in Louisiana in the Haynesville and Bossier Shales (“Haynesville”), in Pennsylvania in the Marcellus Shale (“Northeast Appalachia”) and in West Virginia and Ohio in the Marcellus and Utica Shales (“Southwest Appalachia”).\nOur strategy is to create shareholder value through the responsible development of our significant resource plays while continuing to be a leading provider of natural gas to markets in need. We continue to focus on improving margins through operating efficiencies and financial discipline and improving our ESG performance. To accomplish these goals, we intend to allocate our human resources and capital expenditures to projects we believe offer the highest cash return on capital invested, to deploy leading drilling and completion technology throughout our portfolio, and to take advantage of acquisition and divestiture opportunities to strengthen our portfolio. We also intend to continue to dedicate capital to projects designed to reduce the environmental impact of our production activities.\n Additionally, we aim to be conscientious in our efforts and how they will shape our approach to sustainability for the future and have established the following goals:\n•\nNet zero (Scope 1 and 2) greenhouse gas emissions by 2035.\n•\nMaintain 100% responsibly sourced gas (RSG) certification across our portfolio.\n54\nTABLE OF CONTENTS\nRecent Developments\nSouthwestern Merger\nOn January 10, 2024, Chesapeake and Southwestern entered into an all-stock agreement and plan of merger (the “Merger Agreement”). Southwestern was an independent energy company engaged in development, exploration and production activities, including related marketing activities, within its operating areas in the Appalachia and Haynesville shale plays. Our Board of Directors and the Board of Directors of Southwestern both approved the Merger Agreement. At separate special meetings each held on June 18, 2024, Chesapeake’s stockholders approved the issuance of Chesapeake’s common stock to the stockholders of Southwestern in connection with the Southwestern Merger, and Southwestern’s stockholders approved the Merger Agreement.\nOn October 1, 2024, the Southwestern Merger was completed, and we issued approximately 95.7 million shares of our common stock to Southwestern’s shareholders in connection with the Merger Agreement. Under the terms of the Merger Agreement, subject to certain exceptions, each share of Southwestern common stock was converted into the right to receive 0.0867 of a share of the Company’s common stock. Based on the closing price of our common stock, the total value of such shares of our common stock issued to Southwestern’s shareholders was approximately $7.9 billion. See \nNote 2\n of the notes to our consolidated financial statements included in Item 8 of Part II of this report for further discussion.\nInvestment Grade Rating\nOn October 1, 2024, we received an investment grade rating from S&P Global Ratings (“S&P”). S&P assigned an issuer-level rating of ‘BBB-’ on our unsecured debt and raised our issuer credit rating to ‘BBB-’, with a stable outlook. Additionally, on October 2, 2024, we received an investment grade rating from Fitch Ratings (“Fitch”). Fitch affirmed our revolver credit rating at ‘BBB-’ and upgraded the rating on our senior notes to ‘BBB-’, with a stable outlook. As a result of these investment grade ratings and the satisfaction of certain other conditions, certain restrictive covenants on our credit facility fell away and became more permissive. The leverage ratio and current ratio financial covenants and PV-9 Coverage Ratio are no longer effective, and the Company is required to maintain compliance with a total indebtedness to capitalization ratio, which is the ratio of the Company’s total indebtedness to the sum of total indebtedness plus stockholders’ equity, not to exceed 65%. See \nNote 4\n of the notes to our consolidated financial statements included in Item 8 of Part II of this report for further discussion.\nIssuance of Senior Notes, Senior Notes Tender Offer and Redemption of Debt\nIn December 2024, we completed our underwritten public offering of $750 million aggregate principal amount of our 5.70% Senior Notes due 2035 (the “2035 Notes”). Additionally, we announced an offer to purchase for cash, any and all of our outstanding 2026 Notes (the “Tender Offer”). Upon expiration of the Tender Offer, approximately 91%, or $453 million, of the 2026 Notes were validly tendered and not validly withdrawn. In a separate transaction during the fourth quarter of 2024, we redeemed all of the $304 million aggregate principal of the SWN 2028 Notes for approximately $312 million, which included an $8 million premium to call the notes. \nAdditionally, on January 23, 2025, the $389 million aggregate principal of the SWN 2025 Notes (as defined below) was repaid and terminated with cash on hand and borrowings on the Credit Facility. See \nNote 4\n of the notes to our consolidated financial statements included in Item 8 of Part II of this report for further discussion.\nRepurchase Program and Enhanced Returns Framework\nIn October 2024, our Board of Directors authorized the Company to repurchase up to $1.0 billion, in aggregate, of the Company’s common stock and/or warrants. Additionally, we also announced our enhanced capital returns framework which is designed to more effectively return cash to shareholders and reduce net debt. The plan became effective January 1, 2025, and prioritizes the base dividend of $2.30 per share and a targeted $500 million of annual net debt reduction in 2025, which target will be redetermined annually. Once both have been funded, it is anticipated that 75% of remaining free cash flow will be distributed as market conditions warrant, between share repurchases and additional dividend payments. The remaining free cash flow would be maintained on the balance sheet.\n55\nTABLE OF CONTENTS\nDivestitures \nOn January 17, 2023, we entered into an agreement to sell a portion of our Eagle Ford assets to WildFire Energy I LLC for approximately $1.425 billion, subject to post-closing adjustments. This transaction closed on March 20, 2023 (with an effective date of October 1, 2022) and resulted in the recognition of a gain of approximately $337 million. \nOn February 17, 2023, we entered into an agreement to sell a portion of our remaining Eagle Ford assets to INEOS Energy for approximately $1.4 billion, subject to post-closing adjustments. This transaction closed on April 28, 2023 (with an effective date of October 1, 2022) and resulted in the recognition of a gain of approximately $470 million. \nOn August 11, 2023, we entered into an agreement to sell the final portion of our remaining Eagle Ford assets to SilverBow Resources, Inc. (“SilverBow”) for approximately $700 million, subject to post-closing adjustments. This transaction closed on November 30, 2023 (with an effective date of February 1, 2023) and resulted in the recognition of a gain of approximately $140 million. Due to the satisfaction of certain commodity price triggers, we received an additional $25 million cash consideration during the fourth quarter of 2024.\nLNG Agreement\nOn February 13, 2024, we announced our entrance into an LNG export deal that includes executed Sales and Purchase Agreements (“SPA”) for long-term liquefaction offtake. Under the SPAs, we will purchase approximately 0.5 million tonnes of LNG per annum from Delfin LNG LLC at a Henry Hub price with a contract targeted start date in 2028, then deliver to Gunvor Group Ltd on a free on board basis with the sales price linked to the Japan Korea Market for a period of 20 years. \nInvestments - Momentum Sustainable Ventures LLC \nDuring the fourth quarter of 2022, we entered into an agreement with Momentum Sustainable Ventures LLC to build a new natural gas gathering pipeline and carbon capture project, which will gather and treat natural gas produced in the Haynesville Shale for re-delivery to Gulf Coast markets, including LNG export. The pipeline is expected to have an initial capacity of 1.7 Bcf/d expandable to 2.2 Bcf/d. The carbon capture portion of the project anticipates capturing approximately 1.0 million tons per annum of CO2 and delivering the CO2 to ExxonMobil Low Carbon Solutions Onshore Storage, LLC for additional transportation and storage. The natural gas gathering pipeline is projected for a potential in-service date in the fourth quarter of 2025. Through the end of 2024, we have made total capital contributions of $296 million to the project.\nEconomic and Market Conditions\nGeopolitical risk and policy uncertainty continue to drive volatility in natural gas, oil and NGL prices, while macroeconomic headwinds in key consuming countries could impact global growth prospects, potentially affecting supply and demand for energy commodities. Domestically, the natural gas market balance has tightened, driven by increasing demand from new LNG export facilities, reduced industry activity levels, and a recent period of colder than average temperatures, providing support for prices in 2025 and 2026. Our future estimated cash flow is partially protected from commodity price volatility due to our current hedge positions that provide a floor price on over half of our projected gas volumes through the end of 2025 with significant upside participation via costless collars. For the foreseeable future, we believe our operational flexibility, cost structure and liquidity position will enable us to successfully navigate continued price volatility.\nRig count reductions across the lower 48 states of the United States led to service cost deflation in 2024 resulting in decreased operating and capital cost. Higher commodity prices in 2025 could lead to increased rig activity across the industry resulting in modest levels of inflation. We continue to monitor these situations, including the recently enacted tariff on steel by the current Presidential Administration, and assess their impact on our business, including business partners and customers. As a result of the Southwestern Merger, we assumed Southwestern’s oilfield service business that will allow for some vertical integration of our exploration and production operations, which may help to control costs and secure inputs for our operations. For additional discussion regarding risk associated with price volatility and economic uncertainty, see",
    "item1a": "Item 1A Risk Factors in this report.\n56\nTABLE OF CONTENTS\nLiquidity and Capital Resources\nLiquidity Overview\nOur primary sources of capital resources and liquidity are internally generated cash flows from operations and borrowings under our Credit Facility, and our primary uses of cash are for the development of our natural gas and oil properties, acquisitions of additional natural gas and oil properties and return of value to stockholders through dividends and equity repurchases. We believe our cash flow from operations, including from the acquired Southwestern business, cash on hand and unused borrowing capacity under the Credit Facility, as discussed below, will provide sufficient liquidity during the next 12 months and the foreseeable future. As of December 31, 2024, we had $2.8 billion of liquidity available, including $317 million of cash on hand and $2.5 billion of aggregate unused borrowing capacity available under the Credit Facility. As of December 31, 2024, we had no outstanding borrowings under our Credit Facility. \nFurther, we may from time to time seek to retire, refinance or amend some or all of our outstanding debt or debt agreements through exchanges, open market purchases, privately negotiated transactions, tender offers or otherwise. Such transactions, if any, and the terms thereof, will depend on prevailing market conditions, our liquidity requirements, contractual restrictions and other factors. The amounts involved in such financing transactions may be material. See \nNote \n4\n of the notes to our consolidated financial statements included in Item 8 of Part II of this report for further discussion of our debt obligations, including principal and carrying amounts of our senior notes. \nDividends\nOn February 26, 2025, we declared a base quarterly dividend payable of $0.575 per share, which will be paid on March 27, 2025 to stockholders of record at the close of business on March 11, 2025. See \nNote 1\n0\n of the notes to our consolidated financial statements included in Item 8 of Part II of this report for further discussion.\nThe declaration and payment of any future dividend, whether fixed or variable, will remain at the full discretion of the Board and will depend on the Company’s financial results, cash requirements, future prospects and other relevant factors. The Company’s ability to pay dividends to its stockholders is restricted by (i) Oklahoma corporate law, (ii) its Certificate of Incorporation, (iii) the terms and provisions of the Credit Agreement governing the Credit Facility and (iv) the terms and provisions of the indentures governing its 5.500% Senior Notes due 2026, 5.875% Senior Notes due 2029, 6.750% Senior Notes due 2029, and 5.70% Senior Notes due 2035 as well as the senior notes assumed from Southwestern, including the 5.375% Senior Notes due 2029, 5.375% Senior Notes due 2030 and 4.750% Senior Notes due 2032.\nDerivative and Hedging Activities\nOur results of operations and cash flows are impacted by changes in market prices for natural gas, oil and NGL. We enter into various derivative instruments to mitigate a portion of our exposure to commodity price declines, but these transactions may also limit our cash flows in periods of rising commodity prices. Our natural gas, oil and NGL derivative activities, when combined with our sales of natural gas, oil and NGL, allow us to better predict the total revenue we expect to receive. See \nItem 7A\n Quantitative and Qualitative Disclosures About Market Risk included in Part II of this report for further discussion on the impact of commodity price risk on our financial position. \n57\nTABLE OF CONTENTS\nContractual Obligations and Off-Balance Sheet Arrangements\nAs of December 31, 2024, our material contractual obligations include repayment of senior notes, derivative obligations, asset retirement obligations, lease obligations, undrawn letters of credit and various other commitments we enter into in the ordinary course of business that could result in future cash obligations. In addition, we have contractual commitments with midstream companies and pipeline carriers for future gathering, processing and transportation of natural gas to move certain of our production to market. The estimated gross undiscounted future commitments under these agreements were approximately $9.9 billion as of December 31, 2024. As discussed above, we believe our existing sources of liquidity will be sufficient to fund our near and long-term contractual obligations. See \nNotes \n4\n, \n5\n, \n7\n, \n13\n and \n16\n of the notes to our consolidated financial statements included in Item 8 of Part II of this report for further discussion. \nCredit Facility\nOn December 9, 2022, we entered into the Credit Agreement, as amended by the Initial Credit Agreement Amendment and the Investment Grade Credit Agreement Amendment, maturing in December 2027. The Credit Facility provides for aggregate commitments of $2.5 billion, with a $500 million sublimit available for the issuance of letters of credit and a $50 million sublimit available for swingline loans. As of December 31, 2024, we had approximately $2.5 billion available for borrowings under the Credit Facility.\nBorrowings under the Credit Agreement may be alternate base rate loans or term SOFR loans, at the Company’s election. On October 1, 2024, we received an investment grade rating from S&P Global Ratings (“S&P”). S&P assigned an issuer-level rating of ‘BBB-’ on our unsecured debt and raised our issuer credit rating to ‘BBB-’, with a stable outlook. Additionally, on October 2, 2024, we received an investment grade rating from Fitch Ratings (“Fitch”). Fitch affirmed our revolver credit rating at ‘BBB-’ and upgraded the rating on our senior notes to ‘BBB-’, with a stable outlook. As a result of these investment grade ratings and the satisfaction of certain other conditions, (i) the Pre-IG Credit Agreement was automatically amended by the Investment Grade Credit Agreement Amendment, (ii) all liens and guarantees previously provided by the Company and its subsidiaries in connection with the Pre-IG Credit Agreement were released and (iii) all guarantees previously provided in connection with the Company’s senior notes were released. Such Investment Grade Credit Agreement Amendment, among other things, removed the application of the borrowing base provided for in the Pre-IG Credit Agreement and modified the pricing and covenants as discussed in \nNote \n4\n of the notes to our consolidated financial statements included in Item 8 of Part II of this report for further discussion.\nAssumption of Southwestern’s Senior Notes and Southwestern Credit Facility Extinguishment\nOn October 1, 2024, the Southwestern Merger was completed, and we assumed approximately $3.7 billion of Southwestern’s senior notes. On October 1, 2024, Southwestern’s existing credit facility was terminated, with all loan amounts and other obligations outstanding thereunder repaid in full and all commitments thereunder extinguished, for approximately $585 million, which included all outstanding borrowings, accrued interest and transaction fees. See \nNote 4\n of the notes to our consolidated financial statements included in Item 8 of Part II of this report for further discussion. \nCapital Expenditures\nFor the year ending December 31, 2025, we currently expect to complete and turn in line 240 to 270 gross wells utilizing approximately 11 to 15 rigs and plan to invest between approximately $2.9 – $3.1 billion in capital expenditures. We currently plan to fund our 2025 capital program through cash on hand, expected cash flow from our operations and borrowings under our Credit Facility. We may alter or change our plans with respect to our capital program and expected capital expenditures based on developments in our business, our financial position, our industry or any of the markets in which we operate. \n58\nTABLE OF CONTENTS\nSources and (Uses) of Cash and Cash Equivalents\nThe following table presents the sources and uses of our cash and cash equivalents for the periods presented:\nYears Ended December 31,\n \n2024\n2023\n2022\nCash provided by operating activities\n$\n1,565 \n$\n2,380 \n$\n4,125 \nProceeds from divestitures of property and equipment\n21 \n2,533 \n407 \nProceeds from Credit Facility, net\n— \n— \n1,050 \nReceipts of deferred consideration\n166 \n— \n— \nProceeds from issuance of senior notes, net\n747 \n— \n— \nProceeds from warrant exercise\n3 \n— \n27 \nCapital expenditures\n(1,557)\n(1,829)\n(1,823)\nContributions to investments\n(75)\n(231)\n(18)\nPayments on Credit Facility, net\n— \n(1,050)\n— \nPayments on Exit Credit Facility, net\n— \n— \n(221)\nBusiness combination, net\n(459)\n— \n(1,967)\nCash paid to purchase debt\n(767)\n— \n— \nDebt issuance and other financing costs\n(11)\n— \n(17)\nCash paid to repurchase and retire common stock\n— \n(355)\n(1,073)\nCash paid for common stock dividends\n(388)\n(487)\n(1,212)\nOther\n(3)\n— \n— \nNet increase (decrease) in cash, cash equivalents and restricted cash\n$\n(758)\n$\n961 \n$\n(722)\nCash Flow from Operating Activities\nCash provided by operating activities was $1.57 billion, $2.38 billion and $4.12 billion during the years ended December 31, 2024, 2023 and 2022, respectively. The decrease in 2024 is primarily due to lower prices for the natural gas, oil and NGL we sold. The decrease in 2023 is primarily due to lower prices for the natural gas, oil and NGL we sold as well as decreased sales volumes related to our Eagle Ford divestitures. Cash flows from operations are largely affected by the same factors that affect our net income, excluding various non-cash items, such as depreciation, depletion and amortization, certain impairments, gains or losses on sales of assets, deferred income taxes and mark-to-market changes in our open derivative instruments. See further discussion below under \nResults of Operations\n.\nProceeds from Divestitures of Property and Equipment\nIn 2023, we sold our Eagle Ford assets through three separate transactions resulting in total cash proceeds of $2.5 billion after customary post-closing adjustments. In 2022, we sold our Powder River Basin assets to Continental Resources, Inc. for approximately $400 million after customary closing adjustments. See \nNote \n2\n of the notes to our consolidated financial statements included in Item 8 of Part II of this report for further discussion.\nProceeds from Credit Facility, net\nIn 2022, we borrowed a net $1.05 billion under the Credit Facility. We utilized these borrowings to terminate the Exit Credit Facility. A portion of the borrowings under the Credit Facility were repaid with internally generated cash provided by operating activities.\n59\nTABLE OF CONTENTS\nReceipts of Deferred Consideration\nDuring 2024, we received $166 million in deferred consideration associated with our Eagle Ford divestiture transactions. See \nNote 2\n of the notes to our consolidated financial statements included in Item 8 of Part II of this report for further discussion.\nProceeds from Issuance of Senior Notes, net\nIn 2024, we completed our underwritten public offering of $750 million aggregate principal amount of our 5.70% Senior Notes due 2035. See \nNote 4\n of the notes to our consolidated financial statements included in Item 8 of Part II of this report for further discussion.\nCapital Expenditures\nOur capital expenditures during the year ended December 31, 2024 decreased compared to the year ended December 31, 2023, primarily as a result of decreased drilling and completion activity within our Northeast Appalachia and Haynesville operating areas, as well as reduced activity in Eagle Ford due to our Eagle Ford divestitures. Our capital expenditures during the year ended December 31, 2023 were in line with the capital expenditures during the year ended December 31, 2022, primarily as a result of increased drilling and completion activity within our Haynesville operating area, partially offset by reduced activity due to our Eagle Ford divestitures. During the year ended December 31, 2024, our average operated rig count was 9 rigs and 133 spud wells, compared to an average operated rig count of 11 rigs and 193 spud wells in the year ended December 31, 2023 and 14 rigs and 217 spud wells in the year ended December 31, 2022. We completed 81 operated wells in the year ended December 31, 2024 compared to 166 in the year ended December 31, 2023 and 216 in the year ended December 31, 2022.\nContributions to Investments\nDuring the years ended December 31, 2024, 2023 and 2022, contributions to investments primarily consisted of contributions to our investment with Momentum Sustainable Ventures LLC to build a new natural gas gathering pipeline and carbon capture project. See \nNote 15\n of the notes to our consolidated financial statements included in Item 8 of Part II of this report for additional information.\nPayments on Credit Facility, net\nDuring the year ended December 31, 2023, we made net repayments of $1.05 billion on the Credit Facility, utilizing a portion of the proceeds from the Eagle Ford divestitures and internally generated cash provided by operating activities.\nPayments on Exit Credit Facility, net\nIn December 2022, we entered into the Credit Facility and terminated the Exit Credit Facility, repaying all amounts outstanding and extinguishing all commitments thereunder.\nBusiness Combination, net \nIn connection with the completion of the Southwestern Merger during 2024, we terminated Southwestern’s existing credit facility, with all loan amounts and other obligations outstanding thereunder repaid in full and all commitments thereunder extinguished, for approximately $585 million utilizing cash on hand as well as the cash assumed from Southwestern. During the year ended December 31, 2022, we completed the Marcellus Acquisition for approximately $2 billion and 9.4 million shares of our common stock. See \nNote 2\n of the notes to our consolidated financial statements included in Item 8 of Part II of this report for further discussion of these acquisitions.\n60\nTABLE OF CONTENTS\nCash Paid to Purchase Debt\nIn 2024, we announced an offer to purchase for cash, any and all of our outstanding 2026 Notes, the “Tender Offer”. Upon expiration of the Tender Offer, approximately 91%, or $453 million, of the 2026 Notes were validly tendered and not validly withdrawn. In a separate transaction during the fourth quarter of 2024, we redeemed all of the $304 million aggregate principal of the 2028 Notes assumed in the Southwestern Merger for approximately $312 million, which included an $8 million premium to call the notes. See \nNote 4\n of the notes to our consolidated financial statements included in Item 8 of Part II of this report for further discussion.\nDebt Issuance and Other Financing Costs\nDuring 2024, we paid $11 million of one-time fees to lenders related to the changes to our Credit Facility as well as for the issuance of the 2035 Senior Notes. During 2022, we paid $17 million of one-time fees to lenders to establish the Credit Facility. \nCash Paid to Repurchase and Retire Common Stock\nWe did not repurchase any shares during 2024. During 2023, we repurchased 4.4 million shares of our common stock for an aggregate cost of approximately $355 million. During 2022, we repurchased 11.7 million shares of our common stock for an aggregate cost of $1.1 billion. The repurchased shares of common stock were retired and recorded as a reduction to common stock and retained earnings. See \nNote 1\n0\n of the notes to our consolidated financial statements included in Item 8 of Part II of this report for further discussion.\nCash Paid for Common Stock Dividends\nAs part of our dividend program, we paid common stock dividends of $388 million, $487 million and $1.2 billion during the years ended December 31, 2024, 2023 and 2022, respectively. See \nNote 1\n0\n of the notes to our consolidated financial statements included in Item 8 of Part II of this report for further discussion.\n61\nTABLE OF CONTENTS\nResults of Operations\nYear ended December 31, 2024 compared to the year ended December 31, 2023\nBelow is a discussion of changes in our results of operations for 2024 compared to 2023. The results of operations discussed below include amounts pertaining to Southwestern after the merger closed on October 1, 2024. A discussion of changes in our results of operations for 2023 compared to 2022 has been omitted from this Form 10-K, but may be found in \nPart II, Item 7. Management\n’\ns Discussion and Analysis of Financial Condition and Results of Operations\n of our Form 10-K for the year ended December 31, 2023 as filed with the SEC on February 21, 2024.\nNatural Gas, Oil and NGL Production and Average Sales Prices\nYear Ended December 31, 2024\nNatural Gas\nOil\nNGL\nTotal\nMMcf per day\n$/Mcf\nMBbl per day\n$/Bbl\nMBbl per day\n$/Bbl\nMMcfe per day\n$/Mcfe\nHaynesville\n1,532 \n2.14 \n— \n— \n— \n— \n1,532 \n2.14 \nNortheast Appalachia\n1,809 \n1.88 \n— \n— \n— \n— \n1,809 \n1.88 \nSouthwest Appalachia\n270 \n2.42 \n3 \n60.41 \n21 \n27.44 \n417 \n3.42 \nTotal\n3,611 \n2.03 \n3 \n60.41 \n21 \n27.44 \n3,758 \n2.16 \nAverage NYMEX Price\n2.27 \n75.72 \nAverage Realized Price (including realized derivatives)\n2.75 \n61.04 \n26.91 \n2.84 \nYear Ended December 31, 2023\nNatural Gas\nOil\nNGL\nTotal\nMMcf per day\n$/Mcf\nMBbl per day\n$/Bbl\nMBbl per day\n$/Bbl\nMMcfe per day\n$/Mcfe\nHaynesville\n1,551 \n2.30 \n— \n— \n— \n— \n1,551 \n2.30 \nNortheast Appalachia\n1,834 \n2.22 \n— \n— \n— \n— \n1,834 \n2.22 \nEagle Ford\n85 \n2.25 \n21 \n77.80 \n10 \n25.62 \n274 \n7.64 \nTotal\n3,470 \n2.25 \n21 \n77.80 \n10 \n25.62 \n3,659 \n2.66 \nAverage NYMEX Price\n2.74 \n77.63 \nAverage Realized Price (including realized derivatives)\n2.64 \n72.89 \n25.62 \n2.99 \n62\nTABLE OF CONTENTS\nNatural Gas, Oil and NGL Sales\nYear Ended December 31, 2024\nNatural Gas\nOil\nNGL\nTotal\nHaynesville\n$\n1,205 \n$\n— \n$\n— \n$\n1,205 \nNortheast Appalachia\n1,242 \n— \n— \n1,242 \nSouthwest Appalachia\n239 \n69 \n214 \n522 \nTotal natural gas, oil and NGL sales\n$\n2,686 \n$\n69 \n$\n214 \n$\n2,969 \nYear Ended December 31, 2023\nNatural Gas\nOil\nNGL\nTotal\nHaynesville\n$\n1,300 \n$\n— \n$\n— \n$\n1,300 \nNortheast Appalachia\n1,483 \n— \n— \n1,483 \nEagle Ford\n70 \n596 \n98 \n764 \nTotal natural gas, oil and NGL sales\n$\n2,853 \n$\n596 \n$\n98 \n$\n3,547 \nNatural gas, oil and NGL sales in 2024 decreased $578 million compared to 2023. Lower average prices, which were consistent with the downward trend in index prices for gas and oil, drove a $426 million decrease in 2024. The Eagle Ford divestitures resulted in a $764 million decrease. Additionally, planned curtailments and activity deferrals led to lower sales volumes in Haynesville and Northeast Appalachia for decreases of $243 million and $167 million, respectively. These decreases were partially offset by a $1.0 billion increase due to the Southwestern Merger.\nProduction Expenses\nYears Ended December 31,\n2024\n2023\n$/Mcfe\n$/Mcfe\nHaynesville\n$\n170 \n0.30 \n$\n185 \n0.33 \nNortheast Appalachia\n97 \n0.15 \n81 \n0.12 \nSouthwest Appalachia\n49 \n0.32 \n— \n— \nEagle Ford\n— \n— \n90 \n0.91 \nTotal production expenses\n$\n316 \n0.23 \n$\n356 \n0.27 \nProduction expenses in 2024 decreased $40 million compared to 2023. The decrease was primarily due to a $90 million decrease due to the Eagle Ford divestitures, which was partially offset by a $49 million increase in Southwest Appalachia due to the Southwestern Merger. Haynesville had a net decrease of $15 million due to a $51 million decrease in workover activity, saltwater disposal expenses and treating expenses, partially offset by a $36 million increase related to the Southwestern Merger. Northeast Appalachia increased $16 million due to an additional $22 million of expense related to the Southwestern Merger, partially offset by a $6 million decrease related to lower workover expense, saltwater disposal and repairs and maintenance. \n63\nTABLE OF CONTENTS\nGathering, Processing and Transportation Expenses (“GP&T”)\nYears Ended December 31,\n2024\n2023\n$/Mcfe\n$/Mcfe\nHaynesville\n$\n326 \n0.58 \n$\n263 \n0.46 \nNortheast Appalachia\n507 \n0.77 \n433 \n0.65 \nSouthwest Appalachia\n202 \n1.33 \n— \n— \nEagle Ford\n— \n— \n157 \n1.57 \nTotal GP&T\n$\n1,035 \n0.75 \n$\n853 \n0.64 \nGathering, processing and transportation expenses in 2024 increased $182 million compared to 2023. The increase was primarily due to a $404 million increase related to the Southwestern Merger. The increase was partially offset by a $157 million decrease due to the Eagle Ford divestitures. Additionally, curtailments led to decreased volumes resulting in decreases of $58 million and $66 million in Haynesville and Northeast Appalachia, respectively. These decreases were partially offset by increases of $11 million and $48 million related to rate increases in Haynesville and Northeast Appalachia, respectively.\nSeverance and Ad Valorem Taxes\nYears Ended December 31,\n2024\n2023\n$/Mcfe\n$/Mcfe\nHaynesville\n$\n60 \n0.11 \n$\n105 \n0.19 \nNortheast Appalachia\n15 \n0.02 \n14 \n0.02 \nSouthwest Appalachia\n22 \n0.14 \n— \n— \nEagle Ford\n— \n— \n48 \n0.48 \nTotal severance and ad valorem taxes\n$\n97 \n0.07 \n$\n167 \n0.13 \nSeverance and ad valorem taxes in 2024 decreased $70 million compared to 2023. The decrease was primarily related to a $48 million decrease due to the Eagle Ford divestitures and a $50 million decrease in Haynesville, which was driven by a decrease in the statutory severance tax rates. These decreases were partially offset by an increase of $5 million in Haynesville and an increase of $22 million in Southwest Appalachia due to the Southwestern Merger.\n64\nTABLE OF CONTENTS\nNatural Gas, Oil and NGL Derivatives\nYears Ended December 31,\n2024\n2023\nNatural gas derivatives - realized gains\n$\n919 \n$\n488 \nNatural gas derivatives - unrealized gains (losses)\n(951)\n1,199 \nTotal gains (losses) on natural gas derivatives\n$\n(32)\n$\n1,687 \nOil derivatives - realized gains (losses)\n$\n1 \n$\n(38)\nOil derivatives - unrealized gains\n(3)\n88 \nTotal gains (losses) on oil derivatives\n$\n(2)\n$\n50 \nNGL derivatives - realized losses\n$\n(4)\n$\n— \nNGL derivatives - unrealized losses\n(13)\n— \nTotal losses on NGL derivatives\n$\n(17)\n$\n— \nContingent consideration - realized gains\n$\n25 \n$\n— \nContingent consideration - unrealized losses\n(12)\n(9)\nTotal gains (losses) on contingent consideration\n$\n13 \n$\n(9)\nTotal gains (losses) on natural gas, oil and NGL derivatives\n$\n(38)\n$\n1,728 \nSee \nNote 1\n3\n of the notes to our consolidated financial statements included in Item 8 of Part II of this report for a complete discussion of our derivative activity.\nMarketing Revenues and Expenses\n \nYears Ended December 31,\n2024\n2023\nMarketing revenues\n$\n1,290 \n$\n2,500 \nMarketing expenses\n1,310 \n2,499 \nMarketing margin\n$\n(20)\n$\n1 \nMarketing revenues and expenses decreased in 2024 compared to 2023 as a result of decreased oil marketing activities, primarily as a result of the Eagle Ford divestitures in 2023.\nExploration Expenses \nDuring 2024, exploration expense of $10 million was primarily the result of $6 million of non-cash impairment charges on unproved properties and $3 million of geological and geophysical expense. During 2023, exploration expense of $27 million was primarily the result of $12 million of non-cash impairment charges on unproved properties and $11 million of geological and geophysical expense. \n65\nTABLE OF CONTENTS\nGeneral and Administrative Expenses\nYears Ended December 31,\n2024\n2023\nTotal G&A, net\n$\n186 \n$\n127 \nG&A, net per Mcfe\n$\n0.14 \n$\n0.09 \nTotal general and administrative expenses, net during 2024 increased $59 million compared to 2023, primarily due to a decrease in our producing well count following the Eagle Ford divestitures, which reduced our allocations and reimbursements of G&A. Additionally, compensation and other corporate expenses increased following the Southwestern Merger.\nSeparation and Other Termination Costs\nDuring 2024 and 2023, we recognized $23 million and $5 million, respectively, of separation and other termination costs related to one-time termination benefits for certain employees.\nDepreciation, Depletion and Amortization\nYears Ended December 31,\n2024\n2023\nDD&A\n$\n1,729 \n$\n1,527 \nDD&A per Mcfe\n$\n1.26 \n$\n1.14 \nThe absolute increase in depreciation, depletion and amortization for 2024 compared to 2023 is primarily related to the Southwestern Merger. Depreciation, depletion and amortization per Mcfe increased for 2024 compared to 2023 primarily related to production curtailments during 2024.\nOther Operating Expense\n, Net\nYears Ended December 31,\n2024\n2023\nOther operating expense, net\n$\n332 \n$\n18 \nDuring 2024, we recognized approximately $312 million of costs related to the Southwestern Merger, which included $148 million related to employee expenses and the remainder of the costs relating to transaction fees,  consulting and legal fees and other fees related to the transaction.\nInterest Expense\nYears Ended December 31,\n2024\n2023\nInterest expense on debt\n$\n181 \n$\n143 \nAmortization of premium, discount, issuance costs and other\n(7)\n(9)\nCapitalized interest\n(51)\n(30)\nTotal interest expense\n$\n123 \n$\n104 \nThe increase in total interest expense 2024 compared to 2023, was primarily due to our assumption of Southwestern’s Senior Notes as a result of the Southwestern Merger, which resulted in an increase in interest expense on debt. Additionally, our capitalized interest increased in 2024 compared to 2023 primarily as a result of the capitalized interest related to our investment with Momentum Sustainable Ventures LLC. See \nNote 4\n and \nNote 15\n of the notes to our consolidated financial statements included in Item 8 of Part II of this report for additional discussion.\n66\nTABLE OF CONTENTS\nOther Income, net\nYears Ended December 31,\n2024\n2023\nOther income, net\n$\n86 \n$\n79 \nOther income during the time periods presented above primarily consists of interest income and deferred consideration amortization. The increase in 2024 compared to 2023 was primarily due to increased interest income related to our higher average cash balance in 2024.\nIncome Tax Expense (Benefit)\nWe recorded an income tax benefit of $127 million in 2024. Of this amount, $4 million is related to current federal and state income tax benefit, and the remainder is related to deferred federal and state income taxes. We recorded income tax expense of $698 million in 2023. Of this amount, $270 million is related to current federal and state income taxes, and the remainder is related to deferred federal and state income taxes. See \nNote \n9\n of the notes to our consolidated financial statements included in Item 8 of Part II of this report for a discussion of income tax expense (benefit).\n67\nTABLE OF CONTENTS\nCritical Accounting Estimates\nThe preparation of financial statements in accordance with accounting principles generally accepted in the United States require us to make estimates and assumptions. The accounting estimates and assumptions that involve a significant level of estimation uncertainty and have or are reasonably likely to have a material impact on our financial condition or results of operations are discussed below. Our management has discussed each critical accounting estimate with the Audit Committee of our Board of Directors.\nNatural Gas and Oil Reserves. \nEstimates of natural gas and oil reserves and their values, future production rates, future development costs and commodity pricing differentials are the most significant of our estimates. The accuracy of any reserve estimate is a function of the quality of data available and of engineering and geological interpretation and judgment. In addition, estimates of reserves may be revised based on actual production, results of subsequent exploration and development activities, recent commodity prices, operating costs and other factors. These revisions could materially affect our financial statements. The volatility of commodity prices results in increased uncertainty inherent in these estimates and assumptions. Changes in natural gas, oil or NGL prices could result in actual results differing significantly from our estimates. See \nSupplemental Disclosures About Natural Gas, Oil and NGL Producing Activities\n included in \nItem 8 of Part II\n of this report for further information.\nAccounting for Business Combinations.\n We account for business combinations using the acquisition method, which is the only method permitted under FASB ASC Topic 805 – Business Combinations and involves the use of significant judgment. Under the acquisition method of accounting, a business combination is accounted for at a purchase price based on the fair value of the consideration given. The assets and liabilities acquired are measured at their fair values, and the purchase price is allocated to the assets and liabilities based upon these fair values.  The excess, if any, of the consideration given to acquire an entity over the net amounts assigned to its assets acquired and liabilities assumed is recognized as goodwill. The excess, if any, of the fair value of assets acquired and liabilities assumed over the cost of an acquired entity is recognized immediately to earnings as a gain from bargain purchase.\nThe Company’s principal assets are its natural gas and oil properties, which are accounted for under the successful efforts accounting method. The Company determines the fair value of acquired natural gas and oil properties based on the discounted future net cash flows expected to be generated from these assets. Discounted cash flow models by operating area are prepared using the estimated future revenues and operating costs for all proved developed properties and undeveloped properties comprising the proved and unproved reserves. Significant inputs associated with the calculation of discounted future net cash flows include estimates of (i) future production volumes based on estimated reserves, (ii) future operating and development costs, (iii) future commodity prices escalated by an inflationary rate after three years, adjusted for differentials, and (iv) a market-based weighted average cost of capital by operating area. The Company utilizes NYMEX strip pricing, adjusted for differentials, to value the reserves. The NYMEX strip pricing inputs used are classified as Level 1 fair value assumptions and all other inputs are classified as Level 3 fair value assumptions. The discount rates utilized are derived using a weighted average cost of capital computation, which includes an estimated cost of debt and equity for market participants with similar geographies and asset development type by operating area.\nSee \nNote 2\n of the notes to our consolidated financial statements included in Item 8 of Part II of this report for additional information on our business combinations, including the Southwestern Merger, which was completed on October 1, 2024.\nIncome Taxes.\n Income taxes are accounted for using the asset and liability method as required by GAAP.  Deferred tax assets and liabilities arise from temporary differences between the tax basis of assets and liabilities and their reported amounts in the financial statements. Deferred tax assets for tax attributes such as NOL carryforwards and disallowed business interest carryforwards are also recognized. Deferred tax assets represent potential future tax benefits and are reduced by a valuation allowance if it is more likely than not that such benefits will not be realized. \nIn assessing the need for a valuation allowance or adjustments to existing valuation allowances, one source of evidence is a projection of income exclusive of existing timing differences. Our judgement regarding the realizability of deferred tax assets is thus partially affected by estimates of future financial condition. \n68\nTABLE OF CONTENTS\nWe also routinely assess potential uncertain tax positions and, if required, establish accruals for such positions. Accounting guidance for recognizing and measuring uncertain tax positions requires that a more likely than not threshold condition be met on a tax position, based solely on its technical merits of being sustained, before any benefit of the uncertain tax position can be recognized in the financial statements. If it is more likely than not a tax position will be sustained, we measure and recognize the position following a cumulative probability estimate.\nImpairments\n. Long-lived assets used in operations, including proved gas and oil properties, are assessed for impairment whenever changes in facts and circumstances indicate a possible significant deterioration in future cash flows expected to be generated by an asset group. Individual assets are grouped for impairment purposes based on a judgmental assessment of the lowest level for which there are identifiable cash flows that are largely independent of the cash flows of other groups of assets. If there is an indication the carrying amount of an asset may not be recovered, the asset is assessed by management through an established process in which changes to significant assumptions such as prices, volumes, and future development plans are reviewed. If, upon review, the sum of the undiscounted pre-tax cash flows is less than the carrying value of the asset group, the carrying value is written down to estimated fair value by discounting using a weighted average cost of capital. Because there usually is a lack of quoted market prices for long-lived assets, the fair value of impaired assets is assessed by management using the income approach. Level 3 inputs associated with the calculation of discounted cash flows used in the impairment analysis include our estimate of future natural gas and crude oil prices, production costs, development expenditures, anticipated production of proved reserves and other relevant data. Additionally, we utilize NYMEX strip pricing, adjusted for differentials, to value the reserves.\n69\nTABLE OF CONTENTS\nItem 7A.\nQuantitative and Qualitative Disclosures About Market Risk\nThe primary objective of the following information is to provide forward-looking quantitative and qualitative information about our exposure to market risk. The term market risk relates to our risk of loss arising from adverse changes in natural gas, oil and NGL prices and interest rates. These disclosures are not meant to be precise indicators of expected future losses, but rather indicators of reasonably possible losses. The forward-looking information provides indicators of how we view and manage our ongoing market risk exposures.\nCommodity Price Risk\nOur results of operations and cash flows are impacted by changes in market prices for natural gas, oil and NGL, which have historically been volatile. To mitigate a portion of our exposure to adverse price changes, we enter into various derivative instruments. Our natural gas, oil and NGL derivative activities, when combined with our sales of natural gas, oil and NGL, allow us to predict with greater certainty the revenue we will receive. We believe our derivative instruments continue to be highly effective in achieving our risk management objectives.\nWe determine the fair value of our derivative instruments utilizing established index prices, volatility curves and discount factors. These estimates are compared to counterparty valuations for reasonableness. Derivative transactions are also subject to the risk that counterparties will be unable to meet their obligations. This non-performance risk is considered in the valuation of our derivative instruments, but to date has not had a material impact on the values of our derivatives. Future risk related to counterparties not being able to meet their obligations has been partially mitigated under our commodity hedging arrangements that require counterparties to post collateral if their obligations to us are in excess of defined thresholds. The values we report in our financial statements are as of a point in time and subsequently change as these estimates are revised to reflect actual results, changes in market conditions and other factors. See \nNote 1\n3\n of the notes to our consolidated financial statements included in Item 8 of Part II of this report for further discussion of the fair value measurements associated with our derivatives.\nFor the year ended December 31, 2024, natural gas, oil and NGL revenues, excluding any effect of our derivative instruments, were $2,686 million, $69 million, and $214 million, respectively. Based on production, natural gas, oil and NGL revenue for the year ended December 31, 2024 would have increased or decreased by approximately $269 million, $7 million, and $21 million, respectively, for each 10% increase or decrease in prices. As of December 31, 2024, the fair value of our natural gas and NGL derivatives were net liabilities of $49 million and $9 million, respectively. As of December 31, 2024, the fair value of our oil derivatives was a net asset of $4 million. A 10% increase in forward gas prices would decrease the valuation of natural gas derivatives by approximately $493 million, while a 10% decrease would increase the valuation by approximately $482 million. A 10% fluctuation in forward oil prices would impact the valuation of oil derivatives by approximately $4 million. A 10% fluctuation in forward NGL prices would impact the valuation of NGL derivatives by $18 million. This fair value change assumes volatility based on prevailing market parameters at December 31, 2024. See \nNote 1\n3\n of the notes to our consolidated financial statements included in Item 8 of Part II of this report for further information on our open derivative positions.\nInterest Rate Risk\nOur exposure to interest rate changes relates primarily to borrowings under our Credit Facility. Interest is payable on borrowings under the Credit Facility based on floating rates. See \nNote \n4\n of the notes to our consolidated financial statements included in Item 8 of Part II of this report for additional information. As of December 31, 2024, we did not have any outstanding borrowings under our Credit Facility.\n70\nTABLE OF CONTENTS\nItem 8.\nFinancial Statements and Supplementary Data\nINDEX TO FINANCIAL STATEMENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nPage\nReport of Independent Registered Public Accounting Firm (PCAOB ID \n238\n)\n \n72\nConsolidated Financial Statements:\n \nConsolidated Balance Sheets \n75\nConsolidated Statements of Operations\n \n76\nConsolidated Statements of Cash Flows\n77\nConsolidated Statements of Stockholders’ Equity\n \n78\nNotes to the Consolidated Financial Statements:\nNote 1.   Basis of Presentation and Summary of Significant Accounting Policies\n79\nNote \n2\n.   Natural Gas and Oil Property Transactions\n85\nNote \n3\n.   Earnings Per Share \n \n90\nNote \n4\n.   Debt\n91\nNote \n5\n.   Contingencies and Commitments\n96\nNote \n6\n.   Other Liabilities\n98\nNote \n7\n.   Leases\n98\nNote \n8\n.  Revenue\n100\nNote \n9\n.  Income Taxes\n102\nNote 1\n0\n.  Equity\n106\nNote 1\n1\n.  Share-Based Compensation\n109\nNote 1\n2\n.  Employee Benefit Plans\n111\nNote 1\n3\n.  Derivative and Hedging Activities\n111\nNote 14.  Other Property and Equipment\n114\nNote 15.  Investments\n114\nNote 16.   Asset Retirement Obligations\n115\nNote 17.   Supplemental Cash Flow Information\n115\nNote 18.   Segment Information\n116\nSupplementary Information:\nSupplemental Disclosures About Natural Gas, Oil and NGL Producing Activities (unaudited)\n117\n71\nTABLE OF CONTENTS\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Stockholders of Expand Energy Corporation\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Expand Energy Corporation and its subsidiaries (the \"Company\") as of December 31, 2024 and 2023, and the related consolidated statements of operations, of stockholders’ equity and of cash flows for each of the three years in the period ended December 31, 2024, including the related notes (collectively referred to as the \"consolidated financial statements\"). We also have audited the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control - Integrated Framework\n (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024 in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control - Integrated Framework\n (2013) issued by the COSO.\nBasis for Opinions\nThe Company's management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in Management’s Report on Internal Control over Financial Reporting appearing under Item 9A. Our responsibility is to express opinions on the Company’s consolidated financial statements and on the Company's internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nAs described in Management’s Report on Internal Control over Financial Reporting, management has excluded Southwestern Energy from its assessment of internal control over financial reporting as of December 31, 2024, because it was acquired by the Company in a purchase business combination during 2024. We have also excluded Southwestern Energy from our audit of internal control over financial reporting. Southwestern Energy is a wholly-owned subsidiary whose total assets and total revenues excluded from management’s assessment and our audit of internal control over financial reporting represent 56% and 35%, respectively, of the related consolidated financial statement amounts as of and for the year ended December 31, 2024.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting \n72\nTABLE OF CONTENTS\nincludes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that (i) relate to accounts or disclosures that are material to the\n \nconsolidated financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated\n \nfinancial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate. \nThe Impact of Proved Developed Natural Gas and Oil Reserves on Proved Natural Gas and Oil Properties, Net\nAs described in Note 1 to the consolidated financial statements, the Company's property and equipment, net balance was $24.3 billion as of December 31, 2024, and the related depreciation, depletion and amortization expense for the year ended December 31, 2024 was $1.7 billion, both of which substantially related to proved natural gas and oil properties. The Company follows the successful efforts method to account for its natural gas and oil properties. Under this method, all capitalized well costs and leasehold costs of proved natural gas and oil properties are depreciated using the unit-of-production depreciation method based on total estimated proved developed natural gas and oil reserves. As disclosed by management, estimates of natural gas and oil reserves and their values, future production rates, future development costs and commodity pricing differentials are the most significant of management’s estimates. The accuracy of any reserve estimate is a function of the quality of data available and of engineering and geological interpretation and judgment. In addition, estimates of reserves may be revised based on actual production, results of subsequent exploration and development activities, recent commodity prices, operating costs and other factors. The estimates of proved natural gas and oil reserves have been developed by specialists, specifically the Company’s reservoir engineers, and assessed by independent petroleum engineers (together “management’s specialists”). \nThe principal considerations for our determination that performing procedures relating to the impact of proved developed natural gas and oil reserves on proved natural gas and oil properties, net is a critical audit matter are (i) the significant judgment by management, including the use of management’s specialists, when developing the estimates of proved developed natural gas and oil reserves and (ii) a high degree of auditor judgment, subjectivity, and effort in performing procedures and evaluating audit evidence related to the data, methods, and assumptions used by management and its specialists in developing the estimates of proved developed natural gas and oil reserves.  \nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to management’s estimates of proved developed natural gas and oil reserves. The work of management’s specialists was used in performing the procedures to evaluate the reasonableness of the estimates of proved developed natural gas and oil reserves. As a basis for using this work, the specialists’ qualifications were understood and the Company’s relationship with the specialists was assessed. The procedures performed also included (i) evaluating the methods and assumptions used by the specialists; (ii) testing the completeness and accuracy of the underlying data used by the specialists related to historical production volumes; and (iii) evaluating the specialists’ findings related to future production volumes by comparing the future production volumes to relevant historical and current period production volumes, as applicable.\n73\nTABLE OF CONTENTS\nSouthwestern Merger \n–\n Valuation of Proved Natural Gas and Oil Properties\nAs described in Note 2 to the consolidated financial statements, on October 1, 2024, the Company completed the merger with Southwestern\n \n(“Southwestern Merger”) and recorded estimated fair values of the acquired proved natural gas and oil properties of approximately $10.0 billion. As disclosed by management, management determines the fair value of acquired natural gas and oil properties based on the discounted future net cash flows expected to be generated from these assets. Discounted cash flow models by operating area are prepared using the estimated future revenues and operating costs for all proved developed properties. Significant inputs associated with the calculation of discounted future net cash flows include estimates of (i) future production volumes based on estimated reserves, (ii) future operating and development costs, (iii) future commodity prices escalated by an inflationary rate after three years, adjusted for differentials, and (iv) a market-based weighted average cost of capital by operating area. \n \nThe principal considerations for our determination that performing procedures relating to the valuation of proved natural gas and oil properties acquired in the Southwestern Merger is a critical audit matter are (i) the significant judgment by management, including the use of management’s specialists, when developing the fair value estimate of the proved natural gas and oil properties acquired; (ii) a high degree of auditor judgment, subjectivity, and effort in performing procedures and evaluating management’s significant assumptions related to future production volumes based on estimated reserves, future operating costs; future commodity prices escalated by an inflationary rate after three years, adjusted for differentials, and a market-based weighted average cost of capital by operating area; and (iii) the audit effort involved the use of professionals with specialized skill and knowledge.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to acquisition accounting, including controls over the valuation of proved natural gas and oil properties acquired. These procedures also included, among others (i) reading the merger agreement; (ii) testing management’s process for developing the fair value estimate of proved natural gas and oil properties acquired; (iii) evaluating the appropriateness of the discounted cash flow model; (iv) testing the completeness and accuracy of underlying data used in the discounted cash flow model; and (v) evaluating the reasonableness of the significant assumptions used by management related to future production volumes based on estimated reserves, future operating costs, future commodity prices escalated by an inflationary rate after three years, adjusted for differentials, and a market-based weighted average cost of capital by operating area. Evaluating the reasonableness of management’s assumption related to future operating costs involved considering the reasonableness of the costs as compared to the past performance of the acquired business. Evaluating the reasonableness of management’s assumption related to future commodity prices, adjusted for differentials, involved comparing the prices against observable market data and evaluating the reasonableness of the differentials as compared to the past performance of the acquired business. Professionals with specialized skill and knowledge were used to assist in evaluating (i) the appropriateness of the discounted cash flow model; (ii) the reasonableness of the market-based weighted average cost of capital by operating area assumption; and (iii) the reasonableness of the inflationary rate after three years used to escalate commodity prices. The work of management’s specialists was used in performing procedures to evaluate the reasonableness of the future production volumes based on estimated reserves used in the discounted cash flow model. As a basis for using this work, the specialists’ qualifications were understood and the Company’s relationship with the specialists was assessed. The procedures performed also included evaluating the methods and assumptions used by the specialists, testing the completeness and accuracy of the data used by the specialists related to historical production volumes, and evaluating the specialists’ findings related to future production volumes by comparing the future production volumes to relevant historical and current period production volumes, as applicable.\n/s/ \nPricewaterhouseCoopers LLP\n \nOklahoma City, Oklahoma\n \nFebruary 26, 2025\nWe have served as the Company’s auditor since 1992.\n74\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\n($ in millions, except per share data)\nDecember 31, 2024\nDecember 31, 2023\nAssets\nCurrent assets:\nCash and cash equivalents\n$\n317\n \n$\n1,079\n \nRestricted cash\n78\n \n74\n \nAccounts receivable, net\n1,226\n \n593\n \nDerivative assets\n84\n \n637\n \nOther current assets\n292\n \n226\n \nTotal current assets\n1,997\n \n2,609\n \nProperty and equipment:\nNatural gas and oil properties, successful efforts method\nProved natural gas and oil properties\n23,093\n \n11,468\n \nUnproved properties\n5,897\n \n1,806\n \nOther property and equipment\n654\n \n497\n \nTotal property and equipment\n29,644\n \n13,771\n \nLess: accumulated depreciation, depletion and amortization\n(\n5,362\n)\n(\n3,674\n)\nTotal property and equipment, net\n24,282\n \n10,097\n \nLong-term derivative assets\n1\n \n74\n \nDeferred income tax assets\n589\n \n933\n \nOther long-term assets\n1,025\n \n663\n \nTotal assets\n$\n27,894\n \n$\n14,376\n \nLiabilities and stockholders' equity\nCurrent liabilities:\nAccounts payable\n$\n777\n \n$\n425\n \nCurrent maturities of long-term debt, net\n389\n \n—\n \nAccrued interest\n100\n \n39\n \nDerivative liabilities\n71\n \n3\n \nOther current liabilities\n1,786\n \n847\n \nTotal current liabilities\n3,123\n \n1,314\n \nLong-term debt, net\n5,291\n \n2,028\n \nLong-term derivative liabilities\n68\n \n9\n \nAsset retirement obligations, net of current portion\n499\n \n265\n \nLong-term contract liabilities\n1,227\n \n—\n \nOther long-term liabilities\n121\n \n31\n \nTotal liabilities\n10,329\n \n3,647\n \nContingencies and commitments (\nNote \n5\n)\nStockholders' equity:\nCommon stock, $\n0.01\n par value, \n450,000,000\n shares authorized: \n231,769,886\n and \n130,789,936\n shares issued\n2\n \n1\n \nAdditional paid-in capital\n13,687\n \n5,754\n \nRetained earnings\n3,876\n \n4,974\n \nTotal stockholders' equity\n17,565\n \n10,729\n \nTotal liabilities and stockholders' equity\n$\n27,894\n \n$\n14,376\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n75\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS\nYears Ended December 31,\n ($ in millions, except per share data)\n2024\n2023\n2022\nRevenues and other:\nNatural gas, oil and NGL\n$\n2,969\n \n$\n3,547\n \n$\n9,892\n \nMarketing\n1,290\n \n2,500\n \n4,231\n \nNatural gas, oil and NGL derivatives\n(\n38\n)\n1,728\n \n(\n2,680\n)\nGains on sales of assets\n14\n \n946\n \n300\n \nTotal revenues and other\n4,235\n \n8,721\n \n11,743\n \nOperating expenses:\nProduction\n316\n \n356\n \n475\n \nGathering, processing and transportation\n1,035\n \n853\n \n1,059\n \nSeverance and ad valorem taxes\n97\n \n167\n \n242\n \nExploration\n10\n \n27\n \n23\n \nMarketing\n1,310\n \n2,499\n \n4,215\n \nGeneral and administrative\n186\n \n127\n \n142\n \nSeparation and other termination costs\n23\n \n5\n \n5\n \nDepreciation, depletion and amortization\n1,729\n \n1,527\n \n1,753\n \nOther operating expense, net\n332\n \n18\n \n49\n \nTotal operating expenses\n5,038\n \n5,579\n \n7,963\n \nIncome (loss) from operations\n(\n803\n)\n3,142\n \n3,780\n \nOther income (expense):\nInterest expense\n(\n123\n)\n(\n104\n)\n(\n160\n)\nLosses on purchases, exchanges or extinguishments of debt\n(\n1\n)\n—\n \n(\n5\n)\nOther income, net\n86\n \n79\n \n36\n \nTotal other income (expense)\n(\n38\n)\n(\n25\n)\n(\n129\n)\nIncome (loss) before income taxes\n(\n841\n)\n3,117\n \n3,651\n \nIncome tax expense (benefit)\n(\n127\n)\n698\n \n(\n1,285\n)\nNet income (loss)\n(\n714\n)\n2,419\n4,936\nDeemed dividend on warrants\n—\n \n—\n \n(\n67\n)\nNet income (loss) available to common stockholders\n$\n(\n714\n)\n$\n2,419\n \n$\n4,869\n \nEarnings (loss) per common share:\nBasic\n$\n(\n4.55\n)\n$\n18.21\n \n$\n38.71\n \nDiluted\n$\n(\n4.55\n)\n$\n16.92\n \n$\n33.36\n \nWeighted average common shares outstanding (in thousands):\nBasic\n156,989\n132,840\n125,785\nDiluted\n156,989\n142,976\n145,961\nThe accompanying notes are an integral part of these consolidated financial statements.\n76\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n \nYears Ended December 31,\n ($ in millions)\n2024\n2023\n2022\nCash flows from operating activities:\nNet income (loss)\n$\n(\n714\n)\n$\n2,419\n \n$\n4,936\n \nAdjustments to reconcile net income (loss) to net cash provided by operating activities:\nDepreciation, depletion and amortization\n1,729\n \n1,527\n \n1,753\n \nDeferred income tax expense (benefit)\n(\n123\n)\n428\n \n(\n1,332\n)\nDerivative (gains) losses, net\n38\n \n(\n1,728\n)\n2,680\n \nCash receipts (payments) on derivative settlements, net\n947\n \n354\n \n(\n3,561\n)\nShare-based compensation\n38\n \n33\n \n22\n \nGains on sales of assets\n(\n14\n)\n(\n946\n)\n(\n300\n)\nContract amortization\n(\n57\n)\n—\n \n—\n \nLosses on purchases, exchanges or extinguishments of debt\n1\n \n—\n \n5\n \nOther\n35\n \n18\n \n45\n \nChanges in assets and liabilities\n(\n315\n)\n275\n \n(\n123\n)\nNet cash provided by operating activities\n1,565\n2,380\n4,125\nCash flows from investing activities:\nCapital expenditures\n(\n1,557\n)\n(\n1,829\n)\n(\n1,823\n)\nReceipts of deferred consideration\n166\n \n—\n \n—\n \nBusiness combination, net\n(\n459\n)\n—\n \n(\n1,967\n)\nContributions to investments\n(\n75\n)\n(\n231\n)\n(\n18\n)\nProceeds from divestitures of property and equipment\n21\n \n2,533\n \n407\n \nNet cash provided by (used in) investing activities\n(\n1,904\n)\n473\n(\n3,401\n)\nCash flows from financing activities:\nProceeds from Credit Facility\n20\n \n1,125\n \n1,600\n \nPayments on Credit Facility\n(\n20\n)\n(\n2,175\n)\n(\n550\n)\nProceeds from Exit Credit Facility\n—\n \n—\n \n9,583\n \nPayments on Exit Credit Facility\n—\n \n—\n \n(\n9,804\n)\nProceeds from issuance of senior notes, net\n747\n \n—\n \n—\n \nProceeds from warrant exercise\n3\n \n—\n \n27\n \nDebt issuance and other financing costs\n(\n11\n)\n—\n \n(\n17\n)\nCash paid to repurchase and retire common stock\n—\n \n(\n355\n)\n(\n1,073\n)\nCash paid to purchase debt\n(\n767\n)\n—\n \n—\n \nCash paid for common stock dividends\n(\n388\n)\n(\n487\n)\n(\n1,212\n)\nOther\n(\n3\n)\n—\n \n—\n \nNet cash used in financing activities\n(\n419\n)\n(\n1,892\n)\n(\n1,446\n)\nNet increase (decrease) in cash, cash equivalents and restricted cash\n(\n758\n)\n961\n \n(\n722\n)\nCash, cash equivalents and restricted cash, beginning of period\n1,153\n \n192\n \n914\n \nCash, cash equivalents and restricted cash, end of period\n$\n395\n \n$\n1,153\n \n$\n192\n \nCash and cash equivalents\n$\n317\n \n$\n1,079\n \n$\n130\n \nRestricted cash\n78\n \n74\n \n62\n \nTotal cash, cash equivalents and restricted cash\n$\n395\n \n$\n1,153\n \n$\n192\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n77\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY\nCommon Stock\nAdditional Paid-in Capital\nRetained Earnings\nTotal Stockholders’ Equity\n($ in millions)\nShares\nAmount\nBalance as of December 31, 2021\n117,917,349\n \n$\n1\n \n$\n4,845\n \n$\n825\n \n$\n5,671\n \nIssuance of common stock for Marcellus Acquisition\n9,442,185\n \n— \n764\n \n— \n764\n \nShare-based compensation\n174,740\n \n— \n21\n \n— \n21\n \nIssuance of common stock for warrant exchange offer\n16,305,984\n \n— \n67\n \n— \n67\n \nIssuance of common stock for warrant exercise\n2,102,244\n \n— \n27\n \n— \n27\n \nIssuance of reserved common stock and warrants\n439,370\n \n— \n— \n— \n— \nRepurchase and retirement of common stock\n(\n11,666,778\n)\n— \n— \n(\n1,073\n)\n(\n1,073\n)\nNet income\n— \n— \n— \n4,936\n \n4,936\n \nDividends on common stock\n— \n— \n— \n(\n1,222\n)\n(\n1,222\n)\nDeemed dividend on warrants\n— \n— \n— \n(\n67\n)\n(\n67\n)\nBalance as of December 31, 2022\n134,715,094\n \n$\n1\n \n$\n5,724\n \n$\n3,399\n \n$\n9,124\n \nShare-based compensation\n214,684\n \n— \n31\n \n— \n31\n \nIssuance of common stock for warrant exercise\n221,952\n \n— \n— \n— \n—\n \nIssuance of reserved common stock and warrants\n12,089\n \n— \n— \n— \n— \nRepurchase and retirement of common stock\n(\n4,373,883\n)\n— \n(\n1\n)\n(\n357\n)\n(\n358\n)\nNet income\n— \n— \n— \n2,419\n \n2,419\n \nDividends on common stock\n— \n— \n— \n(\n487\n)\n(\n487\n)\nBalance as of December 31, 2023\n130,789,936\n \n$\n1\n \n$\n5,754\n \n$\n4,974\n \n$\n10,729\n \nIssuance of common stock for Southwestern Merger\n95,700,325\n \n1\n \n7,888\n \n— \n7,889\n \nShare-based compensation\n727,799\n \n— \n42\n \n— \n42\n \nIssuance of common stock for warrant exercise\n4,083,103\n \n— \n3\n \n— \n3\n \nIssuance of reserved common stock and warrants\n468,723\n \n— \n— \n— \n— \nNet loss\n— \n— \n— \n(\n714\n)\n(\n714\n)\nDividends on common stock\n— \n— \n— \n(\n384\n)\n(\n384\n)\nBalance as of December 31, 2024\n231,769,886\n \n$\n2\n \n$\n13,687\n \n$\n3,876\n \n$\n17,565\n \nThe accompanying notes are an integral part of these consolidated financial statements.\n78\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1.\nBasis of Presentation and Summary of Significant Accounting Policies\nDescription of Company\nOn October 1, 2024, Chesapeake Energy Corporation (“Chesapeake”) changed its name to Expand Energy Corporation (\"Expand Energy,\" “we,” “our,” “us” or the \"Company\") in connection with the Southwestern Merger, further discussed in \nNote 2\n. Following the Southwestern Merger, Expand Energy is the largest natural gas producer in the U.S., based on net daily production, and is focused on responsibly developing an abundant supply of natural gas, oil and NGL to expand energy access for all. We have operations in Louisiana, Pennsylvania, West Virginia and Ohio, with all of our operations located onshore in the United States.\nBasis of Presentation\nThe accompanying consolidated financial statements of Expand Energy were prepared in accordance with GAAP and include the accounts of our direct and indirect wholly owned subsidiaries and entities in which Expand Energy has a controlling financial interest. Intercompany accounts and balances have been eliminated. All monetary values, other than per unit and per share amounts, are stated in millions of U.S. dollars unless otherwise specified.\nThis Annual Report on Form 10-K (this “Form 10-K”) relates to our financial position as of December 31, 2024 and as of December 31, 2023, and our results of operations for the year ended December 31, 2024, the year ended December 31, 2023 and the year ended December 31, 2022. For the time periods covered by this Form 10-K, we did not have any changes or items impacting other comprehensive income.\n \nAccounting Estimates\nThe preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and the related disclosures in the financial statements. Management evaluates its estimates and related assumptions regularly, including those related to the impairment of natural gas and oil properties, natural gas and oil reserves, derivatives, income taxes, impairment of other property and equipment, environmental remediation costs, asset retirement obligations, litigation and regulatory proceedings and fair values. Changes in facts and circumstances or additional information may result in revised estimates, and actual results may differ significantly from these estimates.\nConsolidation\nWe consolidate entities in which we have a controlling financial interest and variable interest entities in which we are the primary beneficiary. We consolidate subsidiaries in which we hold, directly or indirectly, more than 50% of the voting rights. We use the equity method of accounting to record our net interests where we have the ability to exercise significant influence through our investment but lack a controlling financial interest. Under the equity method, our share of net income (loss) is included in our consolidated statements of operations according to our equity ownership or according to the terms of the applicable governing instrument. See \nNote 15\n for further discussion of our investments. Undivided interests in natural gas and oil properties are consolidated on a proportionate basis.\nSegments\nOperating segments are defined as components of an enterprise that engage in activities from which it may earn revenues and incur expenses for which separate operational financial information is available and is regularly evaluated by the chief operating decision maker (“CODM”), who is our Chief Executive Officer, for the purpose of allocating an enterprise’s resources and assessing its operating performance. We have concluded that we have \none\n reportable segment, due to the similar nature of the exploration and production business across Expand Energy and its consolidated subsidiaries and the fact that our marketing activities are ancillary to our operations.\n See \nNote 18\n for additional information.\nCash and Cash Equivalents\nFor purposes of the consolidated financial statements, we consider investments in all highly liquid instruments with original maturities of three months or less at the date of purchase to be cash equivalents.\n \n79\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nRestricted Cash\nAs of December 31, 2024, we had restricted cash of $\n78\n million. Our restricted cash represents funds legally restricted for future payment of certain royalties, as well as for payment of certain convenience class unsecured claims.\n \nAccounts Receivable\nOur accounts receivable are primarily from purchasers of natural gas, oil and NGL and from exploration and production companies that own interests in properties we operate. This industry concentration could affect our overall exposure to credit risk, either positively or negatively, because our purchasers and joint working interest owners may be similarly affected by changes in economic, industry or other conditions. We monitor the creditworthiness of all our counterparties and we generally require letters of credit or parent guarantees for receivables from parties deemed to have sub-standard credit, unless the credit risk can otherwise be mitigated. We utilize an allowance method in accounting for bad debt based on historical trends in addition to specifically identifying receivables that we believe may be uncollectible.\n See \nNote \n8\n for additional information regarding our accounts receivable.\nNatural Gas and Oil Properties\nWe follow the successful efforts method of accounting for our natural gas and oil properties. Under this method, exploration costs such as exploratory geological and geophysical costs, expiration of unproved leasehold, delay rentals and exploration overhead are expensed as incurred. All costs related to production, general corporate overhead and similar activities are also expensed as incurred. All property acquisition costs and development costs are capitalized when incurred. \nExploratory drilling costs are initially capitalized, or suspended, pending the determination of proved reserves. If proved reserves are found, drilling costs remain capitalized and are classified as proved properties. Costs of unsuccessful wells are charged to exploration expense. For exploratory wells that find reserves that cannot be classified as proved when drilling is completed, costs continue to be capitalized as suspended exploratory drilling costs if there have been sufficient reserves found to justify completion as a producing well and sufficient progress is being made in assessing the reserves and the economic and operational viability of the project. If we determine that future appraisal drilling or development activities are unlikely to occur, associated suspended exploratory well costs are expensed. In some instances, this determination may take longer than one year. We review the status of all suspended exploratory drilling costs quarterly. Costs to develop proved reserves, including the costs of all development wells and related equipment used in the production of natural gas and oil are capitalized. \nCosts of drilling and equipping successful wells, costs to construct or acquire facilities, and associated asset retirement costs are depreciated using the unit-of-production (“UOP”) method based on total estimated proved developed gas and oil reserves. Costs of acquiring proved properties, including leasehold acquisition costs transferred from unproved properties, are depleted using the UOP method based on total estimated proved developed and undeveloped reserves.  \nProceeds from the sales of individual natural gas and oil properties and the capitalized costs of individual properties sold or abandoned are credited and charged, respectively, to accumulated depreciation, depletion and amortization, if doing so does not materially impact the depletion rate of an amortization base. Generally, no gain or loss is recognized until an entire amortization base is sold. However, a gain or loss is recognized from the sale of less than an entire amortization base if the disposition is significant enough to materially impact the depletion rate of the remaining properties in the amortization base.\nWhen circumstances indicate that the carrying value of proved natural gas and oil properties may not be recoverable, we compare unamortized capitalized costs to the expected undiscounted pre-tax future cash flows for the associated assets grouped at the lowest level for which identifiable cash flows are independent of cash flows of other assets. If the expected undiscounted pre-tax future cash flows, based on our estimate of future natural gas and crude oil prices, operating costs, anticipated production from proved reserves and other relevant data, are lower than the unamortized capitalized costs, the capitalized costs are reduced to fair value. Fair value is generally estimated using the income approach described in the ASC 820, \nFair Value Measurements\n. If applicable, we utilize prices and other relevant information generated by market transactions involving assets and liabilities that are identical or comparable to the item being measured as the basis for determining fair value. The expected future cash flows used for impairment reviews and related fair value measurements are typically based on judgmental \n80\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nassessments of commodity prices, pricing adjustments for differentials, operating costs, capital investment plans, future production volumes, and estimated proved reserves, considering all available information at the date of review. These assumptions are applied to develop future cash flow projections that are then discounted to estimated fair value, using a market-based weighted average cost of capital. We have classified these fair value measurements as Level 3 in the fair value hierarchy.\nOther Property and Equipment\nOther property and equipment consists primarily of buildings and improvements, computers and office equipment, gathering and water systems, land and other assets that support our operations. Major renewals and betterments are capitalized while the costs of repairs and maintenance are charged to expense as incurred. Other property and equipment costs, excluding land, are depreciated on a straight-line basis and recorded within depreciation, depletion and amortization in the consolidated statement of operations. \nRealization of the carrying value of other property and equipment is reviewed for possible impairment whenever events or changes in circumstances indicate that the carrying amount may not be recoverable. Assets are determined to be impaired if a forecast of undiscounted estimated future net operating cash flows directly related to the asset, including any disposal value, is less than the carrying amount of the asset. If any asset is determined to be impaired, the loss is measured as the amount by which the carrying amount of the asset exceeds its fair value. An estimate of fair value is based on the best information available, including prices for similar assets and discounted cash flow.\n See \nNote 14\n for further discussion of other property and equipment.\nAssets Held for Sale \nWe may market certain non-core natural gas and oil assets or other properties for sale. At the end of each reporting period, we evaluate if these assets should be classified as held for sale. The held for sale criteria includes the following: management commits to a plan to sell, the asset is available for immediate sale, an active program to locate a buyer exists, the sale of the asset is probable and expected to be completed within a year, the asset is actively being marketed for sale and that it is unlikely that significant changes to the plan will be made. If each of the criteria are met, then the assets and associated liabilities are classified as held for sale. Additionally, once assets are classified as held for sale, we cease depreciation on those related assets.\nCapitalized Interest\nInterest from external borrowings is capitalized on significant investments in major development projects until the asset is ready for service using the weighted average borrowing rate of outstanding borrowings. Capitalized interest is determined by multiplying our weighted average borrowing cost on debt by the average amount of qualifying costs incurred. Capitalized interest is depreciated over the useful lives of the assets in the same manner as the depreciation of the underlying asset.\nAccounts Payable\nIncluded in accounts payable as of December 31, 2024 are liabilities of approximately $\n64\n million, representing the amount by which checks issued, but not yet presented to our banks for collection, exceeded balances in applicable bank accounts.\nDebt Issuance Costs\nCosts associated with the arrangement of our credit facility are included in other long-term assets and are amortized over the life of the facility using the straight-line method. As of December 31, 2024, these costs were $\n17\n million. Costs associated with the issuance of the senior notes are included in long-term debt and the remaining unamortized issuance costs are amortized over the life of the senior notes using the straight-line method. Unamortized issuance costs associated with our senior notes as of December 31, 2024 totaled $\n10\n million.\n \n81\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nLitigation Contingencies\nWe are subject to litigation and regulatory proceedings, claims and liabilities that arise in the ordinary course of business. We accrue losses associated with litigation and regulatory claims when such losses are probable and reasonably estimable. If we determine that a loss is probable and cannot estimate a specific amount for that loss but can estimate a range of loss, our best estimate within the range is accrued. Estimates are adjusted as additional information becomes available or circumstances change. We do not reduce these liabilities for potential insurance or third-party recoveries. If applicable, we accrue receivables for probable insurance or third-party recoveries. Legal defense costs associated with loss contingencies are expensed in the period incurred.\n See \nNote \n5\n for further discussion of litigation contingencies.\nEnvironmental Remediation Costs\nWe record environmental reserves for estimated remediation costs related to existing conditions from past operations when the responsibility to remediate is probable and the costs can be reasonably estimated. Expenditures that create future benefits or contribute to future revenue generation are capitalized.\n See \nNote \n5\n for discussion of environmental contingencies.\nAsset Retirement Obligations\nWe recognize liabilities for obligations associated with the retirement of tangible long-lived assets that result from the acquisition, construction and development of the assets. We recognize the fair value of a liability for a retirement obligation in the period in which the liability is incurred. For natural gas and oil properties, this is the period in which a natural gas or oil well is acquired or drilled. The liability is then accreted each period until the liability is settled or the well is sold, at which time the liability is removed. The related asset retirement cost is capitalized as part of the carrying amount of our natural gas and oil properties.\n See \nNote 16\n for further discussion of asset retirement obligations.\nRevenue Recognition\nRevenue from the sale of natural gas, oil and NGL is recognized upon the transfer of control of the products, which is typically when the products are delivered to customers. Revenue is recognized net of royalties due to third parties in an amount that reflects the consideration we expect to receive in exchange for those products. We follow the sales method of accounting for our natural gas revenue whereby we recognize sales revenue on all natural gas sold to our purchasers, regardless of whether the sales are proportionate to our ownership in the property.\nRevenue from contracts with customers includes the sale of our natural gas, oil and NGL production (recorded as natural gas, oil and NGL revenues in the consolidated statements of operations) as well as the sale of certain of our joint interest holders’ production which we purchase under joint operating arrangements (recorded in marketing revenues in the consolidated statements of operations). In connection with the marketing of these products, we obtain control of the natural gas, oil and NGL we purchase from other interest owners at defined delivery points and deliver the product to third parties, at which time revenues are recorded.\n See \nNote \n8\n for a presentation of the disaggregation of revenue. \nPayment terms and conditions vary by contract type, although terms generally include a requirement of payment within 30 to 60 days.\n There are no significant judgments that significantly affect the amount or timing of revenue from contracts with customers.\nWe also generate revenue from other sources, including from a variety of derivative and hedging activities to reduce our exposure to fluctuations in future commodity prices and to protect our expected operating cash flow against significant market movements or volatility, as well as a variety of natural gas, oil and NGL purchase and sale contracts with third parties for various commercial purposes, including credit risk mitigation and satisfaction of our pipeline delivery commitments (recorded within marketing revenues in the consolidated statements of operations). In circumstances where we act as an agent rather than a principal, our results of operations related to natural gas, oil and NGL marketing activities are presented on a net basis.\n82\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nFair Value Measurements\nCertain financial instruments are reported on a recurring basis at fair value on our consolidated balance sheets. We also use fair value measurements on a nonrecurring basis when a qualitative assessment of our assets indicates a potential impairment. Under fair value measurement accounting guidance, fair value is defined as the amount that would be received from the sale of an asset or paid for the transfer of a liability in an orderly transaction between market participants (i.e., an exit price). To estimate an exit price, a three-level hierarchy is used. The fair value hierarchy prioritizes the inputs, which refer broadly to assumptions market participants would use in pricing an asset or a liability, into three levels. Level 1 inputs are unadjusted quoted prices in active markets for identical assets and liabilities and have the highest priority. Level 2 inputs are inputs other than quoted prices within Level 1 that are observable for the asset or liability, either directly or indirectly. Level 3 inputs are unobservable inputs for the asset or liability and have the lowest priority.\n The valuation techniques that may be used to measure fair value include a market approach, an income approach and a cost approach. A market approach uses prices and other relevant information generated by market transactions involving identical or comparable assets or liabilities. An income approach uses valuation techniques to convert future amounts to a single present amount based on current market expectations, including present value techniques, option-pricing models and the excess earnings method. The cost approach is based on the amount that currently would be required to replace the service capacity of an asset (replacement cost).\nThe carrying values of financial instruments comprising cash and cash equivalents, accounts payable and accounts receivable approximate fair values due to the short-term maturities of these instruments.\n See Notes \n4\n and \n1\n3\n for further discussion of fair value measurements.\nDerivatives\nDerivative instruments are recorded at fair value, and changes in fair value are recognized currently in earnings unless specific hedge accounting criteria are followed. As of December 31, 2024, \nnone\n of our open derivative instruments were designated as cash flow hedges.\nDerivative instruments reflected as current in the consolidated balance sheets represent the estimated fair value of derivatives scheduled to settle over the next 12 months based on market prices/rates as of the respective balance sheet dates. Cash settlements of our derivative instruments are generally classified as operating cash flows unless the derivatives are deemed to contain, for accounting purposes, a significant financing element at contract inception, in which case these cash settlements are classified as financing cash flows in the accompanying consolidated statements of cash flows. All of our commodity derivative instruments are subject to master netting arrangements by contract type which provide for the offsetting of asset and liability positions within each contract type, as well as related cash collateral if applicable, by counterparty. Therefore, we net the value of our derivative instruments by contract type with the same counterparty in the accompanying consolidated balance sheets.\nWe have established the fair value of our derivative instruments using established index prices, volatility curves and discount factors. These estimates are compared to our counterparty values for reasonableness. The values we report in our financial statements are as of a point in time and subsequently change as these estimates are revised to reflect actual results, changes in market conditions and other factors. Derivative transactions are subject to the risk that counterparties will be unable to meet their obligations. This non-performance risk is considered in the valuation of our derivative instruments, but to date has not had a material impact on the values of our derivatives.\n See \nNote 1\n3\n for further discussion of our derivative instruments.\n83\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nIncome Taxes\nWe are subject to current income taxes assessed by the federal and various state jurisdictions in the U.S. and account for current income taxes based on amounts paid or estimated to be payable net of amounts refunded or estimated to be refunded. Additionally, we account for deferred income taxes using the asset and liability method of accounting for income taxes. Under this method, deferred tax assets and liabilities are recorded for the estimated future tax consequences attributable to the differences between the financial carrying amounts of existing assets and liabilities and their respective tax basis. Deferred tax assets and liabilities are measured using the tax rate expected to be in effect for the year in which those temporary differences are expected to reverse. The effect of a change in tax rates on deferred tax assets and liabilities is recognized in the year of the enacted rate change. Deferred income taxes are provided to recognize the income tax effect of reporting certain transactions in different years for income tax and financial reporting purposes. A valuation allowance for deferred tax assets, including net operating losses, is recognized when it is more likely than not that some or all of the benefit from the deferred tax assets will not be realized.\nWe are required to make judgments, including estimating reserves for potential adverse outcomes regarding tax positions that we have taken. We account for uncertainty in income taxes using a recognition and measurement threshold for tax positions taken or expected to be taken in a tax return. The tax benefit from an uncertain tax position is recognized when it is more likely than not that the position will be sustained upon examination by taxing authorities based on technical merits of the position. The amount of the tax benefit recognized is the largest amount of the benefit that has a greater than 50 percent likelihood of being realized upon ultimate settlement. The effective tax rate and the tax basis of assets and liabilities reflect management’s estimates of the ultimate outcome of various tax uncertainties. We recognize accrued interest related to uncertain tax positions in interest expense and accrued penalties related to such positions in general and administrative expense in the consolidated statements of operations. See \nNote 9\n for further discussion of income taxes.\nShare-Based Compensation\nOur share-based compensation program consists of restricted stock units and performance share units granted to employees and restricted stock units granted to non-employee directors under our Long Term Incentive Plan. We recognize the cost of services received in exchange for restricted stock units based on the fair value of the equity instruments as of the grant date. This value is amortized over the vesting period, which is generally \nthree years\n from the grant date. Forfeitures on our share-based compensation awards are recognized as they occur. Because performance share units are settled in shares, they are classified as equity and are measured at fair value as of the grant date.\nTo the extent compensation expense relates to employees directly involved in the acquisition of natural gas and oil leasehold and development activities, these amounts are capitalized to natural gas and oil properties. Amounts not capitalized to natural gas and oil properties are generally recognized as general and administrative expense, production expense, or exploration expense, based on the employees involved in those activities.\n See \nNote 1\n1\n for further discussion of share-based compensation.\nRecently Issued Accounting Standards\nIn November 2024, the FASB issued ASU 2024-03, \nIncome Statement – Reporting Comprehensive Income – Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses\n. ASU 2024-03 expands disclosures about specific costs and expenses presented on the face of the income statement. This ASU is effective for annual reporting periods beginning after December 15, 2026 and for interim reporting periods within annual reporting periods beginning after December 15, 2027, with early adoption permitted. We are evaluating the impact this ASU will have on our disclosures.\nIn December 2023, the FASB issued ASU 2023-09, \nIncome Taxes (Topic 740): Improvements to Income Tax Disclosures\n. ASU 2023-09 intends to provide investors with additional information about an entity’s income taxes by requiring disclosure of items such as disaggregation of the effective tax rate reconciliation as well as information regarding income taxes paid. This ASU is effective for annual reporting periods beginning after December 15, 2024, with early adoption permitted for annual financial statements that have not yet been issued or made available for issuance. We are evaluating the impact this ASU will have on our disclosures.\n84\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nIn November 2023, the FASB issued ASU 2023-07, \nSegment Reporting (Topic 280): Improvements to Reportable Segments Disclosures\n. Under ASU 2023-07, the scope and frequency of segment disclosures is increased to provide investors with additional detail about information utilized by an entity’s CODM, including information about significant segment expenses. This ASU is effective beginning with this annual report on Form 10-K and interim periods beginning in 2025. See \nNote 18\n for further discussion on our segment reporting.\n2.\nNatural Gas and Oil Property Transactions\nSouthwestern Merger\nOn January 10, 2024, Chesapeake and Southwestern entered into an all-stock agreement and plan of merger (the “Merger Agreement”). Southwestern was an independent energy company engaged in development, exploration and production activities, including related marketing activities, within its operating areas in the Appalachia and Haynesville shale plays. Our Board of Directors and the Board of Directors of Southwestern both approved the Merger Agreement. At separate special meetings each held on June 18, 2024, Chesapeake’s stockholders approved the issuance of Chesapeake’s common stock to the stockholders of Southwestern in connection with the Southwestern Merger, and Southwestern’s stockholders approved the Merger Agreement. \nOn October 1, 2024, the Southwestern Merger was completed, and we issued approximately \n95.7\n million shares of our common stock to Southwestern’s shareholders in connection with the Merger Agreement. Under the terms of the Merger Agreement, subject to certain exceptions, each share of Southwestern common stock was converted into the right to receive \n0.0867\n of a share of the Company’s common stock. Based on the closing price of our common stock, the total value of the shares of our common stock issued to Southwestern’s shareholders was approximately $\n7.9\n billion. During 2024, we recognized approximately $\n312\n million of costs related to the Southwestern Merger, which included $\n148\n million related to employee expenses and the remainder of the costs relating to transaction fees, consulting and legal fees and other fees related to the transaction. These acquisition-related costs are included within other operating expense, net within our consolidated statements of operations. The Southwestern Merger was structured as a tax-free reorganization for United States federal income tax purposes.\nPreliminary Southwestern Merger Purchase Price Allocation\nWe have accounted for the Southwestern Merger as a business combination, using the acquisition method, with Expand Energy (formerly Chesapeake) treated as the accounting acquirer. \nThe following table represents the preliminary allocation of the total purchase price of Southwestern to the identifiable assets acquired and the liabilities assumed based on the fair values as of the acquisition date. Certain data necessary to complete the purchase price allocation is not yet available, and includes, but is not limited to, final tax returns that provide the underlying tax basis of Southwestern’s assets and liabilities and final appraisals of assets acquired and liabilities assumed. \nWe expect to complete the purchase price allocation during the 12-month period following the acquisition date, during which time the value of the assets and liabilities may be revised as appropriate.\n85\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nPreliminary Purchase Price Allocation\nConsideration:\nCash\n(a)\n$\n585\n \nFair value of Expand Energy common stock issued\n(b)\n7,871\n \nRestricted stock unit and performance stock unit replacement awards\n17\n \nTotal consideration\n$\n8,473\n \nFair Value of Assets Acquired:\nCash and cash equivalents and restricted cash\n$\n126\n \nOther current assets\n828\n \nProved natural gas and oil properties\n10,002\n \nUnproved properties\n4,270\n \nOther property and equipment\n128\n \nOther long-term assets\n496\n \nAmounts attributable to assets acquired\n$\n15,850\n \nFair Value of Liabilities Assumed:\nCurrent liabilities\n$\n1,955\n \nLong-term debt\n3,305\n \nDeferred tax liabilities\n479\n \nLong-term contract liabilities\n1,287\n \nOther long-term liabilities\n351\n \nAmounts attributable to liabilities assumed\n7,377\n \nTotal identifiable net assets\n$\n8,473\n \n____________________________________________\n(a)\nReflects the repayment of $\n585\n million outstanding on Southwestern's 2022 revolving credit facility including $\n2\n million of accrued interest and fees, as the facility was repaid and retired upon close of the Southwestern Merger.\n(b)\nThe fair value of our common stock is a Level 1 input, as our stock price is a quoted price in an active market as of the acquisition date.\nNatural Gas and Oil Properties\nFor the Southwestern Merger, we applied the business combination guidance, under which an acquirer should recognize the identifiable assets acquired and the liabilities assumed on the acquisition date at fair value. The fair value estimate of proved and unproved natural gas and oil properties as of the acquisition date was based on estimated natural gas and oil reserves and related future net cash flows discounted using a weighted average cost of capital, including estimates of future production rates and future development costs. We utilized NYMEX strip pricing adjusted for inflation to value the reserves. We then applied various discount rates depending on the classification of reserves and other risk characteristics. Management utilized the assistance of a third-party valuation expert to estimate the value of the natural gas and oil properties acquired. Additionally, the fair value estimate of proved and unproved natural gas and oil properties was corroborated by utilizing a market approach, which considers recent comparable transactions for similar assets.\nThe inputs used to value natural gas and oil properties require significant judgment and estimates made by management and represent Level 3 inputs.\n86\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nAs part of the Southwestern Merger, we assumed gathering, processing and transportation contracts, certain of which were deemed to be above or below current market rates. We recognized assets and liabilities for the difference in the contractual and market rates of these contracts, as of the date of the Merger. The terms of the contracts extend through 2035.\nSouthwestern Merger Revenues and Expenses Subsequent to Acquisition\nWe included in our consolidated statements of operations natural gas, oil and NGL revenues of \n$\n1,021\n million\n, marketing revenues of \n$\n482\n million\n, net losses on natural gas, oil and NGL derivatives of \n$\n34\n million\n, and direct operating expenses of \n$\n1,384\n million\n, including depreciation, depletion and amortization, and net earnings of \n$\n36\n million\n, related to the Southwestern Merger businesses for the period from October 1, 2024 through December 31, 2024.\nMarcellus Acquisition\nOn March 9, 2022, we completed the acquisition of Chief and associated non-operated interests held by affiliates of Tug Hill, of premium drilling locations in the Marcellus Shale in Northeast Pennsylvania (“Marcellus Acquisition”) for total consideration of approximately $\n2.77\n billion, consisting of approximately $\n2\n billion in cash, including working capital adjustments and approximately \n9.4\n million shares of our common stock, to acquire high quality producing assets and a deep inventory of premium drilling locations in the prolific Marcellus Shale in Northeast Pennsylvania. The Marcellus Acquisition was indebtedness free, effective as of January 1, 2022 and was subject to customary purchase price adjustments. We funded the cash portion of the consideration with cash on hand and $\n914\n million of borrowings under the Company’s Exit Credit Facility. \nDuring 2022, we recognized approximately $\n41\n million of costs related to our Marcellus Acquisition, which included integration costs, consulting fees, financial advisory fees, legal fees and change in control expense in accordance with Chief’s existing employment agreements. These acquisition-related costs are included within other operating expense, net within our consolidated statements of operations.\n87\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nMarcellus Acquisition Purchase Price Allocation\nWe have accounted for the Marcellus Acquisition as a business combination, using the acquisition method. The following table represents the allocation of the total purchase price to the identifiable assets acquired and the liabilities assumed based on the fair values as of the acquisition date.\n \nPurchase Price Allocation\nConsideration:\nCash\n$\n2,000\n \nFair value of common stock issued in the merger \n(a)\n764\n \nWorking capital adjustments\n6\n \nTotal consideration\n$\n2,770\n \nFair Value of Liabilities Assumed:\nCurrent liabilities\n$\n459\n \nOther long-term liabilities\n129\n \nAmounts attributable to liabilities assumed\n$\n588\n \nFair Value of Assets Acquired:\nCash, cash equivalents and restricted cash\n$\n39\n \nOther current assets\n218\n \nProved natural gas and oil properties\n2,309\n \nUnproved properties\n788\n \nOther property and equipment\n1\n \nOther long-term assets\n3\n \nAmounts attributable to assets acquired\n$\n3,358\n \nTotal identifiable net assets\n$\n2,770\n \n____________________________________________\n(a)\nThe fair value of our common stock is a Level 1 input, as our stock price is a quoted price in an active market as of the acquisition date.\n \nNatural Gas and Oil Properties\n For the Marcellus Acquisition, we applied the business combination guidance, under which an acquirer should recognize the identifiable assets acquired and the liabilities assumed on the acquisition date at fair value. The fair value estimate of proved and unproved natural gas and oil properties as of the acquisition date was based on estimated natural gas and oil reserves and related future net cash flows discounted using a weighted average cost of capital, including estimates of future production rates and future development costs. We utilized NYMEX strip pricing adjusted for inflation to value the reserves. We then applied various discount rates depending on the classification of reserves and other risk characteristics. Management utilized the assistance of a third-party valuation expert to estimate the value of the natural gas and oil properties acquired. Additionally, the fair value estimate of proved and unproved natural gas and oil properties was corroborated by utilizing a market approach, which considers recent comparable transactions for similar assets.\nThe inputs used to value natural gas and oil properties require significant judgment and estimates made by management and represent Level 3 inputs.\nMarcellus Acquisition Revenues and Expenses Subsequent to Acquisition\nWe included in our consolidated statements of operations natural gas, oil and NGL revenues of $\n1,331\n million, marketing revenues of $\n20\n million, net losses on natural gas, oil and NGL derivatives of $\n379\n million, and direct operating expenses of $\n483\n million, including depreciation, depletion and amortization, and net earnings of \n88\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n$\n381\n million, related to the Marcellus Acquisition businesses for the period from March 10, 2022 (the date immediately following the completion of the Marcellus Acquisition) through December 31, 2022.\nCombined Pro Forma Financial Information\nThe following unaudited pro forma financial information is based on our historical consolidated financial statements adjusted to reflect as if the Southwestern Merger and the divestiture of our Eagle Ford assets had each occurred on January 1, 2023. \nThe information below reflects pro forma adjustments based on available information and certain assumptions that we believe are reasonable, including the estimated tax impact of the pro forma adjustments.\nYears Ended December 31,\n2024\n2023\nRevenues\n$\n8,193\n \n$\n14,247\n \nNet income (loss) available to common stockholders\n$\n(\n607\n)\n$\n3,852\n \nEarnings (loss) per common share:\nBasic\n$\n(\n2.65\n)\n$\n16.86\n \nDiluted\n$\n(\n2.65\n)\n$\n16.14\n \nEagle Ford Divestitures\nIn January 2023, we entered into an agreement to sell a portion of our Eagle Ford assets to WildFire Energy I LLC for approximately $\n1.425\n billion, subject to customary post-closing adjustments. Approximately $\n225\n million of the purchase price was recorded as deferred consideration and treated as a non-interest-bearing note to be paid in installments of $\n60\n million per year for the first three years following the transaction close date, with $\n45\n million to be paid in the fourth year following the transaction close date. During 2024, we received the first installment payment related to this transaction. The deferred consideration is recorded at fair value with an imputed rate of interest as a Level 2 input, and approximately $\n59\n million and $\n58\n million of the deferred consideration is reflected within other current assets and approximately $\n89\n million and $\n135\n million is reflected within other long-term assets on the consolidated balance sheets as of December 31, 2024 and December 31, 2023, respectively. The divestiture, which closed on March 20, 2023 (with an effective date of October 1, 2022), resulted in a gain of approximately $\n337\n million, inclusive of post-closing adjustments, based on the difference between the carrying value of the assets and consideration received.\n In February 2023, we entered into an agreement to sell a portion of our remaining Eagle Ford assets to INEOS Upstream Holdings Limited (“INEOS Energy”) for approximately $\n1.4\n billion, subject to customary post-closing adjustments. Approximately $\n225\n million of the purchase price was recorded as deferred consideration and treated as a non-interest-bearing note to be paid in installments of approximately $\n56\n million per year for \nfour years\n following the transaction close date. During 2024, we received the first installment payment related to this transaction. The deferred consideration is recorded at fair value with an imputed rate of interest as a Level 2 input, and approximately $\n55\n million and $\n55\n million of the deferred consideration is reflected within other current assets and approximately $\n99\n million and $\n144\n million is reflected within other long-term assets on the consolidated balance sheets as of December 31, 2024 and December 31, 2023, respectively. The divestiture, which closed on April 28, 2023 (with an effective date of October 1, 2022), resulted in a gain of approximately $\n470\n million, based on the difference between the carrying value of the assets and consideration received. Included within the liabilities assumed by INEOS Energy was approximately $\n53\n million of asset retirement obligations.\nIn August 2023, we entered into an agreement to sell the final portion of our remaining Eagle Ford assets to SilverBow Resources, Inc. (“SilverBow”) for approximately $\n700\n million, subject to customary post-closing adjustments. Approximately $\n50\n million of the purchase price was recorded as deferred consideration and treated as a non-interest-bearing note to be paid one year from the closing date. The deferred consideration is recorded at fair value with an imputed rate of interest as a Level 2 input, and approximately $\n46\n million of the deferred consideration is reflected within other current assets on the consolidated balance sheets as of December 31, 2023. During 2024, we received the deferred consideration. Additionally, SilverBow agreed to pay us an additional contingent payment of $\n25\n million should WTI NYMEX prices average between $\n75\n and $\n80\n per barrel or $\n50\n million should WTI NYMEX prices average above $\n80\n per barrel during the year following the close of the \n89\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\ntransaction. On July 30, 2024, Crescent Energy Company (“Crescent”) acquired SilverBow. The fair value of the contingent consideration as of December 31, 2023 of $\n12\n million is reflected within short-term derivative assets within our consolidated balance sheets. See \nNote 1\n3\n for additional information. During 2024, we received the contingent payment of $\n25\n million from Crescent based upon the average NYMEX prices during the year following the close of the transaction. The divestiture, which closed on November 30, 2023 (with an effective date of February 1, 2023), resulted in a gain of approximately $\n140\n million, based on the difference between the carrying value of the assets and consideration received. Included within the liabilities assumed by SilverBow was approximately $\n11\n million of asset retirement obligations.\nDuring the years ended December 31, 2024 and 2023, we amortized approximately $\n31\n million and $\n24\n million related to the deferred consideration from the Eagle Ford divestiture transactions described above. The deferred consideration amortization is recorded within other income, net, in our consolidated statements of operations. \nPowder River Divestiture\nIn January 2022, we signed an agreement to sell our Powder River Basin assets in Wyoming to Continental Resources, Inc. for approximately $\n450\n million, subject to customary post-closing adjustments. The divestiture, which closed on March 25, 2022, resulted in the recognition of a gain of approximately $\n293\n million, which included $\n13\n million of post-close adjustments, based on the difference between the carrying value of the assets and the cash received.\n \n3.\nEarnings Per Share\nBasic earnings (loss) per common share is computed by dividing the net income (loss) available to common stockholders by the weighted average number of shares of common stock outstanding during the period. Diluted earnings (loss) per common share is calculated in the same manner but includes the impact of potentially dilutive securities utilizing the treasury stock method. Potentially dilutive securities consists of issuable shares related to warrants, unvested restricted stock units (“RSUs”), and unvested performance share units (“PSUs”).    \nThe reconciliations between basic and diluted earnings (loss) per share are as follows:\nYears Ended December 31,\n2024\n2023\n2022\nNumerator\nNet income (loss) available to common stockholders, basic and diluted\n$\n(\n714\n)\n$\n2,419\n \n$\n4,869\n \nDenominator (in thousands)\nWeighted average common shares outstanding, basic\n156,989\n \n132,840\n \n125,785\n \nEffect of potentially dilutive securities\nWarrants\n—\n \n9,750\n \n19,734\n \nRestricted stock units\n—\n \n338\n \n395\n \nPerformance share units\n—\n \n48\n \n47\n \nWeighted average common shares outstanding, diluted\n156,989\n \n142,976\n \n145,961\n \nEarnings per common share:\nBasic\n$\n(\n4.55\n)\n$\n18.21\n \n$\n38.71\n \nDiluted\n$\n(\n4.55\n)\n$\n16.92\n \n$\n33.36\n \nDuring the years ended December 31, 2024, 2023 and 2022, the diluted earnings per share calculation excludes the effect of \n308,646\n, \n777,369\n and \n789,458\n reserved shares of common stock and \n582,109\n, \n1,466,502\n and \n1,489,337\n reserved Class C Warrants related to the settlement of General Unsecured Claims associated with the Chapter 11 Cases, as all necessary conditions had not been met for such shares to be considered dilutive shares during the years ended December 31, 2024, 2023 and 2022, respectively. Additionally, the diluted loss per \n90\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nshare calculation during the year ended December 31, 2024 excludes the antidilutive effect of \n9,058,361\n Warrants, \n315,318\n RSUs and \n86,421\n PSUs.\n \n4.\nDebt\nOur long-term debt consisted of the following as of December 31, 2024 and 2023:\nDecember 31, 2024\nDecember 31, 2023\nCarrying Amount\nFair Value\n(a)\nCarrying Amount\nFair Value\n(a)\nCredit Facility\n$\n—\n \n$\n—\n \n$\n—\n \n$\n—\n \n4.95\n% senior notes due 2025\n(b)\n389\n \n389\n \n—\n \n—\n \n5.50\n% senior notes due 2026\n47\n \n47\n \n500\n \n496\n \n5.375\n% senior notes due 2029\n(b)\n700\n \n684\n \n—\n \n—\n \n5.875\n% senior notes due 2029\n500\n \n494\n \n500\n \n489\n \n6.75\n% senior notes due 2029\n950\n \n959\n \n950\n \n958\n \n5.375\n% senior notes due 2030\n(b)\n1,200\n \n1,174\n \n—\n \n—\n \n4.75\n% senior notes due 2032\n(b)\n1,150\n \n1,067\n \n—\n \n—\n \n5.70\n% senior notes due 2035\n(c)\n750\n \n734\n \n—\n \n—\n \nPremiums on senior notes, net\n4\n \n— \n83\n \n— \nDebt issuance costs\n(\n10\n)\n— \n(\n5\n)\n— \nTotal debt, net\n5,680\n \n5,548\n \n2,028\n \n1,943\n \nLess current maturities of long-term debt, net\n(\n389\n)\n(\n389\n)\n—\n \n—\n \nTotal long-term debt, net\n$\n5,291\n \n$\n5,159\n \n$\n2,028\n \n$\n1,943\n \n____________________________________________\n(a)\nThe carrying value of borrowings under our Credit Facility approximates fair value as the interest rates are based on prevailing market rates; therefore, they are a Level 1 fair value measurement. For all other debt, a market approach, based upon quotes from major financial institutions, which are Level 2 inputs, is used to measure the fair value.\n(b)\nOn October 1, 2024, we assumed the debt of Southwestern in connection with the Southwestern Merger, which primarily consisted of these senior notes. See \nNot\ne 2\n for additional discussion on the Southwestern Merger and further discussion of these senior notes below.\n(c)\nOn December 2, 2024, we issued $\n750\n million of \n5.70\n% senior notes. See further discussion below.\nThe table below presents debt maturities as of December 31, 2024, excluding debt issuance costs, discounts and premiums:\nTotal\n2025\n$\n389\n \n2026\n47\n \n2027\n—\n \n2028\n—\n \n2029\n2,150\n \nThereafter\n3,100\n \nTotal debt\n$\n5,686\n \n91\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nCredit Facility. \nIn December 2022, we entered into a senior secured reserve-based credit agreement, as amended pursuant to the Amendment No. 1 and Borrowing Base Agreement, dated April 29, 2024 (the “Initial Credit Agreement Amendment”) and as automatically amended on October 28, 2024 by the Investment Grade Credit Agreement Amendment (as defined below), with the lenders and issuing banks party thereto from time to time (the “Lenders”), and JPMorgan Chase Bank, N.A., as administrative agent and collateral agent (in such capacity, the “Administrative Agent”) (such credit agreement as amended by the Initial Credit Agreement Amendment, the “Pre-IG Credit Agreement”, and as further amended by the Investment Grade Credit Agreement Amendment, the “Credit Agreement”), providing for a revolving credit facility (such facility as amended pursuant to the Initial Credit Agreement Amendment, the “Pre-IG Credit Facility”, and as further amended pursuant to the Investment Grade Credit Agreement Amendment, the “Credit Facility”) maturing in December 2027. The Initial Credit Agreement Amendment, among other things, increased the aggregate commitments under the Pre-IG Credit Facility from $\n2.0\n billion to $\n2.5\n billion and increased the sublimit available for the issuance of letters of credit from $\n200\n million to $\n500\n million. The Credit Facility continues to provide for a $\n50\n million sublimit available for swingline loans. As of December 31, 2024, we had approximately $\n2.5\n billion available for borrowings under the Credit Facility. \nThe obligations under the Pre-IG Credit Facility were guaranteed by certain of Expand Energy’s subsidiaries (the “Guarantors”), and the Pre-IG Credit Facility was secured by substantially all of the assets owned by the Company and the Guarantors (subject to customary exceptions), including mortgages on not less than \n85\n% of the total PV-9 of the borrowing base properties evaluated in the most recent reserve report (where PV-9 is the net present value, discounted at \n9\n% per annum, of the estimated future net revenues). Since the effectiveness of the Investment Grade Credit Agreement Amendment, the Credit Facility is no longer guaranteed or secured, or subject to a borrowing base.\nThe Pre-IG Credit Agreement contained restrictive covenants, subject to customary exceptions for reserve-based credit facilities, that limited Expand Energy and its subsidiaries’ ability to, among other things: (i) incur additional indebtedness, (ii) make investments, (iii) enter into mergers; (iv) make or declare dividends; (v) repurchase or redeem certain indebtedness; (vi) enter into certain hedges; (vii) incur liens; (viii) sell assets; and (ix) engage in certain transactions with affiliates. Since the effectiveness of the Investment Grade Credit Agreement Amendment on October 28, 2024, the Credit Agreement contains restrictive covenants that, subject to exceptions customary to investment grade credit facilities, limit Expand Energy and its subsidiaries’ ability to, among other things: (i) incur priority indebtedness, (ii) enter into mergers; (iii) make or declare dividends; (iv) incur liens; (v) sell all or substantially all of their assets; and (vi) engage in certain transactions with affiliates. The Pre-IG Credit Agreement required Expand Energy to maintain compliance with the following financial ratios: (A) a current ratio, which was the ratio of Expand Energy’s and its restricted subsidiaries’ consolidated current assets (including unused commitments under the Pre-IG Credit Facility but excluding certain non-cash assets) to their consolidated current liabilities (excluding the current portion of long-term debt and certain non-cash liabilities), of not less than \n1.00\n to 1.00; (B) a net leverage ratio, which was the ratio of total indebtedness (less unrestricted cash up to a specified threshold) to Consolidated EBITDAX (as defined in the Pre-IG Credit Agreement) for the prior four fiscal quarters, of not greater than \n3.50\n to 1.00 and (C) a PV-9 coverage ratio of the net present value, discounted at \n9\n% per annum, of the estimated future net revenues expected in the proved reserves to Expand Energy’s and its restricted subsidiaries’ total indebtedness of not less than \n1.50\n to 1.00. The Investment Grade Credit Agreement Amendment, among other things, (i) removed the current ratio, net leverage ratio and PV-9 coverage ratio previously contained in the Pre-IG Credit Agreement and (ii) provides for our compliance with an indebtedness to capitalization ratio, which is the ratio of the Company’s total indebtedness to the sum of total indebtedness plus stockholders’ equity (the “Debt to Capitalization Ratio”), not to exceed \n65\n%. As of December 31, 2024, we were in compliance with the Debt to Capitalization Ratio.\nBorrowings under the Credit Agreement may be alternate base rate loans or term SOFR loans, at our election. Interest is payable quarterly for alternate base rate loans and at the end of the applicable interest period for term SOFR loa\nns. Term SOFR loans bear interest at term SOFR plus an applicable rate ranging from \n125\n to \n187.5\n basis points per annum, depending on the Company’s unsecured debt ratings (which rate under the Pre-IG Credit Agreement previously ranged from \n175\n to \n275\n basis points per annum, depending on the percentage of the commitments utilized), plus an additional \n10\n basis points per annum credit spread adjustment. Alternate base rate loans bear interest at a rate per annum equal to the greatest of: (i) the prime rate; (ii) the federal funds effective rate plus \n50\n basis points; and (iii) the adjusted term SOFR rate for a one-month interest period plus \n100\n basis points, plus an applicable margin ranging from \n25\n to \n87.5\n basis points per annum, depending on the Company’s unsecured debt ratings (which applicable margin under the Pre-IG Credit Agreement previously ranged from \n75\n to \n175\n basis \n92\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\npoints per annum, depending on the percentage of the commitments utilized). Expand Energy also pays a commitment fee on unused commitment amounts under the Credit Facility ranging from \n15\n to \n27.5\n basis points per annum, depending on the Company’s unsecured debt ratings (which commitment fee rate under the Pre-IG Credit Agreement previously ranged from \n37.5\n to \n50\n basis points per annum, depending on the percentage of the commitments utilized). \nThe Credit Facility is subject to customary events of default, remedies, and cure rights for investment grade credit facilities of this nature.\nInvestment Grade Rating.\nOn October 1, 2024, we received an investment grade rating from S&P Global Ratings (“S&P”). S&P assigned an issuer-level rating of ‘BBB-’ on our unsecured debt and raised our issuer credit rating to ‘BBB-’, with a stable outlook. Additionally, on October 2, 2024, we received an investment grade rating from Fitch Ratings (“Fitch”). Fitch affirmed our revolver credit rating at ‘BBB-’ and upgraded the rating on our senior notes to ‘BBB-’, with a stable outlook. As a result of these investment grade ratings and the satisfaction of certain other conditions, (i) the Pre-IG Credit Agreement was automatically amended in its entirety as set forth in an exhibit to the Pre-IG Credit Agreement (such automatic amendment, the “Investment Grade Credit Agreement Amendment”, and the Pre-IG Credit Agreement as amended by such amendment, the “Credit Agreement”), (ii) all liens and guarantees previously provided by the Company and its subsidiaries in connection with the Pre-IG Credit Agreement were released and (iii) all guarantees previously provided in connection with the Company’s senior notes were released. Such Investment Grade Credit Agreement Amendment, among other things, removed the application of the borrowing base provided for in the Pre-IG Credit Agreement and modified the pricing and covenants as described above.\nAssumption of Southwestern’s Senior Notes and Southwestern Credit Facility Extinguishment.\nOn October 1, 2024, the Southwestern Merger was completed, and we became the successor issuer in respect to Southwestern’s (i) $\n389\n million aggregate principal amount of \n4.950\n% Senior Notes due 2025 (the “SWN 2025 Notes”), (ii) $\n304\n million aggregate principal amount of \n8.375\n% Senior Notes due 2028 (the “SWN 2028 Notes”), (iii) $\n700\n million aggregate principal amount of \n5.375\n% Senior Notes due 2029 (the “SWN 2029 Notes”), (iv) $\n1,200\n million aggregate principal amount of \n5.375\n% Senior Notes due 2030 (the “SWN 2030 Notes”) and (v) $\n1,150\n million aggregate principal amount of \n4.750\n% Senior Notes due 2032 (the “SWN 2032 Notes” and together with the SWN 2025 Notes, the SWN 2028 Notes, the SWN 2029 Notes and the SWN 2030 Notes, the “SWN Notes”). We assumed the obligations under (i) the SWN 2025 Notes pursuant to Supplemental Indenture No. 9 (“SWN 2025 Notes Supplemental Indenture No. 9”) to a base indenture dated January 23, 2015, by and among Southwestern and U.S. Bank National Association, as Trustee, (ii) the SWN 2028 Notes pursuant to Supplemental Indenture No. 9 (“SWN 2028 Notes Supplemental Indenture No. 9”) to a base indenture dated September 25, 2017, by and among Southwestern and U.S. Bank National Association, as Trustee, (iii) the SWN 2029 Notes pursuant to Supplemental Indenture No. 6 (“Supplemental Indenture No. 6”) to a base indenture dated August 30, 2021 (the “2021 Base Indenture”) by and among Southwestern and Regions Bank, as Trustee, (iv) the 2030 Notes pursuant to Supplemental Indenture No. 7 (“Supplemental Indenture No. 7”) to the 2021 Base Indenture and (v) the 2032 Notes pursuant to Supplemental Indenture No. 8 (“Supplemental Indenture No. 8” and, together with SWN 2025 Notes Supplemental Indenture No. 9, SWN 2028 Notes Supplemental Indenture No. 9, Supplemental Indenture No. 6 and Supplemental Indenture No. 7, the “SWN Supplemental Indentures”) to the 2021 Base Indenture. In addition, pursuant to each SWN Supplemental Indenture, existing subsidiaries of the Company that guarantee our notes provided guarantees of the SWN Notes. As a result of the investment grade ratings we received on October 1 and October 2, 2024, and the satisfaction of certain other conditions, all guarantees previously provided in connection with the Company’s outstanding senior notes, including the SWN Notes, were released.\nThe SWN 2025 Notes matured on January 23, 2025 and bore interest at a rate of \n4.950\n% per annum, with interest that was payable on January 23 and July 23 of each year. The SWN 2029 Notes mature on February 1, 2029 and bear interest at a rate of \n5.375\n% per annum, with interest payable on February 1 and August 1 of each year. The SWN 2030 Notes mature on March 15, 2030 and bear interest at a rate of \n5.375\n% per annum, with interest payable on March 15 and September 15 of each year. The SWN 2032 Notes mature on February 1, 2032 and bear interest at a rate of \n4.750\n% per annum, with interest payable on February 1 and August 1 of each year.\n93\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n On October 1, 2024, Southwestern’s existing credit facility was terminated, with all loan amounts and other obligations outstanding thereunder repaid in full and all commitments thereunder extinguished, for approximately $\n585\n million, which included all outstanding borrowings, accrued interest and transaction fees.\nIssuance of \n5.70\n% Senior Notes\nOn December 2, 2024, we completed our underwritten public offering of $\n750\n million aggregate principal amount of our \n5.70\n% Senior Notes due 2035 (the “2035 Notes”). The 2035 Notes were issued pursuant to the Indenture (the “Base Indenture”), dated as of December 2, 2024, between the Company and Regions Bank (the “Trustee”), as trustee, as supplemented by the First Supplemental Indenture, dated as of December 2, 2024 (the “First Supplemental Indenture” and, together with the Base Indenture, the “Indenture”), between the Company and the Trustee, setting forth specific terms applicable to the 2035 Notes.\nThe 2035 Notes are the Company’s senior unsecured obligations and rank equally in right to payment of the holders of the Company’s other current and future unsecured senior debt, including debt under the Company’s revolving credit facility and the Company’s existing senior notes, and senior in right of payment to any future subordinated debt that the Company may incur. The 2035 Notes are not guaranteed by any of the Company’s subsidiaries and are therefore structurally subordinated to any indebtedness incurred by any of the Company’s subsidiaries.\nThe 2035 Notes mature on January 15, 2035 and interest on the 2035 Notes is payable semi-annually, on January 15 and July 15 of each year to holders of record on the immediately preceding January 1 and July 1. The first interest payment date will commence on July 15, 2025 to holders of record on July 1, 2025.\nOutstanding Senior Notes. \nOn October 28, 2024, the Company satisfied the “Investment Grade Date” conditions set forth under the Credit Facility (the “Investment Grade Date Event”) and, as a result, entered into supplemental indentures pursuant to which each subsidiary guarantor party thereto was released of all of its obligations under its guarantee of the Company’s obligations under the indenture, dated as of February 5, 2021, among the Issuer, the guarantor party thereto and Deutsche Bank Trust Company Americas, as trustee, that issued the $\n500\n million aggregate principal amount of \n5.50\n% Senior Notes due 2026 (“the 2026 Notes”) and the $\n500\n million aggregate principal amount of \n5.875\n% Senior Notes due 2029 (the “2029 Notes”). Additionally, as a result of receiving such investment grade rating, pursuant to the indenture governing the 2026 Notes and the 2029 Notes, certain restrictive covenants under such indentures are no longer in effect upon the Company.\nInterest on the 2026 Notes and 2029 Notes is payable semi-annually, on February 1 and August 1 of each year to holders of record on the immediately preceding January 15 and July 15.\nThe Company and certain of its subsidiaries previously agreed to guarantee such obligations under the indenture dated April 7, 2021 with Wilmington Trust, National Association, as Trustee (the “Vine Indenture”) under which the Company assumed the obligations under Vine’s $\n950\n million aggregate principal amount of \n6.75\n% Senior Notes due 2029 (the “Vine Notes”). Additionally, certain subsidiaries of Vine entered into a supplemental indenture to the Company’s existing indenture, dated February 5, 2021, with Deutsche Bank Trust Company Americas as trustee (the “CHK Indenture”), pursuant to which such subsidiaries of Vine have agreed to guarantee obligations under the CHK Indenture. On October 28, 2024, in connection with the Investment Grade Date Event, the Company entered into a supplemental indenture to the CHK Indenture pursuant to which each subsidiary guarantor party thereto was released of all its obligations under its guarantee of the Company’s obligations under the CHK Indenture. \nInterest on the Vine Notes is payable semi-annually, on April 15 and October 15 of each year to holders of record on the immediately preceding April 1 and October 1.\nIn connection with the completion of the Southwestern Merger, on October 1, 2024, the Company entered into (i) Supplemental Indenture No. 3 to the Indenture dated February 5, 2021, by and among Chesapeake Escrow LLC, as issuer, the guarantors signatory thereto and Deutsche Bank Trust Company, as Trustee governing the 2026 Notes and 2029 Notes and (ii) Supplemental Indenture No. 5 to the Indenture dated April 7, 2021, by and among Vine Energy Holdings LLC, the guarantors signatory thereto and Wilmington Trust, National Association, as Trustee governing the Company’s existing \n6.75\n% Senior Notes due 2029 (the “Vine Notes” and together with the 2026 Notes and the 2029 Notes, the “Existing Notes”), in each case to add as guarantors of the Existing Notes, the subsidiaries of Southwestern that guarantee SWN Notes that are described above. As discussed above, on October \n94\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n28, 2024, each Southwestern subsidiary guarantor was released of all its obligations under its guarantee of the Company’s obligations under each of the indentures governing the Existing Notes in connection with the Investment Grade Date Event.\nThe Credit Facility, the SWN Notes and the Existing Notes are the Company’s senior unsecured obligations. Accordingly, they rank (i) equal in right of payment to all existing and future senior unsecured indebtedness, (ii) effectively subordinate in right of payment to all existing and future secured indebtedness, to the extent of the value of the collateral securing such indebtedness, (iii) structurally subordinate in right of payment to all existing and future indebtedness and other liabilities of any future subsidiaries that do not guarantee the Credit Facility, the SWN Notes and/or Existing Notes and any entity that is not a subsidiary that does not guarantee the Credit Facility, the SWN Notes and/or Existing Notes and (iv) senior in right of payment to all future subordinated indebtedness. \nThe Company had \nno\n secured debt as of December 31, 2024.\nTender Offer and Early Redemption of Senior Notes\nDuring the fourth quarter of 2024, we announced an offer to purchase for cash, any and all of our outstanding 2026 Notes, the “Tender Offer”. Upon expiration of the Tender Offer, approximately \n91\n%, or $\n453\n million, of the 2026 Notes were validly tendered and not validly withdrawn. In a separate transaction during the fourth quarter of 2024, we redeemed all of the $\n304\n million aggregate principal of the SWN 2028 Notes for approximately $\n312\n million, which included an $\n8\n million premium to call the notes. We utilized the proceeds from the 2035 Notes to fund the Tender Offer for the 2026 Notes and the early redemption of the SWN 2028 Notes.\nSubsequent Event - Maturity and Repayment of the SWN 2025 Notes\nOn January 23, 2025, the $\n389\n million aggregate principal of SWN 2025 Notes was repaid and terminated with cash on hand and borrowings on the Credit Facility.\n95\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n5.\nContingencies and Commitments\nContingencies\nBusiness Operations and Litigation and Regulatory Proceedings\nWe are involved in, and expect to continue to be involved in, various lawsuits and disputes incidental to our business operations, including commercial disputes, personal injury claims, royalty claims, property damage claims and contract actions. We are also party to the consolidated Chapter 11 Cases pending for the Debtors in the Bankruptcy Court.\nOur total accrued liability in respect of litigation and regulatory proceedings is determined on a case-by-case basis and represents an estimate of probable losses after considering, among other factors, the progress of each case or proceeding, our experience and the experience of others in similar cases or proceedings, and the opinions and views of legal counsel. Significant judgment is required in making these estimates. While it is not possible at this time to estimate the amount of any additional loss, or range of loss that is reasonably possible, based on the nature of the claims, management believes that current litigation, claims and proceedings, individually or in aggregate and after taking into account insurance, are not likely to have a material adverse impact on our financial position, results of operations or cash flows. Many of these matters are in early stages and are all subject to inherent uncertainties. Therefore, management’s view may change in the future. If an unfavorable final outcome were to occur, there exists the possibility of our final liabilities being materially different.\nThe majority of Chesapeake’s pre-petition legal proceedings were settled during the Chapter 11 Cases or will be resolved in connection with the claims reconciliation process before the Bankruptcy Court, together with actions seeking to collect pre-petition indebtedness or to exercise control over the property of Chesapeake’s bankruptcy estates. Any allowed claim related to such litigation will be treated in accordance with the Plan. The Plan in the Chapter 11 Cases, which became effective on February 9, 2021, provided for the treatment of claims against Chesapeake’s bankruptcy estates, including pre-petition liabilities that had not been satisfied or addressed during the Chapter 11 Cases. Many of these proceedings were in early stages as of the Petition Date, and many of them sought damages and penalties, the amount of which is indeterminate. Any legal proceeding pending against Southwestern and assumed by us in connection with the Southwestern Merger is not subject to discharge or resolution as part of the Chapter 11 Cases.\nEnvironmental Contingencies\nThe nature of the natural gas and oil business carries with it certain environmental risks for us and our subsidiaries. We have implemented various policies, programs, procedures, training and audits to reduce and mitigate such environmental risks. We conduct periodic reviews, on a company-wide basis, to assess changes in our environmental risk profile. Environmental reserves are established for environmental liabilities for which economic losses are probable and reasonably estimable. We manage our exposure to environmental liabilities in acquisitions by using an evaluation process that seeks to identify pre-existing contamination or compliance concerns and address the potential liability. Depending on the extent of an identified environmental concern, we may, among other things, exclude a property from the transaction, require the seller to remediate the property to our satisfaction in an acquisition or agree to assume liability for the remediation of the property.\nOther Matters\nBased on management’s current assessment, we are of the opinion that no pending or threatened lawsuit or dispute relating to our business operations is likely to have a material adverse effect on our future consolidated financial position, results of operations or cash flows. The final resolution of such matters could exceed amounts accrued, however, and actual results could differ materially from management’s estimates.\n96\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nCommitments\nGathering, Processing and Transportation Agreements\nWe have contractual commitments with midstream service companies and pipeline carriers for future gathering, processing and transportation of natural gas, oil and NGL to move certain of our production to market. Working interest owners and royalty interest owners, where appropriate, will be responsible for their proportionate share of these costs. Commitments related to gathering, processing and transportation agreements are not recorded as obligations in the accompanying consolidated balance sheets.\nThe aggregate undiscounted commitments under our gathering, processing and transportation agreements, excluding any reimbursement from working interest and royalty interest owners, credits for third-party volumes or future costs under cost-of-service agreements, are presented below:\n \nDecember 31, 2024\n2025\n$\n1,377\n \n2026\n1,300\n \n2027\n1,189\n \n2028\n1,134\n \n2029\n943\n \nThereafter\n3,937\n \nTotal\n$\n9,880\n \nAs a result of the Southwestern Merger, during the year ended December 31, 2024, we acquired certain gathering, processing and transportation agreements from Southwestern and have reflected these agreements within the table above. In addition, we have long-term agreements for certain natural gas gathering and related services within specified acreage dedication areas in exchange for cost-of-service based fees redetermined annually, or tiered fees based on volumes delivered relative to scheduled volumes. Future gathering fees may vary with the applicable agreement.\nOther Commitments\nAs part of our normal course of business, we enter into various agreements providing, or otherwise arranging for, financial or performance assurances to third parties on behalf of our wholly owned guarantor subsidiaries. These agreements may include future payment obligations or commitments regarding operational performance that effectively guarantee our subsidiaries’ future performance.\nIn connection with acquisitions and divestitures, our purchase and sale agreements generally provide indemnification to the counterparty for liabilities incurred as a result of a breach of a representation or warranty by the indemnifying party and/or other specified matters. These indemnifications generally have a discrete term and are intended to protect the parties against risks that are difficult to predict or cannot be quantified at the time of entering into or consummating a particular transaction. For divestitures of natural gas and oil properties, our purchase and sale agreements may require the return of a portion of the proceeds we receive as a result of uncured title or environmental defects.\nWhile executing our strategic priorities, we have incurred certain cash charges, including contract termination charges, financing extinguishment costs and charges for unused natural gas transportation and gathering capacity.\n \n97\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n6.\nOther Liabilities\nOther current liabilities as of December 31, 2024 and 2023 are detailed below:\nDecember 31, 2024\nDecember 31, 2023\nRevenues and royalties due to others\n$\n734\n \n$\n360\n \nAccrued drilling and production costs\n296\n \n211\n \nContract liabilities\n284\n \n—\n \nAccrued compensation and benefits\n124\n \n64\n \nTaxes payable\n142\n \n84\n \nOperating leases\n71\n \n84\n \nJoint interest prepayments received\n13\n \n8\n \nAccrued hedging costs\n9\n \n2\n \nOther\n113\n \n34\n \nTotal other current liabilities\n$\n1,786\n \n$\n847\n \n \n7.\nLeases\nWe are a lessee under various agreements for drilling rigs, pressure pumping equipment, vehicles, office space, compressors, certain water transportation lines and other equipment under non-cancelable operating leases expiring through 2036. Certain of our lease agreements include options to renew the lease, terminate the lease early or purchase the underlying asset at the end of the lease. We determine the lease term at the lease commencement date as the non-cancelable period of the lease, including options to extend or terminate the lease when we are reasonably certain to exercise the option. The Company’s vehicles are the only leases with renewal options that we are reasonably certain to exercise. The renewals are reflected in the right of use (“ROU”) asset and lease liability balances.\nOn October 1, 2024, we completed the Southwestern Merger. As part of the purchase price allocation, we recognized additional operating lease liabilities of $\n134\n million and a related ROU asset of $\n134\n million related to drilling rigs, pressure pumping equipment, vehicles, office space, compressors, certain water transportation lines and other equipment. Regarding our drilling rigs and pressure pumping equipment, our policy is to treat both lease and non-lease components as a single lease component. See \nNote 2\n for additional information about the Southwestern Merger.\nOur operating ROU assets are included in \nother long-term assets\n while operating lease liabilities are included in other current and other long-term liabilities on the consolidated balance sheet.\nThe following table presents our ROU assets and lease liabilities as of December 31, 2024 and 2023. As of December 31, 2024 and 2023, we did not have any finance leases.\nOperating Leases\n \nDecember 31, 2024\nDecember 31, 2023\nROU assets\n$\n145\n \n$\n99\n \nLease liabilities:\nCurrent lease liabilities\n$\n71\n \n$\n84\n \nLong-term lease liabilities\n74\n \n15\n \nTotal lease liabilities, net\n$\n145\n \n$\n99\n \n98\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nAdditional information for the Company’s operating leases is presented below:\nYears Ended December 31,\n \n2024\n2023\n2022\nLease cost:\nOperating lease cost\n$\n88\n \n$\n107\n \n$\n51\n \nShort-term lease cost\n62\n \n40\n \n74\n \nTotal lease cost\n$\n150\n \n$\n147\n \n$\n125\n \nOther information:\nOperating cash outflows from operating leases\n$\n13\n \n$\n10\n \n$\n15\n \nInvesting cash outflows from operating leases\n$\n137\n \n$\n137\n \n$\n110\n \nDecember 31, 2024\nDecember 31, 2023\nWeighted average remaining lease term - operating leases\n3.03\n years\n1.24\n years\nWeighted average discount rate - operating leases\n5.99\n \n%\n7.02\n \n%\nMaturity analysis of operating lease liabilities is presented below: \nDecember 31, 2024\n2025\n$\n71\n \n2026\n37\n \n2027\n30\n \n2028\n14\n \n2029\n6\n \nThereafter\n1\n \nTotal lease payments\n159\n \nLess imputed interest\n(\n14\n)\nPresent value of lease liabilities\n145\n \nLess current maturities\n(\n71\n)\nPresent value of lease liabilities, less current maturities\n$\n74\n \n99\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n8.\nRevenue\nThe following tables show revenue disaggregated by operating area and product type, for the periods presented:\nYear Ended December 31, 2024\nNatural Gas\nOil\nNGL\nTotal\nHaynesville\n$\n1,205\n \n$\n—\n \n$\n—\n \n$\n1,205\n \nNortheast Appalachia\n1,242\n \n—\n \n—\n \n1,242\n \nSouthwest Appalachia\n239\n \n69\n \n214\n \n522\n \nNatural gas, oil and NGL revenue\n$\n2,686\n \n$\n69\n \n$\n214\n \n$\n2,969\n \nMarketing revenue\n$\n1,095\n \n$\n116\n \n$\n79\n \n$\n1,290\n \nYear Ended December 31, 2023\nNatural Gas\nOil\nNGL\nTotal\nHaynesville\n$\n1,300\n \n$\n—\n \n$\n—\n \n$\n1,300\n \nNortheast Appalachia\n1,483\n \n—\n \n—\n \n1,483\n \nEagle Ford\n70\n \n596\n \n98\n \n764\n \nNatural gas, oil and NGL revenue\n$\n2,853\n \n$\n596\n \n$\n98\n \n$\n3,547\n \nMarketing revenue\n$\n989\n \n$\n1,332\n \n$\n179\n \n$\n2,500\n \nYear Ended December 31, 2022\nNatural Gas\nOil\nNGL\nTotal\nHaynesville\n$\n3,481\n \n$\n—\n \n$\n—\n \n$\n3,481\n \nNortheast Appalachia\n4,041\n \n—\n \n—\n \n4,041\n \nEagle Ford\n261\n \n1,798\n \n212\n \n2,271\n \nPowder River Basin\n20\n \n66\n \n13\n \n99\n \nNatural gas, oil and NGL revenue\n$\n7,803\n \n$\n1,864\n \n$\n225\n \n$\n9,892\n \nMarketing revenue\n$\n2,455\n \n$\n1,547\n \n$\n229\n \n$\n4,231\n \n100\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nMajor Customers\nFor the year ended December 31, 2024, we had no purchaser that accounted for 10% or greater of our total revenues (before the effects of hedging). For the year ended December 31, 2023, we had sales to two purchasers that accounted for approximately \n17\n% and \n10\n% of total revenues (before the effects of hedging). For the year ended December 31, 2022, was had sales to two purchasers that accounted for approximately \n13\n% and \n10\n% of total revenues (before the effects of hedging). No other purchasers accounted for more than 10% of our total revenues during the years ended December 31, 2023 or 2022.  \nAccounts Receivable\nAccounts receivable as of December 31, 2024 and 2023 are detailed below:\nDecember 31, 2024\nDecember 31, 2023\nNatural gas, oil and NGL sales\n$\n1,028\n \n$\n406\n \nJoint interest\n191\n \n180\n \nOther\n18\n \n8\n \nAllowance for doubtful accounts\n(\n11\n)\n(\n1\n)\nTotal accounts receivable, net\n$\n1,226\n \n$\n593\n \n \n101\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n9.\nIncome Taxes\n \nThe components of the income tax expense (benefit) for each of the periods presented below are as follows:\nYears Ended December 31,\n2024\n2023\n2022\nCurrent\nFederal\n$\n(\n1\n)\n$\n264\n \n$\n37\n \nState\n(\n3\n)\n6\n \n10\n \nCurrent Income Taxes\n(\n4\n)\n270\n \n47\n \nDeferred\nFederal\n(\n178\n)\n381\n \n(\n1,112\n)\nState\n55\n \n47\n \n(\n220\n)\nDeferred Income Taxes\n(\n123\n)\n428\n \n(\n1,332\n)\nTotal\n$\n(\n127\n)\n$\n698\n \n$\n(\n1,285\n)\nThe income tax expense (benefit) reported in our consolidated statement of operations is different from the federal income tax expense (benefit) computed using the federal statutory rate for the following reasons:\nYears Ended December 31,\n2024\n2023\n2022\nIncome tax expense (benefit) at the federal statutory rate of 21%\n$\n(\n177\n)\n21.0\n \n%\n$\n655\n \n21.0\n \n%\n$\n767\n \n21.0\n \n%\nState income taxes (net of federal income tax benefit)\n(\n5\n)\n0.6\n \n%\n76\n \n2.5\n \n%\n45\n \n1.2\n \n%\nDeferred remeasurement due to state rate changes\n47\n \n(\n5.6\n)\n%\n(\n20\n)\n(\n0.6\n)\n%\n30\n \n0.8\n \n%\nChange in valuation allowance due to acquisitions\n14\n \n(\n1.7\n)\n%\n—\n \n—\n \n%\n19\n \n0.5\n \n%\nChange in valuation allowance excluding impact of acquisitions\n(\n18\n)\n2.1\n \n%\n(\n33\n)\n(\n1.1\n)\n%\n(\n2,147\n)\n(\n58.8\n)\n%\nResearch and development tax credits\n(\n31\n)\n3.7\n \n%\n(\n3\n)\n(\n0.1\n)\n%\n(\n19\n)\n(\n0.5\n)\n%\nTransaction costs\n22\n \n(\n2.6\n)\n%\n—\n \n—\n \n%\n2\n \n0.1\n \n%\nCompensation costs related to acquired company\n11\n \n(\n1.2\n)\n%\n—\n \n—\n \n%\n—\n \n—\n \n%\nOther\n10\n \n(\n1.2\n)\n%\n23\n \n0.7\n \n%\n18\n \n0.5\n \n%\nTotal\n$\n(\n127\n)\n15.1\n \n%\n$\n698\n \n22.4\n \n%\n$\n(\n1,285\n)\n(\n35.2\n)\n%\nIn 2024, the Company’s overall effective tax rate decreased compared to 2023 due to the revaluation of state deferred taxes as a result of Louisiana’s recent enactment of a tax rate decrease and as a result of permanent differences for transaction and compensation costs associated with the Southwestern Merger. The Company’s effective tax rate in 2023 increased from 2022 due to the release of the valuation allowance in 2022 which resulted in that year being a net benefit. \n102\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nDeferred income taxes are provided to reflect temporary differences in the tax basis of assets and liabilities and their reported amounts in the financial statements. \nThe tax-effected temporary differences, net operating loss (“NOL”) carryforwards and excess business interest expense carryforwards that comprise our deferred income taxes are as follows:\nDecember 31, 2024\nDecember 31, 2023\nDeferred tax liabilities:\nProperty, plant and equipment\n$\n(\n1,730\n)\n$\n(\n295\n)\nDerivative instruments\n—\n \n(\n166\n)\nRight of use lease asset\n(\n36\n)\n(\n25\n)\nOther\n(\n3\n)\n(\n4\n)\nDeferred tax liabilities\n(\n1,769\n)\n(\n490\n)\nDeferred tax assets:\nNet operating loss carryforwards\n1,258\n \n848\n \nCarrying value of debt\n4\n \n25\n \nExcess business interest expense carryforward\n777\n \n646\n \nCapital loss carryforwards\n103\n \n78\n \nTax credit carryforwards\n53\n \n15\n \nContract liabilities\n261\n \n—\n \nAsset retirement obligations\n123\n \n65\n \nInvestments\n—\n \n1\n \nFuture lease payments\n36\n \n25\n \nAccrued liabilities\n39\n \n15\n \nDerivative instruments\n13\n \n—\n \nOther\n24\n \n17\n \nDeferred tax assets\n2,691\n \n1,735\n \nValuation allowance\n(\n343\n)\n(\n312\n)\nDeferred tax assets after valuation allowance\n2,348\n \n1,423\n \nNet deferred tax asset\n$\n579\n \n$\n933\n \nReflected in the accompanying balance sheets as:\nDeferred income tax assets\n$\n589\n \n$\n933\n \nDeferred income tax liabilities\n(\n10\n)\n—\n \nTotal\n$\n579\n \n$\n933\n \nAs of December 31, 2024 and 2023, we had deferred tax assets of $\n2.691\n billion and $\n1.735\n billion, respectively, upon which we had a valuation allowance of $\n343\n million and $\n312\n million, respectively. The net change in the valuation allowance of $\n31\n million is primarily due to the additional valuation allowance recorded related to the acquisition of Southwestern tax attributes partially offset by the expiration of a capital loss carryforward and state net operating loss carryforwards. Of this $\n31\n million net change in the valuation allowance, $\n35\n million is reflected in components of stockholders’ equity which is partially offset by $\n4\n million reflected as a component of income tax benefit in the consolidated statements of operations.\nWe maintain a partial valuation allowance of $\n343\n million against a portion of our federal and state deferred tax assets such as NOLs, credit carryovers, and capital losses, which may expire before we are able to utilize them due to the application of the limitations under Section 382 and the ordering in which such attributes may be applied.\nOur ability to utilize NOL carryforwards, disallowed business interest carryforwards, tax credits and possibly other tax attributes to reduce future taxable income and federal income tax is subject to various limitations under Section 382 of the Code. The utilization of such attributes may be subject to an annual limitation under Section 382 of the Code should transactions involving our equity result in a cumulative shift of more than 50% in the beneficial ownership of our stock during any three-year testing period (an “Ownership Change”). \n103\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nThe Company experienced an Ownership Change in 2021 (“First Ownership Change”). The amount of the annual limitation due to the First Ownership Change is $\n54\n million. This limitation applies to our NOL carryforwards, disallowed business interest carryforwards and general business tax credits that existed at the time of the First Ownership Change until such attributes expire or are fully utilized. As a result of the Southwestern Merger on October 1, 2024, the Company experienced another Ownership Change (“Second Ownership Change”). The base amount of the annual limitation due to the Second Ownership Change has been estimated to be $\n380\n million. This limitation applies to our NOL carryforwards, disallowed business interest carryforwards and general business credits generated subsequent to the First Ownership Change until such attributes expire or are fully utilized. We believe that we are in a net unrealized built-in gain position at the time of the Second Ownership Change, which may result in increases to the annual limitation amount for a 5-year period. Some states impose similar limitations on tax attribute utilization upon experiencing an Ownership Change.\nOn October 1, 2024, we completed the Southwestern Merger. For federal income tax purposes, the transaction qualified as a tax-free merger under Section 368 of the Code and, as a result, we acquired carryover tax basis in Southwestern’s assets and liabilities. We recorded a $\n479\n million net deferred tax liability determined through business combination accounting. Additionally, we acquired NOL and interest expense carryforwards which were previously subject to base annual Section 382 limitations of $\n2\n million and $\n48\n million. The acquired NOL and interest expense carryforwards that were not previously subject to a base annual Section 382 limitation are now subject to a base annual Section 382 limitation of approximately $\n269\n million as a result of the merger. The base annual limitation is estimated to be increased over the first five years for recognized built-in gains.\nThe Marcellus Acquisition during 2022 was treated as a taxable asset acquisition with no tax carryovers acquired.\nAs of December 31, 2024, and after taking into account each of the foregoing matters, the federal NOLs are as follows:\nNet operating losses, by year of expiration:\n2031\n$\n5\n \n2032\n8\n \n2033\n2\n \n2034\n2\n \n2035\n50\n \n2036\n618\n \n2037\n832\n \nIndefinitely lived\n3,640\n \nTotal federal net operating losses\n$\n5,157\n \nWe had state NOL carryforwards of approximately $\n4.296\n billion. Several states adopt the federal NOL carryforward period such that our more recent state NOLs do not expire. The state NOL carryforwards are subject to apportioned amounts of the federal Section 382 limitations. \nAs of December 31, 2024 and 2023, we have an income tax receivable of $\n32\n million and $\n33\n million included in other current assets within our consolidated balance sheets, respectively.\nOn August 16, 2022, the President of the United States signed into law the Inflation Reduction Act of 2022 (“IRA”) which, among other things, includes provisions for a 15% corporate alternative minimum tax on book income for companies whose average book income exceeds $1 billion for any three consecutive years preceding the tax year. We believe that we are an applicable corporation beginning in 2024 for purposes of this alternative tax. We estimate no tax due to this as a result of the book loss.\nAccounting guidance for recognizing and measuring uncertain tax positions requires a more likely than not threshold condition be met on a tax position, based solely on the technical merits of being sustained, before any benefit of the tax position can be recognized in the financial statements. Guidance is also provided regarding recognition, classification and disclosure of uncertain tax positions. As of December 31, 2024 and 2023, the amount of unrecognized tax benefits related to NOL carryforwards, tax credit carryforwards, and tax liabilities associated with uncertain tax positions was $\n80\n million and $\n68\n million, respectively. As of December 31, 2024, $\n24\n million is related to \n104\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nstate tax receivables not expected to be recovered, $\n14\n million is related to a liability for tax credits taken, $\n9\n million is related to tax credit carryforwards, and the remainder is related to NOL carryforwards. As of December 31, 2023, $\n24\n million is related to state tax receivables not expected to be recovered, $\n10\n million is related to a liability for tax credits taken, and the remainder is related to NOL carryforwards. If recognized, $\n47\n million of the uncertain tax positions identified would have an effect on the effective tax rate. As of December 31, 2024, we had $\n1\n million accrued for interest related to these uncertain tax positions. As of December 31, 2023, we had \nno\n amounts accrued for interest related to these uncertain tax positions. We recognize interest related to uncertain tax positions as a component of interest expense. Penalties, if any, related to uncertain tax positions would be recorded in other expenses.\nA reconciliation of the beginning and ending balances of unrecognized tax benefits is as follows:\nYears Ended December 31,\n2024\n2023\n2022\nUnrecognized tax benefits at beginning of period\n$\n68\n \n$\n69\n \n$\n74\n \nAdditions based on tax positions related to the current year\n3\n \n3\n \n2\n \nAdditions to tax positions of prior years\n1\n \n3\n \n2\n \nAdditions to tax positions related to acquisitions\n9\n \n—\n \n—\n \nSettlements\n—\n \n(\n5\n)\n—\n \nExpiration of the applicable statute of limitations\n—\n \n—\n \n—\n \nReductions to tax positions of prior years\n(\n1\n)\n(\n2\n)\n(\n9\n)\nUnrecognized tax benefits at end of period\n$\n80\n \n$\n68\n \n$\n69\n \nOur federal and state income tax returns are subject to examination by federal and state tax authorities. Our tax years 2021 through 2024 remain open for all purposes of examination by the IRS as well as the Southwestern 2021 through 2023 returns, the Southwestern short period return for January 1, 2024 through October 1, 2024, and the Vine short period return for January 1, 2021 through November 1, 2021. However, certain earlier tax years remain open for adjustment to the extent of their NOL carryforwards available for future utilization.\nIn addition, tax years 2021 through 2024 as well as certain earlier years remain open for examination by state tax authorities. We do not anticipate that the outcome of any federal or state audit will have a significant impact on our financial position or results of operations.\n105\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n10.\nEquity\nCommon Stock\nOn March 9, 2022, we completed the Marcellus Acquisition and issued \n9,442,185\n shares of common stock. On October 1, 2024, we issued \n95,700,325\n shares of our common stock to Southwestern’s shareholders in connection with the closing of the Southwestern Merger. See further discussion of both transactions in \nNote \n2\n.\nDuring the years ended December 31, 2024, 2023 and 2022, \n468,723\n, \n12,089\n and \n439,370\n reserved shares, respectively, were issued to resolve allowed General Unsecured Claims.\nDividends\nIn May 2021, we initiated an annual base dividend on our shares of common stock, expected to be paid quarterly. In March 2022, we adopted a variable return program that resulted in the payment of an additional variable dividend equal to the sum of Adjusted Free Cash Flow from the prior quarter less the base quarterly dividend, multiplied by 50%. \nThe following table summarizes our dividend payments during the years ended December 31, 2024, 2023 and 2022:\n \nBase\nVariable\nRate Per Share\nTotal\n2024:\nFirst Quarter\n$\n0.575\n \n$\n—\n \n$\n0.575\n \n$\n77\n \nSecond Quarter\n$\n0.575\n \n$\n0.14\n \n$\n0.715\n \n$\n95\n \nThird Quarter\n$\n0.575\n \n$\n—\n \n$\n0.575\n \n$\n78\n \nFourth Quarter\n$\n0.575\n \n$\n—\n \n$\n0.575\n \n$\n134\n \n2023:\nFirst Quarter\n$\n0.55\n \n$\n0.74\n \n$\n1.29\n \n$\n175\n \nSecond Quarter\n$\n0.55\n \n$\n0.63\n \n$\n1.18\n \n$\n160\n \nThird Quarter\n$\n0.575\n \n$\n—\n \n$\n0.575\n \n$\n77\n \nFourth Quarter\n$\n0.575\n \n$\n—\n \n$\n0.575\n \n$\n75\n \n2022:\nFirst Quarter\n$\n0.4375\n \n$\n1.33\n \n$\n1.7675\n \n$\n210\n \nSecond Quarter\n$\n0.50\n \n$\n1.84\n \n$\n2.34\n \n$\n298\n \nThird Quarter\n$\n0.55\n \n$\n1.77\n \n$\n2.32\n \n$\n280\n \nFourth Quarter\n$\n0.55\n \n$\n2.61\n \n$\n3.16\n \n$\n424\n \nOn February 26, 2025, we declared a base quarterly dividend payable of $\n0.575\n per share, which will be paid on March 27, 2025 to stockholders of record at the close of business on March 11, 2025.\nShare Repurchase Programs\nAs of December 2, 2021, the Company was authorized to purchase up to $\n1.0\n billion of the Company’s common stock and/or warrants under a share repurchase program, and in March 2022, we commenced our share repurchase program. In June 2022, our Board of Directors authorized an expansion of the share repurchase program by $\n1.0\n billion, bringing the total authorized share repurchase amount to $\n2.0\n billion for common stock and/or warrants. The $\n2.0\n billion share repurchase program expired on December 31, 2023.\n106\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nThe table below presents the shares purchased under the $\n2.0\n billion share repurchase program.\nShares Purchased (thousands)\nDollar Value of Shares Purchased\nAverage Price Per Share\n2022\nFirst Quarter\n1,000\n$\n83\n \n$\n82.98\n \nSecond Quarter\n5,812\n$\n515\n \n$\n88.67\n \nThird Quarter\n750\n$\n69\n \n$\n92.14\n \nFourth Quarter\n4,105\n$\n406\n \n$\n98.90\n \n2023\nFirst Quarter\n793\n$\n60\n \n$\n74.95\n \nSecond Quarter\n1,444\n$\n115\n \n$\n78.77\n \nThird Quarter\n1,509\n$\n130\n \n$\n86.16\n \nFourth Quarter\n627\n$\n52\n \n$\n82.03\n \nTotal\n16,040\n$\n1,430\n \nThe repurchased shares of common stock were retired and recorded as a reduction to common stock and retained earnings. All share repurchases made after January 1, 2023 are subject to a 1% excise tax on share repurchases, as enacted under the Inflation Reduction Act of 2022. We are able to net this 1% excise tax on share repurchases against certain issuance of shares of our common stock. The impact of this 1% excise tax was immaterial during the year ended December 31, 2023.\nOn October 22, 2024, our Board of Directors authorized the Company to repurchase up to $\n1.0\n billion, in aggregate, of the Company’s common stock and/or warrants under a new share repurchase program. \nEnhanced Returns Framework\nIn October 2024, we announced our enhanced capital returns framework which is designed to more effectively return cash to shareholders and reduce net debt. The plan became effective January 1, 2025, and prioritizes the base dividend of $\n2.30\n per share and a targeted $\n500\n million of annual net debt reduction in 2025, which target will be redetermined annually. Once both have been funded, it is anticipated that \n75\n% of remaining free cash flow will be distributed as market conditions warrant, between share repurchases and additional dividend payments. The remaining free cash flow will be maintained on the balance sheet.\nWarrants \nClass A Warrants\nClass B Warrants\nClass C Warrants\n(a)\nOutstanding as of December 31, 2021\n10,856,852\n \n12,313,273\n \n11,388,371\n \nConverted into common stock\n(b)\n(\n1,609,641\n)\n(\n29,679\n)\n(\n959,247\n)\nConverted in warrant exchange offer\n(b)\n(\n4,752,207\n)\n(\n7,879,030\n)\n(\n7,252,004\n)\nIssued for General Unsecured Claims\n—\n \n—\n \n829,109\n \nOutstanding as of December 31, 2022\n4,495,004\n \n4,404,564\n \n4,006,229\n \nConverted into common stock\n(b)\n(\n247,389\n)\n(\n1,500\n)\n(\n5,581\n)\nIssued for General Unsecured Claims\n—\n \n—\n \n22,835\n \nOutstanding as of December 31, 2023\n4,247,615\n \n4,403,064\n \n4,023,483\n \nConverted into common stock\n(b)\n(\n2,993,136\n)\n(\n1,329,870\n)\n(\n524,242\n)\nIssued for General Unsecured Claims\n—\n \n—\n \n884,393\n \nOutstanding as of December 31, 2024\n1,254,479\n \n3,073,194\n \n4,383,634\n \n_________________________________________\n(a)\nAs of December 31, 2024, we had \n582,109\n of reserved Class C Warrants.\n(b)\nDuring the years ended December 31, 2024 and December 31, 2023, we issued \n4,083,103\n and \n221,952\n common shares, respectively, as a result of Warrant exercises. During the year ended December 31, 2022, we \n107\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nissued \n18,408,228\n common shares as a result of Warrant exercises, inclusive of the shares issued as part of the Warrant exchange offers described below.\n \nOur Class A, Class B and Class C Warrants were initially exercisable for \none\n share of common stock per Warrant at initial exercise prices of $\n27.63\n, $\n32.13\n and $\n36.18\n per share, respectively, subject to adjustments pursuant to the terms of the Warrants. The Warrants are exercisable until February 9, 2026. The Warrants contain customary anti-dilution adjustments in the event of any stock split, reverse stock split, reclassification, stock dividend or other distributions. The exercise prices of the Warrants were adjusted to prevent the dilution of rights for the effects of the quarterly dividend distribution on December 4, 2024, and the adjusted exercise prices are $\n22.58\n, $\n26.25\n, and $\n29.56\n per share for the Class A, Class B and Class C Warrants, respectively. Additionally, we have recalculated the number of shares of common stock issuable upon the exercise of each of the Class A, Class B and Class C Warrants, respectively, and as a result, \n1.22\n shares are issuable upon the exercise of a Class A, Class B or Class C Warrant.\nOn August 18, 2022, we announced exchange offers relating to our outstanding Class A Warrants, Class B Warrants and Class C Warrants. The exchange offers expired on October 7, 2022 and resulted in the issuance of \n16,305,984\n shares of our common stock in exchange for the cancellation of (i) \n4,752,207\n Class A Warrants, (ii) \n7,879,030\n Class B Warrants and (iii) \n7,252,004\n Class C Warrants. Under the exchange offers, the Warrants were exchanged in a cashless transaction and were converted to shares of our common stock at a ratio of \n0.8636\n for Class A Warrants, \n0.8224\n for Class B Warrants and \n0.7890\n for Class C Warrants, respectively. As the fair value of the common stock issued was greater than the fair value of the Warrants tendered in the exchange offers due to stated exchange premiums, we recorded a non-cash deemed dividend of $\n67\n million. Such fair values were determined using our stock price that is considered a Level 1 input.\n108\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n11.\nShare-Based Compensation\nOur long-term incentive plan, as amended and adopted by our Board of Directors (the “LTIP”), provides for the grant of restricted stock units (“RSUs”), restricted stock awards, stock options, stock appreciation rights, performance awards and other stock awards to the Company’s employees and non-employee directors and has a share reserve equal to \n6,800,000\n shares of common stock.\nRestricted Stock Units. \nDuring the years ended December 31, 2024, 2023 and 2022, we granted RSUs to employees and non-employee directors under the LTIP, which will vest over a \nthree-year\n to \nfive-year\n period and \none-year\n period, respectively. The fair value of RSUs is based on the closing sales price of our common stock on the date of grant, and compensation expense is recognized ratably over the requisite service period. \nA summary of the changes in unvested RSUs is presented below:\n \nUnvested\nRestricted Stock Units\nWeighted Average\nGrant Date\nFair Value Per Share\n(in thousands)\nUnvested as of December 31, 2021\n775\n \n$\n46.77\n \nGranted\n666\n \n$\n81.87\n \nVested\n(\n300\n)\n$\n48.11\n \nForfeited\n(\n184\n)\n$\n56.54\n \nUnvested as of December 31, 2022\n957\n \n$\n68.91\n \nGranted\n440\n \n$\n72.25\n \nVested\n(\n329\n)\n$\n61.66\n \nForfeited\n(\n128\n)\n$\n68.42\n \nUnvested as of December 31, 2023\n940\n \n$\n73.08\n \nGranted\n (a)\n962\n \n$\n83.09\n \nVested \n(a)\n(\n925\n)\n$\n74.18\n \nForfeited\n(\n20\n)\n$\n77.71\n \nUnvested as of December 31, 2024\n957\n \n$\n81.99\n \n_________________________________________\n(a)\nApproximately \n5.2\n million Southwestern RSUs were converted to \n478\n thousand Company RSUs, of which approximately \n384\n thousand RSUs were accelerated. We recognized the accelerated share-based compensation expense related to these awards in other operating expense, net on our consolidated statements of operations. Additionally, approximately \n105\n thousand RSUs were accelerated related to one-time termination benefits for certain employees.\nThe aggregate intrinsic value of RSUs that vested during the years ended December 31, 2024, 2023 and 2022 was approximately $\n77\n million, $\n25\n million and $\n26\n million, respectively, based on the stock price at the time of vesting. \nAs of December 31, 2024, there was approximately\n $\n46\n million \nof total unrecognized compensation expense related to unvested RSUs. The expense is expected to be recognized over a weighted average period of approximatel\ny \n2.04\n years.\nPerformance Share Units. \nDuring the years ended December 31, 2024, 2023 and 2022,\n we granted performance share units (“PSUs”) to senior management under the LTIP, which will generally vest over a \nthree-year\n period and will be settled in shares. The performance criteria include total shareholder return (“TSR”) and relative TSR (“rTSR”) and could result in a total payout between \n0\n% - \n200\n% of the target units. The fair value of the PSUs was measured on the grant date using a Monte Carlo simulation, and compensation expense is recognized ratably over the requisite service period because these awards depend on a combination of service and market criteria. \n109\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nThe following table presents the assumptions used in the valuation of the PSUs granted during the years ended December 31, 2024, 2023 and 2022.\nAssumption - TSR, rTSR\n2024 PSU Awards\n2023 PSU Awards\n2022 PSU Awards\nRisk-free interest rate\n4.55\n \n%\n3.85\n \n%\n2.00\n \n%\nVolatility\n39.36\n \n%\n64.4\n \n%\n70.2\n \n%\n \nA summary of the changes in unvested PSUs is presented below:  \nUnvested Performance Share Units\nWeighted Average\nGrant Date\nFair Value Per Share\n(in thousands)\nUnvested as of December 31, 2021\n183\n \n$\n66.12\n \nGranted\n133\n \n$\n109.65\n \nVested\n—\n \n$\n—\n \nForfeited\n(\n40\n)\n$\n57.48\n \nUnvested as of December 31, 2022\n276\n \n$\n88.28\n \nGranted\n131\n \n$\n78.78\n \nVested\n—\n \n$\n—\n \nForfeited\n(\n13\n)\n$\n68.77\n \nUnvested as of December 31, 2023\n394\n \n$\n85.78\n \nGranted\n133\n \n$\n95.33\n \nVested\n(\n151\n)\n$\n71.29\n \nForfeited\n—\n \n$\n—\n \nUnvested as of December 31, 2024\n376\n \n$\n94.67\n \nThe aggregate intrinsic value of PSUs that vested during the year ended December 31, 2024 was approximately $\n19\n million based on the stock price at the time of vesting.\nAs of \nDecember 31, 2024, there was approximatel\ny $\n14\n million \nof total unrecognized compensation expense related to unvested PSUs. The expense is expected to be recognized over a weighted average period of approximat\nely \n1.84\n years\n.\nRSU and PSU Compensation.\n \nWe recognized the following compensation costs, net of actual forfeitures, related to RSUs and PSUs for the periods presented:\nYears Ended December 31,\n2024\n2023\n2022\nGeneral and administrative expenses\n$\n33\n \n$\n29\n \n$\n19\n \nNatural gas and oil properties\n7\n \n6\n \n4\n \nProduction expense\n4\n \n4\n \n3\n \nSeparation and other termination costs\n9\n \n—\n \n—\n \nOther operating expense, net\n28\n \n—\n \n—\n \nTotal RSU and PSU compensation\n$\n81\n \n$\n39\n \n$\n26\n \nRelated income tax benefit\n$\n13\n \n$\n7\n \n$\n6\n \n110\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n12.\nEmployee Benefit Plans\nOur qualified 401(k) profit sharing plan (“401(k) Plan”) is the Expand Energy Corporation 401(k) Plan, which is open to employees of Expand Energy and all our subsidiaries. Eligible employees may elect to defer compensation through voluntary contributions to their 401(k) Plan accounts, subject to plan limits and those set by the IRS. We match employee contributions dollar for dollar (subject to a maximum contribution of \n6\n% of an employee's base salary and performance bonus) in cash. In addition to our employer match contributions, in 2022 we commenced a discretionary fixed dollar contribution benefit for all employees, paid quarterly, which is based upon a calculation of \n1\n% of Adjusted Free Cash Flow less the base quarterly dividend. This discretionary fixed dollar contribution is subject to an annual maximum contribution of $\n15,000\n per employee. We contributed $\n8\n million, $\n13\n million and $\n22\n million to the 401(k) Plan during the years ended December 31, 2024, 2023 and 2022, respectively.\n13.\nDerivative and Hedging Activities\nWe use derivative instruments to reduce our exposure to fluctuations in future commodity prices and to protect our expected operating cash flow against significant market movements or volatility. All of our natural gas, oil and NGL derivative instruments are net settled based on the difference between the fixed-price payment and the floating-price payment, resulting in a net amount due to or from the counterparty. \nNone\n of our open natural gas, oil and NGL derivative instruments were designated for hedge accounting as of December 31, 2024 and 2023.\nNatural Gas, Oil and NGL Derivatives\nAs of December 31, 2024 and 2023, our natural gas, oil and NGL derivative instruments consisted of the following types of instruments:\n•\nSwaps\n: We receive a fixed price and pay a floating market price to the counterparty for the hedged commodity. In exchange for higher fixed prices on certain of our swap trades, we may sell call options and swap options.\n•\nOptions\n: We have bought and sold call options in exchange for a premium. At the time of settlement, if the market price exceeded the fixed price of the call option, we paid the counterparty the excess on sold call options and received the excess on bought call options. If the market price settled below the fixed price of the call option, no payment was due from either party. \n•\nCollars\n: These instruments contain a fixed floor price (put) and ceiling price (call). If the market price exceeds the call strike price or falls below the put strike price, we receive the fixed price and pay the market price. If the market price is between the put and the call strike prices, no payments are due from either party. Three-way collars included the sale by us of an additional put option in exchange for a more favorable strike price on the call option. This eliminated the counterparty’s downside exposure below the second put option strike price.\n•\nBasis Protection Swaps\n: These instruments are arrangements that guarantee a fixed price differential to NYMEX from a specified delivery point. We receive the fixed price differential and pay the floating market price differential to the counterparty for the hedged commodity.\n111\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nContingent Consideration Arrangement\nIn November 2023, we sold the final portion of our Eagle Ford assets to SilverBow. As part of the divestiture agreement, SilverBow agreed to pay the Company an additional contingent payment of $\n25\n million should WTI NYMEX prices average between $\n75\n and $\n80\n per barrel or $\n50\n million should WTI NYMEX prices average above $\n80\n per barrel during the year following the close of the transaction. On July 30, 2024, Crescent acquired SilverBow. The changes in fair value, and the realized gains were recognized as a gain or loss in earnings in the period they occurred within natural gas, oil and NGL derivatives in our consolidated statements of operations. During 2024, we received the contingent payment of $\n25\n million from Crescent based upon the average NYMEX prices during the year following the close of the transaction.\nThe estimated fair values of our natural gas, oil and NGL derivative instrument assets (liabilities) as of December 31, 2024 and 2023 are provided below: \n \nDecember 31, 2024\nDecember 31, 2023\nNotional Volume\nFair Value\nNotional Volume\nFair Value\nNatural gas (Bcf):\nFixed-price swaps\n369\n \n$\n(\n28\n)\n343\n \n$\n188\n \nCollars\n1,098\n \n(\n27\n)\n558\n \n497\n \nThree-way collars\n161\n \n60\n \n—\n \n—\n \nCall options (purchased)\n73\n \n1\n \n—\n \n—\n \nCall options (sold)\n219\n \n(\n16\n)\n—\n \n—\n \nBasis protection swaps\n279\n \n(\n39\n)\n578\n \n2\n \nTotal natural gas\n2,199\n \n(\n49\n)\n1,479\n \n687\n \nOil (MMBbls):\nThree-way collars\n2\n \n$\n4\n \n—\n \n$\n—\n \nTotal oil\n2\n \n4\n \n—\n \n—\n \nNGLs (MMBbls):\nFixed-price swaps\n7\n \n$\n(\n9\n)\n—\n \n$\n—\n \nTotal NGL\n7\n \n(\n9\n)\n—\n \n—\n \nContingent Consideration:\nEagle Ford divestiture\n—\n \n12\n \nTotal estimated fair value\n$\n(\n54\n)\n$\n699\n \n112\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nEffect of Derivative Instruments – Consolidated Balance Sheets\nThe following table presents the fair value and location of each classification of derivative instrument included in the consolidated balance sheets as of December 31, 2024 and 2023 on a gross basis and after same-counterparty netting:\nGross \nFair Value\n(a)\nAmounts Netted \nin the \nConsolidated \nBalance Sheets\nNet Fair Value\nPresented in the\nConsolidated\nBalance Sheets\nAs of December 31, 2024\nCommodity Contracts:\nShort-term derivative asset\n$\n191\n \n$\n(\n107\n)\n$\n84\n \nLong-term derivative asset\n6\n \n(\n5\n)\n1\n \nShort-term derivative liability\n(\n178\n)\n107\n \n(\n71\n)\nLong-term derivative liability\n(\n73\n)\n5\n \n(\n68\n)\nContingent Consideration:\nShort-term derivative asset\n—\n \n—\n \n—\n \nTotal derivatives\n$\n(\n54\n)\n$\n—\n \n$\n(\n54\n)\nAs of December 31, 2023\nCommodity Contracts:\nShort-term derivative asset\n$\n661\n \n$\n(\n36\n)\n$\n625\n \nLong-term derivative asset\n101\n \n(\n27\n)\n74\n \nShort-term derivative liability\n(\n39\n)\n36\n \n(\n3\n)\nLong-term derivative liability\n(\n36\n)\n27\n \n(\n9\n)\nContingent Consideration:\nShort-term derivative asset\n12\n \n—\n \n12\n \nTotal derivatives\n$\n699\n \n$\n—\n \n$\n699\n \n___________________________________________\n(a)\nThese financial assets (liabilities) are measured at fair value on a recurring basis utilizing significant other observable inputs; see further discussion on fair value measurements below.\nFair Value\nThe fair value of our commodity derivatives is based on third-party pricing models, which utilize inputs that are either readily available in the public market, such as natural gas, oil and NGL forward curves and discount rates, or can be corroborated from active markets or broker quotes, and, as such, are classified as Level 2. These values are compared to the values given by our counterparties for reasonableness. Derivatives are also subject to the risk that either party to a contract will be unable to meet its obligations. We factor non-performance risk into the valuation of our derivatives using current published credit default swap rates. To date, this has not had a material impact on the values of our derivatives. The valuation of the contingent consideration is based on an option pricing model using significant Level 2 inputs that include quoted future commodity prices based on active markets.\nCredit Risk Considerations\nOur derivative instruments expose us to our counterparties’ credit risk. To mitigate this risk, we only enter into commodity contracts derivatives with counterparties that are highly rated or deemed by us to have acceptable credit strength and deemed by management to be competent and competitive market-makers, and we attempt to limit our exposure to non-performance by any single counterparty. As of December 31, 2024, our commodity contracts derivative instruments were spread among \n20\n counterparties.\n113\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nHedging Arrangements\nCertain of our hedging arrangements are with counterparties that are also Lenders (or affiliates of Lenders) under our Credit Facility. The contracts entered into with these counterparties were previously secured by the same collateral that secured the Pre-IG Credit Facility, but such collateral was released on October 28, 2024 in connection with the Investment Grade Credit Agreement Amendment. We do not expect to post cash or letters of credit to secure our obligations under such contracts while we have the investment grade ratings described in \nNote 4\n. The obligations under these contracts must be secured by cash or letters of credit to the extent that any mark-to-market amounts exceed defined thresholds. As of December 31, 2024, we did \nno\nt have any cash or letters of credit posted as collateral for our commodity derivatives.\n14.\nOther Property and Equipment\n \nA summary of other property and equipment held for use and the estimated useful lives thereof is as follows:\nEstimated \nUseful\nLife\nDecember 31, 2024\nDecember 31, 2023\n(in years)\nBuildings and improvements\n$\n329\n \n$\n316\n \n10\n - \n39\nComputer equipment\n110\n \n94\n \n5\nGathering and water systems\n(a)\n78\n \n—\n \n7\n - \n20\nMachinery and equipment\n40\n \n19\n \n7\n - \n10\nLand\n29\n \n28\n \nOther\n68\n \n40\n \n3\n - \n30\nTotal other property and equipment, at cost\n654\n \n497\n \nLess: accumulated depreciation\n(\n127\n)\n(\n90\n)\nTotal other property and equipment, net\n$\n527\n \n$\n407\n \n___________________________________________\n(a)\nThese assets were acquired as a result of the Southwestern Merger. See \nNote 2\n for further discussion of this transaction.\n \n15.\nInvestments\nMomentum Sustainable Ventures LLC.\n During the fourth quarter of 2022, the Company entered into an agreement with Momentum Sustainable Ventures LLC to build a new natural gas gathering pipeline and carbon capture project, which will gather and treat natural gas produced in the Haynesville Shale for re-delivery to Gulf Coast markets, including LNG export. The pipeline is expected to have an initial capacity of \n1.7\n Bcf/d expandable to \n2.2\n Bcf/d. The carbon capture portion of the project anticipates capturing approximately \n1.0\n million tons per annum of CO2 and delivering the CO2 to ExxonMobil Low Carbon Solutions Onshore Storage, LLC for additional transportation and storage. The natural gas gathering pipeline is projected for a potential in-service date in the fourth quarter of 2025. We have a \n35\n% interest in the joint venture entity. We have accounted for this investment as an equity method investment, and its carrying value, which is reflected within other long-term assets on the consolidated balance sheets, was $\n307\n million and $\n238\n million as of December 31, 2024 and December 31, 2023, respectively. As of December 31, 2024, the carrying value of our investment included approximately $\n17\n million of capitalized interest related to the project.\n \n114\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n16.\nAsset Retirement Obligations\nThe components of the change in our asset retirement obligations are shown below:\nYears Ended December 31,\n2024\n2023\nAsset retirement obligations, beginning of period\n$\n276\n \n$\n335\n \nAdditions\n(a)\n263\n \n9\n \nRevisions\n(b)\n(\n21\n)\n(\n9\n)\nSettlements and disposals\n(c)\n(\n5\n)\n(\n75\n)\nAccretion expense\n18\n \n16\n \nAsset retirement obligations, end of period\n531\n \n276\n \nLess current portion\n32\n \n11\n \nAsset retirement obligations, long-term\n$\n499\n \n$\n265\n \n___________________________________________\n(a)    During the year ended December 31, 2024, approximately $\n251\n million of additions relate to the Southwestern Merger. See \nNote \n2\n for further discussion of this transaction.\n(b)    Revisions\n \nprimarily represent changes in the present value of liabilities resulting from changes in estimated costs and economic lives of producing properties.\n(c)    During the year ended December 31, 2023, approximately $\n64\n million of disposals related to the divestitures of our Eagle Ford assets. See \nNote \n2\n for further discussion of these transactions.\n17.\nSupplemental Cash Flow Information\nSupplemental disclosures to the consolidated statements of cash flows are presented below.\nYears Ended December 31,\n2024\n2023\n2022\nChanges in assets and liabilities\nAccounts receivable\n$\n(\n168\n)\n$\n857\n \n$\n(\n106\n)\nAccounts payable\n(\n62\n)\n(\n152\n)\n49\n \nOther current assets\n3\n \n143\n \n(\n182\n)\nOther current liabilities\n(\n88\n)\n(\n573\n)\n116\n \nTotal\n$\n(\n315\n)\n$\n275\n \n$\n(\n123\n)\nSupplemental cash flow information:\nInterest paid, net of capitalized interest\n$\n93\n \n$\n117\n \n$\n146\n \nIncome taxes paid (refunds received), net\n$\n(\n3\n)\n$\n132\n \n$\n193\n \nSupplemental disclosure of significant \n  non-cash investing and financing activities:\nChange in accrued drilling and completion costs\n$\n(\n49\n)\n$\n(\n31\n)\n$\n148\n \nCommon stock issued for business combination\n$\n7,888\n \n$\n—\n \n$\n764\n \nOperating lease obligations recognized\n$\n137\n \n$\n96\n \n$\n120\n \n115\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\n18.\nSegment Information\nOperating segments are defined as components of an enterprise that engage in activities from which it may earn revenues and incur expenses for which separate operational financial information is available and is regularly evaluated by the CODM, who is our Chief Executive Officer, for the purpose of allocating an enterprise’s resources and assessing its operating performance. Our revenues are derived from the production, marketing and sale of natural gas, oil and NGL. Additional information on our revenues, including the disaggregation of our revenues and major customers, is found in \nNote 8\n. As of December 31, 2024, we considered each of our operating areas as operating segments, however, we have aggregated those operating segments into \none\n reportable segment due to the similar nature of the exploration and production business across Expand Energy and its consolidated subsidiaries and the fact that our marketing activities are ancillary to our operations.\nOur CODM uses consolidated net income (loss), for purposes of allocating resources and in assessing Expand Energy’s operating performance. Additionally, our CODM is regularly provided information on production expense, gathering, processing and transportation expense, severance and ad valorem taxes and general and administrative expense, which are our significant segment expenses. Other segment items primarily consist of depreciation, depletion and amortization, marketing expense, interest expense and income tax expense (benefit). Our significant segment expenses and other segment items are derived from, and can be found within the consolidated statements of operations.\nThe measure of segment assets is total assets as reported on our consolidated balance sheets, and as of December 31, 2024 and 2023 our total assets were $\n27,894\n million and $\n14,376\n million, respectively. Additionally, in analyzing company performance, our CODM reviews capital expenditures. During the years ended December 31, 2024, 2023 and 2022, our capital expenditures were $\n1,529\n million, $\n1,782\n million and $\n1,936\n million, respectively. During the years ended December 31, 2024, 2023 and 2022, we contributed approximately $\n58\n million, $\n220\n million and $\n18\n million, respectively, to equity method investments, which primarily consisted of our investment with Momentum Sustainable Ventures LLC. Additional discussion around our investment with Momentum Sustainable Ventures LLC is in \nNote 15\n. Our interest revenue during the years ended December 31, 2024, 2023 and 2022 was $\n45\n million, $\n29\n million and $\n1\n million, respectively.\n116\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nSUPPLEMENTARY INFORMATION\nSupplemental Disclosures About Natural Gas, Oil and NGL Producing Activities (unaudited)\nNet Capitalized Costs\nCapitalized costs related to our natural gas, oil and NGL producing activities are summarized as follows:\nDecember 31, 2024\nDecember 31, 2023\nNatural gas and oil properties:\nProved\n$\n23,093\n \n$\n11,468\n \nUnproved\n5,897\n \n1,806\n \nTotal\n28,990\n \n13,274\n \nLess accumulated depreciation, depletion and amortization\n(\n5,235\n)\n(\n3,584\n)\nNet capitalized costs\n$\n23,755\n \n$\n9,690\n \nUnproved properties as of December 31, 2024 consisted mainly of leasehold acquired through our Southwestern Merger in 2024 and Marcellus Acquisition in 2022 and unproved properties as of December 31, 2023, consisted mainly of leasehold acquired through our Marcellus Acquisition in 2022. We will continue to evaluate our unproved properties, and although the timing of the ultimate evaluation or disposition of the properties cannot be determined, we can expect the majority of our unproved properties not held by production to be transferred into the amortization base over the next five years.\nCosts Incurred in Natural Gas and Oil Property Acquisition, Exploration and Development\nCosts incurred in natural gas and oil property acquisition, exploration and development, including capitalized interest and asset retirement costs, are summarized as follows:\nYears Ended December 31,\n2024\n2023\n2022\nAcquisition of properties\n(a)\n:\nProved properties\n$\n10,010\n \n$\n10\n \n$\n2,321\n \nUnproved properties\n4,393\n \n52\n \n795\n \nExploratory costs\n17\n \n15\n \n15\n \nDevelopment costs\n1,420\n \n1,721\n \n1,918\n \nCosts incurred\n$\n15,840\n \n$\n1,798\n \n$\n5,049\n \n___________________________________________\n(a)    Includes $\n10.0\n billion and $\n4.3\n billion of proved and unproved property acquisitions, respectively, related to the Southwestern Merger in 2024. Includes $\n2.3\n billion and $\n0.8\n billion of proved and unproved property acquisitions, respectively, related to our Marcellus Acquisition in 2022.\n117\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nSUPPLEMENTARY INFORMATION - (Continued)\nResults of Operations from Natural Gas, Oil and NGL Producing Activities \nThe following table includes revenues and expenses associated directly with our natural gas, oil and NGL producing activities for the periods presented. It does not include any derivative activity, interest costs or indirect general and administrative costs and, therefore, is not necessarily indicative of the contribution to consolidated net operating results of our natural gas, oil and NGL operations. \nYears Ended December 31,\n2024\n2023\n2022\nNatural gas, oil and NGL sales\n$\n2,969\n \n$\n3,547\n \n$\n9,892\n \nProduction expenses\n(\n316\n)\n(\n356\n)\n(\n475\n)\nGathering, processing and transportation expenses\n(\n1,035\n)\n(\n853\n)\n(\n1,059\n)\nSeverance and ad valorem taxes\n(\n97\n)\n(\n167\n)\n(\n242\n)\nExploration\n(\n10\n)\n(\n27\n)\n(\n23\n)\nDepletion and depreciation\n(\n1,673\n)\n(\n1,478\n)\n(\n1,703\n)\nAccretion of asset retirement obligations\n(\n18\n)\n(\n16\n)\n(\n17\n)\nImputed income tax provision\n(a)\n42\n \n(\n152\n)\n(\n1,440\n)\nResults of operations from natural gas, oil and NGL producing activities\n$\n(\n138\n)\n$\n498\n \n$\n4,933\n \n___________________________________________\n(a)    The imputed income tax provision is hypothetical (at the statutory tax rate) and determined without regard to our deduction for general and administrative expenses, interest costs and other income tax credits and deductions, nor whether the hypothetical tax provision (benefit) will be payable (receivable).\nNatural Gas, Oil and NGL Reserve Quantities\nOur petroleum engineers estimated all of our proved reserves as of December 31, 2024, 2023 and 2022. Independent petroleum engineering firm Netherland, Sewell & Associates, Inc. audited our total proved reserves as of December 31, 2024. \nProved natural gas, oil and NGL reserves are those quantities of natural gas, oil and NGL which, by analysis of geoscience and engineering data, can be estimated with reasonable certainty to be economically producible – from a given date forward, from known reservoirs, and under existing economic conditions, operating methods, and government regulations – prior to the time at which contracts providing the right to operate expire, unless evidence indicates that renewal is reasonably certain, regardless of whether deterministic or probabilistic methods are used for the estimation.  Existing economic conditions include prices and costs at which economic producibility from a reservoir is to be determined. Based on reserve reporting rules, the price is calculated using the average price during the 12-month period prior to the ending date of the period covered by the report, determined as an unweighted arithmetic average of the first-day-of-the-month price for each month within the period, unless prices are defined by contractual arrangements, excluding escalations based upon future conditions. A project to extract hydrocarbons must have commenced or the operator must be reasonably certain that it will commence the project within a reasonable time. The area of the reservoir considered as proved includes: (i) the area identified by drilling and limited by fluid contacts, if any, and (ii) adjacent undrilled portions of the reservoir that can, with reasonable certainty, be judged to be continuous with it and to contain economically producible natural gas or oil on the basis of available geoscience and engineering data. In the absence of data on fluid contacts, proved quantities in a reservoir are limited by the lowest known hydrocarbons as seen in a well penetration unless geoscience, engineering or performance data and reliable technology establish a lower contact with reasonable certainty. Where direct observation from well penetrations has defined a highest known oil elevation and the potential exists for an associated natural gas cap, proved oil reserves may be assigned in the structurally higher portions of the reservoir only if geoscience, engineering or performance data and reliable technology establish the higher contact with reasonable certainty. Reserves which can be produced economically through application of improved recovery techniques (including, but not limited to, fluid injection) are included in the proved classification when: (i) successful testing by a pilot project in an area of the reservoir with properties no more favorable than in the reservoir as a whole, the operation of an installed program in the reservoir or an analogous reservoir, or other evidence using reliable technology establishes the reasonable certainty of the engineering analysis on which the project or program \n118\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nSUPPLEMENTARY INFORMATION - (Continued)\nwas based; and (ii) the project has been approved for development by all necessary parties and entities, including governmental entities.\nThe information provided below on our natural gas, oil and NGL reserves is presented in accordance with regulations prescribed by the SEC. Our reserve estimates are generally based upon extrapolation of historical production trends, analogy to similar properties and volumetric calculations. Accordingly, these estimates will change as future information becomes available and as commodity prices change. These changes could be material and could occur in the near term.\nPresented below is a summary of changes in estimated proved reserves for the periods presented: \nNatural Gas\nOil\nNGL\nTotal\n(Bcf)\n(MMBbl)\n(MMBbl)\n(Bcfe)\nDecember 31, 2024\nProved reserves, beginning of period\n9,688\n \n—\n \n—\n \n9,688\n \nExtensions, discoveries and other additions\n124\n \n—\n \n—\n \n124\n \nRevisions of previous estimates\n(\n1,654\n)\n—\n \n—\n \n(\n1,654\n)\nProduction\n(\n1,321\n)\n(\n1.2\n)\n(\n7.8\n)\n(\n1,375\n)\nSale of reserves-in-place\n—\n \n—\n \n—\n \n—\n \nPurchase of reserves-in-place\n10,087\n \n69.1\n \n585.9\n \n14,017\n \nProved reserves, end of period\n16,924\n \n67.9\n \n578.1\n \n20,800\n \nProved developed reserves:\nBeginning of period\n6,363\n \n—\n \n—\n \n6,363\n \nEnd of period\n14,418\n \n40.3\n \n383.0\n \n16,958\n \nProved undeveloped reserves:\nBeginning of period\n3,325\n \n—\n \n—\n \n3,325\n \nEnd of period\n(a)\n2,506\n \n27.6\n \n195.1\n \n3,842\n \nDecember 31, 2023\nProved reserves, beginning of period\n11,369\n \n198.4\n \n73.9\n \n13,002\n \nExtensions, discoveries and other additions\n415\n \n—\n \n—\n \n415\n \nRevisions of previous estimates\n(\n325\n)\n—\n \n—\n \n(\n325\n)\nProduction\n(\n1,266\n)\n(\n7.7\n)\n(\n3.8\n)\n(\n1,335\n)\nSale of reserves-in-place\n(\n563\n)\n(\n190.7\n)\n(\n70.1\n)\n(\n2,127\n)\nPurchase of reserves-in-place\n58\n \n—\n \n—\n \n58\n \nProved reserves, end of period\n9,688\n \n—\n \n—\n \n9,688\n \nProved developed reserves:\nBeginning of period\n7,385\n \n157.2\n \n58.9\n \n8,681\n \nEnd of period\n6,363\n \n—\n \n—\n \n6,363\n \nProved undeveloped reserves:\nBeginning of period\n3,984\n \n41.2\n \n15.0\n \n4,321\n \nEnd of period\n(a)\n3,325\n \n—\n \n—\n \n3,325\n \n119\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nSUPPLEMENTARY INFORMATION - (Continued)\nNatural Gas\nOil\nNGL\nTotal\n(Bcf)\n(MMBbl)\n(MMBbl)\n(Bcfe)\nDecember 31, 2022\nProved reserves, beginning of period\n7,824\n \n209.7\n \n82.0\n \n9,573\n \nExtensions, discoveries and other additions\n60\n \n2.1\n \n1.5\n \n82\n \nRevisions of previous estimates\n1,989\n \n22.5\n \n5.0\n \n2,155\n \nProduction\n(\n1,308\n)\n(\n19.4\n)\n(\n6.0\n)\n(\n1,461\n)\nSale of reserves-in-place\n(\n122\n)\n(\n16.5\n)\n(\n8.6\n)\n(\n273\n)\nPurchase of reserves-in-place\n2,926\n \n—\n \n—\n \n2,926\n \nProved reserves, end of period\n11,369\n \n198.4\n \n73.9\n \n13,002\n \nProved developed reserves:\nBeginning of period\n4,246\n \n165.7\n \n61.7\n \n5,610\n \nEnd of period\n7,385\n \n157.2\n \n58.9\n \n8,681\n \nProved undeveloped reserves:\nBeginning of period\n3,578\n \n44.0\n \n20.3\n \n3,963\n \nEnd of period\n(a)\n3,984\n \n41.2\n \n15.0\n \n4,321\n \n___________________________________________\n(a)    As of December 31, 2024, 2023 and 2022, there were no PUDs that had remained undeveloped for five years or more.\nDuring 2024, we acquired \n14,017\n Bcfe, primarily related to the Southwestern Merger. We recorded extensions and discoveries of \n124\n Bcfe, primarily related to new PUDs in Northeast Appalachia and previously unproved producing wells in both Northeast Appalachia and Haynesville. We recorded \n1,654\n Bcfe of downward revisions of previous estimates, with \n2,395\n Bcfe of downward revisions due to lower natural gas, oil and NGL prices in 2024, partially offset by \n741\n Bcfe of non-price related positive revisions. The non-price revisions primarily consisted of \n750\n Bcfe of reserves increases on existing proved properties, related to increases in PUD forecasts and aligning forecasts for proved developed wells with latest production trends, increased ownership interests in some of the locations, and improved differentials in Haynesville. Also included within the non-price revisions were \n174\n Bcfe of new PUDs and producing wells in areas previously classified as proved, and \n183\n Bcfe of downward revisions due to development plan and other changes in Northeast Appalachia and Haynesville. The natural gas, oil and NGL prices used in computing our reserves as of December 31, 2024, were $\n2.13\n per Mcf, $\n75.48\n per Bbl and $\n75.48\n per Bbl, respectively, before basis differential adjustments.\nDuring 2023, we divested \n2,127\n Bcfe, primarily related to our Eagle Ford divestitures. We recorded extensions and discoveries of \n415\n Bcfe, primarily related to new PUDs and previously unproved producing wells in the Upper Marcellus and Bossier Shales. We recorded \n325\n Bcfe of downward revisions of previous estimates, with \n1,623\n Bcfe of downward revisions due to lower natural gas, oil and NGL prices in 2023, partially offset by \n1,298\n Bcfe of non-price related positive revisions. The non-price revisions primarily consisted of \n1,517\n Bcfe from new PUDs and producing wells added in previously proved areas, \n469\n Bcfe of positive revisions to previously recorded PUD reserves primarily due to expected longer laterals in both Northeast Appalachia and Haynesville, partially offset by downward revisions of \n451\n Bcfe due to development plan and other changes in Northeast Appalachia and Haynesville, and a downward revision of \n237\n Bcfe on proved developed reserves related to aligning forecasts with latest production trends. The natural gas, oil and NGL prices used in computing our reserves as of December 31, 2023, were $\n2.64\n per Mcf, $\n78.22\n per Bbl and $\n28.61\n per Bbl, respectively, before basis differential adjustments.\n120\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nSUPPLEMENTARY INFORMATION - (Continued)\nDuring 2022, we acquired \n2,926\n Bcfe, primarily related to the Marcellus Acquisition. We recorded extensions and discoveries of \n82\n Bcfe, primarily related to new PUDs and previously unproved producing wells in emerging plays. We recorded \n2,155\n Bcfe of upward revisions of previous estimates, which consisted of \n866\n Bcfe of revisions to PUDs, primarily due to development plan optimization through prioritizing longer laterals and multi-well pad development in the Haynesville, \n1,156\n Bcfe of revisions to existing or new proved developed properties, primarily due to performance and \n133\n Bcfe of revisions due to higher natural gas, oil and NGL prices in 2022. The natural gas, oil and NGL prices used in computing our reserves as of December 31, 2022, were $\n6.36\n per Mcf, $\n93.67\n per Bbl and $\n43.58\n per Bbl, respectively, before basis differential adjustments.\nStandardized Measure of Discounted Future Net Cash Flows \nAccounting Standards Codification Topic 932 prescribes guidelines for computing a standardized measure of future net cash flows and changes therein relating to estimated proved reserves. Expand Energy has followed these guidelines which are briefly discussed below.\nFuture cash inflows and future production and development costs as of December 31, 2024, 2023 and 2022 were determined by applying the average of the first-day-of-the-month prices for the 12 months of the year and year-end costs to the estimated quantities of natural gas, oil and NGL to be produced. Actual future prices and costs may be materially higher or lower than the prices and costs used. For each year, estimates are made of quantities of proved reserves and the future periods during which they are expected to be produced based on continuation of the economic conditions applied for that year. Estimated future income taxes are computed using current statutory income tax rates including consideration of the current tax basis of the properties and related carryforwards, giving effect to permanent differences and tax credits. The resulting future net cash flows are reduced to present value amounts by applying a 10% annual discount factor.\nThe assumptions used to compute the standardized measure are those prescribed by the Financial Accounting Standards Board and do not necessarily reflect our expectations of actual revenue to be derived from those reserves nor their present worth. The limitations inherent in the reserve quantity estimation process, as discussed previously, are equally applicable to the standardized measure computations since these estimates reflect the valuation process.\nThe following summary sets forth our future net cash flows relating to proved natural gas, oil and NGL reserves based on the standardized measure:\nYears Ended December 31,\n2024\n2023\n2022\nFuture cash inflows\n$\n24,213\n \n(a)\n$\n14,659\n \n(b)\n$\n76,626\n \n(c)\nFuture production costs\n(\n7,007\n)\n(\n3,326\n)\n(\n10,177\n)\nFuture development costs\n(\n3,537\n)\n(d)\n(\n2,779\n)\n(e)\n(\n5,343\n)\n(f)\nFuture income tax provisions\n(\n119\n)\n(\n174\n)\n(\n10,440\n)\nFuture net cash flows\n13,550\n \n8,380\n \n50,666\n \nLess effect of a 10% discount factor\n(\n6,019\n)\n(\n3,903\n)\n(\n24,361\n)\nStandardized measure of discounted future net cash flows\n$\n7,531\n \n$\n4,477\n \n$\n26,305\n \n___________________________________________\n(a)    Calculated using prices of $\n2.13\n per Mcf of natural gas, $\n75.48\n per Bbl of oil and $\n75.48\n per Bbl of NGL, before basis differential adjustments.\n(b)    Calculated using prices of $\n2.64\n per Mcf of natural gas, before basis differential adjustments.\n(c)    Calculated using prices of $\n6.36\n per Mcf of natural gas, $\n93.67\n per Bbl of oil and $\n43.58\n per Bbl of NGL, before basis differential adjustments.\n(d)    Included approximately $\n1,625\n million of future plugging and abandonment costs as of December 31, 2024.\n(e)    Included approximately $\n730\n million of future plugging and abandonment costs as of December 31, 2023. \n(f)    Included approximately $\n979\n million of future plugging and abandonment costs as of December 31, 2022.\n \n121\nTABLE OF CONTENTS\nEXPAND ENERGY CORPORATION AND SUBSIDIARIES\nSUPPLEMENTARY INFORMATION - (Continued)\nThe principal sources of change in the standardized measure of discounted future net cash flows are as follows:\nYears Ended December 31,\n2024\n2023\n2022\nStandardized measure, beginning of period\n$\n4,477\n \n$\n26,305\n \n$\n12,287\n \nSales of natural gas and oil produced, net of production costs\n  and gathering, processing and transportation\n(a)\n(\n1,521\n)\n(\n2,171\n)\n(\n8,116\n)\nNet changes in prices and production costs\n(\n2,266\n)\n(\n23,535\n)\n14,256\n \nExtensions and discoveries, net of production and \n  development costs\n50\n \n182\n \n251\n \nChanges in estimated future development costs\n652\n \n346\n \n(\n1,512\n)\nPreviously estimated development costs incurred during the period\n396\n \n818\n \n690\n \nRevisions of previous quantity estimates\n(\n922\n)\n(\n205\n)\n6,697\n \nPurchase of reserves-in-place\n5,409\n \n77\n \n7,047\n \nSales of reserves-in-place\n—\n \n(\n7,158\n)\n(\n402\n)\nAccretion of discount\n457\n \n3,270\n \n1,371\n \nNet change in income taxes\n58\n \n6,301\n \n(\n4,972\n)\nChanges in production rates and other\n741\n \n247\n \n(\n1,292\n)\nStandardized measure, end of period\n(a)\n$\n7,531\n \n$\n4,477\n \n$\n26,305\n \n___________________________________________\n(a)    Excludes gains and losses on derivatives. Production costs includes severance and ad valorem taxes.\n122\nTABLE OF CONTENTS\nItem 9.\nChanges In and Disagreements with Accountants on Accounting and Financial Disclosure\nNot applicable.\nItem 9A.\nControls and Procedures\nEvaluation of Disclosure Controls and Procedures\nWe maintain disclosure controls and procedures designed to ensure that information required to be disclosed in reports we file or submit under the Securities Exchange Act of 1934, as amended (the “Exchange Act”), is recorded, processed, summarized and reported within the time periods specified in SEC rules and forms, and that such information is accumulated and communicated to management, including our principal executive and principal financial officers, as appropriate, to allow timely decisions regarding required disclosure.\nAs of the end of the period covered by this report, we carried out an evaluation, under the supervision and with the participation of management, including our Chief Executive Officer and Chief Financial Officer, of the effectiveness of the design and operation of our disclosure controls and procedures pursuant to Exchange Act Rule 13a-15(b). Based on that evaluation, our Chief Executive Officer and Chief Financial Officer concluded as of December 31, 2024 that our disclosure controls and procedures were effective.\nChanges in Internal Control Over Financial Reporting\nThere were no changes in our internal control over financial reporting that occurred during the quarter ended December 31, 2024 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nManagement’s Report on Internal Control Over Financial Reporting\nIt is the responsibility of the management of Expand Energy Corporation to establish and maintain adequate internal control over financial reporting (as defined in Rule 13a-15(f) under the Securities Exchange Act of 1934).  Management utilized the Committee of Sponsoring Organizations of the Treadway Commission's \nInternal Control-Integrated Framework\n (2013) in conducting the required assessment of effectiveness of the Company's internal control over financial reporting.\nManagement has performed an assessment of the effectiveness of the Company's internal control over financial reporting and has determined the Company’s internal control over financial reporting was effective as of December 31, 2024.\nManagement’s assessment and conclusion on the effectiveness of the Company’s internal control over financial reporting as of December 31, 2024 excludes an assessment of the internal control over financial reporting of Southwestern Energy, which was acquired in a business combination on October 1, 2024. Southwestern Energy represents approximately 56% of our consolidated total assets as of December 31, 2024 and approximately 35% of our consolidated revenues for the year ended December 31, 2024.\nThe effectiveness of our internal control over financial reporting as of December 31, 2024 has been audited by PricewaterhouseCoopers LLP, an independent registered public accounting firm, as stated in its report which appears herein. \n/s/ DOMENIC J. DELL'OSSO, JR.\nDomenic J. Dell'Osso, Jr.\nPresident and Chief Executive Officer\n/s/ MOHIT SINGH\nMohit Singh\nExecutive Vice President and Chief Financial Officer\nFebruary 26, 2025\nItem 9B.\nOther Information\nRule 10b5-1 Trading Arrangements\n123\nTABLE OF CONTENTS\nDuring the three months ended December 31, 2024, no director or officer of the Company \nadopted\n or \nterminated\n a “Rule 10b5-1 trading arrangement” or “non-Rule 10b5-1 trading arrangement”, as each term is defined in Item 408 of Regulation S-K.\nCompensatory Arrangements\nOn February 21, 2025, our Compensation Committee approved a supplement to outstanding restricted stock unit and performance share unit award agreements under the LTIP (the “Global Supplement”) held by certain of our employees, including our executive officers. The Global Supplement provides for a pro rata acceleration and vesting of such awards in connection with a termination by the Company without Cause (as defined in the LTIP); provided, however, that such acceleration will not apply (1) if the holder of such awards has not been employed for at least one year as of the date of termination or (2) if such awards are already subject to full acceleration pursuant to another agreement with the Company.\nThis summary of the Global Supplement does not purport to be complete and is subject to, and qualified in its entirety by reference to, the full text of the Global Supplement, which is filed as Exhibit 10.34 to this Annual Report on Form 10-K and incorporated herein by reference.\nItem 9C.\nDisclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\nPART III\nItem 10.\nDirectors, Executive Officers and Corporate Governance\nThe names of executive officers of the Company and their ages, titles and biographies as of the date hereof are incorporated by reference from Item 1 of Part I of this report. The other information called for by this Item 10 is incorporated herein by reference to the definitive proxy statement to be filed by Expand Energy pursuant to Regulation 14A of the General Rules and Regulations under the Securities Exchange Act of 1934 no later than 120 days following the fiscal year ended December 31, 2024 (the “2025 Proxy Statement”).\nCode of Business Conduct\nThe Company has adopted a Code of Business Conduct that applies to all of its officers, directors and employees. We have posted a copy of our Code of Business Conduct on the “Sustainability” section of our website at www.expandenergy.com. Any amendments to, or waivers from, our Code of Business Conduct that apply to our executive officers and directors will be posted on the “Sustainability” section of our website at www.expandenergy.com. Note that the information on the Company’s website is not incorporated by reference into this filing.\nItem 11.\nExecutive Compensation\nThe information called for by this Item 11 is incorporated herein by reference to the 2025 Proxy Statement.\nItem 12.\nSecurity Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information called for by this Item 12 is incorporated herein by reference to the 2025 Proxy Statement.\nItem 13.\nCertain Relationships and Related Transactions, and Director Independence\nThe information called for by this Item 13 is incorporated herein by reference to the 2025 Proxy Statement.\nItem 14.\nPrincipal Accountant Fees and Services\nThe information called for by this Item 14 is incorporated herein by reference to the 2025 Proxy Statement.\n124\nTABLE OF CONTENTS\nPART IV\nItem 15.\nExhibits and Financial Statement Schedules\n \n____________________________________________\n(a)    The following financial statements, financial statement schedules and exhibits are filed as a part of this report:\n1.\nFinancial Statements\n. Expand Energy's consolidated financial statements are included in \nItem 8 of Part II\n of this report. Reference is made to the accompanying Index to Financial Statements.\n2.\nFinancial Statement Schedules\n. No financial statement schedules are applicable or required.\n3.\nExhibits\n. The exhibits listed below in the Index of Exhibits are filed, furnished or incorporated by reference pursuant to the requirements of Item 601 of Regulation S-K.\nINDEX OF EXHIBITS\n \n \nIncorporated by Reference\n \nExhibit\nNumber\nExhibit Description\nForm\nSEC File\nNumber\nExhibit\nFiling Date\nFiled or\nFurnished\nHerewith\n2.1\nFifth Amended Joint Plan of Reorganization of Chesapeake Energy Corporation and its Debtor Affiliates Pursuant to Chapter 11 of the Bankruptcy Code (Exhibit A of the Confirmation Order).\n8-K\n001-13726\n2.1\n1/19/2021\n2.2\nPartnership Interest Purchase Agreement by and among The Jan & Trevor Rees-Jones Revocable Trust, Rees-Jones Family Holdings, LP, Chief E&D Participants, LP, and Chief E&D (GP) LLC (collectively, as Sellers) and Chesapeake Energy Corporation and its affiliates, dated as of January 24, 2022.\n10-K\n001-13726\n10.36\n2/24/2022\n2.3\nMembership Interest Purchase Agreement by and among Radler 2000 Limited Partnership and Tug Hill, Inc., together as Sellers, and Chesapeake Energy Corporation and its affiliates, dated as of January 24, 2022.\n10-K\n001-13726\n10.37\n2/24/2022\n2.4\nMembership Interest Purchase Agreement by and among Radler 2000 Limited Partnership and Tug Hill, Inc., together as Sellers, and Chesapeake Energy Corporation and its affiliates, dated as of January 24, 2022.\n10-K\n001-13726\n10.38\n2/24/2022\n2.5*\nAgreement and Plan of Merger, dated as of January 10, 2024, among Chesapeake Energy Corporation, Hulk Merger Sub, Inc., Hulk LLC Sub, LLC, and Southwestern Energy Corporation\n8-K\n001-13726\n2.1\n1/11/2024\n3.1\nThird \nAmended and Restated Certificate of Incorporation of Expand Energy Corporation.\n8-K\n001-13726\n3.1\n10/1/2024\n3.2\nThird Amended and Restated Bylaws of Expand Energy Corporation.\n8-K\n001-13726\n3.2\n10/1/2024\n4.1\nDescription of Securities.\n8-A\n001-13726\nN/A\n2/9/2021\n125\nTABLE OF CONTENTS\n10.1\nRestructuring Support Agreement, dated June 28, 2020.\n8-K\n001-13726\n10.1\n6/29/2020\n10.2\nBackstop Commitment Agreement, dated June 28, 2020 (Exhibit 4 to the Restructuring Support Agreement).\n8-K\n001-13726\n10.1\n6/29/2020\n10.3\nRegistration Rights Agreement, dated as of February 9, 2021, by and among Chesapeake Energy Corporation and the other parties signatory thereto.\n8-K\n001-13726\n10.2\n2/9/2021\n10.4\nClass A Warrant Agreement, dated as of February 9, 2021, between Chesapeake Energy Corporation and Equiniti Trust Company.\n8-K\n001-13726\n10.3\n2/9/2021\n10.5\nClass B Warrant Agreement, dated as of February 9, 2021, between Chesapeake Energy Corporation and Equiniti Trust Company.\n8-K\n001-13726\n10.4\n2/9/2021\n10.6\nClass C Warrant Agreement, dated as of February 9, 2021, between Chesapeake Energy Corporation and Equiniti Trust Company.\n8-K\n001-13726\n10.5\n2/9/2021\n10.7\nForm of Indemnity Agreement.\nX\n10.8†\nExpand Energy Corporation 2021 Long Term Incentive Plan.\nX\n10.9\nPurchase Agreement, dated as of February 2, 2021, by and among Chesapeake Escrow Issuer LLC, and Goldman Sachs & Co. LLC, RBC Capital Markets, LLC, as representatives of the purchasers signatory thereto, with respect to 5.5% Senior Notes due 2026 and 5.875% Senior Notes due 2029.\n10-K\n001-13726\n10.10\n3/1/2021\n10.10\nIndenture dated as of February 5, 2021, among Chesapeake Escrow Issuer LLC, as issuer, the guarantors signatory thereto, and Deutsche Bank Trust Company Americas, as Trustee, with respect to 5.5% Senior Notes due 2026 and 5.875% Senior Notes due 2029.\n10-K\n001-13726\n10.11\n3/1/2021\n10.11\nJoinder Agreement, dated as of February 9, 2021, by and among Chesapeake Energy Corporation and the Guarantors party thereto, with respect to 5.5% Senior Notes due 2026 and 5.875% Senior Notes due 2029.\n10-K\n001-13726\n10.12\n3/1/2021\n10.12\nFirst Supplemental Indenture, dated as of February 9, 2021, by and among Chesapeake Energy Corporation, the Guarantors signatory thereto, and Deutsche Bank Trust Company Americas, as Trustee, with respect to 5.5% Senior Notes due 2026 and 5.875% Senior Notes due 2029.\n10-K\n001-13726\n10.13\n3/1/2021\n10.13†\nAmendment to the \nExpand\n Energy Corporation 2021 Long Term Incentive Plan.\nX\n10.14†\nForm of Executive/Employee Restricted Stock Unit Award Agreement for\n Expand Ener\ngy Corporation \n2021 Long Term Incentive Pla\nn.\nX\n126\nTABLE OF CONTENTS\n10.15†\nForm of Non-Employee Director Restricted Stock Unit Award Agreement for \nExpand Energy Corporation \n2021 Long Term Incentive Pla\nn.\nX\n10.16†\nForm of Performance Share Unit Award (Absolute TSR) for \nExpand Energy Corporation \n2021 Long Term Incentive Pla\nn.\nX\n10.17†\nForm of Performance Share Unit Award (Relative TSR) for \nExpand Energy Corporation \n2021 Long Term Incentive Pla\nn.\nX\n10.18†\nExpand \nEnergy Corporation Executive Severance Pla\nn.\nX\n10.19†\nForm of Participation Agreement pursuant to \nExpand\n Energy Corporation Executive Severance Pla\nn.\nX\n10.20†\nSecond Amendment to the Expand Energy Corporation 2021 Long Term Incentive Plan.\nX\n10.21\nSupplemental Indenture, dated as of November 2, 2021, by and among Chesapeake Energy Corporation, the guarantors party thereto and Wilmington Trust, National Association, as Trustee.\n8-K\n001-13726\n4.1\n11/2/2021\n10.22\nSupplemental Indenture, dated as of November 2, 2021, by and among Chesapeake Energy Corporation, the guarantors party thereto and Deutsche Bank Trust Company Americas, as Trustee.\n8-K\n001-13726\n4.2\n11/2/2021\n10.23\nRegistration Rights Agreement dated March 9, 2022, by and among the Company and The Jan & Trevor Rees-Jones Revocable Trust, Rees-Jones Family Holdings, LP, Chief E&D Participants, LP, and Chief E&D (GP) LLC.\n8-K\n001-13726\n10.1\n3/9/2022\n10.24\nRegistration Rights Agreement dated March 9, 2022, by and among the Company and Radler 2000 Limited Partnership.\n8-K\n001-13726\n10.2\n3/9/2022\n10.25\nForm of Dealer Manager Agreement in connection with exchange offers for Warrants.\nS-4\n333-266961\n10.34\n8/18/2022\n10.26\nForm of Tender and Support Agreement, dated September 12, 2022, in connection with exchange offers for Warrant.\nS-4/A\n333-266961\n10.35\n9/12/2022\n10.27\nCredit Agreement, dated as of December 9, 2022, among Chesapeake Energy Corporation, as borrower, JPMorgan Chase Bank, N.A., as administrative agent, and the lenders and other parties thereto.\n8-K\n001-13726\n10.1\n12/12/2022\n10.28†\nForm of \nChesapeake\n Energy Corporation Executive Letter Agreement\n8-K\n001-13726\n10.1\n1/11/2024\n10.29†\nLetter Agreement with Chris Lacy, dated October 11, 2024.\nX\n127\nTABLE OF CONTENTS\n10.30\nIndenture, dated as of December 2, 2024, by and between Expand Energy Corporation and Regions Bank, as Trustee.\n8-K\n001-13726\n4.1\n12/2/2024\n10.31\nFirst Supplemental Indenture, dated as of December 2, 2024, by and between Expand Energy Corporation and Regions Bank, as Trustee (including the form of the Notes).\n8-K\n001-13726\n4.2\n12/2/2024\n10.32\nAgreement No. 1 and Borrowing Base Agreement, dated as of April 29, 2024, among Chesapeake Energy Corporation, JPMorgan Chase Bank, N.A., as Administrative Agent, and the lenders and other parties thereto.\n10-Q\n001-13726\n10.1\n7/29/2024\n10.33\nCredit Agreement, dated as of December 9, 2022 by and among Expand Energy Corporation (f/k/a Chesapeake Energy Corporation), the lenders from time to time party thereto and JPMorgan Chase Bank, N.A., as Administrative Agent\n8-K\n001-13726\n10.1\n11/1/2024\n10.34†\nGlobal Supplement to Awards under the Expand Energy Corporation 2021 Long Term Incentive Plan\nX\n19.1\nExpand Energy Corporation Insider Trading Compliance Policy\nX\n21\nSubsidiaries of \nExpand\n Energy Corporation.\nX\n23.1\nConsent of PricewaterhouseCoopers LLP.\nX\n23.2\nConsent of Netherland, Sewell & Associates, Inc.\nX\n31.1\nDomenic J. Dell’Osso, Jr., President and Chief Executive Officer, Certification pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nX\n31.2\nMohit Singh, Executive Vice President and Chief Financial Officer, Certification pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nX\n32.1**\nDomenic J. Dell’Osso, Jr., President and Chief Executive Officer, Certification pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nX\n32.2**\nMohit Singh, Executive Vice President and Chief Financial Officer, Certification pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nX\n97.1\nExpand Energy Corporation Clawback Policy\nX\n99.1\nAudit Letter of Netherland, Sewell & Associates, Inc.\nX\n101 INS\nInline XBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\nX\n128\nTABLE OF CONTENTS\n101 SCH\nInline XBRL Taxonomy Extension Schema Document.\nX\n101 CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\nX\n101 DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document.\nX\n101 LAB\nInline XBRL Taxonomy Extension Labels Linkbase Document.\nX\n101 PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\nX\n104\nCover Page Interactive Data file (formatted as Inline XBRL and contained in Exhibit 101).\nX\n*\nSchedules have been omitted pursuant to Item 601(a)(5) of Regulation S-K. The registrant hereby undertakes to furnish supplemental copies of any of the omitted schedules upon request by the SEC.\n**\nFurnished herewith.\n†\nManagement contract or compensatory plan or arrangement.\nPLEASE NOTE: Pursuant to the rules and regulations of the Securities and Exchange Commission, we have filed or incorporated by reference the agreements referenced above as exhibits to this Annual Report on Form 10-K. The agreements have been filed to provide investors with information regarding their respective terms. The agreements are not intended to provide any other factual information about Expand Energy Corporation or its business or operations. In particular, the assertions embodied in any representations, warranties and covenants contained in the agreements may be subject to qualifications with respect to knowledge and materiality different from those applicable to investors and may be qualified by information in confidential disclosure schedules not included with the exhibits. These disclosure schedules may contain information that modifies, qualifies and creates exceptions to the representations, warranties and covenants set forth in the agreements. Moreover, certain representations, warranties and covenants in the agreements may have been used for the purpose of allocating risk between the parties, rather than establishing matters as facts. In addition, information concerning the subject matter of the representations, warranties and covenants may have changed after the date of the respective agreement, which subsequent information may or may not be fully reflected in our public disclosures. Accordingly, investors should not rely on the representations, warranties and covenants in the agreements as characterizations of the actual state of facts about Expand Energy Corporation or its business or operations on the date hereof.\nItem 16.\nForm 10-K Summary\nNot applicable.\n129\nSignatures\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nEXPAND ENERGY CORPORATION\nDate: February 26, 2025\nBy:\n \n/s/ DOMENIC J. DELL’OSSO, JR. \n \n \nDomenic J. Dell’Osso, Jr.\nPresident and Chief Executive Officer\n130\nPOWER OF ATTORNEY\nEach person whose signature appears below constitutes and appoints Domenic J. Dell'Osso, Jr. his true and lawful attorney-in-fact and agent, with full power of substitution and resubstitution, for him and in his name, place and stead, in any and all capacities, to sign any or all amendments to this Annual Report on Form 10-K, and to file the same, with all, exhibits thereto and other documents in connection therewith, with the Securities and Exchange Commission, granting unto said attorney-in-fact and agent full power and authority to do and perform each, and every act and thing requisite and necessary to be done in and about the premises, as fully to all intents and purposes as he might or could do in person, hereby ratifying and confirming all that said attorneys-in-fact and agents, and each of them, or the substitute or substitutes of any or all of them, may lawfully do or cause to be done by virtue hereof.\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nCapacity\nDate\n/s/  DOMENIC J. DELL’OSSO, JR.\nPresident and Chief Executive Officer \n(Principal Executive Officer)\nFebruary 26, 2025\nDomenic J. Dell’Osso, Jr.\n/s/  MOHIT SINGH\nExecutive Vice President \nand Chief Financial Officer \n(Principal Financial Officer)\nFebruary 26, 2025\nMohit Singh\n/s/ GREGORY M. LARSON\nVice President - Accounting & Controller\n(Principal Accounting Officer)\nFebruary 26, 2025\nGregory M. Larson\n/s/ MICHAEL A. WICHTERICH\nChairman of the Board\nFebruary 26, 2025\nMichael A. Wichterich\n/s/ TIMOTHY S. DUNCAN\nDirector\nFebruary 26, 2025\nTimothy S. Duncan\n/s/ BENJAMIN C. DUSTER, IV\nDirector\nFebruary 26, 2025\nBenjamin C. Duster, IV\n/s/ SARAH A. EMERSON\nDirector\nFebruary 26, 2025\nSarah A. Emerson\n/s/ MATTHEW M. GALLAGHER\nDirector\nFebruary 26, 2025\nMatthew M. Gallagher\n/s/ JOHN D. GASS\nDirector\nFebruary 26, 2025\nJohn D. Gass\n/s/ SYLVESTER P. JOHNSON IV\nDirector\nFebruary 26, 2025\nSylvester P. Johnson IV\n/s/ CATHERINE A. KEHR\nDirector\nFebruary 26, 2025\nCatherine A. Kehr\n/s/ SHAMEEK KONAR\nDirector\nFebruary 26, 2025\nShameek Konar\n/s/ BRIAN STECK\nDirector\nFebruary 26, 2025\nBrian Steck\n131"
  }
}