{
  "ticker": "EXPD",
  "cik": "0000746515",
  "company_name": "EXPEDITORS INTERNATIONAL OF WASHINGTON INC",
  "filing_date": "2025-02-21",
  "accession": "0000950170-25-024750",
  "primary_doc": "expd-20241231.htm",
  "item_sections": {
    "item1a": "ITEM 1A – RI\nSK FACTORS\n\n\nIn addition to the other information set forth in this report, you should carefully consider the following factors, which could materially affect our business, financial condition or results of operations in future periods. The risks described below are not the only risks facing our Company. Additional risks not currently known to us or that we currently deem to be immaterial may also materially adversely affect our business, financial condition or results of operations in future periods.\n\n\nIndustry Risks\n\n\nAny reduction in international commerce or disruption in global trade may adversely impact our business and operating results.\n\n\nExpeditors primarily provides services to customers engaged in international commerce. Everything that affects international trade has the potential to expand or contract our primary markets and adversely impact our operating results. For example, international trade is influenced by:\n\n\n•\ncurrency exchange rates and currency control regulations;\n\n\n•\ninterest rate fluctuations;\n\n\n•\nchanges and uncertainties in governmental policies and inter-governmental disputes, which could result in increased tariff rates, quota restrictions, trade barriers and other types of restrictions;\n\n\n•\nchanges in and application of international and domestic customs, trade and security regulations;\n\n\n•\nwars, strikes, civil unrest, acts of terrorism, and other conflicts;\n\n\n•\nchanges in labor and other costs, including the impacts of inflation;\n\n\n•\nincreased global concerns regarding working conditions and environmental sustainability;\n\n\n•\nchanges in consumer attitudes regarding goods made in countries other than their own;\n\n\n•\nchanges in availability of credit; and\n\n\n•\nchanges in the price and readily available quantities of oil and other petroleum-related products.\n\n\nOur industry is highly competitive, and failure to compete or respond to customer requirements could damage our business and results of operations.\n\n\nThe global logistics services industry is intensely competitive and is expected to remain so for the foreseeable future. There are a large number of companies competing in one or more segments of the industry, but the number of firms with a global network that offer a full complement of logistics services is more limited. Nevertheless, many of these competitors have significantly more resources than Expeditors and may pursue acquisition opportunities and are developing new technologies to gain competitive advantages. Depending on the location of the shipper and the importer, we must compete against niche players, larger entities including carriers, and emerging technology companies. The primary competitive factors are price and quality of service. Many larger customers utilize the services of multiple logistics providers. Customers regularly solicit bids from competitors in order to improve service and to secure favorable pricing and contractual terms such as: longer payment terms; fixed-price arrangements; higher or unlimited liability limits; broad indemnity undertakings; heightened cybersecurity and data privacy obligations; and performance penalties. Increased competition and competitors' acceptance of expanded contractual terms coupled with customers’ dissatisfaction with elevated rates, scarce capacity, and extended transit times could result in loss of business, reduced revenues, reduced margins, higher operating costs or loss of market share, any of which would damage our results of operations, cash flows and financial condition.\n\n\n17\n.\n\n\n\n\n \n\n\nOperational Risks\n\n\nWe are dependent on our personnel and any inability to hire, develop or retain our key employees may have a negative impact on our operations.\n\n\nIn the long term, identifying, recruiting, hiring, training, and retaining employees is essential to our ability to operate and deliver our services, our ability to grow and ultimately our future profitability. We require employees to work in the office, while other companies may allow fully or partially remote-work policies. As a result of those individuals who prefer working remotely, we may experience a higher degree of turnover of employees and this could inhibit our ability to identify, recruit, and hire new employees over time. Additionally, we may incur higher compensation-related expense to recruit and retain employees and incur additional significant expense to hire third parties to perform tasks that have historically been performed by our employees.\n\n\nWe believe that our compensation programs are among the unique characteristics responsible for differentiating our performance from that of many of our competitors. Significant changes to compensation programs or significant declines in our operating income or operating losses could impact our ability to attract and retain key personnel.\n\n\nEffective succession planning is an important element of our programs. Failure to ensure an effective transfer of knowledge and smooth transitions involving key employees could adversely affect our business by hindering our ability to execute our business strategies and impacting our level of service. We must continue to develop and retain management personnel to address issues of succession planning.\n\n\nWe cannot predict how management’s responses to these challenges will ultimately impact our Company culture, financial position, results of operations and cash flows or our ability to successfully attract and retain key employees in the future.\n\n\nWe rely heavily upon the flexibility and sophistication of the technologies used in our core business and failure to properly manage, enhance and update technologies could lead to disruptions in our operations or our ability to remain competitive.\n\n\nExpeditors relies heavily and must compete based upon the flexibility and sophistication of the technologies utilized in performing our core businesses. Future results depend on our success in developing competitive and reliable systems to address the needs of our customers and suppliers. Development and maintenance of these systems must be accomplished in a cost-effective manner and support the use of secure protocols, including integration and availability of third-party technology. We are continually improving and enhancing our systems and processes, including meaningful upgrades to core operating and accounting systems and remediation of internal control deficiencies. These efforts are inherently complex and, if not managed properly, could lead to disruptions in our operations or our ability to remain competitive.\n\n\nAny significant disruptions or unapproved third-party access to our network and systems continuity could have an adverse impact to our business and financial results.\n\n\nAs our employees, our customers and suppliers continue to increase reliance on systems, and as additional features are added, the risks also increase. Any significant disruptions or unapproved third-party access to our global systems or the internet for any reason, which could include equipment or network failures; co-location facility failures; power outages; sabotage; government interference, employee error or other actions; cyber-attacks or other security breaches; reliance on third party technology; geo-political activity or natural disasters; all of which could have a material negative effect on our results. In February 2022, we were the subject of a targeted cyber-attack. Upon discovering the incident, we shut down most of our operating systems globally to manage the safety of our overall global systems environment. This shutdown and any such future events are likely to result in loss of revenue; business disruptions (such as the inability to timely process shipments); and significant remediation costs. This cyber-attack, or any future cyber-attack could also result in increased vulnerability to attempts of fraud, legal claims and proceedings including potential breach of contract claims, reporting delays or errors; interference with regulatory reporting; an increase in costs to protect our systems and technology; or damage to our reputation.  A future cyber-attack may also result in the destruction or exfiltration of our data as well as that of our customers and service providers.\n \n\n\n18\n.\n\n\n\n\n \n\n\nWe rely on service providers, including air, ocean, ground freight carriers and others and if they have insufficient capacity available relative to market demand or have reduced capacity to provide service, it may adversely impact our business and operating results.\n\n\nAs a non-asset-based provider of global logistics services, Expeditors depends on a variety of carriers and other service providers, including air, ocean and ground freight carriers. Our ability to deliver our services depends on service providers having sufficient capacity available to purchase. The quality and profitability of our services depend upon effective selection and oversight of our service providers. When market demand significantly exceeds available capacity in a given market, we may not always be able to find acceptable transportation or other service solutions to meet our customers’ needs, or the routing and delivery of freight may be subject to delays that are outside of our control. Quality customer service is a key element of the Company’s success, and such challenges in meeting our customers’ needs and requirements may result in loss of business. Major disruptions to carriers’ operations, such as caused by a global health emergency, could place significant stress on our air, ocean and freight ground carriers, as well as other service providers, which may result in reduced carrier capacity or availability, pricing volatility or more limited carrier transportation schedules and other services that we utilize, which could adversely impact our operations and financial results.\n\n\nFailure to grow and gain profitable market share could adversely impact our ability to remain competitive and could adversely impact our business.\n\n\nExpeditors has historically relied primarily upon organic growth and has tended to avoid growth through acquisition. Future results will depend upon our ability to anticipate and adapt to constantly evolving supply chain requirements and innovations. To continue to grow organically, we must gain profitable market share in a highly competitive environment and successfully develop and market new service offerings. When investment opportunities arise, our success could be dependent on our ability to evaluate and integrate acquisitions.\n\n\nAny disruption of our business caused by a catastrophic event could harm our ability to conduct normal business operations and impact our operating results.\n\n\nA disruption or failure of Expeditors' systems or operations in the event of a major earthquake, weather event, cyber-attack, terrorist attack, strike, civil unrest, mass population dislocation, pandemic or other catastrophic event could cause delays in providing services or performing other mission-critical functions. Our corporate headquarters and certain other critical business operations are in the Puget Sound area of Washington, which is near major earthquake faults. A catastrophic event that results in the destruction or disruption of any of our critical business or information technology systems could harm our ability to conduct normal business operations and our operating results. See “Any significant disruptions to our network and systems continuity could have an adverse impact to our business and financial results” above\n.\n\n\nWe face risks associated with the handling, transporting, and storing of customer inventory including classified dangerous goods and high value commodities.\n\n\nUnder some of our agreements, we maintain and transport the inventory of our customers, some of which may be classified as dangerous goods or high value in nature. Our failure to properly handle and safeguard such inventory exposes us to potential claims and expenses as well as harm to our business and reputation.\n\n\nOur insurance coverage does not cover all potential losses and significant uninsured losses could adversely impact our financial results.\n\n\nWe carry insurance coverage for property damage, personal injury and other insurable events resulting from certain events such as fire, accidents, and other perils under extended coverage policies. Our insurance coverages contain policy specifications and insured limits customarily carried for similar locations, business activities and markets. Though we believe we are adequately insured, certain losses, including losses from floods, earthquakes, acts of war, acts of terrorism or riots, cybersecurity events and pandemics, generally are not insured against or not fully insured against because it is not deemed economically feasible or prudent to do so. In some instances, the value of our customers’ goods stored in a single facility or contained in a single shipment may be high in nature and may exceed our general property damage insurance policy limits. If an uninsured loss or a loss in excess of insured limits occurs with respect to one or more of our facilities in the future, we could experience a significant loss of assets, including customer inventory (inclusive of high value commodities), and future operations could be harmed resulting in a loss of revenues or higher claims and operating expenses.\n\n\nFurthermore, we cannot be sure that the insurance companies will be able to continue to offer products with sufficient coverage at commercially reasonable rates. If we experience a loss that is uninsured or that exceeds insured limits, then we could incur additional expenses or a loss of future revenues from a facility that is damaged. Any such losses or higher insurance costs could adversely affect our business.\n\n\n19\n.\n\n\n\n\n \n\n\nDifficulty in forecasting timing or volumes of customer shipments or rate changes by carriers could adversely impact our margins and operating results.\n\n\nExpeditors is not aware of any accurate means of forecasting short-term customer requirements. However, long-term customer satisfaction depends upon our ability to meet these unpredictable short-term customer requirements. Personnel costs, our single largest expense, are always less flexible in the very near term as we must staff to meet uncertain demand. As a result, short-term operating results could be disproportionately affected.\n\n\nA significant portion of Expeditors' revenues is derived from customers in retail and technology industries whose shipping patterns are tied closely to consumer demand, and from customers in industries whose shipping patterns are dependent upon just-in-time production schedules. Therefore, the timing of our revenues is, to a large degree, impacted by factors out of our control, such as a sudden change in consumer demand for retail goods, changes in trade tariffs, product launches and/or manufacturing production delays. Additionally, many customers ship a significant portion of their goods at or near the end of a quarter, and therefore, we may not learn of a shortfall in revenues until late in a quarter. To the extent that a shortfall in revenues or earnings was not expected by securities analysts or investors, any such shortfall from levels predicted by securities analysts or investors could have an immediate and adverse effect on the trading price of our stock.\n\n\nVolatile market conditions can create situations where rate increases charged by carriers and other service providers are implemented with little or no advance notice. We often cannot pass these rate increases on to our customers in the same time frame, if at all. As a result, our yields and margins can be negatively impacted.\n\n\nClimate change, including measures to address climate change, could adversely impact our business and financial results.\n\n\nThe long-term effects of climate change are difficult to predict and may be widespread. The impacts of climate change may include physical risks (such as rising sea levels, which could affect port operations or frequency and severity of extreme weather conditions, which could disrupt our operations and damage cargo and our facilities), compliance costs and transition risks (such as increased regulation and taxation to support carbon emissions reduction investments), shifts in customer demands (such as customers requiring more fuel efficient transportation modes or transparency to carbon emissions in their supply chains) and customer contractual requirements around environmental initiatives (such as greenhouse gas emission reduction target setting) and other adverse effects. Our non-asset-based model gives us a flexibility and an ability to change locations, modes, and carriers based on evolving operating conditions. However, such impacts may disrupt our operations by adversely affecting our ability to procure services that meet regulatory or customer requirements, depending on the availability of sufficient appropriate logistics solutions.\n\n\nIn addition, the increasing concern over climate change has resulted and may continue to result in more regulations relating to climate change, including regulating greenhouse gas emissions, restrictions on modes of transportation, alternative energy policies and sustainability initiatives, such as the FuelEU Maritime initiative or the EU Emissions Trading System. If, in the United States or in any other jurisdictions in which we operate, legislation or regulations are enacted or promulgated that impose more stringent restrictions and requirements than our current legal or regulatory obligations, we may experience disruptions in, or increases in the costs associated with delivering our services, which may negatively affect our results of operations, cash flows and financial condition.\n\n\nGovernment Regulation and Tax Risks\n\n\nWe are subject to a complex regulatory environment, and failure to comply with and adapt to these regulations could result in penalties or otherwise adversely impact our business.\n\n\nExpeditors is affected by ever increasing regulations from a number of sources in the United States and in foreign locations in which we operate. Many of these regulations are complex and require varying degrees of interpretation, including those related to handling dangerous and hazardous materials, trade compliance, data privacy, environmental, employment, compensation and competition, and may result in unforeseen costs.\n\n\nIn reaction to the continuing global terrorist threat, governments around the world are continuously enacting or updating security regulations. These regulations are multi-layered, increasingly technical in nature and characterized by a lack of harmonization of substantive requirements among various governmental authorities. Furthermore, the implementation of these regulations, including deadlines and substantive requirements, can be driven by regulatory urgencies rather than industry's realistic ability to comply.\n\n\n20\n.\n\n\n\n\n \n\n\nFailure to consistently and timely comply with these regulations, or the failure, breach or compromise of our policies and procedures or those of our service providers or agents, may result in increased operating costs, damage to our reputation, difficulty in attracting and retaining key personnel, restrictions on operations or fines and penalties.\n\n\nWe operate globally and any inability to safeguard our operations or comply with anti-corruption laws and trade compliance regulations would adversely impact our reputation and business.\n\n\nA material portion of Expeditors' revenues and operating income comes from operations conducted outside the United States. To maintain a global service network, we may be required to operate in hostile locations and in dangerous situations. Doing business in foreign locations also subjects us to a variety of risks and considerations not normally encountered by domestic enterprises.\n\n\nIn addition, we operate in parts of the world where common business practices could constitute violations of the anti-corruption laws, rules, regulations and decrees of the United States and of other countries in which we conduct business, including the U.S. Foreign Corrupt Practices Act as well as trade and exchange control laws, or laws, regulations and Executive Orders imposing embargoes and sanctions; and anti-boycott laws and regulations. Compliance with these laws, rules, regulations and decrees is dependent on our employees, service providers, agents, third party brokers and customers, whose individual actions could violate these laws, rules, regulations and decrees. Failure to comply could result in substantial penalties and additional expenses, damage to our reputation and restrictions on our ability to conduct business.\n\n\nWe are subject to taxation in multiple jurisdictions, and although we believe our tax estimates are reasonable, any adverse determinations in tax audits could negatively impact our financial results.\n\n\nExpeditors is subject to income and non-income taxation in the United States (Federal, state and local) as well as many foreign jurisdictions including the People’s Republic of China, including Hong Kong, Taiwan, Vietnam, India, Mexico, Canada, Netherlands and the United Kingdom. In many of these jurisdictions, the tax laws are very complex and are open to different interpretations and application. Tax authorities frequently implement new taxes and change their tax rates and rules, including interpretations of those rules. The Organization for Economic Cooperation and Development (OECD) reached agreement among various countries to implement a minimum 15% tax rate on certain multinational enterprises, commonly referred to as Pillar Two. Many countries continue to announce changes in their tax laws and regulations based on the Pillar Two proposals. We are continuing to evaluate the impact of these proposed and enacted legislative changes as new guidance becomes available. Some of these legislative changes could impact our effective tax rate and tax liabilities. Given the numerous proposed tax law changes and the uncertainty regarding such proposed legislative changes, the impact of Pillar Two cannot be determined at this time.\n\n\nThe timing of the resolution of income and non-income tax examinations can be highly uncertain, and the amounts ultimately paid, if any, upon resolution of the issues raised by the taxing authorities, may differ significantly from the amounts recorded. It is reasonably possible that within the next twelve months we will undergo further audits and examinations by various tax authorities and possibly may reach resolution related to income tax examinations covering one or more jurisdictions and years. In recent years, the United States and other foreign governments have made significant changes to tax laws, and more changes are anticipated in future periods. Often, those changes are subject to the issuance of new regulations and interpretations, which adds complexity and uncertainty in calculating tax liabilities.\n \n\n\nWe are regularly under audit by tax authorities, including transfer pricing inquiries. The Indian tax authority (ITA) has asserted that additional tax applies principally related to transfer pricing and transactions between and amongst the Company and its Indian subsidiary and the applicability to an Indian service tax applicable to ocean and air imports and exports. We believe that ITA’s positions are without merit, and we are defending our position vigorously in Indian courts. If these matters are adversely resolved, we would recognize significant additional tax expense including interest and penalties. Although we believe our tax estimates are reasonable, the final determination of tax audits, including any potential penalties and interest, could be materially different from our tax provisions and accruals and negatively impact our financial results. We cannot currently provide an estimate of the range of possible outcomes.\n\n\nCurrent economic and political conditions make tax laws and regulations, or their interpretation and application, in any jurisdiction subject to significant change. Changes in tax laws or statutory tax rates, competing tax regimes, variability in the mix of pretax earnings we generate in the U.S, as compared to other countries, or new taxes in the United States or foreign jurisdictions could result in additional tax liabilities, or increased volatility in our effective tax rate and total tax expense.\n\n\n21\n.\n\n\n\n\n \n\n\nGeneral Risks\n\n\nInvestigations and litigation could require management time and or to incur substantial legal costs or fines, penalties or damages, any of which could adversely impact on our financial results.\n\n\nAs a multinational corporation, Expeditors is subject to formal or informal investigations from governmental authorities or others in the countries in which we do business. In addition, we may become subject to civil litigation with our customers, service providers and other parties with whom we do business. These investigations and litigation may require significant management time and could cause us to incur substantial additional legal and related costs, which may include fines, penalties or damages that could have a materially adverse impact on our financial results.\n\n\nGlobal health emergencies on the scale of the COVID-19 pandemic may significantly impact worldwide economic conditions and global trade and can have a disruptive effect on our operations, and the operations of our service providers and our customers, which may impact our business.\n\n\nWe may be impacted by a global health emergency, similar to the scale of what we experienced during the COVID-19 pandemic. Significant global health emergencies may prompt governments around the world to mandate lockdowns and implement other restrictions that can have a direct impact on international trade. Such government restrictions may contribute to shortages of both labor and capacity and increase costs that impact our operations.  Any significant global health emergency on the scale of the COVID- 19 pandemic could negatively affect our business and our financial results. Such a disruptions could also have the effect of heightening many of the other risks described above.\n\n\nWe identified material weaknesses in our internal control over financial reporting related to ineffective information technology general controls which, if not remediated appropriately or timely, could result in loss of investor confidence and adversely impact our stock price.\n\n\nInternal controls related to the operation of technology systems are critical to maintaining adequate internal control over financial reporting. As disclosed in Part II,",
    "item1": "ITEM 1—B\nUSINESS\n\n\nOverview\n\n\nExpeditors International of Washington, Inc. (herein referred to as \"Expeditors,” the \"Company,\" \"we,\" \"us,\" \"our\") provides a full suite of global logistics services, offering customers access to an international network of people and integrated information systems to support the movement and strategic positioning of goods. As a third-party logistics provider, we purchase cargo space from carriers (such as airlines, ocean shipping lines, and trucking lines) on a volume basis and resell that space to our customers. We do not compete for overnight courier or small parcel business and do not own aircraft or ships.\n\n\nWe provide a broad range of transportation services and customer solutions, such as customs brokerage, order management, time-definite transportation, warehousing and distribution, temperature-controlled transit, cargo insurance, specialized cargo monitoring and tracking, and other customized logistics and consulting solutions. In addition, our Project Cargo unit handles special project shipments that move via a single method or combination of air, ocean, and/or ground transportation and generally require a high level of specialized attention because of the unusual size or nature of what is being shipped.\n \n\n\nExpeditors' primary services include:\n\n\n•\nAirfreight Services\n\n\n•\nOcean Freight and Ocean Services\n\n\n•\nCustoms Brokerage and Other Services\n\n\nAirfreight Services: \nWithin airfreight, Expeditors typically acts either as a freight consolidator or as an agent for the airline that carries the shipment. Whether acting as a consolidator or agent, we offer our customers routing expertise, familiarity with local business practices, knowledge of export and import documentation and procedures, the ability to arrange for ancillary services and to assist with securing capacity during periods of high demand.\n\n\nSolutions within Airfreight Services include:\n\n\nAirfreight Consolidation: \nas an airfreight consolidator, Expeditors purchases cargo capacity from airlines on a volume basis and resells that space to our customers at lower rates than what those customers could negotiate directly from the airlines on an individual shipment. Expeditors determines the routing, consolidates shipments bound for a particular airport distribution point, and then selects the airline for transportation to the distribution point, where either we or one of our agents then arranges for the consolidated lot to be broken down into its component shipments and for the transportation of each individual shipment to its final destination.\n\n\nAirfreight Forwarding\n: as a freight forwarder, Expeditors receives and forwards individual, unconsolidated shipments, and arranges the transportation with the airline that carries the shipment.\n\n\n3\n.\n\n\n\n\n \n\n\nOcean Freight and Ocean Services: \nWithin ocean services, Expeditors offers three basic services: ocean freight consolidation, direct ocean forwarding, and order management:\n\n\nOcean freight consolidation\n:\n \nExpeditors, when acting\n \nas an ocean freight consolidator, contracts with ocean shipping carriers to obtain transportation for an allocation of containers between various points during a specified time period at agreed-upon rates. We handle both full container loads as well as Less-than Container Load (LCL) freight, offering a wide range of shipping options and rates. We also generate fees for ancillary services such as the preparation of documentation to comply with local export and import laws.\n\n\nDirect ocean forwarding\n:\n \nExpeditors acts as the agent when its customer contracts directly with the ocean carrier. We receive fees for customer handling and ancillary services and may also receive a commission from the carrier.\n\n\nOrder management\n:\n \nExpeditors provides a range of order management services including consolidation of cargo from many suppliers in a particular origin into the fewest possible number of containers, putting more product into larger and fewer containers in order to maximize space, minimize cost and help our customers reduce their carbon footprint.\n\n\nCustoms Brokerage and Other Services:\n Expeditors offers a range of custom solutions, including:\n\n\nCustoms Brokerage and Import Services: \nExpeditors helps customers clear shipments through customs by preparing and filing required documentation, calculating, and providing for payment of duties and other taxes on behalf of the customer as well as arranging for any required inspections by governmental agencies, and import services such as arranging for local pick up, storage and delivery at destinations. Such services can include screening commercial documentation for assessed value, country of origin, application of special trade programs, and classification. Our target market is primarily comprised of customers looking to reduce the number of customs brokers used, those looking to improve compliance and reporting, and those seeking opportunities to participate in special trade programs globally.\n\n\nTranscon: \nExpeditors' Transcon consists of intra-continental ground transportation, including time-definite less-than-truck and full-truck solutions.\n\n\nWarehousing and Distribution Services: \nExpeditors’ services include inventory management, multi-channel order fulfillment, vendor managed inventory programs, and other value-added services. Our warehousing services are generally offered globally in multi-client facilities so that customers may benefit from cost savings related to shared space, labor, equipment, and other efficiencies.\n\n\n4\n.\n\n\n\n\n \n\n\nRevenues\n\n\nThe following chart shows our 2024 revenues by service type:\n\n\n\n\nThe Expeditors Network\n\n\nExpeditors has approximately 18,000 employees and provides a complete range of global logistics services to a diversified group of customers that vary in size, industry and geographic location. As opportunities for profitable growth arise, we will continue to open new offices where it makes sense to support existing global customers and serve new local markets. As a knowledge-based global provider of logistics services, we have often concluded over the course of our history that it is better to grow organically rather than by acquisition. When we have made acquisitions, it has generally been to obtain technology or gain specialized industry expertise that could be leveraged to benefit our entire network.\n\n\nExpeditors, including its majority-owned subsidiaries, is organized functionally in geographic operating segments and operates district offices in the regions identified below. Our district offices are defined by geographic boundaries and have been established in locations where Expeditors maintains unilateral control over operations, and where the existence of the parent-subsidiary relationship is maintained by means other than record ownership of voting stock.\n\n\nExpeditors operates 172 district offices in the following geographic areas of responsibility:\n\n\n•\nAmericas (70)\n\n\n•\nNorth Asia (17)\n\n\n•\nSouth Asia (16)\n\n\n•\nEurope (45)\n\n\n•\nMiddle East, Africa and India (24)\n\n\n5\n.\n\n\n\n\n \n\n\nWe also maintain branch offices, which are aligned with and dependent upon one district office, where practical benefit is gained by having staff located closer to the customers they are serving. Additionally, we contract with independent agents in locations where we do not have our own offices to provide required services for our existing customers. We have established 35 such relationships worldwide.\n\n\nAt Expeditors, we create our strategy and develop our global products and services; processes; technology; and compliance programs at the corporate level, in order to drive consistency across all levels of the organization. Global consistency and compliance are fundamental to preserving our culture and network of people, processes, technology and locations. We leverage regional and local expertise by staffing our districts principally with local managers and personnel who are from the regions in which they operate and who often have extensive experience in logistics, coupled with a deep understanding of their local market. District offices are responsible for selling and executing Expeditors' products and services directly to customers and are involved in the selection of logistics service providers. Defining our strategy at a global level while executing it at the regional and local levels with customized supply chain solutions enables us to drive consistency and efficiency for our network and customers. We believe that focus on hiring and developing a diverse and talented workforce with an emphasis on exceptional customer service, along with our incentive-based compensation program, enables us to achieve superior financial results and provide for ongoing career advancement opportunities.\n\n\nOur Culture and Strategy\n\n\nWe believe that our unique culture, at the center of which are our employees, is a critical component to our continued success. We strongly believe that it is nearly impossible to predict events that, individually or in the aggregate, could have a positive or a negative impact on our future operations. As a result, management's focus is on building and maintaining a global corporate culture and an environment where well-trained employees and managers are prepared to identify and react to changes as they develop and thereby help us adapt and thrive as major trends emerge.\n \n\n\nExpeditors’ strategic plan is to achieve long-term, sustainable and profitable growth by focusing on the right markets and, within each market, on the right customers that lead to profitable business growth through the aggressive marketing of our service offerings. Innovative solutions, integrated platforms and data quality are vital to achieving a competitive advantage. Our teams are aligned on the specific markets of these focused priorities; on the targeted accounts within those markets; and on ways that we can continue to differentiate ourselves from our competitors. Our key strategic initiatives include:\n\n\n1.\nEnsuring that base-line strategies for air, ocean and customs services for every district office and region lead to growth at sustainable and competitive market rates, profits and volumes by services.\n\n\n2.\nGrowing our business services into and out of Europe, with particular focus on certain defined markets beyond our base-line growth expectations.\n\n\n3.\nGrowing our customs brokerage offering throughout Asia by leveraging our strength and expertise in customs brokerage services and developing critical talent, processes and tools.\n\n\nOur chief strategy officer continues to oversee all strategy within Expeditors, with a deep focus on exploring new avenues for innovation, differentiation and expansion.\n\n\nGlobal Logistics and Supply Chain Technology\n\n\nExpeditors has long believed that it is a competitive advantage to focus on organic growth and to utilize a single enterprise technology platform designed and built by logistics technology professionals for logistics professionals. Our technology platform is built on principles of innovation, agility, collaboration, performance and consistency across the Expeditors global network to meet diverse and complex global logistics and supply chain needs. The platform is comprised of proprietary, third party and open-source technologies. We utilize a globally-consistent infrastructure supporting both centralized and distributed technology strategies that incorporate security, disaster recovery and high availability.\n\n\nExpeditors’ technology platform is designed, coded, tested and implemented by the collaborative efforts of our logistics industry and information technology professionals. Internally developing, maintaining and enhancing technology capabilities is in keeping with Expeditors' long-held belief that it not outsource core functions, with information systems being one of those core functions.\n\n\n6\n.\n\n\n\n\n \n\n\nWe are not dependent on third parties for developing or enhancing our core transportation technology platforms to address our needs or those of our customers. We utilize internally developed and third-party solutions to perform our customs brokerage services, to address country and regional specifications. We continuously monitor emerging technologies for potential applicability to our business. Expeditors also believes that having a single, uniform, globally-connected platform driving logistics operations and providing comprehensive visibility and advanced analytics creates greater efficiency and value, particularly as the value of timely data and insights into that data are increasingly important. We are continually enhancing our systems, including meaningful upgrades to core operating and accounting systems.\n\n\nTailored Solutions\n\n\nAs a non-asset-based logistics services provider, we have considerable flexibility to tailor customer-specific solutions by product. By understanding a customer's logistics and supply chain processes, strategies, and objectives, we identify targeted areas of opportunity for improvement, and deploy the right services and solutions for that customer. These services include our core product offerings of transportation, customs clearance, warehousing and distribution, and order management, along with expertise in supply chain analysis and optimization, trade compliance consulting, cargo insurance, cargo security, and solutions for oversized and heavy-lift freight. Our trained professional employees deliver these services across the globe through our network of district offices using a common technology platform, in conjunction with consistent and efficient operational processes that adhere to the highest standards of compliance while focusing on the individual needs of each customer.\n \n\n\nBecause Expeditors is in the business of optimizing our customers’ freight logistics and supply chains, we focus our sales and engagement strategies on professionals in logistics and supply chain management roles inside of customer organizations. While we drive our sales strategies at a global level, district management of each office is responsible for its own business development, operations, and service execution. We also employ dedicated account management staff who work with existing customers to improve operations and grow new business opportunities.\n\n\nWhat Expeditors Ships\n\n\nThe goods that Expeditors handles are generally a function of the products that dominate international trade between any particular origin and destination. These goods include products from diverse industries, including electronics, high technology, healthcare, aerospace and aviation, manufacturing, oil and energy, automotive, retail consumer goods and fashion. In order to meet customers' complex and industry-specific demands, we utilize industry vertical teams throughout our network that focus on providing tailored solutions to different industries. Industry vertical teams work closely with our regional and district resources to grow our business. No single customer accounts for five percent or more of our revenues.\n\n\nExpeditors' Services in Detail\n\n\nThe following describes in more detail the operations of each of Expeditors’ services:\n\n\nAirfreight Services\n\n\nAirfreight services accounted for approximately 34% and 35% of Expeditors' total revenues in 2024 and 2023, respectively.\n \nWhen performing airfreight services, we typically act either as a freight consolidator or as an agent for the airline that carries the shipment. When acting as a freight consolidator, we purchase cargo capacity from airlines on a volume basis and resell that space to our customers at lower rates than they could obtain directly from airlines on an individual shipment. We then issue a House Airway Bill (HAWB) to our customers as the contract of carriage and separately, we receive a Master Airway Bill from the airline when the freight is physically tendered. When moving shipments between points where the nature or volume of business does not facilitate consolidation, we receive and forward individual shipments as the agent of the airline that carries the shipment. Whether acting as a consolidator or agent, we offer our customers expertise for optimum routing, familiarity with local business practices, knowledge of export and import documentation and procedures, the ability to arrange for ancillary services, and assistance with securing capacity during periods of high demand.\n\n\nIn our airfreight operations, we receive shipments from our customers, determine the routing, consolidate shipments bound for a particular airport distribution point, and select the airline for transportation to the distribution point. At the distribution point, either we or an Expeditors' agent arranges for the consolidated lot to be broken down into its component shipments and for the transportation of the individual shipments to their final destinations.\n\n\n7\n.\n\n\n\n\n \n\n\nWe estimate that our average airfreight consolidation weighs approximately\n \n3,600 pounds and that a typical consolidation includes merchandise from several shippers. Because shipment by air is relatively expensive compared with ocean transportation, air shipments are generally characterized by a high value-to-weight ratio, the need for rapid delivery, or both.\n\n\nAt the origin, Expeditors typically delivers shipments from one of our warehouses to the airline after consolidating the freight into containers or onto pallets. Normally that shipment will then arrive at the destination distribution point within 48-72 hours from the point of origin. During periods of high demand, available cargo capacity from the scheduled air carriers can be limited and backlogs of freight shipments may occur. When these conditions exist, we may charter aircraft to meet customer demand.\n\n\nExpeditors consolidates individual shipments based on weight and volume characteristics in cost-effective combinations. Typically, as the weight or volume of a shipment increases, the cost that we charge per pound/kilo or cubic inch/centimeter decreases. The rates charged by airlines also generally decrease as the weight or volume of the shipment increases. As a result, by aggregating shipments and presenting them to an airline as a single shipment, we are able to obtain a lower rate per pound/kilo or cubic inch/centimeter than what is charged for an individual shipment, while generally offering the customer a lower rate than could be obtained directly from the airline for an unconsolidated shipment.\n\n\nOur airfreight revenues less directly related costs of transportation and other expenses for a consolidated shipment include the differential between the rate that the airline charges Expeditors and the rate that we, in turn, charge our customers, in addition to fees that we charge our customers for ancillary services. Such ancillary services we provide include preparation of shipping and customs documentation, packing, crating, insurance services, and the preparation of documentation to comply with local export laws.\n\n\nExpeditors' management believes that owning aircraft would subject us to undue business risks, including large capital outlays, increased fixed operating expenses, exposure to volatile fuel prices, problems of fully utilizing aircraft and competition with our service providers - the airlines. Because we rely on commercial airlines to transport our shipments, our business may be adversely affected by changes in carrier financial stability, policies and practices such as pricing, payment terms, scheduling, capacity and frequency of service.\n\n\nCarriers' financial results will continue to drive their asset acquisition and deployment strategies, which will impact airfreight pricing and capacity. Most of Expeditors' customers are focused on improving supply-chain efficiency, reducing overall logistics costs by negotiating lower rates and utilizing ocean freight whenever possible. We expect these trends to continue in conjunction with carriers' efforts to manage available capacity and the evolution of consumer purchasing behavior, such as online shopping. Changes in available capacity, periods of high or low demand, or other market disruptions has impacted and could continue to impact our buy and sell rates and challenge our ability to maintain historical unitary profitability.\n\n\nOcean Freight and Ocean Services\n\n\nOcean freight services accounted for approximately 30% and 25% of Expeditors' total revenues in 2024 and 2023, respectively. We operate Expeditors International Ocean, Inc. (EIO), an Ocean Transportation Intermediary, sometimes referred to as a Non-Vessel Operating Common Carrier (NVOCC), which specializes in ocean freight services in most major trade lanes in the world. EIO provides service to and from any location where we have an office or an agent. Ocean freight services are comprised of three basic services: ocean freight consolidation, direct ocean forwarding and order management.\n\n\nOcean freight consolidation\n: As an NVOCC, EIO contracts with ocean shipping lines to obtain transportation for an allocation of containers between various points during a specified time period at an agreed rate. EIO provides full container load services to companies that need access to vessel capacity and flexibility via multiple sailing and service options. Additionally, EIO supports customers that prefer to supplement their carrier strategy with an NVOCC. EIO also leverages the Expeditors global gateway network for the movement of LCL freight for customers needing to ship smaller consignments via ocean. EIO issues a House Ocean Bill of Lading (HOBL) or a House Sea Waybill to customers as the contract of carriage and receives a separate Master Ocean Bill of Lading (MOBL) from the contracted shipping line when freight is physically tendered. Revenues from fees charged to customers for ancillary services that EIO may provide include the preparation of shipping and customs documentation, booking arrangements, packing, crating, insurance services, and the preparation of documentation to comply with local export and import laws. We also charter vessels to support our customers’ special projects needs.\n\n\nDirect ocean forwarding\n: When the customer contracts directly with the ocean carrier, EIO acts as an agent of the customer and derives its revenues from handling fees paid by the customer and, in some cases, commissions paid by the carrier. In such arrangements, EIO does not issue a HOBL or House Sea Waybill. Rather, the carrier issues a MOBL directly to the customer who employs EIO to create documentation, manage shipment information and arrange various services to facilitate the shipment of goods. The MOBL shows the customer as the shipper or consignee.\n\n\n8\n.\n\n\n\n\n \n\n\nOrder management\n: Order management provides services that manage consolidation of goods at origin, supplier performance, carrier allocation, carrier performance, container management, document management, delivery management and Order/SKU visibility through our web-based portal. Customers have the ability to monitor and report against near real-time status of orders from the date of creation through final delivery. Item quantities, required ship dates, required delivery dates, commodity descriptions, estimated vs. actual ex-factory dates, container utilization, document creation and visibility are many of the managed functions that are visible and reportable via our web-based portal. Order management is available for various modes of transportation, including ocean, air, truck and rail. Order management revenues are derived from services provided to the shipper, as well as management fees associated with managing order execution against customer specific rules. One basic function of order management involves arranging cargo from many suppliers in a particular origin and “consolidating” these shipments into the fewest possible number of containers to maximize space utilization and minimize cost. Through origin consolidation, customers can reduce the number of containers shipped by putting more product in larger and fewer containers.\n\n\nMultiple carrier acquisitions and alliances have occurred, and certain carriers are entering into onshore services as they pursue scale and additional market share in an effort to improve profitability. Ocean carriers have improved their management of capacity relative to demand in recent years. Carriers also face changes in regulatory requirements such as requiring reductions in the sulfur in marine fuel and the EU emissions trading system, which are increasing their operating and capital costs. Consequently, when the market goes through seasonal peaks or significant disruption and demand exceeds supply, the carriers react by increasing their pricing. This carrier behavior, along with fluctuations in demand, creates pricing volatility that could impact Expeditors' ability to maintain historical unitary profitability.\n\n\nExpeditors’ pricing is based on contract negotiations each year with our global carrier partners. Our pricing model is flexible. We purchase based on customer needs, and our carrier strategy determines our volume and pricing commitments. Fixed pricing arrangements are entered into for a portion of our forecasted commitments, while spot market pricing arrangements are typically negotiated at the regional and local levels.\n\n\nWe offer our customers multiple sailing options and services globally to meet their changing needs. With fewer global carriers than in the past, maintaining close relationships with our carrier partners allows us to meet our customers’ space requirements throughout the year, including during peak periods.\n\n\nCustoms Brokerage and Other Services\n\n\nCustoms brokerage and other services accounted for approximately 36% and 40% of Expeditors' total revenues in 2024 and 2023, respectively. As a customs broker, we assist our customers in clearing shipments through customs by preparing and filing required information and documentation, calculating and providing for payment of duties and other taxes on behalf of the customer, arranging required inspections by governmental agencies, and providing import services such as pick up, storage and delivery services, including value-added services, at destinations. We provide customs brokerage services in conjunction with transportation services or independently. Expeditors supports regulatory compliance and visibility to the supply chain through process and system controls, technology, and licensed and trained professional oversight. We offer a customized, solutions-based approach to our customers, based on the complexity of their business. Our pricing reflects this complexity and scope, in addition to the number of declarations filed.\n\n\nWe also provide other value-added services within our network, such as warehousing and distribution, Transcon and consulting services. Expeditors' warehousing and distribution services include inventory management, multi-channel order fulfillment, vendor managed inventory programs, and other industry-specific, value-added services. Our warehousing services are generally offered in facilities utilized by multiple customers so that customers may benefit from cost savings related to shared space, labor, equipment and other efficiencies. Expeditors' Transcon consists of intra-continental ground transportation, including time-definite less-than-truck and full-truck solutions. Expeditors responds to customer-driven trade compliance consulting services requests primarily through Tradewin. Fees for these non-transactional services are based upon hourly billing rates and bids for mutually agreed-upon projects.\n\n\n9\n.\n\n\n\n\n \n\n\nHuman Capital\n\n\nOpportunities for employees and positive work environment\n\n\nExpeditors’ most important asset is its employees. The cornerstone of our company culture is the professional growth and development of our employees. From the inception of our company, management has inherently understood that the elements required for a successful global service organization can only be assured through recruiting, training and ultimately retaining knowledgeable and experienced personnel. We believe that our greatest challenge is now, and always has been, perpetuating a consistent global corporate culture that requires:\n\n\n•\nTotal dedication to providing superior customer service;\n\n\n•\nCompliance with our policies and procedures and government regulations;\n\n\n•\nA positive, safe work environment that is diverse, inclusive and free from discrimination and harassment;\n\n\n•\nOngoing mentoring and development of key employees and management personnel;\n\n\n•\nCreation of unlimited advancement opportunities for employees dedicated to hard work, personal growth and continuous improvement with a focus on promotion from within;\n\n\n•\nTraining, development and engagement programs that ensure that our employees understand and remain connected to Expeditors culture and strategic initiatives;\n\n\n•\nIndividual commitment to the identification and mentoring of successors for every key position so that when change occurs, a qualified and well-trained internal candidate is ready to step forward;\n\n\n•\nContinuous identification, design and implementation of system solutions and differentiated service offerings, both technological and otherwise, that place employees in a position to be successful in meeting and exceeding the needs of customers; and\n\n\n•\nFocus on developing processes and technological solutions that maximize the engagement, efficiency and effectiveness of our employees.\n\n\nWe believe in creating and maintaining a positive work environment for employees. That commitment is supported by policies designed to promote fairness and equitable treatment and our supervisors and managers are charged with the responsibility of setting positive examples and providing mentoring with a focus on the importance of compliance. We promote equal employment opportunity and have policies that expressly prohibit unacceptable behaviors, including harassment, intimidation or discrimination of any kind based on race, sex, sexual orientation, gender identity, gender expression, marital status, age, color, religion, creed, national origin, disability, veteran status or any other characteristic protected under applicable law.\n\n\nTo protect our employees, we are committed to maintaining secure business operations globally by following our well-established security standards, maintained and deployed by our Health and Safety team, as well as applicable health and safety laws and regulation. We have mechanisms in place to report accidents, injuries and unsafe working conditions.\n\n\nAs a knowledge-based organization we focus on employees’ professional development through regular performance reviews and training, including mandatory trainings related to compliance; ethics, health and security; specific certifications where required to perform certain duties; supervising skills and development of succession plans of key employees.\n\n\nCompensation and retention\n\n\nWe reinforce these values with a compensation system that rewards employees for profitably managing the things they can control. This incentive-based compensation system has been in place since we became a publicly traded company. There is no limit to how much a key employee can earn for success. We believe in a “real world” environment where the employees of our operating units are held accountable for the profit implications of their decisions. If these decisions result in operating losses, management generally must make up these losses with future operating profits, in the aggregate, before any cash incentive compensation can be earned. Executive management, in limited circumstances, makes exceptions at the district operating unit level. At the same time, our policies, processes and relevant training focus on such things as cargo management, risk mitigation, compliance, sound business decisions, accounts receivable collection, cash flow and credit soundness in an attempt to help managers avoid the kinds of errors that might end a career. To retain the services of highly qualified, experienced, and motivated employees, we place considerable emphasis on our incentive-based compensation programs.\n\n\n10\n.\n\n\n\n\n \n\n\nSince our business is service based, we believe that employee retention remains critical to our long-term success. We evaluate our ability to engage and retain employees by monitoring turnover rates, percentage of positions filled internally, and by regularly conducting employee satisfaction surveys to identify opportunities where we can improve.\n \n\n\nGeographically diverse workforce\n\n\nAt December 31, 2024, Expeditors employed more than 18,000 people, of which approximately 12,000 were employed in international locations. We believe that focus on hiring and developing a diverse and talented workforce coupled with our incentive-based compensation program, enables us to provide exceptional service and superior financial results. We need to leverage regional and local expertise by staffing our districts principally with local managers and personnel who are from the regions in which they operate and who have extensive experience in logistics, coupled with a deep understanding of their local market. This results in a highly talented, inclusive and multi-cultural global workforce that reflects the diverse regions that we serve. Because our business involves shipments between districts and typically touches more than one geographic area, our success requires a high degree of communication and cooperation among our employees globally.\n \n\n\nDistrict Managers are key individuals in our Company, as sales, operational execution and business and expenditure decisions necessary to service our customers are the responsibility of management at each district. The vast majority of our employees are based in our operational districts, geographically distributed as shown below. We have summarized below, the number of employees based on individual headcount as of December 31, 2024, including corporate and information services employees.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nEmployee Count as of December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nUnited States\n\n\n \n\n\n \n\n\n6,350\n\n\n \n\n\n\n\n\n\nOther North America\n\n\n \n\n\n \n\n\n1,550\n\n\n \n\n\n\n\n\n\nLatin America\n\n\n \n\n\n \n\n\n750\n\n\n \n\n\n\n\n\n\nNorth Asia\n\n\n \n\n\n \n\n\n2,250\n\n\n \n\n\n\n\n\n\nSouth Asia\n\n\n \n\n\n \n\n\n1,750\n\n\n \n\n\n\n\n\n\nEurope\n\n\n \n\n\n \n\n\n3,850\n\n\n \n\n\n\n\n\n\nMiddle East, Africa and India\n\n\n \n\n\n \n\n\n1,900\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n \n\n\n18,400\n\n\n \n\n\n\n\n\n\nCompetition\n\n\nThe global logistics services industry is intensely competitive and is expected to remain so for the foreseeable future. There are a large number of companies competing in one or more segments of the industry, but the number of firms with a global network that offer a full complement of logistics services is more limited. Certain air and ocean carriers periodically enter into onshore services as they pursue more profitable and less commoditized market segments to provide balance against their incumbent asset-based offerings. Further, there are new technology-based competitors that have entered the industry with substantial capital funding, with the intent to compete on a global level. Some of our competitors have significantly more resources than Expeditors. Depending on the location of the shipper and the importer, Expeditors must compete against both the niche players and larger entities. The industry continues to experience consolidations into larger firms striving for stronger and more complete multinational and multi-service networks. However, regional and local competitors still maintain a strong presence in certain markets.\n\n\nThe primary competitive factors in the global logistics services industry continue to be price and quality of service, including reliability, responsiveness, expertise, convenience and scope of operations. Expeditors emphasizes quality customer service, underscored by a strong commitment to compliance, and believes that our prices are market competitive.\n\n\nLarger customers utilize the services of multiple logistics providers and implement sophisticated and efficient procedures for the management of their logistics and supply chains by embracing strategies such as just-in-time delivery, network optimization, transportation flow optimization, and process improvement. Accordingly, timely and accurate data integrated into customer service capabilities is a significant factor in attracting and retaining customers.  Expeditors supports our customers in these strategies through digital products that provide quoting, booking, freight tracing and tracking, customized reporting, data analytics, and solution modeling/simulation/optimization. We can further extend support for these customer strategies through our order management and customs brokerage products and related digital solutions. These digital solutions can be enabled through Electronic Data Interface (EDI), Application Programming Interfaces (API), and browser-based web applications or mobile applications.\n\n\n11\n.\n\n\n\n\n \n\n\nSupply chain disruptions stemming from various factors, including geopolitical tensions and port labor disruptions impact our customers across different industries. As a result, many companies explore options to build a strategy around supply chain resiliency, agility, sourcing, and inventory optimization. While our customers’ supply chain strategies may evolve, we believe that the industry will remain highly competitive with a mix of large, niche, and new entrants, competing aggressively for customers’ business.\n\n\nExpeditors' management believes that the ability to develop and deliver innovative solutions to meet our customers’ increasingly sophisticated supply chain requirements is a critical factor in our ongoing success. We devote significant resources towards the maintenance and enhancement of technology and digital solutions in order to meet these customer demands. Management believes that our existing systems are competitive with the systems currently in use by other logistics services companies with which we compete. We continue to monitor the evolving features and capabilities of new technologies such as artificial intelligence.\n\n\nUnlike many of our competitors, who have tended to grow by merger and acquisition, Expeditors operates fully integrated transportation, customs brokerage, and accounting systems, running on a common hardware platform, in all districts. Small and middle-tier competitors, in general, do not have the resources available to develop and integrate these customized systems. Historically, growth through aggressive acquisition has proven to be a challenge for many of our competitors and typically involves the purchase of significant “goodwill.” In contrast, Expeditors has pursued a strategy emphasizing organic growth supplemented by select strategic acquisitions.\n\n\nDependence on Service Providers\n\n\nIn addition, our ability to provide services to our customers is highly dependent on good working relationships with a variety of entities, including airlines, ocean carrier lines, ground transportation providers and governmental agencies. The significance of maintaining acceptable working relationships with these entities has gained increased importance as a result of ongoing concerns over terrorism, security, changes in governmental regulations and oversight of international trade. We use a consistent approach in selecting and managing service providers across all of our product offerings, beginning with a rigorous qualification and risk-based diligence process. We select and engage with best-in-class, compliance-focused, efficiently run, growth-oriented partners, based upon defined value elements and are intentional in our relationship and performance management activity, reinforcing success by awarding service providers who consistently achieve at the highest levels with additional business. We consider our current working relationships with these entities to be satisfactory. However, changes in the financial stability and operating capabilities and capacity of asset-based carriers, capacity allotments available from carriers, governmental regulation or deregulation efforts, modernization of the regulations governing customs brokerage, and/or changes in governmental restrictions, quota restrictions or trade accords could affect our business in unpredictable ways.\n\n\nCurrency and Inflation\n\n\nOur worldwide operations require that we transact in a multitude of currencies other than the U.S. dollar. That exposes us to the inherent risks of volatile international currency markets and governmental interference. Some of the countries where we maintain offices and/or have agency relationships maintain strict currency control regulations that influence our ability to hedge foreign currency exposure. We try to compensate for these exposures by accelerating international currency settlements among our offices or agents.\n\n\nHistorically, our business has not been adversely affected by inflation. Beginning in 2021 and continuing into 2024, many countries, including the United States experienced increasing levels of inflation. As a result, our business experienced rising labor costs, significant service provider rate increases, higher rent and occupancy and other expenses. Due to the high degree of competition in the marketplace we may not be able to increase our prices to our customers to offset this inflationary pressure, which could lead to an erosion in our margins and operating income in the future. Conversely, raising our prices to keep pace with inflationary pressure may result in a decrease in volume and customer demand for our services. As we are not required to purchase or maintain extensive property and equipment and have not otherwise incurred substantial interest rate-sensitive indebtedness, we currently have limited direct exposure to increased costs resulting from increases in interest rates.\n\n\nThere is uncertainty as to how future regulatory requirements and volatility in oil prices will continue to impact future buy rates. Because fuel is an integral part of carriers' costs and impacts both our buy rates and sell rates, we would expect our revenues and costs to be impacted as carriers adjust rates for the effect of changing fuel prices. To the extent that future fuel prices increase, and we are unable to pass through the increase to our customers, fuel price increases could adversely affect our operating income.\n\n\n \n\n\n12\n.\n\n\n\n\n \n\n\nSeasonality\n\n\nHistorically, our operating results have been subject to seasonal demand trends, with the first quarter being the weakest and the third and fourth quarters being the strongest; however, there is no assurance that this seasonal trend will occur in the future or to what degree it will be impacted by an uncertain economy. This historical pattern has been the result of, or influenced by, numerous factors, including weather patterns, national holidays, consumer demand, new product launches, just-in-time inventory models, economic conditions, pandemics, governmental policies, inter-governmental disputes and a myriad of other similar and subtle forces. We cannot accurately forecast many of these factors, nor can we estimate accurately the relative influence of any particular factor and, as a result, there can be no assurance that historical patterns will continue in future periods.\n \n\n\nGovernment Regulations\n\n\nTransportation and Customs Brokerage\n\n\nWith respect to activities in the air transportation industry in the United States, Expeditors is subject to regulation by the Transportation Security Administration (TSA) of the Department of Homeland Security (DHS) as an indirect air carrier. All United States indirect air carriers must maintain prescribed security procedures and are subject to periodic audits by TSA. Our overseas offices and agents are licensed as airfreight forwarders in their respective countries of operation. Each Expeditors office is licensed, or, in the case of our newer offices, has applied for a license as an airfreight forwarder from the International Air Transport Association (IATA), a voluntary association of airlines and air transport related entities that prescribes specific operating procedures for airfreight forwarders acting as agents for its members. The majority of our airfreight forwarding business is conducted with airlines that are IATA members.\n\n\nExpeditors is licensed as an Ocean Transportation Intermediary (OTI) (sometimes referred to as an NVOCC) by the Federal Maritime Commission (FMC). The FMC has established specific qualifications for shipping agents, including certain surety bonding requirements. The FMC is also responsible for the economic regulation of OTI/NVOCC activity originating or terminating in the United States. To comply with these economic regulations, OTI/NVOCCs, such as Expeditors, must file tariffs electronically, establishing the rates to be charged for the movement of specified commodities into and out of the United States. The FMC has the power to enforce these regulations by assessing penalties.\n\n\nExpeditors is licensed as a customs broker by the Customs and Border Protection (CBP) agency of DHS, nationally and in each U.S. customs district in which we do business. All United States customs brokers must maintain prescribed records and are subject to periodic audits by CBP. In other jurisdictions in which Expeditors performs customs clearance services, we are licensed by the appropriate governmental authority where such license is required to perform these services. Expeditors participates in various governmental supply chain security programs, such as the Air Cargo Advance Screening (ACAS), the Customs Trade Partnership Against Terrorism (CTPAT) in the United States and Authorized Economic Operator (AEO) programs in other countries. Additionally, Expeditors is subject to additional regulatory and licensing requirements in the countries where we operate.\n\n\n13\n.\n\n\n\n\n \n\n\nBusiness operations\n\n\nWe do not believe the current United States and foreign governmental regulations impose significant economic restraint upon our business operations. In general, Expeditors conducts business activities in each country through a wholly or majority-owned subsidiary corporation that is organized and existing under the laws of that country. However, the regulations of foreign governments can impose barriers to our ability to provide the full range of our business activities in a wholly or majority United States-owned subsidiary. For example, foreign ownership of a customs brokerage business is prohibited in some jurisdictions. Less frequently, the ownership of the licenses required for freight forwarding and/or freight consolidation is restricted to local entities. When we encounter this sort of governmental restriction, we work to establish a legal structure that meets the local regulations’ requirements while also providing the substantive operating and economic advantages available in the absence of such regulation. This can be accomplished by creating a joint venture or exclusive agency relationship with a qualified local entity that holds the required license.\n\n\nGeopolitical risks, along with the continuing global threats from pandemics, terrorism, cyber-attacks, smuggling, wars, and governments’ overriding concern for the safety of passengers and citizens who import and export goods into and out of their respective countries, have resulted in a proliferation of cargo security and other regulations. Many of these regulations are complex and require varying degrees of interpretation. While these regulations have already created a marked difference in the security and other arrangements necessary to move shipments around the globe, regulations are expected to become more stringent in the future. As governments look for ways to tighten border controls and attempt to mitigate criminal elements and potential terror-related incidents, our competitors in the transportation business and we may be required to incorporate security and other procedures within our respective scope of services to a far greater degree than has been required in the past. We believe that increased security and additional requirements may involve further investments in technology and more sophisticated screening procedures being applied to cargo, customers, vendors, and employees.\n\n\nEnvironmental\n\n\nIn the United States, we are subject to Federal, state, and local laws aimed at protecting the environment, including provisions regulating the discharge of materials and emissions into the environment. Similar laws apply in many other jurisdictions in which we operate. Although our current operations have not been significantly affected by compliance with these environmental laws, an increasing number of governments, service providers and customers are becoming sensitive to environmental issues.\n\n\nWhile further government regulation related to climate change is either under consideration or being implemented by various levels of governments internationally and in the United States, Expeditors is committed to systematic efforts to reduce the impact of our operations on the environment and assisting our customers in their efforts to reduce their carbon footprint. We have employee-led Green Teams which cover most of our local district offices and are responsible for projects focused on environmental sustainability, including reducing waste, energy consumption, and Expeditors' Scope 1 and Scope 2 greenhouse gas (GHG) emissions (as defined by the Greenhouse Gas Protocol, Scope 1 emissions include all direct GHG emissions from sources that are owned or controlled by the company; Scope 2 includes indirect GHG emissions from the generation of purchased electricity, heat or steam consumed by the company). We have voluntarily disclosed our Scope 1 and Scope 2 emissions data to CDP since 2010.\n \n\n\nWe cannot predict what impact future environmental regulations may have on our business. We monitor climate-related risks and opportunities through our engagement with our customers and service providers and through our active participation in key initiatives and organizations focused on climate. For example, we are a SmartWay partner company in the United States. SmartWay is a voluntary public-private program sponsored by the U.S. Environmental Protection Agency (EPA) for tracking, documenting, and sharing information about fuel use and freight emissions across supply chains.\n\n\nCargo and Customs Brokerage Liability\n\n\nWhen acting as an airfreight consolidator, Expeditors assumes a carrier’s liability for lost or damaged shipments. This legal liability is typically limited by contract to the lower of the value of the goods or the released value (26 Special Drawing Rights [SDRs] per kilo unless the customer declares a higher value and pays a surcharge), except in the absence of an appropriate airway bill. The airline that we utilize to make the actual shipment is generally liable to us in the same manner and to the same extent. Generally, when acting solely as the agent of the shipper, we do not assume any contractual liability for loss or damage to shipments tendered to the carrier.\n\n\nWhen acting as an ocean freight consolidator, Expeditors assumes a carrier’s liability for lost or damaged shipments. This legal liability is typically limited by contract to the lower of the value of the goods or the released value (generally between $500 and 667 SDRs per package or customary freight unit unless the customer declares a higher value and pays a surcharge). The ocean carrier that we utilize to make the actual shipment is generally liable to us in the same manner and to the same extent. Generally, we do not assume liability for lost or damaged shipments in our ocean freight forwarding and customs clearance operations.\n\n\n14\n.\n\n\n\n\n \n\n\nWhen providing ground transportation services as a carrier, Expeditors assumes a carrier’s liability for lost or damaged shipments. This legal liability is typically limited by contract to the lower of the value of the goods or the released value (generally between $0.50 per pound and 8.33 SDRs per kilo, although the released value can vary from country to country) unless the customer declares a higher value and pays a surcharge. The ground carrier that we utilize to make the actual shipment is generally liable to us in the same manner and to the same extent.\n\n\nWhen providing warehousing and distribution services, our legal liability is limited by contract and tariff to an amount generally equal to the lower of the value of the goods or $0.50 per pound with a maximum of $50 per “lot” — which is defined as the smallest unit that the warehouse is required to track.\n\n\nWhen providing customs brokerage services, Expeditors does not assume liability for lost or damaged shipments because we do not maintain care, custody, or control over the goods in our capacity as a customs broker. Our liability for customs brokerage services is limited by contract to an amount generally equal to the lower of $50 per customs entry or the amount of brokerage fees paid to Expeditors for the customs entry.\n \n\n\nWe maintain cargo legal liability insurance covering claims for losses attributable to missing or damaged shipments for which we are legally liable. Expeditors also maintains legal liability insurance coverage for the property of others that is stored in our warehouse facilities. This insurance coverage is provided by a Vermont, U.S.-based insurance entity wholly owned by Expeditors. The coverage is fronted and re-insured by a global insurance company. The total risk retained by Expeditors in 2024 was $5 million. In addition, we are licensed as an insurance broker through our subsidiary, Expeditors Cargo Insurance Brokers, Inc., and place cargo insurance coverage for other customers. In certain circumstances, Expeditors will assume additional limited liability.\n\n\nInformation about our Executive Officers\n\n\nThe following table sets forth the names, ages, and positions of current executive officers of our company.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nName\n\n\n \n\n\nAge\n\n\n \n\n\nPosition\n\n\n\n\n\n\nJeffrey S. Musser\n\n\n \n\n\n59\n\n\n \n\n\nPresident, Chief Executive Officer and Director\n\n\n\n\n\n\nDaniel R. Wall\n\n\n \n\n\n56\n\n\n \n\n\nPresident, Global Geographies and Operations\n \n\n\n\n\n\n\nBlake R. Bell\n\n\n \n\n\n53\n\n\n \n\n\nPresident, Global Business Development\n\n\n\n\n\n\nKelly K. Blacker\n\n\n \n\n\n52\n\n\n \n\n\nPresident, Global Products\n\n\n\n\n\n\nBradley S. Powell\n\n\n \n\n\n64\n\n\n \n\n\nSenior Vice President and Chief Financial Officer\n\n\n\n\n\n\nCourtney A. Hawkins\n\n\n \n\n\n50\n\n\n \n\n\nSenior Vice President and Chief Information Officer\n\n\n\n\n\n\nBenjamin G. Clark\n\n\n \n\n\n56\n\n\n \n\n\nSenior Vice President, Global Enterprise Services and Chief Strategy Officer\n\n\n\n\n\n\nJeffrey F. Dickerman\n\n\n \n\n\n49\n\n\n \n\n\nSenior Vice President, General Counsel and Corporate Secretary\n\n\n\n\n\n\nJeffrey S. Musser joined Expeditors in February 1983 and was promoted to District Manager in October 1989. Mr. Musser was elected to Regional Vice President in September 1999, Senior Vice President - Chief Information Officer in January 2005 and to Executive Vice President and Chief Information Officer in May 2009. On December 19, 2013, Mr. Musser was appointed as President and Chief Executive Officer and was elected by the Board of Directors as a director, effective March 1, 2014. On February 17, 2025, Mr. Musser notified the Board of Directors of his plans to retire and step down from the Board of Directors, effective March 31, 2025.\n\n\nDaniel R. Wall joined Expeditors in March 1987 and was promoted to District Manager in May 1992 and Global Director - Account Management in March 2002. Mr. Wall was elected Vice President – ECMS (Order Management) in January 2004 and Senior Vice President - Ocean Services in September 2004. Mr. Wall was appointed as President, Global Products in June 2015, and as President, Global Services, effective January 1, 2023. In October 2023, Mr. Wall was named President, Global Geographies and Operations, effective January 1, 2024. On February 17, 2025, the Board of Directors elected Mr. Wall to President and Chief Executive Officer effective April 1, 2025. Mr. Wall will be appointed to the Board of Directors.\n\n\nBlake R. Bell joined Expeditors in September 1995 and was promoted to District Manager in January 2001. Mr. Bell was elected to Regional Vice President in May 2014, and Senior Vice President of Global Transcon in October 2015. On February 17, 2023, Mr. Bell was promoted as President, Global Products and was appointed as President, Global Services, effective January 1, 2024. Effective January 1, 2025, Mr. Bell was appointed President, Global Business Development.\n\n\n15\n.\n\n\n\n\n \n\n\nKelly K. Blacker joined Expeditors in 1994 and was promoted to New York Branch Manager in 2001, Columbus District Manager in 2004, Memphis District Manager in 2007, and Atlanta District Manager in 2011. Ms. Blacker was named Regional Vice President of the U.S. Mid-Atlantic region in 2015, and Senior Vice President of Global Air in May 2020. In November 2023, Ms. Blacker was appointed President, Global Products, effective January 1, 2024.\n\n\nBradley S. Powell joined Expeditors as Chief Financial Officer in October 2008 and was elected Senior Vice President and Chief Financial Officer in February 2012. Prior to joining Expeditors, Mr. Powell served as President and Chief Financial Officer of Eden Bioscience Corporation, a publicly-traded biotechnology company, from December 2006 to September 2008 and as Vice President and Chief Financial Officer from July 1998 to December 2006.\n\n\nCourtney A. Hawkins joined Expeditors as Senior Vice President and Chief Information Officer in September 2024, having previously served as Senior Vice President of Customer & Retail Technology for Starbucks Corporation since 2023. From 2021 to 2023, Ms. Hawkins served as Chief Technology Officer for Zulily, Inc. From 2014 to 2021, Ms. Hawkins served in various technology vice president roles with NIKE, Inc., Starbucks Corporation, and Nordstrom, Inc.\n\n\nBenjamin G. Clark joined Expeditors in February 2015 as Senior Vice President and General Counsel, was appointed Corporate Secretary in May 2015 and was appointed to Chief Strategy Officer in January 2020. In January 2025, he was appointed Senior Vice President – Global Enterprise Services and Chief Strategy Officer. From 2002 through 2014, Mr. Clark served as Deputy General Counsel for Celanese Corporation, and in various progressively senior roles within Honeywell International, Inc.\n\n\nJeffrey F. Dickerman joined Expeditors in October 2004 as Associate Corporate Counsel and became Corporate Counsel in 2007. Mr. Dickerman became Director, Global Legal Services in 2011 and Vice President and Associate General Counsel in 2015. In 2019, Mr. Dickerman became Vice President, Deputy General Counsel. In January 2020, Mr. Dickerman was appointed to Senior Vice President, General Counsel and was appointed Corporate Secretary in May 2020. Prior to joining Expeditors, Mr. Dickerman was an Associate Attorney at Stoel Rives LLP.\n \n\n\nAvailable Information\n\n\nOur internet address is \nhttp://www.expeditors.com\n. We make available free of charge through our internet website Expeditors' annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and all amendments to those reports as soon as reasonably practicable after such material is electronically filed with or furnished to the Securities and Exchange Commission (SEC). These reports are also available on the SEC's website at \nhttps://www.sec.gov\n. The information contained on or accessible through Expeditors' website is not a part of this Annual Report on Form 10-K.\n\n\n16\n."
  }
}