{
  "ticker": "FAST",
  "cik": "0000815556",
  "company_name": "FASTENAL CO",
  "filing_date": "2025-02-06",
  "accession": "0000815556-25-000065",
  "primary_doc": "fast-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1.\nBUSINESS \nNote – Information in this section is as of year end unless otherwise noted. The year end is December 31, 2024 unless additional years are included or noted.\nOverview\nFastenal Company (together with our subsidiaries, hereinafter referred to as Fastenal or by terms such as we, our, or us) began as a partnership in 1967, and was incorporated under the laws of Minnesota in 1968. We opened our first branch in 1967 in Winona, Minnesota, a city with a population today of approximately 26,000. We began with a marketing strategy of supplying threaded fasteners to customers through a branch network in small, medium, and, in subsequent years, large cities. Over time, how and where we engage our customers has expanded and evolved. Today we sell a broader range of industrial and construction supplies spanning more than nine major product lines through a global network of in-market locations utilizing diverse technologies such as vending devices, bin stock devices, and eBusiness. The large majority of our transactions are business-to-business. We provide additional descriptions of our product lines and market channels later in this document. At the end of 2024, we had 3,628 in-market locations (defined in the table below) in 25 countries supported by 15 distribution centers in North America, with 12 in the United States (U.S.), two in Canada, and one in Mexico; one in Asia; and two in Europe, and we employed 23,702 people. We believe our success can be attributed to the high quality of our employees and their convenient proximity to our customers, and our ability to offer customers a full range of products and services to reduce their total cost of procurement.\nOur Channels to Market\nWe engage our customers primarily through branch and Onsite locations. Branches and Onsites exist very close to our customers, usually within miles of, and often within or immediately proximate to, our customers' physical operations. Together, these constitute our 'in-market' network. Many of our customers engage with us through eBusiness, but in most cases these customers are utilizing eBusiness to supplement our service through our other channels.\n2\nTable of Contents\nThe following table shows, as of the end of each of the last 10 fiscal years, our consolidated net sales; the number of branch, Onsite, and total in-market locations; their respective sales, as well as the average monthly sales per location that were generated from our branch and Onsite locations; and our sales generated from non-traditional sources:\n2024\n2023\n2022\n2021\n2020\n2019\n2018\n2017\n2016\n2015\nNet sales\n$\n7,546.0\n \n7,346.7 \n6,980.6 \n6,010.9 \n5,647.3 \n5,333.7 \n4,965.1 \n4,390.5 \n3,962.0 \n3,869.2 \nBranch locations\n1,597\n \n1,597 \n1,683 \n1,793 \n2,003 \n2,114 \n2,227 \n2,383 \n2,503 \n2,622 \n    Branch sales \n(1)\n$\n4,109.3\n \n4,073.6 \n4,161.6 \n3,726.2 \n3,587.1 \n3,660.1 \n3,625.8 \n3,399.6 \n3,198.1 \n3,281.8 \n    Average monthly sales \nper branch location \n(2)\n$\n214.4\n \n207.0 \n199.5 \n163.6 \n145.2 \n140.5 \n131.1 \n116.0 \n104.0 \n104.0 \nOnsite locations \n2,031\n \n1,822 \n1,623 \n1,416 \n1,265 \n1,114 \n894 \n605 \n401 \n264 \n    Onsite sales \n(1)\n$\n3,201.6\n \n2,926.7 \n2,465.5 \n1,898.0 \n1,485.6 \n1,391.7 \n1,081.7 \n770.2 \n569.2 \n454.3 \n    Average monthly sales per Onsite location \n(2)\n$\n138.5\n \n141.6 \n135.2 \n118.0 \n104.1 \n115.5 \n120.3 \n127.6 \n142.7 \n158.4 \nOther sales \n(3)\n$\n235.1\n \n346.4 \n353.5 \n386.7 \n574.6 \n281.9 \n257.6 \n220.7 \n194.7 \n133.1 \nTotal in-market locations \n(4)\n3,628\n \n3,419 \n3,306 \n3,209 \n3,268 \n3,228 \n3,121 \n2,988 \n2,904 \n2,886 \n(1)\nSales attributable to our traditional and international branch locations (both of which are defined below), and our Onsite locations, respectively.\n(2)\nAverage sales per month considers the average active base of branches and Onsites, respectively, in the given year, factoring in the beginning and ending location count, divided by total sales attributable to our branch and Onsite locations, respectively, further divided by 12 months. This information is presented in thousands.\n(3)\nThis portion of sales is generated outside our traditional in-market locations, examples of which include sales arising from our custom in-house manufacturing, industrial services, and other non-traditional sources of sales. In 2020, this included the effects of COVID-19, one response to which was substantial sales of pandemic-related products that were direct-shipped (versus sold through in-market locations) as a means of delivering critical supplies more quickly.\n(4)\n'In-market locat\nions' is defined as the sum of the total number of branch locations and the total number of Onsite locations.\nThis structure has evolved over time as a result of one of Fastenal's guiding principles since inception: that we can improve our service by getting closer to the customer. This has been achieved by opening branch locations and, more recently, Onsite locations. Today, we believe there are few companies that offer our North American in-market location coverage. In 2024, roughly 53% of our sales and 50% of our in-market locations were in major Metropolitan Statistical Areas (MSAs) (populations in the U.S. and Canada greater than 500,000 people), while 21% of our sales and 20% of our in-market locations were in small MSAs (populations under 500,000 people), and 26% of our sales and 30% of our in-market locations were not in an MSA (populations under 50,000 people). In our view, this has proven to be an efficient means of providing customers with a broad range of products and services on a timely basis. Maintaining operations that are physically proximate to our customers' operations have represented, and continue to represent, the foundation of our service approach.\nThe distinctions between our branch and Onsite locations are as follows:\nBranch locations\n typically service a wide variety and number of customers, ranging from the local operations of large, national account customers to smaller local businesses. Locations are selected primarily based on their proximity to our distribution network and employment and production data for manufacturing and non-residential construction companies. We stock all branches with inventory drawn from all of our product lines and tailored by our district and branch personnel to the needs of the local customer base. \nBased on the unique characteristics of certain markets and the judgement of local leadership, different branch types have emerged over time. In the United States and Canada, the most common type is the \nCustomer Fulfillment Center (CFC),\n which tends to feature a limited showroom and stock customer-specific inventory. These have the appearance of and function more like an industrial supply house and stocking location. The United States and Canada also utilize a \nCustomer Service Branch (CSB)\n, which tend to feature a showroom and a more standardized stocking model of products designed for contractors. CSBs often conduct some business with non-account or retail-like customers. At the end of 2024, 87% of our United States and Canada branches operated as a CFC and 13% operated as a CSB. Outside the United States and Canada we typically deploy an \nInternational Branch\n. These locations lack a showroom and tend to service fewer customers who tend to be large, national account customers disproportionately concentrated in manufacturing and heavily oriented toward planned product spend.\n3\nTable of Contents\nRegardless of what branch type ultimately evolves to service the unique features of a specific geographic location, all our branches share a common purpose and similar operating priorities. We believe our ability to provide a consistent local service model on a global basis is attractive to our customer base, which consists heavily of North American-based multinational companies with significant foreign operations. \nSince Fastenal's founding and through 2013, branch openings were a primary growth driver for us, peaking in 2013 at 2,687 locations. Branches were entirely U.S.-based until 1994, when we opened our first location in Canada followed by opening our first branch location in Mexico in 2001. Since then, we have continued to expand our global footprint, including into Europe, Asia, and Central and South America. In the period from 2013 to 2023, we experienced a net decline of 1,090 in our total branch count, which was primarily due to consolidations in our U.S. market. New growth drivers, business models, and business tools emerged and diminished the direct role of branch openings in our growth, resulting in a strategic rationalization to align our physical footprint with changes in our business strategies. In 2024, we disclosed that this strategic rationalization had concluded and future openings and closings were likely to be more balanced and in accordance with the strategies and specific circumstances of local operations. \nAt the end of 2024, we had 1,499 branches in North America, which includes the United States, Canada, and Mexico, representing 52.2% of net sales and 98 branches outside of North America representing 2.2% of net sales. \nOnsite locations\n are not new, having entered into the first such arrangement in 1992. However, it was largely a local option that grew slowly before we identified it as a growth driver in 2014, at which point we made substantial investments to accelerate its traction in the marketplace. In this model, we provide dedicated sales and service to a single customer from a location that is physically within, or strategically proximate to, the customer's facility, with inventory that is specific to the customer's needs. In many cases, we are shifting sales with the customer from an existing branch location, though we also see new customer opportunities arise as a result of our Onsite capabilities. The model is best suited for larger companies, though we believe we can provide a higher degree of service at a lower level of sales than most of our competitors. It has been our experience that the sales mix at our Onsite locations typically produces a lower gross profit percentage than at our branch locations, but we gain sales with the customer and our cost to serve is lower. We have identified over 11,000 manufacturing and construction customer locations in North America with potential to implement the Onsite service model. These include customers with which we have an existing national account relationship today, and potential customers we are aware of due to our local market presence with which we do not have a meaningful relationship today. However, as awareness of our capabilities has grown, we have identified additional Onsite potential with certain agencies of state, provincial, and local government customers, and academia. We also believe as we continue to follow our existing national account customers outside the U.S., our market potential for Onsite solutions will continue to expand. The international opportunity is substantial, but our speed is limited by our relatively underdeveloped infrastructure in comparison to the U.S. We expect sales from Onsite arrangements to continue to increase meaningfully over time. At the end of 2024, we had 1,961 Onsite locations in North America, which included the United States, Canada, and Mexico, representing 41.6% of net sales and 70 Onsite locations outside of North America representing 0.8% of net sales. As of December 31, 2024, we signed 358, 326, and 356 new Onsite locations (referred to herein as signings) in 2024, 2023, and 2022, respectively. \n4\nTable of Contents\nAt the end of 2024, we operated branches and Onsites in 25 total countries. The following table provides a summary of the branches and Onsite locations we operated at the end of each year, as well as the openings, closings, and conversions during each year:\nNorth America\nOutside North America\nU.S.\n (1)\nCanada\nMexico\nSubtotal\nCentral & South America \n(2)\nAsia \n(3)\nEurope \n(4)\nSubtotal\nTotal\nIn-Market Locations - 12/31/22\n2,707 \n276 \n177 \n3,160 \n21 \n45 \n80 \n146 \n3,306 \nStarting Branches\n1,369 \n169 \n66 \n1,604 \n5 \n22 \n52 \n79 \n1,683 \nOpened Branches\n— \n— \n3 \n3 \n— \n3 \n4 \n7 \n10 \nClosed/Converted Branches \n(5)\n(92)\n(5)\n— \n(97)\n— \n— \n1 \n1 \n(96)\nEnding Branches \n1,277 \n164 \n69 \n1,510 \n5 \n25 \n57 \n87 \n1,597 \nStarting Onsites\n1,338 \n107 \n111 \n1,556 \n16 \n23 \n28 \n67 \n1,623 \nOpened Onsites\n283 \n18 \n20 \n321 \n— \n1 \n7 \n8 \n329 \nClosed/Converted Onsites \n(5)\n(115)\n(6)\n(3)\n(124)\n(1)\n(2)\n(3)\n(6)\n(130)\nEnding Onsites\n1,506 \n119 \n128 \n1,753 \n15 \n22 \n32 \n69 \n1,822 \nIn-Market Locations - 12/31/23\n2,783 \n283 \n197 \n3,263 \n20 \n47 \n89 \n156 \n3,419 \nStarting Branches\n1,277 \n164 \n69 \n1,510 \n5 \n25 \n57 \n87 \n1,597 \nOpened Branches\n1\n \n—\n \n1\n \n2\n \n—\n \n3\n \n6\n \n9\n \n11\n \nClosed/Converted Branches \n(5)\n(14)\n—\n \n1\n \n(13)\n—\n \n(1)\n3\n \n2\n \n(11)\nEnding Branches \n1,264\n \n164\n \n71\n \n1,499\n \n5\n \n27\n \n66\n \n98\n \n1,597\n \nStarting Onsites\n1,506 \n119 \n128 \n1,753 \n15 \n22 \n32 \n69 \n1,822 \nOpened Onsites\n271\n \n36\n \n27\n \n334\n \n—\n \n4\n \n5\n \n9\n \n343\n \nClosed/Converted Onsites \n(5)\n(117)\n(2)\n(7)\n(126)\n(1)\n—\n \n(7)\n(8)\n(134)\nEnding Onsites \n1,660\n \n153\n \n148\n \n1,961\n \n14\n \n26\n \n30\n \n70\n \n2,031\n \nIn-Market Locations - 12/31/24\n2,924\n \n317\n \n219\n \n3,460\n \n19\n \n53\n \n96\n \n168\n \n3,628\n \n(1)\nIncludes the U.S., the Dominican Republic, Guam, and Puerto Rico.\n(2)\nIncludes Panama, Brazil, and Chile.\n(3)\nIncludes Singapore, China, Malaysia, and Thailand.\n(4)\nIncludes the Netherlands, Hungary, the United Kingdom, Germany, the Czech Republic, Italy, Romania, Sweden, Poland, Austria, Switzerland, Ireland, Spain, France, and Belgium.\n(5)\nThe net impact of non-in-market locations or Onsite locations converted to branches, branches converted to Onsite locations or non-in-market locations, and closures of branches or Onsite locations.\nWe believe the profitability of our in-market locations is affected by the average sales produced by each site. In any in-market location, certain costs related to growth are at least partly variable, such as employee-related expenses, while others, like rent and utility costs, tend to be fixed. As a result, it has been shown that as an in-market location increases its sales base over time, it typically will achieve a higher operating profit margin. This ability to increase our operating profit margin is influenced by: (1) general growth based on end market expansion and/or market share gains that increases the monthly sales of the location and (2) the age of the in-market location (new locations tend to be less profitable due to start-up costs and, in the case of a branch, the time necessary to generate a customer base). The paths to higher operating profit margins are slightly different in a traditional branch versus an Onsite location, as the former will tend to have more fixed costs to leverage, while the latter will tend to have a smaller fixed cost burden but have greater leverage of its employee-related expenses. In the short term, the Onsite program can hurt the profitability of our existing branch network as it can pull established sales away from an existing branch even as its fixed expenses are largely unchanged.\nThere are many reasons why local or regional management might decide to close an in-market location. Key customers may have migrated to a different part of the market, factories may have closed, our own supply chain capabilities in a market may have evolved to allow us to service some areas with fewer branches, and/or our customers may have transitioned to our Onsite model. An Onsite location may also close because local or regional management determines that the business at the location is unlikely to scale sufficiently to justify our being on premise, in which case the relationship often reverts to being managed in a local branch. \n5\nTable of Contents\nWe utilize additional types of selling locations within our network, but these tend to be more specialized in nature and relatively few in number, comprising less than five percent of our total selling locations. We remain committed to a large, robust service network, including traditional branches, international branch\nes, and Onsites; it r\nemains the indispensable foundation of our business. We anticipate that relatively stable branch count in the United States and Canada, combined with growth in branch count outside of the United States and Canada and growth in global Onsite locations, will result in an increase to overall in-market locations over time.\nOur Business Tools\nFastenal Managed Inventory (FMI\n®\n)\nOver time, we have invested in and developed various technologies that allow us to put physical product closer to the point of use in a customer location, increase the visibility of a customer's supply chain (to the customer as well as our personnel), and/or improve the ability to monitor or control usage. While there are isolated exceptions, these technologies are not themselves channels to the market but rather are utilized by our branch and Onsite channels to enhance service to our customers. Collectively, these tools comprise our Fastenal Managed Inventory (FMI) Technology suite. We believe our fully integrated distribution network allows us to manage the supply chain for all sizes of customers. FMI programs tend to generate a higher frequency of business transactions and, coupled with our fully integrated distribution network, foster a strong relationship with customers.\nIndustrial vending (FASTVend\n®\n)\n was introduced in 2008 to provide our customers with improved product monitoring and control. Benefits include reduced consumption, reduced purchase orders, reduced product handling, and 24-hour product availability. We believe that we have a market advantage by virtue of our extensive in-market network of inventory and local personnel. For these reasons, the initiative began to gain significant traction in 2011, and we finished 2024 with approximately 119,800 FASTVend devices in the field. We believe industrial vending has proven its effectiveness in strengthening our relationships with customers and helped to streamline the supply chain where it has been utilized. We also believe there remains considerable room to grow our current installed base of devices before it begins to approach the number of units we believe the market can support. We estimate the market could support as many as 1.7 million vending units and, as a result, we anticipate continued growth in installed devices over time. \nOur industrial vending portfolio consists of 20 different vending devices, with 16 of these being in either a helix or locker format. Our most utilized models include the helix-based FAST 5000 and our 12- and 18-door lockers; combined, these comprise approximately 64% of our installed base of devices. These are either configurable or are available in multiple configurations to accommodate the various sizes and forms of products that will be dispensed to match the unique needs of our customers. Target monthly sales per device typically range from under $1,000 to in excess of $3,000, with our flagship FAST 5000 device having a targeted monthly throughput of $2,000. \nBin stock (FASTStock\n℠\n and FASTBin\n®\n)\n programs, where product is held in bins in a customer facility, are similar to our vending business in that it involves moving product closer to the point of customer use within their facilities. Such programs have existed in the industrial supply industry for a considerable time, with open bins being clustered in a racking system, each of which holds original equipment manufacturing (OEM) fasteners, maintenance, repair, and operations (MRO) fasteners, and/or non-fastener products that are consumed in the customers' operations. Historically, these bins were simply plastic and metal containers that held product and were visually inspected by our customers or Fastenal personnel to determine replenishment need. These bins in some cases are organized and labeled into customized digital plan-o-grams, which we call FASTStock and allow for the scanning of product when it is at a minimum desired level. However, in 2019 we introduced our FASTBin technology. FASTBin is the evolution of FASTStock into a set of electronic inventory management solutions that automate process controls by providing 24/7 continuous inventory monitoring, real-time inventory visibility, and automatic replenishment of bin stock parts.\nThese technologies come in four forms: (1) scales that utilize a high-precision weight sensor system to measure the exact quantity on hand in real time, notifying Fastenal to replenish when inventory hits an established minimum; (2) infrared (IR) that uses IR sensors lining individual bins to provide real-time visibility of approximate quantity and inventory values, notifying Fastenal to replenish when inventory hits an established minimum threshold; (3) RFID, which is a Kanban system that utilizes RFID tags so that when an empty bin is removed from the rack and placed in a replenishment zone (also part of the same racking system), a notification is sent to Fastenal to refill the order; and (4) FASTClick, which is an electronic button utilized on products or in locations that do not lend themselves to a vending- or bin-based solution that allows a customer to signal they would like a replenishment activity without the need of a Fastenal representative. These technologies provide superior monitoring capabilities and immediate visibility to consumption changes, allowing for a lean supply chain, reducing risk of stock-outs, and providing a more efficient labor model for both the customer and the supplier.\n6\nTable of Contents\nOur \nweighted FMI measure\n combines signings and installations of FASTBin and FASTVend in a standardized machine equivalent unit (MEU) based on the expected output of each type of device. We do not include FASTStock in this measurement because scanned stocking locations can take many forms, such as bins, shelves, cabinets, pallets, etc., that cannot be converted into a standardized MEU. This conversion takes the targeted monthly throughput of each FMI device signed or installed and compares it to the $2,000 target monthly throughput of our FAST 5000 vending device. For example, an RFID enclosure, with target monthly sales of $2,000 would be counted as '1.00' machine equivalent ($2,000/$2,000 = 1.00). An infrared bin, with target monthly sales of $40, would be counted as '0.02' machine equivalent ($40/$2,000 = 0.02).\nThe table below summarizes the signings and installations of, and sales through, our FMI devices.\nTwelve-month Period\n2024\n2023\nChange\nWeighted FASTBin/FASTVend signings (MEUs)\n27,984\n \n24,126 \n16.0 \n%\nSignings per day\n110\n \n95 \nWeighted FASTBin/FASTVend installations (MEUs; end of period)\n126,957\n \n113,138 \n12.2 \n%\nFASTStock sales\n$\n956.6\n \n927.6 \n3.1 \n%\n% of sales\n12.5\n \n%\n12.5 \n%\nFASTBin/FASTVend sales\n$\n2,295.5\n \n2,070.2 \n10.9 \n%\n% of sales\n30.0\n \n%\n27.8 \n%\nFMI sales\n$\n3,252.1\n \n2,997.8 \n8.5 \n%\nFMI daily sales\n$\n12.8\n \n11.8 \n7.6 \n%\n% of sales\n42.5\n \n%\n40.3 \n%\nDigital Solutions\nWe also invest in digital solutions that aim to deliver strategic value for our customers, leverage local inventory for same-day solutions, and provide efficient service. While there is a transactional element to our digital services, many of the solutions we invest in are intended to add value to customers by illuminating various elements of their supply chain. In many cases, this provides insights that allow us to migrate transactional, 'non-sticky' (and traditionally high cost) online spend into a 'sticky' managed setting (such as our FMI programs). These solutions take many forms:\n1) \nTransactional\n. Our eBusiness includes eProcurement activities, which are integrated transactions, including electronic data interchange (EDI), and eCommerce (transactional website sales), which provide a means for our customers to effectively and efficiently procure MRO and unplanned spend. While there is a retail component to our transactional digital services, most of the sales attributable to this is with our traditional customer base, nearly all of which purchase digitally as a supplement to other channels and tools it utilizes with Fastenal. We attribute the sales generated from a customer location through our transactional platforms to the in-market location traditionally servicing this customer location.\n2) \nAnalytics\n. Data analytics provide customers with detailed insights into their business operations. FAST360° offers a comprehensive view of inventory and spending, allowing users to visualize product organization and analyze spending trends. FAST360° Analytics uses Microsoft Power BI to offer stakeholders visualization tools for analyzing spend, supply channels, and cost savings. FAST360° acts as the bridge between our fulfillment operations and a customer's view into our managed service model, and provides our customers with one central source of information. These platforms empower users to make data-driven decisions, optimize operations, and improve efficiency by providing actionable insights into Fastenal-managed inventory and spending. By incorporating visual representations of complex data into standardized and tailored reporting templates, the team collaborates with Fastenal's customers and business leaders to turn insights into action.  \n3) \nDigital Visibility\n. Certain of our digital capabilities are intended to produce operational efficiencies for our customers and ourselves and/or to deliver strategic value by illuminating customer supply chain operations. For instance, we have developed, and continue to develop, 'Mobility' applications, one example of which is our Vending App, which provides a number of benefits. It provides easy, real-time information pertaining to a customer's local inventory position within their point-of-use devices. It incorporates customer usage data to recommend optimized parts and quantity for specific devices, which improves customer inventories while reducing the risk of stock-outs. Moving our fulfillment process from a vending device-based keypad function to a tablet or scanning interaction improves the restock process (reduced risk of product outages), reducing time consumed (greater efficiency) while improving accuracy (improved quality assurance). We will continue to build out our suite of Mobility applications. EDI is the connectivity between our system and our customers' procurement systems – whether a direct integration into their Enterprise Resource Planning system or through a third-party procurement network or marketplace. These solutions provide a system-to-system exchange of electronic procurement documents (such as purchase orders, advanced shipping notices, and invoices for direct and indirect spend). Our eProcurement Solutions provide a bridge between our \n7\nTable of Contents\nmanaged replenishment activity and our customers' procurement systems – creating an efficient, accurate and streamlined procure-to-pay process. \n4.) \nCrib Management\n. We host FASTCrib, a cloud-based software tool designed to provide customers with visibility and control of their entire supply chain. It is an integrated platform that maintains customer-specific product catalogs, provides control and tracking of inventory levels, streamlines and consolidates procurement processes, and enables rich visualization and reporting in an environment with robust user controls. It also has modules for asset tracking and integrates into our FMI suite. FASTCrib creates a one-stop, just-in-time supply chain management capability for all of the products and services consumed by our customers, whether provided directly by Fastenal or other vendors.  \nDigital Footprint\nOur d\nigita\nl products and services are comprised of sales through FMI (FASTStock, FASTBin, and FASTVend) plus that proportion of our eBusiness sales that do not represent billings of FMI services (collectively,\n our Digital Footprint).\n We believe the data that is created through our digital capabilities enhances product visibility, traceability, and control that reduces risk in operations and creates ordering and fulfillment efficiencies for both us and our customers. As a result, we believe our opportunity to grow our business will be enhanced through the continued development and expansion of our digital capabilities. Our Digital Footprint represented 60.4% of sales in 2024.\nWe believe the combination of our broad product offering, physical presence on a global scale, and toolbox of services, specialists, and digital capabilities, produces a customer engagement model that is difficult for large and small competitors to replicate. This is consistent with our strategy and offers significant value by providing differentiated and difficult to displace service. We also believe it differentiates us when compared to web purchasing models as an independent sales channel. We expect to continue to build out and develop our digital solutions over time. Our greatest opportunity lies with the deployment of efficient and effective supply chain programs. We are focused on addressing the four key components: people, products, processes, and technology, to support this model.\nDistribution Network\nWe operate 15 regional distribution centers in North America: 12 in the U.S., two in Canada, and one in Mexico. We also operate one distribution center in Asia and  two distribution centers in Europe. These distribution centers give us approximately 5.1 million square feet of distribution capacity. Additional details on these locations can be found within the '"
  }
}