{
  "ticker": "FDS",
  "cik": "0001013237",
  "company_name": "FACTSET RESEARCH SYSTEMS INC",
  "filing_date": "2025-10-22",
  "accession": "0001628280-25-045769",
  "primary_doc": "fds-20250831.htm",
  "item_sections": {
    "item1": "Item 1. \nBusiness - Business Overview \nand\n Business Strategy\n and Part II, Item 8. Note 17, \nSegment Information\n, in the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for more information. \n29\nTable of Contents\nFiscal 2025 in Review\nRevenues for fiscal 2025 were $2,321.7 million, an increase of 5.4% from the comparable prior year. The growth in revenues was driven by a 4.4% increase in organic revenues, a 0.9% increase from acquisition-related revenues and a net increase of 0.1% from foreign currency exchange rate fluctuations. Revenues increased in all our segments, primarily in the Americas. Revenues increased primarily from workstations and to a lesser extent, CGS and front office solutions. Refer to Part II, Item 7. \nManagement's Discussion and Analysis of Financial Condition and Results of Operations, Non-GAAP Financial Measures, \nof this Annual Report on Form 10-K for a definition of organic revenues and a reconciliation between revenues and organic revenues.\nAs of August 31, 2025, organic annual subscription value (\"Organic ASV\") totaled $2,370.9 million, an increase of 5.7% over the prior year. Organic ASV increased in all our segments, with the majority of the increase in the Americas. Organic ASV growth was mainly driven by workstations, data solutions and, to a lesser extent, CGS. Refer to Part II, Item 7. \nManagement's Discussion and Analysis of Financial Condition and Results of Operations, Annual Subscription Value, \nof this Annual Report on Form 10-K for the definition of Organic ASV.\nOperating margin was 32.2% for fiscal 2025, compared with 31.8% for fiscal 2024. This increase in operating margin was mainly due to growth in revenues and, when expressed as a percentage of revenues, charges related to the Sales Tax Dispute that were recorded in the prior year, partially offset by higher amortization of intangible assets in the current year. Refer to Part II, Item 8. Note 12, \nCommitments and Contingencies \nin the Notes to the Consolidated Financial Statements of this Annual Report on Form 10-K for more information on the Sales Tax Dispute.\nNet income for fiscal 2025 was $597.0 million, an increase of 11.2% from the prior year. Diluted earnings per common share (\"Diluted EPS\") for fiscal 2025 was $15.55, an increase of 11.8% compared with the prior year. The increase in Net income and Diluted EPS was primarily driven by higher operating income and a gain from the divestiture of a business.\nWe returned $460.4 million to our stockholders in the form of share repurchases and dividends during fiscal 2025.\nAs of August 31, 2025, our client and user counts were 8,996 and 237,324, respectively. Our employee headcount was 12,800 as of August 31, 2025, up 3.2% compared to the prior year. This increase was driven by net headcount growth of 6.0% in the Americas and 2.6% in each of EMEA and Asia Pacific. \nAnnual Subscription Value (\"ASV\")\nWe believe ASV reflects our ability to grow recurring revenues and generate positive cash flows, and thus serves as a key indicator of the successful execution of our business strategy. \n–\nASV at any point in time represents our forward-looking revenues for the next 12 months from all subscription services currently being supplied to clients.\n–\nOrganic ASV at any point in time equals our ASV excluding ASV from acquisitions and dispositions completed within the last 12 months and the effects of foreign currency movements.\nBeginning in fiscal 2025, we are reporting Organic ASV, rather than Organic ASV plus professional services, to focus on the recurring nature of our revenues. This underscores the shift of our offerings toward providing more managed services and less project-based services. \n30\nTable of Contents\nOrganic ASV\nThe following table presents the calculation of Organic ASV as of August 31, 2025. With proper notice provided as contractually required, our clients can add to, delete portions of, or terminate service, subject to certain limitations. \n(dollar amounts in millions)\nAs of August 31, 2025\nASV\n$\n2,405.6 \nImpact from foreign currency movements\n(0.6)\nAcquisition ASV\n(1\n)\n(34.1)\nOrganic ASV\n$\n2,370.9 \nOrganic ASV annual growth rate\n(2)\n5.7 \n%\n(1)  ASV from acquisitions completed within the last 12 months.\n(2) For comparability purposes, in calculating the organic ASV annual growth rate, the prior year excludes ASV from dispositions completed in the last 12 months.\nAs of August 31, 2025, Organic ASV was $2,370.9 million, an increase of 5.7% compared with August 31, 2024. Organic ASV increased in all our segments, with the majority of the increase in the Americas. The increase in Organic ASV was primarily due to higher sales to existing clients and, to a lesser extent, sales to new clients and price increases to existing clients, all primarily attributable to workstations, data solutions and, to a lesser extent, CGS. This increase was partially offset by existing client cancellations. \nSegment ASV\nAs of August 31, 2025, ASV from the Americas represented 65% of total ASV and was $1,570.1 million, an increase from $1,455.4 million as of August 31, 2024. Americas Organic ASV was $1,541.9 million as of August 31, 2025, a 6.0% increase from the prior year. The Organic ASV increase in the Americas was primarily driven by workstations and, to a lesser extent, data solutions. \nAs of August 31, 2025, ASV from EMEA represented 25% of total ASV and was $591.6 million, an increase from $569.7 million as of August 31, 2024. EMEA Organic ASV was $586.3 million as of August 31, 2025, a 4.2% increase from the prior year. The EMEA Organic ASV increase was mainly from data solutions.\nAs of August 31, 2025, ASV from Asia Pacific represented 10% of total ASV and was $243.9 million, an increase from $230.3 million as of August 31, 2024. Asia Pacific Organic ASV was $242.7 million as of August 31, 2025, a 7.2% increase from the prior year. The Asia Pacific Organic ASV increase was primarily driven by data solutions and workstations. \nBuy-side and Sell-side Organic ASV Growth\nThe buy-side and sell-side Organic ASV annual growth rates as of August 31, 2025 were 5.5% and 4.3%, respectively. Buy-side clients account for approximately 82% of our Organic ASV, consistent with the prior year, and primarily include institutional asset managers, wealth managers, asset owners, partners, hedge funds and corporate clients. The remaining Organic ASV is derived from sell-side firms and primarily include broker-dealers, banking and advisory firms, and private equity and venture capital firms. \nClient and User Additions\nThe table below presents our total clients and users:\nAs of August 31,\n2025\n2024\n% Change\nClients\n(1)\n8,996 \n8,217 \n9.5 \n%\nUsers\n(2)\n237,324 \n216,381 \n9.7 \n%\n(1)\nThe client count includes clients with ASV of $10,000 and above.\n(2)\nThe user count does not reflect users associated with our fiscal 2025 acquisitions. \n31\nTable of Contents\nOur total client count was 8,996 as of August 31, 2025, a net increase of 9.5% or 779 clients in the last 12 months, mainly due to an increase in corporate clients, primarily driven by clients from the Platform Group Limited (\"Irwin\") acquisition. \nAs of August 31, 2025, there were 237,324 professionals using FactSet, representing a net increase of 9.7% or 20,943 users in the last twelve months, primarily driven by an increase in wealth management users. The user count does not reflect our fiscal 2025 acquisitions.\nAnnual ASV retention was greater than 95% of ASV as of August 31, 2025 and August 31, 2024. When expressed as a percentage of clients, annual retention was 91% as of August 31, 2025, compared with 90% as of August 31, 2024.\nEmployee Headcount\nAs of August 31, 2025, our net employee headcount increased by 3.2% to 12,800, compared with 12,398 employees as of August 31, 2024. This net headcount increase was primarily in the technology and sales groups mainly driven by continued investment in our COEs, through an increase in employees based in the Philippines and India, and our Irwin and Liquid Holdings, LLC (\"LiquidityBook\") acquisitions. \nAs of August 31, 2025, compared to August 31, 2024, our net headcount growth was 6.0% in the Americas and 2.6% in each of EMEA  and Asia Pacific. As of August 31, 2025, we had 8,854 employees located in Asia Pacific, 2,510 in the Americas and 1,436 in EMEA. Approximately 68% of our employees are located in our COEs. \nResults of Operations\nFor an understanding of the significant factors that influenced our performance during fiscal 2025 and 2024, the following discussion should be read in conjunction with the Consolidated Financial Statements and related Notes presented in Part II, Item 8. in this Annual Report on Form 10-K.\nThe following table summarizes the results of operations for the years presented:\n \nYears ended August 31,\n(in thousands, except per share data)\n2025\n2024\n% Change\nRevenues\n$\n2,321,748 \n$\n2,203,056 \n5.4 \n%\nCost of services\n1,097,782 \n1,011,945 \n8.5 \n%\nSelling, general and administrative\n475,663 \n489,812 \n(2.9)\n%\nOperating income\n$\n748,303 \n$\n701,299 \n6.7 \n%\nNet income\n$\n597,040 \n$\n537,126 \n11.2 \n%\nDiluted weighted average common shares\n38,385 \n38,618 \nDiluted EPS\n$\n15.55\n$\n13.91\n11.8 \n%\nRevenues\nRevenues in fiscal 2025 were $2,321.7 million, an increase of 5.4%. This 5.4% growth in revenues was driven by a 4.4% increase in organic revenues which totaled $2,300.2 million for fiscal 2025, a 0.9% increase from acquisition-related revenues and a net increase of 0.1% from foreign currency exchange rate fluctuations. Revenues increased in all our geographic segments, primarily in the Americas. The increase in revenues was mainly from workstations and, to a lesser extent, CGS and front office solutions.\n32\nTable of Contents\nRevenues by Segment\nThe following table summarizes our revenues by segment:\nYears ended August 31,\n(dollar amounts in thousands)\n2025\n2024\n% Change\nAmericas\n$\n1,506,108\n$\n1,419,901\n6.1 \n%\n% of revenues\n64.9 \n%\n64.4 \n%\nEMEA\n$\n580,284\n$\n563,128\n3.0 \n%\n% of revenues\n25.0 \n%\n25.6 \n%\nAsia Pacific\n$\n235,356\n$\n220,027\n7.0 \n%\n% of revenues\n10.1 \n%\n10.0 \n%\nConsolidated\n$\n2,321,748\n$\n2,203,056\n5.4 \n%\nAmericas\nRevenues from the Americas increased 6.1% to $1,506.1 million in fiscal 2025, compared with $1,419.9 million in fiscal 2024. This 6.1% growth in revenues was driven by a 4.9% increase in organic revenues and a 1.2% increase from acquisition-related revenues. The increase in revenues was mainly driven by workstations and, to a lesser extent, front office solutions.\nEMEA\nRevenues from EMEA increased 3.0% to $580.3 million in fiscal 2025, compared with $563.2 million in fiscal 2024. This  3.0% growth in revenues was driven by a 2.5% increase in organic revenues, a 0.4% increase from acquisition-related revenues and a 0.1% net increase from foreign currency exchange rate fluctuations. The increase in revenues was primarily from data solutions and middle office solutions. \nAsia Pacific\nRevenues from Asia Pacific increased 7.0% to $235.3 million in fiscal 2025, compared with $220.0 million in fiscal 2024. This 7.0% was driven by a 6.3% increase in organic revenues, a 0.5% increase from acquisition-related revenues and a 0.2% net increase from foreign currency exchange rate fluctuations. The increase in revenues was mainly driven by data solutions, workstations and, to a lesser extent, front office solutions.\nOperating Expenses\nPrincipal Operating Expenses\nCost of services\n is mainly comprised of employee compensation costs and also includes expenses related to data costs, computer-related expenses, amortization of intangible assets, royalty fees, telecommunication costs and computer depreciation.\nSelling, general and administrative \n(\"\nSG&A\")\n consists primarily of employee compensation costs and also includes expenses related to occupancy costs, professional fees, depreciation of furniture and fixtures, amortization of leasehold improvements, travel and entertainment expenses, marketing costs, other employee-related expenses, internal communication costs, bad debt expense, the impact from our foreign currency forward contracts and asset impairments.\nEmployee compensation costs are a major component of both our Cost of services and SG&A. These expenses primarily include costs related to salaries, incentive compensation and sales commissions, stock-based compensation, benefits, employment taxes and restructuring costs.\nWe assign employee compensation costs between Cost of services and SG&A based on the roles and activities associated with each employee. We categorize employees within the content collection, consulting, product development, software and systems engineering groups as Cost of services personnel. Employees included in our sales department and those that serve in various other support departments, including marketing, finance, legal, human resources and administrative services, are classified as SG&A.\n33\nTable of Contents\nThe following table summarizes the components of our total operating expenses and operating margin:\n(dollar amounts in thousands)\nYears ended August 31,\n2025\n2024\n% Change\nCost of services\n$\n1,097,782\n$\n1,011,945\n8.5 \n%\nSG&A\n475,663\n489,812\n(2.9)\n%\nTotal operating expenses\n$\n1,573,445\n$\n1,501,757\n4.8 \n%\nOperating income\n$\n748,303\n$\n701,299\n6.7 \n%\nOperating margin\n32.2 \n%\n31.8 \n%\n1.2 \n%\nCost of Services\nCost of services increased 8.5% to $1,097.8 million in fiscal 2025, compared with $1,011.9 million in fiscal 2024, primarily due to an increase in amortization of intangible assets, employee compensation costs and computer-related expenses.\nCost of services, when expressed as a percentage of revenues, was 47.3% for fiscal 2025, an increase of 130 basis points compared with fiscal 2024. This increase was primarily from higher amortization of intangible assets, mainly driven by a 100 basis point increase in amortization from our capitalized internal-use software development costs.\nSelling, General and Administrative\n \nSG&A expenses decreased 2.9% to $475.7 million during fiscal 2025, compared with $489.8 million in fiscal 2024. The decrease was primarily attributable to charges related to the Sales Tax Dispute recorded in the prior year, partially offset by higher employee compensation costs and professional fees in the current year.\nSG&A expenses, when expressed as a percentage of revenues, were 20.5% for fiscal 2025, a decrease of 170 basis points compared with fiscal 2024. This decrease was primarily due to charges associated with the Sales Tax Dispute recorded in the prior year, partially offset by higher employee compensation costs and professional fees in the current year.\nWhen expressed as a percentage of revenues:\n•\nThe charges related to the Sales Tax Dispute recorded in the prior year decreased SG&A by 240 basis points. Refer to Part II, Item 8. Note 12, \nCommitments and Contingencies \nin the Notes to the Consolidated Financial Statements of this Annual Report on Form 10-K for more information on the Sales Tax Dispute.\n•\nEmployee compensation costs increased by 80 basis points, mainly due to higher variable compensation costs driven by a lower bonus accrual during fiscal 2024.\n•\nProfessional fees increased by 60 basis points, mainly due to acquisition-related costs.\nOperating Income and Operating Margin\nOperating income increased 6.7% to $748.3 million in fiscal 2025, compared with $701.3 million in fiscal 2024. This increase was primarily driven by  growth in revenues and charges associated with the Sales Tax Dispute recorded in the prior year, partially offset by higher employee compensation costs and amortization of intangible assets in the current year.\nOperating margin increased to 32.2% in fiscal 2025, compared with 31.8% in the prior year. This increase was primarily driven by growth in revenues and, when expressed as a percentage of revenues, charges associated with the Sales Tax Dispute recorded in the prior year, partially offset by higher amortization of intangible assets in the current year.\n34\nTable of Contents\nOperating Income by Segment\nWe operate our business through three segments: the Americas; EMEA; and Asia Pacific. Refer to Part II, Item 8. Note 17, \nSegment Information \nin the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for further discussion regarding our segments. The following table summarizes our operating income by segment:\n \nYears ended August 31,\n(dollar amounts in thousands)\n2025\n2024\n% Change\nAmericas\n$\n305,963 \n$\n261,790 \n16.9 \n%\nEMEA\n274,002 \n282,963 \n(3.2)\n%\nAsia Pacific\n168,338 \n156,546 \n7.5 \n%\nTotal Operating Income\n$\n748,303 \n$\n701,299 \n6.7 \n%\nAmericas\nAmericas operating income increased 16.9% to $306.0 million during fiscal 2025, compared with $261.8 million from the prior year. This increase was primarily due to growth in revenues of 6.1% and charges associated with the Sales Tax Dispute recorded in the prior year, partially offset by higher amortization of intangible assets and employee compensation costs in the current year.\n•\nThe charge related to the Sales Tax Dispute in the prior year is discussed in Part II, Item 8. Note 12, \nCommitments and Contingencies\n in the Notes to the Consolidated Financial Statements of this Annual Report on Form 10-K.\n•\nAmortization of intangible assets increased mainly due to higher amortization from our capitalized internal-use software development costs.\n•\nEmployee compensation costs increased primarily due to higher variable compensation costs driven by a lower bonus accrual during fiscal 2024. \nEMEA\nEMEA operating income decreased 3.2% to $274.0 million during fiscal 2025, compared with $283.0 million from the prior year. This decrease was primarily due to higher employee compensation costs, partially offset by growth in revenues of 3.0%. Employee compensation costs increased primarily due to higher annual base salaries, driven by an increase in annual merit and net headcount growth of 37 employees, and, to a lesser extent, variable compensation costs mainly due to a lower bonus accrual during fiscal 2024.\nAsia Pacific\nAsia Pacific operating income increased 7.5% to $168.3 million during fiscal 2025, compared with $156.5 million from the prior year. This increase was mainly due to growth in revenues of 7.0%, partially offset by higher employee compensation costs. Employee compensation costs increased primarily due to higher annual base salaries, driven by annual merit increases and a net headcount increase of 222 employees, and higher variable compensation costs mainly due to a lower bonus accrual during fiscal 2024. \nIncome Taxes\nThe provision for income taxes and the effective tax rate are as follows:\n \nYears ended August 31,\n(dollar amounts in thousands)\n2025\n2024\n% Change\nIncome before income taxes\n$\n720,958 \n$\n651,503 \n10.7 \n%\nProvision for income taxes\n$\n123,918 \n$\n114,377 \n8.3 \n%\nEffective tax rate\n17.2 \n%\n17.6 \n%\n(2.1)\n%\nWe are subject to taxation in the U.S. and various state, local and foreign jurisdictions in which we conduct our business. Our effective tax rate will vary based on, among other factors, changes in levels of foreign income, as well as other non-recurring events.\n35\nTable of Contents\nOur effective tax rate for fiscal 2025 was 17.2% compared with 17.6% for fiscal 2024. This decrease was primarily due to a lower U.S. tax impact of foreign earnings. All local, federal and foreign taxes payable were paid in a timely manner, subject to normal audits of open years.\nFor the periods presented, our effective tax rates were lower than the applicable U.S. corporate income tax rate. This was primarily attributable to excess tax benefits from stock-based compensation, a lower U.S. tax impact of foreign earnings, research and development (\"R&D\") tax credits and a foreign derived intangible income (\"FDII\") tax deduction, partially offset by our state income taxes.\nNet Income and Diluted EPS\n \nYears ended August 31,\n(in thousands, except per share data)\n2025\n2024\n% Change\nNet income\n$\n597,040 \n$\n537,126 \n11.2 \n%\nDiluted weighted average common shares\n38,385 \n38,618 \n(0.6)\n%\nDiluted EPS\n$\n15.55 \n$\n13.91 \n11.8 \n%\nThe increase in Net income and Diluted EPS for fiscal 2025, compared with fiscal 2024, was primarily driven by higher operating income and a gain from the divestiture of a business. \nNon-GAAP Financial Measures\nTo supplement the financial measures prepared in accordance with generally accepted accounting principles in the United States (\"GAAP\"), we use non-GAAP financial measures including organic revenues, adjusted operating income, adjusted operating margin, adjusted net income, EBITDA, adjusted EBITDA, adjusted Diluted EPS and free cash flow. Reconciliations from our financial measures calculated and presented in accordance with GAAP to these non-GAAP financial measures are shown in the tables below, and the reconciliation of free cash flow is included in the \nLiquidity and Capital Resources \nsection. These non-GAAP financial measures should not be considered in isolation from, as a substitute for, or superior to, financial measures reported in accordance with GAAP. Moreover, these non-GAAP financial measures have limitations in that they do not reflect all the items associated with the operations of our business as determined in accordance with GAAP. Other companies may calculate similarly titled non-GAAP financial measures differently than we do, limiting the usefulness of those measures for comparative purposes.\nDespite the limitations of these non-GAAP financial measures, we believe these adjusted financial measures and the information they provide are useful in viewing our performance using the same tools that management uses to gauge progress in achieving our goals. Adjusted measures may also facilitate comparisons to our historical performance.\nOrganic revenues excludes the current year impact of revenues from acquisitions and dispositions completed within the past 12 months (\"Acquisition revenues\" and \"Disposition revenues\", respectively) and the current year impact from changes in foreign currency. In addition, for our year to date comparisons, organic revenues also excludes current year revenues that were incurred prior to the first anniversary date of an acquisition. The table below provides an unaudited reconciliation of revenues to organic revenues:\n \nYears ended August 31,\n(dollar amounts in thousands)\n2025\n2024\n% Change\nRevenues\n$\n2,321,748 \n$\n2,203,056 \n5.4 \n%\nAcquisition revenues\n(20,663)\n— \nCurrency impact\n(901)\n— \nOrganic revenues\n$\n2,300,184 \n$\n2,203,056 \n4.4 \n%\nThe table below provides an unaudited reconciliation of Operating income, operating margin, Net income and Diluted EPS to adjusted operating income, adjusted operating margin, adjusted net income, EBITDA, adjusted EBITDA and adjusted Diluted EPS. Adjusted operating income and margin, adjusted net income, and adjusted Diluted EPS exclude the impact of acquisition-related intangible asset amortization and non-recurring items. EBITDA represents earnings before interest expense, provision for income taxes and depreciation and amortization, while adjusted EBITDA further excludes non-recurring non-cash expenses.\n36\nTable of Contents\nYears ended August 31, \n(in thousands, except per share data)\n2025\n2024\n% Change\nOperating income\n$\n748,303 \n$\n701,299 \n6.7 \n%\nIntangible asset amortization\n73,036 \n67,383 \nBusiness divestiture, acquisitions and related costs\n17,761 \n884 \nSales Tax Dispute\n(1)\n2,398 \n54,048 \n \nExecutive search costs\n1,675 \n— \nRestructuring/severance\n259 \n5,596 \nAsset impairment\n— \n3,443 \nAdjusted operating income\n$\n843,432 \n$\n832,653 \n1.3 \n%\nOperating margin\n32.2 \n%\n31.8 \n%\nAdjusted operating margin\n(2)\n36.3 \n%\n37.8 \n%\nNet income\n$\n597,040 \n$\n537,126 \n11.2 \n%\nIntangible asset amortization\n54,074 \n49,529 \nGain on business divestiture\n(17,205)\n— \nBusiness divestiture, acquisitions and related costs\n13,150 \n650 \nSales Tax Dispute\n(1)\n1,775 \n39,727 \n \nExecutive search costs\n1,240 \n— \nRestructuring/severance\n192 \n4,113 \nAsset impairment\n— \n2,531 \nIncome tax items\n1,351 \n1,397 \n \nAdjusted net income\n(3)\n$\n651,617 \n$\n635,073 \n2.6 \n%\nNet income\n$\n597,040 \n$\n537,126 \n11.2 \n%\nInterest expense\n56,324 \n65,778 \nIncome taxes\n123,918 \n114,377 \nDepreciation and amortization expense\n157,691 \n125,187 \nEBITDA\n$\n934,973 \n$\n842,468 \n11.0 \n%\nNon-recurring non-cash expenses\n— \n5,070 \nAdjusted EBITDA\n$\n934,973 \n$\n847,538 \n10.3 \n%\nDiluted EPS\n$\n15.55 \n$\n13.91 \n11.8 \n%\nIntangible asset amortization\n1.41 \n1.27 \nGain on business divestiture\n(0.45)\n— \nBusiness divestiture, acquisitions and related costs\n0.34 \n0.02 \nSales Tax Dispute\n(1)\n0.05 \n1.03 \n \nExecutive search costs\n0.03 \n— \nRestructuring/severance\n0.01 \n0.11 \nAsset impairment\n— \n0.07 \nIncome tax items\n0.04 \n0.04 \n \nAdjusted Diluted EPS\n(3)\n$\n16.98 \n$\n16.45 \n3.2 \n%\nWeighted average common shares (diluted)\n38,385 \n38,618 \n \n(1)\nRelated to a resolved matter with the Massachusetts Department of Revenue. Refer to Note 12, \nCommitments and Contingencies\n in the Notes to the Consolidated Financial Statements included in Part II, Item 8. of this Annual Report on Form 10-K, for further discussion on this matter.\n(2)\nAdjusted operating margin is calculated as Adjusted operating income divided by Revenues.\n(3)\nFor purposes of calculating Adjusted net income and Adjusted Diluted EPS, all adjustments were taxed at an adjusted tax rate of 26.0% and 26.5% for fiscal 2025 and fiscal 2024, respectively.\n37\nTable of Contents\nLiquidity and Capital Resources\nAs of August 31, 2025, Cash and cash equivalents were $337.7 million and restricted cash was $14.0 million, compared with Cash and cash equivalents of $423.0 million as of August 31, 2024. Refer to \nSummary of Cash Flows\n within this section below, for more information on cash flows during fiscal 2025 and 2024. Our Cash and cash equivalents as of August 31, 2025 are held in numerous locations throughout the world, with $169.8 million in EMEA (with the largest balance held in the UK), $106.1 million in the Americas and the remaining $61.8 million in Asia Pacific (with the largest balance held in the Philippines). \nAs of \nAugust 31, 2025\n, we had $486.9 million of undistributed foreign earnings of which $69.1 million are permanently reinvested. It is our intent to permanently reinvest all foreign undistributed earnings, except in jurisdictions where earnings can be repatriated substantially free of tax. It is not practicable to determine the deferred tax liability that would be payable if these earnings were repatriated to the U.S. \nOur cash flows provided by operating activities, existing cash and cash equivalents, supplemented with our debt borrowings, have been sufficient to fund our operations while allowing us to invest in activities that support the long-term growth of our operations. Generally, some or all of our remaining available cash flows have been used to, among other things, service our existing and future debt obligations, satisfy our working capital requirements and fund various activities, including our capital expenditures, acquisitions, investments, dividend payments and repurchases of our common stock. Based on past performance and current expectations, we believe our sources of liquidity, including the available capacity under our existing revolving credit facility and other financing alternatives, will provide us the necessary capital to fund these transactions and achieve our planned growth for the next 12 months and the foreseeable future. We are exposed to credit risk for our cash, cash equivalents and restricted cash held in financial institutions in the event of a default, to the extent that such amounts are in excess of applicable insurance limits; however, we do not believe our concentration of cash, cash equivalents and restricted cash presents a significant credit risk as the counterparties to the instruments consist of multiple high-quality, credit-worthy financial institutions.\nSources of Liquidity\nDebt and Swap Agreements\n2025 Credit Agreement\nOn April 8, 2025, we entered into a credit agreement (the \"2025 Credit Agreement\") and borrowed $500.0 million under a senior unsecured term loan credit facility (the \"2025 Term Facility\"). We used the proceeds from the 2025 Term Facility borrowing to repay the outstanding balance under the 2022 Revolving Facility (as defined below). The 2025 Credit Agreement also provides for a $1.0 billion senior unsecured revolving credit facility (the \"2025 Revolving Facility\"). The 2025 Revolving Facility, together with the 2025 Term Facility, are referred to as the \"2025 Credit Facilities\".\nThe 2025 Term Facility matures on April 8, 2028, and the 2025 Revolving Facility matures on April 8, 2030. The 2025 Revolving Facility provides for up to $100.0 million in the form of letters of credit and up to $100.0 million in the form of swingline loans. We may seek additional commitments of up to $1.0 billion under the 2025 Revolving Facility from lenders or other financial institutions.\nThe 2025 Term Facility is subject to scheduled quarterly principal payments, commencing on August 31, 2025, with each quarterly principal payment equal to 1.25% of the original principal amount of the 2025 Term Facility. The 2025 Credit Facilities are not otherwise subject to any other mandatory repayments. We may voluntarily prepay loans under the 2025 Credit Facilities at any time without premium or penalty. Prepayments of the 2025 Term Facility shall be applied to reduce the subsequent scheduled quarterly principal payments in direct order of maturity. \nDuring fiscal 2025, we repaid $125.0 million under the 2025 Term Facility. This included $68.8 million to satisfy all scheduled quarterly principal payments from loan inception through maturity, eliminating any future mandatory quarterly principal payment requirements. The remaining $56.2 million was made as a voluntary prepayment. From the effective date of the 2025 Revolving Facility through August 31, 2025, we have had no borrowings under the 2025 Revolving Facility.\nFrom the borrowing date through August 31, 2025, the outstanding borrowings under the 2025 Credit Facilities bore interest at a rate equal to the applicable one-month Term Secured Overnight Financing Rate (\"SOFR\") plus a 0.975% spread (comprised of a 0.875% interest rate margin, based on a pricing grid determined by reference to our senior unsecured non-credit enhanced long-term debt rating and our total leverage ratio, plus a 0.1% credit spread adjustment). \n38\nTable of Contents\nWe pay a commitment fee on the daily unused amount of the 2025 Revolving Facility using a pricing grid based on our senior unsecured non-credit enhanced long-term debt rating and our total leverage ratio. The commitment fee remained consistent at 0.1% through August 31, 2025.\nDebt issuance costs related to the 2025 Credit Facilities were $3.4 million. These debt issuance costs are presented in the Consolidated Balance Sheets as a direct deduction from the carrying amount of the debt liability for the 2025 Term Facility and within Other assets for the 2025 Revolving Facility. Debt issuance costs are amortized to Interest expense in the Consolidated Statements of Income on a straight-line basis over the contractual term of the debt (which approximates the effective interest method for the 2025 Term Facility).\nThe 2025 Credit Agreement contains usual and customary event of default provisions for facilities of this type, which are subject to usual and customary grace periods and materiality thresholds. If an event of default occurs under the 2025 Credit Agreement, the lenders may, among other things, terminate their commitments and declare all outstanding borrowings immediately due and payable. \nThe 2025 Credit Agreement contains usual and customary affirmative and negative covenants for facilities of this type, including a financial covenant requiring maintenance of a total leverage ratio of no greater than 3.75 to 1.00 as of the last day of each fiscal quarter (subject to an increase to 4.25 to 1.00 for five consecutive fiscal quarters in connection with certain material acquisitions). We were in compliance with all covenants and requirements of the 2025 Credit Agreement as of August 31, 2025.\n2022 Credit Agreement\nOn March 1, 2022, we entered into a credit agreement (the \"2022 Credit Agreement\") and borrowed $1.0 billion under a senior unsecured term loan credit facility (the \"2022 Term Facility\") and $250.0 million of the available $500.0 million under a senior unsecured revolving credit facility (the \"2022 Revolving Facility\"). The 2022 Revolving Facility, together with the 2022 Term Facility, are referred to as the \"2022 Credit Facilities\". On January 31, 2025, we entered into a joinder agreement to our 2022 Credit Agreement pursuant to which commitments under the 2022 Revolving Facility were increased by $100.0 million, to a total of $600.0 million. All other terms of the 2022 Credit Agreement remained unchanged. \nThe 2022 Term Facility, originally due to mature on March 1, 2025, was repaid in full following $125.0 million of repayments made during the six months ended February 28, 2025. During fiscal 2025, we borrowed $305.0 million and repaid $555.0 million under the 2022 Revolving Facility. The 2022 Credit Agreement was terminated on April 8, 2025, concurrent with entering into the 2025 Credit Agreement.\nBorrowings previously outstanding under the 2022 Credit Facilities bore interest at a rate equal to the applicable one-month Term SOFR plus a spread, using a debt leverage pricing grid and a credit spread adjustment (with total spread ranging from 0.975% to 1.1% over the term of the debt). \nInterest Rate Swap Agreements\nWe leverage interest rate swap agreements to manage our floating interest rate exposure with a fixed interest rate. Our interest rate swap agreements are designated as cash flow hedges at inception.\n2025 Swap Agreement\nOn April 24, 2025, we entered into an interest rate swap agreement (\"2025 Swap Agreement\") with a notional amount of $200.0 million to hedge a portion of our outstanding floating SOFR debt with a fixed interest rate of 4.086%. The notional amount of the 2025 Swap Agreement declines by $50.0 million on a quarterly basis beginning May 31, 2025 and matures on February 28, 2026. As of August 31, 2025, the notional amount of the 2025 Swap Agreement was $100.0 million.\n2024 Swap Agreement\nOn March 1, 2024, we entered into an interest rate swap agreement (\"2024 Swap Agreement\") with a notional amount of $200.0 million to hedge a portion of our outstanding floating SOFR debt with a fixed interest rate of 5.145%. The notional amount of the 2024 Swap Agreement declined by $50.0 million on a quarterly basis beginning May 31, 2024. The 2024 Swap Agreement matured on February 28, 2025.\n39\nTable of Contents\n2022 Swap Agreement\nOn March 1, 2022, we entered into an interest rate swap agreement (\"2022 Swap Agreement\") with a notional amount of $800.0 million to hedge a portion of our outstanding floating SOFR debt with a fixed interest rate of 1.162%. The notional amount of the 2022 Swap Agreement declined by $100.0 million on a quarterly basis beginning May 31, 2022. The 2022 Swap Agreement matured on February 28, 2024. \nRefer to Part II, Item 7A. \nQuantitative and Qualitative Disclosures About Market Risk\n, in this Annual Report on Form 10-K, for further discussion of our exposure to interest rate risk on our outstanding floating rate debt.\nSenior Notes\nOn March 1, 2022, we completed a public offering issuing $500.0 million of 2.900% Senior Notes due March 1, 2027 (the \"2027 Notes\") and $500.0 million of 3.450% Senior Notes due March 1, 2032 (the \"2032 Notes\" and, together with the 2027 Notes, the \"Senior Notes\"). The Senior Notes were issued pursuant to an indenture, dated as of March 1, 2022, by and between us and U.S. Bank Trust Company, National Association, as trustee (the \"Trustee\"), as supplemented by the supplemental indenture, dated as of March 1, 2022, between us and the Trustee (the \"Supplemental Indenture\").\nThe Senior Notes were issued at an aggregate discount of $2.8 million and we incurred approximately $9.1 million in debt issuance costs during fiscal 2022. Debt discounts and debt issuance costs are presented in the Consolidated Balance Sheets as a net direct deduction from the carrying amount of the debt liability. The debt discounts and debt issuance costs are amortized to Interest expense in the Consolidated Statements of Income over the contractual term of the debt, leveraging the effective interest method.\nInterest on the Senior Notes is payable semiannually in arrears on March 1 and September 1 of each year. \nWe may redeem the Senior Notes, in whole or in part, at any time at specified redemption prices, plus any accrued and unpaid interest. Upon the occurrence of a change of control triggering event (as defined in the Supplemental Indenture), we must offer to repurchase the Senior Notes at 101% of their principal amount, plus any accrued and unpaid interest. \nUses of Liquidity\nReturning Value to Stockholders\nWe returned $460.4 million and $385.9 million to our stockholders in the form of share repurchases and dividends during fiscal 2025 and 2024, respectively. \nShare Repurchase Program\nWe may repurchase shares of our common stock under our share repurchase program from time-to-time in the open market or via privately negotiated transactions, subject to market conditions. During fiscal 2025 and 2024, we repurchased 684,960 shares for $300.5 million and 537,800 shares for $235.2 million, respectively.\nThere is no defined number of shares to be repurchased over a specified timeframe through the life of our share repurchase program. On September 17, 2024, our Board of Directors approved a new share repurchase authorization of up to $300 million in aggregate, which was available during fiscal 2025. This authorization expired upon the conclusion of fiscal 2025 and was not available for share repurchases after that date.\nOn June 17, 2025, our Board of Directors authorized up to $400 million for share repurchases on or after September 1, 2025 through September 30, 2026. \nRefer to Part III, Item 12, \nSecurity Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\n, of this Annual Report on Form 10-K for further discussion on our share repurchase program. \nDividends\nDuring fiscal 2025 and 2024, we paid dividends of $160.0 million and $150.7 million, respectively. In the third quarter of fiscal 2025, our Board of Directors approved a 6% increase in the regular quarterly dividend from $1.04 to $1.10 per share. Fiscal 2025 marked the 26th consecutive fiscal year we have increased dividends on a stock split-adjusted basis, highlighting our continued commitment to returning value to our stockholders. Future cash dividend payments are subject to final determination by our Board of Directors and will depend on our earnings, capital requirements, financial condition and other relevant factors.\n40\nTable of Contents\nCapital Expenditures\nFor the year ended August 31, 2025, capital expenditures increased by 27.0% to $108.8 million, compared with $85.7 million in fiscal 2024. This increase was primarily due to higher capitalized costs related to the development of our internal-use software.\nAcquisitions\nOur acquisitions with the most significant cash flows from fiscal 2023 through fiscal 2025 included Liquid Holdings, LLC (\"LiquidityBook\") and Platform Group Limited (\"Irwin\"). Refer to Part II, Item 8. Note 5, \nAcquisitions \nin the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for further discussion of these acquisitions.\nLiquidityBook\nOn February 7, 2025 we completed the acquisition of LiquidityBook for a purchase price of $243.2 million, net of cash acquired, and inclusive of preliminary working capital adjustments. The purchase price includes contingent consideration of $11.9 million, which reflects the acquisition date fair value of potential future payments that are contingent upon the achievement of certain specified milestones. \nLiquidityBook provides cloud-native trading solutions to hedge fund, asset and wealth management, outsourced trading, and sell-side middle office clients. LiquidityBook operates a proprietary FIX network that enables streamlined connectivity to over 200 brokers and order routing to more than 1,600 destinations across 80 markets globally. This acquisition adds technology-forward order management and investment book of record capabilities and enhances FactSet’s ability to serve the integrated workflow needs of clients across the portfolio life cycle.\nIrwin\nOn November 5, 2024, we completed the acquisition of Irwin for a purchase price of $120.2 million, net of cash acquired, and inclusive of working capital adjustments. The purchase price includes contingent consideration of $9.6 million, which reflects the acquisition date fair value of potential future payments that are contingent upon the achievement of certain specified milestones. We finalized the purchase accounting for the Irwin acquisition during the third quarter of fiscal 2025. \nIrwin is a leading investor relations and capital markets platform for public companies and their advisors. This acquisition builds on a recent successful partnership between FactSet and Irwin, and expands our ability to address the holistic workflow needs of investor relations professionals with an integrated, modern solution.\nContractual Obligations\nPurchase obligations represent our legally-binding agreements to purchase fixed or minimum quantities at determinable prices. As of August 31, 2025 and 2024, we had total purchase obligations with suppliers and vendors of approximately $352 million and $383 million, respectively. Our total purchase obligations as of August 31, 2025 and 2024 primarily related to hosting services, acquisition of data and, to a lesser extent, third-party software providers.\nWe also have contractual obligations related to our lease liabilities and outstanding debt. Refer to Part II, Item 8. Note 10, \nLeases\n and Note 11, \nDebt\n in the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for information regarding our lease commitments and outstanding debt obligations, respectively.\nSummary of Cash Flows\nThe following table provides a summary of our net cash flow activity for the fiscal years presented:\nYears ended August 31,\n(dollar amounts in thousands)\n2025\n2024\n $ Change\nNet cash provided by operating activities\n$\n726,260 \n$\n700,338 \n$\n25,922 \nNet cash provided by (used in) investing activities\n(392,773)\n(144,317)\n(248,456)\nNet cash provided by (used in) financing activities\n(407,821)\n(560,850)\n153,029 \nEffect of exchange rate changes on cash, cash equivalents and restricted cash\n3,050 \n2,364 \n686 \nNet increase (decrease) in cash, cash equivalents and restricted cash\n$\n(71,284)\n$\n(2,465)\n$\n(68,819)\n41\nTable of Contents\nOperating\nFor fiscal 2025, net cash provided by operating activities was $726.3 million, which included net income of $597.0 million, non-cash charges of $235.0 million and a net cash outflow of $105.7 million to support our working capital requirements. The non-cash charges were primarily driven by depreciation and amortization. The change in our working capital was primarily driven by cash outflows related to payments to resolve the Sales Tax Dispute, timing of vendor payments and client collections, as well as lease payments.\nFor fiscal 2024, net cash provided by operating activities was $700.3 million, which included net income of $537.1 million, non-cash charges of $201.6 million and a net cash outflow of $38.4 million to support our working capital requirements. The non-cash charges were primarily driven by depreciation and amortization and, to a lesser extent, stock-based compensation expense. The change in our working capital was primarily driven by cash outflows related to lease payments and prepaid expenses, partially offset by the timing of payments to vendors.\nInvesting\nFor fiscal 2025, net cash used in investing activities was $392.8 million. The cash used in investing activities primarily consisted of $348.3 million of acquisition-related consideration related mainly to the Irwin and LiquidityBook transactions, $108.8 million of\n \ncapital expenditures mainly driven by the capitalization of internal-use software development costs, partially offset by $58.2 million in proceeds from our investments in mutual funds.\nFor fiscal 2024, net cash used in investing activities was $144.3 million. The cash used in investing activities was primarily related to capital expenditures of $85.7 million, mainly driven by the capitalization of internal-use software development costs and $58.6 million in investments, primarily related to the purchase of mutual funds.\nFinancing\nFor fiscal 2025, net cash used in financing activities was $407.8 million, consisting mainly of $805.0 million related primarily to the repayment of the 2022 Credit Facilities, $300.5 million of share repurchases and $160.0 million of dividend payments, partially offset by $803.4 million of proceeds from borrowings under the 2025 Term Facility and the 2022 Revolving Facility, in periods prior to its termination, and $81.7 million of proceeds from employee stock plans. \nFor fiscal 2024, net cash used in financing activities was $560.9 million, consisting mainly of $250.0 million related to the partial repayment of the 2022 Term Facility, $235.2 million of share repurchases and $150.7 million of dividend payments, partially offset by $91.7 million of proceeds from employee stock plans.\nFree Cash Flow\nWe define free cash flow, a non-GAAP financial measure, as cash provided by operating activities, less purchases of property, equipment and leasehold improvements (\"PPE\") and capitalized internal-use software. We believe free cash flow is a liquidity measure that provides useful information to management and investors about the amount of cash generated by the business that, after capital expenditures, can be used for strategic opportunities, including returning value to stockholders, investing in our business, making strategic acquisitions, and strengthening the balance sheet. Free cash flow should be considered in addition to consolidated net income and net cash provided by operating activities, but should not be used as a substitute for these key measures of our performance and liquidity.\nThe following table reconciles our net cash provided by operating activities to free cash flow:\nYears ended August 31,\n(dollar amounts in thousands)\n2025\n2024\n$ Change\nNet cash provided by operating activities\n$\n726,260 \n$\n700,338 \n$\n25,922 \nLess: purchases of property, equipment, leasehold improvements and capitalized internal-use software\n(108,806)\n(85,681)\n(23,125)\nFree cash flow\n$\n617,454 \n$\n614,657 \n$\n2,797 \nWe generated free cash flow of $617.5 million during fiscal 2025, an increase of $2.8 million compared with fiscal 2024. This increase was driven by $25.9 million in cash provided by operating activities, partially offset by higher PPE mainly from capitalized costs related to the development of our internal-use software.\n42\nTable of Contents\nOff-Balance Sheet Arrangements\nAs of August 31, 2025 and August 31, 2024, we had no off-balance sheet financing other than letters of credit incurred in the ordinary course of business. Refer to Part II, Item 8. Note 11, \nDebt \nand\n \nNote 12, \nCommitments and Contingencies \nin the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for more information on our letters of credit. \nAs of August 31, 2025 and August 31, 2024, we also had no other arrangements with unconsolidated entities or financial partnerships (such as entities often referred to as structured finance or special purpose entities) established for purposes of facilitating off-balance sheet financing, other debt arrangements, or other contractually limited purposes.\nForeign Currency Exposure\nAs we operate globally, we are exposed to the risk that our financial condition, results of operations and cash flows could be impacted by changes in foreign currency exchange rates. During fiscal 2025 and 2024, we maintained a series of foreign currency forward contracts to hedge a portion of our projected operating expenses in our primary currency exposures, namely the British Pound Sterling, Euro, Indian Rupee, and Philippine Peso. As of August 31, 2025, the hedge maturity periods of our outstanding foreign currency forward contracts range from the first quarter of fiscal 2026 through the fourth quarter of fiscal 2026. \nRefer to Part II, Item 7A. \nQuantitative and Qualitative Disclosures About Market Risk\n in this Annual Report on Form 10-K for more information on our foreign currency exposures.\nCritical Accounting Estimates\nWe prepare the Consolidated Financial Statements in conformity with GAAP, which requires us to make certain estimates and apply judgments that affect the reported amounts of assets, liabilities, revenues and expenses and related disclosures. We base our estimates on historical experience and other assumptions that we believe to be reasonable at the time the Consolidated Financial Statements are prepared and, as such, they may ultimately differ materially from actual results.\nWe describe our significant accounting policies in Part II, Item 8. Note 2, \nSummary of Significant Accounting Policies\n in the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K. \nThe Audit Committee of our Board of Directors reviews the development and selection of our critical accounting estimates. The critical accounting estimates and judgments that we believe to have the most significant impacts to our Consolidated Financial Statements are described below.\nIncome Taxes\nWe are subject to taxation in the U.S. and various state, local and foreign jurisdictions in which we conduct our business. Our provision for income taxes is an estimate based on our understanding of laws in these federal, state, local and foreign tax jurisdictions. These laws can be complicated and are difficult to apply to any business. The tax laws also require us to allocate our taxable income to many jurisdictions based on subjective allocation methodologies and information collection processes.\nOur provision for income taxes is subject to volatility and could be adversely impacted by numerous factors such as changes in earnings or tax laws, regulations, or accounting principles, including accounting for uncertain tax positions or interpretations of them. Significant judgment is required in determining our provision for income taxes, deferred tax assets and liabilities and unrecognized tax benefits. \nFurther, as a result of certain ongoing employment and capital investment actions and commitments, our income in certain countries is subject to reduced tax rates. Our failure to meet these employment and capital investment actions and commitments could adversely affect our provision for income taxes. In addition, we are subject to the continuous examination of our income tax returns by the Internal Revenue Service and other tax authorities. We regularly assess the likelihood of adverse outcomes resulting from these examinations to determine the adequacy of our provision for income taxes. There can be no assurance that the outcomes from these continuous examinations will not adversely impact our operating results and financial condition. \nSignificant judgment is required in determining our uncertain tax positions. We follow a two-step approach in recognizing and measuring uncertain tax positions. The first step is to evaluate the tax position for recognition by determining if the weight of available evidence indicates that it is more likely than not (defined as a likelihood of more than 50%) that a tax position will be sustained based on its technical merits as of the reporting date. The second step, for those positions that meet the recognition \n43\nTable of Contents\ncriteria, is to measure and recognize the largest amount of benefit that is greater than 50% likely of being realized upon effective settlement with a taxing authority. As the determination of liabilities related to uncertain tax positions and associated interest and penalties requires significant estimates and assumptions, there can be no assurance that we will accurately predict the outcomes of these audits. For this reason and due to ongoing audits by multiple tax authorities, we regularly engage in discussions and negotiations with tax authorities regarding tax matters in various jurisdictions. We adjust these reserves in light of changing facts and circumstances, such as the closing of a tax audit or the refinement of an estimate. To the extent that the final outcome of these matters is different than the amounts recorded, such differences will affect the provision for income taxes in the period in which such determination is made. \nWe accrue interest on all tax exposures for which reserves have been established consistent with jurisdictional tax laws. \nThe Provision for income taxes on our Consolidated Statements of Income includes the impact of changes to reserves and any related interest. We have no reason to believe that such audits will result in the payment of additional taxes and/or penalties that would have a material adverse effect on our results of operations or financial position, beyond current estimates. \nRefer to Part II, Item 8. Note 9, \nIncome Taxes\n in the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for further information.\nStock-based Compensation\nWe measure and recognize stock-based compensation expense for all stock-based awards and purchases of common stock under the employee stock purchase plan (\"ESPP\") based on their estimated grant date fair value.\nWe utilize a lattice-binomial option-pricing model (\"binomial model\") to estimate the grant date fair value for our employee stock options and the Black-Scholes model to estimate the grant date fair value for stock options granted to the members of the Board of Directors (\"non-employee directors\") and common stock purchased by eligible employees under our ESPP.\nBoth the binomial model and Black-Scholes model involve certain estimates and assumptions such as:\n•\nRisk-free interest rate\n \n-\n based on the U.S. Treasury yield curve in effect at the time of grant with maturities equal to the expected terms of the stock-based awards granted. \n•\nExpected life\n -\n \nthe weighted average period the stock-based awards are expected to remain outstanding.\n•\nExpected volatility\n \n- based on a blend of historical volatility of the stock-based award's useful life and the weighted average implied volatility for call option contracts traded in the 90 days preceding the stock-based award's valuation date. \n•\nDividend yield\n -\n \nthe expectation of dividend payouts based on our history. \nThe binomial model also incorporates market conditions, vesting restrictions and exercise patterns.\nFor our performance share units (\"PSUs\"), management makes quarterly assessments of the probability of achieving specified performance criteria established at the time of grant. The ultimate number of common shares that may be earned from a PSU is determined pursuant to a payout range based on the achievement of specified performance levels.\nWe estimate expected forfeitures of equity awards at the date of grant and recognize compensation expense only for those awards expected to vest. The forfeiture assumption is revised if actual forfeitures differ from those estimates.\nThe assumptions we use to calculate and account for stock-based compensation awards represent management's best estimates, which involve inherent uncertainties. As a result, if we revise our assumptions and estimates, our stock-based compensation expense could differ from amounts recorded. \nRefer to Part II, Item 8. Note 15, \nStock-Based Compensation\n in the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for further information.\nGoodwill \nGoodwill represents the excess of the purchase price over the fair value of identifiable net assets acquired at the acquisition date. Goodwill is not amortized as it is estimated to have an indefinite life. We test goodwill annually for impairment during the fourth quarter of each fiscal year or more frequently if events and circumstances occur indicating that it is more likely than not that the fair value of any one of our reporting units is less than its respective carrying value. Impairment is tested at the reporting unit level and if the carrying value of the reporting unit exceeds the fair value, then the goodwill is considered impaired and written down to the reporting unit’s fair value. The impairment loss for the reporting unit cannot exceed the carrying value of the goodwill allocated to that reporting unit.\n44\nTable of Contents\nWe may elect to perform a qualitative analysis for the reporting units to determine whether it is more likely than not (a likelihood of more than 50%) that the fair value of the reporting unit is less than its carrying value. In performing a qualitative assessment, we consider such factors as macro-economic conditions, industry and market conditions in which we operate, including the competitive environment and significant changes in demand for our products or services. We also consider the share price both in absolute terms and in relation to peer companies. If the qualitative analysis indicates that it is more likely than not the fair value of a reporting unit is less than its carrying value or if we elect not to perform a qualitative analysis, a quantitative analysis is performed to determine whether a goodwill impairment exists.\nThe quantitative goodwill impairment analysis is used to identify potential impairment by comparing the carrying value of a reporting unit with its fair value. To perform this analysis, we apply the income approach which utilizes discounted cash flows and other relevant market information. Significant judgment is involved in determining the assumptions used in estimating future cash flows, such as: expected sales, working capital needs to support each reporting unit, capital expenditures and related depreciation and amortization, operating expenses, expected tax rates and the weighted average cost of capital for each reporting unit. Our cost of capital is based on assumptions about interest rates, as well as a risk-adjusted rate of return required by our equity investors. These estimates and judgments are critical, as they directly influence the calculated fair value of our reporting units and, consequently, the results of our goodwill impairment assessment. \nRefer to Part II, Item 8. Note 7, \nGoodwill \nin the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for further details.\nBusiness Combinations\nWe account for business combinations using the purchase method of accounting. Under this method, the acquisition purchase price is allocated to the underlying identified tangible and intangible assets acquired, and liabilities assumed, based on their respective estimated fair values on the acquisition date. The excess of the purchase consideration over the fair value of the identified assets and liabilities is recorded as goodwill and assigned to one or more reporting units. The value and useful life assigned to acquisition-related tangible and intangible assets impact the amount and timing of future amortization expense. Determining the fair value of assets acquired and liabilities assumed and the expected useful life requires management’s judgment and often involves the use of significant estimates and assumptions, including assumptions with respect to future cash inflows and outflows, discount rates, asset lives and market multiples, among other items. Acquisition-related expenses and restructuring costs, if any, are recognized separately from the business combination and are expensed as incurred.\nRefer to Part II, Item 8. Note 5, \nAcquisitions \nin the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for further information.\nPPE and Intangible Assets \nWe amortize our PPE and identifiable intangible assets over their estimated useful lives. Determining the useful life requires judgment and an understanding of our planned use of the asset, among other factors. If different useful lives had been used, the resulting amortization or depreciation expense recognized may be materially different. If the estimate of the remaining useful life is changed, the remaining carrying amount of the PPE and intangible asset is, respectively, amortized or depreciated, prospectively over that revised remaining useful life. \nWe review our PPE and intangible assets to determine if any indicators of impairment are present on a quarterly basis or whenever events or changes in circumstances indicate that the carrying amount of an asset group may not be recoverable. If indicators of impairment are present, the asset group is tested for impairment by comparing the carrying value to undiscounted cash flows and, if impaired, written down to fair value based on discounted cash flows. In performing this assessment, significant judgment is involved in determining the assumptions used in estimating future cash flows and the discount rate. \nRefer to Part II, Item 8. Note 6, \nProperty, Equipment and Leasehold Improvements \nand\n \nNote 8, \nIntangible Assets \nin the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for further information.\nContingencies\nWe are subject to various legal proceedings, claims and litigation that have arisen in the ordinary course of business, which involve inherent uncertainties. We accrue for contingencies when we believe that a loss is probable and the amount can be reasonably estimated. Judgment is required to determine both the probability and the estimated amount of loss. If the reasonable estimate of a probable loss is a range, we record an accrual for the most probable estimate of the loss or the minimum amount when no amount within the range is a better estimate than any other amount. We review these accruals on a quarterly basis and adjust, as necessary, to reflect the impact of negotiations, settlements, rulings, advice of legal counsel and other current information. If actual results differ from our assessments, our financial position, results of operations, or cash flows would be \n45\nTable of Contents\naffected. Refer to Part II, Item 8. Note 12, \nCommitments and Contingencies \nin the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for more information on our contingent matters.\nFor more information on the accounting of our income tax contingencies, refer to Part II, Item 8. Note 9, \nIncome Taxes\n in the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K.\nNew Accounting Pronouncements\nFor a discussion of accounting pronouncements recently adopted and those issued but not yet adopted, refer to Part II, Item 8. Note 2, Summary of Significant Accounting Policies in the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K. \n46\nTable of Contents\nITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nIn the normal course of business, we are exposed to foreign currency exchange risk and interest rate risk that could impact our financial position and results of operations. Current market events have not required us to materially modify our financial risk management strategies with respect to our exposures to foreign currency exchange risk or interest rate risk.\nForeign Currency Transaction Risk\nAs we operate globally, we are exposed to the risk that our financial condition, results of operations and cash flows could be impacted by changes in foreign currency exchange rates. During fiscal 2025 and 2024, we maintained a series of foreign currency forward contracts to hedge a portion of our projected operating expenses in these primary currency exposures, namely the British Pound Sterling, Euro, Indian Rupee and Philippine Peso. As of August 31, 2025, the hedge maturity periods of our outstanding foreign currency forward contracts range from the first quarter of fiscal 2026 through the fourth quarter of fiscal 2026. Based on the operating income for fiscal 2025, comparing the average quarterly foreign currency exchange rates for fiscal 2025 to the respective rates for fiscal 2024, net of hedge activity, resulted in an increase in operating income of $0.3 million. We utilize cash flow hedges to manage risk and not for speculative or trading purposes.\nWe performed a sensitivity analysis to determine the effects on both the fair value of our outstanding foreign currency forward contracts and our operating income, excluding these forward contracts, of a hypothetical devaluation of the U.S. dollar by 10% as of August 31, 2025, relative to the other foreign currencies in which we transact. The sensitivity analysis indicated that a devaluation of the U.S. dollar by 10% would have increased the fair value of our outstanding forward contracts by approximately $19 million as of August 31, 2025 and decreased our operating income, excluding these forward contracts, by an estimated $47 million for fiscal 2025. This sensitivity analysis has inherent limitations as it disregards the possibility that rates of multiple foreign currencies will not always move in the same direction relative to the value of the U.S. dollar over time and does not account for our forward contracts that we utilize to mitigate fluctuations in exchange rates. \nForeign Currency Translation\n Risk\nWe are exposed to foreign currency risk due to the translation of our results from certain international operations into U.S. Dollars, as part of the consolidation process. Fluctuations in foreign currency exchange rates can create volatility in our results of operations and our financial condition. \nThe following table reflects the foreign currency translation adjustment gains and losses recorded in Other comprehensive income (loss):\nYears ended August 31,\n(in thousands)\n2025\n2024\nForeign currency translation adjustment gains (losses)\n$\n15,565 \n$\n8,565 \nInterest Rate Risk\nCash and Cash Equivalents and Investments\nAs of August 31, 2025, we had Cash and cash equivalents of $337.7 million and Investments of $17.4 million. Our Cash and cash equivalents consist of cash and highly liquid investments including demand deposits and money market funds and our Investments consist of mutual funds. We are exposed to interest rate risk through fluctuations of interest rates on these investments. As we have a restrictive investment policy, our financial exposure to fluctuations in interest rates is expected to remain low. Refer to Part II, Item 8. Note 2, \nSummary of Significant Accounting Policies \nin the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for more information on our Cash and cash equivalents.\nDebt\n2025 Credit Agreement\nAs of August 31, 2025, our outstanding floating rate debt included $375.0 million under the 2025 Credit Agreement. As of August 31, 2025, the outstanding borrowings under the 2025 Credit Agreement bore interest at a rate equal to the applicable \n47\nTable of Contents\none-month Term SOFR plus a 0.975% spread (comprised of a 0.875% interest rate margin based on a debt leverage pricing grid plus a 0.1% credit spread adjustment).\nTo mitigate our exposure to interest rate volatility due to changes in SOFR, we entered into the 2025 Swap Agreement on April 24, 2025, to hedge a portion of our outstanding floating SOFR debt with a fixed interest rate of 4.086%. As of August 31, 2025, the 2025 Swap Agreement has a notional amount of $100.0 million and matures on February 28, 2026.\nOur Senior Notes have a fixed interest rate and are not subject to interest rate change. As such, our interest rate exposure as of August 31, 2025 is limited to the outstanding principal balance of our floating rate debt under our 2025 Credit Facilities in excess of the 2025 Swap Agreement. As of August 31, 2025, our interest rate exposure equals the Term SOFR applied to $275.0 million, our outstanding floating rate debt, net of our 2025 Swap Agreement. Assuming the principal balance of our outstanding floating rate debt, net of the 2025 Swap Agreement, remained at $275.0 million, a hypothetical 25 basis point change (up or down) in the one-month SOFR would result in an approximate $1 million change to our annual interest expense as of August 31, 2025. \nRefer to Part II, Item 8. Note 11, \nDebt \nin the Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K for more information on our swap agreements and outstanding borrowings.\n48\nTable of Contents\nITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nIndex to Consolidated Financial Statements\nPage\nManagement’s Statement of Responsibility for Financial Statements\n50\nManagement’s Report on Internal Control Over Financial Reporting\n50\nReports of Independent Registered Public Accounting Firm Reports of Independent Registered Public Accounting Firm (PCAOB ID:\n \n42\n)\n52\nConsolidated Financial Statements:\nConsolidated Statements of Income for the years ended\n August 31, 2025, 2024 \nand\n 2023\n56\nConsolidated Statements of Comprehensive Income for the years ended August 31, \n2025, 2024\n \nand\n 2023\n57\nConsolidated Balance Sheets at August 31, \n2025 \nand\n 2024\n58\nConsolidated Statements of Cash Flows for the years ended August 3\n1, \n2025, 2024 \nand\n 2023\n59\nConsolidated Statements of Changes in Stockholders’ Equity for the years ended August 31, \n2025, 2024 \n and \n2023\n61\nNotes to the Consolidated Financial Statements\n62\nFinancial Statement Schedule:\nSchedule II – Valuation and Qualifying Accounts\n97\n49\nTable of Contents\nManagement’s Statement of Responsibility for Financial Statements \nOur management prepares and is responsible for the fairness, integrity and objectivity of our Consolidated Financial Statements. The accompanying Consolidated Financial Statements have been prepared in conformity with accounting principles generally accepted in the United States of America (\"GAAP\") and include amounts based on our management’s estimates and judgments. All financial information in this Report on Form 10-K has been presented on a basis consistent with the information included in the accompanying financial statements.\nOur policies and practices reflect corporate governance initiatives that are compliant with the listing requirements of the New York Stock Exchange, the NASDAQ Stock Market and the corporate governance requirements of the Sarbanes-Oxley Act of 2002. Our management, with oversight by our Board of Directors, has established and maintains a strong ethical climate so that our affairs are conducted to the highest standards of personal and corporate conduct.\nWe maintain accounting systems, including internal accounting controls, designed to provide reasonable assurance of the reliability of financial records and the protection of assets. The concept of reasonable assurance is based on recognition that the cost of a system should not exceed the related benefits. The effectiveness of those systems depends primarily upon the careful selection of financial and other managers, clear delegation of authority and assignment of accountability, inculcation of high business ethics and conflict-of-interest standards, policies and procedures for coordinating the management of corporate resources, and the leadership and commitment of top management. In compliance with the Sarbanes-Oxley Act of 2002, we assessed our internal control over financial reporting as of August 31, 2025 and issued a report (see below).\nManagement’s Report on Internal Control Over Financial Reporting\nAs previously reported in the Company’s Annual Report on Form 10-K for the fiscal year ended August 31, 2024, we had identified a material weakness in the design and operation of information technology (“IT”) general controls that support our revenues, accounts receivable, and deferred revenues processes which, in the aggregate, gave rise to a material weakness in internal control over financial reporting, which we are in the process of remediating.\nFor fiscal 2025, our management (with the participation of the Chief Executive Officer and Chief Financial Officer) conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework in Internal Control—Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this evaluation, our management concluded that our internal control over financial reporting was not effective as of August 31, 2025, as a result of the material weakness in internal control over financial reporting described further below, which represents a continuation of a sub-set of the control deficiencies which gave rise to the initial material weakness previously identified. However, giving full consideration to the material weakness, the control deficiencies did not result in any identified misstatements, and the Company's management has concluded that our Consolidated Financial Statements present fairly, in all material respects, our financial position, results of operations and cash flows for the periods disclosed in conformity with GAAP.\nIn accordance with the guidance issued by the Securities and Exchange Commission, companies are permitted to exclude acquisitions from their first assessment of internal control over financial reporting following the date of acquisition. Based on those guidelines, our management's assessment of the effectiveness of our internal control over financial reporting excluded Platform Group Limited (\"Irwin\") and Liquid Holdings, LLC (\"LiquidityBook\"), which we acquired in the first quarter and second quarter of fiscal 2025, respectively. Excluding goodwill and intangible assets, these acquisitions represented a combined 2% of our Total assets as of August 31, 2025 and 1% of our consolidated Revenues for fiscal year 2025. Refer to Note 5, \nAcquisitions\n, for additional information on these acquisitions.\nInherent Limitations of Internal Controls over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting for FactSet. Internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with GAAP. Internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of our assets; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles and that our receipts and expenditures are being made only in accordance with authorizations of our management and directors; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of our assets that could have a material effect on the financial statements.\n50\nTable of Contents\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions or that the degree of compliance with the policies or procedures may deteriorate.\nManagement’s Report on Internal Control Over Financial Reporting\nWhile we have made significant progress remediating the control deficiencies identified during our year ended August 31, 2024, we continue to have certain deficiencies related to the IT general controls that support our revenues, accounts receivable, and deferred revenues processes which, in the aggregate, rise to a material weakness in internal control over financial reporting. The deficiencies related to program change management and user access in connection with segregation of duties and restriction to appropriate users. As a result, the automated controls and IT dependent manual business process controls that rely upon information from the affected financial applications were also deemed not effective. A material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of a company’s annual or interim financial statements will not be prevented or detected on a timely basis.\nWhile we have concluded that these control deficiencies did not result in any material misstatements in our Consolidated Financial Statements or disclosures in any of the fiscal years ended August 31, 2025, 2024 or 2023, they were not remediated as of August 31, 2025, and thus created a reasonable possibility that they could result in a material misstatement to the Consolidated Financial Statements that would not be prevented or detected on a timely basis. Accordingly, we determined that these control deficiencies constituted a material weakness.\nAs a result of the identification of the material weakness, we performed further analysis and completed additional procedures intended to ensure our consolidated financial statements for the years ended August 31, 2025, 2024, and 2023 fairly present in all material respects the financial condition, results of operations and cash flows of the Company and have been prepared in accordance with GAAP.\n \nBased on these procedures and analysis, and notwithstanding the material weakness in our internal control over financial reporting, our management has concluded that our Consolidated Financial Statements present fairly, in all material respects, our financial position, results of operations and cash flows for the periods disclosed in conformity with GAAP.\nErnst & Young LLP (PCAOB ID: 42), an independent registered public accounting firm, has audited the effectiveness of our internal control over financial reporting and has issued an adverse opinion on the effectiveness of our internal control over financial reporting as stated in their report on the subsequent page.\n51\nTable of Contents\nReport of Independent Registered Public Accounting Firm \nTo the Stockholders and the Board of Directors of FactSet Research Systems Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of FactSet Research Systems Inc. (the Company) as of August 31, 2025 and 2024, the related consolidated statements of income, comprehensive income, changes in stockholders’ equity and cash flows for each of the three years in the period ended August 31, 2025, and the related notes and financial statement schedule listed in the Index at Item 15(a) (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at August 31, 2025 and 2024, and the results of its operations and its cash flows for each of the three years in the period ended August 31, 2025, in conformity with U.S. generally accepted accounting principles. \nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of August 31, 2025 based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework), and our report dated October 22, 2025 expressed an adverse opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters \nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nMeasurement of income tax provision\nDescription of the Matter\nAs discussed in Note 2, \nSummary of Significant Accounting Policies,\n and Note 9, \nIncome Taxes,\n of the Consolidated Financial Statements, the Company serves international markets and is subject to income taxes in the U.S. and various foreign jurisdictions, which affect the Company’s provision for income taxes. The income tax provision is an estimate based on management’s understanding of current enacted tax laws and tax rates of each tax jurisdiction and the use of subjective allocation methodologies to allocate taxable income to tax jurisdictions based upon the structure of the Company’s operations and customer arrangements. For the year-ended August 31, 2025 the Company recognized a consolidated provision for income taxes of $123.9 million with $45.6 million related to its U.S. operations and $78.3 million related to its Non-U.S. operations.\nAuditing management’s calculation of the provision for income taxes required complex audit judgement as the Company’s calculation of the provision for income taxes involved subjective estimation and evaluation of the application of tax laws, including the methods used to allocate taxable income and judgments used in determining uncertain tax positions. \n52\nTable of Contents\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design and tested the operating effectiveness of internal controls over management’s calculation of its provision for income taxes. For example, we tested controls over management’s evaluation of the allocation methodologies and management’s review of the assumptions and data utilized in determining the allocation of income to applicable tax jurisdictions.\nAmong other audit procedures performed, we evaluated the reasonableness of management’s allocation methodologies based on the Company’s structure, operations and current tax laws, recalculated income tax expense using management’s methodologies and agreed the data used in the calculations to the Company’s underlying books and records. We involved our tax professionals to evaluate the application of tax laws to management’s allocation methodologies and tax position, including the evaluation of third-party reports and advice obtained by the Company. We also performed a sensitivity analysis to assess the effect of changes in management’s allocation methodologies and assumptions. We have evaluated the Company’s income tax disclosures included in Note 9, \nIncome Taxes\n, of the Consolidated Financial Statements in relation to these matters.\nValuation of Acquired Software Technology\nDescription of the Matter\nAs disclosed in Note 5, \nAcquisitions\n, of the Consolidated Financial Statements, the Company completed its acquisition of Liquid Holdings, LLC for total consideration of $243.2 million and Platform Group Limited for total consideration of $120.2 million in 2025. The transactions were accounted for as business combinations. The considerations paid in the acquisitions were allocated to the acquired assets and liabilities assumed generally based on their fair values, with the excess of the purchase prices over those fair values allocated to goodwill. The acquired software technologies totaled $101.7 million combined.\nAuditing the valuation of the Company’s business combinations was especially challenging and complex due to the significant assumptions and measurement uncertainty involved in determining the fair value of the acquired assets and liabilities assumed, specifically related to the Company’s determination of the fair values of acquired software technologies. In particular, the fair value estimates were sensitive to changes in significant underlying assumptions such as the projected revenue growth rate. This significant assumption included forward-looking considerations and was based on expectations of future economic and market conditions.\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design, and tested the operating effectiveness of internal controls over the Company’s accounting for acquisitions and the related fair value estimation process. Specifically, we tested controls over management’s review of the valuation of the acquired software technologies, including management’s review of the valuation models applied and the significant assumptions described above. We also tested management’s internal controls to develop the projected financial information used in the valuation models and validated that the data used in the valuation models was complete and accurate. \nTo test the estimated fair value of the acquired software technologies, we performed audit procedures that included, among others, evaluating the Company’s valuation methodology and  significant assumptions used by management, testing the completeness and accuracy of the underlying data supporting the significant assumptions described above, and performing sensitivity analyses of significant assumptions to evaluate the changes in the fair values of the acquired software technologies. We involved our valuation specialists to assist with our evaluation of the Company’s valuation methodology and significant assumptions used in the fair value estimates.\n/s/\n \nErnst & Young LLP\nWe have served as the Company’s auditor since 2013. \nStamford, Connecticut\nOctober 22, 2025\n53\nTable of Contents\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of FactSet Research Systems Inc.\nOpinion on Internal Control Over Financial Reporting\nWe have audited FactSet Research Systems Inc.’s internal control over financial reporting as of August 31, 2025, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, because of the effect of the material weakness described below on the achievement of the objectives of the control criteria, FactSet Research Systems Inc. (the Company) has not maintained effective internal control over financial reporting as of August 31, 2025, based on the COSO criteria.\nAs indicated in the accompanying Management’s Report on Internal Control over Financial Reporting, management’s assessment of and conclusion on the effectiveness of internal control over financial reporting did not include the internal controls of Liquid Holdings, LLC and Platform Group Limited, which are included in the 2025 consolidated financial statements of the Company and which in aggregate, when excluding goodwill and intangible assets, constituted 2% of total assets as of August 31, 2025 and 1% of total revenues for the year then ended. Our audit of internal control over financial reporting of the Company also did not include an evaluation of the internal control over financial reporting of Liquid Holdings, LLC and Platform Group Limited.\nA material weakness is a deficiency, or combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the company’s annual or interim financial statements will not be prevented or detected on a timely basis. The following material weakness has been identified and included in management’s assessment. Management has identified a material weakness related to the design and operation of information technology (“IT”) general controls for certain financial applications that support the revenue, accounts receivable, and deferred revenue processes. Consequently, automated controls and IT dependent manual business process controls that rely upon information from the affected financial applications were also deemed ineffective.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of August 31, 2025 and 2024, the related consolidated statements of income, comprehensive income, changes in stockholders’ equity and cash flows for each of the three years in the period ended August 31, 2025, and the related notes and financial statement schedule listed in the Index at Item 15(a). This material weakness was considered in determining the nature, timing and extent of audit tests applied in our audit of the 2025 consolidated financial statements, and this report does not affect our report dated October 22, 2025, which expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\n54\nTable of Contents\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nStamford, Connecticut\nOctober 22, 2025\n55\nTable of Contents\nFactSet Research Systems Inc.\nConsolidated Statements of Income\n(in thousands, except per share data)\nFor the years ended August 31, \n2025\n2024\n2023\nRevenues\n$\n2,321,748\n \n$\n2,203,056\n \n$\n2,085,508\n \nOperating expenses\nCost of services\n1,097,782\n \n1,011,945\n \n973,225\n \nSelling, general and administrative\n475,663\n \n489,812\n \n483,076\n \nTotal operating expenses\n1,573,445\n \n1,501,757\n \n1,456,301\n \nOperating income\n748,303\n \n701,299\n \n629,207\n \nOther income (expense), net\nInterest income\n6,533\n \n14,447\n \n12,809\n \nInterest expense\n(\n56,324\n)\n(\n65,778\n)\n(\n66,319\n)\nOther income (expense), net\n22,446\n \n1,535\n \n8,257\n \nTotal other income (expense), net\n(\n27,345\n)\n(\n49,796\n)\n(\n45,253\n)\nIncome before income taxes\n720,958\n \n651,503\n \n583,954\n \nProvision for income taxes\n123,918\n \n114,377\n \n115,781\n \nNet income\n$\n597,040\n \n$\n537,126\n \n$\n468,173\n \nBasic earnings per common share\n$\n15.74\n \n$\n14.11\n \n$\n12.26\n \nDiluted earnings per common share\n$\n15.55\n \n$\n13.91\n \n$\n12.04\n \nBasic weighted average common shares\n37,924\n \n38,059\n \n38,194\n \nDiluted weighted average common shares\n38,385\n \n38,618\n \n38,898\n \nThe accompanying notes are an integral part of these Consolidated Financial Statements.\n56\nTable of Contents\nFactSet Research Systems Inc.\nConsolidated Statements of Comprehensive Income\n(in thousands)\nFor the years ended August 31, \n2025\n2024\n2023\nNet income\n$\n597,040\n \n$\n537,126\n \n$\n468,173\n \nOther comprehensive income (loss), net of tax\nNet unrealized gain (loss) on cash flow hedges\n(1)\n300\n \n(\n1,037\n)\n(\n269\n)\nForeign currency translation adjustment gains (losses) \n15,565\n \n8,565\n \n21,511\n \nOther comprehensive income (loss)\n15,865\n \n7,528\n \n21,242\n \nComprehensive income\n$\n612,905\n \n$\n544,654\n \n$\n489,415\n \n(1) \nPresented net of a tax expense of $\n119\n thousand, tax benefit of $\n369\n thousand, and a tax benefit of $\n61\n thousand for the years ended August 31, 2025, 2024 and 2023, respectively.\nThe accompanying notes are an integral part of these Consolidated Financial Statements.\n57\nTable of Contents\nFactSet Research Systems Inc.\nConsolidated Balance Sheets\n(in thousands, except share data)\nAugust 31, \n2025\n2024\nASSETS\n \n \nCash and cash equivalents\n$\n337,651\n \n$\n422,979\n \nInvestments\n17,445\n \n69,619\n \nAccounts receivable, net of reserves of $\n13,789\n at August 31, 2025 and $\n14,581\n at August 31, 2024 \n270,684\n \n228,054\n \nPrepaid taxes\n33,600\n \n55,103\n \nPrepaid expenses and other current assets\n70,379\n \n60,093\n \nTotal current assets\n729,759\n \n835,848\n \nProperty, equipment and leasehold improvements, net\n85,203\n \n82,513\n \nGoodwill\n1,284,708\n \n1,011,129\n \nIntangible assets, net\n1,916,102\n \n1,844,141\n \nDeferred tax assets\n61,226\n \n61,337\n \nLease right-of-use assets, net\n121,776\n \n130,494\n \nOther assets\n105,498\n \n89,578\n \nTOTAL ASSETS\n$\n4,304,272\n \n$\n4,055,040\n \nLIABILITIES\nAccounts payable and accrued expenses\n$\n135,262\n \n$\n178,250\n \nCurrent debt\n—\n \n124,842\n \nCurrent lease liabilities\n33,145\n \n31,073\n \nAccrued compensation\n130,596\n \n93,279\n \nDeferred revenues\n167,852\n \n159,761\n \nCurrent taxes payable\n13,041\n \n40,391\n \nDividends payable\n41,410\n \n39,470\n \nTotal current liabilities\n521,306\n \n667,066\n \nLong-term debt\n1,368,260\n \n1,241,131\n \nDeferred tax liabilities\n14,902\n \n8,452\n \nDeferred revenues, non-current\n624\n \n1,344\n \nTaxes payable\n45,095\n \n40,452\n \nLong-term lease liabilities\n157,104\n \n177,521\n \nOther liabilities\n10,568\n \n6,614\n \nTOTAL LIABILITIES\n$\n2,117,859\n \n$\n2,142,580\n \nCommitments and contingencies (see Note 12)\nSTOCKHOLDERS’ EQUITY\nPreferred stock, $\n0.01\n par value, \n10,000,000\n shares authorized, \nnone\n issued\n$\n—\n \n$\n—\n \nCommon stock, $\n0.01\n par value, \n150,000,000\n shares authorized, \n43,013,266\n and \n42,598,915\n shares issued, \n37,645,870\n and \n37,952,270\n shares outstanding at August 31, 2025 and 2024, respectively\n430\n \n426\n \nAdditional paid-in capital\n1,621,753\n \n1,478,839\n \nTreasury stock, at cost: \n5,367,396\n and \n4,646,645\n shares at August 31, 2025 and 2024, respectively\n(\n1,695,429\n)\n(\n1,375,696\n)\nRetained earnings\n2,323,407\n \n1,888,504\n \nAccumulated other comprehensive loss\n(\n63,748\n)\n(\n79,613\n)\nTOTAL STOCKHOLDERS’ EQUITY\n$\n2,186,413\n \n$\n1,912,460\n \nTOTAL LIABILITIES AND STOCKHOLDERS’ EQUITY\n$\n4,304,272\n \n$\n4,055,040\n \nThe accompanying notes are an integral part of these Consolidated Financial Statements.\n58\nTable of Contents\nFactSet Research Systems Inc.\nConsolidated Statements of Cash Flows\n(in thousands)\nYears ended August 31,\n2025\n2024\n2023\nCASH FLOWS FROM OPERATING ACTIVITIES\n \n \n \nNet income\n$\n597,040\n \n$\n537,126\n \n$\n468,173\n \nAdjustments to reconcile net income to net cash provided by operating activities\nDepreciation and amortization\n157,691\n \n125,187\n \n105,384\n \nAmortization of lease right-of-use assets\n30,982\n \n30,407\n \n32,344\n \nStock-based compensation expense\n61,229\n \n63,501\n \n62,038\n \nDeferred income taxes\n(\n3,545\n)\n(\n32,020\n)\n(\n31,119\n)\nGain on divestiture of a business\n(\n23,238\n)\n—\n \n—\n \nOther, net\n11,867\n \n14,511\n \n38,010\n \nChanges in assets and liabilities, net of effects of acquisitions\nAccounts receivable\n(\n42,540\n)\n2,195\n \n(\n40,103\n)\nPrepaid expenses and other assets\n65\n(\n29,874\n)\n7,579\nAccounts payable and accrued expenses\n(\n59,400\n)\n55,347\n \n8,393\n \nAccrued compensation\n35,666\n \n(\n20,213\n)\n(\n3,431\n)\nDeferred revenues\n2,249\n \n4,939\n \n(\n3,387\n)\nTaxes payable, net of prepaid taxes\n(\n1,161\n)\n(\n11,448\n)\n41,396\n \nLease liabilities, net\n(\n40,645\n)\n(\n39,320\n)\n(\n39,704\n)\nNet cash provided by operating activities\n726,260\n \n700,338\n \n645,573\n \nCASH FLOWS FROM INVESTING ACTIVITIES\nPurchases of property, equipment, leasehold improvements and capitalized internal-use software\n(\n108,806\n)\n(\n85,681\n)\n(\n60,786\n)\nAcquisition of businesses, net of cash and cash equivalents acquired\n(\n348,255\n)\n—\n \n(\n23,593\n)\nPurchases of investments\n(\n18,867\n)\n(\n58,636\n)\n(\n11,014\n)\nProceeds from maturity or sale of investments\n58,155\n \n—\n \n—\n \nProceeds from divestiture\n25,000\n \n—\n \n—\n \nNet cash provided by (used in) investing activities\n(\n392,773\n)\n(\n144,317\n)\n(\n95,393\n)\nCASH FLOWS FROM FINANCING ACTIVITIES\nProceeds from debt\n803,410\n \n—\n \n—\n \nRepayments of debt\n(\n805,000\n)\n(\n250,000\n)\n(\n375,000\n)\nDividend payments\n(\n159,973\n)\n(\n150,667\n)\n(\n138,601\n)\nProceeds from employee stock plans\n81,688\n \n91,711\n \n72,006\n \nRepurchases of common stock\n(\n300,457\n)\n(\n235,235\n)\n(\n176,720\n)\nOther financing activities\n(\n27,489\n)\n(\n16,659\n)\n(\n13,709\n)\nNet cash provided by (used in) financing activities\n(\n407,821\n)\n(\n560,850\n)\n(\n632,024\n)\nEffect of exchange rate changes on cash, cash equivalents and restricted cash\n3,050\n \n2,364\n \n4,015\n \nNet increase (decrease) in cash, cash equivalents and restricted cash\n(\n71,284\n)\n(\n2,465\n)\n(\n77,829\n)\nCash and cash equivalents at beginning of period\n422,979\n \n425,444\n \n503,273\n \nCash, cash equivalents and restricted cash at end of period\n$\n351,695\n \n$\n422,979\n \n$\n425,444\n \nReconciliation of total cash, cash equivalents and restricted cash:\nCash and cash equivalents\n$\n337,651\n \n$\n422,979\n \n$\n425,444\n \nRestricted cash included in Prepaid expenses and other current assets\n6,522\n \n—\n \n—\n \nRestricted cash included in Other assets\n7,522\n \n—\n \n—\n \nTotal cash, cash equivalents and restricted cash\n$\n351,695\n \n$\n422,979\n \n$\n425,444\n \n59\nTable of Contents\nSupplemental Disclosure of Cash Flow Information\nCash paid during the year for interest\n$\n54,813\n \n$\n65,920\n \n$\n76,524\n \nCash paid during the year for income taxes, net of refunds\n$\n103,167\n \n$\n157,015\n \n$\n91,170\n \nSupplemental Disclosure of Non-Cash Transactions\nDividends declared, not paid\n$\n41,410\n \n$\n39,470\n \n$\n37,265\n \nThe accompanying notes are an integral part of these Consolidated Financial Statements.\n60\nTable of Contents\nFactSet Research Systems Inc.\nConsolidated Statements of Changes in Stockholders’ Equity\n(in thousands, except share data)\nCommon Stock\nAdditional\nPaid-in\nCapital\nTreasury Stock\nRetained\nEarnings\nAccumulated\nOther\nComprehensive\nLoss\nTotal\nStockholders’\nEquity\nShares\nPar Value\nShares\nAmount\nBalance as of August 31, 2022\n41,653,218\n \n$\n417\n \n$\n1,190,350\n \n3,608,462\n \n$\n(\n930,715\n)\n$\n1,179,739\n \n$\n(\n108,383\n)\n$\n1,331,408\n \nNet income\n— \n— \n— \n— \n— \n468,173\n \n— \n468,173\n \nOther comprehensive income (loss)\n— \n— \n— \n— \n— \n— \n21,242\n \n21,242\n \nCommon stock issued for employee stock plans\n360,375\n \n3\n \n72,003\n \n410\n \n(\n166\n)\n— \n— \n71,840\n \nVesting of restricted stock\n83,035\n \n1\n \n(\n1\n)\n32,034\n \n(\n13,544\n)\n— \n— \n(\n13,544\n)\nExcise tax on share repurchases\n— \n— \n— \n— \n(\n932\n)\n— \n— \n(\n932\n)\nRepurchases of common stock\n— \n— \n— \n430,350\n \n(\n176,720\n)\n— \n— \n(\n176,720\n)\nStock-based compensation expense\n— \n— \n62,038\n \n— \n— \n— \n— \n62,038\n \nDividends declared\n— \n— \n— \n— \n— \n(\n142,816\n)\n— \n(\n142,816\n)\nOther\n— \n— \n(\n759\n)\n— \n— \n— \n— \n(\n759\n)\nBalance as of August 31, 2023\n42,096,628\n \n$\n421\n \n$\n1,323,631\n \n4,071,256\n \n$\n(\n1,122,077\n)\n$\n1,505,096\n \n$\n(\n87,141\n)\n$\n1,619,930\n \nNet income\n— \n— \n— \n— \n— \n537,126\n \n— \n537,126\n \nOther comprehensive income (loss)\n— \n— \n— \n— \n— \n— \n7,528\n \n7,528\n \nCommon stock issued for employee stock plans\n407,542\n \n4\n \n91,708\n \n831\n \n(\n376\n)\n— \n— \n91,336\n \nVesting of restricted stock\n94,745\n \n1\n \n(\n1\n)\n36,758\n \n(\n16,283\n)\n— \n— \n(\n16,283\n)\nExcise tax on share repurchases\n— \n— \n— \n— \n(\n1,725\n)\n— \n— \n(\n1,725\n)\nRepurchases of common stock\n— \n— \n— \n537,800\n \n(\n235,235\n)\n— \n— \n(\n235,235\n)\nStock-based compensation expense\n— \n— \n63,501\n \n— \n— \n— \n— \n63,501\n \nDividends declared\n— \n— \n— \n— \n— \n(\n153,718\n)\n— \n(\n153,718\n)\nBalance as of August 31, 2024\n42,598,915\n \n$\n426\n \n$\n1,478,839\n \n4,646,645\n \n$\n(\n1,375,696\n)\n$\n1,888,504\n \n$\n(\n79,613\n)\n$\n1,912,460\n \nNet income\n— \n— \n— \n— \n— \n597,040\n \n— \n597,040\n \nOther comprehensive income (loss)\n— \n— \n— \n— \n— \n— \n15,865\n \n15,865\n \nCommon stock issued for employee stock plans\n325,030\n \n3\n \n81,686\n \n370\n(\n170\n)\n— \n— \n81,519\n \nVesting of restricted stock\n89,321\n \n1\n \n(\n1\n)\n35,421\n \n(\n16,072\n)\n— \n— \n(\n16,072\n)\nExcise tax on share repurchases\n— \n— \n— \n— \n(\n3,034\n)\n— \n— \n(\n3,034\n)\nRepurchases of common stock\n— \n— \n— \n684,960\n \n(\n300,457\n)\n— \n— \n(\n300,457\n)\nStock-based compensation expense\n— \n— \n61,229\n \n— \n— \n— \n— \n61,229\n \nDividends declared\n— \n— \n— \n— \n— \n(\n162,137\n)\n— \n(\n162,137\n)\nBalance as of August 31, 2025\n43,013,266\n \n$\n430\n \n$\n1,621,753\n \n5,367,396\n \n$\n(\n1,695,429\n)\n$\n2,323,407\n \n$\n(\n63,748\n)\n$\n2,186,413\n \nThe accompanying notes are an integral part of these Consolidated Financial Statements.\n61\nTable of Contents\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFactSet Research Systems Inc.\nAugust 31, 2025 \nPage\nNote 1\nDescription of Business\n62\nNote 2\nSummary of Significant Accounting Policies\n63\nNote 3\nRevenue Recognition\n70\nNote 4\nFair Value Measures\n71\nNote \n5\nAcquisitions\n73\nNote \n6\nProperty, Equipment and Leasehold Improvements\n75\nNote \n7\nGoodwill\n75\nNote \n8\nIntangible Assets\n76\nNote \n9\nIncome Taxes\n77\nNote 1\n0\nLeases\n80\nNote 1\n1\nDebt\n82\nNote 1\n2\nCommitments and Contingencies\n84\nNote 1\n3\nStockholders' Equity\n86\nNote 1\n4\nEarnings Per Share\n87\nNote 1\n5\nStock-Based Compensation\n88\nNote 1\n6\nEmployee Benefit Plans\n91\nNote 1\n7\nSegment Information\n91\n1. \nDESCRIPTION OF BUSINESS\nFactSet Research Systems Inc. and its wholly-owned subsidiaries (\"we,\" \"our,\" \"us,\" the \"Company\" or \"FactSet\") is a global financial digital platform and enterprise solutions provider with open and flexible technologies that deliver financial intelligence to investment professionals worldwide. \nOur platform delivers expansive data, sophisticated analytics, and flexible, artificial intelligence (\"AI\")-powered technology used by global financial professionals to power their critical investment workflows. As of August 31, 2025, we had approximately \n9,000\n clients comprised of over \n237,000\n investment professionals, including institutional asset managers, bankers, wealth managers, asset owners, partners, hedge funds, corporate users, and private equity and venture capital professionals. Our revenues are primarily derived from subscriptions to our multi-asset class data and solutions powered by our connected data and technology platform. Our products and services include workstations, portfolio analytics and enterprise data solutions. We also offer managed services that operate as an extension of our clients' internal teams to support data, performance, risk and reporting workflows.\nWe drive our business based on a detailed understanding of our clients’ workflows, which helps us to solve their most complex challenges. We provide financial data and market intelligence on securities, companies, industries and people to enable our clients to research investment ideas and analyze, monitor and manage their portfolios. Our solutions span the investment lifecycle of investment research, portfolio construction and analysis, trade execution, performance measurement, risk management and reporting. We provide open and flexible technology offerings, including a configurable desktop and mobile platform, comprehensive data feeds, cloud-based digital solutions, and application programming interfaces (\"APIs\"). AI is embedded across these offerings to enhance data discovery, automate routine workflows and improve the speed and accuracy of client insights. The CUSIP Global Services (\"CGS\") business supports security master files relied on by the investment industry for critical front, middle and back-office functions. All of our platforms and solutions are supported by our dedicated client service team. \nWe operate our business through \nthree\n \nreportable segments (\"segments\"): the Americas, EMEA and Asia Pacific. Within each segment, we offer data, products and analytical applications by firm type: Institutional Buyside, Dealmakers, Wealth, and Partnerships and CGS. Refer to Note 17, \nSegment Information \nfor further discussion on our segments.\n \n62\nTable of Contents\n2. \nSUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nWe conduct business globally and manage our business on a geographic basis. The accompanying Consolidated Financial Statements and Notes to the Consolidated Financial Statements included in this Annual Report on Form 10-K are prepared in accordance with generally accepted accounting principles in the United States (\"GAAP\") for annual financial information and the instructions to Form 10-K and Article 10 of Regulation S-X. The accompanying Consolidated Financial Statements include our accounts and those of our wholly-owned subsidiaries; all intercompany activity and balances have been eliminated.\nReclassifications\nFor the year ended August 31, 2025, asset impairments were included within Selling, general and administrative (\"SG&A\") in the Consolidated Statements of Income and within Other, net in the Consolidated Statements of Cash Flows. We conformed the comparative prior year figures to the current year presentation.\nFor the year ended August 31, 2025, Prepaid expenses and other assets, previously included within Other, net, were presented as a separate component of Cash Flows from Operating Activities in the Consolidated Statements of Cash Flows. We conformed the comparative prior year figures to the current year presentation.\nUse of Estimates\nThe preparation of our Consolidated Financial Statements and related disclosures in conformity with GAAP required management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Significant estimation may be involved in the accounting for income taxes, stock-based compensation, goodwill, business combinations, property, equipment and leasehold improvements (\"PPE\"), intangible assets and contingencies. We base our estimates on historical experience and on various other assumptions that are believed to be reasonable, the results of which form the basis for making judgments about the carrying values of our assets and liabilities. Actual results could differ materially from those estimates.\n \nRefer to Part II, Item 7. \nManagement's Discussion and Analysis of Financial Condition and Results of Operations, Critical Accounting Estimates\n, of this Annual Report on Form 10-K for further discussion on our use of estimates.\nRevenue Recognition \nThe majority of our revenues are derived from client access to our multi-asset solutions powered by our platform of connected data and technology that is available over the contractual term (referred to as the \"Hosted Platform\"). The Hosted Platform is a subscription-based service that provides client access to various combinations of products and services including workstations, portfolio analytics and enterprise solutions. In addition, through the CGS platform, we provide subscription access to a database of universally recognized security identifiers reflecting differentiating characteristics for issuers and their financial instruments (referred to as the \"Identifier Platform\").\nRevenues from our products and services are recognized as we transfer control to our clients, in an amount that reflects the consideration we expect to receive in exchange for satisfying our performance obligations. We record revenues net of sales taxes which are subsequently remitted to taxing authorities and are excluded from the transaction price. We determined the majority of our contracts with clients, whether for our Hosted Platform or Identifier Platform service, each represent a single performance obligation covering a series of distinct products and services that are substantially the same and that have the same pattern of transfer to the client. The primary nature of our promise to the client is to provide daily access to each of these data and analytics platforms, with revenue recognized over-time as performance is satisfied on an output time-based measure of progress, as the client is simultaneously receiving and consuming the benefits of the platform. \nWe record deferred revenues when payments are received in advance of performance under the client contract.\n \n63\nTable of Contents\nStock-Based Compensation\nOur stock-based compensation expense consists of:\n•\nStock options, restricted stock units (\"RSUs\") and performance share units (\"PSUs\") issued to eligible employees under the FactSet Research Systems Inc. Stock Option and Award Plan, as Amended and Restated (the \"LTIP\"). \n•\nStock options and RSUs issued to non-employee members of the Board of Directors (\"non-employee directors\") under the FactSet Research Systems Inc. Non-Employee Directors’ Stock Option and Award Plan as Amended and Restated (the \"Director Plan\").\n•\nCommon stock purchased by eligible employees under the FactSet Research Systems Inc. Employee Stock Purchase Plan as Amended and Restated (the \"ESPP\"). \nWe measure and recognize stock-based compensation expense for all stock-based awards and purchases of common stock under the ESPP based on their estimated grant date fair value. \nWe utilize a lattice-binomial option-pricing model (\"binomial model\") to estimate the grant date fair value for our employee stock options and the Black-Scholes model to estimate the grant date fair value for non-employee director stock options and common stock purchased by eligible employees under our ESPP.\nBoth the binomial model and Black-Scholes model involve certain estimates and assumptions such as:\n•\nRisk-free interest rate\n \n-\n based on the United States (\"U.S.\") Treasury yield curve in effect at the time of grant with maturities equal to the expected terms of the stock-based awards granted. \n•\nExpected life\n -\n \nthe weighted average period the stock-based awards are expected to remain outstanding.\n•\nExpected volatility\n \n- based on a blend of historical volatility of the stock-based award's useful life and the weighted average implied volatility for call option contracts traded in the 90 days preceding the stock-based award's valuation date. \n•\nDividend yield\n -\n \nthe expectation of dividend payouts based on our history. \nThe binomial model also incorporates market conditions, vesting restrictions and exercise patterns.\nFor RSUs and PSUs (collectively, \"Restricted Stock Awards\"), the grant date fair value is measured by reducing the grant date price of our common stock by the present value of expected future dividend payments on the underlying stock during the requisite service period, discounted at the appropriate risk-free interest rate. The number of PSUs granted assumes target-level achievement of the specified performance levels within the payout range. The ultimate number of common shares that may be earned pursuant to our PSU awards depends on the level of our achievement of stated financial performance objectives. \nStock-based compensation expense for stock option and RSU awards is recognized over the requisite service period using the straight-line method. For these awards, the amount of stock-based compensation expense recognized on any date is at least equal to the vested portion of the award on that date. \nOur PSUs require us to make assumptions regarding the probability of achieving specified performance levels established at the time of grant. We recognize stock-based compensation expense for PSUs using the straight-line method over the requisite service period. The probability of achieving the specified performance levels is reviewed on a quarterly basis to ensure the amount of stock-based compensation expense appropriately reflects the expected achievement. \nFor our ESPP, stock-based compensation expense is recognized on a straight-line basis over the offering period.\nOur stock-based awards are generally subject to the continued employment for employees, or continued service for non-employee directors, through the applicable vesting date. Compensation expense for stock-based awards is recorded net of estimated forfeitures, which are based on historical forfeiture rates and are revised if actual forfeitures differ from those estimates.\n \nResearch and Product Development Costs\nWe do not have a separate research and product development department, but rather we rely on collaboration across departments, with costs primarily consisting of employee compensation costs, such as salaries and related benefits for our product development, software engineering and technical support departments, as well as certain third party costs. These teams collaborate with our strategists, product and content managers, technologists, sales and other team members to develop new products and process innovations and enhance existing products. Our research and product development costs are expensed as \n64\nTable of Contents\nincurred and are primarily recorded in employee compensation costs, which are included in our Cost of services and Selling, general and administrative (\"SG&A\") expenses in the Consolidated Statements of Income, dependent on the nature of the team.\n We incurred research and product development costs of $\n300.7\n million, $\n265.2\n million and $\n267.4\n million during fiscal 2025, 2024 and 2023, respectively. \nIncome Taxes\nWe account for income taxes using the asset and liability method. Under this method, deferred tax assets and liabilities are recorded for the temporary differences between the financial statement and the tax basis of assets and liabilities. In addition, deferred tax assets and liabilities are recorded for net operating loss carryforwards (\"NOLs\") and tax credit carryforwards. Deferred tax assets and liabilities are measured using the currently enacted tax rates that apply to taxable income in effect for the years in which they are expected to be realized or settled. Deferred tax assets are evaluated for future realization and reduced by a valuation allowance to the amount that is more likely than not (defined as a likelihood of more than 50%) to be realized.\nApplicable accounting guidance prescribes a comprehensive model for financial statement recognition, measurement, classification and disclosure of uncertain tax positions that a company has taken or expects to take on a tax return. We follow a two-step approach in recognizing and measuring uncertain tax positions. The first step is to evaluate the tax position for recognition by determining if the weight of available evidence indicates that it is more likely than not (defined as a likelihood of more than 50%) that a tax position will be sustained based on its technical merits as of the reporting date. The second step, for those positions that meet the recognition criteria, is to measure and recognize the largest amount of benefit that is greater than 50% likely of being realized upon effective settlement with a taxing authority. We classify the liability for unrecognized tax benefits as Taxes Payable (non-current) and to the extent we anticipate payment of cash within one year, the benefit is classified as Current taxes payable in the Consolidated Balance Sheets. \nThe determination of liabilities related to uncertain tax positions and associated interest and penalties requires significant estimates and assumptions; as such, there can be no assurance that we will accurately predict the outcome. For this reason and due to ongoing audits by multiple tax authorities, we regularly engage in discussions and negotiations with tax authorities regarding tax matters in various jurisdictions. We adjust these reserves in light of changing facts and circumstances, such as the closing of a tax audit or the refinement of an estimate. To the extent that the final outcome of these matters is different than the amounts recorded, such differences will affect the provision for income taxes in the period in which such determination is made.\nWe accrue interest on all income tax exposures for which reserves have been established consistent with jurisdictional tax laws, and recognize this interest in the Provision for income taxes in the Consolidated Statements of Income and in Current taxes payable or Taxes payable (non-current), based on the expected timing of the payment, within the Consolidated Balance Sheets.\nCash and Cash Equivalents\nCash and cash equivalents consist of cash and highly liquid investments including demand deposits and money market funds available for withdrawal without restriction or with original maturities of 90 days or less. The carrying value of our cash and cash equivalents approximates fair value.\nAccounts Receivable\nAccounts receivable includes both invoiced and unbilled receivables, net of allowance for any potential uncollectible amounts. Unbilled receivables reflect revenues earned for which we have the unconditional right to payment, even though we have not yet issued an invoice. Amounts included in accounts receivable are expected to be collected within one year. Our allowance for expected credit losses is based on a variety of factors, including collectability trends, our historical write-off activity, current economic environment, client-specific information and expectations of future economic conditions. Our allowance is recorded to SG&A in the Consolidated Statements of Income and we assess the adequacy of the allowance on a quarterly basis. Recoveries of accounts previously reserved are recognized as a reversal to SG&A when payment is received. We write-off accounts receivable balances when we have exhausted our collection efforts.\nProperty, Equipment and Leasehold Improvements\nPPE are stated at cost, less accumulated depreciation and amortization. Property and equipment are depreciated based on the straight-line method over the estimated useful lives of the assets, ranging from \nthree\n to \nfive years\n for computers and related equipment and \nseven years\n for furniture and fixtures. Leasehold improvements are amortized on a straight-line basis over the \n65\nTable of Contents\nshorter of their respective useful lives or the related lease term. Repairs and maintenance expenditures, which are not considered leasehold improvements and do not extend the useful life of the property and equipment, are expensed as incurred.\nWe review our PPE to determine if any indicators of impairment are present on a quarterly basis or whenever events or changes in circumstances indicate that the carrying amount of an asset group may not be recoverable. If indicators of impairment are present, the asset group is tested for impairment by comparing its carrying value to its undiscounted cash flows and if impaired, written down to fair value based on its discounted cash flows. In addition, we periodically evaluate the estimated remaining useful lives of our PPE to determine whether events or changes in circumstances warrant a revision to the remaining period of depreciation or amortization.\n \nGoodwill\nWe recognize the excess of the purchase price over the fair value of identifiable net assets acquired at the acquisition date as goodwill. Goodwill is not amortized as it is estimated to\n have an indefinite life and is teste\nd for impairment at the reporting unit level annually, or more frequently if impairment indicators occur. Goodwill is deemed to be impaired and written-down in the period in which the carrying value of the reporting unit exceeds its fair value. We have \nthree\n reporting units, Americas, EMEA and Asia Pacific, which are consistent with our operating segments.\nWhen assessing goodwill for impairment, we may first elect to perform a qualitative analysis for the reporting units to determine whether it is more likely than not (a likelihood of more than 50 percent) that the fair value of the reporting unit is less than its carrying value. If the qualitative analysis indicates that it is more likely than not the fair value of a reporting unit is less than its carrying value or if we elect not to perform a qualitative analysis, a quantitative analysis is performed to determine whether a goodwill impairment exists. \nThe quantitative goodwill impairment analysis is used to identify potential impairment by comparing the carrying value of a reporting unit with its fair value. To perform this analysis, we apply the income approach which utilizes discounted cash flows, along with other relevant market information. The annual review of the carrying value of goodwill requires us to develop estimates of expected cash flows by reporting unit, based on future business performance, discounted by their respective weighted average cost of capital. Changes in our estimates can impact the present value of expected cash flows used in determining fair value of a reporting unit. If the carrying value of the reporting unit exceeds the fair value, then the goodwill is considered impaired and written down to the reporting unit’s fair value. The impairment loss for the reporting unit cannot exceed the carrying value of the goodwill allocated to that reporting unit.\nIntangible Assets\nWe amortize intangible assets over their estimated useful lives, assuming no residual value. We evaluate the useful lives annually to determine whether events and circumstances warrant a revision to the remaining period of amortization. If the estimate of the remaining useful life is changed, the remaining carrying amount of the intangible asset is amortized prospectively over that revised remaining useful life. \nIntangible assets are tested for impairment qualitatively on a quarterly basis or whenever events or changes in circumstances indicate that the carrying amount of an asset group is not recoverable. If indicators of impairment are present, the asset group is tested for impairment by comparing its carrying value to undiscounted cash flows and, if impaired, written down to fair value based on discounted cash flows. \nInternal-use Software and Implementation Costs of Hosting Arrangements\nOur developed technology intangible assets (“Developed technology”) consist of capitalized internal-use software costs, such as employee compensation and external expenses incurred during the application development phase, as well as costs related to upgrades and enhancements that add functionality, and software acquired for internal use. These costs are recorded in Intangible assets, net on the Consolidated Balance Sheets. We also capitalize qualifying implementation costs for hosting arrangements that meet the capitalization criteria per the internal-use software guidance within Other assets on the Consolidated Balance Sheets. Our Developed technology and implementation assets are typically amortized over \nthree\n to \nfive years\n using the straight-line method.\n \nLeases\nOur operating lease arrangements relate to our office space and data centers\n. We determine if an arrangement qualifies as a lease at inception by evaluating if there is an identified asset and whether we obtain substantially all the economic benefits of and have the right to control the use of an asset. For operating leases with a term greater than one year, we recognize lease right-of-use (\"ROU\") assets and lease liabilities as the present value of future minimum lease payments over the reasonably \n66\nTable of Contents\ncertain lease term beginning at the commencement or modification date. The future minimum lease payments include fixed lease payments and certain qualifying index-based variable payments. Our lease ROU assets may further be impacted by prepayments, lease incentives received and initial direct costs incurred. Our operating leases are classified within Lease right-of-use assets, net, Current lease liabilities and Long-term lease liabilities on our Consolidated Balance Sheets.\nOur leases generally do not have a readily determinable implicit rate; therefore, we use our incremental borrowing rate (\"IBR\") at the lease commencement, or on the date of lease modification, if applicable, in determining the present value of future payments. Our IBR is derived by selecting U.S. corporate yield curves observed for public companies that are reflective of our credit rating, adjusted to approximate a secured rate of borrowing. We also consider revisions to the rate to reflect the geographic location where the leased asset is located. \nCertain of our lease agreements include options to extend and/or terminate the lease, which we do not include in our minimum lease terms unless we are reasonably certain to exercise these options. We account for the lease and non-lease components as a single lease component, which we recognize over the expected term on a straight-line expense basis in occupancy costs (a component of SG&A expense in the Consolidated Statements of Income). Variable lease payments that are not included in the calculation of lease ROU assets and lease liabilities are expensed as incurred within occupancy costs. \nWe review our lease ROU assets for impairment when there are indicators that an asset may no longer be recoverable. The impairment assessment requires significant judgments and estimates, including estimating subtenant rental income, calculating an appropriate discount rate and assessing other applicable future cash flows associated with the leased location. These estimates are based on our experience and knowledge of the market in which the property is located, previous efforts to dispose of similar assets and the assessment of existing market conditions. Impairments are recognized as a reduction to the carrying value of the Lease right-of-use assets, net with a corresponding increase to SG&A on our Consolidated Balance Sheets and Consolidated Statements of Income, respectively.\nTreasury Stock\nWe account for treasury stock under the cost method and present it within Treasury stock as a component of Stockholders' equity on the Consolidated Balance Sheets. We may repurchase shares of our common stock under our share repurchase program in the open market or via privately negotiated transactions, subject to market conditions. Repurchased shares of our common stock are recorded at the market price on the trade date and are held as treasury shares until they are reissued or retired. When treasury shares are reissued, if the issuance price is higher than the average price paid to acquire the shares (\"the cost\"), the excess of the issuance price over the cost is credited to additional paid-in capital (\"APIC\"). If the issuance is lower than the cost, the difference is first charged against any credit balance in APIC from Treasury stock, with the remaining balance charged to Retained earnings on the Consolidated Balance Sheets. \nWe account for the formal retirement of treasury shares by deducting its par value from Common stock, reflecting any excess over par value as a reduction to APIC (to the extent created by previous issuances of the shares) and then Retained earnings on the Consolidated Balance Sheets.\nThe Inflation Reduction Act of 2022 (\"IRA\"), which was enacted into law on August 16, 2022, imposed a nondeductible 1% excise tax on the net value of certain stock repurchases made after December 31, 2022. We record the applicable excise tax in Treasury stock, as part of the cost basis of the stock repurchased, and a corresponding liability for the excise taxes payable in Accounts payable and accrued expenses on the Consolidated Balance Sheets.\nFair Value Measurements\nFair value is defined as the price that would be received from selling an asset or paid to transfer a liability (i.e., the \"exit price\") in an orderly transaction between market participants at the measurement date. In determining fair value, the use of various valuation methodologies, including market, income and cost approaches is permissible. The inputs to these methodologies consider market comparable information, taking into account the principal or most advantageous market in which we would transact. The accounting guidance for fair value measurements establishes a fair value hierarchy that requires an entity to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. There are three levels of inputs that may be used to measure fair value based on the reliability of inputs. A financial instrument’s categorization within the fair value hierarchy is based upon the lowest level of input that is significant to the fair value measurement.\n \nForeign Currency Translation and Remeasurement\nCertain wholly-owned subsidiaries operate under a functional currency different from the U.S. dollar. Our primary currency exposures include th\ne British Pound Sterling, Euro, Indian Rupee and Philippine Peso. \n67\nTable of Contents\nThe financial statements of our foreign subsidiaries that are local currency functional are translated into U.S. dollars using period-end rates of exchange for assets and liabilities and average monthly rates for revenues and expenses. The resulting translation gains and losses that arise from translating these assets, liabilities, revenues and expenses of our foreign operations are recorded in Accumulated other comprehensive loss (\"AOCL\") in the Consolidated Balance Sheets. \nFor the financial statements of our foreign subsidiaries that are U.S. dollar functional but maintain their books of record in their respective local currency, we remeasure our revenues and expenses into U.S. dollars at the average rates of exchange for the period, monetary assets and liabilities using period-end rates and non-monetary assets and liabilities at their historical rates. The resulting remeasurement gains and losses are recorded to SG&A in the Consolidated Statements of Income.\nConcentrations of Credit Risk\nCredit risk arises from the potential nonperformance by counterparties to fulfill their financial obligations. Our financial instruments that potentially subject us to concentrations of credit risk consist primarily of our cash, cash equivalents, restricted cash, investments in mutual funds, accounts receivable and derivative instruments. The maximum credit exposure of our cash, cash equivalents, restricted cash, investments in mutual funds and accounts receivable is their carrying values as of the balance sheet date. The maximum credit exposure related to our derivative instruments is based upon their respective gross fair values as of the balance sheet date.\nCash, Cash Equivalents, Restricted Cash and Investments\nWe are exposed to credit risk on our cash, cash equivalents, restricted cash and investments in mutual funds in the event of default by the financial and governmental institutions with which we transact. We invest in a manner that aligns with our restrictive cash investment practices, preserves capital and provides liquidity, while minimizing our exposure to credit risk. We limit our exposure to credit loss by investing with multiple financial and governmental institutions that we believe are high-quality and credit-worthy. We have not experienced any credit losses relating to our cash, cash equivalents, restricted cash and investments in mutual funds.\nAccounts Receivable\nOur accounts receivable credit risk is dependent upon the financial stability of our individual clients. As of August 31, 2025 and August 31, 2024, our accounts receivable reserve was $\n13.8\n million and $\n14.6\n million, respectively. We do not require collateral from our clients; however, no single client represented more than 3.5% of our total annual revenues for fiscal 2023 through fiscal 2025. Due to our large and geographically dispersed client base, our concentration of credit risk related to our accounts receivable is generally limited.\nDerivative Instruments\nOur use of derivative instruments exposes us to credit risk to the extent counterparties may be unable to meet the terms of their agreements. To mitigate credit risk, we limit counterparties to financial institutions we believe are credit-worthy and use several institutions to reduce concentration risk. We do not expect any losses as a result of default by our counterparties.\nConcentrations of Data Providers\nWe integrate data from various third-party sources into our hosted proprietary data and analytics platform. As certain data sources have a limited number of suppliers, we make every effort to assure that, where reasonable, alternative sources are available. We are not dependent on any individual third-party data supplier to meet the needs of our clients, with two data suppliers each representing more than \n10\n% of our total data costs for the year ended August 31, 2025.\n68\nTable of Contents\nConcentrations of Cloud Providers\nOur clients rely on us for the delivery of time-sensitive, up-to-date data and applications. Our business is dependent on our ability to process substantial volumes of data and transactions rapidly and efficiently. We currently use multiple providers of cloud services; however, one supplier provided the majority of our cloud computing support for fiscal 2025. We maintain back-up facilities and other redundancies at our data centers, take security measures and have emergency planning procedures to minimize the risk that an event will disrupt our operations.\n \nRecently Adopted Accounting Pronouncements\nSegment Reporting - Improvements to Reportable Segment Disclosures\nIn November 2023, the FASB issued ASU 2023-07, \nSegment Reporting (Topic 280) - Improvements to Reportable Segment Disclosures\n. This ASU enhances segment disclosures primarily related to significant segment expenses for both interim and annual periods. We adopted this ASU on a retrospective basis for our annual financial statements starting in fiscal 2025. The adoption of this ASU resulted in additional disclosures with no impact to our Consolidated Financial Statements. Refer to Note 17, \nSegment Information\n, for further information. \nCodification Improvements - Amendments to Remove References to the Concepts Statements\nIn March 2024, the FASB issued ASU 2024-02, \nCodification Improvements - Amendments to Remove References to the Concepts Statements\n. This ASU amends the FASB Accounting Standards Codification (\"the Codification\") to remove references to various FASB Concepts Statements and impacts a variety of topics in the Codification. The amendments apply to all reporting entities within the scope of the affected accounting guidance, but in most instances the references removed are extraneous and not required to understand or apply the guidance. We early adopted this ASU on a prospective basis as of March 1, 2025. The adoption of this ASU did not have a material impact on our Consolidated Financial Statements or related disclosures. \nAccounting Pronouncements Not Yet Adopted\nIncome Statement - Disaggregation of Income Statement Expenses\nIn November 2024, the FASB issued Accounting Standards Update (\"ASU\") 2024-03, \nIncome Statement - Reporting Comprehensive Income - Expense Disaggregation Disclosures (Subtopic 220-40) - Disaggregation of Income Statement Expenses\n. This ASU requires disaggregation of certain income statement expense captions into specified categories to be disclosed within the footnotes to the financial statements. This ASU does not change the expense captions on the income statement. The amendments in this ASU are to be applied prospectively, although retrospective application is permitted, and are effective for our annual financial statements starting in fiscal 2028 and interim periods starting in fiscal 2029. Early adoption is permitted. This ASU is not expected to have a material impact on our Consolidated Financial Statements. We are currently assessing the impact of the new requirements on our disclosures.\nU.S. Securities and Exchange Commission (\"SEC\") Disclosures - The Enhancement and Standardization of Climate-Related Disclosures for Investors\nIn March 2024, the SEC adopted a final rule under SEC Release Nos. 33-11275 and 34-99678, \nThe Enhancement and Standardization of Climate-Related Disclosures for Investors\n, which would require disclosure of certain climate-related information in various filings with the SEC. In April 2024, the SEC stayed implementation of the final rule pending completion of judicial review. In\n \nMarch 2025, the SEC stated that it has ended its defense of the rule. We are currently monitoring the legal challenges and assessing the potential impact of the rule on our disclosures.\nIncome Taxes - Improvements to Income Tax Disclosures\nIn December 2023, the FASB issued ASU 2023-09, \nIncome Taxes (Topic 740) - Improvements to Income Tax Disclosures\n. This ASU enhances annual income tax disclosures primarily related to our effective tax rate reconciliation and income taxes paid. The amendments in this ASU are to be applied prospectively, although retrospective application is permitted, and are effective for our annual financial statements starting in fiscal 2026. Early adoption is permitted. This ASU is not expected to have a material impact on our Consolidated Financial Statements. We are currently assessing the impact of the new requirements on our disclosures.\n69\nTable of Contents\nDisclosure Improvements - Codification Amendment in Response to the SEC's Disclosure Update and Simplification Initiative\nIn October 2023, the FASB issued ASU 2023-06, \nDisclosure Improvements - Codification Amendment in Response to the SEC’s Disclosure Update and Simplification Initiative\n. The ASU incorporates several disclosure and presentation requirements currently residing in the SEC Regulations S-X and S-K. The amendments will be applied prospectively and are effective when the SEC removes the related requirements from Regulations S-X or S-K. Any amendments the SEC does not remove by June 30, 2027 will not be effective. As we are currently subject to these SEC requirements, this ASU is not expected to have a material impact on our Consolidated Financial Statements or related disclosures.\nNo other new accounting pronouncements issued or effective during fiscal 2025 have had, or are expected to have, a material impact on our Consolidated Financial Statements.\n3. \nREVENUE RECOGNITION \nWe derive most of our revenues by delivering client access to our multi-asset class solutions powered by our platform of connected data and technology that is available over the contractual term (referred to as the \"Hosted Platform\"). The Hosted Platform is a subscription-based service that provides client access to various combinations of products and services including workstations, portfolio analytics and enterprise solutions. We also derive revenues through the CGS platform, a subscription-based service that provides access to a database of universally recognized security identifiers and related descriptive data for issuers and their financial instruments (referred to as the \"Identifier Platform\"). \nThe majority of each of our contracts with clients, whether for Hosted Platform or Identifier Platform services, represents a single performance obligation covering a series of distinct products and services that are substantially the same and that have the same pattern of transfer to the client. The primary nature of the promise to the client is to provide daily access to each of these data and analytics platforms over the associated contractual term. These platforms provide integrated financial information, analytical applications and industry-leading service for the investment community. Based on the nature of the products and services offered by these platforms, we apply an output time-based measure of progress as the client is simultaneously receiving and consuming the benefits of the respective platform. We recognize revenue for the majority of these platforms in accordance with the 'as invoiced' practical expedient, because the consideration that we have the right to invoice corresponds directly with the value of our performance to date. There are no significant judgments that would impact the timing of revenue recognition. \nThe majority of client contracts have a duration of one year, or the amount we are entitled to receive corresponds directly with the value of our performance obligations completed to date. Therefore, we do not disclose the value of the remaining unsatisfied performance obligations. \nDisaggregated Revenues\n \nWe disaggregate revenues from our client contracts by segment based on the geographic region where the sale originated. Our business segmentation by geography is aligned with the operational and economic characteristics of our business. Refer to Note 17, \nSegment Information\n, for further information. \nThe following table presents revenues disaggregated by segment:\n \nYears ended August 31,\n(in thousands)\n2025\n2024\n2023\nAmericas\n$\n1,506,108\n \n$\n1,419,901\n \n$\n1,335,484\n \nEMEA\n580,284\n \n563,128\n \n539,843\n \nAsia Pacific\n235,356\n \n220,027\n \n210,181\n \nTotal Revenues\n$\n2,321,748\n \n$\n2,203,056\n \n$\n2,085,508\n \nWe have not disclosed revenues from external clients by product and service, as it is impracticable for us to do so.\n \n70\nTable of Contents\n4. \nFAIR VALUE MEASURES\nFair value is defined as the price that would be received from selling an asset or paid to transfer a liability (i.e., the \"exit price\") in an orderly transaction between market participants at the measurement date. In determining fair value, the use of various valuation methodologies, including market, income and cost approaches are permissible. When pricing an asset or liability, the inputs to these valuation methodologies consider market comparable information, taking into account the principal or most advantageous market in which we would transact. \nFair Value Hierarchy \nThe accounting guidance for fair value measurements establishes a three-level fair value hierarchy that requires an entity to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. The hierarchy ranks the reliability of the inputs, based upon the lowest level of input that is significant to the fair value measurement, used to determine fair value. Our assessment of the significance of a particular input to the fair value measurement requires judgment and may affect its placement within the fair value hierarchy. We have categorized our assets and liabilities within the fair value hierarchy as follows:\n \nLevel 1\n – applies to assets or liabilities for which there are quoted prices in active markets for identical assets or liabilities. \nLevel 2\n – applies to assets or liabilities for which there are inputs other than quoted prices that are observable for the asset or liability such as quoted prices for similar assets or liabilities in active markets; quoted prices for identical assets or liabilities in markets with insufficient volume or infrequent transactions (less active markets); or model-derived valuations in which significant inputs are observable or can be derived principally from, or corroborated by, observable market data. \nLevel 3\n – applies to assets or liabilities for which there are unobservable inputs to the valuation methodology that are significant to the measurement of the fair value of the assets or liabilities.\nThe assumptions used in determining fair value represent our best estimates, but these estimates involve inherent uncertainties and the application of our judgment. As a result, if factors change, our fair value estimates could be materially different in the future and may adversely affect our business and financial results. \n(a) Assets and Liabilities Measured at Fair Value on a Recurring Basis\nThe following tables show, by level within the fair value hierarchy, our assets and liabilities that are measured at fair value on a recurring basis as of August 31, 2025 and August 31, 2024. We did not have any transfers between levels of fair value measurements during fiscal 2025 and 2024. \n(in thousands)\nFair Value Measurements as of August 31, 2025\nLevel 1\nLevel 2\nLevel 3\nTotal\nAssets\n \n \n \nMoney market funds\n(1) \n$\n8,649\n \n$\n—\n \n$\n—\n \n$\n8,649\n \nMutual funds\n(2)\n—\n \n17,445\n \n—\n \n17,445\n \nDerivative instruments\n(3)\n—\n \n3,590\n \n—\n \n3,590\n \nTotal assets measured at fair value\n$\n8,649\n \n$\n21,035\n \n$\n—\n \n$\n29,684\n \nLiabilities\nDerivative instruments\n(3)\n$\n—\n \n$\n808\n \n$\n—\n \n$\n808\n \nContingent liabilities\n(4)\n—\n \n—\n \n24,126\n \n24,126\n \nTotal liabilities measured at fair value\n$\n—\n \n$\n808\n \n$\n24,126\n \n$\n24,934\n \n71\nTable of Contents\n(in thousands)\nFair Value Measurements as of August 31, 2024\nLevel 1\nLevel 2\nLevel 3\nTotal\nAssets\n \n \n \nMoney market funds\n(1)\n$\n129,635\n \n$\n—\n \n$\n—\n \n$\n129,635\n \nMutual funds\n(2)\n—\n \n69,619\n \n—\n \n69,619\n \nDerivative instruments\n(3)\n—\n \n2,619\n \n—\n \n2,619\n \nTotal assets measured at fair value\n$\n129,635\n \n$\n72,238\n \n$\n—\n \n$\n201,873\n \nLiabilities\nDerivative instruments\n(3)\n$\n—\n \n$\n250\n \n$\n—\n \n$\n250\n \nContingent liability\n(4)\n—\n \n—\n \n4,193\n \n4,193\n \nTotal liabilities measured at fair value\n$\n—\n \n$\n250\n \n$\n4,193\n \n$\n4,443\n \n(1) Our money market funds are readily convertible into cash. The net asset value of each fund on the last day of the reporting period is used to determine its fair value. Our money market funds are included in Cash and cash equivalents within the Consolidated Balance Sheets.\n(2) Our mutual funds' fair value is based on the fair value of the underlying investments held by the mutual funds, allocated to each share of the mutual fund using a net asset value approach. The fair value of each underlying investment is based on observable inputs. Our mutual funds are included in Investments within the Consolidated Balance Sheets.\n(3) Our derivative instruments included foreign exchange forward contracts and interest rate swap agreements. We utilized the income approach to measure fair value for our foreign exchange forward contracts. The income approach uses pricing models that rely on market observable inputs such as spot, forward and interest rates, as well as credit default swap spreads. To estimate fair value for our interest rate swap agreements, we utilized a present value of future cash flows, leveraging a model-derived valuation that uses observable inputs such as interest rate yield curves. Our derivative instruments in an asset position are included in \nPrepaid expenses and other current assets\n and those in a liability position are included in \nAccounts payable and accrued expenses\n within the Consolidated Balance Sheets.\n(4) Our contingent liabilities resulted from the acquisitions of various businesses. These liabilities reflect the present value of potential future payments that are contingent upon the achievement of certain specified milestones and are valued using a scenario-based method. This method incorporates unobservable inputs and assumptions made by management, including the probability of achieving specified milestones, expected time until payment and the discount rate. Refer to Note 5, \nAcquisitions,\n for more information on the contingent liabilities associated with the Liquid Holdings LLC (\"LiquidityBook\") and Platform Group Limited (\"Irwin\") acquisitions.\n72\nTable of Contents\n(b) Assets and Liabilities Measured at Fair Value on a Non-Recurring Basis\nAssets that are measured at fair value on a non-recurring basis primarily include our PPE, lease ROU assets, goodwill and intangible assets. These assets are assessed for impairment whenever events or circumstances indicate their carrying value may not be fully recoverable, and at least annually for goodwill. The fair values of these non-financial assets are determined based on valuation techniques using the best information available, and may include quoted market prices, market comparable information and discounted cash flow projections. \n(c) Assets and Liabilities Measured at Fair Value for Disclosure Purposes Only\nWe elected not to carry our debt at fair value on the Consolidated Balance Sheets. Our Senior Notes are publicly traded; therefore, the fair value of our Senior Notes is estimated based on quoted prices in active markets as of the last business day of the fiscal year, which are considered Level 1 inputs. The fair value of our 2022 and 2025 Credit Facilities, for their respective outstanding periods, was estimated based on quoted market prices for similar instruments, adjusted for unobservable inputs to ensure comparability to our investment rating, maturity terms and principal outstanding, which are considered Level 3 inputs. Refer to Note 11, \nDebt \nfor definitions of, and more information on, our Senior Notes, 2025 Credit Facilities and 2022 Credit Facilities.\nThe following table summarizes information on our outstanding debt as of August 31, 2025 and August 31, 2024:\nAugust 31, 2025\nAugust 31, 2024\n(in thousands)\nFair Value Hierarchy\nPrincipal Amount\nEstimated Fair Value\nPrincipal Amount\nEstimated Fair Value\n2027 Notes\nLevel 1\n$\n500,000\n \n$\n490,565\n \n$\n500,000\n \n$\n479,760\n \n2032 Notes\nLevel 1\n500,000\n \n460,440\n \n500,000\n \n449,380\n \n2025 Term Facility\nLevel 3\n375,000\n \n374,866\n \n—\n \n—\n \n2022 Revolving Facility\nLevel 3\n—\n \n—\n \n250,000\n \n246,578\n \n2022 Term Facility\nLevel 3\n—\n \n—\n \n125,000\n \n125,242\n \nTotal principal amount\n$\n1,375,000\n \n$\n1,325,871\n \n$\n1,375,000\n \n$\n1,300,960\n \nTotal unamortized discounts and debt issuance costs\n(1)\n(\n6,740\n)\n(\n9,027\n)\nTotal net carrying value of debt\n$\n1,368,260\n \n$\n1,365,973\n \n(1)\n \nAmount excludes the debt issuance costs related to the 2025 Revolving Facility which are presented within Other assets on the Consolidated Balance Sheets.\n5. \nACQUISITIONS\nOur acquisitions with the most significant cash flows during fiscal 2023 through fiscal 2025 included: \nLiquid Holdings, LLC (\"LiquidityBook\")\nOn February 7, 2025, we completed the acquisition of LiquidityBook for a purchase price of $\n243.2\n million, net of cash acquired, and inclusive of preliminary working capital adjustments. The purchase price includes contingent consideration of $\n11.9\n million, which reflects the acquisition date fair value of potential future payments that are contingent upon the achievement of certain specified milestones. Refer to Note 4, \nFair Value Measures,\n for information regarding the contingent consideration.\nLiquidityBook provides cloud-native trading solutions to hedge fund, asset and wealth management, outsourced trading, and sell-side middle office clients. LiquidityBook operates a proprietary FIX network that enables streamlined connectivity to over \n200\n brokers and order routing to more than \n1,600\n destinations across \n80\n markets globally. This acquisition adds technology-forward order management and investment book of record capabilities and enhances FactSet’s ability to serve the integrated workflow needs of clients across the portfolio life cycle.\nThe results of LiquidityBook's operations have been included within the Americas, EMEA and Asia Pacific segments in our Consolidated Financial Statements. Pro forma information has not been presented because the effect of the LiquidityBook acquisition was not material to our Consolidated Financial Statements. \n73\nTable of Contents\nThe preliminary purchase price allocation is subject to change pending a final valuation of the assets and liabilities acquired and the finalization of working capital adjustments. We expect to finalize the allocation of the purchase price for LiquidityBook as soon as possible, but in any event, no later than one year from the acquisition date.\nThe acquisition date fair values of major classes of assets acquired and liabilities assumed are as follows:\nAcquisition Date Fair Value\nAcquisition Date Useful Life\nAmortization Method\n(in thousands)\n(in years)\nCurrent assets\n$\n3,893\n \nAmortizable intangible assets\n     Software technology\n65,600\n \n12\n years\nStraight-line\n     Client relationships\n8,800\n \n17\n years\nStraight-line\n     Trade names\n3,400\n \n10\n years\nStraight-line\nGoodwill\n164,787\n \nOther assets\n487\n \nCurrent liabilities\n     Deferred revenues\n(\n799\n)\n     Other current liabilities\n(\n2,386\n)\nOther liabilities\n(\n600\n)\nTotal purchase price\n$\n243,182\n \nGoodwill totaling $\n164.8\n million represents the excess of the LiquidityBook purchase price over the fair value of net assets acquired and considers future economic benefits that we expect to achieve as a result of the acquisition. The goodwill is included in the Americas, EMEA and Asia Pacific segments and is deductible for income tax purposes.\nPlatform Group Limited (\"Irwin\")\nOn November 5, 2024, we completed the acquisition of Irwin for a purchase price of $\n120.2\n million, net of cash acquired, and inclusive of working capital adjustments. The purchase price includes contingent consideration of $\n9.6\n million which reflects the acquisition date fair value of potential future payments that are contingent upon the achievement of certain specified milestones. Refer to Note 4, \nFair Value Measures,\n for information regarding the contingent consideration. \nIrwin is a leading investor relations and capital markets platform for public companies and their advisors. This acquisition builds on a recent successful partnership between FactSet and Irwin, and expands our ability to address the holistic workflow needs of investor relations professionals with an integrated, modern solution. \nThe results of Irwin's operations have been included within the Americas, EMEA and Asia Pacific segments in our Consolidated Financial Statements. Pro forma information has not been presented because the effect of the Irwin acquisition was not material to our Consolidated Financial Statements. \n74\nTable of Contents\nWe finalized the purchase accounting for the Irwin acquisition during the third quarter of fiscal 2025 and did not record any material changes to the preliminary purchase price allocation. \nThe acquisition date fair values of major classes of assets acquired and liabilities assumed are as follows:\nAcquisition Date Fair Value\nAcquisition Date Useful Life\nAmortization Method\n(in thousands)\n(in years)\nCurrent assets\n$\n2,393\n \nAmortizable intangible assets\nSoftware technology\n36,100\n \n12\n years\nStraight-line\nClient relationships\n1,700\n \n11\n years\nStraight-line\nTrade names\n1,400\n \n10\n years\nStraight-line\nGoodwill\n91,376\n \nCurrent liabilities\n     Deferred revenues\n(\n4,218\n)\n     Other current liabilities\n(\n524\n)\nOther liabilities\n(\n8,041\n)\nTotal purchase price\n$\n120,186\n \nGoodwill totaling $\n91.4\n million represents the excess of the Irwin purchase price over the fair value of net assets acquired and considers future economic benefits that we expect to achieve as a result of the acquisition. The goodwill is included in the Americas and EMEA segments and is not deductible for income tax purposes.\n6. \nPROPERTY, EQUIPMENT AND LEASEHOLD IMPROVEMENTS\nProperty, equipment and leasehold improvements consist of the following:\n(in thousands)\nAugust 31, \n2025\n2024\nLeasehold improvements\n$\n101,425\n \n$\n95,840\n \nComputers and related equipment\n97,947\n \n84,447\n \nFurniture and fixtures\n30,764\n \n28,747\n \nSubtotal\n$\n230,136\n \n$\n209,034\n \nLess accumulated depreciation and amortization\n(\n144,933\n)\n(\n126,521\n)\nProperty, equipment and leasehold improvements, net\n$\n85,203\n \n$\n82,513\n \nPPE depreciation and amortization expense was $\n24.1\n million, $\n20.2\n million and $\n18.1\n million for fiscal 2025, 2024 and 2023, respectively.\n \n7. \nGOODWILL\nChanges in the carrying value of goodwill by segment for the years ended August 31, 2025 and 2024 are as follows:\n(in thousands)\nAmericas\nEMEA\nAsia Pacific\nTotal\nBalance at August 31, 2023\n$\n704,759\n \n$\n297,734\n \n$\n2,243\n \n$\n1,004,736\n \nAcquisitions\n(\n305\n)\n—\n \n—\n \n(\n305\n)\nForeign currency translations\n—\n \n6,708\n \n(\n10\n)\n6,698\n \nBalance at August 31, 2024\n$\n704,454\n \n$\n304,442\n \n$\n2,233\n \n$\n1,011,129\n \nAcquisitions\n219,107\n \n32,680\n \n9,034\n \n260,821\n \nDivestiture\n(\n269\n)\n(\n1,291\n)\n(\n43\n)\n(\n1,603\n)\nForeign currency translations\n2,460\n \n8,605\n \n3,296\n \n14,361\n \nBalance at August 31, 2025\n$\n925,752\n \n$\n344,436\n \n$\n14,520\n \n$\n1,284,708\n \n75\nTable of Contents\nWe performed our annual goodwill impairment test during the fourth quarter of fiscal 2025 and 2024. During fiscal 2025 and 2024, we utilized a qualitative analysis and concluded there was \nno\n impairment as it was more likely than not that the fair value of each of our reporting units was not less than its respective carrying value.\n8. \nINTANGIBLE ASSETS\nWe amortize intangible assets on a straight-line basis over their estimated useful lives. \nThe following table presents the estimated useful life, gross carrying amounts and accumulated amortization related to our identifiable intangible assets as of August 31, 2025 and August 31, 2024: \nAugust 31, 2025\nAugust 31, 2024\n(in thousands, except useful lives)\nEstimated Useful Life (years)\nGross Carrying Amount\nAccumulated Amortization\nNet Carrying Amount\nGross Carrying Amount\nAccumulated Amortization\nNet Carrying Amount\nABA business process\n36\n$\n1,583,000\n \n$\n153,903\n \n$\n1,429,097\n \n$\n1,583,000\n \n$\n109,930\n \n$\n1,473,070\n \nClient relationships\n11\n to \n26\n280,065\n \n94,365\n \n185,700\n \n266,419\n \n80,904\n \n185,515\n \nDeveloped technology\n3\n to \n5\n260,154\n \n127,669\n \n132,485\n \n181,492\n \n68,286\n \n113,206\n \nSoftware technology\n3\n to \n12\n253,899\n \n131,731\n \n122,168\n \n143,685\n \n117,189\n \n26,496\n \nData content\n7\n to \n20\n86,416\n \n44,490\n \n41,926\n \n84,374\n \n38,725\n \n45,649\n \nTrade names\n5\n to \n10\n4,919\n \n326\n \n4,593\n \n—\n \n—\n \n—\n \nNon-compete agreements\n4\n290\n \n157\n \n133\n \n290\n \n85\n \n205\n \nTotal\n$\n2,468,743\n \n$\n552,641\n \n$\n1,916,102\n \n$\n2,259,260\n \n$\n415,119\n \n$\n1,844,141\n \nThe weighted average useful life of our intangible assets as of August 31, 2025 was \n30.5\n years. We did not identify a material change to the estimated remaining useful lives of our intangible assets during fiscal 2025 and 2024. The intangible assets have no assigned residual values.\nThe following table presents the amortization expense for our intangible assets which is included in Cost of services in our Consolidated Statements of Income:\nYears ended August 31,\n(in thousands)\n \n2025\n2024\n2023\nAmortization expense\n$\n133,573\n \n$\n104,950\n \n$\n87,304\n \nAs of August 31, 2025, estimated intangible asset amortization expense for each of the next five years and thereafter is as follows:\n(in thousands)\nEstimated Amortization Expense\nFiscal Years Ended August 31,\n2026\n$\n143,686\n \n2027\n118,672\n \n2028\n89,985\n \n2029\n72,983\n \n2030\n70,546\n \nThereafter\n1,420,230\n \nTotal\n$\n1,916,102\n \n76\nTable of Contents\n9. \nINCOME TAXES \nWe are subject to taxation in the U.S. and various state, local and foreign jurisdictions in which we conduct our business. Income tax expense is based on taxable income determined in accordance with current enacted laws and tax rates. Deferred income taxes are recorded for the temporary differences between the financial statement carrying amounts and the tax basis of our assets and liabilities using currently enacted tax rates.\nProvision for Income Taxes and Effective Tax Rate\nThe provision for income taxes and the effective tax rate are as follows:\n(in thousands)\nYears ended August 31,\n2025\n2024\n2023\nU.S. operations\n$\n479,288\n \n$\n416,093\n \n$\n382,702\n \nNon-U.S. operations\n241,670\n \n235,410\n \n201,252\n \nIncome before income taxes\n$\n720,958\n \n$\n651,503\n \n$\n583,954\n \nU.S. operations\n$\n45,591\n \n$\n55,219\n \n$\n54,337\n \nNon-U.S. operations\n78,327\n \n59,158\n \n61,444\n \nProvision for income taxes\n$\n123,918\n \n$\n114,377\n \n$\n115,781\n \nEffective tax rate\n17.2\n \n%\n17.6\n \n%\n19.8\n \n%\nThe components of the provision for income taxes consist of the following:\n(in thousands)\nYears ended August 31,\n2025\n2024\n2023\nCurrent\nU.S. federal\n$\n16,255\n \n$\n46,903\n \n$\n38,625\n \nU.S. state and local\n27,594\n \n40,926\n \n38,600\n \nNon-U.S.\n83,614\n \n58,568\n \n69,675\n \nTotal current taxes\n$\n127,463\n \n$\n146,397\n \n$\n146,900\n \nDeferred\nU.S. federal\n$\n(\n1,132\n)\n$\n(\n26,962\n)\n$\n(\n17,235\n)\nU.S. state and local\n2,875\n \n(\n5,648\n)\n(\n5,652\n)\nNon-U.S.\n(\n5,288\n)\n590\n \n(\n8,232\n)\nTotal deferred taxes\n$\n(\n3,545\n)\n$\n(\n32,020\n)\n$\n(\n31,119\n)\nProvision for income taxes\n$\n123,918\n \n$\n114,377\n \n$\n115,781\n \nOur effective tax rate will vary based on, among other factors, changes in levels of foreign income, as well as other non-recurring events. \n77\nTable of Contents\nThe following table presents a reconciliation between the U.S. corporate income tax rate and our effective tax rate:\n \nYears ended August 31, \n(expressed as a percentage of income before income taxes)\n2025\n2024\n2023\nTax at U.S. Federal statutory tax rate\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nIncrease (decrease) in taxes resulting from:\nState and local taxes, net of U.S. federal income tax benefit\n3.1\n \n2.2\n \n3.1\n \nForeign income at other than U.S. rates\n1.7\n \n1.5\n \n(\n0.1\n)\nForeign derived intangible income (\"FDII\") tax deduction\n(\n2.0\n)\n(\n2.3\n)\n(\n1.6\n)\nIncome tax benefits from research and development (\"R&D\") tax credits\n(\n3.1\n)\n(\n2.8\n)\n(\n3.8\n)\nStock-based payments\n(\n1.4\n)\n(\n2.1\n)\n(\n2.2\n)\nU.S. impact of foreign income\n(\n3.1\n)\n(\n2.5\n)\n(\n0.6\n)\nUncertain tax positions\n1.4\n \n2.3\n \n0.5\n \nOne-time adjustment\n(1)\n—\n \n—\n \n3.8\n \nOther, net\n(\n0.4\n)\n0.3\n \n(\n0.3\n)\nEffective tax rate\n17.2\n \n%\n17.6\n \n%\n19.8\n \n%\n(1) During fiscal 2023, we recorded an out-of-period adjustment related to a review and analysis of certain tax positions, resulting in a one-time net charge. The adjustment related to the accounting of tax balance sheet accounts. All local, federal and foreign taxes payable have been paid in a timely manner, subject to normal audits of open years.\nDeferred Tax Assets and Liabilities\nWe recognize deferred income taxes to reflect the temporary differences between the financial statement carrying amounts of assets and liabilities and their corresponding tax basis. The tax effects of these differences are as follows:\n(in thousands)\nAs of August 31, \n2025\n2024\nDeferred tax assets:\nLease liabilities\n$\n35,352\n \n$\n41,373\n \nStock-based compensation\n36,675\n \n35,615\n \nCapitalization of R&D costs\n143,829\n \n109,664\n \nSales Tax Dispute\n—\n \n14,058\n \nOther\n39,793\n \n28,154\n \nTotal deferred tax assets\n$\n255,649\n \n$\n228,864\n \nDeferred tax liabilities:\nDepreciation on PPE\n$\n(\n41,432\n)\n$\n(\n35,666\n)\nPurchased intangible assets, including acquired technology\n(\n141,566\n)\n(\n106,131\n)\nLease ROU assets\n(\n18,184\n)\n(\n24,429\n)\nOther\n(\n5,393\n)\n(\n9,753\n)\nTotal deferred tax liabilities\n$\n(\n206,575\n)\n$\n(\n175,979\n)\nDeferred tax assets (liabilities), net\n$\n49,074\n \n$\n52,885\n \nValuation allowance\n(\n2,750\n)\n—\n \nTotal deferred tax assets (liabilities), net\n$\n46,324\n \n$\n52,885\n \n78\nTable of Contents\nTotal deferred tax assets and liabilities recorded within the Consolidated Balance Sheets were as follows:\n(in thousands)\nAs of August 31, \n2025\n2024\nDeferred tax assets\n$\n61,226\n \n$\n61,337\n \nDeferred tax liabilities\n(\n14,902\n)\n(\n8,452\n)\nTotal deferred tax assets (liabilities), net\n$\n46,324\n \n$\n52,885\n \nAs of August 31, 2025, our pre-tax foreign, federal and state NOLs were approximately $\n12.8\n million, $\n18.9\n million and $\n11.1\n million, respectively. These carryforwards may be used to offset future taxable income. Our foreign NOLs expire on August 31, 2045, while our federal NOLs have various expiration dates, beginning August 31, 2036, with some federal NOLs having an unlimited carryforward. Our state NOLs have various expiration dates, beginning August 31, 2026. Utilization of the NOLs may be subject to an annual limitation due to the ownership limitations provided by the Internal Revenue Code of 1986, as amended (the \"Code\"), and similar state provisions. Any annual limitation may result in the expiration of NOLs before utilization.\nUnrecognized Tax Benefits\nThe determination of liabilities related to uncertain tax positions, and associated interest and penalties, requires significant estimates and assumptions; as such, there can be no assurance that we will accurately predict the outcomes of these audits. We have no reason to believe that such audits will result in the payment of additional taxes and/or penalties that would have a material adverse effect on our results of operations or financial position, beyond current estimates. \nThe following table summarizes the changes in the balance of gross unrecognized tax benefits:\n(in thousands)\nUnrecognized tax benefits as of August 31, 2022\n$\n20,171\n \nAdditions based on tax positions related to the current year\n4,372\nRelease for tax positions of prior years\n(\n3,490\n)\nUnrecognized tax benefits as of August 31, 2023\n$\n21,053\n \nAdditions based on tax positions related to the current year\n6,068\n \n     Additions for tax positions related to prior years\n(1)\n11,726\n \nRelease for tax positions of prior years\n(\n3,557\n)\nUnrecognized tax benefits as of August 31, 2024\n$\n35,290\n \nAdditions based on tax positions related to the current year\n5,344\n \nAdditions for tax positions related to prior years\n(1)\n2,368\n \nRelease for tax positions of prior years\n(\n3,568\n)\nUnrecognized tax benefits as of August 31, 2025\n$\n39,434\n \n(1) Additions for tax positions related to prior years was presented separately in fiscal 2025. Comparative figures for fiscal 2024 have been conformed. There were no such amounts in fiscal 2023.\nWe do not currently anticipate that the total amount of unrecognized tax benefits will significantly change within the next 12 months. We recognize accrued interest related to unrecognized tax benefits in our Provision for income taxes in the Consolidated Statements of Income. Our accrued interest related to unrecognized tax benefits was $\n5.7\n million, $\n3.9\n million and $\n1.6\n million as of August 31, 2025, 2024 and 2023, respectively. As of fiscal 2025, 2024 and 2023, there were $\n38.5\n million, $\n29.1\n million and $\n19.1\n million of unrecognized tax benefits that, if recognized, would affect the annual effective tax rate. \n79\nTable of Contents\nIn the normal course of business, our tax filings are subject to audit by federal, state and foreign tax authorities. \nAs of August 31, 2025, we remained subject to examination in the following significant tax jurisdictions for the fiscal years as indicated below:\nSignificant Tax Jurisdiction\nOpen Tax Fiscal Years\nU.S.\nFederal\n2019\nthrough\n2024\nState (various)\n2019\nthrough\n2024\nNon-U.S.\nUnited Kingdom\n2021\nthrough\n2024\nIndia\n2022\nthrough\n2024\nUndistributed Foreign Earnings\nAs of \nAugust 31, 2025\n, we had $\n486.9\n million of undistributed foreign earnings of which $\n69.1\n million are permanently reinvested. It is our intent to permanently reinvest all foreign undistributed earnings, except in jurisdictions where earnings can be repatriated substantially free of tax. It is not practicable to determine the deferred tax liability that would be payable if these permanently reinvested earnings were repatriated to the U.S. With respect to outside basis differences other than unremitted earnings, we continue to be permanently reinvested and have no plans to liquidate or sell any foreign subsidiaries. In addition, we have not provided for deferred taxes on any outside basis differences of our domestic subsidiaries as we have the ability and intent to recover these basis differences in a tax-free manner. It is not practicable to determine the amount of unrecognized deferred tax related to these basis differences. \nBase Erosion and Profit Shifting Pillar Two\nThe Organization for Economic Co-operation and Development released Base Erosion and Profit Shifting Pillar Two rules (“Pillar Two”) to introduce a global minimum corporate tax of 15% for companies with global revenues and profits above certain thresholds. Certain aspects of Pillar Two are effective for tax years beginning on or after January 1, 2024. Although the U.S. has not yet enacted legislation to adopt Pillar Two, certain countries in which we operate have already adopted, or are in the process of adopting, legislation to implement Pillar Two. We have determined that Pillar Two would not have a material impact to our Consolidated Financial Statements, related disclosures, or effective tax rate. However, the Pillar Two rules continue to evolve and their application may alter our tax obligations in certain countries in which we operate for fiscal 2026, and beyond, as we continue to assess the impact of tax legislation in these jurisdictions.\nOne Big Beautiful Bill Act\nOn July 4, 2025, the One Big Beautiful Bill Act (the \"Act\") was signed into law. The legislation includes a broad range of tax reform provisions affecting businesses including, but not limited to, the expansion of bonus depreciation, immediate expensing of domestic R&D costs, and revisions to the U.S. taxation of profits derived from international operations. The legislation has multiple effective dates, with certain provisions effective in fiscal year 2025 and others implemented through fiscal year 2027. The Act did not have a material impact on the Company financial position and results of operations as of and for the fiscal year ended \nAugust 31, 2025\n.\n10. \nLEASES\nOur operating lease arrangements relate to our office space and data centers. \nWe review new arrangements at inception to evaluate whether we obtain substantially all the economic benefits of and have the right to control the use of an asset. \nOur \nlease ROU assets and lease liabilities are recognized based on \nthe present value of future minimum lease payments at lease commencement or modification date (which includes fixed lease payments and certain qualifying index-based variable payments) \nover the reasonably certain lease term, leveraging \nan estimated IBR. \nCertain adjustments to calculate our lease ROU assets may be required due to prepayments, lease incentives received and initial direct costs incurred. We account for lease and non-lease components as a single lease component, which we recognize over the expected lease term on a straight-line expense basis in occupancy costs (a component of SG&A expense) in our Consolidated Statements of Income. \n80\nTable of Contents\nAs of August 31, 2025\n, we recognized $\n121.8\n million of Lease ROU assets, net and $\n190.2\n million of combined Current lease liabilities and Long-term lease liabilities in the Consolidated Balance Sheets. Our leases \nhave a remaining lease term ranging from less than \none year\n to \njust over\n \n10\n years. Our lease agreements may \ninclude options to extend or terminate the lease, which would be included in the measurement of our lease term if it is reasonably certain that we will exercise the option.\nThe following table presents our future minimum lease payments and a reconciliation to the combined \nCurrent lease liabilities and Long-term lease liabilities in the Consolidated Balance Sheets \nas of August 31, 2025: \n(in thousands) \nMinimum Lease\nPayments\nFiscal Years Ended August 31,\n2026\n$\n41,550\n \n2027\n40,968\n \n2028\n36,685\n \n2029\n31,068\n \n2030\n25,891\n \nThereafter\n41,039\n \nTotal minimum lease payments\n$\n217,201\n \nLess: Imputed interest\n26,952\n \nTotal lease liabilities\n$\n190,249\n \nThe following table includes components of our occupancy costs:\nYears ended August 31,\n(in thousands)\n \n2025\n2024\n2023\nOperating lease costs\n(1)\n$\n30,982\n \n$\n30,407\n \n$\n32,330\n \nVariable lease costs\n(2)\n$\n18,110\n \n$\n17,280\n \n$\n17,940\n \n(1) Operating lease costs include costs associated with fixed lease payments and index-based variable payments that qualified for lease accounting under ASC 842, \nLeases\n and complied with the practical expedients and exceptions we elected.\n(2) Variable lease costs include costs that are not fixed and are not dependent on an index or rate. These costs were not included in the measurement of lease liabilities and primarily include variable non-lease costs, such as utilities, real estate taxes, insurance and maintenance, as well as lease costs for those leases that qualified for the short-term lease exception. \nThe following table summarizes our weighted average remaining lease term and weighted average discount rate related to our operating leases recorded on the Consolidated Balance Sheets:\nAs of August 31, \n2025\n2024\nWeighted average remaining lease term \n(in years)\n6.1\n6.9\nWeighted average discount rate\n (IBR)\n4.7\n \n%\n4.6\n \n%\nThe following table summarizes supplemental cash flow information related to our operating leases:\nYears ended August 31,\n(in thousands)\n \n2025\n2024\n2023\nCash paid for amounts included in the measurement of lease liabilities\n$\n40,613\n \n$\n39,386\n \n$\n39,392\n \nLease ROU assets obtained in exchange for lease liabilities\n(1)\n$\n7,439\n \n$\n10,268\n \n$\n16,934\n \nReductions to ROU assets resulting from reductions to lease liabilities\n(2)\n$\n(\n5,529\n)\n$\n(\n281\n)\n$\n(\n1,376\n)\n(1) Primarily includes new lease arrangements entered into during the respective period and contract modifications that extend our lease terms and/or provide additional rights.\n(2) Primarily relates to lease term reassessments based on contractual options to early terminate, resulting in a reduction to the lease liability and the corresponding lease ROU asset.\n \n81\nTable of Contents\n11. \nDEBT\nWe have not elected the fair value option and report our debt at amortized cost. \nOur debt obligations as of August 31, 2025 and August 31, 2024 consisted of the following: \n(in thousands)\nIssuance Date\nContractual Maturity Date\nAugust 31, 2025\nAugust 31, 2024\nCurrent debt\n2022 Term Facility\n(1)\n3/1/2022\n3/1/2025\n$\n—\n \n$\n125,000\n \nUnamortized debt issuance costs\n—\n \n(\n158\n)\nTotal Current debt\n$\n—\n \n$\n124,842\n \nLong-term debt\n2022 Revolving Facility\n(2)\n3/1/2022\n3/1/2027\n$\n—\n \n$\n250,000\n \n2025 Term Facility\n4/8/2025\n4/8/2028\n375,000\n \n—\n \n2027 Notes\n3/1/2022\n3/1/2027\n500,000\n \n500,000\n \n2032 Notes\n3/1/2022\n3/1/2032\n500,000\n \n500,000\n \nUnamortized discounts and debt issuance costs\n(3)\n(\n6,740\n)\n(\n8,869\n)\nTotal Long-term debt\n$\n1,368,260\n \n$\n1,241,131\n \nTotal debt\n$\n1,368,260\n \n$\n1,365,973\n \n(1) The 2022 Term Facility was repaid in full on February 28, 2025.\n(2) The 2022 Revolving Facility was repaid in full and terminated on April 8, 2025.\n(3) Amount excludes the debt issuance costs related to the 2025 Revolving Facility which are presented within Other assets on the Consolidated Balance Sheets.\nAs of August 31, 2025, annual maturities on our debt obligations, based on contractual maturity dates, were as follows:\n(in thousands)\n \nMaturities\nFiscal Years Ended August 31,\n2026\n$\n—\n \n2027\n500,000\n \n2028\n375,000\n \n2029\n—\n \n2030\n—\n \nThereafter\n500,000\n \nTotal\n$\n1,375,000\n \n2025 Credit Agreement\nOn April 8, 2025, we entered into a credit agreement (the \"2025 Credit Agreement\") and borrowed $\n500.0\n million under a senior unsecured term loan credit facility (the \"2025 Term Facility\"). We used the proceeds from the 2025 Term Facility borrowing to repay the outstanding balance under the 2022 Revolving Facility (as defined below). The 2025 Credit Agreement also provides for a $\n1.0\n billion senior unsecured revolving credit facility (the \"2025 Revolving Facility\"). The 2025 Revolving Facility, together with the 2025 Term Facility, are referred to as the \"2025 Credit Facilities\".\nThe 2025 Term Facility matures on April 8, 2028, and the 2025 Revolving Facility matures on April 8, 2030. The 2025 Revolving Facility provides for up to $\n100.0\n million in the form of letters of credit and up to $\n100.0\n million in the form of swingline loans. We may seek additional commitments of up to $\n1.0\n billion under the 2025 Revolving Facility from lenders or other financial institutions.\n82\nTable of Contents\nThe 2025 Term Facility is subject to scheduled quarterly principal payments, commencing on August 31, 2025, with each quarterly principal payment equal to \n1.25\n% of the original principal amount of the 2025 Term Facility. The 2025 Credit Facilities are not otherwise subject to any other mandatory repayments. We may voluntarily prepay loans under the 2025 Credit Facilities at any time without premium or penalty. Prepayments of the 2025 Term Facility shall be applied to reduce the subsequent scheduled quarterly principal payments in direct order of maturity.\nDuring fiscal 2025, we repaid $\n125.0\n million under the 2025 Term Facility. This included $\n68.8\n million to satisfy all scheduled quarterly principal payments from loan inception through maturity, eliminating any future mandatory quarterly principal payment requirements. The remaining $\n56.2\n million was made as a voluntary prepayment. From the effective date of the 2025 Revolving Facility through August 31, 2025, we have had no borrowings under the 2025 Revolving Facility.\nFrom the borrowing date through August 31, 2025, the outstanding borrowings under the 2025 Credit Facilities bore interest at a rate equal to the applicable one-month Term Secured Overnight Financing Rate (\"SOFR\") plus a \n0.975\n% spread (comprised of a \n0.875\n% interest rate margin, based on a pricing grid determined by reference to our senior unsecured non-credit enhanced long-term debt rating and our total leverage ratio, plus a \n0.1\n% credit spread adjustment). \nWe pay a commitment fee on the daily unused amount of the 2025 Revolving Facility using a pricing grid based on our senior unsecured non-credit enhanced long-term debt rating and our total leverage ratio. The commitment fee remained consistent at \n0.1\n% through August 31, 2025.\nDebt issuance costs related to the 2025 Credit Facilities were $\n3.4\n million. These debt issuance costs are presented in the Consolidated Balance Sheets as a direct deduction from the carrying amount of the debt liability for the 2025 Term Facility and within Other assets for the 2025 Revolving Facility. Debt issuance costs are amortized to Interest expense in the Consolidated Statements of Income on a straight-line basis over the contractual term of the debt (which approximates the effective interest method for the 2025 Term Facility).\nThe 2025 Credit Agreement contains usual and customary event of default provisions for facilities of this type, which are subject to usual and customary grace periods and materiality thresholds. If an event of default occurs under the 2025 Credit Agreement, the lenders may, among other things, terminate their commitments and declare all outstanding borrowings immediately due and payable. \nThe 2025 Credit Agreement contains usual and customary affirmative and negative covenants for facilities of this type, including a financial covenant requiring maintenance of a total leverage ratio of no greater than \n3.75\n to 1.00 as of the last day of each fiscal quarter (subject to an increase to \n4.25\n to 1.00 for five consecutive fiscal quarters in connection with certain material acquisitions). We were in compliance with all covenants and requirements of the 2025 Credit Agreement as of August 31, 2025.\n2022 Credit Agreement\nOn March 1, 2022, we entered into a credit agreement (the \"2022 Credit Agreement\") and borrowed $\n1.0\n billion under a senior unsecured term loan credit facility (the \"2022 Term Facility\") and $\n250.0\n million of the available $\n500.0\n million under a senior unsecured revolving credit facility (the \"2022 Revolving Facility\"). The 2022 Revolving Facility, together with the 2022 Term Facility, are referred to as the \"2022 Credit Facilities\". On January 31, 2025, we entered into a joinder agreement to our 2022 Credit Agreement pursuant to which commitments under the 2022 Revolving Facility were increased by $\n100.0\n million, to a total of $\n600.0\n million. All other terms of the 2022 Credit Agreement remained unchanged. \nThe 2022 Term Facility, originally due to mature on March 1, 2025, was repaid in full following $\n125.0\n million of repayments made during the six months ended February 28, 2025. During fiscal 2025, we borrowed $\n305.0\n million and repaid $\n555.0\n million under the 2022 Revolving Facility. The 2022 Credit Agreement was terminated on April 8, 2025, concurrent with entering into the 2025 Credit Agreement.\nBorrowings previously outstanding under the 2022 Credit Facilities bore interest at a rate equal to the applicable one-month Term SOFR plus a spread, using a debt leverage pricing grid and a credit spread adjustment (with total spread ranging from \n0.975\n% to \n1.1\n% over the term of the debt). \nInterest Rate Swap Agreements\nWe leverage interest rate swap agreements to manage our floating interest rate exposure with a fixed interest rate. Our interest rate swap agreements are designated as cash flow hedges at inception.\n83\nTable of Contents\n2025 Swap Agreement\nOn April 24, 2025, we entered into an interest rate swap agreement (\"2025 Swap Agreement\") with a notional amount of $\n200.0\n million to hedge a portion of our outstanding floating SOFR debt with a fixed interest rate of \n4.086\n%. The notional amount of the 2025 Swap Agreement declines by $\n50.0\n million on a quarterly basis beginning May 31, 2025 and matures on February 28, 2026. As of August 31, 2025, the notional amount of the 2025 Swap Agreement was $\n100.0\n million.\n2024 Swap Agreement\nOn March 1, 2024, we entered into an interest rate swap agreement (\"2024 Swap Agreement\") with a notional amount of $\n200.0\n million to hedge a portion of our outstanding floating SOFR debt with a fixed interest rate of \n5.145\n%. The notional amount of the 2024 Swap Agreement declined by $\n50.0\n million on a quarterly basis beginning May 31, 2024. The 2024 Swap Agreement matured on February 28, 2025. \n2022 Swap Agreement\nOn March 1, 2022, we entered into an interest rate swap agreement (\"2022 Swap Agreement\") with a notional amount of $\n800.0\n million to hedge a portion of our outstanding floating SOFR debt with a fixed interest rate of \n1.162\n%. The notional amount of the 2022 Swap Agreement declined by $\n100.0\n million on a quarterly basis beginning May 31, 2022. The 2022 Swap Agreement matured on February 28, 2024.\nRefer to Part II, Item 7A. \nQuantitative and Qualitative Disclosures About Market Risk\n, in this Annual Report on Form 10-K, for further discussion of our exposure to interest rate risk on our outstanding floating rate debt.\nSenior Notes\nOn March 1, 2022, we completed a public offering issuing $\n500.0\n million of \n2.900\n% Senior Notes due March 1, 2027 (the \"2027 Notes\") and $\n500.0\n million of \n3.450\n% Senior Notes due March 1, 2032 (the \"2032 Notes\" and, together with the 2027 Notes, the \"Senior Notes\"). The Senior Notes were issued pursuant to an indenture, dated as of March 1, 2022, by and between us and U.S. Bank Trust Company, National Association, as trustee (the \"Trustee\"), as supplemented by the supplemental indenture, dated as of March 1, 2022, between us and the Trustee (the \"Supplemental Indenture\"). \nThe Senior Notes were issued at an aggregate discount of $\n2.8\n million and we incurred approximately $\n9.1\n million in debt issuance costs during fiscal 2022. Debt discounts and debt issuance costs are presented in the Consolidated Balance Sheets as a net direct deduction from the carrying amount of the debt liability. The debt discounts and debt issuance costs are amortized to Interest expense in the Consolidated Statements of Income over the contractual term of the debt, leveraging the effective interest method.\nInterest on the Senior Notes is payable semiannually in arrears on March 1 and September 1 of each year. \nWe may redeem the Senior Notes, in whole or in part, at any time at specified redemption prices, plus any accrued and unpaid interest. Upon the occurrence of a change of control triggering event (as defined in the Supplemental Indenture), we must offer to repurchase the Senior Notes at \n101\n% of their principal amount, plus any accrued and unpaid interest. \nInterest Expense\nThe following table presents the interest expense on our outstanding debt which is a component of Interest expense in our Consolidated Statements of Income:\nYears Ended August 31,\n(in thousands)\n \n2025\n2024\n2023\nInterest expense on outstanding debt\n(1)\n$\n57,749\n \n$\n65,412\n \n$\n66,283\n \n (1) Interest expense on our outstanding debt includes the related amortization of debt issuance costs and debt discounts. Interest expense is net of the effects of our interest rate swap agreements.\n12. \nCOMMITMENTS AND CONTINGENCIES\nCommitments represent obligations, such as those for future purchases of goods or services that are not yet recorded on the balance sheet as liabilities. We record liabilities for commitments when incurred (i.e., when the goods or services are received). \n84\nTable of Contents\nExcept for income tax contingencies, we accrue for contingencies when we believe that a loss is probable and the amount can be reasonably estimated. Judgment is required to determine both the probability and the estimated amount of loss. If the reasonable estimate of a probable loss is a range, we record an accrual for the most probable estimate of the loss or the minimum amount when no amount within the range is a better estimate than any other amount. We review these accruals on a quarterly basis and adjust, as necessary, to reflect the impact of negotiations, settlements, rulings, advice of legal counsel and other current information. Contingent gains are recognized only when realized. \nIncome tax contingencies related to uncertain tax positions are accounted for in accordance with applicable accounting guidance. Refer to Note 2, \nSummary of Significant Accounting Policies - Income Taxes\n for further details. \nPurchase Commitments with Suppliers and Vendors\nPurchase obligations represent our legally-binding agreements to purchase fixed or minimum quantities at determinable prices. As of August 31, 2025 and 2024, we had total purchase obligations with suppliers and vendors of approximately $\n352\n million and $\n383\n million, respectively. Our total purchase obligations as of August 31, 2025 and 2024 primarily related to hosting services, acquisition of data and, to a lesser extent, third-party software providers. \nWe also have contractual obligations related to our lease liabilities and outstanding debt. Refer to Note 10, \nLeases\n and Note 11, \nDebt,\n for information regarding our lease commitments and outstanding debt obligations, respectively. \nLetters of Credit\nFrom time to time, we are required to obtain letters of credit in the ordinary course of business. Our 2025 Revolving Facility allows for the availability of up to $\n100.0\n million in the form of letters of credit. We have not obtained any letters of credit under the 2025 Revolving Facility since its inception. As of August 31, 2025 and 2024, we had $\n0.7\n million and $\n0.4\n million of standby letters of credit outstanding, respectively. No liabilities related to these arrangements are reflected in the Consolidated Balance Sheets. \nRefer to Note 11, \nDebt,\n for information regarding the 2025 Revolving Facility. \nContingencies\nLegal Matters\nIn the normal course of our business, we are, or may be, engaged in various legal proceedings, claims, litigation and regulatory proceedings. In view of the uncertainty inherent in litigation and regulatory matters, we cannot predict the eventual outcome of such matters or the timing of their resolution, or in most cases reasonably estimate what the eventual judgments, damages, fines, penalties or impact of activity (if any) restrictions may be. While we cannot predict the outcome of these matters, based on information available at August 31, 2025, our management believes that the ultimate outcome of these unresolved matters against us, individually or in the aggregate, will not have a material adverse effect on our consolidated financial position, our results of operations or our cash flows.\nIncome Taxes\nAs a multinational company operating in many states and countries, we are routinely audited by various taxing authorities and have reserved for potential adjustments to our provision for income taxes that may result from examinations by, or any negotiated settlements with, these tax authorities. We believe that the final outcome of these examinations or settlements will not have a material effect on our consolidated financial position, results of operations or our cash flows. If events occur which indicate payment of these amounts is unnecessary, the reversal of the liabilities would result in the recognition of tax benefits in the period we determine the liabilities are no longer necessary. If our estimates of the federal, state and foreign income tax liabilities are less than the ultimate assessment, additional expense would result.\nSales Tax Matters\nDuring August 2019 through February 2024, we received various assessment and audit notices from the Commonwealth of Massachusetts Department of Revenue (the \"Commonwealth\") with respect to sales taxes, interest and underpayment penalties relating to the tax periods from January 1, 2006 through December 31, 2023 (\"Sales Tax Dispute\"). We entered into an agreement with the Commonwealth on November 26, 2024 which fully resolved all matters relating to the Sales Tax Dispute.\n85\nTable of Contents\nDuring the first quarter of fiscal 2025 and the fourth quarter of fiscal 2024, we took charges of approximately $\n2.4\n million and $\n54.0\n million, respectively, related to this dispute and made corresponding payments of $\n56.4\n million to the Commonwealth during the first quarter of fiscal 2025. In addition to reserves taken in prior fiscal years, this brought our total charge and cash payments with respect to this matter to approximately $\n66.2\n million.\n \n13. \nSTOCKHOLDERS' EQUITY\nThe following table presents the shares of common stock repurchased under our share repurchase program and acquired from holders of our stock-based awards upon vesting to satisfy tax withholding requirements:\nShare Repurchases\n(in thousands, except share data)\nYears Ended August 31, \n2025\n2024\n2023\nRepurchases of common stock under the share repurchase program\n684,960\n \n537,800\n \n430,350\n \nTotal cost of common stock repurchased under the share repurchase program\n(1)\n$\n300,457\n \n$\n235,235\n \n$\n176,720\n \nRepurchases of common stock to satisfy tax withholding requirements due upon vesting of stock-based awards\n35,791\n \n37,589\n \n32,444\n \nTotal cost of repurchases of common stock to satisfy withholding requirements due upon vesting of stock-based awards\n$\n16,242\n \n$\n16,659\n \n$\n13,710\n \n(1) For fiscal 2025, 2024, and 2023, amount excludes a 1% excise tax of $\n3.0\n million, $\n1.7\n million and $\n0.9\n million, respectively, on corporate stock repurchases required under the Inflation Reduction Act of 2022.\n \nWe may repurchase shares of our common stock under our share repurchase program from time-to-time in the open market or via privately negotiated transactions, subject to market conditions. We suspended our share repurchase program beginning in the second quarter of fiscal 2022, with the exception of potential minor repurchases to offset dilution from grants of equity awards or repurchases to satisfy withholding tax obligations due upon the vesting of stock-based awards, to prioritize the repayment of debt under the 2022 Credit Facilities. We resumed our share repurchase program in the third quarter of fiscal 2023.\nThere is no defined number of shares to be repurchased over a specified timeframe through the life of our share repurchase program. On September 17, 2024, our Board of Directors authorized up to $\n300\n million for share repurchases during fiscal 2025. This authorization expired upon the conclusion of fiscal 2025 and was not available for share repurchases after that date. \nOn June 17, 2025, our Board of Directors authorized up to $\n400\n million for share repurchases on or after September 1, 2025 through September 30, 2026. \nIn addition to our share repurchase program, we also acquire shares of our common stock from holders of our stock-based awards to satisfy withholding tax requirements due at vesting. Shares acquired from these holders do not reduce the amount authorized for repurchase under the share repurchase program.\nRefer to Part II, Item 5. \nMarket For Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\n, of this Annual Report on Form 10-K for further discussion on our share repurchase program.\nEquity-based Awards\nRefer to Note 15, \nStock-Based Compensation,\n for more information on equity awards issued during fiscal 2023 through fiscal 2025. \n86\nTable of Contents\nDividends\nOur Board of Directors approved the following dividends: \nYear Ended\nDividends per\nShare of\nCommon Stock\nRecord Date\nTotal Amount\n(in thousands)\nPayment Date\nFiscal 2025\nFirst Quarter\n$\n1.04\n \nNovember 29, 2024\n$\n39,572\n \nDecember 19, 2024\nSecond Quarter\n$\n1.04\n \nFebruary 28, 2025\n39,511\n \nMarch 20, 2025\nThird Quarter\n$\n1.10\n \nMay 30, 2025\n41,644\n \nJune 18, 2025\nFourth Quarter\n$\n1.10\n \nAugust 29, 2025\n41,410\n \nSeptember 18, 2025\nTotal Dividends\n$\n162,137\n \nFiscal 2024\nFirst Quarter\n$\n0.98\n \nNovember 30, 2023\n$\n37,299\n \nDecember 21, 2023\nSecond Quarter\n$\n0.98\n \nFebruary 29, 2024\n37,360\n \nMarch 21, 2024\nThird Quarter\n$\n1.04\n \nMay 31, 2024\n39,589\n \nJune 20, 2024\nFourth Quarter\n$\n1.04\n \nAugust 30, 2024\n39,470\n \nSeptember 19, 2024\nTotal Dividends\n$\n153,718\n \nFiscal 2023\nFirst Quarter\n$\n0.89\n \nNovember 30, 2022\n$\n34,010\n \nDecember 15, 2022\nSecond Quarter\n$\n0.89\n \nFebruary 28, 2023\n34,099\n \nMarch 16, 2023\nThird Quarter\n$\n0.98\n \nMay 31, 2023\n37,442\n \nJune 15, 2023\nFourth Quarter\n$\n0.98\n \nAugust 31, 2023\n37,265\n \nSeptember 21, 2023\nTotal Dividends\n$\n142,816\n \nIn the third quarter of fiscal 2025, our Board of Directors approved a \n6\n% increase in the regular quarterly dividend from $\n1.04\n to $\n1.10\n per share. Future cash dividend payments are subject to final determination by our Board of Directors and will depend on our earnings, capital requirements, financial condition and other relevant factors.\nAccumulated Other Comprehensive Loss\nThe components of AOCL as of August 31, 2025 and August 31, 2024 were as follows:\n(in thousands)\nAugust 31, 2025\nAugust 31, 2024\nAccumulated unrealized gains (losses) on cash flow hedges, net of tax\n$\n2,143\n \n$\n1,843\n \nAccumulated foreign currency translation adjustments\n(\n65,891\n)\n(\n81,456\n)\nTotal AOCL\n$\n(\n63,748\n)\n$\n(\n79,613\n)\n14. \nEARNINGS PER SHARE\nBasic earnings per common share (\"Basic EPS\") is computed by dividing net income by the number of weighted average common shares outstanding during the fiscal year. Diluted earnings per common share (\"Diluted EPS\") is calculated by using the treasury stock method which assumes the issuance of common stock for all potentially dilutive stock-based awards.\n87\nTable of Contents\nThe following is a reconciliation of our Basic and Diluted EPS computations:\nYears Ended August 31,\n(in thousands, except per share data)\n2025\n2024\n2023\nNumerator\nNet income used for calculating Basic EPS and Diluted EPS\n$\n597,040\n \n$\n537,126\n \n$\n468,173\n \nDenominator\nWeighted average common shares used in the calculation of Basic EPS\n37,924\n \n38,059\n \n38,194\n \nCommon stock equivalents associated with stock-based compensation plans\n461\n \n559\n \n704\n \nShares used in the calculation of Diluted EPS\n38,385\n \n38,618\n \n38,898\n \nBasic EPS\n$\n15.74\n \n$\n14.11\n \n$\n12.26\n \nDiluted EPS\n$\n15.55\n \n$\n13.91\n \n$\n12.04\n \nThe following table presents the potential common shares that were excluded from Diluted EPS as they relate to stock-based awards that were antidilutive or subject to performance conditions which have not been satisfied by the end of each fiscal year:\nYears Ended August 31,\n(in thousands)\n2025\n2024\n2023\nStock options\n791\n \n381\n \n566\n \nRestricted Stock Awards\n87\n \n88\n \n59\n \n15. \nSTOCK-BASED COMPENSATION\nOur stock-based compensation expense consists of stock options, RSUs, PSUs and purchases of common stock under the ESPP.\nStock-based Compensation Expense\nThe following table presents the stock-based compensation expense for the fiscal years presented:\nYears Ended August 31,\n(in thousands)\n \n2025\n2024\n2023\nStock-based compensation expense\n$\n61,229\n \n$\n63,501\n \n$\n62,038\n \nThere were \nno\n stock-based compensation costs capitalized during fiscal 2023 through fiscal 2025. As of August 31, 2025, $\n119.3\n million of total unrecognized stock-based compensation expense related to non-vested stock-based awards is expected to be recognized over the remaining weighted average vesting period of \n2.9\n years.\n88\nTable of Contents\nStock Option Awards\nA summary of stock option activity is as follows:\nNumber Outstanding \n(thousands)\nWeighted Average\nExercise Price Per Share\nWeighted Average Grant Date Fair Value\nAggregate Intrinsic Value \n(millions)\n(1)\nWeighted Average Remaining Contractual Life \n(years)\nOutstanding as of August 31, 2022\n2,089\n \n$\n253.85\n \nGranted – employees\n268\n \n$\n426.22\n \n$\n125.57\n \nGranted – non-employee directors\n5\n \n$\n428.70\n \n$\n128.84\n \nExercised\n(2)\n(\n318\n)\n$\n181.67\n \nForfeited\n(\n56\n)\n$\n373.04\n \nOutstanding as of August 31, 2023\n1,988\n \n$\n285.95\n \nGranted – employees\n243\n \n$\n436.61\n \n$\n132.59\n \nGranted – non-employee directors\n6\n \n$\n462.23\n \n$\n132.78\n \nExercised\n(2)\n(\n376\n)\n$\n213.62\n \nForfeited\n(\n38\n)\n$\n404.47\n \nOutstanding as of August 31, 2024\n1,823\n \n$\n319.07\n \nGranted – employees\n203\n \n$\n459.17\n \n$\n133.21\n \nGranted – non-employee directors\n6\n \n$\n453.98\n \n$\n144.90\n \nExercised\n(2)\n(\n300\n)\n$\n239.69\n \nForfeited\n(\n47\n)\n$\n427.76\n \nOutstanding as of August 31, 2025\n1,685\n \n(3)\n$\n347.50\n \n$\n101.1\n \n5.6\nOptions vested and exercisable as of August 31, 2025\n1,018\n \n$\n293.48\n \n$\n97.7\n \n4.2\nOptions expected to vest as of August 31, 2025\n615\n \n$\n428.64\n \n$\n3.4\n \n7.6\n(1)\nThe aggregate intrinsic value represents the difference between our closing stock price as of August 29, 2025 of $\n373.32\n and the exercise price, multiplied by the number of options exercisable as of that date. \n(2)\nThe total pre-tax intrinsic value of stock options exercised during fiscal 2025, 2024 and 2023 was $\n66.5\n million, $\n89.5\n million and $\n77.5\n million, respectively.\n(3)\nAs of August 31, 2025, \n1,685,011\n shares underlying the stock option awards were unvested and outstanding, resulting in unamortized stock-based compensation expense of $\n48.4\n million that is expected to be recognized over the remaining weighted average vesting period of \n2.9\n years.\nDuring fiscal 2025, 2024 and 2023, the total fair value of stock options vested was $\n23.2\n million, $\n20.5\n million and $\n18.9\n million, respectively.\nEmployee Stock Option Awards\nOur annual grant of employee stock options during the first quarter of each fiscal year makes up the majority of our employee stock options granted under the LTIP in each fiscal year.\nThe following table presents the weighted average inputs used in the binomial model to estimate the grant-date fair value of the employee stock options granted:\n2025\n2024\n2023\nStock options granted\n(1)\n203,114\n243,379\n268,185\nRisk-free interest rate\n4.31\n% - \n4.87\n%\n3.78\n% - \n5.53\n%\n3.37\n% - \n5.05\n%\nExpected life (years)\n6.6\n6.6\n6.6\nExpected volatility\n23\n% - \n25\n%\n19\n% - \n25\n%\n24\n% - \n25\n%\nDividend yield\n0.95\n \n%\n0.90\n \n%\n0.83\n \n%\n(1) Includes the annual employee grant on November 1, 2024, November 1, 2023 and November 1, 2022 of \n200,693\n, \n242,371\n and \n266,051\n stock options, respectively. The majority of the stock options granted, including the annual employee grants, vest \n20\n% annually on the anniversary date of the grant and are fully vested after \nfive years\n, expiring \nten years\n from the date of grant.\n \n89\nTable of Contents\nRestricted Stock Awards\nA summary of Restricted Stock Award activity is as follows:\n(in thousands, except per award data)\nNumber Outstanding\nWeighted Average Grant\nDate Fair Value Per Award\nBalance at August 31, 2022\n233\n \n$\n338.87\n \nGranted – employee Restricted Stock Awards\n(1)\n97\n \n$\n416.58\n \nPerformance adjustment – employee PSUs\n(2)\n9\n \n$\n245.67\n \nGranted – non-employee directors RSUs\n2\n \n$\n425.06\n \nVested\n(4)\n(\n83\n)\n$\n291.80\n \nForfeited\n(\n14\n)\n$\n369.71\n \nBalance at August 31, 2023\n244\n \n$\n381.15\n \nGranted – employee Restricted Stock Awards\n(1)\n111\n \n$\n423.57\n \nPerformance adjustment – employee PSUs\n(2)\n14\n \n$\n306.33\n \nGranted – non-employee directors RSUs\n2\n \n$\n458.23\n \nVested\n(4)\n(\n95\n)\n$\n330.00\n \nForfeited\n(\n14\n)\n$\n405.37\n \nBalance at August 31, 2024\n262\n \n$\n412.47\n \nGranted – employee Restricted Stock Awards\n(1)\n127\n \n$\n444.30\n \nPerformance adjustment – employee PSUs\n(2)\n7\n \n$\n424.01\n \nGranted – non-employee directors RSUs\n3\n \n$\n449.72\n \nVested\n(4)\n(\n89\n)\n$\n403.43\n \nForfeited\n(\n17\n)\n$\n420.83\n \nOutstanding as of August 31, 2025\n293\n \n(3)\n$\n429.19\n \n(1)\nDuring fiscal 2025, 2024 and 2023, we granted \n92,840\n RSUs and \n34,479\n PSUs; \n74,456\n RSUs and \n37,008\n PSUs; and \n63,009\n RSUs and \n34,482\n PSUs, respectively. \n(2)\nAdditional PSUs were granted during fiscal 2025, 2024 and 2023 based on performance above the specified target level of achievement for PSUs granted on November 1, 2021, November 9, 2020 and November 1, 2019, respectively.\n(3)\nAs of August 31, 2025, \n292,716\n shares underlying the Restricted Stock Awards were unvested and outstanding, which resulted in unamortized stock-based compensation expense of $\n70.9\n million that is expected to be recognized over the remaining weighted average vesting period of \n2.9\n years.\n(4)\nDuring fiscal 2025, 2024 and 2023, the total fair value of RSUs vested was $\n21.7\n million, $\n17.7\n million and $\n14.5\n million, respectively, and for PSUs vested was $\n14.4\n million, $\n13.6\n million and $\n9.8\n million, respectively.\n \nEmployee Restricted Stock Awards\nOur annual grant of employee Restricted Stock Awards during the first quarter of each fiscal year makes up the majority of our employee Restricted Stock Awards granted under the LTIP in each fiscal year. These awards entitle the holders to shares of common stock as the Restricted Stock Awards vest. For unvested Restricted Stock Awards, holders are not entitled to dividends declared on the underlying shares. \nThe majority of the RSUs granted vest \n20\n% annually on the anniversary date of the grant and are fully vested after \nfive years\n. The majority of the PSUs granted cliff vest on the third anniversary of the grant date. The ultimate number of common shares that may be earned pursuant to our PSU awards depends on the level of our achievement of stated financial performance objectives. The achievement range was \n0\n% to \n200\n% for the November 1, 2024 and November 1, 2023 annual grants and \n0\n% to \n150\n% for the November 1, 2022 annual grant.\nStock-based Awards Available for Grant\nAs of August 31, 2025, we had \n3.3\n million employee stock-based awards available for grant under the LTIP and \n0.2\n million non-employee director stock-based awards available for grant under the Director Plan.\nIn accordance with the LTIP and Director Plan, each Restricted Stock Award granted or canceled/forfeited is equivalent to \n2.5\n shares deducted from or added back to, respectively, the aggregate number of stock-based awards available for grant.\n90\nTable of Contents\n16. \nEMPLOYEE BENEFIT PLANS\nDefined Contribution Plan\nOur 401(k) Plan is a defined contribution plan covering all full-time, U.S. employees of FactSet and is subject to the provisions of the Employee Retirement Income Security Act of 1974 and the Code. Each year, participants may contribute up to \n60\n% of their eligible annual compensation, subject to annual limitations established by the Code. We match up to \n4\n% of employees’ earnings, capped at the Internal Revenue Service annual maximum. Company matching contributions are subject to a \nfive-year\n graduated vesting schedule. All full-time, U.S. employees are eligible for the matching contribution by FactSet. We contributed $\n14.8\n million, $\n14.2\n million and $\n16.6\n million in matching contributions to employee 401(k) accounts during fiscal 2025, 2024 and 2023, respectively.\n17. \nSEGMENT INFORMATION\nOperating segments are defined as components of an enterprise that have the following characteristics: (i) they engage in business activities from which they may earn revenue and incur expense, (ii) their operating results are regularly reviewed by the chief operating decision maker (\"CODM\") for resource allocation decisions and performance assessment, and (iii) their discrete financial information is available. Our Chief Executive Officer functions as our CODM. \nWe have \nthree\n operating segments: Americas, EMEA and Asia Pacific. This is how our CODM manages our business and the geographic markets in which we operate. These operating segments are consistent with our reportable segments. Our CODM uses segment operating income to assess performance and allocate resources to each segment. The CODM compares the actual results of each segment with one another, as well as, to prior periods.\nThe Americas segment primarily sells to clients throughout North, Central, and South America. The EMEA segment primarily sells to clients in Europe, the Middle East, and Africa. The Asia Pacific segment primarily sells to clients in Asia and Australasia. Segment revenues reflect sales to our clients based on the geographic region where the sale originated. \nEach segment records expenses related to its individual operations with the exception of expenditures associated with our data centers, third-party data costs and corporate headquarters charges, which are recorded by the Americas segment and are not allocated to the other segments. The expenses incurred at our global centers of excellence (\"COEs\"), primarily located in India and the Philippines, are allocated to each segment based on their respective percentage of revenues as this reflects the benefits provided by each segment.\nIntercompany revenue and expense amounts have been eliminated within each segment in order to report on the basis that management uses internally for evaluating segment performance.\n91\nTable of Contents\nThe following tables reflect the results of operations of our segments:\n(in thousands)\nYear Ended August 31, 2025\nAmericas\nEMEA\nAsia Pacific\nTotal\nRevenues\n$\n1,506,108\n \n$\n580,284\n \n$\n235,356\n \n$\n2,321,748\n \nOperating expenses\n(1)\n1,200,145\n \n306,282\n \n67,018\n \n1,573,445\n \nOperating income\n$\n305,963\n \n$\n274,002\n \n$\n168,338\n \n$\n748,303\n \nTotal other income (expense), net\n(\n27,345\n)\nIncome before income taxes\n$\n720,958\n \nOther segment disclosures\nDepreciation and amortization\n$\n141,961\n \n$\n7,857\n \n$\n7,873\n \n$\n157,691\n \nStock-based compensation\n$\n47,441\n \n$\n9,182\n \n$\n4,606\n \n$\n61,229\n \nCapital expenditures\n(2)\n$\n95,581\n \n$\n5,924\n \n$\n7,301\n \n$\n108,806\n \nYear Ended August 31, 2024\nAmericas\nEMEA\nAsia Pacific\nTotal\nRevenues\n$\n1,419,901\n \n$\n563,128\n \n$\n220,027\n \n$\n2,203,056\n \nOperating expenses\n(1)\n1,158,111\n \n280,165\n \n63,481\n \n1,501,757\n \nOperating income\n$\n261,790\n \n$\n282,963\n \n$\n156,546\n \n$\n701,299\n \nTotal other income (expense), net\n(\n49,796\n)\nIncome before income taxes\n$\n651,503\n \nOther segment disclosures\nDepreciation and amortization\n$\n110,147\n \n$\n7,171\n \n$\n7,869\n \n$\n125,187\n \nStock-based compensation\n$\n51,601\n \n$\n8,007\n \n$\n3,893\n \n$\n63,501\n \nCapital expenditures\n(2)\n$\n77,417\n \n$\n3,835\n \n$\n4,429\n \n$\n85,681\n \nYear Ended August 31, 2023\nAmericas\nEMEA\nAsia Pacific\nTotal\nRevenues\n$\n1,335,484\n \n$\n539,843\n \n$\n210,181\n \n$\n2,085,508\n \nOperating expenses\n(1)\n1,096,046\n \n296,815\n \n63,440\n \n1,456,301\n \nOperating income\n$\n239,438\n \n$\n243,028\n \n$\n146,741\n \n$\n629,207\n \nTotal other income (expense), net\n(\n45,253\n)\nIncome before income taxes\n$\n583,954\n \nOther segment disclosures\nDepreciation and amortization\n$\n89,602\n \n$\n7,305\n \n$\n8,477\n \n$\n105,384\n \nStock-based compensation\n$\n51,574\n \n$\n7,280\n \n$\n3,184\n \n$\n62,038\n \nCapital expenditures\n(2)\n$\n54,609\n \n$\n2,317\n \n$\n3,860\n \n$\n60,786\n \n(1)\nOperating expenses consist of Cost of services and SG&A costs.\n(2)\nCapital expenditures include purchases of PPE and capitalized internal-use software.\n92\nTable of Contents\nSegment Total Assets\nThe following table reflects the total assets for our segments:\nAs of August 31, \n(in thousands)\n2025\n2024\n2023\nSegment Assets\nAmericas\n$\n3,523,467\n \n$\n3,178,800\n \n$\n3,148,192\n \nEMEA\n610,364\n \n600,206\n \n558,393\n \nAsia Pacific\n170,441\n \n276,034\n \n256,337\n \nTotal assets\n$\n4,304,272\n \n$\n4,055,040\n \n$\n3,962,922\n \nGeographic Information\nThe following tables reflect our revenues and long-lived assets, split geographically by our country of domicile (the United States) and other countries where major subsidiaries are domiciled.\nGeographic Revenues\nThe following table sets forth revenues by geography, attributed to countries based on the location of the client:\n(in thousands)\nYears ended August 31,\n2025\n2024\n2023\nRevenues\nUnited States\n$\n1,415,864\n \n$\n1,340,350\n \n$\n1,265,002\n \nUnited Kingdom\n231,009\n \n221,850\n \n223,809\n \nOther European Countries\n349,275\n \n341,278\n \n316,034\n \nAll Other Countries\n325,600\n \n299,578\n \n280,663\n \nTotal revenues\n$\n2,321,748\n \n$\n2,203,056\n \n$\n2,085,508\n \nGeographic Long-Lived Assets\nThe following table sets forth long-lived assets by geographic area. Long-lived assets consist of PPE, net and Lease ROU assets, net and excludes goodwill, intangible assets, deferred taxes and other assets.\n(in thousands)\nAugust 31, \n2025\n2024\nLong-lived Assets\nUnited States\n$\n103,545\n \n$\n108,208\n \nPhilippines\n38,572\n \n46,191\n \nIndia\n19,482\n \n22,159\n \nUnited Kingdom\n16,869\n \n10,243\n \nAll Other Countries\n28,511\n \n26,206\n \nTotal long-lived assets\n$\n206,979\n \n$\n213,007\n \nITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.\nITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nOur management, including our Principal Executive Officer and Principal Financial Officer, have evaluated the effectiveness of our disclosure controls and procedures pursuant to Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, \n93\nTable of Contents\nas amended (the \"Exchange Act\"), as of the end of the annual period covered by this report. In accordance with the guidance issued by the Securities and Exchange Commission, companies are permitted to exclude acquisitions from their first assessment of internal control over financial reporting following the date of acquisition. Excluding goodwill and intangible assets, Irwin and LiquidityBook represented a combined 2% of our Total assets as of August 31, 2025 and 1% of our consolidated Revenues for fiscal year 2025.\nOur Principal Executive Officer and Principal Financial Officer have concluded that our disclosure controls and procedures were not effective as of the end of the annual period covered by this report due to a material weakness in internal control over financial reporting. This conclusion is due to a material weakness identified in the operation of certain key IT general controls. The material weakness is described below and represents a continuation of a sub-set of the control deficiencies which gave rise to the initial material weakness identified in management’s evaluation of our control environment as of August 31, 2024. \nContinuation of Previously Reported Material Weakness \nAs reported in Part II, Item 9A. “Controls and Procedures” of our Annual Report on Form 10-K for the fiscal year ended August 31, 2024, we had identified a material weakness in the design and operation of IT general controls that support our revenues, accounts receivable, and deferred revenues processes which, in the aggregate, gave rise to a material weakness in internal control over financial reporting. While we have made significant progress remediating those control deficiencies, there remains certain deficiencies related to program change management and monitoring and user access in connection with segregation of duties and restrictions to appropriate users.\n \nAs a result, the automated controls and IT dependent manual business process controls that rely upon information from the affected financial applications were deemed not effective. A material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of a company’s annual or interim financial statements will not be prevented or detected on a timely basis.\nAs a result of the identification of the material weakness, we performed further analysis and completed additional procedures intended to ensure our consolidated financial statements for the years ended August 31, 2025, 2024, and 2023 fairly present in all material respects the financial condition, results of operations and cash flows of the Company and have been prepared in accordance GAAP. Based on these procedures and analysis, after giving full consideration to the material weakness, our management has concluded that our Consolidated Financial Statements present fairly, in all material respects, our financial position, results of operations and cash flows for the periods disclosed in conformity with GAAP. \nRemediation Efforts\nDuring fiscal 2025, management made significant progress in enhancing the Company’s IT general controls to remediate the IT general control material weakness, however this effort remains ongoing. With the oversight of the Audit Committee of our Board of Directors, we have implemented remediation efforts to address the material weakness and enhance our IT general controls that support our revenues, accounts receivable, and deferred revenues processes. Our remediation efforts included:\n•\nStrengthening the control environment by implementing controls that increase the frequency and effectiveness of user management and change management, including improved logging and segregation of duties capabilities.\n•\nEngaging a leading third-party accounting advisory firm, with appropriate internal control expertise and experience, to help evaluate the design of our controls as well as to assist with the documentation, remediation, and related controls testing. \n•\nManagement also worked with the accounting advisory firm to revise the Company’s IT Risk and Control Matrix and to re-design certain controls around manage change and manage access to address the design deficiencies from the prior year.\n•\nHired additional key IT compliance personnel and a global head of internal audit. \n•\nTrained relevant personnel on the design and operation of our IT general controls over financial reporting.\nWhile these efforts have resulted in significant progress toward remediating the material weakness, certain deficiencies remain, which management is committed to remediating. Our remediation plans include:\n•\nEnhancing the precision and documentation of the change monitoring and segregation of duties review controls through additional training and formalized standard operating procedures.\n•\nPerforming additional testing of the change monitoring and segregation of duties review controls to demonstrate the sustainability and repeatability of control operating effectiveness.\n•\nImplementing technology solutions to enhance the control framework for supporting change monitoring, segregation of duties and access management review controls.\n94\nTable of Contents\n•\nContinuing to utilize an expert third-party accounting advisory firm to evaluate the design of our controls as well as to assist with the documentation, remediation and associated testing.\nAdditional or modified measures may also be required to remediate the material weakness. We will not be able to conclude that we have completely remediated the material weakness until the applicable controls are fully implemented and have operated for a sufficient period of time and management has concluded, through formal testing, that the remediated controls are operating effectively. We expect to complete these remediation measures as early as practicable in fiscal 2026. We will continue to monitor the design and effectiveness of these and other processes, procedures, and controls and make any further changes management deems appropriate. We regularly report to the Audit Committee on our progress and will continue to do so in fiscal 2026.\nInherent Limitations of Internal Controls over Financial Reporting\nNo system of controls, no matter how well designed and operated, can provide absolute assurance that the objectives of the system of controls will be met, and no evaluation of controls can provide absolute assurance that all control deficiencies or material weaknesses have been or will be detected. There is no assurance that our remediation efforts will be fully effective. If these remediation efforts do not prove effective and control deficiencies and material weaknesses persist or occur in the future, the accuracy and timing of our financial reporting may be adversely affected.\nChanges in Internal Control Over Financial Reporting\nOther than the ongoing remediation plans described above, there were no changes in the Company’s internal control over financial reporting (as such term is defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) during the fourth quarter of fiscal 2025 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nManagement’s Report on Internal Control Over Financial Reporting\nSee Part II, Item 8. \nManagement’s Report on Internal Control Over Financial Reporting\n of this Annual Report on Form 10-K, which is incorporated herein by reference.\nReport of Independent Registered Public Accounting Firm\nSee Part II, Item 8. \nReport of Independent Registered Public Accounting Firm\n of this Annual Report on Form 10-K, which is incorporated herein by reference.\nITEM 9B. OTHER INFORMATION\nRule 10b5-1 Trading Plans\nNone of our directors or officers (as defined in Section 16 of the Securities Exchange Act of 1934, as amended), \nadopted\n or \nterminated\n a Rule 10b5-1 trading arrangement or a non-Rule 10b5-1 trading arrangement (each as defined in Item 408(a) and (c) of Regulation S-K) during the quarter ended August 31, 2025.\n95\nTable of Contents\nPart III\nITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information required to be furnished by this Item 10 is incorporated herein by reference to our Notice of Annual Meeting of Stockholders and Proxy Statement to be filed within 120 days of August 31, 2025 (the \"Proxy Statement\").\nPursuant to General Instruction G(3) of Form 10-K, the information required by this item relating to our executive officers is included in Part I, Item 1. \nBusiness - Executive Officers of the Registrant\n of this Annual Report on Form 10-K.\nITEM 11. EXECUTIVE COMPENSATION\nThe information required to be furnished by this Item 11 is incorporated herein by reference to our Proxy Statement.\nITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required to be furnished by this Item 12 is incorporated herein by reference to our Proxy Statement.\nEquity Compensation Plan Information\nThe following table summarizes, as of August 31, 2025, the number of outstanding equity awards granted to employees and non-employee directors, as well as the number of equity awards remaining available for future issuance, under our equity compensation plans:\nPlan category\nNumber of securities\nto be issued upon exercise\nof outstanding options, warrants and rights \n(a)\nWeighted-average\nexercise price of\noutstanding options, warrants and rights\n(b)\nNumber of securities remaining\navailable for future issuances under\nequity compensation plans (excluding\nsecurities reflected in column (a))\n(c)\n(3)\nEquity compensation plans approved by security holders\n1,977,727 \n(1)\n$\n347.50 \n(2)\n3,492,745 \n(4)\nEquity compensation plans not approved by security holders\n— \n— \n— \nTotal\n1,977,727 \n(1)\n$\n347.50 \n(2)\n3,492,745 \n(4)\n(1)\nIncludes 1,685,011 shares issuable upon exercise of outstanding options, 201,226 shares issuable upon vesting of outstanding RSUs and 91,490 shares issuable upon the conversion of outstanding PSUs.\n(2)\nWeighted average exercise price of outstanding options only.\n(3)\nIn accordance with the LTIP and Director Plan, each Restricted Stock Award granted or canceled/forfeited is equivalent to 2.5 shares deducted from or added back to, respectively, the aggregate number of stock-based awards available for grant.\n(4)\nIncludes 3,294,837 shares available for future issuance under the LTIP and 197,908 shares available for future issuance under the Director Plan.\nITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required to be furnished by this Item 13 is incorporated herein by reference to our Proxy Statement.\nITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nThe information required to be furnished by this Item 14 is incorporated herein by reference to our Proxy Statement.\n96\nTable of Contents\nPart IV\nITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES\n(a)\nDocuments filed as part of this Annual Report on Form 10-K:\n1.\nFinancial Statements\nThe information required by this item is included in Item 8. \nFinancial Statements and Supplementary Data\n, of this Annual Report on Form 10-K which is incorporated herein.\n2.\nFinancial Statements Schedule\nFactSet Research Systems Inc.\nSchedule II – Valuation and Qualifying Accounts\n(in thousands)\nDescription\nBalance at Beginning of Year\nCharged to Expense\nWrite-offs,\nNet of Recoveries\nBalance at\nEnd of Year\nAccounts Receivable Allowance:\n2025\n$\n14,581\n \n$\n4,973\n \n$\n(\n5,765\n)\n$\n13,789\n \n2024\n$\n7,769\n \n$\n7,420\n \n$\n(\n608\n)\n$\n14,581\n \n2023\n$\n2,776\n \n$\n6,668\n \n$\n(\n1,675\n)\n$\n7,769\n \nAdditional financial statement schedules are omitted since they are either not required, not applicable, or the information is otherwise included in the Consolidated Financial Statements or notes thereto included in this Annual Report on Form 10-K.\n3.\nExhibits\nThe information required by this Item is set forth below.\nIncorporated by Reference\nExhibit\nNumber\nExhibit\nDescription\nForm\nFile No.\nExhibit No.\nFiling Date\nFiled\nHerewith\n3.1\nFactSet Research Systems Inc. Second Amended and Restated Articles of Incorporation\n8-K\n001-11869\n3.1\n1/10/2023\n3.2\nFactSet Research Systems Inc. Amended and Restated By-Laws\n8-K\n001-11869\n3.2\n9/18/2025\n4.0\nForm of Common Stock\nS-1/A\n333-04238\n4.1\n6/26/1996\n4.1\nIndenture, dated as of March 1, 2022, between FactSet Research Systems Inc. and U.S. Bank Trust Company, National Association, as trustee\n8-K\n001-11869\n4.1\n3/1/2022\n4.2\nSupplemental Indenture, dated as of March 1, 2022, between FactSet Research Systems Inc. and U.S. Bank Trust Company, National Association, as trustee\n8-K\n001-11869\n4.2\n3/1/2022\n4.3\nForm of 2.900% Global Note due 2027 (included in Exhibit A-1 to Exhibit 4.2 above)\n8-K\n001-11869\n4.3\n3/1/2022\n4.4\nForm of 3.450% Global Note due 2032 (included in Exhibit A-2 to Exhibit 4.2 above)\n8-K\n001-11869\n4.4\n3/1/2022\n97\nTable of Contents\n10.1\nFactSet Research Systems Inc. 2004 Employee Stock Option and Award Plan\n(1)\nDEF-14A\n001-11869\nExhibit A\n11/10/2004\n10.2\nFactSet Research Systems Inc. 2004 Stock Option and Award Plan, as Amended and Restated\n(1)\nDEFR-14A\n001-11869\nAppendix A\n12/6/2010\n10.3\nFactSet Research Systems Inc. Stock Option and Award Plan as Amended and Restated\n(1)\n8-K\n001-11869\n10.1\n12/21/2017\n10.4\nFactSet Research Systems Inc. 2008 Non-Employee Directors’ Stock Option Plan\n(1)\nDEF-14A\n001-11869\nAppendix A\n10/30/2008\n10.5\nFactSet Research Systems Inc. Non-Employee Directors’ Stock Option and Award Plan, as Amended and Restated\n(1)\n8-K\n001-11869\n10.2\n12/21/2017\n10.6\nLease, dated February 14, 2018, between FactSet Research Systems Inc. and 45 Glover Partners, LLC\n(2)\n10-Q\n001-11869\n10.1\n4/9/2018\n10.7\nFactSet Research Systems Inc. Executive Severance Plan\n(1)\n8-K\n001-11869\n10.1\n7/3/2024\n10.8\nForm of FactSet Research Inc. Equity Award Agreement\n(1)\n8-K\n001-11869\n10.2\n3/5/2020\n10.9\nCredit Agreement dated \nA\npril 8, 2025\n, among FactSet Research Systems Inc., the \nb\norrowing \ns\nubsidiaries \nfrom time to time \nparty thereto, the \nl\nenders \nfrom time to time \nparty thereto, and PNC Bank, National Association, as the \na\ndministrative \na\ngent\n8-K\n001-11869\n1.1\n4/8/2025\n10.1\n0\nSeparation Agreement and General Release of Claims by and between FactSet Research Systems Inc. and Linda Huber, dated July 22, 2024\n8-K\n001-11869\n10.1\n7/23/2024\n1\n0.1\n1\nE\nmployment Agreement dated May 28, 2025 between FactSet Research Systems Inc. and Sanoke Vis\nwanathan\n(1)\n10-Q\n001-11869\n10.2\n7/3/2025\n1\n0.12\nF\nactSet Research Systems Inc.\n 2025\n Employee Stock Purchase Plan\nS-8\n333-289143\n99.1\n7/31/2025\n1\n0.\n13\nR\ne\ntirement Agreement and General Release of Claims between FactSet Research Systems Inc. and F. Philip Snow\n(1)\nX\n19\nFactSet Research Systems Inc. Securities and Insider Trading Policy\n10-K\n001-11869\n19\n10/29/2024\n21\nSubsidiaries of FactSet Research Systems Inc.\nX\n23\nConsent of Ernst & Young LLP\nX\n98\nTable of Contents\n31.1\nCertification of the Chief Executive Officer pursuant to Rule 13a-14(a) and Rule 15d-14(a) of the Securities Exchange Act, as amended.\nX\n31.2\nCertification of the Chief Financial Officer pursuant to Rule 13a-14(a) and Rule 15d-14(a) of the Securities Exchange Act, as amended.\nX\n32.1\nCertification of the Chief Executive Officer pursuant to 18 U.S.C. 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nX\n32.2\nCertification of the Chief Financial Officer pursuant to 18 U.S.C. 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nX\n97\nFactSet Research Systems Inc. Incentive Compensation Recoupment Policy\n10-K\n001-11869\n97\n10/27/2023\n101.INS\nXBRL Instance Document\nX\n101.SCH\nXBRL Taxonomy Extension Schema\nX\n101.CAL\nXBRL Taxonomy Extension Calculation Linkbase\nX\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase Document\nX\n101.LAB\nXBRL Taxonomy Extension Label Linkbase\nX\n101.PRE\nXBRL Taxonomy Extension Presentation Linkbase\nX\n104\nCover page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101\nX\n(1)\nIndicates a management contract or compensatory plan or arrangement.\n(2)\nConfidential treatment has been granted for portions of this exhibit.\nITEM 16. FORM 10-K SUMMARY\nNone.\n99\nTable of Contents\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this Report on Form 10-K to be signed on its behalf by the undersigned, thereunto duly authorized.\nFACTSET RESEARCH SYSTEMS INC.\n(Registrant)\nDate: October 22, 2025\n/s/ SANOKE VISWANATHAN\nSanoke Viswanathan\nChief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this Report on Form 10-K has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nName\nTitle\nDate\n/s/ SANOKE VISWANATHAN\nChief Executive Officer and Director \nOctober 22, 2025\nSanoke Viswanathan\n(Principal Executive Officer)\n/s/ HELEN L. SHAN\nExecutive Vice President, Chief Financial Officer\nOctober 22, 2025\nHelen L. Shan\n(Principal Financial Officer) \n/s/ GREGORY T. MOSKOFF\nManaging Director, Controller and Chief Accounting Officer\nOctober 22, 2025\nGregory T. Moskoff\n(Principal Accounting Officer)\n/s/ ROBIN A. ABRAMS\nDirector\nOctober 22, 2025\nRobin A. Abrams\n/s/ SIEW KAI CHOY\nDirector\nOctober 22, 2025\nSiew Kai Choy\n/s/ BARAK EILAM\nDirector\nOctober 22, 2025\nBarak Eilam\n/s/ MALCOLM FRANK \nDirector\nOctober 22, 2025\nMalcolm Frank\n/s/ LAURIE G. HYLTON\nDirector\nOctober 22, 2025\nLaurie G. Hylton\n/s/ JAMES J. MCGONIGLE\nDirector\nOctober 22, 2025\nJames J. McGonigle\n/s/ LEE SHAVEL\nDirector\nOctober 22, 2025\nLee Shavel\n/s/ LAURIE SIEGEL\nDirector\nOctober 22, 2025\nLaurie Siegel\n/s/ MARIA TERESA TEJADA\nDirector\nOctober 22, 2025\nMaria Teresa Tejada\n/s/ ELISHA WIESEL\nDirector\nOctober 22, 2025\nElisha Wiesel\n100"
  }
}