{
  "ticker": "FDX",
  "cik": "0001048911",
  "company_name": "FEDEX CORP",
  "filing_date": "2025-07-21",
  "accession": "0001048911-25-000011",
  "primary_doc": "fdx-20250531.htm",
  "item_sections": {
    "item1": "Item 1. Business\n” for information regarding the ongoing redesign of the Federal Express international air network to improve efficiency and asset utilization.\nAs of May 31, 2025, Federal Express operated approximately 78,000 motorized vehicles in its global network and also conducts certain linehaul and pickup-and-delivery operations primarily with approximately 95,000 motorized vehicles owned or leased by independent service providers. \n-36-\nAircraft Purchase Commitments\nThe following table is a summary of the number and type of aircraft we were committed to purchase as of May 31, 2025, with the year of expected delivery:\nCessna\nSkyCourier 408\nATR 72-600F\nB767F\nB777F\nTotal\n2026\n19 \n3 \n7 \n— \n29 \n2027\n4 \n3 \n— \n5 \n12 \n2028\n— \n4 \n— \n5 \n9 \n2029\n— \n4 \n— \n— \n4 \n2030\n— \n2 \n— \n— \n2 \nThereafter\n— \n— \n— \n— \n— \nTotal\n23 \n16 \n7 \n10 \n56 \nAs of May 31, 2025, we had $590 million in deposits and progress payments on aircraft purchases and other planned aircraft-related transactions. See \nNote 1\n9\n of the accompanying consolidated financial statements for more information about our purchase commitments and options. \n-37-\nSorting and Handling Facilities \nAt May 31, 2025, Federal Express operated the following major air sorting and handling facilities: \nLocation\nAcres\nSquare Feet\nSorting Capacity (per hour)\n(1)\nLessor\nLease Expiration Calendar Year\nPrimary\nMemphis, Tennessee\n953 \n5,058,299 \n484,000 \nMemphis-Shelby County\nAirport Authority\n2036\nNational\nIndianapolis, Indiana\n(2)\n449 \n3,002,925 \n164,000 \nIndianapolis Airport\nAuthority\n2053\nMiami, Florida\n(3)\n35 \n284,809 \n7,000 \nAero Miami FX, LLC\n2041\nRegional\nFort Worth, Texas\n168 \n987,388 \n76,000 \nFort Worth Alliance Airport\nAuthority\n2041\nNewark, New Jersey\n70 \n634,193 \n156,000 \nPort Authority of New York\nand New Jersey\n2030\nOakland, California\n75 \n587,700 \n63,000 \nPort of Oakland\n2036\nGreensboro, N. Carolina\n165 \n595,000 \n23,000 \nPiedmont Triad Airport Authority\n2031\nMetropolitan\nChicago, Illinois\n54 \n481,350 \n24,000 \nCity of Chicago\n2028\nLos Angeles, California\n34 \n305,300 \n23,000 \nCity of Los Angeles\n2025⁽⁴⁾\nAtlanta, Georgia\n35 \n291,525 \n22,600 \nCity of Atlanta\n2030\nInternational\nAnchorage, Alaska\n(5)\n64 \n375,300 \n25,000 \nState of Alaska, \nDepartment of\nTransportation and \nPublic Facilities\n2078\nParis, France\n(6)\n123 \n1,798,368 \n59,000 \nAeroports de Paris\n2048\nCologne, Germany\n(6)\n14 \n731,267 \n17,900 \nCologne Bonn Airport\n2040\nGuangzhou, China\n(7)\n155 \n873,006 \n36,000 \nGuangdong Airport\nManagement Corp.\n2029\nOsaka, Japan\n(7)\n17 \n425,206 \n9,000 \nKansai Airports\n2029\nLiege, Belgium\n(8)\n23 \n1,027,952 \n33,700 \nLiege Airport\n2036\n(1)\nDocuments and packages. \n(2)\nIn addition to U.S. domestic express package and freight shipments, handles certain international express package and freight shipments to and from Europe.\n(3)\nHandles international express package and freight shipments to and from Latin America and the Caribbean.\n(4)\nProperty is held under four separate leases — we continue to renew the leases for the sorting and handling facility on a month-to-month basis while a new lease is being negotiated.\n(5)\nHandles international express package and freight shipments to and from Asia, Europe, and North America. \n(6)\nHandles intra-Europe express package and freight shipments, as well as international express package and freight shipments to and from Europe. \n(7)\nHandles intra-Asia express package and freight shipments, as well as international express package and freight shipments to and from Asia. \n(8)\nHandles intra-Europe express package and freight shipments.\nFederal Express’s primary sorting facility, which serves as the center of its multiple hub-and-spoke system and worldwide air network, is located at the Memphis International Airport. Federal Express’s facilities at the Memphis International Airport also include aircraft hangars, aircraft ramp areas, vehicle parking areas, flight training and fuel facilities, the FedEx Cold Chain Center, administrative offices, and warehouse space. \n-38-\nFederal Express leases these facilities from the Memphis-Shelby County Airport Authority (the “Authority”). The lease obligates Federal Express to maintain and insure the leased property and to pay all related taxes, assessments, and other charges. The lease is subordinate to, and Federal Express’s rights thereunder could be affected by, any future lease or agreement between the Authority and the U.S. government. \nFederal Express has additional major international sorting and freight handling facilities located at Narita Airport in Tokyo and Stansted Airport outside London. Federal Express also has a substantial presence at airports in Hong Kong, Taiwan, and Dubai. A central air hub near Liege, Belgium connects specific large European markets. Additionally, central European road hubs are located in Duiven, The Netherlands and Novara, Italy, respectively. \nAs of May 31, 2025, Federal Express owned or leased approximately 650 facilities for city station operations in the U.S. As of May 31, 2025, Federal Express owned or leased approximately 1,150 additional sorting and distribution centers in the U.S. and 100 sorting and distribution centers in Canada that support its U.S. and Canada surface operations. This included approximately 720 legacy FedEx Ground and 530 legacy FedEx Express facilities. See the “Federal Express Segment — Operations” section of “\nItem 1. Business\n” for information regarding the ongoing consolidation of these operations. The leased facilities have a variety of lease term lengths and are strategically located to cover the geographic area served by the U.S. and Canada surface operations of Federal Express. The facilities range in size from approximately 1,000 to 1,160,000 square feet, with an average size of approximately 124,000 square feet. \nIn addition, over 1,000 city stations are owned or leased throughout Federal Express’s international network. The majority of these leases are for terms of five to ten years. City stations serve as a sorting and distribution center for a particular city or region. We believe that suitable alternative facilities are available in each locale on satisfactory terms, if necessary.\nAdministrative and Other Properties and Facilities \nThe World Headquarters of Federal Express is located in southeastern Shelby County, Tennessee. Federal Express international headquarters are located in Hoofddorp, The Netherlands. Federal Express leases state-of-the-art technology centers in Collierville, Tennessee and Colorado Springs, Colorado. These facilities house personnel responsible for strategic software development and other functions that support FedEx’s technology and e-commerce solutions. \nAs of May 31, 2025, Federal Express had approximately 24,700 Drop Boxes. Federal Express customers can also ship from approximately 24,000 staffed drop-off locations, including FedEx Office stores and FedEx Authorized ShipCenters. Internationally, Federal Express had approximately 14,000 drop-off locations. \nThe FedEx Authorized ShipCenter program offers U.S. domestic and international Federal Express shipping and drop-off services through a network of approximately 5,000 franchised and independent “pack and ship” retail locations. The FedEx OnSite network includes over 15,000 drop-off locations at Walgreens and Dollar General. Additionally, Federal Express has an agreement with Office Depot, Inc. to offer U.S. domestic and international Federal Express shipping and drop-off services at nearly 800 Office Depot and OfficeMax retail locations.\nFedEx Freight Segment\nFedEx Freight’s corporate headquarters are located in Memphis, Tennessee, with some administrative offices in Harrison, Arkansas. As of May 31, 2025, FedEx Freight operated nearly 30,000 motorized vehicles and approximately 355 service centers, which are strategically located to provide service throughout North America. These facilities range in size from approximately 1,000 to 280,000 square feet of office and dock space. \nFedEx Dataworks Operating Segment\nFedEx Dataworks’ corporate headquarters are located in Memphis, Tennessee.\nFedEx Office Operating Segment\nFedEx Office’s corporate headquarters are located in Plano, Texas. As of May 31, 2025, FedEx Office operated approximately 2,000 customer-facing stores and 16 manufacturing plants with expanded print capabilities (traditional electrophotography, digital and traditional offset, large and grand format, and dye sublimation printing), with 14 of the manufacturing plants also housing co-located signs and graphics production operations. Substantially all FedEx Office stores are leased, generally for terms of five to ten years with varying renewal options. FedEx Office operates approximately 200 stores at hotels, convention centers, hospitals, universities, and corporate campuses, with the remainder generally located in strip malls, office buildings, Walmart stores, and stand-alone structures. FedEx Office’s customer-facing stores average approximately 3,100 square feet in size. \n-39-\nFedEx Logistics Operating Segment\nFedEx Logistics’s corporate headquarters are located in Memphis, Tennessee and FedEx Supply Chain’s corporate headquarters are located in the Pittsburgh, Pennsylvania metropolitan area. As of May 31, 2025, FedEx Logistics operated approximately 110 offices and facilities in 34 countries and territories throughout North America and in Africa, Asia-Pacific, Europe, India, Latin America, the Middle East, and Australia/New Zealand. In addition, as of May 31, 2025, FedEx Supply Chain had 80 facilities through which it operated its supply chain logistics services.\nITEM 3. LEGAL PROCEEDINGS\nFedEx and its subsidiaries are subject to legal proceedings and claims that arise in the ordinary course of their business. See \nNote 2\n1\n of the accompanying consolidated financial statements, which is incorporated herein by reference, for a description of certain pending legal proceedings.\nITEM 4. MINE SAFETY DISCLOSURES \nNot applicable. \nINFORMATION ABOUT OUR EXECUTIVE OFFICERS \nInformation regarding executive officers of FedEx as of July 21, 2025 is as follows: \nName and Office\n \n Age \nPositions and Offices Held and Business Experience\n \nRajesh Subramaniam\nPresident and Chief Executive Officer and Director\n59\nPresident of FedEx since March 2019 and Chief Executive Officer of FedEx since June 2022; President and Chief Executive Officer of Federal Express since June 1, 2024; director of FedEx since January 2020; \nChief Executive Officer–Elect of FedEx from March 2022 to May 2022; \nChief Operating Officer of FedEx from March 2019 to March 2022; President and Chief Executive Officer of Federal Express from January 2019 to March 2019; Executive Vice President — Chief Marketing and Communications Officer of FedEx from January 2017 to December 2018; Executive Vice President — Marketing & Communications of FedEx Services from 2013 to January 2017; Senior Vice President — Marketing of FedEx Services from 2006 to 2013; Senior Vice President — Canada of Federal Express from 2003 to 2006; Vice President — Marketing/APAC of Federal Express from 2000 to 2003; Vice President — APAC, EC & CS of Federal Express from 1999 to 2000; and various management and marketing analyst positions at Federal Express from 1991 to 1999. Mr. Subramaniam serves as a director of The Proctor & Gamble Company, a consumer products company.\nGina F. Adams\nExecutive Vice President, General Counsel and Secretary\n66\nExecutive Vice President, General Counsel and Secretary of FedEx since September 24, 2024; Executive Vice President and General Counsel–Elect of FedEx from September 1, 2024 through September 23, 2024; Corporate Vice President, Government & Regulatory Affairs of FedEx from 2019 through August 2024; Corporate Vice President, Government Affairs of FedEx from 2001 to 2019; Staff Vice President, International Government Affairs of FedEx from 1999 to 2001; and various government and regulatory affairs positions with FedEx and Federal Express from 1992 to 1999. Prior to that, Ms. Adams worked in the Office of the General Counsel of the U.S. Department of Transportation for nine years. Ms. Adams serves as a director of Entergy Corporation, an integrated energy company. \nTracy B. Brightman\nExecutive Vice President — Chief People Officer\n62\nExecutive Vice President — Chief People Officer of FedEx since June 2023; Corporate Vice President — Chief People Officer of FedEx from November 2022 to June 2023; General Counsel & Senior Vice President — Legal and Human Resources of FedEx Office from October 2020 to November 2022; Senior Vice President — Human Resources and Communications of FedEx Office from April 2018 to October 2020; Senior Vice President — Human Resources of FedEx Office from July 2007 to March 2018; Vice President — Field Human Resources Operations of FedEx Office from January 2005 to June 2007; Vice President — Assistant General Counsel and Assistant Secretary of FedEx Office from April 2004 to January 2005; and Director, Litigation and Employment Counsel of FedEx Office from September 2002 to April 2004.\n-40-\nBrie A. Carere\nExecutive Vice President — Chief Customer Officer\n47\nExecutive Vice President — Chief Customer Officer of FedEx since June 2022; Executive Vice President — Chief Marketing and Communications Officer of FedEx from January 2019 to May 2022; Senior Vice President, Global Portfolio Marketing of FedEx Services from October 2016 to December 2018; Vice President, Marketing, Customer Experience and Corporate Communications for FedEx Express Canada from October 2010 to October 2016; and various positions in marketing, customer experience, and strategy with FedEx Express Canada from 2001 to October 2010. Ms. Carere serves as a director of ZipRecruiter, Inc., an online employment marketplace.\nJohn W. Dietrich\nExecutive Vice President and Chief Financial Officer\n60\nExecutive Vice President and Chief Financial Officer of FedEx since August 1, 2023; Executive Vice President and Chief Financial Officer–Elect of FedEx from July 17, 2023 to July 31, 2023; President and Chief Executive Officer and a director of Atlas Air Worldwide Holdings, Inc. (“Atlas”), a global provider of outsourced aircraft and aviation operating services, from January 1, 2020 to June 15, 2023; President and Chief Operating Officer of Atlas from July 2019 to January 2020; Executive Vice President and Chief Operating Officer of Atlas from September 2006 to July 2019; and various senior executive positions at Atlas from March 2003 to September 2006, including Senior Vice President, General Counsel, Chief Human Resources Officer, Corporate Secretary, and head of Information Technology and Corporate Communications functions. Mr. Dietrich serves as a director of AAR Corp., a global aerospace and defense aftermarket solutions company, and First Horizon Corporation, a financial services company.\nJohn A. Smith\nChief Operating Officer — United States and Canada, Federal Express\n63\nChief Operating Officer — United States and Canada of Federal Express since June 1, 2024; President and Chief Executive Officer — U.S. and Canada Ground Operations of Federal Express from April 16, 2023 to May 31, 2024; \nPresident and Chief Executive Officer of FedEx Ground from June 2021 to April 2023; President and Chief Executive Officer–Elect of FedEx Ground from March 2021 to May 2021; President and Chief Executive Officer of FedEx Freight from August 2018 to February 2021; President and Chief Executive Officer—Select of FedEx Freight from May 2018 to August 2018; Senior Vice President — Operations of FedEx Freight from May 2015 to May 2018; Vice President — Safety, Fleet Maintenance and Facilities Services of FedEx Freight from June 2011 to May 2015; Vice President — Operations of FedEx National LTL, Inc. from April 2010 to June 2011; Vice President — Transportation/Fleet Maintenance of FedEx National LTL, Inc. from March 2008 \nto April 2010; and various management positions at FedEx Freight from 2000 to 2008. Mr. Smith has been selected to serve as President and Chief Executive Officer of the new publicly traded company to be created upon the separation of FedEx Freight.\nRichard W. Smith\nChief Operating Officer — International and Chief Executive Officer — Airline, Federal Express\n47\nChief Operating Officer — International and Chief Executive Officer — Airline of Federal Express since June 1, 2024; President and Chief Executive Officer — Airline and International of Federal Express from April 16, 2023 to May 31, 2024;\n President and Chief Executive Officer of Federal Express from September 2022 to April 2023; President and Chief Executive Officer–Elect of Federal Express from April 2022 to August 2022; Regional President, The Americas and Executive Vice President, Global Support of Federal Express from 2020 to March 2022; Regional President, U.S. and Executive Vice President, Global Support of Federal Express from 2019 to 2020; President and Chief Executive Officer of FedEx Logistics from July 2017 to 2019; Senior Vice President, Global Trade and Specialty Services of Federal Express from March 2017 to June 2017; Vice President, Global Trade Services of Federal Express from 2014 to 2017; Managing Director, Life Sciences and Specialty Services/U.S./International of Federal Express from 2009 to 2014; and various positions with FedEx from 2005 to 2009.\nExecutive officers are elected by, and serve at the discretion of, the Board of Directors. There is no arrangement or understanding between any executive officer or person chosen to become an executive officer and any person, other than a director or executive officer of FedEx or of any of its subsidiaries acting solely in his or her official capacity, pursuant to which any executive officer or person chosen to become an executive officer was selected. There are no family relationships between any executive officer and any other executive officer or director of FedEx, or any person nominated or chosen to become a director or executive officer.\n-41-\nPART II \nITEM 5. MARKET FOR REGISTRANT’S COMMON EQUITY, RELATED STOCKHOLDER MATTERS, AND ISSUER PURCHASES OF EQUITY SECURITIES \nFedEx’s common stock is listed on the New York Stock Exchange under the symbol “FDX.” As of July 17, 2025, there were 11,538 holders of record of our common stock. \nWe expect to continue to pay regular quarterly cash dividends, though each quarterly dividend payment is subject to review and approval by our Board of Directors. We evaluate our dividend payment amount on an annual basis. There are no material restrictions on our ability to declare dividends, nor are there any material restrictions on the ability of our subsidiaries to transfer funds to us in the form of cash dividends, loans, or advances.\nUnregistered Sales of Equity Securities\nIn February 2025, we acquired RouteSmart Technologies, Inc. (“RouteSmart”), a global leader in route planning and optimization solutions, and the consideration paid to certain former stockholders of RouteSmart consisted in part of 359,052 unregistered shares of our common stock valued at approximately $90 million as of the acquisition date. In May 2025, in connection with pre-closing period financial statement adjustments, we issued another 1,510 unregistered shares of our common stock valued at less than $500,000 to the former RouteSmart stockholders pursuant to the terms of the acquisition agreement. \nThe foregoing transactions did not involve any underwriters or underwriting discounts or commissions. The shares of our common stock were issued in reliance upon the exemption from registration provided by Section 4(a)(2) of the Securities Act of 1933, as amended, in a privately negotiated transaction not involving any public offerings or solicitations. See \nNote 4\n of the accompanying audited consolidated financial statements for additional information regarding the RouteSmart acquisition. \nIssuer Purchases of Equity Securities\nIn March 2024, our Board of Directors authorized the repurchase of up to $5.0 billion of FedEx common stock. As part of this program, we repurchased 2.1 million shares for $500 million in the open market during the fourth quarter of 2025. In fiscal 2026 we have completed $500 million of share repurchases through open market transactions through July 21, 2025 and expect to continue repurchasing additional shares of our common stock subject to market conditions, our liquidity needs, and other factors.\nAs of July 21, 2025, approximately $1.6 billion remained available to be used for repurchases under the program. Shares under the program may be repurchased from time to time in the open market or in privately negotiated transactions. No time limits were set for completion of the program; however, we may decide to suspend or discontinue the program.\nThe following table provides additional information on our repurchases of our common stock during the fourth quarter of 2025:\nPeriod\nTotal Number of\nShares Purchased\nAverage Price\nPaid per Share\nTotal Number of\nShares Purchased\nas Part of\nPublicly\nAnnounced\nPrograms\nApproximate\nDollar Value of\nShares That May\nYet Be Purchased\nUnder the\nPrograms\n($ in millions)\nMar. 1-31, 2025\n1,775,000 \n$\n242.43 \n1,775,000 \n$\n2,134 \nApr. 1-30, 2025\n287,186 \n$\n242.78 \n287,186 \n$\n2,064 \nMay 1-31, 2025\n— \n$\n— \n— \n$\n2,064 \nTotal\n2,062,186 \n2,062,186 \n$\n2,064 \nSee “\nItem 7. Management’s Discussion and Analysis of Results of Operations and Financial Condition\n” and \nNote 1\n of the consolidated financial statements included in “\nItem 8. Financial Statements and Supplementary Data\n” of this Annual Report for additional information regarding our stock repurchases during 2025 and expected stock repurchases during 2026.\n-42-\nCommon Stock Performance Graph: \nThe following performance graph and related information shall not be deemed “soliciting material” or to be “filed” with the SEC, nor shall such information be incorporated by reference into any future filing under the Securities Act of 1933 or Securities Exchange Act of 1934, each as amended, except to the extent that we specifically incorporate such information by reference into such filing.\nThe following graph compares the cumulative total shareholder return on our common stock for the periods indicated with the Standard & Poor's (\"S&P\") 500 index and the Dow Jones Transportation Average index.\nMay 31,\n2020\n2021\n2022\n2023\n2024\n2025\nFedEx Corporation\n$\n100.00 \n$\n244.20 \n$\n176.29 \n$\n175.00 \n$\n208.06 \n$\n182.43 \nS&P 500 Index\n$\n100.00 \n$\n140.25 \n$\n139.83 \n$\n143.91 \n$\n184.48 \n$\n209.42 \nDow Jones Transportation Average Index\n$\n100.00 \n$\n178.01 \n$\n163.66 \n$\n159.29 \n$\n179.75 \n$\n176.03 \n(1)\nAssumes $100 invested in FedEx common stock and in each index on May 31, 2020 and that all dividends are reinvested.\nITEM 6. [RESERVED] \nITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF RESULTS OF OPERATIONS AND FINANCIAL CONDITION\nORGANIZATION OF INFORMATION \nThis Management’s Discussion and Analysis of Results of Operations and Financial Condition (“MD&A”) of FedEx Corporation (“FedEx”) is composed of three major sections: Results of Operations and Outlook, Financial Condition, and Critical Accounting Estimates. These sections include the following information:\n•\nResults of operations includes an overview of our consolidated 2025 results compared to 2024 results. This section also includes a discussion of key actions and events that impacted our results. Discussion and analysis of 2023 results and year-over-year comparisons between 2024 results and 2023 results can be found in “Item 7. Management’s Discussion and Analysis of Results of Operations and Financial Condition” of our Annual Report on Form 10-K (“Annual Report”) for the year ended May 31, 2024.\n-43-\n•\nThe overview is followed by a discussion of both historical operating results for our business segments during 2025 and 2024 and our outlook for 2026, as well as a financial summary and analysis for each of our transportation segments in place during 2025 and 2024.\n•\nOur financial condition is reviewed through an analysis of key elements of our liquidity and capital resources, financial commitments, and liquidity outlook for 2026.\n•\nCritical accounting estimates discusses those financial statement elements that we believe are most important to understanding the material judgments and assumptions incorporated in our financial results.\nThe discussion in MD&A should be read in conjunction with the other sections of this Annual Report, particularly “\nItem 1. Business\n,” “",
    "item1a": "Item 1A. Risk Factors\n” of this Annual Report.\nLONG-LIVED ASSETS\nUSEFUL LIVES AND SALVAGE VALUES\n. Our business is capital intensive, with approximately 59% of our owned assets invested in our transportation and information system infrastructures. \nThe depreciation or amortization of our capital assets over their estimated useful lives, and the determination of any salvage values, requires management to make judgments about future events. Because we utilize many of our capital assets over relatively long periods (the majority of aircraft costs are depreciated over 18 to 30 years), we periodically evaluate whether adjustments to our estimated service lives or salvage values are necessary to ensure these estimates properly match the economic use of the asset. These evaluations consider usage, maintenance costs, and economic factors that affect the useful life of an asset. This evaluation may result in changes in the estimated lives and residual values used to depreciate our aircraft and other equipment.\n-64-\nFor our aircraft, we consider actual experience with the same or similar aircraft types and future volume projections in estimating the useful lives and expected salvage values. We typically assign no residual value due to the utilization of our aircraft in cargo configuration, which results in little to no value at the end of their useful life. These estimates affect the amount of depreciation expense recognized in a period and, ultimately, the gain or loss on the disposal of the asset. Changes in the estimated lives of assets will result in an increase or decrease in the amount of depreciation recognized in future periods and could have a material impact on our results of operations (as described below). Historically, gains and losses on disposals of operating equipment have not been material. However, such amounts may differ materially in the future due to changes in business levels, technological obsolescence, accident frequency, regulatory changes, and other factors beyond our control.\nIMPAIRMENT. \nAs of May 31, 2025, the Federal Express global air network included a fleet of 698 aircraft (including 312 supplemental aircraft) that provide delivery of packages and freight to more than 220 countries and territories through a wide range of U.S. and international shipping services. While certain aircraft are utilized in primary geographic areas (U.S. versus international), we operate an integrated global network, and utilize our aircraft and other modes of transportation to achieve the lowest cost of delivery while maintaining our service commitments to our customers. Because of the integrated nature of our global network, our aircraft are interchangeable across routes and geographies, giving us flexibility with our fleet planning to meet changing global economic conditions and maintain and modify aircraft as needed. \nBecause of the lengthy lead times for aircraft manufacture and modifications, we must anticipate volume levels and plan our fleet requirements years in advance, and make commitments for aircraft based on those projections. Furthermore, the timing and availability of certain used aircraft types (particularly those with better fuel efficiency) may create limited opportunities to acquire these aircraft at favorable prices in advance of our capacity needs. These activities create risks that asset capacity may exceed demand. At May 31, 2025, we had two purchased aircraft that were not yet placed into service. \nWe evaluate our long-lived assets used in operations for impairment when events and circumstances indicate that the undiscounted cash flows to be generated by that asset group are less than the carrying amounts of the asset group and may not be recoverable. If the cash flows do not exceed the carrying value, the asset must be adjusted to its current fair value. We operate integrated transportation networks, and accordingly, cash flows for most of our operating assets are assessed at a network level, not at an individual asset level for our analysis of impairment. Further, decisions about capital investments are evaluated based on the effect on the overall network rather than the return on an individual asset. We make decisions to remove certain long-lived assets from service based on projections of reduced capacity needs or lower operating costs of newer aircraft types, and those decisions may result in an impairment charge. Assets held for disposal must be adjusted to their estimated fair values less costs to sell when the decision is made to dispose of the asset and certain other criteria are met. The fair value determinations for such aircraft may require management estimates, as there may not be active markets for some of these aircraft. Such estimates are subject to revision from period to period.\nIn the fourth quarter of 2025, we made the decision to permanently retire from service 12 aircraft and eight related engines, resulting in a noncash impairment charge of $21 million ($16 million, net of tax, or $0.06 per diluted share). These retirements included two Boeing 757-200 aircraft, seven Airbus A300-600 aircraft, three Boeing MD-11 aircraft, and align with Federal Express’s fleet reduction and modernization strategy as we continue to improve our global network efficiency and better align air network capacity with anticipated demand. All of these permanently retired aircraft were temporarily idled and not in revenue service.\nDuring 2024, Federal Express made the decision to permanently retire from service 22 Boeing 757-200 aircraft and seven related engines to align with Federal Express’s fleet reduction and modernization strategy. As a consequence of this decision, a noncash impairment charge of $157 million ($120 million, net of tax, or $0.48 per diluted share) was recorded in 2024.\nIn 2023 we accelerated the retirement of the entire Boeing MD-11 fleet by the end of 2028. In 2025 we made the decision to extend the retirement plan to have the fleet retired by the end of 2032 to better align the air network capacity of Federal Express to match anticipated shipment volumes. As a result of this decision, we had a net decrease in depreciation expense in 2025 of $19 million.\nIn the normal management of our aircraft fleet, we routinely idle aircraft and engines temporarily due to maintenance cycles and adjustments of our network capacity to match seasonality and overall customer demand levels. Temporarily idled assets are classified as available-for-use, and we continue to record depreciation expense associated with these assets. These temporarily idled assets are assessed for impairment and remaining life on a quarterly basis. The criteria for determining whether an asset has been permanently removed from service (and, as a result, is potentially impaired) include, but are not limited to, our global economic outlook and the impact of our outlook on our current and projected volume levels, including capacity needs during our peak shipping seasons; the introduction of new fleet types or decisions to permanently retire an aircraft fleet from operations; and changes to planned service expansion activities. At May 31, 2025, we had 22 aircraft temporarily idled. These aircraft have been idled for an average of ten months and are expected to return to revenue service i\nn order to meet expected demand.\nLEASES\n. We utilize operating leases to finance certain of our aircraft, facilities, and equipment. Such arrangements typically shift the risk of loss on the residual value of the assets at the end of the lease period to the lessor. We had $17 billion in operating lease liabilities and $16 billion in related right-of-use assets on the balance sheet as of May 31, 2025. The weighted-average remaining lease term of all operating leases outstanding at May 31, 2025 was 9.7 years.\n-65-\nOur leases generally contain options to extend or terminate the lease. We reevaluate our leases on a regular basis to consider the economic and strategic incentives of exercising the renewal options, and how they align with our operating strategy. Therefore, substantially all the renewal option periods are not included within the lease term and the associated payments are not included in the measurement of the right-of-use asset and lease liability as the options to extend are not reasonably certain at lease commencement. Short-term leases with an initial term of 12 months or less are not recognized in the right-of-use asset and lease liability on the consolidated balance sheets.\nThe lease liabilities are measured at the lease commencement date and determined using the present value of the minimum lease payments not yet paid and our incremental borrowing rate, which approximates the rate at which we would borrow, on a collateralized basis, over the term of a lease in the applicable currency environment. The interest rate implicit in the lease is generally not determinable in transactions where we are the lessee.\nThe determination of whether a lease is accounted for as a finance lease or an operating lease requires management to make estimates primarily about the fair value of the asset and its estimated economic useful life. In addition, our evaluation includes ensuring we properly account for build-to-suit lease arrangements and making judgments about whether various forms of lessee involvement allow the lessee to control the underlying leased asset during the construction period. We believe we have well-defined and controlled processes for making these evaluations, including obtaining third-party appraisals for material transactions to assist us in making these evaluations.\nGOODWILL\n. We had $6.6 billion of recorded goodwill at May 31, 2025 and $6.4 billion of recorded goodwill at May 31, 2024 from our business acquisitions, representing the excess of the purchase price over the fair value of the net assets acquired. Several factors give rise to goodwill in our acquisitions, such as the expected benefits from synergies of the combination and the existing workforce of the acquired business. \nGoodwill is reviewed at least annually for impairment. In our evaluation of goodwill impairment, we perform a qualitative assessment that requires management judgment and the use of estimates to determine if it is more likely than not that the fair value of a reporting unit is less than its carrying amount. An entity has an unconditional option to bypass the qualitative assessment for any reporting unit and proceed directly to performing the quantitative goodwill impairment test. An entity may resume performing the qualitative assessment in any subsequent period. We performed a qualitative assessment of goodwill in the fourth quarter of 2025 and 2024.\nAs part of our qualitative assessment, we consider changes in the macroeconomic environment such as the general economic conditions, limitations on accessing capital, fluctuations in foreign exchange rates, and other developments in equity and credit markets.\nWhen we perform quantitative assessments, we compare the fair value of the reporting unit to its carrying value (including attributable goodwill). Fair value is estimated using standard valuation methodologies (principally the income or market approach classified as Level 3 within the fair value hierarchy) incorporating market participant considerations and management’s assumptions on revenue growth rates, operating margins, discount rates, and expected capital expenditures. Estimates used by management can significantly affect the outcome of the impairment test. Changes in forecasted operating results and other assumptions could materially affect these estimates.\nWe evaluated each of our reporting units during the fourth quarters of \n2025\n and \n2024\n and\n the estimated fair value of each of our reporting units exceeded their carrying values as of the end of 2025 and 2024; therefore, no impairment was recorded during any of the years presented.\nLEGAL AND OTHER\n \nCONTINGENCIES\nWe are subject to various loss contingencies in connection with our operations. Contingent liabilities are difficult to measure, as their measurement is subject to multiple factors that are not easily predicted or projected. Further, additional complexity in measuring these liabilities arises due to the various jurisdictions in which these matters occur, which makes our ability to predict their outcome highly uncertain. Moreover, different accounting rules must be employed to account for these items based on the nature of the contingency. Accordingly, significant management judgment is required to assess these matters and to make determinations about the measurement of a liability, if any. Certain pending loss contingencies are described in \nNote 21\n of the accompanying consolidated financial statements. In the opinion of management, the aggregate liability, if any, of individual matters or groups of related matters not specifically described in \nNote 21\n is not expected to be material to our financial position, results of operations, or cash flows. The following describes our methods and associated processes for evaluating these matters. \nBecause of the complex environment in which we operate, we are subject to numerous legal proceedings and claims, including those relating to general commercial matters, governmental enforcement actions, employment-related claims, vehicle accidents, and service providers. Accounting guidance for contingencies requires an accrual of estimated loss from a contingency, such as a non-income tax or other legal proceeding or claim, when it is probable (i.e., the future event or events are likely to occur) that a loss has been incurred \n-66-\nand the amount of the loss can be reasonably estimated. This guidance also requires disclosure of a loss contingency matter when, in management’s judgment, a material loss is reasonably possible or probable. \nDuring the preparation of our financial statements, we evaluate our contingencies to determine whether it is probable, reasonably possible, or remote that a liability has been incurred. A loss is recognized for all contingencies deemed probable and reasonably estimable. For unresolved contingencies with potentially material exposure that are deemed reasonably possible, we evaluate whether a potential loss or range of loss can be reasonably estimated.\nOur evaluation of these matters is the result of a comprehensive process designed to ensure that accounting recognition of a loss or disclosure of these contingencies is made in a timely manner and involves our legal and accounting personnel, as well as external counsel where applicable. The process includes regular communications during each quarter and scheduled meetings shortly before the issuance of our financial statements to evaluate any new legal proceedings and the status of existing matters.\nIn determining whether a loss should be accrued or a loss contingency disclosed, we evaluate, among other factors: \n•\nthe current status of each matter within the scope and context of the entire lawsuit or proceeding (e.g., the lengthy and complex nature of class-action matters); \n•\nthe procedural status of each matter; \n•\nany opportunities to dispose of a lawsuit on its merits before trial (i.e., motion to dismiss or for summary judgment); \n•\nthe amount of time remaining before a trial date; \n•\nthe status of discovery; \n•\nthe status of settlement, arbitration, or mediation proceedings; and \n•\nour judgment regarding the likelihood of success prior to or at trial. \nIn reaching our conclusions with respect to accrual of a loss or loss contingency disclosure, we take a holistic view of each matter based on these factors and the information available prior to the issuance of our financial statements. Uncertainty with respect to an individual factor or combination of these factors may impact our decisions related to accrual or disclosure of a loss contingency, including a conclusion that we are unable to establish an estimate of possible loss or a meaningful range of possible loss. We update our disclosures to reflect our most current understanding of the contingencies at the time we issue our financial statements. However, events may arise that were not anticipated and the outcome of a contingency may result in a loss to us that differs materially from our previously estimated liability or range of possible loss. \nDespite the inherent complexity in the accounting and disclosure of contingencies, we believe that our processes are robust and thorough and provide a consistent framework for management in evaluating the potential outcome of contingencies for proper accounting recognition and disclosure. \nITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK \nINTEREST RATES.\n While we currently have market risk sensitive instruments related to interest rates, we do not have significant exposure to changing interest rates on our long-term debt. As disclosed in \nNote \n7\n to the accompanying consolidated financial statements, we had outstanding fixed-rate long-term debt (exclusive of finance leases) with an estimated fair value of $17.2 billion at May 31, 2025 and outstanding fixed-rate long-term debt (exclusive of finance leases) with an estimated fair value of $17.5 billion at May 31, 2024. Market risk for long-term debt is estimated as the potential decrease in fair value resulting from a hypothetical 10% increase in interest rates and amounts to approximately $600 million as of May 31, 2025 and approximately $650 million as of May 31, 2024. The underlying fair values of our long-term debt were estimated based on quoted market prices or on the current rates offered for debt with similar terms and maturities. \nWe have interest rate risk with respect to our pension and postretirement benefit obligations. Changes in interest rates impact our liabilities associated with these retirement plans, as well as the amount of pension and postretirement benefit expense recognized. Declines in the value of plan assets could diminish the funded status of our pension plans and potentially increase our requirement to make contributions to the plans. Substantial investment losses on plan assets would also increase net pension expense. See the “Critical Accounting Estimates — Retirement Plans” section of “\nItem 7. Management’s Discussion and Analysis of Results of Operations and Financial Condition\n” of this Annual Report for more information.\nFOREIGN CURRENCY.\n While we are a global provider of transportation, e-commerce, and business services, the majority of our transactions during the periods presented in this Annual Report are denominated in U.S. dollars. The principal foreign currency exchange rate risks to which we are exposed relate to the euro, Chinese yuan, British pound, Canadian dollar, Australian dollar, Mexican peso, Hong Kong dollar, and Japanese yen. Historically, our exposure to foreign currency fluctuations is more significant \n-67-\nwith respect to our revenue than our expenses, as a significant portion of our expenses are denominated in U.S. dollars, such as aircraft and fuel expenses. Foreign currency fluctuations had a slightly positive impact on operating income in 2025 and a slightly negative impact on operating income in 2024. However, favorable foreign currency fluctuations also may have had an offsetting impact on the price we obtained or the demand for our services, which is not quantifiable. At May 31, 2025, the result of a uniform 10% strengthening in the value of the dollar relative to the currencies in which our transactions are denominated would result in a decrease in operating income of approximately $450 million for 2026, assuming operations were consistent with the prior year. This theoretical calculation assumes that each exchange rate would change in the same direction relative to the U.S. dollar, which is not consistent with our actual experience in foreign currency transactions. In addition to the direct effects of changes in exchange rates, fluctuations in exchange rates also affect the volume of sales or the foreign currency sales price as competitors’ services become more or less attractive. The sensitivity analysis of the effects of changes in foreign currency exchange rates does not factor in a potential change in sales levels or local currency prices. \nWe maintain derivative financial instruments to manage foreign currency fluctuations related to probable future transactions and cash flows denominated in currencies other than the currency of the transacting entity, which impacts our exposure to foreign currency exchange risk. Certain derivatives are designated as net investment hedges and the gains or losses on those derivatives are reported in accumulated other comprehensive loss within common stockholders’ investment as part of the cumulative translation adjustment. During 2025, we recognized an $86 million loss in other comprehensive income related to our cross-currency swaps, which excludes any impact of deferred income taxes. All other derivatives are accounted for at fair value with any gains or losses recorded in income, and were immaterial in 2025. The income statement impact of the derivatives was immaterial in 2024. For additional discussion of our derivatives, see \nNote 1\n6\n of the accompanying consolidated financial statements.\nCOMMODITY.\n While we have market risk for changes in the price of jet and vehicle fuel, this risk is largely mitigated by our indexed fuel surcharges. For additional discussion of our indexed fuel surcharges, see the “Results of Operations and Outlook — Consolidated Results — Fuel” section of “\nItem 7. Management’s Discussion and Analysis of \nFinanc\nial Condition and \nResults of Operations\n.\n” \n-68-\nITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA \nMANAGEMENT’S REPORT ON INTERNAL \nCONTROL OVER FINANCIAL REPORTING \nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act of 1934, as amended). Our internal control over financial reporting includes, among other things, defined policies and procedures for conducting and governing our business, sophisticated information systems for processing transactions, and a properly staffed, professional internal audit department. Mechanisms are in place to monitor the effectiveness of our internal control over financial reporting and actions are taken to correct all identified deficiencies. Our procedures for financial reporting include the active involvement of senior management, our Audit and Finance Committee, and our staff of highly qualified financial and legal professionals. \nManagement, with the participation of our principal executive and financial officers, assessed our internal control over financial reporting as of May 31, 2025, the end of our fiscal year. Management based its assessment on criteria established in Internal Control — Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). \nBased on this assessment, management has concluded that our internal control over financial reporting was effective as of May 31, 2025. \nThe effectiveness of our internal control over financial reporting as of May 31, 2025, has been audited by \nErnst & Young LLP\n (PCAOB ID: \n42\n), the independent registered public accounting firm who also audited the Company’s consolidated financial statements included in this Annual Report on Form 10-K. Ernst & Young LLP’s report on the Company’s internal control over financial reporting is included in this Annual Report on Form 10-K. \n-69-\nReport of Independent Registered Public Accounting Firm \nTo the Stockholders and Board of Directors of \nFedEx Corporation\nOpinion on Internal Control Over Financial Reporting \nWe have audited FedEx Corporation’s internal control over financial reporting as of May 31, 2025, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, FedEx Corporation (the Company) maintained, in all material respects, effective internal control over financial reporting as of May 31, 2025, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of May 31, 2025 and 2024, the related consolidated statements of income, comprehensive income, cash flows and changes in common stockholders’ investment for each of the three years in the period ended May 31, 2025, and the related notes and our report dated July 21, 2025 expressed an unqualified opinion thereon. \nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. \nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting \nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements. \nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. \n/s/ Ernst & Young LLP\nMemphis, Tennessee\n \nJuly 21, 2025\n-70-\nReport of Independent Registered Public Accounting Firm \nTo the Stockholders and Board of Directors of\nFedEx Corporation\nOpinion on the Financial Statements \nWe have audited the accompanying consolidated balance sheets of FedEx Corporation (the Company) as of May 31, 2025 and 2024, the related consolidated statements of income, comprehensive income, cash flows and changes in common stockholders’ investment for each of the three years in the period ended May 31, 2025, and the related notes (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at May 31, 2025 and 2024, and the results of its operations and its cash flows for each of the three years in the period ended May 31, 2025, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of May 31, 2025, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework), and our report dated July 21, 2025 expressed an unqualified opinion thereon. \nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion. \nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nU.S. Pension Projected Benefit Obligation\nDescription of the Matter\nThe Company sponsors defined benefit pension plans that provide retirement benefits to certain U.S. employees. At May 31, 2025, the Company’s aggregated projected benefit obligation for U.S. pension plans was $26.0 billion, which was less than the $26.6 billion fair value of U.S. pension plan assets, resulting in a funded status of $0.6 billion. As explained in Note 1 and Note 14 to the consolidated financial statements, the Company’s projected benefit obligation for the U.S. pension plans is measured using actuarial techniques that reflect management’s assumptions for discount rate and demographic experience, such as mortality and retirement ages.\nAuditing the projected benefit obligation of the U.S. pension plans was complex due to the highly judgmental nature and significant effect of the discount rate used in the measurement process. The discount rate has a significant effect on the projected benefit obligation and is developed by utilizing the yield on a theoretical portfolio of high-grade corporate bonds with cash flows that are designed to match expected benefit payments in future years.\n-71-\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design and tested the operating effectiveness of controls over management’s process for estimating the projected benefit obligation of the U.S. pension plans, including management’s review of the significant assumptions and assessment of the data inputs provided to the actuary.\nTo test the projected benefit obligation of the U.S. pension plans, our audit procedures included, among others, evaluating the methodologies used, the significant actuarial assumptions described above, and the underlying data used by the Company. We compared the actuarial assumptions used by management to historical trends and evaluated the change in the projected benefit obligation of the U.S. pension plans from the prior year due to the change in service cost, interest cost, actuarial gains, and benefit payments. In addition, we involved our actuarial specialists to assist in evaluating management’s methodology for determining the discount rate. As part of this assessment, we compared management’s selected discount rate to an independently developed range of reasonable discount rates. Additionally, we compared the projected future cash flows of the U.S. pension plans to the prior year projections and compared the current year benefits paid to the prior year projected cash flows. We also tested the completeness and accuracy of the underlying data, including the participant data provided to management’s actuarial specialists.\nValuation of Self-Insurance Accruals\nDescription of the Matter\nAt May 31, 2025, the Company’s self-insurance accruals reflected in the balance sheet were $5.9 billion. As explained in Note 1 to the consolidated financial statements, self-insurance accruals include costs associated with workers’ compensation claims, vehicle accidents, property and cargo loss, general business liabilities, and benefits paid under employee disability programs. These accrued liabilities are primarily based on the actuarially estimated cost of claims, including incurred-but-not-reported (IBNR) claims.\nAuditing the Company’s self-insurance accruals is complex due to the significant measurement uncertainty inherent to the estimate, the application of management judgment, and the use of various actuarial methods. In addition, the accruals are sensitive due to the volume of claims and the amount of time that can pass before the final cost is known.\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design and tested the operating effectiveness of controls over management’s process for estimating self-insurance accruals, including management’s review of actuarial estimates and assessment of data underlying the accruals.\nTo evaluate the self-insurance accruals, our audit procedures included, among others, testing the completeness and accuracy of the underlying claims data used by the Company. We involved our actuarial specialists to assist in our evaluation of the methodologies applied by management in establishing the actuarially determined accrual and in reviewing the Company’s reinsurance contracts by policy year to assess the Company’s self-insured retentions, deductibles, and coverage limits. We compared the Company’s accrued amounts to a range developed by our actuarial specialists. Furthermore, we compared the Company’s historical estimates of expected incurred losses to actual losses experienced during the current year.\n/s/ Ernst & Young LLP\nWe have served as the Company’s auditor since 2002.\nMemphis, Tennessee\nJuly 21, 2025\n-72-\nFEDEX CORPORATION \nCONSOLIDATED BALANCE SHEETS \n(IN MILLIONS) \nMay 31,\n2025\n2024\nASSETS\nCURRENT ASSETS\nCash and cash equivalents\n$\n5,502\n \n$\n6,501\n \nReceivables, less allowances of $\n773\n and $\n775\n11,368\n \n10,087\n \nSpare parts, supplies, and fuel, less allowances of $\n308\n and $\n288\n602\n \n614\n \nPrepaid expenses and other\n914\n \n1,005\n \nTotal current assets\n18,386\n \n18,207\n \nPROPERTY AND EQUIPMENT, AT COST\nAircraft and related equipment\n31,584\n \n30,525\n \nPackage handling and ground support equipment\n18,878\n \n17,880\n \nInformation technology\n9,706\n \n9,203\n \nVehicles and trailers\n10,949\n \n10,568\n \nFacilities and other\n16,505\n \n16,215\n \nTotal property and equipment, at cost\n87,622\n \n84,391\n \nLess accumulated depreciation and amortization\n45,980\n \n42,900\n \nNet property and equipment\n41,642\n \n41,491\n \nOTHER LONG-TERM ASSETS\nOperating lease right-of-use assets, net\n16,453\n \n17,115\n \nGoodwill\n6,603\n \n6,423\n \nOther assets\n4,543\n \n3,771\n \nTotal other long-term assets\n27,599\n \n27,309\n \nTOTAL ASSETS\n$\n87,627\n \n$\n87,007\n \nThe accompanying notes are an integral part of these consolidated financial statements. \n-73-\nFEDEX CORPORATION \nCONSOLIDATED BALANCE SHEETS \n(IN MILLIONS, EXCEPT SHARE DATA) \nMay 31,\n2025\n2024\nLIABILITIES AND COMMON STOCKHOLDERS’ INVESTMENT\nCURRENT LIABILITIES\nCurrent portion of long-term debt\n$\n1,428\n \n$\n68\n \nAccrued salaries and employee benefits\n2,731\n \n2,673\n \nAccounts payable\n3,692\n \n3,189\n \nOperating lease liabilities\n2,565\n \n2,463\n \nAccrued expenses\n4,995\n \n4,962\n \nTotal current liabilities\n15,411\n \n13,355\n \nLONG-TERM DEBT, LESS CURRENT PORTION\n19,151\n \n20,135\n \nOTHER LONG-TERM LIABILITIES\nDeferred income taxes\n4,205\n \n4,482\n \nPension, postretirement healthcare, and other benefit obligations\n1,698\n \n2,010\n \nSelf-insurance accruals\n4,033\n \n3,701\n \nOperating lease liabilities\n14,272\n \n15,053\n \nOther liabilities\n783\n \n689\n \nTotal other long-term liabilities\n24,991\n \n25,935\n \nCOMMITMENTS AND CONTINGENCIES\nCOMMON STOCKHOLDERS’ INVESTMENT\nCommon stock, $\n0.10\n par value; \n800\n million shares authorized; \n318\n million shares issued as of May 31, 2025 and 2024\n32\n \n32\n \nAdditional paid-in capital\n4,290\n \n3,988\n \nRetained earnings\n41,402\n \n38,649\n \nAccumulated other comprehensive loss\n(\n1,362\n)\n(\n1,359\n)\nTreasury stock, at cost; \n80\n million shares as of May 31, 2025 and \n72\n million shares as of May 31, 2024\n(\n16,288\n)\n(\n13,728\n)\nTotal common stockholders’ investment\n28,074\n \n27,582\n \nTOTAL LIABILITIES AND COMMON STOCKHOLDERS’ INVESTMENT\n$\n87,627\n \n$\n87,007\n \nThe accompanying notes are an integral part of these consolidated financial statements. \n-74-\nFEDEX CORPORATION\nCONSOLIDATED STATEMENTS OF INCOME \n(IN MILLIONS, EXCEPT PER SHARE AMOUNTS) \nYears ended May 31,\n2025\n2024\n2023\nREVENUE\n$\n87,926\n \n$\n87,693\n \n$\n90,155\n \nOPERATING EXPENSES:\nSalaries and employee benefits\n31,232\n \n30,961\n \n31,019\n \nPurchased transportation\n21,768\n \n20,921\n \n21,790\n \nRentals and landing fees\n4,647\n \n4,571\n \n4,738\n \nDepreciation and amortization\n4,264\n \n4,287\n \n4,176\n \nFuel\n3,775\n \n4,710\n \n5,909\n \nMaintenance and repairs\n3,245\n \n3,291\n \n3,357\n \nGoodwill and other asset impairment charges\n21\n \n157\n \n117\n \nBusiness optimization and realignment costs\n756\n \n582\n \n309\n \nOther\n13,001\n \n12,654\n \n13,828\n \nTOTAL OPERATING EXPENSES\n82,709\n \n82,134\n \n85,243\n \nOPERATING INCOME\n5,217\n \n5,559\n \n4,912\n \nOTHER INCOME (EXPENSE):\nInterest expense\n(\n789\n)\n(\n745\n)\n(\n694\n)\nInterest income\n363\n \n370\n \n198\n \nOther retirement plans income\n713\n \n722\n \n1,054\n \nOther, net\n(\n63\n)\n(\n70\n)\n(\n107\n)\nTOTAL OTHER INCOME (EXPENSE)\n224\n \n277\n \n451\n \nINCOME BEFORE INCOME TAXES\n5,441\n \n5,836\n \n5,363\n \nPROVISION FOR INCOME TAXES\n1,349\n \n1,505\n \n1,391\n \nNET INCOME\n$\n4,092\n \n$\n4,331\n \n$\n3,972\n \nBASIC EARNINGS PER COMMON SHARE\n$\n16.96\n \n$\n17.41\n \n$\n15.60\n \nDILUTED EARNINGS PER COMMON SHARE\n$\n16.81\n \n$\n17.21\n \n$\n15.48\n \nThe accompanying notes are an integral part of these consolidated financial statements. \n-75-\nFEDEX CORPORATION \nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME \n(IN MILLIONS) \nYears ended May 31,\n2025\n2024\n2023\nNET INCOME\n$\n4,092\n \n$\n4,331\n \n$\n3,972\n \nOTHER COMPREHENSIVE LOSS:\nForeign currency translation adjustments, net of tax benefits of $\n13\n in 2025, $\n5\n in 2024, and $\n25\n in 2023\n2\n \n(\n60\n)\n(\n214\n)\nPrior service credit arising during period, net of tax (expense) of $\n0\n in 2025, ($\n11\n) in 2024, and $\n0\n in 2023\n—\n \n36\n \n—\n \nAmortization of prior service credits and other, net of tax benefit of $\n6\n in 2025, $\n2\n in 2024, and $\n2\n in 2023\n(\n5\n)\n(\n8\n)\n(\n10\n)\nTOTAL OTHER COMPREHENSIVE LOSS\n(\n3\n)\n(\n32\n)\n(\n224\n)\nCOMPREHENSIVE INCOME\n$\n4,089\n \n$\n4,299\n \n$\n3,748\n \nThe accompanying notes are an integral part of these consolidated financial statements. \n-76-\nFEDEX CORPORATION\nCONSOLIDATED STATEMENTS OF CASH FLOWS \n(IN MILLIONS) \nYears ended May 31,\n2025\n2024\n2023\nOPERATING ACTIVITIES\nNet income\n$\n4,092\n \n$\n4,331\n \n$\n3,972\n \nAdjustments to reconcile net income to cash provided by operating activities:\nDepreciation and amortization\n4,264\n \n4,287\n \n4,176\n \nProvision for uncollectible accounts\n521\n \n421\n \n696\n \nOther noncash items including leases and deferred income taxes\n3,156\n \n2,919\n \n3,472\n \nStock-based compensation\n154\n \n163\n \n182\n \nRetirement plans mark-to-market adjustments\n(\n515\n)\n(\n561\n)\n(\n650\n)\nGoodwill and other asset impairment charges\n21\n \n157\n \n117\n \nBusiness optimization and realignment costs, net of payments\n43\n \n26\n \n23\n \nChanges in assets and liabilities:\nReceivables\n(\n1,780\n)\n(\n270\n)\n782\n \nOther current assets\n90\n \n(\n43\n)\n48\n \nPension and postretirement healthcare assets and liabilities, net\n(\n553\n)\n(\n522\n)\n(\n623\n)\nAccounts payable and other liabilities\n(\n2,445\n)\n(\n2,553\n)\n(\n3,331\n)\nOther, net\n(\n12\n)\n(\n43\n)\n(\n16\n)\nCash provided by operating activities\n7,036\n \n8,312\n \n8,848\n \nINVESTING ACTIVITIES\nCapital expenditures\n(\n4,055\n)\n(\n5,176\n)\n(\n6,174\n)\nPurchase of investments\n(\n262\n)\n(\n176\n)\n(\n84\n)\nProceeds from sale of investments\n110\n \n38\n \n—\n \nProceeds from asset dispositions, and other investing activities, net\n115\n \n114\n \n84\n \nCash used in investing activities\n(\n4,092\n)\n(\n5,200\n)\n(\n6,174\n)\nFINANCING ACTIVITIES\nPrincipal payments on debt\n(\n157\n)\n(\n147\n)\n(\n152\n)\nProceeds from stock issuances\n524\n \n491\n \n231\n \nDividends paid\n(\n1,339\n)\n(\n1,259\n)\n(\n1,177\n)\nPurchase of common stock\n(\n3,017\n)\n(\n2,500\n)\n(\n1,500\n)\nOther, net\n(\n30\n)\n(\n11\n)\n1\n \nCash used in financing activities\n(\n4,019\n)\n(\n3,426\n)\n(\n2,597\n)\nEffect of exchange rate changes on cash\n76\n \n(\n41\n)\n(\n118\n)\nNet decrease in cash and cash equivalents\n(\n999\n)\n(\n355\n)\n(\n41\n)\nCash and cash equivalents at beginning of period\n6,501\n \n6,856\n \n6,897\n \nCash and cash equivalents at end of period\n$\n5,502\n \n$\n6,501\n \n$\n6,856\n \nThe accompanying notes are an integral part of these consolidated financial statements. \n-77-\nFEDEX CORPORATION\nCONSOLIDATED STATEMENTS OF CHANGES IN COMMON STOCKHOLDERS’ INVESTMENT \n(IN MILLIONS, EXCEPT SHARE DATA) \nCommon\nStock\nAdditional\nPaid-in\nCapital\nRetained\nEarnings\nAccumulated\nOther\nComprehensive\nLoss\nTreasury\nStock\nTotal\nBalance at May 31, 2022\n$\n32\n \n$\n3,712\n \n$\n32,782\n \n$\n(\n1,103\n)\n$\n(\n10,484\n)\n$\n24,939\n \nNet income\n— \n— \n3,972\n \n— \n— \n3,972\n \nOther comprehensive loss, net of tax of $\n27\n— \n— \n— \n(\n224\n)\n— \n(\n224\n)\nPurchases of common stock (\n9.2\n million shares)\n— \n(\n82\n)\n— \n— \n(\n1,418\n)\n(\n1,500\n)\nCash dividends declared ($\n5.86\n per share)\n— \n— \n(\n1,495\n)\n— \n— \n(\n1,495\n)\nEmployee incentive plans and other (\n1.9\n million shares issued)\n— \n139\n \n— \n— \n257\n \n396\n \nBalance at May 31, 2023\n32\n \n3,769\n \n35,259\n \n(\n1,327\n)\n(\n11,645\n)\n26,088\n \nNet income\n— \n— \n4,331\n \n— \n— \n4,331\n \nOther comprehensive loss, net of tax of $\n4\n— \n— \n— \n(\n32\n)\n— \n(\n32\n)\nPurchases of common stock (\n9.8\n million shares)\n— \n(\n22\n)\n— \n— \n(\n2,495\n)\n(\n2,517\n)\nCash dividends declared ($\n3.78\n per share)\n— \n— \n(\n941\n)\n— \n— \n(\n941\n)\nEmployee incentive plans and other (\n3.1\n million shares issued)\n— \n241\n \n— \n— \n412\n \n653\n \nBalance at May 31, 2024\n32\n \n3,988\n \n38,649\n \n(\n1,359\n)\n(\n13,728\n)\n27,582\n \nNet income\n— \n— \n4,092\n \n— \n— \n4,092\n \nOther comprehensive loss, net of tax of $\n19\n— \n— \n— \n(\n3\n)\n— \n(\n3\n)\nPurchases of common stock (\n10.9\n million shares)\n— \n(\n21\n)\n— \n— \n(\n2,999\n)\n(\n3,020\n)\nIssuance of treasury stock for acquisition\n— \n42\n \n— \n— \n48\n \n90\n \nCash dividends declared ($\n5.52\n per share)\n— \n— \n(\n1,339\n)\n— \n— \n(\n1,339\n)\nEmployee incentive plans and other (\n2.9\n million shares issued)\n— \n281\n \n— \n— \n391\n \n672\n \nBalance at May 31, 2025\n$\n32\n \n$\n4,290\n \n$\n41,402\n \n$\n(\n1,362\n)\n$\n(\n16,288\n)\n$\n28,074\n \nThe accompanying notes are an integral part of these consolidated financial statements. \n-78-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nNOTE 1: \nDESCRIPTION OF BUSINESS SEGMENTS AND SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nDESCRIPTION OF BUSINESS SEGMENTS.\n FedEx Corporation (“FedEx”) provides a broad portfolio of transportation, e-commerce, and business services, offering integrated business solutions utilizing our flexible, efficient, and intelligent global network. During the fiscal years ended May 31, 2025 and 2024, our primary operating companies were Federal Express Corporation (“Federal Express”), the world’s largest express transportation company and a leading North American provider of small-package ground delivery services, and FedEx Freight, Inc. (“FedEx Freight”), a leading North American provider of less-than-truckload (“LTL”) freight transportation services. \nIn connection with our one FedEx consolidation pl\nan, on June 1, 2024, FedEx Ground Package System, Inc. (“FedEx Ground”) and FedEx Corporate Services, Inc. (“FedEx Services”) were merged into Federal Express, becoming a single company operating a unified, fully integrated air-ground express network under the respected FedEx brand. FedEx Freight continues to provide LTL freight transportation services as a separate subsidiary. Beginning in the first quarter of 2025, Federal Express and FedEx Freight represent our major service lines and constitute our reportable segments. Additionally, the results of FedEx Custom Critical, Inc. (“FedEx Custom Critical”) are included in the FedEx Freight segment instead of the Federal Express segment in 2025. Prior-year amounts were revised to reflect this presentation.\nWe evaluated our reporting units with significant recorded goodwill during the fourth quarter of 2024, and the estimated fair value of each reporting unit exceeded its carrying value as of the end of 2024 immediately before our one FedEx consolidation. We reevaluated the conclusion of our 2024 goodwill impairment tests as of June 1, 2024 immediately after our one FedEx consolidation and concluded that the estimated fair values of our reporting units with significant goodwill continued to exceed their respective carrying values.\nIn December 2024, we announced that FedEx’s Board of Directors decided to pursue a full separation of FedEx Freight throu\ngh the capital markets, creating a new publicly traded company. The transaction, which would be implemented through the spin-off of shares of the new company to FedEx stockholders, is expected to be tax-free for U.S. federal income tax purposes for FedEx stockholders and be completed by June 2026.\nFISCAL YEARS\n. Except as otherwise specified, references to years indicate our fiscal year ended May 31, 2025 or ended May 31 of the year referenced, and comparisons are to the corresponding period of the prior year.\nIn January 2025, the Board of Directors approved a change in FedEx's fiscal year end from May 31 to December 31. The fiscal year change will be effective for the period beginning June 1, 2026.\nPRINCIPLES OF CONSOLIDATION\n. The consolidated financial statements include the accounts of FedEx and its subsidiaries, substantially all of which are wholly owned. All significant intercompany accounts and transactions have been eliminated in consolidation.\n \nREVENUE RECOGNITION\n. \nSatisfaction of Performance Obligation\nA performance obligation is a promise in a contract to transfer a distinct good or service to the customer, and is the basis of revenue recognition in accordance with U.S. generally accepted accounting principles (“GAAP”). To determine the proper revenue recognition method for contracts, we evaluate whether two or more contracts should be combined and accounted for as one single contract and whether the combined or single contract should be accounted for as more than one performance obligation. For most of our contracts, the customer contracts with us to provide distinct services within a single contract, primarily transportation services. Substantially all of our contracts with customers for transportation services include only one performance obligation, the transportation services themselves. However, if a contract is separated into more than one performance obligation, we allocate the total transaction price to each performance obligation in an amount based on the estimated relative standalone selling prices of the promised goods or services underlying each performance obligation. We frequently sell standard transportation services with observable standalone sales prices. In these instances, the observable standalone sales are used to determine the standalone selling price.\nFor transportation services, revenue is recognized over time as we perform the services in the contract because of the continuous transfer of control to the customer. Our customers receive the benefit of our services as the goods are transported from one location to another. If we were unable to complete delivery to the final location, another entity would not need to reperform the transportation service already performed. As control transfers over time, revenue is recognized based on the extent of progress towards completion of the performance obligation. The selection of the method to measure progress towards completion requires judgment and is based on the nature of the products or services to be provided. We use the cost-to-cost measure of progress for our package delivery contracts because it best depicts the transfer of control to the customer which occurs as we incur costs on our contracts. Under the cost-to-cost measure of progress, the extent of progress towards completion is measured based on the ratio of costs incurred to date to the total \n-79-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nestimated costs at completion of the performance obligation. Revenue, including ancillary or accessorial fees and reductions for estimated customer incentives, is recorded proportionally as costs are incurred. Costs to fulfill include labor and other direct costs and an allocation of indirect costs. For our FedEx Freight and freight forwarding contracts, an output method of progress based on time-in-transit is utilized as the timing of costs incurred does not best depict the transfer of control to the customer. \nWe also provide customized customer-specific solutions, such as supply chain management solutions and inventory and service parts logistics, through which we provide the service of integrating a complex set of tasks and components into a single capability. For these arrangements, the majority of which are conducted by our FedEx Logistics, Inc. (“FedEx Logistics”) operating segment, the entire contract is accounted for as one performance obligation. For these performance obligations, we typically have a right to consideration from customers in an amount that corresponds directly with the value to the customers of our performance completed to date, and as such we recognize revenue in the amount to which we have a right to invoice the customer. \nContract Modification\nContracts are often modified to account for changes in the rates we charge our customers or to add additional distinct services. We consider contract modifications to exist when the modification either creates new enforceable rights and obligations or alters the existing arrangement. Contract modifications that add distinct goods or services are treated as separate contracts. Contract modifications that do not add distinct goods or services typically change the price of existing services. These contract modifications are accounted for prospectively as the remaining performance obligations are distinct.\nVariable Consideration\nCertain contracts contain customer incentives, guaranteed service refunds, and other provisions that can either increase or decrease the transaction price. These incentives are generally awarded based upon achieving certain performance metrics. We estimate variable consideration as the most likely amount to which we expect to be entitled. We include estimated amounts of revenue, which may be reduced by incentives or other contract provisions, in the transaction price to the extent it is probable that a significant reversal of cumulative revenue recognized will not occur when the uncertainty associated with the variable consideration is resolved. Our estimates of variable consideration and determination of whether to include estimated amounts in the transaction price are based on an assessment of anticipated customer spending and all information (historical, current, and forecasted) that is reasonably available to us. \nPrincipal vs. Agent Considerations\nTransportation services are provided with the use of employees and independent businesses that contract with FedEx. GAAP requires us to evaluate whether our businesses themselves promise to transfer services to the customer (as the principal) or to arrange for services to be provided by another party (as the agent) using a control model. Based on our evaluation of the control model, we determined that FedEx is the principal to the transaction for most of these services and revenue is recognized on a gross basis based on the transfer of control to the customer. Costs associated with independent businesses providing transportation services are recognized as incurred and included within “Purchased transportation” in the accompanying consolidated statements of income. \nOur contract logistics, global trade services, and certain transportation businesses engage in certain transactions wherein they act as agents. Revenue from these transactions is recorded on a net basis. Net revenue includes billings to customers less third-party charges, including transportation or handling costs, fees, commissions, and taxes and duties.\nContract Assets and Liabilities\nContract assets include billed and unbilled amounts resulting from in-transit shipments, as we have an unconditional right to payment only once all performance obligations have been completed (e.g., packages have been delivered). Contract assets are generally classified as current, and the full balance is converted each quarter based on the short-term nature of the transactions. Our contract liabilities consist of advance payments and billings in excess of revenue. The full balance of deferred revenue is converted each quarter based on the short-term nature of the transactions. \nGross contract assets related to in-transit shipments totaled $\n673\n million and $\n672\n million at May 31, 2025 and May 31, 2024, respectively. Contract assets net of deferred unearned revenue were $\n526\n million and $\n463\n million at May 31, 2025 and May 31, 2024, respectively. Contract assets are included within “Receivables” in the accompanying consolidated balance sheets. Contract liabilities related to advance payments from customers were $\n23\n million and $\n23\n million at May 31, 2025 and May 31, 2024, respectively. Contract liabilities are included within “Accrued expenses” in the accompanying consolidated balance sheets.\nPayment Terms\nCertain of our revenue-producing transactions are subject to taxes and duties, such as sales tax, assessed by governmental authorities. We present these revenues net of tax. Under the typical payment terms of our customer contracts, the customer pays at periodic \n-80-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nintervals (e.g., every \n15\n days, \n30\n days, \n45\n days, etc.) for shipments included on invoices received. It is not customary business practice to extend payment terms past \n90\n days, and as such, we do not have a practice of including a significant financing component within our revenue contracts with customers.\nDisaggregation of Revenue\nSee \nNote 1\n5\n for disclosure of disaggregated revenue for the periods ended May 31. This presentation is consistent with how we organize our segments internally for making operating decisions and measuring performance.\nCREDIT RISK.\n We routinely grant credit to many of our customers for transportation and business services without collateral. The risk of credit loss in our trade receivables is substantially mitigated by our credit evaluation process, short collection terms, and sales to a large number of customers, as well as the low revenue per transaction for most of our services. Allowances for potential credit losses are determined based on historical experience and the impact of current economic conditions. Historically, credit losses have been within management’s expectations.\n \nADVERTISING. \nAdvertising and promotion costs are expensed as incurred and are classified in other operating expenses.\n Advertising and promotion expenses were $\n425\n million in 2025, $\n421\n million in 2024, and $\n435\n million in 2023. \nCASH EQUIVALENTS.\n Cash in excess of current operating requirements is invested in short-term, interest-bearing instruments with maturities of three months or less at the date of purchase and is stated at cost, which approximates market value.\n \nSPARE PARTS, SUPPLIES, AND FUEL. \nSpare parts (principally aircraft-related) are reported at weighted-average cost. Allowances for obsolescence are provided for spare parts currently identified as excess or obsolete as well as expected to be on hand at the date the aircraft are retired from service. These allowances are provided over the estimated useful life of the related aircraft and engines. The majority of our supplies and fuel are reported at weighted-average cost.\n \nPROPERTY AND EQUIPMENT\n. Expenditures for major additions, improvements, and flight equipment modifications are capitalized when such costs are determined to extend the useful life of the asset or are part of the cost of acquiring the asset. Expenditures for equipment overhaul costs of engines or airframes prior to their operational use are capitalized as part of the cost of such assets as they are costs required to ready the asset for its intended use. Maintenance and repairs costs are charged to expense as incurred, except for certain aircraft engine maintenance costs incurred under third-party service agreements. These agreements result in costs being expensed based on cycles or hours flown and are subject to annual escalation. These service contracts transfer risk to third-party service providers and generally fix the amount we pay for maintenance to the service provider as a rate per cycle or flight hour, in exchange for maintenance and repairs under a predefined maintenance program. We capitalize certain direct internal and external costs associated with the development of internal-use software, including implementation of cloud computing service arrangements. Gains and losses on sales of property used in operations are classified within operating expenses and historically have been nominal. \nFor financial reporting purposes, we record depreciation and amortization of property and equipment on a straight-line basis over the asset’s service life or related lease term, if shorter. For income tax purposes, depreciation is computed using accelerated methods when applicable.\n \nThe depreciable lives and net book value of our property and equipment are as follows (dollars in millions): \nNet Book Value at May 31,\nRange\n2025\n2024\nWide-body aircraft and related equipment\n18\n to \n30\n years\n$\n18,202\n \n$\n17,936\n \nNarrow-body and feeder aircraft and related equipment\n5\n to \n30\n years\n1,750\n \n1,849\n \nPackage handling and ground support equipment\n3\n to \n15\n years\n7,573\n \n7,607\n \nInformation technology\n3\n to \n7\n years\n1,568\n \n1,722\n \nVehicles and trailers\n3\n to \n15\n years\n4,075\n \n4,053\n \nFacilities and other\n1\n to \n33\n years\n8,474\n \n8,324\n \nSubstantially all property and equipment have no material residual values. The majority of aircraft costs are depreciated on a straight-line basis over \n18\n to \n30\n years\n. We\n periodically evaluate the estimated service lives and residual values used to depreciate our property and equipment.\nDepreciation and amortization expense, excluding gains and losses on sales of property and equipment used in operations, was $\n4.3\n billion in 2025, $\n4.3\n billion in 2024, and $\n4.2\n billion in 2023. Depreciation and amortization expense includes amortization of assets under finance leases.\n-81-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nCAPITALIZED INTEREST\n. Interest on funds used to finance the acquisition and modification of aircraft, including purchase deposits, construction of certain facilities, and development of certain software up to the date the asset is ready for its intended use, is capitalized and included in the cost of the asset if the asset is actively under construction.\n Capitalized interest was $\n55\n million in 2025, $\n81\n million in 2024, and $\n77\n million in 2023.\nIMPAIRMENT OF LONG-LIVED ASSETS. \nLong-lived assets are reviewed for impairment when circumstances indicate the carrying value of an asset may not be recoverable. For assets that are to be held and used, an impairment is recognized when the estimated undiscounted cash flows associated with the asset or group of assets is less than their carrying value. If impairment exists, an adjustment is made to write the asset down to its fair value, and a loss is recorded as the difference between the carrying value and fair value. Fair values are determined based on quoted market values, discounted cash flows, or internal and external appraisals, as applicable. Assets to be disposed of are carried at the lower of carrying value or estimated net realizable value. \nWe operate integrated transportation networks so cash flows for most of our operating assets to be held and used are assessed at a network level, not at an individual asset level, for our analysis of impairment. \nIn 2025 we made the decision to permanently retire from service \n12\n aircraft and \neight\n related engines, resulting in a noncash impairment charge of $\n21\n million ($\n16\n million, net of tax, or $\n0.06\n per diluted share). These retirements included \ntwo\n Boeing 757-200 aircraft, \nseven\n Airbus A300-600 aircraft, \nthree\n Boeing MD-11 aircraft, and align with Federal Express’s fleet reduction and modernization strategy as we continue to improve our global network efficiency and better align air network capacity with anticipated demand. All of these permanently retired aircraft were temporarily idled and not in revenue service.\nIn 2024, we made the decision to permanently retire from service \n22\n Boeing 757-200 aircraft and \nseven\n related engines to align with Federal Express’s fleet reduction and modernization strategy. As a consequence of this decision, a noncash impairment charge of $\n157\n million ($\n120\n million, net of tax, or $\n0.48\n per diluted share) was recorded in 2024.\nIn 2023, we made the decision to permanently retire from service \n12\n Boeing MD-11F aircraft and \n25\n related engines, \nfour\n Boeing 757-200 aircraft and \none\n related engine, and \ntwo\n Airbus A300-600 aircraft and \neight\n related engines for the same reasons stated above. As a consequence of this decision, a noncash impairment charge of $\n70\n million ($\n54\n million, net of tax, or $\n0.21\n per diluted share) was recorded in 2023.\nIn 2023 we accelerated the retirement of the entire Boeing MD-11 fleet by the end of 2028. In 2025 we made the decision to extend the retirement plan to have the fleet retired by the end of 2032 to better align air network capacity of Federal Express to match current and anticipated shipment volumes. As a result of this decision, we had a net decrease in depreciation expense in 2025 of $\n19\n million.\nIn the normal management of our aircraft fleet, we routinely idle aircraft and engines temporarily due to maintenance cycles and adjustments of our network capacity to match seasonality and overall customer demand levels. Temporarily idled assets are classified as available-for-use, and we continue to record depreciation expense associated with these assets. These temporarily idled assets are assessed for impairment and remaining life on a quarterly basis. The criteria for determining whether an asset has been permanently removed from service (and, as a result, is potentially impaired) include, but are not limited to, our global economic outlook and the impact of our outlook on our current and projected volume levels, including capacity needs during our peak shipping seasons; the introduction of new fleet types or decisions to permanently retire an aircraft fleet from operations; and changes to planned service expansion activities. At May 31, 2025, we had \n22\n aircraft temporarily idled. These aircraft have been idled for an average of \nten months\n and are expected to return to revenue service i\nn order to meet expected demand.\nGOODWILL. \nGoodwill is recognized for the excess of the purchase price over the fair value of tangible and identifiable intangible net assets of businesses acquired. Several factors give rise to goodwill in our acquisitions, such as the expected benefits from synergies of the combination and the existing workforce of the acquired business. Goodwill is reviewed at least annually for impairment. In our evaluation of goodwill impairment, we perform a qualitative assessment to determine if it is more likely than not that the fair value of a reporting unit is less than its carrying amount. If the qualitative assessment is not conclusive, we proceed to test goodwill for impairment, including comparing the fair value of the reporting unit to its carrying value (including attributable goodwill). Fair value for our reporting units is determined using an income or market approach incorporating market participant considerations and management’s assumptions on revenue growth rates, operating margins, discount rates, and expected capital expenditures. Fair value determinations may include both internal and third-party valuations. Unless circumstances otherwise dictate, we perform our annual impairment testing in the fourth quarter.\n See \nNote 5\n for additional information.\nINTANGIBLE ASSETS\n. Intangible assets primarily include customer relationships, technology assets, and trademarks acquired in business combinations. Intangible assets are amortized over periods ranging from \n1\n to \n15\n years\n, either\n on a straight-line basis or on a basis consistent with the pattern in which the economic benefits are realized.\n See \nNote 5\n for additional information. \nPENSION AND POSTRETIREMENT HEALTHCARE PLANS.\n Our defined benefit pension and other postretirement benefit plans are measured using actuarial techniques that reflect management’s assumptions for discount rate, investment returns on plan assets, salary \n-82-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nincreases, expected retirement, mortality, and employee turnover. We determine the discount rate (which is required to be the rate at which the projected benefit obligation (“PBO”) could be effectively settled as of the measurement date) with the assistance of actuaries, who calculate the yield on a theoretical portfolio of high-grade corporate bonds (rated Aa or better) with cash flows that are designed to match our expected benefit payments in future years. We use the fair value of plan assets to calculate the expected return on assets (“EROA”) for interim and segment reporting purposes. Our EROA is a judgmental estimate which is reviewed on an annual basis and revised as appropriate. \nThe accounting guidance related to employers’ accounting for defined benefit pension and other postretirement plans requires recognition in the balance sheet of the funded status of these plans. We use “mark-to-market” (or “MTM”) accounting and immediately recognize changes in the fair value of plan assets and actuarial gains or losses in our results annually in the fourth quarter each year. The annual MTM adjustment is recognized at the corporate level and does not impact segment results. The remaining components of pension and postretirement healthcare expense, primarily service and interest costs and the EROA, are recorded on a quarterly basis. Only service cost is recognized in segment level operating results.\nINCOME TAXES.\n Deferred income taxes are provided for the tax effect of temporary differences between the tax basis of assets and liabilities and their reported amounts in the financial statements. The liability method is used to account for income taxes, which requires deferred taxes to be recorded at the statutory rate expected to be in effect when the taxes are paid. \nDeferred income tax assets represent amounts available to reduce income taxes payable on taxable income in future years. Such assets arise because of temporary differences between the financial reporting and tax bases of assets and liabilities, as well as from net operating loss, capital loss, and tax credit carryforwards. We evaluate the recoverability of these future tax deductions and credits by assessing the adequacy of future expected taxable income from all sources, including reversal of taxable temporary differences, forecasted operating earnings, and available tax planning strategies. These sources of income rely heavily on estimates to make this determination and, as a result, there is a risk that these estimates will have to be revised as new information is received. To the extent we do not consider it more likely than not that a deferred tax asset will be recovered, a valuation allowance is established. We believe we will generate sufficient future taxable income to realize the tax benefits related to the remaining net deferred tax assets in the consolidated balance sheets that are not subject to valuation allowances. We record the taxes for global intangible low-taxed income as a period cost.\nWe recognize liabilities for uncertain income tax positions based on a two-step process. The first step is to evaluate the tax position for recognition by determining if the weight of available evidence indicates that it is more likely than not that the position will be sustained on audit, including resolution of related appeals or litigation processes, if any. The second step requires us to estimate and measure the tax benefit as the largest amount that is more than 50% likely to be realized upon ultimate settlement. It is inherently difficult and subjective to estimate such amounts, as we must determine the probability of various possible outcomes. We reevaluate these uncertain tax positions on a quarterly basis or when new information becomes available to management. These reevaluations are based on factors including, but not limited to, changes in facts or circumstances, changes in tax law, successfully settled issues under audit, and new audit activity. Such a change in recognition or measurement could result in the recognition of a tax benefit or an increase to the related provision. \nWe classify interest related to income tax liabilities as interest expense, and if applicable, penalties are recognized as a component of income tax expense. The income tax liabilities and accrued interest and penalties that are due within one year of the balance sheet date are presented as current liabilities. The noncurrent portion of our income tax liabilities and accrued interest and penalties are included within “Other liabilities” in the accompanying consolidated balance sheets.\n \nSELF-INSURANCE ACCRUALS.\n We are self-insured for costs associated with workers’ compensation claims, vehicle accidents, property and cargo loss, general business liabilities, and benefits paid under employee disability programs. Accruals are primarily based on the actuarially estimated cost of claims, which includes incurred-but-not-reported claims. Current workers’ compensation claims, vehicle and general liability, and long-term disability are included within “Accrued expenses” in the accompanying consolidated balance sheets. We self-insure up to certain limits that vary by operating company and type of risk. Claims costs are recognized on a gross basis and a receivable is recorded for amounts covered by third-party insurance. Periodically, we evaluate the level of insurance coverage and adjust insurance levels based on risk tolerance and premium expense.\nWe are also self-insured for certain short-term employee healthcare claims, which are included within “Accrued expenses” in the accompanying consolidated balance sheets.\n \nLEASES.\n We lease certain facilities, aircraft, equipment, and vehicles under operating and finance leases. A determination of whether a contract contains a lease is made at the inception of the arrangement. Our leased facilities include national, regional, and metropolitan sorting facilities; retail facilities; and administrative buildings. \n-83-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nOur leases generally contain options to extend or terminate the lease. We reevaluate our leases on a regular basis to consider the economic and strategic incentives of exercising the renewal options, and how they align with our operating strategy. Therefore, substantially all the renewal option periods are not included within the lease term and the associated payments are not included in the measurement of the right-of-use asset and lease liability as the options to extend are not reasonably certain at lease commencement. Short-term leases with an initial term of 12 months or less are not recognized in the right-of-use asset and lease liability within the consolidated balance sheets.\nThe lease liabilities are measured at the lease commencement date and determined using the present value of the minimum lease payments not yet paid and our incremental borrowing rate, which approximates the rate at which we would borrow, on a collateralized basis, over the term of a lease in the applicable currency environment. The interest rate implicit in the lease is generally not determinable in transactions where we are the lessee. \nFor real estate leases, we account for lease components and non-lease components (such as common area maintenance) as a single lease component. Certain real estate leases require additional payments based on sales volume and index-based rate increases, as well as reimbursement for real estate taxes, common area maintenance, and insurance, which are expensed as incurred as variable lease costs. Certain leases contain fixed lease payments for items such as real estate taxes, common area maintenance, and insurance. These fixed payments are considered part of the lease payment and included in the right-of-use asset and lease liability. See \nNote 8\n for additional information.\nDERIVATIVE FINANCIAL INSTRUMENTS. \nWe record all derivatives on the balance sheet at fair value. The accounting for changes in the fair value of derivatives depends on the intended use of the derivative, whether we have elected to designate a derivative in a hedging relationship and apply hedge accounting, and whether the hedging relationship has satisfied the criteria necessary to apply hedge accounting. Derivatives designated and qualifying as a hedge of the exposure to changes in the fair value of an asset, liability, or firm commitment attributable to a particular risk, such as interest rate risk, are considered fair value hedges. Derivatives designated and qualifying as a hedge of the exposure to variability in expected future cash flows, or other types of forecasted transactions, are considered cash flow hedges. Derivatives may also be designated as hedges of the foreign currency exposure of a net investment in a foreign operation. Hedge accounting generally provides for the matching of the timing of gain or loss recognition on the hedging instrument with the recognition of the changes in the fair value of the hedged asset or liability that are attributable to the hedged risk in a fair value hedge or the earnings effect of the hedged forecasted transactions in a cash flow hedge. We may enter into derivative contracts that are intended to economically hedge certain of our risk, even though hedge accounting does not apply or we elect not to apply hedge accounting. We are not subject to any master netting agreements.\n \nSUPPLIER FINANCE PROGRAM. \nWe offer voluntary Supply Chain Finance (“SCF”) programs through financial institutions to certain of our suppliers. We agree to commercial terms with our suppliers, including prices, quantities, and payment terms, and they issue invoices to us based on the agreed-upon contractual terms. If our suppliers choose to participate in the SCF programs, they determine which invoices, if any, to sell to the financial institutions to receive an early discounted payment, while we settle the invoice amount with the financial institutions on the payment due dates. We guarantee these payments with the financial institutions.\nAmounts due to our suppliers that participate in the SCF programs are included within “Accounts payable” in the accompanying consolidated balance sheets.\n We have been informed by the participating financial institutions that as of May 31, 2025 and May 31, 2024, suppliers have been approved to sell to them $\n71\n million and $\n94\n million, respectively, of our outstanding payment obligations. \nA rollforward of obligations confirmed and paid during the years ended May 31 is presented below (in millions):\n2025\n2024\nConfirmed obligations outstanding at the beginning of the year\n$\n94\n \n$\n83\n \nInvoices confirmed during the year\n625\n \n686\n \nConfirmed invoices paid during the year\n(\n651\n)\n(\n678\n)\nCurrency translation adjustments\n3\n \n3\n \nConfirmed obligations outstanding at the end of the year\n$\n71\n \n$\n94\n \nFOREIGN CURRENCY TRANSLATION.\n Translation gains and losses of foreign operations that use local currencies as the functional currency are accumulated and reported, net of applicable deferred income taxes, as a component of accumulated other comprehensive loss (“AOCL”) within “Common stockholders’ investment” in the accompanying consolidated balance sheets. Transaction gains and losses that arise from exchange rate fluctuations on transactions denominated in a currency other than the local currency are included within “Other, net” in the accompanying consolidated statements of income and were immaterial for each period presented.\n \nEMPLOYEES UNDER COLLECTIVE BARGAINING ARRANGEMENTS.\n Our pilots, who are a small number of our total employees, are represented by the Air Line Pilots Association, International (“ALPA”) and are employed under a collective bargaining agreement that took effect on November 2, 2015. The agreement became amendable in November 2021. Bargaining for a successor agreement \n-84-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nbegan in May 2021, and in November 2022 the National Mediation Board (“NMB”) began actively mediating the negotiations. In July 2023, the pilots failed to ratify the tentative successor agreement that was approved by ALPA’s FedEx Master Executive Council the prior month. Bargaining for a successor agreement continues. In April 2024, the NMB rejected ALPA’s request for a proffer of arbitration. The conduct of mediated negotiations has no effect on our operations. Once a new agreement is ratified, we may amend our pension plan offered to the pilots, which would result in a remeasurement of our pension benefit obligation.\n \nINVESTMENTS IN EQUITY AND DEBT SECURITIES. \nInvestments in equity securities with a readily determinable fair value are carried at fair value. For equity securities without readily determinable fair values that qualify for the net asset value (“NAV”) practical expedient, we have elected to apply the NAV practical expedient to estimate fair value. Changes in fair value are included in “Other income (expense)” in the accompanying consolidated statements of income.\nWe apply the measurement alternative to all other investments in equity securities without a readily determinable fair value. Under the measurement alternative these equity securities are accounted for at cost, with adjustments for observable changes in prices and impairments included within “Other income (expense)” in the accompanying consolidated statements of income. We perform a qualitative assessment each reporting period to evaluate whether these equity securities are impaired. Our assessment includes a review of recent operating results and trends and other publicly available data. If an investment is impaired, we write it down to its estimated fair value.\nInvestments in debt securities, which are considered short-term investments, are classified as “available-for-sale” and are carried at fair value. Realized gains and losses on available-for-sale debt securities are included within “Other income (expense)” in the accompanying consolidated statements of income while unrealized gains and losses, net of tax, are included within AOCL in the accompanying consolidated balance sheet. \nInvestments in equity securities and debt securities are included within “Other assets” and “Prepaid expenses and other,” respectively, in the accompanying consolidated balance sheets.\nSTOCK-BASED COMPENSATION.\n The accounting guidance related to share-based payments requires recognition of compensation expense for stock-based awards using a fair value method. We use the Black-Scholes option pricing model to calculate the fair value of stock options. The value of restricted stock awards and restricted stock units (“RSUs”) are based on the stock price of the award on the grant date. We record stock-based compensation expense within “Salaries and employee benefits” in the accompanying consolidated statements of income. We issue new shares or treasury shares from stock repurchases to cover employee stock option exercises and restricted stock grants. Shares not issued for restricted stock grants are available to be issued for stock option grants.\n \nTREASURY SHARES. \nIn \nDecember 2021\n, our Board of Directors authorized a stock repurchase program of up to \n$\n5.0\n billion\n of FedEx common stock.\n \nIn \nMarch 2024\n, our Board of Directors authorized a new stock repurchase program for additional repurchases of up to \n$\n5.0\n billion\n of FedEx common stock.\n As of June 1, 2024, $\n5.1\n billion remained available to be used for repurchases under the 2021 and 2024 programs.\nDuring 2025, we repurchased \n10.9\n million shares of FedEx common stock under accelerated share repurchase (\"ASR\") transactions with \ntwo\n banks and open market transactions at an average price of $\n274.34\n per share for a total of $\n3.0\n billion. Share repurchases had a benefit of $\n0.44\n per diluted share in 2025. In fiscal 2026 we have completed $\n500\n million of share repurchases through open market transactions and as of July 21, 2025, $\n1.6\n billion remained available to be used for repurchases under the 2024 program, which is the only program that currently exists. During 2024, we repurchased \n9.8\n million shares of FedEx common stock at an average price of $\n255.34\n per share for a total of $\n2.5\n billion. During 2023, we repurchased \n9.2\n million shares of FedEx common stock at an average price of $\n163.39\n per share for a total of $\n1.5\n billion.\nThe final number of shares delivered upon settlement of the ASR agreements was determined based on a discount to the volume-weighted average price of our stock during the term of the transaction. The repurchased shares were accounted for as a reduction within “Common stockholders’ investment” in the accompanying consolidated balance sheets and resulted in a reduction of the outstanding shares used to calculate the weighted-average common shares outstanding for basic and diluted earnings per share. \nShares under the 2024 repurchase program may be repurchased from time to time in the open market or in privately negotiated transactions. The timing and volume of repurchases are at the discretion of management, based on the capital needs of the business, the market price of FedEx common stock, and general market conditions. No time limits were set for the completion of the programs, however the programs may be suspended or discontinued at any time.\nDIVIDENDS DECLARED PER COMMON SHARE.\n On June 9, 2025, our Board of Directors declared a quarterly cash dividend of $\n1.45\n per share of common stock. The dividend was paid on July 8, 2025 to stockholders of record as of the close of business on June 23, 2025. Each quarterly dividend payment is subject to review and approval by our Board of Directors, and we evaluate our dividend payment amount on an annual basis. There are no material restrictions on our ability to declare dividends, nor are there any material restrictions on the ability of our subsidiaries to transfer funds to us in the form of cash dividends, loans, or advances.\n-85-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nB\nUSINESS OPTIMIZATION AND REALIGNMENT COSTS\n. In the second quarter of 2023, we announced DRIVE, a comprehensive program to improve long-term profitability. This program includes a business optimization plan to drive efficiency within and among our transportation segments, lower our overhead and support costs, and transform our digital capabilities. We have commenced our plan to consolidate our sortation facilities and equipment, reduce pickup-and-delivery routes, and optimize our enterprise linehaul network by moving beyond discrete collaboration to an end-to-end optimized network through Network 2.0, the multi-year effort to improve the efficiency with which FedEx picks up, transports, and delivers packages in the U.S. and Canada.\nWe have implemented Network 2.0 optimization in approximately \n290\n locations in the U.S and Canada as of May 31, 2025. Service providers will handle the pickup and delivery of Federal Express packages in some locations while employee couriers will handle others. We completed Canada’s implementation of Network 2.0 in the fourth quarter of 2025.\nIn June 2024, Federal Express announced a workforce reduction plan in Europe as part of its ongoing measures to reduce structural costs. The plan will impact approximately \n1,400\n employees in Europe across back-office and commercial functions. The execution of the plan is subject to a consultation process that is expected to occur over an \n18-month\n period in accordance with local country processes and regulations. We expect savings from the plan to be approximately $\n150\n million on an annualized basis beginning in calendar 2026.\nWe expect the pre-tax cost of the severance benefits and legal and professional fees to be provided under and related to our workforce reduction plan in Europe to range from $\n250\n million to $\n275\n million in cash expenditures through fiscal 2026. The timing and amount of our business optimization expenses and the related cost savings from the workforce reduction plan may change as we revise and implement our plans. The identification of costs as business optimization-related expenditures is subject to our disclosure controls and procedures.\nWe incurred business optimization costs of $\n756\n million ($\n577\n million, net of tax, or $\n2.37\n per diluted share) in 2025, including $\n235\n million of costs related to the workforce reduction plan in Europe. These costs were primarily related to professional services and severance, and are included in Federal Express and Corporate, other, and eliminations. We incurred costs associated with our business optimization activities of $\n582\n million ($\n444\n million, net of tax, or $\n1.77\n per diluted share) in 2024. These costs were primarily related to professional services and severance and are included in Corporate, other, and eliminations and Federal Express. We incurred costs associated with our business optimization activities of $\n273\n million ($\n209\n million, net of tax, or $\n0.81\n per diluted share) in 2023. These costs were primarily related to consulting services, severance, professional fees, and idling our operations in Russia. These business optimization costs are included in Corporate, other, and eliminations and Federal Express. The aggregate pre-tax cost of our business optimization activities was $\n1.6\n billion through 2025.\nIn 2021, Federal Express announced a workforce reduction plan in Europe related to the network integration of TNT Express. The plan affected approximately \n5,000\n employees in Europe across operational teams and back-office functions and was completed during 2023. We incurred costs of $\n36\n million ($\n27\n million, net of tax, or $\n0.11\n per diluted share) in 2023 associated with our business realignment activities. These costs were related to certain employee severance arrangements. Payments under this program totaled approximately $\n118\n million in 2023. The cumulative pre-tax cost of our business realignment activities was approximately $\n430\n million. We did \nno\nt incur any costs related to business realignment activities in 2024 or 2025.\nFEDEX FREIGHT SPIN-OFF COSTS. \nWe incurred costs related to the planned spin-off of FedEx Freight of $\n56\n million ($\n44\n million, net of tax, or $\n0.18\n per diluted share) in 2025. These costs are included in Corporate, other, and eliminations and consist of $\n38\n million of professional and legal fees included within “Other” operating expenses and $\n18\n million related to the debt exchange offer and consent solicitation transactions discussed in \nNote 7\n included within “Other, net” in the accompanying consolidated statements of income. We did not incur any FedEx Freight spin-off costs in 2024.\nUSE OF ESTIMATES\n. The preparation of our consolidated financial statements requires the use of estimates and assumptions that affect the reported amounts of assets and liabilities, the reported amounts of revenue and expenses, and the disclosure of contingent liabilities. Management makes its best estimate of the ultimate outcome for these items based on historical trends and other information available when the financial statements are prepared. Changes in estimates are recognized in accordance with the accounting rules for the estimate, which is typically in the period when new information becomes available to management. Areas where the nature of the estimate makes it reasonably possible that actual results could materially differ from amounts estimated include self-insurance accruals, retirement plan obligations, long-term incentive accruals, tax liabilities, loss contingencies, litigation claims, impairment assessments on long-lived assets (including goodwill) that rely on projections of future cash flows, and purchase price allocations.\nNOTE 2: \nRECENT ACCOUNTING GUIDANCE\nNew accounting rules and disclosure requirements can significantly affect our reported results and the comparability of our financial statements. We believe the following new accounting guidance is relevant to the readers of our financial statements.\n-86-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nRecently Adopted Accounting Standards\nIn November 2023, the Financial Accounting Standards Board (“FASB”) issued Accounting Standards Update (“ASU”) 2023-07, Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures, which expands disclosures about a public entity’s reportable segments and requires more enhanced information about a reportable segment’s expenses, interim segment profit or loss, and how a public entity’s chief operating decision maker uses reported segment profit or loss information in assessing segment performance and allocating resources. We adopted this standard effective June 1, 2024 (fiscal 2025). The adoption of this standard did not have a material effect on our consolidated financial statements or internal controls. See \nNote 15\n for further discussion about segment reporting. \nNew Accounting Standards and Accounting Standards Not Yet Adopted \nIn December 2023, the FASB issued ASU 2023-09, Income Taxes (Topic 740): Improvements to Income Tax Disclosures, which expands disclosures in an entity’s income tax rate reconciliation table and regarding cash taxes paid both in the U.S. and foreign jurisdictions. The update will be effective for annual periods beginning after December 15, 2024 (fiscal 2026). We are assessing the effect of this update on our consolidated financial statements and related disclosures. \nIn March 2024, the Securities and Exchange Commission (“SEC”) adopted final rules requiring public entities to provide certain climate-related information in their registration statements and annual reports. As part of the disclosures, entities would have been required to quantify certain effects of severe weather events and other natural conditions in a note to their audited financial statements. The rules were originally scheduled to be effective for annual periods beginning in calendar 2025. In April 2024, the SEC voluntarily stayed implementation of the final rules pending certain legal challenges and in February 2025 requested that the court not schedule the matter for argument in order to allow time for the SEC to determine appropriate next steps. In March 2025, the SEC withdrew its defense of the rules. We are currently evaluating the status of these rules and the related litigation. \nIn November 2024, the FASB issued ASU 2024-03, Income Statement–Reporting Comprehensive Income–Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses, which expands disclosures about specific expense categories at interim and annual reporting periods. The update will be effective for annual periods beginning after December 15, 2026 and interim periods beginning after December 15, 2027. We are assessing the effect of this update on our consolidated financial statements and related disclosures.\nOther accounting pronouncements issued, but not effective until after May 31, 2025, are not expected to have a material impact on our consolidated financial statements, related disclosures, or internal controls.\nNOTE 3: \nCREDIT LOSSES\nWe are exposed to credit losses primarily through our trade receivables. We assess ability to pay for certain customers by conducting a credit review, which considers the customer’s established credit rating and our assessment of creditworthiness. We determine the allowance for credit losses on accounts receivable using a combination of specific reserves for accounts that are deemed to exhibit credit loss indicators and general reserves that are determined using loss rates based on historical write-offs by geography and recent forecast information, including underlying economic expectations. We update our estimate of credit loss reserves quarterly. \nCredit losses were $\n521\n million in 2025, $\n421\n million in 2024, and $\n696\n million in 2023. Our allowance for credit losses was $\n438\n million at May 31, 2025 and $\n436\n million at May 31, 2024.\n \nNOTE 4: \nBUSINESS COMBINATIONS\nOn February 4, 2025, we acquired RouteSmart Technologies, Inc. (“RouteSmart”), a global leader in route planning and optimization solutions, for $\n113\n million in FedEx common shares from treasury stock and cash from operations. The majority of the purchase price was allocated to intangible assets and goodwill. The financial results of RouteSmart are included in the FedEx Dataworks, Inc. (“FedEx Dataworks”) operating segment under “Corporate, other and eliminations” from the date of acquisition and were not material to our results of operations or financial condition; therefore, pro forma financial information has not been provided.\n-87-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nNOTE 5: \nGOODWILL AND OTHER INTANGIBLE ASSETS\nGOODWILL.\n \nThe carrying amount of goodwill attributable to each reportable operating segment and changes therein are as follows (in millions): \nFederal Express\nSegment\nFedEx Freight\nSegment\nCorporate, Other, and Eliminations\nTotal\nGoodwill at May 31, 2023\n$\n5,781\n \n$\n771\n \n$\n1,961\n \n$\n8,513\n \nAccumulated impairment charges\n—\n \n(\n133\n)\n(\n1,945\n)\n(\n2,078\n)\nBalance as of May 31, 2023\n5,781\n \n638\n \n16\n \n6,435\n \nOther\n(1)\n(\n12\n)\n—\n \n—\n \n(\n12\n)\nBalance as of May 31, 2024\n5,769\n \n638\n \n16\n \n6,423\n \nGoodwill acquired\n(2)\n38\n \n—\n \n—\n \n38\n \nOther\n(1)\n142\n \n—\n \n—\n \n142\n \nBalance as of May 31, 2025\n$\n5,949\n \n$\n638\n \n$\n16\n \n$\n6,603\n \nAccumulated goodwill impairment charges as of May 31, 2025\n$\n—\n \n$\n(\n133\n)\n$\n(\n1,945\n)\n$\n(\n2,078\n)\n(1)\nPrimarily currency translation adjustments. \n(2)\nGoodwill acquired related to the acquisition of RouteSmart Technologies. See \nNote 4\n for more information.\nWe evaluated each of our reporting units during the fourth quarters of 2025 and 2024 and the estimated fair value of each of our reporting units exceeded their carrying values as of the end of 2025 and 2024; therefore, \nno\n impairment was recorded during any of the years presented.\nIn connection with our annual impairment testing of goodwill conducted in the fourth quarter of 2023, we recorded an \nimpairment charge\n of $\n36\n million for all of the goodwill attributable to our FedEx Dataworks reporting unit. The key factors contributing to the goodwill impairment were underperformance of the ShopRunner business during 2023, including base business erosion, and the failure to attain the level of operating synergies and revenue and profit growth anticipated at the time of acquisition. Based on these factors, our outlook for the business changed in the fourth quarter of 2023.\nOTHER INTANGIBLE ASSETS\n. \nThe summary of our intangible assets and related accumulated amortization at May 31, 2025 and 2024 is as follows (in millions):  \n2025\n2024\nGross\nCarrying\nAmount\nAccumulated\nAmortization\nNet Book\nValue\nGross\nCarrying\nAmount\nAccumulated\nAmortization\nNet Book\nValue\nCustomer relationships\n$\n580\n \n$\n(\n454\n)\n$\n126\n \n$\n570\n \n$\n(\n405\n)\n$\n165\n \nTechnology\n132\n \n(\n53\n)\n79\n \n62\n \n(\n46\n)\n16\n \nTrademarks and other\n1\n \n(\n1\n)\n—\n \n1\n \n(\n1\n)\n—\n \nTotal\n$\n713\n \n$\n(\n508\n)\n$\n205\n \n$\n633\n \n$\n(\n452\n)\n$\n181\n \nAs part of our review of long-lived assets in the fourth quarter of 2025 and 2024, there were \nno\n impairments recorded for our reporting units. During the fourth quarter of 2023, we recognized an $\n11\n million asset impairment charge related to customer relationships from the ShopRunner acquisition.\nAmortization expense for intangible assets was $\n48\n million in 2025, $\n47\n million in 2024, and $\n52\n million in 2023.\nExpected amortization expense for the next five years is as follows (in millions): \n2026\n$\n54\n \n2027\n53\n \n2028\n50\n \n2029\n11\n \n2030\n$\n10\n \n-88-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nNOTE 6: \nSELECTED CURRENT LIABILITIES\nThe components of selected current liability captions at May 31 were as follows (in millions)\n2025\n2024\nAccrued salaries and employee benefits\nSalaries\n$\n1,083\n \n$\n757\n \nEmployee benefits, including variable compensation\n796\n \n977\n \nCompensated absences\n852\n \n939\n \n$\n2,731\n \n$\n2,673\n \nAccrued expenses\nSelf-insurance accruals\n$\n1,858\n \n$\n1,931\n \nTaxes other than income taxes\n372\n \n334\n \nOther\n2,765\n \n2,697\n \n$\n4,995\n \n$\n4,962\n \nNOTE 7: \nLONG-TERM DEBT AND OTHER FINANCING ARRANGEMENTS \nThe components of long-term debt (net of discounts and debt issuance costs), along with maturity dates for the years subsequent to May 31, 2025, are as follows (in millions):\nMay 31,\nInterest Rate %\nMaturity\n2025\n2024\nSenior secured debt:\n1.875\n \n2034\n$\n729\n \n$\n780\n \nSenior unsecured debt:\n3.25\n \n2026\n749\n \n748\n \n3.40\n \n2028\n498\n \n498\n \n4.20\n \n2029\n398\n \n398\n \n3.10\n-\n4.25\n2030\n1,738\n \n1,739\n \n2.40\n \n2031\n992\n \n992\n \n4.90\n \n2034\n496\n \n497\n \n3.90\n \n2035\n495\n \n495\n \n3.25\n \n2041\n740\n \n740\n \n3.875\n-\n4.10\n2043\n985\n \n986\n \n5.10\n \n2044\n742\n \n743\n \n4.10\n \n2045\n641\n \n642\n \n4.55\n-\n4.75\n2046\n2,462\n \n2,464\n \n4.40\n \n2047\n736\n \n737\n \n4.05\n \n2048\n986\n \n987\n \n4.95\n \n2049\n835\n \n836\n \n5.25\n \n2050\n1,225\n \n1,227\n \n4.50\n \n2065\n245\n \n246\n \n7.60\n \n2098\n237\n \n237\n \nEuro senior unsecured debt:\n0.45\n \n2026\n569\n \n542\n \n1.625\n \n2027\n1,422\n \n1,353\n \n0.45\n \n2029\n679\n \n647\n \n1.30\n \n2032\n566\n \n539\n \n0.95\n \n2033\n734\n \n699\n \nTotal senior unsecured debt\n19,170\n \n18,992\n \nFinance lease obligations\n680\n \n431\n \n20,579\n \n20,203\n \nLess current portion\n1,428\n \n68\n \n$\n19,151\n \n$\n20,135\n \nInterest on our U.S. dollar fixed-rate notes is paid semi-annually. Interest on our euro fixed-rate notes is paid annually. The weighted-average interest rate on long-term debt was \n3.5\n% as of May 31, 2025. Long-term debt, including current maturities and exclusive of \n-89-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nfinance leases, had estimated fair values of $\n17.2\n billion at May 31, 2025 and $\n17.5\n billion at May 31, 2024. The estimated fair values were determined based on quoted market prices and the current rates offered for debt with similar terms and maturities. The fair value of our long-term debt is classified as Level 2 within the fair value hierarchy. This classification is defined as a fair value determined using market-based inputs other than quoted prices that are observable for the liability, either directly or indirectly. \nWe have a shelf registration statement filed with the SEC that allows us to sell, in one or more future offerings, any combination of our unsecured debt securities and common stock and allows pass-through trusts formed by Federal Express to sell, in one or more future offerings, pass-through certificates.\nFederal Express has issued $\n970\n million of Pass-Through Certificates, Series 2020-1AA (the “Certificates”) with a fixed interest rate of \n1.875\n% due in February 2034 utilizing pass-through trusts. The Certificates are secured by 19 Boeing aircraft with a net book value of $\n1.6\n billion at May 31, 2025. The payment obligations of Federal Express in respect of the Certificates are fully and unconditionally guaranteed by FedEx. \nThe following table sets forth the future scheduled principal payments due by fiscal year on our long-term debt (in millions):\nDebt Principal\n2026\n$\n1,371\n \n2027\n1,476\n \n2028\n552\n \n2029\n1,135\n \n2030\n1,802\n \nThereafter\n13,777\n \nSubtotal\n20,113\n \nDiscount and debt issuance costs\n$\n(\n214\n)\nTotal debt\n$\n19,899\n \nExchange Offers and Consent Solicitations\nIn January 2025, in connection with the planned separation of FedEx Freight, we commenced offers to exchange any and all of $\n16.2\n billion of FedEx’s outstanding senior notes (22 series in total) for new notes to be issued by FedEx. Concurrently with the exchange offers, we also solicited consents from eligible holders of such notes to adopt certain proposed amendments to each of the indentures governing such notes to provide for the automatic and unconditional release and discharge of the guarantee of FedEx Freight with respect to that series of notes at the time FedEx Freight ceases to be a subsidiary of FedEx in connection with the planned separation (the “Proposed Amendments”).\nWe completed the exchange offers and consent solicitations in February 2025. An aggregate of $\n10.7\n billion principal amount of U.S. dollar-denominated notes and €\n940\n million principal amount of euro-denominated notes were validly tendered and not properly withdrawn, and the requisite consents were received to adopt the Proposed Amendments with respect to an aggregate of $\n15.9\n billion principal amount of our outstanding senior notes (21 of the 22 series in scope). The new notes issued in connection with the exchange offer have the same interest rate, interest payment dates, maturity date, and optional redemption provisions as the corresponding series of existing notes; provided that (a) the methodology for calculating any make-whole redemption price for the USD-denominated notes will reflect the SIFMA model provisions and (b) FedEx will be permitted to deliver notices of redemption that are subject to one or more conditions precedent with respect to the notes.\nCredit Agreements\nWe have a $\n1.75\n billion \nthree-year\n credit agreement (the “Three-Year Credit Agreement”) and a $\n1.75\n billion \nfive-year\n credit agreement (the “Five-Year Credit Agreement” and together with the Three-Year Credit Agreement, the “Credit Agreements”). The Three-Year Credit Agreement and the Five-Year Credit Agreement expire in March 2027 and March 2029, respectively, and each has a $\n125\n million letter of credit sublimit. The Credit Agreements are available to finance our operations and other cash flow needs. As of May 31, 2025, \nno\n amounts were outstanding under the Credit Agreements, \nno\n commercial paper was outstanding, and we had $\n250\n million of the letter of credit sublimit unused under the Credit Agreements. Outstanding commercial paper reduces the amount available to borrow under the Credit Agreements. \nOur Credit Agreements contain a financial covenant requiring us to maintain a ratio of debt (excluding up to $\n500\n million of unrestricted cash and cash equivalents) to consolidated earnings (excluding noncash retirement plans mark-to-market adjustments, noncash pension service costs, noncash asset impairment charges, business optimization and restructuring expenses, and pro forma cost savings and synergies associated with an acquisition) before interest, taxes, depreciation, and amortization (“adjusted EBITDA”) \n-90-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nof not more than \n3.5\n to 1.0, calculated as of the last day of each fiscal quarter on a rolling four-quarters basis. The aggregate amount of adjustments for business optimization and restructuring expenses and pro forma cost savings and synergies associated with an acquisition may not exceed \n10\n% of adjusted EBITDA (calculated after giving effect to any such addback and such cap and all other permitted addbacks and adjustments) in any period. Additionally, following the consummation of an acquisition for which the aggregate cash consideration is at least $\n250\n million, FedEx may elect to increase the ratio to \n4.0\n to 1.0 with respect to the last day of the fiscal quarter during which such acquisition is consummated and the last day of each of the immediately following three consecutive fiscal quarters, provided that there must be at least two consecutive fiscal quarters between such elections during which the ratio is \n3.5\n to 1.0. The ratio of our debt to adjusted EBITDA was \n1.9\n to 1.0 at May 31, 2025. \nThe financial covenant discussed above is the only significant restrictive covenant in the Credit Agreements. The Credit Agreements contain other customary covenants that do not, individually or in the aggregate, materially restrict the conduct of our business. We are in compliance with the financial covenant and all other covenants in the Credit Agreements and do not expect the covenants to affect our operations, including our liquidity or expected funding needs. If we failed to comply with the financial covenant or any other covenants in the Credit Agreements, our access to financing could become limited. Our commercial paper program is backed by unused commitments under the Credit Agreements.\nNOTE 8: \nLEASES \nThe following table is a summary of the components of net lease cost for the period ended May 31 (in millions)\n2025\n2024\nOperating lease cost\n$\n3,421\n \n$\n3,326\n \nFinance lease cost:\nAmortization of right-of-use assets\n31\n \n30\n \nInterest on lease liabilities\n17\n \n24\n \nTotal finance lease cost\n48\n \n54\n \nShort-term lease cost\n484\n \n494\n \nVariable lease cost\n1,840\n \n1,714\n \nNet lease cost\n$\n5,793\n \n$\n5,588\n \nSupplemental cash flow information related to leases for the period ended May 31 is as follows (in millions):\n2025\n2024\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows paid for operating leases\n$\n3,422\n \n$\n3,319\n \nOperating cash flows paid for interest portion of finance leases\n17\n \n15\n \nFinancing cash flows paid for principal portion of finance leases\n101\n \n80\n \nRight-of-use assets obtained in exchange for new operating lease liabilities\n1,945\n \n2,083\n \nRight-of-use assets obtained in exchange for new finance lease liabilities\n352\n \n10\n \n-91-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nSupplemental balance sheet information related to leases as of May 31 is as follows (dollars in millions):\n2025\n2024\nOperating leases:\nOperating lease right-of-use assets, net\n$\n16,453\n$\n17,115\nCurrent portion of operating lease liabilities\n$\n2,565\n$\n2,463\nOperating lease liabilities\n14,272\n15,053\nTotal operating lease liabilities\n$\n16,837\n$\n17,516\nFinance leases:\nNet property and equipment\n$\n621\n$\n373\nCurrent portion of long-term debt\n$\n59\n$\n18\nLong-term debt, less current portion\n621\n413\nTotal finance lease liabilities\n$\n680\n$\n431\nWeighted-average remaining lease term:\nOperating leases\n9.7\n9.5\nFinance leases\n19.6\n29.8\nWeighted-average discount rate:\nOperating leases\n3.98\n \n%\n3.79\n \n%\nFinance leases\n3.90\n \n%\n3.63\n \n%\nWe utilize certain aircraft, land, facilities, retail locations, and equipment under finance and operating leases that expire at various dates through 2078. We leased less than \n1\n% of our total aircraft fleet under operating leases as of May 31, 2025 and less than \n1\n% as of May 31, 2024. A portion of our supplemental aircraft are leased by us under agreements that provide for cancellation upon 30 days’ notice. Our leased facilities include national, regional, and metropolitan sorting facilities; retail facilities; and administrative buildings. \nA summary of future minimum lease payments under non-cancelable operating and finance leases with an initial or remaining term in excess of one year at May 31, 2025 is as follows (in millions):\nAircraft\nand Related\nEquipment\nFacilities\nand Other\nTotal\nOperating\nLeases\nFinance Leases\nTotal Leases\n2026\n$\n126\n \n$\n2,881\n \n$\n3,007\n \n$\n84\n \n$\n3,091\n \n2027\n124\n \n2,811\n \n2,935\n \n85\n \n3,020\n \n2028\n124\n \n2,450\n \n2,574\n \n84\n \n2,658\n \n2029\n117\n \n2,071\n \n2,188\n \n82\n \n2,270\n \n2030\n47\n \n1,731\n \n1,778\n \n74\n \n1,852\n \nThereafter\n90\n \n7,817\n \n7,907\n \n610\n \n8,517\n \nTotal lease payments\n628\n \n19,761\n \n20,389\n \n1,019\n \n21,408\n \nLess imputed interest\n(\n67\n)\n(\n3,485\n)\n(\n3,552\n)\n(\n339\n)\n(\n3,891\n)\nPresent value of lease liability\n$\n561\n \n$\n16,276\n \n$\n16,837\n \n$\n680\n \n$\n17,517\n \nWhile certain of our lease agreements contain covenants governing the use of the leased assets or require us to maintain certain levels of insurance, none of our lease agreements include material financial covenants or limitations.\nAs of May 31, 2025, FedEx has entered into additional leases which have not yet commenced and are therefore not part of the right-of-use asset and liability. These leases are generally for build-to-suit facilities and equipment and have undiscounted future payments of approximately $\n1.1\n billion and will commence when FedEx gains beneficial access to the leased asset. Commencement dates are expected to be from calendar years 2025 to 2026.\n-92-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nFederal Express makes payments under certain leveraged operating leases that are sufficient to pay principal and interest on certain pass-through certificates. The pass-through certificates are not direct obligations of, or guaranteed by, FedEx or Federal Express. \nWe are the lessee under certain leases covering a portion of our leased aircraft in which the lessors are trusts established specifically to purchase, finance, and lease these aircraft to us. These leasing entities are variable interest entities. We are not the primary beneficiary of the leasing entities, as the lease terms are at market at the inception of the lease and do not include a residual value guarantee, fixed-price purchase option, or similar feature that obligates us to absorb decreases in value or entitles us to participate in increases in the value of the aircraft. Therefore, we are not required to consolidate any of these entities as the primary beneficiary. Our maximum exposure under these leases is included in the summary of future minimum lease payments.\nNOTE 9: \nPREFERRED STOCK\nOur Certificate of Incorporation authorizes the Board of Directors, at its discretion, to issue up to \n4,000,000\n shares of preferred stock. The stock is issuable in series, which may vary as to certain rights and preferences, and has \nno\n par value. As of May 31, 2025, \nnone\n of these shares had been issued.\n \nNOTE 10: \nACCUMULATED OTHER COMPREHENSIVE LOSS\nThe following table provides changes in AOCL, net of tax, reported in the consolidated financial statements for the years ended May 31 (in millions; amounts in parentheses indicate debits to AOCL): \n \n2025\n2024\n2023\nForeign currency translation loss:\nBalance at beginning of period\n$\n(\n1,422\n)\n$\n(\n1,362\n)\n$\n(\n1,148\n)\nTranslation adjustments\n2\n \n(\n60\n)\n(\n214\n)\nBalance at end of period\n(\n1,420\n)\n(\n1,422\n)\n(\n1,362\n)\nRetirement plans adjustments:\nBalance at beginning of period\n63\n \n35\n \n45\n \nPrior service credit arising during period\n—\n \n36\n \n—\n \nAmortization of prior service credits\n(\n5\n)\n(\n8\n)\n(\n10\n)\nBalance at end of period\n58\n \n63\n \n35\n \nAOCL at end of period\n$\n(\n1,362\n)\n$\n(\n1,359\n)\n$\n(\n1,327\n)\nNOTE 11: \nSTOCK-BASED COMPENSATION \nOur total stock-based compensation expense for the years ended May 31 was as follows (in millions): \n2025\n2024\n2023\nStock-based compensation expense\n$\n154\n \n$\n163\n \n$\n182\n \nWe have \nthree\n types of equity-based compensation: stock options, restricted stock, and RSUs. \nSTOCK OPTIONS\n. Under the provisions of our incentive stock plan, key employees and non-employee directors may be granted options to purchase shares of our common stock at a price not less than its fair market value on the date of grant. Vesting requirements are determined at the discretion of the Compensation and Human Resources Committee of our Board of Directors. Option-vesting periods range from \none\n to \nfour years\n, with the majority of our options vesting ratably over \nfour years\n. Compensation expense associated with these awards is recognized on a straight-line basis over the requisite service period of the award. \nRESTRICTED STOCK AND RSUs\n. Under the terms of our incentive stock plan, restricted shares of our common stock are awarded to key employees and RSUs are awarded to non-employee directors. Restrictions on shares of restricted stock expire ratably over a \nfour-year\n period and restrictions on the RSUs expire after \none year\n (or the date of the next annual meeting of stockholders, if earlier). Restricted stock and RSUs are valued at the market price on the date of award. The terms of our restricted stock provide for continued vesting subsequent to the employee’s retirement. Compensation expense associated with these awards is recognized on a straight-line basis over the shorter of the requisite service period or the stated vesting period. \n-93-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nASSUMPTIONS\n. The key assumptions for the Black-Scholes valuation method include the expected life of the option, stock price volatility, a risk-free interest rate, and dividend yield. \nThe following table includes the weighted-average Black-Scholes value per share of our stock option grants, the intrinsic value of options exercised (in millions), and the key weighted-average assumptions used in the valuation calculations for options granted during the years ended May 31, followed by a discussion of our methodology for developing each of the assumptions used in the valuation model: \n2025\n2024\n2023\nWeighted-average Black-Scholes value per share\n$\n104.42\n$\n79.48\n$\n63.44\nIntrinsic value of options exercised\n$\n263\n$\n290\n$\n160\nBlack-Scholes assumptions:\nExpected lives\n6.3\n years\n6.4\n years\n6.4\n years\nExpected volatility\n37\n%\n35\n%\n34\n%\nRisk-free interest rate\n4.59\n%\n3.94\n%\n1.68\n%\nDividend yield\n1.840\n%\n2.030\n%\n1.694\n%\nThe expected life represents an estimate of the period of time options are expected to remain outstanding, and we examine actual stock option exercises to determine the expected life of the options. Options granted have a maximum term of \n10\n years. Expected volatilities are based on the actual changes in the market value of our stock and are calculated using daily market value changes from the date of grant over a past period equal to the expected life of the options. The risk-free interest rate is the U.S. Treasury Strip rate posted at the date of grant having a term equal to the expected life of the option. The expected dividend yield is the annual rate of dividends per share over the exercise price of the option. \nThe following table summarizes information regarding stock option activity for the year ended May 31, 2025: \nStock Options\nShares\nWeighted-\nAverage\nExercise\nPrice\nWeighted-\nAverage\nRemaining\nContractual\nTerm\nAggregate\nIntrinsic Value\n(in millions)\n(1)\nOutstanding at June 1, 2024\n13,457,990\n \n$\n210.35\n \nGranted\n1,447,141\n \n$\n285.19\n \nExercised\n(\n2,733,218\n)\n$\n191.57\n \nForfeited\n(\n459,561\n)\n$\n245.35\n \nOutstanding at May 31, 2025\n11,712,352\n \n$\n222.31\n \n5.6\n$\n251\n \nExercisable\n8,263,050\n \n$\n209.31\n \n4.6\n$\n244\n \nExpected to vest\n3,054,819\n \n$\n253.99\n \n8.2\n$\n6\n \nAvailable for future grants\n10,976,914\n \n(1)\nOnly presented for options with market value at May 31, 2025 in excess of the exercise price of the option.\n \nThe options granted during 2025 are primarily related to our principal annual stock option grant in June 2024. \nThe following table summarizes information regarding vested and unvested restricted stock and RSUs for the year ended May 31, 2025: \n \nRestricted Stock and RSUs\nShares/Units\nWeighted-\nAverage\nGrant Date\nFair Value\nUnvested at June 1, 2024\n349,972\n \n$\n226.11\n \nGranted\n150,967\n \n276.44\n \nVested\n(\n185,286\n)\n214.78\n \nForfeited\n(\n9,374\n)\n243.67\n \nUnvested at May 31, 2025\n306,279\n \n$\n253.66\n \nAvailable for future grants\n609,193\n \n-94-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nDuring the year ended May 31, 2024, there were \n169,371\n shares of restricted stock granted with a weighted-average fair value of $\n239.33\n per share. During the year ended May 31, 2023, there were \n160,286\n shares of restricted stock granted with a weighted-average fair value of $\n208.57\n per share. \nStock option vesting during the years ended May 31 was as follows: \nStock Options\nVested during\nthe year\nFair value\n(in millions)\n2025\n1,896,584\n \n$\n116\n \n2024\n2,599,042\n \n137\n \n2023\n2,711,215\n \n$\n137\n \nAs of May 31, 2025, there was $\n219\n million of total unrecognized compensation cost, net of estimated forfeitures, related to unvested share-based compensation arrangements. This compensation expense is expected to be recognized on a straight-line basis over the remaining weighted-average vesting period of approximately \ntwo years\n. \nTotal shares outstanding or available for grant related to equity compensation at May 31, 2025 represented \n9\n% of the total outstanding common and equity compensation shares and equity compensation shares available for grant.\n \nNOTE 12: \nCOMPUTATION OF EARNINGS PER SHARE \nThe calculation of basic and diluted earnings per common share for the years ended May 31 was as follows (in millions, except per share amounts): \n2025\n2024\n2023\nBasic earnings per common share:\nNet earnings allocable to common shares\n(1)\n$\n4,087\n \n$\n4,325\n \n$\n3,966\n \nWeighted-average common shares\n241\n248\n254\nBasic earnings per common share\n$\n16.96\n \n$\n17.41\n \n$\n15.60\n \nDiluted earnings per common share:\nNet earnings allocable to common shares\n(1)\n$\n4,087\n \n$\n4,325\n \n$\n3,966\n \nWeighted-average common shares\n241\n248\n254\nDilutive effect of share-based awards\n2\n3\n2\nWeighted-average diluted shares\n243\n251\n256\nDiluted earnings per common share\n$\n16.81\n \n$\n17.21\n \n$\n15.48\n \nAnti-dilutive options excluded from diluted earnings per common share\n4.9\n5.8\n7.4\n \n(1)\nNet earnings available to participating securities were $\n5\n million in 2025, $\n6\n million in 2024, and $\n6\n million in 2023.\n-95-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nNOTE 13: \nINCOME TAXES\nThe components of the provision for income taxes for the years ended May 31 were as follows (in millions): \n2025\n2024\n2023\nCurrent provision\nDomestic:\nFederal\n$\n891\n \n$\n1,184\n \n$\n579\n \nState and local\n146\n \n218\n \n157\n \nForeign\n359\n \n265\n \n209\n \n1,396\n \n1,667\n \n945\n \nDeferred provision\nDomestic:\nFederal\n(\n302\n)\n(\n82\n)\n369\n \nState and local\n20\n \n60\n \n37\n \nForeign\n235\n \n(\n140\n)\n40\n \n(\n47\n)\n(\n162\n)\n446\n \nTotal Provision\n$\n1,349\n \n$\n1,505\n \n$\n1,391\n \nPre-tax earnings of foreign operations for 2025, 2024, and 2023 were $\n1.8\n billion, $\n0.5\n billion, and $\n0.6\n billion, respectively. These amounts represent only a portion of total results associated with international shipments and do not represent our international results of operations. \nA reconciliation of total income tax expense and the amount computed by applying the statutory federal income tax to income before income taxes for the years ended May 31 is as follows (dollars in millions): \n2025\n2024\n2023\nTaxes computed at federal statutory rate\n$\n1,143\n \n$\n1,226\n \n$\n1,126\n \nIncreases (decreases) in income tax from:\nU.S. and foreign return-to-provision adjustments\n5\n \n11\n \n(\n44\n)\nState and local income taxes, net of federal benefit\n137\n \n177\n \n152\n \nForeign operations\n101\n \n65\n \n96\n \nNon-deductible expenses\n72\n \n48\n \n40\n \nUncertain tax positions\n(\n5\n)\n(\n21\n)\n60\n \nBenefits from share-based payments\n(\n18\n)\n(\n26\n)\n(\n18\n)\nValuation allowance\n21\n \n59\n \n59\n \nForeign tax rate enactments\n6\n \n—\n \n3\n \nState deferred tax remeasurement\n—\n \n54\n \n—\n \nGoodwill impairment charges\n—\n \n—\n \n8\n \nCorporate structuring transactions\n(\n66\n)\n—\n \n—\n \nOther, net\n(\n47\n)\n(\n88\n)\n(\n91\n)\nProvision for income taxes\n$\n1,349\n \n$\n1,505\n \n$\n1,391\n \nEffective Tax Rate\n24.8\n \n%\n25.8\n \n%\n25.9\n \n%\nThe 2025 tax provision includes an income tax benefit of $\n66\n million from the write-off of U.S. deferred tax balances due to corporate structuring transactions.\nThe 2024 tax provision includes an unfavorable income tax expense of $\n54\n million from the remeasurement of U.S. state deferred tax balances to reflect aggregate temporary differences at the expected applicable tax rates after the merger of FedEx Ground and FedEx Services into Federal Express Corporation.\nThe 2023 tax provision was negatively impacted by an expense of $\n46\n million related to a write-down and valuation allowance on certain foreign tax credit carryforwards due to operational changes which impacted the determination of the realizability of the deferred tax asset. The 2023 tax provision was also negatively impacted by lower earnings in certain non-U.S. jurisdictions.\n-96-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nWe regularly assess the need for cash in the U.S., as well as in our foreign subsidiaries, and will occasionally repatriate back to the U.S. excess earnings above working capital needs that can be repatriated with an immaterial tax cost. We assert all other earnings, both historical and current in our foreign subsidiaries, are permanently reinvested and therefore no deferred taxes or withholding taxes have been provided, including deferred taxes on any additional outside basis difference (e.g., stock basis differences attributable to acquisition or other permanent differences). Determination of the amount of unrecognized deferred income tax liability related to any remaining undistributed foreign earnings and additional outside basis differences is not practicable.\nThe significant components of deferred tax assets and liabilities as of May 31 were as follows (in millions): \n2025\n2024\nDeferred Tax\nAssets\nDeferred Tax\nLiabilities\nDeferred Tax\nAssets\nDeferred Tax\nLiabilities\nProperty, equipment, leases, and intangibles\n$\n4,515\n \n$\n10,434\n \n$\n4,597\n \n$\n10,815\n \nEmployee benefits\n725\n \n291\n \n744\n \n68\n \nSelf-insurance accruals\n1,247\n \n— \n1,183\n \n— \nOther\n591\n \n42\n \n561\n \n140\n \nNet operating loss/credit carryforwards\n1,123\n \n— \n1,306\n \n— \nValuation allowances\n(\n523\n)\n— \n(\n537\n)\n— \n$\n7,678\n \n$\n10,767\n \n$\n7,854\n \n$\n11,023\n \nThe net deferred tax liabilities as of May 31 have been classified in the balance sheets as follows (in millions): \n2025\n2024\nNoncurrent deferred tax assets\n(1)\n$\n1,116\n \n$\n1,313\n \nNoncurrent deferred tax liabilities\n(\n4,205\n)\n(\n4,482\n)\n$\n(\n3,089\n)\n$\n(\n3,169\n)\n(1)\nNoncurrent deferred tax assets are included within “Other Assets” in the accompanying consolidated balance sheets.\n \nWe have approximately $\n3.2\n billion of net operating loss carryovers in various foreign jurisdictions, $\n1.4\n billion of state operating loss carryovers, and $\n139\n million of U.S. federal operating loss and capital loss carryovers. The valuation allowances primarily represent amounts reserved for operating loss carryforwards, which expire over varying periods starting in 2026. Therefore, we establish valuation allowances if it is more likely than not that deferred income tax assets will not be realized. The total change in the valuation allowance reflects certain balance sheet items. Income statement impacts are reflected in our effective tax rate reconciliation. The decrease in the valuation allowance during 2025 includes a $\n42\n million increase related to foreign net operating losses, which includes a $\n21\n million increase in a branch valuation allowance which has been offset by a corresponding deferred tax asset in the U.S. We believe that we will generate sufficient future taxable income to realize the tax benefits related to the remaining net deferred tax assets in the consolidated balance sheets. See \nNote 1\n for more information on our policy for assessing the recoverability of deferred tax assets and valuation allowances. \nWe are subject to taxation in the U.S. and various U.S. state, local, and foreign jurisdictions. We are currently under examination by the Internal Revenue Service for the 2016 through 2021 tax years. It is reasonably possible that certain income tax return proceedings will be completed during the next 12 months and could result in a change in our balance of unrecognized tax benefits. However, we believe we have recorded adequate amounts of tax, including interest and penalties, for any adjustments expected to occur.\nDuring 2021, we filed suit in U.S. District Court for the Western District of Tennessee challenging the validity of a tax regulation related to the one-time transition tax on unrepatriated foreign earnings, which was enacted as part of the Tax Cuts and Jobs Act (“TCJA”). Our lawsuit sought to have the court declare this regulation invalid and order the refund of overpayments of U.S. federal income taxes for 2018 and 2019 attributable to the denial of foreign tax credits under the regulation. We have recorded a cumulative benefit of $\n249\n million attributable to our interpretation of the TCJA and the Internal Revenue Code. In March 2023, the District Court ruled that the regulation is invalid and contradicts the plain terms of the tax code. On February 13, 2025, the District Court ruled again in our favor with regard to a new argument raised by the U.S. government. On June 4, 2025, the District Court validated the amount of refunds owed for 2018 and 2019, which includes the foreign tax credits previously denied. The U.S. government has until August 4, 2025, to appeal the decision to the U.S. Court of Appeals for the Sixth Circuit. If we are ultimately unsuccessful in defending our position, we may be required to reverse the benefit previously recorded.\n-97-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nA reconciliation of the beginning and ending amount of unrecognized tax benefits for the years ended May 31 is as follows (in millions): \n2025\n2024\n2023\nBalance at beginning of year\n$\n186\n \n$\n212\n \n$\n169\n \nIncreases for tax positions taken in the current year\n31\n \n5\n \n3\n \nIncreases for tax positions taken in prior years\n33\n \n4\n \n68\n \nDecreases for tax positions taken in prior years\n(\n11\n)\n(\n3\n)\n(\n7\n)\nSettlements\n(\n87\n)\n(\n31\n)\n(\n15\n)\nChanges due to currency translation\n3\n \n(\n1\n)\n(\n6\n)\nBalance at end of year\n$\n155\n \n$\n186\n \n$\n212\n \nOur liabilities recorded for uncertain tax positions include $\n149\n million at May 31, 2025 and $\n184\n million at May 31, 2024 associated with positions that, if favorably resolved, would provide a benefit to our income tax expense. We classify interest related to income tax liabilities as interest expense and, if applicable, penalties are recognized as a component of income tax expense. The balance of accrued interest and penalties was $\n35\n million at May 31, 2025 and $\n59\n million at May 31, 2024. \nIt is difficult to predict the ultimate outcome or the timing of resolution for tax positions. Changes may result from the conclusion of ongoing audits, appeals, or litigation in state, local, federal, and foreign tax jurisdictions, or from the resolution of various proceedings between U.S. and foreign tax authorities. It is reasonably possible that the amount of the benefit with respect to certain of our unrecognized tax positions will increase or decrease within the next 12 months. However, estimates of the amounts or ranges for individual matters where a material change is reasonably possible cannot be made. We believe we have recorded adequate amounts of tax reserves, including interest and penalties, for any adjustments that may occur.\n \n NOTE 14: \nRETIREMENT PLANS \nWe sponsor programs that provide retirement benefits to most of our employees. These programs include defined benefit pension plans, defined contribution plans, and postretirement healthcare plans.\nThe accounting guidance related to postretirement benefits requires recognition in the balance sheet of the funded status of defined benefit pension and other postretirement benefit plans, and the recognition in either expense or accumulated other comprehensive income of unrecognized gains or losses and prior service costs or credits. We use MTM accounting for the recognition of our actuarial gains and losses related to our defined benefit pension and postretirement healthcare plans as described in \nNote 1\n. The funded status is measured as the difference between the fair value of the plan’s assets and the PBO of the plan.\nA summary of our retirement plan costs for the years ended May 31 is as follows (in millions): \n2025\n2024\n2023\nDefined benefit pension plans\n$\n278\n \n$\n363\n \n$\n236\n \nDefined contribution plans\n1,144\n \n968\n \n955\n \nPostretirement healthcare plans\n87\n \n85\n \n92\n \nPension plans MTM gain\n(\n515\n)\n(\n561\n)\n(\n650\n)\n$\n994\n \n$\n855\n \n$\n633\n \nThe components of the MTM adjustments for the years ended May 31 are as follows (in millions): \n2025\n2024\n2023\nActual versus expected return on assets\n$\n75\n \n$\n(\n67\n)\n$\n2,492\n \nDiscount rate change\n(\n1,024\n)\n(\n1,139\n)\n(\n3,395\n)\nDemographic experience:\nCurrent year actuarial loss\n196\n \n67\n \n142\n \nChange in future assumptions\n247\n \n577\n \n110\n \nPension plan amendments, including curtailment gains\n(\n9\n)\n1\n \n1\n \nTotal MTM gain\n$\n(\n515\n)\n$\n(\n561\n)\n$\n(\n650\n)\n-98-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \n2025\nNet of all fees and expenses, the actual rate of return on our U.S. Pension Plan assets was \n6.50\n%, which was lower than our expected rate of return of \n6.75\n%. Performance was driven by public equities and alternatives, offset by fixed income gains due to higher interest rates. The weighted-average discount rate for all our pension and postretirement healthcare plans increased from \n5.53\n% at May 31, 2024 to \n5.87\n% at May 31, 2025. The demographic experience in 2025 reflects an update to our retirement rate assumption.\n2024\nNet of all fees and expenses, the actual rate of return on our U.S. Pension Plan assets was \n6.80\n%, which was higher than our expected rate of return of \n6.50\n%. Performance was driven by public equities and alternatives, offset by modest losses in fixed-income due to higher interest rates. The weighted-average discount rate for all our pension and postretirement healthcare plans increased from \n5.17\n% at May 31, 2023 to \n5.53\n% at May 31, 2024. The demographic experience in 2024 reflects an update to our retirement rate and short-term cash balance interest crediting assumptions.\n2023\nNet of all fees and expenses, the actual rate of return on our U.S. Pension Plan assets was (\n2.70\n%), which was lower than our expected rate of return of \n6.50\n%. Negative portfolio returns derived due to losses in both equities and our fixed-income assets due to market volatility and rising interest rates. The weighted-average discount rate for all our pension and postretirement healthcare plans increased from \n4.21\n% at May 31, 2022 to \n5.17\n% at May 31, 2023. The demographic experience in 2023 reflects an update to our short-term cash balance interest crediting assumption.\nPENSION PLANS\n. Our largest pension plan covers certain U.S. employees age 21 and over, with at least \none year\n of service. Pension benefits for most employees are accrued under a cash balance formula we call the Portable Pension Account (“PPA”). Under the PPA, the retirement benefit is expressed as a dollar amount in a notional account that grows with annual credits based on pay, age and years of credited service, and interest on the notional account balance. The PPA benefit is payable as a lump sum or an annuity at retirement at the election of the employee. The plan interest credit rate varies from year to year based on a U.S. Treasury index. Prior to 2009, certain employees earned benefits using a traditional pension formula (based on average earnings and years of service). Benefits under this formula were capped on May 31, 2008 for most employees. \nWe also sponsor or participate in nonqualified benefit plans covering certain of our U.S. employee groups and other pension plans covering certain of our international employees. The international defined benefit pension plans provide benefits primarily based on earnings and years of service and are funded in compliance with local laws and practices. The majority of our international obligations are for defined benefit pension plans in the United Kingdom. \nIn 2020, we announced the closing of our U.S.-based defined benefit pension plans to new non-union employees hired on or after January 1, 2020. We introduced an all-401(k) plan retirement benefit structure for eligible employees with a higher company match of up to \n8\n% across all U.S.-based operating companies in 2022. During calendar 2021, current eligible employees under the PPA pension formula were given a one-time option to continue to be eligible for pension compensation credits under the existing PPA formula and remain in the existing 401(k) plan with its company match of up to \n3.5\n%, or to cease receiving compensation credits under the PPA and move to the new 401(k) plan with the higher match of up to \n8\n%. Changes to the new 401(k) plan structure became effective January 1, 2022. See \nNote 1\n for additional information on potential amendments to our pension plan offered to Federal Express pilots.\nPOSTRETIREMENT HEALTHCARE PLANS.\n Certain of our subsidiaries offer medical, dental, and vision coverage to eligible U.S. retirees and their eligible dependents and a small number of international employees. U.S. employees covered by the principal plan become eligible for these benefits at age 55 and older, if they have permanent, continuous service of at least 10 years after attainment of age 45 if hired prior to January 1, 1988, or at least 20 years after attainment of age 35 if hired on or after January 1, 1988. \nThe U.S. postretirement healthcare benefit is a lump-sum benefit in a notional retiree health reimbursement account (“HRA”) for eligible participants. The HRA is available to reimburse a participant for qualifying healthcare premium costs and limits the company liability to the HRA account balance. The amount of the credit is based on age at retirement. Retiree health coverage was closed to most new employees hired on or after January 1, 2018.\nPENSION PLAN ASSUMPTIONS\n. The accounting for pension and postretirement healthcare plans includes numerous assumptions, such as: discount rates; expected long-term investment returns on plan assets; future salary increases; employee turnover; mortality; and retirement ages.\n-99-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nWeighted-average actuarial assumptions used to determine the benefit obligations and net periodic benefit cost of our plans are as follows: \nU.S. Pension Plans\nInternational Pension Plans\nPostretirement Healthcare Plans\n2025\n2024\n2023\n2025\n2024\n2023\n2025\n2024\n2023\nDiscount rate used to determine benefit obligation\n5.94\n \n%\n5.58\n \n%\n5.20\n \n%\n4.40\n \n%\n4.29\n \n%\n4.21\n \n%\n5.60\n \n%\n5.63\n \n%\n5.37\n \n%\nDiscount rate used to determine net periodic benefit cost\n5.58\n \n5.20\n \n4.25\n \n4.29\n \n4.21\n \n3.09\n \n5.63\n \n5.37\n \n4.35\n \nRate of increase in future compensation levels used to determine benefit obligation\n5.36\n \n5.29\n \n5.13\n \n3.11\n \n3.06\n \n3.04\n \n—\n \n—\n \n—\n \nRate of increase in future compensation levels used to determine net periodic benefit cost\n5.29\n \n5.13\n \n5.11\n \n3.06\n \n3.04\n \n2.89\n \n—\n \n—\n \n—\n \nExpected long-term rate of return on assets\n6.75\n \n6.50\n \n6.50\n \n3.59\n \n3.55\n \n2.26\n \n—\n \n—\n \n—\n \nInterest crediting rate used to determine benefit obligation\n4.10\n \n4.32\n \n4.23\n \n2.30\n \n2.90\n \n2.40\n \n—\n \n—\n \n—\n \nInterest crediting rate used to determine net periodic benefit cost\n4.32\n \n4.23\n \n4.00\n \n2.90\n \n2.40\n \n3.70\n \n—\n \n—\n \n—\n \nOur U.S. Pension Plan assets are invested primarily in publicly tradable securities, and our pension plans hold only a minimal investment in FedEx common stock that is entirely at the discretion of third-party pension fund investment managers. As part of our strategy to manage pension costs and funded status volatility, we follow a liability-driven investment strategy to better align plan assets with liabilities. \nEstablishing the expected future rate of investment return on our pension assets is a judgmental matter, which we review on an annual basis and revise as appropriate. Management considers the following factors in determining this assumption: \n•\nthe duration of our pension plan liabilities, which drives the investment strategy we can employ with our pension plan assets; \n•\nthe types of investment classes in which we invest our pension plan assets and the expected compound geometric return we can reasonably expect those investment classes to earn over time, net of all fees and expenses; and \n•\nthe investment returns we can reasonably expect our investment management program to achieve in excess of the returns we could expect if investments were made strictly in indexed funds. \nFor consolidated pension expense, we assumed a \n6.75\n% expected long-term rate of return on our U.S. Pension Plan assets in 2025 and \n6.50\n% in 2024 and 2023. The historical annual return on our U.S. Pension Plan assets, calculated on a compound geometric basis, was \n6.90\n%, net of all fees and expenses, for the 15-year period ended May 31, 2025. \nThe investment strategy for our U.S. Pension Plan assets is to utilize a diversified mix of public equities, fixed-income, and alternative investments to earn a long-term investment return that meets our pension plan obligations. Our largest asset classes are Corporate Fixed Income Securities and Government Fixed Income Securities (which are largely benchmarked against the Bloomberg Barclays Long Government, Bloomberg Barclays Long Corporate, or the Bloomberg Barclays 20+ STRIPS indices), and U.S. and non-U.S. Equities (which are mainly benchmarked to the S&P 500 Index and MSCI indices). Accordingly, we do not have any significant concentrations of risk. Active management strategies are utilized within the plan in an effort to realize investment returns in excess of market indices. Our investment strategy also includes the limited use of derivative financial instruments on a discretionary basis to improve investment returns and manage portfolio risk.\nThe following is a description of the valuation methodologies used for investments measured at fair value: \n•\nCash and cash equivalents.\n Level 1 investments include cash, cash equivalents, and foreign currency valued using exchange rates. Level 2 investments include short-term investment funds, which are collective funds priced at a constant value by the administrator of the funds. \n•\nDomestic, international, and global equities.\n Level 1 investments are valued at the closing price or last trade reported on the major market on which the individual securities are traded. \n•\nFixed income.\n We determine the fair value of Level 2 corporate bonds, U.S. and non-U.S. government securities, and other fixed-income securities by using bid evaluation pricing models or quoted prices of securities with similar characteristics. \n-100-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \n•\nAlternative Investments.\n The valuation of Level 3 investments requires significant judgment due to the absence of quoted market prices, the inherent lack of liquidity, and the long-term nature of such assets. Investments in private equity, debt, real estate, hedge funds, and other private investments are valued at estimated fair value based on quarterly financial information received from the investment advisor and/or general partner. These estimates incorporate factors such as contributions and distributions, market transactions, market comparables, and performance multiples. \nThe fair values of investments by level and asset category and the weighted-average asset allocations for our U.S. Pension Plans and our most significant international pension plan at the measurement date are presented in the following tables (in millions): \nPlan Assets at Measurement Date\n2025\nAsset Class (U.S. Plan)\nFair Value\nActual %\nTarget \nRange %\n(1)\nQuoted Prices in\nActive Markets\nLevel 1\nOther Observable\nInputs\nLevel 2\nUnobservable\nInputs\nLevel 3\nCash and cash equivalents\n$\n641\n \n2\n \n%\n0\n - \n5\n%\n$\n34\n \n$\n607\n \n$\n—\n \nEquities\n25\n - \n40\nU.S. large cap equity\n(2)\n3,804\n \n14\n \n1,678\n \n—\n \n—\n \nInternational equities\n(2)\n2,869\n \n11\n \n1,994\n \n—\n \n—\n \nGlobal equities\n(2)\n1,224\n \n5\n \n—\n \n—\n \n—\n \nU.S. SMID cap equity\n671\n \n2\n \n662\n \n9\n \n—\n \nFixed-income securities\n40\n - \n60\nCorporate\n6,625\n \n25\n \n—\n \n6,625\n \n—\n \nGovernment\n(2)\n4,142\n \n16\n \n—\n \n2,277\n \n—\n \nMortgage-backed and other\n(2)\n1,648\n \n6\n \n—\n \n229\n \n—\n \nAlternative investments\n(2)\n4,972\n \n19\n \n15\n - \n25\n—\n \n—\n \n1,083\n \nOther\n5\n \n—\n \n(\n16\n)\n21\n \n—\n \nTotal U.S. plan assets\n$\n26,601\n \n100\n \n%\n$\n4,352\n \n$\n9,768\n \n$\n1,083\n \nAsset Class (International Plan)\nCash and cash equivalents\n$\n12\n \n3\n \n%\n$\n12\n \n$\n—\n \n$\n—\n \nFixed-income securities\nCorporate\n(2)\n118\n \n34\n \n—\n \n—\n \n—\n \nGovernment\n(2)\n184\n \n53\n \n141\n \n—\n \n—\n \nOther\n(2)\n35\n \n10\n \n—\n \n—\n \n—\n \nTotal international plan assets\n$\n349\n \n100\n \n%\n$\n153\n \n$\n—\n \n$\n—\n \n(1)\nTarget ranges have not been provided for international plan assets as they are managed at an individual country level.\n(2)\nCertain investments that are measured at fair value using the net asset value per share (or its equivalent) practical expedient have not been classified in the fair value hierarchy but are included in the total.\n \n-101-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nPlan Assets at Measurement Date\n2024\nAsset Class (U.S. Plan)\nFair Value\nActual %\nTarget\nRange %\n(1)\nQuoted Prices in\nActive Markets\nLevel 1\nOther Observable\nInputs\nLevel 2\nUnobservable\nInputs\nLevel 3\nCash and cash equivalents\n$\n577\n \n2\n \n%\n0\n - \n5\n%\n$\n130\n \n$\n447\n \n$\n—\n \nEquities\n25\n - \n40\nU.S. large cap equity\n(2)\n3,376\n \n13\n \n1,382\n \n—\n \n—\n \nInternational equities\n(2)\n2,631\n \n10\n \n1,780\n \n—\n \n—\n \nGlobal equities\n(2)\n1,397\n \n5\n \n—\n \n—\n \n—\n \nU.S. SMID cap equity\n926\n \n4\n \n916\n \n10\n \n—\n \nFixed-income securities\n40\n - \n60\nCorporate\n6,502\n \n25\n \n—\n \n6,502\n \n—\n \nGovernment\n(2)\n4,194\n \n16\n \n—\n \n2,335\n \n—\n \nMortgage-backed and other\n(2)\n1,514\n \n6\n \n—\n \n205\n \n—\n \nAlternative investments\n(2)\n4,777\n \n19\n \n15\n - \n25\n—\n \n—\n \n1,075\n \nOther\n(\n97\n)\n—\n \n(\n111\n)\n14\n \n—\n \nTotal U.S. plan assets\n$\n25,797\n \n100\n \n%\n$\n4,097\n \n$\n9,513\n \n$\n1,075\n \nAsset Class (International Plan)\nCash and cash equivalents\n$\n8\n \n2\n \n%\n$\n8\n \n$\n—\n \n$\n—\n \nFixed-income securities\nCorporate\n(2)\n62\n \n18\n \n—\n \n—\n \n—\n \nGovernment\n(2)\n177\n \n52\n \n149\n \n—\n \n—\n \nOther\n(2)\n94\n \n28\n \n—\n \n—\n \n—\n \nTotal international plan assets\n$\n341\n \n100\n \n%\n$\n157\n \n$\n—\n \n$\n—\n \n(1)\nTarget ranges have not been provided for international plan assets as they are managed at an individual country level.\n(2)\nCertain investments that are measured at fair value using the net asset value per share (or its equivalent) practical expedient have not been classified in the fair value hierarchy but are included in the total.\nThe change in fair value of Level 3 assets that use significant unobservable inputs is shown in the table below (in millions): \nU.S. Pension Plans\n2025\n2024\nBalance at beginning of year\n$\n1,075\n \n$\n937\n \nActual return on plan assets:\nAssets held during current year\n(\n63\n)\n59\n \nAssets sold during the year\n75\n \n30\n \nPurchases, sales, and settlements, net\n(\n4\n)\n49\n \nBalance at end of year\n$\n1,083\n \n$\n1,075\n \n-102-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nThe following tables provide a reconciliation of the changes in the pension and postretirement healthcare plans’ benefit obligations and fair value of assets over the two-year period ended May 31, 2025 and a statement of the funded status as of May 31, 2025 and 2024 (in millions):\nU.S. Pension Plans\nInternational\nPension Plans\nPostretirement Healthcare Plans\n2025\n2024\n2025\n2024\n2025\n2024\nAccumulated Benefit Obligation (“ABO”)\n$\n25,501\n \n$\n25,756\n \n$\n938\n \n$\n885\n \nChanges in PBO and Accumulated Postretirement Benefit Obligation (“APBO”)\nPBO/APBO at the beginning of year\n$\n26,284\n \n$\n26,426\n \n$\n1,018\n \n$\n990\n \n$\n1,162\n \n$\n1,169\n \nService cost\n499\n \n544\n \n38\n \n38\n \n26\n \n27\n \nInterest cost\n1,447\n \n1,362\n \n43\n \n42\n \n65\n \n61\n \nActuarial (gain) loss\n(\n581\n)\n(\n514\n)\n(\n4\n)\n3\n \n2\n \n18\n \nBenefits paid\n(\n1,674\n)\n(\n1,534\n)\n(\n39\n)\n(\n39\n)\n(\n62\n)\n(\n89\n)\nSettlements\n—\n \n—\n \n(\n20\n)\n(\n11\n)\n—\n \n—\n \nOther\n—\n \n—\n \n37\n \n(\n5\n)\n2\n \n(\n24\n)\nPBO/APBO at the end of year\n$\n25,975\n \n$\n26,284\n \n$\n1,073\n \n$\n1,018\n \n$\n1,195\n \n$\n1,162\n \nChange in Plan Assets\nFair value of plan assets at the beginning of year\n$\n25,797\n \n$\n24,826\n \n$\n602\n \n$\n579\n \n$\n—\n \n$\n—\n \nActual return on plan assets\n1,661\n \n1,674\n \n6\n \n12\n \n—\n \n—\n \nCompany contributions\n817\n \n831\n \n64\n \n50\n \n59\n \n67\n \nBenefits paid\n(\n1,674\n)\n(\n1,534\n)\n(\n39\n)\n(\n39\n)\n(\n62\n)\n(\n89\n)\nSettlements\n—\n \n—\n \n(\n22\n)\n(\n11\n)\n—\n \n—\n \nOther\n—\n \n—\n \n33\n \n11\n \n3\n \n22\n \nFair value of plan assets at the end of year\n$\n26,601\n \n$\n25,797\n \n$\n644\n \n$\n602\n \n$\n—\n \n$\n—\n \nFunded Status of the Plans\n$\n626\n \n$\n(\n487\n)\n$\n(\n429\n)\n$\n(\n416\n)\n$\n(\n1,195\n)\n$\n(\n1,162\n)\nAmount Recognized in the Balance Sheet at May 31:\nNoncurrent asset\n$\n746\n \n$\n—\n \n$\n88\n \n$\n73\n \n$\n—\n \n$\n—\n \nCurrent pension, and other benefit obligations\n(\n33\n)\n(\n35\n)\n(\n25\n)\n(\n22\n)\n(\n79\n)\n(\n81\n)\nNoncurrent pension, and other benefit obligations\n(\n87\n)\n(\n452\n)\n(\n492\n)\n(\n467\n)\n(\n1,116\n)\n(\n1,081\n)\nNet amount recognized\n$\n626\n \n$\n(\n487\n)\n$\n(\n429\n)\n$\n(\n416\n)\n$\n(\n1,195\n)\n$\n(\n1,162\n)\nAmounts Recognized in AOCL and not yet reflected in Net Periodic Benefit Cost:\nPrior service cost (credit)\n$\n(\n32\n)\n$\n(\n39\n)\n$\n3\n \n$\n3\n \n$\n(\n39\n)\n$\n(\n43\n)\nOur pension plans included the following components at May 31 (in millions): \nPBO\nFair Value of\nPlan Assets\nFunded Status\n2025\nQualified\n$\n25,855\n \n$\n26,601\n \n$\n746\n \nNonqualified\n120\n \n—\n \n(\n120\n)\nInternational Plans\n1,073\n \n644\n \n(\n429\n)\nTotal\n$\n27,048\n \n$\n27,245\n \n$\n197\n \n2024\nQualified\n$\n26,152\n \n$\n25,797\n \n$\n(\n355\n)\nNonqualified\n132\n \n—\n \n(\n132\n)\nInternational Plans\n1,018\n \n602\n \n(\n416\n)\nTotal\n$\n27,302\n \n$\n26,399\n \n$\n(\n903\n)\n-103-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nThe table above provides the PBO, fair value of plan assets, and funded status of our pension plans on an aggregated basis. The following tables present our plans on a disaggregated basis to show those plans (as a group) whose assets did not exceed their liabilities. The fair value of plan assets for pension plans with a PBO or ABO in excess of plan assets at May 31 were as follows (in millions): \nPBO Exceeds the Fair Value\nof Plan Assets\n2025\n2024\nU.S. Pension Benefits\nFair value of plan assets\n$\n—\n \n$\n25,797\n \nPBO\n(\n120\n)\n(\n26,284\n)\nNet funded status\n$\n(\n120\n)\n$\n(\n487\n)\nInternational Pension Benefits\nFair value of plan assets\n$\n268\n \n$\n239\n \nPBO\n(\n784\n)\n(\n728\n)\nNet funded status\n$\n(\n516\n)\n$\n(\n489\n)\nABO Exceeds the Fair Value\nof Plan Assets\n2025\n2024\nU.S. Pension Benefits\nABO\n(1)\n$\n(\n115\n)\n$\n(\n124\n)\nFair value of plan assets\n—\n \n—\n \nPBO\n(\n120\n)\n(\n132\n)\nNet funded status\n$\n(\n120\n)\n$\n(\n132\n)\nInternational Pension Benefits\nABO\n(1)\n$\n(\n627\n)\n$\n(\n575\n)\nFair value of plan assets\n242\n \n216\n \nPBO\n(\n757\n)\n(\n703\n)\nNet funded status\n$\n(\n515\n)\n$\n(\n487\n)\n(1)\nABO not used in determination of funded status.\nContributions to our \nqualified U.S. Pension Plans\n for the years ended May 31 were as follows (in millions):\n2025\n2024\nRequired\n$\n—\n \n$\n—\n \nVoluntary\n800\n \n800\n \n$\n800\n \n$\n800\n \nFor 2026, \nno\n pension contributions are required for our U.S. Pension Plan as it is fully funded under the Employee Retirement Income Security Act. However, we expect to make voluntary contributions of up to $\n600\n million to the plan in 2026.\nNet periodic benefit (income) cost for the years ended May 31 were as follows (in millions):\nU.S. Pension Plans\nInternational Pension Plans\nPostretirement Healthcare Plans\n2025\n2024\n2023\n2025\n2024\n2023\n2025\n2024\n2023\nService cost\n$\n499\n \n$\n544\n \n$\n651\n \n$\n38\n \n$\n38\n \n$\n44\n \n$\n26\n \n$\n27\n \n$\n37\n \nInterest cost\n1,447\n \n1,362\n \n1,218\n \n43\n \n42\n \n34\n \n65\n \n61\n \n55\n \nExpected return on plan assets\n(\n1,721\n)\n(\n1,598\n)\n(\n1,688\n)\n(\n21\n)\n(\n18\n)\n(\n14\n)\n—\n \n—\n \n—\n \nAmortization of prior service credit\n(\n8\n)\n(\n7\n)\n(\n7\n)\n1\n \n—\n \n(\n2\n)\n(\n4\n)\n(\n3\n)\n—\n \nActuarial losses (gains) and other\n(\n521\n)\n(\n590\n)\n(\n487\n)\n4\n \n13\n \n(\n25\n)\n2\n \n16\n \n(\n138\n)\nNet periodic benefit (income) cost\n$\n(\n304\n)\n$\n(\n289\n)\n$\n(\n313\n)\n$\n65\n \n$\n75\n \n$\n37\n \n$\n89\n \n$\n101\n \n$\n(\n46\n)\n-104-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nAmounts recognized in other comprehensive loss were primarily related to amortization of prior service cost in our U.S. Pension Plans of $\n8\n million in 2025 and $\n7\n million in 2024 ($\n6\n million, net of tax, in 2025 and $\n6\n million, net of tax, in 2024). \nBenefit payments, which reflect expected future service, are expected to be paid as follows for the years ending May 31 (in millions): \nU.S. Pension Plan\nInternational\nPension Plans\nPostretirement\nHealthcare Plans\n2026\n$\n1,758\n \n$\n60\n \n$\n79\n \n2027\n1,793\n \n56\n \n90\n \n2028\n1,839\n \n61\n \n100\n \n2029\n1,879\n \n74\n \n110\n \n2030\n1,935\n \n81\n \n121\n \n2031-2035\n10,292\n \n453\n \n672\n \nThese estimates are based on assumptions about future events. Actual benefit payments may vary significantly from these estimates. \nFuture medical benefit claims costs are estimated to increase at an annual rate of \n6.90\n% during 2026, decreasing to an annual growth rate of \n4.0\n% in 2045 and thereafter.\n \nNOTE 15: \nBUSINESS SEGMENTS AND DISAGGREGATED REVENUE\nFederal Express and FedEx Freight represent our major service lines and constitute our reportable segments. Our reportable segments include the following businesses:\nFederal Express Segment\nFederal Express (express transportation, small-package ground delivery, and freight transportation)\nFedEx Freight Segment\nFedEx Freight (LTL freight transportation)\nFedEx Custom Critical (time-critical transportation)\nIn connection with our one FedEx consolidation plan, on June 1, 2024, FedEx Ground and FedEx Services were merged into Federal Express, becoming a single company operating a unified, fully integrated air-ground express network under the respected FedEx brand. FedEx Freight continues to provide LTL freight transportation services as a separate subsidiary. Beginning in the first quarter of 2025, Federal Express and FedEx Freight represent our major service lines and constitute our reportable segments. Additionally, the results of FedEx Custom Critical are included in the FedEx Freight segment instead of the Federal Express segment in 2025. Prior-year amounts were revised to reflect this presentation.\nOur Chief Executive Officer is our chief operating decision maker (“CODM”). The CODM is responsible for the company’s operating strategy, growth, and profitability and reviews financial information for our \ntwo\n reportable segments. The CODM uses operating income as the primary measure of segment performance because it reflects the underlying business performance and provides the CODM with a basis for making resource allocation decisions. Operating income is defined as income before other income (expense), interest expense and income tax expense. Our CODM regularly reviews significant segment level expense details to assess segment performance and allocate resources.\nReferences to our transportation segments include, collectively, the Federal Express segment and the FedEx Freight segment.\nThe Federal Express segment operates combined sales, marketing, administrative, and information-technology functions in shared service operations for U.S. customers of our major business units and certain back-office support to FedEx Freight and our other operating segments which allows us to obtain synergies from the combination of these functions. We allocate the net operating costs of these services to reflect the full cost of operating our businesses in the results of those segments. We review and evaluate the performance of FedEx Freight and our other operating segments based on operating income inclusive of these allocations.\nOperating expenses for our FedEx Freight segment include allocations of these services from the Federal Express segment. These allocations also include charges and credits for administrative services provided between operating companies. The allocations of net operating costs are based on metrics such as relative revenue or estimated services provided. We believe these allocations approximate the net cost of providing these functions. Our allocation methodologies are refined periodically, as necessary, to reflect changes in our businesses.\n-105-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nCorporate, Other, and Eliminations \nCorporate and other includes corporate headquarters costs for executive officers and certain legal and finance functions, certain other costs and credits not attributed to our core business, and certain costs associated with developing integrated business solutions through our FedEx Dataworks operating segment. FedEx Dataworks is focused on creating solutions to transform the digital and physical experiences of our customers and team members.\nAlso included in Corporate and other is the FedEx Office and Print Services, Inc. (“FedEx Office”) operating segment, which provides an array of document and business services and retail access to our customers for our package transportation businesses, and the FedEx Logistics operating segment, which provides integrated supply chain management solutions, specialty transportation, customs brokerage, and global ocean and air freight forwarding.\nThe results of Corporate, other, and eliminations are not allocated to the other business segments.\nCertain FedEx operating companies provide transportation and related services for other FedEx companies outside their reportable segment in order to optimize our resources.\n \nBillings for such services are based on negotiated rates and are reflected as revenue of the billing segment. These rates are adjusted from time to time based on market conditions. Such intersegment revenue and expenses are eliminated in our consolidated results and are not separately identified in the following segment information because the amounts are not material.\nThe following table presents segment information for the year ended May 31, 2025 (in millions):\nFederal\nExpress\nSegment\nFedEx\nFreight\nSegment\nCorporate, \nother, and eliminations\nConsolidated\nTotal\nRevenue\n$\n75,304\n \n$\n8,892\n \n$\n3,730\n \n$\n87,926\n \nOperating expenses:\nSalaries and employee benefits\n25,091\n \n3,865\n \n2,276\n \n31,232\n \nPurchased transportation\n19,974\n \n807\n \n987\n \n21,768\n \nRentals and landing fees\n3,939\n \n287\n \n421\n \n4,647\n \nDepreciation and amortization\n3,722\n \n416\n \n126\n \n4,264\n \nFuel\n3,316\n \n457\n \n2\n \n3,775\n \nMaintenance and repairs\n2,799\n \n332\n \n114\n \n3,245\n \nAsset impairment charges\n21\n \n—\n \n—\n \n21\n \nBusiness optimization costs\n384\n \n—\n \n372\n \n756\n \nIntercompany allocations (charges)\n(\n791\n)\n573\n \n218\n \n—\n \nOther\n(1)\n11,964\n \n666\n \n371\n \n13,001\n \nTotal operating expenses\n70,419\n \n7,403\n \n4,887\n \n82,709\n \nOperating income\n$\n4,885\n \n$\n1,489\n \n$\n(\n1,157\n)\n5,217\n \nOther income (expense):\nInterest, net\n(\n426\n)\nOther retirement plans, net\n(2)\n713\n \nOther, net\n(3)\n(\n63\n)\nTotal other income (expense)\n224\n \nIncome before income taxes\n5,441\n \nProvision for income taxes\n1,349\n \nNet income\n$\n4,092\n \n(1)\nIncludes $\n88\n million of net expenses included in Federal Express for international regulatory and legacy FedEx Ground legal matters. Also includes costs related to the planned spin-off of FedEx Freight of $\n38\n million included in \"Corporate, other, and eliminations.\"\n(2)\nIncludes a pre-tax, noncash gain of $\n515\n million associated with our MTM retirement plans accounting adjustments.\n(3)\nIncludes $\n18\n million related to the debt exchange offer and consent solicitation transactions in connection with the planned spin-off of FedEx Freight.\n-106-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nThe following table presents segment information for the year ended May 31, 2024 (in millions):\nFederal\nExpress\nSegment\nFedEx\nFreight\nSegment\nCorporate, \nother, and eliminations\nConsolidated\nTotal\nRevenue\n$\n74,663\n \n$\n9,429\n \n$\n3,601\n \n$\n87,693\n \nOperating expenses:\nSalaries and employee benefits\n24,606\n \n3,923\n \n2,432\n \n30,961\n \nPurchased transportation\n19,330\n \n877\n \n714\n \n20,921\n \nRentals and landing fees\n3,863\n \n280\n \n428\n \n4,571\n \nDepreciation and amortization\n3,754\n \n404\n \n129\n \n4,287\n \nFuel\n4,137\n \n571\n \n2\n \n4,710\n \nMaintenance and repairs\n2,848\n \n330\n \n113\n \n3,291\n \nGoodwill and other asset impairment charges\n157\n \n—\n \n—\n \n157\n \nBusiness optimization costs\n251\n \n—\n \n331\n \n582\n \nIntercompany allocations (charges)\n(\n684\n)\n543\n \n141\n \n—\n \nOther\n(1)\n11,582\n \n680\n \n392\n \n12,654\n \nTotal operating expenses\n69,844\n \n7,608\n \n4,682\n \n82,134\n \nOperating income\n$\n4,819\n \n$\n1,821\n \n$\n(\n1,081\n)\n5,559\n \nOther income (expense):\nInterest, net\n(\n375\n)\nOther retirement plans, net\n(2)\n722\n \nOther, net\n(\n70\n)\nTotal other income (expense)\n277\n \nIncome before income taxes\n5,836\n \nProvision for income taxes\n(3)\n1,505\n \nNet income\n$\n4,331\n \n(1)\nIncludes a $\n57\n million benefit included in “Corporate, other, and eliminations\" for an insurance reimbursement related to pre- and post-judgment interest in connection with a legacy FedEx Ground legal matter.\n(2)\nIncludes a pre-tax, noncash gain of $\n561\n million associated with our MTM retirement plans accounting adjustments.\n(3)\nIncludes a $\n54\n million tax expense related to the remeasurement of state deferred income taxes under the new one FedEx structure.\n-107-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nThe following table presents segment information for the year ended May 31, 2023 (in millions):\nFederal\nExpress\nSegment\nFedEx\nFreight\nSegment\nCorporate, \nother, and eliminations\nConsolidated\nTotal\nRevenue\n$\n75,884\n \n$\n10,084\n \n$\n4,187\n \n$\n90,155\n \nOperating expenses:\nSalaries and employee benefits\n24,523\n \n4,057\n \n2,439\n \n31,019\n \nPurchased transportation\n19,677\n \n1,078\n \n1,035\n \n21,790\n \nRentals and landing fees\n4,035\n \n269\n \n434\n \n4,738\n \nDepreciation and amortization\n3,655\n \n387\n \n134\n \n4,176\n \nFuel\n5,157\n \n748\n \n4\n \n5,909\n \nMaintenance and repairs\n2,910\n \n320\n \n127\n \n3,357\n \nGoodwill and other asset impairment charges\n70\n \n—\n \n47\n \n117\n \nBusiness optimization costs\n47\n \n—\n \n262\n \n309\n \nIntercompany allocations (charges)\n(\n689\n)\n542\n \n147\n \n—\n \nOther\n(1)\n12,306\n \n747\n \n775\n \n13,828\n \nTotal operating expenses\n71,691\n \n8,148\n \n5,404\n \n85,243\n \nOperating income\n$\n4,193\n \n$\n1,936\n \n$\n(\n1,217\n)\n4,912\n \nOther income (expense):\nInterest, net\n(\n496\n)\nOther retirement plans, net\n(2)\n1,054\n \nOther, net\n(\n107\n)\nTotal other income (expense)\n451\n \nIncome before income taxes\n5,363\n \nProvision for income taxes\n1,391\n \nNet income\n$\n3,972\n \n(1)\nIncludes $\n35\n million in connection with a FedEx Ground legal matter included in “Corporate, other, and eliminations.”\n(2)\nIncludes a pre-tax, noncash gain of $\n650\n million associated with our MTM retirement plans accounting adjustments.\nThe following table provides a reconciliation of segment assets to consolidated financial statement totals (in millions) for the years as of May 31:\nFederal\nExpress\nSegment\nFedEx\nFreight\nSegment\nCorporate, other, and eliminations\nConsolidated\nTotal\nSegment assets\n(1)\n2025\n$\n74,154\n \n$\n12,899\n \n$\n574\n \n$\n87,627\n \n2024\n73,259\n \n11,615\n \n2,133\n \n87,007\n \n2023\n85,128\n \n10,416\n \n(\n8,401\n)\n87,143\n \n(1)\nSegment assets include intercompany receivables. In the fourth quarter of 2024, legacy FedEx Ground settled an intercompany balance of $\n19.5\n billion with FedEx in preparation for the one FedEx consolidation.\nThe following table provides a reconciliation of reportable segment capital expenditures to consolidated totals for the years ended May 31 (in millions): \nFederal\nExpress\nSegment\nFedEx\nFreight\nSegment\nOther\nConsolidated\nTotal\n2025\n$\n3,505\n \n$\n437\n \n$\n113\n \n$\n4,055\n \n2024\n4,591\n \n461\n \n124\n \n5,176\n \n2023\n5,480\n \n557\n \n137\n \n6,174\n \n-108-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nThe following table presents revenue by service type and geographic information for the years ended or as of May 31 (in millions):\n2025\n2024\n2023\nREVENUE BY SERVICE TYPE\nFederal Express segment:\nPackage:\nU.S. priority revenue\n$\n10,520\n \n$\n10,543\n \n$\n10,896\n \nU.S. deferred revenue\n5,007\n \n4,926\n \n5,126\n \nU.S. ground revenue\n33,887\n \n32,981\n \n32,352\n \nTotal U.S. domestic package revenue\n49,414\n \n48,450\n \n48,374\n \nInternational priority\n8,737\n \n9,454\n \n10,938\n \nInternational economy\n5,861\n \n4,653\n \n3,307\n \nTotal international export package revenue\n14,598\n \n14,107\n \n14,245\n \nInternational domestic\n(1)\n4,495\n \n4,659\n \n4,552\n \nTotal package revenue\n68,507\n \n67,216\n \n67,171\n \nFreight:\nU.S.\n1,536\n \n2,391\n \n2,883\n \nInternational priority\n2,320\n \n2,205\n \n3,059\n \nInternational economy\n1,975\n \n1,874\n \n1,719\n \nTotal freight revenue\n5,831\n \n6,470\n \n7,661\n \nOther\n966\n \n977\n \n1,052\n \nTotal Federal Express segment\n75,304\n \n74,663\n \n75,884\n \nFedEx Freight segment\n8,892\n \n9,429\n \n10,084\n \nOther and eliminations\n(2)\n3,730\n \n3,601\n \n4,187\n \n$\n87,926\n \n$\n87,693\n \n$\n90,155\n \nGEOGRAPHICAL INFORMATION\n(3)\nRevenue:\nU.S.\n$\n62,916\n \n$\n63,531\n \n$\n64,890\n \nInternational:\nFederal Express segment\n23,720\n \n23,136\n \n23,951\n \nFedEx Freight segment\n247\n \n266\n \n264\n \nOther\n1,043\n \n760\n \n1,050\n \nTotal international revenue\n25,010\n \n24,162\n \n25,265\n \n$\n87,926\n \n$\n87,693\n \n$\n90,155\n \nNoncurrent assets:\nU.S.\n$\n57,040\n \n$\n56,822\n \n$\n56,449\n \nInternational\n12,201\n \n11,978\n \n12,084\n \n$\n69,241\n \n$\n68,800\n \n$\n68,533\n \n(1)\nInternational domestic revenue relates to our intra-country operations. \n(2)\nIncludes the FedEx Office, FedEx Logistics, and FedEx Dataworks operating segments.\n(3)\nInternational revenue includes shipments that either originate in or are destined to locations outside the United States, which could include U.S. payors. Noncurrent assets include property and equipment, operating lease right-of-use assets, goodwill, and other long-term assets. Our flight equipment is registered in the U.S. and is included as U.S. assets; however, many of our aircraft operate internationally.\nNOTE 16: \nDERIVATIVE FINANCIAL INSTRUMENTS\nRISK MANAGEMENT OBJECTIVE OF USING DERIVATIVES.\n We enter into derivative financial instruments to reduce the effects of volatility in foreign currency exchange exposure on operating results and cash flows. Our derivative financial instruments are used to manage differences in the amount, timing, and duration of cash receipts and cash payments principally related to our investments.\nCertain of our foreign operations expose us to fluctuations of foreign exchange rates. These fluctuations may impact the value of our cash receipts and payments in terms of our functional currency. \n-109-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nNET INVESTMENT HEDGES\n. We are exposed to fluctuations in foreign exchange rates on investments we hold in foreign entities. We use debt denominated in foreign currency and fixed-to-fixed cross-currency swaps to hedge our exposure to changes in foreign exchange rates on certain of our foreign investments. Cross-currency swaps involve the receipt of functional-currency-fixed rate amounts from a counterparty in exchange for us making foreign-currency-fixed rate payments over the life of the agreement. Cross-currency swaps also involve final exchanges of the functional-currency principal amounts for the foreign-currency principal amounts between us and the counterparty.\nFor debt and foreign currency derivatives designated as net investment hedges, the gain or loss on the derivative is reported in AOCL as part of the cumulative translation adjustment. Amounts are reclassified out of AOCL into earnings when the hedged net investment is either sold or substantially liquidated.\nAs of May 31, 2025 and 2024, we had €\n506\n million and €\n173\n million, respectively, of debt designated to reduce the volatility of the U.S. dollar value of a portion of our net investment in a euro-denominated consolidated subsidiary. \nDuring 2025 and 2024, we entered into certain foreign currency derivatives to hedge our net investments in foreign operations. \nThe following foreign currency derivatives were outstanding as of May 31, 2025 and 2024 (notional amounts in millions):\n2025\n2024\nForeign Currency Derivative\nNumber of Instruments\nNotional Sold\nNotional Purchased\nNumber of Instruments\nNotional Sold\nNotional Purchased\nCross-currency swaps\n4\n€\n(\n949\n)\n$\n1,000\n \n4\n€\n(\n468\n)\n$\n500\n \nThe following table presents the fair value of our derivatives, including their classification on the consolidated balance sheet, as of May 31, 2025 and 2024 (in millions):\nBalance Sheet Location\n2025\n2024\nAsset Derivatives\nCross-currency swaps\nPrepaid expenses and other\n$\n13\n \n$\n8\n \nLiability Derivatives\nCross-currency swaps\nOther liabilities\n$\n108\n \n$\n14\n \nThe estimated fair values were determined using pricing models that rely on market-based inputs such as foreign currency exchange rates and yield curves. The fair value of our derivative financial instruments is classified as Level 2 within the fair value hierarchy. \nDuring 2025 and 2024, we recognized losses of $\n86\n million and $\n6\n million, respectively, in AOCL related to our cross-currency swaps, which excludes any adjustments for the impact of deferred income taxes. \nAs of May 31, 2025 and 2024, we had not posted any collateral related to our cross-currency swaps. \nNo\n amounts have been reclassified out of AOCL during 2025 or 2024 for our net investment hedges. As of May 31, 2025 and 2024, our net investment hedges remained effective.\nNOTE 17: \nSUPPLEMENTAL CASH FLOW INFORMATION\nCash paid for interest expense and income taxes for the years ended May 31 was as follows (in millions): \n2025\n2024\n2023\nCash payments for:\nInterest (net of capitalized interest)\n$\n814\n \n$\n744\n \n$\n694\n \nIncome taxes\n$\n1,285\n \n$\n1,555\n \n$\n1,096\n \nIncome tax refunds received\n(\n35\n)\n(\n122\n)\n(\n53\n)\nCash tax payments, net\n$\n1,250\n \n$\n1,433\n \n$\n1,043\n \nNoncash investing and financing activities for the years ended May 31 were as follows (in millions):\n2025\n2024\n2023\nShares of common stock issued from treasury stock for acquisition\n$\n90\n \n$\n—\n \n$\n—\n \n-110-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nNOTE 18: \nGUARANTEES AND INDEMNIFICATIONS \nIn conjunction with certain transactions, primarily the lease, sale, or purchase of real estate, operating assets, or services in the ordinary course of business and in connection with business sales and acquisitions, we may provide routine guarantees or indemnifications (e.g., environmental, fuel, tax, and intellectual property infringement), the terms of which range in duration, and often they are not limited and have no specified maximum obligation. The overall maximum potential amount of the obligation under such guarantees and indemnifications cannot be reasonably estimated. Historically, we have not been required to make significant payments under our guarantee or indemnification obligations and no material amounts have been recognized in our financial statements for the underlying fair value of these obligations.\nNOTE 19: \nCOMMITMENTS\nAnnual purchase commitments under various contracts as of May 31, 2025 were as follows (in millions): \nAircraft and\nAircraft Related\nOther\n(1)\nTotal\n2026\n$\n889\n \n$\n848\n \n$\n1,737\n \n2027\n1,114\n \n581\n \n1,695\n \n2028\n989\n \n411\n \n1,400\n \n2029\n410\n \n338\n \n748\n \n2030\n204\n \n20\n \n224\n \nThereafter\n1,075\n \n90\n \n1,165\n \nTotal\n$\n4,681\n \n$\n2,288\n \n$\n6,969\n \n(1)\nPrimarily information technology and advertising contracts.\nThe amounts reflected in the table above for purchase commitments represent noncancellable agreements to purchase goods or services. Open purchase orders that are cancellable are not considered unconditional purchase obligations for financial reporting purposes and are not included in the table above.\nWe have several aircraft modernization programs under way that are supported by the purchase of Boeing 777 Freighter (“B777F”) and Boeing 767-300 Freighter (“B767F”) aircraft. These aircraft are significantly more fuel-efficient per unit than the aircraft types previously utilized, and these future expenditures are necessary to achieve significant long-term operational savings and to replace older aircraft. Our ability to delay the timing of these aircraft-related expenditures is limited without incurring significant costs to modify existing purchase agreements.  \nAs of May 31, 2025, we had $\n590\n million in deposits and progress payments on aircraft purchases and other planned aircraft-related transactions. These deposits are classified in the “Other assets” caption of our accompanying consolidated balance sheets. Aircraft and aircraft-related contracts are subject to price escalations. \nThe following table is a summary of the key aircraft we were committed to purchase as of May 31, 2025, with the year of expected delivery:  \n \nCessna SkyCourier 408\nATR 72-600F\nB767F\nB777F\nTotal\n2026\n19\n \n3\n \n7\n \n—\n \n29\n \n2027\n4\n \n3\n \n—\n \n5\n \n12\n \n2028\n—\n \n4\n \n—\n \n5\n \n9\n \n2029\n—\n \n4\n \n—\n \n—\n \n4\n \n2030\n—\n \n2\n \n—\n \n—\n \n2\n \nThereafter\n—\n \n—\n \n—\n \n—\n \n—\n \nTotal\n23\n \n16\n \n7\n \n10\n \n56\n \nDuring 2025, Federal Express exercised options to purchase \neight\n B777F aircraft and \nten\n ATR 72-600F aircraft. Of the \neight\n B777F aircraft, \nthree\n are expected to be delivered in calendar year 2026 and \nfive\n are expected to be delivered in calendar year 2027. Of the \nten\n ATR 72-600F aircraft, \nthree\n are expected to be delivered in calendar year 2027, \nfour\n in calendar year 2028, and \nthree\n in calendar year 2029.\n \n-111-\nFEDEX CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS \nNOTE 20: \nINVESTMENTS\nEQUITY SECURITIES. \nEquity securities are included within “Other assets” in the accompanying consolidated balance sheets. \nThe summary of our investments in equity securities at May 31, 2025 and 2024 is as follows (in millions):\n2025\n2024\nEquity securities with readily determinable fair values\n$\n91\n \n$\n100\n \nEquity securities without readily determinable fair values - NAV practical expedient\n51\n \n37\n \nEquity securities without readily determinable fair values - measurement alternative\n364\n \n223\n \nTotal equity securities\n$\n506\n \n$\n360\n \nEquity securities with a readily determinable fair value are Level 1 investments that are valued at the closing price or last trade reported on the major market on which the individual securities are traded. For equity securities without readily determinable fair values that qualify for the NAV practical expedient, we have elected to apply the NAV practical expedient to estimate fair value. We apply the measurement alternative for all other equity securities without readily determinable fair values, where adjustments to cost are made for observable price changes and any impairments. For equity securities where the measurement alternative is applied, annual and cumulative amounts of impairments, downward adjustments, and upward adjustments were immaterial for 2025 and 2024. \nUnrealized gains and (losses) recognized during the reporting period on all equity securities still held at May 31, 2025, 2024, and 2023 were ($\n6\n) million, $\n14\n million, and ($\n48\n) million, respectively. \nDEBT SECURITIES. \nThe carrying values of our investments in debt securities are classified as available-for-sale and reported at their estimated fair values within “Prepaid expenses and other” in the accompanying consolidated balance sheets. \nThe summary of our investments in debt securities at May 31, 2025 and 2024 is as follows (in millions):\n2025\n2024\nGross Unrealized\nGross Unrealized\nCost\nGains\nLosses\nEstimated Fair Value\nCost\nGains\nLosses\nEstimated Fair Value\nFixed-income securities\n$\n69\n \n$\n1\n \n$\n—\n \n$\n70\n \n$\n76\n \n$\n1\n \n$\n—\n \n$\n77\n \nTotal debt securities\n$\n69\n \n$\n1\n \n$\n—\n \n$\n70\n \n$\n76\n \n$\n1\n \n$\n—\n \n$\n77\n \nDebt securities are classified as Level 2 within the fair value hierarchy. Realized gains and losses were \nimmaterial\n for 2025 and 2024. We did \nno\nt invest in debt securities during 2023.\nNOTE 21: \nCONTINGENCIES\nFedEx Ground Negligence Lawsuit.\n In December 2022, FedEx Ground was named as a defendant in a lawsuit filed in Texas state court related to the alleged kidnapping and first-degree murder of a minor by a driver employed by a service provider engaged by FedEx Ground. The complaint alleged compensatory and punitive damages against FedEx Ground for negligence and gross negligence, negligent hiring and retention, and negligent entrustment. The service provider and driver were also named as defendants in the lawsuit. In February 2025, we reached an agreement to settle the lawsuit for an amount below the previously established immaterial accrual, and the court approved the settlement and dismissed the case in March 2025.\nOther Litigation Matters.\n FedEx and its subsidiaries are subject to various legal proceedings and claims, including lawsuits alleging that Federal Express should be treated as the employer or joint employer of drivers employed by service providers engaged by Federal Express, lawsuits containing various class-action allegations of wage-and-hour violations in which plaintiffs claim, among other things, that they were forced to work “off the clock,” were not paid overtime, or were not provided work breaks or other benefits, and lawsuits alleging that FedEx and its subsidiaries are responsible for third-party losses related to vehicle accidents that could exceed our insurance coverage for such losses. In the opinion of management, the aggregate liability, if any, with respect to these actions will not have a material adverse effect on our financial position, results of operations, or cash flows.\nEnvironmental Matters.\n SEC regulations require us to disclose certain information about proceedings arising under federal, state, or local environmental provisions involving a governmental authority as a party if we reasonably believe that such proceedings may result in monetary sanctions above a stated threshold. Pursuant to the SEC regulations, FedEx uses a threshold of $\n1\n million or more for purposes of determining whether disclosure of any such proceedings is required. Applying this threshold, there are no environmental matters required to be disclosed for this period.\n \n-112-\nITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE \nNone. \nITEM 9A. CONTROLS AND PROCEDURES \nManagement’s Evaluation of Disclosure Controls and Procedures \nThe management of FedEx, with the participation of our principal executive and financial officers, has evaluated the effectiveness of our disclosure controls and procedures in ensuring that the information required to be disclosed in our filings under the Securities Exchange Act of 1934, as amended, is recorded, processed, summarized, and reported within the time periods specified in the SEC’s rules and forms, including ensuring that such information is accumulated and communicated to FedEx management as appropriate to allow timely decisions regarding required disclosure. Based on such evaluation, our principal executive and financial officers have concluded that such disclosure controls and procedures were effective as of May 31, 2025 (the end of the period covered by this Annual Report). \nAssessment of Internal Control Over Financial Reporting \nManagement’s report on our internal control over financial reporting and the report of Ernst & Young LLP with respect to our internal control over financial reporting are presented in “Item 8. Financial Statements and Supplementary Data” of this Annual Report. \nChanges in Internal Control Over Financial Reporting \n During our fiscal quarter ended May 31, 2025, no change occurred in our internal control over financial reporting that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.\nITEM 9B. OTHER INFORMATION \nTrading Arrangements\nDuring our fiscal quarter ended May 31, 2025, no director or officer of FedEx \nadopted\n, modified, or \nterminated\n any Rule 10b5-1 trading arrangement or non-Rule 10b5-1 trading arrangement, as such terms are defined in Item 408(a) of Regulation S-K.\nDisclosure Pursuant to Section 219 of the Iran Threat Reduction and Syria Human Rights Act of 2012 and Section 13(r) of the Exchange Act\nThe information provided pursuant to Section 13(r) of the Securities Exchange Act of 1934 in Part II, Item 5 (“Other Information”) of FedEx’s Quarterly Report on Form 10-Q for the quarter ended November 30, 2024, is incorporated herein by reference.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III\nITEM 10. DIRECTORS, EXECUTIVE OFFICERS, AND CORPORATE GOVERNANCE \nInformation regarding members of the Board of Directors and certain other aspects of FedEx’s corporate governance (such as the procedures by which FedEx’s stockholders may recommend nominees to the Board of Directors, information about the Audit and Finance Committee, including its members and our “audit committee financial expert,” and information regarding FedEx’s policies and procedures regarding insider trading) will be presented in FedEx’s definitive proxy statement for its 2025 annual meeting of stockholders, which will be held on September 29, 2025, and is incorporated herein by reference. Information regarding executive officers of FedEx is included above in Part I of this Annual Report under the caption “Information About Our Executive Officers” pursuant to the Instruction to Item 401 of Regulation S-K and General Instruction G(3) of Form 10-K. Information regarding FedEx’s Code of Conduct is included above in “\nItem 1. Business\n” of this Annual Report under the caption “Reputation and Responsibility — Governance.” \nITEM 11. EXECUTIVE COMPENSATION \nInformation regarding director and executive compensation (including FedEx’s policies and practices regarding the timing of awards of stock options in relation to the disclosure of material, non-public information) will be presented in FedEx’s definitive proxy statement for its 2025 annual meeting of stockholders, which will be held on September 29, 2025, and is incorporated herein by reference; provided that the information in the “Executive Compensation — Pay Versus Performance” section of the definitive proxy statement is not incorporated herein by reference. \n-113-\nITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS \nInformation regarding security ownership of certain beneficial owners and management and related stockholder matters, as well as equity compensation plan information, will be presented in FedEx’s definitive proxy statement for its 2025 annual meeting of stockholders, which will be held on September 29, 2025, and is incorporated herein by reference. \nITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE \nInformation regarding certain relationships and transactions with related persons (including FedEx’s policies and procedures for the review and preapproval of related person transactions) and director independence will be presented in FedEx’s definitive proxy statement for its 2025 annual meeting of stockholders, which will be held on September 29, 2025, and is incorporated herein by reference.\nITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES \nInformation regarding the fees for services provided by Ernst & Young LLP during 2025 and 2024 and the Audit and Finance Committee’s administration of the engagement of Ernst & Young LLP, including the Committee’s preapproval policies and procedures (such as FedEx’s Policy on Engagement of Independent Auditor), will be presented in FedEx’s definitive proxy statement for its 2025 annual meeting of stockholders, which will be held on September 29, 2025, and is incorporated herein by reference. \n-114-\nPART IV \nITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES \n(a)(1) and (2) Financial Statements; Financial Statement Schedules \nFedEx’s consolidated financial statements, together with the notes thereto and the report of Ernst & Young LLP dated July 21, 2025 thereon, are presented in “\nItem 8. Financial Statements and Supplementary Data\n” of this Annual Report. FedEx’s “Schedule II — Valuation and Qualifying Accounts,” together with the report of Ernst & Young LLP dated July 21, 2025 thereon, is presented on pages \n126\n through \n127\n of this Annual Report. All other financial statement schedules have been omitted because they are not applicable or the required information is included in FedEx’s consolidated financial statements or the notes thereto. \n(a)(3) Exhibits \nExhibit\nNumber\nDescription of Exhibit\nCertificate of Incorporation and Bylaws\n3.1\nRestated Certificate of Incorporation of FedEx. (Filed as Exhibit 3.1 to FedEx’s \nFY25 Second Qua\nrter \nReport on Form \n10-Q\n, and incorporated herein by reference.)\n3.2\nAmended and Restated Bylaws of FedEx. (Filed as Exhibit 3.1 to FedEx’s Current Report on Form 8-K dated and filed March 11, 2024, and incorporated herein by reference.)\nLong-Term Debt Instruments\n*4.1\nDescription of Capital Stock and Debt Securities.\n4.2\nIndenture, dated as of August 8, 2006, between FedEx, the Guarantors named therein and The Bank of New York Mellon Trust Company, N.A. (formerly, The Bank of New York Trust Company, N.A.), as trustee. (Filed as Exhibit 4.3 to FedEx’s Registration Statement on Form S-3 filed on September 19, 2012, and incorporated herein by reference.)\n4.3\nSupplemental Indenture No. 3, dated as of July 27, 2012, between FedEx, the Guarantors named therein and The Bank of New York Mellon Trust Company, N.A., as trustee. (Filed as Exhibit 4.5 to FedEx’s Registration Statement on Form S-3 filed on September 19, 2012, and incorporated herein by reference.)\n4.4\nForm of 3.875% Note due 2042. (Included in Exhibit 4.5 to FedEx’s Registration Statement on Form S-3 filed on September 19, 2012, and incorporated herein by reference.)\n4.5\nSupplemental Indenture No. 4, dated as of April 11, 2013, between FedEx, the Guarantors named therein and The Bank of New York Mellon Trust Company, N.A., as trustee. (Filed as Exhibit 4.1 to FedEx’s Current Report on Form 8-K dated and filed April 11, 2013, and incorporated herein by reference.)\n4.6\nForm of 4.10% Note due 2043. (Included in Exhibit 4.1 to FedEx’s Current Report on Form 8-K dated and filed April 11, 2013, and incorporated herein by reference.)\n4.7\nSupplemental Indenture No. 5, dated as of January 9, 2014, between FedEx, the Guarantors named therein and The Bank of New York Mellon Trust Company, N.A., as trustee. (Filed as Exhibit 4.1 to FedEx’s Current Report on Form 8-K dated and filed January 9, 2014, and incorporated herein by reference.)\n4.8\nForm of 4.900% Note due 2034. (Included in Exhibit 4.1 to FedEx’s Current Report on Form 8-K dated and filed January 9, 2014, and incorporated herein by reference.)\n4.9\nForm of 5.100% Note due 2044. (Included in Exhibit 4.1 to FedEx’s Current Report on Form 8-K dated and filed January 9, 2014, and incorporated herein by reference.)\n4.10\nSupplemental Indenture No. 6, dated as of January 9, 2015, between FedEx, the Guarantors named therein and The Bank of New York Mellon Trust Company, N.A., as trustee. (Filed as Exhibit 4.1 to FedEx’s Current Report on Form 8-K dated and filed January 9, 2015, and incorporated herein by reference.)\n4.11\nForm of 3.900% Note due 2035. (Included in Exhibit 4.1 to FedEx’s Current Report on Form 8-K dated and filed January 9, 2015, and incorporated herein by reference.)\n4.12\nForm of 4.100% Note due 2045. (Included in Exhibit 4.1 to FedEx’s Current Report on Form 8-K dated and filed January 9, 2015, and incorporated herein by reference.)\n-115-\n4.13\nForm of 4.500% Note due 2065. (Included in Exhibit 4.1 to FedEx’s Current Report on Form 8-K dated and filed January 9, 2015, and incorporated herein by reference.)\n4.14\nSupplemental Indenture No. 7, dated as of February 26, 2025, among FedEx Corporation, as issuer, the subsidiary guarantors named therein and U.S. Bank Trust Company, National Association, as trustee. (Filed as Exhibit 4.1 to FedEx's Current Report on Form 8-K dated February 24, 2025 and filed February 26, 2025, and incorporated herein by reference).\n4.15\nIndenture, dated as of October 23, 2015, between FedEx, the Guarantors named therein and Wells Fargo Bank, National Association, as trustee. (Filed as Exhibit 4.1 to FedEx’s Current Report on Form 8-K dated and filed October 23, 2015, and incorporated herein by reference.)\n4.16\nSupplemental Indenture No. 1, dated as of October 23, 2015, between FedEx, the Guarantors named therein and Wells Fargo Bank, National Association, as trustee. (Filed as Exhibit 4.2 to FedEx’s Current Report on Form 8-K dated and filed October 23, 2015, and incorporated herein by reference.)\n4.17\nForm of 4.750% Note due 2045. (Included in Exhibit 4.2 to FedEx’s Current Report on Form 8-K dated and filed October 23, 2015, and incorporated herein by reference.)\n4.18\nSupplemental Indenture No. 2, dated as of March 24, 2016, between FedEx, the Guarantors named therein and Wells Fargo Bank, National Association, as trustee. (Filed as Exhibit 4.2 to FedEx’s Current Report on Form 8-K dated and filed March 24, 2016, and incorporated herein by reference.)\n4.19\nForm of 3.250% Note due 2026. (Included in Exhibit 4.2 to FedEx’s Current Report on Form 8-K dated and filed March 24, 2016, and incorporated herein by reference.)\n4.20\nForm of 4.550% Note due 2046. (Included in Exhibit 4.2 to FedEx’s Current Report on Form 8-K dated and filed March 24, 2016, and incorporated herein by reference.)\n4.21\nSupplemental Indenture No. 3, dated as of April 11, 2016, between FedEx, the Guarantors named therein, Wells Fargo Bank, National Association, as trustee, and Elavon Financial Services Limited, UK Branch, as paying agent. (Filed as Exhibit 4.2 to FedEx’s Current Report on Form 8-K dated and filed April 11, 2016, and incorporated herein by reference.)\n4.22\nForm of 1.625% Note due 2027. (Included in Exhibit 4.2 to FedEx’s Current Report on Form 8-K dated and filed April 11, 2016, and incorporated herein by reference.)\n4.23\nSupplemental Indenture No. 4, dated as of January 6, 2017, between FedEx, the Guarantors named therein and Wells Fargo Bank, National Association, as trustee. (Filed as Exhibit 4.2 to FedEx’s Current Report on Form 8-K dated and filed January 6, 2017, and incorporated herein by reference.)\n4.24\nForm of 4.400% Note due 2047. (Included in Exhibit 4.2 to FedEx’s Current Report on Form 8-K dated and filed January 6, 2017, and incorporated herein by reference.)\n4.25\nSupplemental Indenture No. 5, dated as of January 31, 2018, between FedEx, the Guarantors named therein and Wells Fargo Bank, National Association, as trustee. (Filed as Exhibit 4.2 to FedEx’s Current Report on Form 8-K dated and filed January 31, 2018, and incorporated herein by reference.)\n4.26\nForm of 3.400% Note due 2028. (Included in Exhibit 4.2 to FedEx’s Current Report on Form 8-K dated and filed January 31, 2018, and incorporated herein by reference.)\n4.27\nForm of 4.050% Note due 2048. (Included in Exhibit 4.2 to FedEx’s Current Report on Form 8-K dated and filed January 31, 2018, and incorporated herein by reference.)\n4.28\nSupplemental Indenture No. 6, dated as of October 17, 2018, between FedEx, the Guarantors named therein and Wells Fargo Bank, National Association, as trustee. (Filed as Exhibit 4.2 to FedEx’s Current Report on Form 8-K dated and filed October 17, 2018, and incorporated herein by reference.)\n4.29\nForm of 4.200% Note due 2028. (Included in Exhibit 4.2 to FedEx’s Current Report on Form 8-K dated and filed October 17, 2018, and incorporated herein by reference.)\n4.30\nForm of 4.950% Note due 2048. (Included in Exhibit 4.2 to FedEx’s Current Report on Form 8-K dated and filed October 17, 2018, and incorporated herein by reference.)\n-116-\n4.31\nSupplemental Indenture No. 9, dated as of July 24, 2019, between FedEx, the Guarantors named therein and Wells Fargo Bank, National Association, as trustee. (Filed as Exhibit 4.2 to FedEx’s Current Report on Form 8-K dated and filed July 24, 2019, and incorporated herein by reference.)\n4.32\nForm of 3.100% Note due 2029. (Included in Exhibit 4.2 to FedEx’s Current Report on Form 8-K dated and filed July 24, 2019, and incorporated herein by reference.)\n4.33\nSupplemental Indenture No. 10, dated as of August 5, 2019, between FedEx, the Guarantors named therein, Wells Fargo Bank, National Association, as trustee, and Elavon Financial Services DAC, UK Branch, as paying agent. (Filed as Exhibit 4.2 to FedEx’s Current Report on Form 8-K dated and filed August 5, 2019, and incorporated herein by reference.)\n4.34\nForm of 0.450% Note due 2025. (Included in Exhibit 4.2 to FedEx’s Current Report on Form 8-K dated and filed August 5, 2019, and incorporated herein by reference.)\n4.35\nForm of 1.300% Note due 2031. (Included in Exhibit 4.2 to FedEx’s Current Report on Form 8-K dated and filed August 5, 2019, and incorporated herein by reference.)\n4.36\nSupplemental Indenture No. 11, dated as of April 7, 2020, between FedEx, the Guarantors named therein and Wells Fargo Bank, National Association, as trustee. (Filed as Exhibit 4.2 to FedEx’s Current Report on Form 8-K dated and filed April 7, 2020, and incorporated herein by reference.)\n4.37\nForm of 4.250% Note due 2030. (Included in Exhibit 4.2 to FedEx’s Current Report on Form 8-K dated and filed April 7, 2020, and incorporated herein by reference.)\n4.38\nForm of 5.250% Note due 2050. (Included in Exhibit 4.2 to FedEx’s Current Report on Form 8-K dated and filed April 7, 2020, and incorporated herein by reference.)\n4.39\nPass Through Trust Agreement, dated as of August 13, 2020, between Fed\neral\n Express and Wilmington Trust Company. (Filed as Exhibit 4.1 to FedEx’s Current Report on Form 8-K dated and filed August 13, 2020 (the “August 13, 2020 Form 8-K”), and incorporated herein by reference.)\n4.40\nTrust Supplement No. 2020-1AA, dated as of August 13, 2020, between Fed\neral\n Express and Wilmington Trust Company, as Trustee, to the Pass Through Trust Agreement dated as of August 13, 2020. (Filed as Exhibit 4.2 to the August 13, 2020 Form 8-K, and incorporated herein by reference.)\n \n4.41\nGuarantee of FedEx dated August 13, 2020. (Filed as Exhibit 4.3 to the August 13, 2020 Form 8-K, and incorporated herein by reference.)\n4.42\nForm of Pass Through Trust Certificate, Series 2020-1AA. (Included in Exhibit A to Exhibit 4.2 to the August 13, 2020 Form 8-K, and incorporated herein by reference.)\n4.43\nIntercreditor Agreement, dated as of August 13, 2020, among Wilmington Trust Company, as Trustee of the FedEx Pass Through Trust 2020-1AA, BNP Paribas, acting through its New York Branch, as Liquidity Provider, and Wilmington Trust Company, as Subordination Agent. (Filed as Exhibit 4.5 to the August 13, 2020 Form 8-K, and incorporated herein by reference.)\n4.44\nRevolving Credit Agreement (2020-1AA), dated as of August 13, 2020, between Wilmington Trust Company, as Subordination Agent, agent and trustee for the trustee of the FedEx Pass Through Trust 2020-1AA and as Borrower, and BNP Paribas, acting through its New York Branch, as Liquidity Provider (the “Liquidity Provider Revolving Credit Agreement”). (Filed as Exhibit 4.6 to the August 13, 2020 Form 8-K, and incorporated herein by reference.)\n4.45\nAmendment No. 1, dated May 22, 2023, to the Liquidity Provider Revolving Credit Agreement. (Filed as Exhibit 4.44 to FedEx’s FY23 Annual Report on Form 10-K, and incorporated herein by reference.)\n** †4.46\nParticipation Agreement (N126FE), dated as of August 13, 2020, among\n Federal\n Express, Wilmington Trust Company, as Pass Through Trustee under the Pass Through Trust Agreements, Wilmington Trust Company, as Subordination Agent, Wilmington Trust Company, as Loan Trustee, and Wilmington Trust Company, in its individual capacity as set forth therein. (Filed as Exhibit 4.7 to the August 13, 2020 Form 8-K, and incorporated herein by reference.)\n \n-117-\n*** †4.47\nParticipation Agreement (N869FD), dated as of August 13, 2020, among Fed\ne\nral\n Express, Wilmington Trust Company, as Pass Through Trustee under the Pass Through Trust Agreements, Wilmington Trust Company, as Subordination Agent, Wilmington Trust Company, as Loan Trustee, and Wilmington Trust Company, in its individual capacity as set forth therein. (Filed as Exhibit 4.8 to the August 13, 2020 Form 8-K, and incorporated herein by reference.)\n**4.48\nIndenture and Security Agreement (N126FE), dated as of August 13, 2020, between Fed\neral\n Express and Wilmington Trust Company, as Loan Trustee. (Filed as Exhibit 4.9 to the August 13, 2020 Form 8-K, and incorporated herein by reference.)\n \n***4.49\nIndenture and Security Agreement (N869FD), dated as of August 13, 2020, between Fed\neral\n Express and Wilmington Trust Company, as Loan Trustee. (Filed as Exhibit 4.10 to the August 13, 2020 Form 8-K, and incorporated herein by reference.)\n \n4.50\nForm of Series 2020-1AA Equipment Notes. (Included in Exhibit 4.9 to the August 13, 2020 Form 8-K, and incorporated herein by reference.)\n \n4.51\nSupplemental Indenture No. 12, dated as of April 29, 2021, between FedEx, the Guarantors named therein and Wells Fargo Bank, National Association, as trustee. (Filed as Exhibit 4.2 to FedEx’s Current Report on Form 8-K dated and filed April 29, 2021, and incorporated herein by reference.)\n4.52\nForm of 2.400% Note due 2031. (Included in Exhibit 4.2 to FedEx’s Current Report on Form 8-K dated and filed April 29, 2021, and incorporated herein by reference.)\n4.53\nForm of 3.250% Note due 2041. (Included in Exhibit 4.2 to FedEx’s Current Report on Form 8-K dated and filed April 29, 2021, and incorporated herein by reference.)\n4.54\nSupplemental Indenture No. 13, dated as of May 4, 2021, between FedEx, the Guarantors named therein, Wells Fargo Bank, National Association, as trustee, and Elavon Financial Services DAC, UK Branch, as paying agent. (Filed as Exhibit 4.2 to FedEx’s Current Report on Form 8-K dated and filed May 4, 2021, and incorporated herein by reference.)\n4.55\nForm of 0.450% Note due 2029. (Included in Exhibit 4.2 to FedEx’s Current Report on Form 8-K dated and filed May 4, 2021, and incorporated herein by reference.)\n4.56\nForm of 0.950% Note due 2033. (Included in Exhibit 4.2 to FedEx’s Current Report on Form 8-K dated and filed May 4, 2021, and incorporated herein by reference.)\n4.57\nSupplemental Indenture No. 14, dated as of February 26, 2025, among FedEx, as issuer, the subsidiary guarantors named therein and U.S. Bank Trust Company, National Association, as trustee. (Filed as Exhibit 4.3 to FedEx\n’\ns Current Report on Form 8-K dated February 24, 2025 and filed February 26, 2025, and incorporated herein by reference).\n4.58\nSupplemental Indenture No. 15, dated as of February 26, 2025, among FedEx, as issuer, the subsidiary guarantors named therein and U.S. Bank Trust Company, National Association, as trustee. (Filed as Exhibit 4.4 to FedEx\n’\ns Current Report on Form 8-K dated February 24, 2025 and filed February 26, 2025, and incorporated herein by reference).\n4.59\nForm of 3.400% Notes due 2028. (Included in Exhibit 4.4 to FedEx’s Current Report on Form 8-K dated February 24, 2025 and filed February 26, 2025, and incorporated herein by reference).\n4.60\nForm of 4.200% Notes due 2028. (Included in Exhibit 4.4 to FedEx’s Current Report on Form 8-K dated February 24, 2025 and filed February 26, 2025, and incorporated herein by reference).\n4.61\nForm of 3.100% Notes due 2029. (Included in Exhibit 4.4 to FedEx’s Current Report on Form 8-K dated February 24, 2025 and filed February 26, 2025, and incorporated herein by reference).\n4.62\nForm of 4.250% Notes due 2030. (Included in Exhibit 4.4 to FedEx’s Current Report on Form 8-K dated February 24, 2025 and filed February 26, 2025, and incorporated herein by reference).\n4.63\nForm of 2.400% Notes due 2031. (Included in Exhibit 4.4 to FedEx’s Current Report on Form 8-K dated February 24, 2025 and filed February 26, 2025, and incorporated herein by reference).\n4.64\nForm of 4.900% Notes due 2034. (Included in Exhibit 4.4 to FedEx’s Current Report on Form 8-K dated February 24, 2025 and filed February 26, 2025, and incorporated herein by reference).\n-118-\n4.65\nForm of 3.900% Notes due 2035. (Included in Exhibit 4.4 to FedEx’s Current Report on Form 8-K dated February 24, 2025 and filed February 26, 2025, and incorporated herein by reference).\n4.66\nForm of 3.250% Notes due 2041. (Included in Exhibit 4.4 to FedEx’s Current Report on Form 8-K dated February 24, 2025 and filed February 26, 2025, and incorporated herein by reference).\n4.67\nForm of 3.875% Notes due 2042. (Included in Exhibit 4.4 to FedEx’s Current Report on Form 8-K dated February 24, 2025 and filed February 26, 2025, and incorporated herein by reference).\n4.68\nForm of 4.100% Notes due 2043. (Included in Exhibit 4.4 to FedEx’s Current Report on Form 8-K dated February 24, 2025 and filed February 26, 2025, and incorporated herein by reference).\n4.69\nForm of 5.100% Notes due 2044 (included in Exhibit 4.4 to the February 24, 2025 Form 8-K, and incorporated herein by reference).\n4.70\nForm of 4.100% Notes due 2045 (included in Exhibit 4.4 to the February 24, 2025 Form 8-K, and incorporated herein by reference).\n4.71\nForm of 4.750% Notes due 2045. (Included in Exhibit 4.4 to FedEx’s Current Report on Form 8-K dated February 24, 2025 and filed February 26, 2025, and incorporated herein by reference).\n4.72\nForm of 4.550% Notes due 2046. (Included in Exhibit 4.4 to FedEx’s Current Report on Form 8-K dated February 24, 2025 and filed February 26, 2025, and incorporated herein by reference).\n4.73\nForm of 4.400% Notes due 2047 (included in Exhibit 4.4 to the February 24, 2025 Form 8-K, and incorporated herein by reference).\n4.74\nForm of 4.050% Notes due 2048 (included in Exhibit 4.4 to the February 24, 2025 Form 8-K, and incorporated herein by reference).\n4.75\nForm of 4.950% Notes due 2048. (Included in Exhibit 4.4 to FedEx’s Current Report on Form 8-K dated February 24, 2025 and filed February 26, 2025, and incorporated herein by reference).\n4.76\nForm of 5.250% Notes due 2050 (included in Exhibit 4.4 to the February 24, 2025 Form 8-K, and incorporated herein by reference).\n4.77\nForm of 4.500% Notes due 2065 (included in Exhibit 4.4 to the February 24, 2025 Form 8-K, and incorporated herein by reference).\n4.78\nSupplemental Indenture No. 16, dated as of February 26, 2025, among FedEx, as issuer, the subsidiary guarantors named therein, U.S. Bank Trust Company, National Association, as trustee, and U.S. Bank Europe DAC, UK Branch, as paying agent. (Filed as Exhibit 4.24 to FedEx’s Current Report on Form 8-K dated February 24, 2025 and filed February 26, 2025, and incorporated herein by reference).\n4.79\nForm of 0.450% Notes due 2029. (Included in Exhibit 4.24 to FedEx’s Current Report on Form 8-K dated February 24, 2025 and filed February 26, 2025, and incorporated herein by reference).\n4.80\nForm of 1.300% Notes due 2031. (Included in Exhibit 4.24 to FedEx’s Current Report on Form 8-K dated February 24, 2025 and filed February 26, 2025, and incorporated herein by reference).\n4.81\nForm of 0.950% Notes due 2033. (Included in Exhibit 4.24 to FedEx’s Current Report on Form 8-K dated February 24, 2025 and filed February 26, 2025, and incorporated herein by reference).\n4.82\nRegistration Rights Agreement, dated February 26, 2025, among FedEx, the subsidiary guarantors named therein and Goldman Sachs & Co. LLC. (Filed as Exhibit 4.28 to FedEx’s Current Report on Form 8-K dated February 24, 2025 and filed February 26, 2025, and incorporated herein by reference).\n4.83\nSuccession Agreement, dated as of December 13, 2021, among FedEx, the guarantors named therein, The Bank of New York Mellon Trust Company, N.A., and U.S. Bank National Association. (Filed as Exhibit 4.1 to FedEx’s Current Report on Form 8-K dated December 13, 2021 and filed December 16, 2021, and incorporated herein by reference.)\n4.84\nSuccession Agreement, dated as of December 13, 2021, among FedEx, the guarantors named therein, Computershare Trust Company, N.A., as agent for Wells Fargo Bank, National Association, and U.S. Bank National Association. (Filed as Exhibit 4.2 to FedEx’s Current Report on Form 8-K dated December 13, 2021 and filed December 16, 2021, and incorporated herein by reference.)\n-119-\nFacility Lease Agreements\n10.1\nComposite Lease Agreement dated May 21, 2007 (but effective as of January 1, 2007) between the Memphis-Shelby County Airport Authority and Fed\neral Express\n (the “Composite Lease Agreement”). (Filed as Exhibit 10.1 to FedEx’s FY07 Annual Report on Form 10-K, and incorporated herein by reference.)\n10.2\nFirst Amendment dated December 29, 2009 (but effective as of September 1, 2008) to the Composite Lease Agreement. (Filed as Exhibit 10.1 to FedEx’s FY10 Third Quarter Report on Form 10-Q, and incorporated herein by reference.)\n10.3\nSecond Amendment dated March 30, 2010 (but effective as of June 1, 2009) and Third Amendment dated April 27, 2010 (but effective as of July 1, 2009), each to the Composite Lease Agreement. (Filed as Exhibit 10.3 to FedEx’s FY10 Annual Report on Form 10-K, and incorporated herein by reference.)\n10.4\nFourth Amendment dated December 22, 2011 (but effective as of December 15, 2011) to the Composite Lease Agreement. (Filed as Exhibit 10.4 to FedEx’s FY12 Third Quarter Report on Form 10-Q, and incorporated herein by reference.)\n10.5\nFifth Amendment dated December 19, 2012 (but effective as of January 1, 2013) to the Composite Lease Agreement. (Filed as Exhibit 10.5 to FedEx’s FY13 Third Quarter Report on Form 10-Q, and incorporated herein by reference.)\n10.6\nSixth Amendment dated September 19, 2013 (but effective as of July 1, 2014) to the Composite Lease Agreement. (Filed as Exhibit 10.5 to FedEx’s FY14 Second Quarter Report on Form 10-Q, and incorporated herein by reference.)\n10.7\nSeventh Amendment dated June 1, 2016 (but effective as of April 1, 2016) to the Composite Lease Agreement. (Filed as Exhibit 10.7 to FedEx’s FY16 Annual Report on Form 10-K, and incorporated herein by reference.)\n10.8\nEighth Amendment dated July 29, 2016 (but effective as of April 1, 2017) to the Composite Lease Agreement. (Filed as Exhibit 10.14 to FedEx’s FY17 First Quarter Report on Form 10-Q, and incorporated herein by reference.)\n10.9\nNinth Amendment dated August 14, 2017 (but effective as of September 1, 2017) to the Composite Lease Agreement. (Filed as Exhibit 10.9 to FedEx’s FY18 First Quarter Report on Form 10-Q, and incorporated herein by reference.)\n10.10\nTenth Amendment dated May 22, 2018 (but effective as of May 1, 2018) to the Composite Lease Agreement. (Filed as Exhibit 10.10 to FedEx’s FY18 Annual Report on Form 10-K, and incorporated herein by reference.)\n10.11\nEleventh Amendment dated January 22, 2019 (but effective as of January 1, 2019) to the Composite Lease Agreement. (Filed as Exhibit 10.9 to FedEx’s FY19 Third Quarter Report on Form 10-Q, and incorporated herein by reference.)\n†10.12\nTwelfth Amendment dated April 9, 2019 (but effective as of April 1, 2019) to the Composite Lease Agreement. (Filed as Exhibit 10.12 to FedEx’s FY19 Annual Report on Form 10-K, and incorporated herein by reference.)\n \n†10.13\nThirteenth Amendment dated and effective July 26, 2021 to the Composite Lease Agreement. (Filed as Exhibit 10.3 to FedEx’s FY22 First Quarter Report on Form 10-Q, and incorporated herein by reference.) \n†10.14\nFourteenth Amendment dated March 14, 2022 (but effective as of February 1, 2022) to the Composite Lease Agreement. (Filed as Exhibit 10.14 to FedEx’s FY22 Annual Report on Form 10-K, and incorporated herein by reference.)\n†10.15\nFifteenth Amendment dated and effective May 19, 2022 to the Composite Lease Agreement. (Filed as Exhibit 10.15 to FedEx’s FY22 Annual Report on Form 10-K, and incorporated herein by reference.)\n†10.16\nSixteenth Amendment dated June 27, 2023 (but effective as of May 1, 2023) to the Composite Lease Agreement. (Filed as Exhibit 10.16 to FedEx’s FY23 Annual Report on Form 10-K, and incorporated herein by reference.)\n†10.17\nSeventeenth Amendment dated September 30, 2024 (but effective as of September 1, 2024) to the Composite Lease Agreement\n. (Filed as Exhibit 10.1\n to FedEx’s FY2\n5\n \nSecond\n Quarter\n Report on Form 10-\nQ\n, and incorporated herein by reference.)\n \nFinancing Agreements\n-120-\n †10.18\nThree-Year Credit Agreement dated as of March 15, 2024, among FedEx, JPMorgan Chase Bank, N.A., individually and as administrative agent, and other financial institutions.\n (Filed as Exhibit 10.47 to FedEx\n’\ns FY2\n4 Annual Rep\nort on Form 10-K, and incorporated here\nin by reference).\n \n†10.19\nFive-Year Credit Agreement dated as of March 15, 2024, among FedEx, JPMorgan Chase Bank, N.A., individually and as administrative agent, and other financial institutions. \n(Filed as Exhibit 10.4\n8\n to FedEx\n’\ns FY24 Annual Report on Form 10-K, and incorporated herein by reference).\n \nManagement Contracts/Compensatory Plans or Arrangements\n10.20\nFedEx 2010 Omnibus Stock Incentive Plan, as amended (the “2010 Omnibus Stock Incentive Plan”). (Filed as Exhibit 10.12 to FedEx’s FY18 Second Quarter Report on Form 10-Q, and incorporated herein by reference.)\n10.21\nForm of Terms and Conditions of stock option grant pursuant to the 2010 Omnibus Stock Incentive Plan. (Filed as Exhibit 4.4 to FedEx’s Registration Statement No. 333-171232 on Form S-8, and incorporated herein by reference.)\n10.22\nForm of Terms and Conditions of restricted stock grant pursuant to the 2010 Omnibus Stock Incentive Plan. (Filed as Exhibit 4.5 to FedEx’s Registration Statement No. 333-171232 on Form S-8, and incorporated herein by reference).\n10.23\nForm of Restricted Stock Agreement pursuant to the 2010 Omnibus Stock Incentive Plan. (Filed as Exhibit 4.5 to FedEx’s Registration Statement No. 333-192957 on Form S-8, and incorporated herein by reference).\n10.24\nFedEx 2019 Omnibus Stock Incentive Plan, as amended (the “2019 Omnibus Stock Incentive Plan”). (Filed as Exhibit 99.1 to FedEx’s Registration Statement No. 333-267559 on Form S-8, and incorporated herein by reference.)\n10.25\nForm of Terms and Conditions of Stock Option Grant for U.S. Employees pursuant to the 2019 Omnibus Stock Incentive Plan. (Filed as Exhibit 99.2 to FedEx’s Registration Statement No. 333-234010 on Form S-8, and incorporated herein by reference.)\n10.26\nForm of Stock Option Agreement for Non-U.S. Participants pursuant to the 2019 Omnibus Stock Incentive Plan. (Filed as Exhibit 99.3 to FedEx’s Registration Statement No. 333-234010 on Form S-8, and incorporated herein by reference).\n10.27\nForm of Stock Option Agreement for Non-Management Members of the Board of Directors pursuant to the 2019 Omnibus Stock Incentive Plan. (Filed as Exhibit 99.4 to FedEx’s Registration Statement No. 333-234010 on Form S-8, and incorporated herein by reference).\n10.28\nForm of Restricted Stock Agreement for U.S. Participants pursuant to the 2019 Omnibus Stock Incentive Plan. (Filed as Exhibit 99.5 to FedEx’s Registration Statement No. 333-234010 on Form S-8, and incorporated herein by reference).\n10.29\nForm of Restricted Stock Agreement for Non-U.S. Participants pursuant to the 2019 Omnibus Stock Incentive Plan. (Filed as Exhibit 99.6 to FedEx’s Registration Statement No. 333-234010 on Form S-8, and incorporated herein by reference).\n10.30\nForm of Restricted Stock Unit Agreement for Non-Management Directors pursuant to the 2019 Omnibus Stock Incentive Plan. (Filed as Exhibit 10.1 to FedEx’s Current Report on Form 8-K dated September 21, 2023 and filed September 22, 2023, and incorporated herein by reference).\n10.31\nAmended and Restated FedEx Retirement Parity Pension Plan, effective June 1, 2024.\n (Filed as Exhibit 10.60 to FedEx's FY24 Annual Report on Form 10-K, and incorporated herein by reference).\n \n10.32\nFedEx Office Supplemental Retirement Plan dated December 30, 2019 (but effective as of January 1, 2020). (Filed as Exhibit 10.102 to FedEx’s FY22 Annual Report on Form 10-K, and incorporated herein by reference.)\n10.33\nFirst Amendment to FedEx Office Supplemental Retirement Plan dated December 22, 2021 (but effective as of January 1, 2021). (Filed as Exhibit 10.103 to FedEx’s FY22 Annual Report on Form 10-K, and incorporated herein by reference.)\n10.34\nSecond Amendment to FedEx Office Supplemental Retirement Plan dated June 20, 2022 (but effective as of August 1, 2022). (Filed as Exhibit 10.104 to FedEx’s FY22 Annual Report on Form 10-K, and incorporated herein by reference.)\n10.35\nFedEx’s Amended and Restated Retirement Plan for Outside Directors. (Filed as Exhibit 10.2 to FedEx’s FY09 Second Quarter Report on Form 10-Q, and incorporated herein by reference.)\n-121-\n10.36\nForm of Management Retention Agreement between FedEx and each of \nRajesh Subramaniam, \nGina F. Adams, \nTracy B. Brightman, Brie A. Carere, John W. Dietrich, \nSriram Krishnasamy, \nJohn A. Smith, and Richard W. Smith. (Filed as Exhibit 10.5 to FedEx’s FY10 Third Quarter Report on Form 10-Q, and incorporated herein by reference.)\n10.37\nLetter Agreement, dated July 11, 2022, between FedEx and Sriram Krishnasamy\n.\n (Filed as Exhibit \n10.67 \nto FedE\nx's \nFY2\n4\n Annual Report on Form 10-K, and incorporated here\nin by refer\nence).\n10.38\nFedEx Supplemental Short-Term Disability Plan, effective January 1, 2025 (Filed as Exhibit 10.1  to FedEx's FY25 Third Quarter Report on Form 10-Q, and incorporated herein by reference).\n10.39\nFedEx Supplemental Long-Term Disability Plan, effective January 1, 2025 (Filed as Exhibit 10.2  to FedEx's FY25 Third Quarter Report on Form 10-Q, and incorporated herein by reference).\nOther Exhibits\n19\nFedEx Securities Manual, amended as of June 10, 2024 (Filed as Exhibit 19 to FedEx's FY24 Annual Report on Form 10-K, and incorporated herein by reference).\n*21\nSubsidiaries of Registrant.\n*22\nList of Guarantor Subsidiaries.\n*23\nConsent of Independent Registered Public Accounting Firm.\n*24\nPowers of Attorney (presented on the signature pages of this Annual Report).\n*31.1\nCertification of Principal Executive Officer Pursuant to Rules 13a-14(a) and 15d-14(a) under the Securities Exchange Act of 1934, as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n*31.2\nCertification of Principal Financial Officer Pursuant to Rules 13a-14(a) and 15d-14(a) under the Securities Exchange Act of 1934, as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n*32.1\nCertification of Principal Executive Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n*32.2\nCertification of Principal Financial Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n97.1\nFedEx Policy on Recoupment of Incentive Compensation. (Filed as Exhibit 97.1 to FedEx's FY24 Annual Report on Form 10-K , and incorporated herein by reference).\n**99.1\nSchedule I related to the Fed\neral Express\n Pass Through Certificates, Series 2020-1AA (the “Certificates”). (Filed as Exhibit 99.1 to the August 13, 2020 Form 8-K, and incorporated herein by reference).\n***99.2\nSchedule II related to the Certificates. (Filed as Exhibit 99.2 to the August 13, 2020 Form 8-K, and incorporated herein by reference).\n*101.1\nInteractive Data Files pursuant to Rule 405 of Regulation S-T formatted in Inline Extensible Business Reporting Language (“Inline XBRL”).\n*104\nCover Page Interactive Data File (formatted in Inline XBRL and contained in Exhibit 101.1).\n \n* Filed herewith.\n** Pursuant to Instruction 2 to Item 601 of Regulation S-K, Exhibit 99.1 to the August 13, 2020 Form 8-K contains a list of documents applicable to the Boeing 767-300F aircraft (other than the aircraft bearing Registration No. N126FE) that relate to the offering of the Certificates, which documents are substantially identical to those which are filed as Exhibits 4.7 and 4.9 to the August 13, 2020 Form 8-K, except for the information identifying such aircraft in question and various information relating to the principal amounts of the equipment notes relating to such aircraft. Exhibit 99.1 to the August 13, 2020 Form 8-K sets forth the details by which such documents differ from the corresponding representative sample of documents filed as Exhibits 4.7 and 4.9 to the August 13, 2020 Form 8-K with respect to the aircraft bearing Registration No. N976JT.\n*** Pursuant to Instruction 2 to Item 601 of Regulation S-K, Exhibit 99.2 to the August 13, 2020 Form 8-K contains a list of documents applicable to the Boeing 777F aircraft (other than the aircraft bearing Registration No. N869FD) that relate to the offering of the Certificates, which documents are substantially identical to those which are filed as Exhibits 4.8 and 4.10 to the August 13, 2020 \n-122-\nForm 8-K, except for the information identifying such aircraft in question and various information relating to the principal amounts of the equipment notes relating to such aircraft. Exhibit 99.2 to the August 13, 2020 Form 8-K sets forth the details by which such documents differ from the corresponding representative sample of documents filed as Exhibits 4.8 and 4.10 to the August 13, 2020 Form 8-K with respect to the aircraft bearing Registration No. N869FD.\n† Certain attachments have been omitted pursuant to Item 601(a)(5) of Regulation S-K because the information contained therein is not material and is not otherwise publicly disclosed. FedEx will furnish supplementally copies of such attachments to the SEC or its staff upon request.\nITEM 16. FORM 10-K SUMMARY\nNone.\n-123-\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, as amended, the Registrant has duly caused this Report to be signed on its behalf by the undersigned, thereunto duly authorized. \n  \nFEDEX CORPORATION\n \nDated: July 21, 2025\nBy:\n /s/ Rajesh Subramaniam\n \n \n \n      Rajesh Subramaniam\n \n \n \n      President and Chief Executive Officer\n \nPower of Attorney\n. KNOW ALL PERSONS BY THESE PRESENTS, that\n each person whose signature appears below hereby constitutes and appoints \nRajesh Subramaniam\n, \nJohn W. Dietrich\n, and \nGuy M. Erwin II\n, and each of them, his or her true and lawful attorneys-in-fact and agents, with full power of substitution and resubstitution, for him or her and in his or her name, place and stead, in any and all capacities, to sign any and all amendments to this Annual Report on Form 10-K, and to file the same, with any and all exhibits thereto, and other documents in connection therewith, with the Securities and Exchange Commission, and hereby grants to such attorneys-in-fact and agents, and each of them, full power and authority to do and perform each and every act and thing requisite and necessary to be done in connection therewith, as fully to all intents and purposes as he or she might or could do in person, hereby ratifying and confirming all that said attorneys-in-fact and agents, or any of them, or their or his substitute or substitutes, may lawfully do or cause to be done by virtue hereof.\nPursuant to the requirements of the Securities Exchange Act of 1934, as amended, this Report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated. \n \nSignature\nCapacity\nDate\n /s/ Rajesh Subramaniam\nPresident and Chief Executive\nJuly 21, 2025\nRajesh Subramaniam\nOfficer and Director\n(Principal Executive Officer)\n /s/  John W. Dietrich\nExecutive Vice President and\nJuly 21, 2025\n John W. Dietrich\nChief Financial Officer\n(Principal Financial Officer)\n /s/ Guy M. Erwin II\nCorporate Vice President and Chief \nJuly 21, 2025\nGuy M. Erwin II\nAccounting Officer\n(Principal Accounting Officer)\n/s/ Silvia Davila\nDirector\nJuly 21, 2025\n     Silvia Davila\n /s/ Marvin R. Ellison\nDirector\nJuly 21, 2025\nMarvin R. Ellison\n /s/ Stephen E. Gorman\nDirector\nJuly 21, 2025\nStephen E. Gorman\n /s/ Susan Patricia Griffith\nDirector\nJuly 21, 2025\nSusan Patricia Griffith\n /s/ Amy B. Lane\nDirector\nJuly 21, 2025\nAmy B. Lane\n-124-\n /s/ R. Brad Martin\nDirector\nJuly 21, 2025\nR. Brad Martin\n /s/ Nancy A. Norton\nDirector\nJuly 21, 2025\nNancy A. Norton\n /s/ Frederick Perpall\nDirector\nJuly 21, 2025\nFrederick Perpall\n /s/ Joshua Cooper Ramo\nDirector\nJuly 21, 2025\nJoshua Cooper Ramo\n /s/ Susan C. Schwab\nDirector\nJuly 21, 2025\n      Susan C. Schwab\n /s/ Paul S. Walsh\nDirector\nJuly 21, 2025\nPaul S. Walsh\n-125-\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors of\nFedEx Corporation\nWe have audited the consolidated financial statements of FedEx Corporation (the Company) as of May 31, 2025 and 2024, and for each of the three years in the period ended May 31, 2025, and have issued our report thereon dated July 21, 2025 included elsewhere in this Form 10-K. Our audits of the consolidated financial statements included the financial statement schedule listed in Item 15(a) of this Form 10-K (the “schedule”). This schedule is the responsibility of the Company's management. Our responsibility is to express an opinion on the Company’s schedule, based on our audits.\nIn our opinion, the schedule presents fairly, in all material respects, the information set forth therein when considered in conjunction with the consolidated financial statements.\n/s/ Ernst & Young LLP\nMemphis, Tennessee\nJuly 21, 2025\n-126-\nSCHEDULE II \nFEDEX CORPORATION \nVALUATION AND QUALIFYING ACCOUNTS \nFOR THE YEARS ENDED MAY 31, 2025, 2024, AND 2023\n(IN MILLIONS) \nAdditions\nDescription\nBalance\nat\nbeginning\nof year\nCharged\nto\nexpenses\nCharged to other accounts\nDeductions\nBalance at end of year\nAccounts Receivable Reserves:\nAllowance for Credit Losses\n2025\n$\n436\n \n$\n521\n \n$\n—\n \n$\n519\n \n(a)\n$\n438\n \n2024\n472\n \n421\n \n—\n \n457\n \n(a)\n436\n \n2023\n340\n \n696\n \n—\n \n564\n \n(a)\n472\n \nAllowance for Revenue Adjustments\n2025\n$\n339\n \n$\n—\n \n$\n1,495\n \n(b)\n$\n1,499\n \n(c)\n$\n335\n \n2024\n328\n \n—\n \n1,534\n \n(b)\n1,523\n \n(c)\n339\n \n2023\n352\n \n—\n \n1,662\n \n(b)\n1,686\n \n(c)\n328\n \nInventory Valuation Allowance:\n2025\n$\n288\n \n$\n41\n \n$\n—\n \n$\n21\n \n$\n308\n \n2024\n276\n \n40\n \n—\n \n28\n \n288\n \n2023\n360\n \n33\n \n—\n \n117\n \n276\n \n(a)\nUncollectible accounts written off, net of recoveries, and other adjustments. \n(b)\nPrincipally charged against revenue. \n(c)\nService failures, rebills, and other.\n \n-127-"
  }
}