{
  "ticker": "FE",
  "cik": "0001031296",
  "company_name": "FIRSTENERGY CORP",
  "filing_date": "2025-02-27",
  "accession": "0001031296-25-000006",
  "primary_doc": "fe-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1.     BUSINESS\nThe Companies\nFE and its subsidiaries are principally involved in the transmission, distribution, and generation of electricity. FirstEnergy’s electric operating companies comprise one of the nation’s largest investor-owned electric systems, serving over six million customers in the Midwest and Mid-Atlantic regions. FirstEnergy’s transmission operations include more than 24,000 miles of transmission lines and two regional transmission operation centers. As of December 31, 2024, MP and AGC control 3,604 MWs of total capacity.\nRegulated Electric Company Operating Subsidiaries\nThe Electric Companies’ combined service areas encompass approximately 65,000 square miles in Ohio, Pennsylvania, West Virginia, Maryland, New Jersey, and New York, providing distribution services for over six million customers in an area with a population of approximately 14 million and include more than 9,900 miles of transmission lines. Total rate base was approximately $20.6 billion as of December 31, 2024.\nOE owns property and does business as an electric public utility in Ohio, providing distribution services to approximately 1.1 million customers in central and northeastern Ohio, with a rate base of $2.1 billion as of December 31, 2024. OE has 1,061 employees and serves an area that has a population of approximately 2.4 million.\nCEI owns property and does business as an electric public utility in Ohio, providing distribution services to approximately 0.8 million customers in northeastern Ohio, with a rate base of $1.7 billion as of December 31, 2024. CEI has 819 employees and serves an area that has a population of approximately 1.7 million.\nTE owns property and does business as an electric public utility in Ohio, providing distribution services to approximately 0.3 million customers in northwestern Ohio, with a rate base of $0.6 billion as of December 31, 2024. TE has 324 employees and serves an area that has a population of approximately 0.7 million.\nFE PA owns property and does business as an electric public utility in Pennsylvania and New York, providing distribution services to approximately 2.1 million customers in Pennsylvania and four thousand customers in Waverly, New York, with a rate base of $6.6 billion as of December 31, 2024. FE PA has 2,083 employees and serves an area that has a population of approximately 4.5 million. On January 1, 2024, FirstEnergy consolidated the Pennsylvania Companies into FE PA, rendering FE PA a new, single operating entity and the successor-in-interest to all assets and liabilities of the Pennsylvania Companies. As of January 1, 2024, FE PA is FE’s only regulated distribution power company in Pennsylvania encompassing the operations previously conducted individually by the Pennsylvania Companies. \nJCP&L owns property and does business as an electric public utility in New Jersey, providing distribution services to approximately 1.2 million customers, as well as transmission services in northern, western, and east central New Jersey, with a combined rate base of $4.7 billion as of December 31, 2024. JCP&L has 1,296 employees and serves an area that has a population of approximately 2.8 million.\nPE owns property and does business as an electric public utility in Maryland, Virginia, and West Virginia, providing distribution services to approximately 0.5 million customers in Maryland and West Virginia and provides transmission services in Maryland, West Virginia and Virginia. PE had a combined rate base of approximately $1.6 billion as of December 31, 2024. PE has 505 employees and serves an area that has a population of approximately 1.0 million.\nMP owns property and does business as an electric public utility in West Virginia, providing distribution services to approximately 0.4 million customers, as well as generation and transmission services in northern West Virginia, with a combined rate base of $3.3 billion as of December 31, 2024. MP has 1,040 employees and serves an area with a population of approximately 0.8 million. MP is contractually obligated to provide power to PE to meet its load obligations in West Virginia. MP owns or contractually controls 3,604 MWs of net maximum generation capacity that is supplied to its electric utility business, including 24 MWs of Solar generation and 487 MWs of pumped-storage hydroelectric generation from its 16.25% undivided interest in the Bath County facility in Virginia through its wholly-owned subsidiary AGC.\nRegulated Transmission Company Operating Subsidiaries\nFET, a holding company and parent of ATSI, MAIT, TrAIL, and PATH, is a VIE of FE, which holds 50.1% of its issued and outstanding membership interests. Brookfield owns the remaining 49.9% of the issued and outstanding membership interests of FET. Through its subsidiaries, FET owns and operates high-voltage transmission facilities in the PJM Region and has a rate base of $8.5 billion. FET's subsidiaries are subject to regulation by FERC and applicable state regulatory authorities. FET and its subsidiaries have no direct employees. Each of these companies, however, relies on employees of their affiliates, including FESC, for the performance of necessary services. On January 1, 2024, PN and ME contributed their respective Class B equity interests of MAIT to FE, which were ultimately contributed to FET in exchange for a special purpose membership interest in FET. \n1\nSo long as FE holds the FET special purpose membership interests, it will receive 100% of any Class B distributions made by MAIT.\nOn July 26, 2024, FE, VEPCO and Transource Energy, LLC, a subsidiary of AEP, entered into a joint proposal agreement in connection with PJM’s 2024 Regional Transmission Expansion Plan Open Window 1 process. Pursuant to such joint proposal agreement, FET, VEPCO and Transource Energy, LLC jointly proposed certain regional electric transmission projects for PJM's consideration during the Open Window process. On November 25, 2024, FET, Dominion High Voltage MidAtlantic, Inc., as affiliate of VEPCO, and Transource Energy, LLC, formed Valley Link, which is the holding company responsible for managing and executing any projects awarded by PJM, and entered into a limited liability agreement. On February 26, 2025, PJM selected certain of the joint proposed projects, which included approximately $3 billion in investments for Valley Link to both build new and upgrade existing transmission infrastructure.\nATSI owns high-voltage transmission facilities in PJM, which consist of 7,964 circuit miles of transmission lines with nominal voltages of 345 kV, 138 kV and 69 kV in Ohio and Pennsylvania and has a rate base of $4.3 billion as of December 31, 2024.\nMAIT owns high-voltage transmission facilities in PJM, which consist of 4,287 circuit miles of transmission lines with nominal voltages of 500 kV, 345 kV, 230 kV, 138 kV, 115 kV, 69 kV and 46 kV in Pennsylvania, and has a rate base of $2.8 billion as of December 31, 2024.\nTrAIL owns high-voltage transmission facilities in PJM, which consists of 269 circuit miles of transmission lines with nominal voltages of 500 kV, 345 kV, 230 kV, 138 kV, including a 500 kV transmission line extending approximately 150 miles from southwestern Pennsylvania through West Virginia to a point of interconnection with VEPCO in northern Virginia, and has a rate base of $1.4 billion as of December 31, 2024.\nPATH was a proposed transmission line from West Virginia through Virginia into Maryland which PJM cancelled in 2012. In March 2024, PATH completed the process of terminating all of its FERC-jurisdictional rates and facilities, with the result that PATH no longer is a “public utility” and no longer is subject to FERC jurisdiction. FET and its non-affiliated joint venture partner are completing the process of terminating the PATH corporate entities.\nKATCo owns high-voltage transmission facilities formerly owned by WP in PJM, which consist of 1,696 circuit miles of transmission lines with nominal voltages of 500 kV, 345 kV, 230 kV, 138 kV, and 115 kV in Pennsylvania, and has a rate base of $0.5 billion as of December 31, 2024. On January 1, 2024, WP transferred certain of its Pennsylvania-based transmission assets to KATCo. See Note 1, \"Organization and Basis of Presentation,\" for more information.\nService Company\nFESC has 5,166 employees and provides corporate support and other services, including executive administration, accounting and finance, risk management, human resources, corporate affairs, communications, information technology, legal services and other similar services at cost, in accordance with its cost allocation manual, to affiliated FirstEnergy companies under FESC agreements. \nSegments Overview\nDuring the first quarter of 2024, FirstEnergy’s segment reporting structure was modified to increase transparency for leadership and investors, simplify the presentation to corresponding legal entities, and align FirstEnergy’s earnings, cash flows and balance sheets at the business unit level. FirstEnergy’s reportable segments are as follows, and FirstEnergy continues to evaluate segment performance based on earnings attributable to FE from continuing operations: \n•\nDistribution Segment, which consists of the Ohio Companies and FE PA; \n•\nIntegrated Segment, which consists of MP, PE and JCP&L; and \n•\nStand-Alone Transmission Segment, which consists of FE's ownership in FET and KATCo.\nFE and its subsidiaries are principally involved in the transmission, distribution and generation of electricity through its reportable segments: Distribution, Integrated and Stand-Alone Transmission.\nThe \nDistribution\n segment, which consists of the Ohio Companies and FE PA, representing $11 billion in rate base as of December 31, 2024, distributes electricity through FirstEnergy’s electric operating companies in Ohio and Pennsylvania. The Distribution segment serves approximately 4.3 million customers in Ohio and Pennsylvania across its distribution footprint and purchases power for its provider of last resort, SOS, standard service offer and default service requirements. The segment’s results reflect the costs of securing and delivering electric generation to customers, including the deferral and amortization of certain costs.\nThe \nIntegrated\n segment includes the distribution and transmission operations under JCP&L, MP and PE, as well as MP’s regulated generation operations, representing $9.6 billion in rate base as of December 31, 2024. The Integrated segment distributes electricity to approximately 2 million customers in New Jersey, West Virginia and Maryland across its distribution footprint; provides transmission infrastructure in New Jersey, West Virginia, Maryland and Virginia to transmit electricity and \n2\noperates 3,604 MWs of regulated net maximum generation capacity located primarily in West Virginia and Virginia. The segment will also include MP and PE’s 50 MWs of solar generation at five sites in West Virginia once complete. The first two solar generation sites were completed and placed in service in January and September 2024, representing 24 MWs of net maximum generating capacity. The remaining three sites, once completed, are expected to provide 26 MWs of additional net maximum generation capacity.\nThe\n Stand-Alone Transmission\n segment, which consists of FE's ownership in FET and KATCo, representing $5.3 billion in rate base as of December 31, 2024, includes transmission infrastructure owned and operated by the Transmission Companies and used to transmit electricity. The segment’s revenues are primarily derived from forward-looking formula rates, pursuant to which the revenue requirement is updated annually based on a projected rate base and projected costs, which is subject to an annual true-up based on actual rate base and costs. The segment’s results also reflect the net transmission expenses related to the delivery of electricity on FirstEnergy’s transmission facilities. KATCo, which was a subsidiary of FET, became a wholly owned subsidiary of FE prior to the closing of the FET P&SA I and remains in the Stand-Alone Transmission segment. On January 1, 2024, WP transferred certain of its Pennsylvania-based transmission assets to KATCo and prior year results in the Stand-Alone Transmission segment reflect the earnings and results of those WP transmission assets.\nCorporate/Other\n reflects corporate support and other costs not charged or attributable to the Electric Companies or Transmission Companies, including FE’s retained pension and OPEB assets and liabilities of former subsidiaries, interest expense on FE’s holding company debt and other investments or businesses that do not constitute an operating segment, including FEV’s investment of 33-1/3% equity ownership in Global Holding. Also included in Corporate/Other for segment reporting is 67 MWs of net maximum generation capacity, representing AE Supply’s OVEC capacity entitlement. As of December 31, 2024, Corporate/Other had approximately $6.1 billion of external FE holding company debt. \nRegulatory Accounting \nFirstEnergy accounts for the effects of regulation through the application of regulatory accounting to the Electric Companies and the Transmission Companies as their rates are established by third-party regulators with the authority to set binding rates that are cost-based and can be charged to and collected from customers.\nThe Electric Companies and the Transmission Companies recognize, as regulatory assets and regulatory liabilities, costs that FERC and the various state utility commissions, as applicable, have authorized for recovery from or return to customers in future periods or for which authorization is probable. Without the probability of such authorization, costs currently recorded as regulatory assets and regulatory liabilities would have been charged or credited to income as incurred. All regulatory assets and liabilities are expected to be recovered from or returned to customers. Based on current ratemaking procedures, the Electric Companies and the Transmission Companies continue to collect cost-based rates for their distribution and transmission services; accordingly, it is appropriate that the Electric Companies and the Transmission Companies continue the application of regulatory accounting to those operations. Regulatory accounting is applied only to the parts of the business that meet the above criteria. If a portion of the business applying regulatory accounting no longer meets those requirements, previously recorded regulatory assets and liabilities are removed from the balance sheet in accordance with GAAP.\nState Regulation and Federal Regulation\nThe following table summarizes the allowed ROE and the aggregate actual ROE of the Electric Companies and Transmission Companies as determined for regulatory purposes as of and for the year ended December 31, 2024:\nSegment\nEntity/State\nAllowed ROE\nActual ROE\nStand-Alone Transmission\nFET\n9.88%\n(1)\n - 12.7%\n10.4%\n(2)\nKATCo\n9.6%\n10.45%\nIntegrated\nMaryland\n9.5% - Distribution\n10.45% - Transmission\n8.3%\nNew Jersey\n9.6% - Distribution\n10.2% - Transmission\n9.3%\nWest Virginia\n9.8%\n8.4%\nDistribution\nOhio\n10.8%\n(3)\n4.7%\n(3)\nPennsylvania\nSettled\n(4)\n9.0%\n(1) \nReflects a 0.5% reduction to ATSI's 10.38% approved ROE due to the January 2025 Sixth Circuit ruling eliminating the 50 basis point adder associated with RTO membership (see Transmission ROE Incentive: OCC v. ATSI, et al. below)\n(2)\n FET ROE is a weighted average allowed ROE of ATSI, MAIT and TrAIL\n(3) \nAs filed on July 31, 2024, in pending base rate case before revenue adjustment\n(4)\n Commission-approved settlement agreement did not disclose ROE\n3\nSee \"Outlook - State Regulation\" in Item 7, \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" for additional information and discussion.\nSee \"Outlook - FERC Regulatory Matters\" in Item 7, \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" for additional information and discussion.\nEnvironmental Matters\nSee \"Outlook - Environmental Matters\" in Item 7, \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" for additional information and discussion.\nCapital Requirements\nFirstEnergy’s business is capital intensive, requiring significant resources to fund operating expenses, construction and other investment expenditures, scheduled debt maturities and interest payments, dividend payments and potential contributions to its pension plan. See \"Capital Resources and Liquidity\" in Item 7, \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" for additional information and discussion.\nSupply Plan\nSupply Chain\nEconomic conditions have stabilized across numerous material categories, but not all lead times have returned to pre-pandemic levels. Several key suppliers have seen improvements with capacity, but FirstEnergy continues to monitor the situation as demand increases across the industry, including due to data center usage. Inflationary pressures have moderated, which has improved the cost of materials, but certain categories have remained elevated. FirstEnergy continues to implement mitigation strategies to address supply constraints and does not expect any corresponding service disruptions or any material impact on its capital investment plan. However, the situation remains fluid and a prolonged continuation or further increase in demand, or the continuation of uncertain or adverse macroeconomic conditions, including inflationary pressures and new or increased existing tariffs, could lead to an increase in supply chain disruptions that could, in turn, have an adverse effect on FirstEnergy’s results of operations, cash flow and financial condition.\nIn February 2025, the new U.S. presidential administration announced the imposition of widespread and substantial tariffs on imports, with plans for additional tariffs to potentially be adopted in the future. Although certain of these tariffs were subsequently temporarily stayed, the situation is dynamic and subject to rapid change. The imposition of these or any other new or increased tariffs or resultant trade wars could have an adverse effect on FirstEnergy's results of operations, cash flow and financial condition.\nDefault Service\nCertain of the Electric Companies have default service obligations to provide power to non-shopping customers who have elected to continue to receive service under regulated retail tariffs. These default service plans vary by state and service territory, and volume of sales can vary depending on the level of shopping that occurs. JCP&L’s default service, or BGS supply, is secured through a statewide competitive procurement process approved by the NJBPU. Default service for the Ohio Companies, FE PA and PE's Maryland jurisdiction are provided through a competitive procurement process approved by the PUCO (under the current ESP), PPUC (under the Default Service Plan) and MDPSC (under the SOS), respectively. If any supplier fails to deliver power to any one of those Electric Companies’ service areas, the Utility serving that area may need to procure the required power in the market in their role as the default load serving entity. West Virginia electric generation continues to be regulated by the WVPSC.\nFuel Supply\nMP has coal contracts with various terms to purchase approximately 3 million tons of coal for the year 2025, which, along with its 2024 year-end inventory levels, accounts for approximately 80% of its forecasted 2025 coal requirements. MP has the ability to acquire additional tonnage through options available in its current contracts, as well as purchases through the spot market. The contracts expire at various times through 2027. This contracted coal is produced primarily from mines located in Pennsylvania and West Virginia. In order to meet emission requirements, MP holds contracts for a variety of reagents expiring at various times through 2026, as well as the ability to purchase additional reagents through the spot market. Additionally, MP is granted emission allowances by the EPA and purchases additional allowances as needed to meet emission requirements. See \"Outlook - Environmental Matters\" in Item 7, \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" for additional information pertaining to the impact of increased environmental regulations on fuel supply.\n4\nSystem Demand\nThe maximum hourly demand in 2024, 2023 and 2022 for each of the Electric Companies was:\nFor the Years Ended December 31,\nSystem Demand\n2024\n2023\n2022\n(In MWs)\nCEI\n3,971 \n3,868 \n4,266 \nFE PA\n1\n10,404 \n10,058 \n10,255 \nJCP&L\n6,184 \n5,731 \n6,122 \nMP\n2,096 \n2,051 \n2,124 \nOE\n5,582 \n5,192 \n5,652 \nPE\n3,860 \n3,103 \n3,514 \nTE\n2,074 \n2,220 \n2,277 \n(1)\n On January 1, 2024, FirstEnergy consolidated the Pennsylvania Companies into FE PA, making it a new, single operating entity. \nRegional Reliability\nAll of FirstEnergy's facilities are located within the PJM Region and operate under the reliability oversight of a regional entity known as RFC. This regional entity operates under the oversight of NERC in accordance with a delegation agreement approved by FERC.\nCompetition\nWithin FirstEnergy’s Electric Companies' distribution business, there generally is no competition for electric distribution service in the Electric Companies’ respective service territories in Ohio, Pennsylvania, West Virginia, Maryland, New Jersey and New York. Additionally, pursuant to FERC’s Order No. 1000 and subject to state and local siting and permitting approvals, non-incumbent developers can compete for certain PJM transmission projects in the service territories of certain of FirstEnergy’s Electric Companies' providing transmission services and the Transmission Companies. This has resulted in additional competition to build transmission facilities in the respective service territories while also allowing the opportunity to seek to build facilities in non-incumbent service territories.\nSeasonality\nThe sale of electric power is generally a seasonal business, and weather patterns can have, and have in the past had, a material impact on FirstEnergy’s Electric Companies' operating results. Demand for electricity in our service territories historically peaks during the summer and winter months. Accordingly, FirstEnergy’s annual results of operations and liquidity position may depend disproportionately on its operating performance during the summer and winter. Mild weather conditions may result in lower power sales, and consequently, lower revenue, earnings and cash flow.\nHuman Capital\nFirstEnergy focuses on a number of human capital resources, measures and objectives in managing its business, including through striving to achieve its core values.\nFirstEnergy believes that creating a sense of belonging among our employees positions the company to deliver better service to customers, strengthen operational performance, and help create a work environment where employees feel valued and respected. FirstEnergy remains focused advancing a culture of belonging for employees.\nDuring 2024, FirstEnergy continued to promote these values by:\n•\nSponsoring a council of select senior management and other leaders and influential employees across the company, who work together to promote our core values throughout the workforce;\n•\nSharing the results of our most recent employee engagement survey designed to capture our employees’ perspectives on their work experience and progress toward embracing a more welcoming culture; and\n•\nSupporting multiple employee business resource groups, known as \"EBRGs,\" to further support our values through networking, mentoring, coaching, recruiting, development and community outreach. There are currently 9 EBRGs across 21 chapters, which are open to all employees.\n5\nSafety \nSafety is an unwavering core value of FirstEnergy. FirstEnergy employees have the power and responsibility to keep each other safe and eliminate life-changing events, which are injuries that have life-changing impacts or fatal results. Safety metrics, such as injuries that result in days away or restricted time and life-changing events, are regularly monitored, internally reported, and included in FirstEnergy’s annual incentive compensation program to reinforce that a safe work environment is crucial to FirstEnergy’s success. \nFirstEnergy continues to focus on mitigating life-changing event exposure to strengthen FirstEnergy’s safety-first culture and drive safer decisions from an engaged workforce who puts safety first. FirstEnergy continues to embed its \"Leading with Safety\" learnings where leaders and employees receive safety training and reinforcement of exposure control concepts that are designed to improve job site exposure identification, communication and mitigation to ultimately prevent life changing events. \nEmployee Development\nFirstEnergy’s employees are empowered to take ownership of their careers with increased transparency into FirstEnergy’s internal and external hiring process and availability of tools and processes that support career management, talent reviews, succession planning and leadership selection. FirstEnergy is committed to preparing its high-performing workforce for the future and helping employees reach their full potential, which includes developing employee skills and competencies and preparing aspiring, emerging and experienced leaders for future leadership responsibilities.\nUnderstanding FirstEnergy’s rapidly changing industry and strategy is key to its employees’ ability to support FirstEnergy’s mission and meet its customers’ evolving needs. Key FirstEnergy development programs include: \n•\nTalent management\n, which includes a commitment to transparency in career management and development opportunities, consistent with FirstEnergy’s core values;\n•\nA \nmentoring program \nthat gives employees the opportunity to select a mentor from within the organization to promote enhanced learning, teamwork and collaboration;\n•\nLeadership development opportunities \nthat include training for new supervisors and managers, experienced leader programming and coaching, aspiring leader programs that build leadership capabilities for employees who are ready near-term leadership roles; and external partnership with the Center for Creative Leadership\n®\n and BeingFirst\n®\n for senior and executive leadership development;\n•\nEducational opportunities\n through FirstEnergy’s \"Educate to Elevate\" program, which provides access to post-secondary education and a path to both associate’s and bachelor’s degrees for employees; and\n•\nWorkforce development programs\n that include an apprentice line worker program designed to attract technical entry-level talent to FirstEnergy.\nCompensation and Benefits\nFirstEnergy’s total rewards program is designed to attract, motivate, retain and reward employees for their role in the success of FirstEnergy. The base pay program is designed to balance an employee’s value to FirstEnergy in a manner that is commensurate with comparable jobs at peer companies. FirstEnergy aims to ensure that its internal policies and processes support pay equity.\nThe annual incentive compensation program is designed to align compensation with the achievement of near-term corporate and business unit objectives, as well as outstanding individual performance. Additionally, FirstEnergy’s long-term incentive compensation program is designed to reward eligible leaders for FirstEnergy’s achievement of longer-term goals intended to drive shareholder value and growth. In addition to base pay and incentive compensation plans, FirstEnergy offers a comprehensive benefits program, including healthcare, dental, prescription, vision, a 401(k) savings plan and a defined benefit pension plan to eligible employees. \n6\nEmployees and Collective Bargaining Agreements \nAs of December 31, 2024, FirstEnergy had 12,294 employees, all of whom were located in the United States as follows:\nTotal\nEmployees\nBargaining\nUnit\nEmployees\nFESC\n5,166 \n521 \nCEI\n819 \n570 \nFE PA\n2,083 \n1,536 \nJCP&L\n1,296 \n992 \nMP\n1,040 \n396 \nOE\n1,061 \n666 \nPE\n505 \n246 \nTE\n324 \n249 \nTotal\n12,294\n \n5,176\n \nAs of December 31, 2024, the IBEW, the UWUA and the OPEIU unions collectively represented approximately 40% of FirstEnergy’s employees. There are currently 15 collective bargaining agreements between FirstEnergy’s subsidiaries and its unions, which have multi-year contracts. In 2024, FirstEnergy’s subsidiaries reached new collective bargaining agreements with IBEW Local 1289, IBEW Local 459 and OPEIU 792. One collective bargaining agreement was set to expire in 2025, with a settlement reached in January 2025, representing approximately 3% of FirstEnergy’s employees.\n7\nInformation About Our Executive Officers (as of February 27, 2025) \nName\nAge\nPositions Held During Past Five Years\nDates\nBrian X. Tierney\n57\nChair, President and Chief Executive Officer (A)\n2024-Present\nPresident and Chief Executive Officer (A)\n2023-2024\nPresident and Chief Executive Officer (B)\n2023-Present\nBlackstone Infrastructure Partners, Senior Managing Director\n2021-2023\nAEP, Executive Vice President - Strategy\n2021\nAEP, Executive Vice President and Chief Financial Officer\n*-2020\nHyun Park\n63\nSenior Vice President and Chief Legal Officer (A) (B)\n2021-Present\nSenior Vice President and General Counsel (C) (D)\n2021-2022\nLimNexus, Partner and General Counsel\n*-2021\nJason J. Lisowski\n43\nVice President, Controller and Chief Accounting Officer (A) (B)\n*-Present\nVice President and Controller (C) (E)\n*-Present\nK. Jon Taylor\n51\nSenior Vice President, Chief Financial Officer and Strategy (A) (B)\n2021-Present\nSenior Vice President and Chief Financial Officer (C) (E)\n2020-2024\nSenior Vice President and Chief Financial Officer (A) (B)\n2020-2021\nVice President, Utility Operations (B)\n*-2020\nPresident (D)\n*-2020\nToby L. Thomas\n53\nChief Operating Officer (A) (B)\n2023-Present\nAEP, Senior Vice President\n2021-2023\nIndiana Michigan Power, President and Chief Operating Officer\n*-2021\nA. Wade Smith\n60\nPresident, FirstEnergy Utilities (A) (B)\n2023-Present\nPuget Sound Energy, Inc., Executive Vice President and Chief Operating Officer\n2022-2023\nPacific Gas & Electric, Senior Vice President\n2021-2022\nAEP, Senior Vice President\n*-2021\n* Indicates position held at least since January 1, 2020\n(A) Denotes position held at FE\n(B) Denotes position held at FESC\n(C) Denotes position held at the Ohio Companies, the Pennsylvania Companies\n(1)\n, MP, PE, FET, ATSI, MAIT, TrAIL and KATCo.\n(D) Denotes position held at AGC\n(E) Denotes position held at FE PA\n(1)\n(1)\n On January 1, 2024, FirstEnergy consolidated the Pennsylvania Companies into FE PA, making it a new, single operating entity. Upon consolidation, executive officers of the Pennsylvania Companies were named as executive officers of FE PA.\n8\nFirstEnergy Website and Other Social Media Sites and Applications\nFirstEnergy's Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, amendments to those reports, and all other documents filed with or furnished to the SEC pursuant to Section 13(a) of the Exchange Act are made available free of charge on FirstEnergy’s website at investors.firstenergycorp.com. These documents are also available to the public from commercial document retrieval services and the website maintained by the SEC at www.sec.gov.\nFirstEnergy has adopted, and posted on its website at www.firstenergycorp.com/responsibility, a Code of Conduct, The Power of Integrity, which applies to all employees, including FirstEnergy’s Chief Executive Officer, Chief Financial Officer and Chief Accounting Officer. The Code of Conduct is available, without charge, upon written request to the Corporate Secretary, FirstEnergy Corp., 76 South Main Street, Akron, Ohio 44308-1890. Within the time period required by the SEC, FirstEnergy will post on its website any substantive amendment to the Code of Conduct and any waiver applicable to an FE director or FE executive officer.\nThese SEC filings are posted on the website as soon as reasonably practicable after they are electronically filed with or furnished to the SEC. Additionally, FirstEnergy routinely posts additional important information, including press releases, investor presentations, investor factbooks and notices of upcoming events under the \"Investors\" section of FirstEnergy’s website and recognizes FirstEnergy’s website as a channel of distribution to reach public investors and as a means of disclosing (including initially or exclusively) material non-public information for complying with disclosure obligations under Regulation FD. Investors may be notified of postings to the website by signing up for email alerts and Rich Site Summary feeds on the “Investors” page of FirstEnergy’s website. FirstEnergy also uses X (the social networking site formerly known as Twitter®), LinkedIn®, YouTube® and Facebook® as additional channels of distribution to reach public investors and as a supplemental means of disclosing material non-public information for complying with its disclosure obligations under Regulation FD. Information contained on FirstEnergy’s website, X (the social networking site formerly known as Twitter®) handle, LinkedIn® profile, YouTube® channel or Facebook® page, and any corresponding applications of those sites, shall not be deemed incorporated into, or to be part of, this report.\n9",
    "item1a": "Item 1A. Risk Factors should be read in conjunction with this",
    "item1b": "ITEM 1B.     UNRESOLVED STAFF COMMENTS\nNone.",
    "item1c": "Item 1C. Cybersecurity."
  }
}