{
  "ticker": "FISV",
  "cik": "0000798354",
  "company_name": "FISERV INC",
  "filing_date": "2025-02-20",
  "accession": "0000798354-25-000047",
  "primary_doc": "fi-20241231.htm",
  "item_sections": {
    "item1": "Item 1.  Business \nOverview\nFiserv, Inc. is a leading global provider of payments and financial services technology solutions. We are publicly traded on the New York Stock Exchange and part of the S&P 500 Index. We serve clients around the globe, including merchants, banks, credit unions, other financial institutions, corporate and public sector clients. We help clients achieve best-in-class results through a commitment to innovation and excellence in areas including account processing and digital banking solutions; card issuer processing and network services; payments; e-commerce; merchant acquiring and processing; and the Clover\n®\n cloud-based point-of-sale (“POS”) and business management platform. Most of the products and services we provide are necessary for our clients to operate their businesses and are therefore non-discretionary in nature. We serve our global client base by working among our geographic teams across various regions, including the United States of America (“U.S.”) and Canada; Europe, Middle East and Africa; Latin America; and Asia Pacific.\nIn 2024, we had $20.5 billion in total revenue, $5.9 billion in operating income and $6.6 billion of net cash provided by operating activities. Processing and services revenue, which in 2024 represented 81% of our total revenue, is primarily generated from account- and transaction-based fees under multi-year contracts that generally have high renewal rates. We have operations and offices located both within the U.S. and Canada, and internationally, which as a percentage of total revenue were as follows:\nYear Ended December 31,\n(In millions)\n2024\n2023\n2022\nTotal revenue\n$\n20,456 \n$\n19,093 \n$\n17,737 \nU.S. and Canada\n85 \n%\n85 \n%\n86 \n%\nInternational \n(1)\n15 \n%\n15 \n%\n14 \n%\n(1)\n Represents revenue in the following international regions: EMEA (Europe, Middle East and Africa), LATAM (Latin America) and APAC (Asia-Pacific).\nWe have grown our business through acquisitions and organically by signing new clients, expanding the products and services we provide to existing clients, offering new and enhanced products and services developed through innovation and acquisition, and extending our capabilities geographically, all of which have enabled us to deliver a wide range of products and services and created new opportunities for growth.\nOur headquarters are located at 600 N. Vel R. Phillips Avenue, Milwaukee, Wisconsin 53203, and our telephone number is (262) 879-5000.\nEffective in the first quarter of 2024, we realigned our reportable segments to correspond with changes in our business designed to further enhance operational performance in the delivery of our integrated portfolio of products and solutions to our financial institution clients (the “Segment Realignment”). Our new reportable segments are the Merchant Solutions (“Merchant”) segment and the Financial Solutions (“Financial”) segment. \nMerchant Solutions \nThe businesses in our Merchant segment provide commerce-enabling products and services to companies of all sizes around the world. These products and services include merchant acquiring and digital commerce services; mobile payment services; security and fraud protection solutions; stored-value solutions; software-as-a-service (“SaaS”); POS devices; and pay-by-bank solutions. The business lines aggregated within the Merchant segment consist of the following: \n•\nSmall Business –\n provides products and services to small businesses and independent software vendors (“ISVs”), including Clover\n®\n, our POS and business management platform for small business clients\n•\nEnterprise –\n provides products and services to large businesses, including our integrated omnichannel operating system for enterprise clients\n2\nTable of Contents\n                                 \n \n•\nProcessing – \nprovides products and services to financial institutions, joint ventures, and other third party resellers which have direct relationships with merchants\nWe distribute the products and services in the Merchant segment businesses through a variety of channels, including direct sales teams, strategic partnerships with agent sales forces, ISVs, independent sales organizations (“ISOs”), financial institutions and other strategic partners in the form of merchant alliances, revenue sharing alliances and referral agreements.\nSmall Business \nWe offer merchant acquiring solutions to enable small businesses to securely accept payment transactions online or in-person. Payment transactions include credit, debit, gift card and loyalty payments online or through a physical POS or mobile device, such as a smartphone or tablet.\nOur global point-of-sale and business management platform, Clover\n®\n, includes hardware and software technology necessary to enable small business merchants to accept payments; take orders; schedule pick-up and delivery services; and provide vertical specific business management tools. By integrating next-generation hardware and SaaS capabilities, along with value-added services, Clover has become a leader in enabling omnichannel commerce solutions for small businesses. We also offer small business owners advance access to capital through our Clover Capital cash advance and, within our international operations, merchant anticipation programs.\nEnterprise \nWe provide products and services to large businesses that are designed to enable clients to engage in commerce through various channels including online and mobile, drive value and savings through transactions, and engage more customers. Our integrated omnichannel operating system allows enterprise clients to orchestrate payments and create consistent customer commerce experiences, delivered how and when their customers want. These solutions help clients maximize approval rates, reduce declines, lower fraud and chargebacks, reduce costs and improve the customer experience. Through this integrated platform, a variety of payment and commerce solutions can be accessed, including payment acceptance, payments optimization, fraud mitigation, online electronic benefits transfers, pay-by-bank and digital payouts. We also offer a single platform for payment facilitators, marketplaces, software companies, and acquiring banks to compliantly manage boarding, credit and risk, and money movement for sub-merchants. Clients can access our enterprise services through Commerce Hub™, our next generation gateway and orchestration layer that provides full-function e-commerce, omnichannel and multi-acquirer solutions that ease development effort and maintenance.\nOur Enterprise business also provides end-to-end, omnichannel solutions to securely implement and manage stored value programs such as gift cards and loyalty, which help clients drive revenue and customer engagement. These solutions include physical and digital gift card fulfillment, program management, e-commerce gift card storefronts, security and fraud protection, transaction processing services, incentive and rebate cards as well as reloadable and non-reloadable prepaid cards that may be used with a variety of mobile applications. We help our clients consolidate their forms of stored value in a single digital wallet that is enabled in-store for true omnichannel customer engagement. Additionally, we provide payment services to companies, such as utilities, telephone and cable companies, lending institutions and insurance providers. These services enable our clients to reduce costs, collect payments faster through multiple channels and increase customer satisfaction, providing customers flexible, easy-to-use ways to view and pay their bills.\nProcessing\nWe provide products and services to financial institutions, joint ventures, and other third-party resellers such as ISOs, which have direct relationships with merchants. We provide these distribution partners with integrated merchant technology solutions to help them grow their businesses and manage their portfolios. Partner technology tools enable real-time access to portfolio activity and pricing management. These strategic alliances combine our commerce-enabling technology, processing capabilities and management expertise with the distribution capabilities, footprint and customer relationships of our partners.\nFinancial Solutions\nThe businesses in our Financial segment provide products and services to financial institution, corporate and public sector clients across the world, enabling the processing of customer loan and deposit accounts, digital payments and card transactions. The business lines aggregated within the Financial segment consist of the following: \n•\nDigital Payments\n \n–\n provides debit card processing services; debit network services; security and fraud protection products; bill payment; person-to-person payments; and account-to-account transfers\n3\nTable of Contents\n                                 \n \n•\nIssuing\n \n–\n provides credit card processing services; prepaid card processing services; card production services; print services; government payment processing; and student loan processing\n•\nBanking\n \n–\n provides customer loan and deposit account processing; digital banking; financial and risk management; professional services and consulting; and check processing\nDigital Payments\nWe are a leading enabler of digital payment capabilities to financial institutions of all sizes, including solutions that help clients enable debit card processing services, peer-to-peer payments, account-to-account transfers, bill payment capabilities, and Automated Clearing House (“ACH”) and real-time payments.\nWe provide debit card processing services, which include tokenization, loyalty and reward programs; customized authorization processing; gateway processing to payment networks; ATM managed services and cash and logistics management; and risk management products. We also provide security, risk and fraud management solutions, which incorporate machine-learning-based predictive technology, that help financial institutions securely operate and grow their business by preventing fraud. CardHub provides our clients’ customers with mobile, customizable card management and alert tools that drive engagement and revenue for card issuers. We also own and operate the Accel\n®\n, STAR\n®\n and MoneyPass\n®\n networks, which provide access to funds for debit card purchases through any physical and online channel. These networks are available to all issuers and merchants in the U.S.\nOur person-to-person payment and account-to-account transfer services allow consumers a convenient way to send and receive money while offering financial institutions the opportunity to generate new transaction-based revenue, attract new accounts and increase loyalty among existing customers. We offer a turnkey implementation of Zelle\n®\n real-time person-to-person payments service. Our electronic bill payment and presentment product for financial and other institutions, CheckFree\n®\n RXP\n®\n, allows our clients’ customers to manage household bills via an easy-to-use, online tool; view billing and payment information; pay and manage their bills in one place; and complete same-day or next-day bill payments to a wide range of billers and others. In addition, CashFlow Central\n℠\n, an integrated digital payment and cash flow management product, enables financial institutions to better meet the payments needs of small businesses. \nAdditionally, we offer products and services which enable operating efficiencies and management insight by providing financial institutions with the infrastructure they need to process, route and settle non-card-based electronic payments, including ACH, wire and instant payments, and to efficiently manage associated information flows. These products and services provide multiple payment capabilities, including domestic and international wire transfers and real time payments connection to the FedNow Service and RTP Network. PEP+ is an enterprise payment solution that allows financial institutions to automatically receive and originate electronic payments through the ACH network in a straight-through processing manner. Clients may use our payment platform applications on a licensed or hosted basis, and as an add-on to existing legacy technology or as a stand-alone comprehensive modern payments platform. \nIssuing\nWe provide credit card processing services; card production services; print services; prepaid card processing services; government payment processing; and student loan processing. \nOur credit card processing services provide solutions to financial institutions and other issuers of credit, such as group service providers, retailers and consumer finance companies, to enable them to process credit card transactions on behalf of their customers. Depending on the needs of our client, we deliver these solutions through our proprietary processing platforms, software application licenses, or SaaS hosted in the cloud. Our solutions in North America primarily use our Optis\n℠\n platform to provide transaction authorization and posting, account maintenance and settlement. Our FirstVision\n™\n and VisionPLUS\n®\n products are used globally to provide transaction processing services or are licensed to enable clients to process transactions on their own. We also provide financial institutions with solutions that support the lifecycle of a cardholder, including acquisition, fraud detection, credit risk management, servicing, collections and professional services.\nWe provide business statement and card products and services to clients across a wide variety of industries, including financial services, healthcare, retail, utilities, telecommunications, insurance and travel and entertainment. Our products and services include electronic document management through our electronic document delivery products and services; card manufacturing, personalization and mailing; statement production and mailing; and design and fulfillment of direct mail services.\nOur prepaid card processing services include stored value cards offered by our Money Network\n®\n businesses. The Money Network service simplifies payment distribution for organizations while reducing or eliminating expenses associated with issuing traditional paper checks. This service also provides consumers without bank accounts with fast, digital access to their \n4\nTable of Contents\n                                 \n \nmoney, including wages. Money Network solutions include Electronic Payroll Delivery, government disbursements, digital disbursements and corporate incentives as well as single-load and reloadable prepaid account options.\nOur government payment and student loan processing services generally relate to the processing of consumer payment activity. We provide entitlement payments for state entities, unemployment, and disability debit card payments, as well as technology that enables our clients to provide student loan support services.\nBanking\nWe provide customer loan and deposit account processing; digital banking; financial and risk management; professional services and consulting; and check processing. The lines between merchant acquiring, payment processing and banking are increasingly interconnected, as more banking and payment transactions are initiated at different touchpoints within merchant engagement.\nAccount processing solutions enable a financial institution to operate systems that process customer deposit and loan accounts, an institution’s general ledger, central information files and other financial information. These solutions also include security, reporting and other features that financial institutions need to process transactions for their customers. Although many of our clients obtain a majority of their processing requirements from us, our software design allows clients to start with one application and, as needed, add applications and features developed by us or by third parties. We support a broad range of client-owned peripheral devices manufactured by a variety of vendors, which reduce a new client’s initial conversion expenses, enhance existing clients’ ability to change technology and broaden our market opportunity. The principal account processing solutions used by our depository institution clients are Cleartouch\n®\n, DNA\n®\n, Finxact, Portico®, Precision\n®\n, Premier\n®\n and Signature\n®\n. All of these systems are available in the U.S., and the DNA, Finxact and Signature platforms are also available globally. Account processing solutions are offered primarily as an outsourced service or can be installed on client-owned computer systems or those hosted by third parties.\nOur principal consumer and business digital banking platform, Experience Digital (“XD”), builds on our Configure\n™\n, Architect\n™\n, Corillian Online\n®\n, Mobiliti\n™\n and Create\n™\n products. XD is a cloud-based platform that enables customers to perform balance inquiries, view their transaction history and access electronic bill payments, person-to-person digital payments, card services, account and loan originations, funds transfer and personal financial management tools. XD can be highly customized and integrated to multiple products and services, allowing clients to deploy new services quickly and efficiently to increase customer acquisition, engagement and insights.\nAdditionally, our embedded finance solutions enable merchants and others to deliver personalized financial experiences to their customers through a combination of Fiserv solutions including Finxact, Carat, plastics, and card processing, as well as third-party services, including banking services.\nWe also offer consulting services, business operations services and related software products that enable the transition of check capture from branch and teller channels to digital self-service deposit channels, including mobile, merchant and ATM. Through the Fiserv\n®\n Clearing Network, we provide check clearing and image exchange services. Other products and services include image archive with online retrieval, in-clearings, exceptions and returns, statements, and fraud detection.\nOur Strategy\nWe are focused on operating businesses where we have: deep industry expertise that enables us to serve the market with high effectiveness; a strong competitive position, currently or via a clear path in the foreseeable future; long-term, trusted client relationships that are based on recurring services and transactions; differentiated solutions that deliver value to our clients through integration and innovation; and strong management to execute strategies in a disciplined manner. Consistent with this focus, we continue to operate our business in accordance with the following strategic framework:\n•\nClient Relationship Value\n. We plan to increase the number and breadth of our client relationships by, among other actions: continuing to integrate our products and services; introducing new products and services that are aligned with market needs; combining products and services to deliver enhanced, integrated value propositions; and delivering quality service and support for our clients.\n•\nInnovation\n. We seek to be an innovation leader, utilizing our assets and capabilities to be at the forefront of our industry and enable our clients to deliver best-in-class results.\n•\nOperational Effectiveness\n. We believe we can further improve the quality of our client delivery while reducing our costs by using the opportunities created by our size and scale.\n5\nTable of Contents\n                                 \n \n•\nPortfolio Management\n. We expect to acquire businesses when we identify: a compelling strategic need, such as a product, service or technology that helps meet client demand; an opportunity to change industry dynamics; a way to achieve business scale that enables competition and operational efficiency; or similar considerations. We expect to divest businesses that are not in line with our market, product or financial strategies.\n•\nCapital Discipline\n. We intend to make capital allocation decisions that offer the best prospects for our long-term growth and profitability, which may include, among other matters: internal investment; repayment of debt; repurchases of our own shares; or acquisitions.\nServicing the Market\nThe financial technology industry is highly dynamic, with new innovations entering the market and driving the expectations of our clients globally. The markets for our solutions have specific needs and requirements, with strong emphasis placed by clients on quality, security, service reliability, timely introduction of new capabilities and features, flexibility and value. This requires us to continue our focus on product and service delivery, integration and innovation to meet and exceed the specific needs of our clients. We believe that our financial strength and specialized market knowledge enable us to support our clients to meet their changing preferences. In addition, we believe that our focus on quality, innovation, client service and our commitment of substantial resources to training and technical support helps us to identify and fulfill the needs of our clients.\nProduct Development\nTo meet the changing technology needs of our clients, we continually develop, maintain and enhance our products and systems. Our development and technology operations apply the expertise of multiple teams to design, develop and maintain specialized products and processing systems. Our products and solutions are designed to meet the preferences and diverse requirements of the international, national, regional or local market-specific merchant and financial services environments of our clients. In developing our products, we use current software development principles, such as service-oriented architecture, to create efficiencies, and we stress interaction with and responsiveness to the needs of our clients. In addition, we use our data and artificial intelligence (“AI”) responsibly to help us create new products and services and to enhance existing ones. We currently use AI in a variety of ways, including to enable higher quality customer service experiences, platform analytics, and fraud mitigation across a number of solutions.\nResources\nOur business depends on a variety of resources to operate including products and services provided to us by third parties. For example, we rely on our human capital resources for product development (including product design and coding), sales, operations (including customer service, technology support, security and compliance) and management; access to financial and telecommunication networks; computers, servers, mainframes, microchips and other computer equipment; and Clover and other POS devices. We periodically review our resource requirements and sources, as well as our relationships with key vendors, to best meet the needs of our business including global sourcing efforts and alternate supplier resourcing. We believe we have access to the resources necessary for our current business needs. More information regarding supply chain risks can be found under the heading “Competitive and Business Risks\n”\n in the Risk Factors section of this report and our human capital resources can be found below under the heading “Human Capital.”\nIntellectual Property\nWe regard our hardware, software, transaction processing services and related products as proprietary, and we use a combination of patent, copyright, trademark and trade secret laws, internal security practices, employee confidentiality and assignment agreements, and third-party non-disclosure agreements to protect our intellectual property assets. Our patents cover innovations relating to numerous financial software and hardware products and services, and we continue, where appropriate, to seek and secure patents with respect to our ongoing innovations. We believe that we possess all proprietary rights necessary to conduct our business.\n6\nTable of Contents\n                                 \n \nCompetition\nThe market for technology products and services is fragmented, highly competitive, and served by a multitude of large and small businesses. Our principal competitors include other large, integrated providers of financial services technology and payment systems, data processing affiliates of large companies, processing centers owned or operated as user cooperatives, financial institutions, merchant acquirers, ISOs, ISVs, payments companies and payment network operators. Our competitors also include global and local IT product and services companies and payment service providers and processors. We expect competition to continue to increase as new companies enter our markets and existing competitors expand or consolidate their product lines and services. Some of these competitors possess substantial financial, sales and marketing resources and can compete with us in various ways, including through the use of integrated product offerings and through pricing and long-standing relationships. Depending on the product or service, competitive factors may include quality, security, innovation, breadth or novelty of features and functionality, client satisfaction, market opportunity, integration, reliability, agility, global reach, multiple distribution channels, service reliability and performance standards, timely introduction of new products and features, platform scalability and flexibility, and value. We believe that we compete favorably in each of these categories. Additional information about competition in our segments is provided below.\nMerchant\nThe products and services in our Merchant segment compete with merchant acquirers and financial institutions that provide acquiring and processing services to businesses on their own. In many cases, our alliance and commercial partners, such as ISOs and ISVs, compete against each other. We also compete with merchant services providers and, in a number of countries outside of the U.S., our Merchant segment competes with a growing number of local and regional providers. In addition, payment networks and large technology, media and other integrated payments software providers are increasingly offering products and services that compete with our suite of merchant acquiring solutions.\nFinancial\nThe products and services in our Financial segment compete with large, diversified software and service companies, independent suppliers of software products, businesses that offer consumer payment solutions and a number of payment and card issuer processors. In addition to traditional payments competitors, large technology, media and other emerging financial technology providers are increasingly seeking to provide alternative payment and financing solutions. Existing and potential financial institution and other corporate clients could also develop and use their own in-house systems or custom-designed solutions instead of our products and services. In addition, we compete with vendors that offer similar transaction processing products and services to financial institutions.\nGovernment Regulation \nOur operations, and the products and services that we offer, are subject to various U.S. federal, state and local regulations, as well as regulations outside the U.S. We are also subject to non-government-issued rules and requirements, such as those promulgated by various payment networks. Failure to comply with these rules and regulations may result in the suspension or revocation of licenses or registrations, the limitation, suspension or termination of service and the imposition of civil and criminal penalties, including fines. We may also be required, among other things, to make significant additional investments to comply with rules and regulations, to modify our products or services or the manner in which they are provided, or to limit or change the amount or types of revenue we are able to generate. \nFinancial Institution Regulations.\n Because a number of our businesses provide services to regulated financial institutions, we are considered to be a significant service provider under the Bank Service Company Act and, as a result, we are subject to examination by the U.S. Federal Banking Agencies, which are comprised of the Board of Governors of the Federal Reserve System, the Federal Deposit Insurance Corporation, and the Office of the Comptroller of the Currency. We are regulated based on the uniform principles, standards, and guidance created by the Federal Financial Institutions Examination Council (“FFIEC”). The FFIEC is a formal interagency body empowered to standardize and promote uniformity in supervision of financial institutions. The member agencies of the FFIEC include the Federal Reserve Board, the Federal Deposit Insurance Corporation, the Office of the Comptroller of the Currency, the National Credit Union Administration, and the Consumer Financial Protection Bureau (“CFPB”), which are empowered to conduct rule-making and supervision related to, and enforcement of, federal consumer financial laws, some of which apply to products and services offered by our clients.\nIn the U.S., we are also subject to the Dodd-Frank Wall Street Reform and Consumer Protection Act, which, among other things, and in conjunction with the Federal Reserve Board’s Regulation II, caps debit interchange rates for certain debit and prepaid card issuers; prohibits card issuers and payment networks from restricting the ability of merchants to direct the routing of debit card transactions; requires all debit card issuers in the U.S. to participate in at least two unaffiliated debit payment card networks; prohibits payment card networks from restricting debit and prepaid card issuers from contracting with other payment \n7\nTable of Contents\n                                 \n \ncard networks; and generally prohibits network exclusivity arrangements for debit card and prepaid card issuers. These regulations impact our card processing businesses and our clients’ ability to generate revenue.\nCertain of our subsidiaries hold payment institution or electronic money licenses. These subsidiaries are subject to regulation and oversight in the jurisdictions in which they operate, and may be required to meet minimum capital maintenance requirements or other obligations. In addition, we are subject to regulation by the Georgia Department of Banking and Finance in connection with our subsidiary’s Merchant Acquirer Limited Purpose Bank charter in Georgia. In addition, several of our subsidiaries outside of the U.S. provide services such as merchant terminal leasing, debit processing, acquiring, issuing, factoring and settlement that make them subject to regulation by financial services supervisory agencies, including the Financial Conduct Authority (“FCA”) and Payment Systems Regulator in the United Kingdom (“U.K.”), the Federal Financial Supervision Agency in Germany, the National Bank of Poland, the Central Bank of the Netherlands, the Central Bank of Ireland, the Reserve Bank of Australia, the Central Bank of Brazil, the Central Bank of Uruguay, the Monetary Authority of Singapore, Bank Negara Malaysia (BNM) and Australian Transaction Reports and Analysis Centre.\nAssociation and Network Rules. \nWe are subject to the rules of various payment networks, such as Visa and Mastercard. In order to provide processing services, a number of our subsidiaries are registered with Visa and/or Mastercard as service providers for member institutions. A number of our subsidiaries outside the U.S. are direct members or associate members of Visa and Mastercard for purposes of conducting merchant acquiring. Various subsidiaries are also processor level members of other debit and electronic benefits transaction networks or are otherwise subject to various network rules in connection with processing services and other services we provide. As such, we are subject to applicable card association, network and national scheme rules that could subject us to fines or penalties. We are subject to network operating rules promulgated by Nacha relating to payment transactions processed by us using the ACH network and to various federal and state laws regarding such operations, including laws pertaining to electronic benefits transactions.\nPrivacy and Cybersecurity Regulations.\n We provide services that involve the collection and processing of significant amounts of data, including personal data financial data and other sensitive data which subject our offerings to various federal, state, local and foreign privacy and cybersecurity laws and regulations, as well as association and network privacy and cybersecurity rules, which govern, among other things, the collection, processing, storage, deletion, use and disclosure of personal information. These laws and rules contain a variety of obligations including the safeguarding of personal information, the provision of notices and use and disclosure rights. The regulations and rules are complex and evolving and can provide for significant penalties or the suspension or termination of our registrations or certifications for non-compliance, furthermore many of these regulations and rules are still evolving and could be interpreted in ways that could impact our business.\nIn the U.S., we are subject to various federal and state privacy and cybersecurity laws and regulations. The U.S. Gramm-Leach-Bliley Act (“GLBA”) requires financial institutions to explain their information sharing practices to their customers and to safeguard customer data. In some circumstances, we are subject to GLBA and we have privacy and information security obligations to our clients who are regulated by the GLBA. In certain circumstances, we are subject to the U.S. Health Insurance Portability and Accountability Act of 1996 (“HIPAA”), which governs the use and disclosure of protected health information in healthcare treatment, payment and operations by covered entities and their business associates. We are also subject to the Federal Trade Commission Act which empowers the U.S. Federal Trade Commission (“FTC”) to prohibit unfair and deceptive practices, including those related to privacy and cybersecurity. In addition to the Federal Trade Commission Act, the FTC, along with the CFPB, is responsible for overseeing and enforcing the privacy and information security provisions over certain aspects of GLBA and the Fair Credit Reporting Act (“FCRA”), each of which is applicable to our businesses in certain circumstances. We also have obligations under various state privacy and cybersecurity laws, such as the California Consumer Privacy Act, which, among other things, give consumers more control over the personal information businesses hold about them. \nIn the European Union (“E.U.”) and the U.K., we are subject to the General Data Protection Regulation (“GDPR”), which impose a comprehensive approach to personal data protection and include penalties for non-compliance of up to the greater of 20 million Euro (or 17.5 million British Pound) or four percent of a company’s consolidated global revenue. There are numerous additional privacy laws and regulations that apply to our businesses around the world which also provide for significant penalties. Some of these data protection laws, including in the E.U., Brazil, India, United Arab Emirates and China, impose requirements regarding data rights and security and either prohibit the international transfer of personal data or restrict such transfers absent lawfully recognized transfer mechanisms. There are also additional obligations that apply to us by virtue of the fact that we provide services in the financial services industry or are considered to be providing critical infrastructure to our clients including the SOCI Act in Australia, the EBA Outsourcing Requirements and the Digital Operational Resilience Act in the E.U. and the CERT-In obligations in India.\nAdditional information about privacy and cybersecurity regulation applicable to our business can be found in the Risk Factors section of this report under the heading “Regulatory and Compliance Risks”.\n8\nTable of Contents\n                                 \n \nMoney Transmission and Payment Instrument Licensing and Regulations.\n We are subject to various U.S. federal, state and foreign laws and regulations governing money transmission and the issuance and sale of payment instruments, including some of our prepaid products. In the U.S., most states license money transmitters and issuers of payment instruments. Many states exercise authority over the operations of our services related to money transmission and payment instruments and, as part of this authority, subject us to periodic examinations. Many states require money transmitters, issuers of payment instruments and their agents to comply with federal and state anti-money laundering laws and regulations and often require the licensee to maintain certain levels of net worth.  \nCredit Reporting and Debt Collections Regulations.\n TeleCheck, our check acceptance business, is subject to FCRA and various similar state laws. The collection business within our subsidiary TRS Recovery Services, Inc. (“TRS”) is subject to the U.S. federal Fair Debt Collection Practices Act and various similar state laws. TRS maintains licenses in a number of states in order to engage in collection in those states. TeleCheck and TRS are also subject to regulation, supervision and examination from the CFPB. In addition, several of our subsidiaries are subject to comparable local laws regarding collection activities and obtaining credit reports and our U.K. branch described above also holds FCA permissions for debt collection activities.\nUnfair Trade Practice Regulations.\n We and our clients are subject to various federal, state and foreign laws prohibiting unfair or deceptive trade practices. Various regulatory enforcement agencies, including the FTC and state attorneys general, have authority to take action against parties that engage in unfair or deceptive trade practices or violate other laws, rules and regulations. If we process payments for a merchant or other client in violation of laws, rules and regulations, we could be subject to enforcement actions and incur losses and liabilities that may impact our business.\nAnti-Money Laundering and Sanctions Regulations.\n We are subject to anti-money laundering laws and regulations, including the U.S. Bank Secrecy Act (“BSA”). Among other things, the BSA requires money services businesses, such as money transmitters, issuers of money orders and official checks, and providers of prepaid access, to develop and implement anti-money laundering programs. Our acquiring businesses outside the U.S. are subject to anti-money laundering laws and regulations in the countries where they operate. Our Money Network Financial, LLC subsidiary provides prepaid access for various open loop prepaid programs for which it is the program manager and therefore must meet the requirements of the Financial Crimes Enforcement Network.\nWe are also subject to certain economic and trade sanctions programs that are administered by the U.S. Treasury Department’s Office of Foreign Assets Control (“OFAC”), which prohibit or restrict transactions to or from, or dealings with, specified countries, governments, individuals and entities that are specially designated nationals of those countries, including narcotics traffickers and terrorists or terrorist organizations. Other group entities may be subject to additional local sanctions requirements in other relevant jurisdictions.\nSimilar anti-money laundering, counter terrorist financing and proceeds of crime laws apply to movements of currency and payments through electronic transactions and to dealings with persons specified in lists maintained by the country equivalents to OFAC lists in several other countries and require specific data retention obligations to be observed by intermediaries in the payment process. Our businesses in those jurisdictions are subject to those data retention obligations.\nCommunications Laws. \nWe are subject to various federal and state laws that govern telephone calls and the issuance of text messages to clients and consumers in the U.S. as well as to regulations that impose requirements on marketing emails sent to U.S residents. Our international subsidiaries are subject to equivalent laws in applicable jurisdictions.\nIndirect Regulatory Requirements. \nA number of our clients are subject to various regulations and compliance obligations that do not apply directly to us but impact the services that we provide to our clients. To remain competitive, we have invested, and expect to continue to invest, significant resources to develop and update our products and services to assist our clients to meet various compliance obligations. In addition, independent auditors annually review many of our operations to provide internal control evaluations for our clients and their auditors.\nHuman Capital\nThe Talent and Compensation Committee of our Board of Directors assists the Board of Directors in establishing our compensation philosophy and strategy and overseeing our human capital management strategy which includes maintaining a culture committed to attracting, developing and retaining top talent, fostering innovation, and promoting employee engagement, safety and well-being. As of December 31, 2024, we had over 38,000 employees worldwide.\nDevelopment and Retention\n \nWe are committed to creating a high-performance culture that consistently delivers excellence for our clients and long-term value for our shareholders while providing a workplace experience for our employees that values collaboration, innovation and \n9\nTable of Contents\n                                 \n \ndiversity. Career development and internal mobility are important aspects of our value proposition for employees. We provide employees with numerous training and development opportunities, including through an e-learning platform specifically geared toward global technology associates; our Leading Women program, designed to accelerate the professional growth of female top talent across each of our global regions; our Leading Fiserv program, designed to develop critical leadership skills for frontline managers; our Vision to Results leadership program, focused on driving enterprise goals; and an online platform that provides global access to over 10,000 learning opportunities. Internal mobility is generally our preferred approach for filling open positions and fostering career advancement for our employees. To encourage internal mobility, we maintain a sustainable internal talent pipeline, increasing associate retention, job satisfaction and personal and professional growth opportunities.\nWe have adopted a pay-for-performance philosophy that is designed to recognize performance and reward achievement of our strategic business objectives and financial results. Total compensation consists of a competitive base pay and annual incentive opportunity typically delivered in a mix of cash and equity that is designed to promote retention and reward the attainment of defined performance goals. We are committed to providing fair pay to our employees regardless of gender, race, ethnicity or any other protected characteristic, and we conduct pay audits to track, measure and evaluate employee compensation. In addition, throughout the year, we celebrate employee contributions and achievements through a peer-based global recognition program that enables recognition and financial rewards.\nEmployee Engagement\nWe value employee engagement and feedback. Throughout the year, we engage with our employees through events such as lunch-and-learns, quarterly all-hands meetings, town halls, leadership meetings and other forums. We encourage managers to meet regularly with their teams and encourage skip-level discussions.\nTo assess employee engagement, we periodically collect employee feedback through employee engagement surveys, including annual enterprise-wide surveys and issue-specific surveys. These surveys cover a variety of topics, such as engagement, well-being, client experience, communication, teamwork, manager effectiveness, trust and inclusion. In addition to assessing engagement, the survey results enable us to gain insight into employee perspectives and issues which we use to enhance processes, set priorities and respond to associate concerns. \nIn 2024, 94% of our associates participated in our engagement survey. The categories in which we were ranked highest were “operational excellence” and “manager effectiveness”.\nSafety and Well-Being\nWe are committed to the safety of our workforce and maintain a global safety program that is designed to protect the safety and well-being of our employees in the workplace, minimize injury and accident frequency and severity, minimize loss to property, equipment and operational disruption, and enable greater associate satisfaction and productivity.\nWe are also committed to providing comprehensive and competitive benefits to our associates that are responsive to their physical, financial, social and emotional needs. Our benefit offerings include a variety of medical and dental plan choices, mental health and counseling programs, caregiver support programs, enhanced family forming and planning resources, and paid time off. We control the cost of health care benefits for our employees despite the increased cost of such benefits to the company. Investing in our associates in this way helps us retain top talent and demonstrates our commitment to our employees, our most important asset.\nAvailable Information\nOur website address is www.fiserv.com. We are not including the information provided on our website as a part of, or incorporating it by reference into, this Annual Report on Form 10-K. We make available free of charge (other than an investor’s own internet access charges) through our website our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and amendments to these reports, as soon as reasonably practicable after we electronically file such material with, or furnish such material to, the Securities and Exchange Commission.",
    "item1a": "Item 1A.  Risk Factors\nYou should carefully consider each of the risks described below, together with all of the other information contained in this Annual Report on Form 10-K, before making an investment decision with respect to our securities. If any of the following risks develop into actual events, our business, results of operations or financial condition could be materially and adversely affected, and you may lose all or part of your investment.\n10\nTable of Contents\n                                 \n \nCompetitive and Business Risks\nWe operate in a competitive business environment and may not be able to compete effectively.\nThe markets for our products and services are highly competitive from new and existing competitors. Our principal competitors include other vendors and providers of financial services technology and payment systems, data processing affiliates of large companies, processing centers owned or operated as user cooperatives, financial institutions, independent sales organizations (“ISOs”), independent software vendors, payments companies and payment network operators. Our competitors vary in size and in the scope and breadth of the services they offer. Many of our larger existing and potential clients have historically developed their key applications in-house. As a result, we may compete against our existing or potential clients’ in-house capabilities. In addition, we expect that the markets in which we compete will continue to attract new technologies and well-funded competitors, including large technology, telecommunication, media and other companies not historically in the financial services and payments industries, start-ups and international providers of products and services similar to ours. In addition, participants in the financial services, payments and technology industries may merge, create joint ventures or engage in other business combinations, alliances and consolidations that may strengthen their existing products and services or create new products and services that compete with ours. We cannot provide any assurance that we will be able to compete successfully against current or future competitors or that competitive pressures faced by us in the markets in which we operate will not materially and adversely affect our business, results of operations and financial condition.\nIf we fail to keep pace with technological change, including as a result of artificial intelligence, we could lose clients or have trouble attracting new clients, and our ability to grow may be limited.\nThe markets for our products and services are characterized by constant and rapid technological change, evolving industry standards, frequent introduction of new products and services, and increasing client expectations. Our ability to respond timely to these changes, including by enhancing our current products and services and developing and introducing new products and services, will significantly affect our future success. In addition, the success of certain of our products and services rely, in part, on financial institutions, business partners and other third parties promoting the use of or distributing our products and services. If we are unsuccessful in developing, marketing and selling products or services that gain market acceptance, or if third parties insufficiently promote or distribute our products and services, it would likely have a material adverse effect on our ability to retain existing clients, to attract new ones and to grow profitably.\nWe believe that data, and the insights enabled by data, can be used to create or enhance the products and services that we offer to our clients. As a result, we are using, and expect to continue to expand our use of, artificial intelligence and machine learning in our product development processes, services and operations. Our use of artificial intelligence technologies carries inherent risks, and there can be no assurance that our use of artificial intelligence will enhance our products or services or achieve any improvements in innovation or efficiency. In addition, we could be exposed to liability as a result of any misuse of artificial intelligence and machine learning-technology by our personnel while carrying out company responsibilities. In addition, our competitors and other third parties may incorporate artificial intelligence into their products and offerings more quickly or more successfully than us, which could impair our ability to compete effectively and adversely affect our results of operations. If the content, analyses or recommendations that artificial intelligence applications assist in producing are or are alleged to be inaccurate, deficient or biased, our business, financial condition and results of operations may be adversely affected. Furthermore, the integration of third-party artificial intelligence models with our services relies on certain safeguards implemented by the third-party developers of the underlying artificial intelligence models, including those related to the accuracy, bias and other variables of the data, and these safeguards may be insufficient. Legislation and regulations governing the development or use of artificial intelligence have been implemented or are under consideration in the U.S. at the state and local level, as well as internationally. Such legislation and regulations may impose obligations related to our development, offering, and use of artificial intelligence and expose us to increased risk of regulatory enforcement and litigation. As a result, the ability to use artificial intelligence and machine learning may be constrained by current or future laws, regulatory or self-regulatory requirements.\nIf we are unable to renew contracts on favorable terms or if contracts are terminated prematurely, we could lose clients and our results of operations and financial condition may be adversely affected.\nFailure to achieve favorable renewals of client contracts could negatively impact our business. At the end of the contract term, clients have the opportunity to renegotiate their contracts with us or to consider whether to engage one or more of our competitors to provide products and services or to perform the services in-house. Some of our competitors may offer more attractive prices, features or other services that we do not offer, and some clients may desire to perform the services themselves. Larger clients may be able to seek lower prices from us when they renew or extend a contract or the client’s business has significant volume changes. In addition, larger clients may reduce the services we provide if they decide to move services in-\n11\nTable of Contents\n                                 \n \nhouse. Further, our small merchant business clients may seek reduced fees due to pricing competition, their own financial condition or pressure from their customers. \nWe also have contracts with U.S. federal, state and local governments. The contracts with these clients may contain terms that are not typical for non-government clients, such as the right to terminate for convenience, the right to unilaterally modify or reduce work to be provided under the contract, significant or unlimited indemnification obligations and being subject to appropriation of funds for the government contract program. In addition, if any of our government contracts were to be terminated for default, we could be suspended or debarred from contracting with that entity in the future, which could also provide other government clients the right to terminate.\nThese factors could result in lower revenue from a client than we had anticipated based on our agreement with that client. If we are not successful in achieving high contract renewal rates and favorable contract terms, if contracts are terminated, or if we are prevented from performing work for these clients in the future, our results of operations and financial condition may be materially and adversely affected.\nChanges in card association and debit network fees or products could increase costs or otherwise limit our operations.\nFrom time to time, card associations and debit networks, including the card networks which we own and operate, increase the processing and other fees (including what is commonly called “interchange fees”) that they charge. It is possible that competitive and other pressures will result in us absorbing a portion of such increases in the future, or not being able to increase our own fees, which would increase our operating costs, reduce our profit margin, limit our growth, and adversely affect our business, results of operations and financial condition. In addition, the various card associations and networks prescribe certain capital requirements. Any increase in the capital level required would further limit our use of capital for other purposes.\nOur business depends, in part, on our merchant relationships and alliances, and if we are unable to maintain these relationships and alliances, our business may be adversely affected.\nUnder our alliance program, a bank or other institution forms an alliance with us, generally on an exclusive basis, either contractually or through a separate legal entity. Merchant contracts may be contributed to the alliance by us and/or the bank or institution. The banks and other institutions generally provide card association sponsorship, clearing and settlement services and typically act as a merchant referral source when the institution has an existing banking or other relationship with such merchant. We provide transaction processing and related functions to the alliance. Both we and our alliance partners may also provide management, sales, marketing and other administrative services. The alliance structure allows us to be the processor for multiple financial institutions, any one of which may be selected by the merchant as its bank partner. Our merchant acquiring business depends, in part, on our merchant relationships, alliances and other distribution channels. There can be no guarantee that we will achieve growth in our merchant relationships, alliances or other distribution channels. In addition, our contractual arrangements with merchants and merchant alliance partners are for fixed terms and may allow for early termination upon the occurrence of certain events. There can be no assurance that we will be able to renew our contractual arrangements with these merchants or merchant alliance partners on similar terms or at all. The loss of merchant relationships or alliance partners could negatively impact our business and have a material adverse effect on our results of operations and financial condition.\nConsolidations in the banking and financial services industry could adversely affect our revenue by eliminating existing or potential clients and making us more dependent on fewer clients.\nMergers, consolidations and failures of financial institutions reduce the number of our clients and potential clients, which could adversely affect our revenue. If our clients merge with or are acquired by other entities that are not our clients, or that use fewer of our services, they may discontinue or reduce their use of our services. Our alliance strategy could also be negatively affected by consolidations, especially where the financial institutions involved are committed to their internal merchant processing businesses that compete with us. It is also possible that the larger financial institutions that result from mergers or consolidations could have an increased ability to negotiate terms with us or could decide to perform in-house some or all of the services which we currently provide or could provide. Any of these developments could have a material adverse effect on our business, results of operations and financial condition.\nOperational and Security Risks\nSecurity incidents or other technological risks involving our systems and data, or those of our clients, partners or vendors, could expose us to liability or damage our reputation.\nOur operations depend on receiving, storing, processing and transmitting sensitive information pertaining to our business, our employees, our clients and their customers. Under the card network rules, various federal, state and international laws, and client contracts, we are responsible for information provided to us by financial institutions, merchants, ISOs, third-party service \n12\nTable of Contents\n                                 \n \nproviders and others. Preserving the confidentiality of sensitive business and personal information is critical to our business. Any unauthorized access, intrusion, infiltration, network disruption, ransom, denial of service or similar incident could disrupt the integrity, continuity, security and trust of our systems or data, or the systems or data of our clients, partners, vendors or service providers. These incidents are often difficult to detect and are constantly evolving. We expect that unauthorized parties will continue to attempt to gain access to our systems or facilities, and those of our clients, partners, vendors and service providers, through various means and with increasing sophistication, particularly as cybercriminals attempt to profit from increased online banking, e-commerce and other online activity. State-sponsored cybersecurity attacks on the U.S. financial system or U.S. financial service providers could also adversely affect our business. These events could create costly litigation, significant financial liability, increased regulatory scrutiny, financial sanctions and a loss of confidence in our ability to serve clients and cause current or potential clients to choose another service provider, all of which could have a material adverse impact on our business. In addition, we have invested and expect to continue to invest significant resources to maintain and enhance our information security and controls or to investigate and mitigate security vulnerabilities. Although we believe that we maintain a robust program of information security and controls and that none of the events that we have encountered to date have materially affected us, we cannot be certain that the security measures and procedures we have in place to detect security incidents and protect sensitive data, will be successful or sufficient to counter all current and emerging risks and threats. While we maintain cybersecurity insurance, our insurance may be insufficient or may not cover all liabilities incurred by such attacks. The impact of a material event involving our systems and data, or those of our clients, partners, vendors or service providers, could have a material adverse effect on our business, results of operations and financial condition.\nOperational failures and resulting interruptions in the availability of our products or services could harm our business and reputation.\nOur business depends heavily on the reliability of our systems. An operational failure that results in an interruption in the availability of our products and services could harm our business or cause us to lose clients. An operational failure could involve the hardware, software, data, networks or systems upon which we rely to deliver our services and could be caused by our actions, the actions of third parties or events over which we may have limited or no control. Events that could cause operational failures include, but are not limited to, hardware and software defects or malfunctions, ransomware, denial-of-service and other cyberattacks, human error, earthquakes, hurricanes, floods, fires, natural disasters, pandemics, power losses, disruptions in telecommunications services, fraud, military or political conflicts, terrorist attacks, computer viruses or other malware, or other events. In the event of operational failures or damage or disruption to our business due to these occurrences, we may not be able to successfully or quickly recover all of our critical business functions, assets and data through our business continuity program. Implementation delays, interruptions of service or hardware device defects could damage our relationship with clients and could cause us to incur substantial expenses, including those related to the payment of service credits, product recalls or other liabilities. A prolonged interruption of our services or network could cause us to experience data loss or a reduction in revenue, and significantly impact our clients’ businesses and the customers they serve. In addition, a significant interruption of service or product recall could have a negative impact on our reputation and could cause our current and potential clients to choose another service provider. As a provider of payments solutions and other financial services, clients, regulators and others may require enhanced business continuity and disaster recovery plans including frequent testing of such plans. Meeting these various requirements may require a significant investment of time and money. Any of these developments could have a material adverse impact on our business, results of operations and financial condition.\nDisruptions of operations of other participants in the global financial system could prevent us from delivering our products and services.\nThe operations and systems of many participants in the global financial system are interconnected. Many of the transactions involving our products and services rely on multiple participants in the global financial system to move funds and communicate information to the next participant in the transaction chain. A disruption for any reason of the operations of a participant in the global financial system could impact our ability to obtain or provide information or cause funds to be moved in a manner to successfully deliver our products and services. Although we work with other participants to avoid any disruptions, there is no assurance that such efforts will be effective. Such a disruption could lead to our inability to deliver products and services, reputational damage, lost clients and revenue, loss of clients’ and their customers’ confidence, as well as additional costs, all of which could have a material adverse effect on our business, results of operations and financial condition.\nWe rely on third parties to provide products and services and if we are unable to obtain such products or services in the future or if \nthese third parties fail to perform these services adequately\n, our business may be materially and adversely affected.\nWe rely on third parties we do not control to provide us with products and services, including payment card networks, acquiring processors, payment card issuers, financial institutions and the Automated Clearing House (“ACH”) network which transmit transaction data, process chargebacks and refunds, and perform clearing services in connection with our settlement activities. If, \n13\nTable of Contents\n                                 \n \nfor example, such third parties stop providing clearing services or limit our volumes, we would need to find other financial institutions to provide those services. In the event these third parties fail to provide these services adequately or in a timely manner, including as a result of errors in their systems or events beyond their control, or refuse to provide these services on terms acceptable to us or at all, and we are not able to find timely suitable alternatives, we may no longer be able to provide certain services to customers, which could expose us and our clients to information security, financial, compliance and reputational risks. We may be negatively impacted by a disruption to our supply chain or third-party delivery service providers, including if the factories that manufacture our point-of-sale devices, payment cards or computer chips for payment cards, or paper stock are temporarily closed or experience workforce shortages; shipping services are interrupted or delayed; there are increased lead times, shortages or higher costs for certain materials and components; or there are workforce shortages at our third-party customer support, software development or technology hosting facilities. If we are unable to renew our existing contracts with key vendors and service providers, we might not be able to replace the related product or service at all or at the same cost. Any of these risks could have a material adverse effect on our business, results of operations and financial condition.\nWe may experience software defects, development delays or installation difficulties, which would harm our business and reputation and expose us to potential liability.\nOur services are based on sophisticated software and computer systems and we may encounter delays when developing new applications and services. Further, the software underlying our services may contain undetected errors or defects when first introduced or when new versions are released. We may also experience difficulties in installing or integrating our technology on systems or with other programs used by our clients. Defects in our software, errors or delays in the processing of electronic transactions or other difficulties could result in interruption of business operations, delay in market acceptance, additional development and remediation costs, diversion of technical and other resources, loss of clients or client data, negative publicity or exposure to liability claims. Although we attempt to limit our potential liability through disclaimers and limitation of liability provisions in our license and client agreements, we cannot be certain that these measures will successfully limit our liability.\nGlobal Market Risks\nOur business may be adversely affected by geopolitical and other risks associated with operations outside of the U.S. and, as we continue to expand internationally, we may incur higher than anticipated costs and may become more susceptible to these risks.\nWe offer merchant acquiring, processing and issuing services outside of the U.S., including in the U.K., Germany, Mexico, Uruguay, Argentina, India and Brazil. Our facilities outside of the U.S., and those of our suppliers and vendors, including manufacturing, customer support, software development and technology hosting facilities, are subject to risks, including natural disasters, public health crises, political crises, terrorism, war, political instability and other events outside of our or our suppliers’ control. As we continue to expand internationally and grow our client base outside of the U.S., we may face challenges due to the presence of more established competitors and our relative lack of experience in such non-U.S. markets, and we may incur higher than anticipated costs. If we are unable to successfully manage the risks associated with the international operation and expansion of our business, our results of operations and financial condition could be negatively impacted.\nOur business is impacted by U.S. and global market and economic conditions.\nFor the foreseeable future, we expect to continue to derive revenue primarily from products and services we provide to the financial services industry and from our merchant acquiring business. Given this focus, we are exposed to global economic conditions and adverse economic trends may accelerate the timing, or increase the impact of, risks to our financial performance. Such trends may include, but are not limited to, the following:\n•\ninflation, trade policy and tariffs, taxes, foreign currency fluctuations, declining economies, social unrest, natural disasters, public health crises, including the occurrence of a contagious disease or illness, and the pace of economic recovery can change consumer spending behaviors, on which a significant portion of our revenues are dependent;\n•\nlow levels of consumer and business confidence typically associated with recessionary environments and those markets experiencing relatively high inflation and/or unemployment, may cause decreased spending by cardholders;\n•\nbudgetary concerns in the U.S. and other countries around the world could affect the U.S. and other specific sovereign credit ratings, impact consumer confidence and spending, and increase the risks of operating in those countries;\n•\nemerging market economies tend to be more volatile than the more established markets we serve in the U.S. and Europe, and adverse economic trends, including high rates of inflation, may be more pronounced in such emerging markets;\n14\nTable of Contents\n                                 \n \n•\nfinancial institutions may restrict credit lines to cardholders or limit the issuance of new cards to mitigate cardholder defaults;\n•\nuncertainty and volatility in the performance of our clients’ businesses may make estimates of our revenues, rebates, incentives, and realization of prepaid assets less predictable;\n•\nour clients may decrease spending for value-added services; and\n•\ngovernment intervention, including the effect of laws, regulations, treaties and/or government investments in our clients, may have potential negative effects on our business, operations and our relationships with our clients or otherwise alter their strategic direction away from our products.\nA weakening in the economy or competition from other retailers could force some retailers to close, resulting in exposure to potential credit losses and declines in transactions, and reduced earnings on transactions due to a potential shift to large discount merchants. Additionally, credit card issuers may reduce credit limits and become more selective in their card issuance practices.\nA prolonged poor economic environment, including a potential recession in the U.S. or other economies in which our business operates, could result in significant decreases in demand by current and potential clients for our products and services and in the number and dollar amount of transactions we process or accounts we service, which could have a material adverse effect on our business, results of operations and financial condition.\nPotential tariffs or trade wars could increase the cost of our products, which could adversely impact the competitiveness of our products and our financial results.\nThe U.S. has imposed tariffs, and may impose new or increased tariffs, on certain imports from other countries, which may lead to retaliatory tariffs imposed by other governments. If the U.S. administration or other countries impose new or increased tariffs, trade restrictions or restrictions on the cross-border flow of data, our manufacturing of hardware devices, supply of raw materials and access to certain markets, could be impacted. Although it is difficult to predict how current or future tariffs on items imported from other countries will impact our business, the cost of our products manufactured in other countries and imported into the U.S. or elsewhere could increase, which could adversely affect the demand for these products and have a material adverse effect on our business and results of operations.\nRegulatory and Compliance Risks\nIf we or third parties with whom we partner or contract fail to comply with applicable laws and regulations, we could be subject to liability and our business could be harmed.\nOur businesses are subject to state, federal, and foreign laws and regulations, including payment, cybersecurity, consumer protection, money transmission, data privacy, anti-money laundering, anti-bribery, economic and trade sanctions, payment institution, electronic money licensing, credit reporting and debt collection laws and regulations. Our clients are also subject to numerous laws and regulations applicable to banks, financial institutions and card issuers in the U.S. and abroad, and, consequently, we are at times affected by these federal, state, local and foreign laws and regulations. These laws and regulations are subject to change, and new laws, regulations and interpretations are regularly adopted.\nThe volume and complexity of the regulations that impact our business, directly or indirectly, will continue to increase our cost of doing business. If we or third parties with whom we partner or contract fail to comply with applicable laws and regulations, we could be exposed to litigation or regulatory proceedings, our client relationships and reputation could be harmed, our ability to obtain new clients could be inhibited, we could be required to change the manner in which we conduct our business or suspend or terminate certain services, and we could incur significant fines, penalties, or losses, all of which could have a material adverse impact on our business, results of operations and financial condition.\nIf we fail to comply with the applicable requirements of the payment card networks and Nacha, they could seek to fine us, suspend us or terminate our registrations, which could adversely affect our business.\nIn order to provide our transaction processing services, several of our subsidiaries are registered with Visa and Mastercard and other networks as members or service providers for member institutions. A number of our subsidiaries outside the U.S. are direct members or associate members of Visa and Mastercard for purposes of conducting merchant acquiring, and various subsidiaries are also processor level members of numerous debit and electronic benefits transaction networks. As such, we are subject to card association and network rules that could subject us or our clients to a variety of fines or penalties that may be levied by the card associations or networks for certain acts or omissions by us, acquiring clients, processing clients or merchants. In addition, we are subject to Nacha rules relating to payment transactions processed by us using the ACH network and to various federal and state laws regarding such operations, including laws pertaining to electronic fund transfer and \n15\nTable of Contents\n                                 \n \nelectronic benefits transactions, as well as the Payment Card Industry Data Security Standard enforced by the major card brands. The rules of Nacha and the card networks are set by their respective boards, some of which are our competitors, and the card network rules may be influenced by card issuers, some of which offer competing transaction processing services.\nIf we fail to comply with these rules, we could be fined and our member registrations or certifications could be suspended or terminated. The suspension or termination of our member registrations or certifications, or any changes to the association and network rules, that we do not successfully address, or any other action by the card networks to restrict our ability to process transactions over such networks, could limit our ability to provide transaction processing services to clients and result in a reduction of revenue or increased costs of operation, which, in either case, could have a material adverse effect on our business and results of operations.\nA heightened regulatory environment in the financial services industry may have an adverse impact on our clients and our business.\nSince the enactment of the Dodd-Frank Wall Street Reform and Consumer Protection Act, a number of substantial regulations affecting the supervision and operation of the financial services industry within the U.S. have been adopted, including those that establish the Consumer Financial Protection Bureau (“CFPB”). The CFPB has issued regulations and guidance under U.S. consumer financial protection laws that apply to, and conducts direct examinations of, “supervised banks and nonbanks” as well as “supervised service providers” like us. CFPB rules, examinations and enforcement actions may require us to adjust our activities and may increase our compliance costs. Changes to applicable financial services laws or regulations could adversely impact our debit network business and other businesses. In addition, certain of our alliance partners are subject to regulation by federal and state authorities and, as a result, could pass through some of those compliance obligations to us.\nAdditional regulation, examination or oversight of our business could require us to modify the manner in which we contract with or provide products and services to our clients; directly or indirectly limit how much we can charge for our services; require us to invest additional time and resources to comply with such oversight and regulations, including in respect of audits, investigations or enforcement actions related to us or third parties; or limit our ability to update our existing products and services, or require us to develop new ones. If this oversight or regulation negatively impacts the business, operations or financial condition of our clients, our business and results of operations could be materially and adversely affected because, among other matters, our clients could have less capacity to purchase products and services from us, could decide to avoid or abandon certain lines of business, or could seek to pass on increased costs to us by negotiating price reductions. Any of these events, if realized, could have a material adverse effect on our business, results of operations and financial condition.\nLegislative or regulatory initiatives on cybersecurity and data privacy could adversely impact our business and financial results. \nCybersecurity and data privacy risks have received heightened legislative and regulatory attention. In Europe and the U.K., their respective General Data Protection Regulations (collectively, “GDPR”) extends the scope of their data protection laws to all companies processing data of individuals within the E.U. and the U.K., regardless of the company’s location, subject to certain limitations. The law requires companies to meet stringent requirements regarding the handling of personal data. E.U. and U.K. data protection law continuously develops and requires significant changes to our policies and procedures. GDPR imposes strict rules on the transfer of personal data out of the E.U. or U.K. to a “third country,” including the United States, unless particular transfer mechanisms are implemented. The mechanisms that we and many other companies rely upon for such data transfers are the subject of legal challenge, regulatory interpretation, and judicial decisions. In the E.U., U.K. and other markets, potential new rules and restrictions on the flow of data across borders could increase the cost and complexity of doing business in those regions. Additionally, we are subject to the E.U. Regulation known as the Digital Operational Resilience Act (“DORA”). DORA is intended to strengthen the information technology systems of covered financial entities to mitigate risks associated with operational disruptions. Our efforts to comply with E.U., U.K. and other cybersecurity, privacy and data protection laws around the world that apply to our businesses could involve substantial expenses, divert resources from other initiatives and projects and limit the services we are able to offer. There is also increased focus on data localization requirements around the world in countries such as the United Arab Emirates, China and India which could impact our business model with respect to our storage and transfer of personal data.  \nIn addition, U.S. regulators, including the U.S. Federal Banking Agencies and the U.S. Federal Trade Commission (“FTC”) have adopted or proposed enhanced cyber and privacy security standards that apply to us and our financial institution clients and address privacy requirements for processing data of individuals, cyber risk governance and management, management of internal and external dependencies, and incident response, cyber resilience and situational awareness. The FTC and many state attorneys general are also interpreting federal and state consumer protection laws as imposing standards for the collection, use, dissemination, and security of data. Additionally, over a third of U.S. states have proposed or enacted comprehensive consumer privacy laws (such as the California Consumer Privacy Act) that have taken effect or will take effect in coming years. We \n16\nTable of Contents\n                                 \n \ncannot fully predict the impact of recently proposed or enacted laws or regulations on our business or operations, but compliance may require us to modify our data processing practices and policies incurring costs and expense. Legislation and regulations on cybersecurity, data privacy and data localization may compel us to enhance or modify our systems, invest in new systems or alter our business practices or our policies on how we process personal information, data governance and privacy. If any of these outcomes were to occur, our operational costs could increase significantly. Failure to comply with applicable laws in this area could also result in significant fines, penalties and reputational damage.\nFailure to comply with state and federal antitrust requirements could adversely affect\n \nour\n \nbusiness.\nThrough our merchant alliances, we hold an ownership interest in and have commercial relationships with competing merchant acquiring businesses while serving as an electronic processor for those businesses. In order to satisfy state and federal antitrust requirements, we actively maintain an antitrust compliance program. Notwithstanding our compliance program, it is possible that perceived or actual violations of state or federal antitrust requirements could give rise to regulatory enforcement investigations or actions. Regulatory scrutiny of, or regulatory enforcement action in connection with, compliance with state and federal antitrust requirements could have a material adverse effect on our reputation and business.\nWe may be sued for infringing the intellectual property rights of others.\nThird parties may claim that we are infringing their intellectual property rights. We expose ourselves to additional liability when we agree to defend or indemnify our clients against third-party infringement claims. If the owner of intellectual property establishes that we are, or a client which we are obligated to indemnify is, infringing its intellectual property rights, we may be forced to change our products or services, and such changes may be expensive or impractical, or we may need to seek royalty or license agreements from the owner of such rights. If we are unable to agree on acceptable terms, we may be required to discontinue the sale of key products or halt other aspects of our operations. We may also be liable for financial damages for a violation of intellectual property rights, and we may incur expenses in connection with indemnifying our clients against losses suffered by them. Any adverse result related to violation of third-party intellectual property rights could materially and adversely harm our business, results of operations and financial condition. Even if intellectual property claims brought against us are without merit, they may result in costly and time-consuming litigation and may require significant attention from our management and key personnel.\nMisappropriation of our intellectual property and proprietary rights could impair our competitive position.\nOur ability to compete depends upon proprietary systems and technology. We actively seek to protect our intellectual property and proprietary rights. Nevertheless, unauthorized parties may attempt to copy aspects of our services or to obtain and use information that we regard as proprietary. In addition, use of artificial intelligence tools may result in the release of confidential or proprietary information which could limit our ability to protect, or prevent us from protecting, our intellectual property rights. The steps we have taken may not prevent misappropriation of technology. Agreements entered into for that purpose may not be enforceable or provide us with an adequate remedy. It is also possible that others will independently develop the same or similar technology. Further, we use open source software in connection with our solutions. Companies that incorporate open source software into their solutions have, from time to time, faced claims challenging the ownership of solutions developed using open source software. As a result, we could be subject to suits by parties claiming ownership of what we believe to be open source software. Some of our solutions integrate licensed software, including open source software, and any failure to comply with the terms of one or more of the licenses could adversely affect our business. Effective patent, trademark, service mark, copyright and trade secret protection may not be available in every country in which our applications and services are made available. The laws of certain non-U.S. countries where we do business or contemplate doing business in the future may not recognize intellectual property rights or protect them to the same extent as do the laws of the U.S. Misappropriation of our intellectual property or potential litigation concerning such matters could have a material adverse effect on our business, the results of which could affect our operations and financial condition.\nChanges in tax laws and regulations could adversely affect\n \nour results of operations and cash flows from operations.\nOur operations are subject to tax by federal, state, local, and international taxing jurisdictions. Changes in tax laws or their interpretations in our significant tax jurisdictions could materially increase the amount of taxes we owe, thereby negatively impacting our results of operations as well as our cash flows from operations. Additionally, future tax laws, regulations or guidance from the Internal Revenue Service, the Securities and Exchange Commission or the Financial Accounting Standards Board could cause us to adjust current estimates in future periods, which could impact our earnings and have an adverse effect on our results of operations and cash flow. \nThe U.S. Congress, the Organization for Economic Co-operation and Development (the “OECD”) and other government agencies in jurisdictions in which we do business remain focused on the taxation of multinational corporations. The OECD, which represents a coalition of member countries, including the U.S., is contemplating changes to numerous longstanding tax \n17\nTable of Contents\n                                 \n \nprinciples, including ensuring all companies pay a global minimum tax and expanding taxing rights of market countries. Because the timing of implementation and the specific measures adopted will vary among participating countries, significant uncertainty remains regarding the impact of these initiatives and their implementation could adversely affect our business or financial results.\nFurthermore, our implementation of new practices and processes designed to comply with changing tax laws and regulations could require us to make substantial changes to our business practices, allocate additional resources, and increase our costs, which could negatively affect our business, results of operations and financial condition.\nUnfavorable resolution of tax contingencies could adversely affect\n \nour results of operations and cash flows from operations\nOur tax returns and positions are subject to review and audit by federal, state, local and international taxing authorities. An unfavorable outcome to a tax audit could result in higher tax expense, thereby negatively impacting our results of operations as well as our cash flows from operations. We have established contingency reserves for known tax exposures relating to deductions, transactions and other matters involving some uncertainty as to the proper tax treatment of the item. These reserves reflect what we believe to be reasonable assumptions as to the likely final resolution of each issue if raised by a taxing authority. While we believe that the reserves are adequate to cover reasonably expected tax risks, there is no assurance that, in all instances, an issue raised by a tax authority will be finally resolved at a financial cost not in excess of any related reserve. An unfavorable resolution, therefore, could negatively impact our effective tax rate, financial position, results of operations, and cash flows in the current and/or future periods.\nOrganizational and Financial Risks\nThe failure to attract and retain key personnel could have a material adverse effect on our business.\nWe depend on the experience, skill and contributions of our senior management and other key employees. If we fail to attract, motivate and retain highly qualified management, technical, compliance and sales personnel, our future success could be harmed. Our senior management provides strategic direction for our company, and if we lose members of our leadership team, our management resources may have to be diverted from other priorities to address this loss. Our products and services require sophisticated knowledge of the financial services industry, applicable regulatory and industry requirements, computer systems, and software applications, and if we cannot hire or retain the necessary skilled personnel, we could suffer delays in new product development, experience difficulty complying with applicable requirements or otherwise fail to satisfy our clients’ demands.\nLosses due to chargebacks, refunds or returns could have a material adverse effect on our business, results of operations and financial condition.\nWe may be liable if our merchants or other parties that have obligations to deliver goods or services to cardholders fail to satisfy their obligations. For example, we and our merchant acquiring alliances may be subject to contingent liability for transactions originally acquired by us that are disputed by the cardholder and charged back to the merchants or other parties. These disputes could arise from fraud, misuse, unintentional use, settlement delay or failure, insufficiency of funds, returns, a failure to perform a service, or other reasons. If we or the alliance is unable to collect this amount from the merchant or other party because of the merchant’s or other party’s insolvency or other reasons, we or the alliance will bear the loss for the amount of the refund paid to the cardholder. Although we have an active program to manage our credit risk, and often mitigate our risk by obtaining collateral, a default on such obligations by one or more of our merchants or others could have a material adverse effect on our business, and results of operations and financial condition.\nAdditionally, we may be subject to potential liability for fraudulent transactions, including electronic payment and card transactions or credits initiated by merchants or others. Examples of merchant fraud include when a merchant or other party knowingly uses a stolen or counterfeit credit, debit or prepaid card, card number or other credentials to record a false sales transaction, processes an invalid card or intentionally fails to deliver the merchandise or services sold in an otherwise valid transaction. Criminals are using increasingly sophisticated methods to engage in illegal activities such as counterfeiting and fraud. We also rely on ISOs to sell our merchant processing services, which they may do by contracting with their own sub-ISOs. We rely on these ISOs and sub-ISOs to exercise appropriate controls to avoid fraudulent transactions. It is possible that incidents of fraud could increase in the future. Failure to effectively manage risk and prevent fraud, or otherwise effectively administer our chargeback responsibilities, would increase our chargeback liability and expose us to fines or other liabilities. Increases in chargebacks, fines or other liabilities could have a material adverse effect on our business, results of operations and financial condition.\n18\nTable of Contents\n                                 \n \nAcquisitions subject us to risks, including assumption of unforeseen liabilities and difficulties in integrating operations.\nA major contributor to our growth in revenue and earnings since our inception has been our ability to identify, acquire and integrate complementary businesses. We anticipate that we will continue to seek to acquire complementary businesses, products and services. We may not be able to identify suitable acquisition candidates or complete acquisitions in the future, which could adversely affect our future growth; or businesses that we acquire may not perform as well as expected or may be more difficult or expensive to integrate and manage than expected, which could adversely affect our business and results of operations. We may not be able to integrate all aspects of acquired businesses successfully or realize the potential benefits of bringing them together. In addition, the process of integrating these acquisitions may disrupt our business and divert our resources.\nIn addition, acquisitions outside of the U.S. often involve additional or increased risks including, for example:\n•\nmanaging geographically separated organizations, systems and facilities;\n•\nintegrating personnel with diverse business backgrounds and organizational cultures;\n•\ncomplying with non-U.S. regulatory requirements;\n•\nfluctuations in currency exchange rates;\n•\nenforcement of intellectual property rights in some non-U.S. countries;\n•\ndifficulty entering new non-U.S. markets due to, among other things, consumer acceptance and business knowledge of these new markets; and\n•\ngeneral economic and political conditions.\nThese risks may arise for a number of reasons: we may not be able to find suitable businesses to acquire at affordable valuations or on other acceptable terms; we may face competition for acquisitions from other potential acquirers; we may need to borrow money or sell equity or debt securities to the public to finance acquisitions and the terms of these financings may be adverse to us; changes in accounting, tax, securities or other regulations could increase the difficulty or cost for us to complete acquisitions; we may discover liabilities, deficiencies, or other claims associated with the companies or assets we acquire that were not identified in advance, which may result in significant unanticipated costs; the effectiveness of our due diligence review and our ability to evaluate the results of such due diligence are dependent upon the accuracy and completeness of statements and disclosures made or actions taken by the companies we acquire or their representatives, as well as the limited amount of time in which acquisitions are executed. In addition, we may fail to accurately forecast the financial impact of an acquisition or other strategic transaction, including tax and accounting charges; we may incur unforeseen obligations or liabilities in connection with acquisitions; we may need to devote unanticipated financial and management resources to an acquired business; we may not realize expected operating efficiencies or product integration benefits from an acquisition; we could enter markets where we have minimal prior experience; and we may experience decreases in earnings as a result of non-cash impairment charges.\nWe may be obligated to indemnify the purchasers of businesses pursuant to the terms of the relevant purchase and sale agreements.\nWe have in the past and may in the future sell businesses. In connection with sales of businesses, we may make representations and warranties about the businesses and their financial affairs and agree to retain certain liabilities associated with our operation of the businesses prior to their sale. Our obligation to indemnify the purchasers and agreement to retain liabilities could have a material adverse effect on our business, results of operations and financial condition.\nOur balance sheet includes significant amounts of goodwill and intangible assets. The impairment of a significant portion of these assets would negatively affect our results of operations.\nOur balance sheet includes goodwill and intangible assets that represent 60% of our total assets at December 31, 2024. These assets consist primarily of goodwill and identified intangible assets associated with our acquisitions. On at least an annual basis, we assess whether there have been impairments in the carrying value of goodwill. In addition, we review intangible assets for impairment whenever events or changes in circumstances indicate the carrying amount of the asset may not be recoverable. If the carrying value of the asset is determined to be impaired, then it is written down to fair value by a non-cash charge to operating earnings. An impairment of a significant portion of goodwill or intangible assets could have a material negative effect on our results of operations.\n19\nTable of Contents\n                                 \n \nExisting or future leverage may harm our financial condition and results of operations.\nAt December 31, 2024, we had approximately $25 billion of debt. We and our subsidiaries may incur additional indebtedness in the future. Our indebtedness could: decrease our ability to obtain additional financing for working capital, capital expenditures, general corporate or other purposes; limit our flexibility to make acquisitions; increase our cash requirements to support the payment of interest; limit our flexibility in planning for, or reacting to, changes in our business and our industry; and increase our vulnerability to adverse changes in general economic and industry conditions. Our ability to make payments of principal and interest on our indebtedness depends upon our future performance, which will be subject to general economic conditions and financial, business and other factors affecting our consolidated operations, many of which are beyond our control. In addition, if certain of our outstanding senior notes or commercial paper notes are downgraded to below investment grade, we may incur additional interest expense. If we are unable to generate sufficient cash flow from operations in the future to service our debt and meet our other cash requirements, including due to deterioration in economic and market conditions, we may be required, among other things: to seek additional financing in the debt or equity markets; to refinance or restructure all or a portion of our indebtedness; or to reduce or delay planned capital or operating expenditures. Such measures might not be sufficient to enable us to service our debt and meet our other cash requirements. In addition, any such financing, refinancing or sale of assets might not be available at all or on economically favorable terms.\nAn increase\n \nin interest rates may negatively impact our operating results and financial condition.\nCertain of our borrowings, including borrowings under our revolving credit facility, foreign lines of credit and commercial paper programs, are at variable rates of interest. Beginning in 2022, and continuing through mid-2023, interest rates increased significantly and interest rates may continue to increase or remain at higher than recent historical levels in the future. An increase in interest rates would have a negative impact on our results of operations by causing an increase in interest expense. At December 31, 2024, we had approximately $2.4 billion in variable rate debt, which includes $899 million drawn on our revolving credit facility and foreign lines of credit, and an aggregate amount of $1.5 billion outstanding under our U.S. dollar and Euro commercial paper programs. Based on outstanding debt balances and interest rates at December 31, 2024, a 1% increase in variable interest rates would result in an increase to annual interest expense of $24 million.\nOur results of operations may be adversely affected by changes in foreign currency exchange rates.\nWe are subject to risks related to changes in currency rates as a result of our investments in foreign operations and from revenues generated in currencies other than the U.S. dollar. Revenues and profit generated by such international operations will increase or decrease compared to prior periods as a result of changes in foreign currency exchange rates. From time to time, we utilize foreign currency forward contracts and other hedging instruments to mitigate the market value risks associated with foreign currency-denominated transactions and investments. These hedging strategies may not, however, eliminate all of the risks related to foreign currency translation, and we may forgo the benefits we would otherwise experience if currency exchange rates were to change in our favor. In addition, we may incur material foreign currency exchange losses due to the remeasurement of monetary assets and liabilities in highly inflationary economies. We have also issued foreign currency-denominated senior notes and commercial paper notes for which payments of interest and principal are to be made in foreign currency, and fluctuations in foreign currency exchange rates could cause the expense associated with such payments to increase. In addition, we may become subject to exchange control regulations that restrict or prohibit the conversion of our foreign revenue currencies into U.S. dollars. Any of these factors could decrease the value of revenues and earnings we derive from our international operations and have a material adverse effect on our business.",
    "item1b": "Item 1B.  Unresolved Staff Comments\nNone.",
    "item1c": "Item 1C.  Cybersecurity\nEnterprise Risk Management\nAt the core of our business, we host, collect, process, use and retain significant amounts of financial, personal and other sensitive data across our own technology environment and the third-party information systems of our vendors, service providers and partners. In order to keep this data secure, \nwe maintain an enterprise risk management (“ERM”) program designed to systematically identify and manage risk including risk from cybersecurity threats.\n The risk committee of the board of directors oversees our ERM program and it is reviewed annually by both the risk and audit committees of the board of directors. The risk committee also monitors and reports to the board regarding issues arising with respect to the risk governance structure and performance of the risk management function. The board, as a whole and through its committees, regularly engages with the Chief Risk Officer, management and outside advisors to identify, assess and manage risks of the company and to ensure the risk management function has the appropriate resources and authority to fulfill its responsibilities. An executive risk committee, \n20\nTable of Contents\n                                 \n \ncomprised of senior leaders of our lines of business and corporate functions, provides executive level accountability for the ERM program.\n \nOn an ongoing basis, we identify, categorize, assess, monitor and respond to business risks. We consider the various ways in which risks may affect our business by measuring the impact of those risks against a consistent set of criteria, which include the potential impact to our operations, financial performance, clients, technology, reputation, business strategy and regulatory environment. The risk committee of the board of directors reviews and approves a list of top enterprise risks and the risk appetite relating to such risks. Among the top risks included in our ERM program is cybersecurity risk. Response plans are developed, tracked and implemented for residual risks that are above the acceptable tolerance level.\n \n \nCybersecurity Risk\nManagement’s Role in Cybersecurity\nOur \nglobal cybersecurity services team\n is responsible for assessing our technology environment, identifying emerging cybersecurity threats and evolving cybersecurity threat capabilities, and implementing business processes and technical defenses to safeguard our technology environment and services. Our management has established a cybersecurity and technology risk committee focused on managing cybersecurity and technology risk and implementing cybersecurity and technology plans, strategies and objectives. The committee is chaired by the Deputy Chief Information Security Officer, who reports to the Chief Operating Officer through our Chief Information Security Officer (“CISO”), and is comprised of senior business, cybersecurity, and technology leaders responsible for delivering our products and services. Our cybersecurity program is designed to enable us to detect and respond to cybersecurity incidents, continually improve the effectiveness of our cybersecurity controls, and dynamically respond to the evolving threat landscape.\nOur cybersecurity operation center monitors our environment to detect cybersecurity incidents, identifies suspicious activities or unusual behaviors, and responds with the objective of minimizing potential impact to operations. We use various security technologies and controls and modern analytics designed to detect, prevent and respond to cybersecurity threats. Our global cybersecurity services team collects intelligence from the private and public sector related to cybersecurity threats, emerging adversarial campaigns and vulnerabilities. The global cybersecurity services team uses this information, along with internal intelligence and analytics, to evaluate the potential cybersecurity threats and develop security strategies to reduce risk and improve response.\n \nWe maintain a global cybersecurity policy that incorporates recognized industry standards and best practices from the National Institute of Standards and Technology as well as various security certifications. \nOur employees play a vital role in protecting our and our clients’ data. We provide regular, mandatory training for our employees regarding cybersecurity threats to equip our employees with effective tools to address cybersecurity threats, and to communicate our evolving information security policies, standards, processes and practices. \nWe also maintain a third-party risk management program to identify, assess, mitigate and monitor risks associated with third parties’ software and services that we utilize.\nOur CISO has served in various senior roles in information technology and information security, in both the public and private sector, for over two decades and maintains a Certified Chief Information Security Officer professional certification. Similarly, the other members of our global cybersecurity services team have a broad range of cybersecurity training and experience in both the public, including military and law enforcement, and private sectors and maintain various certifications in relevant subjects.\n \nBoard Oversight\nThe board of directors maintains primary oversight of the company’s strategic, operational and financial risks, including cybersecurity risks. \nThe risk committee of the board of directors assists the board in its oversight of such risks and is primarily responsible for oversight of cybersecurity risks\n. The risk committee regularly reviews and discusses with management the current cybersecurity threat landscape, emerging trends and developments, and the company’s guidelines, policies and processes for monitoring, managing, and mitigating cybersecurity risks. \nThe board and the risk committee receive regular presentations and reports from management as well as outside experts on cybersecurity risks, which address a wide range of topics including recent developments, evolving standards, vulnerability assessments, third-party and independent reviews, the threat environment, technology trends and information security considerations arising with respect to our peers and third parties. On an annual basis, the board and the risk committee discuss our approach to cybersecurity risk management with our Chief Risk Officer, Chief Compliance Officer and Chief Information Officer, among others. At each regular board meeting, the risk committee reviews and reports to the board on key cybersecurity \n21\nTable of Contents\n                                 \n \nrisks. The board and the risk committee receive prompt and timely information regarding any cybersecurity incident that meets established reporting thresholds, as well as ongoing updates regarding any such incident until it has been addressed.\n \nImpact of Cybersecurity Threats\nOur results of operations and financial condition have not been materially affected by cybersecurity threats or incidents to date.\n However, to assess, identify, and manage material risks from cybersecurity threats, including as a result of previous cybersecurity incidents, we have invested and expect to continue to invest significant resources, including maintaining cybersecurity insurance coverage, to sustain and enhance our information security and controls or to investigate and mitigate security vulnerabilities. As a result, cybersecurity threats and other technological risks involving our systems have materially affected our business strategy and processes. Although we believe that we maintain a robust program of information security and controls and that none of the cybersecurity incidents that we have encountered to date have materially affected us, we cannot be certain that the security measures and procedures we have in place to detect security incidents and protect sensitive data will be successful or sufficient to counter all current and emerging risks and threats. The impact of a material cybersecurity incident involving our systems and data, or those of our clients, partners or vendors, could have a material adverse effect on our business strategy, results of operations and financial condition.\nAdditional information on the impact of cybersecurity threats applicable to our business can be found in the Risk Factors section of this report under the heading “Operational and Security Risks”."
  }
}