{
  "ticker": "FITB",
  "cik": "0000035527",
  "company_name": "FIFTH THIRD BANCORP",
  "filing_date": "2025-02-24",
  "accession": "0000035527-25-000079",
  "primary_doc": "fitb-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1. BUSINESS\nGeneral Information\nFifth Third Bancorp (the “Bancorp” or “Fifth Third”), an Ohio corporation organized in 1975, is a bank holding company (“BHC”) as defined by the Bank Holding Company Act of 1956, as amended (the “BHCA”), and has elected to be treated as a financial holding company (“FHC”) under the Gramm-Leach-Bliley Act of 1999 (“GLBA”) and regulations of the Board of Governors of the Federal Reserve System (the “FRB”).\nThe Bancorp is a diversified financial services company headquartered in Cincinnati, Ohio and is the indirect holding company of Fifth Third Bank, National Association (the “Bank”). As of December 31, 2024, Fifth Third had $213 billion in assets and operates 1,089 full-service Banking Centers and 2,080 Fifth Third branded ATMs in Ohio, Kentucky, Indiana, Michigan, Illinois, Florida, Tennessee, West Virginia, Georgia, North Carolina and South Carolina. The Bancorp operates three main businesses: Commercial Banking, Consumer and Small Business Banking and Wealth and Asset Management. Fifth Third is among the largest money managers in the Midwest and, as of December 31, 2024, had $634 billion in assets under care, of which it managed $69 billion for individuals, corporations and not-for-profit organizations. Investor information and press releases can be viewed on the Bancorp’s Investor Relations website at ir.53.com. Information on or accessible through our website is not deemed to be incorporated into this Annual Report on Form 10-K. Website references in this Annual Report are merely textual references. Fifth Third’s common stock is traded on the NASDAQ® Global Select Market under the symbol “FITB.”\nThe Bancorp’s subsidiaries provide a wide range of financial products and services to the commercial, financial, retail, governmental, educational, energy and healthcare sectors. This includes a variety of checking, savings and money market accounts, wealth management solutions, payments and commerce solutions, securities products and services, insurance services and credit products such as commercial loans and leases, mortgage loans, credit cards, installment loans and other lending products. These products and services are delivered through a variety of channels including the Bancorp’s banking centers, other offices, telephone sales, the internet and mobile applications. The Bank has deposit insurance provided by the Federal Deposit Insurance Corporation (the “FDIC”) through the Deposit Insurance Fund (the “DIF”). Refer to Exhibit 21 filed as an attachment to this Annual Report on Form 10-K for a list of subsidiaries of the Bancorp as of February 15, 2025.\nAdditional information regarding the Bancorp’s businesses is included in Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nAvailability of Financial Information\nThe Bancorp files reports with the SEC. Those reports include the annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and annual proxy statement, as well as any amendments to those reports. The SEC maintains an internet site that contains reports, proxy and information statements and other information regarding issuers that file electronically with the SEC at www.sec.gov. The Bancorp’s annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, annual proxy statement and amendments to those reports filed or furnished pursuant to section 13(a) or 15(d) of the Exchange Act are accessible at no cost on the Bancorp’s Investor Relations website at ir.53.com on a same day basis after they are electronically filed with or furnished to the SEC.\nInformation about the Bancorp’s Code of Business Conduct and Ethics (as amended from time to time), is available on Fifth Third’s corporate website at www.53.com. In addition, any future waivers from a provision of the Fifth Third Code of Business Conduct and Ethics covering any of Fifth Third’s directors or executive officers (including Fifth Third’s principal executive officer, principal financial officer, and principal accounting officer or controller) will be posted at this internet address.\nCompetition\nThe Bancorp, primarily through the Bank, competes for deposits, loans and other banking services in its principal geographic markets as well as in selected national markets as opportunities arise. In addition to traditional banking institutions, the Bancorp competes with securities dealers, brokers, mortgage bankers, investment advisors, specialty finance, private credit, financial technology and insurance companies. These companies compete across geographic boundaries and provide customers with meaningful alternatives to traditional banking services in nearly all significant products. The increasingly competitive environment is primarily a result of changes in regulation, changes in technology, product delivery systems and the accelerating pace of consolidation among financial service providers. These competitive trends are likely to continue.\nHuman Capital Resources\nThe Bancorp’s human capital strategy is designed to attract, develop and retain talent. This strategy ensures that Fifth Third has the talent, capabilities and organizational structure to support business needs now and in the future. As of December 31, 2024, the Bancorp had 18,616 full-time equivalent employees, compared to 18,724 as of December 31, 2023. These employees support the organization’s ambition and purpose by upholding its values by committing to excellence, being connected and acting with creativity and courage. Fifth Third is committed to living its values, serving its customers, delivering financial performance and being recognized as a leader in building an engaging workplace.\n16 Fifth Third Bancorp \nTable of Contents\n \nEngagement and Development\nFifth Third believes that an engaged workforce is one of its most valuable assets in sustaining its success. The Bancorp’s continuous listening strategy is an important component of its inclusive culture. The Bancorp’s holistic approach to collecting, measuring and responding to employee feedback enhances the employee experience at critical points during times of change in business or work environments. Feedback is collected through a variety of methods, including the Employee Viewpoints Survey, which includes questions related to culture, engagement, inclusion, employee well-being, expectations and intent to stay. \nThe Bancorp’s learning, development and career mobility strategy delivers personalized and accessible experiences that fuel career growth and help retain talent. In response to employee feedback, Fifth Third continued its focus on career mobility with enhanced tools to support internal career pathing. This includes a robust suite of learning resources covering several areas, including leadership and professional development to foster learning and career advancement across the employee population. In 2024, employees engaged in over 255,000 hours of discretionary learning.\nSeveral new initiatives were introduced, including a comprehensive onboarding program for new managers, a high performing program for senior leaders, and new offerings aimed at developing the professional and leadership skills necessary to build a strong pipeline of leaders. Fifth Third leaders engaged in 2,800 different development offerings. Fifth Third’s commitment to compliance and risk management also remains strong, with all employees and contingent workers completing more than 475,000 course hours on these topics.\nTotal Rewards – Compensation and Benefits \nThe Bancorp is committed to providing competitive compensation programs that attract and retain top talent, while driving the business strategy and effectively managing risk. Fifth Third’s compensation programs are designed to reward performance and align with regulatory expectations while reflecting the Bancorp’s values and behavioral standards. The Bancorp’s compensation philosophy is centered on creating long-term shareholder value.\nFifth Third continuously analyzes its compensation programs to ensure all employees have equal opportunities to maximize their potential. Fifth Third’s comprehensive benefits program is designed to address the personal and professional needs of employees and their families. In addition to traditional benefits offerings, the Bancorp provides comprehensive support with unique programs focused on the financial, physical, emotional and social well-being of employees.\nRecruitment and Retention\nThe Bancorp continues to navigate the changing talent landscape by monitoring the external environment and adapting talent strategies to meet internal needs. The Bancorp’s focus on its employee value proposition demonstrates a continued commitment to employees by developing great leaders and evolving the employee experience. Full year turnover improved, decreasing from 16.9% in 2023 to 16.2% in 2024.\nThe Bancorp’s recruitment strategies enhance the organization by promoting an inclusive culture. To attract the most talented employees, the Bancorp continues to enhance relationships with universities and partner organizations to attract top talent. Creating and developing an inclusive workforce is important for the Bancorp’s business growth, leading to enhanced innovation while focusing on the needs of its customers. \nAcquisitions and Investments\nThe Bancorp’s strategy for growth includes strengthening its presence in core markets, expanding its presence in high-growth markets and broadening its product offerings. In order to take into account the integration and other risks, the Bancorp conducts due diligence to evaluate and identify the risks associated with possible transactions. As a result, discussions, and in some cases, negotiations regarding acquisitions and investments may take place and future transactions involving cash, debt or equity securities may occur. These typically involve the payment of a premium over book value and current market price, and therefore, some dilution of tangible book value and net income per share may occur with any future transactions.\n17 Fifth Third Bancorp\nTable of Contents\n \nRegulation and Supervision\nIn addition to the generally applicable state and federal laws governing businesses and employers, the Bancorp and the Bank are subject to extensive regulation and supervision under federal and state laws and regulations applicable to financial institutions and their parent companies. Virtually all aspects of the business of the Bancorp and the Bank are subject to specific requirements or restrictions and general regulatory oversight. The principal objectives of state and federal banking laws and regulations and the supervision, regulation and examination of banks and their parent companies (such as the Bank and the Bancorp) by bank regulatory agencies are the maintenance of the safety and soundness of financial institutions, the maintenance of the federal deposit insurance system and the protection of consumers or classes of consumers, rather than the protection of shareholders or debtholders of a bank or the parent company of a bank. The Bancorp and its subsidiaries are subject to an extensive regulatory framework of complex and comprehensive federal and state laws and regulations addressing the provision of banking and other financial services and other aspects of the Bancorp’s businesses and operations. The Dodd-Frank Wall Street Reform and Consumer Protection Act (“Dodd-Frank”) and legislation modifying Dodd-Frank, the Economic Growth, Regulatory Relief and Consumer Protection Act of 2018 (“EGRRCPA”), will continue to impact the Bancorp and the Bank. To the extent the following material describes statutory or regulatory provisions, it is qualified in its entirety by reference to the particular statute or regulation. While the regulatory environment has recently been in a period of rebalancing, the Bancorp expects that its business will remain subject to extensive regulation and supervision.\nThe EGRRCPA amended various sections of Dodd-Frank, including section 165, which was revised to raise the asset thresholds for determining the application of enhanced prudential standards for BHCs. The EGRRCPA’s increased asset thresholds took effect immediately for BHCs with total consolidated assets less than $100 billion, with the exception of risk committee requirements, which now apply to publicly traded BHCs with $50 billion or more of consolidated assets. BHCs with consolidated assets between $100 billion and $250 billion, including the Bancorp, were subject to the enhanced prudential standards that applied to them before enactment of EGRRCPA until December 31, 2019, when rules adopted by the FRB that tailor the applicability of enhanced prudential standards and capital and liquidity requirements for BHCs with $100 billion or more in total consolidated assets became effective, as described in detail below.\nSubsequent to the EGRRCPA, the FRB adopted a rule that adjusts the thresholds at which certain enhanced prudential standards (“EPS”) apply to BHCs with $100 billion or more in total consolidated assets (the “EPS Tailoring Rule”) and the FRB, the Office of the Comptroller of the Currency (the “OCC”) and FDIC adopted a rule that similarly adjusts the thresholds at which certain other capital and liquidity standards apply to BHCs and banks with $100 billion or more in total consolidated assets (the “Capital and Liquidity Tailoring Rule” and, together with the EPS Tailoring Rule, the “Tailoring Rules”). The Tailoring Rules establish four risk-based categories of institutions, and the extent to which enhanced prudential standards and certain other capital and liquidity standards apply to these BHCs and banks depends on the banking organization’s category. Under the Tailoring Rules, the Bancorp and the Bank each qualify as a Category IV banking organization subject to the least restrictive of the requirements applicable to firms with $100 billion or more in total consolidated assets.\nRegulators\nThe Bancorp and/or the Bank are subject to regulation and supervision primarily by the FRB, the Consumer Financial Protection Bureau (the “CFPB”) and the OCC and additionally by certain other functional regulators and self-regulatory organizations. The Bancorp is also subject to regulation by the SEC by virtue of its status as a public company and due to the nature of some of its businesses. The Bank is also subject to regulation by the FDIC, which insures the Bank’s deposits as permitted by law.\nThe federal and state laws and regulations that are applicable to banks and to BHCs regulate, among other matters, the scope of the Bancorp’s and the Bank’s businesses, their activities, their investments, their capital and liquidity levels, their ability to make capital distributions (such as share repurchases and dividends), their reserves against deposits, the timing of the availability of deposited funds, the amount of loans to individual and related borrowers and the nature, the amount of and collateral for certain loans and the amount of interest that may be charged on loans, as applicable. Various federal and state consumer laws and regulations also affect the services provided to consumers.\nThe Bancorp and the Bank are required to file various reports with and are subject to examination by various regulators, including the FRB, the OCC and the CFPB. The FRB, the OCC and the CFPB have the authority to issue orders for BHCs and banks to cease and desist from certain banking practices and violations of conditions imposed by, or violations of agreements with, the FRB, the OCC and the CFPB. Some of the Bancorp’s and the Bank’s regulators are also empowered to assess civil money penalties against companies or individuals in certain situations, such as when there is a violation of a law or regulation. Applicable state and federal laws also grant the Bancorp’s regulators the authority to impose additional requirements and restrictions on the activities of the Bancorp and the Bank and, in some situations, the imposition of such additional requirements and restrictions will not be publicly available information.\nThe following discussion describes certain elements of the comprehensive regulatory framework applicable to the Bancorp and its subsidiaries. This discussion is not intended to describe all laws and regulations applicable to the Bancorp, the Bank and the Bancorp’s other subsidiaries.\nAcquisitions\nThe BHCA requires the prior approval of the FRB for a BHC to acquire substantially all the assets of a bank or to acquire direct or indirect ownership or control of more than 5% of any class of the voting shares of any bank, BHC or savings association, or to merge or consolidate with any BHC.\n18 Fifth Third Bancorp \nTable of Contents\n \nThe BHCA generally prohibits a BHC from engaging in, or acquiring a direct or indirect interest in or control of more than 5% of any class of the voting shares of a company that is not a bank or a BHC that engages directly or indirectly in activities other than those of banking, managing or controlling banks or furnishing services to its banking subsidiaries, except that it may engage in and may own shares of companies engaged in certain activities the FRB has determined to be so closely related to banking or managing or controlling banks as to be proper incident thereto.\nFinancial Holding Companies\nThe Bancorp is registered as a BHC with the FRB under the BHCA and qualifies for and has elected to become an FHC. An FHC is permitted to engage directly or indirectly in a broader range of activities than those permitted for a BHC under the BHCA. Permitted activities for an FHC include securities underwriting and dealing, insurance underwriting and brokerage, merchant banking and other activities that are declared by the FRB, in cooperation with the Treasury Department, to be “financial in nature or incidental thereto” or are declared by the FRB unilaterally to be “complementary” to financial activities. In addition, an FHC is allowed to conduct permissible new financial activities or acquire permissible non-bank financial companies with after-the-fact notice to the FRB. A BHC may elect to become an FHC if the BHC is well-capitalized and is well managed and each of its banking subsidiaries is well-capitalized, is well managed and has at least a “Satisfactory” rating under the Community Reinvestment Act (“CRA”). To maintain FHC status, a BHC must continue to meet these requirements. The failure to meet such requirements could result in material restrictions on the activities of the FHC and may also adversely affect the FHC’s ability to enter into certain transactions (including mergers and acquisitions) or obtain necessary approvals in connection therewith, as well as loss of FHC status. If restrictions are imposed on the activities of an FHC, such information may not necessarily be available to the public.\nDividends\nThe Bancorp is a legal entity separate and distinct from its subsidiaries and depends in part upon dividends received from its direct and indirect subsidiaries, including the Bank, to fund its activities, including its ability to make capital distributions, such as paying dividends or repurchasing shares. Under federal law, there are various limitations on the extent to which the Bank can declare and pay dividends to the Bancorp, including those related to regulatory capital requirements, general regulatory oversight to prevent unsafe or unsound practices and federal banking law requirements concerning the payment of dividends out of net profits, surplus and available earnings. Certain contractual restrictions also may limit the ability of the Bank to pay dividends to the Bancorp. No assurances can be given that the Bank will, in any circumstances, pay dividends to the Bancorp.\nThe Bancorp’s ability to declare and pay dividends is similarly limited by federal banking law and FRB regulations and policy. The FRB has authority to prohibit BHCs from making capital distributions if they would be deemed to be an unsafe or unsound practice. The FRB has indicated generally that it may be an unsafe or unsound practice for BHCs to pay dividends unless a BHC’s net income is sufficient to fund the dividends and the expected rate of earnings retention is consistent with the organization’s capital needs, asset quality and overall financial condition. In addition, the Bancorp’s ability to make capital distributions, including paying dividends and repurchasing shares, is subject to the Bancorp complying with the automatic restrictions on capital distributions under the FRBs “Capital Rules” process discussed below (see Regulatory Capital Requirements below).\nSource of Strength\nA BHC, including the Bancorp, is expected to act as a source of financial and managerial strength to each of its banking subsidiaries and to commit resources to their support. This support may be required at times when the BHC may not have the resources to provide it or when doing so is not otherwise in the interests of the Bancorp or its shareholders or creditors. United States (“U.S.”) banking regulators may require a BHC to make capital injections into a troubled subsidiary bank and may charge the BHC with engaging in unsafe and unsound practices if the BHC fails to commit resources to such a subsidiary bank or if it undertakes actions that the FRB believes might jeopardize the BHC’s ability to commit resources to such subsidiary bank.\nUnder these requirements, the Bancorp may in the future be required to provide financial assistance to the Bank should it experience financial distress. Capital loans by the Bancorp to the Bank would be subordinate in right of payment to deposits and certain other debts of the Bank. In the event of the Bancorp’s bankruptcy, any commitment by the Bancorp to a federal bank regulatory agency to maintain the capital of the Bank would be assumed by the bankruptcy trustee and entitled to a priority of payment.\nFDIC Assessments\nThe Deposit Insurance Fund (“DIF”) provides insurance coverage for certain deposits, up to a standard maximum deposit insurance amount of $250,000 per depositor per account ownership category per bank and is funded through assessments on insured depository institutions, based on the risk each institution poses to the DIF. The Bank accepts customer deposits that are insured by the DIF and, therefore, must pay insurance premiums. The FDIC may increase the Bank’s insurance premiums based on various factors, including the FDIC’s assessment of its risk profile.\nAs of June 30, 2020, the DIF reserve ratio fell to 1.30%, below the statutory minimum of 1.35%. The FDIC, as required under the Federal Deposit Insurance Act, established a plan on September 15, 2020 to restore the DIF reserve ratio to meet or exceed the statutory minimum of 1.35% within eight years. On October 18, 2022, the FDIC adopted an amended restoration plan to increase the likelihood that the reserve \n19 Fifth Third Bancorp\nTable of Contents\n \nratio would be restored to at least 1.35% by September 30, 2028. The FDIC’s amended restoration plan increases the initial base deposit insurance assessment rate schedules uniformly by 2 basis points, which began with the first quarterly assessment period of 2023. \nIn response to the bank failures that occurred in the first half of 2023, the FDIC issued a final rule for a special deposit insurance assessment on banking organizations with greater than $5 billion in assets to recover the losses to the DIF associated with protecting uninsured depositors. As of December 31, 2024, the Bancorp’s estimate of its allocation of the special assessment was $252 million, based on the most recent information provided by the FDIC. As a result of this special assessment, the Bancorp recorded expense of $28 million and $224 million during the years ended December 31, 2024 and \n2023, respectively,\n related to this estimate. The Bancorp currently expects to pay the special assessment to the FDIC over a total of ten quarterly assessment periods, which began with the first quarter of 2024. The estimate of the cost associated with protecting the uninsured depositors will continue to be subject to periodic adjustment until the final loss amount is determined by the FDIC.\nTransactions with Affiliates\nFederal banking laws restrict transactions between a bank and its affiliates, including a parent BHC. The Bank is subject to these restrictions, which include quantitative and qualitative limits on the amounts and types of transactions that may take place, including extensions of credit to affiliates, investments in the stock or securities of affiliates, purchases of assets from affiliates and certain other transactions with affiliates. These restrictions also require that credit transactions with affiliates be collateralized and that transactions with affiliates be on market terms or better for the bank. Generally, a bank’s covered transactions with any affiliate are limited to 10% of the bank’s capital stock and surplus and covered transactions with all affiliates are limited to 20% of the bank’s capital stock and surplus. Dodd-Frank expanded the scope of these regulations, including by applying them to the credit exposure arising under derivative transactions, repurchase and reverse repurchase agreements, and securities borrowing and lending transactions. Federal banking laws also place similar restrictions on loans and other extensions of credit by FDIC-insured banks, such as the Bank, and their subsidiaries to their directors, executive officers and principal shareholders.\nCommunity Reinvestment Act\nThe CRA generally requires insured depository institutions, including the Bank, to identify the communities they serve and to make loans and investments and provide services that meet the credit needs of those communities. The CRA requires the OCC to evaluate the performance of national banks (including the Bank) with respect to these CRA obligations. Depository institutions must maintain comprehensive records of their CRA activities for purposes of these examinations. The OCC must take into account the institution’s record of performance in meeting the credit needs of the entire community served, including low-and moderate-income neighborhoods. For purposes of CRA examinations, the OCC rates each institution’s compliance with the CRA as “Outstanding,” “Satisfactory,” “Needs to Improve” or “Substantial Noncompliance.” The Bank’s most recently received CRA performance rating from the OCC was Outstanding. \nThe CRA requires the relevant federal bank regulatory agency to consider a bank’s CRA assessment when considering the bank’s application to conduct certain mergers or acquisitions or to open or relocate a branch office. The FRB also must consider the CRA record of each subsidiary bank of a BHC in connection with any acquisition or merger application filed by the BHC. An unsatisfactory CRA record could substantially delay or result in the denial of an approval or application by the Bancorp or the Bank.\nOn October 24, 2023, the OCC, FRB and FDIC issued a final rule to modernize their respective CRA regulations. The revised rules substantially alter the methodology for assessing compliance with the CRA, with material aspects taking effect January 1, 2026 and revised data reporting requirements taking effect January 1, 2027. Among other things, the revised rules evaluate lending outside traditional assessment areas generated by the growth of non-branch delivery systems, such as online and mobile banking, apply a metrics-based benchmarking approach to assessment and clarify eligible CRA activities. The revised CRA regulations have been subject to an injunction since March 29, 2024. The effective dates will be extended for each day the injunction remains in place, pending the resolution of the lawsuit.\nRegulatory Capital Requirements\nThe Bancorp and the Bank are subject to certain risk-based capital and leverage ratio requirements under the capital adequacy rules (the “Capital Rules”) adopted by the FRB, for the Bancorp, and by the OCC, for the Bank. These quantitative calculations are minimums, and the FRB and OCC may determine that a banking organization, based on its size, complexity, or risk profile, must maintain a higher level of capital in order to operate in a safe and sound manner. Failure to be well-capitalized or to meet minimum capital requirements could result in certain mandatory and possible additional discretionary actions by regulators that, if undertaken, could have an adverse material effect on the Bancorp’s operations or financial condition. Failure to be well-capitalized or to meet minimum capital requirements could also result in restrictions on the Bancorp’s or the Bank’s ability to pay dividends or otherwise distribute capital or to receive regulatory approval of applications. Under the Capital Rules, the Bancorp’s and the Bank’s assets, exposures and certain off-balance sheet items are subject to risk weights used to determine the institutions’ risk-weighted assets pursuant to the federal banking agencies’ Standardized Approach to risk-weighting of assets. These risk-weighted assets are used to calculate the following minimum capital ratios for the Bancorp and the Bank:\n•\nCommon Equity Tier 1 (“CET1”) Capital Ratio, equal to the ratio of CET1 capital to risk-weighted assets. CET1 capital primarily includes common shareholders’ equity subject to certain regulatory adjustments and deductions, including with respect to goodwill, intangible assets, certain deferred tax assets and accumulated other comprehensive income (“AOCI”). The Bancorp has elected to exclude certain AOCI components, with the result that those components are not recognized in the Bancorp’s CET1. The FDIC, FRB and OCC have jointly issued rules for institutions that do not apply advanced approaches to regulatory capital, including the \n20 Fifth Third Bancorp \nTable of Contents\n \nBancorp and the Bank. These rules simplified the capital treatment of certain items (including mortgage servicing assets, deferred tax assets and investments in the capital of unconsolidated financial institutions) and simplified the recognition and calculation of minority interests that are includable in regulatory capital. The advanced approaches to regulatory capital are generally required for large, internationally active banking organizations including those designated as global systemically important BHCs and those with total assets or cross-jurisdictional activity in excess of certain thresholds.\n•\nTier 1 Risk-Based Capital Ratio, equal to the ratio of Tier 1 capital to risk-weighted assets. Tier 1 capital is primarily comprised of CET1 capital, perpetual preferred stock and certain qualifying capital instruments.\n•\nTotal Risk-Based Capital Ratio, equal to the ratio of total capital, including CET1 capital, Tier 1 capital and Tier 2 capital, to risk-weighted assets. Tier 2 capital primarily includes qualifying subordinated debt and qualifying allowance for credit losses (“ACL”). Tier 2 capital also includes, among other things, certain trust preferred securities.\n•\nLeverage Ratio, equal to the ratio of Tier 1 capital to quarterly average assets (net of goodwill, certain other intangible assets and certain other deductions).\nUnder the Capital Rules, an institution’s eligible retained income, when considered in conjunction with capital ratios and the stress capital buffer, provides limitations on capital distributions (including dividends and share repurchases) and certain executive compensation arrangements for the quarter following the calculation. As of December 31, 2024, the Bancorp was not subject to these limitations. \nEffective January 1, 2020, the Bancorp elected the five-year transition phase-in option for the impact of ASU 2016-13 (“CECL”) on regulatory capital. The estimated impact of CECL on regulatory capital (“modified CECL transitional amount”) is calculated as the sum of the day-one impact on retained earnings upon adoption of CECL (“CECL transitional amount”) and the calculated change in the ACL relative to the day-one ACL upon adoption of CECL multiplied by a scaling factor of 25%. The scaling factor is used to approximate the difference in the ACL under CECL relative to the incurred loss methodology. The modified CECL transitional amount was calculated each quarter for the first two years of the five-year transition. The amount of the modified CECL transition amount was then fixed as of December 31, 2021 and that amount is subject to the three-year phase out. Refer to the Capital Management section of Management’s Discussion and Analysis of Financial Condition and Results of Operations for more information.\nThe Capital Rules also require banking organizations to maintain a stress capital buffer to avoid becoming subject to certain limitations on capital distributions and discretionary bonuses to executive officers (see Stress Buffer Requirements below). For more information related to the stress capital buffer, refer to Note 29 of the Notes to Consolidated Financial Statements. \nThe total minimum regulatory capital ratios and well-capitalized minimum ratios are reflected in the table below. The FRB has not yet revised the well-capitalized standard for BHCs to reflect the higher capital requirements imposed under the Capital Rules. For purposes of the FRB’s Regulation Y, including determining whether a BHC meets the requirements to be an FHC, BHCs, such as the Bancorp, must maintain a Tier 1 Risk-Based Capital Ratio of 6.0% or greater and a Total Risk-Based Capital Ratio of 10.0% or greater. If the FRB were to apply the same or a very similar well-capitalized standard to BHCs as that applicable to the Bank, the Bancorp’s capital ratios as of December 31, 2024 would exceed such revised well-capitalized standard. The FRB may require BHCs, including the Bancorp, to maintain capital ratios substantially in excess of mandated minimum levels, depending upon general economic conditions and a BHC’s particular condition, risk profile and growth plans.\nThe following table presents the minimum regulatory capital ratios, minimum ratio plus stress capital buffer and well-capitalized minimums compared with the Bancorp’s and the Bank’s regulatory capital ratios as of December 31, 2024:\nRegulatory Capital Ratios:\nMinimum Regulatory Capital Ratio\nMinimum Ratio + Stress Capital Buffer\n(a)\nWell-Capitalized Minimums\n(b)\nActual at\nDecember 31, 2024\nCET1 risk-based capital ratio:\nFifth Third Bancorp\n4.50 \n%\n7.70 \nN/A\n10.57 \nFifth Third Bank, National Association\n4.50 \n7.70 \n6.50 \n12.86 \nTier 1 risk-based capital ratio:\nFifth Third Bancorp\n6.00 \n9.20 \n6.00 \n11.86 \nFifth Third Bank, National Association\n6.00 \n9.20 \n8.00 \n12.86 \nTotal risk-based capital ratio:\nFifth Third Bancorp\n8.00 \n11.20 \n10.00 \n13.86 \nFifth Third Bank, National Association\n8.00 \n11.20 \n10.00 \n14.19 \nLeverage ratio:\nFifth Third Bancorp\n4.00 \nN/A\nN/A\n9.22 \nFifth Third Bank, National Association\n4.00 \nN/A\n5.00 \n10.02 \n(a)\nReflects the stress capital buffer of 3.2% as of December 31, 2024.\n(b)\nReflects the well-capitalized standard applicable to the Bancorp under FRB Regulation Y and the well-capitalized standard applicable to the Bank.\n21 Fifth Third Bancorp\nTable of Contents\n \nCapital Planning and Stress Testing\nThe FRB’s capital plan rule requires BHCs with $100 billion or more in consolidated assets, including the Bancorp, to develop and maintain a capital plan approved by the Board of Directors on an annual basis. The mandatory elements of the capital plan are an assessment of the expected uses and sources of capital over a nine-quarter planning horizon, a description of all planned capital actions over the planning horizon, a discussion of any expected changes to the BHC’s business plan that are likely to have a material impact on its capital adequacy or liquidity, a detailed description of the BHC’s process for assessing capital adequacy and the BHC’s capital policy.\nThe FRB annually evaluates capital adequacy, internal capital adequacy assessment processes and capital distribution plans of BHCs with $100 billion or more in total consolidated assets. The evaluation process is intended to help ensure that those BHCs have robust, forward-looking capital planning processes that account for each company’s unique risks and that permit continued operations during times of economic and financial stress.\nIn March 2020, the FRB adopted a final rule to integrate the annual capital planning and stress testing requirements with certain ongoing regulatory capital requirements for large BHCs. As a result, the FRB’s supervisory stress test process is now used to calibrate the stress capital buffer requirement for large BHCs. As a result of the EPS Tailoring Rule, Category IV BHCs, including the Bancorp, are no longer required to conduct and disclose the results of company-run stress tests and are subject to the supervisory stress test process every two years. The Bancorp’s most recent required assessment was completed in 2024. These supervisory stress tests are forward-looking quantitative evaluations of the impact of stressful economic and financial market conditions on the Bancorp’s capital. \nStress Buffer Requirements\nThe Bancorp is subject to the stress capital buffer requirement and must maintain capital ratios above the sum of its minimum risk-based capital ratios and the stress capital buffer to avoid certain limitations on capital distributions and discretionary bonuses to executive officers. The FRB uses the supervisory stress test to determine the Bancorp’s stress capital buffer, subject to a floor of 2.5%. The Bancorp’s stress capital buffer under the FRB severely adverse scenario was 3.2% as of December 31, 2024 and 2.5% as of December 31, 2023. The Bancorp’s capital ratios have exceeded the stress capital buffer requirement for all periods presented.\nEnhanced Prudential Standards\nPursuant to Title I of Dodd-Frank, certain U.S. BHCs are subject to enhanced prudential standards and early remediation requirements. As a result, the Bancorp is subject to more stringent standards, including liquidity and capital requirements, leverage limits, stress testing, resolution planning and risk management standards, than those applicable to smaller institutions. Certain larger banking organizations are subject to additional enhanced prudential standards.\nAs discussed above, under the EPS Tailoring Rule, the Bancorp, as a Category IV banking organization, is subject to the least restrictive enhanced prudential standards applicable to firms with $100 billion or more in total consolidated assets. As compared to enhanced prudential standards that were applicable to the Bancorp, under the EPS Tailoring Rule, the Bancorp is no longer subject to company-run stress testing requirements and is subject to less frequent supervisory stress tests, less frequent internal liquidity stress tests and reduced liquidity risk management requirements.\nHeightened Governance and Risk Management Standards\nThe OCC has published guidelines documenting expectations for the governance and risk management practices of certain large financial institutions, including the Bank. The guidelines require covered institutions to establish and adhere to a written governance framework in order to manage and control their risk-taking activities. In addition, the guidelines provide standards for the institutions’ boards of directors to oversee the risk governance framework. The Bank currently has a written governance framework and associated controls.\nPrivacy and Data Security\nThe OCC, FRB, FDIC and other bank regulatory agencies have adopted guidelines for safeguarding confidential, personal customer information. The guidelines require each financial institution, under the supervision and ongoing oversight of its board of directors or an appropriate committee thereof, to create, implement and maintain a comprehensive written information security program designed to ensure the security and confidentiality of customer information, protect against any anticipated threats or hazards to the security or integrity of such information and protect against unauthorized access to or use of such information that could result in substantial harm or inconvenience to any customer. In addition, various U.S. regulators, including the OCC, FRB and the SEC, have increased their focus on cybersecurity through guidance, examinations and regulations. The Bancorp has adopted an information security program that has been approved by the Bancorp’s Board of Directors. For more information related to cybersecurity, refer to Part I,",
    "item1c": "ITEM 1C. CYBERSECURITY\nThe Bancorp recognizes the importance of maintaining a cybersecurity risk management system designed to reduce the risks that cybersecurity threats pose to financial institutions. \nAs such, the Bancorp has adopted proactive and defensive safeguards intended to better protect the Bancorp’s information assets and supporting infrastructures from technology-related attacks. The Bancorp’s Board of Directors and management oversee its information security and cybersecurity risk management programs.\n As further discussed below, the Bancorp has established various programs, policies and procedures which are designed to proactively protect information assets. However, not all incidents can be prevented. As a result, the Bancorp has also established various policies and procedures governing how to respond to security incidents, with the objective of minimizing any potential impacts.\n \nAs of December 31, 2024, the Bancorp is not aware of any cybersecurity incidents that have materially affected or are reasonably likely to materially affect Fifth Third, including its business strategies, results of operations or financial condition.\n \nRisk Assessment and Management\nThe Bancorp maintains a variety of programs and policies to support the management of cybersecurity risk within the organization with a focus on prevention, detection and response processes. These programs and policies leverage frameworks and controls from the National Institute of Standards and Technology as well as various other regulatory requirements and industry-specific standards. The Bancorp also participates in the federally recognized Financial Services Information Sharing and Analysis Center and requires its employees and contractors to complete various education and training programs related to information security.\nThe Bancorp’s Information Technology (“IT”) and Information Security (“IS”) teams have the primary responsibility for establishing appropriate policies and procedures that are responsive to cybersecurity threats and other information security risks. The Bancorp’s Information Technology and Cybersecurity Risk Management (“IT CSRM”) team, as part of the Bancorp’s Risk Management division, provides independent risk management oversight to those IT and IS teams. In addition to the Board oversight discussed below, the Bancorp’s Internal Audit function independently oversees, reviews and validates these activities and reports to the Board of Directors on the effectiveness of governance, risk management and internal controls.\nThe Bancorp has established an Enterprise Risk Management Framework which informs the Bancorp’s risk management programs. As part of this framework, the IT CSRM team maintains the Bancorp’s IT CSRM Program, which is designed to identify, assess, manage, monitor and report cybersecurity risks as part of the Bancorp’s independent risk management function. The IT CSRM team is responsible for defining the risk management practices set forth in the IT CSRM Program. Refer to the Risk Management – Overview section of Item 7 (Management’s Discussion and Analysis of Financial Condition and Results of Operations) of this Annual Report for additional information on the Bancorp’s Enterprise Risk Management Framework and related risk management processes.\nIn light of the complexity and evolving nature of the cybersecurity landscape, the Bancorp periodically re-assesses the maturity of its cybersecurity programs, policies and procedures, including in some instances by engaging the assistance of external experts. The Bancorp also conducts exercises to test its incident response plans and threat assessments, some of which also involve assistance from external consultants.\nThe Bancorp also maintains a Third Party Risk Management Program to perform similar functions related to risks associated with the Bancorp’s relationships with third parties.\n This assists the Bancorp in its management of its relationships with third parties, which includes considerations for identifying, analyzing and monitoring the cybersecurity risks that third parties may present to Fifth Third. The Bancorp also maintains a third-party incident response program to govern its response in the event of third-party cybersecurity events.\nBoard of Directors Oversight\nThe Technology Committee of the Bancorp’s Board of Directors takes primary responsibility for overseeing the Bancorp’s information security programs at the Board level. The Technology Committee’s primary purpose is to assist the Board of Directors in its oversight of plans and operations related to information technology, cybersecurity, data privacy and third-party technology strategy.\nThe Bancorp’s Risk and Compliance Committee of the Board of Directors oversees the Bancorp’s Enterprise Risk Management Framework and policies, including oversight of risks related to information security. The Risk and Compliance Committee receives periodic reports from the Technology Committee and these committees meet jointly at least once per year to discuss the Company’s programs and risks. \nThe full Board of Directors receives reports from the Technology Committee and the Risk and Compliance Committee about the Bancorp’s cybersecurity programs as a result of the above-described oversight. In the event of a material cybersecurity incident, the Bancorp’s incident response procedures include notifications to the Technology Committee, Risk and Compliance Committee and full Board of Directors, when appropriate and necessary.\n \n39 Fifth Third Bancorp\nTable of Contents\n \nManagement Oversight\nThe Bancorp’s Information Security Governance Committee (“ISGC”) is a management committee that reviews and discusses critical information security risks that impact the Bancorp, identifies solutions to address these risks and has oversight of the Bancorp’s information technology and information security policies. \nThe ISGC provides cybersecurity reports periodically to the Risk and Compliance Committee and is comprised of the Bancorp’s senior information security, information technology and enterprise risk management leaders, including the Chief Information Security Officer (“CISO”), Chief Information Officer, Chief Technology & Information Security Officer, Chief Data Officer and Chief Operational Risk Officer. The ISGC’s membership enables the ISGC to be informed about and monitor the prevention, detection, mitigation and remediation of cybersecurity incidents, if any, in accordance with the Bancorp’s incident response plans.\nThe Bancorp’s \nCISO\n is responsible for information security policies and the coordination of information security efforts across the organization\n. \nThe CISO has over 35 years of diverse experience in information technology management and cybersecurity leadership at Fifth Third and at other large, complex organizations. This prior experience includes leadership of functions for cybersecurity threat management, intelligence, risk mitigation and incident response. The CISO has a Bachelor of Science degree in Computer and Information Science and is a certified Six Sigma Black Belt.\n \nThe Bancorp’s CISO reports to the Chief Technology & Information Security Officer. The CISO also reports directly to the Technology Committee and participates in various management councils and committees. The Bancorp’s IT CSRM team monitors that the CISO has appropriate authority to carry out the duties and responsibilities necessary of that position.\n \nThe CISO remains informed about developments in cybersecurity, including potential threats and emerging risk management techniques, reporting such information to the Chief Information Officer and Technology Committee periodically. The CISO implements and oversees processes for the regular monitoring of information systems. This includes the deployment of advanced security measures and system audits to identify potential vulnerabilities. In the event of a cybersecurity incident, the CISO is equipped with a well-defined incident response plan. This plan includes immediate actions designed to mitigate the impact of any incident, and long-term strategies for remediation and prevention of future incidents.",
    "item1a": "ITEM 1A. RISK FACTORS\nThe risks and uncertainties listed below present risks that could have a material impact on the Bancorp’s financial condition, the results of its operations or its business. Some of these risks and uncertainties are interrelated and the occurrence of one or more of them may exacerbate the effect of others. The risks and uncertainties described below are not the only ones Fifth Third faces. Additional risks and uncertainties not presently known to Fifth Third or that Fifth Third currently believes to be immaterial may also adversely affect its business. See “Cautionary Note Regarding Forward-Looking Statements” elsewhere in this Annual Report on Form 10-K for more information.\nCREDIT RISKS\nDeteriorating credit quality has adversely impacted Fifth Third in the past and may adversely impact Fifth Third in the future.\nWhen Fifth Third lends money or commits to lend money, the Bancorp incurs credit risk, or the risk of loss if borrowers do not repay their loans, leases, credit cards, derivative obligations or other credit obligations. The performance of these credit portfolios significantly affects the Bancorp’s financial results and condition. If the current economic environment were to deteriorate, more customers may have difficulty in repaying their credit obligations which could result in a higher level of credit losses and reserves for credit losses. \nFifth Third reserves for credit losses by establishing reserves through a charge to earnings. The amount of these reserves is based on Fifth Third’s assessment of credit losses expected to be incurred in the credit portfolios, including unfunded credit commitments. The process for determining the amount of the ALLL and the reserve for unfunded commitments is critical to Fifth Third’s financial results and condition. Such determination requires difficult, subjective and complex judgments about the environment, including analysis of economic or market conditions that may impair the ability of borrowers to repay their loans.\nFifth Third may underestimate the credit losses expected to be incurred in its portfolios and have credit losses in excess of the amount reserved. Alternatively, Fifth Third may increase the reserve because of changing economic or market conditions, including inflation, interest rate fluctuations, higher unemployment, or other factors such as changing protections in credit agreements or changes in borrowers’ behavior. As an example, borrowers may “strategically default,” or discontinue making payments on their real estate-secured loans if the value of the real estate is less than what they owe, even if they are still financially able to make the payments.\nFifth Third believes that both the ALLL and the reserve for unfunded commitments are adequate to cover expected losses at December 31, 2024. However, there is no assurance that they will be sufficient to cover future credit losses associated with exposures existing at December 31, 2024, especially if economic conditions decline. In the event of significant deterioration in economic or market conditions, Fifth Third may be required to increase reserves in future periods, which would reduce earnings.\nFifth Third may have more credit risk and higher credit losses to the extent loans are concentrated by exposure to individual borrowers or the location or industry of borrowers or collateral.\nFifth Third’s credit risk and credit losses can increase if its loans are concentrated among individual borrowers, borrowers engaged in the same or similar activities, industries or geographies, or to borrowers who as a group may be uniquely or disproportionately affected by economic or market conditions. Deterioration in economic conditions, including housing conditions or commodity and real estate values in certain states or locations, could result in materially higher credit losses if loans are concentrated in those locations or by other factors. Fifth Third has significant exposure to businesses in certain economic sectors such as manufacturing, real estate, financial services, insurance and healthcare, and weaknesses in those businesses may adversely impact Fifth Third’s business, results of operations or financial condition. Additionally, Fifth Third has a substantial portfolio of commercial and residential real estate loans, and weaknesses in residential or commercial real estate markets may adversely impact Fifth Third’s business, results of operations or financial condition. Fifth Third also has a portfolio of indirect secured consumer loans, and the depreciation in the value of used vehicles may adversely impact Fifth Third’s business, results of operations or financial condition.\nProblems encountered by other financial institutions could adversely affect financial markets generally and have direct and indirect adverse effects on Fifth Third.\nFifth Third has exposure to counterparties in the financial services industry and other industries and routinely executes transactions with such counterparties, including brokers and dealers, commercial banks, investment banks, mutual and hedge funds and other institutional clients. Many of Fifth Third’s transactions with other financial institutions expose Fifth Third to credit risk in the event of default of a counterparty or client. In addition, Fifth Third’s credit risk may be affected when the collateral it holds cannot be realized or is liquidated at prices not sufficient to recover the full amount of the loan or derivative exposure. The commercial soundness of many financial institutions may be closely interrelated as a result of credit, trading, clearing or other relationships between the institutions. As a result, concerns about, or a default or threatened default by, one institution could lead to significant market-wide liquidity and credit problems, losses or defaults by other institutions. This is sometimes referred to as “systemic risk” and may adversely affect financial intermediaries, such as clearing agencies, clearing houses, banks, securities firms and exchanges, with which the Bancorp interacts on a daily basis, and therefore could adversely affect Fifth Third.\n25 Fifth Third Bancorp\nTable of Contents\n \nInability to refinance in capital markets could cause a default that impacts Fifth Third borrowers.\nSome Fifth Third customers rely on additional sources of capital from outside the Bancorp. If capital markets are disrupted or unavailable to these borrowers such that they cannot obtain funds for refinancing, those borrowers may experience a shortfall that would leave them unable to honor short-term and/or long-term obligations to the Bancorp.\nThe effects of global physical climate risks, severe weather events or health emergencies may have an effect on the performance of Fifth Third’s loan portfolios, thereby adversely impacting its results of operations.\nFifth Third’s footprint stretches from the upper Midwestern to lower Southeastern regions of the U.S. and it has offices in many other areas of the country. Some of these regions have experienced severe weather events including hurricanes, tornadoes, fires and other natural disasters. The nature and level of these events and the impact of global climate change upon their frequency and severity cannot be predicted. If large scale events occur, they may significantly impact Fifth Third’s loan portfolios by damaging properties pledged as collateral as well as impairing its borrowers’ ability to repay their loans.\nAdditionally, the impact of widespread health emergencies may adversely impact Fifth Third’s results of operations, such as the impacts previously experienced from the COVID-19 pandemic. If its borrowers are adversely affected due to a widespread health emergency that impacts Fifth Third employees, vendors or economic growth generally, Fifth Third’s financial condition and results of operations could be adversely affected.\nLIQUIDITY RISKS\nFifth Third must maintain adequate sources of funding and liquidity.\nFifth Third must maintain adequate funding sources in the normal course of business to support its operations and fund outstanding liabilities, as well as meet regulatory expectations. Fifth Third primarily relies on bank deposits to be a low cost and stable source of funding for the loans it makes and the operation of its business. Core deposits, which include transaction deposits and certificates of deposit $250,000 or less, have historically provided Fifth Third with a sizeable source of relatively stable and low-cost funds (average core deposits funded 77% of average total assets for the year ended December 31, 2024). In addition to customer deposits, sources of liquidity include investments in the securities portfolio, Fifth Third’s sale or securitization of loans in secondary markets, the pledging of loans and investment securities to access secured borrowing facilities through the FHLB and the FRB and Fifth Third’s ability to raise funds in money and capital markets.\nFifth Third’s liquidity and ability to fund and operate its business could be materially adversely affected by a variety of conditions and factors, including financial and credit market disruptions and volatility or a lack of market or customer confidence in financial markets in general, which may result in a loss of customer deposits or outflows of cash or collateral and/or the ability to access capital markets on favorable terms.\nOther conditions and factors that could materially adversely affect Fifth Third’s liquidity and funding include:\n•\na lack of market or customer confidence in Fifth Third or negative news about Fifth Third, regional banks or the financial services industry generally, which also may result in a loss of customer deposits and/or negatively affect Fifth Third’s ability to access the capital markets;\n•\nthe loss of customer deposits due to competition from other banks or due to alternative investments;\n•\ninability to sell or securitize loans or other assets;\n•\nincreased collateral requirements;\n•\nincreased regulatory requirements; \n•\nreductions in one or more of Fifth Third’s credit ratings; \n•\nincreased utilization of revolving lines of credit by customers; and\n•\nsystematic failure of financial market utilities relied upon by Fifth Third to settle intrabank payment activity.\nA reduction in Fifth Third’s credit rating could adversely affect its ability to retain deposits, borrow funds (including by raising the cost of borrowings substantially) and could cause creditors and business counterparties to raise collateral requirements or take other actions that could adversely affect Fifth Third’s ability to raise liquidity or capital. Many of the above conditions and factors may be caused by events over which Fifth Third has little or no control. There can be no assurance that significant disruption and volatility in the financial markets will not occur again in the future.\nIf Fifth Third is unable to continue to fund assets through customer bank deposits or access capital markets on favorable terms or if Fifth Third suffers an increase in borrowing costs or otherwise fails to manage liquidity effectively, Fifth Third’s liquidity, operating margins and financial results and condition may be materially adversely affected. Fifth Third may also need to raise additional capital and liquidity through the issuance of stock, which could dilute the ownership of existing stockholders, or reduce or even eliminate common stock dividends or share repurchases to preserve capital and liquidity.\nFifth Third and/or the holders of its securities could be adversely affected by unfavorable ratings from rating agencies.\nFifth Third’s ability to access the capital markets is important to its overall funding profile. This access is affected by the ratings assigned by rating agencies to Fifth Third, certain of its subsidiaries and particular classes of securities they issue. The interest rates that Fifth Third pays \n26 Fifth Third Bancorp \nTable of Contents\n \non its securities are also influenced by, among other things, the credit ratings that it, its subsidiaries and/or its securities receive from recognized rating agencies. A downgrade to Fifth Third or its subsidiaries’ credit rating could affect its ability to access the capital markets, increase its borrowing costs and negatively impact its profitability. A ratings downgrade to Fifth Third, its subsidiaries or their securities could also create obligations or liabilities of Fifth Third under the terms of its outstanding securities that could increase Fifth Third’s costs or otherwise have a negative effect on its results of operations or financial condition.\nAdditionally, a downgrade of the credit rating of any particular security issued by Fifth Third or its subsidiaries could negatively affect the ability of the holders of that security to sell the securities and the prices at which any such securities may be sold.\nOther rating agencies may also take actions to downgrade their ratings of the securities issued by Fifth Third or its subsidiaries. There can be no assurances that Fifth Third or its subsidiaries will retain any specific rating from any specific rating agency.\nIf Fifth Third is unable to maintain or grow its deposits, it may be subject to paying higher funding costs.\nThe total amount that Fifth Third pays for funding costs is dependent, in part, on Fifth Third’s ability to maintain or grow its deposits. If Fifth Third is unable to sufficiently maintain or grow its deposits to meet liquidity objectives, it may be subject to paying higher funding costs. Fifth Third competes with banks and other financial services companies for deposits. If competitors raise the rates they pay on deposits, Fifth Third’s funding costs may increase, either because Fifth Third raises rates to avoid losing deposits or because Fifth Third loses deposits and must rely on more expensive sources of funding. Also, customers typically move money from bank deposits to alternative investments during rising interest rate environments. Customers may also move noninterest-bearing deposits to interest-bearing accounts increasing the cost of those deposits. Checking and savings account balances and other forms of customer deposits may decrease when customers perceive alternative investments, such as the stock market, as providing a better risk/return trade-off. Fifth Third’s bank customers could take their money out of the Bank and put it in alternative investments, causing Fifth Third to lose a lower-cost source of funding. Higher funding costs reduce Fifth Third’s net interest margin and net interest income.\nThe Bancorp’s ability to receive dividends from its subsidiaries accounts for most of its revenue and could affect its liquidity and ability to pay dividends.\nFifth Third Bancorp is a separate and distinct legal entity from its subsidiaries. Fifth Third Bancorp typically receives substantially all of its revenue from dividends from its subsidiaries. These dividends are the principal source of funds to pay dividends on Fifth Third Bancorp’s stock and interest and principal on its debt. The ability of Fifth Third Bancorp’s subsidiaries to pay dividends or make other payments or distributions depends on their respective operating results and may be restricted by, among other things, regulatory constraints, prevailing economic conditions (including interest rates) and financial, business and other factors, many of which are beyond the control of Fifth Third Bancorp. Various federal and/or state laws and regulations, as well as regulatory expectations, limit the amount of dividends that the Bancorp’s banking subsidiary and certain nonbank subsidiaries may pay to the Bancorp. Regulatory scrutiny of liquidity and capital levels at BHCs and insured depository institutions has resulted in increased regulatory focus on all aspects of capital planning, including dividends and other distributions to shareholders of banks such as the parent BHCs. In addition, Fifth Third Bancorp’s right to participate in a distribution of assets upon a subsidiary’s liquidation or reorganization is subject to the prior claims of that subsidiary’s creditors.\nRegulatory limitations on the Bancorp’s ability to receive dividends from its subsidiaries, economic conditions and other financial or business factors could have a material adverse effect on its liquidity and ability to pay dividends on stock or interest and principal on its debt and to engage in share repurchases. For further information, refer to Regulation and Supervision in Item 1 of this Annual Report on Form 10-K and Note 3 of the Notes to Consolidated Financial Statements.\nOPERATIONAL RISKS\nFifth Third is exposed to cybersecurity risks that create both operational and reputational risk for the Bank and its customers across all lines of business.\nIn today’s digital world, more and more of Fifth Third’s business is conducted primarily via digital and mobile technology and information management systems. This includes the use of cloud computing, digital applications and third-party providers that host and store sensitive employee and customer information. Failures, interruptions of service or breaches in the security of these environments occur across the financial services industry with some frequency, including at Fifth Third and its third-party providers. If an event of this nature occurred at Fifth Third or one of its third-party providers and such event proved to be material, this could result in disruptions to Fifth Third’s accounting, deposit, lending and other systems, and adversely affect its customer relationships. While Fifth Third heavily invests in information security, technical resiliency, business continuity and disaster recovery planning, and has policies and procedures designed to detect, limit, and prevent the impact of these possible events, there can be no assurance that any such failure, interruption or security breach will not occur or, if any does occur, that it can be remediated in such a way to eliminate the risk.\nThere will always be efforts on the part of threat actors to breach information security at financial institutions or with respect to financial transactions. There have been several recent instances involving financial services, credit bureaus and consumer-based companies reporting the unauthorized disclosure of client or customer information or the destruction or theft of corporate data, by both private individuals and foreign governments. In addition, because the techniques used to cause such security breaches change frequently, often are not recognized until launched against a target and may originate from remote and less regulated areas around the world, Fifth Third may be unable to \n27 Fifth Third Bancorp\nTable of Contents\n \nproactively address these techniques or to implement adequate preventative measures. Threat actors, including nation state attackers, could also use artificial intelligence for malicious purposes, increasing the frequency, complexity and effectiveness of their attacks. Despite Fifth Third’s efforts to prevent a cyber-attack and monitoring of data flow inside and outside Fifth Third, due to the increasing sophistication of techniques used by attackers to conceal access to systems, a successful cyber-attack could persist for an extended period of time before being detected, and, following detection, it could take considerable time for Fifth Third to obtain full and reliable information about the cybersecurity incident and the extent, amount and type of information compromised. During the course of an investigation, Fifth Third may not necessarily know the full effects of the incident or how to remediate it, and actions and decisions that are taken or made in an effort to mitigate risk may further increase the costs and other negative consequences of the incident. Furthermore, financial services companies are regularly the target of cyber-attacks such as distributed denial of service, social engineering and ransomware attacks. The unintentional or willful acts or omissions of employees also remains the primary avenue through which threat actors attempt to gain access to company networks, information systems, data and credentials.\nAn additional risk is the use of third- and fourth-party providers to host critical data and platforms for Fifth Third, or in some cases provide services to Fifth Third domestically and internationally. Fifth Third has a third-party risk program to oversee third- and fourth-party providers. This does not eliminate all risk and its failure to do so could result in customer losses, operational issues, litigation, regulatory actions and reputational damage. Industry trends demonstrate a shift towards the use of cloud providers, Software as a Service partners and hosted platforms rather than traditional software services that can be operated from within a company’s firewall and data centers, and the implementation and development of new and emerging technologies such as artificial intelligence. These additional risks are further heightened through the increasing use of near real-time money movement solutions such as Zelle, and increase the difficulty to detect, prevent and recover fraudulent transactions. These additional risks are increasing the costs of Fifth Third’s investment in technology and cybersecurity and require further investment in cyber-related and data loss event insurance which Fifth Third has in place. Though Fifth Third has insurance against some cybersecurity risks and attacks, it may not be sufficient to offset the impact of a material loss event. Future investment in these areas could have higher than expected costs and/or result in operating inefficiencies, which could increase the costs associated with the implementation as well as ongoing operations.\nIf personal, confidential or proprietary information of customers or clients in the Bancorp’s or such vendors’ or other third-parties’ possession were to be mishandled or misused, the Bancorp could suffer significant regulatory consequences, reputational damage and financial loss.\nFifth Third relies on its systems and certain third-party service providers and certain failures (including those related to cybersecurity or weather events exacerbated by climate change) could materially adversely affect operations.\nFifth Third’s operations, including its financial and accounting systems, use computer systems and telecommunications networks operated by both Fifth Third and third-party service providers. Fifth Third may not be sufficiently resilient and may not recover from significant operational events in a timely manner which could create operational and reputational risks. Additionally, Fifth Third collects, processes and stores sensitive consumer data by utilizing those and other systems and networks. Fifth Third has security, backup and recovery systems in place, as well as a business continuity plan to ensure the systems will not be inoperable. Fifth Third also has security to prevent unauthorized access to the systems. In addition, Fifth Third requires its third-party service providers to maintain similar controls. However, Fifth Third cannot be certain that the measures will be successful, particularly given the rapidly evolving sophistication of threat actors and technologies.\nA security breach in these systems or the loss or corruption of confidential information such as business results, transaction records and related information could adversely impact Fifth Third’s ability to provide timely and accurate financial information in compliance with legal and regulatory requirements, which could result in sanctions from regulatory authorities, significant reputational harm and the loss of customer confidence in Fifth Third. Additionally, security breaches or the loss, theft or corruption of customer information such as social security numbers, credit card numbers, account balances or other information could result in losses by Fifth Third's customers, litigation, regulatory sanctions, lost customers and revenue, increased costs and significant reputational harm.\nFifth Third’s necessary dependence upon automated systems to record and process its transaction volume poses the risk that technical system flaws or employee errors, tampering or manipulation of those systems could result in losses and may be difficult to detect. Fifth Third may also be subject to disruptions of its operating systems arising from events that are beyond its control (for example, cyber-attacks, equipment failure, or electrical or telecommunications outages).\nThird-party service providers with which the Bancorp does business both domestically and offshore, as well as vendors and other third parties with which the Bancorp’s customers do business, can also be sources of operational risk to the Bancorp, particularly where processes are highly concentrated or in widespread use on critical Bancorp systems, or activities of customers are beyond the Bancorp’s security and control systems, such as through the use of the internet, personal computers, tablets, smart phones and other mobile services. Security breaches or system failures affecting the Bancorp or its third-party providers can increase operational costs and reduce customer satisfaction, as the Bancorp takes steps to protect its systems and safeguard confidential information. If personal, confidential or proprietary information of customers or clients in the Bancorp’s or such vendors’ or other third parties’ possession were to be mishandled or misused, the Bancorp could suffer significant regulatory consequences, reputational damage and financial loss. Such mishandling or misuse could include circumstances where, for example, such information was erroneously provided to parties who are not permitted to have the information, either through the fault of the Bancorp’s systems, employees or counterparties, or where such information was intercepted or otherwise compromised by threat actors. The Bancorp may be subject to disruptions of its operating systems arising from events that are wholly or partially beyond the \n28 Fifth Third Bancorp \nTable of Contents\n \nBancorp’s control, which may include, for example, security breaches; electrical or telecommunications outages; failures of computer components or servers or other damage to the Bancorp’s property or assets; natural disasters or severe weather conditions; health emergencies; or events arising from local or larger-scale political events, including outbreaks of hostilities or terrorist acts. While the Bancorp believes that its current business continuity plans are both sufficient and adequate, there can be no assurance that such plans will fully mitigate all potential business continuity risks to the Bancorp or its customers and clients.\nAny failures or disruptions of the Bancorp’s systems or operations could give rise to losses in service to customers and clients, adversely affect the Bancorp’s business and results of operations by subjecting the Bancorp to losses or liability, or require the Bancorp to expend significant resources to correct the failure or disruption, as well as by exposing the Bancorp to reputational harm, litigation, regulatory fines or penalties or losses not covered by insurance. In addition, any security compromise or information technology system disruptions in the financial services industry as a whole, whether actual or perceived, could interrupt the Bancorp’s business or operations, harm its reputation, erode borrower confidence, negatively affect the Bancorp’s ability to attract new members, or subject it to third-party lawsuits, regulatory fines or other action or liability, which could adversely affect Fifth Third’s business and results of operations. The Bancorp could also be adversely affected if it loses access to information or services from a third-party service provider as a result of a security breach or system or operational failure, or disruption affecting the third-party service provider. Fifth Third’s insurance may be inadequate to compensate for failures by, or affecting, third-party service providers upon which Fifth Third relies.\nFifth Third may not be able to effectively manage organizational changes and implement key initiatives in a timely fashion, or at all, due to competing priorities which could adversely affect its business, results of operations, financial condition and reputation.\nFifth Third is subject to rapid changes in technology, regulation and product innovation, and faces intense competition for customers, sources of revenue, capital, services, qualified employees and other essential business resources. In order to meet these challenges, Fifth Third is or may be engaged in numerous critical strategic initiatives at the same time. Accomplishing these initiatives may be complex, time intensive and require significant financial, technological, management and other resources. These initiatives may consume management’s attention and may compete for limited resources. In addition, organizational changes may need to be implemented throughout Fifth Third as a result of the new products, services, partnerships and processes that arise from the execution of these various strategic initiatives. Fifth Third may have difficulty managing these organizational changes and executing these initiatives effectively in a timely fashion, or at all. Fifth Third’s failure to do so could expose it to litigation or regulatory action and may damage Fifth Third’s business, results of operations, financial condition and reputation.\nFifth Third may not be able to successfully implement future information technology system enhancements, which could adversely affect Fifth Third’s business operations and profitability.\nFifth Third invests significant resources in information technology system enhancements in order to provide functionality and security at an appropriate level for ongoing product development and process re-engineering. Fifth Third may not be able to successfully implement and integrate future system enhancements, which could adversely impact the ability to provide timely and accurate financial information in compliance with legal and regulatory requirements, which could result in sanctions from regulatory authorities. Such sanctions could include fines and result in reputational harm and have other negative effects. Failure to properly utilize system enhancements that are implemented in the future could result in impairment charges that adversely impact Fifth Third’s financial condition and results of operations and could result in significant costs to remediate or replace the defective components. In addition, Fifth Third may incur significant training, licensing, maintenance, consulting, depreciation expense and amortization expenses during and after systems implementations, and any such costs may continue for an extended period of time. A failure to maintain or enhance Fifth Third’s competitive position with respect to technology, whether because of a failure to anticipate client expectations or other necessary changes, a failure in the performance of technological developments or an untimely roll out of developments, may cause Fifth Third to lose market share or incur additional expense.\nNew technological advancements may subject Fifth Third to additional risks.\nThe financial services industry is continually undergoing rapid technological change with frequent introductions of new technology-driven products and services (including those related to or involving artificial intelligence, machine learning, blockchain and other distributed ledger technologies), and an established and growing demand for mobile and other phone and computer banking applications. Fifth Third’s future success depends, in part, upon Fifth Third’s ability to address the needs of its customers by using technology to provide products and services that will satisfy customer demands, as well as to create additional efficiencies in its operations. Many of Fifth Third’s competitors have substantially greater resources to invest in technological improvements. Fifth Third may not be able to effectively implement new technology driven products and services or be successful in marketing these products and services to its customers. In addition, Fifth Third’s implementation of certain new technologies, such as those related to artificial intelligence, automation and algorithms, in Fifth Third’s business processes may have unintended consequences due to its limitations or its failure to use them effectively. In addition, cloud technologies are also critical to the operation of Fifth Third’s systems, and its reliance on cloud technologies is growing. Failure to successfully keep pace with technological change affecting the financial services industry could have a material adverse effect on Fifth Third’s business, financial condition and results of operations.\nFurthermore, any new technology could have a significant impact on the effectiveness of Fifth Third’s system of internal controls. Failure to successfully manage these risks in the development and implementation of new lines of business, new products or services and/or new technologies could have a material adverse effect on Fifth Third’s business, financial condition and results of operations.\n29 Fifth Third Bancorp\nTable of Contents\n \nFifth Third may experience losses related to fraud, theft or violence.\nFifth Third has experienced, and may experience again in the future, losses incurred due to customer or employee fraud, theft or physical violence. Additionally, physical violence may negatively affect Fifth Third’s key personnel, facilities or systems. These losses may be material and negatively affect Fifth Third’s results of operations, financial condition or prospects. These losses could also lead to significant reputational risks and other effects. The industry fraud threat continues to evolve, including but not limited to, card fraud, check fraud, electronic fraud, wire fraud, social engineering and phishing attacks for identity theft and account takeover. Nationally, reported incidents of fraud and other financial crimes have increased. Increased use of the internet and telecommunications technologies (including mobile devices) to conduct financial and other business transactions and operations, coupled with the increased sophistication and activities of organized crime, perpetrators of fraud, hackers, terrorists and others increases Fifth Third’s security risks. Fifth Third continues to invest in fraud prevention in the forms of people and systems designed to prevent, detect and mitigate the customer and financial impacts.\nFifth Third could suffer if it fails to attract and retain skilled personnel.\nFifth Third’s success depends, in large part, on its ability to attract and retain key individuals. Competition for qualified candidates in the activities and markets that Fifth Third serves is intense, which may increase Fifth Third’s expenses and may result in Fifth Third not being able to hire candidates or retain them. If Fifth Third is not able to hire qualified candidates or retain its key personnel, Fifth Third may be unable to execute its business strategies and may suffer adverse consequences to its business, operations and financial condition.\nCompensation paid by financial institutions such as Fifth Third is heavily regulated, particularly under Dodd-Frank, which affects the amount and form of compensation Fifth Third pays to hire and retain talented employees. If Fifth Third is unable to attract and retain qualified employees, or do so at rates necessary to maintain its competitive position, or if compensation costs required to attract and retain employees become more expensive, Fifth Third’s performance, including its competitive position, could be materially adversely affected.\nFifth Third may experience operational disruption from the effects of climate change.   \nFifth Third faces operational risk from the effects of climate change as an increase in severe weather may cause closures, damage to infrastructure or damage to Fifth Third’s physical locations or other assets that may disrupt the physical operation of the Bancorp. These interruptions may impair Fifth Third’s ability to operate and may interfere with its ability to carry out business and serve clients and customers.\nLEGAL AND REGULATORY COMPLIANCE RISKS\nFifth Third and/or its affiliates are or may become involved from time to time in information-gathering requests, investigations and litigation, regulatory or other enforcement proceedings by various governmental regulatory agencies and law enforcement authorities, as well as self-regulatory agencies which may lead to adverse consequences. \nFifth Third and/or its affiliates are or may become involved from time to time in information-gathering requests, reviews, investigations and proceedings (both formal and informal) by governmental regulatory agencies and law enforcement authorities, including but not limited to the FRB, OCC, CFPB, SEC, FINRA, U.S. Department of Justice, etc., as well as state and other governmental authorities and self-regulatory bodies, regarding their respective customers and businesses. Also, a violation of law or regulation by another financial institution may give rise to an inquiry or investigation by regulators or other authorities of the same or similar practices by Fifth Third. In addition, the complexity of the federal and state regulatory and enforcement regimes in the U.S. means that a single event or topic may give rise to numerous and overlapping investigations and regulatory proceedings. Furthermore, Fifth Third and certain of its directors and officers have been named from time to time as defendants in various class actions and other litigation relating to Fifth Third’s business and activities, as well as regulatory or other enforcement proceedings. Past, present and future litigation have included or could include claims for substantial compensatory and/or punitive damages or claims for indeterminate amounts of damages. Investigations by regulatory authorities may from time to time result in civil or criminal referrals to law enforcement. Enforcement authorities may seek admissions of wrongdoing and, in some cases, criminal pleas as part of the resolutions of matters and any such resolution of a matter involving Fifth Third which could lead to increased exposure to private litigation, could adversely affect Fifth Third’s reputation and could result in limitations on Fifth Third’s ability to do business in certain jurisdictions. Additionally, in some cases, regulatory authorities may take supervisory actions that are considered to be confidential supervisory information which may not be publicly disclosed.\nEach of the matters described above may result in material adverse consequences, including without limitation, adverse judgments, settlements, fines, penalties, injunctions or other actions, amendments and/or restatements of Fifth Third’s SEC filings and/or financial statements, as applicable, and/or determinations of material weaknesses in its disclosure controls and procedures. In addition, responding to information-gathering requests, reviews, investigations and proceedings, regardless of the ultimate outcome of the matter, could be time-consuming and expensive.\nLike other large financial institutions and companies, Fifth Third is also subject to risk from potential employee misconduct, including non-compliance with policies and improper use or disclosure of confidential information. Substantial legal liability or significant regulatory or other enforcement action against Fifth Third could materially adversely affect its business, financial condition or results of operations and/or cause significant reputational harm to its business. The outcome of lawsuits and regulatory proceedings may be difficult to predict or estimate. Although Fifth Third establishes accruals for legal proceedings when information related to the loss contingencies represented by those matters indicates both that a loss is probable and that the amount of loss can be reasonably estimated, Fifth Third does not have accruals \n30 Fifth Third Bancorp \nTable of Contents\n \nfor all legal proceedings where it faces a risk of loss. In addition, due to the inherent subjectivity of the assessments and unpredictability of the outcome of legal proceedings, amounts accrued may not represent the ultimate loss to Fifth Third from the legal proceedings in question. Thus, Fifth Third’s ultimate losses may be higher, and possibly significantly so, than the amounts accrued for legal loss contingencies, which could adversely affect Fifth Third’s results of operations.\nIn addition, there has been a trend of public settlements with governmental agencies that may adversely affect other financial institutions, to the extent such settlements are used as a template for future settlements. The uncertain regulatory enforcement environment makes it difficult to estimate probable losses, which can lead to substantial disparities between legal reserves and actual settlements or penalties.\nFor further information on specific legal and regulatory proceedings, refer to Note 19 of the Notes to Consolidated Financial Statements. \nFifth Third may be required to repurchase residential mortgage loans or reimburse investors and others as a result of breaches in contractual representations and warranties. \nFifth Third sells residential mortgage loans to various parties, including government-sponsored enterprises (“GSEs”) and other financial institutions that purchase residential mortgage loans for investment or private label securitization. Fifth Third may be required to repurchase residential mortgage loans, indemnify the securitization trust, investor or insurer, or reimburse the securitization trust, investor or insurer, for credit losses incurred on loans in the event of a breach of contractual representations or warranties that is not remedied within a specified period (usually 60 days or less) after Fifth Third receives notice of the breach. Contracts for residential mortgage loan sales to the GSEs include various types of specific remedies and penalties that could be applied to inadequate responses to repurchase requests. As a result, Fifth Third has established reserves in its consolidated financial statements for probable losses related to the residential mortgage loans it has sold. If economic conditions or the housing market deteriorate or future investor repurchase demand and Fifth Third’s success at appealing such repurchase requests differ from expectations, Fifth Third could have increased repurchase obligations and increased loss severity on repurchases, requiring material additions to the repurchase reserve. Due to uncertainties relating to these factors, there can be no assurance that the reserves Fifth Third establishes will be adequate or that the total amount of losses incurred will not have a material adverse effect on Fifth Third’s financial condition or results of operations.\nFifth Third is subject to extensive governmental regulation which could adversely impact Fifth Third or the businesses in which Fifth Third is engaged.\nGovernment regulation and legislation subject Fifth Third and other financial institutions to restrictions, oversight and/or costs that may have an impact on Fifth Third’s business, financial condition, results of operations or the price of its common stock.\nFifth Third is subject to extensive federal and state regulation, supervision and legislation that govern almost all aspects of its operations and limit the businesses in which Fifth Third may engage. These laws and regulations may change from time to time and are primarily intended for the protection of consumers, borrowers and depositors and are not designed to protect security-holders. In the past decade, the scope of the laws and regulations and the intensity of the supervision to which Fifth Third is subject increased in response to the 2008-2009 financial crisis as well as other factors such as technological and market changes. Compliance with these laws and regulations has resulted in and will continue to result in additional costs, which could be significant, and may have a material and adverse effect on Fifth Third’s results of operations. In addition, if Fifth Third does not appropriately comply with current or future legislation and regulations, especially those that apply to its consumer operations, which has been an area of heightened focus, Fifth Third may be subject to fines, penalties or judgments, or material regulatory restrictions on its businesses, which could adversely affect operations and, in turn, financial results. Additionally, actions by regulatory agencies or significant litigation against Fifth Third could cause it to devote significant time and resources to defending itself and may lead to penalties that materially affect Fifth Third and its shareholders. Future changes in laws or regulations (including tax laws and regulations such as the Inflation Reduction Act) or their interpretations or enforcement may also be materially adverse to Fifth Third and its shareholders or may require Fifth Third to expend significant time and resources to comply with such requirements. In addition, as climate change issues become more prevalent, the U.S. and foreign governments are beginning to respond to these issues. The evolving federal and state government focus on climate change may result in new environmental regulations, including disclosure requirements from other jurisdictions in which the Bank operates that could result in additional compliance costs. Similarly, the impact of domestic and international events related to financial crime such as fraud, money laundering, and economic sanctions will continue to be an area of constant change, risk, and regulatory focus which pose ongoing regulatory, compliance, operational and financial risks.\nIt is anticipated that the Trump administration will promulgate a number of executive orders and propose legislation that could directly impact the regulation of the financial services industry, many of which may mark a departure from the Biden administration’s regulatory agenda that has included a heightened focus on the risks arising from climate change, fair lending, consumer protection, Bank Secrecy Act and anti-money laundering requirements, topics related to social equity, executive compensation, and increased capital and liquidity, as well as limits on share buybacks and dividends. It is uncertain if the implementation of any of these policies would impact Fifth Third, and if so, what the impact would be. We expect the Trump administration will seek to implement a regulatory reform agenda that is significantly different than that of the Biden administration, impacting the rulemaking, supervision, examination and enforcement priorities of the federal banking agencies. It is not possible at this time to determine whether changes in the administration may change the regulatory focus and/or implementation of any regulations, policies or reforms.\n31 Fifth Third Bancorp\nTable of Contents\n \nFifth Third cannot predict whether any pending or future legislation will be adopted or the substance and impact of any such new legislation on Fifth Third. Changes in regulation and supervisory and enforcement focus could affect Fifth Third in a substantial way and could have an adverse effect on its business, financial condition and results of operations. Additionally, legislation or regulatory reform could affect the behaviors of third parties that Fifth Third deals with in the course of business, such as rating agencies, insurance companies and investors. \nIn addition, changes in laws or regulations that affect Fifth Third’s customers and business partners could negatively affect Fifth Third’s revenues and expenses. Certain changes in laws such as tax law reforms that impose limitations on the deductibility of interest may decrease the demand for Fifth Third’s products or services and could negatively affect its revenues and results of operations. Heightened standards under proposed and recently finalized laws or regulations, or regulations soon to enter into force whose enforcement is yet to begin (such as, for example, capital and liquidity rules, or heightened Community Reinvestment Act standards), may result in increased obligations and compliance costs, may result in supervisory or enforcement action and may factor into Fifth Third’s ability to expand services and/or engage in new actions. Other changes in laws or regulations could cause Fifth Third’s third-party service providers and other vendors to increase the prices they charge to Fifth Third and negatively affect Fifth Third’s expenses and financial results.\nFifth Third could suffer from unauthorized use of intellectual property.\nFifth Third develops for itself, and licenses from others, intellectual property for use in conducting its business. This intellectual property has been, and may be, subject to misappropriation or infringement by third parties as well as claims that Fifth Third’s use of certain technology or other intellectual property infringes on rights owned by others. Fifth Third has been, and may be, subject to disputes and/or litigation concerning these claims and could be held responsible for significant damages covering past activities and substantial fees to continue to engage in these activities in the future. Fifth Third may also be unable to acquire rights to use certain intellectual property that is important for its business and may be unable to effectively engage in critical business activities. If Fifth Third is unable to protect or acquire rights to use intellectual property it owns or licenses, it may lose certain competitive advantages, incur expenses and/or lose revenue and may suffer harm to its business results and financial condition.\nFifth Third is subject to various regulatory requirements that may limit its operations and potential growth.\nUnder federal and state laws and regulations pertaining to the safety and soundness of insured depository institutions and their holding companies, the FRB, the FDIC, the CFPB and the OCC have the authority to compel or restrict certain actions by the Bancorp and the Bank. The Bancorp and the Bank are subject to such supervisory authority and, more generally, must, in certain instances, obtain prior regulatory approval before engaging in certain activities or corporate decisions. There can be no assurance that such approvals, if required, would be forthcoming or that such approvals would be granted in a timely manner. Failure to receive any such approval, if required, could limit or impair the Bancorp’s operations, restrict its growth, ability to compete, innovate or participate in industry consolidation and/or affect its dividend policy. Such actions and activities that may be subject to prior approval include, but are not limited to, increasing dividends or other capital distributions by the Bancorp or the Bank, entering into a merger or acquisition transaction, acquiring or establishing new branches and entering into certain new businesses.\nFailure by the Bancorp or the Bank to meet the applicable eligibility requirements for FHC status (including capital and management requirements and that the Bank maintain at least a “Satisfactory” CRA rating) may result in restrictions on certain activities of the Bancorp, including the commencement of new activities and mergers with or acquisitions of other financial institutions and could ultimately result in the loss of FHC status.\nFifth Third and other financial institutions are highly regulated and subject to extensive oversight, supervision and examination by regulators, including the FRB, OCC, FDIC, CFPB, SEC, CFTC, FINRA, the National Futures Association and other state, federal and self-regulatory entities. Fifth Third is also subject to certain regulatory requirements as a result of its banking activity including with respect to stress testing, liquidity and capital levels, asset quality, provisioning, AML/BSA, fair lending, consumer compliance, protection of customer information and other prudential matters and efforts to ensure that financial institutions take steps to improve their risk management and prevent future crises. For more information, refer to Regulation and Supervision—Regulatory Regime for Derivatives in Item 1 of this Annual Report on Form 10-K.\nIn this regard, government authorities, including the bank regulatory agencies and law enforcement, are also pursuing aggressive enforcement actions with respect to compliance and other legal matters involving financial activities, which heightens the risks associated with actual and perceived compliance failures and may also adversely affect Fifth Third’s ability to enter into certain transactions or engage in certain activities, or obtain necessary regulatory approvals in connection therewith. The government enforcement authority includes, among other things, the ability to assess significant civil or criminal monetary penalties, fines, or restitution; to issue cease and desist or removal orders; and to initiate injunctive actions against banking organizations and institution-affiliated parties. These enforcement actions may be initiated for violations of laws and regulations and unsafe or unsound practices.\nIn some cases, regulatory agencies may take supervisory actions that may not be publicly disclosed, which restrict or limit a financial institution. Finally, as part of Fifth Third’s regular examination process, the Bancorp and the Bank’s respective regulators may advise it and its banking subsidiary to operate under various restrictions as a prudential matter. Such supervisory actions or restrictions, if and in whatever manner imposed, could negatively affect Fifth Third’s ability to engage in new activities and certain transactions, as well as have a material adverse effect on Fifth Third’s business and results of operations and may not be publicly disclosed.\n32 Fifth Third Bancorp \nTable of Contents\n \nFifth Third could face serious negative consequences if its third-party service providers, business partners, customers or investments fail to comply with applicable laws, rules or regulations.\nFifth Third is expected to oversee the legal and regulatory compliance of its business endeavors, including those performed by third-party service providers, business partners, customers, other vendors and certain companies in which Fifth Third has invested. Legal authorities and regulators could hold Fifth Third responsible for failures by these parties to comply with applicable laws, rules or regulations. These failures could expose Fifth Third to significant litigation or regulatory action that could limit its activities or impose significant fines or other financial losses. Additionally, Fifth Third could be subject to significant litigation from consumers or other parties harmed by these failures and could suffer significant losses of business and revenue, as well as reputational harm as a result of these failures.\nAs a regulated entity, the Bancorp is subject to certain capital requirements that may limit its operations, potential growth and ability to pay or increase dividends on its common stock or to repurchase its capital stock.\nAs a BHC and an FHC, the Bancorp is subject to the comprehensive, consolidated supervision and regulation of the FRB, including risk-based and leverage capital requirements, investment practices, dividend policy and growth. The Bancorp must maintain certain risk-based and leverage capital ratios as required by the FRB which can change depending upon general economic conditions and the Bancorp’s particular condition, risk profile and growth plans. Compliance with the capital requirements, including leverage ratios, may limit operations that require the intensive use of capital and could adversely affect the Bancorp’s ability to expand or maintain present business levels.\nFailure by the Bank to meet applicable capital requirements could subject it to a variety of enforcement actions available to the federal regulatory authorities. These include limitations on the ability of the Bancorp to pay dividends and/or repurchase shares, the issuance by the regulatory authority of a capital directive to increase capital, loss of FHC status and the termination of deposit insurance by the FDIC.\nThe Bancorp is subject to the stress capital buffer requirement and must maintain capital ratios above its buffered minimum (regulatory minimum plus stress capital buffer) in order to avoid certain limitations on capital distributions and discretionary bonuses to executive officers. The FRB uses the supervisory stress test to determine the Bancorp’s stress capital buffer, subject to a floor of 2.5%. The Bancorp’s stress capital buffer under the FRB severely adverse scenario was 3.2% as of December 31, 2024. Further changes to applicable capital and liquidity requirements could result in unexpected or new limitations on the Bancorp’s ability to pay dividends and engage in share repurchases. \n \nDeposit insurance premiums levied against the Bank could increase further if the number of bank failures increase or the cost of resolving failed banks increases.\nThe FDIC maintains a Deposit Insurance Fund (“DIF”) to protect insured depositors in the event of bank failures. The DIF is funded by fees assessed on insured depository institutions including the Bank. Future deposit premiums paid by the Bank depend on FDIC rules, which are subject to change, the level of the DIF and the magnitude and cost of future bank failures. As of June 30, 2020, the DIF reserve ratio fell to 1.30%, below the statutory minimum of 1.35%. In order to restore the DIF to its statutorily mandated minimums, the FDIC significantly increased deposit insurance premium rates, including the Bank’s, resulting in increased expenses. The revised assessment rate schedules became effective January 1, 2023, and were applicable to the first quarterly assessment period of 2023. Additionally, in November 2023, the FDIC issued a final rule for a special deposit insurance assessment to recover the costs associated with protecting uninsured depositors following the bank failures that occurred in 2023. Subsequently, in 2024, the FDIC announced that it expects to incur additional losses related to these bank failures beyond its initial estimates, resulting in an increase to the amount of the special assessment allocated to each member bank. The Bancorp currently expects to pay the special assessment to the FDIC over a total of ten quarterly assessment periods, which began with the first quarter of 2024. The FDIC may further increase the assessment rates or impose additional special assessments in the future, which may require the Bank to pay significantly higher FDIC premiums.\nIf an orderly liquidation of a systemically important BHC or non-bank financial company were triggered, Fifth Third could face assessments for the Orderly Liquidation Fund.\nDodd-Frank created authority for the orderly liquidation of systemically important BHCs and non-bank financial companies and is based on the FDIC’s bank resolution model. The Secretary of the U.S. Treasury may trigger liquidation under this authority only after consultation with the President of the United States and after receiving a recommendation from the board of the FDIC and the FRB upon a two-thirds vote. Liquidation proceedings will be funded by the Orderly Liquidation Fund established under Dodd-Frank, which will borrow from the U.S. Treasury and impose risk-based assessments on covered financial companies. Risk-based assessments would be made, first, on entities that received more in the resolution than they would have received in the liquidation to the extent of such excess and second, if necessary, on, among others, BHCs with total consolidated assets of $50 billion or more, such as Fifth Third. Any such assessments may adversely affect Fifth Third’s business, financial condition or results of operations.\nMARKET RISKS: INTEREST RATE RISKS AND PRICE RISKS\nWeakness in the U.S. economy, including within Fifth Third’s geographic footprint, has adversely affected Fifth Third in the past and may adversely affect Fifth Third in the future.\nFifth Third has been, and will continue to be, impacted by general business and economic conditions in the U.S. These conditions include short-term and long-term interest rates, inflation, money supply, political issues, legislative and regulatory changes, fluctuations in both debt \n33 Fifth Third Bancorp\nTable of Contents\n \nand equity capital markets, broad trends in industry and finance, unemployment, tariffs or other anticipated changes in trade policy and other social, economic and political impacts of the incoming administration and the strength of the U.S. economy and the local economies in which Fifth Third operates, all of which are beyond Fifth Third’s control. Deterioration or continued weakness in any of these conditions could result in a decrease in demand for Fifth Third’s products and services.\nGlobal and domestic political, social and economic uncertainties and changes may adversely affect Fifth Third.\nGlobal financial markets, including the U.S., face political and economic uncertainties (such as recent budget deficit concerns and political conflict over legislation to raise the U.S. government’s debt limit) that may delay investment and hamper economic activity. International events such as trade disputes, separatist movements, leadership changes and political and military conflicts (such as the ongoing military tension between Russia and Ukraine and the conflict in Israel and Gaza) could adversely affect global financial activity and markets and could negatively affect the U.S. economy. Worldwide financial markets have recently experienced periods of extraordinary disruption and volatility, which have been driven by geopolitical events that have resulted in heightened credit risk, reduced valuation of investments, decreased economic activity, heightened risk of cyber-attacks and inflation. Changes in trade policies by the U.S. or other countries, such as tariffs or retaliatory tariffs, may cause inflation which could impact the prices of products sold by the Bancorp’s borrowers and have the potential to reduce demand for their products impacting their profitability and making it difficult for its borrowers to repay their loans. Moreover, many companies have experienced reduced liquidity and uncertainty as to their ability to raise capital during such periods of market disruption and volatility. Additionally, in recent years, the FRB and other major central banks have removed or reduced monetary accommodation and raised interest rates (although offset by recent rate reductions), increasing the risk of recession and may also negatively impact asset values and credit spreads that were impacted by extraordinary monetary stimulus. These potential negative effects on financial markets and economic activity could lead to reduced revenues, increased costs, increased credit risks and volatile markets, could adversely impact Fifth Third’s ability to raise liquidity via money and capital markets and could negatively impact Fifth Third’s businesses, results of operations and financial condition. In the event that these conditions recur or result in a prolonged economic downturn, Fifth Third’s results of operations, financial position and/or liquidity could be materially and adversely affected. These market conditions may affect the Bancorp’s ability to access debt and equity capital markets. In addition, as a result of recent financial and political events, Fifth Third may face increased regulation. \nChanges in interest rates could affect Fifth Third’s income and cash flows\n.\nFifth Third’s income and cash flows depend to a great extent on the difference between the interest rates earned on interest-earning assets such as loans and investment securities and the interest rates paid on interest-bearing liabilities such as deposits and borrowings. These rates are highly sensitive to many factors that are beyond Fifth Third’s control, including general economic conditions in the U.S. or abroad and the policies of various governmental and regulatory agencies (in particular, the FRB). Changes in monetary policy, including changes in interest rates and inflation, could influence the origination of loans, the prepayment speed of loans, the purchase of investments, the generation of deposits and the rates received on loans and investment securities and paid on deposits or other sources of funding as well as customers’ ability to repay loans. For example, a tightening of the money supply by the FRB could reduce the demand for a borrower’s products and services. This could adversely affect the borrower’s earnings and ability to repay a loan, which could have a material adverse effect on Fifth Third’s financial condition and results of operations. The impact of these changes may be magnified if Fifth Third does not effectively manage the relative sensitivity of its assets and liabilities to changes in market interest rates. Fluctuations in these areas may adversely affect Fifth Third, its customers and its shareholders. Throughout 2022 and 2023, the Federal Reserve raised the federal funds rate to between 5.25% and 5.5% in an effort to curb inflation. Although the FRB reduced benchmark rates in the second half of 2024, they remain higher than in previous years, and the inflationary outlook in the U.S. is currently uncertain. To the extent inflation increases and market interest rates rise, the value of Fifth Third’s investment securities, particularly those that have fixed rates or longer maturities, could decrease. Persistent or increasing inflation could lead to the FRB reversing recent reductions in interest rates. Increasing rates would also increase debt service requirements for some of Fifth Third’s borrowers and may adversely affect those borrowers’ ability to pay as contractually obligated and could result in additional delinquencies or charge-offs. Further, any increase in market interest rates is likely to reduce Fifth Third’s loan origination volume, particularly refinance volume, and/or reduce its interest rate spread, which could have an adverse effect on Fifth Third’s profitability and results of operations. Conversely, a lowering in interest rates would likely further reduce the interest Fifth Third earns on loans and other earning assets. Fifth Third cannot predict the nature or timing of future changes in monetary policies or the precise effects that they may have on Fifth Third’s activities and financial results.\nChanges and trends in the capital markets may affect Fifth Third’s income and cash flows.\nFifth Third enters into and maintains trading and investment positions in the capital markets on its own behalf and manages investment positions on behalf of its customers. These investment positions include derivative financial instruments. The revenues and profits Fifth Third derives from managing proprietary and customer trading and investment positions are dependent on market prices. Market changes and trends may result in a decline in wealth and asset management revenue or investment or trading losses that may impact Fifth Third. Losses on behalf of its customers could expose Fifth Third to reputational issues, litigation, credit risks or loss of revenue from those clients and customers. Additionally, losses in Fifth Third’s trading and investment positions could lead to a loss with respect to those investments and may adversely affect Fifth Third’s income, cash flows and funding costs.\nFifth Third’s stock price is volatile.\nFifth Third’s stock price has been volatile in the past and several factors could cause the price to fluctuate substantially in the future. The price for shares of Fifth Third’s common stock may fluctuate significantly in the future, and these fluctuations may be unrelated to Fifth \n34 Fifth Third Bancorp \nTable of Contents\n \nThird’s performance. General market price declines or market volatility in the future could adversely affect the price for shares of Fifth Third’s common stock and the current market price of such shares may not be indicative of future market prices.\nFifth Third’s mortgage banking net revenue can be volatile from quarter to quarter.\nFifth Third earns revenue from the fees it receives for originating mortgage loans and for servicing mortgage loans. When rates rise, the demand for mortgage loans tends to fall, reducing the revenue Fifth Third receives from loan originations. At the same time, revenue from mortgage servicing rights (“MSRs”) can increase through increases in fair value. When rates fall, mortgage originations tend to increase and the value of MSRs tends to decline, also with some offsetting revenue effect. Even though the origination of mortgage loans can act as a “natural hedge,” the hedge is not perfect, either in amount or timing. For example, the negative effect on revenue from a decrease in the fair value of residential MSRs is immediate, but any offsetting revenue benefit from more originations and the MSRs relating to the new loans would accrue over time. It is also possible that even if interest rates were to fall, mortgage originations may also fall or any increase in mortgage originations may not be enough to offset the decrease in the MSRs value caused by the lower rates.\nFifth Third typically uses derivatives and other instruments to hedge its mortgage banking interest rate and price risks. Fifth Third generally does not hedge all of its risks and the fact that Fifth Third attempts to hedge any of the risks does not mean Fifth Third will be successful. Hedging is a complex process, requiring sophisticated models and constant monitoring. Fifth Third may use hedging instruments tied to U.S. Treasury rates, SOFR or other benchmarks that may not perfectly correlate with the value or income being hedged. Fifth Third could incur significant losses from its hedging activities. There may be periods where Fifth Third elects not to use derivatives and other instruments to hedge mortgage banking interest rate and price risks.\nSTRATEGIC RISKS\nIf Fifth Third does not respond to intense competition and rapid changes in the financial services industry or otherwise adapt to changing customer preferences, its financial performance may suffer.\nFifth Third’s ability to deliver strong financial performance and returns on investment to shareholders will depend in part on its ability to expand the scope of available financial services to meet the needs and demands of its customers. In addition to the challenge of competing against other banks in attracting and retaining customers for traditional banking services, Fifth Third’s competitors also include securities dealers, brokers, mortgage bankers, investment advisors and specialty finance, telecommunications, technology and insurance companies as well as large retailers who seek to offer one-stop financial services in addition to other products and services desired by consumers that may include services that banks have not been able or allowed to offer to their customers in the past or may not be currently able or allowed to offer. Many of these other firms may be significantly larger than Fifth Third and may have access to customers and financial resources that are beyond Fifth Third’s capability. Fifth Third competes with these firms with respect to capital, access to capital, revenue generation, products, services, transaction execution, innovation, reputation, talent and price.\nThis increasingly competitive environment is primarily a result of changes in customer preferences, regulation, changes in technology and product delivery systems, as well as the accelerating pace of consolidation among financial service providers. Rapidly changing technology and consumer preferences may require Fifth Third to effectively implement new technology-driven products and services in order to compete and meet customer demands. Fifth Third may not be able to do so or be successful in marketing these products and services to its customers. As a result, Fifth Third’s ability to effectively compete to retain or acquire new business may be impaired, and its business, financial condition or results of operations, may be adversely affected.\nFifth Third may make strategic investments and may expand an existing line of business or enter into new lines of business to remain competitive. If Fifth Third’s chosen strategies are not appropriate to allow Fifth Third to effectively compete or Fifth Third does not execute them in an appropriate or timely manner, Fifth Third’s business and results may suffer. Additionally, these strategies, products and lines of business may bring with them unforeseeable or unforeseen risks and may not generate the expected results or returns, which could adversely affect Fifth Third’s results of operations or future growth prospects and cause Fifth Third to fail to meet its stated goals and expectations.\nIndustry adoption of real-time payments networks could negatively impact financial performance through reductions in product profitability, increased liquidity reserves and the potential for increased fraud losses, among other risks.\nWith the launch of real-time payments networks, such as RTP® from The Clearing House and FedNow® from the Federal Reserve, instantaneous cash settlement capabilities are available 24 hours a day and 7 days a week. The implications of the new settlement capabilities are far reaching and have not yet significantly affected the banking industry. As market adoption increases, Fifth Third may be required to hold more liquidity reserves in cash to facilitate cash settlement activity outside of traditional business hours. Additionally, instantaneous settlement will likely reduce float benefits associated with providing deposit and banking services, as well as pose incremental fraud risk due to a reduced ability to reverse fraudulent transactions due to the speed of money movement.\nChanges in retail distribution strategies and consumer behavior may adversely impact Fifth Third’s investments in its bank premises and equipment and other assets and may lead to increased expenditures to change its retail distribution channel.\nFifth Third has significant investments in bank premises and equipment for its branch network including its 1,089 full-service banking centers and 102 properties that are developed or in the process of being developed as branches, as well as its retail work force and other branch banking assets. Advances in technology such as e-commerce, telephone, internet and mobile banking and in-branch self-service technologies \n35 Fifth Third Bancorp\nTable of Contents\n \nincluding automatic teller machines and other equipment, as well as changing work arrangements and customer preferences for these other methods of accessing Fifth Third’s products and services, could affect the value of Fifth Third’s branch network or other retail distribution assets and may cause it to change its retail distribution strategy, close and/or sell certain branches or parcels of land held for development and restructure or reduce its remaining branches and work force. Further advances in technology and/or changes in customer preferences could have additional changes in Fifth Third’s retail distribution strategy and/or branch network. These actions could lead to losses on these assets or could adversely impact the carrying value of other long-lived assets and may lead to increased expenditures to renovate and reconfigure remaining branches or to otherwise reform its retail distribution channel.\nDifficulties in identifying suitable opportunities or combining the operations of acquired entities or assets with Fifth Third’s own operations or assessing the effectiveness of businesses in which Fifth Third makes strategic investments or with which Fifth Third enters into strategic contractual relationships may prevent Fifth Third from achieving the expected benefits from these acquisitions, investments or relationships.\nInherent uncertainties exist when assessing, acquiring or integrating the operations of another business or investment or relationship opportunity. Fifth Third may not be able to fully achieve its strategic objectives and planned operating efficiencies relevant to an acquisition or strategic relationship. In addition, the markets and industries in which Fifth Third and its potential acquisition and investment targets operate are highly competitive. Acquisition or investment targets may lose customers or otherwise perform poorly or unprofitably, or in the case of an acquired business or strategic relationship, cause Fifth Third to lose customers or perform poorly or unprofitably. Future acquisition and investment activities and efforts to monitor newly acquired businesses or reap the benefits of a new strategic relationship may require Fifth Third to devote substantial time and resources and may cause these acquisitions, investments and relationships to be unprofitable or cause Fifth Third to be unable to pursue other business opportunities.\nAfter completing an acquisition, Fifth Third may find that certain material information was not adequately disclosed during the due diligence process or that certain items were not accounted for properly in accordance with financial accounting and reporting standards. Fifth Third may also not realize the expected benefits of the acquisition due to lower financial results pertaining to the acquired entity or assets. For example, Fifth Third could experience higher charge-offs than originally anticipated related to the acquired loan portfolio. Additionally, acquired companies or businesses may increase Fifth Third’s risk of regulatory action or restrictions related to the operations of the acquired business.\nFuture acquisitions may dilute current shareholders’ ownership of Fifth Third and may cause Fifth Third to become more susceptible to adverse economic events.\nFuture business acquisitions could be material to Fifth Third and it may issue additional shares of stock to pay for those acquisitions, which would dilute current shareholders’ ownership interests. Acquisitions also could require Fifth Third to use substantial cash or other liquid assets or to incur debt. In those events, Fifth Third could become more susceptible to economic downturns, dislocations in capital markets and competitive pressures.\nFifth Third may sell or consider selling one or more of its businesses or investments. Should it determine to sell such a business or investment, it may not be able to generate gains on sale or related increases in shareholders’ equity commensurate with desirable levels. Moreover, if Fifth Third sold such businesses or investments, the loss of income could have an adverse effect on its earnings and future growth.\nFifth Third owns, or owns a minority stake in, as applicable, several businesses, investments and other assets that, in the future, may no longer be aligned with Fifth Third’s strategic plans or regulatory expectations. If Fifth Third were to sell one or more of its businesses or investments, it would be subject to market forces that may affect the timing or pricing of such sale or result in an unsuccessful sale. If Fifth Third were to complete the sale of any of its businesses, investments and/or interests in third parties, it would lose the income from the sold businesses and/or interests, including those accounted for under the equity method of accounting, and such loss of income could have an adverse effect on its future earnings and growth. Additionally, Fifth Third may encounter difficulties in separating the operations of any businesses it sells, which may affect its business or results of operations.\nFifth Third has businesses other than banking that are subject to a variety of risks.\nFifth Third is a diversified financial services company. As a result, the Bancorp is subject to additional risks and uncertainties. Other businesses that the Bancorp operates include investment banking, securities underwriting and market making, investment management and retail and institutional brokerage services offered through the Bancorp’s subsidiaries. These business activities are subject to rigorous regulatory oversight by federal, state and self-regulatory entities, and may incur substantial market, operational, credit, regulatory, legal and other risks that could adversely impact the Bancorp’s results of operations. For more information, refer to Regulation and Supervision—Regulatory Regime for Derivatives in Item 1 of this Annual Report on Form 10-K.\nREPUTATION RISKS\nDamage to Fifth Third’s reputation could harm its business.\nFifth Third’s actual or alleged conduct in activities, such as certain sales and lending practices, data security, operational resiliency, corporate governance and acquisitions, inappropriate behavior or misconduct of employees, failure to deliver minimum or required standards of service or quality, association with particular customers, business partners, investments or vendors, as well as developments from any of the other \n36 Fifth Third Bancorp \nTable of Contents\n \nrisks described above, may result in negative public opinion at large (or with certain segments of the public) and may damage Fifth Third’s reputation. Because Fifth Third conducts most of its businesses under the “Fifth Third” brand, negative public opinion about one business could affect its other businesses. Actions taken by government regulators, shareholder activists and community organizations may also damage Fifth Third’s reputation. Additionally, whereas negative public opinion once was primarily driven by adverse news coverage in traditional media, the advent and expansion of social media facilitates the rapid dissemination of information or misinformation. Though Fifth Third monitors social media channels, the potential remains for rapid and widespread dissemination of inaccurate, misleading or false information or other negative information that could damage Fifth Third’s reputation. Negative public perception can adversely affect Fifth Third’s ability to attract and keep customers and can increase the risk that it will be a target of litigation and regulatory action or experience an accelerated deposits withdrawal event.\nFifth Third is subject to environmental, social and governance risks that could adversely affect its reputation, the trading price of its common stock and/or its business, operations and earnings.\nThere is continued focus, including from governmental organizations, regulators, investors, customers and other stakeholders, on environmental, social, governance and sustainability issues. Laws and regulations related to these issues continue to evolve. These laws and regulations may impose additional compliance or disclosure obligations on us. Failure to adapt to or comply with regulatory requirements or investor or stakeholder expectations and standards could negatively impact Fifth Third’s reputation, ability to do business with certain partners, access to capital and its stock price. Organizations that provide information to investors and shareholders on corporate governance and related matters have developed scores and ratings to evaluate companies on their approach to these matters, and unfavorable ratings of Fifth Third may lead to negative investor sentiment and negative publicity in traditional and social media, including based on the identity of those Fifth Third chooses to do business with and the public’s view of those customers. \nWhile Fifth Third has sustainability and corporate responsibility initiatives, there can be no assurance that regulators, customers, investors and employees will determine that these programs are sufficiently robust. Actual or perceived shortcomings with respect to these initiatives and reporting can impact Fifth Third’s ability to hire and retain employees, increase its customer base or attract and retain certain types of investors. Collecting, measuring, and reporting on this information and metrics can be costly, difficult and time consuming, is subject to evolving reporting standards and can present numerous operational, reputational, financial, legal and other risks, any of which could have a material impact, including on Fifth Third’s reputation and stock price. Inadequate processes to collect and review this information prior to disclosure could be subject to potential liability related to such information.\nActivists have historically targeted financial firms with public criticism for their relationships with clients that are engaged in certain industries (such as those which are carbon intensive), including businesses whose products are or are perceived to be harmful to health, the environment, the global climate or the social good. Activist criticism of Fifth Third’s relationships or due diligence practices with clients in sensitive industries could potentially engender dissatisfaction among stakeholders with how Fifth Third addresses environmental or social concerns through business activities or disclosures which could negatively affect its business or reputation. \nConversely, states throughout the Bank’s footprint have taken actions or proposed measures to limit the state’s ability to do business with financial institutions or other businesses identified as discriminating against certain industries (such as those which are carbon intensive) or practices based on environmental or social criteria. Additionally, other activist groups and state officials have in the past targeted firms with public criticism and penalties for engaging in, or adhering to, certain environmental, social or governance practices or principles. Although Fifth Third has a defined risk-based approach for client selection, Fifth Third could be inherently exposed to reputational, financial and legal risk, and its ability to retain and attract customers and employees may be negatively impacted as a result of these contrasting arguments in how a financial institution should address these issues.\nGENERAL BUSINESS RISKS\nChanges in accounting standards or interpretations could impact Fifth Third’s reported earnings and financial condition.\nThe accounting standard setters, including the FASB, the SEC and other regulatory agencies, periodically change the financial accounting and reporting standards that govern the preparation of Fifth Third’s consolidated financial statements. These changes can be hard to predict and can materially impact how Fifth Third records and reports its financial condition and results of operations. In some cases, Fifth Third could be required to apply a new or revised standard retroactively, which would result in the recasting of Fifth Third’s prior period financial statements.\nFifth Third uses models for business planning purposes that may not adequately predict future results.\nFifth Third uses financial models to aid in its planning for various purposes including its capital and liquidity needs and other purposes. The models used may not accurately account for all variables, may fail to predict outcomes accurately and/or may overstate or understate certain effects. As a result of these potential failures, Fifth Third may not adequately prepare for future events and may suffer losses or other setbacks due to these failures.\nAlso, information Fifth Third provides to the public or to its regulators based on models could be inaccurate or misleading due to inadequate design or implementation, for example. Decisions that its regulators make, including those related to capital distributions to its shareholders, could be affected adversely due to the perception that the models used to generate the relevant information are unreliable or inadequate.\n37 Fifth Third Bancorp\nTable of Contents\n \nFifth Third’s framework for managing risks may not be effective in mitigating its risk and loss.\nFifth Third’s risk management framework seeks to mitigate risk and loss. Fifth Third has established processes and procedures intended to identify, measure, monitor, report and manage the types of risk to which it is exposed, including liquidity risk, credit risk, interest rate risk, price risk, legal and regulatory compliance risk, strategic risk, reputational risk and operational risk related to its employees, systems and vendors, among others. Fifth Third also considers the physical and transition risks arising from climate change to be transverse risk drivers that impact all of these material risks and has therefore integrated climate risk considerations into its risk management framework. Any system of control and any system to reduce risk exposure, however well designed and operated, is based in part on certain assumptions and can provide only reasonable, not absolute, assurances that the objectives of the system are met. A failure in Fifth Third’s internal controls could have a significant negative impact not only on its earnings, but also on the perception that customers, regulators and investors may have of Fifth Third. Fifth Third continues to devote a significant amount of effort, time and resources to improving its controls and ensuring compliance with complex regulations, and overall safety and soundness.\nAdditionally, instruments, systems and strategies used to hedge or otherwise manage exposure to various types of interest rate, price, legal and regulatory compliance, credit, liquidity, operational and business risks and enterprise-wide risk could be less effective than anticipated. As a result, Fifth Third may not be able to effectively mitigate its risk exposures in particular market environments or against particular types of risk. If Fifth Third’s risk management framework proves ineffective, Fifth Third could incur litigation costs, negative regulatory consequences, reputational damages among other adverse consequences and Fifth Third could suffer unexpected losses that may affect its financial condition or results of operations.\nThe preparation of financial statements requires Fifth Third to make subjective determinations and use estimates that may vary from actual results and materially impact its results of operations or financial position.\nThe preparation of consolidated financial statements in conformity with U.S. GAAP requires management to make significant estimates that affect the financial statements. If new information arises that results in a material change to a reserve amount, such a change could result in a change to previously announced financial results. Refer to the Critical Accounting Policies section of Management’s Discussion and Analysis of Financial Condition and Results of Operations for more information regarding management’s significant estimates.\nSocietal responses to climate change could adversely affect Fifth Third’s business and performance, including indirectly through impacts on Fifth Third’s customers.\nConcerns over the long-term impacts of climate change have led and may continue to lead to governmental efforts around the world to mitigate those impacts. Consumers and businesses also may change their behavior on their own as a result of these concerns. Fifth Third and its customers will need to respond to new laws and regulations, as well as consumer and business preferences resulting from climate change concerns. Fifth Third and its customers may face cost increases, asset value reductions, operating process changes, and the like. The impact on Fifth Third’s customers will likely vary depending on their specific attributes, including reliance on or role in carbon intensive activities that may be negatively affected by economic transition towards a lower-carbon economy. Further, the effects of a disorderly transition may vary from those of an orderly transition. Fifth Third could experience a drop in demand for its products and services, particularly in certain sectors or geographies. In addition, Fifth Third could face reductions in creditworthiness on the part of some customers or in the value of assets securing loans. Fifth Third’s efforts to take these risks into account in making lending and other decisions, including by increasing business relationships with climate-resilient companies, may not be effective in protecting Fifth Third from the negative impact of new laws and regulations or changes in consumer or business behavior.\nBank failures may create significant market volatility and regulatory uncertainty which could have a material adverse effect on Fifth Third’s business and financial condition.\nThe U.S. government has adopted or proposed a variety of measures and new regulations, including modifications to liquidity, long-term debt and capital requirements, enhancing existing stress testing frameworks, and may include additional special assessments to recover losses to the DIF. \nIf enhanced levels of scrutiny and escalation from its regulators continues, it could negatively impact Fifth Third’s business activities as its regulators perform reviews of, among other things, its liquidity, capital, stress testing and risk management programs and may require Fifth Third to enhance its liquidity position and take other steps regarding risk management. \n38 Fifth Third Bancorp \nTable of Contents",
    "item1b": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nThere are no SEC staff comments regarding the Bancorp’s periodic or current reports under the Exchange Act that are pending resolution."
  }
}