{
  "ticker": "FOX",
  "cik": "0001754301",
  "company_name": "Fox Corp",
  "filing_date": "2025-08-06",
  "accession": "0001628280-25-038077",
  "primary_doc": "fox-20250630.htm",
  "item_sections": {
    "item1": "Item 1. “Business” and",
    "item1a": "Item 1A. “Risk Factors” in this Annual Report.\nForward-looking statements in this Annual Report speak only as of the date hereof, and forward-looking statements in documents that are incorporated by reference hereto speak only as of the date of those documents. The Company does not undertake any obligation to update or release any revisions to any forward-looking statement made herein or to report any events or circumstances after the date hereof or to reflect the occurrence of unanticipated events or to conform such statements to actual results or changes in our expectations, except as required by law\n.\nITEM 7A.    QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nThe Company has exposure to two types of market risk: changes in interest rates and stock prices. The Company neither holds nor issues financial instruments for trading purposes.\n49\nThe following sections provide quantitative and qualitative information on the Company’s exposure to interest rate risk and stock price risk. The Company makes use of sensitivity analyses that are inherently limited in estimating actual losses in fair value that can occur from changes in market conditions.\nInterest Rates\nThe Company’s current financing arrangements and facilities include $6.7 billion of outstanding fixed-rate debt, before adjustments for unamortized discount and debt issuance costs (See Note 9—Borrowings to the accompanying Financial Statements).\nFixed and variable-rate debts are impacted differently by changes in interest rates. A change in the interest rate or yield of fixed-rate debt will only impact the fair market value of such debt, while a change in the interest rate of variable-rate debt will impact interest expense, as well as the amount of cash required to service such debt. As of June 30, 2025, all the Company’s financial instruments with exposure to interest rate risk were denominated in U.S. dollars and no variable-rate debt was outstanding. Information on financial instruments with exposure to interest rate risk is presented below:\n \nAs of June 30, \n \n2025\n2024\n \n(in millions) \nFair Value\n \n \nBorrowings: liability\n$\n6,625 \n$\n7,017 \nSensitivity Analysis\nPotential change in fair values resulting from a 10% adverse change in quoted interest rates\n$\n258 \n$\n297 \nStock Prices\nThe Company has common stock investments in publicly traded companies that are subject to market price volatility. Information on the Company’s investments with exposure to stock price risk is presented below:\n \nAs of June 30, \n \n2025\n2024\n \n(in millions) \nFair Value\n \n \nTotal fair value of common stock investments\n$\n1,249 \n$\n797 \nSensitivity Analysis\n \nPotential change in fair values resulting from a 10% adverse change in quoted market prices\n$\n(125)\n$\n(80)\nConcentrations of Credit Risk\nSee Note 2—Summary of Significant Accounting Policies to the accompanying Financial Statements under the heading “Concentrations of Credit Risk.”\n50\nITEM 8.    FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA \nFOX CORPORATION \nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\n \nPage\nManagement’s Report on Internal Control Over Financial Reporting\n52\nReports of Independent Registered Public Accounting Firm\n (PCAOB ID: \n42\n)\n53\nConsolidated Statements of Operations for the fiscal years ended June 30, 2025, 2024 and 2023\n57\nConsolidated Statements of Comprehensive Income for the fiscal years ended June 30, 2025, 2024 and 2023\n58\nConsolidated Balance Sheets as of June 30, 2025 and 2024\n59\nConsolidated Statements of Cash Flows for the fiscal years ended June 30, 2025, 2024 and 2023\n60\nConsolidated Statements of Equity for the fiscal years ended June 30, 2025, 2024 and 2023\n61\nNotes to the Consolidated Financial Statements\n62\n51\nMANAGEMENT’S REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nManagement of Fox Corporation is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act of 1934, as amended. The Company’s internal control over financial reporting includes those policies and procedures that:\n•\npertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of Fox Corporation;\n•\nprovide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with accounting principles generally accepted in the United States of America;\n•\nprovide reasonable assurance that receipts and expenditures of Fox Corporation are being made only in accordance with authorization of management and directors of Fox Corporation; and\n•\nprovide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of assets that could have a material effect on the consolidated financial statements.\nFox Corporation’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States of America. Because of its inherent limitations, internal control over financial reporting, no matter how well designed, may not prevent or detect misstatements. Also, the assessment of the effectiveness of internal control over financial reporting was made as of a specific date. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagement, including the Company’s principal executive officer and principal financial officer, conducted an evaluation of the effectiveness of Fox Corporation’s internal control over financial reporting as of June 30, 2025, based on the framework set forth in “Internal Control — Integrated Framework” issued by the Committee of Sponsoring Organizations of the Treadway Commission in 2013. Based on this evaluation, management determined that, as of June 30, 2025, Fox Corporation maintained effective internal control over financial reporting.\nErnst & Young LLP, the independent registered public accounting firm who audited and reported on the Consolidated Financial Statements of Fox Corporation included in the Annual Report on Form 10-K for the fiscal year ended June 30, 2025, has audited the Company’s internal control over financial reporting. Their report appears on the following page.\n52\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the \nStockholders and the Board of Directors\n of Fox Corporation:\nOpinion on Internal Control Over Financial Reporting\nWe have audited Fox Corporation’s internal control over financial reporting as of June 30, 2025, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Fox Corporation (the Company) maintained, in all material respects, effective internal control over financial reporting as of June 30, 2025, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of June 30, 2025 and 2024, the related consolidated statements of operations, comprehensive income, equity and cash flows for each of the three years in the period ended June 30, 2025, and the related notes and our report dated August 6, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ \nErnst & Young LLP\nNew York, New York\nAugust 6, 2025\n53\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and the Board of Directors of Fox Corporation:\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Fox Corporation (the Company) as of June 30, 2025 and 2024, the related consolidated statements of operations, comprehensive income, equity and cash flows for each of the three years in the period ended June 30, 2025, and the related notes (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at June 30, 2025 and 2024, and the results of its operations and its cash flows for each of the three years in the period ended June 30, 2025, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of June 30, 2025, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated\n \nAugust 6, 2025\n expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\n54\nProgram rights amortization – National sports programming\nDescription of the Matter\nAs disclosed in Note 2 to the consolidated financial statements, the Company has single and multi-year contracts for national sports programming. The costs of multi-year sports contracts at the Company are primarily amortized based on the ratio of each contract’s current period's attributable revenue to the estimated total remaining attributable revenue. \nAuditing the amortization of the Company’s national sports programming involved subjective estimation and complex auditor judgment because amortization of this programming is based on estimates of future revenues from the programming. Differing estimates of future revenues could materially affect the timing of sports programming amortization.\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design and tested the operating effectiveness of internal controls that address the risks of material misstatement relating to the amortization of the Company’s national sports programming, including controls over management’s review of the amortization analysis and the significant assumptions used to develop the estimated future revenues. We also tested management’s controls to validate that the data used in the analysis was complete and accurate.\nAmong other audit procedures performed, we evaluated the significant assumptions used by the Company to estimate future revenues and tested the completeness and accuracy of the underlying data used in the analysis. For example, we evaluated management’s forecasts of estimated future revenues by performing a look-back analysis of management’s historical estimates compared to actual results. We also performed a sensitivity analysis of the estimated future revenues to evaluate the change in the amortization of the Company’s national sports programming resulting from changes in the assumptions.\n \nDefamation and disparagement claims\nDescription of the Matter\nAs disclosed in Note 14 to the consolidated financial statements, the Company and its news businesses and their employees are subject to lawsuits alleging defamation or disparagement. The Company records a liability for those legal proceedings when management determines it is probable that a loss has been incurred and the amount of the loss can be reasonably estimated. The Company also discloses when it is reasonably possible that a material loss may be incurred. The Company continues to believe the pending lawsuits alleging defamation or disparagement are without merit and intends to defend against them vigorously, including through any appeals. The Company is unable to predict the final outcome of these matters and has determined that a loss is neither probable nor reasonably estimable. \nAccounting for contingencies related to defamation and disparagement claims requires management to make significant judgments to determine the likelihood of a loss and if necessary, the estimate of the amount or range of loss related to such matters. Auditing management’s accounting for and disclosure of these matters involves complex auditor judgment in assessing the Company’s evaluation of the probability of a loss, and the estimated amount or range of loss.\n55\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design and tested the operating effectiveness of internal controls that address the risks of material misstatement relating to management’s evaluation of defamation and disparagement claims, including controls over determining whether a loss is probable and whether the amount of loss can be reasonably estimated, as well as financial statement disclosures. \nAmong other audit procedures, we tested management’s evaluation of the probability of outcome and range of loss, if estimable, through inspection of responses to inquiry letters sent to both internal and external legal counsel, discussions with internal legal counsel to confirm our understanding of the allegations and related merits, and by obtaining written representations from executives of the Company. In addition, we evaluated the adequacy of financial disclosures.\n/s/ Ernst & Young LLP\nWe have served as the Company's auditor since 2018.\nNew York, New York\nAugust 6, 2025\n56\nFOX CORPORATION\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(IN MILLIONS, EXCEPT PER SHARE AMOUNTS)\n \nFor the years ended June 30, \n2025\n2024\n2023\nRevenues\n$\n16,300\n \n$\n13,980\n \n$\n14,913\n \nOperating expenses\n(\n10,518\n)\n(\n9,089\n)\n(\n9,689\n)\nSelling, general and administrative\n(\n2,168\n)\n(\n2,024\n)\n(\n2,049\n)\nDepreciation and amortization\n(\n385\n)\n(\n389\n)\n(\n411\n)\nRestructuring, impairment and other corporate matters\n(\n350\n)\n(\n67\n)\n(\n1,182\n)\nEquity (losses) earnings of affiliates\n(\n29\n)\n(\n44\n)\n4\n \nInterest expense, net\n(\n227\n)\n(\n216\n)\n(\n218\n)\nNon-operating other, net\n438\n \n(\n47\n)\n368\n \nIncome before income tax expense\n3,061\n \n2,104\n \n1,736\n \nIncome tax expense\n(\n768\n)\n(\n550\n)\n(\n483\n)\nNet income\n2,293\n \n1,554\n \n1,253\n \nLess: Net income attributable to noncontrolling interests\n(\n30\n)\n(\n53\n)\n(\n14\n)\nNet income attributable to Fox Corporation stockholders\n$\n2,263\n \n$\n1,501\n \n$\n1,239\n \nEARNINGS PER SHARE DATA\nNet income attributable to Fox Corporation stockholders per share:\nBasic\n$\n4.97\n \n$\n3.14\n \n$\n2.34\n \nDiluted\n$\n4.91\n \n$\n3.13\n \n$\n2.33\n \nThe accompanying notes are an integral part of these Consolidated Financial Statements.\n57\nFOX CORPORATION\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(IN MILLIONS)\nFor the years ended June 30,\n2025\n2024\n2023\nNet income\n$\n2,293\n \n$\n1,554\n \n$\n1,253\n \nOther comprehensive (loss) income, net of tax:\nBenefit plan adjustments and other\n(\n17\n)\n42\n \n77\n \nOther comprehensive (loss) income, net of tax\n(\n17\n)\n42\n \n77\n \nComprehensive income\n2,276\n \n1,596\n \n1,330\n \nLess: Net income attributable to noncontrolling interests\n(a)\n(\n30\n)\n(\n53\n)\n(\n14\n)\nComprehensive income attributable to Fox Corporation stockholders\n$\n2,246\n \n$\n1,543\n \n$\n1,316\n \n(a)\nNet income attributable to noncontrolling interests includes $(\n1\n) million, $(\n1\n) million and $(\n16\n) million for the fiscal years ended June 30, 2025, 2024 and 2023, respectively, relating to redeemable noncontrolling interests.\nThe accompanying notes are an integral part of these Consolidated Financial Statements.\n58\nFOX CORPORATION\nCONSOLIDATED BALANCE SHEETS\n(IN MILLIONS, EXCEPT SHARE AND PER SHARE AMOUNTS)\nAs of June 30, \n2025\n2024\nASSETS\nCurrent assets\nCash and cash equivalents\n$\n5,351\n \n$\n4,319\n \nReceivables, net\n2,472\n \n2,364\n \nInventories, net\n432\n \n626\n \nOther\n174\n \n192\n \nTotal current assets\n8,429\n \n7,501\n \nNon-current assets\nProperty, plant and equipment, net\n1,705\n \n1,696\n \nIntangible assets, net\n2,969\n \n3,038\n \nGoodwill\n3,639\n \n3,544\n \nDeferred tax assets\n2,721\n \n2,878\n \nOther non-current assets\n3,732\n \n3,315\n \nTotal assets\n$\n23,195\n \n$\n21,972\n \nLIABILITIES AND EQUITY\nCurrent liabilities\nBorrowings\n$\n—\n \n$\n599\n \nAccounts payable, accrued expenses and other current liabilities\n2,897\n \n2,353\n \nTotal current liabilities\n2,897\n \n2,952\n \nNon-current liabilities\nBorrowings\n6,602\n \n6,598\n \nOther liabilities\n1,341\n \n1,366\n \nRedeemable noncontrolling interests\n288\n \n242\n \nCommitments and contingencies\nEquity\nClass A Common Stock\n(a)\n2\n \n2\n \nClass B Common Stock\n(b)\n2\n \n2\n \nAdditional paid-in capital\n7,603\n \n7,678\n \nRetained earnings\n4,479\n \n3,139\n \nAccumulated other comprehensive loss\n(\n124\n)\n(\n107\n)\nTotal Fox Corporation stockholders’ equity\n11,962\n \n10,714\n \nNoncontrolling interests\n105\n \n100\n \nTotal equity\n12,067\n \n10,814\n \nTotal liabilities and equity\n$\n23,195\n \n$\n21,972\n \n(a)\nClass A Common Stock\n, $\n0.01\n par value per share, \n2,000,000,000\n shares authorized, \n210,754,900\n shares and \n225,727,598\n shares issued and outstanding at par as of June 30, 2025 and 2024, respectively.\n(b)\nClass B Common Stock\n, $\n0.01\n par value per share, \n1,000,000,000\n shares authorized, \n235,581,025\n shares issued and outstanding at par as of June 30, 2025 and 2024.\nThe accompanying notes are an integral part of these Consolidated Financial Statements.\n59\nFOX CORPORATION \nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(IN MILLIONS)\nFor the years ended June 30, \n2025\n2024\n2023\nOPERATING ACTIVITIES\n \n \n \nNet income\n$\n2,293\n \n$\n1,554\n \n$\n1,253\n \nAdjustments to reconcile net income to net cash provided by operating activities\nDepreciation and amortization\n385\n \n389\n \n411\n \nAmortization of cable distribution investments\n10\n \n16\n \n16\n \nRestructuring, impairment and other corporate matters\n267\n \n67\n \n367\n \nEquity-based compensation\n135\n \n90\n \n74\n \nEquity losses (earnings) of affiliates\n29\n \n44\n \n(\n4\n)\nCash distributions received from affiliates\n13\n \n—\n \n—\n \nNon-operating other, net\n(\n438\n)\n47\n \n(\n368\n)\nDeferred income taxes\n164\n \n203\n \n321\n \nChange in operating assets and liabilities, net of acquisitions and dispositions\nReceivables and other assets\n(\n95\n)\n(\n172\n)\n(\n104\n)\nInventories net of programming payable\n521\n \n(\n303\n)\n145\n \nAccounts payable and accrued expenses\n89\n \n(\n1\n)\n(\n68\n)\nOther changes, net\n(\n49\n)\n(\n94\n)\n(\n243\n)\nNet cash provided by operating activities\n3,324\n \n1,840\n \n1,800\n \nINVESTING ACTIVITIES\nProperty, plant and equipment\n(\n331\n)\n(\n345\n)\n(\n357\n)\nAcquisitions, net of cash acquired\n(\n97\n)\n—\n \n—\n \nPurchase of investments\n(\n79\n)\n(\n103\n)\n(\n54\n)\nOther investing activities, net\n(\n30\n)\n(\n4\n)\n(\n27\n)\nNet cash used in investing activities\n(\n537\n)\n(\n452\n)\n(\n438\n)\nFINANCING ACTIVITIES\nRepurchase of shares \n(\n1,000\n)\n(\n1,000\n)\n(\n2,000\n)\nRepayment of borrowings\n(\n600\n)\n(\n1,250\n)\n—\n \nBorrowings\n—\n \n1,232\n \n—\n \nDividends paid and distributions\n(\n277\n)\n(\n281\n)\n(\n299\n)\nSale of subsidiary noncontrolling interest\n—\n \n—\n \n35\n \nOther financing activities, net\n122\n \n(\n42\n)\n(\n26\n)\nNet cash used in financing activities\n(\n1,755\n)\n(\n1,341\n)\n(\n2,290\n)\nNet increase (decrease) in cash and cash equivalents\n1,032\n \n47\n \n(\n928\n)\nCash and cash equivalents, beginning of year\n4,319\n \n4,272\n \n5,200\n \nCash and cash equivalents, end of year\n$\n5,351\n \n$\n4,319\n \n$\n4,272\n \nThe accompanying notes are an integral part of these Consolidated Financial Statements.\n60\nFOX CORPORATION \nCONSOLIDATED STATEMENTS OF EQUITY\n(IN MILLIONS)\n \nClass A \nClass B\nAdditional \nPaid-in \nCapital\nRetained \nEarnings \nAccumulated\nOther \nComprehensive \nLoss\nTotal Fox\nCorporation\nStockholders’ \nEquity \nNoncontrolling \nInterests\n(a)\n \nTotal Equity \n \nCommon Stock \nCommon Stock\n \nShares \nAmount \nShares \nAmount\nBalance, June 30, 2022\n308\n \n$\n3\n \n243\n \n$\n3\n \n$\n9,098\n \n$\n2,461\n \n$\n(\n226\n)\n$\n11,339\n \n$\n36\n \n$\n11,375\n \nNet income\n— \n— \n— \n— \n— \n1,239\n \n— \n1,239\n \n30\n \n1,269\n \nOther comprehensive income\n— \n— \n— \n— \n— \n— \n77\n \n77\n \n— \n77\n \nDividends\n— \n— \n— \n— \n— \n(\n265\n)\n— \n(\n265\n)\n— \n(\n265\n)\nShares repurchased\n(\n46\n)\n— \n(\n8\n)\n— \n(\n891\n)\n(\n1,123\n)\n— \n(\n2,014\n)\n— \n(\n2,014\n)\nOther\n1\n \n— \n— \n(\n1\n)\n46\n \n(\n43\n)\n— \n2\n \n1\n \n3\n \nBalance, June 30, 2023\n263\n \n$\n3\n \n235\n \n$\n2\n \n$\n8,253\n \n$\n2,269\n \n$\n(\n149\n)\n$\n10,378\n \n$\n67\n \n$\n10,445\n \nNet income\n— \n— \n— \n— \n— \n1,501\n \n— \n1,501\n \n54\n \n1,555\n \nOther comprehensive income\n— \n— \n— \n— \n— \n— \n42\n \n42\n \n— \n42\n \nDividends\n— \n— \n— \n— \n— \n(\n250\n)\n— \n(\n250\n)\n— \n(\n250\n)\nShares repurchased\n(\n40\n)\n— \n— \n— \n(\n663\n)\n(\n347\n)\n— \n(\n1,010\n)\n— \n(\n1,010\n)\nOther\n3\n \n(\n1\n)\n— \n— \n88\n \n(\n34\n)\n— \n53\n \n(\n21\n)\n32\n \nBalance, June 30, 2024\n226\n \n$\n2\n \n235\n \n$\n2\n \n$\n7,678\n \n$\n3,139\n \n$\n(\n107\n)\n$\n10,714\n \n$\n100\n \n$\n10,814\n \nNet income\n— \n— \n— \n— \n— \n2,263\n \n— \n2,263\n \n31\n \n2,294\n \nOther comprehensive loss\n— \n— \n— \n— \n— \n— \n(\n17\n)\n(\n17\n)\n— \n(\n17\n)\nDividends\n— \n— \n— \n— \n— \n(\n246\n)\n— \n(\n246\n)\n— \n(\n246\n)\nShares repurchased\n(\n21\n)\n— \n— \n— \n(\n356\n)\n(\n654\n)\n— \n(\n1,010\n)\n— \n(\n1,010\n)\nOther\n6\n \n— \n— \n— \n281\n \n(\n23\n)\n— \n258\n \n(\n26\n)\n232\n \nBalance, June 30, 2025\n211\n \n$\n2\n \n235\n \n$\n2\n \n$\n7,603\n \n$\n4,479\n \n$\n(\n124\n)\n$\n11,962\n \n$\n105\n \n$\n12,067\n \n(a)\nExcludes Redeemable noncontrolling interests (See Note 6—Fair Value under the heading “Redeemable Noncontrolling Interests”).\nThe accompanying notes are an integral part of these Consolidated Financial Statements.\n61\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n \nNOTE 1. \nDESCRIPTION OF BUSINESS AND BASIS OF PRESENTATION\nFox Corporation (“FOX” or the “Company”) is a news, sports and entertainment company, which manages and reports its businesses in the following reportable segments: Cable Network Programming and Television.\nBasis of Presentation\nThe Company’s financial statements as of and for the years ended June 30, 2025, 2024 and 2023 are presented on a consolidated basis.\nThe Consolidated Financial Statements are referred to as the “Financial Statements” herein. The Consolidated Statements of Operations are referred to as the “Statements of Operations” herein. The Consolidated Statements of Comprehensive Income are referred to as the “Statements of Comprehensive Income” herein. The Consolidated Balance Sheets are referred to as the “Balance Sheets” herein. The Consolidated Statements of Cash Flows are referred to as the “Statements of Cash Flows” herein. The Consolidated Statements of Equity are referred to as the “Statements of Equity” herein.\nNOTE 2. \nSUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nPrinciples of Consolidation\nThe Financial Statements include the accounts of all majority-owned and controlled subsidiaries. In addition, the Company evaluates its relationships with other entities to identify whether they are variable interest entities and whether the Company is the primary beneficiary. Consolidation is required if both of these criteria are met. All significant intercompany accounts and transactions within the Company’s consolidated businesses have been eliminated in consolidation.\nAny change in the Company’s ownership interest in a consolidated subsidiary, where a controlling financial interest is retained, is accounted for as an equity transaction. When the Company ceases to have a controlling financial interest in a consolidated subsidiary, the Company recognizes a gain or loss in net income upon deconsolidation.\nThe Company’s fiscal year ends on June 30 (“fiscal”) of each year.\nReclassifications and Adjustments\nCertain fiscal 2024 and 2023 amounts have been reclassified to conform to the fiscal 2025 presentation.\nUse of Estimates\nThe preparation of the Company’s Financial Statements in conformity with U.S. generally accepted accounting principles (“GAAP”) requires management to make estimates and assumptions that affect the amounts that are reported in the Financial Statements and accompanying disclosures. Although these estimates are based on management’s best knowledge of current events and actions that the Company may undertake in the future, actual results may differ from those estimates.\nCash and Cash Equivalents\nCash and cash equivalents consist of cash on hand and marketable securities with original maturities of three months or less.\nReceivables\nReceivables are presented net of an allowance for credit losses, which is an estimate of amounts that may not be collectible. The allowance for credit losses is estimated based on historical experience, receivable aging, current expected collections, current economic trends and specific identification of certain receivables that are at risk of not being paid.\n62\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nReceivables, net consist of:\n \nAs of June 30, \n \n2025\n2024\n \n(in millions) \nTotal receivables\n$\n2,522\n \n$\n2,408\n \nAllowance for credit losses\n(\n50\n)\n(\n44\n)\nTotal receivables, net\n$\n2,472\n \n$\n2,364\n \nInventories\nLicensed and Owned Programming\nThe Company incurs costs to license programming rights and to produce owned programming. Licensed programming includes costs incurred by the Company for access to content owned by third parties. The Company has single and multi-year contracts for sports and non-sports programming. Licensed programming is recorded at the earlier of payment or when the license period has begun, the cost of the program is known or reasonably determinable and the program is accepted and available for airing. Advances paid for the right to broadcast sports events within one year and programming with an initial license period of one year or less are classified as current inventories included within Inventories, net in the Balance Sheets, and license fees for programming with an initial license period of greater than one year are classified as non-current inventories included within Other non-current assets in the Balance Sheets. Licensed programming is predominantly amortized as the associated programs are made available over the shorter of the license period or the period in which an economic benefit is expected to be derived. The costs of multi-year sports contracts are primarily amortized based on the ratio of each contract’s current period attributable revenue to the estimated total remaining attributable revenue. Estimates can change and, accordingly, are reviewed periodically and amortization is adjusted as necessary. Such changes in the future could be material.\nOwned programming, included within Other non-current assets in the Balance Sheets, includes content internally developed and produced as well as co-produced content. Capitalized costs for owned programming, including direct costs, production overhead and development costs, are predominantly amortized using the individual-film-forecast-computation method, which is based on the ratio of current period revenue to estimated total future remaining revenue, and related costs are expensed as incurred. Future remaining revenue includes imputed license fees for content used by FOX as well as revenue expected to be earned based on distribution strategy and historical performance of similar content. Changes to estimated future revenues may result in impairments or changes in amortization patterns. When production partners distribute owned programming on the Company’s behalf, the net participation in profits is recorded as content license revenue. Projects in-process are written off at the earlier of abandonment or three years after initial capitalization. The Company may receive government incentives in connection with the production of owned programming. The Company records government incentives as a reduction of capitalized costs for owned programming when the monetization of the incentive is probable, and as a receivable included within Other non-current assets in the Balance Sheets. Government incentives were not material in fiscal 2025, 2024 and 2023.\nInventories are evaluated for recoverability when an event or circumstance occurs that indicates that fair value may be less than unamortized costs. The Company will determine if there is an impairment by evaluating the fair value of the inventories, which are primarily supported by internal forecasts as compared to unamortized costs. Where an evaluation indicates unamortized costs, including advances on multi-year sports rights contracts, are not recoverable, amortization of rights is accelerated in an amount equal to the amount by which the unamortized costs exceed fair value. Owned programming is predominantly monetized and tested for impairment on an individual basis. Licensed programming is predominantly monetized as a group and tested for impairment on a channel, network, or daypart basis. The recoverability of certain sports rights is assessed on an aggregate basis.\nInvestments\nInvestments in and advances to entities or joint ventures in which the Company has significant influence over the investee’s operating and financial policies, but less than a controlling financial interest, are accounted \n63\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nfor using the equity method. Significant influence generally exists when the Company owns an interest between 20% and 50%. Additionally, investments in partnerships or limited liability companies are accounted for using the equity method when specific ownership accounts are maintained, unless the Company has virtually no influence over the investee’s operating and financial policies.\nEquity method investments are initially recorded at fair value and will increase as a result of additional contributions and will decrease as a result of cash distributions received from the equity method investee, amortization of identifiable intangible assets of the investee resulting from the transaction and impairments. Additionally, the Company’s share of the equity method investee’s net income or loss will increase and decrease the investment, respectively.\nEquity investments, including investments in equity securities, in which the Company has no significant influence (generally less than a 20% ownership interest) with readily determinable fair values are accounted for at fair value based on quoted market prices. Equity investments without readily determinable fair values are accounted for using the measurement alternative which is at cost minus impairment, if any, plus or minus changes resulting from observable price changes in orderly transactions for the identical or a similar investment of the same issuer. All gains and losses on investments in equity investments are recognized in the Statements of Operations.\nEquity method investments are reviewed for impairment by comparing their fair value to their respective carrying amounts when events or circumstances suggest that the carrying amount of the investment may be impaired. The Company determines the fair value of its private company investments by considering available information, including recent investee equity transactions, discounted cash flow analyses, estimates based on comparable public company operating multiples and, in certain situations, balance sheet liquidation values. If the fair value of the investment has dropped below the carrying amount, management considers several factors when determining whether an other-than-temporary decline in market value has occurred, including the length of time and extent to which the market value has been below cost, the financial condition and near-term prospects of the issuer of the security, the intent and ability of the Company to retain its investment in the issuer for a period of time sufficient to allow for an anticipated recovery in market value and other factors influencing the fair market value, such as general market conditions.\nThe Company regularly reviews equity investments not accounted for using the equity method or at fair value for impairment based on a qualitative assessment which includes, but is not limited to (i) significant deterioration in the earnings performance, credit rating, asset quality or business prospects of the investee, (ii) significant adverse changes in the regulatory, economic or technological environment of the investee and (iii) significant adverse changes in the general market condition of either the geographical area or the industry in which the investee operates. If an equity investment is impaired, an impairment loss is recognized in the Statements of Operations equal to the difference between the fair value of the investment and its carrying amount.\nProperty, Plant and Equipment\nProperty, plant and equipment are stated at cost. Depreciation is provided using the straight-line method over an estimated useful life of \nthree\n to \n40\n years for buildings and leaseholds and \nthree\n to \n10\n years for machinery and equipment. Leasehold improvements are amortized using the straight-line method over the shorter of their useful lives or the life of the lease. Costs associated with the repair and maintenance of property are expensed as incurred. Changes in circumstances, such as technological advances, or changes to the Company’s business model or capital strategy, could result in the actual useful lives differing from the Company’s estimates. In those cases where the Company determines that the estimated useful life of property, plant and equipment should be shortened, the Company depreciates the asset over its revised remaining useful life, thereby increasing depreciation expense.\nGoodwill and Other Intangible Assets\nThe Company’s intangible assets include goodwill, Federal Communications Commission (“FCC”) licenses, traditional and virtual multi-channel video programming distributor (“MVPD”) affiliate agreements and relationships, software and trademarks and other copyrighted products. Intangible assets other than goodwill acquired in business combinations are recorded at their estimated fair value at the date of acquisition. Goodwill \n64\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nis recorded as the difference between the consideration transferred to acquire entities and the estimated fair values assigned to their tangible and identifiable intangible net assets. Amounts recorded as goodwill are assigned to more than one reporting unit as of the acquisition date when more than one reporting unit is expected to benefit from the synergies of the combination. The Company’s goodwill and indefinite-lived intangible assets, which primarily consist of FCC licenses, are tested annually for impairment, or earlier if events occur or circumstances change that would more likely than not reduce the fair value below its carrying amount. The impairment assessment of indefinite-lived intangibles compares the fair value of the assets to their carrying value. Intangible assets with finite lives are generally amortized over their estimated useful lives. The weighted average original amortization period of amortizable intangible assets is approximately \n10\n years.\nAnnual Impairment Review\nGoodwill\nGoodwill is tested for impairment at the reporting unit level, which is an operating segment, or one level below. If the Company determines it is more likely than not that the fair value of a reporting unit is less than its carrying amount after a qualitative assessment, the Company performs a quantitative impairment test to compare the fair value of each reporting unit to its carrying amount, including goodwill. In performing the quantitative assessment, the Company determines the fair value of a reporting unit primarily by using discounted cash flow analysis and market-based valuation approach methodologies. Determining fair value requires the exercise of significant judgments, including judgments about appropriate discount rates, long-term growth rates, asset lives, market multiples and relevant comparable transactions, as applicable, and the amount and timing of expected future cash flows. The cash flows employed in the analyses are based on the Company’s estimated outlook and various growth rates have been assumed for years beyond the long-term business plan period. Discount rate assumptions are based on an assessment of the risk inherent in the future cash flows of the respective reporting units. In assessing the reasonableness of its determined fair values, the Company evaluates its results against other value indicators, such as comparable public company trading values. If the fair value of a reporting unit exceeds its carrying amount, goodwill of the reporting unit is not impaired. If the carrying amount of a reporting unit exceeds its fair value, an impairment loss is recognized in an amount equal to that excess, limited to the total amount of goodwill allocated to that reporting unit.\nFCC licenses\nThe Company performs impairment reviews by comparing the estimated fair value of the Company’s FCC licenses with their carrying amount on a market-by-market basis. Fair value is determined using a discounted cash flow valuation method, assuming a hypothetical start-up scenario for a broadcast station in each of the markets the Company operates in. This method also involves the use of management’s judgment in estimating appropriate terminal growth rates, operating margins and discount rates reflecting the risk of a market participant in the broadcast industry, as well as industry data on future advertising revenues in the markets where the Company owns television stations. The resulting fair values for FCC licenses are sensitive to these long-term assumptions and any adverse changes to the assumptions used could result in an impairment to existing carrying values in future periods and such impairment could be material.\nDuring fiscal 2025, the Company recorded a non-cash impairment charge for intangible assets of approximately $\n70\n million primarily related to FCC licenses in Restructuring, impairment and other corporate matters in the Statements of Operations within the Television segment. Based on the Company’s annual assessment, the carrying value of FCC licenses in certain markets exceeded their fair value primarily as a result of updated market data, including lower expected future advertising revenue. Additionally, the fair value of FCC licenses in certain markets exceeded their respective carrying value by less than \n10\n% as of June 30, 2025. An increase to the discount rate of \n0.5\n percentage points, or a decrease to the terminal growth rate of \n0.5\n percentage points, assuming no changes to other long-term assumptions, would cause the aggregate fair value of FCC licenses to fall below the aggregate carrying value by approximately $\n80\n million and $\n50\n million, respectively. Further adverse changes in market conditions may result in additional non-cash impairment charges.\nDuring fiscal 2025, the Company determined that the goodwill included in the Balance Sheets as of June 30, 2025 was not impaired based on the Company’s annual assessment and there are no reporting units at risk of impairment. While the Company believes its judgments represent reasonably possible outcomes \n65\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nbased on available facts and circumstances, adverse changes to the assumptions, including prevailing market conditions, discount rates, competitive factors, comparable public company trading values and expected future cash flows, could negatively impact the fair value of our reporting units and potentially result in a non-cash goodwill impairment charge in future periods. The Company will continue to monitor its goodwill and indefinite-lived intangible assets for any possible future non-cash impairment charges.\nLeases\nThe Company has lease agreements primarily for office facilities and other equipment. At contract inception, the Company determines if a contract is or contains a lease and, if so, whether it is an operating or finance lease. The Company does not separate lease components from nonlease components for real estate leases.\nFor operating leases that have a lease term of greater than one year, the Company initially recognizes operating lease liabilities and right-of-use (“ROU”) assets at the lease commencement date, which is the date that the lessor makes an underlying asset available for use by the Company. ROU assets represent the Company’s right to use an underlying asset for the lease term and lease liabilities represent the present value of the Company’s obligation to make lease payments, primarily escalating fixed payments, over the lease term. The discount rate used to determine the present value of the lease payments is generally the Company’s incremental borrowing rate because the rate implicit in the lease is generally not readily determinable. The incremental borrowing rate for the lease term is determined by adjusting the Company’s unsecured borrowing rate for a similar term to approximate a collateralized borrowing rate. The Company’s lease terms for each of its leases represents the noncancelable period for which the Company has the right to use an underlying asset, together with all of the following: (i) periods covered by an option to extend the lease if the Company is reasonably certain to exercise that option; (ii) periods covered by an option to terminate the lease if the Company is reasonably certain not to exercise that option; and (iii) periods covered by an option to extend (or not to terminate) the lease in which exercise of the option is controlled by the lessor. The Company recognizes lease expense for operating leases on a straight-line basis over the lease term.\nThe Company’s operating ROU assets are included in Other non-current assets and the Company’s current and non-current operating lease liabilities are included in Accounts payable, accrued expenses and other current liabilities and Other liabilities, respectively, in the Company’s Balance Sheets (See Note 20—Additional Financial Information).\nLong-Lived Asset Impairments\nThe Company periodically reviews the carrying amounts of its long-lived assets, including property, plant and equipment, ROU assets and finite-lived intangible assets, to determine whether current events or circumstances indicate that such carrying amounts may not be recoverable. If the carrying amount of the asset or asset group is greater than the expected undiscounted cash flows to be generated by such asset or asset group, an impairment adjustment is recognized and is measured as the amount by which the carrying value of such asset or asset group exceeds its fair value. The Company generally measures fair value by considering sale prices for similar assets or by discounting estimated future cash flows using an appropriate discount rate. Considerable management judgment is necessary to estimate the fair value of assets; accordingly, actual results could vary significantly from such estimates. Assets to be disposed of are carried at the lower of their financial statement carrying amount or fair value less their costs to sell.\nRevenue Recognition\nRevenue is recognized when control of the promised goods or services is transferred to the Company’s customers in an amount that reflects the consideration the Company expects to be entitled to in exchange for those goods or services. The Company considers the terms of each arrangement to determine the appropriate accounting treatment.\nThe Company generates advertising revenue from sales of commercial time within the Company’s network programming, and from sales of advertising on the Company’s owned and operated television stations and various digital properties. Advertising revenue from customers is recognized as the commercials are aired. Certain of the Company’s advertising contracts have guarantees of a certain number of targeted audience \n66\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nviews, referred to as impressions, where the performance obligation is the guarantee and revenue is recognized as the guarantee is satisfied. For contracts without guarantees, the individual advertising spots are the performance obligation and consideration is allocated based on its relative standalone selling price. Advertising contracts, which are generally short-term, are billed monthly for the spots aired during the month, with payments due shortly thereafter.\nThe Company generates affiliate fee revenue from agreements with MVPDs for cable network programming and for the broadcast of the Company’s owned and operated television stations. In addition, the Company generates affiliate fee revenue from agreements with independently owned television stations that are affiliated with the FOX Network and receives retransmission consent fees from MVPDs for their signals. Affiliate fee revenue is recognized as the Company satisfies the performance obligation by continuously making the programming available to the customer over the term of the agreement. For contracts with affiliate fees based on the number of the affiliate’s subscribers, revenues are recognized based on the contractual rate multiplied by the estimated number of subscribers each period. For contracts with fixed affiliate fees, revenues are recognized based on the relative standalone selling price of the network programming provided over the contract term, which generally reflects the invoiced amount. Affiliate contracts are generally multi-year contracts billed monthly with payments due shortly thereafter.\nThe Company classifies the amortization of cable distribution investments (capitalized fees paid to MVPDs to facilitate carriage of a cable network) against affiliate fee revenue. The Company amortizes the cable distribution investments on a straight-line basis over the contract period.\nOther revenue primarily includes revenue generated from the Company’s content licensing agreements and revenue from production services and rentals. Revenue from content licensing agreements is recognized when the content is made available under the content licensing agreements. Production services and rental revenues are recognized as the goods or services are delivered.\nAdvertising Expenses\nThe Company expenses advertising costs as incurred. The Company incurred advertising expenses of $\n694\n million, $\n646\n million and $\n680\n million for fiscal 2025, 2024 and 2023, respectively.\nIncome Taxes\nThe Company uses an asset and liability approach for financial accounting and reporting for income taxes. Under this approach, deferred taxes are provided for the net tax effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes. Valuation allowances are established where management determines that it is more likely than not that some portion or all of a deferred tax asset will not be realized.\nEarnings Per Share\nBasic earnings per share for FOX’s Class A Common Stock, par value $\n0.01\n per share (the “Class A Common Stock”), and Class B Common Stock, par value $\n0.01\n per share (the “Class B Common Stock” and, together with the Class A Common Stock, the “Common Stock”) is calculated by dividing Net income attributable to Fox Corporation stockholders by the weighted average number of outstanding shares of Class A Common Stock, including vested restricted stock units (“RSUs”), and Class B Common Stock. Diluted earnings per share for the Class A Common Stock and Class B Common Stock is calculated similarly, except that the calculation for the Class A Common Stock includes the dilutive effect of the assumed issuance of the shares issuable under the Company’s equity-based compensation plan.\nEquity-Based Compensation\nThe Company applies a fair value-based measurement method in accounting for generally all share-based payment transactions with employees. The Company recognizes compensation cost for awards granted that have only service requirements and a graded vesting schedule on a straight-line basis over the requisite service period for the entire award. The Company accounts for forfeitures when they occur.\n67\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFinancial Instruments\nThe carrying value of the Company’s financial instruments exclusive of borrowings, such as cash and cash equivalents, receivables, payables and investments accounted for using the measurement alternative, approximates fair value. The fair value of financial instruments is generally determined by reference to market values resulting from trading on a national securities exchange or in an over-the-counter market.\nRedeemable Noncontrolling Interests\nRedeemable noncontrolling interests are presented outside of permanent equity on the Company’s Balance Sheets as their redemption is outside the control of the Company. The redeemable noncontrolling interests recorded are put rights held in Credible Labs Inc. (“Credible”), an entertainment production company and a digital media company. The Company accretes the changes in the redemption value of the redeemable noncontrolling interests over the period from issuance to the earliest redemption date. If a redeemable noncontrolling interest is redeemable at fair value, adjustments to the carrying amount are recorded in retained earnings. If a redeemable noncontrolling interest is redeemable at an amount in excess of fair value, the portion of the adjustment that reflects a redemption in excess of fair value is presented within net income attributable to noncontrolling interests in the Statements of Operations.\nConcentrations of Credit Risk\nCash and cash equivalents are maintained with several financial institutions. The Company has deposits held with banks that exceed the amount of insurance provided on such deposits. Generally, these deposits may be redeemed upon demand and are maintained with financial institutions of reputable credit and, therefore, bear minimal credit risk.\nGenerally, the Company does not require collateral to secure receivables. As of June 30, 2025 and 2024, the Company had no individual customers that accounted for 10% or more of the Company’s receivables.\nRecently Adopted and Recently Issued Accounting Guidance and Other\nAdopted\nSegment Reporting\nIn November 2023, the Financial Accounting Standards Board (“FASB”) issued guidance that enhances segment reporting by requiring the disclosure of significant segment expenses that are regularly provided to the chief operating decision maker and included within the reported measure of segment profit or loss. The Company adopted the guidance for all periods presented in this Annual Report on Form 10-K (See Note 17—Segment Information).\nIssued\nIncome Taxes\nIn December 2023, the FASB issued updated guidance that enhances income tax disclosures, primarily requiring consistent categories and greater disaggregation of information in the rate reconciliation and income taxes paid by jurisdiction. The amendment is effective for the Company beginning with the Company’s Annual Report on Form 10-K for the fiscal year ending June 30, 2026 on a prospective basis, with the option to use retrospective application. The Company is currently evaluating the impact the new guidance will have on our financial statement disclosures.\nDisaggregation of Income Statement Expenses\nIn November 2024, the FASB issued updated guidance that requires disclosure of specified information about certain costs and expenses. The amendment is effective for the Company beginning with the Company’s Annual Report on Form 10-K for the fiscal year ending June 30, 2028 and for interim periods beginning with the Company's Quarterly Report on Form 10-Q for the quarter ending September 30, 2028 on a prospective basis, with the option to use retrospective application. The Company is currently evaluating the impact the new guidance will have on our financial statement disclosures.\n68\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nOther\nOne Big Beautiful Bill Act\nOn July 4, 2025, the U.S. government enacted The One Big Beautiful Bill Act of 2025 which includes, among other provisions, changes to the U.S. corporate income tax system including the allowance of immediate expensing of qualified property and research and development expenses and permanent extensions of certain provisions within the Tax Cuts and Jobs Act. These provisions generally will be applicable for the Company beginning in fiscal 2026. The Company is currently evaluating the future impact of these tax law changes on our financial statements.\nNOTE 3. \nACQUISITIONS, DISPOSALS AND OTHER TRANSACTIONS\nThe Company’s acquisitions support the Company’s strategy to strengthen its core brands, grow its digital businesses and selectively enhance production capabilities for its digital and linear platforms. The Company records any noncontrolling interests in an acquiree at their acquisition date fair value. When there is a business combination, the initial accounting, including the allocation of the consideration transferred, is based on provisional amounts. The amounts allocated to intangible assets and goodwill, the estimates of useful lives and the related amortization expense are subject to changes pending the completion of the final valuations of certain assets and liabilities. A change in the allocation of consideration transferred and any estimates of useful lives could result in a change in the value allocated to the intangible assets that could impact future amortization expense.\nDuring fiscal 2025, the Company acquired controlling ownership interests in \ntwo\n digital media companies. The incremental revenues and Segment EBITDA (as defined in Note 17—Segment Information) related to the fiscal 2025 acquisitions, included in the Company's results of operations, were not material individually or in the aggregate. The accounting for the business combinations is based on provisional amounts and the allocation of the consideration transferred is not final and is subject to changes pending the completion of the final valuation of certain assets and liabilities. During fiscal 2024 and 2023, the Company made \nno\n acquisitions.\nOther Transactions\nIn February 2024, FOX announced that it would enter into a joint venture with ESPN, a subsidiary of The Walt Disney Company (“Disney”), and Warner Bros. Discovery Inc. (“WBD”) to form a digital distribution platform focused on sports called Venu Sports. On January 10, 2025, FOX, Disney and WBD announced the decision to discontinue Venu Sports (See Note 14—Commitments and Contingencies under the heading \"Venu Sports”). In connection with that decision, FOX recorded restructuring charges and wrote off the previously capitalized costs in Restructuring, impairment and other corporate matters in the Statements of Operations for the fiscal year ended June 30, 2025 (See Note 4—Restructuring, impairment and other corporate matters).\nOn January 12, 2024, the United Football League (the “UFL”) was launched as a professional spring football league that combines the legacy operations of the United States Football League (the “USFL”), a majority-owned consolidated subsidiary of FOX, and XFL, a third-party company. In connection with the launch of the UFL, the Company deconsolidated the operations of the USFL and contributed the USFL net assets to the UFL. As consideration for the net assets contributed, the Company received an approximately \n42\n% ownership interest in the UFL, a variable interest entity, which was recorded as an equity method investment, initially at fair value. This equity method investment is included in Other non-current assets in the Balance Sheets. As a result of this transaction, the Company recorded a gain of approximately $\n170\n million in Non-operating other, net in the Statements of Operations for the fiscal year ended June 30, 2024 (See Note 20—Additional Financial Information under the heading “Non-Operating Other, net”).\n69\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 4. RESTRUCTURING, IMPAIRMENT AND OTHER CORPORATE MATTERS\nThe following table sets forth the components of Restructuring, impairment and other corporate matters included in the Statements of Operations:\nFor the years ended June 30,\n2025\n2024\n2023\n(in millions) \nRestructuring charges\n(a)\n$\n(\n35\n)\n$\n(\n13\n)\n$\n(\n111\n)\nImpairment charges\n(b)\n(\n68\n)\n—\n \n—\n \nOther corporate matters\nLegal settlement costs\n(c)\n(\n126\n)\n(\n24\n)\n(\n894\n)\nU.K. Newspaper Matters Indemnity\n(c)\n(\n30\n)\n(\n20\n)\n(\n117\n)\nOther\n(d)\n(\n91\n)\n(\n10\n)\n(\n60\n)\nTotal restructuring, impairment and other corporate matters\n$\n(\n350\n)\n$\n(\n67\n)\n$\n(\n1,182\n)\n(a)\nPrimarily related to Venu Sports at Corporate and Other (See Note 3—Acquisitions, Disposals and Other Transactions) for fiscal 2025 and severance costs at the Cable Network Programming and Television reportable segments and Corporate and Other for fiscal 2024 and 2023.\n(b)\nRelated to a non-cash impairment charge for intangible assets for fiscal 2025 (See Note 2—Summary of Significant Accounting Policies under the heading \"Goodwill and Other Intangible Assets”).\n(c)\nSee Note 14—Commitments and Contingencies.\n(d)\nPrimarily related to Venu Sports for fiscal 2025 (See Note 3—Acquisitions, Disposals and Other Transactions).\nRestructuring\nChanges in the restructuring program liabilities were as follows:\nOne time\ntermination\nbenefits\nContract\ntermination\ncosts\nTotal \n(in millions) \nBalance, June 30, 2022\n$\n(\n8\n)\n$\n(\n19\n)\n$\n(\n27\n)\nAdditions\n(\n111\n)\n—\n \n(\n111\n)\nPayments\n52\n \n2\n \n54\n \nBalance, June 30, 2023\n$\n(\n67\n)\n$\n(\n17\n)\n$\n(\n84\n)\nAdditions and other\n(\n19\n)\n6\n \n(\n13\n)\nPayments\n69\n \n11\n \n80\n \nBalance, June 30, 2024\n$\n(\n17\n)\n$\n—\n \n$\n(\n17\n)\nAdditions\n(a)\n(\n35\n)\n—\n \n(\n35\n)\nPayments\n(a)\n37\n \n—\n \n37\n \nBalance, June 30, 2025\n$\n(\n15\n)\n$\n—\n \n$\n(\n15\n)\n(a)\nExcludes amounts collected from Disney and WBD related to the decision to discontinue Venu Sports (See Note 3—Acquisitions, Disposals and Other Transactions).\n70\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nAmounts recognized in the Balance Sheets consist of:\nAs of June 30,\n2025\n2024\n2023\n(in millions)\nAccounts payable, accrued expenses and other current liabilities\n$\n15\n \n$\n17\n \n$\n74\n \nOther liabilities\n—\n \n—\n \n10\n \nTotal restructuring liabilities\n$\n15\n \n$\n17\n \n$\n84\n \nNOTE 5. \nINVENTORIES, NET\nThe Company’s inventories were comprised of the following:\nAs of June 30,\n2025\n2024\n(in millions) \nLicensed programming, including prepaid sports rights\n$\n633\n \n$\n841\n \nOwned programming\n541\n \n497\n \nTotal inventories, net\n1,174\n \n1,338\n \nLess: current portion of inventories, net\n(\n432\n)\n(\n626\n)\nTotal non-current inventories, net\n$\n742\n \n$\n712\n \nOwned programming\nReleased\n$\n308\n \n$\n238\n \nIn-process or other\n233\n \n259\n \nTotal\n$\n541\n \n$\n497\n \nThe following table presents the aggregate amortization expense related to Inventories, net included in Operating expenses in the Statements of Operations:\nFor the years ended June 30,\n2025\n2024\n2023\n(in millions)\nTotal amortization expense\n$\n6,638\n \n$\n5,473\n \n$\n6,036\n \nBased on the balance of Inventories, net as of June 30, 2025, the estimated amortization expense for each of the succeeding three fiscal years is as follows:\nFor the years ending June 30,\n2026\n2027\n2028\n(in millions)\nEstimated amortization expense\n$\n555\n \n$\n140\n \n$\n88\n \nInventories are evaluated for recoverability when an event or circumstance occurs that indicates that fair value may be less than unamortized costs. The Company will determine if there is an impairment by evaluating the fair value of the inventories, which are primarily supported by internal forecasts as compared to unamortized costs. The Company recognized impairments of approximately $\n40\n million, $\n40\n million and $\n10\n million in fiscal 2025, 2024 and 2023, respectively, related to owned programming at the Television segment, which were recorded in Operating expenses in the Statements of Operations.\n71\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 6. \nFAIR VALUE\nFair value measurements are disclosed using a three-tiered fair value hierarchy which distinguishes market participant assumptions into the following categories: (i) inputs that are quoted prices in active markets (“Level 1”); (ii) inputs other than quoted prices included within Level 1 that are observable, including quoted prices for similar assets or liabilities (“Level 2”); and (iii) inputs that require the entity to use its own assumptions about market participant assumptions (“Level 3”).\nThe following tables present information about financial assets and redeemable noncontrolling interests carried at fair value on a recurring basis:\nFair value measurements \nAs of June 30, 2025 \nTotal \nLevel 1\n \nLevel 2\nLevel 3 \n(in millions) \nInvestments in equity securities\n$\n1,249\n \n$\n1,249\n \n(a)\n$\n—\n \n$\n—\n \nRedeemable noncontrolling interests\n(\n288\n)\n—\n \n—\n \n(\n288\n)\n(b)\nTotal\n$\n961\n \n$\n1,249\n \n$\n—\n \n$\n(\n288\n)\nFair value measurements \nAs of June 30, 2024\nTotal \nLevel 1\nLevel 2\nLevel 3 \n(in millions) \nInvestments in equity securities\n$\n797\n \n$\n797\n \n(a)\n$\n—\n \n$\n—\n \nRedeemable noncontrolling interests\n(\n242\n)\n—\n \n—\n \n(\n242\n)\n(b)\nTotal\n$\n555\n \n$\n797\n \n$\n—\n \n$\n(\n242\n)\n(a)\nThe investments categorized as Level 1 primarily represents an investment in equity securities of Flutter Entertainment plc (“Flutter”) with a readily determinable fair value.\n(b)\nThe Company utilizes both the market and income approach valuation techniques for its Level 3 fair value measures. Inputs to such measures could include observable market data obtained from independent sources such as broker quotes and recent market transactions for similar assets. It is the Company’s policy to maximize the use of observable inputs in the measurement of its Level 3 fair value measurements. To the extent observable inputs are not available, the Company utilizes unobservable inputs based upon the assumptions market participants would use in valuing the redeemable noncontrolling interests. Examples of utilized unobservable inputs are future cash flows and long-term growth rates.\nIn connection with the combination of The Stars Group Inc. and Flutter in May 2020, FOX Sports received the right to acquire an \n18.6\n% equity interest in FanDuel Group (“FanDuel”), a majority-owned subsidiary of Flutter, at a price set forth in the relevant agreement (structured as a \n10\n-year option), which has been the subject of arbitration proceedings. In January 2023, the U.S. District Court for the Southern District of New York confirmed and entered the arbitrator’s ruling affirming FOX Sports’ \n10\n-year call option expiring in December 2030 to acquire \n18.6\n% of FanDuel for $\n3.7\n billion, with a \n5\n% annual escalator. As of June 30, 2025, the option exercise price is approximately $\n4.5\n billion. FOX has no obligation to commit capital towards this opportunity unless and until it exercises the option. In addition, Flutter cannot pursue an initial public offering for FanDuel without FOX’s consent or approval from the arbitrator who presided over a FOX-Flutter arbitration in 2021 and 2022.\n72\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nRedeemable Noncontrolling Interests\nThe changes in redeemable noncontrolling interests classified as Level 3 measurements were as follows:\n \nFor the years ended June 30, \n \n2025\n2024\n2023\n \n(in millions) \nBeginning of year\n$\n(\n242\n)\n$\n(\n213\n)\n$\n(\n188\n)\nAcquisitions\n(a)\n(\n27\n)\n—\n \n—\n \nNet loss\n1\n \n1\n \n16\n \nAccretion and redemption value adjustments\n(\n20\n)\n(\n30\n)\n(\n41\n)\nEnd of year\n$\n(\n288\n)\n$\n(\n242\n)\n$\n(\n213\n)\n(a)\n The amount in fiscal 2025 was primarily due to the acquisition of a digital media company.\nRedeemable noncontrolling interests held in the entertainment production company and digital media company were determined in accordance with the related contractual redemption terms. Redeemable noncontrolling interests held at fair value were determined using discounted cash flow analysis and market-based valuation approach methodologies. Significant unobservable inputs used in the fair value measurements of the Company’s redeemable noncontrolling interests are EBITDA (as defined in Note 17—Segment Information) projections, discount rates, long-term growth rates and multiples. Significant changes in these long-term assumptions may result in a significantly different value.\nThe put right held by the entertainment production company’s minority shareholder will become exercisable in fiscal 2027. The put right held by the digital media company’s minority shareholders will become exercisable in fiscal 2030.\nThe put right held by the Credible minority interest shareholder was exercised in December 2024. The Company and the Credible minority interest shareholder will determine the value of the redeemable noncontrolling interest as part of a predetermined fair market value process, which is expected to be completed in the first half of fiscal 2026. As of June 30, 2025, the redeemable noncontrolling interest held in Credible has been recorded at the preliminary settlement value.\nFinancial Instruments\nThe carrying value of the Company’s financial instruments exclusive of borrowings, such as cash and cash equivalents, receivables, payables and investments, accounted for using the measurement alternative method, approximates fair value.\nThe following table sets forth the fair value and carrying value of the Company’s Borrowings:\n \nAs of June 30,\n \n2025\n2024\n \n(in millions)\nBorrowings\n \n \nFair value\n$\n6,625\n \n$\n7,017\n \nCarrying value\n$\n6,602\n \n$\n7,197\n \nFair value is generally determined by reference to market values resulting from trading on a national securities exchange or in an over-the-counter market (a Level 1 measurement).\nAssets and Liabilities Measured at Fair Value on a Nonrecurring Basis\nThe Company’s assets measured at fair value on a nonrecurring basis include investments accounted for using the equity method and the measurement alternative method, long-lived assets, indefinite-lived intangible \n73\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nassets and goodwill. The Company reviews the carrying amounts of such assets whenever events or changes in circumstances indicate that the carrying amounts may not be recoverable or at least annually for indefinite-lived intangible assets and goodwill. Any resulting asset impairment would require that the asset be recorded at its fair value. The resulting fair value measurements of the assets are considered to be Level 3 measurements. In addition, investments accounted for using the measurement alternative method are recorded at fair value as a result of observable price changes in orderly transactions for the identical or a similar investment of the same issuer.\nNOTE 7. \nPROPERTY, PLANT AND EQUIPMENT, NET\nThe Company’s property, plant and equipment is comprised of the following:\n \nAs of June 30, \n \n2025\n2024\n \n(in millions) \nLand\n$\n206\n \n$\n206\n \nBuildings and leaseholds\n1,463\n \n1,369\n \nMachinery and equipment\n2,132\n \n1,997\n \n \n3,801\n \n3,572\n \nLess: accumulated depreciation and amortization\n(\n2,367\n)\n(\n2,170\n)\n \n1,434\n \n1,402\n \nConstruction in progress\n271\n \n294\n \nTotal property, plant and equipment, net\n$\n1,705\n \n$\n1,696\n \nDepreciation and amortization expense related to Property, plant and equipment was $\n350\n million, $\n344\n million and $\n337\n million for fiscal 2025, 2024 and 2023, respectively.\nNOTE 8. \nGOODWILL AND INTANGIBLE ASSETS, NET\nThe changes in the carrying values of the Company’s intangible assets and related accumulated amortization were as follows:\n \n \nIntangible assets not subject to amortization \nAmortizable\nintangible\nassets, net\n(a)\n \nTotal\nintangible\nassets, net\n \nFCC\nlicenses\n \nOther\n \nTotal \n \n \n(in millions) \nBalance, June 30, 2023\n$\n2,250\n \n$\n642\n \n$\n2,892\n \n$\n192\n \n$\n3,084\n \nAmortization and other\n—\n \n—\n \n—\n \n(\n46\n)\n(\n46\n)\nBalance, June 30, 2024\n$\n2,250\n \n$\n642\n \n$\n2,892\n \n$\n146\n \n$\n3,038\n \nAcquisitions\n(b)\n—\n \n—\n \n—\n \n33\n \n33\n \nAmortization and other\n(c)\n(\n66\n)\n(\n2\n)\n(\n68\n)\n(\n34\n)\n(\n102\n)\nBalance, June 30, 2025\n$\n2,184\n \n$\n640\n \n$\n2,824\n \n$\n145\n \n$\n2,969\n \n(a)\nNet of accumulated amortization of $\n441\n million and $\n405\n million as of June 30, 2025 and 2024, respectively. \n(b)\nSee Note 3—Acquisitions, Disposals and Other Transactions.\n(c)\nIncludes an impairment charge (See Note 2—Summary of Significant Accounting Policies under the heading “Goodwill and Other Intangible Assets”).\nAmortization expense related to finite-lived intangible assets was $\n35\n million, $\n45\n million and $\n74\n million for fiscal 2025, 2024 and 2023, respectively.\n74\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nBased on the balance of finite-lived intangible assets as of June 30, 2025, the estimated amortization expense for each of the succeeding five fiscal years is as follows:\n \nFor the years ending June 30,\n \n2026\n2027\n2028\n2029\n2030\n \n(in millions)\nEstimated amortization expense\n(a)\n$\n37\n \n$\n35\n \n$\n29\n \n$\n22\n \n$\n14\n \n(a)\nThese amounts may vary as acquisitions and dispositions occur in the future.\nThe changes in the carrying value of goodwill, by reportable segment and Corporate and Other, were as follows:\n \nCable Network Programming \nTelevision \nCorporate \nand Other\nTotal Goodwill \n \n(in millions) \nBalance, June 30, 2023\n$\n1,059\n \n$\n2,246\n \n$\n254\n \n$\n3,559\n \nOther\n(\n15\n)\n—\n \n—\n \n(\n15\n)\nBalance, June 30, 2024\n$\n1,044\n \n$\n2,246\n \n$\n254\n \n$\n3,544\n \nAcquisitions\n(a)\n1\n \n89\n \n—\n \n90\n \nOther\n—\n \n5\n \n—\n \n5\n \nBalance, June 30, 2025\n$\n1,045\n \n$\n2,340\n \n$\n254\n \n$\n3,639\n \n(a)\nSee Note 3—Acquisitions, Disposals and Other Transactions.\nThe carrying amount of Television segment goodwill was net of accumulated impairments of $\n371\n million as of June 30, 2025 and 2024.\nNOTE 9. \nBORROWINGS\nPublic Debt - Senior Notes Issued\nThe Company has issued senior notes (the “Notes”) under an Indenture, dated as of January 25, 2019, by and between the Company and The Bank of New York Mellon, as Trustee (the “2019 Indenture”). The Notes are direct unsecured obligations of the Company and rank pari passu with all other senior indebtedness of the Company, including the indebtedness under the Revolving Credit Agreement described below. Redemption may occur, at the option of the holders, at \n101\n% of the principal amount plus an accrued interest amount in certain circumstances where a change of control is deemed to have occurred. The Notes are subject to certain covenants, which, among other things, limit the Company’s ability and the ability of the Company’s subsidiaries, to create liens and engage in merger, sale or consolidation transactions. The 2019 Indenture does not contain any financial maintenance covenants.\n75\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nIn October 2023, the Company issued $\n1.25\n billion of senior notes and used the net proceeds for general corporate purposes. \nThe following table summarizes the Company’s senior notes, net of repayments:\n \nOutstanding as of June 30,\n \n2025\n2024\n \n(in millions) \nPublic debt\n3.050\n% senior notes due 2025 \n$\n—\n \n$\n600\n \n4.709\n% senior notes due 2029\n2,000\n \n2,000\n \n3.500\n% senior notes due 2030\n600\n \n600\n \n6.500\n% senior notes due 2033\n1,250\n \n1,250\n \n5.476\n% senior notes due 2039\n1,250\n \n1,250\n \n5.576\n% senior notes due 2049\n1,550\n \n1,550\n \nTotal public debt\n6,650\n \n7,250\n \nLess: unamortized discount and debt issuance costs\n(\n48\n)\n(\n53\n)\nTotal borrowings\n$\n6,602\n \n$\n7,197\n \n \nCurrent Borrowings\nIncluded in Borrowings within Current liabilities as of \nJune 30, 2024\n was $\n600\n million of \n3.050\n% senior notes which matured and were repaid in full in April 2025.\nRevolving Credit Agreement\nOn June 14, 2023, the Company entered into a \nfive-year\n credit agreement (the “Revolving Credit Agreement”) among the Company, as Borrower, the initial lenders named therein, the initial issuing banks named therein, Citibank, N.A., as Administrative Agent, Deutsche Bank Securities Inc. and Goldman Sachs Bank USA, as Co-Syndication Agents and JPMorgan Chase Bank, N.A. and Morgan Stanley Senior Funding Inc., as Co-Documentation Agents. The Company entered into the Revolving Credit Agreement in anticipation of the transition away from the London Interbank Offered Rate (“LIBOR”) as a result of reference rate reform and to replace the Company’s previous unsecured revolving credit facility.\nThe Revolving Credit Agreement provides for a $\n1.0\n billion unsecured revolving credit facility with a sub-limit of $\n150\n million available for the issuance of letters of credit and a maturity date of June 2028. Under the Revolving Credit Agreement, the Company may request an increase in the amount of the credit facility commitments up to a maximum facility amount of $\n1.75\n billion and the Company may request that the maturity date be extended for up to \ntwo\n additional \none-year\n periods. The material terms of the Revolving Credit Agreement include the requirement that the Company maintain specific leverage ratios and limitations on indebtedness. The interest rates and fees under the Revolving Credit Agreement are based on the Company’s long-term senior unsecured non-credit enhanced debt ratings. Given the current credit ratings, the interest rate on borrowings under the Revolving Credit Agreement would be the forward-looking term rate based on the \nSecured Overnight Financing Rate\n plus \n1.125\n% and the facility fee is \n0.125\n%. As of June 30, 2025, there were \nno\n borrowings outstanding under the Revolving Credit Agreement.\n76\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 10. \nLEASES\nLessee Arrangements\nThe following amounts were recorded in the Company’s Balance Sheets relating to its operating leases and other supplemental information:\n \nAs of June 30, \n \n2025\n2024\n \n(in millions) \nROU assets\n$\n814\n \n$\n904\n \nLease liabilities\nCurrent lease liabilities\n$\n41\n \n$\n76\n \nNon-current lease liabilities\n822\n \n879\n \nTotal lease liabilities\n$\n863\n \n$\n955\n \nOther supplemental information\nWeighted average remaining lease term\n15\n years\n16\n years\nWeighted average discount rate\n5\n \n%\n5\n \n%\nThe following table presents information about the Company’s lease costs and supplemental cash flows information for leases:\n \nFor the years ended June 30,\n \n2025\n2024\n2023\n \n(in millions)\nLease costs\n \n \nTotal lease costs\n(a)\n$\n146\n \n$\n147\n \n$\n145\n \nSupplemental cash flows information\nOperating cash flows from operating leases\n$\n125\n \n$\n126\n \n$\n119\n \nROU assets obtained in exchange for operating lease liabilities\n(b)\n$\n19\n \n$\n36\n \n$\n568\n \n(a)\nTotal lease costs are net of sublease income of approximately $\n15\n million in each period.\n(b)\nThe Company recorded an additional $\n540\n million in operating lease assets and liabilities as of June 30, 2023, in connection with the extension of the operating lease for its corporate headquarters at 1211 Avenue of the Americas in New York through fiscal 2042.\n77\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nThe following table presents the lease payments relating to the Company’s operating leases:\n \nAs of June 30, 2025 \n \n(in millions) \nFiscal Year\n \n2026\n$\n76\n \n2027\n72\n \n2028\n103\n \n2029\n96\n \n2030\n84\n \nThereafter\n918\n \nTotal lease payments\n1,349\n \nLess: imputed interest\n(\n486\n)\nPresent value of operating lease liabilities\n$\n863\n \nLessor Arrangements\nThe Company’s lessor arrangements primarily relate to its owned production and office facilities at the FOX Studio Lot, which is located \nin Los Angeles, California\n.\n The Company le\nases production and office space on the FOX Studio Lot, which will predominantly be utilized by Disney until March of 2026 for approximately $\n35\n million annually in lease payments.\nThe Company recorded total lease income for fiscal 2025, 2024 and 2023 of approximately $\n45\n million, $\n55\n million and $\n55\n million, respectively, which is\n included in Revenues in the Statements of Operations. The Company recognizes lease payments for operating leases as revenue on a straight-line basis over the lease term and variable lease payments as revenue in the period incurred.\nNOTE 11. \nSTOCKHOLDERS’ EQUITY\nCommon Stock and Preferred Stock\nThe Company has \ntwo\n classes of common stock that are authorized and outstanding: Class A Common Stock and Class B Common Stock. As a general matter, holders of Class B Common Stock are entitled to \none\n vote per share on all matters on which stockholders have the right to vote, including director elections. Holders of Class \nA Common Stock are entitled to vote only in the limited circumstances set forth in the Company’s Amended and Restated Certificate of Incorporation (the “Certificate of Incorporation”).\nAs of June 30, 2025, there were approximately \n12,900\n holders of record of shares of Class A Common Stock and approximately \n2,700\n holders of record of shares of Class B Common Stock.\nIn the event of a liqui\ndation or dissolution or winding up of the Company, after distribution in full of the preferential and/or other amounts to be distributed to the holders of shares of any outstanding series of preferred stock or series common stock, holders of Class A Common Stock and Class B Common Stock, to the extent fixed by the Board of Directors (the “Board”) with respect thereto, are entitled to receive all of the remaining assets of the Company available for distribution to its stockholders, ratably in proportion to the number of shares held by Class A Common Stock holders and Class B Common Stock holders, respectively. In the event of any merger or consolidation with or into another entity, the holders of Class A Common Stock and the holders of Class B Common Stock generally are entitled to receive substantially identical per share consideration.\nUnder the Certificate of Incorporation, the Board is authorized to issue shares of preferred stock or common stock at any time, without stockholder approval, and to determine all the terms of those shares, \n78\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nincluding the following:\n(i) the voting rights, if any, except that the issuance of preferred stock or series common stock which entitles holders thereof to more than one vote per share requires the affirmative vote of the holders of a majority of the combined voting power of the then outstanding shares of the Company’s capital stock entitled to vote generally in the election of directors;\n(ii) the dividend rate and preferences, if any, which that preferred stock or common stock will have compared to any other class; and\n(iii) the redemption and liquidation rights and preferences, if any, which that preferred stock or common stock will have compared to any other class.\nAny decision by the Board to issue preferred stock or common stock must, however, be taken in accordance with the Board’s fiduciary duty to act in the best interests of the Company’s stockholders. The Company is authorized to issue \n35,000,000\n shares of preferred stock, par value $\n0.01\n per share and \n35,000,000\n shares of series common stock, par value $\n0.01\n per share. The Board has the authority, without any further vote or action by the stockholders, to issue preferred stock and series common stock in one or more series and to fix the number of shares, designations, relative rights (including voting rights), preferences, qualifications and limitations of such series to the full extent permitted by Delaware law.\nStock Repurchase Program\nThe Company’s Board has authorized a stock repurchase program under which the Company can repurchase $\n7\n billion of \nClass A Common Stock and Class B Common Stock\n. The program has no time limit and may be modified, suspended or discontinued at any time. As of June 30, 2025, the Company’s remaining stock repurchase authorization was approximately $\n400\n million.\nFiscal 2023 and \n2024\nIn connection with the stock repurchase program, the Company entered into an\n \naccelerated share repurchase (“ASR”) \nagreement\n in February 2023 under which the Company paid a third-party financial institution $\n1\n billion and received an initial delivery of approximately \n22.5\n million shares of Class A Common Stock, representing \n80\n% of the shares expected to be repurchased under the ASR agreement, at a price of $\n35.54\n per share, which was the Nasdaq Global Select Market (“Nasdaq”) closing share price of the Class A Common Stock on February 8, 2023. Upon settlement of the ASR agreement in August 2023, the Company received a final delivery of approximately \n7.8\n million shares of Class A Common Stock. The final number of shares purchased under the ASR agreement was determined using a price of $\n33.03\n per share (the volume-weighted average market price of the Class A Common Stock on the Nasdaq during the term of the ASR agreement less a discount). The Company accounted for the ASR agreement as \ntwo\n \nseparate transactions. The initial delivery of Class A Common Stock was accounted for as a treasury stock transaction recorded on the acquisition date. The final settlement of Class A Common Stock was accounted for as a forward contract indexed to the Class A Common Stock and qualified as an equity transaction.\nIn addition to the shares purchased under the ASR agreement, the Company repurchased shares of Class A Common Stock and Class B Common Stock in the open market during fiscal \n2025,\n 2024 and 2023. Repurchased sh\nares are retired and reduce the number of shares issued and outstanding. The Company allocates the amount of the repurchase price over par value between additional paid-in capital and retained earnings.\n79\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nThe foll\nowing table summarizes the Company’s repurchases of its Class A Common Stock and Class B Common Stock:\n \nFor the years ended June 30,\n \n2025\n2024\n2023\n \n(in millions)\nTotal cost of repurchases\n(a)\n$\n1,000\n \n$\n1,000\n \n$\n2,000\n \nTotal number of shares repurchased\n21\n \n40\n \n54\n \n(a)\nThese amounts exclude any fees, commissions, excise taxes or other costs associated with the share repurchases.\n Stockholders Agreement\nThe Company announced on \nNovember 6, 2019\n that it had entered into a stockholders agreement with the Murdoch Family Trust pursuant to which the Company and the Murdoch Family Trust have agreed not to take actions that would result in the Murdoch Family Trust and Murdoch family members together owning more than \n44\n% of the outstanding voting power of the shares of Class B Common Stock or would increase the Murdoch Family Trust’s voting power by more than \n1.75\n% in any rolling twelve-month period. The Murdoch Family Trust would forfeit votes to the extent necessary to ensure that the Murdoch Family Trust and the Murdoch family collectively do not exceed \n44\n% of the outstanding voting power of the Class B shares, except where a Murdoch family member votes their own shares differently from the Murdoch Family Trust on any matter.\nDividends\nThe\n following table summarizes the dividends declared and paid per share on both the Company’s Class A Common Stock and Class B Common Stock:\n \n \nFor the years ended June 30,\n \n2025\n2024\n2023\nCash dividend per share\n$\n0.54\n \n$\n0.52\n \n$\n0.50\n \nComprehensive Income\nComprehensive \nincome\n is reported in the Statements of Comprehensive Income and consists of Net income and Other comprehensive (loss) income, including benefit plan adjustments, which affect stockholders’ equity, and under GAAP, are excluded from Net income.\nThe following tables summarize \nthe\n activity within Other comprehensive (loss) income:\n \nFor the year ended June 30, 2025\n \nBefore tax\nTax benefit\n(provision)\nNet of tax\n \n(in millions)\nBenefit plan and cumulative translation adjustments\nUnrealized losses\n$\n(\n32\n)\n$\n8\n \n$\n(\n24\n)\nReclassifications realized in net income\n(a)\n1\n \n—\n \n1\n \nCumulative translation adjustment\n6\n \n—\n \n6\n \nOther comprehensive loss\n$\n(\n25\n)\n$\n8\n \n$\n(\n17\n)\n80\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n \nFor the year ended June 30, 2024 \n \nBefore tax \nTax benefit\n(provision)\nNet of tax \n \n(in millions) \nBenefit plan adjustments and other\nUnrealized gains\n$\n47\n \n$\n(\n11\n)\n$\n36\n \nReclassifications realized in net income\n(a)\n8\n \n(\n2\n)\n6\n \nOther comprehensive income\n$\n55\n \n$\n(\n13\n)\n$\n42\n \n \nFor the year ended June 30, 2023 \n \nBefore tax \nTax benefit\n(provision)\nNet of tax \n \n(in millions) \nBenefit plan, cumulative translation adjustments and other\nUnrealized gains\n$\n79\n \n$\n(\n19\n)\n$\n60\n \nReclassifications realized in net income\n(a)\n19\n \n(\n5\n)\n14\n \nCumulative translation adjustment\n3\n \n—\n \n3\n \nOther comprehensive income\n$\n101\n \n$\n(\n24\n)\n$\n77\n \n(a)\nReclassifications of amounts related to benefit plan adjustments are included in Non-operating other, net in the Statements of Operations (See Note 15—Pension and Other Postretirement Benefits for additional information).\nAccumulated other comprehensive loss\nThe following \ntable\n summarizes the components of Accumulated other comprehensive loss, net of tax:\n \nAs of June 30, \n \n2025\n2024\n2023\n \n(in millions) \nBenefit plan adjustments and other\n$\n(\n126\n)\n$\n(\n103\n)\n$\n(\n145\n)\nCumulative translation adjustment\n2\n \n(\n4\n)\n(\n4\n)\nAccumulated other comprehensive loss, net of tax\n$\n(\n124\n)\n$\n(\n107\n)\n$\n(\n149\n)\nNOTE 12. \nEQUITY-BASED COMPENSATION\nThe Company has equity-based compensation plans, including the Fox Corporation 2019 Shareholder Alignment Plan (the “SAP”), under which stock options (including performance-based stock options (“PSOs”), stock appreciation rights, restricted and unrestricted stock, RSUs, performance stock units “PSUs”) an\nd other types of FOX or subsidiary equity awards may be granted.\n2019 Shareholder Alignment Plan\nThe Company’s officers, directors and employees are eligible to participate in the SAP. The maximum number of shares of Class A Common Stock that may be issued under the SAP is \n65\n million shares. As of June 30, 2025, the remaining number of shares of Class A Common Stock available for issuance under the SAP was approximately \n30\n million.\nAwards granted under the SAP (other than stock options or stock appreciation rights) entitle the holder to receive Dividend Equivalents (as defined in the SAP) for each regular cash dividend on the common stock underlying the award paid by the Company during the award period. Dividend equivalents granted with respect \n81\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nto equity awards will be accrued during the applicable award period and such dividend equivalents will vest and be paid only if and when the underlying award vests.\nThe fair value of equity-based compensation under the SAP was calculated according to the type of award issued.\nRestricted Stock Units\nRSUs are awards that represent the potential to receive shares of Class A Common Stock at the end of the applicable vesting period, subject to the terms and conditions of the SAP, the applicable award documents and such other terms and conditions as the Compensation Committee of the Board (the “Compensation Committee”) may es\ntablish. RSUs awarded under the SAP are fair valued based upon the fair market value of Class A Common Stock on the grant date. Any person who holds RSUs has no ownership interest in the shares of Class A Common Stock to which such RSUs relate until and unless shares of Class A Common Stock are delivered to the holder.\nRSUs generally vest in equal annual installments \nover a \nthree-year\n period subject to the participants’ continued employment with the Company.\nPerformance Stock Units\nPSUs are fair valued on the date of grant and expensed over the service period using a straight-line method as the awards cliff vest at the end of a \nthree-year\n performance period. The Company also estimates the number of shares expected to vest which is based on management’s determination of the probable outcome of the performance conditions, which requires considerable judgment. The Company records a cumulative adjustment in periods in which the Com\npany’s estimate of the number of shares expected to vest changes. Additionally, the Company ultimately adjusts the expense recognized to reflect the actual vested shares following the resolution of the performance conditions. The number of shares that will be issued upon vesting of PSUs can range from \n0\n% to \n200\n% of the target award, based on the Company’s three-year total shareholder return (“TSR”) as measured against the three-year TSR of the companies that comprise the Standard and Poor’s 500 Index and other performance measures. The fair value of the TSR condition is determined using a Monte Carlo simulation model.\nPSUs have a \nthree-yea\nr\n performance measurement period and are subject to the achievement of three pre-established objective performance measures determined by the Compensation Committee. The awards issued will be settled in shares of Class A Common Stock upon vesting and are subject to the participants’ continued employment with the Company. Any person who holds PSUs has no ownership interest in the shares of Class A Common Stock to which such PSUs relate until and unless shares of Class A Common Stock are delivered to the holder. All shares of Class A Common Stock underlying awards that are cancelled or forfeited become available for future grants. Certain of these awards have a graded vesting provision and the expense recognition is accelerated.\n82\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nThe following table summarizes the activity related to RSUs and target PSUs granted to the Company’s employees to be settled in stock (RSUs and PSUs in thousands):\nFiscal 2025\nFiscal 2024\nFiscal 2023\nNumber\nof\nshares\nWeighted\naverage\ngrant-\ndate fair\nvalue\nNumber\nof\nshares\nWeighted\naverage\ngrant-\ndate fair\nvalue\nNumber\nof\nshares\nWeighted\naverage\ngrant-\ndate fair\nvalue\nRSUs and PSUs\nUnvested units at beginning of the year\n4,801\n \n$\n35.20\n \n4,284\n \n$\n33.72\n \n5,052\n \n$\n32.53\n \nGranted\n1,945\n \n37.58\n \n3,209\n \n35.13\n \n2,314\n \n34.31\n \nVested\n(\n1,685\n)\n34.68\n \n(\n2,153\n)\n31.97\n \n(\n2,092\n)\n31.75\n \nCancelled\n(\n121\n)\n39.57\n \n(\n539\n)\n35.28\n \n(\n990\n)\n33.30\n \nUnvested units at the end of the year\n(a)\n4,940\n \n$\n36.75\n \n4,801\n \n$\n35.20\n \n4,284\n \n$\n33.72\n \n(a)\nThe intrinsic value of unvested RSUs and target PSUs as of June 30, 2025 was approximately $\n180\n million.\nStock Options\nStock options are awards that entitle the holder to purchase a specified number of shares of Class A Common Stock at a specified \nprice\n for a specified period of time and become exercisable over time, subject to the terms and conditions of the SAP, the applicable award documents and such other terms and conditions as the Compensation Committee of the Board may establish. There were \nno\n stock options granted during fiscal 2025, 2024 or 2023.\nPerformance-Based Stock Options\nPSOs are awards that entitle the holder to purchase a specified number of shares of Class A Common Stock at a specified price for a specified period of time, contingent on the performance of the Class A Common Stock over a \nthree-year\n \nperiod\n, subject to the terms and conditions of the SAP, the applicable award documents and such other terms and conditions as the Compensation Committee of the Board may establish. The PSOs granted under the SAP will vest in full only if the Company’s Class A Common Stock exceeds the exercise price of the PSO by a certain threshold over a certain period of time during the performance period (the “market condition”). The PSOs were fair valued using a Monte Carlo simulation model that uses the following assumptions: (i) expected volatility was generally based on historical volatility of the Company and the Company’s peer group over the expected term of the PSOs; (ii) expected term of PSOs granted was generally determined by analyzing historical data of the Company’s peer group and represented the period of time that PSOs granted were expected to be outstanding; (iii) risk-free interest rate was based on the U.S. Treasury yield curve in effect at the time of grant of the award for time periods approximately equal to the expected term of the award; and (iv) expected dividend yield.\n \nCompensation cost related to the PSO will be recognized even if the market condition is not met.\nThe PSOs granted during fiscal 2025, 2024 and 2023 will vest in full at the end of the applicable \nthree-year\n performance period as the market condition has been met, and have a term of \nseven years\n thereafter.\n83\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nThe following table summarizes information about the Company’s stock options and PSOs granted under the SAP during fiscal 2025, 2024 and 2023 (options in thousands):\nFiscal 2025\nFiscal 2024\nFiscal 2023\nNumber of options \nWeighted average exercise price\nNumber of options \nWeighted average exercise price\nNumber of options \nWeighted average exercise price\nOutstanding at the beginning of the year\n18,326\n \n$\n33.75\n \n17,048\n \n$\n33.12\n \n14,250\n \n$\n32.90\n \nGranted\n3,386\n \n38.98\n \n3,927\n \n34.77\n \n4,314\n \n33.40\n \nExercised\n(a)\n(\n5,243\n)\n32.67\n \n(\n1,216\n)\n27.85\n \n(\n234\n)\n28.76\n \nCancelled\n(\n192\n)\n37.77\n \n(\n1,433\n)\n34.30\n \n(\n1,282\n)\n32.77\n \nOutstanding at the end of the year\n(b)\n16,277\n \n$\n35.14\n \n18,326\n \n$\n33.75\n \n17,048\n \n$\n33.12\n \nExercisable at the end of the year\n(c)\n5,907\n \n$\n34.08\n \n8,158\n \n$\n32.95\n \n5,282\n \n$\n36.35\n \nWeighted average grant-date fair value of options granted\n$\n11.67\n \n$\n10.30\n \n$\n10.32\n \nWeighted average remaining contractual term of options outstanding at the end of the year\n6.35\n years\n5.97\n years\n6.51\n years\nWeighted average remaining contractual term of options exercisable at the end of the year\n3.51\n years\n3.51\n years\n2.96\n years\n(a)\nDuring fiscal 2025, 2024 and 2023, the Company received approximately $\n171\n million, $\n34\n million and $\n7\n million, respectively, in cash payments from the exercise of options.\n(b)\nThe intrinsic value of options outstanding as of June 30, 2025, 2024 and 2023 was $\n340.2\n million, $\n31.7\n million and $\n37.1\n million, respectively.\n(c)\nThe intrinsic value of options exercisable as of June 30, 2025, 2024 and 2023 was $\n129.7\n million, $\n28.7\n million and $\n6.8\n million, respectively.\nThe fair value of each PSO grant is estimated on the date of grant with the following \nweighted average\n assumptions used for grants during fiscal\n 2025, 2024 and 2023\n:\n \nFor the years ended June 30,\n \n2025\n2024\n2023\nExpected volatility\n30.17\n \n%\n31.63\n \n%\n35.00\n \n%\nRisk-free interest rate\n3.86\n \n%\n3.96\n \n%\n2.83\n \n%\nExpected dividend yield\n1.39\n \n%\n1.44\n \n%\n1.40\n \n%\nExpected term\n7.15\n years\n6.50\n years\n5.30\n years\n84\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nThe following table summarizes the Company’s equity-based compensation:\nFor the years ended June 30,\n2025\n2024\n2023\n(in millions)\nEquity-based compensation\n$\n135\n \n$\n90\n \n$\n74\n \nIntrinsic value of all settled equity-based awards\n$\n134\n \n$\n78\n \n$\n77\n \nTax benefit on settled equity-based awards\n$\n24\n \n$\n12\n \n$\n14\n \nAs of June 30, 2025, the Company’s total estimated compensation cost, not yet recognized, related to non-vested equity awards held by the Company’s employees was approximately $\n105\n million and is expected to be recognized over a weighted average period between \ntwo\n and \nthree years\n.\nNOTE 13. \nRELATED PARTY TRANSACTIONS\nIn the ordinary course of business, the Company enters into transactions with related parties to buy and/or sell programming and purchase and/or sell advertising.\nFor fiscal 2025, 2024 and 2023, the related party revenue and expense were not material (See Note 14—Commitments and Contingencies and Note 4—Restructuring, impairment and other corporate matters for information related to U.K. Newspaper Matters Indemnity obligation to News Corporation).\nAs of June 30, 2025 and 2024, the amounts due to related parties were $\n67\n million and $\n74\n million, respectively, which were primarily included in Accounts payable, accrued expenses and other current liabilities in the Balance Sheets.\nNOTE 14. \nCOMMITMENTS AND CONTINGENCIES\nThe Company has commitments under certain firm contractual arrangements (“firm commitments”) to make future payments. These firm commitments secure the future rights to various assets and services to be used in the normal course of operations. \nThe following table summarizes the Company’s material firm commitments as of June 30, 2025:\n \nAs of June 30, 2025\n \nPayments due by period\n \nTotal\n1 year\n2 - 3 years\n4 - 5 years\nAfter 5 years\n \n(in millions)\nBorrowings\n$\n6,650\n \n$\n—\n \n$\n—\n \n$\n2,600\n \n$\n4,050\n \nLicensed programming\n26,941\n \n5,666\n \n10,129\n \n9,840\n \n1,306\n \nOther commitments and contractual obligations\n1,595\n \n464\n \n704\n \n262\n \n165\n \nTotal commitments\n$\n35,186\n \n$\n6,130\n \n$\n10,833\n \n$\n12,702\n \n$\n5,521\n \nBorrowings\nSee Note 9—Borrowings.\nLicensed programming\nUnder the Company’s contracts with the National Football League (“NFL”), the remaining future minimum payments for program rights to broadcast certain football games are payable over the remaining term of the contract through the 2033 NFL season. The NFL has a one-time termination right after the 2029 NFL season.\n85\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nThe Company’s contract with Major League Baseball (“MLB”) gives the Company rights to broadcast certain regular season and post-season games, as well as exclusive rights to broadcast MLB’s \nWorld Series\n and \nAll-Star Game\n through the 2028 MLB season.\nThe Company’s contracts with the National Association of Stock Car Auto Racing (“NASCAR”) give the Company rights to broadcast certain races and ancillary content through calendar year 2031.\nUnder the Company’s contracts with certain collegiate conferences, remaining future minimum payments for program rights to broadcast certain sports events are payable over the remaining terms of the contracts.\nOther commitments and contractual obligations\nPrimarily includes obligations relating to talent costs and television rating services agreements.\nLeases\nSee Note 10—Leases.\nPension and other postretirement benefits\nThe total accrued net benefit liability for pension and other postretirement benefit plans recognized as of June 30, 2025 was $\n295\n million (See Note 15—Pension and Other Postretirement Benefits). This amount is affected by, among other items, statutory funding levels, changes in plan demographics and assumptions and investment returns on plan assets. Because of the current overall funded status of the Company’s material plans, the accrued liability does not represent expected near-term liquidity needs and, accordingly, this amount is not included in the contractual obligations table.\nContingencies\nThe Company establishes an accrued liability for legal claims and indemnification claims when the Company determines that a loss is both probable and the amount of the loss can be reasonably estimated. Once established, accruals are adjusted from time to time, as appropriate, in light of additional information. The amount of any loss ultimately incurred in relation to matters for which an accrual has been established may be higher or lower than the amounts accrued for such matters. Any fees, expenses, fines, penalties, judgments or settlements which might be incurred by the Company in connection with the various proceedings could affect the Company’s results of operations and financial condition. For the contingencies disclosed below for which there is at least a reasonable possibility that a loss may be incurred, other than the accrual provided, the Company was unable to estimate the amount of loss or range of loss.\nFOX News\nThe Company’s FOX News business and certain of its current and former employees have been subject to allegations of sexual harassment and discrimination on the basis of sex and race. The Company has resolved many of these claims and is contesting other claims in litigation. The Company has also received regulatory and investigative inquiries relating to these matters. To date, none of the amounts paid in settlements or reserved for pending or future claims is material, individually or in the aggregate, to the Company. The amount of additional liability, if any, that may result from these or related matters cannot be estimated at this time. However, the Company does not currently anticipate that the ultimate resolution of any such pending matters will have a material adverse effect on its business, financial condition, results of operations or cash flows.\nU.K. Newspaper Matters Indemnity\nIn connection with the separation of Twenty-First Century Fox, Inc. (“21CF”) and News Corporation in June 2013 (the “21CF News Corporation Separation”), 21CF agreed to indemnify News Corporation, on an after-tax basis, for payments made after the 21CF News Corporation Separation arising out of civil claims and investigations relating to phone hacking, illegal data access and inappropriate payments to public officials that occurred at subsidiaries of News Corporation before the 21CF News Corporation Separation, as well as legal and professional fees and expenses paid in connection with the related criminal matters, other than fees, expenses and costs relating to employees who are not (i) directors, officers or certain designated employees or \n86\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(ii) with respect to civil matters, co-defendants with News Corporation (the “U.K. Newspaper Matters Indemnity”). In accordance with the separation agreement entered into connection with the separation of 21CF and the Company in 2019 and 21CF becoming a wholly-owned subsidiary of Disney (the “Transaction”), the Company assumed certain costs and liabilities related to the U.K. Newspaper Matters Indemnity. The liability recorded in the Balance Sheets related to the indemnity was approximately $\n65\n million as of June 30, 2024 and approximately $\n30\n million as of June 30, 2025.\nDefamation and Disparagement Claims\nFrom time to time, the Company and its news businesses, including FOX News Media and the FOX Television Stations, and their employees are subject to lawsuits alleging defamation or disparagement. These include lawsuits filed by Smartmatic USA Corp. and certain of its affiliates (collectively, “Smartmatic”) in February 2021 seeking $\n2.7\n billion in damages and Dominion Voting Systems, Inc. and certain of its affiliates (collectively, “Dominion”) in March 2021 seeking $\n1.6\n billion in damages. On March 31, 2023, the court in the Dominion case issued its rulings on summary judgment motions that were unfavorable to the Company. Following these rulings, on April 18, 2023, the Company and its subsidiary, Fox News Network, LLC, entered into a Release and Settlement Agreement with Dominion pursuant to which the parties agreed to resolve the lawsuits among them. The Company paid an aggregate of approximately $\n800\n million to settle this and a related lawsuit in April 2023.\nThe Company continues to believe the Smartmatic and other pending lawsuits alleging defamation or disparagement are without merit and intends to defend against them vigorously, including through any appeals. The parties filed motions for summary judgment in the Smartmatic case on April 30, 2025, and opposition and reply briefs were filed on June 18, 2025 and July 28, 2025, respectively. At this time, a trial in the Smartmatic lawsuit is not expected to commence until late 2025 or early 2026 at the earliest. The Company is unable to predict the final outcome of these matters and has determined that a loss in the Smartmatic case is neither probable nor reasonably estimable. There can be no assurance that the ultimate resolution of these pending matters will not have a material adverse effect on the Company’s business, financial condition, results of operations or cash flows.\nOn April 11, 2023 and April 20, 2023, stockholders of the Company filed derivative lawsuits in the Delaware Court of Chancery (the “Chancery Court”) against certain directors of the Company, which the Chancery Court subsequently consolidated into one matter captioned In re Fox Corporation Deriv. Litig., C.A. No. 2023-0418 (Del.Ch.). \nTwo\n additional derivative lawsuits were subsequently filed by the Company’s stockholders in the Chancery Court on September 12, 2023 against certain directors and officers of the Company and are part of the consolidated lawsuit. Each of the lawsuits names the Company as a nominal defendant. On April 26, 2024, the lead plaintiffs filed an amended complaint that alleges that certain directors and officers, as applicable, breached their fiduciary duties by allowing the Company’s news channel to air allegations regarding election fraud in connection with the 2020 U.S. Presidential election, which resulted in significant defamation litigation. The amended complaint seeks orders awarding damages in favor of the Company; directing the Company to reform and improve its policies and procedures; and awarding the plaintiffs attorneys' fees and costs. On December 27, 2024, the Chancery Court denied the defendants’ motion to dismiss the amended complaint. On February 18, 2025, the Chancellor of the Chancery Court, on the Chancellor’s own motion, reassigned the consolidated lawsuit to a different Vice Chancellor. On April 28, 2025, the Chancery Court granted the defendants’ motion for leave to move for summary judgment on an issue relating to director independence. The Company intends to continue to vigorously defend against these claims.\nActions and Claims Arising from Alleged Misuse of Personal Information\nThe Company and its subsidiaries, including Tubi, Inc. (“Tubi”), are from time to time parties to actions and arbitration claims arising from their alleged misuse of personal information. In June 2023, a putative class action lawsuit titled Campos v. Tubi was filed with the U.S. District Court for the Northern District of Illinois, Eastern Division (the “District Court”), alleging that Tubi shared viewer information with third parties in violation of the privacy protection provisions of the federal Video Privacy Protection Act (“VPPA”). After a determination that Campos lacked standing to sue Tubi, plaintiff’s counsel filed a new putative class action titled Gregory v. Tubi with the 17th Judicial Circuit Court in Winnebago County, Illinois (the “Illinois State Court”). On July 26, 2024, the parties entered into a Settlement and Release Agreement to resolve all claims, which includes the dismissal of the Campos lawsuit and settlement of the Gregory lawsuit. On January 24, 2025, the Illinois State \n87\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nCourt entered a final order approving the Settlement and Release Agreement. While \nten\n individuals appealed the Illinois State Court’s final order, the Illinois Court of Appeals dismissed their appeal on June 6, 2025. As a result, the Illinois State Court’s final order is now entered and final. The settlement did not have a material adverse effect on the Company’s business, financial condition, results of operations or cash flows. \nOn May 20, 2025, Tubi settled arbitration claims brought on behalf of approximately \n23,000\n individuals in 2024 that involved the alleged misuse of personal information. The settlement did not have a material adverse effect on the Company’s business, financial condition, results of operations or cash flows. \nVenu Sports\nIn February 2024, FOX announced that it would enter into a joint venture with ESPN, a subsidiary of Disney, and WBD to form a digital distribution platform focused on sports called Venu Sports. On February 20, 2024, FuboTV Inc. and FuboTV Media Inc (collectively, “Fubo”) filed a lawsuit against Disney, ESPN, Inc., ESPN Enterprises, Inc., HULU, LLC, FOX and WBD in the U.S. District Court for the Southern District of New York alleging claims under federal and New York antitrust laws.\nOn January 6, 2025, Disney and Fubo announced that they have entered into an agreement to combine the Hulu + Live TV business with Fubo, forming a combined virtual MVPD company (the “Disney/Fubo Transaction”). In conjunction with the Disney/Fubo Transaction, Fubo and the defendants settled the Venu Sports lawsuit and the defendants made an aggregate $\n220\n million settlement payment to Fubo, of which approximately $\n80\n million was the Company’s portion, which was recorded in Restructuring, impairment and other corporate matters in the Statements of Operations during the three months ended December 31, 2024. On January 10, 2025, the defendants announced their decision to discontinue the Venu Sports joint venture and not launch its streaming service effective immediately, and as a result the Company wrote off the previously capitalized costs. Under certain circumstances, including if the Disney/Fubo Transaction does not close due to the failure to obtain certain regulatory approvals, a termination fee of $\n130\n million will be payable to Fubo. Concurrently with the Disney/Fubo transaction, Disney has committed to provide Fubo a senior unsecured term loan of up to $\n145\n million in January 2026. If any such payment is required for the termination fee or senior unsecured term loan, it will be paid by FOX, Disney and WBD.\nOther\nThe Company’s operations are subject to tax primarily in various domestic jurisdictions and as a matter of course, the Company is regularly audited by federal and state tax authorities. The Company believes it has appropriately accrued for the expected outcome of all pending tax matters and does not currently anticipate that the ultimate resolution of pending tax matters will have a material adverse effect on its consolidated financial condition, future results of operations or liquidity. In connection with the Transaction, each member of the 21CF consolidated group, which includes 21CF, the Company (prior to the Transaction) and 21CF’s other subsidiaries, is jointly and severally liable for the U.S. federal income and, in certain jurisdictions, state tax liabilities of each other member of the consolidated group. Consequently, the Company could be liable in the event any such liability is incurred, and not discharged, by any other member of the 21CF consolidated group. The tax matters agreement entered into in connection with the Transaction requires 21CF and/or Disney to indemnify the Company for any such liability. Disputes or assessments could arise during future audits by the IRS in amounts that the Company cannot quantify.\nNOTE 15. \nPENSION AND OTHER POSTRETIREMENT BENEFITS\nThe Company participates in and/or sponsors various pension, savings and postretirement benefit plans. Pension plans and postretirement benefit plans are closed to new participants with the exception of a small group covered by collective bargaining agreements. The Company has a legally enforceable obligation to contribute to some plans and is not required to contribute to others. The plans include both defined benefit pension plans and employee non-contributory and employee contributory accumulation plans covering all eligible employees. The Company makes contributions in accordance with applicable laws or contract terms.\nPension and postretirement plans that are sponsored by the Company are accounted for as defined benefit pension plans. Accordingly, the funded and unfunded position of each plan is recorded in the Balance Sheets. Actuarial gains and losses that have not yet been recognized through income are recorded in \n88\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nAccumulated other comprehensive loss net of taxes, and they are systematically amortized as a component of net periodic benefit cost. The Company’s benefit obligation for the plans is calculated using assumptions which the Company reviews on a regular basis. The funded status of the plans can change from year to year, but the assets of the funded plans have been sufficient to pay all benefits that came due in each of fiscal 2025, 2024 and 2023.\nThe Company uses a June 30 measurement date for all pension and postretirement benefit plans. The following table sets forth the change in the projected benefit obligation, change in the fair value of plan assets and funded status for the Company’s pension and postretirement benefit plans:\nPension benefits \nPostretirement benefits \nAs of June 30, \n2025\n2024\n2025\n2024\n(in millions) \nProjected benefit obligation, beginning of the year\n$\n1,119\n \n$\n1,172\n \n$\n45\n \n$\n47\n \nService cost\n23\n \n27\n \n1\n \n—\n \nInterest cost\n57\n \n61\n \n2\n \n2\n \nBenefits paid\n(\n44\n)\n(\n43\n)\n(\n3\n)\n(\n3\n)\nSettlements\n(a)\n(\n37\n)\n(\n50\n)\n—\n \n—\n \nActuarial losses (gains)\n(b)\n37\n \n(\n48\n)\n(\n1\n)\n(\n1\n)\nProjected benefit obligation, end of the year\n1,155\n \n1,119\n \n44\n \n45\n \nChange in the fair value of plan assets for the Company’s benefit plans:\nFair value of plan assets, beginning of the year\n891\n \n853\n \n—\n \n—\n \nActual return on plan assets\n54\n \n45\n \n—\n \n—\n \nEmployer contributions\n40\n \n86\n \n3\n \n3\n \nBenefits paid\n(\n44\n)\n(\n43\n)\n(\n3\n)\n(\n3\n)\nSettlements\n(a)\n(\n37\n)\n(\n50\n)\n—\n \n—\n \nFair value of plan assets, end of the year\n904\n \n891\n \n—\n \n—\n \nFunded status\n(c)\n$\n(\n251\n)\n$\n(\n228\n)\n$\n(\n44\n)\n$\n(\n45\n)\nGrantor Trust assets\n(c)\n$\n265\n \n$\n266\n \n$\n—\n \n$\n—\n \n(a)\nRepresents the full settlement of former employees’ deferred pension benefit obligations through lump sum payments.\n(b)\nActuarial losses for June 30, 2025 and actuarial gains for June 30, 2024 were primarily due to a change in the mortality assumption and higher interest rates, respectively, utilized in measuring the plan obligations.\n(c)\nThe Company has established an irrevocable grantor trust (the “Grantor Trust”), administered by an independent trustee, with the intention of making cash contributions to the Trust to fund certain future pension benefit obligations of the Company. The assets in the Grantor Trust are unsecured funds of the Company and can be used to satisfy the Company’s obligations in the event of bankruptcy or insolvency.\n89\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nAmounts recognized in the Balance Sheets consist of:\nPension benefits \nPostretirement benefits \nAs of June 30,\n2025\n2024\n2025\n2024\n(in millions) \nPension assets\n$\n10\n \n$\n36\n \n$\n—\n \n$\n—\n \nAccrued pension liabilities\n(\n261\n)\n(\n264\n)\n(\n44\n)\n(\n45\n)\nNet amounts recognized\n$\n(\n251\n)\n$\n(\n228\n)\n$\n(\n44\n)\n$\n(\n45\n)\nAmounts recognized in Accumulated other comprehensive loss, before tax, consist of:\nPension benefits\nPostretirement benefits\nAs of June 30,\n2025\n2024\n2025\n2024\n(in millions)\nActuarial losses (gains)\n$\n197\n \n$\n169\n \n$\n(\n27\n)\n$\n(\n30\n)\nAccumulated pension benefit obligations as of June 30, 2025 and 2024 were $\n1.05\n billion and $\n1.01\n billion, respectively. As of June 30, 2025 and 2024, the fair value of plan assets exceeds the projected benefit obligation and accumulated benefit obligation for each funded plan. As of June 30, 2025 and 2024, the projected benefit obligation and accumulated benefit obligation exceeds the fair value of plan assets for each unfunded plan. \nInformation about funded and unfunded pension plans is presented below:\nFunded plans\nUnfunded plans\nAs of June 30,\n2025\n2024\n2025\n2024\n(in millions)\nProjected benefit obligation\n$\n894\n \n$\n855\n \n$\n261\n \n$\n264\n \nAccumulated benefit obligation\n794\n \n747\n \n256\n \n260\n \nFair value of plan assets\n904\n \n891\n \n—\n \n(a)\n—\n \n(a)\n(a)\nThe fair value of the assets in the Grantor Trust as of June 30, 2025 and 2024 was $\n265\n million and $\n266\n million, respectively.\nThe components of net periodic benefit costs were as follows:\nPension benefits \nPostretirement benefits \nFor the years ended June 30,\n2025\n2024\n2023\n2025\n2024\n2023\n(in millions) \nService cost\n$\n23\n \n$\n27\n \n$\n30\n \n$\n1\n \n$\n—\n \n$\n1\n \nInterest cost\n57\n \n61\n \n52\n \n2\n \n2\n \n2\n \nExpected return on plan assets\n(\n50\n)\n(\n45\n)\n(\n40\n)\n—\n \n—\n \n—\n \nAmortization of deferred losses (gains)\n5\n \n12\n \n23\n \n(\n4\n)\n(\n4\n)\n(\n4\n)\nNet periodic benefit costs\n$\n35\n \n$\n55\n \n$\n65\n \n$\n(\n1\n)\n$\n(\n2\n)\n$\n(\n1\n)\nThe components of net periodic benefit costs other than the service cost component are included in Non- operating other, net in the Statements of Operations.\n90\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nPension benefits\nPostretirement benefits\nFor the years ended June 30,\n2025\n2024\n2023\n2025\n2024\n2023\nAdditional information\nWeighted-average assumptions used to determine benefit obligations\nDiscount rate\n5.5\n \n%\n5.5\n \n%\n5.3\n \n%\n5.3\n \n%\n5.4\n \n%\n5.3\n \n%\nWeighted-average assumptions used to determine net periodic benefit costs\nDiscount rate for service cost\n5.5\n \n%\n5.3\n \n%\n4.8\n \n%\n5.5\n \n%\n5.3\n \n%\n4.8\n \n%\nDiscount rate for interest cost\n5.3\n \n%\n5.4\n \n%\n4.5\n \n%\n5.3\n \n%\n5.4\n \n%\n4.5\n \n%\nExpected return on plan assets\n5.6\n \n%\n5.3\n \n%\n5.0\n \n%\nN/A\nN/A\nN/A\nN/A – not applicable.\nThe Company utilizes a full yield curve approach in the estimation of the service and interest components of net periodic benefit costs for pension and postretirement benefits by applying the specific spot rates along the yield curve used in the determination of the benefit obligation to their underlying projected cash flows. The Company utilizes the latest mortality table released by the Society of Actuaries with adjustments to reflect plan specific characteristics.\nThe following assumed health care cost trend rates were also used in accounting for postretirement benefits:\nPostretirement benefits\nAs of June 30, \n2025\n2024\nHealth care cost trend rate\n6.4\n \n%\n6.6\n \n%\nRate to which the cost trend rate is assumed to decline (the ultimate trend rate)\n4.9\n \n%\n4.9\n \n%\nYear that the rate reaches the ultimate trend rate\n2031\n2031\nThe following table sets forth the estimated benefit payments and estimated settlements for the next five fiscal years and in aggregate for the five fiscal years thereafter. These payments are estimated based on the same assumptions used to measure the Company’s benefit obligation at the end of the fiscal year and include benefits attributable to estimated future employee service:\nExpected benefit payments\nPension\nbenefits\nPostretirement\nbenefits\n(in millions)\nFiscal year\n2026\n$\n88\n \n$\n3\n \n2027\n87\n \n4\n \n2028\n89\n \n4\n \n2029\n96\n \n4\n \n2030\n98\n \n4\n \n2031-2035\n482\n \n19\n \n91\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nThe above table presents expected benefit payments for the postretirement benefits net of a nominal amount of U.S. Medicare subsidy receipts per year.\nPlan Assets and Grantor Trust\nThe following tables present Plan assets for the Company’s funded pension plans and Grantor Trust assets to fund certain future unfunded pension benefit obligations of the Company. \nThe assets are classified by level within the fair value hierarchy, as described in Note 6—Fair Value, as of June 30, 2025 and 2024:\nAs of June 30, 2025\nFair value measurements at reporting date using\nAssets measured\nTotal\nLevel 1\nat NAV\n(a)\n(in millions)\nPension plan assets\nPooled funds\n(b)\nMoney market funds\n$\n35\n \n$\n35\n \n$\n—\n \nDomestic equity funds\n116\n \n116\n \n—\n \nDomestic fixed income funds\n(c)\n582\n \n582\n \n—\n \nInternational equity funds\n83\n \n83\n \n—\n \nBalanced funds\n55\n \n55\n \n—\n \nPartnership interests\n33\n \n—\n \n33\n \nTotal fair value of plan assets\n$\n904\n \n$\n871\n \n$\n33\n \nGrantor Trust assets\nPooled funds\n(b)\nMoney market funds\n$\n8\n \n$\n8\n \n$\n—\n \nDomestic fixed income funds\n(c)\n68\n \n68\n \n—\n \nBalanced funds\n60\n \n60\n \n—\n \nDomestic government obligations\n(d)\n128\n \n128\n \n—\n \nOther\n(e)\n1\n \n1\n \n—\n \nTotal fair value of Grantor Trust assets\n$\n265\n \n$\n265\n \n$\n—\n \n92\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nAs of June 30, 2024\nFair value measurements at reporting \ndate using\nAssets measured\nTotal\nLevel 1 \nat NAV\n(a)\n(in millions)\nPension plan assets\nPooled funds\n(b)\nMoney market funds\n$\n12\n \n$\n12\n \n$\n—\n \nDomestic equity funds\n156\n \n156\n \n—\n \nDomestic fixed income funds\n(c)\n488\n \n488\n \n—\n \nInternational equity funds\n118\n \n118\n \n—\n \nBalanced funds\n69\n \n69\n \n—\n \nPartnership interests\n48\n \n—\n \n48\n \nTotal fair value of plan assets\n$\n891\n \n$\n843\n \n$\n48\n \nGrantor Trust assets\nPooled funds\n(b)\nMoney market funds\n$\n26\n \n$\n26\n \n$\n—\n \nDomestic fixed income funds\n(c)\n66\n \n66\n \n—\n \nBalanced funds\n53\n \n53\n \n—\n \nDomestic government obligations\n(d)\n120\n \n120\n \n—\n \nOther\n(e)\n1\n \n1\n \n—\n \nTotal fair value of Grantor Trust assets\n$\n266\n \n$\n266\n \n$\n—\n \n(a)\nInvestments that are measured at fair value using the net asset value (“NAV”) per share (or its equivalent) as a practical expedient are excluded from the fair value hierarchy disclosure. These investments have monthly liquidity.\n(b)\nPooled funds that have a readily determinable fair value are valued at the regularly published NAV.\n(c)\nDomestic fixed income funds consist primarily of investment grade securities.\n(d)\nGovernment obligations consist of investment grade securities whose fair value is based on observable market data obtained from dealers and brokers.\n(e)\nIncludes cash and cash equivalents.\nThe investment objective for the funded pension plans is to grow assets at a level commensurate with the growth in the liability while minimizing funded status volatility. The asset allocation strategy will change over time by shifting assets from return seeking assets to liability hedging assets upon the achievement of certain funding milestones. Return seeking assets are diversified across equity, fixed income and other investments and liability hedging assets are primarily fixed income investments, which are managed to correlate highly with the pension liabilities to reduce interest rate risk. The target asset allocation on June 30, 2025 is \n32\n% return seeking assets and \n68\n% liability hedging assets which approximates the actual asset allocation as of June 30, 2025. Assets are generally managed by external investment managers. The expected long-term rate of return on asset assumption is determined using the current target asset allocation and applying expected future returns for the various asset classes and correlations amongst the asset classes.\n93\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nThe funded plans weighted-average asset allocation, by asset category, are as follows:\nPension benefits\nAs of June 30,\n2025\n2024\nAsset category\nEquity investments\n22\n \n%\n31\n \n%\nFixed income investments, including cash\n72\n \n61\n \nOther\n6\n \n8\n \nTotal\n100\n \n%\n100\n \n%\nRequired pension plan contributions for the next fiscal year are not expected to be material; however, actual contributions may be affected by pension asset and liability valuation changes during the year. The Company will continue to make voluntary contributions as necessary to improve funded status.\nDefined Contribution Plans\nThe Company has defined contribution plans for the benefit of substantially all employees meeting certain eligibility requirements. Employer contributions to such plans were $\n74\n million, $\n70\n million and $\n68\n million for fiscal 2025, 2024 and 2023, respectively.\nNOTE 16. \nINCOME TAXES\nIncome before income tax expense was attributable primarily to the U.S. jurisdiction. Significant components of the Company’s provision for income taxes were as follows:\nFor the years ended June 30,\n2025\n2024\n2023\n(in millions)\nU.S.\nFederal\n$\n429\n \n$\n300\n \n$\n127\n \nState, local and other\n175\n \n47\n \n35\n \nTotal current\n604\n \n347\n \n162\n \nDeferred\n164\n \n203\n \n321\n \nProvision for income taxes\n$\n768\n \n$\n550\n \n$\n483\n \nThe following table is a reconciliation of income tax computed at the statutory rate to income tax expense:\nFor the years ended June 30,\n2025\n2024\n2023\nU.S. federal income tax rate\n21\n \n%\n21\n \n%\n21\n \n%\nState and local taxes\n3\n \n4\n \n4\n \nEffect of enacted tax law changes\n—\n \n(\n2\n)\n1\n \nValuation allowance movement\n—\n \n2\n \n2\n \nNondeductible compensation\n1\n \n1\n \n—\n \nEffective tax rate\n25\n \n%\n26\n \n%\n28\n \n%\n94\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nThe following is a summary of the components of the deferred tax accounts:\nAs of June 30,\n2025\n2024\n(in millions) \nDeferred tax assets\nBasis difference\n(a)\n$\n2,288\n \n$\n2,645\n \nOperating lease liabilities\n210\n \n232\n \nSports rights contracts\n90\n \n—\n \nNet operating loss carryforwards\n48\n \n38\n \nTax credit carryforwards\n45\n \n96\n \nEquity-based compensation\n44\n \n39\n \nOther\n339\n \n238\n \nTotal deferred tax assets\n3,064\n \n3,288\n \nDeferred tax liabilities\nOperating lease ROU assets\n(\n198\n)\n(\n220\n)\nAccrued liabilities\n(\n10\n)\n(\n24\n)\nPension benefit obligations\n—\n \n(\n19\n)\nSports rights contracts\n—\n \n(\n33\n)\nTotal deferred tax liabilities\n(\n208\n)\n(\n296\n)\nNet deferred tax asset before valuation allowance\n2,856\n \n2,992\n \nLess: valuation allowance\n(\n140\n)\n(\n119\n)\nTotal net deferred tax assets\n(b)\n$\n2,716\n \n$\n2,873\n \n(a)\nAs a result of the Transaction (See Note 14—Commitments and Contingencies under the heading \"Other\"), which was a taxable transaction for which the estimated tax liability of $\n5.8\n billion was included in the transaction tax paid by the Company, FOX obtained a tax basis in its assets equal to their respective fair market values. This amount includes the remaining estimated deferred tax asset recorded as a result of the additional tax basis.\n(b)\nIncludes a $\n5\n million deferred tax liability recorded in Other liabilities in the Balance Sheets as of June 30, 2025 and 2024.\nAs of June 30, 2025, the Company had $\n48\n million of tax attributes from net operating loss carryforwards available to offset future taxable income. A substantial portion of these losses can be carried forward indefinitely. As of June 30, 2025, the Company has $\n45\n million of tax credit carryforwards primarily attributable to the corporate alternative minimum tax credit which can be carried forward indefinitely.\nThe net increase in the valuation allowance to $\n140\n million as of June 30, 2025 was primarily due to the additional valuation allowance required on tax attributes.\n95\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nThe following table sets forth the change in the uncertain tax positions, excluding interest and penalties:\nFor the years ended June 30,\n2025\n2024\n2023\n(in millions) \nBalance, beginning of year\n$\n26\n \n$\n26\n \n$\n28\n \nAdditions for prior year tax positions\n(a)\n26\n \n6\n \n2\n \nAdditions for current year tax positions\n—\n \n—\n \n2\n \nReduction for prior year tax positions\n(b)\n(\n2\n)\n(\n6\n)\n(\n6\n)\nBalance, end of year\n$\n50\n \n$\n26\n \n$\n26\n \n(a)\nThe additions for prior year tax positions in fiscal 2025 is primarily due to federal tax matters related to the corporate alternative minimum tax. The additions for prior year tax positions in fiscal 2024 is primarily due to the impact of state tax law changes.\n(b)\nThe reduction for tax positions was primarily due to audit settlements or the expiration of statutes of limitations.\nThe Company recognizes interest and penalty charges related to uncertain tax positions as income tax (expense) benefit. The Company recorded liabilities for accrued interest of $\n15\n million and $\n12\n million as of June 30, 2025 and 2024, respectively, and the amounts of interest income/expense recorded in each of fiscal 2025, 2024 and 2023 were not material.\nThe Company is subject to tax primarily in various domestic jurisdictions and, as a matter of ordinary course, the Company is regularly audited by federal and state tax authorities. The Company believes it has appropriately accrued for the expected outcome of all pending tax matters and does not anticipate that the resolution of these pending tax matters will have a material adverse effect on its consolidated financial condition, future results of operations or liquidity. The movement in the balance of uncertain tax positions in fiscal 2025 is primarily attributable to federal tax matters. The Company does not expect significant changes to these positions over the next 12 months. As of June 30, 2025 and 2024, $\n20\n million would affect the Company’s effective income tax rate if the Company’s position with respect to the uncertainties is sustained.\nNOTE 17. \nSEGMENT INFORMATION\nThe Company is a news, sports and entertainment company, which manages and reports its businesses in \nfour\n operating segments: Cable Network Programming, Television, Credible and the FOX Studio Lot with the following \ntwo\n reportable segments:\n•\nCable Network Programming\n, which produces and licenses news and sports content distributed through MVPDs and other digital platforms, primarily in the U.S.\n•\nTelevision\n, which produces, acquires, markets and distributes programming through the FOX broadcast network, advertising supported video-on-demand service Tubi, \n29\n full power broadcast television stations, including \n11\n duopolies, and other digital platforms, primarily in the U.S. \nEighteen\n of the broadcast television stations are affiliated with the FOX Network and \n11\n are affiliated with MyNetworkTV. The segment also includes various production companies that produce content for the Company and third parties.\nThe Credible and the FOX Studio Lot operating segments do not meet the criteria under GAAP to be separately reported as a reportable segment or aggregated with other operating segments, and as such are presented as part of Corporate and Other, which is not a reportable segment. Corporate and Other principally consists of Credible, the FOX Studio Lot and corporate overhead costs. Credible is a U.S. consumer finance marketplace. The FOX Studio Lot, located in Los Angeles, California, provides television and film production services along with office space, studio operation services and includes all operations of the facility.\n96\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nThe Company’s operating segments have been determined in accordance with the Company’s internal management structure, which is organized based on operating activities. The Company evaluates performance based upon several factors, of which the primary financial measure is Segment EBITDA (defined below). Due to the integrated nature of these operating segments, estimates and judgments are made in allocating certain assets, revenues and expenses. Intersegment transactions principally relate to the sublicensing of sports content and rental of studio and administrative space, which are recorded consistently with the recognition of transactions with third parties and are eliminated in consolidation.\nSegment EBITDA is defined as Revenues less Operating expenses and Selling, general and administrative expenses. Segment EBITDA does not include: Amortization of cable distribution investments, Depreciation and amortization, Restructuring, impairment and other corporate matters, Equity earnings (losses) of affiliates, Interest expense, net, Non-operating other, net and Income tax expense. Management believes that Segment EBITDA is an appropriate measure for evaluating the operating performance of the Company’s operating segments because it is the primary measure used by the Company’s chief operating decision maker, the Chief Executive Officer, to monitor actual versus budget and prior fiscal year financial results, forecast future periods and perform competitive analyses to evaluate performance and allocate resources.\nThe tables below present summarized financial information for each of the Company’s reportable segments and Corporate and Other.\nFor the years ended June 30, \n2025\n2024\n2023\n(in millions) \nRevenues\nCable Network Programming\n$\n6,930\n \n$\n5,955\n \n$\n6,043\n \nTelevision\n9,325\n \n7,875\n \n8,710\n \nCorporate and Other\n244\n \n209\n \n217\n \nEliminations\n(\n199\n)\n(\n59\n)\n(\n57\n)\nTotal revenues\n$\n16,300\n \n$\n13,980\n \n$\n14,913\n \nSegment EBITDA\nCable Network Programming\n$\n3,030\n \n$\n2,693\n \n$\n2,472\n \nTelevision\n945\n \n506\n \n1,009\n \nCorporate and Other\n(\n351\n)\n(\n316\n)\n(\n290\n)\nAmortization of cable distribution investments\n(\n10\n)\n(\n16\n)\n(\n16\n)\nDepreciation and amortization\n(\n385\n)\n(\n389\n)\n(\n411\n)\nRestructuring, impairment and other corporate matters\n(\n350\n)\n(\n67\n)\n(\n1,182\n)\nEquity (losses) earnings of affiliates\n(\n29\n)\n(\n44\n)\n4\n \nInterest expense, net\n(\n227\n)\n(\n216\n)\n(\n218\n)\nNon-operating other, net\n438\n \n(\n47\n)\n368\n \nIncome before income tax expense\n3,061\n \n2,104\n \n1,736\n \nIncome tax expense\n(\n768\n)\n(\n550\n)\n(\n483\n)\nNet income\n2,293\n \n1,554\n \n1,253\n \nLess: Net income attributable to noncontrolling interests\n(\n30\n)\n(\n53\n)\n(\n14\n)\nNet income attributable to Fox Corporation stockholders\n$\n2,263\n \n$\n1,501\n \n$\n1,239\n \n97\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFor the years ended June 30,\n2025\n2024\n2023\n(in millions)\nReconciliation of Revenues to Segment EBITDA\nCable Network Programming\nRevenues\n$\n6,930\n \n$\n5,955\n \n$\n6,043\n \nOperating expenses\n(\n3,275\n)\n(\n2,668\n)\n(\n2,927\n)\nSelling, general and administrative\n(\n635\n)\n(\n610\n)\n(\n660\n)\nAmortization of cable distribution investments\n10\n \n16\n \n16\n \nSegment EBITDA\n$\n3,030\n \n$\n2,693\n \n$\n2,472\n \nTelevision\nRevenues\n$\n9,325\n \n$\n7,875\n \n$\n8,710\n \nOperating expenses\n(\n7,308\n)\n(\n6,372\n)\n(\n6,704\n)\nSelling, general and administrative\n(\n1,072\n)\n(\n997\n)\n(\n997\n)\nSegment EBITDA\n$\n945\n \n$\n506\n \n$\n1,009\n \nFor the years ended June 30,\n2025\n2024\n2023\n(in millions)\nRevenues by Segment by Component\nCable Network Programming\nAffiliate fee\n$\n4,316\n \n$\n4,188\n \n$\n4,175\n \nAdvertising\n1,531\n \n1,262\n \n1,403\n \nOther\n1,083\n \n505\n \n465\n \nTotal Cable Network Programming revenues\n6,930\n \n5,955\n \n6,043\n \nTelevision\nAdvertising\n5,334\n \n4,182\n \n5,204\n \nAffiliate fee\n3,340\n \n3,136\n \n2,876\n \nOther\n651\n \n557\n \n630\n \nTotal Television revenues\n9,325\n \n7,875\n \n8,710\n \nCorporate and Other\n244\n \n209\n \n217\n \nEliminations\n(\n199\n)\n(\n59\n)\n(\n57\n)\nTotal revenues\n$\n16,300\n \n$\n13,980\n \n$\n14,913\n \nFor fiscal 2025, 2024 and 2023, the Company had no individual customers that accounted for 10% or more of Revenues.\nFor the years ended June 30,\n2025\n2024\n2023\n(in millions)\nDepreciation and amortization\nCable Network Programming\n$\n94\n \n$\n77\n \n$\n71\n \nTelevision\n119\n \n117\n \n126\n \nCorporate and Other\n172\n \n195\n \n214\n \nTotal depreciation and amortization\n$\n385\n \n$\n389\n \n$\n411\n \n98\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFor the years ended June 30,\n2025\n2024\n2023\n(in millions)\nCapital expenditures\nCable Network Programming\n$\n127\n \n$\n161\n \n$\n66\n \nTelevision\n82\n \n76\n \n96\n \nCorporate and Other\n122\n \n108\n \n195\n \nTotal capital expenditures\n$\n331\n \n$\n345\n \n$\n357\n \nAs of June 30,\n2025\n2024\n(in millions)\nAssets\nCable Network Programming\n$\n2,895\n \n$\n2,792\n \nTelevision\n7,924\n \n7,961\n \nCorporate and Other\n10,755\n \n10,090\n \nInvestments\n1,621\n \n1,129\n \nTotal assets\n$\n23,195\n \n$\n21,972\n \n \nAs of June 30,\n \n2025\n2024\n \n(in millions)\nGoodwill and intangible assets, net\nCable Network Programming\n$\n1,290\n \n$\n1,288\n \nTelevision\n4,636\n \n4,605\n \nCorporate and Other\n682\n \n689\n \nTotal goodwill and intangible assets, net\n$\n6,608\n \n$\n6,582\n \nNOTE 18. \nEARNINGS PER SHARE\nThe following table sets forth the computation of basic and diluted earnings per share:\n \nFor the years ended June 30,\n \n2025\n2024\n \n2023\n \n(in millions, except per share amounts)\nNet income attributable to Fox Corporation stockholders\n$\n2,263\n \n$\n1,501\n \n$\n1,239\n \nWeighted average shares - basic\n455\n \n478\n \n529\n \nShares issuable under equity-based compensation plans\n(a)\n6\n \n2\n \n2\n \nWeighted average shares - diluted\n461\n \n480\n \n531\n \nNet income attributable to Fox Corporation stockholders per share - basic\n$\n4.97\n \n$\n3.14\n \n$\n2.34\n \nNet income attributable to Fox Corporation stockholders per share - diluted\n$\n4.91\n \n$\n3.13\n \n$\n2.33\n \n(a)\nWeighted average common shares include the incremental shares that would be issued upon the assumed vesting of RSUs, PSUs and stock options (including PSOs) if the effect is dilutive, and, for those shares that are contingently issuable, all necessary conditions have been satisfied for the periods presented (See Note 12—Equity-Based Compensation).\n99\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 19. \nVALUATION AND QUALIFYING ACCOUNTS\nThe changes in valuation and qualifying accounts were as follows:\nBalance as\nof beginning\nof year\nAdditions \nUtilization\nOther\nBalance as\nof end of\nyear\n(in millions) \nFiscal 2025\nAllowance for credit losses\n$\n(\n44\n)\n$\n(\n9\n)\n$\n3\n \n$\n—\n \n$\n(\n50\n)\nDeferred tax valuation allowance\n(\n119\n)\n(\n15\n)\n1\n \n(\n7\n)\n(\n140\n)\n \nFiscal 2024\nAllowance for credit losses\n$\n(\n44\n)\n$\n(\n8\n)\n$\n5\n \n$\n3\n \n$\n(\n44\n)\nDeferred tax valuation allowance\n(\n72\n)\n(\n52\n)\n3\n \n2\n \n(\n119\n)\n \nFiscal 2023\nAllowance for credit losses\n$\n(\n54\n)\n$\n—\n \n$\n3\n \n$\n7\n \n$\n(\n44\n)\nDeferred tax valuation allowance\n(\n34\n)\n(\n38\n)\n—\n \n—\n \n(\n72\n)\nNOTE 20. \nADDITIONAL FINANCIAL INFORMATION\nInterest Expense, net\nThe following table sets forth the components of Interest expense, net included in the Statements of Operations:\nFor the years ended June 30,\n2025\n2024\n2023\n(in millions) \nInterest expense\n$\n(\n403\n)\n$\n(\n405\n)\n$\n(\n349\n)\nInterest income\n176\n \n189\n \n131\n \nTotal interest expense, net\n$\n(\n227\n)\n$\n(\n216\n)\n$\n(\n218\n)\nNon-Operating Other, net\nThe following table sets forth the components of Non-operating other, net included in the Statements of Operations:\nFor the years ended June 30,\n2025\n2024\n2023\n(in millions) \nNet gains (losses) on investments in equity securities\n(a)\n$\n449\n \n$\n(\n189\n)\n$\n403\n \nGain on sale of assets\n(b)\n—\n \n166\n \n—\n \nOther\n(\n11\n)\n(\n24\n)\n(\n35\n)\nTotal non-operating other, net\n$\n438\n \n$\n(\n47\n)\n$\n368\n \n(a)\nNet gains (losses) on investments in equity securities includes the gains (losses) related to the change in fair value of the Company’s investment in Flutter (See Note 6—Fair Value), and for the year ended June 30, 2024, the losses related to the Company’s investment in a live streaming mobile platform.\n(b)\nSee Note 3—Acquisitions, Disposals and Other Transactions.\n100\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nOther Non-Current Assets\nThe following table sets forth the components of Other non-current assets included in the Balance Sheets:\nAs of June 30,\n2025\n2024\n(in millions)\nInvestments\n(a)\n$\n1,621\n \n$\n1,129\n \nOperating lease assets\n814\n \n904\n \nInventories, net\n742\n \n712\n \nGrantor Trust assets - long-term\n246\n \n247\n \nOther\n309\n \n323\n \nTotal other non-current assets\n$\n3,732\n \n$\n3,315\n \n(a)\nIncludes investments accounted for at fair value on a recurring basis of $\n1.2\n billion and $\n797\n million as of June 30, 2025 and 2024, respectively (See Note 6—Fair Value). \nAccounts Payable, Accrued Expenses and Other Current Liabilities\nThe following table sets forth the components of Accounts payable, accrued expenses and other current liabilities included in the Balance Sheets:\n \nAs of June 30,\n \n2025\n2024\n \n(in millions)\nAccrued expenses\n$\n1,081\n \n$\n1,006\n \nProgramming payable\n1,070\n \n683\n \nDeferred revenue\n299\n \n180\n \nOperating lease liabilities\n41\n \n76\n \nOther current liabilities\n406\n \n408\n \nTotal accounts payable, accrued expenses and other current liabilities\n$\n2,897\n \n$\n2,353\n \nOther Liabilities\nThe following table sets forth the components of Other liabilities included in the Balance Sheets:\n \nAs of June 30,\n \n2025\n2024\n \n(in millions)\nNon-current operating lease liabilities\n$\n822\n \n$\n879\n \nAccrued non-current pension/postretirement liabilities\n276\n \n276\n \nOther non-current liabilities\n243\n \n211\n \nTotal other liabilities\n$\n1,341\n \n$\n1,366\n \nFuture Performance Obligations\nAs of June 30, 2025, approximately $\n5.4\n billion of revenues are expected to be recognized primarily over the next one to three years. The Company’s most significant remaining performance obligations relate to affiliate contracts, content licensing contracts with fixed fees and sports advertising contracts. The amount disclosed does not include (i) revenues related to performance obligations that are part of a contract whose original expected duration is one year or less, (ii) revenues that are in the form of sales- or usage-based royalties and \n101\nFOX CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(iii) revenues related to performance obligations for which the Company elects to recognize revenue in the amount it has a right to invoice.\nSupplemental Information\nThe following table summarizes supplemental information on the Statements of Cash Flows:\nFor the years ended June 30,\n2025\n2024\n2023\n(in millions)\nSupplemental cash flow information\nCash paid for interest\n$\n(\n402\n)\n$\n(\n398\n)\n$\n(\n345\n)\nCash paid for income taxes\n$\n(\n515\n)\n$\n(\n232\n)\n$\n(\n245\n)\nNOTE 21. \nSUBSEQUENT EVENTS\nSubsequent to \nJune 30, 2025\n, the \nCompany\n increased its semi-annual dividend and declared a semi-annual dividend of \n$\n0.28\n per share on both the Class A Common Stock and the Class B Common Stock. The dividend declared is payable on \nSeptember 24, 2025\n with a record date for determining dividend entitlements of \nSeptember 3, 2025\n.\nSubsequent to \nJune 30, 2025\n, the \nCompany\n repurchased a total of approximately \n0.9\n million shares of Class A Common Stock for $\n50\n million in the open market.\nSubsequent to June 30, 2025, the Company announced that the Board has authorized incremental stock repurchases of an additional \n$\n5\n billion\n of Class A and Class B Common Stock. With this increase, the Company’s total stock repurchase authorization is now \n$\n12\n billion\n.\nIn July 2025, the Company acquired a noncontrolling minority interest in a sports and entertainment company. This investment will not have a material effect on the Company’s business, financial condition, results of operations or cash flows.\n102\nITEM 9.    CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE.\nNone.\nITEM 9A.    CONTROLS AND PROCEDURES.\nDisclosure Controls and Procedures\nThe Company’s management, with the participation of the Company’s Chief Executive Officer and Chief Financial Officer, has evaluated the effectiveness of the Company’s disclosure controls and procedures (as such term is defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the “Exchange Act”)) as of the end of the period covered by this Annual Report. Based on such evaluation, the Company’s Chief Executive Officer and Chief Financial Officer have concluded that, as of the end of such period, the Company’s disclosure controls and procedures were effective in recording, processing, summarizing and reporting on a timely basis, information required to be disclosed by the Company in the reports that it files or submits under the Exchange Act and were effective in ensuring that information required to be disclosed by the Company in the reports that it files or submits under the Exchange Act is accumulated and communicated to the Company’s management, including the Company’s Chief Executive Officer and Chief Financial Officer, as appropriate to allow timely decisions regarding required disclosure.\nManagement’s Annual Report on Internal Control Over Financial Reporting\nManagement’s report and the report of the independent registered public accounting firm thereon are set forth on pages \n52\n and \n53\n, respectively, and are incorporated herein by reference.\nChanges in Internal Control Over Financial Reporting\nThere were no changes in the Company’s internal control over financial reporting (as such term is defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) during the Company’s fourth quarter of fiscal 2025 that have materially affected, or are reasonably likely to materially affect, the Company’s internal control over financial reporting.\nITEM 9B.    OTHER INFORMATION.\nNone.\nITEM 9C.    DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS.\nNot applicable.\n103\nPART III \nITEMS 10, 11, 12, 13 AND 14.    DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE; EXECUTIVE COMPENSATION; SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS; CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE; PRINCIPAL ACCOUNTANT FEES AND SERVICES.\nThe information required by Items 10, 11, 12, 13 and 14 of Part III is incorporated by reference from the Company’s Definitive Proxy Statement to be filed in connection with its 2025 Annual Meeting of Stockholders pursuant to Regulation 14A.\n104\nPART IV \nITEM 15.    EXHIBITS AND FINANCIAL STATEMENT SCHEDULES.\nThe following documents are filed as part of this Annual Report:\n1.\nThe Company’s Consolidated Financial Statements required to be filed as part of this Annual Report and the Reports of Independent Registered Public Accounting Firm are included in Part II, Item 8. Financial Statements and Supplementary Data.\n2.\nAll other financial statement schedules are omitted because the required information is not applicable or because the information called for is included in the Company’s Consolidated Financial Statements or the Notes to the Consolidated Financial Statements.\n3.\nThe exhibits listed on the Exhibit Index below are filed or incorporated by reference as part of this Annual Report.\nEXHIBIT INDEX\nNumber\nDescription\n2.1\nSeparation Agreement, dated as of March 19, 2019, between Twenty-First Century Fox, Inc. and Fox Corporation (the \n“\nRegistrant\n”\n) (incorporated herein by reference to Exhibit 2.1 to the Registrant\n’\ns Current Report on Form 8-K dated March 14, 2019 and filed with the Securities and Exchange Commission (the \n“\nSEC\n”\n) on March 19, 2019 (the \n“\nMarch 2019 Form 8-K\n”\n). \nѱ\n2.2\nTax Matters Agreement, dated as of March 19, 2019, between Twenty-First Century Fox, Inc., the Registrant and The Walt Disney Company (incorporated herein by reference to Exhibit 2.2 to the March 2019 Form 8-K).\nѱ\n3.1\nAmended and Restated Certificate of Incorporation of the Registrant (incorporated herein by reference to Exhibit 3.1 to the Registrant’s Quarterly Report on Form 10-Q for the quarter ended December 31, 2022). \n3.2\nAmended and Restated By-laws of the Registrant (incorporated herein by reference to Exhibit 3.1 to the Registrant’s Current Report on Form 8-K dated February 6, 2024 and filed with the SEC on February 7, 2024)\n.\n4.1\nDescription of the Registrant’s Securities Registered Pursuant to Section 12 of the Securities Exchange Act of 1934.* \n4.2\nIndenture, dated as of January 25, 2019, between the Registrant and The Bank of New York Mellon, as trustee (incorporated by reference to Exhibit 4.1 to Amendment No. 2 to the Registration Statement on Form 10-12B/A filed with the SEC on January 25, 2019).\n10.1\nFox Corporation 2019 Shareholder Alignment Plan (incorporated herein by reference to Exhibit 10.1 to the March 14, 2019 Form 8-K).\n+\n10.2\nForm of Amended and Restated Indemnification Agreement (incorporated herein by reference to Exhibit 10.1 to the Registrant’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2023).\n+\n10.3\nForm of Fox Corporation 2019 Shareholder Alignment Plan Restricted Stock Unit Terms and Conditions (incorporated herein by reference to Exhibit 10.3 to the Registrant’s Annual Report on Form 10-K for the year ended June 30, 2023).\n+\n10.4\nForm of Fox Corporation 2019 Shareholder Alignment Plan Non-Qualified Stock Option Terms and Conditions (incorporated herein by reference to Exhibit 10.4 to the March 2019 Form 8-K).\n+\n10.5\nForm of Fox Corporation 2019 Shareholder Alignment Plan Non-Qualified Stock Option Terms and Conditions FY 2025 Annual Grant\n (incorporated herein by reference to E\nxhibit\n 10.5 to the Reg\nistrant\n’\ns Annual Report on Form 10-K for the \nfiscal year ended \nJune 30, 2024 (\nthe \n“\n2024 Form 10-K\n”\n))\n+\n10.6\nForm of Employment Agreement\n (incorporated herein by reference to Exhibit 10.1 to the Registrant’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2025).\n+\n105\n10.7\nLetter Agreement between Lachlan K. Murdoch and News Corporation dated November 17, 2008 (incorporated herein by reference to Exhibit 10.6 to the March 2019 Form 10-Q).\n+\n10.8\nLetter Agreements between John P. Nallen and News Corporation dated January 1, 2005 and November 17, 2008, as amended through June 3, 2013 (incorporated herein by reference to Exhibit 10.7 to the March 2019 Form 10-Q).\n+\n \n10.9\nLetter A\ngreement between Steven Tomsic and the Registrant dated November 17, 2023 (incorporated herein by reference to Exhibit 10.1 to the Registrant’s Quarterly Report on Form 10-Q for the quarter ended December 31, 2023\n).\n+\n10.10\nTransition and Separation Agreement, dated August 9, 2023, between the Registrant and Viet D. Dinh (incorporated herein by reference to Exhibit 10.1 to the Registrant’s Current Report on Form 8-K dated August 9, 2023 and filed with the SEC on August 11, 2023 (the “August 2023 Form 8-K”)\n)\n.\n+\n10.11\nAdvisory Services Agreement, dated August 9, 2023, by and among the Registrant, Viet D. Dinh, P.C. and Viet D. Dinh (incorporated herein by reference to Exhibit 10.2 to the August 2023 Form 8-K).\n+\n10.12\nCredit Agreement, dated as of June 14, 2023, among the Registrant, as Borrower, the initial lenders named therein, the initial issuing banks named therein, Citibank, N.A., as Administrative Agent, Deutsche Bank Securities Inc. and Goldman Sachs Bank USA, as Co-Syndication Agents, JPMorgan Chase Bank, N.A. and Morgan Stanley Senior Funding, Inc., as Co-Documentation Agents, and Citibank, N.A., Deutsche Bank Securities Inc., Goldman Sachs Bank USA, JPMorgan Chase Bank, N.A. and Morgan Stanley Senior Funding, Inc., as Joint Lead Arrangers and Joint Bookrunners (incorporated herein by reference to Exhibit 10.1 to the Registrant's Current Report on Form 8-K dated June 14, 2023 and filed with the SEC on June 15, 2023).\nѱ\n10.13\nStockholders Agreement, dated as of November 6, 2019, by and between the Registrant and the Murdoch Family Trust (incorporated herein by reference to Exhibit 10.1 to the Registrant's Current Report on Form 8-K dated November 5, 2019 and filed with the SEC on November 6, 2019).\n19\nFox Corporation Insider Trading and Confidentiality Policy.*\n21\nSubsidiaries of the Registrant.* \n23.1\nConsent of Independent Registered Public Accounting Firm.*\n31.1\nChief Executive Officer Certification required by Rules 13a-14 and 15d-14 under the Securities Exchange Act of 1934, as amended.*\n31.2\nChief Financial Officer Certification required by Rules 13a-14 and 15d-14 under the Securities Exchange Act of 1934, as amended.*\n32.1\nCertification of Chief Executive Officer and Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of Sarbanes Oxley Act of 2002.**\n97\nFox Corporation Clawback Policy\n \n(incorporated herein by reference to Exhibit 97 to the 2024 Form 10-K). \n101\nThe following financial information from the Company’s Annual Report on Form 10-K for the fiscal year ended June 30, 2025 formatted in Inline XBRL (eXtensible Business Reporting Language): (i) Consolidated Statements of Operations for the fiscal years ended June 30, 2025, 2024 and 2023; (ii) Consolidated Statements of Comprehensive Income for the fiscal years ended June 30, 2025, 2024 and 2023; (iii) Consolidated Balance Sheets as of June 30, 2025 and 2024; (iv) Consolidated Statements of Cash Flows for the fiscal years ended June 30, 2025, 2024 and 2023; (v) Consolidated Statements of Equity for the fiscal years ended June 30, 2025, 2024 and 2023 and (vi) Notes to the Consolidated Financial Statements.*\n106\n104\nCover Page Interactive Data File (formatted in Inline XBRL and contained in Exhibit 101).\nѱ\nCertain schedules and exhibits have been omitted pursuant to Item 601(a)(5) of Regulation S-K. A copy of any omitted schedule or exhibit will be furnished supplementally to the SEC upon request.\n*\nFiled herewith.\n+\nThis exhibit is a management contract or compensatory plan or arrangement. \n**\nFurnished herewith.\nThe Registrant hereby agrees to furnish to the SEC at its request copies of long-term debt instruments defining the rights of holders of outstanding long-term debt that are not required to be filed herewith.\nITEM 16.    FORM 10-K SUMMARY.\nNot applicable.\n107\nSIGNATURES \nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized. \n \nFox Corporation\n(Registrant)\nBy:\n/\nS\n/ Steven Tomsic\n \nSteven Tomsic\nChief Financial Officer\nDate: August 6, 2025\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated:\n \nSignature\nTitle\nDate\n/\nS\n/ Lachlan K. Murdoch\n \nExecutive Chair and Chief Executive Officer\n(Principal Executive Officer)\nAugust 6, 2025\nLachlan K. Murdoch\n/\nS\n/ Steven Tomsic\nChief Financial Officer\n(Principal Financial and Accounting Officer)\nAugust 6, 2025\n \nSteven Tomsic\n /\nS\n/ Tony Abbott AC\nDirector\nAugust 6, 2025\nTony Abbott\n /\nS\n/ William A. Burck\nDirector\nAugust 6, 2025\n \nWilliam A. Burck\n /\nS\n/ Chase Carey\nDirector\nAugust 6, 2025\n \nChase Carey\n /\nS\n/ Roland A. Hernandez\nDirector\nAugust 6, 2025\n \nRoland A. Hernandez\n /\nS\n/ Margaret L. Johnson\nDirector\nAugust 6, 2025\nMargaret L. Johnson\n /\nS\n/ Paul D. Ryan\nDirector\nAugust 6, 2025\n \nPaul D. Ryan\n108"
  }
}