{
  "ticker": "FRT",
  "cik": "0000034903",
  "company_name": "FEDERAL REALTY INVESTMENT TRUST",
  "filing_date": "2025-02-13",
  "accession": "0000034903-25-000016",
  "primary_doc": "frt-20241231.htm",
  "item_sections": {
    "item1": "ITEM 1.    BUSINESS\nGeneral\nFederal Realty Investment Trust (the \"Parent Company\" or the \"Trust\") is an equity real estate investment trust (\"REIT\"). Federal Realty OP LP (the \"Operating Partnership\") is the entity through which the Trust conducts substantially all of its operations and owns substantially off of its assets. The Trust owns 100% of the limited liability company interest of, is sole member of, and exercises exclusive control over Federal Realty GP LLC (the \"General Partner\"), which in turn, is the sole \n3\nTable of Contents\ngeneral partner of the Operating Partnership. Unless stated otherwise or the context otherwise requires, \"we,\" \"our,\" and \"us\" means the Trust and its business and operations conducted through its directly and indirectly owned subsidiaries, including the Operating Partnership. We specialize in the ownership, management, and redevelopment of high quality retail and mixed-use properties located primarily in communities where we believe retail demand exceeds supply, in strategically selected metropolitan markets in the Mid-Atlantic and Northeast regions of the United States, California, and South Florida. As of December 31, 2024, we owned or had a majority interest in community and neighborhood shopping centers and mixed-use properties which are operated as 102 predominantly retail real estate projects comprising approximately 26.8 million commercial square feet. In total, the real estate projects were 96.2% leased and 94.1% occupied at December 31, 2024. Our revenue is primarily generated from lease agreements with tenants. We have paid quarterly dividends to our shareholders continuously since our founding in 1962 and have increased our dividends per common share for 57 consecutive years.\nWe were founded in 1962 as a REIT under the laws of the District of Columbia and re-formed as a REIT in the state of Maryland in 1999. In January of 2022, we consummated the UPREIT reorganization described in the Explanatory Note at the beginning of this Annual Report. We operate in a manner intended to qualify as a REIT for tax purposes pursuant to provisions of the Internal Revenue Code of 1986, as amended (the “Code”). Our principal executive offices are located at 909 Rose Avenue, North Bethesda, Maryland 20852. Our telephone number is (301) 998-8100. Our website address is \nwww.federalrealty.com\n. The information contained on our website is not a part of this report and is not incorporated herein by reference.\nBusiness Objectives and Strategies\nOur primary business objective is to own, manage, acquire and redevelop a portfolio of high quality retail focused properties that will:\n•\nprovide increasing cash flow for distribution to shareholders;\n•\ngenerate higher internal growth than the shopping center industry over the long term;\n•\nprovide potential for capital appreciation; and\n•\nprotect investor capital.\nOur portfolio includes, and we continue to acquire and redevelop, high quality retail in many formats ranging from regional, community and neighborhood shopping centers that often are anchored by grocery stores to mixed-use properties that are typically centered around a retail component but also include residential and office components.\nOperating Strategies\nWe continuously evaluate and assess our operating strategies to ensure they are effective and put us in the best position to address changes in the market. We actively manage our properties to maximize rents and maintain occupancy levels by attracting and retaining a strong and diverse base of tenants and replacing less relevant, weaker, underperforming tenants with stronger ones. Our properties are generally located in some of the most densely populated and affluent areas of the country. These strong demographics help our tenants generate higher sales, which has generally enabled us to maintain higher occupancy rates, charge higher rental rates, and maintain steady rent growth, all of which increase the value of our portfolio. Our operating strategies also include:\n•\nincreasing rental rates through the negotiation of contractual rental increases during the term of the lease, the renewal of expiring leases or the leasing of space to new tenants at higher rental rates while limiting vacancy and down-time;\n•\nmaintaining a diversified tenant base, thereby limiting exposure to any one tenant’s financial or operating difficulties;\n•\nactively managing the merchandising mix of our tenant base to achieve a balance of strong national and regional tenants with local specialty tenants;\n•\nminimizing overhead and operating costs;\n•\nactively managing the physical appearance of our properties and the construction quality, condition and design of the buildings and other improvements located on our properties to maximize our ability to attract customers and thereby generate higher rents and occupancy rates;\n•\nmanaging our properties to take into account their impact on climate change and their resilience in the face of climate change;\n•\ndeveloping local and regional market expertise in order to capitalize on market and retailing trends;\n•\nleveraging the contacts and experience of our management team to build and maintain long-term relationships with tenants; \n•\nproviding exceptional customer service; and\n•\ncreating an experience at many of our properties that is identifiable, unique and serves the surrounding communities to help insulate these properties and the tenants at these properties from the impact of on-line retailing.\n4\nTable of Contents\nInvesting Strategies\nOur investment strategy is to deploy capital at risk-adjusted rates of return that exceed our long-term weighted average cost of capital in projects that have potential for future income growth and increased value. Our investments primarily fall into one of the following four categories:\n•\nrenovating, expanding, reconfiguring and/or retenanting our existing properties to take advantage of under-utilized land or existing square footage to increase revenue;\n•\nrenovating or expanding tenant spaces for tenants capable of producing higher sales, and therefore, paying higher rents;\n•\nacquiring quality retail and mixed-use properties located in densely populated and/or affluent areas where barriers to entry for further development are high, and that have possibilities for enhancing operating performance and creating value through renovation, expansion, reconfiguration and/or retenanting; and\n•\ndeveloping the retail portions of mixed-use properties and developing or otherwise investing in non-retail portions of mixed-use properties we already own in order to capitalize on the overall value created in these properties.\nInvestment Criteria\nWhen we evaluate potential redevelopment, retenanting, expansion, acquisition and development opportunities, we consider such factors as:\n•\nthe expected returns in relation to our short and long-term cost of capital as well as the anticipated risk we will face in achieving the expected returns;\n•\nthe anticipated growth rate of operating income generated by the property;\n•\nthe ability to increase the long-term value of the property through redevelopment and retenanting;\n•\nthe tenant mix at the property, tenant sales performance and the creditworthiness of those tenants;\n•\nthe geographic area in which the property is located, including the population density, household incomes, education levels, as well as the population and income trends in that geographic area. This may from time to time include the evaluation of new markets;\n•\ncompetitive conditions in the vicinity of the property, including gross leasable area (GLA) per capita, competition for tenants and the ability of others to create competing properties through redevelopment, new construction or renovation;\n•\naccess to and visibility of the property from existing roadways and the potential for new, widened or realigned, roadways within the property’s trade area, which may affect access and commuting and shopping patterns;\n•\nthe level and success of our existing investments in the market area;\n•\nthe current market value of the land, buildings and other improvements and the potential for increasing those market values; and\n•\nthe physical condition of the land, buildings and other improvements, including the structural and environmental condition.\nFinancing Strategies\nOur financing strategies are designed to enable us to maintain an investment grade balance sheet while retaining sufficient flexibility to fund our operating and investing activities in the most cost-efficient way possible. Our financing strategies include:\n•\nmaintaining a prudent level of overall leverage and an appropriate pool of unencumbered properties that is sufficient to support our unsecured borrowings;\n•\nmanaging our exposure to variable-rate debt;\n•\nmaintaining sufficient levels of cash and available line of credit to fund operating and investing needs on a short-term basis;\n•\ntaking advantage of market opportunities to refinance existing debt, reduce interest costs and manage our debt maturity schedule so that a significant portion of our debt relative to our size does not mature in any one year;\n•\nselling properties that have limited growth potential or are not a strategic fit within our overall portfolio and redeploying the proceeds to redevelop, renovate, retenant and/or expand our existing properties, acquire new properties or reduce debt; and\n•\nutilizing the most advantageous long-term source of capital available to us to finance redevelopment and acquisition opportunities, which may include:\n◦\nthe sale of our equity or debt securities through public offerings, including our at-the-market (\"ATM\") equity program in which we may from time to time offer and sell common shares including through forward sales contracts, or private placements,\n◦\nthe incurrence of indebtedness through unsecured or secured borrowings including exchangeable debt,\n5\nTable of Contents\n◦\nthe issuance of units in our operating partnership (generally issued in exchange for a tax deferred contribution of property); these units typically receive the same distributions as our common shares and the holders of these units have the right to exchange their units for cash or common shares at our option, or\n◦\nthe use of joint venture arrangements.\nHuman Capital\nAt February 10, 2025, we had 304 full-time employees and 5 part-time employees. None of our employees are represented by a collective bargaining unit. We believe that our relationship with our employees is good. We are an Equal Opportunity/Affirmative Action employer, and strive to maintain a workplace that is free from discrimination on the basis of race, color, religion, sex, sexual orientation, nationality, disability, or protected Veteran status.\nHealth, Safety, and Wellness\nWe are committed to the health, safety, and wellness of our employees, and foster an environment that allows our people to succeed while balancing work and life. We provide our employees with access to health and wellness programs, which includes benefits that support both physical and mental health. We have also transitioned to a hybrid work model. \nCompensation and Benefits\nWe provide competitive pay and benefits including health, dental, vision, short and long-term disability, life insurance and a 401(k) retirement program, as well as a generous paid time off program that includes vacation, sick, and personal leave. In addition to our equity awards program, we also offer a quarterly recognition program, as well as rewarding employees with spot bonuses for stellar performance or going above and beyond the base requirements of their job description.\nTalent Development\nEmployees have access to a variety of different training courses, books, book summaries and audio books, and an array of source materials covering a myriad of different business and soft skills training subjects. Additionally, we provide reimbursement for tuition and professional licensures.\nCommunity Involvement\nGiving back to the community is an integral part of who we are and what we do. We provide ample ways to give back through programs at our properties or charitable endeavors and volunteer opportunities that also serve as team building exercises for our employees.\nTax Status\nWe elected to be taxed as a REIT under the federal income tax laws when we filed our 1962 tax return. As a REIT, we are generally not subject to federal income tax on taxable income that we distribute to our shareholders. Under the Code, REITs are subject to numerous organizational and operational requirements, including the requirement to generally distribute at least 90% of taxable income each year. We will be subject to federal income tax on our taxable income (including, for our taxable years ending on or prior to December 31, 2017, any applicable alternative minimum tax) at regular corporate rates if we fail to qualify as a REIT for tax purposes in any taxable year, or to the extent we distribute less than 100% of our taxable income. We will also generally not qualify for treatment as a REIT for federal income tax purposes for four years following the year during which qualification is lost. Even if we qualify as a REIT for federal income tax purposes, we may be subject to certain state and local income and franchise taxes and to federal income and excise taxes on our undistributed taxable income.\nWe have elected to treat certain of our subsidiaries as taxable REIT subsidiaries, which we refer to as a TRS. In general, a TRS may engage in any real estate business and certain non-real estate businesses, subject to certain limitations under the Code. A TRS is subject to federal and state income taxes. Our TRS activities have not been material.\nGeneral Economic Conditions \nThe economy continues to face several issues including inflation risk, high interest rates, and potentially worsening economic conditions presenting risks for our business and tenants. We continue to monitor and address risks related to the general state of the economy. The extent of the future effects on our business, results of operations, cash flows, and growth strategies is highly uncertain and will ultimately depend on future developments, none of which can be predicted. \n6\nTable of Contents\nGovernmental Regulations Affecting Our Properties\nWe and our properties are subject to a variety of federal, state and local environmental, health, safety and similar laws. Please see",
    "item1a": "ITEM 1A.    RISK FACTORS\nThis Annual Report on Form 10-K contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, Section 21E of the Exchange Act and the Private Securities Litigation Reform Act of 1995. Also, documents that we “incorporate by reference” into this Annual Report on Form 10-K, including documents that we subsequently file with the SEC will contain forward-looking statements. When we refer to forward-looking statements or information, sometimes we use words such as “may,” “will,” “could,” “should,” “plans,” “intends,” “expects,” “believes,” “estimates,” “anticipates” and “continues.” In particular, the below risk factors describe forward-looking information. The risk factors describe risks that may affect these statements but are not all-inclusive, particularly with respect to possible future events. Many things can happen that can cause actual results to be different from those we describe. These factors include, but are not limited to the following:\nRisk Factors Related to our Real Estate Investments and Operations\nRevenue from our properties may be reduced or limited if the retail operations of our tenants are not successful.\nRevenue from our properties depends primarily on the ability of our tenants to pay the full amount of rent and other charges due under their leases on a timely basis. Some of our leases provide for the payment, in addition to base rent, of additional rent above the base amount according to a specified percentage of the gross sales generated by the tenants and generally provide for reimbursement of real estate taxes and expenses of operating the property. Economic, legal, and/or competitive conditions, as well as public health concerns, may impact the success of our tenants’ retail operations and therefore the amount of rent and expense reimbursements we receive from our tenants. Any reduction in our tenants' abilities to pay base rent, percentage rent, or other charges on a timely basis, including the closing of stores prior to the end of the lease term or the filing by any of our tenants for bankruptcy protection, will adversely affect our financial condition and results of operations. In the event of default by a tenant, we may experience delays and unexpected costs in enforcing our rights as landlord under lease terms, which may also adversely affect our financial condition and results of operations.\nOur net income depends on the success and continued presence of our “anchor” tenants.\nOur net income could be adversely affected in the event of a downturn in the business, or the bankruptcy or insolvency, of any anchor store or anchor tenant. Anchor tenants generally occupy large amounts of square footage, pay a significant portion of the total rents at a property and contribute to the success of other tenants by drawing significant numbers of customers to a property. The closing of one or more anchor stores at a property could adversely affect that property and result in lease terminations by, or reductions in rent from, other tenants whose leases may permit termination or rent reduction in those circumstances or whose own operations may suffer as a result. If we were to experience high levels of anchor turnover and closings, an oversupply of larger retail spaces could result and we may see an increase in vacancy, and/or a decrease in rents for those spaces, which could have a negative impact to our net income. As of December 31, 2024, our anchor tenant space is 97.5% leased and 95.2% occupied.\nA shift in retail shopping from brick and mortar stores to online shopping may have an adverse impact on our cash flow, financial condition and results of operations.\nMany retailers operating brick and mortar stores have made online sales a vital piece of their business. The shift to online shopping may cause declines in brick and mortar sales generated by certain of our tenants and may cause certain of our tenants to reduce the size or number of their retail locations in the future. This risk is partially mitigated by our strategy of maintaining a diverse portfolio of retail properties. The trend of retailers utilizing brick and mortar locations for ‘showroom’ and on-line sales distribution purposes (particularly at shopping centers in densely populated areas like ours) may further mitigate this risk. However, there can be no assurance that our shopping centers will not be further impacted by the shift to online shopping. As a result, our cash flow, financial condition, and results of operations could be adversely affected.\n8\nTable of Contents\nWe have properties that are geographically concentrated, and adverse economic or real estate market declines in these areas could have a material adverse effect on us.\nAs of December 31, 2024, our tenants operated in 12 states and the District of Columbia. Any adverse situation that disproportionately affects the the markets where our properties are concentrated may have a magnified adverse effect on our portfolio. Refer to “Properties” ("
  }
}