{
  "ticker": "FSLR",
  "cik": "0001274494",
  "company_name": "FIRST SOLAR, INC.",
  "filing_date": "2025-02-25",
  "accession": "0001274494-25-000010",
  "primary_doc": "fslr-20241231.htm",
  "item_sections": {
    "item1": "Item 1.\n Business\nCompany Overview\nWe are America’s leading photovoltaic (“PV”) solar technology and manufacturing company. The only U.S.-headquartered company among the world’s largest solar manufacturers, First Solar is focused on competitively and reliably enabling power generation needs with our advanced, thin film PV technology. Developed at research and development (“R&D”) labs in California and Ohio, the Company’s technology represents the next generation of solar power generation, providing a competitive, high-performance, and responsibly produced alternative to conventional crystalline silicon PV solar modules. Our PV solar modules are produced using a fully integrated, continuous process that does not rely on Chinese crystalline silicon supply chains.\nWe are the world’s largest thin film PV solar module manufacturer and the largest PV solar module manufacturer in the Western Hemisphere. In addressing the overall global demand for electricity, PV solar modules provide energy at a lower levelized cost of electricity (“LCOE”), meaning the net present value of a system’s total life cycle costs divided by the quantity of energy that is expected to be produced over the system’s life, when compared to traditional forms of energy generation. With approximately $2 billion in cumulative R&D investments in the last 20 years, we have a demonstrated history of innovation and continuous improvement. We believe our strategies and points of differentiation provide the foundation for our competitive position and enable us to remain one of the preferred providers of PV solar modules.\nBusiness Strategy\nAdvanced Module Technology\nOur current module semiconductor structure is a single-junction polycrystalline thin film that uses Cadmium Telluride (“CdTe”) as the absorption layer. CdTe has absorption properties that are well matched to the solar spectrum and can deliver competitive wattage using approximately 2% to 3% of the amount of semiconductor material used to manufacture conventional crystalline silicon modules. \nIn terms of performance, in many climates our solar modules provide certain energy production advantages relative to competing crystalline silicon modules. For example, our CdTe solar technology provides:\n•\na superior temperature coefficient, which results in stronger system performance in typical high insolation climates as the majority of a system’s generation, on average, occurs when module temperatures are well above 25°C (standard test conditions);\n•\na superior spectral response in humid environments where atmospheric moisture alters the solar spectrum relative to standard test conditions;\n•\na better partial shading response than competing crystalline silicon technologies, which may experience significantly lower energy generation than CdTe solar technologies when partial shading occurs; and\n•\nan immunity to cell cracking and its resulting power output loss, a common failure often observed in crystalline silicon modules caused by poor manufacturing, handling, weather, or other conditions.\nIn addition to these technological advantages, we also warrant that our solar modules will produce at least 98% of their labeled power output rating during the first year, with the warranty coverage reducing by a degradation factor that is generally between 0.3% and 0.5%, depending on the module series, every year thereafter throughout the limited power output warranty period of up to \n30\n years. As a result of these and other factors, our solar modules can produce more annual energy in real-world operating conditions than conventional crystalline silicon modules with the same nameplate capacity.\n3\nTable of Co\nn\ntents\nManufacturing Process and Distributed Manufacturing Presence\nOur modules combine our leading-edge CdTe technology with the manufacturing excellence and quality control that comes from being the world’s most experienced producer of thin film PV solar modules. With more than 75 GW of modules sold worldwide, we have a demonstrated history of manufacturing success and innovation. Our global manufacturing footprint includes facilities in the United States, Malaysia, Vietnam, and India. During 2023, we commenced production of our Series 7\nTM\n (“Series 7”) modules at our third manufacturing facility in Ohio and our first manufacturing facility in India, which combine our thin film CdTe technology with a larger form factor and an innovative steel back rail mounting structure that reduces module installation time. During 2024, we commenced production of Series 7 modules at our first manufacturing facility in Alabama, bringing our total installed nameplate production capacity across all our facilities to approximately 21 GW. Additionally, we are in the process of expanding our manufacturing capacity by approximately 4 GW, including the construction of our fifth U.S. manufacturing facility, which is expected to commence operations in the second half of 2025.\nOur modules are manufactured in a high-throughput, automated environment that integrates all manufacturing steps into a continuous flow process. This process eliminates the multiple supply chain operators and resource-intensive batch processing steps that are used to produce crystalline silicon modules, which typically occur over several days and across multiple factories. At the outset of our module production, a sheet of glass enters the production line and in a matter of hours is transformed into a completed module ready for shipment.\nThis proprietary production process includes the following three stages: (i) the deposition stage, (ii) the cell definition and treatment stage, and (iii) the assembly and test stage. In the deposition stage, panels of transparent oxide-coated glass are robotically loaded onto the production line where they are cleaned, laser-mark identified with a serial number, heated, and coated with thin layers of semiconductor material, including CdTe, using our vapor transport deposition technology, after which the semiconductor-coated plates are cooled rapidly to increase glass strength. In the cell definition and treatment stage, we use high-speed lasers to transform the large continuous semiconductor coating on the glass plate into a series of interconnected cells that deliver the desired current and voltage output. In this stage, we also treat the semiconductor film using certain chemistries and processes to improve the device’s performance and apply a back contact. In the assembly and test stage, we apply busbars, inter-layer material, and a rear glass cover sheet that is laminated to encapsulate the device. We then apply anti-reflective coating material to the substrate glass to further improve the module’s performance by increasing its ability to absorb sunlight. Finally, junction boxes, termination wires, and a frame are applied to complete the module assembly.\nWe maintain a robust quality and reliability assurance program that monitors critical process parameters and measures product performance to ensure that industry and more stringent internal standards are met. We also conduct acceptance testing for electrical leakage, visual quality, and power measurement on a solar simulator prior to preparing a module for shipment. Our quality and reliability tests complement production surveillance with an ongoing monitoring program, subjecting production modules to accelerated life stress testing to help ensure ongoing conformance to requirements of the International Electrotechnical Commission and Underwriters Laboratories Inc. These programs and tests help assure delivery of power and performance in the field with a high level of product quality and reliability.\nResearch and Development\nOur R&D model differentiates us from much of our competition due to its vertical integration, from advanced research to product development, manufacturing, and applications. We continue to devote substantial resources to our R&D efforts, which generally focus on continually improving the wattage and energy yield of our solar modules. We also have R&D programs to improve module durability and manufacturing efficiencies, including throughput, volume ramp, and material cost reduction. We continue to invest significant financial resources in such initiatives, including the construction of a dedicated perovskite development line and a dedicated R&D innovation center in Ohio, which was formally commissioned during 2024. This R&D innovation center, which features a high-\n4\nTable of Co\nn\ntents\nvolume manufacturing scale production pilot line, is expected to enable the production of full-sized prototypes of thin film and tandem PV modules, supporting the implementation of our technology roadmap. Based on publicly available information, we are one of the leaders in R&D investment among PV solar module manufacturers.\nIn the course of our R&D activities, we explore various technologies in our efforts to sustain competitive differentiation in our modules. We primarily conduct our R&D activities and qualify process and product improvements for full production at our Perrysburg, Ohio facilities and systematically deploy them to our other facilities. We believe our systematic approach to technology change management enables continuous improvements and ensures uniform adoption across our production lines. In addition, our production lines are replicas or near replicas of each other and, as a result, a process or production improvement on one line can be rapidly and reliably replicated across other production lines.\nWe regularly produce research cells in our laboratories, some of which are tested for performance and certified by independent labs, such as the National Renewable Energy Laboratory. Cell efficiency measures the proportion of light converted to electricity in a single solar cell under standard test conditions. Our research cells are produced using laboratory equipment and methods and are not intended to be representative of our manufacturing capability. We currently hold two world records for CdTe PV cell efficiency, achieving an independently certified research cell efficiency of 23.1% and a module aperture area efficiency of 19.9%. We continue to evaluate opportunities to develop and leverage other solar cell technologies in multi-junction applications consisting of CdTe, or other materials, including thin film technologies. For example, during 2023, we acquired Evolar AB (“Evolar”), a European developer of perovskite technology. This acquisition is expected to accelerate the development of high efficiency multi-junction devices by integrating Evolar’s expertise with First Solar’s existing R&D capabilities. We believe such multi-junction applications have the potential to significantly increase the efficiency of PV modules beyond the limits of traditional single-junction devices.\nResponsible Solar\nWe are committed to enhancing the social and economic benefits of our products and reducing our carbon footprint. Our thin film modules are manufactured through an integrated process that uses less energy, water, and semiconductor material than conventional crystalline silicon modules. Our thin film module technology has the fastest energy payback time, smallest carbon footprint, and lowest water use of any commercially available PV solar technology, measured on a lifecycle basis that accounts for the energy, raw materials, water usage, and transportation across the supply chain, manufacturing process, and end-of-life module recycling.\nOur Series 7 module is our most eco-efficient product to date, with a carbon and water footprint that is approximately four times lower than conventional crystalline silicon modules manufactured in China and an energy payback time that is approximately five times faster. In just two months under high irradiation conditions, our Series 7 modules produce more energy than was required to create them. This corresponds to a 180-fold energy return on investment over a 30-year project lifetime, providing an abundant net energy gain to the electricity grid. \nFirst Solar modules are designed for high-value recycling to maximize material recovery and contribute to a circular economy. Our recycling process recovers more than 90% of module materials for reuse, providing high quality secondary resources for new solar modules and other glass, rubber, and aluminum products. First Solar has a unique and long-standing leadership position in PV recycling, having established the industry’s first global recycling program in 2005 and recycled approximately 400,000 metric tons of PV modules to date.\nFinancial Stability\nIn addition to our responsible solar commitments, we are also committed to creating long-term shareholder value through a decision-making framework that delivers a balance of growth, profitability, and liquidity. This framework has enabled us to fund our module manufacturing and capacity expansion initiatives primarily using cash flows generated by our operations and by maintaining appropriate debt levels based on cash flow expectations. Our \n5\nTable of Co\nn\ntents\nfinancial stability provides strategic optionality as we evaluate how to invest in our business and generate returns for our shareholders. Our financial stability also enables us to offer meaningful warranties, which provide us with a competitive advantage relative to many of our peers in the solar industry. Furthermore, we expect our financial discipline and ability to manage operating costs to enhance our profitability as we continue to scale our business.\nMarket Overview\nSolar energy is one of the fastest growing forms of renewable energy with numerous benefits, including economic and speed of deployment, that make it an attractive complement to or substitute for traditional forms of energy generation. In recent years, the cost of producing electricity from PV solar power systems has decreased to levels that are competitive with or below the wholesale price of electricity in many markets. Other technological developments in the renewable energy industry, such as the advancement of energy storage capabilities, have further enhanced the prospects of solar energy as an alternative to traditional forms of energy generation. As a result of these and other factors, worldwide solar markets continue to develop and expand.\nGovernment incentive programs, such as the Inflation Reduction Act of 2022 (the “IRA”), have contributed to this momentum by providing solar module manufacturers, project developers, and project owners with various incentives to accelerate the deployment of solar power generation. Among other things, the IRA (i) reinstates the 30% investment tax credit for qualifying solar projects that meet certain wage and apprenticeship requirements, (ii) extends the production tax credit (“PTC”) to include energy generated from solar projects, (iii) provides incremental investment and production tax credits for solar projects that meet certain domestic content and location requirements, and (iv) offers tax credits for solar modules and solar module components manufactured in the United States and sold to third parties. In light of such regulatory developments, we have recently commenced or completed certain manufacturing expansion activities in the United States and India and continue to evaluate opportunities for future expansion worldwide, as described below under “Global Markets.” For more information about certain risks associated with the IRA, see",
    "item1a": "Item 1A. \nRisk Factors\nAn investment in our stock involves a high degree of risk. You should carefully consider the following information, together with the other information in this Annual Report on Form 10-K, before buying shares of our stock. If any of the following risks or uncertainties occur, our business, financial condition, and results of operations could be materially and adversely affected and the trading price of our stock could decline.\nSummary of Risk Factors\nThe following is a summary of the principal risks and uncertainties that could materially adversely affect our business, financial condition, and results of operations and make an investment in our stock speculative or risky. You should read this summary together with the more detailed description of each risk factor contained below.\nRisks Related to Our Markets and Customers\n•\nCompetition in solar markets globally and across the solar value chain is intense and could remain that way for an extended period of time. The solar industry may experience periods of structural imbalance between global PV module supply and demand that result in periods of pricing volatility. If our competitors reduce module pricing to levels near or below their manufacturing costs, or are able to operate at minimal or negative operating margins for sustained periods of time, or if global demand for PV modules decreases relative to installed production capacity, our business, financial condition, and results of operations could be adversely affected.\n•\nThe modification, reduction, elimination, or expiration of government subsidies, economic incentives, tax incentives, renewable energy targets, and other support for on-grid solar electricity applications, or other public policies could negatively impact demand and/or price levels for our solar modules. The imposition of tariffs on our products or their related raw materials and components could materially increase our costs to perform under our contracts with customers, which could adversely affect our results of operations.\n•\nThe loss of any of our large customers, or the inability of our customers and counterparties to perform under their contracts with us, could significantly reduce our net sales and negatively impact our results of operations.\nRisks Related to Our Operations, Manufacturing, and Technology\n•\nWe face intense competition from manufacturers of crystalline silicon solar modules; if global supply exceeds global demand, it could lead to a further reduction in the average selling price for PV solar modules, which could reduce our net sales and adversely affect our results of operations.\n•\nProblems with product quality or performance may cause us to incur significant and/or unexpected contractual damages and/or warranty and related expenses, damage our market reputation, and prevent us from maintaining or increasing our market share.\n•\nOur failure to further refine our technology and develop and introduce improved PV products, including as a result of delays in implementing planned advancements, could render our solar modules uncompetitive and reduce our net sales, profitability, and/or market share.\n•\nSeveral of our key raw materials and components, in particular CdTe, tellurium, products containing tellurium, and substrate glass, and manufacturing equipment are either single-sourced or sourced from a limited number of suppliers, and their failure to perform could cause manufacturing delays, especially as we expand or seek to expand our business, and/or impair our ability to deliver solar modules to customers in the required quality and quantities and at a price that is profitable to us.\n17\nTable of Co\nn\ntents\n•\nOur failure to effectively manage module manufacturing production and selling costs, including costs related to raw materials and logistics services, could render our solar modules uncompetitive and reduce our net sales, profitability, and/or market share.\n•\nOur future success depends on our ability to effectively balance manufacturing production with market demand, effectively manage our cost per watt, and, when necessary, continue to build new manufacturing plants over time in response to market demand, all of which are subject to risks and uncertainties.\n \n•\nWe may be unable to generate sufficient cash flows or have access to the sources of external financing necessary to fund planned capital investments in manufacturing capacity and product development.\nRisks Related to Regulations\n•\nWe have received and expect to continue to receive certain financial benefits as a result of tax incentives provided by the Inflation Reduction Act of 2022. If these financial benefits vary significantly from our assumptions, our business, financial condition, and results of operations could be adversely affected.\n•\nExisting regulations and policies, changes thereto, and new regulations and policies may present technical, regulatory, and economic barriers to the purchase and use of PV solar products, which may significantly reduce demand for our modules.\nRisks Related to Our Markets and Customers\nCompetition in solar markets globally and across the solar value chain is intense and could remain that way for an extended period of time. The solar industry may experience periods of structural imbalance between global PV module supply and demand that result in periods of pricing volatility, which could have a material adverse effect on our business, financial condition, and results of operations.\nIn the aggregate, we believe manufacturers of solar cells and modules have significant installed production capacity, relative to global demand, and the ability for additional capacity expansion. For example, we estimate that in 2024 approximately 270 GW of capacity was added by solar module manufacturers, primarily in China. We believe the solar industry may from time to time experience periods of structural imbalance between supply and demand, and that excess capacity will continue to put pressure on pricing. Although module average selling prices in many global markets continue to decline, recent module pricing in the United States, our primary market, has been relatively stable due, in part, to the demand for domestically manufactured modules as a result of the IRA. There may be additional pressure on global demand and average selling prices in the future resulting from fluctuating demand in certain major solar markets, such as China. If our competitors reduce module pricing to levels near or below their manufacturing costs, or are able to operate at minimal or negative operating margins for sustained periods of time, or if global demand for PV modules decreases relative to installed production capacity, our business, financial condition, and results of operations could be adversely affected.\nThe modification, reduction, elimination, or expiration of government subsidies, economic incentives, tax incentives, renewable energy targets, and other support for on-grid solar electricity applications, or the impact of other public policies, such as tariffs or other trade remedies imposed on solar cells and modules or related raw materials or equipment, could negatively impact demand and/or price levels for our solar modules and limit our growth or lead to a reduction in our net sales or increase our costs, thereby adversely impacting our operating results.\nAlthough we believe that solar energy will experience widespread adoption in those applications where it competes economically with traditional forms of energy without any incentive programs, in certain markets our net sales and profits remain subject to variability based on the availability and size of government subsidies and economic incentives. Federal, state, and local governmental bodies in many countries have provided subsidies in the form of \n18\nTable of Co\nn\ntents\nfeed-in-tariff structures, rebates, tax incentives, and other incentives to end users, distributors, system integrators, and manufacturers of PV solar products. Many of these incentive programs expire, phase down over time, require renewal by the applicable authority, or may be amended. A summary of certain recent developments in the major government incentive programs that may impact our business appears under Item 1. “Business – Incentive Programs.” To the extent these incentive programs are reduced earlier than previously expected, are changed retroactively, or are not renewed, such changes could negatively impact demand and/or price levels for our solar modules, lead to a reduction in our net sales, and adversely impact our operating results.\nCurrent regulatory policies, or any future changes or threatened changes to such policies, including those changes as a result of the new presidential administration and control of the U.S. Congress, may subject us to significant risks, including the following:\n•\na reduction or removal of clean energy programs and initiatives and the incentives they provide may diminish the market for future solar energy off-take agreements, slow the retirement of aging fossil fuel plants, including the retirements of coal generation plants, and reduce the ability for solar project developers to compete for off-take agreements, which may reduce PV solar module sales;\n•\nany limitations on the value or availability to manufacturers or potential investors of tax incentives that benefit solar energy production, sales, or projects, such as the Section 45X advanced manufacturing production credit, ITC, and PTC, could result in reducing such manufacturers’ or investors’ economic returns and could cause a reduction in the availability of financing, thereby reducing demand for PV solar modules;\n•\nany incentives contingent upon domestic production of modules, such as tax incentives set forth under the IRA, could limit our ability to sell modules manufactured in certain foreign jurisdictions, which may adversely impact our module average selling prices and could require us to record significant charges to earnings should we determine that the manufacturing equipment in such foreign jurisdictions is impaired; and\n•\nany effort to overturn federal and state laws, regulations, or policies that are supportive of solar energy generation or that remove costs or other limitations on other types of electricity generation that compete with solar energy projects could negatively impact our ability to compete with traditional forms of electricity generation and materially and adversely affect our business.\nApplication of trade laws may also impact, either directly or indirectly, our operating results. In some instances, the application of trade laws is currently beneficial to the Company, and changes in their application could have an adverse impact. Recent developments include the following:\n•\nUnited States — Tariffs on Certain Imported Crystalline Silicon PV Cells and Modules\n. The United States currently imposes different types of tariffs and/or other trade remedies on certain imported crystalline silicon PV cells and modules from various countries. In February 2022, the previous U.S. President proclaimed a four-year extension of a global safeguard measure imposed pursuant to Section 201 of the Trade Act of 1974 that provides for tariffs on imported crystalline silicon solar modules and a tariff-rate quota on imported crystalline silicon solar cells. Thin film solar cell products, such as our CdTe technology, are specifically excluded from the tariffs. The extension measure’s tariff rate was originally set at 14.75%, with annual reductions of 0.25 percentage points over the remainder of its four-year term. The current rate is 14.25%. The extension measure also provides an annual tariff-rate quota, whereby tariffs apply to imported crystalline silicon solar cells above the first 5.0 GW of imports.\n•\nUnited States — Antidumping and Countervailing Duties on Certain Imported Crystalline Silicon PV Cells and Modules. \nThe United States currently imposes antidumping and countervailing duties (“AD/CVDs”) on certain imported crystalline silicon PV cells and modules from China and Taiwan. Such AD/CVDs can \n19\nTable of Co\nn\ntents\nchange over time pursuant to annual administrative reviews conducted by the U.S. Department of Commerce (“USDOC”), and a decline in duty rates or USDOC failure to fully enforce U.S. AD/CVD laws could have an adverse impact on our operating results. In August 2023, the USDOC issued final affirmative circumvention rulings, finding that solar modules completed in Cambodia, Malaysia, Thailand, and Vietnam using parts and components produced in China circumvent the pre-existing AD/CVD orders on China. Such duties apply to circumventing imports on or after June 6, 2024, as well as any circumventing imports prior to that date that were not used or installed on or before December 3, 2024. Our operating results could be adversely impacted if the USDOC and other U.S. government agencies do not enforce the affirmative circumvention rulings as expected or if pending litigation challenges result in a modification of the rulings. Conversely, effective enforcement could positively impact our operating results.\n•\nUnited States — Antidumping and Countervailing Duties on Certain Imported Aluminum Extrusions.\n In October 2023, a coalition of U.S. aluminum extruders and a labor union filed AD/CVD petitions with the USDOC and the U.S. International Trade Commission (“USITC”) related to aluminum extrusions from 15 countries. We import certain items that are within the scope of the investigations. The USDOC issued preliminary and final antidumping determinations in May and September 2024, respectively, both of which found that our Malaysian supplier of aluminum extrusions was not dumping. The USITC issued a negative preliminary determination on the Dominican Republic in November 2023 and negative final determinations on the remaining 14 countries in October 2024, terminating the investigations with no application of AD/CVD. The Petitioners appealed the USITC’s negative determinations. Our operating results could be adversely impacted if pending litigation challenges result in a modification of the rulings.\n•\nUnited States — Antidumping and Countervailing Duties on Certain Traded Solar Products.\n In April 2024, the American Alliance for Solar Manufacturing Trade Committee, which includes First Solar, filed a set of AD/CVD petitions with the USDOC and the USITC to impose duties on certain unfairly traded solar products from Cambodia, Malaysia, Thailand, and Vietnam. The investigations could potentially lead to the imposition of AD/CVD orders on such solar products. In June 2024, the USITC issued affirmative preliminary determinations. In October 2024, the USDOC announced preliminary affirmative determinations in the CVD investigations, finding that silicon solar cells and panels from Cambodia, Malaysia, Thailand, and Vietnam are unfairly subsidized at rates ranging from de minimis to nearly 300%, depending on the particular foreign producer. The USDOC has imposed provisional CVDs accordingly. In November 2024, the USDOC announced preliminary affirmative determinations in the AD investigations, providing for certain preliminary dumping rates applicable to solar cells from Cambodia, Malaysia, Thailand, and Vietnam ranging from de minimis to approximately 270%, depending on the particular foreign producer. The USDOC is expected to announce final determinations in June 2025.\n•\nUnited States — Additional Tariffs on Certain Chinese Imports\n. The United States currently imposes tariffs on various articles imported from China, including tariffs of 50% on crystalline silicon solar cells and tariffs of 25% on modules, based on an investigation under Section 301 of the Trade Act of 1974. In February 2025, the U.S. President announced an additional 10% tariff on all imports from China, which is related to the national security threat posed by China’s trade in fentanyl and other illegal narcotics. This 10% tariff applies in addition to the 25% tariffs under Section 301 and ordinary customs duties and AD/CVDs. Our operating results could be adversely impacted if these tariffs were to be terminated or reduced.\n•\nUnited States — Tariffs on Certain Foreign-imported Aluminum and Steel. \nThe United States currently imposes tariffs of 25% on imported aluminum and steel articles under Section 232 of the Trade Expansion Act of 1962. Such tariffs and policies, or any other U.S. or global trade remedies or other trade barriers, may directly or indirectly affect U.S. or global markets for solar energy and our business, financial condition, and results of operations.\n20\nTable of Co\nn\ntents\n•\nIndia — Domestic and Foreign Imports.\n The Approved List of Models and Manufacturers (“ALMM”) was introduced in 2021 as a non-tariff barrier to incentivize domestic manufacturing of PV modules by approving the list of models and manufacturers who can participate in certain solar development projects. The ALMM is approved by the MNRE, and any modifications to the ALMM and its application may affect future investments in solar module manufacturing in India. In April 2024, the government of India reimposed the ALMM, thereby requiring solar project developers to procure qualifying modules from companies on the list, which includes our Indian manufacturing facility. Also in April 2024, the ALMM was amended to include specific minimum conversion efficiency thresholds for CdTe solar technologies starting at 18% for solar lighting, 18.5% for rooftop applications, and 19% for utility-scale applications. In December 2024, the ALMM was amended to require nearly all solar development projects to use PV modules that contain domestically manufactured solar cells, which is expected to be effective for such projects completed on or after June 2026. Our operating results could be adversely impacted if the ALMM requirements are significantly relaxed to allow modules, solar cells, or certain other key module components to be imported from other countries.\n•\nIndia — Import Duty Tariffs. \nIn April 2022, the Indian government began imposing import duty tariffs of 40% on solar modules and 25% on solar cells. In connection with such April 2022 tariffs, the Indian government also implemented a regulation mandating that any solar project with federal utility, state utility, or commercial and industrial off-takers that interconnects through government owned transmission lines only use solar modules from manufacturers included in the ALMM, and a requirement that all federal procurement of solar modules be only from cells and modules produced domestically. However, in February 2025, the Indian government began imposing import duty tariffs of 20% each on solar modules and cells and levied additional tax on certain commercial agricultural production, which tax included of 20% on solar modules and 7.5% on solar cells. Therefore, the aggregate impact on the import of solar modules and cells is 40% and 27.5%, respectively. \nThese examples show that established markets for PV solar development face uncertainties arising from policy, regulatory, and governmental actions. While the expected potential of the markets we are targeting is significant, policy promulgation and market development are especially vulnerable to governmental inertia, political instability, the imposition or lowering of trade remedies and other trade barriers, geopolitical risk, fossil fuel subsidization, potentially stringent localization requirements, and limited available infrastructure.\nThe loss of any of our large customers, or the inability of our customers and counterparties to perform under their contracts with us, could significantly reduce our net sales and negatively impact our results of operations.\nOur customers include developers and operators of systems, utilities, independent power producers, commercial and industrial companies, and other system owners, who may experience intense competition at the system level, thereby constraining the ability for such customers to sustain meaningful and consistent profitability. The loss of any of our large customers, their inability to perform under their contracts, or their default in payment could significantly reduce our net sales and/or adversely impact our operating results. While our contracts with customers typically have certain firm purchase commitments and may include provisions for the payment of amounts to us in certain events of contract termination, these contracts may be subject to amendments made by us or requested by our customers. These contract terminations or amendments may reduce the volume of modules to be sold under the contract, adjust delivery schedules, and/or otherwise decrease the expected revenue under these contracts and could significantly reduce our net sales and negatively impact our results of operations. Additionally, although we require some form of payment security from our customers, such as cash deposits, parent guarantees, bank guarantees, surety bonds, or commercial letters of credit, in the event the providers of such payment security fail to perform their obligations, our operating results could be adversely impacted.\n21\nTable of Co\nn\ntents\nAn increase in interest rates or tightening of the supply of capital in the global financial markets (including a reduction in total tax equity availability) could make it difficult for customers to finance the cost of a PV solar power system and could reduce the demand for our modules and/or lead to a reduction in the average selling price for our modules.\nMany of our customers depend on debt and/or equity financing to fund the initial capital expenditure required to develop, build, and/or purchase a PV solar power system. As a result, an increase in interest rates, or a reduction in the supply of project debt financing or tax equity investments, could reduce the number of solar projects that receive financing or otherwise make it difficult for our customers to secure the financing necessary to develop, build, purchase, or install a PV solar power system on favorable terms, or at all, and thus lower demand for our solar modules, which could limit our growth or reduce our net sales. For additional information, see the Risk Factor entitled, “The modification, reduction, elimination, or expiration of government subsidies, economic incentives, tax incentives, renewable energy targets, and other support for on-grid solar electricity applications, or the impact of other public policies, such as tariffs or other trade remedies imposed on solar cells and modules or related raw materials or equipment, could negatively impact demand and/or price levels for our solar modules and limit our growth or lead to a reduction in our net sales or increase our costs, thereby adversely impacting our operating results.” In addition, we believe that a significant percentage of our customers install systems as an investment, funding the initial capital expenditure through a combination of equity and debt. An increase in interest rates could lower an investor’s return on investment in a system, increase equity return requirements, or make alternative investments more attractive relative to PV solar power systems and, in each case, could cause these customers to seek alternative investments.\nWe may be unable to execute our long-term strategic plans, which could have a material adverse effect on our business, financial condition, or results of operations.\nWe face numerous difficulties in executing on our long-term strategic plans, particularly in new foreign jurisdictions, including the following:\n•\ndifficulty in competing against companies who may have greater financial resources and/or a more effective or established localized business presence and/or an ability to operate with minimal or negative operating margins for sustained periods of time;\n•\ndifficulty in competing successfully with other technologies, such as crystalline silicon, hybrid perovskites, tandem solar cells, or other thin films;\n•\ndifficulty in accurately prioritizing geographic markets that we can most effectively and profitably serve with our solar module offerings, including miscalculations in overestimating or underestimating addressable market demand;\n•\nadverse public policies in countries we operate in and/or are pursuing, including local content requirements, the imposition of trade remedies, the removal of trade barriers, the imposition of tariffs, or capital investment requirements;\n•\nbusiness climates, such as that in China, that may have the effect of putting foreign companies at a disadvantage relative to domestic companies;\n•\nunstable or adverse economic, social, and/or operating environments, including social unrest, currency, inflation, and interest rate uncertainties;\n•\nthe possibility of applying an ineffective commercial approach to targeted markets, including product offerings that may not meet market needs;\n22\nTable of Co\nn\ntents\n•\ndifficulty in generating sufficient sales volumes at economically sustainable profitability levels;\n•\ndifficulty in timely identifying, attracting, training, and retaining qualified sales, technical, and other talent;\n•\ndifficulty in realizing the potential benefits of strategic acquisitions and investments;\n•\ndifficulty in maintaining proper controls and procedures as we expand our business operations in terms of geographical reach, including transitioning certain business functions to low-cost geographies, with any material control failure potentially leading to reputational damage and loss of confidence in our financial reporting;\n•\ndifficulty in competing successfully for market share in overall solar markets as a result of the success of companies participating in other solar segments in which we do not have significant historical experience, such as residential;\n•\ndifficulty in establishing and implementing a commercial and operational approach adequate to address the specific needs of the markets we are pursuing;\n•\ndifficulty in identifying effective local partners and developing any necessary partnerships with local businesses on commercially acceptable terms; and\n•\ndifficulty in balancing market demand and manufacturing production in an efficient and timely manner, potentially causing our manufacturing capacity to be constrained in some future periods or over-supplied in others.\nRefer also to the Risk Factors entitled, “Our substantial international operations subject us to a number of risks, including unfavorable political, regulatory, labor, and tax conditions in the United States and/or foreign countries,” “The modification, reduction, elimination, or expiration of government subsidies, economic incentives, tax incentives, renewable energy targets, and other support for on-grid solar electricity applications, or the impact of other public policies, such as tariffs or other trade remedies imposed on solar cells and modules or related raw materials or equipment, could negatively impact demand and/or price levels for our solar modules and limit our growth or lead to a reduction in our net sales or increase our costs, thereby adversely impacting our operating results,” and “We may be unable to generate sufficient cash flows or have access to the sources of external financing necessary to fund planned capital investments in manufacturing capacity and product development.”\nRisks Related to Our Operations, Manufacturing, and Technology\nWe face intense competition from manufacturers of crystalline silicon solar modules; if global supply exceeds global demand, it could lead to a further reduction in the average selling price for PV solar modules\n, \nwhich could reduce our net sales and adversely affect our results of operations.\nThe solar and renewable energy industries are highly competitive and are continually evolving as participants strive to distinguish themselves within their markets and compete with the larger electric power industry. Within the global PV solar industry, we face intense competition from crystalline silicon module manufacturers. Existing or future module manufacturers might be acquired by larger companies with significant capital resources, thereby further intensifying competition with us. In addition, the introduction of a low-cost disruptive technology could adversely affect our ability to compete, which could reduce our net sales and adversely affect our results of operations.\nWe expect to compete with future entrants into the PV solar industry and existing market participants that offer new or differentiated technological solutions. For example, while conventional solar modules are monofacial, meaning their ability to produce energy is a function of direct and diffuse irradiance on their front side, most module manufacturers offer bifacial modules that also capture diffuse irradiance on the back side of a module. Such \n23\nTable of Co\nn\ntents\ntechnology can improve the overall energy production of a module relative to nameplate efficiency when applied in certain applications, which could potentially lower the overall LCOE of a system when compared to systems using conventional solar modules, including the modules we currently produce. Additionally, certain module manufacturers have introduced n-type mono-crystalline modules, such as tunnel oxide passivated contact (“TOPCon”) modules, which are expected to provide certain improvements to module efficiency, temperature coefficient, and bifacial performance, and claim to provide certain degradation advantages compared to other mono-crystalline modules. Finally, many of our competitors are promoting modules with larger overall area based on the use of larger silicon wafers. While the transition to such larger wafers would increase nameplate wattage, we believe the associated production cost would not improve significantly.\nEven if demand for solar modules continues to grow, the rapid manufacturing capacity expansion undertaken by many module manufacturers in China and certain parts of Southeast Asia, particularly manufacturers of crystalline silicon wafers, cells, and modules, has created and may continue to cause periods of structural imbalances between supply and demand. For additional information, see the Risk Factor entitled, “Competition in solar markets globally and across the solar value chain is intense and could remain that way for an extended period of time. The solar industry may experience periods of structural imbalance between global PV module supply and demand that result in periods of pricing volatility, which could have a material adverse effect on our business, financial condition, and results of operations.” In addition, we believe any significant decrease in the cost of silicon feedstock or polysilicon would reduce the manufacturing cost of crystalline silicon modules and lead to further pricing pressure for solar modules and potentially an oversupply of solar modules.\nOur competitors could decide to reduce their sales prices in response to competition, even below their manufacturing costs, in order to generate sales, and may do so for a sustained period. Certain competitors, including many in China, may have direct or indirect access to sovereign capital or other forms of state support, which could enable such competitors to operate at minimal or negative operating margins for sustained periods of time. As a result, we may be unable to sell our solar modules at attractive prices, or for a profit, during any period of excess supply of solar modules, which would reduce our net sales and adversely affect our results of operations. Additionally, we may decide to lower our average selling prices to customers in certain markets in response to competition, which could also reduce our net sales and adversely affect our results of operations.\nProblems with product quality or performance may cause us to incur significant and/or unexpected contractual damages and/or warranty and related expenses, damage our market reputation, and prevent us from maintaining or increasing our market share.\nWe perform a variety of module quality and life tests under different environmental conditions upon which we base our assessments of future module performance over the duration of the warranty. However, if our thin film solar modules perform below expectations, we could experience significant warranty and related expenses, damage to our market reputation, and erosion of our market share. With respect to our modules, we provide a limited warranty covering defects in materials and workmanship under normal use and service conditions for up to \n12.5\n years. We also typically warrant that modules installed in accordance with agreed-upon specifications will produce at least \n98\n% of their labeled power output rating during the first year, with the warranty coverage reducing by a degradation factor every year thereafter throughout the limited power output warranty period of up to \n30\n years. Among other things, our solar module warranty also covers the resulting power output loss from cell cracking.\nWe have identified manufacturing issues affecting certain Series 7 modules manufactured in 2023 and 2024 that may cause the modules to experience premature power loss once installed in the field. We currently believe the primary causes of the issues have been identified and we have taken actions to address such issues. The ultimate loss we will incur for these manufacturing issues will depend on the extent of the premature power loss that is experienced in relation to the obligations under our limited product warranties, as well as any additional commitments we may make to remediate the affected modules. Based on currently available information and certain assumptions and estimates, we believe a reasonable estimate of the aggregate losses related to these manufacturing issues will range from approximately $\n56\n million to $\n100\n million. At this time, no individual amount within that \n24\nTable of Co\nn\ntents\nrange is a better estimate than any other amount. Accordingly, we increased our product warranty liability by the low end of the range. The estimated range set forth above was based on our evaluation of the currently available information, including select samples of module performance data from several locations, the estimated number of affected modules, and projections of probable costs to remediate the issues. If any of our estimates or assumptions related to the above referenced manufacturing issues are not accurate, we may be required to accrue additional expenses, which could adversely impact our reputation, financial position, operating results, and cash flows.\nIf any of the other assumptions used in estimating our module warranties prove incorrect, we may also be required to accrue additional expenses, which could adversely impact our financial position, operating results, and cash flows. Although we have taken significant precautions to avoid future manufacturing issues from occurring, any manufacturing issues, including any additional commitments made by us to take remediation actions in respect of affected modules beyond the stated remedies in our warranties, could also adversely impact our reputation, financial position, operating results, and cash flows.\nAlthough our module performance warranties extend for up to \n30\n years, our oldest solar modules manufactured during the qualification of our pilot production line have only been in use since 2001. Accordingly, our warranties are based on a variety of quality and life tests that enable predictions of durability and future performance. These predictions, however, could prove to be materially different from the actual performance during the warranty period, causing us to incur substantial expense to repair or replace defective solar modules or provide financial remuneration in the future. For example, our solar modules could suffer various failures, including breakage, delamination, corrosion, or performance degradation in excess of expectations, and our manufacturing operations or supply chain could be subject to material or process variations that could cause affected modules to fail or underperform compared to our expectations. These risks could be amplified as we implement design and process changes in connection with our efforts to improve our products and module wattage as part of our long-term strategic plans. In addition, if we increase the number of installations in extreme climates, we may experience increased failure rates due to deployment into such field conditions. Any widespread product failures may damage our market reputation, cause our net sales to decline, require us to repair or replace the defective modules or provide financial remuneration, and result in us taking voluntary remedial measures beyond those required by our standard warranty terms to enhance customer satisfaction, which could have a material adverse effect on our reputation, financial position, operating results, and cash flows.\nIn resolving claims under both the limited defect and power output warranties, we typically have the option of either repairing or replacing the covered modules or, under the limited power output warranty, providing additional modules to remedy the power shortfall or making certain cash payments; however, historical versions of our module warranty did not provide a refund remedy. Consequently, we may be obligated to repair or replace the covered modules under such historical programs. As our manufacturing process may change from time-to-time in accordance with our technology roadmap, we may elect to stop production of older versions of our modules that would constitute compatible replacement modules. In some jurisdictions, our inability to provide compatible replacement modules could potentially expose us to liabilities beyond the limitations of our module warranties, which could adversely impact our reputation, financial position, operating results, and cash flows.\nIn addition to our limited solar module warranties described above, for PV solar power systems we have constructed for customers in prior periods, we have provided limited warranties for defects in engineering design, installation, and balance of systems (“BoS”) part workmanship for a period of one to two years following the substantial completion of a system or a block within the system. BoS parts represent mounting, electrical, and other parts used in PV solar power systems. In resolving claims under such BoS warranties, we have the option of remedying the defect through repair or replacement. As with our modules, these warranties are based on a variety of quality and life tests that enable predictions of durability and future performance. Any underperformance or failures in BoS equipment beyond our expectations may also adversely impact our reputation, financial position, operating results, and cash flows.\n25\nTable of Co\nn\ntents\nIn addition, our contracts with customers may include provisions with particular product specifications, minimum wattage requirements, and specified delivery schedules. These contracts may be terminated, or we may incur significant liquidated damages or other damages, if we fail to perform our contractual obligations. In addition, our costs to perform under these contracts may exceed our estimates, which could adversely impact our profitability. Any failures to comply with our contracts for the sale of our modules could adversely impact our reputation, financial position, operating results, and cash flows.\nOur failure to further refine our technology and develop and introduce improved PV products, including as a result of delays in implementing planned advancements, could render our solar modules uncompetitive and reduce our net sales, profitability, and/or market share.\nWe need to continue to invest significant financial resources in R&D to further improve the energy yield of our modules and otherwise keep pace with technological advances in the solar industry. However, R&D activities are inherently uncertain, and we could encounter difficulties in commercializing our research results. We seek to continuously improve our products and processes, including, for example, certain planned improvements to our CdTe module technology and manufacturing capabilities, and the resulting changes carry potential risks in the form of delays, performance, additional costs, or other unintended contingencies. For example, we commenced a limited commercial production run of modules employing our copper replacement (“CuRe”) technology in late 2024 and intend to begin a phased replication of the technology across our fleet in the first quarter of 2026. Our CuRe program is intended to improve our current semiconductor structure by replacing copper with certain other elements that are expected to enhance module performance by improving its bifaciality characteristics, improving its temperature coefficient, and improving its warranted degradation. These technology attributes must be proven to be effective in real-world operating conditions. We may encounter unanticipated challenges as we implement design and process changes in connection with the CuRe program and other technology improvements.\nWe may expand our portfolio of offerings to include solutions that build upon our core competencies but for which we have not had significant historical experience, including variations in our traditional product offerings or other offerings related to certain markets. There can be no guarantee that our significant R&D expenditures will produce corresponding benefits. Other companies are developing a variety of competing PV technologies, including advanced p-type and n-type crystalline silicon cells, and new emerging technologies such as hybrid perovskites, tandem solar cells, or other thin films, which could result in solar modules that prove to be more cost-effective or have better performance than our solar modules. If we are unable to achieve the necessary technology improvements to remain competitive, our overall growth and financial performance may be limited relative to our competitors and our operating results could be adversely impacted.\nWe often forward price our products in anticipation of future technology improvements. Furthermore, certain of our contracts with customers may include transaction price adjustments associated with future module technology improvements, including enhancements to certain energy related attributes. Accordingly, our operating results could be adversely affected by (i) an inability to further refine our technology and execute our module technology roadmap, (ii) changes to the expected timing of such improvements being incorporated into our manufacturing process, and/or (iii) changes to expected and/or actual manufacturing timelines, especially as a result of key raw material sourcing.\nSome of our manufacturing equipment is customized and sole sourced. If our manufacturing equipment fails or if our equipment suppliers fail to perform under their contracts, we could experience production disruptions and be unable to satisfy our contractual requirements.\nSome of our manufacturing equipment is customized to our production lines based on designs or specifications that we provide to equipment manufacturers, which then undertake a specialized process to manufacture the custom equipment. As a result, the equipment is not readily available from multiple vendors and would be difficult to repair or replace if it were to become delayed, damaged, or stop working. If any piece of equipment fails, production along the entire production line could be interrupted. In addition, the failure of our equipment manufacturers to supply \n26\nTable of Co\nn\ntents\nequipment in a timely manner or on commercially reasonable terms could delay our expansion or conversion plans, otherwise disrupt our production schedule, and/or increase our manufacturing costs, all of which would adversely impact our operating results.\nSeveral of our key raw materials and components are either single-sourced or sourced from a limited number of suppliers, and their failure to perform could cause manufacturing delays and impair our ability to deliver solar modules to customers in the required quality and quantities and at a price that is profitable to us.\nOur failure to obtain raw materials and components that meet our quality, quantity, and cost requirements in a timely manner could interrupt or impair our ability to manufacture our solar modules, or increase our manufacturing costs. Several of our key raw materials and components, in particular CdTe and substrate glass, are either single-sourced or sourced from a limited number of suppliers. As a result, the failure of any of our suppliers to perform could disrupt our supply chain and adversely impact our operations. In addition, some of our suppliers are smaller companies that may be unable to supply our increasing demand for raw materials and components as we expand or seek to expand our business. We may be unable to identify new suppliers or qualify their products for use on our production lines in a timely manner and on commercially reasonable terms. A constraint on our production may result in our inability to meet our capacity plans and/or our obligations under our customer contracts, which would have an adverse impact on our business. Additionally, reductions in our production volume may put pressure on suppliers, resulting in increased material and component costs.\nA disruption in our supply chain for CdTe, tellurium, products containing tellurium, or other key raw materials, or equipment could interrupt or impair our ability to manufacture solar modules and could adversely impact our profitability and long-term growth prospects.\nA key raw material used in our module production process is a CdTe compound. Tellurium, one of the main components of CdTe, is mainly produced as a by-product of copper refining, and therefore, its supply is largely dependent upon demand for copper. If our competitors begin to use or increase their demand for tellurium, our requirements for tellurium increase, new applications for tellurium emerge, or adverse trade laws or policies restrict our ability to obtain tellurium from foreign vendors or make doing so cost prohibitive, the supply of tellurium, products containing tellurium, and related CdTe compounds could be reduced and prices could increase. For example, in early February 2025, China announced that it would tighten export controls for five key minerals, including products containing tellurium. As mentioned above, tellurium is one of the main components of our CdTe module production process. Although tellurium and products containing tellurium are sourced globally, China is a major global producer of tellurium and products containing tellurium. Exporters of tellurium and related products may be required to obtain a license from the Chinese Ministry of Commerce, which may be difficult, costly, and time-consuming, and our suppliers may not be successful in obtaining necessary export licenses in a timely manner or at all. Challenges in obtaining required export licenses may disrupt certain aspects of our supply chain for tellurium and products containing tellurium, which could result in raw material cost increases and/or disrupted production timelines. A constraint on our production may result in our inability to (i) meet our capacity plans, (ii) meet obligations under our customer contracts, and/or (iii) realize transaction price adjustments associated with future module technology improvements, which could adversely impact our profitability and long-term growth objectives. See Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of Operations – Certain Trends and Uncertainties” for additional information regarding China’s export controls.\nFurthermore, our supply chain could be limited if any of our current or future suppliers fail to perform or are unable to acquire an adequate supply in a timely manner or at commercially reasonable prices. If our current or future suppliers cannot obtain sufficient raw materials or key equipment, they could substantially increase prices or be unable to perform under their contracts. Additionally, we may also be unable to effectively manage fluctuations in the availability and cost of logistics services associated with the procurement of raw materials or equipment used in our manufacturing process. If we are unable to pass such cost increases to our customers, a substantial increase in prices or any limitations or disruptions in our supply chain could adversely impact our profitability and long-term growth objectives.\n27\nTable of Co\nn\ntents\nOur failure to effectively manage module manufacturing production and selling costs, including costs related to raw materials and logistics services, could render our solar modules uncompetitive and reduce our net sales, profitability, and/or market share.\nCertain of our key raw material purchase contracts include variable pricing terms, which are driven by underlying indices for certain commodities, including aluminum, steel, and natural gas, among others. Fluctuations in such underlying commodity indices may increase our raw material costs. For example, in February 2025, the U.S. President announced an additional 10% tariff on all imports from China, which is related to the national security threat posed by China’s trade in fentanyl and other illegal narcotics. For additional information about global tariffs and trade developments, see the Risk Factor entitled, “The modification, reduction, elimination, or expiration of government subsidies, economic incentives, tax incentives, renewable energy targets, and other support for on-grid solar electricity applications, or the impact of other public policies, such as tariffs or other trade remedies imposed on solar cells and modules or related raw materials or equipment, could negatively impact demand and/or price levels for our solar modules and limit our growth or lead to a reduction in our net sales or increase our costs, thereby adversely impacting our operating results.”\nAdditionally, an increase in price levels generally, such as inflation related to the cost of raw materials, key manufacturing equipment, labor, and logistics services, could adversely impact our profitability. From time to time, we may utilize derivative hedging instruments to mitigate price changes related to our raw materials or key manufacturing equipment. Our profitability could be adversely impacted if we are unable to effectively hedge such prices or pass these cost increases through to our customers. We often forward price our products in anticipation of future cost reductions, and thus, an inability to execute our cost reduction roadmap could adversely affect our operating results.\nOur future success depends on our ability to effectively balance manufacturing production with market demand, effectively manage our cost per watt, and, when necessary, continue to build new manufacturing plants over time in response to market demand, all of which are subject to risks and uncertainties.\nOur future success depends on our ability to effectively balance manufacturing production with market demand, effectively manage our cost per watt, and increase our manufacturing capacity in a cost-effective and efficient manner. If we cannot do so, we may incur damages under our contracts with our customers or be unable to decrease our cost per watt, maintain our competitive position, sustain profitability, expand our business, or create long-term shareholder value. Our ability to effectively manage our cost per watt or successfully expand production capacity is subject to significant risks and uncertainties, including the following:\n•\nfailure to reduce manufacturing material, labor, or overhead costs;\n•\nan inability to increase production throughput or the average power output per module, or minimize manufacturing yield losses;\n•\nfailure to effectively manage the availability and cost of logistics services associated with the procurement of raw materials or equipment used in our manufacturing process and the shipping, handling, storage, and distribution of our modules;\n•\ndelays and cost overruns as a result of a number of factors, many of which may be beyond our control, such as our inability to secure economical contracts with equipment vendors;\n•\nour custom-built equipment taking longer and costing more to manufacture than expected and not operating as designed;\n•\ndelays or denial of required approvals by relevant government authorities;\n28\nTable of Co\nn\ntents\n•\nan inability to hire qualified staff;\n•\ncapital expenditures exceeding our initial estimates with respect to expanding and building our manufacturing and R&D facilities;\n•\ndifficulty in balancing market demand and manufacturing production in an efficient and timely manner, potentially causing our manufacturing capacity to be constrained in some future periods or over-supplied in others; and\n•\nincurring manufacturing asset write-downs, write-offs, and other charges and costs, which may be significant, during those periods in which we idle, slow down, shut down, or otherwise adjust our manufacturing capacity.\nIf there is a delay or disruption in the construction or expansion of our manufacturing facilities, we may incur costs due to the postponed production generated by these facilities.\nWe may be unable to generate sufficient cash flows or have access to the sources of external financing necessary to fund planned capital investments in manufacturing capacity and product development.\nOur business and our future plans for expansion are capital-intensive, and we anticipate that our operating and capital expenditure requirements may increase. To develop new products, support future growth, and maintain product quality, we may need to make significant capital investments in manufacturing technology, facilities and capital equipment, and R&D. Consequently, we may seek to raise additional funds through the issuance of equity, equity-related, or debt securities, through obtaining credit from financial institutions to fund, together with our traditional sources of liquidity, the costs of developing and manufacturing our current or future products, or through the sale of tax credits. We cannot be certain that we will be able to generate sufficient cash flows, or that additional funds will be available to us on favorable terms when required, or at all. If we cannot fund the required investments from our operating cash flows or raise additional funds when we need them, we may be unable to fully execute our business plan and our financial condition, results of operations, and business prospects could be materially and adversely affected.\nIf our estimates regarding the future costs of collecting and recycling CdTe solar modules covered by our solar module collection and recycling program are incorrect, we could be required to accrue additional expenses and face a significant unplanned cash burden.\nAs necessary, we fund any incremental amounts for our estimated collection and recycling obligations on an annual basis based on the estimated costs of collecting and recycling covered modules, estimated rates of return on our restricted marketable securities, and an estimated solar module life of 25 years less amounts already funded in prior years. We estimate the cost of our collection and recycling obligations based on the present value of the expected future cost of collecting and recycling the solar modules, which includes estimates for the cost of packaging materials; the cost of freight from the solar module installation sites to a recycling center; material, labor, and capital costs; by-product credits for certain materials recovered during the recycling process; the estimated useful lives of modules covered by the program; and the number of modules expected to be recycled. We base these estimates on our experience collecting and recycling solar modules and certain assumptions regarding costs at the time the solar modules will be collected and recycled. If our estimates prove incorrect, we could be required to accrue additional expenses and could also face a significant unplanned cash burden at the time we realize our estimates are incorrect or end users return their modules, which could adversely affect our operating results. Participating end users can return their modules covered under the collection and recycling program at any time. As a result, we could be required to collect and recycle covered CdTe solar modules earlier than we expect.\n29\nTable of Co\nn\ntents\nOur failure to protect or successfully commercialize our intellectual property rights may undermine our competitive position, and litigation to protect our intellectual property rights or defend against third-party allegations of infringement may be costly.\nProtection of our proprietary processes, methods, and other technology is critical to our business. Failure to protect and monitor the use of our existing intellectual property rights or to successfully commercialize future intellectual property rights could result in the loss of valuable technologies. We rely primarily on patents, trademarks, trade secrets, copyrights, and contractual restrictions to protect our intellectual property. We regularly file patent applications to protect certain inventions arising from our R&D and are currently pursuing such patent applications in various countries in accordance with our strategy for intellectual property in that jurisdiction. Our existing patents and future patents could be challenged, invalidated, circumvented, or rendered unenforceable. Our pending patent applications may not result in issued patents, or if patents are issued to us, such patents may not be sufficient to provide meaningful protection against competitors or against competitive technologies.\nWe also rely on unpatented proprietary manufacturing expertise, continuing technological innovation, and other trade secrets to develop and maintain our competitive position. Although we generally enter into confidentiality agreements with our associates and third parties to protect our intellectual property, such confidentiality agreements are limited in duration and could be breached and may not provide meaningful protection for our trade secrets or proprietary manufacturing expertise. Adequate remedies may not be available in the event of unauthorized use or disclosure of our trade secrets and manufacturing expertise. In addition, others may obtain knowledge of our trade secrets through independent development or legal means. The failure of our patents or confidentiality agreements to protect our processes, equipment, technology, trade secrets, and proprietary manufacturing expertise, methods, and compounds could have a material adverse effect on our business. In addition, effective patent, trademark, copyright, and trade secret protection may be unavailable or limited in some foreign countries, especially any developing countries into which we may expand our operations. In some countries, we have not applied for patent, trademark, or copyright protection.\nThird parties may infringe or misappropriate our proprietary technologies or other intellectual property rights, which could have a material adverse effect on our business, financial condition, and operating results. Policing unauthorized use of proprietary technology can be difficult and expensive. Additionally, litigation may be necessary to enforce our intellectual property rights, protect our trade secrets, or determine the validity and scope of the proprietary rights of others. For example, on February 25, 2025, we filed a lawsuit in the United States District Court for the District of Delaware against JinkoSolar and its related entities alleging infringement of certain of our U.S. TOPCon patents. We cannot ensure that the outcome of such potential litigation will be in our favor, and such litigation may be costly and may divert management attention and other resources away from our business. An adverse determination in any such litigation may impair our intellectual property rights and may harm our business, prospects, and reputation. In addition, we have no insurance coverage against such litigation costs and would have to bear all costs arising from such litigation to the extent we are unable to recover them from other parties.\nIf any future production lines are not built in line with committed schedules, it may adversely affect our future growth plans. If any future production lines do not achieve operating metrics similar to our existing production lines, our solar modules could perform below expectations and cause us to lose customers.\nIf we are unable to systematically replicate our production lines over time and achieve operating metrics similar to our existing production lines, our manufacturing capacity could be substantially constrained, our manufacturing costs per watt could increase, our growth could be limited, and we may be in breach of our contracts with customers for failure to deliver modules. Such factors may result in lower net sales, and/or lower net income than we anticipate. Future production lines could produce solar modules that have lower conversion efficiencies, higher failure rates, and/or higher rates of degradation than solar modules from our existing production lines, and we could be unable to determine the cause of the lower operating metrics or develop and implement solutions to improve performance.\n30\nTable of Co\nn\ntents\nWe are in the process of expanding our manufacturing capacity by approximately 4 GW including the construction of our fifth U.S. manufacturing facility, which is expected to commence operations in the second half of 2025. If we cannot successfully execute on our current capacity expansion plans, we may incur significant costs in excess of our expected investment for these new facilities. If we are not able to effectively manage current or future expansion activities or realize their anticipated benefits, it may adversely impact our results of operations.\nOur substantial international operations subject us to a number of risks, including unfavorable political, regulatory, labor, and tax conditions in the United States and/or foreign countries.\nWe have significant manufacturing, sales, and marketing operations both within and outside the United States and expect to continue to expand our operations worldwide. Our global business requires us to respond to rapid changes in market conditions worldwide. Our overall success depends, in part, on our ability to succeed in differing legal, regulatory, economic, social, and political conditions. For example, in response to market conditions and an unfavorable policy environment in Europe, we have decided to scale down our footprint in Europe and to focus our business development efforts in the United States and India. We may not be able to timely develop and implement policies and strategies that will be effective in each location where we do business. Risks inherent to international operations include, but are not limited to, the following:\n•\ndifficulty in enforcing agreements in foreign legal systems;\n•\nvarying degrees of protection afforded to foreign investments in the countries in which we operate and irregular interpretations and enforcement of laws and regulations in such jurisdictions;\n•\nforeign countries may impose additional income and withholding taxes or otherwise tax our foreign operations, impose tariffs, or adopt other controls or restrictions on foreign trade and investment, including currency exchange controls;\n•\nfluctuations in exchange rates may affect demand for our products and services and may adversely affect our profitability and cash flows in U.S. dollars to the extent that our net sales or our costs are denominated in a foreign currency and the cost associated with hedging the U.S. dollar equivalent of such exposures is prohibitive; the longer the duration of such foreign currency exposure, the greater the risk;\n•\nanti-corruption compliance issues, including the costs related to the mitigation of such risk;\n•\nrisk of nationalization or other expropriation of private enterprises;\n•\nchanges in general economic and political conditions in the countries in which we operate, including changes in government incentive provisions and government program funding;\n•\nunexpected adverse changes in U.S. or foreign laws or regulatory requirements, including those with respect to environmental protection, import or export duties, tariffs, and quotas;\n•\nopaque approval processes in which the lack of transparency may cause delays and increase the uncertainty of project approvals;\n•\ndifficulty in staffing and managing widespread operations;\n•\ndifficulty in repatriating earnings;\n•\ndifficulty in negotiating a successful collective bargaining agreement in applicable foreign jurisdictions;\n31\nTable of Co\nn\ntents\n•\ntrade barriers such as export requirements, tariffs, taxes, local content requirements, anti-dumping regulations and requirements, and other restrictions and expenses, which could increase the effective price of our solar modules and make us less competitive in some countries or increase the costs to perform under our existing contracts; and\n•\ndifficulty of, and costs relating to, compliance with the different commercial and legal requirements of the overseas countries in which we offer and sell our solar modules.\nAlthough we have implemented policies and procedures designed to ensure compliance with the laws, regulations, and policies in each jurisdiction in which we operate, there can be no assurance that all of our employees, contractors, service providers, business partners, and agents will comply with these laws, regulations, and policies.\nRisks Related to Regulations\nWe have received and expect to continue to receive certain financial benefits as a result of tax incentives provided by the Inflation Reduction Act of 2022. If these financial benefits vary significantly from our assumptions, our business, financial condition, and results of operations could be adversely affected.\nIn August 2022, the previous U.S. President signed the IRA into law, which was intended to accelerate the country’s ongoing energy transition. The provisions of the IRA are generally effective for tax years beginning after 2022. We continue to evaluate the extent of benefits available to us, which we expect will favorably impact our results of operations in future periods. For example, we currently expect to qualify for the advanced manufacturing production credit under Section 45X of the IRC, which provides certain specified benefits for solar modules and certain solar module components manufactured in the United States and sold to third parties. For eligible components, the credit is equal to (i) $12 per square meter for a PV wafer, (ii) 4 cents multiplied by the capacity of a PV cell in watts, and (iii) 7 cents multiplied by the capacity of a PV module in watts. Based on the current form factor of our modules, we expect to qualify for a credit of approximately 17 cents per watt for each module produced in the United States and sold to a third party.\nSuch credit may be refundable by the IRS or transferable to a third party and is available from 2023 to 2032, subject to phase down beginning in 2030. For example, in December 2024 and December 2023, we entered into various agreements for the sales of Section 45X tax credits we generated in 2024 and 2023, respectively. For further information, see Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of Operations – Liquidity and Capital Resources.” However, there is no assurance that future sales of tax credits will be available to us on similar or alternative terms or at all. Furthermore, the potential policies of the new U.S. presidential administration and Congress have raised some uncertainty as to the continued availability of financial benefits available to us and others as a result of tax incentives provided by the IRA. For example, on January 20, 2025, the U.S. President issued an executive order entitled, “Unleashing American Energy,” which, among other things, indicated a lack of support for federal funding of certain solar and solar-related projects.\nCertain developments to technical guidance and regulations include the following:\n•\nIn March 2024, the U.S. Treasury Department and the IRS issued final regulations on the direct payment election under Section 6417 of the IRC. The final regulations apply to tax years ending on or after March 11, 2024, but taxpayers may choose to apply the rules in the final regulations in taxable years ending before March 11, 2024, provided the final regulations are applied in their entirety and in a consistent manner. The final regulations mostly adopted and confirmed the proposed regulations previously issued in June 2023.\n32\nTable of Co\nn\ntents\n•\nIn April 2024, the U.S. Treasury Department and the IRS issued final regulations on the elective transfer provisions under Section 6418 of the IRC. The final regulations apply to taxable years ending on or after April 30, 2024, but taxpayers may choose to apply the rules in the final regulations in taxable years ending before April 30, 2024, provided the final regulations are applied in their entirety and in a consistent manner. The final regulations mostly adopted and confirmed the proposed regulations previously issued in June 2023.\n•\nIn October 2024, the U.S. Treasury Department and the IRS issued final regulations on the Section 45X credit confirming key aspects of the credit, including (i) that a vertically-integrated solar module manufacturer is entitled to the sum of the credit amounts for each eligible component that is integrated into the solar module, (ii) the determination of the credit amounts based on standard test conditions, and (iii) the definition of a Section 45X manufacturing facility.\nAny modifications to the law or its effects arising, for example, through (i) technical guidance and regulations from the IRS and U.S. Treasury Department, including the certain aspects disclosed above, (ii) subsequent amendments to or interpretations of the law by the IRS, the U.S. Treasury Department, or the courts, (iii) future laws or regulations rendering certain provisions of the IRA less effective or ineffective, in whole or in part, and/or (iv) changes to U.S. government priorities, policies, and/or initiatives as a result of the new presidential administration and control of the U.S. Congress, could result in changes to the expected and/or actual benefits in the future, which could have a material adverse effect on demand and/or price levels for our solar modules, our net sales, and future expansion plans within the United States, and/or otherwise adversely impact our business, financial condition, and results of operations.\nExisting regulations and policies, changes thereto, and new regulations and policies may present technical, regulatory, and economic barriers to the purchase and use of PV solar products, which may significantly reduce demand for our modules.\nThe market for electricity generation products is heavily influenced by federal, state, local, and foreign government regulations and policies concerning the electric utility industry, as well as policies promulgated by electric utilities. These regulations and policies often relate to electricity pricing and interconnection of customer-owned electricity generation. In the United States and certain other countries, these regulations and policies have been modified in the past and may be modified again in the future, which could deter end-user purchases of PV solar products. For example, without a mandated regulatory exception for PV solar power systems, system owners are often charged interconnection or standby fees for putting distributed power generation on the electric utility grid. To the extent these interconnection standby fees are applicable to PV solar power systems, it is likely that they would increase the cost of such systems, which could make the systems less desirable, thereby adversely affecting our business, financial condition, and results of operations. Another example is the effect of governmental land-use planning policies and environmental policies on utility-scale PV solar development. The adoption of restrictive land-use designations or environmental regulations that proscribe or restrict the siting of utility-scale solar facilities could adversely affect the marginal cost of such development.\nOur modules are often subject to oversight and regulation in accordance with national and local ordinances relating to building codes, safety, environmental protection, and other matters, and tracking the requirements of individual jurisdictions is complex. Any new government regulations or utility policies pertaining to our modules may result in significant additional expenses to us or our customers and, as a result, could cause a significant reduction in demand for our products. In addition, any regulatory compliance failure could result in significant management distraction, unplanned costs, and/or reputational damage.\n33\nTable of Co\nn\ntents\nWe could be adversely affected by any violations of the FCPA, the U.K. Bribery Act, and other foreign anti-bribery laws\n.\nThe FCPA generally prohibits companies and their intermediaries from making improper payments to non-U.S. government officials for the purpose of obtaining or retaining business. Other countries in which we operate also have anti-bribery laws, some of which prohibit improper payments to government and non-government persons and entities, and others (e.g., the FCPA and the U.K. Bribery Act) extend their application to activities outside their country of origin. Our policies mandate compliance with all applicable anti-bribery laws. We currently operate in, and may further expand into, key parts of the world that have experienced governmental corruption to some degree and, in certain circumstances, strict compliance with anti-bribery laws may conflict with local customs and practices. In addition, due to the level of regulation in our industry, our operations in certain jurisdictions where norms can differ from U.S. standards may require substantial government contact, either directly by us or through intermediaries over whom we have less direct control, such as subcontractors, agents, and partners (such as joint venture partners). Although we have implemented policies, procedures, and, in certain cases, contractual arrangements designed to facilitate compliance with these anti-bribery laws, our officers, directors, associates, subcontractors, agents, and partners may take actions in violation of our policies, procedures, contractual arrangements, and anti-bribery laws. Any such violation, even if prohibited by our policies, could subject us and such persons to criminal and/or civil penalties or other sanctions potentially by government prosecutors from more than one country, which could have a material adverse effect on our business, financial condition, cash flows, and reputation.\nEnvironmental obligations and liabilities could have a substantial negative impact on our business, financial condition, and results of operations.\nOur operations involve the use, handling, generation, processing, storage, transportation, and disposal of hazardous materials and are subject to extensive environmental laws and regulations at the national, state, local, and international levels. These environmental laws and regulations include those governing the discharge of pollutants into the air and water, the use, management, and disposal of hazardous materials and wastes, the cleanup of contaminated sites, and occupational health and safety. As we expand our business into foreign jurisdictions worldwide, our environmental compliance burden may continue to increase both in terms of magnitude and complexity. We have incurred and may continue to incur significant costs in complying with these laws and regulations. In addition, violations of, or liabilities under, environmental laws or permits may result in restrictions being imposed on our operating activities or in our being subject to substantial fines, penalties, criminal proceedings, third-party property damage or personal injury claims, cleanup costs, or other costs. While we believe we are currently in substantial compliance with applicable environmental requirements, future developments such as more aggressive enforcement policies, the implementation of new, more stringent laws and regulations, or the discovery of presently unknown environmental conditions may require expenditures that could have a material adverse effect on our business, financial condition, and results of operations.\nOur solar modules contain CdTe and other semiconductor materials. Elemental cadmium and certain of its compounds are regulated as hazardous materials due to the adverse health effects that may arise from human exposure. Based on existing research, the risks of exposure to CdTe are not believed to be as serious as those relating to exposure to elemental cadmium due to CdTe’s limited bioavailability. In our manufacturing operations, we maintain engineering controls to minimize our associates’ exposure to cadmium compounds and require our associates who handle cadmium compounds to follow certain safety procedures, including the use of personal protective equipment such as respirators, chemical goggles, and protective clothing. Relevant studies and third-party peer reviews of our technology have concluded that the risk of exposure to cadmium or cadmium compounds from our end-products is negligible. In addition, the risk of exposure is further minimized by the encapsulated nature of these materials in our products, the physical properties of cadmium compounds used in our products, and the recycling or responsible disposal of our modules. While we believe that these factors and procedures are sufficient to protect our associates, end users, and the general public from adverse health effects that may arise from cadmium exposure, we cannot ensure that human or environmental exposure to cadmium or cadmium compounds used in our \n34\nTable of Co\nn\ntents\nproducts will not occur. Any such exposure could result in future third-party claims against us, damage to our reputation, and heightened regulatory scrutiny, which could limit or impair our ability to sell and distribute our products. The occurrence of future events such as these could have a material adverse effect on our business, financial condition, and results of operations.\nThe use of cadmium or cadmium compounds in various products is also coming under increasingly stringent governmental regulation. Future regulation in this area could impact the design, manufacturing, sale, collection, and recycling of solar modules and could require us to make unforeseen environmental expenditures or limit our ability to sell and distribute our products. For example, European Union Directive 2011/65/EU on the Restriction of the Use of Hazardous Substances (“RoHS”) in electrical and electronic equipment (the “RoHS Directive”) restricts the use of certain hazardous substances, including cadmium and its compounds, in all electronic equipment sold into the European market, unless excluded from the law. Currently, PV solar modules are explicitly excluded from the scope of RoHS (Article 2), as adopted in June 2011. Other jurisdictions have adopted similar legislation or are considering doing so. The next revision of the RoHS Directive is expected in 2025. If PV modules were to be included in the scope of future RoHS revisions without an exemption or under similar regulations in other jurisdictions, we would be required to redesign our solar modules to reduce cadmium and other affected hazardous substances to the maximum allowable concentration thresholds in the RoHS Directive or other similar regulation in order to continue to offer them for sale within the EU or such other jurisdiction. As such actions would be impractical, this type of regulatory development would effectively close the affected market to us, which could have a material adverse effect on our business, financial condition, and results of operations.\nOur business is subject to evolving corporate governance and public disclosure regulations and expectations, including with respect to environmental, social, and governance matters, that could expose us to numerous risks.\nCompanies across many industries are facing increasing scrutiny related to their environmental, social and governance (“ESG”) practices. Investor advocacy groups, certain institutional investors, investment funds and other influential investors are also increasingly focused on ESG practices and in recent years have placed increasing importance on the non-financial impacts of their investments. While our vision is to lead the world’s sustainable energy future through solar technology that is eco-efficient and socially responsible, if our ESG practices do not meet investor or other industry stakeholder expectations, which continue to evolve, we may incur additional costs and our brand, business, and ability to attract and retain qualified employees may be harmed.\nFurthermore, customer, investor, regulatory, and employee expectations in areas such as ESG have been rapidly evolving and increasing. Specifically, regulatory bodies around the globe continue to develop ESG reporting requirements, many of which will be subject to independent audits. For example, certain government agencies and regulators are considering rules requiring the disclosure of certain ESG matters, and California enacted new environmental disclosure laws in October 2023 that will generally require additional disclosure and reporting by 2026. The new California laws, the Climate Corporate Data Accountability Act, and the Climate-Related Financial Risk Act each impose additional climate-related reporting requirements on large companies conducting business in the state of California. We expect we will be subject to these new laws, which impose extensive reporting obligations about greenhouse gas emissions and climate-related financial risks. We also expect certain of our subsidiaries may be subject to the EU Corporate Sustainability Reporting Directive, which requires companies meeting certain criteria to disclose information about various ESG matters. Our ability to compete and to meet investor or other industry stakeholder expectations also depends on effectively executing on our approach to responsible sourcing and supply chain due diligence. The enhanced stakeholder focus on ESG issues relating to First Solar requires the continuous monitoring of various and evolving standards and the associated reporting requirements. A failure to adequately meet regulatory requirements and stakeholder expectations or achieve our ESG-related goals may result in the loss of business, diluted market valuation, an inability to attract customers, or an inability to attract and retain top talent.\n35\nTable of Co\nn\ntents\nAs of the date of this filing, we have made several public commitments regarding our intended reduction of greenhouse gas emissions and operating a responsible supply chain with zero tolerance for forced labor. Although we intend to meet these commitments and deliver on our greenhouse gas emissions reduction and renewable energy targets, we may be required to expend significant resources to do so, which could increase our operational costs. Our ESG initiatives could be unsuccessful for various reasons, including due to our growing manufacturing footprint, the lack of offsite renewable energy options in certain jurisdictions, and violations by our suppliers of applicable laws, regulations, and our Supplier Code of Conduct. Given the dynamic nature of ESG standards, expectations, and regulations, which may change over time, we may from time to time need to update or otherwise revise our current targets, practices, and initiatives, including in response to legislative or legal developments. Any actual or perceived inability to meet these commitments and/or deliver on our targets could result in adverse publicity and reactions from investors, activist groups, and other stakeholders, which could adversely impact the perception of First Solar and our products and services by current and potential customers, as well as investors, which could in turn adversely impact our results of operations.\nGeneral Risk Factors\nCybersecurity incidents or information or security breaches, or those of third parties with which we do business, could have a material adverse effect on our business, financial condition, and results of operations.\nOur operations rely on our information systems, including hardware, software, and networks, as well as on the information systems of third parties with which we do business (including their upstream and/or downstream service providers, as applicable), to securely process, store, and transmit proprietary, confidential, and other information, including intellectual property and personally identifiable information. We also rely heavily on these information systems to operate our manufacturing lines. These information systems may be compromised by cybersecurity incidents, including those caused by computer viruses, malware, ransomware and other cyber-attacks, as well as other events, including information and security breaches, that could be materially disruptive to our business operations and could put the security of our information, and that of the third parties with which we do business, at risk of misappropriation or destruction. In recent years, such cybersecurity incidents and events have become increasingly frequent and sophisticated, targeting or otherwise affecting a wide range of companies.\nRecent developments in the threat landscape include the use of AI and machine learning, as well as an increased number of cyber extortion attacks, with higher financial ransom demand amounts and increasing sophistication and variety of ransomware techniques and methodology. While we have instituted security measures and procured insurance to mitigate the likelihood and impact of a cybersecurity incident and other events, including information and security breaches, there is no assurance that these measures, or those of the third parties with which we do business, will be adequate in the future. If these measures are not adequate, among other impacts, valuable information may be lost; our operations may be disrupted; we may be unable to fulfill our customer obligations; and our reputation may suffer. Additionally, any cybersecurity incident affecting our automated manufacturing lines could adversely affect our ability to produce solar modules or otherwise affect the quality and performance of the modules produced.\nWe may also be subject to litigation, regulatory sanctions, enforcement actions, government fines, remedial expenses, and financial losses beyond the scope or limits of our insurance coverage. These consequences of a failure of security measures could, individually or in the aggregate, have a material adverse effect on our business, financial condition, and results of operations. While we and the third parties with which we do business have experienced and may continue to experience cybersecurity incidents and other events, including information and security breaches, we have not experienced any material adverse effect on our business, financial condition, or results of operations, or any other material consequences, relating to or as a result of a cybersecurity incident or other such event, whether directed at us or our third parties.\n36\nTable of Co\nn\ntents\nUncertainty in the development, deployment and use of AI in our products and services, as well as our business more broadly, could adversely affect our business and reputation.\nWe use systems and tools that incorporate AI-based technologies, including generative AI, for customers and our workforce. As with many new and emerging technologies, AI presents numerous risks and challenges that could adversely affect our business. The development, adoption, integration, and use of generative AI technology remains in early stages, and ineffective or inadequate AI governance, development, use, or deployment practices by us or third parties could result in unintended consequences. For example, AI algorithms that we use may be flawed or may be (or may be perceived to be) based on datasets that are biased or insufficient. In addition, any latency, disruption, or failure in our AI systems or infrastructure could result in delays or errors in our offerings. Inadequate governance, testing, or quality assurance processes could result in flawed deployments, producing erroneous or harmful outputs, which could damage our reputation and lead to legal liabilities. Thoroughly testing generative AI models is challenging due to their complexity and the unpredictability of their outputs. Developing, testing, and deploying resource-intensive AI systems may require additional investment and increase our costs. There also may be real or perceived social harm, unfairness, or other outcomes that undermine public confidence in the deployment and use of AI. Furthermore, third parties may deploy AI technologies in a manner that reduces customer demand for our products and services. Any of the foregoing may result in decreased demand for our products and services or harm to our business, financial condition, results of operations, or reputation.\nThe legal and regulatory landscape surrounding AI technologies is rapidly evolving and uncertain, including in relation to the areas of intellectual property, cybersecurity, and privacy and data protection. For example, there is uncertainty around the validity and enforceability of intellectual property rights related to our development, deployment, and use of AI. Additionally, third parties that license AI technologies to us may impose unfavorable licensing terms or terminate the licenses altogether which would require us to seek licenses from alternative sources to avoid disruptions in feature delivery. Compliance with new or changing laws, regulations, or industry standards relating to AI may impose significant operational costs and may limit our ability to develop, deploy, or use AI technologies. Failure to appropriately respond to this evolving landscape may result in legal liability, regulatory action, or brand and reputational harm.\nClimate-related physical risks, including weather events and natural disasters, may affect our manufacturing operations, supply chains, and customers, which could have a material adverse effect on our business, financial condition, or results of operations.\nClimate-related physical impacts of weather events and natural disasters are highly uncertain, unpredictable, and varied by geographic location, including, but not limited to, flooding, hurricanes, wildfires, and tornadoes. Although we carry business interruption insurance coverage and typically have provisions in our contracts that protect us in certain events, our coverage may not be adequate to compensate us for all losses that may occur as a direct or indirect result of weather events or natural disasters.\nWe have manufacturing operations in regions that have experienced extreme weather such as flooding, hurricanes, wildfires, and tornadoes. In case of these or other weather events or natural disasters, (i) our manufacturing and R&D equipment, on-site IT facilities, and inventory, among other things, may be damaged or destroyed, which may result in significant write-offs or significant expenses to repair or replace certain operations; (ii) the production and shipment of our solar modules may be disrupted as a result of (a) the damage or destruction of our facilities and infrastructure, (b) power outages, (c) delayed or cancelled deliveries of equipment and raw materials, and/or (d) the lack of clear and safe physical access to and from our manufacturing facilities, among other things; and (iii) we may be unable to execute our technology roadmap in a timely manner. We also consider the risks associated with weather events and natural disasters as part of our manufacturing site selection, design, and construction process.\nOur suppliers may be adversely affected by weather events and natural disasters, which could disrupt their ability to deliver certain manufacturing equipment, materials, and/or services for extended periods of time. Our suppliers may also incur additional costs to repair or replace their own operations, which may cause them to require higher prices \n37\nTable of Co\nn\ntents\nas part of current and future contracts and/or otherwise be unable to perform under their existing contract commitments. For additional information regarding the risks related to the sourcing of our manufacturing equipment and raw materials, respectively, see the Risk Factors entitled, “Some of our manufacturing equipment is customized and sole sourced. If our manufacturing equipment fails or if our equipment suppliers fail to perform under their contracts, we could experience production disruptions and be unable to satisfy our contractual requirements.” and “Several of our key raw materials and components are either single-sourced or sourced from a limited number of suppliers, and their failure to perform could cause manufacturing delays and impair our ability to deliver solar modules to customers in the required quality and quantities and at a price that is profitable to us.” For additional information regarding the risks related to supply chain disruptions, see the Risk Factor entitled, “A disruption in our supply chain for CdTe, tellurium, products containing tellurium, or other key raw materials, or equipment could interrupt or impair our ability to manufacture solar modules and could adversely impact our profitability and long-term growth prospects.”\nOur customers may be adversely affected by weather events and natural disasters, which could result in significant site damages, including damages to our solar modules installed at those sites. Damages may adversely impact our customers financially, and related business disruptions may delay or accelerate certain project timelines, which could result in an inability to perform under their contracts or otherwise deliver timely payment to us, if at all. Further, as a result of our own potential operational delays mentioned above, our ability to fulfill customer orders may be impaired or delayed, and we could incur significant losses. For additional information regarding the risks related to our customers, see the Risk Factor entitled, “The loss of any of our large customers, or the inability of our customers and counterparties to perform under their contracts with us, could significantly reduce our net sales and negatively impact our results of operations.”\nThe severity and duration of public health threats could materially impact our business, financial condition, and results of operations.\nThe extent to which public health threats (including pandemics such as COVID-19 or similarly infectious diseases) could impact us in the future is highly uncertain and unpredictable, and will depend largely on subsequent developments, including but not limited to (i) the severity and duration of any public health threat, (ii) measures taken to contain the spread of any public health threat, such as restrictions on travel and gatherings of people and temporary closures of or limitations on businesses and other commercial activities, (iii) the timing and nature of policies implemented by governmental authorities, and (iv) any future variants of the public health threat, which may surge over time. As a result of any public health threat and any related containment measures, we, our suppliers, or customers may be subject to significant risks, including to supply chain and business operations, which have the potential to materially and adversely impact our business, financial condition, and results of operations.\nIf we are unable to attract, train, retain, and successfully integrate key talent into our team, our business may be materially and adversely affected.\nOur future success depends, to a significant extent, on our ability to attract, train, and retain management, operations, sales, and technical talent, including associates in foreign jurisdictions. Recruiting and retaining capable individuals, particularly those with expertise in the PV solar and related industries across a variety of technologies, are vital to our success. We are also dependent on the services of our executive officers and other members of our senior management team. The loss of one or more of these key associates could have a material adverse effect on our business. We have a comprehensive succession planning process in place, which contemplates talent at all levels of the organization. However, we may not be able to retain or replace these key associates in a timely manner. Although several of our current key associates, including our executive officers, are subject to employment conditions or arrangements that contain post-employment non-competition provisions, these arrangements permit the associates to terminate their employment with us upon little or no notice. In addition, on April 23, 2024, the U.S. Federal Trade Commission (“U.S. FTC”) issued a final rule that, if enforceable, would ban any non-competition provisions, including provisions in existing employment agreements, which could make it more difficult for us to retain qualified associates. On August 20, 2024, a U.S. district court issued an order stopping the U.S. FTC from \n38\nTable of Co\nn\ntents\nenforcing the rule effective September 4, 2024 onward, and the U.S. FTC has appealed this order. However, this order does not prevent the U.S. FTC from addressing non-competition provisions on a case-by-case basis. It is uncertain if the rule will be enforceable or whether the language of the final rule could be further modified.\nThere is substantial competition for qualified technical and manufacturing personnel, and while we continue to benchmark our organization against a broad spectrum of businesses in our market space to remain economically competitive, there can be no assurances that we will be able to attract and retain technical personnel. As we continue to expand domestically and internationally, we may encounter regional laws that mandate union representation or associates who desire union representation or a collective bargaining agreement. If we are unable to attract and retain qualified associates, or otherwise experience unexpected labor disruptions within our business, we may be materially and adversely affected.\nWe may be exposed to intellectual property violation claims by third parties, which, if determined adversely to us, could cause us to pay significant damage awards or limit or prohibit the manufacture, use, distribution, export, import, or sale of our solar modules or other technology or know-how.\nOur success depends largely on our ability to exploit our technology and know-how without violating the intellectual property rights of third parties. The validity and scope of claims relating to PV solar technology patents involve complex scientific, legal, and factual considerations and analysis and, therefore, may be highly uncertain. We may be subject to legal proceedings involving intellectual property violation claims by third parties. For example, during 2022, we received various indemnification demands from certain customers, for whom we provided engineering, procurement, and construction (“EPC”) services, regarding claims that such customers’ PV tracker systems infringe, in part, on patents owned by Rovshan Sade (“Sade”), the owner of a company called Trabant Solar, Inc. See Note 14. “Commitments and Contingencies – Legal Proceedings” to our consolidated financial statements for more information on our legal proceedings. The defense and prosecution of intellectual property suits, patent opposition proceedings, and other legal and administrative proceedings can be both costly and time consuming and may significantly divert the efforts and resources of our technical and management personnel. An adverse determination in any such legal proceedings to which we may become a party could subject us to significant liability to third parties, require us to seek licenses from third parties, which may not be available on reasonable terms, or at all, or pay ongoing royalties or other payments, require us to redesign our solar modules or other technology, or subject us to injunctions limiting or prohibiting the manufacture, use, distribution, export, import, or sale of our solar modules or other technology or know-how. Legal proceedings could also result in our customers or potential customers deferring or limiting their purchase or use of our solar modules or other technology or know-how until the resolution of such legal proceedings.\nCurrency translation and transaction risk may negatively affect our results of operations.\nAlthough our reporting currency is the U.S. dollar, we conduct certain business and incur costs in the local currency of most countries in which we operate. As a result, we are subject to currency translation and transaction risk. For example, certain business arrangements outside the United States have involved and may involve significant investments denominated in local currencies. Changes in exchange rates between foreign currencies and the U.S. dollar could affect our results of operations and result in exchange gains or losses. We cannot accurately predict the impact of future exchange rate fluctuations on our results of operations.\nWe could also expand our business into emerging markets, many of which have an uncertain regulatory environment relating to currency policy. Conducting business in such emerging markets could cause our exposure to changes in exchange rates to increase, due to the relatively high volatility associated with emerging market currencies and potentially longer payment terms for our proceeds.\n39\nTable of Co\nn\ntents\nOur ability to hedge foreign currency exposure is dependent on our credit profile with the banks that are willing and able to do business with us. Deterioration in our credit position or a significant tightening of the credit market conditions could limit our ability to hedge our foreign currency exposures; and therefore, result in exchange gains or losses.\nUnanticipated changes in our tax position, the enactment of new tax legislation, or exposure to additional income tax liabilities could affect our profitability.\nWe are subject to income taxes in the various jurisdictions in which we operate. Accordingly, we are subject to a variety of tax laws and interpretations of such laws by local tax authorities. Longstanding international tax laws that determine each country’s jurisdictional tax rights in cross-border international trade continue to evolve as a result of the base erosion and profit shifting reporting requirements and the introduction of the global minimum tax recommended by the Organisation for Economic Co-operation and Development (“OECD”). For example, the OECD Pillar Two framework introduces a global minimum corporate tax rate of 15% for companies with global revenues above certain thresholds. While it is uncertain whether the U.S. will enact legislation to adopt Pillar Two, certain jurisdictions in which we operate have adopted, and other jurisdictions are in the process of introducing, legislation to implement Pillar Two. As these legislative changes develop and expand, our effective tax rate and tax liabilities may be materially affected. Given the complexities of Pillar Two, we expect to continue to monitor the changes and evaluate their potential impact to our results of operations.\nAdditionally, in August 2022, the previous U.S. President signed into law the IRA, which revised U.S. tax law by, among other things, including a new corporate alternative minimum tax (the “CAMT”) of \n15\n% on certain large corporations, imposing a \n1\n% excise tax on stock buybacks, and providing various incentives to address climate change, including the introduction of the advanced manufacturing production credit under Section 45X of the IRC. The provisions of the IRA are generally effective for tax years beginning after 2022. Given the complexities of the IRA, we will continue to monitor these developments and evaluate the potential future impact to our results of operations. For further information, see the Risk Factor entitled, “We have received and expect to continue to receive certain financial benefits as a result of tax incentives provided by the Inflation Reduction Act of 2022. If these financial benefits vary significantly from our assumptions, our business, financial condition, and results of operations could be adversely affected.” Changes to these and other tax laws and regulations could have a material adverse impact on our business, financial condition, and results of operations.\nWe are subject to potential tax examinations in various jurisdictions, and taxing authorities may disagree with our interpretations of U.S. and foreign tax laws and may assess additional taxes. We regularly assess the likely outcomes of these examinations in order to determine the appropriateness of our tax provision; however, the outcome of tax examinations cannot be predicted with certainty. Therefore, the amounts ultimately paid upon resolution of such examinations could be materially different from the amounts previously included in our income tax provision, which could have a material adverse impact on our business, financial condition, and results of operations.\nIn addition, our future effective tax rate could be adversely affected by changes to our operating structure, losses of tax holidays, changes in the jurisdictional mix of earnings among countries with tax holidays or differing statutory tax rates, changes in the valuation of deferred tax assets and liabilities, changes in tax laws, and the discovery of new information in the course of our tax return preparation process. Any changes in our effective tax rate may have a material adverse impact on our business, financial conditions, and results of operations.\nWe have been and may be subject to or involved in litigation or threatened litigation, the outcome of which may be difficult to predict, and which may be costly to defend, divert management attention, require us to pay damages, or restrict the operation of our business.\nFrom time to time, we have been and may be subject to disputes and litigation, with and without merit, that may be costly and which may divert the attention of our management and our resources in general, whether or not any dispute actually proceeds to litigation. The results of complex legal proceedings are difficult to predict. Moreover, \n40\nTable of Co\nn\ntents\ncomplaints filed against us may not specify the amount of damages that plaintiffs seek, and we therefore may be unable to estimate the possible range of damages that might be incurred should these lawsuits be resolved against us. Even if we are able to estimate losses related to these actions, the ultimate amount of loss may be materially higher than our estimates. Any resolution of litigation, or threatened litigation, could involve the payment of damages or expenses by us, which may be significant or involve an agreement with terms that restrict the operation of our business. Even if any future lawsuits are not resolved against us, the costs of defending such lawsuits may be significant. These costs may exceed the dollar limits of our insurance policies or may not be covered at all by our insurance policies. Because the price of our common stock has been, and may continue to be, volatile, we can provide no assurance that additional securities or other litigation will not be filed against us in the future. See Note 14. “Commitments and Contingencies – Legal Proceedings” to our consolidated financial statements for more information on our legal proceedings.\nChanges in, or any failure to comply with, privacy laws, regulations, and standards may adversely affect our business.\nPersonal privacy and data security have become significant issues in the jurisdictions in which we operate. The regulatory framework for privacy and security issues worldwide is rapidly evolving and is likely to remain uncertain for the foreseeable future. Furthermore, federal, state, or foreign government bodies or agencies have in the past adopted, and may in the future adopt, laws and regulations affecting data privacy, all of which may be subject to invalidation by relevant foreign judicial bodies. Industry organizations also regularly adopt and advocate for new standards in this area.\nIn the United States, these include rules and regulations promulgated or pending under the authority of federal agencies, state attorneys general, legislatures, and consumer protection agencies. Internationally, many jurisdictions in which we operate have established their own data security and privacy legal framework with which we, relevant suppliers, and customers must comply. In many jurisdictions, enforcement actions and consequences for noncompliance are also rising. In addition to government regulation, privacy advocates and industry groups may propose new and different self-regulatory standards that either legally or contractually apply to us. Although we have implemented policies, procedures, and, in certain cases, contractual arrangements designed to facilitate compliance with applicable privacy and data security laws and standards, any inability or perceived inability to adequately address privacy and security concerns, even if unfounded, or comply with applicable privacy and data security laws, regulations, and policies, could result in additional fines, costs, and liabilities to us, damage our reputation, inhibit sales, and adversely affect our business.\nOur Amended and Restated Bylaws designate a state or federal court located within the State of Delaware as the exclusive forum for substantially all disputes between us and our stockholders, and the federal district courts of the United States as the exclusive forum for the resolution of any complaint asserting a cause of action under the Securities Act of 1933, which could limit our stockholders’ ability to choose the judicial forum for disputes with us or our directors, officers, employees, agents or stockholders.\nOur Amended and Restated Bylaws (“Bylaws”) provide that, unless we consent in writing to the selection of an alternative forum, the Court of Chancery of the State of Delaware (or, if the Court of Chancery of the State of Delaware lacks subject matter jurisdiction, the federal district court for the District of Delaware) is the sole and exclusive forum for (i) any derivative action or proceeding brought on our behalf, (ii) any action or proceeding asserting a claim of breach of a fiduciary duty owed by any of our directors, officers, other employees, agents or stockholders to us or our stockholders, (iii) any action or proceeding against us or any of our directors, officers, other employees, agents or stockholders arising pursuant to any provision of the Delaware General Corporation Law (“DGCL”), our Amended and Restated Certificate of Incorporation or our Bylaws, (iv) any action or proceeding against us or any of our directors, officers or other employees asserting a claim that is governed by the internal affairs doctrine, or (v) any action or proceeding asserting an “internal corporate claim,” as defined in the DGCL. Our Bylaws also provide that, unless we consent in writing to the selection of an alternative forum, the federal district courts of the United States are the exclusive forum for resolving any complaint asserting a cause of action under the \n41\nTable of Co\nn\ntents\nSecurities Act. Nothing in our Bylaws precludes stockholders that assert claims under the Exchange Act from bringing such claims in any court, subject to applicable law.\n42\nTable of Co\nn\ntents\nAny person or entity holding, owning or otherwise acquiring any interest in any of our securities shall be deemed to have notice of and consented to these provisions. These exclusive forum provisions may limit a stockholder’s ability to bring a claim in a judicial forum of its choosing for disputes with us or our directors, officers, other employees, agents or stockholders, which may discourage lawsuits against us and our directors, officers, other employees, agents or stockholders. The enforceability of similar choice of forum provisions in other companies’ governing documents has been challenged in legal proceedings, and it is possible that a court could find these types of provisions to be inapplicable or unenforceable. For example, in December 2018, the Court of Chancery of the State of Delaware determined that a provision stating that federal district courts of the United States are the exclusive forum for resolving any complaint asserting a cause of action arising under the Securities Act is not enforceable. Although this decision was reversed by the Delaware Supreme Court in March 2020, courts in other states may still find these provisions to be inapplicable or unenforceable. If a court were to find the exclusive forum provisions in our Bylaws to be inapplicable or unenforceable in an action, we may incur additional costs associated with resolving the dispute in other jurisdictions, which could adversely affect our results of operations.",
    "item1b": "Item 1B. \nUnresolved Staff Comments\nNone.",
    "item1c": "Item 1C. \nCybersecurity\nFirst Solar maintains a cyber risk management program designed to identify, assess, and manage cybersecurity risks. The underlying controls of the cyber risk management program incorporate recognized best practices and standards for cybersecurity, including guidance from the National Institute of Standards and Technology (“NIST”) cybersecurity framework. \nOur cyber risk management program includes various risk assessments that are completed on a regular basis, including (i) information security controls assessments with internal and external audit partners, (ii) architectural and technical assessments with third-party experts, (iii) internal and external penetration testing with third-party service providers, (iv) continuous cyber risk register reviews, and (v) risk prioritization with our executive officers. The identification of cybersecurity risks is aided by a technical toolset as well as threat hunting and counterintelligence services provided by third-party service providers.\n These risk assessments and the technical toolset inform our information security roadmap, which allocates resources toward strategic initiatives to mitigate, transfer, and/or reduce cybersecurity risks. Our associates receive cybersecurity awareness communications, engage in annual cybersecurity training, and are exposed to periodic phishing simulation exercises with targeted training. Additionally, confidential information protection training is regularly provided to associates who have access to personally identifiable information, reside in certain jurisdictions, or have privileged access.\nThird-party risk management at First Solar includes screening processes to evaluate the information security programs and capabilities of our vendors, including periodic reviews of vendor control assessments, such as System and Organization Controls (“SOC”) 2 Type 2 reports, which are supplemented by end-user controls performed by First Solar associates. These processes enable us to oversee and identify potentially material risks from cybersecurity threats associated with our use of third-party service providers.\n43\nTable of Contents\nThe Head of Information Security oversees the Information Security team, which assesses and manages cybersecurity risks at First Solar as part of our information security program.\n \nThe Head of Information Security and our Information Security team members collectively hold certifications in cyber-risk oversight from the National Association of Corporate Directors, Certified Systems Security Officer and Certified Information Systems Manager credentials, and Certified Information Systems Security Professional and Systems Security Certified Practitioner credentials. \nThe Head of Information Security, who has over 20 years of information technology experience, including over 10 years in leadership roles at First Solar,\n reports to the Chief Information Officer\n and regularly briefs the Chief Financial Officer and, at least quarterly, briefs \nthe audit committee of the board of directors\n on cybersecurity matters.\n Effective March 16, 2025, our Head of Information Security will be departing the Company and, as a result, our Chief Information Officer will act as our interim Head of Information Security while we conduct a search for a permanent replacement. Our Chief Information Officer has 25 years of information technology experience, including 18 years in leadership roles at First Solar.\nThe cybersecurity risks identified as part of our information security program are integrated into our enterprise risk management program.\n The audit committee reviews the integration of our cybersecurity controls and procedures with our overall risk management systems and processes, and reviews and discusses with management First Solar’s major information security risks (including cybersecurity) and the steps management has taken to monitor, control, and limit such exposures and risks. An Information Security Steering Committee, which is comprised of senior management from various departments, serves in an advisory capacity regarding the implementation, support, and management of the information security program and compliance with applicable state and federal laws and regulations. This committee aligns business initiatives, material digital risks, risk tolerance levels, and security requirements with the information security roadmap.\nThe Information Security team actively manages cybersecurity threats and incidents through comprehensive technical tooling, reporting, partnerships, and processes. Intrusion prevention, detection, and response systems, access management systems, and incident and vulnerability management systems are all examples of technical tools employed by First Solar’s Information Security team to protect our information technology environment. Our incident response plan includes specific criteria for determining the potential impact of an identified cybersecurity incident and defined escalation protocols to determine which internal and external stakeholders should be involved and the appropriate communication channels, including considerations of any reporting based on regulatory requirements. Further, at least annually, certain key members from our Information Security team engage in cybersecurity tabletop exercises alongside certain members of both our executive team and board of directors, which are designed to simulate a cybersecurity threat or incident to test First Solar’s incident response plan. Cybersecurity incidents are evaluated on a case-by-case basis and are categorized as low, moderate, or high impact incidents depending on qualitative and quantitative factors, including, but not limited to, their operational impact, degree of compromise, legal or regulatory impacts, and data disclosure impacts. The audit committee of the board of directors is notified if a potentially material incident is identified and reviews our response to material cybersecurity incidents, including disclosure considerations and the engagement of forensic and other technology experts to ascertain the extent of the incident, remediation actions, and responsive measures to prevent or mitigate future incidents.\nAs a result of ongoing monitoring, we have not identified any risks from cybersecurity threats, including as a result of previous cybersecurity incidents, that have materially affected or are reasonably likely to materially affect the Company, including its business strategy, financial condition, or results of operations during the period covered by this filing.\n Notwithstanding the cybersecurity processes and procedures described above, we may not be successful in preventing or mitigating a cybersecurity incident that could have a material adverse effect on our business, financial condition, or results of operations. While we maintain cybersecurity insurance, the costs related to cybersecurity incidents, including information and security breaches, or other disruptions may not be fully insured. For further information regarding the risks to us associated with cybersecurity incidents and other events, including information and security breaches, and how such risks may affect the Company, see the Risk Factor entitled, “Cybersecurity incidents or information or security breaches, or those of third parties with which we do business, could have a material adverse effect on our business, financial condition, and results of operations.”\n44\nTable of Contents"
  }
}