{
  "ticker": "FTV",
  "cik": "0001659166",
  "company_name": "Fortive Corp",
  "filing_date": "2025-02-25",
  "accession": "0001659166-25-000024",
  "primary_doc": "ftv-20241231.htm",
  "item_sections": {
    "item1": "Item 1A. Risk Factors” in this Annual Report:\nRisk Related to Our Business Operations\n•\nConditions in the global economy, the markets we serve, and the financial markets may adversely affect our business and financial results.\n•\nIf we cannot adjust our manufacturing capacity, supply chain management or the purchases required for our manufacturing activities to reflect changes in market conditions, customer demand and supply chain disruptions, our profitability may suffer. In addition, our reliance upon sole or limited sources of supply for certain materials, components, and services could cause production interruptions, delays and inefficiencies. \n•\nOur financial results are subject to fluctuations in the cost and availability of commodities or components that we use in our operations.\n•\nOur growth could suffer if the markets into which we sell our products and services decline, do not grow as anticipated, or experience cyclicality.\n•\nWe face intense competition and if we are unable to compete effectively, we may experience decreased demand and decreased market share. Even if we compete effectively, we may be required to reduce prices for our products and services.\n•\nOur growth depends in part on the timely development and commercialization and customer acceptance of new and enhanced products and services based on technological innovation.\n•\nOur ability to attract, develop, and retain senior leaders and other key employees is critical to our success.\n2\nTable of Contents\n•\nDisruptions in, or breaches in security of, our information technology systems have adversely affected, and in the future could adversely affect, our business.\n•\nDefects and unanticipated use or inadequate disclosure with respect to our products (including software) or services could adversely affect our business, reputation, and financial results.\n•\nAdverse changes in our relationships with, or the financial condition, performance, purchasing patterns, or inventory levels of, key distributors and other channel partners could adversely affect our financial results.\n•\nOur restructuring activities could have long-term adverse effects on our business.\n•\nWork stoppages, works council campaigns, and other labor disputes could adversely impact our productivity and results of operations.\n•\nIf we suffer loss to our facilities, supply chains, distribution systems, or information technology systems due to catastrophe or other events, our operations could be seriously harmed.\n•\nIf we do not or cannot adequately protect our intellectual property, or if third parties infringe our intellectual property rights, we may suffer competitive injury or expend significant resources enforcing our rights.\n•\nThird parties may claim that we are infringing or misappropriating their intellectual property rights and we could suffer significant litigation expenses, losses, or licensing expenses or be prevented from selling products or services.\n•\nWe are subject to a variety of litigation and other legal and regulatory proceedings in the course of our business that could adversely affect our financial results.\n•\nClimate change, or legal or regulatory measures to address climate change, may negatively affect us.\n•\nWe may use artificial intelligence in our business and in our products, and challenges with properly managing its use could result in reputational harm, competitive harm, and legal liability, and adversely affect our results of operations.\nRisk Related to our International Operations\n•\nInternational economic, political, legal, trade policies, compliance, and business factors could negatively affect our financial results.\n•\nTrade relations between the United States and other countries could have a material adverse effect on our business and financial results.\n•\nForeign currency exchange rates, including the volatility thereof, may adversely affect our financial results.\nRisk Related to Our Acquisitions, Investments, and Dispositions\n•\nOur plans to separate into two independent, publicly traded companies may not be completed on the currently contemplated timeline or at all and may not achieve the intended benefits, including the anticipated tax treatment.\n•\nAny inability to consummate acquisitions at our anticipated rate and at appropriate prices, and to make appropriate investments that support our long-term strategy, could negatively impact our growth rate and stock price.\n•\nOur acquisition of businesses, investments, joint ventures, and other strategic relationships could negatively impact our financial results.\n•\nThe indemnification provisions of acquisition agreements by which we have acquired companies may not fully protect us and as a result we may face unexpected liabilities.\n•\nDivestitures or other dispositions could negatively impact our business, and contingent liabilities from businesses that we have sold could adversely affect our financial results.\n•\nPotential indemnification liabilities to Vontier Corporation (“Vontier”) pursuant to the separation agreement could materially and adversely affect our businesses, financial condition, results of operations, and cash flows.\n3\nTable of Contents\nRisk Related to Regulatory and Compliance Matters\n•\nChanges in industry standards and governmental regulations may reduce demand for our products or services or increase our expenses.\n•\nOur reputation, ability to do business, and financial results may be impaired by improper conduct by any of our employees, agents, or business partners.\n•\nOur operations, products, and services expose us to the risk of environmental, health, and safety liabilities, costs, and violations that could adversely affect our reputation and financial results.\n•\nOur businesses are subject to extensive regulation, including healthcare regulations; failure to comply with those regulations could adversely affect our financial results and our business, including our reputation.\nRisk Related to Our Tax and Accounting Matters\n•\nChanges in our effective tax rates or exposure to additional tax liabilities or assessments could affect our profitability. In addition, audits by tax authorities could result in additional tax payments for prior periods.\n•\nWe could incur significant liability if our separation from Danaher, our separation of our Automation and Specialty business, or our separation of Vontier (collectively, the “Separation Transactions”) are determined to be a taxable transaction.\n•\nChanges in U.S. GAAP could adversely affect our reported financial results and may require significant changes to our internal accounting systems and processes.\n•\nWe may be required to recognize impairment charges for our goodwill and other intangible assets.\nRisk Related to Our Financing Activities\n•\nWe have incurred a significant amount of debt, and our debt obligations, including the cost of such debt, will increase further if we incur additional debt and do not retire existing debt, our credit rating declines, or if the applicable interest rates rise.\nPART I\nITEM 1. BUSINESS\nGeneral\nFortive Corporation is a provider of essential technologies for connected workflow solutions across a range of attractive end-markets. Our strategic segments - Intelligent Operating Solutions, Precision Technologies, and Advanced Healthcare Solutions - include well-known brands with leading positions in their markets. Our businesses design, develop, manufacture, and service professional and engineered products, software, and services, building upon leading brand names, innovative technologies, and significant market positions. We are headquartered in Everett, Washington and have a workforce of more than 18,000 research and development, manufacturing, sales, distribution, service, and administrative professionals in more than 50 countries around the world.\nOn September 4, 2024, we announced our intention to separate our Precision Technologies segment business into an independent publicly-traded company (the “Separation”), which will be named Ralliant. The Separation will create (i) a technology solutions company, retaining the Fortive name, with a portfolio of the brands currently operating under Fortive’s Intelligent Operating Solutions and Advanced Healthcare Solutions business segments, focused on resilient, high-quality recurring growth by delivering productivity and safety to customers, and (ii) a global technology company consisting of our brands currently operating under the Precision Technologies segment with a focus on precision instruments and highly engineered products essential for breakthrough innovation and aligned to powerful secular trends. The Separation is intended to qualify as a tax-free spin-off for Fortive shareholders for U.S. federal income tax purposes. The Company is targeting completion of the Separation early in the third quarter of 2025, subject to the satisfaction of certain conditions, including, among others, final approval of Fortive’s Board of Directors, satisfactory completion of financing, receipt of a favorable opinion of legal counsel and/or a private letter ruling from the U.S. Internal Revenue Service with respect to the tax treatment of \n4\nTable \nof\n Contents\nthe transaction for U.S. federal income tax purposes, the effectiveness of a Form 10 registration statement filed with the SEC, and other regulatory approvals. \nFortive Corporation is a Delaware corporation and was incorporated in 2015 in connection with the separation of Fortive from Danaher Corporation (“Danaher” or “Former Parent”) on July 2, 2016 as an independent, publicly-traded company, listed on the New York Stock Exchange.\nIn this Annual Report, the terms “Fortive” or the “Company” refer to either Fortive Corporation or to Fortive Corporation and its consolidated subsidiaries, as the context requires. Unless otherwise indicated, all amounts in this Annual Report refer to continuing operations.\nFortive Business System\nOur teams across our operating companies are united by our culture of continuous improvement – characterized by the high expectations, inclusion, humility, and transparency embodied in the Fortive Business System (“FBS”). This cultural foundation is reinforced by the rigor of our disciplined operating cadence. FBS enables us to operate our businesses with a focus on relentless execution, powered by our mindset and a set of tools and best practices consistently applied across our portfolio. We are committed to delivering on our financial commitments and engaging our leaders and teams to accelerate and sustain progress in every aspect of the business, including new product development and commercialization, finance, human capital management, and sustainability. We are continually evolving FBS to meet the changing needs of our portfolio and incorporating new technology enablers, like artificial intelligence and machine learning, to drive faster growth, more productivity, and greater impact. The execution of our disciplined acquisition strategy is strengthened by the value FBS creates and is a critical component of how we achieve sustained results over time.\nPurpose and Values\nWe are guided by our shared purpose to deliver essential technology for the people who accelerate progress. We strive to accelerate transformation in high-impact fields, such as workplace safety, engineering, and healthcare, delivering high-tech solutions and high impact for engineers, scientists, frontline workers, and patients around the world.\nOur values guide how we deliver every day for our stakeholders:\nWe build extraordinary teams for extraordinary results.\nWe believe we are more together, and we all have something unique to offer as we come together to solve problems no one could solve alone, committed to a strong and inclusive culture.\nCustomer success inspires our innovation\n.\nWe believe our most important breakthroughs are the ones that help our customers succeed, and we strive to break down barriers and forge new paths to world-changing innovations to move our customers forward.\nKaizen is our way of life\n.\nWe know we can always do and be better. Our commitment to continuous improvement, grounded in our FBS inspires us to approach our work with curiosity. We are always growing and learning.\nWe compete for our shareholders\n.\nWe believe in prioritizing trust, sustainability, and positive impact to create long-term value for all of our stakeholders, including our shareholders, our employees, our customers and our communities. \nReportable Segments\nWe operate and report our results in three segments, Intelligent Operating Solutions, Precision Technologies, and Advanced Healthcare Solutions, each of which is further described below. \nIntelligent Operating Solutions\nOur Intelligent Operating Solutions segment provides advanced instrumentation, software and services to tens of thousands of customers enabling their mission-critical workflows. These offerings include electrical test & measurement, facility and asset lifecycle software applications, connected worker safety and compliance solutions across a range of vertical end markets, including manufacturing, process industries, healthcare, utilities and power, communications and electronics, among others. \n5\nTable \nof\n Contents\nTypical users of these safety, productivity and sustainability solutions include electrical engineers, electricians, electronic technicians, EHS professionals, network technicians, facility managers, first-responders, and maintenance professionals.  \nProducts and services within our Intelligent Operating Solutions segment are marketed under a variety of leading brands, including ACCRUENT, FLUKE, GORDIAN, INDUSTRIAL SCIENTIFIC, INTELEX, PRUFTECHNIK, and SERVICECHANNEL.  \nPrecision Technologies\nOn September 4, 2024, we announced our intention to separate our Precision Technologies segment into an independent publicly traded company, subject to the satisfaction of certain conditions, including, among others, final approval of Fortive’s Board of Directors, satisfactory completion of financing, receipt of a favorable opinion of legal counsel and/or a private letter ruling from the U.S. Internal Revenue Service with respect to the tax treatment of the transaction for U.S. federal income tax purposes, the effectiveness of a Form 10 registration statement filed with the SEC, and other regulatory approvals.\nOur Precision Technologies segment helps solve tough technical challenges to speed breakthroughs in a wide range of applications, from food and beverage production and manufacturing to next-generation electric vehicles and clean energy, as our customers seek new test solutions to enable the electrification and connectivity of everything. Our expertise in materials, methods and measurements are reflected in our electrical test & measurement and sensing and material technologies offered to a broad set of customers and vertical end markets, including industrial, power and energy, automotive, medical equipment, food and beverage, aerospace and defense, semiconductor, and other general industries. Customers for these products and services include design engineers for advanced electronic devices and equipment, process and quality engineers focused on improved process capability and productivity, facility maintenance managers driving increased uptime, and other customers for whom precise measurement, reliability, and compliance are critical in their applications.\nProducts and services in our Precision Technologies segment are marketed under a variety of brands, including ANDERSON-NEGELE, GEMS, SETRA, HENGSTLER-DYNAPAR, QUALITROL, PACIFIC SCIENTIFIC, KEITHLEY and TEKTRONIX. \nAdvanced Healthcare Solutions\nOur Advanced Healthcare Solutions segment supplies critical workflow solutions enabling healthcare providers to deliver exceptional patient care more efficiently. Our offerings include instrument sterilization solutions, instrument tracking, biomedical test tools, radiation detection and safety monitoring, and end-to-end clinical productivity software and solutions. Our healthcare offerings help ensure critical safety standards are met, instruments and operating rooms are working at peak performance, and complex procedures are followed accurately in these mission-critical healthcare environments.  \nProducts and services in our Advanced Healthcare Solutions segment are marketed under a variety of brands, including ASP, CENSIS, CENSITRAC, EVOTECH, FLUKE BIOMEDICAL, LANDAUER, PROVATION, RAYSAFE, and STERRAD. \n************************************\nThe following discussion includes information common to all of our segments.\nMaterials  \nOur manufacturing operations employ a wide variety of raw materials, including electronic components, steel, plastics and other petroleum-based products, aluminum, and copper. Prices of oil and gas affect our costs for freight and utilities. We purchase raw materials from a large number of independent sources around the world. Tariffs affect our costs for impacted materials or components we import into the United States. Based on allocation of annual spend among our various suppliers, no single supplier is material. However, some components that require particular specifications or qualifications are dependent on a single supplier or a limited number of suppliers that can readily provide such components. We utilize a number of techniques to address potential disruption in and other risks relating to our supply chain, including in certain cases the use of safety stock, alternative materials that meet the quality and regulatory requirements, and qualification of multiple supply sources. While the remediation efforts taken by certain jurisdictions in response to events, such as the COVID-19 pandemic and the disruptions from the Ukraine/Russia conflict, have raised material and shipping costs, our supply chain was responsive to these dynamics, and we implemented solutions, including through FBS and working collaboratively with our suppliers, to effectively support our operations, and help countermeasure production material shortages and distribution limitations. For a further discussion of risks related to the materials and components required for our operations, please refer to “",
    "item1a": "Item 1A of this Annual Report on Form 10-K, which disclosures are incorporated by reference herein\n.\nCybersecurity Governance\nCybersecurity is an important part of our risk management processes and an area of focus for our Board and management.\nOur \nAudit Committee\n is responsible for the oversight of risks from cybersecurity threats and provides regular reports to the entire Board.\n \nIn addition, at least annually, the entire Board receives an overview from management of our cybersecurity threat risk management and strategy processes covering topics such as data security posture, results from third-party assessments, progress towards predetermined risk-mitigation-related goals, our incident response plan, and material cybersecurity threat risks or incidents and developments, as well as the steps management has taken to respond to such risks. In such sessions, the Board generally receives materials indicating current and emerging material cybersecurity threat risks and describing the company’s ability to mitigate those risks, and discusses such matters with our CIO and CISO. Material cybersecurity threat risks are also considered during separate Board meeting discussions of overall key enterprise risks, operational budgeting, crisis management planning, and other relevant matters.\nOur cybersecurity risk management and strategy processes, which are discussed in greater detail above, are led by our CIO and our CISO. Our CIO and our CISO have over 30 years and 25 years, respectively, of prior work experience in various roles involving managing information security, developing cybersecurity strategy, implementing effective information and cybersecurity programs and implementing business continuity planning and incident response plans. Our CIO and CISO each hold several degrees and certifications relevant to their roles. Our CIO and our CISO are informed about and monitor the prevention, mitigation, detection, and remediation of cybersecurity incidents through their management of, and participation in, the cybersecurity risk management and strategy processes described above, including the operation of our incident response plan, oversight of the entire IT function, including at Fortive Corporation and the IT leaders at our operating companies.\nOur CIO and our CISO report to the Audit Committee and to the full Board about cybersecurity threat risks and other cybersecurity related matters.\n \nIn addition, under our escalation policy, following the detection of a potentially significant cybersecurity incident, our CISO and our General Counsel escalate to the Executive Officers, core members of the Disclosure Committee\n, Chair of the Audit Committee and the Chair of the Board initially, and then to the entire Board, as appropriate.",
    "item1b": "ITEM 1B. UNRESOLVED STAFF COMMENTS \nNot applicable.",
    "item1c": "ITEM 1C. CYBERSECURITY\nCybersecurity Risk Management and Strategy\nOur process for assessing, identifying, and managing material risks associated with cybersecurity threats, including risks related to disruptions to our operations, compromise of our intellectual property rights, data privacy, litigation and other legal liability and reputational impacts, is an important component of our overall enterprise risk management process.\n \nAs part of this process, \n24\nTable \nof\n Contents\nboth corporate and operating company leaders collaborate with subject matter experts to identify and assess cybersecurity threats and implement relevant countermeasures.\n \nIn addition to this component of our overall risk management process, we have separate cybersecurity-specific risk assessment and management processes that are managed centrally and executed at both the corporate and operating company levels.\n \nThese processes, including corresponding controls, are designed to help us protect against, detect, and respond to cybersecurity threats, and to manage business continuity, the availability of critical systems, product security, disclosure controls and procedures, escalation, and regulatory compliance in the event of any cybersecurity disruption.\n \nAs part of our cybersecurity controls and processes:\n•\nwe have designed our cybersecurity program based on the National Institute of Security and Technology (“NIST”) framework, Generally Accepted Privacy Program (“GAPP”) guiding principles, and ISO 27001/2 standards;\n•\nour cybersecurity team, led by our Chief Information Officer (“CIO”) and Chief Information Security Officer (“CISO”) coordinates with our privacy and information governance team within our legal department to help ensure compliance with applicable regulatory and reporting requirements;\n•\nthe CIO and CISO undertake an annual review of the cybersecurity strategy and initiatives for Fortive and each of the operating companies, with monthly reviews of performance relative to strategic initiatives with the Chief Executive Officer (“CEO”) and the other executive officers;\n•\nthe CIO and CISO participate in product design efforts with operating company leaders to enhance our product security;\n•\nthrough the compliance training program, we conduct mandatory cybersecurity management, data privacy and incident training for all employees;\n•\nwe conduct regular phishing email simulations for all employees and all contractors with access to corporate email systems to enhance awareness and responsiveness to possible threats;\n•\nthrough policy, practice and contract provisions, we require employees, as well as third-party vendors who process data, to treat customer and other personal information and data with care and in compliance with regulations;\n•\nwe run tabletop exercises conducted by leading third-party cybersecurity experts, with involvement by the broader IT team, legal team, communications team, executive management team, and the Board, to simulate a response to a cybersecurity incident and use the findings to improve our processes and technologies;\n•\nwe conduct regular network and endpoint monitoring, vulnerability assessments, and penetration testing designed to improve our information systems;\n•\nwe review and update, and provide training, on cybersecurity incident response plans, business continuity plans, and cyber incident escalation plans, including the involvement of our Disclosure Committee (which includes our CISO as a regular member);\n•\nas part of that cyber incident escalation plan, our Disclosure Committee\n \nreviews cybersecurity incidents to assess materiality and consider disclosure requirements; \n•\nthe CISO meets with the information security teams at the operating companies on a monthly basis, or as needed, to review escalated items, compliance with incident response plans, and performance against strategic targets;\n•\nthe CIO and the CISO meet with the CEOs of our operating segments and the presidents of our operating companies to discuss IT strategies, updates, and initiatives, including those related to cybersecurity; \n•\nthe CIO and the CISO meet with the Audit Committee on a quarterly basis and the full Board on an annual basis to provide updates on the cybersecurity program, including controls and processes, strategies, achievements, risks, and recent incidents;\n•\nthe CIO and the CISO also meet with the full Board on an annual basis as part of the overall enterprise risk management review; and\n25\nTable \nof\n Contents\n•\nthe CISO, as a member of the Disclosure Committee, meets with other members of the Disclosure Committee to discuss materiality and disclosure with respect to cybersecurity matters.\nAs part of the above processes, we regularly engage with assessors, consultants, auditors, and other third parties, including by regularly having independent cybersecurity experts conduct tabletop exercises, conduct penetration tests, and review our cybersecurity program to help identify areas for continued focus, improvement and compliance.\n \nIn addition, our processes also address cybersecurity threat risks associated with our use of third-party software and service providers, including those in our supply chain or who have access to our customer and employee data or our systems. Third-party risks are included within our broader overall risk assessment process, as well as our cybersecurity-specific risk identification program, both of which are discussed above. In addition, cybersecurity considerations affect the selection and oversight of our third-party service providers. We perform diligence on critical third parties that have access to our systems, data or facilities that house such systems or data, and continually monitor cybersecurity threat risks identified through such diligence. Additionally, we generally require those third parties to agree by contract to manage their cybersecurity risks in specified ways to be subject to cybersecurity audits, which we may conduct as appropriate.\nTo date, we believe that the risks from identified cybersecurity threats, including as a result of previous cybersecurity incidents, have not materially affected and are not reasonably likely to materially affect us, including our business strategy, results of operations, or financial condition. Refer to the discussions under the headings “Significant disruptions in, or breaches in security of, our information technology systems have adversely affected, and in the future could adversely affect, our business” included as part of our risk factor disclosures at"
  }
}