{
  "ticker": "GD",
  "cik": "0000040533",
  "company_name": "GENERAL DYNAMICS CORP",
  "filing_date": "2025-02-07",
  "accession": "0000040533-25-000008",
  "primary_doc": "gd-20241231.htm",
  "item_sections": {
    "item1": "Item 16.\nForm 10-K Summary\n109\nSignatures\n110\n2\nPART\n \nI\nITEM 1.\n BUSINESS\n(Dollars in millions, unless otherwise noted)\nBUSINESS OVERVIEW\nGeneral Dynamics is a global aerospace and defense company that specializes in high-end design, engineering and manufacturing to deliver state-of-the-art solutions to our customers. We offer a broad portfolio of products and services in business aviation; ship construction and repair; land combat vehicles, weapons systems and munitions; and technology products and services. Our leadership positions in attractive business aviation and defense markets enable us to deliver superior and enduring shareholder returns.\nOur company consists of 10 business units, which are organized into four operating segments: Aerospace, Marine Systems, Combat Systems and Technologies. We refer to the latter three collectively as our defense segments. To optimize market focus, customer intimacy, agility and operating expertise, each business unit is responsible for the development and execution of its strategy and operating results. This structure allows for a lean corporate function, which sets the overall strategy and governance for the company and is responsible for allocating and deploying capital.\nOur business units seek to deliver superior operating results by building industry-leading franchises. To achieve this goal, we invest in advanced technologies, pursue a culture of continuous improvement, and strive to be the low-cost, high-quality provider in each of our markets. The result is long-term value creation measured by strong earnings and cash flow and an attractive return on capital.\nOver the past decade, we have invested to create, renew or expand our portfolio of products and services across our businesses. This includes product development investments in Aerospace to bring to market an all-new lineup of business jet aircraft, capital investments in Marine Systems to support significant growth in U.S. Navy ship and submarine construction plans over the next two decades, development of next-generation platforms and technologies to meet customers’ emerging requirements in Combat Systems, and strategic acquisitions to achieve critical mass and build out a complete spectrum of solutions for our Technologies customers. We expect to realize an attractive return from these investments in each of our segments, and we will continue to evaluate our capital deployment opportunities to deliver long-term growth and enduring value to our shareholders.\nFollowing is additional information on each of our operating segments. For a supplemental discussion of segment performance and backlog, see Management’s Discussion and Analysis of Financial Condition and Results of Operations in Item 7.\nAEROSPACE\nOur Aerospace segment is recognized as a leading producer of business jets and the standard bearer in new technology aircraft, aircraft repair, customer support and custom completion services. The segment consists of our Gulfstream and Jet Aviation business units. We have earned our reputation through:\n•\nsuperior aircraft design, manufacturing excellence, quality, performance, safety and reliability;\n•\ntechnologically advanced flight deck and cabin systems; and\n•\nindustry-leading customer support.\n3\nWe believe the key to long-term value creation in the business jet industry is steady investment in new aircraft models and technologies and in customer service capabilities. Since acquiring Gulfstream more than 20 years ago, we have made significant investments in research and development (R&D), state-of-the-art manufacturing facilities, and maintenance and support through a combination of product development efforts, capital expansion and Jet Aviation’s global support network. We are also the industry leader in the use of sustainable aviation fuel (SAF) and energy efficient engines.\nWe are committed to continual investment in R&D to create new aircraft that consistently broaden customer offerings while raising the bar for safety and performance. The result is the unprecedented development of an all-new lineup of the most technologically advanced business jet aircraft in the world. The Gulfstream family of aircraft offer industry-leading cabin, cockpit and safety technologies and the longest ranges at the fastest speeds in their respective classes.\nThe following represents Gulfstream’s current product line, along with the maximum range, maximum speed, cabin length (excluding baggage), and total number of city-pair speed records held for each aircraft: \nGulfstream’s in-service aircraft hold 405 city-pair speed records, more than any other business jet manufacturer, including the National Aeronautic Association’s polar and westbound around-the-world speed records.\nThe most recent addition to the in-service Gulfstream fleet is the ultra-long-range, ultra-large-cabin G700, which entered service following U.S. Federal Aviation Administration (FAA) certification in March 2024. It combines our most spacious cabin with our advanced Symmetry Flight Deck, the industry’s most technologically advanced flight deck, and the superior high-speed performance of all-new engines to create best-in-class capabilities. \nIn 2021, we introduced two new aircraft, the ultra-long-range, ultra-large-cabin G800 and the large-cabin G400, completing a nearly two decade effort to develop an all new family of Gulfstream aircraft. \n4\nBoth aircraft feature our industry-leading high-speed range and efficiency, safety enhancements, and our advanced Symmetry Flight Deck. The G800 is Gulfstream’s longest-range aircraft, with an 8,000 nautical mile range at Mach 0.85. The G800 replaces the G650 and G650ER, which currently operate in 55 countries with more than 580 aircraft of this family in service. The G400 is a clean-sheet (i.e., all new) design developed in concert with the G500 and G600, thus expanding the commonality across the Gulfstream family of aircraft. The G400 will join a market segment in which Gulfstream has not participated for several decades. Both aircraft will enter service following FAA certification. \nThe G500 and G600 entered service in 2018 and 2019, respectively. These clean sheet aircraft replaced the G450 and G550 models, whose combined family has an installed base of more than 1,650 aircraft around the world. Our investment in the development of these aircraft included a new wing, new avionics, new fuselage and new ergonomically designed larger interiors, as well as systems and technologies to improve the manufacturing process and quality of the aircraft. As a result, the G500 and G600 are faster, more fuel efficient, and have greater cabin volume, reduced emissions, more range and improved flight controls compared with the aircraft they replaced. At year-end 2024, cumulative deliveries of the G500 and G600 aircraft totaled more than 300. \nOur disciplined and consistent approach to new product development has allowed us to introduce repeatedly first-to-market capabilities that set industry standards for safety, performance, quality, speed and comfort. Product enhancement and development efforts include initiatives in advanced avionics, composites, flight-control and vision systems, acoustics, and cabin technologies.\nGulfstream designs, develops and manufactures aircraft in Savannah, Georgia, including all large-cabin models. The mid-cabin G280 is assembled by a non-U.S. partner. All models are outfitted in Gulfstream’s and Jet Aviation’s facilities. As Gulfstream’s aircraft portfolio and customer base have grown and become increasingly global in reach over the years, we have invested in our facilities and operations around the world. At our Savannah campus, we added new purpose-built manufacturing facilities, increased aircraft service capacity, opened a customer-support distribution center and expanded our R&D capabilities.\nWe offer comprehensive support for the more than 3,000 Gulfstream aircraft in service around the world and operate an extensive network of factory-owned service centers. We continue to invest in these maintenance, repair and overhaul (MRO) facilities and inventory to accommodate fleet growth. We also operate a 24/7 year-round customer support center and offer on-call Gulfstream aircraft technicians ready to deploy around the world for customer service requirements under our Field and Airborne Support Team (FAST) rapid-response unit.\nIn addition to expanding the reach of Gulfstream’s aircraft maintenance network outside the United States, Jet Aviation provides a comprehensive suite of innovative aircraft services for aircraft owners and operators around the world. With approximately 50 locations throughout North America, Europe, the Middle East and the Asia-Pacific region, our offerings include maintenance, completion, aircraft management, charter, staffing and fixed-base operator (FBO) services. \nJet Aviation manages approximately 310 business aircraft globally on behalf of individuals and corporate owners. We operate a leading global FBO network of approximately 30 facilities on four continents and support all aircraft types with a full range of maintenance services, including 24/7 global aircraft-on-ground support. We also operate one of the world’s largest custom completion and refurbishment centers for both narrow- and wide-body aircraft and perform modifications, upgrades and lifecycle sustainment support for various government fleets. We continue to grow our global footprint through acquisitions, expansions and significant renovations in strategic business aviation markets most \n5\nfrequented by these customers. In 2024, we acquired FBO operations in Milwaukee, Wisconsin, and broke ground on a new facility in Miami, Florida, at Opa Locka Executive Airport, expanding options in the Upper Midwest and on the East Coast for customers based in and traveling across these regions. \nThe following map displays the broad reach of our combined Gulfstream and Jet Aviation services network, including authorized service centers: \nThe Aerospace segment places a priority on sustainability throughout its manufacturing and service operations, producing aircraft that maximize fuel efficiency while offering customers options to reduce or eliminate their carbon footprints. Gulfstream and Jet Aviation have been at the forefront of the industry by adopting and expanding the availability of SAF, which achieves as much as an 80% reduction in carbon dioxide emissions per gallon over its lifecycle compared to petroleum-based jet fuel. Gulfstream’s service and test aircraft have flown more than two million nautical miles on SAF since 2016, and in 2019, Gulfstream became the first business jet manufacturer to make SAF available to customers. In November 2023, Gulfstream conducted the world’s first transatlantic flight using 100% SAF. Gulfstream also offers operators the ability to achieve carbon-neutral travel by facilitating the purchase of carbon-offset credits. In addition to actively expanding the availability of SAF at its FBO locations, Jet Aviation allows customers to purchase SAF at locations where it is not available through a book-and-claim system. Since 2019, Jet Aviation has uploaded more than 11 million gallons of blended SAF to its customers.\nRevenue for the Aerospace segment was 24% of our consolidated revenue in 2024, 20% in 2023 and 22% in 2022. Revenue by major products and services was as follows:\nYear Ended December 31\n2024\n2023\n2022\nAircraft manufacturing\n$\n7,811 \n$\n5,710 \n$\n5,876 \nAircraft services\n3,438 \n2,911 \n2,691 \nTotal Aerospace\n$\n11,249 \n$\n8,621 \n$\n8,567 \n6\nMARINE SYSTEMS\nOur Marine Systems segment is the leading designer and builder of nuclear-powered submarines and a leader in surface combatant and auxiliary ship design and construction for the U.S. Navy. We also provide maintenance, modernization and lifecycle support services for Navy ships and maintain the most sophisticated marine engineering expertise in the world to support future capabilities. Our ability to design, build and maintain our nation’s most technologically sophisticated warships is a critical element of the U.S. defense industrial base. In addition to Navy ships, we have designed and built ocean-going Jones Act ships for commercial customers. Marine Systems consists of three business units — Electric Boat, Bath Iron Works and NASSCO.\nIn support of our Navy customer’s significant increase in demand for submarines and surface ships, we have made substantial investments to expand our facilities, grow and train our workforce, and expand our supply chain. The resulting increase in capacity and capabilities will support the unprecedented growth expected in our shipbuilding business, particularly submarines, over the next two decades.\nElectric Boat is the prime contractor and lead shipyard on all Navy nuclear-powered submarine programs. The business is responsible for all aspects of design and engineering and leads the construction of both Columbia-class ballistic-missile submarines and Virginia-class attack submarines.\nThe Columbia-class ballistic-missile submarine is a 12-boat program that the Navy considers its top acquisition priority. Accordingly, the program has received the highest possible rating from the government’s Defense Priorities and Allocations System. These submarines will provide strategic deterrent capabilities for decades, with the first boat expected to deliver in 2028 to begin replacement of the current Ohio-class ballistic-missile submarine fleet as it reaches the end of its service life. Construction is scheduled to span two decades, and the value of the Navy’s program of record is in excess of $125 billion.\nThe Navy procures Virginia-class submarines in multi-boat blocks. Along with an industry partner, we are currently working on Blocks IV and V in the program, with 14 Virginia-class submarines in our backlog scheduled for delivery through 2032. Ten of the planned boats in Block V will include the Virginia Payload Module, an 84-foot Electric Boat-designed-and-built hull section that adds four additional payload tubes, more than tripling the strike capacity of these submarines and providing unique capabilities to support special missions. \nWe have invested significant capital over the past several years in expanded and modernized facilities at Electric Boat to support the growth in submarine construction, and will work with our Navy customer on any additional construction needs that could develop in light of increased submarine demand. Equal to the commitment of capital is our commitment to developing our Electric Boat workforce. While the steepest portion of our personnel ramp is behind us, we still expect the Electric Boat workforce to continue to grow to enable sustained production of one Columbia-class submarine plus up to two Virginia-class submarines per year as the submarine industrial base expands to support that pace. Along with strong contributions from the states of Connecticut and Rhode Island, we continue to invest in the training and tools necessary for our skilled employees to deliver these next-generation submarines to the Navy. We continue to work with our growing network of approximately 3,000 suppliers to support the growth related to concurrent production of the two submarine programs.\nBath Iron Works builds the Arleigh Burke-class (DDG-51) guided-missile destroyer and manages modernization and lifecycle support for all Navy destroyers. In 2023, we were awarded a contract from \n7\nthe Navy for construction of three Flight III DDG-51 destroyers. We have a total of 11 ships in backlog scheduled for delivery through 2032.\nNASSCO specializes in Navy auxiliary and support ships and is currently building the Expeditionary Sea Base (ESB), which serves as an afloat forward-staging base for U.S. Marines and special operations forces, and the John Lewis-class (T-AO-205) fleet replenishment oiler. Work on the final ESB in backlog will continue into 2026, while the six T-AO-205 ships currently in backlog have deliveries planned into \n2028\n. In 2024, NASSCO received an award for the tenth ship of this class with options to build up to seven additional T-AO-205 ships. NASSCO has also designed and built crude oil and product tankers and container and cargo ships for commercial customers, satisfying Jones Act requirements that ships carrying cargo between U.S. ports be built in U.S. shipyards.\nOn December 31, 2024, backlog for our major ship construction programs and the scheduled final delivery date of ships currently in backlog were as follows:\nIn addition to design and construction activities, our Marine Systems segment provides comprehensive post-delivery services to modernize and extend the service life of these and other Navy ships. NASSCO conducts full-service maintenance and surface-ship repair operations in Navy fleet concentration areas in San Diego, California; Norfolk, Virginia; Bremerton, Washington; and Mayport, Florida. Electric Boat provides submarine maintenance and modernization services in a variety of U.S. locations, and Bath Iron Works provides lifecycle support services for Navy surface ships in U.S. and overseas ports. In support of allied navies, we offer program management, planning, engineering and design support for submarine construction programs.\n8\nRevenue for the Marine Systems segment was 30% of our consolidated revenue in 2024, 29% in 2023 and 28% in 2022. Revenue by major products and services was as follows:\nYear Ended December 31\n2024\n2023\n2022\nNuclear-powered submarines\n$\n10,392 \n$\n8,631 \n$\n7,310 \nSurface ships\n2,819 \n2,698 \n2,561 \nRepair and other services\n1,132 \n1,132 \n1,169 \nTotal Marine Systems\n$\n14,343 \n$\n12,461 \n$\n11,040 \nCOMBAT SYSTEMS\nOur Combat Systems segment is a premier manufacturer and integrator of land combat solutions worldwide, including wheeled and tracked combat vehicles, weapons systems and munitions. The segment consists of three business units — Land Systems, European Land Systems (ELS), and Ordnance and Tactical Systems (OTS).\nCombat Systems creates long-term value through operational excellence — high-quality, on-schedule and on-budget performance — combined with investments in innovative technologies that modernize existing platforms and develop next-generation capabilities to meet our customers’ rapidly evolving requirements. We maintain our market-leading position by focusing on innovation, affordability and speed to market to deliver increased survivability, performance and lethality on the battlefield. Our large installed base of wheeled and tracked vehicles around the world and expertise gained from research, engineering and production programs position us well for modernization programs, support and sustainment services, and future development programs.\nLand Systems is the sole-source producer of two foundational products central to the U.S. Army’s warfighting capabilities — the Abrams main battle tank and Stryker wheeled combat vehicle. Both of these platforms are core components of the multi-domain, joint war fight in practice today and envisioned on the battlefield of the future. \nWe continue to maximize the capability, effectiveness and lethality of the Abrams tank to overmatch all current and potential threats. The demand by NATO members and other allies and partners for procurement and upgrades of Abrams tanks remains strong, reflected by a growing installed base in Europe, the Middle East, North Africa and Indo-Pacific theaters of operation.\nThe Stryker is an eight-wheeled, medium-weight combat vehicle that combines lethality, mobility and survivability. Land Systems continues to develop upgrades and enhancements to this highly versatile and combat-proven platform to address the Army’s evolving operational needs. We are currently fielding a Stryker platform that includes enhanced survivability, increased power, improved cross-country mobility and an advanced digital, in-vehicle network. We have completed fielding these vehicles for four of the current eight Army brigades, as well as for the Army’s Ranger Regiment. In addition, coordination continues with the Army for next-generation upgrades to the platform and new uses for the vehicle. We continue to expand the mission capabilities of this platform, including an air defense mission package (Sergeant Stout, formerly known as M-SHORAD), a state-of-the-art electronic warfare suite, a high-energy laser, a high-power microwave and several command post options.\nWe are in low-rate initial production (LRIP) of the Army’s M10 Booker combat vehicle — the first newly developed Army ground combat vehicle to transition from prototype to production in 45 years. The M10 Booker will enhance the capability and lethality of Infantry Brigade Combat Teams in combat \n9\noperations. The highly lethal, survivable and mobile direct-fire combat vehicle melds recently developed and battle-tested designs to dominate ground threats on the multi-domain battlefield.\nCombat Systems provides similar capabilities for U.S. allies and partners through export opportunities and through our operations in several countries around the world, including Canada, the United Kingdom, Spain, Switzerland, Austria, Germany and Romania. As a result, we have a market-leading position in light armored vehicles (LAVs) with more than 12,000 of the high-mobility, versatile Pandur, Piranha and other LAVs in service worldwide.\nLand Systems is producing 449 new LAVs for the Canadian army in eight variants, including ambulances, command posts, maintenance and recovery vehicles, and troop-carrying vehicles, as well as upgrading Canada’s existing fleet. In addition, Land Systems is producing 66 additional LAVs on the Light Armoured Vehicle Reconnaissance Surveillance System (LRSS) program that are equipped with state of the art surveillance suites. Land Systems is also producing the British Army’s Ajax armored fighting vehicle, a next-generation, medium-weight tracked combat vehicle. With six variants, including a reconnaissance vehicle, an armored personnel carrier and various support platforms, the Ajax family of vehicles offers advanced electronic architecture and proven technology for a balance of survivability, lethality and mobility, along with high reliability for a vehicle in its weight class. \nELS is producing and upgrading Piranha vehicles, a premier 8x8 armored combat vehicle, around the world. We are currently providing Piranha 5 vehicles for several countries, including Denmark, Romania and Spain. Additionally, we provide mobile bridge systems with payloads ranging from 100 kilograms to 100 tons to customers worldwide. We offer the ASCOD, a highly versatile tracked combat vehicle with multiple versions, including the Spanish Pizarro and the Austrian Ulan. ELS also offers Duro and Eagle tactical vehicles in a range of options and weight classes and is currently producing these vehicles for Luxembourg, Switzerland and Germany, while providing a full range of product support for the German armed forces.\nWe are expanding our platform capabilities through continued investment in robotic and autonomous vehicle technology. We have developed semi-autonomous robotic platforms that can be equipped with an array of modular mission payloads for use alongside dismounted soldiers. The Army’s first robotic vehicle program of record, the Small Multipurpose Equipment Transport (S-MET), is based on a Land Systems-developed autonomous vehicle. Additionally, we have developed the Tracked Robot 10-ton (TRX) prototype, a medium-sized, semi-autonomous combat vehicle that enables critical battlefield roles, such as direct and indirect fire, autonomous resupply, reconnaissance and other battlefield missions. \n10\nOn December 31, 2024, the installed base for our major vehicle programs, as well as the quantity and scheduled final delivery date of vehicles and vehicle upgrades in backlog were as follows:\nComplementing these military-vehicle offerings, OTS designs, develops and produces a comprehensive array of sophisticated weapon systems and munitions. OTS produces next-generation weapon and defense systems for shipboard, aircraft and ground applications, including high-speed Gatling guns for all U.S. fighter aircraft, and combat vehicle active protection systems.\nOTS’s munitions portfolio covers the full breadth of naval, air and ground forces applications across all calibers and weapon platforms for the U.S. government and its non-U.S. partners. Globally, we maintain a market-leading position in the supply of Hydra-70 rockets, large-caliber tank ammunition, medium-caliber ammunition, military propellants, mortar and a 155mm artillery suite of ammunition. OTS is expanding its existing metal parts production capacity from 36,000 to 86,000 rounds per month in 2025 and its existing propellant capacity from 5 million to 16 million pounds per year by 2028 while establishing capacity for 155mm load, assemble, and pack (LAP) of 50,000 rounds per month in 2025. The OTS facilities and production expansion supports the Army’s effort to accelerate artillery production. In addition, OTS entered into a strategic teaming agreement in 2024 for the production of solid rocket motors that will improve resiliency in the domestic supply chain.\nOTS is the systems integrator for the next generation of artillery solutions in support of the Army’s Indirect Fire Modernization objectives. Additionally, OTS maintains a leading position providing missile subsystems in support of U.S. tactical and strategic missiles, provisioning both legacy and next-\n11\ngeneration missiles with critical aerostructures, control actuators, high-performance warheads, and cutting-edge hypersonic rocket cases.\nRevenue for the Combat Systems segment was 19% of our consolidated revenue in 2024, 20% in 2023 and 18% in 2022. Revenue by major products and services was as follows:\nYear Ended December 31\n2024\n2023\n2022\nMilitary vehicles\n$\n5,101 \n$\n5,036 \n$\n4,581 \nWeapons systems, armament and munitions\n2,932 \n2,442 \n2,024 \nEngineering and other services\n964 \n790 \n703 \nTotal Combat Systems\n$\n8,997 \n$\n8,268 \n$\n7,308 \nTECHNOLOGIES\nOur Technologies segment provides a full spectrum of services, technologies and products to a wide range of military, intelligence, federal civilian and state customers. The segment is organized into two business units — Information Technology (GDIT) and Mission Systems — with a diverse portfolio that includes:\n•\nconsulting, technology solutions and mission-support services;\n•\nmobile communication, computers, command-and-control and cyber (C5) mission systems; and\n•\nintelligence, surveillance and reconnaissance (ISR) solutions.\nOver the past decade, the U.S. Department of Defense (DoD), the intelligence community and federal civilian agencies have increasingly prioritized technology solutions as a critical element of their missions, transforming technology resources from back-office support functions to a strategic priority. Expanded cyber threats and the demand for advanced warfighter connectivity have accelerated these trends, adding urgency to required technology investments. The result is a significant increase in federal information technology (IT) modernization and technology spending in recent years and a shift to large-scale, end-to-end, highly engineered solutions to meet the ever-changing information-systems and mission-support needs of these customers.\nGDIT and Mission Systems share a common defense, intelligence and federal civilian customer base and increasingly go to market together. In addition, with the convergence of digital technologies, the two businesses benefit from significant complementary offerings and solution sets. We make strategic investments in new and emerging technologies and partner with commercial companies to bring solutions to our customers that combine leading-edge technologies with an intimate knowledge of customers’ mission needs. The segment’s highly skilled workforce comprises approximately 40,000 employees, including technologists, engineers, mission experts and cleared personnel critical to solving the toughest security and technology challenges facing the United States and its allies.\nGDIT provides digital consulting services, modernizes large-scale IT enterprises, and deploys the latest technologies to optimize and protect customer networks, data and information. Operating thousands of complex digital modernization programs across the federal government, GDIT’s expansive portfolio includes cloud services, cybersecurity, network modernization, artificial intelligence/machine learning (AI/ML), application development, high-performance computing, and 5G and next-generation wireless communications. In 2024, GDIT acquired Iron EagleX, Inc., further expanding its portfolio of mission solutions in AI/ML, cyber, software development and cloud services. At the center of these efforts is GDIT’s development of secure, tailorable and scalable digital solutions, known as our Digital \n12\nAccelerators. These Digital Accelerators are at the forefront of technological trends and are designed to accelerate customers’ adoption and integration of advanced technologies to meet unique mission needs.\nMission Systems is a defense electronics manufacturer and integrator for C5ISR applications in all domains. Our products and solutions are built into platforms and integrated systems critical to our national security. The business’ portfolio includes both prime contract programs with government customers as well as subcontract positions with large platform providers to develop and integrate technologies to make their systems smarter and more secure.\nThe Technologies segment leverages its scale, partnerships and deep knowledge of its customers’ missions and challenges to bring innovation to those customers across a portfolio of thousands of contracts. While no individual contract is material to the segment’s results, the following highlights provide a sampling of the value of this business. \nIn the defense market, GDIT is modernizing the U.S. Central Command’s (CENTCOM) enterprise IT infrastructure. CENTCOM’s area of responsibility covers 21 nations in Northeast Africa, Central and South Asia and the Middle East. We are utilizing AI/ML technologies to improve decision making, transition CENTCOM to a new cloud environment, and enhance the efficiency and effectiveness of its networks. GDIT is also leveraging its zero trust capabilities to bolster CENTCOM’s cyber defenses and protect against future cyber threats.\nIn the federal civilian market, GDIT is operating and modernizing the Healthcare Integrated General Ledger Accounting System (HIGLAS) for the Centers for Medicare and Medicaid Services (CMS). HIGLAS is a single, integrated accounting system that standardizes and centralizes federal financial accounting for all of CMS’s programs. The HIGLAS system processes approximately 4.5 million Medicare claims daily and over $1.6 trillion in annual payments. In modernizing the HIGLAS system, GDIT will leverage its AI/ML capabilities to analyze trends and patterns to determine potential anomalies in the data and detect fraud, waste and abuse.\nUnder the User Facing and Data Center Services (UDS) contract for the National Geospatial-Intelligence Agency (NGA), GDIT is providing hybrid cloud services, and innovative IT design, engineering, implementation and operations support services. We are supporting NGA in the development of their new headquarters in St. Louis, Missouri, and are committed to supporting the St. Louis area as a strategic hub for the geospatial intelligence community through our innovation center, community partnerships and talent pipeline programs. As an example, in our DeepSky lab, teams can test new capabilities and collaborate with technology and industry partners to prototype new solutions.\nMission Systems develops and manufactures high-assurance encryption products that are widely deployed to protect national security systems, data and networks against persistent threats. These Type 1 National Security Agency (NSA)-certified products and capabilities provide needed protection for classified voice, video and data in-transit or at-rest in all domains. Capabilities range from enterprise systems to embedded applications required for terrestrial, airborne or space environments. \nWe are working with our U.S. Army customer to adapt elements of advanced resilient radio frequency (RF) to address battlefield realities such as jamming, spoofing, cyberattacks and lack of ground connectivity. Given our deep product innovation experience, we were recently selected to build the Next Generation Survival radio for the U.S. Joint Forces. For the Canadian Army, we provide the Land Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) system.\n13\nMission Systems continues to help advance our nation’s position in the space domain. The U.S. Space Development Agency (SDA) selected Mission Systems to establish the ground operations and integration segment for Tranche 1 and 2 of the National Defense Space Architecture by building ground entry points and operations centers, as well as providing network operations and systems integration services for the SDA’s next tranche of proliferated low-Earth orbit satellites. In addition, we provide critical subsystems for data processing and security of space assets across multiple space vehicle platforms.\nIn the maritime domain, we have a more than 60-year legacy of providing critical systems to the Navy’s submarine programs. These include advanced fire-control and weapon launch systems, tactical control systems, specialized hardware and software solutions for acoustics, cybersecurity, and torpedo guidance, and other core capabilities that are essential for submarine modernization with U.S. and allied forces.\nMission Systems also continues to invest in autonomous capabilities both undersea and in the air. Our Unmanned Undersea Vehicle (UUV) Manufacturing and Assembly Center of Excellence provides manufacturing, assembly, integration and testing capabilities for Mission Systems’ Bluefin Robotics UUVs, as well as the Hammerhead and MEDUSA programs for the Navy. In addition, we support a variety of manned aircraft and unmanned aerial vehicle (UAV) platforms with mission-critical processing and security subsystems on both modern combat and ISR aircraft as well as emerging capabilities like the Collaborative Combat Aircraft.\nRevenue for the Technologies segment was 27% of our consolidated revenue in 2024, 31% in 2023 and 32% in 2022. Revenue by major products and services was as follows:\nYear Ended December 31\n2024\n2023\n2022\nIT services\n$\n8,761 \n$\n8,459 \n$\n8,195 \nC5ISR solutions\n4,366 \n4,463 \n4,297 \nTotal Technologies\n$\n13,127 \n$\n12,922 \n$\n12,492 \nCUSTOMERS\nIn 2024, 69% of our consolidated revenue was from the U.S. government, 14% was from U.S. commercial customers, 10% was from non-U.S. government customers and the remaining 7% was from non-U.S. commercial customers.\n14\nU.S. GOVERNMENT\nOur primary customer is the DoD. We also contract with other U.S. government customers, including the intelligence community and the Departments of Homeland Security and Health and Human Services. Our revenue from the U.S. government was as follows:\nYear Ended December 31\n2024\n2023\n2022\nDoD\n$\n27,191 \n$\n24,720 \n$\n22,250 \nNon-DoD\n4,810 \n4,711 \n4,808 \nForeign military sales (FMS)*\n1,063 \n896 \n633 \nTotal U.S. government\n$\n33,064 \n$\n30,327 \n$\n27,691 \n% of total revenue\n69 \n%\n72 \n%\n70 \n%\n*\nIn addition to our direct non-U.S. sales, we sell to non-U.S. governments through the FMS program. Under the FMS program, we contract with and are paid by the U.S. government, and the U.S. government assumes the risk of collection from the non-U.S. government customer.\nOur U.S. government revenue is derived from fixed-price, cost-reimbursement and time-and-materials contracts. Our production contracts are primarily fixed-price. Under these contracts, we agree to perform a specific scope of work for a fixed amount. Contracts for research, engineering, repair and maintenance, and other services are typically cost-reimbursement or time-and-materials. Under cost-reimbursement contracts, the customer reimburses contract costs incurred and pays a fixed, incentive or award-based fee. The amount for an incentive or award fee is determined by our ability to achieve targets set in the contract, such as cost, quality, schedule and performance. Under time-and-materials contracts, the customer pays a fixed hourly rate for direct labor and generally reimburses us for the cost of materials.\nOf our U.S. government revenue, fixed-price contracts accounted for 51% in 2024, 53% in 2023 and 56% in 2022; cost-reimbursement contracts accounted for 43% in 2024, 41% in 2023 and 38% in 2022; and time-and-materials contracts accounted for 6% in 2024, 2023 and 2022.\nFor information on the advantages and disadvantages of each of these contract types, see Note B to the Consolidated Financial Statements in Item 8. \nU.S. COMMERCIAL\nOur U.S. commercial revenue was $6.7 billion in 2024, $5.8 billion in 2023 and $5.7 billion in 2022, which represented 14%, 14% and 15% of our consolidated revenue in each of the respective years. The majority of this revenue was for business jet aircraft and related services where our customer base consists of individuals and public and privately held companies across a wide range of industries. \nNON-U.S.\nOur revenue from non-U.S. government and commercial customers was $8 billion in 2024, $6.1 billion in 2023 and $6 billion in 2022, which represented 17% of our consolidated revenue in 2024, 14% in 2023 and 15% in 2022.\nWe conduct business with customers around the world. Our non-U.S. defense subsidiaries maintain long-term relationships with their customers and have established themselves as principal regional suppliers and employers, providing a broad portfolio of products and services.\nOur non-U.S. commercial revenue consists primarily of business jet aircraft exports and worldwide aircraft services. While the installed base of aircraft is concentrated in North America, orders from \n15\ncustomers outside North America represent a significant portion of our aircraft business with approximately 43% of the Aerospace segment’s aircraft backlog on December 31, 2024.\nCOMPETITION\nSeveral factors determine our ability to compete successfully in the defense and business aviation markets. While customers’ evaluation criteria vary, the principal competitive elements include:\n•\nthe technical excellence, reliability, safety and cost competitiveness of our products and services;\n•\nour ability to innovate and develop new products and technologies that improve mission performance and adapt to dynamic threats;\n•\nsuccessful program execution and on-time delivery of complex, integrated systems;\n•\nour global footprint and accessibility to customers;\n•\nthe reputation and customer confidence derived from past performance; and\n•\nthe successful management of customer relationships.\nDEFENSE MARKET COMPETITION\nThe U.S. government contracts with numerous domestic and non-U.S. companies for products and services. We compete against other contractors as well as smaller companies that specialize in a particular technology or capability. Outside the United States, we compete with global defense contractors’ exports and the offerings of local, private and state-owned defense manufacturers. Our Marine Systems segment has one primary competitor with which it also partners on the Virginia-class submarine program, and to which it subcontracts on the Columbia-class submarine program. For commercial and repair work, the Marine Systems segment competes with several additional U.S. shipyards. Our Combat Systems segment competes with a large number of U.S. and non-U.S. businesses. Our Technologies segment competes with many companies, from large government contracting and commercial technology companies to small niche competitors with specialized technologies or expertise. The operating cycle of many of our major programs can result in sustained periods of program continuity when we perform successfully.\nWe are involved in teaming and subcontracting relationships with some of our competitors. Competitions for major defense and other government contracting programs often require companies to form teams to bring together a spectrum of capabilities to meet the customer’s requirements. Opportunities associated with these programs include roles as the program’s integrator, overseeing and coordinating the efforts of all participants on a team, or as a provider of a specific component or subsystem.\nBUSINESS JET AIRCRAFT MARKET COMPETITION\nThe Aerospace segment has several competitors for each of its Gulfstream products. Key competitive factors include aircraft safety, reliability and performance; comfort and in-flight productivity; service quality, global footprint and responsiveness; technological and new-product innovation; and price. We believe that Gulfstream competes effectively in all of these areas.\nThe Aerospace segment competes worldwide in the business jet aircraft services market primarily on the basis of quality, price and timeliness. While competition for each type of service varies somewhat, the segment faces a number of competitors of varying sizes for each of its offerings. \n16\nINTELLECTUAL PROPERTY\nWe develop technology, manufacturing processes and systems-integration practices. In addition to owning a large portfolio of proprietary intellectual property, we license some intellectual property rights to and from others. The U.S. government holds licenses to many of our patents developed in the performance of U.S. government contracts, and it may use or authorize others to use the inventions covered by these patents. Although these intellectual property rights are important to the operation of our business, no existing patent, license or other intellectual property right is of such importance that its loss or termination would have a material impact on our business.\nHUMAN CAPITAL MANAGEMENT\nOur company is a global community of approximately 117,000 employees dedicated to our Ethos of transparency, trust, honesty and alignment. These four core values drive how we operate our business; govern how we interact with each other, our customers, partners and suppliers; guide the way that we treat our workforce; and determine how we connect with our communities. Our commitment to ethical business practices is outlined in our \nStandards of Business Ethics and Conduct\n, which states our expectation that all employees conduct business in accordance with our Ethos, applicable laws and our policies. Each employee is asked to acknowledge receipt, understanding of and compliance with our standards.\nDue to the highly specialized nature of our business, we must hire and train skilled and qualified people to design and build the products and perform the services required by our customers. This includes upskilling employees to advance within the workplace. The health, welfare and safety of our employees is paramount throughout our workplaces. This effort starts with treating all employees with dignity and respect and providing them with fair, market-based, competitive and equitable compensation. We recognize and reward the performance of our employees in line with our pay-for-performance philosophy and provide a comprehensive suite of benefit options that aim to enable our employees and their dependents to live healthy and productive lives.\nAcross our businesses, we take measures to prevent workplace hazards, encourage healthy and safe behaviors and enforce a culture of continuous improvement to ensure that our processes help reduce safety incidents and illnesses and comply with applicable health and safety laws.\nWe recognize that our success as a company depends on our ability to attract, develop and retain qualified people. Our commitment to promoting diversity of thought, experience, perspectives, backgrounds and capabilities to drive innovation strengthens the solutions we deliver to our customers. General Dynamics works hard to promote an environment that values and supports all employees. We proudly support a work environment that respects diverse opinions, values individual skills, celebrates unique experiences and cultivates teamwork. These efforts are a demonstration of our dedication to equal employment opportunities that foster and support a principled, productive and inclusive work environment. We stand for basic universal human rights, including that employment must be voluntary. We track, measure and analyze our workforce trends to establish accountability for putting people first across our businesses and at every level of our company.\nOur values motivate us to promote strong workplace practices with opportunities for development and training. Our training and development efforts focus on ensuring that our people are appropriately trained on critical job skills as well as on leadership behaviors that are consistent with our Ethos. We conduct rigorous succession planning exercises to ensure that key positions have the appropriate level of \n17\nbench strength to provide for future key positions and leadership transitions. We listen to our people to assess areas of concern and levels of engagement.\n2024 WORKFORCE STATISTICS\n•\nApproximately 84% of our employees are based in the United States, of which roughly 69% are white, 31% are people of color, 19% are veterans of the U.S. armed forces and 8% have self-reported having a disability. The remaining 16% of our workforce is based internationally in over 65 countries with the primary concentrations being in North America and Europe. Approximately 21% of our workforce is represented by collective bargaining agreements.\n•\nOur global workforce is 76% male and 24% female, and our senior leadership teams across the business are represented by 75% males and 25% females. During 2024, we hired more than 23,800 individuals of which 74% were male and 26% were female. For our approximately 19,400 U.S.-based hires in 2024, 58% were white and 42% were people of color.\nRAW MATERIALS AND SUPPLIERS\nWe depend on suppliers and subcontractors for raw materials, components and subsystems. Our U.S. government customer is a supplier for some of our programs. These supply networks can experience price fluctuations and capacity constraints, which can put pressure on our costs. Effective management and oversight of suppliers and subcontractors is an important element of our successful performance. If our sources of supply are disrupted, particularly in instances where we rely on only one or two sources of supply, or in the event that international conflicts result in the disruption of manufacturing or trade relations for some supply components, our ability to meet our customer commitments could be adversely impacted. We attempt to mitigate risks with our suppliers by entering into long-term agreements and leveraging company-wide agreements to achieve economies of scale and by negotiating flexible pricing terms in our customer contracts.\nREGULATORY MATTERS\nU.S. GOVERNMENT CONTRACTS\nU.S. government contracts are subject to procurement laws and regulations. The Federal Acquisition Regulation (FAR) and the Cost Accounting Standards (CAS) govern the majority of our contracts. The FAR mandates uniform policies and procedures for U.S. government acquisitions and purchased services. Also, individual agencies can have acquisition regulations that provide implementing language for the FAR or that supplement the FAR. For example, the DoD implements the FAR through the Defense Federal Acquisition Regulation Supplement (DFARS). For all federal government entities, the FAR regulates the phases of any product or service acquisition, including:\n•\nacquisition planning;\n•\ncompetition requirements;\n•\ncontractor qualifications;\n•\nprotection of source selection and supplier information; and\n•\nacquisition procedures.\nIn addition, the FAR addresses the allowability of our costs, while the CAS addresses the allocation of those costs to contracts. The FAR and CAS subject us to audits and other government reviews \n18\ncovering issues such as cost, performance, internal controls and accounting practices relating to our contracts.\nNON-U.S. REGULATORY\nOur non-U.S. operations are subject to the applicable government regulations and procurement policies and practices, as well as U.S. policies and regulations. We are also subject to regulations governing investments, exchange controls, repatriation of earnings and import-export control.\nBUSINESS JET AIRCRAFT\nThe Aerospace segment is subject to FAA regulation in the United States and other similar aviation regulatory authorities internationally, including the Civil Aviation Administration of Israel (CAAI), the European Aviation Safety Agency (EASA) and the Civil Aviation Administration of China (CAAC). For an aircraft to be manufactured and sold, the model must receive a type certificate from the appropriate aviation authority, and each aircraft must receive a certificate of airworthiness. Aircraft outfitting and completions also require approval by the appropriate aviation authority, which is often accomplished through a supplemental type certificate. Aviation authorities can require changes to a specific aircraft or model type before granting approval. Maintenance facilities and charter operations must be licensed by aviation authorities as well.\nENVIRONMENTAL\nWe are subject to a variety of federal, state, local and foreign environmental laws and regulations. These laws and regulations cover the discharge, treatment, storage, disposal, investigation and remediation of materials, substances and wastes identified in the laws and regulations. We are directly or indirectly involved in environmental investigations or remediation at some of our current and former facilities and at third-party sites that we do not own but where we have been designated a potentially responsible party (PRP) by the U.S. Environmental Protection Agency or a state environmental agency. As a PRP, we are potentially liable to the government or third parties for the cost of remediating contamination. In cases where we have been designated a PRP, we generally seek to mitigate these environmental liabilities through available insurance coverage and by pursuing appropriate cost-recovery actions. In the unlikely event that we are required to fully fund the remediation of a site, the current statutory framework would allow us to pursue contributions from other PRPs. We regularly assess our compliance status and management of environmental matters.\nOperating and maintenance costs associated with environmental compliance and management of contaminated sites are a normal, recurring part of our operations. Historically, these costs have not been material. In addition, we could be affected by future laws or regulations imposed in response to concerns over climate change, the timing and effect of which are difficult to assess.\nChanges in environmental and climate change laws or regulations, including laws relating to greenhouse gas emissions, could lead to new or additional investment in product designs or facilities and could increase environmental compliance expenditures, including increased energy and raw materials costs. Environmental costs are often recoverable under our contracts with the U.S. government. Based on information currently available and current U.S. government policies relating to cost recovery, we do not expect continued compliance with environmental regulations, including costs associated with changes in environmental and climate change laws or regulations, to have a material impact on our results of operations, financial condition or cash flows. For additional information relating to the impact of environmental matters, see Note M to the Consolidated Financial Statements in Item 8.\n19\nAVAILABLE INFORMATION\nWe file reports and other information with the Securities and Exchange Commission (SEC) pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended (the Exchange Act). These reports and information include annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and proxy statements. Free copies of these items, and any amendments to those items filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act, are made available on our website (gd.com) as soon as practicable after we electronically file such items with, or furnish them to, the SEC. The SEC maintains a website (sec.gov) that contains reports, proxy and information statements, and other information.\nIn addition to the information contained in this Form 10-K, information about the company can be found on our website and our Investor Relations website (investorrelations.gd.com). Our Investor Relations website contains a significant amount of information about the company, including financial information, our corporate governance principles and practices, and other information for investors. We encourage investors to visit our website, as we frequently update and post new information about our company, and it is possible that this information could be deemed material information.\nReferences to our website and the SEC’s website in this Form 10-K do not constitute, and should not be viewed as, incorporation by reference of the information contained on, or available through, the websites. The information should not be considered a part of this Form 10-K, unless otherwise expressly incorporated by reference.",
    "item1a": "Item 1A—Risk Factors above for additional discussion of various risks related to cybersecurity that are reasonably likely to have a material impact on our company, including our business strategy, results of operations or financial condition.\n26",
    "item1b": "ITEM 1B.\n UNRESOLVED STAFF COMMENTS\nNone.",
    "item1c": "ITEM 1C.\n \nCYBERSECURITY\nWe face various cybersecurity threats. \nThe purpose of our cybersecurity program is to assess, identify, manage and mitigate cybersecurity risk while supporting the achievement of our business objectives.\nUnder our comprehensive risk management program, the board of directors (Board) of the company maintains oversight of the most significant risks facing the company, including cybersecurity risks, while senior management is responsible for the identification and prioritization of risks that are material to our business, corresponding risk-mitigation efforts and day-to-day management of our risk management program. The full Board retains oversight over management’s cybersecurity efforts. \nAt least annually, and often more frequently, the Board receives cybersecurity briefings from \nsenior executives\n, including, when appropriate, executives focused on cybersecurity matters.\n \nOur companywide cybersecurity policy sets the framework for our approach to cybersecurity. \nEach business unit and our corporate headquarters designates individuals with appropriate qualifications and experience to be responsible for addressing cybersecurity matters, including assessing, identifying and managing risks from cybersecurity threats, with a direct reporting line to senior management.\n Under our approach to cybersecurity, each business unit designs and operates its own information and cybersecurity program tailored to its market, customer requirements, regulatory requirements and threats. Our cybersecurity policy and procedures are designed to ensure senior management receives timely and adequate information regarding cybersecurity matters, including threats and incident response, as appropriate to the matter. \nOur policies and procedures are also designed to oversee and identify material cybersecurity risks related to third-party vendors and service providers.\nOur companywide \nCyber Council\n, comprised of information technology and cybersecurity executives from our business units, shares information and cybersecurity practices throughout the company, recommends policy and procedure updates and tracks emerging trends. The chair of the Cyber Council reports directly to the company’s chief executive officer.\nAs part of our approach to cyber risk management, we regularly perform internal audits of internal processes and controls relating to cybersecurity.\n From time to time, as appropriate under our overall cybersecurity program, we engage \nthird-party\n experts to support the assessment of cyber related risks, including to conduct cyber penetration testing.\nSee"
  }
}