{
  "ticker": "GE",
  "cik": "0000040545",
  "company_name": "GENERAL ELECTRIC CO",
  "filing_date": "2025-02-03",
  "accession": "0000040545-25-000015",
  "primary_doc": "ge-20241231.htm",
  "item_sections": {
    "item1": "FORWARD-LOOKING STATEMENTS. Our public communications and filings we make with the U.S. Securities and Exchange Commission (SEC) may contain statements related to future, not past, events. These forward-looking statements often address our expected future business and financial performance and financial condition, and often contain words such as \"expect,\" \"anticipate,\" \"intend,\" \"plan,\" \"believe,\" \"seek,\" \"see,\" \"will,\" \"would,\" \"estimate,\" \"forecast,\" \"target,\" \"preliminary\" or \"range.\" Forward-looking statements by their nature address matters that are, to different degrees, uncertain, such as statements about the impacts of macroeconomic and market conditions and volatility on our business operations, financial results and financial position; conditions affecting the aerospace and defense industry, including our customers and suppliers; our expected financial performance, including cash flows, revenue, margins, earnings and earnings per share; planned and potential transactions; our credit ratings and outlooks; our funding and liquidity; our cost structures and plans to reduce costs; restructuring, impairment or other financial charges; or tax rates.\n\nFor us, particular areas where risks or uncertainties could cause our actual results to be materially different than those expressed in our forward-looking statements include:\n\n•changes in macroeconomic and market conditions and market volatility (including risks related to recession, inflation, supply chain constraints or disruptions, interest rates, values of financial assets, oil, jet fuel and other commodity prices and exchange rates), and the impact of such changes and volatility on our business operations and financial results;\n•global economic trends, competition and geopolitical risks, including impacts from the ongoing conflict between Russia and Ukraine and related sanctions and risks related to conflict in the Middle East; demand or supply shocks from events such as a major terrorist attack, war, natural disasters or actual or threatened public health pandemics or other emergencies; or an escalation of sanctions, tariffs or other trade tensions between the U.S. and China or other countries;\n•market or other developments that may affect demand or the financial strength and performance of airframers, airlines, suppliers and other key aerospace and defense industry participants, such as demand for air travel, supply chain or other production constraints, shifts in U.S. or foreign government defense programs and other industry dynamics;\n•pricing, cost, volume and the timing of sales, investment and production by us and our customers, suppliers or other industry participants;\n•the impact of actual or potential safety or quality issues or failures of our products or third-party products with which our products are integrated, including design, production, performance, durability or other issues, and related costs and reputational effects;\n•operational execution on our business plans, including our performance amidst market growth and ramping newer product platforms, meeting delivery and other contractual obligations, improving turnaround times in our services businesses and reducing costs over time;\n•the amount and timing of our earnings and cash flows, which may be impacted by macroeconomic, customer, supplier, competitive, contractual, financial or accounting (including changes in estimates) and other dynamics and conditions;\n•our capital allocation plans, including the timing and amount of dividends, share repurchases, acquisitions, organic investments and other priorities;\n•our decisions about investments in research and development or new products, services and platforms, and our ability to launch new products in a cost-effective manner, as well as technology developments and other dynamics that could shift the demand or competitive landscape for our products and services;\n•our success in executing planned and potential transactions, including the timing for such transactions, the ability to satisfy any applicable pre-conditions and the expected benefits;\n•downgrades of our credit ratings or ratings outlooks, or changes in rating application or methodology, and the related impact on our funding profile, costs, liquidity and competitive position;\n•capital or liquidity needs associated with our run-off insurance operations or mortgage portfolio in Poland (Bank BPH), the amount and timing of any required future capital contributions and any strategic options that we may consider;\n•changes in law, regulation or policy that may affect our businesses, such as trade policy and tariffs; government defense priorities or budgets; regulation, incentives and emissions offsetting or trading regimes related to climate change; and the effects of tax law changes;\n•the impact of regulation; government investigations; regulatory, commercial and legal proceedings or disputes; environmental, health and safety matters; or other legal compliance risks, including the impact of shareholder and related lawsuits, Bank BPH and other proceedings that are described in our SEC filings;\n•the impact related to information technology, cybersecurity or data security breaches at GE Aerospace or third parties; and\n•the other factors that are described in the \"Risk Factors\" section in this Annual Report on Form 10-K for the year ended December 31, 2024, as such descriptions may be updated or amended in future reports we file with the SEC.\n\nThese or other uncertainties may cause our actual future results to be materially different than those expressed in our forward-looking statements. We do not undertake to update our forward-looking statements. This document includes certain forward-looking projected financial information that is based on current estimates and forecasts. Actual results could differ materially.\n\n\n2024 FORM 10-K 3\n\nABOUT GE AEROSPACE. General Electric Company operates as GE Aerospace (GE Aerospace or the Company). GE Aerospace is a global aerospace leader with the industry's largest and growing commercial propulsion fleet. The Company’s installed base of approximately 45,000 commercial and 25,000 military engines drives our aftermarket services business, which represents approximately 70% of revenue, reflecting the strength of customer demand across our business. Through FLIGHT DECK, the Company's proprietary lean operating model, GE Aerospace is prioritizing safety, quality, delivery and cost, to drive focused execution and bridge strategy to results. We are focused on delivering against our strategic priorities for today (services and readiness), tomorrow (delivering the production and services ramp for new engines) and the future (inventing next generation flight technology for our commercial and defense customers). Our global team is building on more than a century of innovation and learning, as we invent the future of flight, lift people up and bring them home safely.\n\nOn January 3, 2023, the Company completed the separation of its healthcare business into an independent publicly traded company, GE HealthCare Technologies Inc. (GE HealthCare), and on April 2, 2024, the Company completed the separation of its GE Vernova business into an independent publicly traded company, GE Vernova, Inc. (GE Vernova). In connection with these separations, the historical results of GE HealthCare and GE Vernova, and certain assets and liabilities included in the separations, are reported in our consolidated financial statements as discontinued operations. See Note 2 for further information.\n\nWe serve customers in approximately 120 countries. Manufacturing and service operations are carried out at 67 facilities located in 22 states in the United States and Puerto Rico, of which 24 are owned, and at 67 facilities located in 24 other countries, of which 34 are owned.\n\nSEGMENTS. GE Aerospace operates through two reportable segments: Commercial Engines & Services and Defense & Propulsion Technologies.\n\nCOMMERCIAL ENGINES & SERVICES. Commercial Engines & Services (CES) designs, develops, manufactures and services jet engines for commercial airframes, as well as business aviation and aeroderivative applications. Services include maintenance, repair and overhaul (MRO) of engines and the sale of spare parts, and we offer services under a variety of arrangements such as long-term service agreements or time and material contracts. CES was approximately 70% of total revenue for the year ended December 31, 2024, with services representing 74% of total CES revenue.\n\nOur CES customers for equipment and services consist primarily of airframers and airlines, including both Boeing and Airbus, and third-party MRO shops, to whom we sell equipment and license MRO technology. CES engines power aircraft in all commercial categories—narrowbody, widebody and regional—and this includes engines sold by joint venture partners, the most significant of which is CFM International, a 50-50 non-consolidated joint venture with Safran Aircraft Engines, a subsidiary of Safran Group of France. Depending on the aircraft model, airline customers may have a choice between our engines and those of other manufacturers or, as in the case of some Boeing models, our engines may be the sole source engine for a particular aircraft.\n\nCommercial and financial dynamics for major engine platforms often play out over the course of many years, as new product development cycles are long and, after initial sale, commercial engines can operate for decades with services in the aftermarket. In the narrowbody aircraft segment, we are in the midst of a significant ramp in production of the LEAP engine, which entered into service in 2016 and is expected in the coming years to overtake the mature CFM56 as the industry’s most utilized narrowbody engine. This is expected to also drive a significant increase in shop visits and need for MRO capacity as LEAP engines come due for services. In the widebody aircraft segment, we have a range of engine platforms that are in different stages of their lifecycles. These include the more mature CF6 and GE90 engines, as well as the GEnx engine that entered into service in 2011 and the GE9X engine that will power the Boeing 777X when that aircraft enters into service. We also have engines that power regional and business aircraft.\n\nWe have been and remain committed to investing in developing and maturing technologies that enable a more sustainable future of flight. Notably, CFM International's Revolutionary Innovation for Sustainable Engines (RISE) program is a suite of pioneering technologies including Open Fan, compact core and hybrid electric systems for compatibility with alternative fuels. We recently completed more than 250 tests on developing a full-scale Open Fan engine. This is one of several initiatives underway to help invent the future of flight.\n\nDEFENSE & PROPULSION TECHNOLOGIES. Defense & Propulsion Technologies (DPT) is a leading provider of defense engines and critical aircraft systems, and it consists of our Defense & Systems and Propulsion & Additive Technologies businesses. DPT was approximately 25% of total revenue for the year ended December 31, 2024, with services representing 56% of total DPT revenue.\n\nDefense & Systems – Defense & Systems designs, develops, manufactures and services jet engines and avionics and power systems for governments, militaries and commercial airframers. Services include MRO of engines and the sale of spare parts.\n\nOur product performance and dedication to innovation have earned long-standing relationships with airframers, shipyards, government agencies and other customers globally. We also regularly work with government customers on the development of classified and unclassified advanced products, including combat engines, hypersonics and unmanned applications. Recently, our team successfully demonstrated a hybrid electric propulsion system rated at one megawatt with the U.S. Army.\nOur defense engines power a wide variety of fighters, bombers, tankers, transport, helicopters and surveillance aircraft, as well as aeroderivative engines for marine applications. Significant product platforms include the F110, F404 and F414 for combat engines, the T408, T700 and T901 for rotorcraft engines and the LM2500 for mobility and marine engines.\n4 2024 FORM 10-K\n\nPropulsion & Additive Technologies – Propulsion & Additive Technologies (P&AT) businesses primarily design, develop, manufacture and support aircraft components and systems for both commercial and military end users under the Avio Aero, Unison, Dowty Propellers and Colibrium Additive brands. These P&AT products include small turboprop engines, aeroengine mechanical transmissions, turbines, combustors and controls, additive manufacturing, propeller systems, ignition systems, sensors and engine accessories for both fixed wing and rotorcraft applications. Avio Aero is a strategic partner in Europe supporting the development of indigenous, classified engine technology and a core member of Clean Aviation, significantly contributing to and benefiting from the European Union sustainability roadmap.\n\nHUMAN CAPITAL. The strength and talent of our workforce are critical to the success of our purpose to invent the future of flight, lift people up and bring them home safely. We strive to attract, develop and retain a workforce that can deliver for our global customer base. The Company’s human capital management priorities are aligned to our business strategy and support the execution of operational results, financial results and the development of technologies that we believe will define the future of the aerospace and defense industry. We continue to monitor a broad set of human capital priorities as a part of our business operating reviews and with oversight by our Board of Directors and the Board’s Management Development and Compensation Committee. The following are our human capital priorities:\n\n•Protecting the health and safety of our workforce: We encourage all employees at every level of the organization to take responsibility for creating a safe and healthy work environment, including the importance of speaking up when a safety concern arises. We have robust procedures and standards that our employees and contractors must follow when performing high risk activities that are designed to prevent potential accidents and injuries. We have established stringent environmental, health and safety standards, often more rigorous than local regulations. For the past four years, our annual bonus program has included a modifier based on the Company’s safety performance.\n•Sustaining a Company culture based in Respect for People through leadership behaviors of humility, transparency and focus, with a commitment to unyielding integrity: This culture is an essential part of GE Aerospace’s proprietary lean operating model, FLIGHT DECK. It is through FLIGHT DECK that we are bridging strategy to deliver results for our customers and our shareholders. GE Aerospace’s organizational culture supports talent attraction, engagement and retention and promotes ways of working that are strongly connected to our goals. In 2024, GE Aerospace conducted its first annual enterprise-wide culture survey as an independent company. This survey is part of a commitment to have a strong employee listening strategy. Results showed that overall our employees feel their safety is prioritized and that the Company maintains high ethical standards. Our performance management system, “People, Performance, and Growth,” directly links individual performance outcomes to incentive compensation. Supporting our culture of integrity, The Spirit & The Letter, GE Aerospace’s employee code of conduct, sets forth the Company’s integrity and compliance standards.\n•Developing and managing our talent to best support our organizational goals: GE Aerospace’s approach to talent management aims to ensure strong individual and company performance, and our employee training and development offerings are designed to support these goals. As a key pillar of our talent strategy, GE Aerospace’s senior management leads an annual organization and talent review for each business to support a strong leadership pipeline and succession planning process. In 2024, our leadership development programs continued to elevate high potential talent and accelerate a continued career path with GE Aerospace.\n•Promoting fairness and opportunity across the enterprise: At GE Aerospace, we are committed to building a culture and environment where every employee has the opportunity to achieve their ultimate potential. Fostering an environment centered on Respect for People is core to FLIGHT DECK and is intended to ensure that every employee feels empowered and has the opportunity to contribute to improve our performance. Our long-standing commitment to pay practices that are fair and competitive is core to Respect for People and is reflected in the fact that men and women performing similar work were paid within 1% of each other in our most recent analysis.\n\nAt December 31, 2024, GE Aerospace and consolidated affiliates employed approximately 53,000 people, of whom approximately 28,000 were employed in the United States.\n\nAt December 31, 2024, GE Aerospace had approximately 3,700 union-represented manufacturing and service employees in the United States. In 2023, the Company negotiated or extended collective bargaining agreements with the majority of its U.S. unions (including the IUE-CWA, UAW and IAM), and these agreements are scheduled to expire between June and August of 2025. GE Aerospace will hold negotiations to enter into new agreements prior to their respective expiration dates. While the outcome of the 2025 negotiations cannot be predicted, the Company’s recent past negotiations have resulted in agreements that we believe provide employees with fair wages and benefits while addressing the competitive realities facing GE Aerospace, and were completed without a work stoppage. GE Aerospace’s relationship with employee-representative organizations outside the U.S. takes many forms, including in Europe where GE Aerospace engages employees’ representatives’ bodies such as works councils (at both European level and locally) and trade unions in accordance with local law.\n\n\n2024 FORM 10-K 5\n\nRESEARCH AND DEVELOPMENT. We have long research and development (R&D) cycles for many of our products, with product safety, quality and efficiency being critical to success. We conduct R&D activities, leveraging FLIGHT DECK, to enhance our existing products and services, develop new products and services to meet our customers’ changing needs and requirements, address new market opportunities and support regulatory certifications. For example, our past and ongoing investments in advanced technologies such as ceramic matrix composites and additive manufacturing for components have applications across a range of narrowbody and widebody engine applications. In addition, we are making significant investments in the RISE program suite of technologies to enable a more sustainable future of flight. And in DPT, leveraging government funding, our investments include the development of advanced propulsion solutions such as adaptive cycle combat engines.INTELLECTUAL PROPERTY. The development and protection of intellectual property rights are a source of competitive advantage within our industry, and protection of key design, manufacturing, repair and product upgrade technologies is important to our business. We maintain, continue to grow, and curate a portfolio of patents, trade secrets and other intellectual property rights stemming from our research and development activities. In some circumstances we license intellectual property to commercial customers, such as to support the maintenance and repair of our products to keep them in safe and airworthy condition. Government customers may also have licenses to some of our intellectual property that is developed or used in the performance of government contracts. While our intellectual property rights in the aggregate are important to our business, we do not believe that our business is materially dependent on the preservation of any singular intellectual property right or patent license. The “GE” name and logo are licensed to various former businesses, including GE HealthCare and GE Vernova, pursuant to agreements governing their use.\n\nSUPPLY CHAIN. We rely on a global supply chain for a wide range of raw materials, commodities, components, parts, MRO services and other indirect spend. Our supply chain is complex and extends into many different countries and regions around the world. We depend on the ability of our suppliers and partners to meet quality standards, performance specifications and delivery schedules at our anticipated costs. In some cases, we also must comply with specific procurement requirements that limit the suppliers and subcontractors we may utilize. Some of our suppliers or their sub-suppliers are limited- or sole-source suppliers, and our ability to meet our obligations to customers depends on the product quality, performance, continued product availability and stability of such suppliers. We employ a number of strategies focused on continuity of supply of raw materials, including monitoring geopolitical and geographical changes and developing counteractions in response to identified risks, evaluating alternate materials and sources and working with suppliers to secure both short- and long-term capacity. Partnering with suppliers, leveraging FLIGHT DECK, we are working to improve material input, supporting our deliveries across internal shop visits, spare part sales and equipment. We operate in a supply-constrained environment that has impacted our industry for the past several years. See the MD&A section for additional discussion of these dynamics.\n\nCOMPETITION. The markets in which we operate are highly competitive in terms of pricing, product and service quality, durability and reliability, product development and introduction time, intellectual property, customer service, financing terms, the ability to respond to shifts in market demand and the ability to attract and retain skilled talent. We compete with other global engine manufacturers in sales of commercial and defense engines and services. Key competitors in commercial engine services also include third-party MRO shops. In DPT, we compete against a range of U.S. and non-U.S. companies or groups for contract and subcontract awards by governments and their prime contractors. Customer selections for aircraft engines, components and systems can also have a significant impact on future sales of parts and services over the life of an engine platform. Competitors may offer substantial discounts and other financial incentives, performance and operating cost guarantees and participation in financing arrangements in an effort to secure an installed base that establishes aftermarket sales associated with these products.\n\nREGULATORY MATTERS. As an aerospace and defense company, we are subject to a wide range of U.S. federal, state and non-U.S. laws and regulations related to our products, services and business operations, including the significant areas of law and regulation summarized below that can apply to our business directly and indirectly. Like other industrial manufacturing companies that operate globally in high-tech sectors, we face significant scrutiny from both U.S. and foreign governmental authorities with respect to regulatory compliance. We regularly engage with our regulators and work to comply with existing, new and changing requirements across relevant jurisdictions, as compliance (or failure to properly comply) with any of these requirements can pose costs and impact our operations. For additional information about government regulation applicable to our business, see Risk Factors and Note 24.\n\n\n6 2024 FORM 10-K\n\nCommercial aviation. The design and production of our commercial aircraft engines are regulated by the U.S. Federal Aviation Administration (FAA) and the European Aviation Safety Agency (EASA). To obtain and maintain design approvals for commercial engines, called type certificates, we must meet stringent certification requirements and maintain ongoing responsibility for the continued operational safety and airworthiness of our engines. We also hold an FAA authorization to produce commercial engines, called a production certificate, pursuant to which engines that we produce must meet the approved type design. GE Aerospace also operates commercial engine MRO facilities around the world, and each of these facilities holds repair station certificates from multiple aviation regulators, depending upon the regulatory jurisdictions of our airline customers that use the facility. All of our certified operations are subject to regulatory oversight, and violations may result in government enforcement action that can include fines, suspension of privileges under the certificates or revocation of the certificates. In addition, global aviation authorities regulate aviation safety and have the authority to mandate that our customers take required actions, such as required inspection, maintenance, modification or removal of our products or their components. These regulators also have the authority to order the grounding of entire fleets of aircraft in the interests of aviation safety.\n\nInternational Trade Controls and Sanctions Compliance. We are subject to various international trade controls and sanctions regulations from governments and regulatory bodies around the world. These include export controls (including the U.S. Export Administration Regulations (EAR) and the International Traffic in Arms Regulations (ITAR)), import controls, sanctions compliance (including sanctions administered by the U.S. Department of the Treasury's Office of Foreign Assets Control (OFAC)) and anti-boycott regulations. These regulations are intended to align business practices with national security and foreign policy objectives. Our international trade controls and sanctions compliance program includes employee training, screening and due diligence reviews of customers, suppliers and business partners and other controls and procedures designed to operate in compliance with these complex requirements.\n\nGovernment Contracts. The U.S. government and our other government customers often have the ability to modify, curtail or terminate their contracts and subcontracts with us either at their convenience or for default based on performance. In the event of termination for convenience, we typically would be entitled to payment for work completed and allowable termination or cancellation costs. In the event of termination for default, typically the government customer would pay only for the work that has been accepted and could require us to pay the net cost to re-procure the contract items, in addition to seeking damages. Our U.S. government contracts are subject to the Federal Acquisition Regulation (FAR), as well as department-specific implementing regulations such as the U.S. Department of Defense’s Defense Federal Acquisition Regulation Supplement (DFARS) and other applicable laws and regulations, which set forth policies, procedures and requirements for the acquisition of goods and services by the U.S. government. These regulations impose a broad range of requirements, many of which are unique to government contracting, including various procurement, import and export, security, contract pricing and cost, contract termination and adjustment, audit, product integrity and government accounting requirements. Failure to comply with these requirements can result in contract withholds, cost or price reductions, civil and criminal penalties, contract modifications or terminations and loss of eligibility to perform government contracts.\n\nEnvironmental. Our operations are subject to various federal, state, local and non-U.S. laws and regulations relating to environmental protection, including the discharge, treatment, storage, disposal and remediation of hazardous substances and wastes. These laws and regulations require ongoing environmental compliance expenditures and over time can lead to increased energy and raw materials costs and new or additional investment in designs and technologies. We regularly assess our compliance status and management of environmental matters, and the investigation, remediation and operation and maintenance costs associated with environmental compliance and management of sites are a normal, recurring part of our operations. In addition to our ongoing business operations, environmental laws and regulations apply to the legacy portfolio of environmental remediation sites that GE Aerospace retained following the separations of GE Vernova and GE HealthCare. Laws and regulations in response to climate change that relate to emissions from air travel can also have direct or indirect impacts on our business, including from increased costs to airlines that fly aircraft powered by our engines.\n\nLEGACY BUSINESSES. We retain some legacy business operations related to the Company’s long history across many different industries. These include operations related to the Company’s former financial services business, including continued exposure to the run-off insurance operations, the mortgage portfolio in Poland (Bank BPH) and certain U.S. tax equity investments. For further information, see Note 2, Note 12, Note 24, the MD&A section (Insurance) and Risk Factors.\n\nADDITIONAL INFORMATION ABOUT GE AEROSPACE. GE Aerospace’s principal executive offices are at 1 Neumann Way, Evendale, OH 45215; we also maintain executive offices in Washington, DC and Norwalk, CT. GE Aerospace’s Internet address at www.geaerospace.com and Investor Relations website at www.geaerospace.com/investor-relations, as well as GE Aerospace’s LinkedIn and other social media accounts, contain a significant amount of information about GE Aerospace, including financial and other information for investors. GE Aerospace encourages investors to visit these websites as information is updated and new information is posted, as we may use our Investor Relations website and these other channels as means of disclosing material information in compliance with Regulation FD. Additional information on non-financial matters, including our Sustainability Report and other matters related to aviation, safety, environment, people and governance, is available at www.geaerospace.com/sustainability. All of such additional information referenced in this report (including the information contained in, or available through, other reports and websites) is provided as a convenience and is not incorporated by reference herein. Therefore, such information should not be considered part of this report.\n\nOur Annual Report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and amendments to those reports are available, without charge, on our website, www.geaerospace.com/investor-relations/events-reports, as soon as reasonably practicable after they are filed electronically with the SEC. Copies are also available, without charge, from GE Aerospace Investor Relations. Reports filed with the SEC may be viewed at www.sec.gov.\n2024 FORM 10-K 7\n\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (MD&A). The consolidated financial statements of GE Aerospace are prepared in conformity with U.S. generally accepted accounting principles (GAAP). Unless otherwise noted, tables are presented in U.S. dollars in millions. Certain columns and rows within tables may not add due to the use of rounded numbers. Percentages presented in this report are calculated from the underlying numbers in millions. Discussions throughout this MD&A are based on continuing operations unless otherwise noted. The MD&A should be read in conjunction with the Financial Statements and Notes to the consolidated financial statements.\n\nIn the accompanying analysis of financial information, we sometimes use information derived from consolidated financial data but not presented in our financial statements prepared in accordance with GAAP. Certain of these data are considered “non-GAAP financial measures” under SEC rules. See the Non-GAAP Financial Measures section for the reasons we use these non-GAAP financial measures and the reconciliations to their most directly comparable GAAP financial measures.\n\nBUSINESS OVERVIEW AND ENVIRONMENT. As a global aerospace company, our worldwide operations can be affected by industrial, economic, and political factors on both a regional and global level. Demand for our equipment and services is demonstrated by our backlog of engine orders and services and growth in our installed base, and tends to follow commercial air travel and freight demand and government funding for defense budgets. We also expect a significant ramp in our delivery of engine units and services for newer product platforms in the years ahead to meet this demand. Refer to the Segment Operations sections for Commercial Engines & Services and Defense & Propulsion Technologies below for additional detail about these dynamics for our commercial and defense businesses, respectively.\n\nGlobal material availability and supplier delivery performance continue to cause disruptions and have impacted our production and delivery of equipment and services to our customers. We are investing in our manufacturing facilities, overhaul facilities and our supply chain to increase production and strengthen yield in order to improve delivery to our customers. We continue to partner with our suppliers to improve material input, and work with our customers to calibrate future production rates. We are leveraging FLIGHT DECK and partnering with suppliers to improve material input and proactively manage the impact of inflationary pressure by driving cost productivity and adjusting the pricing of our products and services. We expect the impact of supply chain constraints and inflation will continue, and we are continuing to take action to mitigate the impacts.\n\nGiven the significant business we have with airframers and many airlines, challenges affecting the commercial aviation industry or key participants can adversely impact the demand for our products and services, the timing of orders, deliveries and related payments and other factors. We are monitoring the production and other challenges at The Boeing Company, and we continue to align with them on production expectations and assess potential impacts to our business. The Boeing worker's strike, resolved in the fourth quarter of 2024, had no significant impact to our revenue, earnings and cash flows for the year ended December 31, 2024.For the year ended December 31, 2024, total revenue increased $3.4 billion, or 9%, compared to the year ended December 31, 2023. Equipment revenue increased, driven by improved pricing and favorable customer and product mix. Services revenue increased, primarily due to higher spare parts volume, improved pricing and increased internal shop visit workscope.\n\nFor the year ended December 31, 2023, total revenue increased $6.2 billion, or 21%, compared to the year ended December 31, 2022. Equipment revenue increased, driven by higher commercial install and spare engine unit shipments. Services revenue increased, primarily due to increased commercial spare part shipments, higher internal shop visit volume, increased internal shop visit workscope and improved pricing.For the year ended December 31, 2024, continuing earnings decreased $2.5 billion compared to the year ended December 31, 2023, driven by a decrease in gains on retained and sold ownership interests of $5.2 billion, primarily related to our GE HealthCare and AerCap investments, an increase in restructuring and other charges of $0.3 billion and a goodwill impairment loss related to our Colibrium Additive reporting unit of $0.3 billion. These decreases were partially offset by an increase in segment profit of $1.6 billion, an increase in profit from our run-off insurance operations of $0.7 billion, an increase in gains on sales of business interests of $0.5 billion, primarily related to the sale of our non-core licensing business, the nonrecurrence of prior year preferred stock dividends of $0.3 billion, and a reduction in separation costs of $0.2 billion. Adjusted earnings* were $5.0 billion, an increase of $1.8 billion, due to an increase in segment profit of $1.6 billion and lower Adjusted Corporate & Other operating costs*.\n*Non-GAAP Financial Measure\n8 2024 FORM 10-K\n\nProfit was $7.6 billion, a decrease of $2.8 billion. Profit margin was 19.7%, a decrease from 29.5%. Operating profit* was $7.3 billion, an increase of $1.7 billion. Operating profit margin* was 20.7%, an increase of 330 basis points. Continuing earnings (loss) per share was $6.09. Excluding the results from our run-off insurance operations, separation costs, restructuring and other costs, non-operating benefit (cost) income, gains on retained and sold ownership interests, gains (losses) on purchases and sales of business interests and goodwill impairments, adjusted earnings per share* was $4.60, an increase of 56%.\n\nFor the year ended December 31, 2023, continuing earnings increased $8.1 billion, primarily due to an increase in gains on retained and sold ownership interests of $5.7 billion, primarily related to our GE HealthCare and AerCap investments, an increase in segment profit of $1.4 billion, an increase in non-operating benefit income of $0.9 billion, the nonrecurrence of debt extinguishment costs of $0.5 billion, a decrease in interest and other financial charges of $0.3 billion, a decrease in restructuring and other charges of $0.3 billion and an increase in profit from our run-off insurance operations of $0.1 billion. These increases were partially offset by an increase in provision for income taxes of $1.1 billion. Adjusted earnings* were $3.2 billion, an increase of $1.1 billion, primarily due to an increase in segment profit.\nProfit was $10.4 billion, an increase of $8.9 billion. Profit margin was 29.5%, an increase from 5.2%. Operating profit* was $5.6 billion, an increase of $1.3 billion. Operating profit margin* was 17.4%, an increase of 130 basis points. Continuing earnings (loss) per share was $8.33. Excluding the results from our run-off insurance operations, separation costs, restructuring and other costs, non-operating benefit (cost) income, gains on retained and sold ownership interests, and gains (losses) on purchases and sales of business interests, adjusted earnings per share* was $2.95, and increase of 54%.\n\nRemaining performance obligation (RPO) is unfilled customer orders for products and product services (expected life of contract sales for product services) excluding any purchase order that provides the customer with the ability to cancel or terminate without incurring a substantive penalty. See Note 25 for further information.As of December 31, 2024, RPO increased $17.6 billion, or 11%, from December 31, 2023, at Commercial Engines & Services, as a result of contract modifications and engines contracted under long-term service agreements that have now been put into service and from equipment orders outpacing revenue recognized, and at Defense & Propulsion Technologies, driven by Defense & Systems equipment orders outpacing revenue recognized.\n\nAs of December 31, 2023, RPO increased $18.6 billion, or 14%, from December 31, 2022, primarily at Commercial Engines & Services as a result of engines contracted under long-term service agreements that have now been put into service and contract modifications, and an increase in equipment orders since December 31, 2022.\n\nSEGMENT OPERATIONS\nCOMMERCIAL ENGINES & SERVICES. Our results in 2024 reflect robust demand for commercial air travel with departures up high-single digits during the year. We are in frequent communication with our airline, airframe and maintenance, repair and overhaul (MRO) customers about the outlook for commercial air travel, new aircraft production, fleet retirements and after-market services, including shop visit and spare parts demand.\n\nTotal engineering investments, both company and partner-funded, increased compared to prior year. Internal shop visit output increased in 2024 compared to 2023, while total engine deliveries and LEAP engine deliveries decreased primarily due to supply chain constraints. We are investing in our manufacturing and overhaul facilities and are deploying engineering and supply chain resources to increase production, expand capacity and strengthen yield.For the year ended December 31, 2024, segment revenue was up $3.0 billion, or 13%, and segment profit was up $1.4 billion, or 25%, compared to the year ended December 31, 2023.\nRevenue increased primarily due to higher spare parts volume, increased internal shop visit workscope, improved pricing and favorable customer mix. These increases were partially offset by lower deliveries of new engines due to supply chain constraints and an unfavorable change in estimated profitability of our long-term service agreements of $0.1 billion.\nProfit increased primarily due to increased spare parts volume, increased internal shop visit workscope, improved pricing and favorable equipment and services mix. These increases were partially offset by inflation, higher growth investment and an unfavorable change in estimated profitability of our long-term service agreements of $0.1 billion.\n\nFor the year ended December 31, 2023, segment revenue was up $5.0 billion, or 27%, and segment profit was up $1.5 billion, or 36%, compared to the year ended December 31, 2022.\nRevenue increased primarily due to additional commercial install and spare engine unit shipments, higher spare part shipments, higher internal shop visit volume, increased internal shop visit workscope and improved pricing.\nProfit increased primarily due to benefits from increased commercial spare part shipments, higher internal shop visit volume, increased workscope and improved pricing. These increases in profit were partially offset by additional growth investment, inflation in our supply chain and product mix.As of December 31, 2024, RPO increased $16.1 billion, or 12%, from December 31, 2023, due to increases in both equipment and services. Equipment increased primarily due to an increase in engine orders outpacing revenue recognized, primarily for LEAP engines. Services increased primarily as a result of contract modifications and engines contracted under long-term service agreements that have now been put into service.\n\nAs of December 31, 2023, RPO increased $16.8 billion, or 14%, from December 31, 2022, due to increases in both equipment and services. Equipment increased primarily due to an increase in engine orders outpacing revenue recognized. Services increased primarily as a result of engines contracted under long-term service agreements that have now been put into service and contract modifications.\n\nDEFENSE & PROPULSION TECHNOLOGIES. Our results in 2024 reflect domestic and international government defense departments’ focus on modernizing and scaling their forces while continuing flight operations, driving services demand. A key underlying driver of our business is government funding, as most of the revenue in Defense & Systems is derived from funding that flows through the U.S. Department of Defense (DoD) budget, or equivalent international budgets. National defense budgets grew in the U.S. in the low-single digits and internationally in the mid-single digits in 2024. In March 2024, Congress passed its defense funding bill for fiscal year 2024, which included funding that supports our advanced engine development research, classified programs and product procurement and maintenance in other engine lines.\n\nAdditionally, the DoD is focused on advanced combat, enhancing platform capability and groundbreaking technology primarily in classified programs, including support for the next generation T901 turboshaft engine and advanced engine architectures. In June 2024, GE Aerospace delivered two T901-GE-900 engines to Sikorsky for integration and testing aboard a UH-60 Black Hawk as part of the U.S. Army upgrade program. In addition, GE Aerospace was awarded a $1.1 billion contract to provide T700 series turbine engines to the U.S. Army through the first half of 2029.For the year ended December 31, 2024, segment revenue was up $0.5 billion, or 6%, and segment profit was up $0.2 billion, or 17%, compared to the year ended December 31, 2023.\nRevenue increased in both D&S and P&AT. D&S revenue increased primarily due to services growth, improved pricing and additional volume in aircraft systems products. This increase was partially offset by lower engine deliveries. P&AT revenue increased, primarily due to higher output at Avio Aero and Unison and improved pricing.\nProfit increased primarily due to services growth, improved pricing and prior year impacts from program costs. This increase was partially offset by incremental investments to support next generation products, inflation in our supply chain and lower deliveries of new engines.\n\nFor the year ended December 31, 2023, segment revenue was up $1.0 billion, or 12%, and segment profit was down $0.1 billion, or 7%, compared to the year ended December 31, 2022.\nD&S revenue increased due to product mix, higher prices, and growth in development contracts and aircraft systems products. P&AT revenue also increased, primarily due to higher output at Avio Aero and Unison and improved pricing.\nProfit decreased primarily due to inflationary pressures within our supply chain, impacts from program costs and lower engine shipments.As of December 31, 2024, RPO increased $1.5 billion, or 9%, from December 31, 2023, primarily due to increases in equipment from D&S orders outpacing revenue recognized. Equipment growth was primarily driven by engine and flight management system orders.\n\nAs of December 31, 2023, RPO increased $1.8 billion, or 12%, from December 31, 2022, primarily due to increases in equipment and services orders outpacing revenue recognized.\n\nCORPORATE & OTHER. Corporate & Other revenue include our run-off insurance operations revenue and the elimination of intersegment activities. Corporate & Other operating profit includes Corporate functions and operations costs, certain costs of our principal retirement plans, significant, higher-cost restructuring programs, separation costs, profit (loss) of our run-off insurance operations, U.S. tax equity profit (loss), transition services agreements, environmental health and safety (EHS) impacts and other costs, as well as certain amounts that are not included in operating segment results because they are excluded from measurement of their operating performance for internal and external purposes.Adjusted Corporate & Other operating costs* excludes gains (losses) on purchases and sales of business interests, gains (losses) on retained and sold ownership interests and other equity securities, higher-cost restructuring programs, separation costs, our run-off insurance operations, Russia and Ukraine charges, U.S. tax equity profit (loss) and goodwill impairments. We believe that adjusting Corporate & Other costs to exclude the effects of items that are not closely associated with ongoing operations provides management and investors with a meaningful measure that increases the period-to-period comparability of our ongoing corporate costs.\n\nFor the year ended December 31, 2024, revenue decreased by $0.2 billion compared to the year ended December 31, 2023, primarily due to higher intercompany eliminations, partially offset by an increase in our run-off insurance operations revenue. Corporate & Other operating profit decreased by $4.3 billion due to $5.2 billion of lower gains on retained and sold ownership interests and other equity securities, primarily related to our GE HealthCare and AerCap investments, $0.3 billion of higher restructuring and other charges, and $0.3 billion of goodwill impairments, related to our Colibrium Additive reporting unit, partially offset by $0.7 billion of higher profit in our run-off insurance operations primarily from improved investment results, positive claims experience and higher premium rate increases, $0.5 billion of higher gains on sales of business interests, primarily related to the sale of our non-core licensing business and prior year valuation allowance losses related to the planned sale of the Electric Insurance business and $0.2 billion of lower separation costs.\nAdjusted Corporate & Other operating costs* decreased primarily due to a reduction in our functional costs and favorability from higher\nbank interest, partially offset by higher intercompany eliminations, primarily resulting from additional intercompany engine parts sales\nvolume in our Propulsion & Additive Technologies business.\n\nFor the year ended December 31, 2023, revenue increased by $0.2 billion compared to the year ended December 31, 2022, primarily due to a $0.4 billion increase in our run-off insurance operations revenue, partially offset by $0.2 billion of higher intercompany eliminations. Corporate & Other operating profit increased by $5.8 billion due to $5.7 billion of higher gains on retained and sold ownership interests, primarily related to our GE HealthCare and AerCap investments, partially offset by the nonrecurrence of prior year gains on our Baker Hughes investment. Corporate & Other operating profit also increased as a result of $0.3 billion of lower restructuring and other charges, $0.1 billion of higher profit in our run-off insurance operations, and $0.1 billion of lower charges from contracts and recoverability of assets in connection with the conflict between Russia and Ukraine, partially offset by $0.1 billion of higher valuation allowance losses related to the planned sale of the Electric Insurance business and $0.1 billion higher separation costs.\nAdjusted Corporate & Other operating costs* increased primarily due to higher EHS costs and higher intercompany eliminations primarily resulting from additional intercompany engine part sales volume in our Propulsion & Additive Technologies business partially offset by a reduction in our functional costs and favorability from higher bank interest.\n\nOTHER CONSOLIDATED INFORMATION\nRESTRUCTURING AND SEPARATION COSTS. Significant, higher-cost restructuring programs, primarily related to the separations, are excluded from measurement of segment operating performance for internal and external purposes; those excluded amounts are reported in Restructuring and other charges for Corporate. In addition, we incur costs associated with separation activities, which are also excluded from measurement of segment operating performance for internal and external purposes. See Note 20 for further information on restructuring and separation costs.\n\nINTEREST AND OTHER FINANCIAL CHARGES were $1.0 billion, $1.0 billion and $1.3 billion for the years ended December 31, 2024, 2023 and 2022, respectively. The decrease was primarily due to lower average borrowing balances. The primary component of interest and other financial charges is interest on short- and long-term borrowings.\n\nDEBT EXTINGUISHMENT COSTS were zero, zero, and $0.5 billion, for the years ended December 31, 2024, 2023 and 2022 respectively. There were no debt tenders in 2024 and 2023.\n\nPOSTRETIREMENT BENEFIT PLANS. Refer to Note 13 for information about our pension and retiree benefit plans.For the year ended December 31, 2024, the effective income tax rate was 12.6% compared to 9.5% for the year ended December 31, 2023. The tax rates for both 2024 and 2023 reflect a tax provision on pre-tax income.\n\nThe provision (benefit) for income taxes was $1.0 billion and $1.0 billion for the years ended December 31, 2024 and 2023, respectively. There was a decrease in tax primarily due to an increase in tax benefits associated with separation activities, earnings of global activities, and equity compensation, largely offset by the tax effect of the increase in pre-tax income excluding gains and losses on our retained and sold ownership interests. There was an insignificant tax on the net gains in GE HealthCare and AerCap equity in both periods because of the tax-free disposition of GE HealthCare shares and because of available capital losses.\n\n\n\n*Non-GAAP Financial Measure\n12 2024 FORM 10-K\n\nFor the year ended December 31, 2024, the adjusted effective income tax rate* was 20.1% compared to 23.9% for the year ended December 31, 2023. The adjusted provision for income taxes* was $1.3 billion in 2024 and $1.1 billion in 2023. The increase in tax was primarily due to the tax effect of the increase in adjusted earnings before taxes*, partially offset by an increase in tax benefit associated with earnings of global activities and equity compensation.\n\nFor the year ended December 31, 2023, the effective income tax rate was 9.5% compared to 11.1% for the year ended December 31, 2022. The tax rates for both 2023 and 2022 reflect a tax provision on pre-tax income.\n\nThe provision (benefit) for income tax was $1.0 billion and $0.2 billion for the years ended December 31, 2023 and 2022, respectively. The increase in tax was primarily due to the tax effect of the increase in pre-tax income excluding gains and losses on our retained and sold ownership interests, partially offset by a decrease in tax expense related to separation-related entity restructuring. There was an insignificant tax on the net gains in GE HealthCare, AerCap and Baker Hughes equity in both periods because of the tax-free disposition of GE HealthCare shares and because of available capital losses.\n\nFor the year ended December 31, 2023, the adjusted effective income tax rate* was 23.9% compared to 17.6% for the year ended December 31, 2022. The adjusted provision for income taxes* was $1.1 billion in 2023 and $0.5 billion in 2022. The increase in tax was primarily due to the tax effect of the increase in adjusted earnings before taxes* and a decrease in favorable audit resolutions.\n\nThe rate of tax on our profitable non-U.S. earnings is below the U.S. statutory rate because we have significant business operations subject to tax in countries where the tax rate on that income is lower than the U.S. statutory rate. Most of these earnings have been reinvested in active non-U.S. business operations. Due to U.S. tax reform, substantially all of our unrepatriated net earnings have been subject to U.S. tax and accordingly we expect to have the ability to repatriate available non-U.S. cash without significant additional tax cost. We reassess reinvestment of earnings on an ongoing basis.\n\nA substantial portion of the benefit for lower-taxed non-U.S. earnings related to business operations subject to tax in countries where the tax on that income is lower than the U.S. statutory rate is derived from our operations located in Singapore, where the earnings are primarily taxed at a rate of 8.5% in 2024 and 2023, and 8.0% in 2022.\n\nThe U.S. has enacted a minimum tax on foreign earnings (global intangible low taxed income) as part of the Tax Cuts and Jobs Act of 2017 (U.S. tax reform). We pay significant foreign tax which substantially reduces the U.S. liability on these earnings. In addition, the rate of tax on non-U.S. operations has increased from losses in foreign jurisdictions where it is not likely that such losses can be utilized and therefore no tax benefit is provided for those losses. Non-U.S. losses also limit our ability to claim U.S. foreign tax credits on certain operations, increasing the rate of tax on non-U.S. operations. Overall, these factors reduce the benefit associated with our non-U.S. operations.\n\nA more detailed analysis of differences between the U.S. federal statutory rate and the consolidated effective rate, as well as other information about our income tax provisions, is provided in Critical Accounting Estimates and Note 15.\n\nDISCONTINUED OPERATIONS primarily comprise our former GE Vernova and GE HealthCare businesses, our mortgage portfolio in Poland (Bank BPH) and other trailing assets and liabilities associated with prior dispositions. Results of operations, financial position and cash flows for these businesses are reported as discontinued operations for all periods presented and the notes to the financial statements have been adjusted on a retrospective basis. See Note 2 for further information regarding our businesses in discontinued operations.\n\nCAPITAL RESOURCES AND LIQUIDITY\nFINANCIAL POLICY. GE Aerospace is committed to maintaining strong investment grade ratings with a disciplined capital allocation strategy. The Company will continue to invest in future growth and innovation through research and development and capital expenditures. We intend to return a majority of our free cash flow* to shareholders through dividends and share repurchases. Merger and acquisition investments will be pursued in a disciplined way and focused on those that offer strategic, operational and financial synergies.\n\nLIQUIDITY POLICY. We maintain a strong focus on liquidity and define our liquidity risk tolerance based on sources and uses to maintain a sufficient liquidity position to meet our business needs and financial obligations under both normal and stressed conditions. We believe that our consolidated liquidity and availability under our revolving credit facilities will be sufficient to meet our liquidity needs.\n\nCONSOLIDATED LIQUIDITY. Our primary sources of liquidity consist of cash and cash equivalents, free cash flow* from our operating businesses, and access to capital markets. If needed, we can also draw from short-term borrowing facilities, including revolving credit facilities. Cash generation can be subject to variability based on many factors, including receipt of down payments on large equipment orders, timing of billings on long-term contracts, timing of customer allowances and market conditions. Total cash, cash equivalents and restricted cash was $13.6 billion at December 31, 2024, of which $4.4 billion was held in the U.S. and $9.2 billion was held outside the U.S.\n\nCash held in non-U.S. entities has generally been reinvested in active foreign business operations; however, substantially all of our unrepatriated earnings were subject to U.S. federal tax and, if there is a change in reinvestment, we would expect to be able to repatriate available cash (excluding amounts held in countries with currency controls) without significant tax cost.\n\n*Non-GAAP Financial Measure\n2024 FORM 10-K 13\n\nCash, cash equivalents and restricted cash at December 31, 2024 included $0.4 billion of cash held in countries with currency control restrictions. Cash held in countries with currency controls represents amounts held in countries that may restrict the transfer of funds to the U.S. or limit our ability to transfer funds to the U.S. without incurring substantial costs. Excluded from cash, cash equivalents and restricted cash was $0.9 billion of cash in our run-off insurance operations, which was classified as All other assets in the Statement of Financial Position.\n\nAs part of the spin-off of GE HealthCare completed in the first quarter of 2023, we retained 19.9% stake of GE HealthCare common stock upon the spin. During the year ended December 31, 2024, we sold all of our remaining GE Healthcare shares and received total proceeds of $5.2 billion from the disposition of 61.6 million shares. See Notes 3 and 19 for further information.\n\nFollowing approval of a statutory permitted accounting practice in 2018 by our primary insurance regulator, the Kansas Insurance Department (KID), we have since provided a total of $15.0 billion of capital contributions to our insurance subsidiaries, including the final contribution of $1.8 billion in the first quarter of 2024. See Note 12 for further information.\n\nOn March 7, 2024, the Company announced that the Board of Directors had authorized the repurchase of up to $15.0 billion of our common stock, which replaced our previous $3.0 billion share repurchase authorization. Under this program, shares may be repurchased on the open market, via various strategies, including plans complying with rules 10b5-1 and 10b-18 as well as plans using accelerated share repurchases. In connection with this new authorization, we repurchased 28.8 million shares for $4.9 billion from April 2024 through December 31, 2024. This included repurchases of 12.5 million shares for $2.2 billion using accelerated stock repurchases, which were utilized as a mechanism to achieve planned repurchase volumes within a quarter during closed windows.\n\nBORROWINGS. Consolidated total borrowings were $19.3 billion and $20.5 billion at December 31, 2024 and December 31, 2023, respectively, a decrease of $1.2 billion, mainly due to maturities. In April 2024, the Company replaced its previous $10.0 billion syndicated credit facility with a five-year unsecured revolving credit facility in an aggregate committed amount of $3.0 billion. The total interest payments on consolidated borrowings are estimated to be $0.8 billion, $0.8 billion, $0.7 billion, $0.7 billion and $0.7 billion for 2025, 2026, 2027, 2028 and 2029, respectively.\n\nCREDIT RATINGS AND CONDITIONS. We have relied, and may continue to rely, on the short- and long-term debt capital markets to fund, among other things, a significant portion of our operations. The cost and availability of debt financing is influenced by our credit ratings. Moody’s Investors Service (Moody’s) and Standard and Poor’s Global Ratings (S&P) currently issue ratings on our short- and long-term debt. Fitch, which previously issued ratings on us, affirmed our BBB+ long term rating and F1 short-term rating and subsequently withdrew its ratings on us on September 13, 2024, at our request. Our credit ratings as of the date of this filing are set forth in the table below.\n\nMoody's\tS&P\nOutlook\tPositive\tStable\nShort term\tP-2\tA-2\nLong term\tBaa1\tBBB+\n \n\nOur ratings may be subject to a revision or withdrawal at any time by the assigning rating organization, and each rating should be evaluated independently of any other rating.\n\nSubstantially all of the Company's debt agreements in place at December 31, 2024 do not contain material credit rating covenants. Our unused back-up revolving syndicated credit facility contains a customary net debt-to-EBITDA financial covenant, which we satisfied at December 31, 2024.\n\nFOREIGN EXCHANGE RISK AND INTEREST RATE RISK. As a result of our global operations, we generate and incur a small portion of our revenue and expenses in currencies other than the U.S. dollar. Such principal currencies include the euro, the British Sterling pound, and Brazilian real. The effect of foreign currency fluctuations on earnings was immaterial for the year ended December 31, 2024. See Note 22 for further information about our risk exposures, our use of derivatives, and the effects of this activity on our financial statements.\n\nExchange rate and interest rate risks are managed with a variety of techniques, including selective use of derivatives. We apply policies to manage each of these risks, including prohibitions on speculative activities. It is our policy to minimize currency exposures by conducting operations in the U.S. dollar if possible or by utilizing the protection of hedge strategies. To assess exposure to interest rate risk, we apply a +/- 100 basis points change in interest rates and keep that in place for the next 12 months. To assess exposure to currency risk of assets and liabilities denominated in other than their functional currencies, we evaluate the effect of a 10% shift in exchange rates against the U.S. dollar (USD). The analyses indicated that our 2024 consolidated net earnings would decline by $0.1 billion for interest rate risk and $0.1 billion for foreign exchange risk.\n\n14 2024 FORM 10-K\n\nSTATEMENT OF CASH FLOWS\nCASH FLOWS FROM CONTINUING OPERATIONS. The most significant source of cash flows from operating activities (CFOA) is customer-related activities, the largest of which is collecting cash resulting from equipment or services sales. The most significant operating use of cash is to pay our suppliers, employees, tax authorities and postretirement plans. GE Aerospace measures itself on a free cash flow* basis. This metric includes CFOA plus investments in property, plant and equipment and additions to internal-use software, and this metric excludes any cash received from dispositions of property, plant and equipment.\n\nCash from operating activities was $5.8 billion in 2024, an increase of $1.2 billion compared to 2023, primarily due to: an increase in net income (after adjusting for depreciation of property, plant and equipment, amortization of intangible assets, goodwill impairments and non-cash (gains) losses related to our retained and sold ownership interests in GE HealthCare, AerCap and Baker Hughes) driven by all segments, a decrease in income tax payments, partially offset by working capital growth and decrease in All other operating activities. The components of All other operating activities were as follows:\nThe cash impacts from changes in working capital were $(0.4) billion, a decrease of $1.1 billion compared to 2023, due to: current receivables of $(0.9) billion, driven by higher volume partially offset by higher collections, including increased collections from CFM International; inventories, including deferred inventory, of $(0.2) billion, driven by higher material purchases and lower liquidations primarily due to output challenges; current contract assets, contract liabilities and current deferred income of $(0.2) billion, driven by higher revenue recognition, partially offset by billings and net unfavorable changes in estimated profitability; progress collections of $0.3 billion, driven by higher collections offset by higher liquidations; accounts payable was flat, driven by higher disbursements related to purchases of materials in prior periods, partially offset by higher volume.\n\nCash from operating activities was $4.6 billion in 2023, an increase of $0.6 billion compared to 2022, primarily due to: an increase in net income (after adjusting for depreciation of property, plant, and equipment, amortization of intangible assets and non-cash (gains) losses related to our retained and sold ownership interests in GE HealthCare, AerCap and Baker Hughes) primarily in our Commercial Engines & Services business; partially offset by an increase in income tax payments and working capital growth.The cash impacts from changes in working capital were $0.6 billion, a decrease of $0.5 billion compared to 2022, due to: current receivables of $1.7 billion, driven by higher collections partially offset by higher volume; inventories, including deferred inventory, of $(0.3) billion, driven by higher material purchases outpacing liquidations primarily due to output challenges; current contract assets, contract liabilities and current deferred income was flat, driven by higher billings offset by higher revenue recognition; progress collections of $(0.9) billion, driven by lower collections and higher liquidations; accounts payable of $(0.9) billion, driven by higher disbursements related to purchases of materials in prior periods partially offset by higher volume.\n\nCash used for investing activities was $0.6 billion in 2024, a decrease of $8.2 billion compared to 2023, primarily due to: higher cash paid related to net settlements between our continuing operations and businesses in discontinued operations of $4.6 billion, primarily related to the separation of GE Vernova of $3.0 billion in 2024 and lower cash received of $1.1 billion related to the separation of GE HealthCare in 2023 (components of All other investing activities); a decrease in proceeds of $3.8 billion from the disposition of our remaining retained ownership interests in AerCap and Baker Hughes of $6.8 billion in 2023, partially offset by an increase in proceeds of $3.1 billion from the disposition of our remaining retained ownership interest in GE HealthCare in 2024. These increases in cash used were partially offset by proceeds received from the dispositions of our non-core licensing business and Electric Insurance Company of $0.5 billion. Cash used for additions to property, plant and equipment and internal-use software, which are components of free cash flow*, was $1.0 billion and $0.9 billion in 2024 and 2023, respectively.\n\n\n\n*Non-GAAP Financial Measure\n2024 FORM 10-K 15\n\nCash from investing activities was $7.7 billion in 2023, a decrease of $2.7 billion compared with 2022, primarily due to: higher cash paid related to net settlements between our continuing operations and businesses in discontinued operations of $6.3 billion, primarily related to lower cash received of $7.6 billion related to the separation of GE Healthcare partially offset by higher cash received of $0.8 billion from the separation of GE Vernova and an increase in cash paid for derivatives settlements of $0.4 billion (components of All other investing activities); partially offset by an increase in proceeds of $4.3 billion from the disposition of our retained ownership interests in GE HealthCare, AerCap and Baker Hughes. Cash used for additions to property, plant and equipment and internal-use software, which are components of free cash flow*, was $0.9 billion and $0.7 billion in 2023 and 2022, respectively.\n\nCash used for financing activities was $6.6 billion in 2024, a decrease of $3.9 billion compared to 2023, primarily due to: cash paid for redemption of GE preferred stock of $5.8 billion in 2023; lower net debt maturities of $2.6 billion and an increase in cash received of $0.9 billion from stock option exercises (a component of All other financing activities); partially offset by an increase in treasury stock repurchases of $4.6 billion and higher dividends paid to shareholders of $0.4 billion.\n\nCash used for financing activities was $10.5 billion in 2023, a decrease of $3.0 billion compared with 2022, primarily due to: cash paid to repurchase long-term debt of $6.9 billion, including debt extinguishment costs in 2022, lower other net debt maturities of $0.5 billion, lower cash paid on derivatives hedging foreign currency debt of $0.7 billion, an increase in cash received of $0.5 billion from stock option exercises, the settlement of Concept Laser GmbH's interest of $0.2 billion in 2022 (components of All other financing activities); partially offset by higher cash paid for redemption of GE preferred stock of $5.7 billion.\n\nFree cash flow* (FCF) was $6.1 billion and $4.7 billion for the years ended December 31, 2024 and 2023, respectively. FCF* increased primarily due to higher net income and lower income tax payments, partially offset by a decrease in All other operating activities and working capital growth, after adjusting for an increase in Corporate & Other restructuring cash expenditures, which are excluded from FCF*.\n\nFree cash flow* was $4.7 billion and $3.5 billion for the years ended December 31, 2023 and 2022, respectively. FCF* increased primarily due to higher net income, partially offset by higher income tax payments and working capital growth, after adjusting for increases in separation cash and Corporate & Other restructuring cash expenditures, which are excluded from FCF*.\n\nCASH FLOWS FROM DISCONTINUED OPERATIONS\nCash used for operating activities of discontinued operations was $1.1 billion in 2024, an increase of $1.7 billion compared to 2023, primarily driven by down payments received on equipment orders at our former GE Vernova business and disbursements for purchases of materials incurred by our former GE HealthCare business in 2023.\n\nCash from operating activities of discontinued operations was $0.6 billion in 2023, a decrease of $1.3 billion compared to 2022, primarily driven by higher disbursements related to purchases of materials in prior periods and higher separation costs related to our former GE HealthCare business, partially offset by down payments received on equipment orders at our former GE Vernova business and tax receipts from our trailing operations.\n\nCash used for investing activities of discontinued operations was $1.1 billion in 2024, a decrease of $2.6 billion compared to 2023, primarily driven by higher cash received of $4.6 billion from net settlements between our discontinued operations and businesses in continuing operations, due to cash received of $3.0 billion in 2024 related to the separation of our former GE Vernova business and cash paid of $1.1 billion in 2023 related to the separation of our former GE HealthCare business. In addition, there was a decrease in cash used due to the prior year separation of GE HealthCare cash and cash equivalents of $1.8 billion. These decreases in cash used were partially offset by a reduction of cash and cash equivalents of $4.2 billion due to the separation of GE Vernova in 2024.\n\nCash used for investing activities of discontinued operations was $3.7 billion in 2023, a decrease of $4.4 billion compared to 2022, primarily driven by higher cash received of $6.3 billion from net settlements between our discontinued operations and businesses in continuing operations, due to cash received of $7.6 billion related to the separation of our former GE HealthCare business and cash paid of $0.8 billion related to the separation of our former GE Vernova business; partially offset by a reduction in cash due to the separation of GE HealthCare cash and cash equivalents of $1.8 billion in 2023.\n\nCash used for financing activities of discontinued operations was $0.1 billion in 2024, a decrease of $2.0 billion compared to 2023, driven by GE HealthCare's long-term debt issuance of $2.0 billion in connection with the spin-off in 2023.\n\nCash from financing activities of discontinued operations was $1.9 billion in 2023, a decrease of $6.1 billion compared to 2022, primarily driven by lower long-term debt issuances of $6.3 billion at GE HealthCare in connection with the spin-off in 2022.\n\nCRITICAL ACCOUNTING ESTIMATES. Accounting estimates and assumptions discussed in this section are those that we consider to be the most critical to an understanding of our financial statements because they involve significant judgments and uncertainties. Actual results in these areas could differ from management's estimates. See Note 1 for further information on our most significant accounting policies.\n\n\n\n\n\n*Non-GAAP Financial Measure\n16 2024 FORM 10-K\n\nREVENUE RECOGNITION ON LONG-TERM SERVICES AGREEMENTS. We enter into long-term services agreements with our customers, predominantly within the CES segment, that require us to maintain the customers’ assets over the contract terms, which generally range from 5 to 25 years. Contract modifications that extend or revise contracts are not uncommon. We recognize revenue as we perform under the arrangements using the percentage of completion method which is based on our costs incurred to date relative to our estimate of total expected costs. This requires us to make estimates of customer payments expected to be received over the current contract term as well as the costs to perform required maintenance services.\n\nOur rights to consideration for these arrangements are generally based on the utilization of the asset (e.g., per hour of usage) and contractual payment terms are based on either periodic billing schedules or upon the occurrence of a maintenance event, such as an overhaul. As a result, a significant estimate in determining expected revenue of a contract is estimating how customers will utilize their assets over the term of the agreement. The estimate of utilization, which can change over the contract life, impacts both the amount of customer payments we expect to receive and our estimate of future contract costs. Customers' asset utilization will influence the timing and extent of overhauls and other service events over the life of the contract. We generally use a combination of both historical utilization trends as well as forward-looking information such as market conditions and potential asset retirements in developing our revenue estimates.\n\nTo develop our cost estimates, we consider the timing and extent of future maintenance and overhaul events, including the frequency of maintenance events and cost of labor, spare parts and other resources required to perform the maintenance. In developing our cost estimates, we utilize a combination of our historical cost experience and expected cost improvements. Cost improvements are only included in future cost estimates after savings have been observed in actual results or proven effective through an extensive regulatory or engineering approval process.\n\nWe routinely review estimates and revise them to adjust for changes in outlook. Changes in estimates are recognized on a cumulative catch-up basis with an adjustment to revenue in the current period. These revisions are based on objectively verifiable information that is available at the time of the review. Contract modifications that change the rights and obligations, as well as the nature, timing and extent of future cash flows, are evaluated for potential price concessions, contract asset impairments and significant financing to determine if adjustments of earnings are required before effectively accounting for a modified contract as a new contract.\n\nWe regularly assess expected billings adjustments and customer credit risk inherent in the carrying amounts of receivables and contract assets, including the risk that contractual penalties may not be sufficient to offset our accumulated investment in the event of customer termination. We gain insight into future utilization and cost trends, as well as credit risk, through our knowledge of the installed base of equipment and fleet management strategies through close interaction with our customers that comes with supplying critical services and parts over extended periods. Revisions may affect a long-term services agreement’s total estimated profitability resulting in an adjustment of earnings.\n\nOn December 31, 2024, our long-term service agreements net liability balance of $6.6 billion represents approximately 4.1% of our total estimated life of contract billings of $162 billion. Our contracts (on average) are approximately 18.4% complete based on costs incurred to date and our estimate of future costs. Revisions to our estimates of future billings or costs that increase or decrease total estimated contract profitability by one percentage point would increase or decrease the long-term service agreements balance by $0.4 billion. Billings collected on these contracts were $8.6 billion and $8.1 billion during the years ended December 31, 2024 and 2023, respectively. See Notes 1 and 8 for further information.\n\nNONRECURRING ENGINEERING COSTS. We incur contract fulfillment costs for engineering and development of products directly related to existing or anticipated contracts with customers, primarily in our Defense & Propulsion Technologies segment. Contract fulfillment costs are capitalized to the extent recoverable from the customer contract, and subsequently amortized as the products are delivered to the customer. We periodically assess the recoverability of capitalized contract fulfillment costs, which requires significant judgement. Specifically, we estimate program volumes, contract revenue based on negotiated prices, and product costs based on input costs, inflation and productivity. See Note 8 for further information.\n\nIMPAIRMENT OF GOODWILL AND OTHER IDENTIFIED INTANGIBLE ASSETS. Goodwill is subject to annual, or more frequent, if necessary, impairment testing. In the impairment test, the fair value is estimated utilizing a discounted cash flow approach utilizing cash flow forecasts, including strategic and annual operating plans, adjusted for terminal value assumptions, or a market approach, when available and appropriate, utilizing market observable pricing multiples of similar businesses and comparable transactions, or both. These impairment tests involve the use of accounting estimates and assumptions, and changes to those assumptions could materially impact our financial condition or operating performance if actual results differ from such estimates and assumptions. To address this uncertainty, we perform sensitivity analyses on key estimates and assumptions. Once the fair value is determined, if the carrying amount exceeds the fair value, it is impaired. In the fourth quarter of each year, we perform our annual impairment test. See Note 7 for further information.\n\nWe review identified intangible assets with defined useful lives and subject to amortization for impairment whenever events or changes in circumstances indicate that the related carrying amounts may not be recoverable. Determining whether an impairment loss has occurred requires the use of our internal forecast to estimate future cash flows and the useful life over which these cash flows will occur. To determine fair value, we use our internal cash flow estimates discounted at an appropriate discount rate. See Notes 1 and 7 for further information.\n\n2024 FORM 10-K 17\n\nINSURANCE AND INVESTMENT CONTRACTS. Refer to the Other Items - Insurance section for further discussion of the accounting estimates and assumptions in our insurance reserves and their sensitivity to change. See Notes 1 and 12 for further information.\n\nPENSION ASSUMPTIONS. Refer to Note 13 for our accounting estimates and assumptions related to our postretirement benefit plans.\n\nINCOME TAXES. Our annual tax rate is based on our income, statutory tax rates and tax planning opportunities available to us in the various jurisdictions in which we operate. Tax laws are complex and subject to different interpretations by the taxpayer and respective governmental taxing authorities. Significant judgment is required in determining our tax expense and in evaluating our tax positions, including evaluating uncertainties. We review our tax positions quarterly and adjust the balances as new information becomes available. Our income tax rate is significantly affected by the tax rate on our global operations. In addition to local country tax laws and regulations, this rate can depend on the extent earnings are indefinitely reinvested outside the U.S. Historically U.S. taxes were due upon repatriation of foreign earnings. Due to the enactment of U.S. tax reform in 2017, substantially all of our unrepatriated net earnings have been subject to U.S. tax and accordingly we expect to have the ability to repatriate available non-U.S. cash without significant additional tax cost. Indefinite reinvestment is determined by management’s judgment about and intentions concerning the future operations of the Company. Most of these earnings have been reinvested in active non-U.S. business operations. We reassess reinvestment of earnings on an ongoing basis.\n\nWe evaluate the recoverability of deferred income tax assets by assessing the adequacy of future expected taxable income from all sources, including reversal of taxable temporary differences, forecasted operating earnings and available tax planning strategies, which rely on reasonable estimates. We use our historical experience and our short- and long-range business forecasts to provide insight. Further, our global and diversified business portfolio gives us the opportunity to employ various prudent and feasible tax planning strategies to facilitate the recoverability of future deductions. Amounts recorded for deferred tax assets related to non-U.S. net operating losses, net of valuation allowances, were $0.5 billion and $1.0 billion at December 31, 2024 and 2023, respectively. Of this, an insignificant amount and $0.6 billion at December 31, 2024 and 2023 respectively, were associated with losses reported in discontinued operations, primarily related to our GE Vernova, GE HealthCare and legacy financial services businesses. See Other Consolidated Information – Income Taxes section and Notes 1 and 15 for further information.\n\nLOSS CONTINGENCIES. Loss contingencies are existing conditions, situations or circumstances involving uncertainty as to possible loss that will ultimately be resolved when future events occur or fail to occur. Such contingencies include, but are not limited to, environmental, health and safety matters, litigation, regulatory investigations and proceedings, government contracts, employee benefit plans, product quality guarantees and losses resulting from other events and developments. In particular, the design, development, production and support of aerospace products is inherently complex and subject to risk. Technical issues associated with these products may arise in the normal course and may result in financial impacts, including increased warranty provisions, customer contract settlements, and changes in contract performance estimates. When a loss is considered probable and reasonably estimable, we record a liability in the amount of our best estimate for the ultimate loss. When there appears to be a range of possible costs with equal likelihood, liabilities are based on the low-end of such range. However, the likelihood of a loss with respect to a particular contingency is often difficult to predict and determining a meaningful estimate of the loss or a range of loss may not be practicable based on the information available and the potential effect of future events and negotiations with or decisions by third parties that will determine the ultimate resolution of the contingency. Moreover, it is not uncommon for such matters to be resolved over many years, during which time relevant developments and new information must be continuously evaluated to determine both the likelihood of potential loss and whether it is possible to reasonably estimate a range of possible loss. Disclosure is provided for material loss contingencies when a loss is probable but a reasonable estimate cannot be made, and when it is reasonably possible that a loss will be incurred or the amount of a loss will exceed the recorded provision. We regularly review contingencies to determine whether the likelihood of loss has changed and to assess whether a reasonable estimate of the loss or range of loss can be made. See Note 24 for further information.\n\nOTHER ITEMS\nINSURANCE. Our run-off insurance operations include Employers Reassurance Corporation (ERAC) and Union Fidelity Life Insurance Company (UFLIC). ERAC primarily assumed long-term care insurance and life insurance from numerous cedents under various types of reinsurance treaties and stopped accepting new policies after 2008. UFLIC primarily assumed long-term care insurance, structured settlement annuities with and without life contingencies and variable annuities from Genworth Financial Inc. (Genworth) and has been closed to new business since 2004.\nStructured settlement annuities. We reinsure approximately 23,400 structured settlement annuities with an average attained age of 57. Approximately 27% of these structured settlement annuities were underwritten on impaired lives (i.e., shorter-than-average life expectancies) at origination and have projected payments extending decades into the future. Our primary risks associated with these contracts include mortality (i.e., life expectancy or longevity), mortality improvement (i.e., assumed rate that mortality is expected to reduce over time), which may extend the duration of payments on life contingent contracts beyond our estimates, and reinvestment risk (i.e., a low interest rate environment). Unlike long-term care insurance, structured settlement annuities offer no ability to require additional premiums or reduce benefits.\n\nLife Insurance contracts. Our life reinsurance business typically covers the mortality risk associated with various types of life insurance policies that we reinsure from approximately 150 ceding company relationships where we pay a benefit based on the death of a covered life. At December 31, 2024, across our U.S. and Canadian life insurance portfolio, we reinsure approximately $45 billion of net amount at risk (i.e., difference between the death benefit and any accrued cash value) from approximately 1.1 million policies with an average attained age of 63. In 2024, our incurred claims were approximately $0.4 billion with an average individual claim of approximately $46,100. The covered products primarily include permanent life insurance and 20- and 30-year level term insurance. We anticipate a significant portion of the 20- and 30-year level term policies, which represent approximately 7% and 43% of the net amount of risk, to lapse through 2026 and 2035 as the policies reach the end of their 20- and 30-year level premium period, respectively.\n\nCritical Accounting Estimates. Our insurance reserves include the following key accounting estimates and assumptions described below.\n\nFuture policy benefit reserves. Future policy benefit reserves represent the present value of future benefits to be paid to or on behalf of policyholders and related expenses less the present value of future net premiums and are estimated based on actuarial assumptions such as mortality, morbidity, terminations, and expenses. The liability is measured for each group of contracts (i.e., cohorts) using current cash flow assumptions.\n\nWe regularly monitor emerging experience in our run-off insurance operations and industry developments to identify trends that may help us refine our reserve assumptions. We review at least annually in the third quarter, future policy benefit reserves cash flow assumptions, except related claim expenses which remain locked-in, and if the review concludes that the assumptions need to be updated, future policy benefit reserves are adjusted retroactively based on the revised net premium ratio using actual historical experience, updated cash flow assumptions, and the locked-in discount rate with the effect of those changes recognized in current period earnings. Our annual review procedures include updating certain experience studies since our last completed review, independent actuarial analysis (principally on long-term care insurance exposures) and review of industry benchmarks. The review of experience and assumptions is a comprehensive and complex process that depends on a number of factors, many of which are interdependent and require evaluation individually and in the aggregate across all insurance products. The vast majority of our run-off insurance operations consists of reinsurance from multiple ceding insurance entities pursuant to treaties having complex terms and conditions. The review relies on claim and policy information provided by these ceding entities and considers the reinsurance treaties and underlying policies. In order to utilize that information for purposes of completing experience studies covering all key assumptions, we perform detailed procedures to conform and validate the data received from the ceding entities. Our long-term care insurance portfolio includes coverage where credible claim experience for higher attained ages is still emerging, and to the extent future experience deviates from current expectations, new projections of claim costs extending over the expected life of the policies may be required. Significant uncertainties exist in making projections for these long-term care insurance contracts, which requires that we consider a wide range of possible outcomes.\n\n\n2024 FORM 10-K 19\n\nThe primary cash flow assumptions used in the annual review include:\n\nMorbidity. Morbidity assumptions used in estimating future policy benefit reserves are based on estimates of expected incidences of disability among policyholders and the costs associated with these policyholders asserting claims under their contracts, and these estimates account for any expected future morbidity improvement. For long-term care insurance exposures, estimating expected future costs includes assessments of incidence (probability of a claim), utilization (amount of available benefits expected to be incurred) and continuance (how long the claim will last, including claim terminations due to death or recovery).\n\nRate of Change in Morbidity. Our review incorporates our best estimates of projected future changes in the morbidity rates reflected in our base claim incidence rates. These estimates draw upon a number of inputs, some of which are subjective, and all of which are interpreted and applied in the exercise of professional actuarial judgment in the context of the characteristics specific to our portfolios. This exercise of actuarial judgment considers factors such as the work performed by internal and external independent actuarial experts engaged to advise us in our annual review, the observed actual experience in our portfolios measured against our base assumptions, industry developments, and other trends, including advances in the state of medical care and healthcare technology development.\n\nTerminations. Terminations include active life mortality and lapse. Mortality assumptions used in estimating future policy benefit reserves are based on published mortality tables as adjusted for the results of our experience studies and estimates of expected future mortality improvement. Lapse refers to the rate at which the underlying policies are cancelled due to non-payment of premiums by a policyholder. Lapse rate assumptions used in estimating the present value of future policy benefit reserves are based on the results of our experience studies and reflect actuarial judgment.\n\nFuture long-term care premium rate increases. Substantially all long-term care insurance policies that are currently premium paying allow the issuing insurance entity to increase premiums, or alternatively allow the policyholder the option to decrease benefits, with approval by state regulators, should actual experience emerge worse than what was projected when such policies were initially underwritten. As a reinsurer, we rely upon the primary insurers that issued the underlying policies to file proposed premium rate increases on those policies with the relevant state insurance regulators. While we have no direct ability to seek or to institute such premium rate increases, we often collaborate with the primary insurers in accordance with reinsurance contractual terms to file proposed premium rate increases. The amount of times that rate increases have occurred varies by ceding company. We consider recent experience of rate increase filings made by our ceding companies along with state insurance regulatory processes and precedents in establishing our current expectations.\n\nIncluded in Insurance losses and annuity benefits in our Statement of Earnings (Loss) for the years ended December 31, 2024 and 2023, are favorable and unfavorable pre-tax adjustments of $196 million and $(155) million, respectively, from updating the net premium ratio (i.e., the percentage of projected gross premiums required to cover expected policy benefits and related expenses) after updating for actual historical experience each quarter and updating of future cash flow assumptions in the third quarter of each year.\n\nSensitivities. The following table provides sensitivities with respect to the impact of changes of key cash flow assumptions underlying our future policy benefit reserves using the locked-in discount rate assumption and have been estimated across the entire product line rather than at an individual cohort level. As our insurance operations are in run-off, the locked-in discount rate is used for the computation of interest accretion on future policy benefit reserves. Many of our assumptions, which are based on our credible experience, are interdependent and require evaluation individually and in the aggregate across all insurance products. Small changes in the amounts used in the sensitivities could result in materially different outcomes from those reflected below. In addition, the effects of changes to cash flow assumptions underlying our future policy benefit reserves may be partially or wholly reflected in the period in which the assumptions are changed and/or over future periods and may vary across cohorts.While higher assumed inflation, holding all other assumptions constant, would result in unfavorable impacts to the projected present value of future cash flows in the table above, it would be expected to be mitigated by more long-term care insurance policies reaching contractual daily or monthly benefit caps and by increased investment income from higher portfolio yields.\n\nOur run-off insurance subsidiaries are required to prepare statutory financial statements in accordance with statutory accounting practices. Statutory accounting practices are set forth by the National Association of Insurance Commissioners as well as state laws, regulation and general administrative rules and can differ in certain respects from GAAP and would result in several of the sensitivities described in the table above being less impactful on our statutory reserves.\n\nSee Capital Resources and Liquidity and Notes 1, 3 and 12 for further information related to our run-off insurance operations.\n\nNEW ACCOUNTING STANDARDS. In December 2023, the Financial Accounting Standards Board (FASB) issued ASU No. 2023-09, Income Taxes (Topic 740): Improvements to Income Tax Disclosures. The amendments require disclosure of specific categories in the rate reconciliation and provide additional information for reconciling items that meet a quantitative threshold and further disaggregation of income taxes paid for individually significant jurisdictions. The ASU is effective for fiscal years beginning after December 15, 2024, with early adoption permitted. We are currently evaluating the impact that this guidance will have on the disclosures within our consolidated financial statements.\n\nIn November 2024, the FASB issued ASU No. 2024-03, Income Statement—Reporting Comprehensive Income—Expense Disaggregation Disclosures (Subtopic 220-40). The amendments increase disclosure requirements primarily through enhanced disclosures about types of expenses (including purchases of inventory, employee compensation, depreciation, and amortization) in commonly presented expense captions. The ASU is effective for fiscal years beginning after December 15, 2026, and is required to be applied prospectively with the option for retrospective application. We are currently evaluating the impact that this guidance will have on the disclosures within our consolidated financial statements.\n\nGE VERNOVA PARENT COMPANY GUARANTEES. To support GE Vernova in selling products and services globally, the Company often entered into contracts on behalf of GE Vernova or issued parent company guarantees or trade finance instruments supporting the performance of what were subsidiary legal entities transacting directly with customers, in addition to providing similar credit support for non-customer related activities of GE Vernova (collectively, “GE Aerospace credit support”). Prior to the spin-off in the second quarter of 2024, GE Vernova had been working to seek novation or assignment of GE Aerospace credit support, the majority of which relates to parent company guarantees, associated with GE Vernova legal entities from GE Aerospace to GE Vernova. For GE Aerospace credit support that remains outstanding post-spin, GE Vernova is obligated to use reasonable best efforts to terminate or replace and obtain a full release of the Company’s obligations and liabilities under, all such credit support. Beginning in 2025, GE Vernova will pay a quarterly fee to the Company based on amounts related to the GE Aerospace credit support, for which we have recorded a stand ready to perform obligation. GE Vernova will face other contractual restrictions and requirements while the Company continues to be obligated under such credit support on behalf of GE Vernova. While the Company will remain obligated under the contract or instrument, GE Vernova will be obligated to indemnify the Company for credit support related payments that the Company is required to make.\n\nAs of December 31, 2024, we estimated GE Vernova RPO and other obligations that relate to GE Aerospace credit support to be approximately $17 billion, an over 73% reduction since December 31, 2023. We expect, approximately $10 billion of the RPO related to GE Aerospace credit support obligations to contractually mature by the end of 2029. The Company’s maximum aggregate exposure under the GE Aerospace credit support cannot be reasonably estimated given the breadth of the portfolio across each of the GE Vernova businesses. The underlying obligations are predominantly customer contracts that GE Vernova performs in the course of its business. We have no known instances historically where payments or performance from us were required under parent company guarantees relating to GE Vernova customer contracts. See Note 24 for additional details regarding guarantees.\n\nNON-GAAP FINANCIAL MEASURES. We believe that presenting non-GAAP financial measures provides management and investors useful measures to evaluate performance and trends of the total company and its businesses. This includes adjustments in recent periods to GAAP financial measures to increase period-to-period comparability following actions to strengthen our overall financial position and how we manage our business. In addition, management recognizes that certain non-GAAP terms may be interpreted differently by other companies under different circumstances. In various sections of this report we have made reference to the following non-GAAP financial measures in describing our (1) revenue, specifically, Adjusted revenue, (2) profit, specifically, Operating profit and Operating profit margin; Adjusted earnings (loss); Adjusted earnings (loss) per share (EPS) and Adjusted effective income tax rate, and (3) cash flows, specifically free cash flow (FCF).",
    "item1a": "RISK FACTORS. The following discussion of the material factors, events and uncertainties that may make an investment in the Company speculative or risky contains “forward-looking statements,\" as discussed in the Forward-Looking Statements section. These risk factors may be important to understanding any statement in this report or elsewhere. The risks described below should not be considered a complete list of potential risks that we face, and additional risks not currently known to us or that we currently consider immaterial may also negatively impact us. The following information should be read in conjunction with the MD&A section and the consolidated financial statements and related notes. The risks we describe in this report or in our other SEC filings could, in ways we may not be able to accurately predict, recognize or control, have a material adverse effect on our business, reputation, financial position, results of operations, cash flows and stock price, and they could cause our future results to be materially different than we presently anticipate.\n\nSTRATEGIC RISKS. Strategic risk relates to the Company’s future business plans and strategies, including the risks associated with the global macro-environment; dynamics in the commercial aviation sector; competitive threats; the demand for our products and services and the success of our investments in technology and innovation; impacts of government spending, programs and contracts; climate change; our recent spin-offs; capital allocation decisions; acquisitions, dispositions, joint ventures and other inorganic investments; intellectual property; and other risks.\n\nGlobal macro-environment - Our financial performance and growth are subject to risks related to global economic, political and geopolitical developments or other disruptions to the economy or our business sectors. We serve customers in many countries around the world and receive a significant portion of our revenue from outside the United States. Accordingly, our operations and execution are subject to the effects of global economic trends, geopolitical risks and demand or supply shocks from events such as war or international conflict, a major terrorist attack, natural disasters or actual or threatened public health pandemics or other emergencies. Our operations and performance are also affected by local and regional economic environments, supply chain constraints and policies in the U.S. and other markets that we serve, including factors such as inflationary pressures in many markets, interest rates, economic growth rates, the availability of skilled labor, monetary policy, exchange rates, currency volatility, commodity prices and sovereign debt levels. For example, inflationary or other pressures that cause our material or labor costs to increase can adversely affect our profitability and cash flows, particularly when we are unable to increase customer contract values or pricing to offset those pressures. Deterioration of economic conditions or outlooks, such as lower rates of investment, lower economic growth, recession or fears of recession in the U.S., China, Europe or other key markets, may adversely affect the demand for or profitability of our products and services, and the impact from developments outside the U.S. on our business performance can be significant given the extent of our global activities. Increased geopolitical tensions and outbreaks of armed conflict can also adversely impact our business, both directly or by adversely affecting economic activity globally or in particular regions or countries. For example, Russia’s invasion of Ukraine in early 2022 and related political and economic consequences, such as sanctions and other measures imposed by the European Union, the U.S. and other countries and organizations in response, have caused and may continue to cause disruption and instability in global markets, supply chains and industries that negatively impact our business, financial condition, results of operations and cash flows and pose reputational risks. More recently, there is risk of wider conflict in the Middle East that could have significant adverse impacts on the region and business activity in addition to the humanitarian and other consequences of the current conflict. Further, political changes and trends such as populism, protectionism, economic nationalism and sentiment toward multinational companies, as well as tariffs, export controls, restrictions on outbound investment or other trade barriers, sanctions, technical or local content regulations, currency controls or changes to tax or other laws and policies, have been and may continue to be disruptive and costly to our business. These can interfere with our global operating model, supply chain, production costs, customer relationships and competitive position. Escalation of tariffs or any other specific trade tensions, including intensified decoupling between the U.S. and China, or in global trade conflict more broadly could be harmful to global economic growth or to our business in or with China or other countries. In addition, market uncertainty and volatility in various geographies may be magnified as a result of potential shifts in U.S. and foreign trade, economic and other policies following the recent U.S. elections. We also do business in emerging market jurisdictions where economic, political and legal risks are heightened and the operating environments are complex.\n\nCommercial aviation sector - Our financial performance is dependent on the condition of the commercial aviation sector and our partners, suppliers and customers in that sector. A substantial portion of our business is directly tied to economic conditions in the commercial aviation sector, which has historically been cyclical in nature. Capital spending and demand for aircraft engines, aviation products and aftermarket parts and services by commercial airlines, lessors, other aircraft owners or operators and airframers are influenced by a wide variety of factors, including current and predicted traffic levels, passenger and cargo load factors, aircraft fuel prices, labor costs and other issues, airline consolidation, bankruptcies and restructuring activities, competition, the retirement of older aircraft, changes in production schedules, production capabilities and capacities of airframers, regulatory oversight and changes, environmental regulations, terrorism and related security concerns, aircraft safety incidents, general economic conditions, tightening of credit in financial markets, corporate profitability, cost reduction efforts and remaining performance obligations levels. Any of these factors could have a negative impact on new orders or on our agreements for the sale of our products and services given the long-term nature of those arrangements and could reduce our sales and profit margins. Other factors, including future terrorist actions, aviation safety concerns, public health crises or major natural disasters, could also dramatically reduce the demand for commercial air travel, which could negatively impact our sales and profit margins. Supply chain capacity shortfalls and disruptions, including for new parts and services, continue to pose challenges and risks for our business as well as other industry participants. Developments that reduce the flying public’s demand for travel could adversely affect future growth in commercial air traffic capacity and the demand for or profitability of our products and services. Additionally, because a substantial portion of product deliveries to commercial aviation customers are scheduled for delivery in the future, changes in economic conditions can cause customers to request that orders be rescheduled or canceled. Spare parts sales and aftermarket service trends are affected by similar factors, including usage, pricing, technological improvements, regulatory changes and the retirement of older aircraft. Furthermore, because of the lengthy research and development cycle involved in bringing new engine platforms and other products to market, we cannot predict the economic conditions that will exist\n26 2024 FORM 10-K\n\nwhen any new product is ready to enter into service. We also have dependencies on our suppliers and partners for commercial engine programs to develop, manufacture and service their share of an engine, and on the major airframers that we supply to timely and successfully develop, certify and commercialize aircraft that utilize our engines as well as to successfully sell those aircraft against aircraft powered by our competitors. A reduction in spending in the commercial aviation sector, or challenges for key industry participants, could have a significant effect on the demand for our products and services, which could have a material adverse effect on our competitive position, results of operations, financial condition or cash flows.\n\nCompetitive environment - We are dependent on the maintenance of existing product lines and service relationships, acceptance by our customers of new product and service introductions, competitive pricing and other terms, and technology and innovation leadership for revenue and earnings growth. The segments in which we operate are highly competitive in terms of pricing, product and service quality, product development and entry into service, product durability, customer service, financing terms, the ability to respond to shifts in market demand and the ability to attract and retain skilled talent. Our long-term operating results and competitive position also depend substantially upon our ability to continue to improve or upgrade current products and services, to maintain long-term customer relationships and to increase our productivity over time as we perform on long-term service agreements, as well as our ability to develop, introduce, and market new and innovative technology, products, services and platforms, such as the RISE program suite of technologies. In addition, the research and development cycle involved in bringing new products to market is often lengthy, it is inherently difficult to predict the economic conditions or competitive dynamics that will exist when any new product is complete, and our investments, to the extent they result in bringing a product to market, may generate weaker returns than we anticipated at the outset. Our capacity to invest in research and development efforts to advance our technologies, products and services also depends on the financial resources that we have available for such investment relative to other capital allocation priorities. Under-investment in research and development, or investment in technologies that prove to be less competitive in the future (at the expense of alternative investment opportunities not pursued), could lead to loss of sales of our products or services in the future due to the long product development cycles in our business. The amounts that we do invest in research and development efforts may not lead to the development of new technologies or products on a timely basis or meet the needs of our customers as fully as competitive offerings, and we may face impairment charges for contract fulfillment costs that are capitalized as nonrecurring engineering costs if we determine recovery of the costs is not probable (see Note 1).\n\nOur business is also subject to technological change and advances, such as growth in industrial automation and increased digitization of the operations, infrastructure and solutions that customers demand. In addition, our use of emerging and evolving technologies such as artificial intelligence and machine learning, which we expect to increase over time, presents business, reputational, legal and compliance risks related to data sourcing, design flaws, integration issues, security threats, privacy protections and the ability to develop sufficient protection measures. Artificial intelligence technologies have rapidly developed and our business may be adversely affected if we cannot successfully integrate these technologies into our business processes and product and service offerings in a timely, cost-effective, compliant and responsible manner. The introduction of innovative and disruptive technologies in the segments in which we operate also poses risks in the form of new competitors, market consolidation, substitutions of existing products, services or solutions, niche players, new business models and competitors that are faster to market with new or more cost-effective products or services. Existing and new competitors offer parts or services for our installed base, and if the customers that purchase our products and services select our competitors or we otherwise fail to maintain or renew service relationships, this can erode our revenue and profitability.\n\nGovernment programs and contracts - Our defense business is subject to risks from changes in government spending that can adversely affect our business strategy or financial performance, in addition to risks related to regulations and compliance with government contracts. Our defense business is heavily influenced by the spending and policy actions of the U.S. federal government, as well as allied governments that rely on U.S. suppliers to provide products and services important to their national defense. Changes in U.S. or other government defense spending, including as a result of potential changes in policy or budgetary positions or priorities, in connection with the recent U.S. elections or otherwise, can negatively impact the results and growth prospects of our defense business. U.S. defense spending levels are difficult to predict and may be impacted by numerous factors such as the evolving nature of the national security threat environment, U.S. national security strategy, U.S. foreign policy, the domestic political environment, macroeconomic conditions and the ability of the U.S. government to enact relevant legislation such as authorization and appropriations bills. Changes in government priorities and funding related to the future of combat, such as greater reliance on uncrewed aircraft systems, could also adversely affect the demand for our defense products and services. In addition, government customers often may modify, curtail or terminate their contracts and subcontracts with us either at their convenience or for default based on performance. The termination of one or more of our government contracts, or the occurrence of performance delays, cost overruns (due to inflation or otherwise), product failures, shortages in materials, components or labor, or other failures to perform to customer expectations and contract requirements could negatively impact our reputation, competitive position and financial results. In addition, our government contracts are subject to extensive procurement regulations, and new regulations or changes to existing requirements could increase our compliance costs. We are also subject to U.S. and other government inquiries and investigations, including periodic audits of our quality systems, manufacturing operations, and costs that we determine are allowable or reimbursable under government contracts. Failure to comply with provisions of our government contracts or other applicable laws and regulations could lead to civil or criminal enforcement under the U.S. False Claims Act or similar enforcement legislation, including potentially significant financial penalties, suspension or debarment against new business and reputational harm.\n\nClimate change - Our business and financial performance may be adversely affected by climate change impacts, including changes in regulations, customer demand, technologies and extreme weather. Our business may be impacted by climate change and governmental and industry actions taken in response, which present a variety of risks to our business and financial results. Changes in environmental and climate-related laws or regulations, including regulations on greenhouse gas emissions caps, carbon\n2024 FORM 10-K 27\n\npricing and taxes, energy taxes, product fuel efficiency standards, mandatory disclosure obligations, including U.S. government procurement-related contractual climate disclosures, could increase our operational and compliance expenditures and those of our customers and suppliers, including increased energy and raw materials costs and costs associated with manufacturing changes, and could require new or additional investments in product designs and facility upgrades. In addition, we face, along with others across the aerospace and defense sector, increasing demand for transitioning to lower emission technologies, including low to no carbon products and services, the use of alternative energy sources and other sustainable aviation technologies and climate adaptation products and services. Customers, regulators, institutional investors, the flying public and other stakeholders also continue to focus on environmental, social and governance issues, including our environmental sustainability practices and commitments with respect to our operations, products and suppliers. We anticipate that over time we will make additional investments in new technologies and capabilities and devote additional management and other resources in connection with these dynamics.\n\nThe achievement of aerospace and defense sector climate goals over the coming decades is likely to depend in part on technologies that are not yet developed, deployed or widely adopted today. For example, emissions reduction over time will likely require a combination of changes such as continued technological innovation in the fuel efficiency of engines, expanded use of low carbon fuels and the development of electric flight and hydrogen-based aviation technologies. The risk of insufficient availability, or higher cost, of low carbon fuels (such as sustainable aviation fuels or hydrogen) may compromise the pace and degree of emissions reduction. Our success in advancing climate objectives will depend in part on the actions of governments, regulators and other market participants to invest in infrastructure, create appropriate market incentives and to otherwise support the development of new technologies. The process of developing new high-technology products and enhancing existing products to mitigate climate change impacts is often complex, costly and uncertain, and we may pursue strategies or make investments that do not prove to be commercially successful in the time frames expected or at all. Moreover, we rely on our suppliers to adapt and meet our evolving technological supply needs, and they may be unable to fully respond to our requirements in a timely manner or at all. We also face risks as our competitors respond to advancing low-emissions technologies. Our competitors may develop these in-demand technologies before we do, their new technologies may be deemed by our customers to be superior to technologies we may develop, and their technologies may otherwise gain industry acceptance in advance of or instead of our products. In addition, as we and our competitors develop increasingly low-emissions technologies, demand for our older offerings may decrease or become nonexistent. Our reputation may also be damaged if we or others in our sector fail, or are perceived to fail, to achieve climate goals or commitments or to comply with evolving climate-related regulations. In addition, climate-related litigation and government investigations could be commenced against us, could be costly to defend and could adversely affect our business. Furthermore, our business, the businesses of our partners, suppliers, subcontractors, service providers, distributors and customers and our sector could be negatively impacted by increasing frequency and severity of acute extreme weather events caused by climate change, including hurricanes, tornadoes, floods, snow and ice storms, fires, heat waves and mud slides, and by chronic changes in weather patterns, such as temperature increases, drought and sea level rise. These events could damage our and our suppliers’ facilities, products and other assets, and cause disruptions to our business and operations, supply chain and distribution networks, and the businesses of our customers, and could require an increase in expenditures to improve climate resiliency of our operations. Any of the foregoing could materially decrease our revenue and materially increase our costs and expenses.\n\nInorganic investments - Our success in meeting strategic, operational and financial objectives can depend on our performance in evaluating and executing on acquisitions, integrations, dispositions, joint ventures and other inorganic investments. With respect to acquisitions and business integrations, dispositions, separations, joint ventures and other inorganic investments, we may not complete announced transactions on a timely basis or at all, including as a result of regulatory approvals, achieve expected returns, financial or operational synergies or other benefits on a timely basis or at all as a result of changes in strategy, integration challenges, investment risk or other factors. Acquisitions may require us to use more financial, operational and other resources on integration and implementation activities than we expect, and we may not be able to successfully integrate the businesses or assets acquired into our existing operations or realize the expected economic or operational benefits of the acquisition. Further, acquired businesses may present risks and unforeseen difficulties that can arise in integrating operations and systems and in retaining and assimilating employees. Declines in the value of equity interests or other assets that we sell can diminish the cash proceeds that we realize, and our ability and timing to sell can depend on market conditions, the liquidity of the relevant asset or other restrictions. We may dispose of businesses or assets at a price or on terms that are less favorable than we had anticipated, or with purchase price adjustments or the exclusion of assets or liabilities that must be divested, managed or run off separately. Dispositions or other business separations also often involve continued financial or operational involvement in the divested business, such as through continuing equity ownership, retained assets or liabilities, transition services agreements, commercial agreements, guarantees, indemnities or other current or contingent financial or operational obligations or liabilities. Under these arrangements, performance by the divested businesses or other conditions outside our control could materially affect our future financial results. Evaluating or executing on all types of potential or planned portfolio transactions can divert senior management time and resources from other pursuits. We also participate in a number of joint ventures with other companies or government enterprises in various markets around the world, including joint ventures where we have a lesser or minimal degree of control over the business operations, which expose us to additional operational, financial, reputational, legal or compliance risks. Furthermore, as our and our joint venture partners’ strategies change or general conditions involving a joint venture and its intended purposes evolve, we may not be able to exit or wind down any unfavorable joint ventures on acceptable terms, without financial or other concessions to our joint venture partners or at all.\n\nRecent spin-offs - The completed GE HealthCare and GE Vernova separations entail certain risks and potential liabilities, including the risk that one or both is determined to be a taxable transaction. The GE HealthCare and GE Vernova separations were effected through spin-offs that were intended to be tax-free for the Company and its shareholders for U.S. federal income tax purposes. If either of the GE HealthCare or GE Vernova separation transactions were ultimately determined to be taxable, the Company would incur a significant tax liability, and the distributions to the Company’s shareholders would become taxable and the new\n28 2024 FORM 10-K\n\nindependent companies might incur income tax liabilities. In addition, the Company may not achieve the anticipated benefits of the GE Vernova and GE HealthCare separations and may be exposed to additional risks, including potential liabilities pursuant to agreements entered into in connection with the spin-offs, the credit support provided to GE Vernova (see the Other Items – GE Vernova Parent Company Guarantees section within MD&A) and the various restructuring and business transformation actions that have brought changes across the Company’s organizational structure, senior leadership, functional alignment, outsourcing and other areas. Any of these risks could result in a material adverse effect on the Company’s business, reputation, results of operations, financial condition and cash flows.\n\nIntellectual property - Our intellectual property portfolio may not prevent others from independently developing products and services comparable or competitive to ours, and we may be negatively impacted by intellectual property enforcement or external dependencies. Our patents and other intellectual property may not prevent others from independently developing or selling products and services comparable or competitive to ours, and there can be no assurance that the resources invested by us to protect our intellectual property will be sufficient to adequately deter infringement, misappropriation or other improper use of our technology, particularly in certain markets outside the U.S. where strong intellectual property protection mechanisms are lacking. Trademark licenses of the GE brand in connection with dispositions, including in connection with the separations of GE HealthCare and GE Vernova into independent companies, may negatively impact the overall value of the brand in the future. We also face potential competition in countries where we have not invested in a patent portfolio. If we are not able to protect our intellectual property, the value of our brand and other intangible assets may be diminished, and our business may be adversely affected. We also face attempts, both internally from insider threats and externally from cyber-attacks, to gain unauthorized access to our IT systems or products for the purpose of improperly acquiring our trade secrets or confidential business information. In addition, we have observed an increase in the use of social engineering tactics by bad actors attempting to access systems storing certain of our trade secrets and other confidential business information. The theft or unauthorized use or publication of our trade secrets or other confidential business information as a result of such incidents could adversely affect our competitive position and the value of certain of our investments in research and development. In addition, we are subject to the enforcement of patents and other apparent intellectual property rights by third parties, including aggressive and opportunistic enforcement claims by non-practicing entities. Regardless of their merit, responding to such claims can be expensive and time-consuming. We also may be found to infringe third-party rights, which could result in us being enjoined from offering some of our products and services or bringing to market new products and services, and require us to pay substantial damages. The value of, or our ability to use, our intellectual property may also be negatively impacted by dependencies on third parties, such as our ability to obtain or renew on reasonable terms, or at all, licenses that we need in the future, or our ability to secure or retain ownership or rights to use data in certain software analytics or services offerings.\n\nOPERATIONAL RISKS. Operational risk relates to risks arising from systems, processes, people and external events that affect the operation of our business. It includes risks related to product safety, quality and performance; supply chain and business disruption; operational execution across product and service life cycles; and information management and data protection and security, including cybersecurity.\n\nProduct safety and quality - Our products and services are highly sophisticated and specialized, and a major failure or quality issue affecting our products or third-party products with which our products are integrated can adversely affect our business, reputation, financial position, results of operations and cash flows. We produce highly sophisticated products, including commercial and defense aircraft engines, integrated engine components and electric power and aircraft systems, and we provide specialized services for products that incorporate or use complex or leading-edge technology, including both hardware and software. Accordingly, the adverse impact of product quality issues can be significant. Actual or perceived design, production, performance, durability or other quality issues related to new product introductions or existing product lines can result in reputational harm to our business, in addition to the potential need for increased inspections and shop visits, and direct warranty, maintenance and other costs that may arise. In addition, a catastrophic product failure or similar event resulting in injuries or death, a fleet grounding or similar systemic consequences could have a material adverse effect on our business, reputation, financial position, cash flows and results of operations. Even when there have not been significant or widespread product failures in the field, many of our products and services must function under demanding operating conditions and meet exacting and evolving certification, performance, reliability and durability standards that we, our customers or regulators adopt. Developing and maintaining products that meet or exceed these standards can be costly and technologically challenging, and may also involve extensive coordination of suppliers and highly skilled labor from thousands of workers; a failure to deliver products and services that meet these standards could have significant adverse financial, competitive or reputational effects. Technical, mechanical and other failures occur from time to time, whether as a result of human factors, manufacturing or design defects, or operational process or production issues attributable to us, our customers, suppliers, third-party integrators or others.\n\nIn some circumstances we have also incurred, and in the future we may incur, increased costs, delayed payments or lost equipment or services revenue in connection with a significant issue with a third-party product with which our products are integrated, or if parts or other components that we incorporate in our products have defects or other quality issues. For example, a prolonged aircraft grounding, certification or production delays or other adverse developments with aircraft powered by our engines can pose risks to our business. There can be no assurance that the operational processes around sourcing, product design, manufacture, performance and servicing that we or our customers or other third parties have designed to meet rigorous regulatory and quality standards will be sufficient to prevent us or our customers or other third parties from experiencing operational process or product failures and other problems, including through human factors, manufacturing or design defects, process or other failures of contractors or third-party suppliers, cyber-attacks or other intentional acts, software vulnerabilities or malicious software, that could result in potential product, safety, quality, regulatory or environmental risks.\n\n2024 FORM 10-K 29\n\nSupply chain - Significant input shortages, supplier capacity constraints, supplier or customer production disruptions, supplier quality and sourcing issues or price increases have increased, and may continue to increase, our operating costs and can adversely impact the competitive positions of our products. Our reliance on third-party suppliers, partners, contract manufacturers and service providers and on commodity markets to secure raw materials, parts, components and sub-systems used in our products exposes us to volatility in the prices and availability of these materials, parts, components, systems and services. As our supply chains are complex and extend into many different countries and regions around the world, we are also subject to global economic and geopolitical dynamics and risks associated with exporting components manufactured in particular countries for incorporation into finished products completed in other countries. We operate in a supply-constrained environment and are facing, and may continue to face, supply-chain shortages, inflationary pressures, shortages of skilled labor, transportation and logistics challenges and manufacturing disruptions that impact our revenue, profitability and timeliness in fulfilling customer orders. We anticipate supply chain pressures across our business will continue to challenge and adversely affect our operations and financial performance for some period of time. For example, successfully executing the significant production and delivery ramp efforts in connection with the growth of newer engine platforms such as the LEAP depends in part on our suppliers having access to the materials, skilled labor and production capacity they require and making timely deliveries to us, as well as meeting the required safety, quality and performance standards for commercial and military aviation. In addition, some of our suppliers or their sub-suppliers are limited- or sole-source suppliers, and our ability to meet our obligations to customers depends on the performance, product quality, continued product availability and stability of such suppliers. We also have dependencies on certain key internal manufacturing or other facilities. Disruptions in deliveries, capacity constraints, production disruptions up- or down-stream, price increases, or decreased availability of raw materials or commodities, including as a result of war, natural disasters (including the effects of climate change such as sea level rise, drought, flooding, wildfires and more intense weather events), actual or threatened public health pandemics or emergencies, governmental, legislative or regulatory actions, or other business continuity events, adversely affect our operations and, depending on the length and severity of the disruption, can limit our ability to meet our commitments to customers or significantly impact our operating profit or cash flows. Further, a prolonged disruption at a significant supplier or discontinuation of an important material, part, component or system can require us to identify and qualify a new supplier or develop other manufacturing or production alternatives; this can require substantial time to implement, particularly if it involves new regulatory certifications, and can lead to costs or delays that adversely impact our production timelines, fulfillment of customer contracts, revenue, profitability, cash flows and reputation. Quality, capability, compliance and sourcing issues experienced by third-party providers can also adversely affect our costs, profitability and the quality and effectiveness of our products and services and result in liability and reputational harm. The harm to us could be significant if, for example, a quality issue at a supplier or with components that we integrate into our products results in a widespread quality issue across one of our product lines or our installed base of equipment. In addition, our suppliers may experience cyber-related attacks, which could negatively impact their ability to meet their delivery obligations to us and in turn have an adverse effect on our ability to meet our commitments to customers.\n\nOperational execution - Operational challenges could have a material adverse effect on our business, reputation, financial position, results of operations and cash flows. Our financial results depend on the successful execution of our business plans and commercial arrangements across all steps of the product and service life cycle. We seek to improve our operations and execution on an ongoing basis, and our ability to make the desired improvements is an important factor in our profitability and overall financial performance. For example, we often enter into long-term service agreements in connection with significant contracts for the sale of our products and services (see Note 1). In connection with these agreements, we must accurately estimate our costs associated with delivering the products, product durability and reliability, and the provision of services over time in order to be competitive and profitable and to generate acceptable returns on our investments. A failure to appropriately estimate, plan for or execute our business plans may adversely affect our delivery of products and services in line with our projected financial performance or cost estimates, and ultimately may result in excess costs, build-up of inventory that becomes obsolete, lower profit margins and an erosion of our competitive position. We also face operational risks in connection with launching or ramping newer product platforms, such as the LEAP or GE9X engines. Particularly with newer product platforms and technologies, we seek to reduce the costs of these products over time through experience and other measures, including the introduction of new designs, technologies, manufacturing methods and suppliers. Risks related to engineering, our supply chain, the availability of skilled labor, product quality, product durability, the cost of producing complex materials or components, regulatory approvals, timely delivery or other aspects of operational execution can adversely affect our ability to achieve those cost reductions and to meet contract obligations and customers’ expectations, as well as our business plan objectives. A strike or other labor disruption could also adversely affect our production, delivery, financial performance and reputation, and we are due in 2025 to renegotiate expiring labor union contracts. In addition, many of our customer contracts are complex and contain provisions that could cause us to incur penalties, be liable for liquidated or actual damages and incur unanticipated expenses with respect to the timely delivery, functionality, deployment, operation and durability of our products, solutions and services. Operational failures that result in product safety or quality problems or potential environmental, health or other risks could have a material adverse effect on our business, reputation, financial position, cash flows and results of operations.\n\nCybersecurity - Increased cybersecurity requirements, vulnerabilities, threats and more sophisticated and targeted attacks, as well as failures, pose risk to our and many critical third parties' systems, networks, products, solutions, services and data. Increased global cybersecurity requirements, vulnerabilities, threats, computer viruses and more sophisticated and targeted cyber-related attacks such as ransomware, as well as cybersecurity failures resulting from human or technological errors, pose risk to the security of our and our customers', partners', suppliers' and third-party service providers' infrastructure, products, systems and networks and the confidentiality, availability and integrity of GE Aerospace and customers' data, as well as associated financial and reputational risks. The perpetrators of such attacks include sophisticated malicious actors, including states and state-affiliated actors targeting critical infrastructure. The risks in this area continue to grow, and we expect cyberattacks will continue to accelerate on a global basis in frequency and impact as threat actors increasingly use artificial intelligence and other techniques to circumvent security controls, evade detection and remove forensic evidence. As a result, there can be no assurance that our cybersecurity risk management processes,\n30 2024 FORM 10-K\n\nincluding our policies and controls, will be effective in promptly or effectively detecting, containing or remediating cybersecurity attacks, which may result in material harm to our systems, information or business.\n\nWe have experienced, and expect to continue to experience, cyberattacks of varying degrees of sophistication and various cybersecurity incidents, such as distributed denial of service attacks and phishing attacks. It may take considerable time for us to investigate and evaluate the full impact of incidents, particularly for sophisticated attacks. This may inhibit our ability to provide prompt, full and reliable information about the incident to our customers, suppliers, regulators and the public. A significant cyber-related attack against us, a key third-party system or a network that we use, or in our sector, such as an attack on commercial aircraft (even if such an attack does not involve our products, services or systems), could adversely affect our business. The large number of suppliers that we work with requires significant effort for the initial and ongoing verification of the effective implementation of cybersecurity requirements by suppliers. The increasing degree of interconnectedness that we have with our partners, suppliers and customers also poses a risk to the security of our network as well as the larger ecosystem in which we operate. Our risk mitigation efforts may fail to prevent, detect and limit the impact of cyber-related attacks, and we remain vulnerable to known and unknown cybersecurity threats.\n\nThe continued adoption of new technologies across our business and by our suppliers, including emerging technologies, system migrations and network transitions, also increases our exposure to cybersecurity threats. Any unknown vulnerability or compromise in our or a third-party product (for example, open source software) exposes our systems, networks, software or connected products to malicious actors that seek to misuse our products, steal intellectual property, misappropriate sensitive, confidential or personal data, or create safety risks or unavailability of equipment. In addition, given the nature of complex systems, software and services like ours, and the scanning tools that we deploy in relation to our networks, infrastructure and products, we regularly identify and track security vulnerabilities. We are not always able to comprehensively apply patches or mitigating measures or ensure that patches are applied before vulnerabilities can be exploited. We also have access to sensitive, classified, confidential or personal data or information that is subject to privacy and security laws, regulations or customer-imposed controls. We are vulnerable to security breaches, theft, misplaced, lost or corrupted data, programming errors and misconfigurations, employee errors (including as a result of social engineering/phishing) and/or malfeasance (including misappropriation by insiders or departing employees) that may compromise sensitive, classified, confidential or personal data or information, improper use of our systems, software solutions or networks, unauthorized access, use, disclosure, modification or destruction of or denial of access to information, defective products, production downtimes and operational disruptions. In addition, a cybersecurity incident that impacts our partners, suppliers or customers could compromise our systems and impact our intellectual property, personal data or other confidential information, or result in production downtimes and operational disruptions that could cause us to breach our commitments to customers. Any security vulnerability or malicious software in a product used by a partner or supplier to deliver a service or embedded in a product that is later integrated into a GE Aerospace product could lead to a vulnerability in the security of GE Aerospace’s product or, if used internally in our network environment, to a compromise of the GE Aerospace network, which may lead to the loss of information or operational disruptions.\nCybersecurity-related and data privacy and protection laws and regulatory regimes are evolving, can vary significantly by country and present increasing compliance challenges, and we from time to time receive, and in the future will likely receive, regulatory inquiries about specific incidents or aspects of our cybersecurity framework; these dynamics increase our costs, affect our competitiveness and can expose us to fines or other penalties and reputational risks. In addition, cybersecurity incidents can result in other negative consequences, regardless of whether the direct effects of an incident are significant, including damage to our reputation or competitiveness, restoration and remediation costs, increased digital infrastructure or related costs that are not covered by insurance, and costs or fines arising from litigation or regulatory investigations or actions. While we carry cyber insurance, we cannot be certain that our coverage will be adequate for liabilities actually incurred, that insurance will continue to be available to us on economically reasonable terms, or at all, or that any insurer will not deny coverage as to any future claim.\n\nFINANCIAL RISKS. Financial risk relates to our ability to meet financial goals and obligations and mitigate exposure to broad market risks. In addition to the risks to financial performance that most of the items described throughout our risk factors pose, financial risks include credit risk; funding and liquidity risks; and volatility in foreign currency exchange rates, interest rates and commodity prices. We also face financial risks associated with our run-off insurance and banking operations. Credit risk is the risk of financial loss arising from a customer or counterparty failure to meet its contractual obligations. Liquidity risk refers to the potential inability to meet contractual or contingent financial obligations (whether on- or off-balance sheet) as they arise, and could potentially impact our financial condition, cash flow or overall safety and soundness.\n\nCustomers and counterparties - Global economic, industry-specific or other developments that weaken the financial condition, soundness or continuity of significant customers, governments, government programs or other parties we deal with can adversely affect our business, results of operations and cash flows. Our business and operating results have been, and will continue to be, affected by worldwide economic conditions, including conditions in the aerospace and defense sector. Activity in our sector is also particularly influenced by the actions of a small group of large original equipment manufacturers, as well as large airlines in various geographies. We have significant business with, and credit exposure to, some of our largest customers and accordingly our performance can be adversely affected by challenges that individual customers or the industry faces related to factors such as competition, regulatory oversight and certifications, the need for cost reduction, financial stability and soundness, supply chain or labor shortages or disruptions, the cost of jet fuel, the availability of aircraft leasing and financing alternatives, interest rates, the retirement of older aircraft and other dynamics affecting the original equipment and aftermarket service markets, or by a significant disruption of air travel demand. Further, changes in the relative value of various national currencies (especially the reduction in the valuation of a home currency against the value of currencies used to purchase and maintain aircraft and aircraft engines) may impact our customers and other industry participants. Existing or potential customers may delay or cancel plans to purchase our products and services and may not be able to fulfill their obligations to us in a timely fashion or at all as a result of business deterioration, cash flow shortages or difficulty obtaining funding or due to macroeconomic conditions, geopolitical disruptions, changes in law or other challenges that they\n2024 FORM 10-K 31\n\nface. The airline industry has historically been highly cyclical, and sustained economic growth and political stability in both developed and emerging markets are principal factors underlying long-term air traffic growth; the current macroeconomic and geopolitical environment and the potential for recession or armed conflict pose risks to the rate of that growth. A potential future disruption in connection with a terrorist incident, war, cyberattack, actual or threatened public health pandemic or emergency or recessionary economic environment that results in the loss of business and leisure traffic could also adversely affect our customers, their ability to fulfill their obligations to us in a timely fashion or at all, demand for our products and services and the viability of a customer’s business. (See also Risk Factors - Commercial aviation sector.) In addition, our customers include governmental entities within and outside the U.S., including the U.S. federal government. Sustained and increased funding from government customers supports research, new product development, production and aftermarket business for our defense business, and a variety of domestic and international political, macroeconomic and geopolitical factors, including recession, can materially affect our customers’ ability to secure budget support and fund these activities year after year. We also at times face greater challenges collecting on receivables with customers that are sovereign governments or located in emerging markets. If there is significant deterioration in the global economy, in our sector, in financial markets or with particular significant counterparties, our results of operations, financial position and cash flows could be materially adversely affected.\n\nRun-off insurance and banking operations - We continue to have exposure to our run-off insurance operations and Bank BPH mortgage portfolio in Poland. While in recent years we have greatly reduced the scope of GE's former financial services operations, we continue to retain significant exposure to legacy insurance and other financial services operations that will run off over a long period of time and, in the event of future adverse developments, could cause funding or liquidity stress. For example, it is possible that results of our statutory testing of insurance reserves in future years will require additional capital contributions to our insurance subsidiaries, even after the capital contribution made in the first quarter of 2024 that completed the contributions in connection with the statutory permitted practice approved in 2018 by the Kansas Insurance Department (KID). Our statutory testing of insurance reserves is subject to a variety of assumptions, including assumptions about the discount rate (which is sensitive to changes in market interest rates), morbidity, mortality and future long-term care premium increases. Future adverse changes to these assumptions (to the extent not offset by any favorable changes to these assumptions) could result in an increase to future policy benefit reserves and, potentially, to the amount of capital we are required to contribute to our insurance subsidiaries (as discussed in the Other Items - Insurance section within the MD&A). In addition, we have exposure to various financial counterparties that pose credit and other risks in the event of insolvency or other default. For example, a portion of our run-off insurance operations’ assets are held in trust accounts associated with reinsurance contracts. For our UFLIC subsidiary, such trust assets are currently held in trusts for the benefit of insurance company subsidiaries of Genworth, which has stated in the past that it will not bolster the capital position of its insurance subsidiaries. Solvency or other concerns about Genworth or its insurance company subsidiaries may cause those subsidiaries or their regulators to take or attempt to take actions that could adversely affect UFLIC, including control over assets in the relevant trusts. It is also possible that additional contingent liabilities and loss estimates for Bank BPH, in connection with the ongoing litigation in Poland related to its portfolio of residential mortgage loans denominated in or indexed to foreign currencies (see Note 24), will need to be recognized (or loss estimates may increase in the future) and will require additional capital contributions. Regulatory requirements and agreements with respect to our run-off insurance operations and Bank BPH require us to maintain adequate levels of capital and could require additional infusion of capital if the required levels are not maintained. Though we may consider strategic options to accelerate the further reduction in the size of these remaining financial services operations, such options may not be viable or attractive because of the associated cash payments, financial charges or other adverse effects. There can be no assurance that future liabilities, losses or impairments to the carrying value of assets within our financial services operations would not materially and adversely affect our business, financial position, cash flows or results of operations.\n\nBorrowings & liquidity - We may face risks related to the refinancing of our debt, particularly in severely adverse market conditions, and future credit downgrades could adversely affect our liquidity, funding costs and related margins. We intend to maintain a sustainable investment-grade long-term credit rating, but there can be no assurance that we will not face future credit rating downgrades as a result of factors such as a change in business strategy or performance, or changes in rating application or methodology. Future downgrades could adversely affect our cost of funds, liquidity and competitive position, and external conditions in the financial and credit markets may limit our availability to refinance our debt at particular times or on commercially reasonable terms. In addition, if we are unable to generate cash flows in accordance with our plans or face unforeseen needs for capital, we may adopt changes to our capital allocation plans (such as plans related to the timing or amounts of investments or capital expenditures, share repurchases or dividends) or take other actions. Further, our pension and other post-retirement benefit obligations are exposed to economic factors, such as changes in interest rates, investment performance of plan assets, and health care costs, which could adversely impact our leverage and liquidity. For additional discussion about our credit ratings, financial conditions and related considerations, refer to the Capital Resources and Liquidity section within MD&A. For discussion regarding how our financial statements have been and can be affected by our pension and healthcare benefit obligations, see Note 13.\n\nLEGAL AND COMPLIANCE RISKS. Legal and compliance risk relates to risks arising from the government and regulatory environment, legal proceedings and compliance with integrity policies and procedures, including matters relating to financial reporting and the environment, health and safety. Government and regulatory risk includes the risk that government or regulatory actions will impose additional cost on us or require us to make adverse changes to our business models or practices.\n\nRegulatory - We are subject to a wide variety of laws, regulations and government policies that require ongoing compliance efforts and may change in significant ways. Our business is subject to regulation under a wide variety of U.S. federal and state and non-U.S. laws, regulations and policies that require ongoing compliance efforts. There can be no assurance that laws, regulations and policies will not be changed or interpreted or enforced in ways that will require us to modify our business models and objectives or affect our returns on investments by restricting existing activities and products, subjecting them to escalating costs or prohibiting them\n32 2024 FORM 10-K\n\noutright. In particular, recent trends globally toward increased protectionism, import and export controls, required licenses or authorizations to engage in business with certain countries or entities, the use of tariffs, restrictions on outbound investment and other trade barriers can result in actions by governments around the world that have been and may continue to be disruptive and costly to our business, and can interfere with our global operating model and weaken our competitive position. In addition, changes in environmental and climate change laws, regulations or policies (including emissions pricing and taxes, emissions standards or sustainable finance, among others) affecting the aerospace and defense sector could lead to additional costs or compliance requirements, a need for additional investment in product designs, require carbon offset investments or otherwise negatively impact our business or competitive position. Other legislative and regulatory areas of significance for our business that U.S. and non-U.S. governments have focused and continue to focus on include cybersecurity, data privacy and sovereignty, artificial intelligence, anti-corruption, competition law, public procurement law, compliance with complex trade controls and economic sanctions laws, technical regulations or local content requirements that could result in market access criteria that our products cannot or do not meet, restrictions related to per- and polyfluoroalkyl substances (PFAS), foreign exchange intervention in response to currency volatility and currency controls that could restrict the movement of liquidity from particular jurisdictions. Potential changes to tax laws, including changes to taxation of global income, may have an effect on our subsidiaries’ structure, operations, sales, liquidity, cash flows, capital requirements, effective tax rate and performance. For example, legislative or regulatory measures by U.S. federal, state or non-U.S. governments, or rules, interpretations or audits under new or existing tax laws such as global minimum taxes or other changes to the treatment of global income, could increase our cash tax costs and effective tax rate. Regulation or government scrutiny may impact the requirements for marketing our products and slow our ability to introduce new products, resulting in an adverse impact on our business. Furthermore, we make sales to U.S. and non-U.S. governments and other public sector customers, and we participate in various governmental financing programs, that require us to comply with strict governmental regulations. As a U.S. government contractor, we are also subject to risks relating to U.S. government audits and investigations that in the past have led, and in the future may lead, to cash withholds, fines, damages or other penalties under civil or criminal laws. Inability to comply with applicable regulations could adversely affect our status with government customers or our ability to participate in projects and could have collateral consequences such as suspension or debarment. Suspension or debarment, depending on the entity involved and length of time, can limit our ability to bid for new U.S. government contracts or business with other government-related customers, and this could adversely affect our results of operations, financial position and cash flows.\n\nLegal proceedings - We are subject to a variety of legal proceedings, disputes, investigations and legal compliance risks, including contingent liabilities from businesses that we have exited or are inactive. We are subject to a variety of legal proceedings, commercial disputes, legal compliance risks and environmental, health and safety compliance risks in virtually every part of the world. We, our representatives and our industry are subject to continuing scrutiny by regulators, other governmental authorities and private sector entities or individuals in the U.S., the European Union and other jurisdictions, which have led or may, in certain circumstances, lead to enforcement actions, adverse changes to our business practices, fines and penalties, required remedial actions such as contaminated site clean-up or other environmental claims, or the assertion of private litigation claims and damages that could be material. For example, we remain subject to shareholder lawsuits related to the Company’s financial performance, accounting and disclosure practices and related legacy matters from several years ago. These types of proceedings involving claims about past financial performance and reporting, as well as any future claims that may arise about past or current misconduct, even if unfounded, may have a significant impact on our reputation and how we are viewed by investors, customers and others. We also from time to time are involved in commercial discussions, disputes or proceedings in which, given the nature of our business that often involves large equipment and service orders and long-term commercial relationships, the claims asserted can be for significant amounts. The estimation of legal reserves or possible losses involves significant judgment and may not reflect the full range of uncertainties and unpredictable outcomes inherent in litigation, disputes and investigations, and the actual losses arising from particular matters may exceed our current estimates and adversely affect our financial results. The risk management and compliance programs we have adopted and related actions that we take may not fully mitigate legal and compliance risks that we face, particularly in light of the global and diverse nature of our operations and the current enforcement environments in many jurisdictions. For example, when we investigate potential noncompliance under U.S. and non-U.S. law involving our employees, partners or third parties we work with, in some circumstances we make self-disclosures about our findings to the relevant authorities who may pursue or decline to pursue enforcement proceedings against us in connection with those matters. We are also subject to material trailing legal liabilities from businesses that we have exited or are inactive. We also expect that additional legal proceedings and other contingencies will arise from time to time. Moreover, we sell products and services in growth markets where claims arising from alleged violations of law, product failures or other incidents involving our products and services are adjudicated within legal systems that are less developed and less reliable than those of the U.S. or other more developed markets, and this can create additional uncertainty about the outcome of proceedings before courts or other governmental bodies in those markets. See Note 24 for further information about legal proceedings and other loss contingencies.\n\nLEGAL PROCEEDINGS. Refer to Legal Matters and Environmental, Health and Safety Matters in Note 24 to the consolidated financial statements for further information relating to our legal matters.\n"
  }
}