{
  "ticker": "GEHC",
  "cik": "0001932393",
  "company_name": "GE HealthCare Technologies Inc.",
  "filing_date": "2025-02-13",
  "accession": "0001932393-25-000005",
  "primary_doc": "gehc-20241231.htm",
  "item_sections": {
    "item1": "Item 1, “Business” and Note 4, “Segment and Geographical Information.”\nTRENDS AND FACTORS IMPACTING OUR PERFORMANCE\nWe believe that our performance and future success depend on a number of factors that present significant opportunities for us but also pose risks and challenges, including those discussed below and particularly in",
    "item1a": "Item 1A,\n \n“Risk Factors.”\nKEY TRENDS AFFECTING RESULTS OF OPERATIONS.\nRussia and Ukraine Conflict\nWe had $162 million and $153 million of assets in, or directly related to, Russia and Ukraine as of December 31, 2024 and December 31, 2023, respectively, none of which are subject to sanctions that impact the carrying value of the assets. We generated revenues of $363 million, $340 million, and $395 million from customers in these two countries for the years ended December 31, 2024, 2023, and 2022, respectively. The potential inability to repatriate earnings from these two countries will not have a material impact on our ability to operate.\nWe continue to monitor the effects of Russia’s invasion of Ukraine, including the consideration of financial impact, cybersecurity risks, the applicability and effect of sanctions, and the employee base in Ukraine and Russia. Under the current U.S. Department of Commerce regulations, we are permitted to export, re-export, or transfer medical equipment and spare parts that meet stated criteria under a License Exception, which has eliminated the need for us to obtain individual U.S. licenses in most cases; however, licenses still may be needed for some transactions. The European Union and other countries have also expanded licensing requirements for certain spare parts, services, software, and other items. We will continue to apply for licenses to supply to these customers and to support our business in Russia, as required. The implementation of these measures affected our ability to supply customers in Russia during the years ended December 31, 2024 and 2023 and will continue to do so as we confirm applicability of the U.S. License Exception to our transactions and continue to obtain licenses. There is no guarantee we will obtain all of the licenses for which we applied, that any approvals we obtain will be on a timely basis, or that our business in Russia will not be further disrupted due to evolving legal or operational considerations. The Board, together with management, will continue to assess whether developments related to the conflict have had, or are reasonably likely to have, a material impact on the Company.\n39\nChina Market\nWe continue to monitor developments in the market in China. In March 2024, the government in China announced a new stimulus program (“2024 stimulus”) that includes the healthcare sector and is being implemented through China’s provinces. In addition, an anti-corruption campaign directed at the healthcare sector remains ongoing. Both of these factors contributed to delayed orders and sales in our China business throughout 2024. We expect the 2024 stimulus program will result in opportunities for our business in China in the longer term, but it has had a short-term impact as provinces develop and announce their plans and customers begin to make purchasing decisions. We expect the effects of the delay in the 2024 stimulus and the anti-corruption campaign to continue to impact our orders and sales in the near term, although we are unable to predict the exact duration or magnitude of the impact. We expect both of these impacts to be temporary, and we believe the focus of government policy in China on expanding access to healthcare will benefit our business in China in the long term.\nTariffs\nIn February 2025, the United States imposed additional tariffs on products from China. These tariffs, and any future tariffs, including on products from Mexico or Canada, by the United States or other countries, will likely result in additional costs to us. The impact of tariffs will depend on various factors including the timing, amount, scope, and nature of the tariffs, and any mitigating actions we implement.\nTax Valuation Allowances\nDeferred income tax assets represent amounts available to reduce income taxes payable on taxable income in future years. We evaluate the recoverability of these future tax deductions and credits by evaluating all available positive and negative evidence. We have a valuation allowance against certain U.S. and foreign deferred tax assets and will release the valuation allowance when there is sufficient positive evidence to support a conclusion that it is more likely than not the deferred tax assets will be realized. For additional information regarding our income taxes, see Note 11, “Income Taxes.”\nSeasonality\nOur revenues and operating profits vary from quarter to quarter. Financial results in the fourth quarter have historically been higher than in other quarters due to the spending patterns of our customers. \nOPERATION AS A STAND-ALONE COMPANY. \nFinancial Presentation Under GE Ownership\nGE HealthCare utilized allocations and carve-out methodologies through the date of the Spin-Off to prepare historical combined financial statements. The combined financial statements herein for periods prior to the Spin-Off may not be indicative of our future performance, do not necessarily include the actual expenses that would have been incurred by us, and may not reflect our results of operations, financial position, and cash flows had we been a separate, stand-alone company during the historical periods presented. For additional information, see Note 1, “Organization and Basis of Presentation.”\nStand-Alone Company Expenses \nAs a result of the Spin-Off, we are subject to federal and state securities laws and stock exchange requirements. We have established additional procedures and practices as a stand-alone public company. As a result, we have and will continue to incur additional costs related to external reporting, internal audit, treasury, investor relations, Board of \nDirectors and officers, and stock administration. \nCompensation \nWe have instituted competitive compensation policies and programs as an independent public company. The expense for these policies and programs increased from the compensation expense allocated by GE in years prior to the Spin-Off, driven primarily by higher cash and stock compensation to retain employees and align more closely with industry peers.\nSUMMARY OF KEY PERFORMANCE MEASURES\nManagement reviews and analyzes several key performance measures including Total revenues, Operating income, Net income attributable to GE HealthCare, Earnings per share, and Cash from (used for) operating activities. Management also reviews and analyzes Organic revenue*, Adjusted earnings before interest and taxes* (“Adjusted EBIT*”), Adjusted net income*, Adjusted tax expense*, Adjusted effective tax rate* (“Adjusted ETR*”), Adjusted earnings per share*, and Free cash flow*, which are non-GAAP financial measures. These measures are reviewed and analyzed in order to evaluate our business performance, identify trends affecting our business, allocate capital, and make strategic decisions, including those discussed below. See “Results of Operations” and “Liquidity and Capital Resources” below for further discussion on our key performance measures.\nThe non-GAAP financial measures should be considered along with the most directly comparable U.S. GAAP financial measures. Definitions of these non-GAAP financial measures, a discussion of why we believe they are useful to management and investors as well as certain of their limitations, and reconciliations to their most directly comparable U.S. GAAP financial measures are provided below under “Non-GAAP Financial Measures.”\n____________________\n*Non-GAAP Financial Measure\n40\nRESULTS OF OPERATIONS\nThe following tables set forth our results of operations for each of the periods presented.\nConsolidated and Combined Statements of Income\nFor the years ended December 31\n2024\n2023\n2022\nSales of products\n$\n13,075\n$\n13,127\n$\n12,044\nSales of services\n6,597\n6,425\n6,297\nTotal revenues\n19,672\n19,552\n18,341\nCost of products\n8,271\n8,465\n7,975\nCost of services\n3,196\n3,165\n3,187\nGross profit\n8,205\n7,922\n7,179\nSelling, general, and administrative\n4,269\n4,282\n3,631\nResearch and development\n1,311\n1,205\n1,026\nTotal operating expenses\n5,580\n5,487\n4,657\nOperating income\n2,625\n2,435\n2,522\nInterest and other financial charges – net\n504\n542\n77\nNon-operating benefit (income) costs\n(406)\n(382)\n(5)\nOther (income) expense – net\n(55)\n(86)\n(62)\nIncome from continuing operations before income taxes\n2,581\n2,361\n2,512\nBenefit (provision) for income taxes\n(531)\n(743)\n(563)\nNet income from continuing operations\n2,050\n1,618\n1,949\nIncome (loss) from discontinued operations, net of taxes\n—\n(4)\n18\nNet income\n2,050\n1,614\n1,967\nNet (income) loss attributable to noncontrolling interests\n(57)\n(46)\n(51)\nNet income attributable to GE HealthCare\n$\n1,993\n$\n1,568\n$\n1,916\nTOTAL REVENUES.\nRevenues by Segment\nFor the years ended December 31\n2024\n2023\n2022\n2024 vs. 2023\n % change\n2023 vs. 2022\n % change\n2024 vs. 2023\n % organic*\n change\n2023 vs. 2022\n % organic*\n change\nSegment revenues\nImaging\n    \n$\n8,855\n$\n8,944\n$\n8,395\n(1)%\n7%\n(1)%\n8%\nAVS\n    \n5,131\n5,094\n5,012\n1%\n2%\n1%\n3%\nPCS\n    \n3,125\n3,142\n2,916\n(1)%\n8%\n—%\n8%\nPDx\n    \n2,508\n2,306\n1,958\n9%\n18%\n9%\n18%\nOther\n(1)\n     \n52\n66\n60\nTotal revenues\n    \n$\n19,672\n$\n19,552\n$\n18,341\n1%\n7%\n1%\n8%\n(1) Financial information not presented within the reportable segments, shown within the Other category, represents HealthCare Financial Services which does not meet the definition of an operating segment.\nRevenues by Region\nFor the years ended December 31\n2024\n2023\n2022\n2024 vs. 2023\n % change\n2023 vs. 2022\n % change\nUnited States and Canada (“USCAN”)\n    \n$\n8,981\n$\n8,551\n$\n8,130\n5%\n5%\nEurope, the Middle East, and Africa (“EMEA”)\n    \n5,051\n5,058\n4,684\n—%\n8%\nChina region\n    \n2,360\n2,785\n2,531\n(15)%\n10%\nRest of World\n    \n3,280\n3,158\n2,996\n4%\n5%\nTotal revenues\n    \n$\n19,672\n$\n19,552\n$\n18,341\n1%\n7%\n____________________\n*Non-GAAP Financial Measure\n41\nFor the year ended December 31, 2024\nTotal revenues were $19,672 million\n, \ngrowing 1% or $120 million\n. The reported growth was largely due to Sales of services increasing \n3%\n or $\n172\n million primarily driven by increased pricing.\nThe segment revenues were as follows:\n•\nImaging segment revenues were $8,855 million, decreasing 1% or $89 million, following high single-digit revenue growth in the prior year, with current year impacts from lower sales volume in China and unfavorable foreign currency impacts;\n•\nAVS segment revenues were $5,131 million, growing 1% or $37 million with an increase in sales volume in USCAN partially offset by lower sales volume in China and unfavorable foreign currency impacts;\n•\nPCS segment revenues were $3,125 million, decreasing 1% or $17 million primarily due to decreased volume in the Monitoring Solutions product line following growth in the prior year and unfavorable foreign currency impacts, partially offset by increased volume in the Maternal Infant Care product line; and\n•\nPDx segment revenues were $2,508 million, growing 9% or $202 million with growth in the USCAN and EMEA regions driven by growth in volume, an increase in price, and new product introductions.\nThe regional revenues were as follows:\n•\nUSCAN revenues were $8,981 million, growing 5% or $430 million with growth across all segment revenues;\n•\nEMEA revenues were $5,051 million, flat to the prior year, following high single-digit growth in the prior year, with growth in PDx revenues largely offset by decreases in Imaging and PCS revenues;\n•\nChina region revenues were $2,360 million, decreasing 15% or $425 million with declines in all segment revenues following double-digit growth in the prior year due to the impact from the 2022 COVID stimulus programs, and current year sales impacted by the delayed 2024 stimulus and the ongoing anti-corruption campaign; and\n•\nRest of World revenues were $3,280 million, growing 4% or $122 million with growth in all segment revenues, partially offset by unfavorable foreign currency impacts.\nFor the year ended December 31, 2023\nTotal revenues were $19,552 million\n, growing 7% or $1,211 million as reported and 8% organically*. The reported growth was primarily due to Sales of products growing 9% or $1,083 million as reported, with growth across all segments.\nThe segment revenues were as follows:\n•\nImaging segment revenues were $8,944 million, growing 7% or $549 million as reported due to an increase in Organic revenue*, partially offset by unfavorable foreign currency impacts. Organic revenue* grew 8% primarily due to growth in Magnetic Resonance and MI/CT product lines, due to supply chain fulfillment improvements, new product introductions, and an increase in price;\n•\nAVS segment revenues were $5,094 million, growing 2% or $82 million as reported due to an increase in Organic revenue*, partially offset by unfavorable foreign currency impacts. Organic revenue* grew 3% primarily due to growth in the CardioVascular and Interventional Solutions product line due to new product introductions, an increase in price, and supply chain fulfillment improvements;\n•\nPCS segment revenues were $3,142 million, growing 8% or $226 million due to growth in Monitoring Solutions and Consumables and Services product lines driven by an increase in price and operational improvements; and\n•\nPDx segment revenues were $2,306 million, growing 18% or $348 million with growth across all regions due to an increase in price and improved demand.\nThe regional revenues were as follows:\n•\nUSCAN revenues were $8,551 million, growing 5% or $421 million due to growth in PCS, PDX, and Imaging revenues;\n•\nEMEA revenues were $5,058 million, growing 8% or $374 million due to growth in Imaging and PDx revenues;\n•\nChina region revenues were $2,785 million, growing 10% or $254 million due to growth across all segment revenues, partially offset by unfavorable foreign currency impacts; and\n•\nRest of World revenues were $3,158 million, growing 5% or $162 million due to growth in PDx, Imaging, and AVS revenues, partially offset by unfavorable foreign currency impacts.\n____________________\n*Non-GAAP Financial Measure\n42\nOPERATING INCOME, NET INCOME ATTRIBUTABLE TO GE HEALTHCARE, ADJUSTED EBIT*, AND ADJUSTED NET INCOME*.\nFor the years ended December 31\n2024\n% of Total revenues\n2023\n% of Total revenues\n2022\n% of Total revenues\n2024 vs. 2023\n % change\n2023 vs. 2022\n % change\nOperating income\n    \n$\n2,625\n13.3%\n$\n2,435\n12.5%\n$\n2,522\n13.8%\n8%\n(3)%\nNet income attributable to GE HealthCare\n1,993\n10.1%\n1,568\n8.0%\n1,916\n10.4%\n27%\n(18)%\nAdjusted EBIT*\n3,211\n16.3%\n2,956\n15.1%\n2,861\n15.6%\n9%\n3%\nAdjusted net income*\n2,060\n10.5%\n1,797\n9.2%\n2,103\n11.5%\n15%\n(15)%\nFor the year ended December 31, 2024\nOperating income was $2,625 million, an increase of $190 million and 90 basis points as a percent of Total revenues. The increase was due to the following factors: \n•\nGross profit increased $283 million or 120 basis points as a percent of Total revenues primarily due to a reduction in Cost of products sold. Cost of products sold decreased $194 million or 120 basis points as a percent of Sales of products. The decrease as a percent of sales was driven by cost productivity, favorable mix within our product offerings, and an increase in pricing of our products, partially offset by cost inflation. Cost of services sold increased $31 million but decreased 80 basis points as a percent of Sales of services. The decrease as a percent of sales was driven by cost productivity and an increase in pricing of our service offerings, partially offset by cost inflation. Included in our total cost of revenue as part of our product investment was $405 million in engineering costs for design follow-through on new product introductions and product lifecycle maintenance subsequent to the initial product launch, compared to $438 million for the \nprior year comparable period\n; and\n•\nTotal operating expenses increased $93 million, with an increase in R&D investments of $106 million and a decrease in Selling, general, and administrative (“SG&A”) expense of $13 million primarily driven by cost saving initiatives, including information technology, largely offset by increased restructuring spend. As a result, R&D as a percentage of Total revenues increased by 50 basis points and SG&A as a percentage of Total revenues decreased by 20 basis points.\nNet income attributable to GE HealthCare and Net income margin were $1,993 million and 10.1%, an increase of $425 million and 210 basis points, respectively, primarily due to the following factors:\n•\nOperating income increased $190 million, as discussed above;\n•\nInterest and other financial charges – net decreased $38 million primarily driven by repayments made on the Term Loan Facility;\n•\nNon-operating benefit income increased $24 million primarily related to the amortization of net gains on our pension plans;\n•\nOther income – net decreased $31 million primarily driven by favorable impacts from Net financing and investment income in the prior year driven by impacts from the revaluation of investments; and\n•\nProvision for income taxes decreased $212 million primarily due to the release of the France valuation allowance partially offset by the establishment of a reserve for ongoing audits in France. In the prior year, there were larger non-recurring impacts from the Tax Matters Agreement with GE as well as an incremental charge for the accrual of withholding and other foreign taxes due upon future distribution of earnings. For additional detail regarding our income taxes, see Note 11, “Income Taxes.”\nAdjusted EBIT* and Adjusted EBIT margin* were $3,211 million and 16.3%, an increase of $255 million and 120 basis points, respectively, primarily due to an increase in Gross profit, partially offset by investment in R&D.\nAdjusted net income*\n \nwas $2,060 million, an increase of $263 million primarily due to an increase in Gross profit and lower Interest and other financial charges – net, partially offset by investment in R&D.\n____________________\n*Non-GAAP Financial Measure\n43\nFor the year ended December 31, 2023\nOperating income was $2,435 million, a decrease of $87 million and 130 basis points as a percent of Total revenues. The decrease as a percent of Total revenues was due to the following factors:\n•\nCost of products sold increased $490 million but decreased 170 basis points as a percent of Sales of products. The decrease as a percent of sales was driven by cost productivity and an increase in pricing of our products, partially offset by cost inflation. Cost of services sold decreased $22 million or 130 basis points as a percent of Sales of services. The decrease as a percent of sales was driven by cost productivity and an increase in pricing of our service offerings, partially offset by cost inflation. Included in our total cost of revenue as part of our product investment was $438 million in engineering costs for design follow-through on new product introductions and product lifecycle maintenance subsequent to the initial product launch, compared to $429 million for the \nprior year comparable period\n; and\n•\nTotal operating expenses increased $830 million due to an increase in SG&A expense of $651 million driven by increased costs associated with both the one-time stand-up and recurring operations of a stand-alone company and commercial and marketing investments and an increase in R&D investments of $179 million. As a result, SG&A as a percentage of Total revenues increased by 210 basis points and R&D as a percentage of Total revenues increased by 60 basis points.\nNet income attributable to GE HealthCare and Net income margin were $1,568 million and 8.0%, a decrease of $348 million and 240 basis points, respectively, primarily due to the following factors:\n•\nOperating income decreased $87 million, as discussed above;\n•\nInterest and other financial charges – net increased $465 million primarily due to interest expense related to the debt securities issued by GE HealthCare in November of 2022 and the Term Loan Facility drawn upon in January of 2023;\n•\nNon-operating benefit income increased $377 million primarily related to the pension plans transferred to GE HealthCare as part of the Spin-Off; and\n•\nProvision for income taxes increased $180 million primarily due to t\nhe tax effect of foreign currency movement, the impact of the Tax Matters Agreement, including the effect of completing the 2022 U.S. federal tax return\n, taxes accrued for the future repatriation of current earnings with a one-time charge for prior period earnings of certain of our foreign subsidiaries, and the impact of adjusting deferred tax assets and liabilities to stand-alone GE HealthCare tax rates. For additional detail regarding our income taxes, see Note 11, “Income Taxes.”\nAdjusted EBIT* and Adjusted EBIT margin* were $2,956 million and 15.1%, an increase of $95 million but a decrease of 50 basis points, respectively, primarily due to an increase in Total revenues, offset by an increase in Total operating expenses, excluding the impact of one-time Spin-Off and separation costs, as discussed above.\nAdjusted net income*\n \nwas $1,797 million, a decrease of $306 million primarily due to higher Interest and other financial charges – net, partially offset by an increase in Operating Income, excluding the impact of one-time Spin-Off and separation costs, as discussed above.\nRESULTS OF OPERATIONS \n–\n SEGMENTS\nWe exclude from Segment EBIT certain corporate-related expenses and certain transactions or adjustments that our Chief Operating Decision Maker (which is our Chief Executive Officer) considers to be non-operational, such as Interest and other financial charges – net, Benefit (provision) for income taxes, restructuring costs, acquisition and disposition-related benefits (charges), Spin-Off and separation costs, Non-operating benefit (income) costs, gain (loss) on business and asset dispositions, amortization of acquisition-related intangible assets, Net (income) loss attributable to noncontrolling interests, Income (loss) from discontinued operations, net of taxes, and investment revaluation gain (loss). See Note 4, “Segment and Geographical Information” for additional information on our reportable segments, and “Results of Operations” above for discussion on segment revenue performance.\nSegment EBIT\nFor the years ended December 31\n2024\n% of segment revenues\n2023\n% of segment revenues\n2022\n% of segment revenues\n2024 vs. 2023\n % change\n2023 vs. 2022\n % change\nImaging\n    \n$\n962\n10.9 \n%\n$\n821\n9.2 \n%\n$\n780\n9.3 \n%\n17 \n%\n5 \n%\nAVS\n1,118\n21.8 \n%\n1,124\n22.1 \n%\n1,228\n24.5 \n%\n(1)\n%\n(8)\n%\nPCS\n    \n347\n11.1 \n%\n383\n12.2 \n%\n341\n11.7 \n%\n(9)\n%\n12 \n%\nPDx\n    \n783\n31.2 \n%\n617\n26.8 \n%\n520\n26.6 \n%\n27 \n%\n19 \n%\n____________________\n*Non-GAAP Financial Measure\n44\nFor the year ended December 31, 2024\n•\nImaging Segment EBIT was $962 million, an increase of $141 million due to cost productivity and an increase in price, partially offset by cost inflation;\n•\nAVS Segment EBIT was $1,118 million, a decrease of $6 million due to cost inflation, unfavorable mix, and investments, partially offset by cost productivity;\n•\nPCS Segment EBIT was $347 million, a decrease of $36 million due to cost inflation, partially offset by cost productivity; and\n•\nPDx Segment EBIT was $783 million, an increase of $166 million due to an increase in price, growth in sales volume, and cost productivity, partially offset by cost inflation.\nFor the year ended December 31, 2023\n•\nImaging Segment EBIT was $821 million, an increase of $41 million due to cost productivity, an increase in price, and growth in sales volume, largely offset by investments, liquidation of higher-cost inventory, and mix between our product and service offerings;\n•\nAVS Segment EBIT was $1,124 million, a decrease of $104 million due to investments and cost inflation, partially offset by cost productivity and an increase in price;\n•\nPCS Segment EBIT was $383 million, an increase of $42 million due to cost productivity, an increase in price, and growth in sales volume, partially offset by investments and cost inflation; and\n•\nPDx Segment EBIT was $617 million, an increase of $97 million due to an increase in price, growth in sales volume, and cost productivity, partially offset by cost inflation and investments.\nNON-GAAP FINANCIAL MEASURES\nThe non-GAAP financial measures presented in this Annual Report on Form 10-K are supplemental measures of our performance and our liquidity that we believe will help investors understand our financial condition, cash flows, and operating results, and assess our future prospects. When read in conjunction with our U.S. GAAP results, these non-GAAP financial measures provide a baseline for analyzing trends in our underlying businesses and can be used by management as one basis for making financial, operational, and planning decisions. Descriptions of the reported non-GAAP measures are included below.\nWe report Organic revenue and Organic revenue growth rate to provide management and investors with additional understanding and visibility into the underlying revenue trends of our established, ongoing operations, as well as provide insights into overall demand for our products and services. To calculate these measures, we exclude the effect of acquisitions, dispositions, and foreign currency rate fluctuations.\nWe report EBIT, Adjusted EBIT, Adjusted EBIT margin, Adjusted net income, and Adjusted earnings per share to provide management and investors with additional understanding of our business by highlighting the results from ongoing operations and the underlying profitability factors, on a normalized basis. To calculate these measures we exclude, and reflect in the detailed reconciliations below, the following adjustments as applicable: Interest and other financial charges \n–\n net, Net (income) loss attributable to noncontrolling interests, Non-operating benefit (income) costs, Benefit (provision) for income taxes and certain tax related adjustments, and certain non-recurring and/or non-cash items. We may from time to time consider excluding other non-recurring items to enhance comparability between periods. Adjusted EBIT margin is calculated by taking Adjusted EBIT divided by Total revenues for the same period.\nWe report Adjusted tax expense and Adjusted ETR to provide management and investors with a better understanding of the normalized tax rate applicable to our business and provide more consistent comparability across periods. A\ndjusted tax expense excludes the income tax related to the pre-tax income adjustments included as part of Adjusted net income and certain income tax adjustments, such as adjustments to deferred tax assets or liabilities. We may from time to time consider excluding other non-recurring tax items to enhance comparability between periods. Adjusted ETR is Adjusted tax expense divided by income before income taxes less the pre-tax income adjustments referenced above.\nWe report Free cash flow to provide management and investors with an important measure of our ability to generate cash on a normalized basis and provide insight into our flexibility to allocate capital\n. Free cash flow is Cash from (used for) operating activities – continuing operations including cash flows related to the additions and dispositions of property, plant, and equipment (“PP&E”) and additions of internal-use software.\n Free cash flow does not represent residual cash flows available for discretionary expenditures, due to the fact that the measure does not deduct the capital required for debt repayments.\nManagement recognizes that these non-GAAP financial measures have limitations, including that they may be calculated differently by other companies or may be used under different circumstances or for different purposes. In order to compensate for the discussed limitations, management does not consider these measures in isolation from or as alternatives to the comparable financial measures determined in accordance with U.S. GAAP. The detailed reconciliations of each non-GAAP financial measure to the most directly comparable U.S. GAAP financial measure are provided below, and no single financial measure should be relied on to evaluate our business.\n45\nOrganic Revenue*\nFor the years ended December 31\n2024\n2023\n% change\nImaging revenues    \n$\n8,855\n$\n8,944\n(1)%\nLess: Acquisitions\n(1)\n    \n47\n—\nLess: Dispositions\n(2)\n    \n—\n—\nLess: Foreign currency exchange    \n(71)\n—\nImaging Organic revenue*\n$\n8,880\n$\n8,944\n(1)%\nAVS revenues    \n$\n5,131\n$\n5,094\n1%\nLess: Acquisitions\n(1)\n    \n—\n—\nLess: Dispositions\n(2)\n    \n—\n—\nLess: Foreign currency exchange    \n(25)\n—\nAVS Organic revenue*    \n$\n5,157\n$\n5,094\n1%\nPCS revenues    \n$\n3,125\n$\n3,142\n(1)%\nLess: Acquisitions\n(1)\n    \n—\n—\nLess: Dispositions\n(2)\n    \n—\n—\nLess: Foreign currency exchange    \n(6)\n—\nPCS Organic revenue*    \n$\n3,131\n$\n3,142\n—%\nPDx revenues    \n$\n2,508\n$\n2,306\n9%\nLess: Acquisitions\n(1)\n    \n—\n—\nLess: Dispositions\n(2)\n    \n—\n—\nLess: Foreign currency exchange    \n(10)\n—\nPDx Organic revenue*    \n$\n2,518\n$\n2,306\n9%\nOther revenues    \n$\n52\n$\n66\n(21)%\nLess: Acquisitions\n(1)\n    \n—\n—\nLess: Dispositions\n(2)\n    \n—\n—\nLess: Foreign currency exchange    \n—\n—\nOther Organic revenue*    \n$\n52\n$\n66\n(21)%\nTotal revenues    \n$\n19,672\n$\n19,552\n1%\nLess: Acquisitions\n(1)\n    \n47\n—\nLess: Dispositions\n(2)\n    \n—\n—\nLess: Foreign currency exchange    \n(112)\n—\nOrganic revenue*    \n$\n19,737\n$\n19,552\n1%\n(1)\nRepresents revenues attributable to acquisitions from the date the Company completed the transaction through the end of four quarters following the transaction.\n(2)\nRepresents revenues attributable to dispositions for the four quarters preceding the disposition date.\n____________________\n*Non-GAAP Financial Measure\n46\nOrganic Revenue*\nFor the years ended December 31\n2023\n2022\n% change\nImaging revenues    \n$\n8,944\n$\n8,395\n7%\nLess: Acquisitions\n(1)\n    \n1\n—\nLess: Dispositions\n(2)\n    \n—\n—\nLess: Foreign currency exchange    \n(131)\n—\nImaging Organic revenue*\n$\n9,074\n$\n8,395\n8%\nAVS revenues    \n$\n5,094\n$\n5,012\n2%\nLess: Acquisitions\n(1)\n    \n—\n—\nLess: Dispositions\n(2)\n    \n—\n—\nLess: Foreign currency exchange    \n(56)\n—\nAVS Organic revenue*    \n$\n5,150\n$\n5,012\n3%\nPCS revenues    \n$\n3,142\n$\n2,916\n8%\nLess: Acquisitions\n(1)\n    \n—\n—\nLess: Dispositions\n(2)\n    \n—\n—\nLess: Foreign currency exchange    \n(16)\n—\nPCS Organic revenue*    \n$\n3,158\n$\n2,916\n8%\nPDx revenues    \n$\n2,306\n$\n1,958\n18%\nLess: Acquisitions\n(1)\n    \n—\n—\nLess: Dispositions\n(2)\n    \n—\n—\nLess: Foreign currency exchange    \n(14)\n—\nPDx Organic revenue*    \n$\n2,320\n$\n1,958\n18%\nOther revenues    \n$\n66\n$\n60\n10%\nLess: Acquisitions\n(1)\n    \n—\n—\nLess: Dispositions\n(2)\n    \n—\n—\nLess: Foreign currency exchange    \n1\n—\nOther Organic revenue*    \n$\n65\n$\n60\n8%\nTotal revenues    \n$\n19,552\n$\n18,341\n7%\nLess: Acquisitions\n(1)\n    \n1\n—\nLess: Dispositions\n(2)\n    \n—\n—\nLess: Foreign currency exchange    \n(216)\n—\nOrganic revenue*    \n$\n19,767\n$\n18,341\n8%\n(1)\nRepresents revenues attributable to acquisitions from the date the Company completed the transaction through the end of four quarters following the transaction.\n(2)\nRepresents revenues attributable to dispositions for the four quarters preceding the disposition date.\n____________________\n*Non-GAAP Financial Measure\n47\nAdjusted EBIT*\nFor the years ended December 31\n2024\n2023\n2022\n2024 vs. 2023\n % change\n2023 vs. 2022\n % change\nNet income attributable to GE HealthCare\n    \n$\n1,993\n$\n1,568\n$\n1,916\n27%\n(18)%\nAdd: Interest and other financial charges – net    \n504\n542\n77\nAdd: Non-operating benefit (income) costs    \n(406)\n(382)\n(5)\nLess: Benefit (provision) for income taxes    \n(531)\n(743)\n(563)\nLess: Income (loss) from discontinued operations, net of taxes    \n—\n(4)\n18\nLess: Net (income) loss attributable to noncontrolling interests     \n(57)\n(46)\n(51)\nEBIT*\n    \n$\n2,679\n$\n2,521\n$\n2,584\n6%\n(2)%\nAdd: Restructuring costs\n(1)\n    \n120\n54\n146\nAdd: Acquisition and disposition-related charges (benefits)\n(2)\n    \n3\n(15)\n(34)\nAdd: Spin-Off and separation costs\n(3)\n    \n251\n270\n14\nAdd: (Gain) loss on business and asset dispositions\n(4)\n    \n—\n—\n(1)\nAdd: Amortization of acquisition-related intangible assets    \n137\n127\n121\nAdd: Investment revaluation (gain) loss\n(5)\n    \n22\n(1)\n31\nAdjusted EBIT*\n    \n$\n3,211\n$\n2,956\n$\n2,861\n9%\n3%\nNet income margin\n10.1%\n8.0%\n10.4%\n210 bps\n(240) bps\nAdjusted EBIT margin*\n    \n16.3%\n15.1%\n15.6%\n120 bps\n(50) bps\n(1)\nConsists of severance, facility closures, and other charges associated with restructuring programs.\n(2)\nConsists of legal, consulting, and other transaction and integration fees, and adjustments to contingent consideration, as well as other purchase accounting related charges and other costs directly related to the transactions.\n(3)\nCosts incurred in the Spin-Off and separation from GE, including system implementations, audit and advisory fees, legal entity separation, Founders Grant equity awards, separation agreements with GE, and other one-time costs.\n(4)\nConsists of gains and losses resulting from the sale of assets and investments.\n(5)\nPrimarily relates to valuation adjustments for equity investments.\nAdjusted Net Income*\nFor the years ended December 31\n2024\n2023\n2022\n2024 vs. 2023\n % change\n2023 vs. 2022\n % change\nNet income attributable to GE HealthCare\n    \n$\n1,993\n$\n1,568\n$\n1,916\n27%\n(18)%\nAdd: Non-operating benefit (income) costs    \n(406)\n(382)\n(5)\nAdd: Restructuring costs\n(1)\n    \n120\n54\n146\nAdd: Acquisition and disposition-related charges (benefits)\n(2)\n    \n3\n(15)\n(34)\nAdd: Spin-Off and separation costs\n(3)\n    \n251\n270\n14\nAdd: (Gain) loss on business and asset dispositions\n(4)\n    \n—\n—\n(1)\nAdd: Amortization of acquisition-related intangible assets    \n137\n127\n121\nAdd: Investment revaluation (gain) loss\n(5)\n    \n22\n(1)\n31\nAdd: Tax effect of reconciling items\n(6)\n(42)\n(24)\n(67)\nAdd: Spin-Off and other tax adjustments\n(7)\n    \n(17)\n196\n—\nLess: Income (loss) from discontinued operations, net of taxes    \n—\n(4)\n18\nAdjusted net income*    \n$\n2,060\n$\n1,797\n$\n2,103\n15%\n(15)%\n(1)\nConsists of severance, facility closures, and other charges associated with restructuring programs.\n(2)\nConsists of legal, consulting, and other transaction and integration fees, and adjustments to contingent consideration, as well as other purchase accounting related charges and other costs directly related to the transactions.\n(3)\nCosts incurred in the Spin-Off and separation from GE, including system implementations, audit and advisory fees, legal entity separation, Founders Grant equity awards, separation agreements with GE, and other one-time costs.\n(4)\nConsists of gains and losses resulting from the sale of assets and investments.\n(5)\nPrimarily relates to valuation adjustments for equity investments.\n(6)\nThe tax effect of reconciling items is calculated using the statutory tax rate, taking into consideration the nature of the items and the relevant taxing jurisdiction.\n(7)\nConsists of certain income tax adjustments, including the accrual of a deferred tax liability on the prior period earnings of certain of the Company’s foreign subsidiaries for which the Company is no longer permanently reinvested, the impact of adjusting deferred tax assets and liabilities to stand-alone GE HealthCare tax rates, and the impact of tax legislation changes. As of the third quarter of 2024 this line additionally includes discrete tax impacts resulting from the Spin-Off and separation from GE previously reported under Tax effect of reconciling items.\n____________________\n*Non-GAAP Financial Measure\n48\nAdjusted Earnings Per Share*\nFor the years ended December 31\n(In dollars, except shares outstanding presented in millions)\n2024\n2023\n2022\n2024 vs. 2023\n $ change\n2023 vs. 2022\n $ change\nDiluted earnings per share – continuing operations\n$\n4.34\n$\n3.04\n$\n4.18\n$\n1.31\n$\n(1.14)\nAdd: Deemed preferred stock dividend of redeemable noncontrolling interest\n— \n0.40 \n— \nAdd: Non-operating benefit (income) costs    \n(0.88)\n(0.83)\n(0.01)\nAdd: Restructuring costs\n(1)\n    \n0.26 \n0.12 \n0.32 \nAdd: Acquisition and disposition-related charges (benefits)\n(2)\n    \n0.01 \n(0.03)\n(0.07)\nAdd: Spin-Off and separation costs\n(3)\n    \n0.55 \n0.59 \n0.03 \nAdd: (Gain) loss on business and asset dispositions\n(4)\n    \n— \n— \n(0.00)\nAdd: Amortization of acquisition-related intangible assets    \n0.30 \n0.28 \n0.27 \nAdd: Investment revaluation (gain) loss\n(5)\n    \n0.05 \n(0.00)\n0.07\nAdd: Tax effect of reconciling items\n(6)\n(0.09)\n(0.05)\n(0.15)\nAdd: Spin-Off and other tax adjustments\n(7)\n    \n(0.04)\n0.43 \n— \nAdjusted earnings per share*\n$\n4.49\n$\n3.93\n$\n4.63\n$\n0.56\n$\n(0.70)\nDiluted weighted-average shares outstanding\n459\n458\n454\n(1)\nConsists of severance, facility closures, and other charges associated with restructuring programs.\n(2)\nConsists of legal, consulting, and other transaction and integration fees, and adjustments to contingent consideration, as well as other purchase accounting related charges and other costs directly related to the transactions.\n(3)\nCosts incurred in the Spin-Off and separation from GE, including system implementations, audit and advisory fees, legal entity separation, Founders Grant equity awards, separation agreements with GE, and other one-time costs.\n(4)\nConsists of gains and losses resulting from the sale of assets and investments.\n(5)\nPrimarily relates to valuation adjustments for equity investments.\n(6)\nThe tax effect of reconciling items is calculated using the statutory tax rate, taking into consideration the nature of the items and the relevant taxing jurisdiction.\n(7)\nConsists of certain income tax adjustments, including the accrual of a deferred tax liability on the prior period earnings of certain of the Company’s foreign subsidiaries for which the Company is no longer permanently reinvested, the impact of adjusting deferred tax assets and liabilities to stand-alone GE HealthCare tax rates, and the impact of tax legislation changes. As of the third quarter of 2024 this line additionally includes discrete tax impacts resulting from the Spin-Off and separation from GE previously reported under Tax effect of reconciling items.\nAdjusted Tax Expense* and Adjusted ETR*\nFor the years ended December 31\n2024\n2023\n2022\nBenefit (provision) for income taxes\n$\n(531)\n$\n(743)\n$\n(563)\nAdd: Tax effect of reconciling items\n(1)\n(42)\n(24)\n(67)\nAdd: Spin-Off and other tax adjustments\n(2)\n    \n(17)\n196\n—\nAdjusted tax expense*\n$\n(590)\n$\n(571)\n$\n(630)\nEffective tax rate\n20.6%\n31.5%\n22.4%\nAdjusted effective tax rate*\n21.8%\n23.7%\n22.6%\n(1)\nThe tax effect of reconciling items is calculated using the statutory tax rate, taking into consideration the nature of the items and the relevant taxing jurisdiction.\n(2)\nConsists of certain income tax adjustments, including the accrual of a deferred tax liability on the prior period earnings of certain of the Company’s foreign subsidiaries for which the Company is no longer permanently reinvested, the impact of adjusting deferred tax assets and liabilities to stand-alone GE HealthCare tax rates, and the impact of tax legislation changes. As of the third quarter of 2024 this line additionally includes discrete tax impacts resulting from the Spin-Off and separation from GE previously reported under Tax effect of reconciling items.\n____________________\n*Non-GAAP Financial Measure\n49\nFree Cash Flow*\nFor the years ended December 31\n2024\n2023\n2022\n2024 vs. 2023\n % change\n2023 vs. 2022\n % change\nCash from (used for) operating activities – continuing operations\n$\n1,955\n$\n2,101\n$\n2,134\n(7)%\n(2)%\nAdd: Additions to PP&E and internal-use software    \n(401)\n(387)\n(310)\nAdd: Dispositions of PP&E    \n—\n1\n4\nFree cash flow*    \n$\n1,554\n$\n1,715\n$\n1,828\n(9)%\n(6)%\nLIQUIDITY AND CAPITAL RESOURCES\nAs of December 31, 2024, our Cash, cash equivalents, and restricted cash balance in the Consolidated Statements of Financial Position was $2,889 million. We have historically generated positive cash flows from operating activities. Additionally, we have access to revolving credit facilities of $3,500 million in aggregate, described in detail in Note 9, “Borrowings.”\nWe believe that our existing balance of Cash, cash equivalents, and restricted cash, future cash generated from operating activities, access to capital markets, and existing credit facilities will be sufficient to meet the needs of our current and ongoing operations, pay taxes due, service our existing debt, and fund investments in our business for at least the next 12 months.\nThe following table summarizes our cash flows for the periods presented:\nCash Flow\nFor the years ended December 31\n2024\n2023\n2022\nCash from (used for) operating activities – continuing operations\n$\n1,955 \n$\n2,101 \n$\n2,134 \nCash from (used for) investing activities – continuing operations\n(914)\n(558)\n(398)\nCash from (used for) financing activities – continuing operations\n(573)\n(478)\n(822)\nFree cash flow*    \n1,554 \n1,715 \n1,828 \nOperating Activities\nCash generated from operating activities in the year ended December 31, 2024 was $1,955 million and included Net income from continuing operations of $2,050 million, non-cash charges primarily for depreciation and amortization of $580 million, and $675 million in outflows from incremental changes in assets and liabilities, primarily driven by company-funded benefit payments for postretirement benefit plans, an increase in receivables due to higher volume, and a build in inventories.\nCash generated from operating activities in the year ended December 31, 2023 was $2,101 million and included Net income from continuing operations of $1,618 million, non-cash charges primarily for depreciation and amortization of $610 million, and $127 million in outflows from incremental changes in assets and liabilities, primarily driven by company-funded benefit payments for postretirement benefit plans and an increase in receivables, partially offset by lower cash taxes paid and a decrease in inventories.\nCash generated from operating activities in the year ended December 31, 2022 was $2,134 million and included Net income from continuing operations of $1,949 million, non-cash charges for depreciation and amortization of $633 million, and a $448 million outflow from changes in assets and liabilities, primarily driven by an increase in both inventories and receivables, and higher cash taxes paid, partially offset by an increase in accounts payable.\nInvesting Activities\nCash used for investing activities in the year ended December 31, 2024 was $914 million and primarily included additions to PP&E of $401 million related mostly to manufacturing capacity expansion and new product introductions, purchases of businesses, net of cash acquired, of $313 million related to the MIM Software Inc. (“MIM Software”) and Intelligent Ultrasound Group PLC acquisitions, and payment of $94 million for settlement of cross-currency swaps that were designated in net investment hedges. Refer to Note 8, “Acquisitions, Goodwill, and Other Intangible Assets” for additional information on the MIM Software acquisition, and Note 13, “Financial Instruments and Fair Value Measurements” for additional information on the settlement of cross-currency swaps.\nCash used for investing activities in the year ended December 31, 2023 was $558 million and primarily included additions to PP&E of $387 million related mostly to new product introductions, manufacturing capacity expansion, and purchases of businesses, net of cash acquired, of $147 million primarily related to Caption Health, Inc.\nCash used for investing activities in the year ended December 31, 2022 was $398 million and primarily included additions to PP&E of $310 million related primarily to manufacturing capacity expansion, and new product introductions. \n____________________\n*Non-GAAP Financial Measure\n50\nFinancing Activities\nCash used for financing activities in the year ended December 31, 2024 was $573 million and primarily included repayment of $1,000 million aggregate principal amount of senior unsecured notes, and $400 million in repayments of the outstanding Term Loan Facility, partially offset by $995 million of net proceeds from the issuance of $1,000 million aggregate principal amount of senior unsecured notes due in 2029. Refer to Note 9, “Borrowings” for further information.\nCash used for financing activities in the year ended December 31, 2023 was $478 million and primarily included $1,317 million of transfers to GE, $850 million partial repayment of our outstanding Term Loan Facility, and $211 million of redemption of noncontrolling interests, partially offset by $2,000 million drawdown of the Term Loan Facility.\nCash used for financing activities in the year ended December 31, 2022 was $822 million and primarily included $8,934 million of transfers to GE, partially offset by $8,198 million of newly issued debt.\nFree cash flow*\nFree cash flow* was $1,554 million for the year ended December 31, 2024 and primarily included $1,955 million of cash generated from operating activities, partially offset by $401 million of cash used for additions to PP&E.\nFree cash flow* was $1,715 million for the year ended December 31, 2023 and primarily included $2,101 million of cash generated from operating activities, partially offset by $387 million of cash used for additions to PP&E.\nFree cash flow* was $1,828 million for the year ended December 31, 2022 and primarily included $2,134 million of cash generated from operating activities, partially offset by $310 million of cash used for additions to PP&E.\nCapital Expenditures\nCash used for capital expenditures was $401 million, $387 million, and $310 million for the years ended December 31, 2024, 2023, and 2022, respectively. Capital expenditures were primarily for manufacturing capacity expansion, new product introductions, and equipment and tooling for new and existing products.\nMaterial Cash Requirements\nIn the normal course of business, we enter into contracts and commitments that obligate us to make payments in the future. Information regarding our obligations under lease, debt, and other commitments are provided in Note 7, “Leases,” Note 9, “Borrowings,” and Note 14, “Commitments, Guarantees, Product Warranties, and Other Loss Contingencies.” We have material cash requirements related to our pension obligations as described in Note 10, “Postretirement Benefit Plans.”\nDebt and Credit Facilities\nAdditional information on our debt and credit facilities, including definitions of the terms used below, is included in \nNote 9\n, \n“Borrowings.” \nAs part of our capital structure, we have incurred debt. The servicing of this debt is supported by cash flows from our operations. As of December 31, 2024, we had $8,951 million of total debt compared to $9,442 million as of December 31, 2023\n. This includes a \n$1,000 million a\nggregate principal amount of senior unsecured notes issued by the Company in the third quarter of 2024, and a repayment in the fourth quarter of 2024 of \n$1,000 million\n of senior unsecured notes. \nThe decrease in debt was due primarily to repayments of \n$150 million\n and \n$250 million\n of the outstanding Term Loan Facility in the first and fourth quarter of 2024, respectively.\nThe weighted average interest rate for the Notes and our Credit Facilities for the year ended December 31, 2024 was 5.99%.\nIn addition to the Term Loan Facility, our credit facilities include a five-year senior unsecured revolving facility that provides borrowings of up to $2,500 million expiring in January 2028, and a 364-day senior unsecured revolving facility that provides borrowings of up to $1,000 million expiring in December 2025. As of \nDecember 31, 2024\n, there were no outstanding borrowings on either of the two revolving facilities.\nThe Credit Facilities include various customary covenants that limit, among other things, the incurrence of liens securing debt, the entry into certain fundamental change transactions by GE HealthCare, and the maximum permitted leverage ratio. As of \nDecember 31, 2024\n, we were in compliance with the covenant requirements, including the maximum consolidated net leverage ratio. \nAccess to Capital and Credit Ratings\nIn connection with the Spin-Off, we accessed the capital markets and raised $10,250 million of debt by issuing \n$8,250 million\n of senior unsecured notes in November 2022, completed a drawdown of the Term Loan Facility of \n$2,000 million\n in January 2023, and arranged $3,500 million of revolving credit facilities to further support our liquidity needs. In the third quarter of 2024, we issued \n$1,000 million\n aggregate principal amount of senior unsecured notes due in 2029. We plan to continue to rely on capital markets, and we expect to have access to credit facilities to fund our operations. The cost and availability of debt financing will be influenced by our credit ratings and market conditions. Moody\n’\ns Investors Service (\n“\nMoody\n’\ns\n”\n), S&P Global Ratings (\n“\nS&P\n”\n), and Fitch Ratings (\n“\nFitch\n”\n) currently issue ratings on our long-term debt. \n____________________\n*Non-GAAP Financial Measure\n51\nOur credit ratings as of \nFebruary 6, 2025\n are set forth in the table below and remain unchanged since the Spin-Off.\nMoody’s\nS&P\nFitch\nLong-term rating\nBaa2\nBBB\nBBB\nOutlook\nStable\nStable\nStable\nWe are disclosing our credit ratings to enhance the understanding of our sources of liquidity and the effects of our ratings on our costs of funds and access to liquidity. Our ratings may be subject to a revision or withdrawal at any time by the assigning rating organization, a\nnd each rating should be evaluated independently of any other rating.\nRECENTLY ISSUED ACCOUNTING PRONOUNCEMENTS\nFor a discussion of recently issued accounting standards, see Note 2, “Summary of Significant Accounting Policies.”\nCRITICAL ACCOUNTING ESTIMATES\nOur financial results are affected by the selection and application of accounting policies and methods. We have adopted accounting policies to prepare our financial statements in conformity with U.S. GAAP.\nTo prepare our financial statements in accordance with U.S. GAAP, management makes estimates and assumptions that may affect the reported amounts of our assets and liabilities, including our contingent liabilities, as of the date of our financial statements, and the reported amounts of our revenues and expenses during the reporting periods. Our actual results may differ from these estimates. We consider estimates to be critical (1) if we are required to make assumptions about material matters that are uncertain at the time of estimation or (2) if materially different estimates could have been made or it is reasonably likely that the accounting estimate will change from period to period. The following are areas considered to be critical and require management’s judgment: Revenue Recognition, Business Combination Related Measurements, Pension and Other Postretirement Benefits, and Income Taxes. \nSee Note 2, “Summary of Significant Accounting Policies” for further information on our significant accounting policies.\nREVENUE RECOGNITION.\nOur revenues are recorded based on the consideration specified in customer contracts net of any sales incentives, discounts, returns, chargebacks, group purchasing organization fees, rebates, or credits, which are accounted for as estimated variable consideration. Our estimates for these deductions are based upon historical experience and consider current and forecasted market trends. We record the estimated amounts as a reduction to revenue when we recognize the related product or service sale. \nChargebacks are a form of variable consideration that occur when a contracted customer purchases through an intermediary wholesaler. The contracted customer generally purchases product from the wholesaler at its contracted price plus a mark-up. The wholesaler, in turn, charges us back for the difference between the price initially paid by the wholesaler and the contract price paid to the wholesaler by the contracted customer. A provision for outstanding chargebacks is recorded at the time we recognize revenue from the sale to the wholesaler and requires certain estimates such as the wholesaler chargeback rates, the expected sell-through levels by our wholesale customers to contracted customers, as well as estimated wholesaler inventory levels. \nThe amounts of variable consideration included in the net transaction price for revenue recognition are limited to the amounts that are estimated to be probable of occurrence to avoid a material revenue reversal in a future period. \nSee Note 3, “Revenue Recognition” for further information on revenue recognition and Note 5, “Receivables” for further information on chargebacks.\nBUSINESS COMBINATION RELATED MEASUREMENTS. \nOur financial statements include the operations of an acquired business starting from the completion of the combination. The assets acquired and liabilities assumed, including any contingent consideration we may be liable to pay in the future, are recorded on the date of the business combination at their respective estimated fair values, with any excess of the purchase price over the estimated fair values of the net assets acquired recorded as goodwill. Our business combinations typically result in the recognition of goodwill, developed technology, and other intangible assets, which affect the amount of future period amortization expense. The fair values of acquired intangible assets and liabilities are determined using information available at the business combination date based on estimates and assumptions that are deemed reasonable. Significant assumptions vary by the class of asset or liability and the valuation technique used. These assumptions can include: the discount rates; timing; probability of achieving regulatory and commercialization milestones; and certain assumptions that form the basis of the forecasted results of the acquired business including revenue, earnings before interest, taxes, depreciation and amortization, growth rates, royalty rates, and technology obsolescence rates. These assumptions are forward-looking and could be affected by future economic and market conditions. We engage third-party valuation specialists who review our critical assumptions and prepare the calculations of the fair value of acquired intangible assets in connection with significant business combinations.\n52\nSee Note 8, “Acquisitions, Goodwill, and Other Intangible Assets” for further information on our business combinations.\nPENSION AND OTHER POSTRETIREMENT BENEFITS.\n \nPension and other postretirement benefits are calculated using significant inputs to the actuarial models that measure pension benefit obligations and related effects on operations. Two assumptions, discount rate and expected return on assets, are important elements of plan expense and related asset and liability measurement. The Company evaluates these critical assumptions at least annually on a plan and country-specific basis. The Company periodically evaluates other assumptions involving demographic factors such as retirement age, mortality, and turnover, and updates them to reflect our experience and expectations for the future. Actual results in any given year often will differ from actuarial assumptions because of economic and other factors. \nProjected benefit obligations (“PBO”) are measured as the present value of expected payments. We discount those cash payments using the weighted average of market-observed yields for high-quality fixed-income securities with maturities that correspond to the expected timing of benefit payments. \nA 50 basis point change in the assumed discount rate would have the following effects on the calculation of net periodic benefit costs in 2025 and PBO and accumulated postretirement benefit obligation (“APBO”) as of December 31, 2024:\nDiscount Rate Sensitivity\nU.S. Plans\nInternational Plans\nOther Postretirement Plans\n50 bps increase in discount rate\nImpact on PBO/APBO as of December 31, 2024\n$\n(812)\n$\n(195)\n$\n(32)\nImpact on service cost and interest cost in 2025\n37 \n2 \n3 \n50 bps decrease in discount rate\nImpact on PBO/APBO as of December 31, 2024\n$\n885 \n$\n215 \n$\n33 \nImpact on service cost and interest cost in 2025\n(43)\n(3)\n(2)\nThe sensitivity of the net deficit to the discount rate would be lower than the projected benefit obligation sensitivity as a result of the liability hedging program incorporated in the plan’s asset allocation.\nTo determine the expected long-term rate of return on pension plan assets, we consider current and target asset allocations, as well as historical and expected returns on various categories of plan assets. In developing future long-term return expectations for our principal benefit plans’ assets, we formulate views on the future economic environment, both in the U.S. and abroad. We evaluate general market trends and historical relationships among a number of key variables that impact asset class returns such as expected earnings growth, inflation, valuations, yields, and spreads, using both internal and external sources. We also consider expected volatility by asset class and diversification across classes to determine expected overall portfolio results given current and target allocations. A 1% change in the assumed expected long-term rate of return on plan assets would increase or decrease the 2025 net periodic benefit costs of these plans by $194 million.\nOur pension plan assets contain financial instruments that are measured at fair value. While the majority of these assets are valued based on quoted prices for identical or similar instruments in active markets, the fair value of certain assets is estimated using significant unobservable inputs (Level 3). These assets primarily relate to real estate and private equity investments.\nFor pension benefits and retiree health and life benefits transferred from GE on January 1, 2023, third-party actuaries were engaged to assist in the valuation of transferred pension assets and liabilities using assumptions provided by GE which the Company reviewed prior to recording amounts in our combined financial statements.\nWe disclose in the following table postretirement plans with assets or obligations that exceed $50 million as of December 31, 2024. Refer to Note 10, “Postretirement Benefit Plans” for further details related to these plans. The value of the assets and liabilities as of December 31, 2024, are summarized in the table below.\nProjected benefit obligations\nFair value of plan assets\nFunded status - surplus (deficit)\nGE HealthCare Pension Plan\n$\n15,230 \n$\n13,650 \n$\n(1,580)\nGE HealthCare Supplementary Pension Plan\n1,886 \n— \n(1,886)\nOther U.S. Pension Plans\n1,125 \n727 \n(398)\nTotal U.S. Plans\n18,241 \n14,378 \n(3,863)\nInternational Plans\n2,957 \n3,276 \n319 \nOPEB Plans\n(1)\n1,016 \n— \n(1,016)\nTotal\n$\n22,214\n \n$\n17,654\n \n$\n(4,561)\n(1) As defined in Note 10, “Postretirement Benefit Plans.”\n53\nINCOME TAXES.\nFor periods prior to the Spin-Off, GE HealthCare is included in the combined U.S. federal, state, and foreign income tax returns of GE, where eligible. However, we have adopted the separate return method for purposes of our combined financial statements. The income tax provisions reflected in our combined financial statements for the period ended December 31, 2022 have been estimated as if we were a separate taxpayer. \nOur annual tax expense is based on our income, applicable statutory tax rates, and tax incentives available to us in the various jurisdictions in which we operate. Changes in existing tax laws or rates could significantly impact the estimate of our tax liabilities. Deferred tax assets represent amounts available to reduce income taxes payable on taxable income in future years. Such assets arise because of temporary differences between the financial reporting and tax basis of assets and liabilities, as well as from net operating loss and tax credit carryforwards. We evaluate the recoverability of these future tax deductions and credits by assessing the adequacy of future expected taxable income from all sources, including reversal of taxable temporary differences, forecasted operating earnings, taxable income in prior carryback years to the extent applicable, and available tax planning strategies. These sources of income rely heavily on estimates; we use our historical experience as well as our short- and long-range business forecasts to provide insight.\nSignificant judgment is required in determining our tax expense and in evaluating our tax positions, including evaluating uncertainties. We recognize tax benefits from uncertain tax positions only if we believe that it is more likely than not that the tax position will be sustained on examination by the relevant taxing authorities based on the technical merits of the position. Our policy is to adjust these reserves when facts and circumstances change, such as the change in the technical merit of a position, or an uncertain tax position is effectively settled with the relevant taxing authority, or the statute of limitations has expired. We have provided for the amounts we believe will ultimately result from these changes; however, due to the complexity of some of these uncertainties, the ultimate resolution may result in a payment that is materially different from our current estimate of the tax liabilities. \nSee Note 11, “Income Taxes” for further information on income taxes.\nITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK \nWe are exposed to market risk primarily from changes in foreign currency exchange rates, interest rates, commodity prices, and equity prices, which may impact future income, cash flows, and fair value of our business. In certain situations, we may seek to reduce cash flow volatility associated with changes in foreign currency exchange rates, the foreign currency risk associated with our net investment in foreign operations, or the fair value interest rate risk of our financial instruments bearing fixed interest by entering into financial arrangements intended to provide a hedge against a portion of such risks. We continue to have exposure to such risks to the extent they are not hedged. We enter into derivative contracts to the extent they meet the objectives described above, and not for speculative purposes. See Note 13, “Financial Instruments and Fair Value Measurements” for further information about our risk exposures, our use of derivatives, and the effects of this activity on our financial statements.\nFOREIGN CURRENCY RISK.\nAs a result of our global operations, we generate and incur a significant portion of our revenues and expenses, including those arising from intercompany transactions, in currencies other than the functional currency of our foreign operations creating exposure to foreign currency translation risk. Such principal currencies include the Euro, the Chinese Renminbi, the Japanese Yen, the Norwegian Krone, and the British Pound Sterling, among others. Operating entities with functional currencies other than the USD also create exposure to foreign currency risk realized upon their sale or a complete or substantially complete liquidation.\nWe use a number of techniques to manage the effects of foreign currency exchange risk, including hedging of significant currency exposures. We use cash flow hedging primarily to reduce or eliminate the effects of foreign currency exchange rate changes on purchase and sale contracts and economic hedges when we have exposures to foreign currency exchange risk for which we are unable to meet the requirements for hedge accounting. We use net investment hedging to hedge the foreign currency risk of our net investment in foreign operations against adverse movements in exchange rates against the USD. As a result of the above mitigating activities, we have been able to significantly reduce the financial impact of volatility from currency fluctuations.\nThe potential decrease in fair value of our foreign currency derivative contracts from a 10% decrease in USD spot rates against other applicable currencies would have been $82 million as of December 31, 2024. This excludes foreign currency derivative contracts designated as net investment hedges as changes in the fair value of those contracts are not expected to impact earnings. The sensitivity analysis assumes a uniform weakening of USD spot rates against the other applicable currencies, compared to the actual exchange rates applied as of December 31, 2024, with all other factors remaining constant. This sensitivity analysis disregards the offsetting change in value of the underlying hedged currency exposures in earnings.\n54\nThe effect arising from foreign currency transactions, including the remeasurement of derivatives mentioned above, can result in significant fluctuations at points in time, but generally will be offset as the underlying hedged item is recognized in earnings. The global nature of our customer base and manufacturing footprint allows for the natural offset of certain income and costs denominated in foreign currencies. See Note 2, “Summary of Significant Accounting Policies” for net gains (losses) from foreign currency transactions for the years ended December 31, 2024, 2023, and 2022. \nINTEREST RATE RISK.\nWe are exposed to interest rate risk due to changes in benchmark interest rates related to the fair value of our borrowings bearing fixed interest rates and variability of cash flows related to our investments and borrowings bearing variable interest rates.\nAs of December 31, 2024, we have $8,250 million of fixed-rate debt and $750 million outstanding on the Term Loan Facility which carries a variable interest rate. As of December 31, 2024, we have $2,889 million of Cash, cash equivalents, and restricted cash, of which $1,885 million is invested in short-term investments that generate income based on variable interest rates.\nA change in interest rates would impact the fair value of our fixed-rate debt and would impact our earnings and cash flows associated with our floating-rate debt. A hypothetical change of interest rates by 100 basis points would increase or decrease our annual interest expense by approximately $35 million, partially offset by the change in interest income from our cash investments.\nWe primarily manage interest rate risk by using a mix of fixed-rate and variable-rate debt that we deem appropriate. As of December 31, 2024, we executed an aggregate notional amount of interest rate swap contracts to synthetically convert $2,700 million of our senior unsecured notes from fixed rates to variable rates as part of our interest rate risk management strategy.\nCOMMODITY RISK.\nWe rely upon supplies of certain raw materials including helium, iodine, and rare earth minerals. Worldwide demand, availability, and pricing of these raw materials have been volatile, and we expect that availability and pricing will continue to fluctuate in the future. If supply of these materials is restricted or if prices increase, this could constrain our manufacturing of affected products, reduce our profit margins, or otherwise adversely affect our business, our customers, and patients who may rely on our products.\nSimilarly, commodities and energy prices are subject to significant volatility. If the costs of certain commodities or of energy, shipping, or transportation increase and we are unable to pass along these costs to our customers, our profit margins would be adversely affected. Furthermore, increasing our prices to our customers could result in long-term sales declines or loss of market share if our customers find alternative suppliers, which could have a material adverse effect on our results of operations.\nDisruptions in deliveries, capacity constraints, production disruptions up- or down-stream, price increases, or decreased availability of raw materials or commodities (including as a result of war, natural disasters, climate change-related physical and transitional risks, actual or threatened public health emergencies, or other business continuity events) adversely affect our operations and, depending on the length and severity of the disruption, can limit our ability to meet our commitments to customers or significantly impact our operating profit or cash flows. \nWe may from time to time engage in hedging transactions to reduce the impact to earnings from commodity price fluctuations. The impact of commodity hedges is recognized in earnings in the applicable current period.\nEQUITY RISK.\nAs of December 31, 2024, we have $260 million of deferred compensation liabilities subject to the risk of changes in equity prices. A change in the U.S equity markets would result in a corresponding change in the value of these deferred compensation liabilities, which would impact our earnings and cash flows. We may from time to time engage in hedging transactions to reduce the impact to earnings from equity price fluctuations.\n55\nITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nPart II. Financial Information\nIndex\nItem 8. Financial Statements and Supplementary Data\nPage\nReport of Independent Registered Public Accounting Firm - Deloitte & Touche LLP (PCAOB ID No.\n \n34\n)\n57\nConsolidated and Combined Statements of Income\n60\nConsolidated and Combined Statements of Comprehensive Income (Loss)\n61\nConsolidated\n Statements of Financial Position\n62\nConsolidated and Combined Statements of Changes in Equity\n63\nConsolidated \na\nn\nd\n \nCombined\n \nStatements of Cash Flows\n64\nNotes to the Consolidated and Combined Financial Statements\n65\nNote 1.     Organization and Basis of Presentation\n65\nNote 2.     Summary of Significant Accounting Policies\n66\nNote 3.     Revenue Recognition\n75\nNote 4.     Segment and Geographical Information\n76\nNote 5.     Receivables\n79\nNote 6.     Financing Receivables\n80\nNote 7.     Leases\n80\nNote 8.     Acquisitions, Goodwill, and Other Intangible Assets\n81\nNote 9.     Borrowings\n83\nNote 10.   Postretirement Benefit Plans\n84\nNote 11.   Income Taxes\n90\nNote 12.   Accumulated Other Comprehensive (Income) Loss – Net\n93\nNote 13.   Financial Instruments and Fair Value Measurements\n94\nNote 14.   Commitments, Guarantees, Product Warranties, and Other Loss Contingencies\n98\nNote 15.   Restructuring \nActivities\n100\nNote 16.   Share-Based Compensation\n100\nNote 17.   Earnings Per Share\n102\nNote 18.   Supplemental Financial Information\n103\nNote 19.   Related Parties\n and Tra\nnsition Services Agreement\n106\nNote 2\n0\n.   Subsequent Events\n108\n56\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the stockholders and the Board of Directors of GE HealthCare Technologies, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated statements of financial position of GE HealthCare Technologies, Inc. (the \"Company\") as of December 31, 2024 and 2023, the related consolidated and combined statements of income, comprehensive income (loss), changes in equity, and cash flows, for each of the three years in the period ended December 31, 2024, and the related notes (collectively referred to as the \"financial statements\"). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with accounting principles generally accepted in the United States of America.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control — Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated February 13, 2025, expressed an unqualified opinion on the Company's internal control over financial reporting.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter \nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nIncome Taxes – Valuation Allowance on Deferred Tax Assets — Refer to Notes 2 and 11 to the financial statements\nCritical Audit Matter Description\nThe Company recognizes deferred income taxes for tax attributes and for differences between the financial statement and tax basis of assets and liabilities at enacted statutory tax rates in effect for the years in which the deferred tax liability or asset is expected to be settled or realized. A valuation allowance is provided to offset deferred tax assets if, based upon the available evidence, it is more likely than not that some or all of the deferred tax assets will not be realized. Future realization of deferred tax assets depends on the existence of sufficient taxable income of the appropriate character. Sources of taxable income include future reversals of deferred tax assets and liabilities, expected future taxable income, taxable income in prior carryback years if permitted under the tax law, and tax planning strategies.\nThe Company’s determination of the valuation allowance for certain deferred tax assets involves judgments and estimates, including the projected timing and pattern of future reversals of existing taxable temporary differences and the projection of future sources of taxable income. Auditing management’s projected timing and pattern of future reversals of existing taxable temporary differences and the projection of future sources of taxable income, which affect the recorded valuation allowances for certain deferred tax assets, required a high degree of auditor judgment and an increased extent of effort, including the need to involve our income tax specialists.\n57\nHow the Critical Audit Matter Was Addressed in the Audit\nWith the assistance of our income tax specialists, our audit procedures related to the determination that it is more likely than not that sufficient taxable income will be generated in the future to realize certain net deferred tax assets included the following, among others: \n•\nWe considered relevant tax laws and regulations in evaluating the appropriateness of management’s estimates of future sources of taxable income.\n•\nWe evaluated the reasonableness of management’s estimates of future sources of taxable income by comparing the estimates to historical sources of taxable income or loss.\n•\nWe evaluated management’s projected timing and projected pattern of the reversals of existing taxable temporary differences.\n•\nWe evaluated whether the estimated future sources of taxable income were of the appropriate character to utilize the deferred tax assets under tax law.\n/s/ \nDeloitte & Touche LLP\nChicago, Illinois\nFebruary 13, 2025\nWe have served as the Company’s auditor since 2022. \nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the stockholders and the Board of Directors of GE HealthCare Technologies Inc.\nOpinion on Internal Control over Financial Reporting\nWe have audited the internal control over financial reporting of GE HealthCare Technologies Inc. (the “Company”) as of December 31, 2024, based on criteria established in Internal Control — Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control — Integrated Framework (2013) issued by COSO.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated financial statements as of and for the year ended December 31, 2024, of the Company and our report dated February 13, 2025, expressed an unqualified opinion on those financial statements.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\n58\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ \nDeloitte & Touche LLP\nChicago, Illinois\nFebruary 13, 2025\n59\nConsolidated and Combined Statements of Income\nFor the years ended December 31\n(In millions, except per share amounts)\n2024\n2023\n2022\nSales of products\n$\n13,075\n \n$\n13,127\n \n$\n12,044\n \nSales of services\n6,597\n \n6,425\n \n6,297\n \nTotal revenues\n19,672\n \n19,552\n \n18,341\n \nCost of products\n8,271\n \n8,465\n \n7,975\n \nCost of services\n3,196\n \n3,165\n \n3,187\n \nGross profit\n8,205\n \n7,922\n \n7,179\n \nSelling, general, and administrative\n4,269\n \n4,282\n \n3,631\n \nResearch and development\n1,311\n \n1,205\n \n1,026\n \nTotal operating expenses\n5,580\n \n5,487\n \n4,657\n \nOperating income\n2,625\n \n2,435\n \n2,522\n \nInterest and other financial charges – net\n504\n \n542\n \n77\n \nNon-operating benefit (income) costs\n(\n406\n)\n(\n382\n)\n(\n5\n)\nOther (income) expense – net\n(\n55\n)\n(\n86\n)\n(\n62\n)\nIncome from continuing operations before income taxes\n2,581\n \n2,361\n \n2,512\n \nBenefit (provision) for income taxes\n(\n531\n)\n(\n743\n)\n(\n563\n)\nNet income from continuing operations\n2,050\n \n1,618\n \n1,949\n \nIncome (loss) from discontinued operations, net of taxes\n—\n \n(\n4\n)\n18\n \nNet income\n2,050\n \n1,614\n \n1,967\n \nNet (income) loss attributable to noncontrolling interests\n(\n57\n)\n(\n46\n)\n(\n51\n)\nNet income attributable to GE HealthCare\n1,993\n \n1,568\n \n1,916\n \nDeemed preferred stock dividend of redeemable noncontrolling interest\n—\n \n(\n183\n)\n—\n \nNet income attributable to GE HealthCare common stockholders\n$\n1,993\n \n$\n1,385\n \n$\n1,916\n \nEarnings per share from continuing operations attributable to GE HealthCare common stockholders:\nBasic\n$\n4.37\n \n$\n3.06\n \n$\n4.18\n \nDiluted\n4.34\n \n3.04\n \n4.18\n \nEarnings per share attributable to GE HealthCare common stockholders:\nBasic\n$\n4.37\n \n$\n3.05\n \n$\n4.22\n \nDiluted\n4.34\n \n3.03\n \n4.22\n \nWeighted-average number of shares outstanding:\nBasic\n456\n455\n454\nDiluted\n459\n458\n454\nThe accompanying notes are an integral part of these consolidated and combined financial statements. \n60\nConsolidated and Combined Statements of Comprehensive Income (Loss)\nFor the years ended December 31\n(In millions, net of tax)\n2024\n2023\n2022\nNet income attributable to GE HealthCare\n$\n1,993\n \n$\n1,568\n \n$\n1,916\n \nNet income (loss) attributable to noncontrolling interests\n57\n \n46\n \n51\n \nNet income\n2,050\n \n1,614\n \n1,967\n \nOther comprehensive income (loss):\nCurrency translation adjustments – net of taxes\n(\n271\n)\n74\n \n(\n878\n)\nPension and Other Postretirement Plans – net of taxes\n(\n456\n)\n(\n897\n)\n58\n \nCash flow hedges – net of taxes\n36\n \n(\n27\n)\n(\n23\n)\nOther comprehensive income (loss)\n(\n691\n)\n(\n850\n)\n(\n843\n)\nComprehensive income (loss)\n1,359\n \n764\n \n1,124\n \nLess: Comprehensive income (loss) attributable to noncontrolling interests\n53\n \n9\n \n51\n \nComprehensive income attributable to GE HealthCare\n$\n1,306\n \n$\n755\n \n$\n1,073\n \nThe accompanying notes are an integral part of these consolidated and combined financial statements. \n61\nConsolidated Statements of Financial Position\nAs of\n(In millions, except share and per share amounts)\nDecember 31, 2024\nDecember 31, 2023\nCash, cash equivalents, and restricted cash\n$\n2,889\n \n$\n2,504\n \nReceivables – net of allowances of $\n103\n and $\n98\n3,564\n \n3,525\n \nDue from related parties\n5\n \n32\n \nInventories\n1,939\n \n1,960\n \nContract and other deferred assets\n974\n \n1,000\n \nAll other current assets\n529\n \n389\n \nCurrent assets\n9,901\n \n9,410\n \nProperty, plant, and equipment – net\n2,550\n \n2,500\n \nGoodwill\n13,136\n \n12,936\n \nOther intangible assets – net\n1,078\n \n1,253\n \nDeferred income taxes\n4,474\n \n4,474\n \nAll other non-current assets\n1,950\n \n1,881\n \nTotal assets\n$\n33,089\n \n$\n32,454\n \nShort-term borrowings\n$\n1,502\n \n$\n1,006\n \nAccounts payable\n3,022\n \n2,947\n \nDue to related parties\n20\n \n99\n \nContract liabilities\n1,943\n \n1,918\n \nCurrent compensation and benefits\n1,521\n \n1,518\n \nAll other current liabilities\n1,545\n \n1,493\n \nCurrent liabilities\n9,553\n \n8,981\n \nLong-term borrowings\n7,449\n \n8,436\n \nNon-current compensation and benefits\n5,583\n \n5,782\n \nDeferred income taxes\n56\n \n68\n \nAll other non-current liabilities\n1,796\n \n1,877\n \nTotal liabilities\n24,437\n \n25,144\n \nCommitments and contingencies\nRedeemable noncontrolling interests\n188\n \n165\n \nCommon stock, par value $\n0.01\n per share, \n1,000,000,000\n shares authorized, \n457,246,971\n shares issued as of December 31, 2024; \n455,342,290\n shares issued as of December 31, 2023\n5\n \n5\n \nTreasury stock, at cost, \n291,053\n shares as of December 31, 2024 and \n0\n shares as of December 31, 2023\n(\n25\n)\n—\n \nAdditional paid-in capital\n6,583\n \n6,493\n \nRetained earnings\n3,262\n \n1,326\n \nAccumulated other comprehensive income (loss) – net\n(\n1,379\n)\n(\n691\n)\nTotal equity attributable to GE HealthCare\n8,446\n \n7,133\n \nNoncontrolling interests\n18\n \n12\n \nTotal equity\n8,464\n \n7,145\n \nTotal liabilities, redeemable noncontrolling interests, and equity\n$\n33,089\n \n$\n32,454\n \nThe accompanying notes are an integral part of these consolidated and combined financial statements.\n62\nConsolidated and Combined Statements of Changes in Equity\nCommon stock\nTreasury stock\n(In millions, except per share amounts)\nShares\nAmount\nShares\nAmount\nAdditional paid-in capital\nRetained earnings\nNet parent investment\nAccumulated other comprehensive income (loss) – net\nEquity attributable to noncontrolling interests\nTotal equity\nBalances as of December 31, 2021\n—\n \n$\n—\n \n—\n \n$\n—\n \n$\n—\n \n$\n—\n \n$\n17,692\n \n$\n(\n1,037\n)\n$\n21\n \n$\n16,676\n \nNet income attributable to GE HealthCare\n— \n— \n— \n— \n— \n— \n1,916\n \n— \n— \n1,916\n \nOther comprehensive income (loss) attributable to GE HealthCare\n— \n— \n— \n— \n— \n— \n— \n(\n841\n)\n— \n(\n841\n)\nTransfers (to) from GE\n— \n— \n— \n— \n— \n— \n(\n8,373\n)\n— \n— \n(\n8,373\n)\nChanges in equity attributable to noncontrolling interests\n— \n— \n— \n— \n— \n— \n— \n— \n(\n16\n)\n(\n16\n)\nBalances as of December 31, 2022\n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n11,235\n \n(\n1,878\n)\n5\n \n9,362\n \nNet transfers from GE, including Spin-Off-related adjustments\n— \n— \n— \n— \n— \n— \n(\n4,851\n)\n2,000\n \n2\n \n(\n2,849\n)\nIssuance of common stock in connection with the Spin-Off and reclassification of net parent investment\n454\n \n5\n \n— \n— \n6,379\n \n— \n(\n6,384\n)\n— \n— \n—\n \nIssuance of shares under equity awards, net of shares withheld for taxes and other\n1\n \n— \n— \n— \n— \n— \n— \n— \n— \n— \nNet income attributable to GE HealthCare\n— \n— \n— \n— \n— \n1,568\n \n— \n— \n— \n1,568\n \nDividends declared ($\n0.12\n per common share)\n— \n— \n— \n— \n— \n(\n55\n)\n— \n— \n— \n(\n55\n)\nOther comprehensive income (loss) attributable to GE HealthCare\n— \n— \n— \n— \n— \n— \n— \n(\n813\n)\n— \n(\n813\n)\nChanges in equity attributable to noncontrolling interests\n— \n— \n— \n— \n— \n— \n— \n— \n5\n \n5\n \nShare-based compensation\n— \n— \n— \n— \n114\n \n— \n— \n— \n— \n114\n \nChanges in equity due to redemption value adjustments on redeemable noncontrolling interests\n— \n— \n— \n— \n— \n(\n187\n)\n— \n— \n— \n(\n187\n)\nBalances as of December 31, 2023\n455\n \n5\n \n—\n \n—\n \n6,493\n \n1,326\n \n—\n \n(\n691\n)\n12\n \n7,145\n \nIssuance of shares under equity awards, net of shares withheld for taxes and other\n2\n \n— \n— \n(\n25\n)\n(\n35\n)\n— \n— \n— \n— \n(\n60\n)\nNet income attributable to GE HealthCare\n— \n— \n— \n— \n— \n1,993\n \n— \n— \n— \n1,993\n \nDividends declared ($\n0.125\n per common share)\n— \n— \n— \n— \n— \n(\n58\n)\n— \n— \n— \n(\n58\n)\nOther comprehensive income (loss) attributable to GE HealthCare\n— \n— \n— \n— \n— \n— \n— \n(\n688\n)\n— \n(\n688\n)\nChanges in equity attributable to noncontrolling interests    \n— \n— \n— \n— \n— \n— \n— \n— \n7\n \n7\n \nShare-based compensation\n— \n— \n— \n— \n125\n \n— \n— \n— \n— \n125\n \nBalances as of December 31, 2024\n457\n \n$\n5\n \n—\n \n$\n(\n25\n)\n$\n6,583\n \n$\n3,262\n \n$\n—\n \n$\n(\n1,379\n)\n$\n18\n \n$\n8,464\n \nThe accompanying notes are an integral part of these consolidated and combined financial statements. \n63\nConsolidated and Combined Statements of Cash Flows\nFor the years ended December 31\n(In millions) \n2024\n2023\n2022\nNet income\n$\n2,050\n \n$\n1,614\n \n$\n1,967\n \nLess: Income (loss) from discontinued operations, net of taxes\n—\n \n(\n4\n)\n18\n \nNet income from continuing operations\n$\n2,050\n \n$\n1,618\n \n$\n1,949\n \nAdjustments to reconcile Net income from continuing operations to Cash from (used for) operating activities – continuing operations\nDepreciation of property, plant, and equipment\n268\n \n248\n \n228\n \nAmortization of intangible assets\n312\n \n362\n \n405\n \nGain on fair value remeasurement of contingent consideration\n(\n19\n)\n(\n17\n)\n(\n65\n)\nNet periodic postretirement benefit plan (income) expense\n(\n357\n)\n(\n332\n)\n9\n \nPostretirement plan contributions\n(\n332\n)\n(\n357\n)\n(\n18\n)\nShare-based compensation\n125\n \n114\n \n67\n \nProvision for income taxes\n531\n \n743\n \n563\n \nCash paid during the year for income taxes\n(\n491\n)\n(\n474\n)\n(\n851\n)\nChanges in operating assets and liabilities, excluding the effects of acquisitions:\nReceivables\n(\n178\n)\n(\n185\n)\n(\n231\n)\nDue from related parties\n25\n \n4\n \n13\n \nInventories\n(\n81\n)\n111\n \n(\n402\n)\nContract and other deferred assets\n3\n \n10\n \n(\n222\n)\nAccounts payable\n126\n \n(\n13\n)\n481\n \nDue to related parties\n(\n61\n)\n(\n84\n)\n(\n33\n)\nContract liabilities\n68\n \n26\n \n138\n \nCurrent compensation and benefits\n39\n \n153\n \n(\n37\n)\nAll other operating activities – net\n(\n74\n)\n174\n \n140\n \nCash from (used for) operating activities – continuing operations\n1,955\n \n2,101\n \n2,134\n \nCash flows – investing activities\nAdditions to property, plant and equipment and internal-use software\n(\n401\n)\n(\n387\n)\n(\n310\n)\nDispositions of property, plant, and equipment\n—\n \n1\n \n4\n \nPurchases of businesses, net of cash acquired\n(\n313\n)\n(\n147\n)\n—\n \nPurchases of investments\n(\n40\n)\n(\n48\n)\n(\n59\n)\nAll other investing activities – net\n(\n160\n)\n23\n \n(\n33\n)\nCash from (used for) investing activities – continuing operations\n(\n914\n)\n(\n558\n)\n(\n398\n)\nCash flows – financing activities\nNet increase (decrease) in borrowings (maturities of 90 days or less)\n—\n \n(\n12\n)\n9\n \nNewly issued debt, net of debt issuance costs (maturities longer than 90 days)\n995\n \n2,006\n \n8,198\n \nRepayments and other reductions (maturities longer than 90 days)\n(\n1,418\n)\n(\n855\n)\n(\n3\n)\nDividends paid to stockholders\n(\n55\n)\n(\n41\n)\n—\n \nRedemption of noncontrolling interests\n—\n \n(\n211\n)\n—\n \nNet transfers (to) from GE\n—\n \n(\n1,317\n)\n(\n8,934\n)\nProceeds from stock issued under employee benefit plans\n33\n \n34\n \n—\n \nTaxes paid related to net share settlement of equity awards\n(\n93\n)\n(\n33\n)\n—\n \nAll other financing activities – net\n(\n34\n)\n(\n49\n)\n(\n92\n)\nCash from (used for) financing activities – continuing operations\n(\n573\n)\n(\n478\n)\n(\n822\n)\nCash from (used for) operating activities – discontinued operations\n(\n4\n)\n—\n \n(\n21\n)\nEffect of foreign currency rate changes on cash, cash equivalents, and restricted cash\n(\n77\n)\n(\n10\n)\n(\n3\n)\nIncrease (decrease) in cash, cash equivalents, and restricted cash\n387\n \n1,055\n \n890\n \nCash, cash equivalents, and restricted cash at beginning of year\n2,506\n \n1,451\n \n561\n \nCash, cash equivalents, and restricted cash at end of year\n$\n2,893\n \n$\n2,506\n \n$\n1,451\n \nSupplemental disclosure of cash flows information\nCash paid during the year for interest\n$\n(\n550\n)\n$\n(\n570\n)\n$\n—\n \nNon-cash investing activities\nAcquired but unpaid property, plant, and equipment\n$\n143\n \n$\n140\n \n$\n136\n \nThe accompanying notes are an integral part of these consolidated and combined financial statements.\n64\nNOTES TO THE CONSOLIDATED AND COMBINED FINANCIAL STATEMENTS\nNOTE 1. \nORGANIZATION AND BASIS OF PRESENTATION\nORGANIZATION.\nGE HealthCare Technologies Inc. and its subsidiaries (“GE HealthCare,” the “Company,” “our,” “us,” or “we”) is a trusted partner and leading global healthcare solutions provider, innovating medical technology, pharmaceutical diagnostics, and integrated, cloud-first AI-enabled solutions, services, and data analytics. We operate at the center of the healthcare ecosystem, helping enable precision care by increasing health system capacity, enhancing productivity, digitizing healthcare delivery, and improving clinical outcomes while serving patients’ demand for greater efficiency, access, and personalized medicine. Our products, services, and solutions are designed to enable clinicians to make more informed decisions quickly and efficiently, improving patient care from screening and diagnosis to therapy and monitoring. \nOn January 3, 2023, the General Electric Company, which now operates as GE Aerospace (“GE”), completed the spin-off of GE HealthCare Technologies Inc. (the “Spin-Off”). The Spin-Off was completed through a distribution of approximately \n80.1\n% of the Company’s outstanding common stock to holders of record of GE’s common stock as of the close of business on December 16, 2022 (the “Distribution”), which resulted in the issuance of approximately \n454\n million shares of common stock. Prior to the Distribution, the Company issued \n100\n shares of common stock in exchange for $\n1.00\n, all of which were held by GE as of December 31, 2022. As a result of the Distribution, the Company became an independent public company. On April 2, 2024, GE completed the separation of its GE Vernova business into an independent publicly traded company. In the fourth quarter of 2024, GE sold its remaining ownership of the Company’s outstanding common stock. Following the share sell-down, GE continues to be reported as a related party due to the nature of our relationship and board member affiliation.\nIn connection with the Spin-Off, certain adjustments were recorded to reflect transfers from GE, the draw-down of the Term Loan Facility, and settlement of Spin-Off transactions with GE, which resulted in the net reduction in Total equity of $\n2,849\n million. These items substantially consisted of the transfer of: (1) certain pension plan liabilities and assets as described in Note 10, “Postretirement Benefit Plans,” (2) certain deferred income taxes as described in Note 11, “Income Taxes,” (3) deferred compensation liabilities of $\n548\n million, and (4) employee termination obligations as described in Note 15, “Restructuring Activities.”\nIn connection with the Spin-Off, the Company entered into or adopted several agreements that provide a framework for the relationship between the Company and GE. See Note 19, “Related Parties and Transition Services Agreement” for more information on these agreements and related transactions.\nUnless the context otherwise requires, references to “GE HealthCare,” “we,” “us,” “our,” and the “Company” refer to (1) GE’s healthcare business prior to the Spin-Off as a carve-out business of GE with related combined financial statements and (2) GE HealthCare Technologies Inc. and its subsidiaries following the Spin-Off with related consolidated financial statements.\nBASIS OF PRESENTATION.\nThe consolidated and combined financial statements and corresponding notes (the “financial statements”) have been prepared in accordance with United States (“U.S.”) generally accepted accounting principles (“U.S. GAAP”) and in accordance with the instructions to Form 10-K. In the opinion of management, all adjustments, including normal recurring adjustments, considered necessary for a fair presentation of the Company’s financial position and operating results have been included. All intercompany balances and transactions within the Company have been eliminated in the financial statements. Tables throughout this document are presented in millions of U.S. dollars unless otherwise stated and certain columns and rows may not sum due to the use of rounded numbers. Percentages presented are calculated from the underlying whole-dollar amounts.\nFor the year ended December 31, 2022, which was prior to the Spin-Off, the combined financial statements were derived from the consolidated financial statements and accounting records of GE, including the historical cost basis of assets and liabilities comprising the Company, as well as the historical revenues, direct costs, and allocations of indirect costs attributable to the operations of the Company, using the historical accounting policies applied by GE. The combined financial statements do not purport to reflect what the results of operations, comprehensive income (loss), financial position, or cash flows would have been had the Company operated as a separate, stand-alone entity prior to the Spin-Off.\nCertain prior year amounts in the financial statements and notes thereto have been reclassified to conform to the current year presentation, which provides additional detail to readers of the financial statements. Amounts related to current compensation and benefit obligations that were previously reported within the All other current liabilities and All other operating activities – net lines on the Consolidated Statements of Financial Position and Consolidated and Combined Statements of Cash Flows, respectively, have been reclassified to separate lines on the respective financial statements. Additionally on the Consolidated and Combined Statements of Cash Flows, amounts related to purchase of investments previously reported within All other investing activities – net, and amounts related to equity award activity previously reported within All other financing activities – net, have been reclassified to separate lines.\n \n65\nEffective July 1, 2024, Image Guided Therapies (“IGT”), previously part of the Imaging segment, was realigned to the Ultrasound segment to better match its clinical usage and realize stronger business and customer impact by providing the right image guidance in the right care setting. The Ultrasound segment was subsequently renamed Advanced Visualization Solutions (“AVS”). Following this realignment, the Company continues to have \nfour\n reportable segments: Imaging, AVS, Patient Care Solutions (“PCS”), and Pharmaceutical Diagnostics (“PDx”). These segments have been identified based on the nature of the products sold and how the Company manages its operations. Historical segment financial information presented within this report has been recast to conform to the new reportable segments structure.\nNOTE 2. \nSUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nESTIMATES AND ASSUMPTIONS. \nThe preparation of the financial statements in conformity with U.S. GAAP requires management to make estimates based on assumptions about current, and for some estimates, future, economic and market conditions, which affect the reported amounts and related disclosures in the financial statements. Estimates are used for, but are not limited to, determining the following: revenue from contracts with customers; recoverability of long-lived assets and inventory; valuation of goodwill and intangible assets; useful lives used in depreciation and amortization; asset retirement obligations; income taxes and related valuation allowances; accruals for contingencies including legal and product warranties; actuarial assumptions used to determine costs of pension and other postretirement benefits; valuation of pension assets; valuation and recoverability of receivables; valuation of derivatives; and valuation of assets acquired, liabilities assumed, and contingent consideration as a result of acquisitions. Actual results could differ from these estimates.\nREVENUE RECOGNITION. \nOur revenues primarily consist of sales of products and services to customers. Products include equipment, imaging agents, software-related offerings, and upgrades. Services include contractual and stand-by preventative maintenance and corrective services, as well as related parts and labor, extended warranties, training, and other service-type offerings. The Company recognizes revenue from contracts with customers when the customer obtains control of the underlying products or services.\nThe Company recognizes a contract with a customer when there is a legally enforceable agreement between the Company and its customer, the rights of the parties are identified, the contract has commercial substance, and collectability of the contract consideration is probable. The Company’s revenues are measured based on the consideration specified in the contract with each customer net of any sales incentives, discounts, returns, chargebacks, group purchasing organization fees, rebates, or credits, as well as taxes collected from customers that are remitted to government authorities. Our estimates for these deductions, which are accounted for as variable consideration, are based on historical experience and consider current and forecasted market trends. We record these estimated amounts as a reduction to revenue when we recognize the related product or service sales. Payment terms are generally within 12 months. Payment terms within 12 months are not treated as significant financing components.\nContracts for the sale of products and services often include multiple distinct performance obligations, usually involving an upfront deliverable of equipment and future performance obligations such as installation, training, or the future delivery of products or services. If a contract contains more than one performance obligation, the transaction price is allocated to each performance obligation based on relative stand-alone selling price. Stand-alone selling price is obtained from sources such as the separate selling price for that or a similar item if reasonably available. If such evidence is not reasonably available, we use our best estimate of selling price, which is established consistent with the pricing strategy of the Company and considers product configuration, geography, customer type, and other market-specific factors. \nRevenue is recognized in the period in which the customer obtains control of the underlying products or services, allowing them the ability to direct the use of, and obtain substantially all of, the remaining benefits of such product or service. This may occur at a point in time or over time. Shipping and handling costs to deliver products to customers are expensed as incurred and recognized within Cost of products or Cost of services in our Consolidated and Combined Statements of Income. \nFor standard, assurance-type warranties that are provided with products, we estimate the cost that may be incurred during the warranty period and record a liability at the time the revenue is recognized. The provision recorded reflects the estimated costs of replacement and free-of-charge services that will be incurred related to the products sold. Service-type warranties or extended warranties sold with products are considered separate performance obligations. As such, a portion of the overall transaction price is allocated to these performance obligations and recognized in revenue over time, as the performance obligations are satisfied.\nThe Company capitalizes certain direct incremental costs incurred to obtain a contract, primarily commissions. Costs to obtain a contract are classified within Contract and other deferred assets or All other non-current assets in the Consolidated Statements of Financial Position and are recognized based on the timing of when the Company expects to earn related revenues. Management assesses these costs for impairment based on periodic assessments of recoverability. \n66\nPerformance Obligations Satisfied at a Point in Time \nWe primarily recognize revenue from sales of products at the point in time that the customer obtains control, which is \ngenerally \nno earlier than when the customer has physical possession. Where arrangements include customer acceptance provisions based on customer-specified criteria, we recognize revenue when we have concluded that the customer has control of the \nproducts, which is typically at the point of acceptance\n. Our billing terms for these point-in-time product contracts generally coincide with delivery to the customer and customer acceptance; however, periodically, we transfer control of products in advance of billing or we receive customer advances and deposits from customers in advance of transfer of control of products which are recognized as contract assets or contract liabilities, respectively, in the Consolidated Statements of Financial Position. Any differences between the timing of our revenue recognition and customer billings (based on contractual terms) result in changes to our contract asset or contract liability positions. \nPerformance Obligations Satisfied Over Time \nWe recognize revenue from the sale of certain service contracts, including preventative maintenance, corrective services, and extended warranties over time on a ratable basis consistent with the nature, timing, and extent of our services, which primarily relate to routine maintenance and as-needed product repairs. Our billing terms for these contracts vary and can occur in advance of or following the period of service; however, we generally invoice periodically as services are provided. The differences between the timing of our revenue recognized and customer billings (based on contractual terms) result in changes to our contract asset or contract liability positions.\n \nSee Note 3, “Revenue Recognition” for further information.\nCASH, CASH EQUIVALENTS, AND RESTRICTED CASH. \nCash deposits, short-term investments, and high-liquidity mutual funds with original maturities of three months or less are included in Cash\n, cash equivalents, and restricted cash in the Consolidated Statements of Financial Position\n. Restricted cash primarily relates to funds restricted in connection with escrow accounts and other contractual and legal restrictions. \nFor the year ended December 31, 2022, which was prior to the Spin-Off\n, the cash presented in the Consolidated and Combined Statements of Cash Flows represents cash not subject to the GE centralized cash management process. Cash held in commingled accounts with GE, or its affiliates, is presented within Net parent investment in the Consolidated and Combined Statements of Changes in Equity.\nSee Note 18, “Supplemental Financial Information” for further information.\nINVESTMENT SECURITIES.\n \nPublicly traded equity securities for which we do not have the ability to exercise significant influence are recorded at fair value with changes in fair value recognized in Other (income) expense – net in the Consolidated and Combined Statements of Income. Privately held equity securities for which we do not have the ability to exercise significant influence are accounted for using the measurement alternative approach and are recorded at cost less impairment, if any, adjusted to fair value for any observable price changes in orderly transactions for the identical or a similar investment of the same issuer, with changes in the measurement recognized through Other (income) expense – net in the Consolidated and Combined Statements of Income. Equity investments without readily determinable fair value as of December 31, 2024 and 2023 were $\n176\n million and $\n156\n million, respectively. Investment securities are recognized within All other non-current assets in the Consolidated Statements of Financial Position.\nEQUITY METHOD INVESTMENTS. \nEquity method investments are investments in entities in which we do not have a controlling financial interest, but over which we have significant influence. Equity method investments are assessed for other-than-temporary impairment when events occur or circumstances change that indicate it is more likely than not the fair value of the asset is below its carrying value. Equity method investments are recognized within All other non-current assets in the Consolidated Statements of Financial Position. Our share of the results of equity method investments is recognized within Other (income) expense – net in the Consolidated and Combined Statements of Income.\n \nSee Note 18, “Supplemental Financial Information” for further information.\nRECEIVABLES. \nAmounts due from customers arising from the sales of products and services are recorded at the outstanding amount, less allowances for credit losses, chargebacks, and other credits. We regularly monitor the recoverability of our receivables.\nSee Note 5\n, “\nReceivables\n”\n for further information.\n67\nFINANCING RECEIVABLES. \nOur financing receivables portfolio consists of a variety of loans and leases, including both larger-balance, non-homogeneous loans and leases, and smaller-balance homogeneous loans and leases. \nLoans\n \nLoans represent term loans that are collateralized by equipment and other assets. Loans are classified as either held for sale or held for investment (“HFI”) based on management’s intent and ability to hold the loans for the foreseeable future. Loans where the Company does not have the ability and intent to hold for investment purposes and those where the Company intends to hold for sale in the foreseeable future are accounted for as loans held for sale. Loans held for sale are recorded at the lower of cost or current fair value with any fair value write-down (or change to the write-down) recorded as a valuation allowance through current period earnings in the period in which the change occurs. Loans classified as HFI are recorded at amortized cost. \nInvestment in Finance Leases \nFinance leases include mostly sales-type leases of equipment and represent net unpaid rentals and estimated unguaranteed residual values of leased equipment, less related deferred income and less the allowance for credit losses. \nSee Note 7, “Leases” for further information on our finance leases and “Allowance for credit losses” below for the Company’s policy regarding allowances for credit losses on financing receivables. \nCredit Quality Indicators \nWe manage our financing receivables portfolio using delinquency and nonaccrual data as key performance indicators. We assess the overall quality of the portfolio based on a potential risk of loss measure. The metric incorporates both the borrower’s credit quality along with any related collateral protection. Financing receivables are considered past due if default on a contractual principal or interest payment exists for a period of 30 days or more. We stop accruing interest on financing receivables at the earlier of when collection of an account becomes doubtful or the account becomes 90 days past due. Although we stop accruing interest in advance of payments, we recognize income within Other (income) expense – net in the Consolidated and Combined Statements of Income when we determine that the account is returned to accrual status, provided that the amount does not exceed that which would have been earned at the historical effective interest rate.\nSee \nNote 6, “Financing Receivables”\n for further information.\nALLOWANCE FOR CREDIT LOSSES\n. \nWhen we record customer receivables, contract assets, and financing receivables, we maintain an allowance for credit losses for the current expected credit losses. Each period, the allowance for credit losses is adjusted through earnings to reflect expected credit losses over the remaining lives of the assets. The credit losses are recognized within Selling, general, and administrative (“SG&A”) in the Consolidated and Combined Statements of Income. For financing receivables, expected credit losses are calculated based on the gross carrying amount of the financial asset, multiplied by a factor reflecting the probability of default and the loss in the event of default. \nWe routinely evaluate our entire portfolio for potential specific credit or collection issues that might indicate an impairment.\nWe estimate expected credit losses based on relevant information from past events, including historical experience, current conditions, and reasonable and supportable forecasts that affect the collectability of the reported amount. When measuring expected credit losses, we pool assets with similar credit risk characteristics. Changes in the relevant information may significantly affect the estimates of expected credit losses.\nINVENTORIES. \nInventories are stated at lower of cost or net realizable values. Cost of inventories is determined on a first-in, first-out basis.\nInventories are generally classified as current, however, based on consumption timelines, certain inventories are considered non-current and are recognized, net of related reserves, within All other non-current assets in the Consolidated Statements of Financial Position.\nAs necessary, we record provisions and write-downs for excess, slow moving, and obsolete inventory. To determine these amounts, we regularly review inventory quantities on hand and compare them to historical utilization and estimates of future product demand, market conditions, and technological developments.\nSee Note 18, “Supplemental Financial Information” for further information. \n68\nPROPERTY, PLANT, AND EQUIPMENT. \nProperty, plant, and equipment is stated at cost and is depreciated on a straight-line basis over its estimated useful life. Estimated useful lives generally range from \n8\n to \n40\n years for buildings, structures and related equipment, \n3\n to \n20\n years for machinery and equipment, and \n1\n to \n15\n years for leasehold improvements. Repair and maintenance costs are expensed as incurred. Property, plant and equipment is reviewed for impairment when events or changes in circumstances indicate that the related carrying amounts may not be recoverable. In such circumstances, assets are tested for impairment based on undiscounted cash flows and, if impaired, written down to estimated fair value based on either discounted cash flows or appraised values.\n \nSee Note 18, “Supplemental Financial Information” for further information.\nLEASES.\nLessee Arrangements\n \nAt lease commencement, we record a lease liability and corresponding right-of-use (“ROU”) asset. ROU assets are recognized within Property, plant, and equipment – net and lease liabilities are recognized within All other current liabilities and All other non-current liabilities in the Consolidated Statements of Financial Position. Options to extend a lease are included as part of the ROU lease asset and liability at commencement when it is reasonably certain the Company will exercise the option. We have elected to combine lease and non-lease components in determining our lease liability for all leased assets except our vehicle leases. Non-lease components are generally related to services that the lessor performs for the Company associated with the leased asset. As the Company’s leases typically do not provide an implicit rate, the present value of our lease liability is determined using our incremental collateralized borrowing rate at lease commencement for leases that commenced post-Spin-Off and GE’s incremental collateralized borrowing rate at lease commencement for leases that commenced pre-Spin-Off. For leases with an initial term of 12 months or less, an ROU asset and lease liability are not recognized, and lease expense is recognized on a straight-line basis over the lease term. Certain of our leases include provisions for variable lease payments which are based on, but not limited to, maintenance, insurance, taxes, index escalations, and usage-based amounts. The Company recognizes variable lease payments not included in its lease liabilities in the period in which the obligation for those payments is incurred. We review ROU assets for impairment annually or \nwhen events occur or circumstances change that \nindicate that the asset may be impaired.\nLessor Arrangements \nEquipment leased to others under operating leases is recognized within Property, plant, and equipment – net in the Consolidated Statements of Financial Position. Leases classified as sales-type leases or direct finance leases are recognized within All other current assets and All other non-current assets, respectively, in the Consolidated Statements of Financial Position. The terms of the related contracts, including the proportion of fixed versus variable payments and any options to shorten or extend the lease term or purchase the underlying asset, vary by customer.\nSee Note 6, “Financing Receivables” and Note 7, “Leases” for further information.\nGOODWILL AND OTHER INTANGIBLE ASSETS. \nGoodwill represents the excess of the purchase price over the fair value of identifiable net assets acquired in a business combination. We test goodwill for impairment at the reporting unit level annually in the fourth quarter of each year as of October 1\nst\n, or more frequently \nwhen an event occurs or circumstances change that would more likely than not reduce the fair value of a reporting unit below its carrying value. \nWhen testing goodwill for impairment, the Company may first assess qualitative factors. If an initial qualitative assessment identifies that it is more likely than not that the fair value of a reporting unit is less than its carrying value, additional quantitative testing is performed. The Company may also elect to skip the qualitative testing and proceed directly to the quantitative testing. If the quantitative testing indicates that goodwill is impaired, an impairment charge is recognized based on the difference between the reporting unit’s carrying value and its fair value.\n When performing a quantitative test, the market approach is typically used for estimating the fair values for our reporting units. Under the market approach, we estimate the fair value based on market multiples of earnings derived from comparable publicly traded companies with operating and investment characteristics similar to the reporting unit. Depending on the specific reporting unit circumstances, we may also consider performing a valuation based on an income approach. \nIt is reasonably possible that the judgments and estimates used could change in future periods.\n69\nIn-proce\nss research and development (“IPR&D”) acquired as part of a business acquisition is capitalized at fair value \nwhen acquired and is considered an indefinite-lived intangible asset. We test indefinite-lived intangible assets for impairment annually in the third quarter of each year or when events occur or circumstances change that indicate it is more likely than not the fair value of the asset is below its carrying value. When testing IPR&D for impairment, the Company may first assess qualitative factors. If an initial qualitative assessment identifies that it is more likely than not that the fair value of the IPR&D is less than its carrying value, additional quantitative testing is performed. The Company may also elect to skip the qualitative testing and proceed directly to the quantitative testing. If the quantitative testing indicates that the IPR&D is impaired, an impairment charge is recognized based on the difference between the IPR&D’s carrying value and its fair value. When the IPR&D project is complete, the asset is considered a finite-lived intangible asset and subject to an impairment test at that date. Thereafter, the resulting asset is amortized over its estimated useful life and is subject to impairment assessments in the same manner as all amortizing intangible assets.\nFor other intangible assets that are not deemed indefinite-lived, the cost of the intangible asset is amortized on a straight-line basis over the asset’s estimated useful life. Amortizable intangible assets are reviewed for impairment when events or changes in circumstances indicate that the related carrying amounts may not be recoverable. In such circumstances, they are tested for impairment based on undiscounted cash flows and, if impaired, written down to estimated fair value based on either discounted cash flows or appraised values. \nInternal-use software is software that is developed, purchased, or modified to meet internal needs and for which no substantive plan exists to sell, lease, or otherwise market the software externally. All costs associated with project tasks classified in the preliminary project development or post-implementation/operation stage are expensed as incurred. Capitalization of application development stage costs begins after both of the following occur: (1) the preliminary project development stage is completed and (2) management authorizes and commits to funding the software project and it is probable that the project will be completed and the software will be used for the purpose for which it was intended. Capitalization ceases when the project is substantially complete. Capitalized amounts are recognized within Other intangible assets – net in the Consolidated Statements of Financial Position and are amortized on a straight-line basis over the asset’s estimated useful life. \nExternal use software relates to software that is (1) intended to be sold, licensed, or marketed to our customers or (2) embedded and integral to our tangible products for which research and development (“R&D”) has been completed. Costs that are related to the conceptual formulation and design of software are expensed as incurred. Costs that are incurred after technological feasibility has been established until general release of the product are capitalized as an intangible asset and recognized within Other intangible assets – net in the Consolidated Statements of Financial Position. Capitalized costs for software to be sold, leased, or otherwise marketed are amortized on an individual product basis using straight-line amortization over the estimated useful life of the product. The Company performs regular reviews to assess whether unamortized capitalized external use software program costs remain recoverable through future revenue.\n \nSee Note 8, “Acquisitions, Goodwill, and Other Intangible Assets” for further information. \nDERIVATIVES AND HEDGING. \nWe use derivative contracts to reduce the volatility of earnings and cash flows associated with risks related to foreign currency exchange rates, interest rates, equity prices, and commodity prices. Our policy is to \nuse derivatives solely for managing risks and not for speculative purposes. \nWe employ the following hedge types: (1) cash flow hedges of foreign currency risk associated with third-party and intercompany foreign currency-denominated forecasted transactions and firm commitments, (2) net investment hedges of foreign currency risk associated with investments in foreign operations, (3) fair value hedges of interest rate risk associated with long-term borrowings, and (4) economic hedges not designated as qualifying hedging relationships of foreign currency risk associated with monetary assets and liabilities, including intercompany balances, equity price risk, and commodity price risk.\nFor net investment hedges, changes in the fair value of the components of the hedging derivatives excluded from the assessment of hedge effectiveness are deferred and amortized to earnings in the Consolidated and Combined Statements of Income using a systematic and rational method over the life of the derivative transaction.\nContracts that do not in their entirety meet the definition of a derivative instrument and are not measured at fair value may contain embedded features affecting some or all of the cash flows or value of other exchanges that would otherwise be considered derivatives when assessed separately from the host contract. Such embedded features are separated from the host contract and accounted for as a derivative measured at fair value if their economic characteristics and risks are not clearly and closely related to those of the host contract.\n \nS\nee Note 13, “Financial Instruments and Fair Value Measurements” for furthe\nr information.\n70\nINCOME TAXES.\n \nFor the year ended December 31, 2022, which was prior to the Spin-Off, the Company’s income tax provision was determined using the separate return method. As a result, actual amounts included in the consolidated financial statements of GE related to the Company may differ from the amounts included in our financial statements. For post Spin-Off periods we file tax returns on our own behalf, and our deferred taxes and actual income tax rate may differ from those in the historical pre Spin-Off periods.\nUncertain tax positions that meet the more likely than not recognition threshold are included in the financial statements. Such uncertain tax positions are measured at the largest amount of benefit that the Company believes has a greater than 50% likelihood of realization upon settlement. Our policy is to adjust these reserves when facts and circumstances change, such as the change in the technical merit of a position, an uncertain tax position is effectively settled with the relevant taxing authority, or the statute of limitations has expired. Penalties and interest related to income tax matters are recognized within Benefit (provision) for income taxes in the Consolidated and Combined Statements of Income. \nDeferred income tax balances reflect the effects of temporary differences between the carrying amounts of assets and liabilities and their respective tax basis, as well as net operating loss and tax credit carryforwards. The deferred income tax balances are stated at enacted tax rates expected to be in effect when those taxes are paid or recovered. Deferred income tax assets represent amounts available to reduce income taxes payable on taxable income in future years. We evaluate the recoverability of these future tax deductions and credits considering all available positive and negative evidence, including the impact of the Tax Matters Agreement with GE, specifically assessing the adequacy of future expected taxable income from all sources, including reversal of existing taxable temporary differences, forecasted operating earnings, taxable income in prior carryback years, if applicable, and available tax planning strategies. To the extent we consider it more likely than not that a deferred tax asset will not be recovered, a valuation allowance is established to reduce its carrying value to the amount that is more likely than not to be realized. Deferred taxes are provided for the outside basis difference of certain investments in non-U.S. affiliates and associated companies based upon our evaluation of the undistributed earnings of such entities if the permanently reinvested assumption cannot be made.\n \nSee Note 11\n, “\nIncome Taxes\n”\n for further information.\nPOSTRETIREMENT BENEFIT PLANS. \nPrior to the Spin-Off, GE sponsored plans were accounted for as multiemployer plans. Therefore, the Combined Statement of Income reflects a proportionate allocation of net periodic benefit costs for the multiemployer plans associated with the Company for the year ended December 31, 2022. \nIn connection with the Spin-Off, on January 1, 2023, GE HealthCare assumed a portion of former GE pension and other postretirement obligations and assets. The pension and other postretirement obligations assumed relate to benefits owed to current GE HealthCare employees, former GE HealthCare employees, and certain GE legacy plan participants. As of January 1, 2023, GE HealthCare established the assumed pension plans as single-employer plans, but continued to participate in legacy GE multiple-employer postretirement benefit plans sponsored by GE. \nOn January 1, 2024, we transitioned from the legacy GE multiple-employer postretirement benefit plans to a GE HealthCare sponsored single-employer postretirement benefit plan. This change did not have an impact on our results of operations or financial position.\n \nManagement accounts for the pension and postretirement plans as defined benefit plans. \nWe measure our plan assets at fair value and categorize plan assets for disclosure purposes in accordance with the fair value hierarchy\n. Certain assets for which the fair value is measured using the net asset value (“NAV”) per share (or its equivalent) as a practical expedient are excluded from the fair value hierarchy. The components of net periodic benefit costs, other than the service cost component, are recognized within Non-operating benefit (income) costs in the Consolidated and Combined Statements of Income for plans sponsored by the Company.\nWe engage third-party actuaries to assist in the determination of benefit obligations and related net periodic benefit costs. We develop significant long-term assumptions, including discount rates and the expected rate of return on assets in connection with our pension accounting. In the fourth quarter of each fiscal year and whenever a plan is determined to qualify for a remeasurement, we recognize differences between expected long-term return on plan assets and actual returns, and net actuarial gains and losses for the pension plan liabilities within the Consolidated and Combined Statements of Comprehensive Income (Loss).\nWe amortize gains and losses, as well as the effects of changes in actuarial assumptions and plan provisions, that exceed 10% of the greater of the market related value of plan assets or benefit obligations, determined as of the beginning of the year. The period over which gains and losses are amortized to earnings is generally over the average remaining life expectancy of plan participants.\n \nSee Note 10, “Postretirement Benefit Plans” for further information.\n71\nLOSS CONTINGENCIES. \nLoss contingencies are uncertain and unresolved matters that arise in the ordinary course of business and result from events that have the potential to result in a future loss. Such contingencies include, but are not limited to, product warranties, claims, litigation, environmental obligations, regulatory investigations and proceedings, product quality, and losses resulting from other events and developments. When a loss is considered probable and reasonably estimable, we record a liability in the amount of our best estimate for the loss. When there appears to be a range of possible losses with equal likelihood, liabilities are based on the low end of such range. Disclosure is provided for material loss contingencies when a loss is probable and an estimate can be made, when a loss is probable but a reasonable estimate cannot be made, and when it is reasonably possible that a loss will be incurred or the amount of a loss will exceed the recorded provision. We regularly review contingencies to determine whether the likelihood of loss has changed and to assess whether a reasonable estimate of the loss or range of loss can be made. Legal costs incurred in connection with loss contingencies are expensed as incurred.\nSee \nNote 14\n, “\nCommitments, Guarantees, Product Warranties, and Other Loss Contingencies\n” for further information. \nSUPPLY CHAIN FINANCE PROGRAMS. \nThe Company participates in voluntary supply chain finance programs which provide participating suppliers the opportunity to sell their GE HealthCare receivables to third parties at the sole discretion of both the suppliers and the third parties. We evaluate supply chain finance programs to ensure the use of a third-party intermediary to settle our trade payables does not change the nature, existence, amount, or timing of our trade payables and does not provide the Company with any direct economic benefit. If any characteristics of the trade payables change or we receive a direct economic benefit, we reclassify the trade payables to borrowings. \nIn connection with the supply chain finance programs, payment terms normally range from \n30\n to \n180\n days, depending on the underlying supplier agreements.\nSee Note 18, “Supplemental Financial Information” for further information. \nFAIR VALUE MEASUREMENTS. \nThe following sections describe the valuation methodologies we use to measure financial and non-financial instruments at fair value including certain assets within our postretirement benefit plans. Observable inputs for fair value measurements reflect market data obtained from independent sources, while unobservable inputs reflect our market assumptions. These inputs establish the following fair value hierarchy:\n•\nLevel 1 — Quoted prices for identical instruments in active markets. \n•\nLevel 2 — Quoted prices for similar instruments in active markets; quoted prices for identical or similar instruments in markets that are not active; and model-derived valuations whose inputs are observable or whose significant value drivers are observable. \n•\nLevel 3 — Significant inputs to the valuation model are unobservable. \nSee \nNote 13\n, “\nFinancial Instruments and Fair Value Measurements\n” for further information.\nRECURRING FAIR VALUE MEASUREMENTS. \nFor financial assets and liabilities measured at fair value on a recurring basis, primarily money market funds, investment securities, derivatives, and contingent consideration, fair value is the price we would receive to sell an asset or pay to transfer a liability in an orderly transaction with a market participant at the measurement date. In the absence of active markets for the identical assets or liabilities, such measurements involve developing assumptions based on market observable data and, in the absence of such data, internal information that is consistent with what market participants would use in a hypothetical transaction that occurs at the measurement date. \nMoney Market Funds\nMoney market funds are valued using pricing information from the fund managers, quoted on a daily basis, and are considered Level 2 inputs.\nInvestment Securities\nPublicly traded equity securities are valued using Level 1 quoted price inputs.\n72\nDerivatives\n \nThe majority of our derivatives are valued using model-derived offers received from financial institutions for similar over-the-counter instruments without an active market or internal models. The models maximize observable inputs including interest rates and both forward and spot prices for currencies and commodities. As of December 31, 2024 and 2023, foreign currency contracts, interest rate contracts, commodity exchange contracts, embedded derivatives, and the equity-linked total return swap were valued using Level 2 inputs.\nContingent Consideration\nWhen an acquisition involves a contingent consideration arrangement, we record on the date of acquisition a liability for the fair value of the estimated additional consideration we may be obligated to pay in the future. The fair value is based upon estimates of future financial projections under various potential scenarios using a probability-weighted expected payment model discounted to present value. The estimates used to determine the fair value are subject to significant judgment and as such are considered Level 3 inputs. We subsequently remeasure such liabilities at the end of each reporting period and record changes in the fair value within SG&A in the Consolidated and Combined Statements of Income.\nInvestments in Private Equity, Real Estate and Collective Funds held within our Postretirement Benefit Plans\nMost investments are generally valued using the NAV per share as a practical expedient for fair value provided certain criteria are met. The NAVs are determined based on the fair values of the underlying investments in the funds. Investments that are measured at fair value using the NAV practical expedient are not required to be classified in the fair value hierarchy. Investments classified within Level 3 primarily relate to real estate and private equities which are valued using unobservable inputs, primarily by discounting expected future cash flows, using comparative market multiples, third-party pricing sources, or a combination of these approaches as appropriate. See Note 10, “Postretirement Benefit Plans” for further information.\nDebt Securities held within our Postretirement Benefit Plans\nWhen available, we use quoted market prices to determine the fair value of debt securities which are Level 1 inputs. For our remaining debt securities, we obtain pricing information from an independent pricing vendor. The inputs and assumptions to the pricing vendor’s models are derived from market observable sources including benchmark yields, reported trades, broker/dealer quotes, issuer spreads, benchmark securities, bids, offers and other market-related data. These investments are classified within Level 2. See Note 10, “Postretirement Benefit Plans” for further information.\nThere were no transfers between Levels 1, 2, and 3 of the fair value hierarchy during the years ended December 31, 2024, 2023, and 2022. See Note 13, “Financial Instruments and Fair Value Measurements” for further information.\nNON-RECURRING FAIR VALUE MEASUREMENTS. \nCertain assets and liabilities are measured at fair value on a non-recurring basis. \nThese items may include financing receivables and long-lived assets reduced to fair value upon classification as held for sale and impaired equity method investments and long-lived assets, which, when written down to fair value upon an impairment, are not subsequently adjusted to fair value unless further impairment occurs. \nThe following sections describe the valuation methodologies the Company uses to measure these assets not measured on a recurring fair value basis.\nEquity Method Investments\n \nEquity method investments are initially recorded at cost and are adjusted in each period for the Company’s share of the investee’s income or loss and dividends paid. \nIn instances of impairment, equity method investments are written down to fair value using market observable data such as quoted prices when available. When market observable data is unavailable, investments are valued using either a discounted cash flow model, comparative market multiples, third-party pricing sources, or a combination of these approaches, as appropriate. These investments are generally valued using Level 3 inputs.\nEquity Investments\n Without Readily Determinable Fair Value\n \nEquity investments without readily determinable fair value, subject to a policy choice on a transaction-by-transaction basis, are accounted for under the measurement alternative at cost less impairment and adjusted to fair value for any observable price changes in or\nderly transactions for the identical or a similar investment of the same issuer. In the instance of impairment, if any, equity investments are adjusted to fair value using market observable data if available. If market observable data is not available, fair values are estimated using discounted cash flow models, comparative market multiples, or a combination of these approaches using Level 3 inputs.\nFinancing Receivables\n \nWe generally use market data, including pricing on recently closed market transactions, to value financing receivables that are held for sale. Such financing receivables are valued using Level 2 inputs. When the data is unobservable, we use valuation methodologies based on current market interest rate data adjusted for inherent credit risk. Such financing receivables are valued using Level 3 inputs. \nLong-Lived Assets\nFair values of long-lived assets are primarily developed internally and are corroborated by available external appraisal information, as applicable. \nThese assets are generally valued using Level 3 inputs.\n73\nFOREIGN CURRENCY. \nWe have determined that the functional currency for many of our international operations is the local currency, and for other international operations the functional currency is the USD. The basis of this determination is the currency in which each of the international operations primarily generates and expends cash. When the functional currency is not the USD, asset and liability accounts are translated at period-end exchange rates. The Company translates functional currency income and expense amounts to their USD equivalents using average exchange rates for the period. These translation gains and losses are recognized within Accumulated other comprehensive income (loss) – net (“AOCI”) in the Consolidated Statements of Financial Position. \nGains and losses from foreign currency transactions, such as those resulting from the settlement of monetary items in the non-functional currency and those resulting from remeasurements of monetary items, are included in Cost of products, Cost of services, SG&A, and R&D in the Consolidated and Combined Statements of Income, depending on the underlying nature of the item.\n Net gains (losses) from foreign currency transactions were $\n16\n million, $\n16\n million, and $(\n88\n) million for the years ended December 31, 2024, 2023, and 2022, respectively.\nBUSINESS COMBINATIONS. \nOur financial statements include the operations of acquired businesses from the date of acquisition. The Company accounts for acquired businesses using the acquisition method of accounting in accordance with U.S. GAAP, which requires that assets acquired and liabilities assumed be recognized at their estimated fair values as of the acquisition date. When we acquire the remaining equity ownership of a company in which we hold an equity interest, we remeasure our equity interest to fair value. Any excess of the purchase price over the assigned values of the net assets acquired is recorded as Goodwill. Transaction costs are expensed as incurred. For those arrangements that involve potential future contingent consideration, on the date of acquisition we record a liability equal to the fair value of the estimated additional consideration we may be obligated to pay in the future.\n \nSee Note 8, “Acquisitions, Goodwill, and Other Intangible Assets” and Note 13, “Financial Instruments and Fair Value Measurements” for further information. \nDISCONTINUED OPERATIONS. \nCertain of our operations have been presented as discontinued. We present businesses whose disposal represents a strategic shift that has, or will have, a major effect on our operations and financial results as discontinued operations when the components meet the criteria for held for sale, are sold, or are spun-off. Presentation as discontinued operations is consistent for all periods presented.\nRESTRUCTURING COSTS. \nWe record liabilities for costs associated with exit or disposal activities in the period in which the liability is incurred. Employee termination costs are accrued when the restructuring actions are probable and estimable. Costs for one-time termination benefits in which the employee is required to render service until termination in order to receive the benefits are recognized ratably over the future service period.\n \nSee Note 15, “Restructuring Activities” for further information.\nRESEARCH AND DEVELOPMENT. \nThe Company conducts R&D activities to create new products, develop new applications for existing products, and enhance existing products. Clinical study and certain research costs are recognized over the service periods specified in the contracts and adjusted as necessary based upon an ongoing review of the level of effort and costs actually incurred. R&D costs are expensed as incurred. \nIn certain instances, R&D activities may be funded by third parties, including government entities. These R&D funding arrangements may include upfront payments, R&D cost sharing payments, and future milestone payments that may be based upon the occurrence of future R&D or commercialization events. Payments received as part of the R&D funding arrangements are generally presented as an offset to R&D expense.\n \nCOLLABORATIVE ARRANGEMENTS.\nWe enter into collaborative arrangements primarily related to development of new products. A collaborative arrangement is a contractual arrangement that involves two or more parties who are active participants in the activity, and are exposed to significant risks and rewards dependent on the commercial success of the activity. The assessment for a collaborative arrangement is performed throughout the life of the arrangement based on changes in the responsibilities of all parties. Amounts that are owed by collaboration partners related to R&D activities are generally presented as an offset to R&D expense.\n \nSee Note 18, “Supplemental Financial Information” for further information. \n74\nACCOUNTING CHANGES.\nAccounting Standards Codification (“ASC”) Topic 740, \nIncome Taxes\n, provides that interest related to unrecognized income tax benefits may either be classified as income tax expense or interest expense in the consolidated statements of operations. In the first quarter of 2023, the Company changed its accounting policy for presentation of interest expense on uncertain tax positions. The interest wa\ns previously presented within Interest and other financial charges – net and has changed to being presented within Benefit (provision) for income taxes. The Company believes this presentation is preferable because the cost is related to income tax matters and this presentation enhances comparability with our peers. The effects of the change in accounting have been prospectively applied to periods beginning in the first quarter of 2023 and were not material to any previously reported periods prior to March 31, 2023. \nRecent Accounting Pronouncements Reflected in These Consolidated and Combined Financial Statements\nIn November 2023, the Financial Accounting Standards Board (“FASB”) issued Accounting Standards Update (“ASU”) No. 2023-07 (“ASU 2023-07”), \nSegment Reporting (Topic 280): Improvements to Reportable Segment Disclosures\n. ASU 2023-07 requires annual and interim disclosures that are expected to improve reportable segment disclosures, primarily through enhanced disclosures about significant segment expenses. The provisions of ASU 2023-07 are effective for fiscal years beginning after December 15, 2023, and interim periods within fiscal years beginning after December 15, 2024, with early adoption permitted. The Company adopted ASU 2023-07 for the year ended December 31, 2024, retrospectively applied to all prior periods presented in the financial statements. See Note 4, “Segment and Geographical Information” for further information.\nOther Recent Accounting Pronouncements\nIn December 2023, the FASB issued ASU No. 2023-09 (“ASU 2023-09”), \nIncome Taxes (Topic 740): Improvements to Income Tax Disclosures\n. ASU 2023-09 addresses investor requests for more transparency about income tax information through improvements to income tax disclosures primarily related to the rate reconciliation and income taxes paid information. This update also includes certain other amendments to improve the effectiveness of income tax disclosures. The provisions of ASU 2023-09 are effective for annual periods beginning after December 15, 2024, with early adoption permitted. We are currently evaluating the effect that ASU 2023-09 will have on the disclosures in our notes to the financial statements.\nIn November 2024, the FASB issued ASU No. 2024-03 (“ASU 2024-03”), \nIncome Statement - Reporting Comprehensive Income - Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses\n. ASU 2024-03 addresses investor requests for more transparency about expense information through the disaggregation of relevant expense captions in the notes to the financial statements. The provisions of ASU 2024-03 are effective for fiscal years beginning after December 15, 2026 and interim periods within fiscal years beginning after December 15, 2027, with early adoption permitted. We expect the adoption to impact disclosures in our notes to the financial statements.\nNOTE 3. \nREVENUE RECOGNITION\nCONTRACT AND OTHER DEFERRED ASSETS.\nContract assets reflect revenue recognized on contracts with customers in excess of billings based on contractual terms. Contract assets are classified as current or non-current based on the amount of time expected to lapse until the Company’s right to consideration becomes unconditional. Other deferred assets consist of costs to obtain contracts, primarily commissions, other cost deferrals for shipped products, and deferred service, labor, and direct overhead costs.\nAs of\nDecember 31, 2024\nDecember 31, 2023\nContract assets\n$\n589\n \n$\n600\n \nOther deferred assets\n385\n \n400\n \nContract and other deferred assets\n974\n \n1,000\n \nNon-current contract assets\n(1)\n103\n \n72\n \nNon-current other deferred assets\n(1)\n105\n \n96\n \nTotal contract and other deferred assets\n$\n1,183\n \n$\n1,168\n \n(1)\nNon-current contract and other deferred assets are recognized within All other non-current assets in the Consolidated Statements of Financial Position.\nCapitalized costs to obtain a contract were $\n217\n million and $\n213\n million as of December 31, 2024 and 2023, respectively. Generally, these costs are recognized within \ntwo years\n of being capitalized. When recognized, the costs to obtain a contract are recorded within SG&A in the Consolidated and Combined Statements of Income.\n75\nCONTRACT LIABILITIES.\nContract liabilities include customer advances and deposits received when orders are placed and billed in advance of completion of performance obligations. Contract liabilities are classified as current or non-current based on the periods over which these remaining performance obligations are expected to be satisfied with our customers.\nAs of December 31, 2024 and 2023, contract liabilities were approximately $\n2,629\n million and $\n2,623\n million, respectively, of which the non-current portion of $\n686\n million and $\n705\n million, respectively, was recognized in All other non-current liabilities in the Consolidated Statements of Financial Position. Revenue recognized related to the contract liabilities balance at the beginning of the year was approximately $\n1,585\n million and $\n1,554\n million for the years ended December 31, 2024 and 2023, respectively.\nREMAINING PERFORMANCE OBLIGATIONS.\nRemaining performance obligations (“RPO”) represents the estimated revenue expected from customer contracts that are partially or fully unperformed inclusive of amounts deferred in contract liabilities, excluding contracts, or portions thereof, that provide the customer with the right to cancel or terminate without incurring a substantive penalty.\nAs of\nDecember 31, 2024\nDecember 31, 2023\nProducts\n$\n4,755\n$\n4,930\nServices    \n9,737\n9,725\nTotal RPO\n    \n$\n14,491\n$\n14,655\nWe expect to recognize substantially all of the revenue for our product-related RPO within \ntwo years\n and services-related RPO within \nfive years\n.\nNOTE 4. \nSEGMENT AND GEOGRAPHICAL INFORMATION\nEffective July 1, 2024, Image Guided Therapies, previously part of the Imaging segment, was realigned to the Ultrasound segment. The Ultrasound segment was subsequently renamed Advanced Visualization Solutions. Following this realignment, the Company continues to have \nfour\n reportable segments: Imaging, AVS, PCS, and PDx. Historical segment financial information presented within this report has been recast to conform to the new reportable segments structure.\nThe Company’s organizational structure is based upon the availability of separate financial information that is evaluated regularly by the Company’s Chief Operating Decision Maker (“CODM”) for the purpose of assessing performance and allocating resources. The Company’s CODM is its Chief Executive Officer. These segments have been identified based on the nature of the products sold and how the Company manages its operations. We have not aggregated any of our operating segments to form reportable segments. A description of our reportable segments has been provided in Item 1, “Business” of this Annual Report on Form 10-K.\nThe CODM assesses segment performance using Total revenues and an earnings metric defined as “Segment EBIT.” Segment EBIT is calculated as income before income taxes in our Consolidated and Combined Statements of Income excluding the impact of the following: Interest and other financial charges – net, Non-operating benefit (income) costs, restructuring costs, acquisition and disposition-related benefits (charges), gain (loss) on business and asset dispositions, Spin-Off and separation costs, amortization of acquisition-related intangible assets, and investment revaluation gain (loss). Segment EBIT is also used in the annual budget and periodic forecasting processes and informs the CODM in decision making regarding the allocation of resources to the segments.\n76\nTotal Revenues by Segment\nFor the years ended December 31\n2024\n2023\n2022\nTotal Imaging\n$\n8,855\n \n$\n8,944\n \n$\n8,395\n \nAVS:\nProcedural Guidance\n2,711\n \n2,666\n \n2,327\n \nSpecialized Ultrasound\n2,420\n \n2,428\n \n2,685\n \nTotal AVS\n5,131\n \n5,094\n \n5,012\n \nPCS:\nMonitoring Solutions\n2,194\n \n2,283\n \n2,092\n \nLife Support Solutions\n931\n \n859\n \n824\n \nTotal PCS\n3,125\n \n3,142\n \n2,916\n \nTotal PDx\n2,508\n \n2,306\n \n1,958\n \nOther\n(1)\n52\n \n66\n \n60\n \nTotal revenues\n$\n19,672\n \n$\n19,552\n \n$\n18,341\n \n(1) Financial information not presented within the reportable segments, shown within the Other category, represents Hea\nlthCar\ne Financial Services (“HFS”) which does not meet the definition of an operating segment.\nNo single customer accounted for more than 10% of the Company’s revenues for the years ended December 31, 2024, 2023, or 2022. Additionally, no single customer accounted for more than 10% of accounts receivable as of December 31, 2024 or 2023.\nSignificant Expenses by Segment\nFor the years ended December 31\n2024\n2023\n2022\nImaging:\nCost of sales\n$\n5,623\n \n$\n5,901\n \n$\n5,660\n \nOther segment items\n(1)\n2,270\n \n2,222\n \n1,955\n \nTotal Imaging\n$\n7,893\n \n$\n8,123\n \n$\n7,615\n \nAVS:\nCost of sales\n$\n2,485\n \n$\n2,485\n \n$\n2,472\n \nOther segment items\n(1)\n1,528\n \n1,485\n \n1,312\n \nTotal AVS\n$\n4,014\n \n$\n3,970\n \n$\n3,784\n \nPCS:\nCost of sales\n$\n1,930\n \n$\n1,890\n \n$\n1,839\n \nOther segment items\n(1)\n848\n \n869\n \n736\n \nTotal PCS\n$\n2,778\n \n$\n2,759\n \n$\n2,575\n \nPDx:\nCost of sales\n$\n1,236\n \n$\n1,192\n \n$\n1,005\n \nOther segment items\n(1)\n490\n \n497\n \n433\n \nTotal PDx\n$\n1,725\n \n$\n1,689\n \n$\n1,438\n \n(1) Other segment items for each segment includes selling, general, administrative, research, and development related expenses, as well as other segment income and expenses\n.\n77\nSegment EBIT\nFor the years ended December 31\n2024\n2023\n2022\nSegment EBIT\nImaging\n$\n962\n \n$\n821\n \n$\n780\n \nAVS\n1,118\n \n1,124\n \n1,228\n \nPCS \n347\n \n383\n \n341\n \nPDx \n783\n \n617\n \n520\n \nOther\n(1)\n2\n \n11\n \n(\n8\n)\n3,211\n \n2,956\n \n2,861\n \nRestructuring costs\n(\n120\n)\n(\n54\n)\n(\n146\n)\nAcquisition and disposition-related benefits (charges)\n(\n3\n)\n15\n \n34\n \nGain (loss) on business and asset dispositions\n—\n \n—\n \n1\n \nSpin-Off and separation costs\n(\n251\n)\n(\n270\n)\n(\n14\n)\nAmortization of acquisition-related intangible assets\n(\n137\n)\n(\n127\n)\n(\n121\n)\nInvestment revaluation gain (loss)\n(\n22\n)\n1\n \n(\n31\n)\nInterest and other financial charges – net\n(\n504\n)\n(\n542\n)\n(\n77\n)\nNon-operating benefit income (costs)\n406\n \n382\n \n5\n \nIncome before income taxes\n$\n2,581\n \n$\n2,361\n \n$\n2,512\n \n(1) Financial information not presented within the reportable segments, shown within the Other category, primarily represents HFS which does not meet the definition of an operating segment.\nThe following table represents the depreciation and amortization amounts reported within the Segment EBIT metric for our reportable segments. Depreciation and amortization expense related to shared property, plant, and equipment and intangibles, exclusive of acquisition-related intangible assets, has been fully allocated to our segments and those allocations are reflected in the amounts presented in the table below. These amounts are included within Cost of sales and Other segment items disclosed in the Significant Expenses by Segment table above.\nDepreciation and Amortization by Segment\nFor the years ended December 31\n2024\n2023\n2022\nImaging\n$\n249\n \n$\n274\n \n$\n282\n \nAVS\n78\n \n90\n \n105\n \nPCS \n55\n \n69\n \n73\n \nPDx \n55\n \n45\n \n45\n \nThe Company does not report total assets by segment as the Company’s CODM does not assess performance, make strategic decisions, or allocate resources based on assets.\nGEOGRAPHIC INFORMATION.\nRevenues are classified according to the country in which products and services are sold.\nTotal Revenues by Country\nFor the years ended December 31\n2024\n2023\n2022\nUnited States\n$\n8,617\n \n$\n8,228\n \n$\n7,819\n \nChina\n2,135\n \n2,560\n \n2,325\n \nAll other countries\n8,919\n \n8,764\n \n8,197\n \nTotal revenues\n$\n19,672\n \n$\n19,552\n \n$\n18,341\n \nLong-lived assets represent Property, plant, and equipment – net and are classified according to the country where the asset is located.\n78\nLong-Lived Assets – Net by Country\nAs of\nDecember 31, 2024\nDecember 31, 2023\nUnited States\n$\n908\n \n$\n913\n \nChina\n392\n \n391\n \nNorway\n296\n \n286\n \nAll other countries\n955\n \n910\n \nTotal long-lived assets – net\n$\n2,550\n \n$\n2,500\n \nNOTE 5. \nRECEIVABLES\nCurrent Receivables\nAs of\nDecember 31, 2024\nDecember 31, 2023\nCurrent customer receivables\n(1)\n$\n3,382\n \n$\n3,339\n \nNon-income based tax receivables\n155\n \n166\n \nOther sundry receivables\n131\n \n118\n \nCurrent sundry receivables\n286\n \n284\n \nAllowance for credit losses\n(\n103\n)\n(\n98\n)\nTotal current receivables – net\n$\n3,564\n \n$\n3,525\n \n(1) Chargebacks, which are primarily related to our PDx business, are generally settled through issuance of credits, typically within one month of initial recognition, and are recorded as a reduction to current customer receivables. Balances related to chargebacks were $\n153\n million and $\n144\n million as of December 31, 2024 and 2023, respectively.\nActivity in the allowance for credit losses related to current receivables consisted of the following:\nFor the years ended December 31\n2024\n2023\n2022\nBalance at beginning of period\n$\n98\n \n$\n91\n \n$\n107\n \nAdditions charged to costs and expenses\n20\n \n16\n \n2\n \nWrite-offs\n(\n12\n)\n(\n11\n)\n(\n13\n)\nForeign currency exchange and other\n(\n2\n)\n2\n \n(\n5\n)\nBalance at end of period \n$\n103\n \n$\n98\n \n$\n91\n \nLong-Term Receivables\nAs of\nDecember 31, 2024\nDecember 31, 2023\nLong-term customer receivables\n$\n59\n \n$\n55\n \nNon-income based tax receivables\n20\n \n26\n \nOther sundry receivables\n68\n \n73\n \nLong-term sundry receivables\n88\n \n99\n \nAllowance for credit losses\n(1)\n(\n5\n)\n(\n30\n)\nTotal long-term receivables – net\n(2)\n$\n142\n \n$\n124\n \n(1) For the year ended December 31, 2024, the decrease in the Allowance for credit losses is driven by a $\n25\n million write-off of a long-term receivable that was fully reserved as of December 31, 2023. Write-offs of long-term receivables were \nno\nt material for the year ended December 31, 2023.\n(2) Long-term receivables are recognized within All other non-current assets in the Consolidated Statements of Financial Position.\n79\nNOTE 6. \nFINANCING RECEIVABLES\nCurrent and Non-current Financing Receivables\nAs of\nDecember 31, 2024\nDecember 31, 2023\nLoans receivable, at amortized cost\n$\n23\n \n$\n29\n \nInvestment in finance leases, net of deferred income\n69\n \n71\n \nAllowance for credit losses\n(\n2\n)\n(\n3\n)\nCurrent financing receivables – net\n(1)\n90\n \n97\n \nLoans receivable, at amortized cost\n35\n \n37\n \nInvestment in finance leases, net of deferred income\n152\n \n146\n \nAllowance for credit losses\n(\n4\n)\n(\n5\n)\nNon-current financing receivables – net\n(1)\n$\n183\n \n$\n178\n \n(1) Current financing receivables and non-current financing receivables are recognized within All other current assets and All other non-current assets, respectively, in the Consolidated Statements of Financial Position.\nAs of \nDecember 31, 2024\n, \n4\n%, \n4\n%, and \n3\n% \nof financing receivables were over 30 days past due, over 90 days past due, and on nonaccrual, respectively, with the majority of nonaccrual financing receivables secured by collateral. As of \nDecember 31, 2023\n, \n5\n%, \n5\n%, and \n6\n% of financing receivables were over 30 days past due, over 90 days past due, and on nonaccrual, respectively, with the majority of nonaccrual financing receivables secured by collateral.\nNOTE 7. \nLEASES\nOPERATING LEASES.\n \nAs a lessee, the Company leases certain logistics, office, and manufacturing facilities, as well as vehicles and other equipment. Certain of the Company’s leases may include options to extend. Our ROU operating lease assets are recognized within \nProperty, plant, and equipment – net\n in the Consolidated Statements of Financial Position. \nOur operating lease liabilities are recognized within \nAll other current liabilities\n and \nAll other non-current liabilities\n in the Consolidated Statements of Financial Position, as detailed below.\nOperating Lease Assets and Liabilities\nAs of\nDecember 31, 2024\nDecember 31, 2023\nOperating lease ROU assets\n$\n364\n \n$\n356\n \nCurrent operating lease liabilities\n115\n \n110\n \nNon-current operating lease liabilities\n270\n \n273\n \nTotal operating lease liabilities\n$\n385\n \n$\n383\n \nOperating Lease Expense\nFor the years ended December 31\n2024\n2023\n2022\nLong-term (fixed)\n$\n134\n \n$\n121\n \n$\n115\n \nLong-term (variable)\n120\n \n106\n \n98\n \nShort-term\n4\n \n2\n \n4\n \nTotal operating lease expense\n$\n258\n \n$\n229\n \n$\n217\n \nMaturity of Lease Liabilities\n2025\n2026\n2027\n2028\n2029\nThereafter\nTotal\nUndiscounted lease payments\n$\n129\n \n$\n113\n \n$\n77\n \n$\n40\n \n$\n24\n \n$\n41\n \n$\n425\n \nLess: imputed interest\n40\n \nTotal lease liability as of December 31, 2024\n$\n385\n \n80\nSupplemental Information Related to Operating Leases\nFor the years ended December 31\n2024\n2023\n2022\nOperating cash flows used for operating leases\n$\n138\n$\n130\n$\n113\nRight-of-use assets obtained in exchange for new lease liabilities\n147\n154\n98\nWeighted-average remaining lease term (in years)\n4.4\n4.7\n4.4\nWeighted-average discount rate\n4.5\n \n%\n4.4\n \n%\n3.8\n \n%\nFINANCE LEASES. \nThe Company leases equipment manufactured or sold by the Company to customers through sales-type leases. Sales-type leases are included in financing receivables and are recognized within All other current assets and All other non-current assets in the Consolidated Statements of Financial Position.\nFinance lease income was\n $\n14\n million\n, \n$\n13\n million,\n and \n$\n12\n million for the years ended December 31, 2024, 2023, and 2022, respectively, and is recognized within Other (income) expense – net i\nn the Consolidated and Combined Statements of Income.\nNet Investment in Finance Leases\nAs of\nDecember 31, 2024\nDecember 31, 2023\nMinimum lease payments receivable\n$\n242\n \n$\n236\n \nLess: deferred income\n(\n31\n)\n(\n30\n)\nDiscounted lease receivable\n211\n \n206\n \nEstimated unguaranteed residual value of leased assets, net of deferred income\n10\n \n11\n \nInvestment in finance leases, net of deferred income\n$\n221\n \n$\n217\n \nContractual Maturities\nDue In\n2025\n2026\n2027\n2028\n2029\nThereafter\nTotal\nMinimum lease payments receivable\n$\n77\n \n$\n61\n \n$\n38\n \n$\n27\n \n$\n17\n \n$\n22\n \n$\n242\n \nWe expect actual maturities to differ from contractual maturities, primarily as a result of prepayments.\nNOTE 8. \nACQUISITIONS, GOODWILL, AND OTHER INTANGIBLE ASSETS\nPROPOSED ACQUISITION.\nOn December 1, 2024, we announced an agreement to acquire the remaining stake in the Nihon Medi-Physics Co., Ltd (“NMP”) equity method investment to assume full ownership. NMP is a leading pharmaceutical manufacturer in Japan, focused on radiopharmaceuticals, which are used to enable clinical images across neurology, cardiology, and oncology procedures, as well as nonclinical and clinical development of radiotracers and theranostics research. Their product portfolio includes several GE HealthCare radiopharmaceuticals. The transaction is expected to close in early 2025, subject to customary closing conditions, including regulatory approval.\nACQUISITIONS.\nMIM Software\nOn April 1, 2024, the Company acquired \n100\n% of the stock of MIM Software Inc. (“MIM Software”) for approximately $\n259\n million, net of cash acquired of $\n11\n million, and potential contingent payments valued at $\n13\n million pertaining to achievement of certain milestones, for a total preliminary purchase price of $\n283\n million. The acquisition included up to $\n23\n million of other contingent payments based on service requirements. The acquisition was funded with cash on hand. This transaction was accounted for as a business combination. The preliminary purchase price allocation resulted in goodwill of $\n194\n million, customer-related intangible assets of $\n52\n million, developed technology intangible assets of $\n48\n million, net deferred tax liabilities of $\n18\n million, and other net assets of $\n7\n million. Purchase price allocations are based on preliminary valuations. Our estimates and assumptions are subject to change within the measurement period. The goodwill associated with the acquired business, recorded within the Imaging segment, is non-deductible for tax purposes and is attributed to expected synergies and commercial benefits from use of the MIM Software technology in our existing GE HealthCare portfolio. MIM Software is a global provider of medical imaging analysis and artificial intelligence (“AI”) solutions for the practice of radiation oncology, molecular radiotherapy, diagnostic imaging, and urology at imaging centers, hospitals, specialty clinics, and research organizations worldwide. \n81\nRevenue and earnings of MIM Software included in the Company’s financial statements since the acquisition date are not material to our consolidated revenue and earnings. If the acquisition of MIM Software had taken place as of the beginning of 2023, consolidated revenues and earnings would not have been significantly different from reported amounts.\nCaption Health\nOn February 17, 2023, the Company acquired \n100\n% of the stock of Caption Health, Inc. (“Caption Health”) for $\n127\n million of upfront payment, $\n10\n million of future holdback payment, and potential earn-out payments valued at $\n13\n million based primarily on various milestones and sales targets. This transaction was accounted for as a business combination. The preliminary purchase price allocation resulted in goodwill of $\n94\n million, intangible assets of $\n60\n million, and deferred tax liabilities of $\n3\n million. The purchase price allocation for Caption Health was finalized in the first quarter of 2024 without material adjustments. The goodwill associated with the acquired business is non-deductible for tax purposes and is reported in the AVS segment. Caption Health is an AI company whose technology expands access to AI-guided ultrasound screening for novice users.\nGOODWILL.\nAs discussed in Note 4, “Segment and Geographical Information”, effective in the third quarter of 2024, the Company (1) reorganized its operations and moved responsibility for and reporting of IGT from the Imaging segment to the Ultrasound Segment and (2) renamed the Ultrasound segment the AVS segment. This resulted in a $\n1,031\n million increase in the Company’s allocation of goodwill to its AVS segment and a corresponding decrease in the goodwill allocated to the Imaging segment. \nThe Company allocated goodwill to its new reporting units using a relative fair value approach. In connection with this change in reportable segments in the third quarter of 2024, the Company evaluated the goodwill of our Imaging and AVS reporting units for impairment before and after the segment realignment. There were \nno\n impairments identified as part of these assessments.\nImaging\nAVS\nPCS\nPDx\nTotal\nBalance at December 31, 2022\n$\n4,409\n \n$\n3,835\n \n$\n2,036\n \n$\n2,533\n \n$\n12,813\n \nAcquisitions\n(1)\n16\n \n94\n \n—\n \n—\n \n110\n \nForeign currency exchange and other\n6\n \n4\n \n2\n \n1\n \n13\n \nBalance at December 31, 2023\n4,431\n \n3,933\n \n2,038\n \n2,534\n \n12,936\n \nReallocation\n(\n1,031\n)\n1,031\n \n—\n \n—\n \n—\n \nAcquisitions\n(1)\n194\n \n42\n \n—\n \n—\n \n236\n \nForeign currency exchange and other\n(\n13\n)\n(\n19\n)\n(\n3\n)\n(\n1\n)\n(\n36\n)\nBalance at December 31, 2024\n$\n3,581\n \n$\n4,987\n \n$\n2,035\n \n$\n2,533\n \n$\n13,136\n \n(1) Includes the acquisition of Intelligent Ultrasound Group PLC in our AVS segment in the fourth quarter of 2024 and IMACTIS SAS in our Imaging segment in the second quarter of 2023.\nThe Company performs an impairment test of goodwill annually in the fourth quarter. In 2024, the Company performed quantitative testing for all reporting units that carried goodwill. The quantitative testing conducted concluded that \nno\n goodwill impairments existed. In 2023, a qualitative assessment was performed. Based on the results of the qualitative testing, the Company concluded that it was more likely than not that the fair value of each reporting unit exceeded its carrying value and no quantitative testing was required.\nOTHER INTANGIBLE ASSETS.\nAs of December 31, 2024\nAs of December 31, 2023\nGross Carrying Amount\nAccumulated Amortization\nNet\nGross Carrying Amount\nAccumulated Amortization\nNet\nDefinite-lived assets\nCustomer-related\n$\n112\n \n$\n(\n24\n)\n$\n88\n \n$\n60\n \n$\n(\n16\n)\n$\n44\n \nPatents and technology\n2,593\n \n(\n1,987\n)\n606\n \n2,541\n \n(\n1,867\n)\n674\n \nCapitalized software \n1,743\n \n(\n1,437\n)\n306\n \n1,963\n \n(\n1,509\n)\n454\n \nTrademarks and other\n33\n \n(\n29\n)\n4\n \n33\n \n(\n27\n)\n6\n \nTotal definite-lived assets\n4,481\n \n(\n3,477\n)\n1,004\n \n4,597\n \n(\n3,419\n)\n1,178\n \nIndefinite-lived assets\n(1)\n74\n \n—\n \n74\n \n75\n \n—\n \n75\n \nTotal other intangible assets\n$\n4,555\n \n$\n(\n3,477\n)\n$\n1,078\n \n$\n4,672\n \n$\n(\n3,419\n)\n$\n1,253\n \n(1) Indefinite-lived intangible assets relate to acquired IPR&D prior to project completion and are not amortized.\n82\nThe Company performs an impairment test of IPR&D in the third quarter. In 2024 and 2023, the Company performed qualitative testing for all IPR&D assets and quantitative testing when warranted. Quantitative testing was performed for all IPR&D assets in 2022. Based on the results of this testing, there were \nno\n material impairments of indefinite-lived intangible assets recognized in the years ended December 31, 2024,  2023, or 2022.\nDuring the year ended \nDecember 31, 2024\n, we recorded additions to acquired intangible assets subject to amortization of $\n117\n million, primarily related to patents and technology and customer-related intangibles, with a weighted-average useful life of \neight years\n.\nAmortization expense was $\n312\n million, $\n362\n million, and $\n405\n million for the years ended December 31, 2024, 2023, and 2022, respectively. There were \nno\n material impairments of definite-lived intangible assets recognized in the years ended December 31, 2024, 2023, or 2022.\nEstimated annual pre-tax amortization expense for intangible assets as of \nDecember 31, 2024\n over the next five calendar years is as follows.\n2025\n2026\n2027\n2028\n2029\nEstimated annual pre-tax amortization\n$\n275\n \n$\n226\n \n$\n142\n \n$\n91\n \n$\n72\n \nNOTE 9. \nBORROWINGS\nThe Company’s borrowings include the following senior unsecured notes and credit agreements:\nSenior Unsecured Notes\nThe Company’s borrowings include $\n8,250\n million aggregate principal amount of senior unsecured notes in \nsix\n series with maturity dates ranging from 2025 through 2052 (collectively, the “Notes”). This reflects the $\n1,000\n million aggregate principal amount of \n4.800\n% senior unsecured notes issued by the Company in the third quarter of 2024, and a repayment in the fourth quarter of 2024 of $\n1,000\n million aggregate principal amount of \n5.550\n% senior unsecured notes.\nInterest payments on the Notes are due semi-annually until maturity. In the event of a change in control and a related downgrade of the ratings of the Notes below investment grade, the indenture governing the Notes requires that the Company make an offer to each holder of the Notes to repurchase all or any part of that holder’s notes at a repurchase price equal to \n101\n% of the aggregate principal amount of the Notes repurchased, plus any accrued and unpaid interest. The indenture also includes a limitation on liens incurred by the Company and its wholly owned U.S. subsidiaries. The indenture does not restrict the Company or its subsidiaries from incurring indebtedness, nor does it contain any financial covenants. All covenants are subject to a number of exceptions, limitations, and qualifications. Refer to the table below for further information about the Notes.\nCredit Facilities\nThe Company has credit agreements providing for:\n•\na \nfive-year\n senior unsecured revolving credit facility in an aggregate committed amount of $\n2,500\n million, maturing on January 3, 2028; \n•\na \n364-day\n senior unsecured revolving credit facility in an aggregate committed amount of $\n1,000\n million, maturing on December 10, 2025; and\n•\na \nthree-year\n senior unsecured term loan credit facility in an aggregate principal amount of $\n2,000\n million, maturing on January 2, 2026 (the “Term Loan Facility” and, together with the \nfive-year\n revolving credit facility and the \n364-day\n revolving credit facility, the “Credit Facilities”).\nThere were \nno\n outstanding amounts under the \nfive-year\n revolving credit facility and \n364-day\n revolving credit facility, and there was $\n750\n million and $\n1,150\n million outstanding on the Term Loan Facility as of December 31, 2024 and 2023, respectively. In the first and fourth quarters of 2024, we repaid $\n150\n million and $\n250\n million, respectively, of the Term Loan Facility. In the fourth quarter of 2024, we entered into a new \n364-day\n senior unsecured revolving credit facility to replace the \n364-day\n senior unsecured revolving credit facility that matured in December 2024.\nThe Company pays a facility fee to each lender, which accrues at a rate equal to an applicable margin specified in the revolving credit facility agreements on the daily commitments of the lenders. The borrowings under the Credit Facilities will bear interest at variable interest rates equal to: (1) the alternate base rate or (2) the Secured Overnight Financing Rate, in each case plus an applicable margin specified in the credit agreement. The Credit Facilities contain affirmative and negative covenants customary to financings of this type that limit, among other things, the Company’s ability to incur additional liens and to enter into certain fundamental change transactions and the incurrence of indebtedness by the Company’s subsidiaries. In addition, the Credit Facilities contain a financial covenant that requires the Company to not exceed a maximum consolidated net leverage ratio. The Company was in compliance with the financial covenant at each reporting period during 2024. The Credit Facilities will be used for general corporate purposes.\n83\nBorrowings Composition\nAs of\nDecember 31, 2024\nDecember 31, 2023\n5.550\n% senior notes due November 15, 2024\n$\n—\n \n$\n1,000\n \n5.600\n% senior notes due November 15, 2025\n1,500\n \n1,500\n \n5.650\n% senior notes due November 15, 2027\n1,750\n \n1,750\n \n4.800\n% senior notes due August 14, 2029\n1,000\n \n—\n \n5.857\n% senior notes due March 15, 2030\n1,250\n \n1,250\n \n5.905\n% senior notes due November 22, 2032\n1,750\n \n1,750\n \n6.377\n% senior notes due November 22, 2052\n1,000\n \n1,000\n \nFloating rate Term Loan Facility due January 2, 2026\n750\n \n1,150\n \nOther\n36\n \n52\n \nTotal principal debt issued\n9,036\n \n9,452\n \nLess: Unamortized debt issuance costs and discounts\n33\n \n35\n \nAdd: Cumulative basis adjustment for fair value hedges\n(\n51\n)\n25\n \nTotal borrowings\n8,951\n \n9,442\n \nLess: Short-term borrowings\n(1)\n1,502\n \n1,006\n \nLong-term borrowings\n$\n7,449\n \n$\n8,436\n \n(1) Short-term borrowings \nas of December 31, 2024 \nand 2023\n i\nncludes \n$\n1,500\n million and $\n1,002\n million, respectively,\n related to the current portion of our long-term borrowings, net of unamortized debt issuance costs and discounts.\nInterest expense associated with long-term debt was $\n580\n million, $\n616\n million, and $\n54\n million for the years ended December 31, 2024, 2023, and 2022, respectively, and is included in Interest and other financial charges – net in the Consolidated and Combined Statements of Income.\nScheduled maturities of borrowings, excluding amortization of discounts and debt issuance costs, are as follows.\n2025\n2026\n2027\n2028\n2029\nThereafter\nTotal\n$\n1,506\n \n$\n779\n \n$\n1,751\n \n$\n—\n \n$\n1,000\n \n$\n4,000\n \n$\n9,036\n \nSee Note 13, “Financial Instruments and Fair Value Measurements” for further information about borrowings and associated derivatives contracts.\nLETTERS OF CREDIT, GUARANTEES, AND OTHER COMMITMENTS.\nAs of December 31, 2024 and 2023, the Company had bank guarantees and surety bonds of approximately $\n784\n million and $\n751\n million, respectively, related to certain commercial contracts. Additionally, we have issued approximately $\n25\n million and $\n39\n million of guarantees as of December 31, 2024 and 2023, respectively, primarily related to residual value and credit guarantees on equipment sold to third-party finance companies. Our Consolidated Statements of Financial Position reflect a liability of $\n3\n million and $\n4\n million as of December 31, 2024 and 2023, respectively, related to these guarantees. For credit-related guarantees, we estimate our expected credit losses related to off-balance sheet credit exposure consistent with the method used to estimate the allowance for credit losses on financial assets held at amortized cost. See Note 14, “Commitments, Guarantees, Product Warranties, and Other Loss Contingencies” for further information on guarantee arrangements with GE.\nNOTE 10. \nPOSTRETIREMENT BENEFIT PLANS\nPENSION AND OTHER POSTRETIREMENT HEALTH AND LIFE INSURANCE BENEFITS SPONSORED BY GE PRIOR TO SPIN-OFF. \nC\nertain GE HealthCare employees were covered under various pension and other postretirement health and life insurance benefit plans sponsored by GE prior to the Spin-Off. These plans were accounted for as multiemployer plans prior to the Spin-Off. Certain \nof these benefit plans are closed to new participants. For the year ended December 31, 2022, relevant costs for these plans were allocated to the Company by GE and recognized within the Combined Statements of Income. These costs included service costs for active employees in the U.S. GE Pension Plan, certain international pension plans, the U.S. GE Supplementary Pension Plan, and certain U.S. retiree benefit plans. \nExpenses associated with our employees’ participation in the U.S. GE Pension Plan and certain U.S. retiree benefit plans, which represent the majority of related expense, were $\n73\n million for the year ended December 31, 2022. Expenses associated with our employees’ participation in certain international pension plans were $\n11\n million for the year ended December 31, 2022. \n84\nPENSION AND OTHER POSTRETIREMENT HEALTH AND LIFE INSURANCE BENEFITS POST SPIN-OFF. \nIn connection with the Spin-Off, on January 1, 2023, GE HealthCare assumed a portion of former GE pension and other postretirement obligations and assets. The pension and other postretirement obligations assumed relate to benefits owed to current GE HealthCare employees, former GE HealthCare employees, and certain GE legacy plan participants. As of January 1, 2023, GE HealthCare established the assumed pension plans as single-employer plans, but continued to participate in legacy GE multiple-employer postretirement benefit plans sponsored by GE.\n On January 1, 2024, we transitioned from the legacy GE multiple-employer other postretirement benefit (“OPEB”) plans to a GE HealthCare sponsored single-employer OPEB plan. This change did not have an impact on our results of operations or financial position.\nThe total assets and liabilities for all plans assumed by GE HealthCare on January 1, 2023, are shown in the tables below.\nAccumulated Benefit Obligations and Unrecognized Gain\nAs of January 1, 2023\nDefined benefit plans\n(1)\nOther postretirement plans\n(2)\nTotal\nAccumulated benefit obligations\n$\n21,696\n \n$\n1,210\n \n$\n22,906\n \nUnrecognized gain recorded in AOCI\n1,258\n \n1,223\n \n2,481\n \nNet Benefit Liability\nAs of January 1, 2023\nDefined benefit plans\n(1)\nOther postretirement plans\n(2)\nTotal\nProjected benefit obligations\n$\n21,743\n \n$\n1,210\n \n$\n22,953\n \nFair value of plan assets\n18,908\n \n—\n \n18,908\n \nNet liability\n$\n2,835\n \n$\n1,210\n \n$\n4,045\n \n(1) Defined benefit plans are comprised of both U.S. Plans and International Plans, as described below.\n(2) OPEB Plans are comprised of benefits, as described below.\nDESCRIPTION OF OUR PLANS.\nAs a result of the liabilities and assets transferred to GE HealthCare on January 1, 2023, we disclose in the following tables postretirement plans with assets or obligations that exceed $\n50\n million for the years ended December 31, 2024 and 2023. For the year ended December 31, 2022, we disclose postretirement plans with assets or obligations that exceed $\n20\n million in the following tables. We use a December 31st measurement date for these plans and all tables presented below are for the years ended December 31st.\nThe U.S. Pension Plans are comprised of the obligations transferred to GE HealthCare from GE in connection with the Spin-Off and obligations that existed prior to the Spin-Off. The largest plans include the GE HealthCare Pension Plan and the GE HealthCare Supplemental Pension Plan, which provides supplementary benefits to higher-level, longer-service U.S. employees. The GE HealthCare Pension Plan and the GE HealthCare Supplemental Pension Plan have been closed to new participants since 2012. All remaining service accruals for the GE HealthCare Pension Plan were frozen effective December 31, 2024. Benefits for participants of the GE HealthCare Supplemental Pension Plan who became executives before 2011 were frozen effective January 1, 2021, and thereafter these employees accrue a benefit which is paid out in \nten\n annual installments upon retirement. The GE HealthCare Pension Plan has a projected benefit obligation of $\n15,230\n million, plan assets of $\n13,650\n million, and is \n90\n% funded per U.S. GAAP as of December 31, 2024. The GE HealthCare Supplemental Pension plan has a projected benefit obligation of $\n1,886\n million as of December 31, 2024, and the benefits are paid to eligible participants directly by the Company as described further in “Funding” below. \nOur International Pension Plans include all other plans that cover non-U.S. participants. These plans include obligations that existed prior to the Spin-Off and obligations transferred to GE HealthCare from GE in connection with the Spin-Off. In certain countries, benefit accruals have ceased and/or have been closed to new hires as of various dates.\nThe OPEB Plans include unfunded postretirement health and life insurance defined benefit obligations to U.S. participants. GE HealthCare assumed the obligations associated with these plans in connection with the Spin-Off. Participants share in the cost of the healthcare and life insurance benefits. With the exception of production employees, subsidized benefits are generally only available to closed groups of employees and retirees.\nFunding\nThe Company funds annually, at a minimum, the statutorily required minimum amount for our qualified plans. Non-qualified plans are unfunded and we pay benefits from our cash on hand. In 2025, the Company expects to make total cash contributions of approximately $\n327\n million to these plans.\n85\nPlan Funded Status\nU.S. Plans\nInternational Plans\nOPEB Plans\n2024\n2023\n2024\n2023\n2024\n2023\nChange in projected benefit obligations\nBalance at January 1\n$\n19,363\n \n$\n297\n \n$\n3,385\n \n$\n343\n \n$\n1,133\n \n$\n—\n \nTransfers from GE at Spin-Off\n—\n \n18,999\n \n—\n \n2,705\n \n—\n \n1,149\n \nService cost\n35\n \n35\n \n20\n \n20\n \n7\n \n6\n \nInterest cost\n970\n \n1,022\n \n141\n \n139\n \n54\n \n59\n \nParticipant contributions\n4\n \n4\n \n—\n \n1\n \n16\n \n18\n \nPlan amendments\n—\n \n53\n \n—\n \n2\n \n—\n \n—\n \nActuarial loss (gain) – net\n(\n799\n)\n553\n \n(\n357\n)\n161\n \n(\n48\n)\n50\n \nBenefits paid\n(\n1,332\n)\n(\n1,570\n)\n(\n131\n)\n(\n130\n)\n(\n146\n)\n(\n149\n)\nCurtailments\n—\n \n(\n30\n)\n—\n \n—\n \n—\n \n—\n \nSettlements\n—\n \n—\n \n(\n4\n)\n—\n \n—\n \n—\n \nExchange rate adjustments\n—\n \n—\n \n(\n96\n)\n144\n \n—\n \n—\n \nBalance at December 31\n$\n18,241\n \n$\n19,363\n \n$\n2,957\n \n$\n3,385\n \n$\n1,016\n \n$\n1,133\n \nChange in plan assets\nBalance at January 1\n$\n15,485\n \n$\n362\n \n$\n3,733\n \n$\n20\n \n$\n—\n \n$\n—\n \nTransfers from GE at Spin-Off\n—\n \n15,402\n \n—\n \n3,482\n \n—\n \n—\n \nActual gain (loss) on plan assets\n49\n \n1,101\n \n(\n263\n)\n145\n \n—\n \n—\n \nEmployer contributions\n172\n \n186\n \n30\n \n40\n \n130\n \n131\n \nParticipant contributions\n4\n \n4\n \n—\n \n1\n \n16\n \n18\n \nBenefits paid\n(\n1,332\n)\n(\n1,570\n)\n(\n136\n)\n(\n130\n)\n(\n146\n)\n(\n149\n)\nAcquisitions/Divestitures/Mergers\n—\n \n—\n \n—\n \n1\n \n—\n \n—\n \nExchange rate adjustments\n—\n \n—\n \n(\n89\n)\n174\n \n—\n \n—\n \nBalance at December 31\n$\n14,378\n \n$\n15,485\n \n$\n3,276\n \n$\n3,733\n \n$\n—\n \n$\n—\n \nFunded status – surplus (deficit)\n$\n(\n3,863\n)\n$\n(\n3,878\n)\n$\n319\n \n$\n348\n \n$\n(\n1,016\n)\n$\n(\n1,133\n)\nActuarial gains and losses result from changes in actuarial assumptions (such as changes in the discount rate and revised mortality rates). Actuarial gains in 2024 and losses in 2023 related to projected benefit obligations were primarily the result of changes in discount rates.\nAmounts Recorded in Consolidated Statements of Financial Position\nU.S. Plans\nInternational Plans\nOPEB Plans\n2024\n2023\n2024\n2023\n2024\n2023\nAll other non-current assets \n$\n11\n \n$\n11\n \n$\n642\n \n$\n701\n \n$\n—\n \n$\n—\n \nCurrent compensation and benefits\n(\n172\n)\n(\n173\n)\n(\n18\n)\n(\n17\n)\n(\n135\n)\n(\n130\n)\nNon-current compensation and benefits \n(\n3,702\n)\n(\n3,716\n)\n(\n305\n)\n(\n336\n)\n(\n881\n)\n(\n1,003\n)\nNet amount recorded\n$\n(\n3,863\n)\n$\n(\n3,878\n)\n$\n319\n \n$\n348\n \n$\n(\n1,016\n)\n$\n(\n1,133\n)\nThe projected benefit obligation (“PBO”) balance at December 31 represents the actuarial present value of benefits based on employee service and compensation as of the measurement date and incorporates assumptions relating to future compensation levels and other demographic and financial assumptions. The accumulated benefit obligation represents the same actuarial obligations, excluding an assumption about future compensation levels. \nPlan Obligations in Excess of Plan Assets\nAs of\nDecember 31, 2024\nDecember 31, 2023\nAccumulated benefit obligation\n$\n22,185\n \n$\n23,841\n \nPlans with accumulated benefit obligation in excess of plan assets\nAccumulated benefit obligation\n$\n19,517\n \n$\n20,774\n \nFair value of plan assets\n14,327\n \n15,433\n \nPlans with projected benefit obligation in excess of plan assets\nProjected benefit obligation\n$\n19,540\n \n$\n20,808\n \nFair value of plan assets\n14,327\n \n15,433\n \n86\nPre-Tax Amounts Recorded in AOCI\nU.S. Plans\nInternational Plans\nOPEB Plans\n2024\n2023\n2024\n2023\n2024\n2023\nNet loss (gain)\n$\n(\n506\n)\n$\n(\n922\n)\n$\n849\n \n$\n784\n \n$\n(\n469\n)\n$\n(\n482\n)\nPrior service cost (credit)\n(\n51\n)\n(\n43\n)\n(\n16\n)\n(\n18\n)\n(\n447\n)\n(\n533\n)\nTotal recorded in AOCI\n$\n(\n557\n)\n$\n(\n965\n)\n$\n833\n \n$\n766\n \n$\n(\n916\n)\n$\n(\n1,015\n)\nPre-tax Cost of Postretirement Benefit Plans and Changes in Other Comprehensive Income\nU.S. Plans\nInternational Plans\nOPEB Plans\n2024\n2023\n2022\n2024\n2023\n2022\n2024\n2023\nCost (income) of postretirement benefit plans\n$\n(\n250\n)\n$\n(\n224\n)\n$\n(\n15\n)\n$\n(\n20\n)\n$\n(\n22\n)\n$\n24\n \n$\n(\n87\n)\n$\n(\n86\n)\nChanges in other comprehensive loss (income):\nTransfers from GE at Spin-Off\n—\n \n(\n1,791\n)\n—\n \n—\n \n542\n \n—\n \n—\n \n(\n1,216\n)\nPlan amendments\n—\n \n53\n \n—\n \n(\n1\n)\n—\n \n—\n \n—\n \n—\n \nNet loss (gain) – current year\n348\n \n695\n \n47\n \n98\n \n198\n \n(\n121\n)\n(\n48\n)\n50\n \nReclassifications out of AOCI:\nCurtailment / settlement gain (loss)\n—\n \n(\n108\n)\n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \nAmortization of net (loss) gain\n68\n \n121\n \n—\n \n(\n14\n)\n(\n6\n)\n(\n5\n)\n61\n \n64\n \nAmortization of prior service (cost) credit\n(\n8\n)\n(\n4\n)\n—\n \n2\n \n3\n \n5\n \n87\n \n87\n \nTotal changes in other comprehensive loss (income)\n$\n408\n \n$\n(\n1,034\n)\n$\n47\n \n$\n86\n \n$\n737\n \n$\n(\n121\n)\n$\n100\n \n$\n(\n1,015\n)\nCost (income) of postretirement benefit plans and changes in other comprehensive loss (income)\n$\n158\n \n$\n(\n1,258\n)\n$\n32\n \n$\n66\n \n$\n715\n \n$\n(\n97\n)\n$\n13\n \n$\n(\n1,101\n)\nWith respect to the retirement benefit balances included on our Consolidated Statement of Financial Position as of December 31, 2024, we estimate that we will amortize $\n119\n million of net actuarial gain and $\n93\n million of prior service credit from AOCI into Non-operating benefit (income) cost in the Consolidated Statement of Income during 2025.\nComponents of Expense (Income)\nU.S. Plans\nInternational Plans\nOPEB Plans\n2024\n2023\n2022\n2024\n2023\n2022\n2024\n2023\nService cost – Operating\n$\n35\n \n$\n35\n \n$\n1\n \n$\n20\n \n$\n20\n \n$\n18\n \n$\n7\n \n$\n6\n \nInterest cost\n970\n \n1,022\n \n11\n \n141\n \n139\n \n6\n \n54\n \n59\n \nExpected return on plan assets\n(\n1,196\n)\n(\n1,242\n)\n(\n27\n)\n(\n193\n)\n(\n184\n)\n—\n \n—\n \n—\n \nAmortization of net loss (gain)\n(\n68\n)\n(\n121\n)\n—\n \n14\n \n6\n \n5\n \n(\n61\n)\n(\n64\n)\nAmortization of prior service cost (credit)\n8\n \n4\n \n—\n \n(\n2\n)\n(\n3\n)\n(\n5\n)\n(\n87\n)\n(\n87\n)\nCurtailment loss (gain)\n—\n \n17\n \n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \nSettlement loss (gain)\n—\n \n61\n \n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \nSpecial termination cost\n1\n \n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \nNon-operating\n$\n(\n285\n)\n$\n(\n259\n)\n$\n(\n16\n)\n$\n(\n40\n)\n$\n(\n42\n)\n$\n6\n \n$\n(\n94\n)\n$\n(\n92\n)\nNet periodic expense (income)\n$\n(\n250\n)\n$\n(\n224\n)\n$\n(\n15\n)\n$\n(\n20\n)\n$\n(\n22\n)\n$\n24\n \n$\n(\n87\n)\n$\n(\n86\n)\nIn the third quarter of 2023, management approved an amendment to the U.S. based GE HealthCare Pension Plan whereby the benefits for all remaining active employees were frozen effective December 31, 2024, and additional benefit enhancements were provided. As a result, we recognized a non-cash pre-tax curtailment loss of approximately $\n17\n million as non-operating benefit costs and an increase to our pension liability of $\n23\n million in 2023. As a result of the plan changes, we remeasured the plan assets and the projected benefit obligation. These changes collectively decreased AOCI by $\n305\n million in the Consolidated Statement of Financial Position. \n87\nIn the fourth quarter of 2023, management approved and paid a one-time lump sum payment for certain terminated employees in \ntwo\n plans who were vested in their benefits. These lump sum settlements reduce our future cash requirements. As a result of the partial settlement of the pension liability, we recognized a non-cash pre-tax settlement charge in 2023. The settlement charge of $\n61\n million represents a pro rata portion of unrecognized net loss recorded in AOCI and is recorded in Non-operating benefit (income) costs in the Consolidated Statement of Income.\nAssumptions\nU.S. Plans\nInternational Plans\nOPEB Plans\n2024\n2023\n2022\n2024\n2023\n2022\n2024\n2023\nWeighted-average benefit obligations assumptions\nDiscount rate\n5.7\n \n%\n5.2\n \n%\n5.5\n \n%\n4.9\n \n%\n4.2\n \n%\n3.3\n \n%\n5.5\n \n%\n5.1\n \n%\nCompensation increases\n3.5\n \n%\n3.7\n \n%\n—\n \n%\n2.8\n \n%\n3.1\n \n%\n3.0\n \n%\n3.6\n \n%\n3.6\n \n%\nWeighted-average benefit cost assumptions\nDiscount rate\n5.2\n \n%\n5.5\n \n%\n3.0\n \n%\n4.2\n \n%\n4.6\n \n%\n1.2\n \n%\n5.1\n \n%\n5.4\n \n%\nExpected rate of return on plan assets\n7.0\n \n%\n7.0\n \n%\n7.0\n \n%\n5.3\n \n%\n5.2\n \n%\n2.4\n \n%\n—\n \n%\n—\n \n%\nFor the December 31, 2024 postretirement health care obligations remeasurement, the Company assumed a \n8.0\n% initial weighted average rate of increase in the per capita cost of the various covered health care benefits, which applies primarily to non-Medicare eligible participants. The trend rate was assumed to decrease gradually to an ultimate rate of \n4.5\n% in 2036 and remain at that level thereafter.\nAssumptions Used in Calculations \nAccounting requirements necessitate the use of assumptions to reflect the uncertainties and the length of time over which the pension obligations will be paid. The actual amount of future benefit payments will depend upon when participants retire, the amount of their benefit at retirement, and how long they live. To reflect the obligation in today’s U.S. dollars, we discount the future payments using a rate that matches the time frame over which the payments are expected to be made. We also assume a long-term rate of return that will be earned on investments used to fund these payments.\nGE HealthCare engages third-party actuaries to assist in the determination of the pension and other postretirement defined benefit plan assumptions. We evaluate these assumptions annually. We periodically evaluate other assumptions, such as retirement age, mortality, and turnover, and update them as necessary to reflect our actual experience and expectations for the future.\nWe determine the discount rate using the weighted average yields on high-quality fixed-income securities that have maturities consistent with the expected timing of benefit payments. \nThe expected return on plan assets is the estimated long-term rate of return that will be earned on the investments used to fund the pension obligations. To determine this rate, we consider the current and target composition of plan investments, our historical returns earned, and our expectations about the future.\nThe compensation assumption is used to estimate the annual rate at which compensation of active plan participants will grow. If the rate of growth assumed increases, the size of the pension obligations will increase, as will the amount recorded in AOCI in our Consolidated Statements of Financial Position and amortized to earnings in subsequent periods. \nExpected Future Benefit Payments of Our Benefit Plans\nU.S. Plans\nInternational Plans\nOPEB Plans\n2025\n$\n1,377\n \n$\n134\n \n$\n135\n \n2026\n1,391\n \n140\n \n132\n \n2027\n1,396\n \n142\n \n129\n \n2028\n1,400\n \n154\n \n125\n \n2029\n1,400\n \n159\n \n121\n \n2030-2034\n6,827\n \n880\n \n487\n \n88\nPENSION PLAN ASSETS.\nThe GE HealthCare Employee Benefits Investment Committee (the “Investment Committee”) and various country pension boards oversee and monitor the investment decisions related to the assets of our U.S. funded pension plans and other international pension assets, respectively. The Investment Committee retains independent investment managers and advisors and uses documented policies and procedures relating to investment goals, targeted asset allocations, risk management practices, allowable and prohibited investment holdings, diversification, use of derivatives, the relationship between plan assets and benefit obligations, the funded status of the plans, and other relevant factors and considerations.\nThe assets of our U.S. funded pension plans are invested in a portfolio that includes U.S. and international equity securities; U.S. government and corporate debt securities; asset-backed debt securities; private equity; real estate and other alternative investments; as well as cash and cash equivalents and derivatives contracts. This combination of assets and derivatives is utilized to implement the investment strategies as well as for hedging asset and liability risks. The Investment Committee sets target allocation percentages at an asset class level, including permitted ranges above or below the target allocation percentages.\nThe plan assets for international plans are managed and allocated by the country pension boards in each country.\nThe following tables summarize our pension plan assets that are measured at fair value on a recurring basis. There are no plan assets associated with our OPEB Plans. The inputs and valuation techniques used to measure the fair value of the assets are consistent with the valuation methodologies we use to measure financial assets at fair value on a recurring basis, as described in Note 2, “Summary of Significant Accounting Policies.”\nComposition of Plan Assets\nBasis of fair value measurement\nBalance as of December 31, 2024\nLevel 1\nLevel 2\nLevel 3\nMeasured at NAV\n(1)\nGlobal equity securities\n$\n4,084\n \n$\n944\n \n$\n38\n \n$\n—\n \n$\n3,101\n \nDebt securities, cash, and cash equivalents\n10,593\n \n1,307\n \n8,000\n \n—\n \n1,285\n \nReal estate\n1,100\n \n—\n \n—\n \n476\n \n623\n \nPrivate equities and other investments\n1,877\n \n7\n \n53\n \n216\n \n1,602\n \nFair value of plan assets\n$\n17,654\n \n$\n2,258\n \n$\n8,091\n \n$\n692\n \n$\n6,612\n \n(1) Certain assets that are measured at fair value using the NAV per share (or its equivalent), as a practical expedient, have not been classified in the fair value hierarchy.\nBasis of fair value measurement\nBalance as of December 31, 2023\nLevel 1\nLevel 2\nLevel 3\nMeasured at NAV\n(1)\nGlobal equity securities\n$\n3,076\n \n$\n1,005\n \n$\n1\n \n$\n—\n \n$\n2,070\n \nDebt securities, cash, and cash equivalents\n11,098\n \n1,105\n \n8,512\n \n—\n \n1,481\n \nReal estate\n1,420\n \n—\n \n—\n \n402\n \n1,018\n \nPrivate equities and other investments\n3,624\n \n—\n \n10\n \n224\n \n3,390\n \nFair value of plan assets\n$\n19,218\n \n$\n2,110\n \n$\n8,523\n \n$\n626\n \n$\n7,959\n \n(1) Certain assets that are measured at fair value using the NAV per share (or its equivalent), as a practical expedient, have not been classified in the fair value hierarchy.\nAs of December 31, 2024 and 2023, the fair value of plan assets that used significant unobservable inputs (Level 3) was $\n692\n million and $\n626\n million, respectively. These assets primarily relate to real estate and private equity investments. The changes to the balances of Level 3 plan assets during 2024 were not significant. During 2023, the balances of Level 3 plan assets increased from $\n61\n million as of December 31, 2022 to $\n626\n million as of December 31, 2023 primarily as a result of the transferred liabilities and assets to GE HealthCare on January 1, 2023. \nWeighted Average Asset Allocation of Pension Plans\n2024 Target\n2024 Actual\nGlobal equity securities\n22\n \n%\n23\n \n%\nDebt securities, cash, and cash equivalents\n61\n \n%\n60\n \n%\nReal estate\n6\n \n%\n6\n \n%\nPrivate equities and other instruments\n11\n \n%\n11\n \n%\n89\nDEFINED CONTRIBUTION PLAN.\nAs a result of the Spin-Off, GE HealthCare established a defined contribution plan for its eligible U.S. employees that was largely consistent with the plan they participated in while GE HealthCare operated as a business of GE. Expenses associated with our employees’ participation in GE HealthCare’s defined contribution plan in 2024 and 2023 and GE’s defined contribution plan allocated to the Company in 2022 represent the employer matching contributions for GE HealthCare employees and\n were $\n130\n million, $\n122\n million, and $\n123\n million for the years ended December 31, 2024, 2023, and 2022, respectively.\n \nNOTE 11. \nINCOME TAXES\nThe Company is subject to income taxes in the U.S. (both federal and state) and in numerous foreign jurisdictions. Changes in the tax laws or regulations in these jurisdictions, or in positions by the relevant authorities regarding their application, administration, or interpretation, may affect our tax liability, return on investments, and business operations.\nThe Tax Cuts and Jobs Act imposes tax on the Company for global intangible low-taxed income (“GILTI”) earned by certain non-U.S. subsidiaries. We have elected to account for GILTI as a period cost. \nIncome Before Income Taxes\nFor the years ended December 31\n2024\n2023\n2022\nU.S. income\n$\n593\n \n$\n816\n \n$\n1,090\n \nNon-U.S. income\n1,988\n \n1,545\n \n1,422\n \nTotal\n$\n2,581\n \n$\n2,361\n \n$\n2,512\n \nProvision for Income Taxes\nFor the years ended December 31\n2024\n2023\n2022\nCurrent\nU.S. Federal\n$\n62\n \n$\n171\n \n$\n396\n \nNon-U.S.\n412\n \n345\n \n324\n \nU.S. State\n8\n \n42\n \n97\n \nDeferred\nU.S. Federal\n3\n \n—\n \n(\n213\n)\nNon-U.S.\n(\n12\n)\n103\n \n7\n \nU.S. State\n58\n \n82\n \n(\n48\n)\nTotal\n$\n531\n \n$\n743\n \n$\n563\n \nReconciliation of U.S. Federal Statutory Income Tax Rate to Actual Income Tax Rate\nFor the years ended December 31\n2024\n2023\n2022\nIncome before taxes\n$\n2,581\n \n$\n2,361\n \n$\n2,512\n \nTax expected at 21%\n542\n \n496\n \n528\n \nForeign operations\n38\n \n63\n \n43\n \nWithholding taxes\n34\n \n28\n \n4\n \nU.S. tax on foreign operations\n(\n43\n)\n(\n35\n)\n(\n36\n)\nUncertain tax positions\n170\n \n11\n \n6\n \nR&D benefits\n(\n51\n)\n(\n33\n)\n(\n33\n)\nState taxes, net of federal benefit\n49\n \n24\n \n39\n \nValuation allowance\n(\n281\n)\n19\n \n8\n \nSpin-Off and separation costs\n72\n \n184\n \n—\n \nOther\n—\n \n(\n14\n)\n4\n \nProvision for income taxes\n$\n531\n \n$\n743\n \n$\n563\n \nEffective income tax rate\n20.6\n%\n31.5\n%\n22.4\n%\n90\nFor the year ended December 31, 2024, included in State taxes, net of federal benefit is $\n35\n million of expense related to revaluation of deferred tax assets as a result of changes in estimates of future apportionment and state tax rates based on the 2023 as-filed tax returns. For the year ended December 31, 2023, the Spin-Off and separation costs line includes $\n59\n million of expense related to revaluation of state deferred tax assets associated with the Spin-Off.\nUNRECOGNIZED TAX BENEFITS. \nThe Company is subject to periodic tax audits by tax authorities in the U.S. (both federal and state) and the numerous countries in which we operate. While the Company currently is being audited, or remains subject to audit, in a number of jurisdictions for tax years 2004-2023, including\n China, France, Germany, India, Japan, Norway, the United Kingdom, and the United States\n, we believe that there are no jurisdictions in which the ultimate outcome of unresolved issues or claims is likely to be material to the results of operations, financial position, or cash flows. We believe that we have made adequate provisions for all unrecognized tax benefits.\nThe balance of unrecognized tax benefits, the amount of related interest and penalties, and what we believe to be the range of reasonably possible changes in the next 12 months are as follows.\n2024\n2023\n2022\nBalance at beginning of period\n$\n409\n \n$\n465\n \n$\n365\n \nAdditions for tax positions of the current year\n4\n \n—\n \n9\n \nAdditions for tax positions of prior years\n181\n \n156\n \n137\n \nReductions for tax positions of prior years\n(\n33\n)\n(\n203\n)\n(\n41\n)\nSettlements with tax authorities\n(\n4\n)\n(\n6\n)\n(\n1\n)\nExpiration of the statute of limitations\n(\n6\n)\n(\n3\n)\n(\n4\n)\nBalance at end of period\n$\n551\n \n$\n409\n \n$\n465\n \nFor the year ended December 31, 2024, the Additions for tax positions of prior years line includes $\n172\n million of reserves established due to ongoing audits, of which $\n142\n million was established against a net operating loss deferred tax asset. Also for the year ended December 31, 2024, the Reductions for tax positions of prior years includes currency translation adjustments (“CTA”) of $\n14\n million and a reversal of $\n19\n million related to various tax audits that were closed during the year.\nDuring the years ended December 31, 2023 and 2022, the Additions for tax positions of prior years line in the table above includes $\n134\n million and $\n132\n million, respectively, related to the Spin-Off. Also during the year ended December 31, 2023, a matter was closed with local tax authorities which resulted in the reversal of a net operating loss deferred tax asset and the related $\n183\n million unrecognized tax benefit, which is included in the Reductions for tax positions of prior years line above. \nUnrecognized Tax Benefits\nFor the years ended December 31\n2024\n2023\n2022\nUnrecognized tax benefits\n$\n551\n \n$\n409\n \n$\n465\n \nAccrued interest on unrecognized tax benefits\n81\n \n72\n \n56\n \nReasonably possible reduction to the balance of unrecognized tax benefits in succeeding 12 months\n175\n \n29\n \n45\n \nPortion that, if recognized, would reduce tax expense and effective tax rate\n182\n \n157\n \n153\n \nIn the first quarter of 2023, the Company changed its accounting policy for presentation of interest expense on uncertain tax positions from within Interest and other financial charges – net to within Benefit (provision) for income taxes. See Note 2, “Summary of Significant Accounting Policies” for further information. \nFor the years ended December 31, 2024 and 2023, $\n13\n million and $\n12\n million, respectively, of interest expense on uncertain tax positions was recorded in Benefit (provision) for income taxes in the Consolidated Statements of Income. For the year ended December 31, 2022, $\n12\n million of interest expense on uncertain tax positions was recorded in Interest and other financial charges – net in the Combined Statement of Income. For the years ended December 31, 2024 and 2023, $\n4\n million and $\n6\n million, respectively, of income tax penalties were recorded in Benefit (provision) for income taxes in the Consolidated Statements of Income. \nNo\n accrual for penalties was made in the year ended December 31, 2022.\nDEFERRED INCOME TAXES. \nWe regularly evaluate the recoverability of our deferred tax assets and establish a valuation allowance, if necessary, to reduce the deferred tax assets to an amount that is more likely than not to be realized (a likelihood of more than 50%). Significant judgment is required in determining whether a valuation allowance is necessary and the amount of such valuation allowance. In assessing the recoverability of our deferred tax assets at December 31, 2024, we considered all available evidence, including the nature of financial statement losses, reversing taxable temporary differences, estimated future operating profits, and tax planning actions and strategies.\n91\nAs of\nDecember 31, 2024\nDecember 31, 2023\nTotal assets\n$\n4,474\n \n$\n4,474\n \nTotal liabilities\n(\n56\n)\n(\n68\n)\nNet deferred income tax asset (liability)\n$\n4,418\n \n$\n4,406\n \nComponents of the Net Deferred Income Tax Asset (Liability)\nAs of\nDecember 31, 2024\nDecember 31, 2023\nDeferred tax assets:\nEmployee benefits\n$\n1,340\n \n$\n1,418\n \nReserves and accruals\n413\n \n458\n \nOperating loss carryforwards\n447\n \n648\n \nLease liabilities\n57\n \n75\n \nTax credit carryforwards\n80\n \n59\n \nU.S. interest restriction carryforwards\n156\n \n61\n \nGoodwill and other intangible assets\n1,355\n \n1,461\n \nProperty, plant, and equipment\n223\n \n261\n \nCapitalized R&D\n689\n \n547\n \nOther deferred tax assets\n55\n \n111\n \nTotal deferred income tax asset\n4,817\n \n5,099\n \nValuation allowances\n(\n231\n)\n(\n540\n)\nTotal deferred income tax asset after valuation allowance\n4,586\n \n4,559\n \nDeferred tax liabilities:\nROU assets\n(\n42\n)\n(\n50\n)\nOther deferred tax liabilities\n(\n126\n)\n(\n102\n)\nTotal deferred income tax liability\n(\n168\n)\n(\n152\n)\nNet deferred income tax asset (liability)\n$\n4,418\n \n$\n4,406\n \nThe deferred tax asset associated with capitalized R&D is related to U.S. tax law that requires capitalization and amortization over five or fifteen years. In the event the capitalization of research costs is adjusted through retroactive legislation effective for 2022, the Company expects to record a reduction to the 2022 deferred tax asset resulting in a charge to tax expense under the Tax Matters Agreement with GE in the amount of $\n228\n million.\nIn connection with the Spin-Off, our net deferred income tax assets inc\nreased in 2023 by $\n3,099\n million primarily due to transfers from GE, including $\n964\n million related to pension and postretirement benefits, with the remainder primarily attributable to tax attributes that were not part of the Company’s stand-alone operations, and changes to valuation on a GE HealthCare basis.\nValuation allowances primarily relate to non-U.S. deferred taxes where there were historical losses and U.S. federal and state credit carryforwards. \nActivity in the valuation allowance consists of the following: \nValuation Allowances\nFor the years ended December 31\n2024\n2023\n2022\nBalance at beginning of period\n$\n540\n \n$\n272\n \n$\n279\n \nProvision for income taxes\n(\n279\n)\n(\n12\n)\n(\n5\n)\nForeign currency exchange and other\n(\n31\n)\n280\n \n(\n2\n)\nBalance at end of period \n$\n231\n \n$\n540\n \n$\n272\n \nAs a result of the Spin-Off, there was an increase in the valuation allowance of $\n269\n million in 2023, which is included in the Foreign currency exchange and other line of the table above. For the year ended December 31, 2024, our valuation allowance decreased by $\n310\n million, which included a release of a valuation allowance in France of $\n295\n million reflected in the Provision for income taxes line. Based on our analysis of all positive and negative evidence during the year ended December 31, 2024, we concluded that it is more likely than not that France deferred tax assets will be realizable based on our profitability in France as a stand-alone company post Spin-Off and our expectation for the continued generation of prospective positive income in the jurisdiction. In making these judgments, we considered various business and structural factors as a stand-alone company, which support our conclusion of the realization of the deferred tax assets.\n92\nNET OPERATING LOSSES.\nAs of December 31, 2024, the Company had net operating loss carryforwards of $\n5,978\n million primarily related to France, Ireland, Brazil, Germany, and the Netherlands, which can be carried forward indefinitely. The gross net operating loss carryforwards resulted in a deferred tax asset of $\n1,133\n million as of December 31, 2024. This amount excludes accruals of $\n266\n million for unrecognized tax benefits the Company has recorded related to the underlying tax positions which generated the net operating losses and expected impacts to U.S. foreign tax credits of $\n420\n million. \nUNDISTRIBUTED EARNINGS.\n \nPost Spin-Off, the Company’s previously undistributed earnings of certain of our foreign subsidiaries are no longer indefinitely reinvested in non-U.S. businesses due to current U.S. funding needs. Therefore, in 2023, an incremental deferred tax liability of $\n21\n million was recorded for withholding and other foreign taxes due upon future distribution of earnings. In addition, the Company is providing for withholding and other foreign taxes due upon future distribution of current period earnings. However, the Company generally considers instances of outside basis differences in foreign subsidiaries that would incur additional U.S. tax upon an unforeseen future reversal (e.g., capital gain distribution or disposition to an unrelated third party) of approximately $\n8\n billion to be permanent in duration. Quantification of the deferred tax liability, if any, associated with indefinitely reinvested basis differences is not practicable.\nNOTE 12. \nACCUMULATED OTHER COMPREHENSIVE INCOME (LOSS) – NET\nChanges in Accumulated other comprehensive income (loss) – net by component were as follows.\nCurrency translation adjustments\n(1)\nPension and Other Postretirement Plans\nCash flow hedges\nTotal AOCI\nDecember 31, 2021\n$\n(\n969\n)\n$\n(\n100\n)\n$\n32\n \n$\n(\n1,037\n)\nOther comprehensive income (loss) before reclassifications – net of taxes of $(\n5\n), $(\n39\n), and $(\n10\n)\n(\n878\n)\n58\n \n27\n \n(\n793\n)\nReclassifications from AOCI – net of taxes\n(2)\n of $\n—\n, $\n—\n, and $\n17\n—\n \n—\n \n(\n50\n)\n(\n50\n)\nOther comprehensive income (loss)\n(\n878\n)\n58\n \n(\n23\n)\n(\n843\n)\nLess: Other comprehensive income (loss) attributable to noncontrolling interests\n(\n2\n)\n—\n \n—\n \n(\n2\n)\nDecember 31, 2022\n(\n1,845\n)\n(\n42\n)\n9\n \n(\n1,878\n)\nOther comprehensive income (loss) before reclassifications\n(3)\n – net of taxes of $\n22\n, $\n186\n, and $\n1\n74\n \n(\n601\n)\n(\n5\n)\n(\n532\n)\nReclassifications from AOCI – net of taxes\n(2)\n of $\n—\n, $\n97\n, and $\n6\n—\n \n(\n296\n)\n(\n22\n)\n(\n318\n)\nOther comprehensive income (loss)\n74\n \n(\n897\n)\n(\n27\n)\n(\n850\n)\nSpin-Off related adjustments – net of taxes\n(4)\n of $\n—\n $(\n509\n), and $\n—\n28\n \n1,972\n \n—\n \n2,000\n \nLess: Other comprehensive income (loss) attributable to noncontrolling interests\n(\n37\n)\n—\n \n—\n \n(\n37\n)\nDecember 31, 2023\n(\n1,706\n)\n1,033\n \n(\n18\n)\n(\n691\n)\nOther comprehensive income (loss) before reclassifications – net of taxes of $(\n19\n), $\n93\n, and $(\n11\n)\n(\n271\n)\n(\n306\n)\n33\n \n(\n545\n)\nReclassifications from AOCI – net of taxes\n(2)\n of $\n—\n, $\n44\n, and $(\n1\n)\n—\n \n(\n150\n)\n3\n \n(\n147\n)\nOther comprehensive income (loss)\n(\n271\n)\n(\n456\n)\n36\n \n(\n691\n)\nLess: Other comprehensive income (loss) attributable to noncontrolling interests\n(\n4\n)\n—\n \n—\n \n(\n4\n)\nDecember 31, 2024\n$\n(\n1,973\n)\n$\n576\n \n$\n18\n \n$\n(\n1,379\n)\n(1) The amount of CTA recognized in Other comprehensive income (loss) (“OCI”) included net gains (losses) relating to net investment hedges, as further discussed in Note 13, \n“\nFinancial Instruments and Fair Value Measurements.”\n(2) Reclassifications from AOCI into earnings for Pension and Other Postretirement Plans are recognized within Non-operating benefit (income) costs, while Cash flow hedges are recognized within Cost of products and Cost of services in our Consolidated and Combined Statements of Income.\n(3) Includes pre-tax impact to Pension and Other Postretirement Plans of $(\n305\n) million for the pension plan amendment and related remeasurement of plan assets and benefit obligations. Refer to Note 10, \n“\nPostretirement Benefit Plans” for further information.\n(4) Includes impact of $\n1,972\n million to Pension and Other Postretirement Plans for unrecognized gain transferred from the GE pension and other postretirement plans and $\n28\n million to CTA associated with other Spin-Off related adjustments.\n \nRefer to Note 10, \n“\nPostretirement Benefit Plans” for further information on the unrecognized gain transferred from the GE pension and other postretirement plans in connection with the Spin-Off.\n93\nNOTE 13. \nFINANCIAL INSTRUMENTS AND FAIR VALUE MEASUREMENTS\nDERIVATIVES AND HEDGING.\nOur primary objective in executing and holding derivative contracts is to reduce the volatility of earnings and cash flows associated with risks related to foreign currency exchange rates, interest rates, equity prices, and commodity prices. These derivative contracts reduce, but do not entirely eliminate, the aforementioned risks. Our policy is to use derivative contracts solely for managing risks and not for speculative purposes.\nThe fair values of derivative contracts are recognized within All other current assets, All other non-current assets, All other current liabilities, and All other non-current liabilities in the Consolidated Statements of Financial Position based upon the contractual timing of settlements for these contracts. We designate certain derivative contracts as hedging instruments in cash flow, fair value, or net investment hedges. We evaluate the effectiveness of our derivative contracts designated as hedging instruments on a quarterly basis.\nCash Flow Hedges\nWe use foreign currency forward contracts to hedge the volatility of cash flows related to firm commitments and forecasted transactions, including intercompany transactions, denominated in foreign currencies other than a subsidiary’s functional currency. The maximum length of time over which we hedge forecasted transactions is \ntwo years\n. As of December 31, 2024, these contracts have a maximum remaining maturity of \n15\n months.\nFor derivative instruments designated as cash\n \nflow hedges, changes in the fair value of designated hedging instruments are initially recorded as a component of AOCI and subsequently reclassified to earnings in the period in which the hedged transaction affects earnings and to the same financial statement line item impacted by the hedged transaction. As of December 31, 2024, we expect to reclassify $\n22\n million of pre-tax net deferred gain associated with designated cash flow hedges to earnings in the next 12 months, contemporaneously with the impact on earnings of the related hedged transactions.\nThe cash flows associated with derivatives designated as cash flow hedges are recorded in All other operating activities – net in the Consolidated and Combined Statements of Cash Flows.\nNet Investment Hedges\nWe use cross-currency interest rate swaps and foreign currency forward contracts in combination with foreign currency option contracts to hedge the foreign currency risk associated with our net investment in foreign operations. As of December 31, 2024, these contracts were designated as hedges of our net investment in foreign operations, primarily in Euro and Chinese Renminbi currencies.\nWe use the spot method to assess hedge effectiveness for our net investment hedges. Changes in the fair value of the designated hedging instruments attributable to fluctuations in foreign currency to USD spot exchange rates are initially recorded and held as a component of the CTA portion of AOCI until the hedged foreign operation is either sold or substantially liquidated. Changes in fair value of the portion of net investment hedging derivatives excluded from the assessment of effectiveness are recorded in CTA and then recognized within Interest and other financial charges – net in the Consolidated and Combined Statements of Income using a systematic and rational method over the life of the hedge. Excluded components on the cross-currency swaps designated as net investment hedges, in the form of accrued interest, are recorded within Interest and other financial charges – net in the Consolidated and Combined Statements of Income.\nThe cash flows associated with derivatives designated as net investment hedges are recorded in All other investing activities – net in the Consolidated and Combined Statements of Cash Flows. For the year ended December 31, 2024, All other investing activities – net includes a $\n94\n million payment for the settlement of cross-currency swaps that were designated in net investment hedges. Cash flows from the periodic interest settlements on the cross-currency swaps are recorded in All other operating activities – net in the Consolidated and Combined Statements of Cash Flows.\nFair Value Hedges\nWe use interest rate swaps to hedge the interest rate risk on our fixed rate borrowings. These derivatives are designated as fair value hedges to hedge the changes in fair value due to benchmark interest rate risk of specific designated cash flows of our senior unsecured notes. In the first quarter and fourth quarter of 2024, we executed interest rate swap contracts with an aggregate notional of $\n700\n million and $\n1,000\n million, respectively, to hedge the benchmark interest rate risk of specific designated cash flows of a senior unsecured note.\nWe record the changes in fair value on these swap contracts in Interest and other financial charges – net in our Consolidated and Combined Statements of Income, the same line item where the offsetting change in the fair value of the designated cash flows of the senior unsecured note is recorded as a basis adjustment.\nCash flows for the periodic interest settlements on the interest rate swaps are recorded in All other operating activities – net in the Consolidated and Combined Statements of Cash Flows.\n94\nDerivatives Not Designated as Hedging Instrument\ns\nWe also execute derivative instruments, such as foreign currency forward contracts and equity-linked total return swaps, which are not designated as qualifying hedges. These derivatives serve as economic hedges of foreign currency exchange rate and equity price risks. We also identify and record foreign currency-related features in our purchase or sales contracts where the currency is not the local or functional currency of any substantive party to the contract and record them as embedded derivatives.\nThe changes in fair value of derivatives not designated in qualifying hedge transactions are recorded in Cost of products, Cost of services, SG&A, and Other (income) expense – net in the Consolidated and Combined Statements of Income based on the nature of the underlying hedged transaction. Changes in fair value of embedded derivatives are recognized in Other (income) expense – net in the Consolidated and Combined Statements of Income.\nThe cash flows associated with derivatives not designated but used as economic hedges are recorded, based on the nature of the underlying hedged transaction, in All other operating activities – net and All other investing activities – net in the Consolidated and Combined Statements of Cash Flows. The cash flows related to embedded derivatives are included in All other operating activities – net in the Consolidated and Combined Statements of Cash Flows.\nThe following table presents the gross fair values of our outstanding derivative instruments.\nFair Value of Derivatives\nDecember 31, 2024\nDecember 31, 2023\nGross Notional\nFair Value – Assets\nFair Value – Liabilities\nGross Notional\nFair Value – Assets\nFair Value – Liabilities\nForeign currency forward contracts\n$\n1,210\n \n$\n43\n \n$\n11\n \n$\n1,356\n \n$\n8\n \n$\n30\n \nDerivatives accounted for as cash flow hedges\n1,210\n \n43\n \n11\n \n1,356\n \n8\n \n30\n \nCross-currency swaps\n(1)\n1,995\n \n15\n \n46\n \n2,209\n \n—\n \n204\n \nForeign currency forward and options contracts\n1,731\n \n30\n \n18\n \n991\n \n9\n \n11\n \nDerivatives accounted for as net investment hedges\n3,726\n \n45\n \n64\n \n3,200\n \n9\n \n215\n \nInterest rate swaps\n(1)\n2,700\n \n—\n \n51\n \n1,000\n \n35\n \n10\n \nDerivatives accounted for as fair value hedges\n2,700\n \n—\n \n51\n \n1,000\n \n35\n \n10\n \nForeign currency forward contracts\n3,925\n \n11\n \n29\n \n3,597\n \n19\n \n12\n \nOther derivatives\n(1)(2)\n370\n \n47\n \n—\n \n438\n \n57\n \n2\n \nDerivatives not designated as hedging instruments\n4,294\n \n57\n \n29\n \n4,035\n \n76\n \n14\n \nTotal derivatives\n$\n11,930\n \n$\n145\n \n$\n155\n \n$\n9,591\n \n$\n128\n \n$\n269\n \n(1) Accrued interest was immaterial for the periods presented and is excluded from fair value. These amounts are recognized within All other current assets and All other current liabilities in the Consolidated Statements of Financial Position.\n(2) Other derivatives are comprised of embedded derivatives and derivatives related to equity contracts. As of December 31, 2023, Other derivatives also included commodity contracts.\nThe following table presents amounts recorded in Long-term borrowings in the Consolidated Statements of Financial Position related to cumulative basis adjustment for fair value hedges.\nDecember 31, 2024\nDecember 31, 2023\nCarrying amount\nCumulative basis adjustment included in the carrying amount\nCarrying amount\nCumulative basis adjustment included in the carrying amount\nLong-term borrowings designated in fair value hedges\n$\n2,644\n \n$\n(\n51\n)\n$\n1,023\n \n$\n25\n \nUnder the master arrangements with the respective counterparties to our derivative contracts, in certain circumstances and subject to applicable requirements, we are allowed to net settle transactions with a single net amount payable by one party to the other. However, we have elected to present the derivative assets and derivative liabilities on a gross basis in our Consolidated Statements of Financial Position and in the table above. \nAs of December 31, 2024 and 2023, the potential effect of rights of offset associated with the derivative contracts would be an offset to both assets and liabilities by $\n77\n million and $\n41\n million, respectively.\nThe table below presents the pre-tax gains (losses) recognized in OCI associated with the Company’s cash flow and net investment hedges.\n95\nPre-tax Gains (Losses) Recognized in OCI Related to Cash Flow and Net Investment Hedges\nFor the years ended December 31\n2024\n2023\n2022\nCash flow hedges\n$\n44\n \n$\n(\n6\n)\n$\n37\n \nNet investment hedges\n(1)\n80\n \n(\n97\n)\n(\n111\n)\n(1) Amounts recognized in OCI for excluded components for the periods presented were immaterial.\nThe tables below present the gains (losses) on our derivative financial instruments and hedging activity in the Consolidated and Combined Statements of Income.\nDerivative Financial Instruments and Hedging Activity\nFor the year ended December 31, 2024\nCost of products\nCost of services\nSG&A\nInterest and other financial charges \n–\n net\nOther\n(4)\nForeign currency forward contracts\n$\n(\n4\n)\n$\n(\n1\n)\n$\n—\n \n$\n—\n \n$\n—\n \nEffects of cash flow hedges\n(\n4\n)\n(\n1\n)\n—\n \n—\n \n—\n \nCross-currency swaps\n—\n \n—\n \n—\n \n31\n \n—\n \nForeign currency forward and options contracts\n—\n \n—\n \n—\n \n11\n \n—\n \nEffects of net investment hedges\n(1)\n—\n \n—\n \n—\n \n42\n \n—\n \nInterest rate swaps\n(2)\n—\n \n—\n \n—\n \n(\n103\n)\n—\n \nDebt basis adjustment on Long-term borrowings\n—\n \n—\n \n—\n \n76\n \n—\n \nEffects of fair value hedges\n—\n \n—\n \n—\n \n(\n27\n)\n—\n \nForeign currency forward contracts\n(\n37\n)\n(\n9\n)\n—\n \n—\n \n1\n \nOther derivatives\n(3)\n—\n \n—\n \n8\n \n—\n \n37\n \nEffects of derivatives not designated as hedging instruments\n(\n37\n)\n(\n9\n)\n8\n \n—\n \n38\n \nFor the year ended December 31, 2023\nCost of products\nCost of services\nSG&A\nInterest and other financial charges \n–\n net\nOther\n(4)\nForeign currency forward contracts\n$\n23\n \n$\n6\n \n$\n—\n \n$\n—\n \n$\n—\n \nEffects of cash flow hedges\n23\n \n6\n \n—\n \n—\n \n—\n \nCross-currency swaps\n—\n \n—\n \n—\n \n34\n \n—\n \nForeign currency forward and option contracts\n—\n \n—\n \n—\n \n3\n \n—\n \nEffects of net investment hedges\n(1)\n—\n \n—\n \n—\n \n37\n \n—\n \nInterest rate swaps\n(2)\n—\n \n—\n \n—\n \n24\n \n—\n \nDebt basis adjustment on Long-term borrowings\n—\n \n—\n \n—\n \n(\n25\n)\n—\n \nEffects of fair value hedges\n—\n \n—\n \n—\n \n(\n1\n)\n—\n \nForeign currency forward contracts\n3\n \n2\n \n—\n \n—\n \n5\n \nOther derivatives\n(3)\n—\n \n—\n \n10\n \n—\n \n47\n \nEffects of derivatives not designated as hedging instruments\n3\n \n2\n \n10\n \n—\n \n52\n \n96\nFor the year ended December 31, 2022\nCost of products\nCost of services\nSG&A\nInterest and other financial charges \n–\n net\nOther\n(4)\nForeign currency forward contracts\n$\n54\n \n$\n—\n \n$\n—\n \n$\n—\n \n$\n—\n \nEffects of cash flow hedges\n54\n \n—\n \n—\n \n—\n \n—\n \nCross-currency swaps\n—\n \n—\n \n—\n \n—\n \n—\n \nForeign currency forward and option contracts\n—\n \n—\n \n—\n \n—\n \n—\n \nEffects of net investment hedges\n(1)\n—\n \n—\n \n—\n \n—\n \n—\n \nInterest rate swaps\n(2)\n—\n \n—\n \n—\n \n—\n \n—\n \nDebt basis adjustment on Long-term borrowings\n—\n \n—\n \n—\n \n—\n \n—\n \nEffects of fair value hedges\n—\n \n—\n \n—\n \n—\n \n—\n \nForeign currency forward contracts\n(\n96\n)\n—\n \n—\n \n—\n \n11\n \nOther derivatives\n(3)\n—\n \n—\n \n—\n \n—\n \n11\n \nEffects of derivatives not designated as hedging instruments\n(\n96\n)\n—\n \n—\n \n—\n \n22\n \n(1) Changes in fair value related to components other than the spot rate are excluded from effectiveness testing for the years ended December 31, 2024, 2023, and 2022.\n(2) Amount includes $(\n27\n) million, $(\n1\n) million, and $\n— million\n of interest expense on interest rate derivatives for the years ended December 31, 2024, 2023, and 2022.\n(3) Other derivatives are primarily comprised of embedded derivatives and derivatives related to equity contracts.\n(4) Amounts are inclusive of gains (losses) in Other (income) expense – net in the Consolidated and Combined Statements of Income.\nCounterparty Credit Risk\nThe Company would be exposed to credit-related losses in the event of non-performance by counterparties on executed derivative instruments. The credit exposure of derivative contracts is represented by the fair value of contracts as of the reporting date. The fair value of the Company’s derivatives can change significantly from period to period based on, among other factors, market movements, and changes in our positions.\nWe manage concentration of counterparty credit risk by limiting acceptable counterparties to major financial institutions with investment grade credit ratings, by limiting the amount of credit exposure to individual counterparties, and by actively monitoring counterparty credit ratings and the amount of individual credit exposure. \nWe also employ master netting arrangements that limit the risk of counterparty non-payment on a particular settlement date to the net gain that would have otherwise been received from the counterparty. Although not completely eliminated, we do not consider the risk of counterparty default to be significant as a result of these protections. None of our derivative instruments are subject to collateral or other security arrangements, nor do they contain provisions that are dependent on our credit ratings from any credit rating agency.\nFAIR VALUE MEASUREMENTS.\nThe following table represents assets and liabilities that are recorded and measured at fair value on a recurring basis.\nFair Value of Assets and Liabilities Measured on a Recurring Basis\nAs of December 31, 2024\nAs of December 31, 2023\nLevel 1\nLevel 2\nLevel 3\nTotal\nLevel 1\nLevel 2\nLevel 3\nTotal\nAssets:\nMoney market funds\n$\n—\n \n$\n312\n \n$\n—\n \n$\n312\n \n$\n—\n \n$\n200\n \n$\n—\n \n$\n200\n \nInvestment securities\n32\n \n—\n \n—\n \n32\n \n31\n \n—\n \n—\n \n31\n \nDerivatives\n—\n \n145\n \n—\n \n145\n \n—\n \n128\n \n—\n \n128\n \nLiabilities:\nDerivatives\n—\n \n155\n \n—\n \n155\n \n—\n \n269\n \n—\n \n269\n \nContingent consideration\n—\n \n—\n \n34\n \n34\n \n—\n \n—\n \n44\n \n44\n \nCash equivalents\nAs of December 31, 2024 and \n2023\n, Cash, cash equivalents, and restricted cash of $\n2,889\n million and $\n2,504\n million, respectively, included money market funds of $\n312\n million and $\n200\n million, and other cash equivalents of $\n1,573\n million and $\n1,023\n million, respectively. The carrying values of the other cash equivalents approximates the fair value due to their short maturities and are valued using Level 1 or Level 2 inputs. Refer to Note 18, “Supplemental Financial Information” for further information.\n97\nDerivatives\nDerivatives are measured at fair value using a discounted cash flow method or option models using interest rates, foreign exchange spot and forward rates and yield curves observable at commonly quoted intervals, implied volatilities, and credit spreads as key inputs. Unobservable inputs relate to our own credit risk which is not significant to the overall measurement of fair value.\nContingent consideration\nContingent consideration is recorded at fair value based on estimates of future cash flows in connection with business acquisitions\n. As the valuation of these liabilities is based on inputs that are less observable or not observable in the market, the determination of fair value is classified within Level 3 of the fair value hierarchy.\nNon-recurring fair value measurements\nChanges in fair value measurements of assets and liabilities measured at fair value on a non-recurring basis, such as equity method investments, equity investments without readily determinable fair value, financing receivables, and long-lived assets, were not material for the \nyears ended\n December 31, 2024, 2023, and 2022.\nFair value of other financial instruments\nThe estimated fair value of borrowings as of December 31, 2024 and 2023 was $\n9,374\n million and $\n9,959\n million, respectively, compared to a carrying value (which only includes a reduction for unamortized debt issuance costs and discounts and cumulative basis adjustment) of $\n8,951\n million and $\n9,442\n million, respectively. The fair value of our borrowings includes accrued interest and is determined based on observable and quoted prices and spreads of comparable debt and benchmark securities and is considered Level 2 in the fair value hierarchy. See Note 9, “Borrowings” and Note 18, “Supplemental Financial Information” for further information.\nNOTE 14. \nCOMMITMENTS, GUARANTEES, PRODUCT WARRANTIES, AND OTHER LOSS CONTINGENCIES \nGUARANTEES. \nThe Company has off-balance sheet credit exposure through standby letters of credit, bank guarantees, bid bonds, and surety bonds. See Note 9, “Borrowings” for further information. \nFollowing the Spin-Off, which was completed pursuant to the Separation and Distribution Agreement, the Company had remaining performance guarantees on behalf of GE. Under the Separation and Distribution Agreement, GE was obligated to use reasonable best efforts to replace the Company as the guarantor or terminate all such performance guarantees. Until such termination or replacement, in the event of non-fulfillment of contractual obligations by the relevant obligors, the Company could have been obligated to make payments under the applicable instruments for which GE was obligated to reimburse and indemnify the Company. As of December 31, 2023, the Company’s maximum aggregate exposure, subject to GE reimbursement, was approximately $\n114\n million. In the second quarter of 2024, these remaining performance guarantees were all terminated or replaced.\nPRODUCT WARRANTIES.\nWe provide warranty coverage to our customers as part of customary practices in the market to provide assurance that the products we sell comply with agreed-upon specifications. We provide estimated product warranty expenses when we sell the related products. Warranty accruals are estimates that are based on the best available information, mostly historical claims experience, therefore claims costs may differ from amounts provided. \nAn analysis of changes in the liability for product warranties follows. \nFor the years ended December 31\n2024\n2023\n2022\nBalance at beginning of period\n$\n192\n \n$\n193\n \n$\n161\n \nCurrent-year provisions\n202\n \n216\n \n238\n \nExpenditures\n(\n220\n)\n(\n218\n)\n(\n199\n)\nForeign currency exchange and other\n(\n6\n)\n1\n \n(\n7\n)\nBalance at end of period\n$\n168\n \n$\n192\n \n$\n193\n \nProduct warranties are recognized within All other current liabilities in the Consolidated Statements of Financial Position. \n98\nLEGAL MATTERS. \nIn the normal course of our business, we are involved from time to time in various arbitrations; class actions; commercial, intellectual property, and product liability litigation; government investigations; investigations by competition/antitrust authorities; and other legal, regulatory, or governmental actions, including the significant matters described below that could have a material impact on our results of operations and cash flows. In many proceedings, including the specific matters described below, it is inherently difficult to determine whether any loss is probable or even reasonably possible or to estimate the size or range of the possible loss, and accruals for legal matters are not recorded until a loss for a particular matter is considered probable and reasonably estimable. Given the nature of legal matters and the complexities involved, it is often difficult to predict and determine a meaningful estimate of loss or range of loss until we know, among other factors, the particular claims involved, the likelihood of success of our defenses to those claims, the damages or other relief sought, how discovery or other procedural considerations will affect the outcome, the settlement posture of other parties, and other factors that may have a material effect on the outcome. For such matters, unless otherwise specified, we do not believe it is possible to provide a meaningful estimate of loss at this time. Moreover, it is not uncommon for legal matters to be resolved over many years, during which time relevant developments and new information must be continuously evaluated.\nContracts with Iraqi Ministry of Health\nIn 2017, a number of U.S. Service members, civilians, and their families brought a complaint in the U.S. District Court for the District of Columbia (the “District Court”) against a number of pharmaceutical and medical device companies, including GE HealthCare and certain affiliates, alleging that the defendants violated the U.S. Anti-Terrorism Act. The complaint seeks monetary relief and alleges that the defendants provided funding for an Iraqi terrorist organization through their sales practices pursuant to pharmaceutical and medical device contracts with the Iraqi Ministry of Health. In July 2020, the District Court granted defendants’ motions to dismiss and dismissed all of the plaintiffs’ claims. In January 2022, a panel of the U.S. Court of Appeals for the District of Columbia Circuit reversed the District Court’s decision. In February 2022, the defendants requested review of the decision by all of the judges on the U.S. Court of Appeals for the District of Columbia Circuit (the “D.C. Circuit”). In February 2023, the D.C. Circuit denied this request. In June 2023, defendants petitioned the Supreme Court to review the D.C. Circuit’s decision. On June 24, 2024, the Supreme Court vacated the D.C. Circuit’s decision and remanded the case to the D.C. Circuit for further consideration. On November 19, 2024, the D.C. Circuit heard oral argument from the parties, and the D.C. Circuit’s decision is pending. The proceedings in the District Court are currently inactive.\nGovernment Disclosures \nFrom time to time, we make self-disclosures regarding our compliance with the Foreign Corrupt Practices Act (“FCPA”) and similar laws to relevant authorities who may pursue or decline to pursue enforcement proceedings against us. We, with the assistance of outside counsel, made voluntary self-disclosures to the U.S. Securities and Exchange Commission (“SEC”) and the U.S. Department of Justice (“DOJ”) beginning in 2018 regarding tender irregularities and other potential violations of the FCPA relating to our activities in certain provinces in China. We have been engaged in ongoing discussions with each of the SEC and the DOJ regarding these matters. We are fully cooperating with the reviews by these agencies and have implemented, and continue to implement, enhancements to our compliance policies and practices. At this time, we are unable to predict the duration, scope, result, or related costs associated with these disclosures to the SEC and the DOJ. We also are unable to predict what, if any, action may be taken by the SEC or the DOJ or what penalties or remedial actions they may seek. Any determination that our operations or activities are not in compliance with existing laws or regulations, including applicable foreign laws, could result in the imposition of fines, penalties, disgorgement, equitable relief, or other losses.\nENVIRONMENTAL AND ASSET RETIREMENT OBLIGATIONS.\nOur operations, like operations of other companies engaged in similar businesses, involve the use, disposal, and cleanup of substances regulated under environmental protection laws and nuclear decommissioning regulations. We have obligations for ongoing and future environmental remediation activities. Liabilities for environmental remediation and nuclear decommissioning exclude possible insurance recoveries. Due to uncertainties or changes regarding the status of laws, regulations, technology, and information related to individual sites and lawsuits, it is reasonably possible that our exposure will exceed amounts accrued, and amounts not currently reasonably estimable and/or probable may need to be accrued in future periods. Our environmental remediation liabilities, which are measured on an undiscounted basis, were $\n16\n million and $\n19\n million as of December 31, 2024 and 2023, respectively, and are recognized within All other current liabilities and All other non-current liabilities in the Consolidated Statements of Financial Position.\nWe record asset retirement obligations, which primarily relate to nuclear decommissioning, associated with the retirement of tangible long-lived assets as a liability in the period in which the obligation is incurred and its fair value can be reasonably estimated. The liability is measured at the present value of the obligation when incurred and is adjusted in subsequent periods. Corresponding asset retirement costs are generally capitalized as part of the carrying value of the related long-lived assets and depreciated over the assets’ useful lives. Our asset retirement obligations were $\n292\n million and $\n267\n million at December 31, 2024 and 2023, respectively, and are recognized within All other current liabilities and All other non-current liabilities in the Consolidated Statements of Financial Position. \n99\nOTHER UNRECOGNIZED CONTRACTUAL OBLIGATIONS. \nWe have future contractual obligations and other minimum commercial commitments which represent take-or-pay contracts as well as purchase orders for goods and services utilized in the normal course of business such as capital expenditures, inventory, and services under contracts.\nAs of December 31, 2024, we had the following purchase commitments that are legally binding and specify minimum purchase quantities or spending amounts. These purchase commitments do not exceed our projected requirements and the amounts below exclude open purchase orders with a remaining term of less than one year.\n2025\n2026\n2027\n2028\n2029\nThereafter\nTotal\nOther Unrecognized Contractual Obligations\n$\n404\n \n$\n362\n \n$\n132\n \n$\n91\n \n$\n81\n \n$\n91\n \n$\n1,160\n \nNOTE 15. \nRESTRUCTURING ACTIVITIES\nRestructuring activities are essential to optimize the business operating model for GE HealthCare and mostly involve workforce reductions, organizational realignments, and revisions to our real estate footprint. Specifically, restructuring charges (gains) primarily include facility exit costs, employee-related termination benefits associated with workforce reductions, asset write-downs, and cease-use costs. For segment reporting, restructuring activities are not allocated. \nNet expenses for restructuring initiatives committed to by management through December 31, 2024 are included in the table below.\nFor the years ended December 31\n2024\n2023\n2022\nEmployee termination costs\n$\n85\n \n$\n38\n \n$\n74\n \nFacility and other exit costs\n18\n \n3\n \n46\n \nAsset write-downs\n17\n \n13\n \n26\n \nTotal restructuring activities – net\n$\n120\n \n$\n54\n \n$\n146\n \nThese restructuring initiatives are expected to result in additional expenses of approximately $\n36\n million, to be incurred primarily over the next 12 months, substantially related to employee-related termination benefits and asset write-downs. Restructuring expenses (gains) are recognized within \nCost of products, Cost of services, or SG&A, as appropriate, in the Consolidated and Combined Statements of Income.\nLiabilities related to restructuring are recognized within Current compensation and benefits, All other current liabilities, Non-current compensation and benefits, and All other non-current liabilities in the Consolidated Statements of Financial Position. \nThe activity related to our restructuring liabilities follows.\nEmployee termination costs\nFacility and other exit costs\nTotal\nBalance at December 31, 2022\n$\n44\n \n$\n31\n \n$\n75\n \nBalance transferred from GE at Spin-Off\n31\n \n—\n \n31\n \nCharges\n36\n \n1\n \n37\n \nPayments and other adjustments\n(\n68\n)\n(\n7\n)\n(\n75\n)\nBalance at December 31, 2023\n$\n43\n \n$\n25\n \n$\n68\n \nCharges\n85\n \n8\n \n93\n \nPayments and other adjustments\n(\n60\n)\n(\n15\n)\n(\n75\n)\nBalance at December 31, 2024\n$\n67\n \n$\n18\n \n$\n86\n \nNOTE 16. \nSHARE-BASED COMPENSATION\nWe grant stock options, restricted stock units (“RSUs”), and performance share units (“PSUs”) to employees under the 2023 Long-Term Incentive Plan (“LTIP”). The Talent, Culture, and Compensation Committee of the Board of Directors approves grants under the LTIP. Under the LTIP, we are authorized to issue up to approximately \n41\n million shares. We record compensation expense for awards expected to vest over the vesting period. We estimate forfeitures based on experience and adjust expense to reflect actual forfeitures. When options are exercised, RSUs vest, and PSUs are earned, we issue shares from authorized unissued common stock. \n100\nStock options provide employees the opportunity to purchase GE HealthCare shares in the future at the market price of our stock on the date the award is granted. The options become exercisable over the vesting period, typically becoming fully vested in \nthree\n to three and a half years, and expire \nten years\n from the grant date if not exercised. We value stock options using a Black-Scholes option pricing model.\nRSUs provide an employee the right to shares of GE HealthCare stock when the restrictions lapse over the vesting period of \nthree\n to three and a half years. Upon vesting, each RSU is converted into one share of GE HealthCare common stock. We value RSUs using the market price on the grant date.\nPSUs provide an employee with the right to receive shares of GE HealthCare stock based upon achievement of certain performance metrics. PSUs are subject to an employee service period of \nthree\n years. PSUs may include a relative total shareholder return (“TSR”) modifier to determine the number of shares earned at the end of the performance period. We engage third-party valuation specialists to assist with the fair value estimate of the PSUs that include the TSR modifier using a Monte Carlo simulation to model the probability of possible outcomes.\nThe following tables provide the weighted average fair value of options, RSUs, and PSUs granted to employees during the years ended December 31, 2024 and 2023, and the related weighted average stock option valuation assumptions used in the Black-Scholes model.\nWeighted Average Grant Date Fair Value\n(In dollars)\nDecember 31, 2024\nDecember 31, 2023\nStock options\n$\n32\n \n$\n25\n \nRSUs\n89\n \n73\n \nPSUs\n96\n \n85\n \nKey Assumptions in the Black-Scholes Valuation for Stock Options\nDecember 31, 2024\nDecember 31, 2023\nRisk-free rate\n4.1\n \n%\n3.6\n \n%\nDividend yield\n0.13\n \n%\n0.01\n \n%\nExpected volatility\n26.2\n \n%\n26.2\n \n%\nExpected term (in years)\n6.2\n6.2\nFor awards granted in 2023 and 2024, the expected volatility was derived from a peer group’s blended historical and implied volatility as GE HealthCare does not have sufficient historical volatility based on the expected term of the underlying options. The expected term of the stock options was determined using the simplified method. The risk-free interest rate was determined using the implied yield currently available for zero-coupon U.S. government issues with a remaining term approximating the expected life of the options. The dividend yield assumption is based on the expected annualized dividend payment at the date of grant.\nStock Option Activity\nShares \n(in thousands)\nWeighted average exercise price \n(in dollars)\nWeighted average contractual term\n(in years)\nIntrinsic value \n(in millions)\nOutstanding as of January 1, 2024\n4,963\n \n$\n84\n \nGranted\n563\n \n92\n \nExercised/Vested\n(\n503\n)\n67\n \nForfeited\n(\n308\n)\n74\n \nExpired\n(\n469\n)\n141\n \nOutstanding as of December 31, 2024\n4,246\n \n$\n82\n \n6.0\n$\n31\n \nExercisable as of December 31, 2024\n2,178\n \n$\n87\n \n3.7\n$\n20\n \nExpected to vest\n4,027\n \n$\n82\n \n5.9\n$\n30\n \n101\nRSU and PSU Activity\nRSUs\nPSUs\nShares (in thousands)\nWeighted average grant date fair value (in dollars)\nWeighted average vesting period (in years)\nIntrinsic value (in millions)\nShares (in thousands)\nWeighted average grant date fair value (in dollars)\nWeighted average vesting period (in years)\nIntrinsic value (in millions)\nOutstanding as of January 1, 2024\n3,729\n \n$\n67\n \n1,246\n \n$\n85\n \nGranted\n1,292\n \n89\n \n610\n \n96\n \nExercised/Vested\n(\n1,745\n)\n63\n \n(\n992\n)\n86\n \nForfeited\n(\n414\n)\n73\n \n(\n86\n)\n89\n \nExpired\n—\n \n—\n \n—\n \n—\n \nOutstanding as of December 31, 2024\n2,860\n \n$\n78\n \n1.9\n$\n223\n \n778\n \n$\n91\n \n1.8\n$\n61\n \nExpected to vest\n2,523\n \n$\n77\n \n1.9\n$\n197\n \nN/A\nN/A\nN/A\nN/A\nShare-based compensation expense is recognized within Cost of products, Cost of services, SG&A, or R&D, as appropriate, in the Consolidated Statements of Income.\nShare-based Compensation Expense\nFor the years ended\nDecember 31, 2024\nDecember 31, 2023\nShare-based compensation expense (pre-tax)\n$\n125\n \n$\n114\n \nIncome tax benefits\n(\n23\n)\n(\n23\n)\nShare-based compensation expense (after-tax)\n$\n102\n \n$\n91\n \nOther Share-based Compensation Data\nFor the years ended\nDecember 31, 2024\nDecember 31, 2023\nCash received from stock options exercised\n$\n33\n \n$\n34\n \nIntrinsic value of stock options exercised and RSUs/PSUs vested\n251\n \n106\n \nUnrecognized compensation expense was $\n146\n million as of December 31, 2024 and is expected to be recognized over a weighted-average period of approximately \n1.8\n years.\nNOTE 17. \nEARNINGS PER SHARE\nThe numerator for both basic and diluted earnings per share (“EPS”) is Net income attributable to GE HealthCare common stockholders. The denominator of basic EPS is the weighted-average number of shares outstanding during the period. Subsequent to the Spin-Off, the dilutive effect of outstanding stock options, RSUs, and PSUs is reflected in the denominator for diluted EPS using the treasury stock method.\nOn January 3, 2023, there were approximately \n454\n million shares of GE HealthCare common stock outstanding, including the interest in our outstanding shares of common stock retained by GE following the Distribution. The computation of basic and diluted earnings per common share for the year ended December 31, 2022 was calculated using this same number of common shares outstanding since no GE HealthCare equity awards were outstanding as of the Distribution Date. \n102\nEarnings Per Share\nFor the years ended December 31\n(In millions, except per share amounts)\n2024\n2023\n2022\nNumerator:\nNet income from continuing operations\n$\n2,050\n \n$\n1,618\n \n$\n1,949\n \nNet (income) loss attributable to noncontrolling interests\n(\n57\n)\n(\n46\n)\n(\n51\n)\nNet income from continuing operations attributable to GE HealthCare\n1,993\n \n1,572\n \n1,898\n \nDeemed preferred stock dividend of redeemable noncontrolling interest\n—\n \n(\n183\n)\n—\n \nNet income from continuing operations attributable to GE HealthCare common stockholders\n1,993\n \n1,389\n \n1,898\n \nIncome (loss) from discontinued operations, net of taxes\n—\n \n(\n4\n)\n18\n \nNet income attributable to GE HealthCare common stockholders\n$\n1,993\n \n$\n1,385\n \n$\n1,916\n \nDenominator:\nBasic weighted-average shares outstanding\n456\n \n455\n \n454\n \nDilutive effect of common stock equivalents\n2\n \n3\n \n—\n \nDiluted weighted-average shares outstanding\n459\n \n458\n \n454\n \nBasic Earnings Per Share:\nContinuing operations\n$\n4.37\n \n$\n3.06\n \n$\n4.18\n \nDiscontinued operations\n—\n \n(\n0.01\n)\n0.04\n \nAttributable to GE HealthCare common stockholders\n4.37\n \n3.05\n \n4.22\n \nDiluted Earnings Per Share:\nContinuing operations\n$\n4.34\n \n$\n3.04\n \n$\n4.18\n \nDiscontinued operations\n—\n \n(\n0.01\n)\n0.04\n \nAttributable to GE HealthCare common stockholders\n4.34\n \n3.03\n \n4.22\n \nAntidilutive securities\n(1)\n3\n \n4\n \n—\n \n(1) Diluted earnings per share excludes certain shares issuable under share-based compensation plans because the effect would have been antidilutive.\nNOTE 18. \nSUPPLEMENTAL FINANCIAL INFORMATION\nCASH, CASH EQUIVALENTS, AND RESTRICTED CASH.\nAs of\nDecember 31, 2024\nDecember 31, 2023\nCash and cash equivalents\n$\n2,874\n \n$\n2,494\n \nShort-term restricted cash\n16\n \n10\n \nTotal Cash, cash equivalents, and restricted cash as presented in the Consolidated Statements of Financial Position\n2,889\n \n2,504\n \nLong-term restricted cash\n(1)\n3\n \n2\n \nTotal Cash, cash equivalents, and restricted cash as presented in the Consolidated and Combined Statements of Cash Flows\n$\n2,893\n \n$\n2,506\n \n(1) Long-term restricted cash is recognized within All other non-current assets in the Consolidated Statements of Financial Position.\nINVENTORIES.\nAs of\nDecember 31, 2024\nDecember 31, 2023\nRaw materials\n$\n921\n \n$\n961\n \nWork in process\n92\n \n91\n \nFinished goods\n926\n \n908\n \nInventories\n$\n1,939\n \n$\n1,960\n \nCertain inventory items are long-term in nature and therefore have been recognized within All other non-current assets in the Consolidated Statements of Financial Position and are not reflected in the table above. See the supplemental table “All Other Current and Non-Current Assets” for further information. \n103\nPROPERTY, PLANT, AND EQUIPMENT – NET.\nAs of\nDecember 31, 2024\nDecember 31, 2023\nLand and improvements\n$\n66\n \n$\n70\n \nBuildings, structures, and related equipment\n1,943\n \n1,956\n \nMachinery and equipment\n2,705\n \n2,617\n \nLeasehold improvements and manufacturing plants under construction\n553\n \n565\n \nTotal property, plant, and equipment, at original cost\n5,267\n \n5,208\n \nAccumulated depreciation\n(\n3,080\n)\n(\n3,064\n)\nRight-of-use operating lease assets, net of amortization\n(1)\n364\n \n356\n \nProperty, plant, and equipment – net\n$\n2,550\n \n$\n2,500\n \n(1) See Note 7, “Leases” for further information.\nDepreciation related to Property, plant, and equipment – net, exclusive of ROU operating lease assets, was $\n268\n million, $\n248\n million, and $\n228\n million for the years ended December 31, 2024, 2023, and 2022, respectively.\nALL OTHER ASSETS AND ALL OTHER LIABILITIES. \nAll Other Current and Non-Current Assets\nAs of\nDecember 31, 2024\nDecember 31, 2023\nPrepaid expenses and deferred costs\n$\n188\n \n$\n147\n \nFinancing receivables – net\n90\n \n97\n \nDerivative instruments\n123\n \n84\n \nTax receivables\n115\n \n53\n \nOther\n13\n \n8\n \nAll other current assets\n$\n529\n \n$\n389\n \nPrepaid pension asset\n$\n657\n \n$\n716\n \nEquity method and other investments\n373\n \n357\n \nFinancing receivables – net\n183\n \n178\n \nLong-term receivables – net\n142\n \n124\n \nInventories\n139\n \n147\n \nContract and other deferred assets\n208\n \n168\n \nOther\n(1)\n248\n \n191\n \nAll other non-current assets\n$\n1,950\n \n$\n1,881\n \n(1) Non-current Other primarily consists of indemnity assets associated with separation agreements with GE, capitalized costs associated with cloud computing arrangements, tax receivables, and derivative instruments.\n104\nAll Other Current and Non-Current Liabilities\nAs of\nDecember 31, 2024\nDecember 31, 2023\nSales allowances and related liabilities\n$\n242\n \n$\n228\n \nIncome and indirect tax liabilities including uncertain tax positions\n279\n \n260\n \nProduct warranties\n168\n \n192\n \nAccrued freight and utilities\n163\n \n132\n \nOperating lease liabilities\n115\n \n110\n \nDerivative instruments\n(1)\n90\n \n128\n \nInterest payable on borrowings\n92\n \n87\n \nEnvironmental and asset retirement obligations\n17\n \n21\n \nOther\n(2)\n379\n \n335\n \nAll other current liabilities\n$\n1,545\n \n$\n1,493\n \nContract liabilities\n$\n686\n \n$\n705\n \nOperating lease liabilities\n270\n \n273\n \nEnvironmental and asset retirement obligations\n291\n \n265\n \nIncome and indirect tax liabilities including uncertain tax positions\n237\n \n208\n \nDerivative instruments\n64\n \n136\n \nFinance lease obligations\n40\n \n38\n \nSales allowances and related liabilities\n23\n \n27\n \nOther\n(3)\n184\n \n225\n \nAll other non-current liabilities\n$\n1,796\n \n$\n1,877\n \n(1) Derivative instruments include the related accrued interest. Refer to Note 13, “Financial Instruments and Fair Value Measurements” for further information.\n(2) Current Other primarily consists of miscellaneous accrued costs, contingent consideration liabilities, and dividends payable to stockholders.\n(3) Non-current Other primarily consists of miscellaneous accrued costs, indemnity liabilities associated with separation agreements with GE, and contingent consideration liabilities.\nEQUITY METHOD INVESTMENTS.\nEquity method investment balance\nEquity method income (loss)\nAs of December 31\nOwnership Percentage\n2024\n2023\n2024\n2023\n2022\nNihon Medi-Physics Co., Ltd\n(1)\n50\n%\n$\n139\n \n$\n150\n \n$\n10\n \n$\n10\n \n$\n16\n \nOther\n24\n \n20\n \n(\n2\n)\n1\n \n(\n3\n)\nTotal\n$\n163\n \n$\n170\n \n$\n8\n \n$\n11\n \n$\n13\n \n(1) In the fourth quarter of 2024, GE HealthCare announced an agreement to acquire the remaining ownership interest of NMP. See Note 8, “Acquisitions, Goodwill, and Other Intangible Assets” for more information.\nSUPPLY CHAIN FINANCE PROGRAMS. \nA rollforward of our outstanding obligations confirmed and paid under the supply chain finance programs, which are included within \nAccounts Payable\n in the Consolidated Statements of Financial Position, is presented below.\nFor the year ended December 31\n2024\nConfirmed obligations outstanding at beginning of period\n$\n365\n \nInvoices confirmed during the year\n886\n \nConfirmed invoices paid during the year\n(\n855\n)\nForeign exchange and other\n(\n2\n)\nConfirmed obligations outstanding at end of period\n$\n394\n \n105\nCOLLABORATIVE ARRANGEMENTS. \nIn October 2023, we entered into a Collaboration and License Agreement with Novo Nordisk (“Novo”) to pursue a collaboration on the development, regulatory approval, and commercialization of an ultrasound therapy. Under the terms of this agreement, in return for providing development activities associated with the development of the underlying ultrasound device to deliver Novo’s clinical therapies, we received an upfront nonrefundable payment with the potential for additional nonrefundable payments through 2027. We recognize the nonrefundable payments as an offset to R&D expense as we perform activities contemplated under this agreement. These nonrefundable payments are not material. We may also receive future payments based on the achievement of certain development milestones and regulatory approvals associated with the ultrasound therapy.\nREDEEMABLE NONCONTROLLING INTERESTS\n.\nThe Company has noncontrolling interests with redemption features. These redemption features, such as put options, could require the Company to purchase the noncontrolling interests upon the occurrence of certain events. All noncontrolling interests with redemption features that are not solely within our control are recognized within the Consolidated Statements of Financial Position between liabilities and equity. Redeemable noncontrolling interests are initially recorded at the issuance date fair value. Those that are currently redeemable, or probable of becoming redeemable, are subsequently adjusted to the greater of current redemption value or initial carrying value. \nActivity attributable to redeemable noncontrolling interests is presented below.\nFor the years ended December 31\n2024\n2023\n2022\nBalance at beginning of period\n$\n165\n \n$\n230\n \n$\n220\n \nNet income attributable to redeemable noncontrolling interests\n50\n \n41\n \n47\n \nRedemption value adjustments\n(1)\n—\n \n183\n \n—\n \nDistributions to and exercise of redeemable noncontrolling interests and other\n(2)\n(\n28\n)\n(\n289\n)\n(\n37\n)\nBalance at end of period \n$\n188\n \n$\n165\n \n$\n230\n \n(1) As of January 3, 2023, certain redeemable noncontrolling interests were probable of becoming redeemable due to the change of control that occurred upon consummation of the Spin-Off. As a result, these redeemable noncontrolling interests were remeasured to their current redemption value. The remeasurement was accounted for as a deemed preferred stock dividend of redeemable noncontrolling interest and recorded as an adjustment to Retained earnings in the Consolidated Statements of Financial Position.\n(2) In the first quarter of 2023, the redeemable noncontrolling interest holder exercised its option redemption provision. The redemption amount of $\n211\n million was paid in the second quarter of 2023.\nOTHER INCOME (EXPENSE) \n–\n NET.\nFor the years ended December 31\n2024\n2023\n2022\nNet financing income and investment income (loss)\n$\n(\n1\n)\n$\n26\n \n$\n(\n9\n)\nEquity method income (loss)\n8\n \n11\n \n13\n \nChange in fair value of assumed obligations\n(\n32\n)\n(\n32\n)\n—\n \nOther items, net\n(1)\n80\n \n81\n \n58\n \nTotal other income (expense) – net\n$\n55\n \n$\n86\n \n$\n62\n \n(1) Other items, net primarily consists of: change in tax indemnity, lease income, government grants, licensing and royalty income, and gains and losses related to derivatives for the year ended December 31, 2024; change in tax indemnity, lease income, licensing and royalty income, and gains and losses related to derivatives for the year ended December 31, 2023; and gains and losses related to derivatives and licensing and royalty income for the year ended December 31, 2022.\nNOTE 19. \nRELATED PARTIES AND TRANSITION SERVICES AGREEMENT\nPRIOR TO SPIN-OFF.\nPrior to the Spin-Off, GE provided the Company with significant corporate infrastructure and shared services. The following disclosures summarize related party activity between GE HealthCare and GE. This activity, which occurred prior to the Spin-Off, is included in the combined financial statements.\n106\nPension, Benefit, and Contribution Plans\nAs discussed in Note 10, “Postretirement Benefit Plans”, employees of the Company participated in pension, benefit, and contribution plans that were sponsored by GE. The Company was charged $\n207\n million for the year ended December 31, 2022 related to employee participation in these plans. In connection with the Spin-Off, a portion of the plans were transferred to the Company.\nShare-Based Compensation\nGE granted various employee benefits to its group employees, including those of the Company, under the GE Long-Term Incentive Plan. These benefits primarily included stock options and RSUs. Compensation expense allocated to the Company was $\n67\n million for the year ended December 31, 2022, and was primarily recognized within SG&A in the Combined Statement of Income. \nCorporate Overhead and Other Allocations from GE\nGE provided certain services described below that were charged to the Company based on employee headcount, revenue, or other allocation methodologies.\nFor the year ended December 31\n2022\nCosts for centralized services\n(1)\n$\n42\n \nCosts associated with employee medical insurance\n(2)\n122\n \nCosts for corporate and shared services\n(3)\n457\n \n(1) Costs for centralized services such as public relations, treasury and cash management, and other services were recognized within SG&A in the Combined Statement of Income.\n(2) Costs associated with employee medical insurance were recognized within Cost of products, Cost of services, SG&A, and R&D in the Combined Statement of Income based on the employee population.\n(3) Costs for corporate and shared services such as information technology, finance and other services were primarily recognized in SG&A and R&D in the Combined Statement of Income.\nManagement believes that the expense and cost allocations have been determined on a basis that is a reasonable reflection of the utilization of services provided or the benefit received by the Company during the year ended December 31, 2022. The amounts that would have been incurred on a stand-alone basis could have materially differed from the amounts allocated due to economies of scale, difference in management judgment, a requirement for more or fewer employees, or other factors.\nAFTER SPIN-OFF.\nIn connection with the Spin-Off, the Company entered into or adopted several agreements that provide a framework for the relationship between the Company and GE. These agreements were structured in anticipation of GE’s transaction to separate the GE Vernova business. Refer to Note 1, “Organization and Basis of Presentation” for additional information. The below agreements had activity during the years ended December 31, 2024 and 2023:\n•\nSeparation and Distribution Agreement \n– sets forth the principal actions to be taken in connection with the Spin-Off, including the transfer of assets and assumption of liabilities, and establishes certain rights and obligations between the Company and GE following the Distribution, including procedures with respect to claims subject to indemnification and related matters.\n•\nTransition Services Agreement \n– governs all matters relating to the provision of shared services between the Company and GE on a transitional basis. The services the Company receives include support for information technology, human resources, supply chain, finance, and facilities services, among others. Some of these costs were included in the allocations from GE prior to Spin-Off. The services generally commenced on the date of the Spin-Off and terminated in the \n24\n months following the Distribution Date depending upon the related transitional service. We incurred $\n172\n million, n\net, and $\n372\n million, net, for the years ended December 31, 2024 and 2023, respectively, under this agreement. These amounts represent fees charged from GE and GE Vernova to the Company, the majority of which are related to information technology, and are net of fees charged from the Company to GE and GE Vernova for facilities and other shared services. \n•\nTax Matters Agreement \n– governs the respective rights, responsibilities, and obligations between the Company and GE with respect to all tax matters (excluding employee-related taxes covered under the Employee Matters Agreement), in addition to certain restrictions which generally prohibit us from taking or failing to take any action in the \ntwo-year\n period following the Distribution that would prevent the Distribution from qualifying as tax-free for U.S. federal income tax purposes, including limitations on our ability to pursue certain strategic transactions. The Tax Matters Agreement specifies the portion of tax liability for which the Company will bear contractual responsibility, and the Company and GE will each agree to indemnify each other against any amounts for which such indemnified party is not responsible.\n107\nCurrent amounts due from and to GE under the various agreements are recognized within Due from related parties or Due to related parties, as applicable, in the Consolidated Statements of Financial Position. Non-current amounts due from GE were $\n99\n million and $\n81\n million, and due to GE were $\n34\n million and $\n33\n million, as of December 31, 2024 and 2023, respectively. These amounts were recognized within All other non-current assets and All other non-current liabilities, respectively, in the Consolidated Statements of Financial Position and relate to tax and other indemnities. Following its separation from GE, GE Vernova does not meet the definition of a related party; accordingly, amounts as of December 31, 2024 due to and from GE Vernova in accordance with the TSA are excluded from the Due from related parties and Due to related parties financial statement line items and non-current balances disclosed above.\n \nNOTE 20. \nSUBSEQUENT EVENTS\nOn February 3, 2025, we repaid $\n250\n million of the outstanding Term Loan Facility.\nITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.\nITEM 9A. CONTROLS AND PROCEDURES\nEVALUATION OF DISCLOSURE CONTROLS AND PROCEDURES.\nUnder the supervision and with the participation of the Company’s management, including the Chief Executive Officer and Chief Financial Officer, the Company evaluated its disclosure controls and procedures as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act. Based on this evaluation, the Chief Executive Officer and Chief Financial Officer concluded that the Company’s disclosure controls and procedures were effective as of December 31, 2024, and that the information required to be disclosed by the Company in the reports that it files or submits under the Exchange Act is recorded, processed, summarized, and reported, within the time periods specified in the SEC’s rules and forms, and that such information is accumulated and communicated to management, including the Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure.\nMANAGEMENT’S REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING.\nThe Company’s management is responsible for establishing and maintaining adequate internal control over financial reporting. Management has evaluated the effectiveness of the internal control over financial reporting, based on the framework and criteria established in Internal Control – Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission, and concluded that they were effective as of December 31, 2024. All internal control systems have inherent limitations; as such, they may not prevent or detect all misstatements or fraud. Therefore, even those internal control systems determined to be effective can provide only reasonable assurance with respect to financial statements preparation and reporting. Additionally, projections of any evaluation of effectiveness to future periods are subject to the risk that the current control structure may become inadequate for changes in conditions or the degree of compliance with the policies may deteriorate.\nThe effectiveness of such controls has been audited by Deloitte & Touche LLP, our independent registered public accounting firm, as stated in their report included in Item 8, “Financial Statements and Supplementary Data” of this Annual Report on Form 10-K.\nCHANGES IN INTERNAL CONTROL OVER FINANCIAL REPORTING.\n \nDuring the quarter ended December 31, 2024, the Company continued to exit from various transition service agreements with GE, primarily related to IT systems that impact financial reporting. Consequently, responsibility for execution of related internal controls transferred to the Company, including general IT controls in connection with IT environment changes. Other than those discussed in the preceding sentences, there were no changes in the Company’s internal control over financial reporting that occurred during the quarter ended December 31, 2024 that materially affected or are reasonably likely to materially affect the Company’s internal control over financial reporting.\nITEM 9B. OTHER INFORMATION\nDIRECTOR AND OFFICER TRADING ARRANGEMENTS.\nNone of our directors or executive officers \nadopted\n or \nterminated\n a Rule 10b5-1 trading arrangement or a non-Rule 10b5-1 trading arrangement (as defined in Item 408(c) of Regulation S-K) during the quarterly period covered by this report.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable. \n108\nPART III\nITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information required under this item, with the exception of “Information About Our Executive Officers” and “Ethics and Governance” located under Item 1, “Business” of this Annual Report on Form 10-K, is incorporated by reference to the Company’s definitive proxy statement pursuant to Regulation 14A, which will be filed with the Securities and Exchange Commission no later than 120 days after the close of the Company’s fiscal year ended December 31, 2024.\nITEM 11. EXECUTIVE COMPENSATION\nThe information required under this item is incorporated by reference to the Company’s definitive proxy statement pursuant to Regulation 14A, which will be filed with the Securities and Exchange Commission no later than 120 days after the close of the Company’s fiscal year ended December 31, 2024.\nITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required under this item is incorporated by reference to the Company’s definitive proxy statement pursuant to Regulation 14A, which will be filed with the Securities and Exchange Commission no later than 120 days after the close of the Company’s fiscal year ended December 31, 2024.\nITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required under this item is incorporated by reference to the Company’s definitive proxy statement pursuant to Regulation 14A, which will be filed with the Securities and Exchange Commission no later than 120 days after the close of the Company’s fiscal year ended December 31, 2024.\nITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information required under this item is incorporated by reference to the Company’s definitive proxy statement pursuant to Regulation 14A, which will be filed with the Securities and Exchange Commission no later than 120 days after the close of the Company’s fiscal year ended December 31, 2024.\nPART IV\nITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\nFINANCIAL STATEMENTS.\nRefer to Item 8, “Financial Statements and Supplementary Data” for a listing of our financial statements.\nFINANCIAL SCHEDULES.\nSchedules required by Regulation S-X (17 CFR 210) are omitted because they are either not applicable or the financial information is already included within the financial statements or notes thereto.\nEXHIBITS. \nNumber\nDescription\n2.1\nSeparation and Distribution Agreement, dated November 7, 2022, by and between General Electric Company and the Registrant, as amended (incorporated by reference to Exhibit 2.1 to the Registrant’s Current Report on Form 8-K filed with the SEC on January 4, 2023).\n†\n3.1\nCertificate of Incorporation of the Registrant (incorporated by reference to Exhibit 3.1 to the Registrant’s Current Report on Form 8-K filed with the SEC on December 29, 2022).\n3.2\nBylaws of the Registrant (incorporated by reference to Exhibit 3.2 to the Registrant’s Current Report on Form 8-K filed with the SEC on December 29, 2022).\n4.1\nBase Indenture, dated as of November 22, 2022, among GE HealthCare Holding LLC, General Electric Company, as guarantor, and The Bank of New York Mellon, as trustee (incorporated by reference to Exhibit 4.1 \nto\n General Electric Company’s Current Report on Form 8-K filed with the SEC on November 23, 2022).\n109\n4.2\nFirst Supplemental Indenture, dated as of November 22, 2022, between GE HealthCare Holding LLC and The Bank of New York Mellon, as trustee (incorporated by reference to Exhibit 4.2 \nto\n General Electric Company’s Current Report on Form 8-K filed with the SEC on November 23, 2022).\n4.3\nSecond Supplemental Indenture\n, dated as of August 1\n4,\n 2024\n, between \nthe Registrant and \nT\nhe Bank of New \nYork Me\nllon, as trustee\n (incorpo\nrated by reference \nto\n Exhibit 4.2 \nto\n t\nhe Registrant\n’\ns Current Report on Form \n8-K filed with the SEC on August 15, 2024).\n \n4.4\nDescription of Securities (incorporated by reference to Exhibit 4.4 \nt\no\n the Registrant’s Annual Report on Form 10-K filed with the SEC on February 15, 2023).\n10.1\nTax Matters Agreement, dated January 2, 2023, by and between General Electric Company and the Registrant (incorporated by reference to Exhibit 10.2 to the Registrant’s Current Report on Form 8-K filed with the SEC on January 4, 2023).\n†\n10.2\nEmployee Matters Agreement, dated January 2, 2023, by and between General Electric Company and the Registrant (incorporated by reference to Exhibit 10.3 to the Registrant’s Current Report on Form 8-K filed with the SEC on January 4, 2023).\n10.3\nTrademark License Agreement, dated December 31, 2022, by and between General Electric Company and GE HealthCare Imaging Holding Inc. (incorporated by reference into Exhibit 10.4 to the Registrant’s Current Report on Form 8-K filed with the SEC on January 4, 2023).\n†\n10.4\nReal Estate Matters Agreement, dated January 2, 2023, by and between General Electric Company and the Registrant (incorporated by reference to Exhibit 10.5 to the Registrant’s Current Report on Form 8-K filed with the SEC on January 4, 2023).\n10.5\nForm of Indemnification Agreement (incorporated by reference to Exhibit 10.7 to the Registrant’s Form 10 filed with the SEC on October 11, 2022).\n10.6\nTerm Loan Agreement, dated as of November 4, 2022, by and among GE HealthCare Holding LLC, as the borrower, the lenders from time to time party thereto and Citibank, N.A., as administrative agent (incorporated by reference to Exhibit 10.8 to the Registrant’s Amendment No.1 to Form 10 filed with the SEC on November 7, 2022).\n10.7\n364-Day Revolving Credit Agreement, dated as of December 1\n1\n, 202\n4\n, by and among GE HealthCare Technologies Inc., the lenders party thereto, and Citibank, N.A., as Administrative Agent \n(incorporated by reference to Exhibit 10.1 \nto\n the Registrant’s Form 8-K filed with the SEC on December 1\n2\n, 202\n4\n).\n10.8\nCredit Agreement, dated as of November 4, 2022, by and among the Registrant, as the borrower, the lenders from time to time party thereto and Citibank, N.A., as administrative agent (incorporated by reference to Exhibit 10.10 to the Registrant's Amendment No. 1 to Form 10 filed with the SEC on November 7, 2022).\n10.9*\nGE HealthCare 2023 Long-Term Incentive Plan (incorporated by reference to Exhibit 10.11 \nto\n the Registrant’s Registration Statement on Form S-1 filed with the SEC on December 14, 2022).\n10.10*\nGE HealthCare Mirror 2022 Long-Term Incentive Plan (incorporated by reference to Exhibit 10.12 \nto\n the Registrant’s Registration Statement on Form S-1 filed with the SEC on December 14, 2022).\n10.11*\nGE HealthCare Mirror 2007 Long-Term Incentive Plan (incorporated by reference to Exhibit 10.13 \nto\n the Registrant’s Registration Statement on Form S-1 filed with the SEC on December 14, 2022).\n10.12*\nGE HealthCare Mirror 1990 Long-Term Incentive Plan (incorporated by reference to Exhibit 10.14 \nto\n the Registrant’s Registration Statement on Form S-1 filed with the SEC on December 14, 2022).\n10.13*\nOffer Letter with Peter J. Arduini, dated June 15, 2021 (incorporated by reference to Exhibit 10.15 to the Registrant’s Amendment No. 1 to Form 10 filed with the SEC on November 7, 2022).\n10.14*\nAmended Offer Letter with Peter J. Arduini, dated November 16, 2022 (incorporated by reference to Exhibit 10.16 to the Registrant’s Amendment No. 2 to Form 10 filed with the SEC on November 18, 2022).\n10.15*\nOffer Letter with Frank R. Jimenez, dated February 4, 2022 (incorporated by reference to Exhibit 10.13 to the Registrant’s Quarterly Report on Form 10-Q filed with the SEC on April 25, 2023).\n10.16*\nOffer Letter with James K. Saccaro, dated May 4, 2023 (incorporated by reference to Exhibit 10.2 to the Registrant’s Quarterly Report on Form 10-Q filed with the SEC on July 25, 2023).\n†\n10.17*\nOffer Letter with Taha Kass-Hout, \ndated September \n9\n, 202\n2\n (incor\nporate\nd by reference to Exhibit 10.5 to the Registrant\n’\ns Quarterly Report on Form 10-\nQ filed with the SEC on April 30, 2024).\n10.18*\nPerformance Stock Unit Grant Agreement for Peter J. Arduini, dated February 23, 2022 (incorporated by reference to Exhibit 10.19 to the Registrant’s Amendment No. 1 to Form 10 filed with the SEC on November 7, 2022).\n10.19*\nGE HealthCare Annual Executive Incentive Plan (incorporated by reference to Exhibit 10.20 to the Registrant’s Amendment No. 1 to Form 10 filed with the SEC on November 7, 2022).\n10.20*\nGE HealthCare Restoration Plan (incorporated by reference to Exhibit 10.21 to the Registrant’s Amendment No. 1 to Form 10 filed with the SEC on November 7, 2022).\n10.21*\nOne GE HealthCare Annual Bonus Plan (incorporated by reference to Exhibit 10.4 to the Registrant’s Current Report on Form 8-K filed with the SEC on February 3, 2023).\n110\n10.22*\nGE HealthCare US Severance and Change in Control Plan for CEO and Leadership Team (incorporated by reference to Exhibit 10.1 to the Registrant’s Quarterly Report on Form 10-Q filed with the SEC on July 25, 2023).\n10.23*\nGE HealthCare Non-Employee Director Compensation and Benefits Plan (incorporated by reference to Exhibit 10.9 to the Registrant’s Quarterly Report on Form 10-Q filed with the SEC on April 25, 2023).\n10.24*\nGE HealthCare Founders Restricted Stock Unit Grant Agreement (incorporated by reference to Exhibit 10.1 to the Registrant’s Current Report on Form 8-K filed with the SEC on February 3, 2023)\n. \n10.25*\nGE HealthCare Founders Stock Option Grant Agreement (incorporated by reference to Exhibit 10.2 to the Registrant’s Current Report on Form 8-K filed with the SEC on February 3, 2023).\n10.26*\n2023 GE HealthCare Restricted Stock Unit Grant Agreement (incorporated by reference to Exhibit 10.1 to the Registrant’s Current Report on Form 8-K filed with the SEC on March 3, 2023).\n10.27*\n2023 GE HealthCare Stock Option Grant Agreement (incorporated by reference to Exhibit 10.2 to the Registrant’s Current Report on Form 8-K filed with the SEC on March 3, 2023).\n10.28*\n2023 GE HealthCare Performance Stock Unit Grant Agreement (incorporated by reference to Exhibit 10.3 to the Registrant’s Current Report on Form 8-K filed with the SEC on March 3, 2023).\n10.29*\n2023 Global Addendum (incorporated by reference to Exhibit 10.3 to the Registrant’s Current Report on Form 8-K filed with the SEC on February 3, 2023).\n10.30*\n2\n024 GE HealthCare Restricted Stock Unit Agreement (\nincorporated by reference to \nExhibit\n 10.1 to the Re\ngistrant\n’\ns \nQuarterly \nReport on Form \n10-Q\n filed with the SEC on \nApril \n30, 2024)\n.\n10.31*\n2\n024 GE HealthC\nare Stock Option Grant Agreement (incorporated by reference to Exhibit 10.2 to the Registrant\n’\ns Quarterly Report on Form 10-\nQ filed with t\nhe S\nEC on April 30, 2024).\n10.32*\n2\n024 GE H\nealthCare Per\nformance Stock Unit \nGrant Agreement (\nincorporate\nd by reference to Exhib\nit 10.3 to the Registrant\n’\ns Quarterly Report on Form 10-Q filed with th\ne SEC on April 30, 2024).\n10.33*\n2024 Global Addendum (incorpo\nrated by reference to Exhibit 10.4 to the Registrant\n’\ns Quarte\nrly Report on Form 10-\nQ filed with t\nhe SEC on April 30, 2024).\n \n10.34*\nGE HealthCare Director Restricted Stock Unit Grant Agreement (incorporated by reference to Exhibit 10.10 to the Registrant’s Quarterly Report on Form 10-Q filed with the SEC on April 25, 2023).\n10.35*\nGE HealthCare Director Deferred Stock Unit Grant Agreement (incorporated by reference to Exhibit 10.11 to the Registrant’s Quarterly Report on Form 10-Q filed with the SEC on April 25, 2023).\n19.1\nGE H\nealthCare Technologies Inc. Securities Trading Policy.\n21.1\nSubsidiaries of the Registrant.\n23.1\nConsent of Independent Registered Public Accounting Firm\n.\n31.1\nCertification of the Registrant’s Chief Executive Officer pursuant to Rule 13a-14(a)/15d-14(a) of the Securities Exchange Act of 1934, as amended, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2\nCertification of the Registrant’s Chief Financial Officer pursuant to Rule 13a-14(a)/15d-14(a) of the Securities Exchange Act of 1934, as amended, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1\nCertifications of the Registrant’s Chief Executive Officer and Chief Financial Officer pursuant to 18 U.S.C. 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n97.1\nGE HealthCare Technologies Inc. Clawback Policy\n \n(inco\nrporated by reference to \nExhibit 9\n7\n.1 to the Registrant\n’\ns Annual Report on Form 10-K filed with t\nhe SEC on \nFebruary\n 6, 202\n4\n).\n \n101\nThe following materials from GE HealthCare Technologies Inc.’s Annual Report on Form 10-K for the fiscal year ended December 31, 2024, formatted inline XBRL (eXtensible Business Reporting Language): (1) Consolidated and Combined Statements of Income for the years ended December 31, 2024, 2023, and 2022; (2) Consolidated and Combined Statements of Comprehensive Income (Loss) for years ended December 31, 2024, 2023, and 2022; (3) Consolidated Statements of Financial Position as of December 31, 2024 and 2023; (4) Consolidated and Combined Statements of Changes in Equity for the years ended December 31, 2024, 2023, and 2022; (5) Consolidated and Combined Statements of Cash Flows for the years ended December 31, 2024, 2023, and 2022; and (6) Notes to the Consolidated and Combined Financial Statements.\n104\nCover Page Interactive Data File (formatted as Inline XBRL).\n†\nCertain portions of this exhibit have been redacted pursuant to Item 601(b)(2)(ii) and Item 601(b)(10)(iv) of Regulation S-K, as applicable. The Company agrees to furnish supplementally an unredacted copy of the exhibit to the Securities and Exchange Commission upon its request.\n*\nManagement contract or compensatory plan or arrangement. \nITEM 16. FORM 10-K SUMMARY\nRegistrants may voluntarily include a summary of information required by Form 10-K under this Item 16. The Company has elected to not include such summary information.\n111\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nGE HealthCare Technologies Inc.\n(Registrant)\nFebruary 13, 2025\n/s/ James K. Saccaro\nDate\nJames K. Saccaro, Vice President & Chief Financial Officer (Principal Financial Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities indicated on February 13, 2025.\nSignature\n/s/ Peter J. Arduini\nTitle\nPeter J. Arduini, President & Chief Executive Officer and Director (Principal Executive Officer)\n/s/ James K. Saccaro\nJames K. Saccaro, Vice President & Chief Financial Officer (Principal Financial Officer)\n/s/ George A. Newcomb\nGeorge A. Newcomb, Chief Accounting Officer (Principal Accounting Officer)\n/s/ H. Lawrence Culp, Jr.\nH. Lawrence Culp, Jr., Chairman of the Board of Directors\n/s/ Rodney F. Hochman\nRodney F. Hochman, Director\n/s/ Lloyd W. Howell, Jr.\nLloyd W. Howell, Jr., Director\n/s/ Risa Lavizzo-Mourey\nRisa Lavizzo-Mourey, Director\n/s/ Catherine Lesjak\nCatherine Lesjak, Director\n/s/ Anne T. Madden\nAnne T. Madden, Director\n/s/ Tomislav Mihaljevic\nTomislav Mihaljevic, Director\n/s/ William J. Stromberg\nWilliam J. Stromberg, Director\n/s/ Phoebe L. Yang\nPhoebe L. Yang, Director\n112"
  }
}