{
  "ticker": "GEN",
  "cik": "0000849399",
  "company_name": "Gen Digital Inc.",
  "filing_date": "2025-05-15",
  "accession": "0000849399-25-000033",
  "primary_doc": "gen-20250328.htm",
  "item_sections": {
    "item1": "Item 1A.\n5\nTable of Contents\nPART I\nItem 1. \nBusiness\nPurpose and Mission\nPurpose: Powering Digital Freedom.\nMission: We create innovative and easy-to-use technology solutions that help people grow, manage and secure their digital and financial lives.\nOur Values\nProtecting people is what inspires us, and our people are at the core of what we do. We seek to attract talent that embraces the following values:\n•\nCustomer Driven. Community Minded.\n We are customer obsessed and drive positive impact.\n•\nThink Big. Be Bold.\n We embrace change and innovate fearlessly.\n•\nBe Scrappy. Make it Happen.\n Big or small, we get things done irrespective of title or role.\n•\nPlay to Win. Together.\n We win for our customers, with passion and integrity.\nCompany Overview\nGen is a global company powering Digital Freedom with a family of trusted brands including Norton, Avast, LifeLock and more. We bring award-winning products and services in cyber safety, covering security, privacy, identity protection and financial wellness to approximately 500 million users in more than 150 countries, empowering them to live their digital lives safely, privately, and confidently today and for generations to come.\nToday’s world is increasingly digital, and this has changed the way we live our lives every day. The last decade has brought increasingly impressive technological advances that have unlocked new ways to play and transact online, control smart homes, manage our life and more. The possibilities in the digital world will continue to unlock new possibilities. However, as our digital footprint expands, so do the risks and exposure. Cybercriminals use a mix of old and new tactics and technologies, including phishing, vishing, smishing, based on machine learning and generative artificial intelligence (AI) technologies, to execute highly advanced threats and attacks. We are our customers’ trusted ally that they can depend on to help secure and control their digital lives so they can be free to enjoy the promise of the digital world. We are committed more than ever to protecting and empowering people’s digital lives with personalized, human-centered safety.\nWe are well-positioned to drive awareness of cyber safety for individuals, families, and small businesses, fueled by an increasingly connected world. We maintain a global, omni-channel sales approach, including direct, indirect and freemium acquisition and a family of brands marketing program. This program is designed to grow our customer base by increasing brand awareness and understanding of our products and services and maximizing our global reach to prospective customers.\nWe help prevent, detect and restore potential damages caused by cybercriminals. We also make it easy for consumers to find, buy and use our products and services. To this end, we offer both free and paid subscription-based cyber safety solutions primarily direct-to-consumer through our family of brands and indirectly through partner relationships. Most of our subscriptions are offered on annual terms, but we also provide monthly subscriptions. \nAs of March 28, 2025, we have approximately 500 million total users, which come from direct, indirect and freemium channels. Of these total users, we have approximately 65 million paid cyber safety customers including over 40 million direct customers with whom we have a direct billing relationship.\n•\nDirect-to-consumer channel:\n We use advertising to elevate our family of brands, attract new customers and generate significant demand for our services. Our direct subscriptions are primarily sold through our e-commerce platform and mobile apps, and we have a direct billing relationship with the majority of these customers.\n•\nIndirect partner distribution channels:\n We use strategic and affiliate partner distribution channels to refer prospective customers to us and expand our reach to our partners’ and affiliates’ customer bases. We developed and implemented a global partner sales organization that targets new, as well as existing, partners to enhance our partner distribution channels. These channels include retailers, telecom service providers, hardware original equipment manufacturers (OEMs), employee benefit providers, strategic partners, small offices, home offices and very small businesses. Physical retail and OEM partners represent a small portion of our distribution, which minimizes the impact of supply chain disruptions.\n•\nFreemium channels:\n With the acquisitions of Avast and Avira, we have expanded our go-to-market with multiple freemium channels. We use free versions of our products to reach the broadest set of consumers globally and bring cyber safety to a larger audience, especially in international markets. The free solution offers a baseline of protection and presents premium functionalities based on the risk profile and specific needs of the user. The user can choose to add specific premium solutions or upgrade to suites that provide security, identity, and privacy across multiple platforms and devices, thereby becoming a paid customer.\n6\nTable of Contents\nSeasonality\nAs is typical for many consumer technology companies, portions of our business are impacted by seasonality. However, we believe the net impact on our business is limited. Seasonal behavior in orders primarily reflects consumer spending patterns during our fiscal third and fourth quarters, as order volume is generally higher due to the holidays in our third quarter, as well as due to follow-on holiday purchases and the U.S. tax filing season which is in our fourth quarter. Revenue generally reflects similar seasonal patterns but to a lesser extent than orders because of our subscription business model, as the majority of our in-period revenues are recognized ratably from our deferred revenue balance.\nOur Strategy\nOur strategy is focused on long-term profitable growth. To fuel our growth, our consumer-centric strategy is to provide comprehensive and easy-to-use integrated platforms, which we have built in-house or acquired. By combining and leveraging our family of trusted consumer brands, including offerings from Norton, Avast, LifeLock and more, we deliver an industry-leading cyber safety and trust-based solutions. \nWe are positioned for long-term growth and expansion. Our three primary growth levers are:\n1.\nExtending Reach:\n Leveraging an omni-channel strategy and building partnerships to broaden privacy and identity protection internationally.\n2.\nIncreasing Value:\n Cross-selling and up-selling, and expanding security, identity and privacy solutions to address consumers’ evolving needs.\n3.\nGrowing Loyalty:\n Increase customer loyalty and retention, as consumers move from point products protecting their devices towards all-in-one comprehensive cyber safety memberships.\nThe key elements of our strategy include the following:\n•\nExtend our leadership position through new products and continued enhancement of our trust-based solutions and services: \nCyber safety is a large and expanding market, which we believe provides a significant growth opportunity. Our strategy is to grow our business through innovation and acquisitions to expand the solutions and services we offer into new cohorts, territories and sectors. We believe there are many additional areas where we can both offer new solutions, as well as use our core capabilities and our integrated platform to reach new customers and markets globally.\n•\nGrow our customer base through multiple channels:\n We have multiple go-to-market channels to reach new customers globally, including direct-to-customer, indirect partnerships and freemium. We intend to leverage our expertise in digital marketing, as well as existing and new strategic partnerships, to grow our customer base. We believe that continued investments in these areas, as well as our product offerings and infrastructure, will allow us to further enhance our leading brands and superior products, increase awareness of our consumer services and enhance our ability to efficiently acquire new customers. \n•\nContinue our focus on customer retention: \nWe continue to optimize and expand the value we provide to customers which we believe can positively impact retention. We aim to continue to increase customer engagements through actionable alerts, education on timely topics and introducing new product capabilities. We also plan to continue investing in enhancing both desktop and mobile customer experiences throughout a customer’s journey with Gen, from purchase, to onboarding and beyond. \n•\nIncrease value to existing customers:\n We believe strong customer satisfaction will provide us with the opportunity to engage customers in new services offerings. We maintain the Norton 360 and Avast One platforms that have multiple tiers of membership, and we continue to engage customers with standalone products to offer membership options and show the value proposition of our premium solutions. Over time, we plan to drive further growth as we add additional offerings and services for our customers.\n•\nDraw strength from our world-class customer service support: \nOur global support team seeks to ensure the voice of the consumer is heard and that we put our customers first. We leverage frequent communication and feedback from our customers to continually improve our solutions and services. We embrace end-to-end customer experience and aim to continue to improve our Net Promoter Scores and overall customer satisfaction.\n•\nLeverage our global brands to drive growth: \nWe will work to keep building our family of trusted brands in markets globally as we strive to bring protection and empowerment to all consumers when it comes to their digital lives. According to our most recent research, Norton has 93% global brand awareness, and we are best positioned and top of mind in consumer cyber safety, according to the internal H1 2025 Gen Brand Tracker. \nOur Cyber Safety Solutions and Services\nOur broad portfolio of products and services is developed from consumer insights to help us bring to market real solutions to real problems and to engage and educate consumers about cyber safety. We continuously aim to release new products and features to outpace evolving threats and find synergies to integrate current and future technology acquisitions. \nOur cyber safety portfolio provides protection across three key categories in multiple channels and geographies, including security and performance, identity protection, and online privacy. Leveraging our technology platforms, we integrate software and service capabilities within these three categories into comprehensive and easy-to-use products and solutions across our brands. \n7\nTable of Contents\nWe have also evolved beyond traditional cyber safety to offer adjacent trust-based solutions, including digital identity and access management, digital reputation, and restoration support services.\nWe protect and empower consumers by providing solutions and services in two main ways:\n•\nComprehensive membership plans:\n Providing a comprehensive and all-in-one cyber safety portfolio of solutions for a membership fee. Plans are offered through Norton 360 and Avast One subscriptions, with both brands providing multiple levels of membership tiers that range from basic, mid-level, or premium tiers where identity theft and online privacy features are included.\n•\nPoint solutions: \nProviding individual, stand-alone products and services in security, identity and privacy, offering flexibility for consumers to choose between free or paid solutions. These products solve for a specific need, when you need it, and can add on to the value you already have. Please see below for our full set of products by category.\nWe are well positioned across three key cyber safety categories:\n•\nSecurity and Performance (Norton, Avast, Avira, AVG, and CCleaner offerings):\n Our offerings provide real-time threat protection for PCs, Macs and mobile devices against malware, viruses, adware, ransomware and other online emerging threats. These offerings monitor and block unauthorized traffic from the internet to the device to help protect private and sensitive information when customers are online. Additionally, our all-in-one cybersecurity solutions help small business owners safeguard their team’s online activities, devices and customer data. Scams have also continued to become more prevalent and sophisticated and we offer a range of AI-powered features integrated into Norton Cyber Safety products to provide always-on protection from today’s most sophisticated scams across phone calls, texts, emails, and websites. Norton Scam Protection and Scam Protection Pro utilize Norton Genie AI engine to analyze the meaning of words, not just links, helping to stop hidden scam patterns that even the most careful person can miss. We also provide performance and optimization software solutions that free up space on devices, clear online tracking and help machines run faster.\n•\nIdentity Protection (U.S.: LifeLock Identity Theft Protection, Avast and AVG Secure Identity; International: Norton Identity Theft Protection, Dark Web Monitoring):\n In the U.S., we offer Identity Theft protection as part of our LifeLock, Avast and AVG brands. All three products include monitoring of credit reports, the dark web and social media accounts to help safeguard our customers’ personal information. The LifeLock product also offers monitoring of financial accounts. In the event of identity theft, we assign an Identity Restoration Specialist to work directly with customers to help restore their identities, and all plans include reimbursements for losses and expenses incurred ranging up to $3 million. Outside the U.S., we offer Norton and have expanded Avast and AVG branded plans to additional regions. Plans include dark web monitoring in over 50 countries and monitoring of credit, social media and financial accounts, restoration support and identity theft insurance in select countries.\n•\nOnline Privacy (VPN, multiple personal data protection products, ReputationDefender):\n Our virtual private network (VPN) solutions offered through the Norton, Avast and AVG brands enhance security and online privacy by providing an encrypted data tunnel. This allows customers to securely transmit and access private information, such as passwords, bank details and credit card numbers, when using public Wi-Fi on PCs, Macs, and mobile iOS and Android devices. We offer a variety of solutions under the Norton and Avast brands to protect customers’ data either by keeping data anonymous while browsing online through our AntiTrack and Secure Browser products or helping customers remove data from public data broker sites through our Privacy Monitor Assistant and BreachGuard products. Norton offers a three-tiered VPN with advanced privacy and malware protection as well as AI-powered protection against sophisticated cyber threats, including scams and phishing attacks. ReputationDefender is a white glove service that helps customers manage all aspects of their personal branding online, including search results, social media sites and overall web presence.\nInnovation, Research and Development\nGen has a long history of innovation, and we plan to continue to invest in research and development to drive our long-term success.\nAs cyber threats evolve, we are focused on delivering a portfolio that protects each element of our customers’ digital lives. To do this, we engage and listen to our customers, and we embrace innovation by deploying a global research and development strategy across our cyber safety platform. Our engineering and product management teams are focused on delivering new versions of existing offerings, as well as developing entirely new offerings to drive the company’s global leadership in cyber safety. \nWe are committed to our innovation and research and development efforts. The Technology team at Gen is driving the company’s future technologies and innovation and helping guide the consumer cybersecurity industry. Our global technology research organization is focused on applied research projects, with the goal of rapidly creating new products to address consumer trends and grow the business, including defending consumer digital privacy and identity. We also have a global threat response and security technology organization that is comprised of our dedicated team of threat and security researchers, supported by advanced systems to innovate security technology and threat intelligence. \nWe have one of the world’s largest consumer cyber safety networks. Leveraging our capabilities, our global threat response team handles a wide variety of attacks, including social engineering attacks, file-based attacks, web and network-based attacks, privacy and data exfiltration attacks, identity theft attacks, algorithmic manipulation attacks, and more.\n8\nTable of Contents\nOur differentiated approach is powered by our global scale and visibility, geographically distributed cloud data platform, and advanced AI-based automation.\nIndustry Overview\nCyber safety is a growing market, fueled by the increase in activities online over the years as well as expected growth in the years ahead. The core markets that we participate in are security, identity and privacy. We believe the cyber safety market will continue to expand beyond these core markets and grow significantly, driven by the increasing number of people globally connected to the internet and their expanding digital lives.\nThe cyber threat landscape is larger and more complicated than ever before, exposing consumers to an increased risk to their digital lives. The digitization of the world and the overlap between the physical and digital world are growing at a fast pace. New technologies, smart devices, digital identities and an increasingly more connected world mean consumers will encounter a range of new cyber safety challenges. Consumer demands and behaviors are rapidly changing and driving more activities online, from shopping, socializing, working, banking, to other activities in healthcare, entertainment and so much more. Almost every aspect of a person’s life has a digital component. Unfortunately, many of those activities are left unprotected, and attackers are exploiting this larger opportunity and the inherent security and privacy vulnerabilities. Cybercriminals have not only expanded their reach, but the sophistication of digital threats and attacks are becoming increasingly more realistic and believable. The advancement of AI and large language model (LLM) technology is a key driver of this increased risk.\nCybercrime, and the ways in which cybercriminals target consumers, continue to evolve along with behaviors and technology. Cybercrime encompasses any crime committed with devices over the internet and includes crimes where (i) malicious software or unauthorized access is detected on a device, network or online account (such as email, social media, online banking, digital assets, online retail, gaming, online entertainment, etc.), and unauthorized access or connection to cloud service accounts; (ii) an individual is digitally victimized through a data breach, cyber theft, cyber extortion, or fraud (stolen personally identifiable information, identity theft, etc.); (iii) online stalking, bullying, or harassment is inflicted; or (iv) attacks related to privacy or disinformation (such as online tracking protection, identity impersonation, disinformation on social media, deepfakes, unsecured WiFi, EvilTwin attacks, etc.).\nCompetitive Landscape\nWe operate in a highly competitive and dynamic environment. We face global competition from a broad range of companies, including software vendors focusing on cyber safety solutions, operating system providers such as Apple, Google and Microsoft, and ‘pure play’ companies that currently specialize in one or a few particular segments of the market (many of which are expanding their product portfolios into different segments). We believe the competitive factors in our market include innovation, access to a breadth of identity and consumer transaction data, broad and effective service offerings, brand recognition, technology, effective and cost-efficient customer acquisition, strong retention rate, customer satisfaction, price, convenience of purchase, ease of use, frequency of upgrades and updates and quality and reliable customer service. Our competitors may vary by offering, geography, business model and channel. \nOur principal competitors are set forth below: \n•\nSecurity: \nOur principal competitors in this segment include Apple, Bitdefender, ESET, F-Secure, Google, Kaspersky, Malwarebytes, McAfee, Microsoft, Trend Micro, and Webroot.\n•\nIdentity Protection: \nOur principal competitors in this segment include credit bureaus such as Equifax, Experian and TransUnion, as well as certain credit monitoring and identity theft protection solutions from others such as Allstate, Aura, Generali (Iris), Intuit (Credit Karma) and Microsoft.\n•\nOnline Privacy:\n Our principal competitors in this segment include Apple, Aura, Brave, DuckDuckGo, IPVanish, Kape, Mozilla and Nord Security.\n•\nOther Competitors:\n In addition to competition from independent software vendors such as Bitdefender, Kaspersky, McAfee and Trend Micro, and from OS providers such as Apple, Google and Microsoft, we also face competition from other companies that currently focus on one or a few cyber safety or adjacent segments but are developing additional competing products and expanding their portfolios into new segments, such as ‘pure play’ companies including but not limited to, 1Password, Bark, Dashlane, LastPass, Life360, Proton, and Truecaller, internet service providers, big tech platform providers, insurance companies and financial service organizations. \nWe believe we compete favorably with our competitors on the strength of our technology, people, product offerings and presence in all of the current key cyber safety categories. However, some of our competitors have greater financial, technical, marketing, distribution or other resources than we do, including in new cyber safety and digital life segments we may enter, which consequently affords them competitive advantages. As a result, they may be able to devote greater resources to develop, promote and sell their offerings; deliver competitive offerings at lower prices or for free; and introduce new solutions and respond to market developments and customer requirements and preferences more quickly or cost effectively than we can. In addition, for individual solutions or features, smaller, well-funded competitors may be able to innovate and adapt more nimbly to the dynamic nature of the market and shifting consumer needs.\nFor more information on the risks associated with our competitors, please see “Risk Factors” – Risks Related to Our Business Strategy and Industry – “We operate in a highly competitive and dynamic environment, and if we are unable to compete effectively, we could experience a loss in market share and a reduction in revenue” and “We may need to change our pricing models to compete successfully,” in",
    "item1a": "Item 1A of this Annual Report on Form 10-K, which disclosures are incorporated by reference herein.",
    "item1b": "Item 1B. \nUnresolved Staff Comments\nNone.",
    "item1c": "Item 1C. \nCybersecurity\nCybersecurity risk management and strategy\nWe maintain a cybersecurity program designed to protect our systems and data from information security risks, including regular oversight of our programs for security monitoring.\n Gen has a process for identifying and assessing material risks from cybersecurity threats on a regular basis that operates alongside our broader overall risk assessment process, covering all identified enterprise wide risks.\n Cybersecurity risk is reviewed quarterly with management and with the board of directors. \nIn addition, we regularly perform evaluations (including independent third-party evaluations) of our security program and our information technology infrastructure and information security management systems. A retained independent third-party firm reviews the maturity of our information security program and the results are discussed annually in the Technology and Cybersecurity Committee of the Board. Our processes also address risk and identification of cybersecurity threat risks from our \nuse of third-party service providers\n.\n This involves, among other things, conducting pre-engagement risk-based diligence, reviewing security and controls reports, implementing contractual security and notification provisions, and ongoing monitoring as needed.\n \nOur information security management system is based upon industry frameworks including but not limited to ISO 27001 and NIST Cybersecurity Framework. \nOur \nChief Information Security Officer (CISO)\n leads our cybersecurity program, which includes the implementation of controls designed to align with these industry frameworks and applicable statutes and regulations.\n \nOur CISO has over 30 years of prior work experience in various roles involving managing information security programs, developing cybersecurity strategy, implementing effective information and cybersecurity initiatives and has been the Head of IT Audit, CISO and CIO at three other companies prior to Gen Digital. He has a Bachelor of Science in Computer Information Systems.\n We have implemented security monitoring capabilities designed to alert us to suspicious activity and developed an incident response program that includes an annual table top exercise and is designed to restore business operations quickly. In addition, employees participate in mandatory annual training and receive communications regarding the cybersecurity environment to increase awareness throughout the company. We also implemented an enhanced annual training program for specific specialized employee populations, including secure coding training.\nGovernance\nThe Technology and Cybersecurity Committee of the Board has direct oversight to the Company’s (1) technology strategy, initiatives, and investments and (2) key cybersecurity information technology risks against both internal and external threats.\n The Technology and Cybersecurity Committee is comprised entirely of independent directors, all of whom have experience related to information security issues or oversight and meets and reports to the Board on a quarterly basis. The \nAudit Committee\n, which is also comprised entirely of independent directors, considers cybersecurity information technology risks in connection with overseeing our enterprise risk management system, and reports to the Board on enterprise risk management matters on a quarterly basis. \nWe have processes in place for management to report security instances to the Technology and Cybersecurity Committee and Audit Committee as they occur, if material, and to provide a summary multiple times per year of other incidents to the Technology and Cybersecurity Committee.\n \nAdditionally, our CISO attends each Technology and Cybersecurity Committee meeting and meets regularly with the Board of Directors or the Audit Committee of the Board of Directors to brief them on technology and information security matters.\n We carry insurance that provides protection against some of the potential losses arising from a cybersecurity incident.\n \nIn the last fiscal three years, we have not experienced any material information security breach incidences and the expenses we have incurred from information security breach incidences were immaterial. This includes penalties and settlements, of which there were none.\n31\nTable of Contents\nWe describe whether and how risks from identified cybersecurity threats, including as a result of any previous cybersecurity incidents, have materially affected or are reasonably likely to materially affect us, including our business strategy, results of operations, or financial condition, under the heading “\nOur solutions, systems, websites and the data on these sources have been in the past and may continue to be subject to cybersecurity events that could materially harm our reputation and future sales.\n” included as part of ”Risk Factors” in"
  }
}