{
  "ticker": "GILD",
  "cik": "0000882095",
  "company_name": "GILEAD SCIENCES, INC.",
  "filing_date": "2025-02-28",
  "accession": "0000882095-25-000006",
  "primary_doc": "gild-20241231.htm",
  "item_sections": {
    "item1": "Item 1. Business “Raw Materials and Manufacturing\n.\n” Our global operations include offices in Europe, North America, Asia, South America, Africa, Australia and the Middle East.\nWe believe that our existing properties, including both owned and leased sites, are adequate and suitable for the conduct of our business. We believe our capital resources are sufficient to purchase, lease or construct any additional facilities required to meet our expected long-term growth needs.\n32\nITEM 3.\n    \nLEGAL PROCEEDINGS\n \nFor a description of our significant pending legal proceedings, see Note 13. Commitments and Contingencies - Legal Proceedings of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K.\nITEM 4.\n    \nMINE SAFETY DISCLOSURES \nNot applicable. \n33\nPART II \nITEM 5.    MARKET FOR REGISTRANT’S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES \nMarket Information\nOur common stock is traded on the Nasdaq Global Select Market under the symbol “GILD.” \nHolders\nAs of February 21, 2025, we had approximately 1,339 stockholders of record of our common stock.\nDividends\nFor the years ended December 31, 2024 and \n2023\n, we paid quarterly dividends. We expect to continue to pay quarterly dividends, although the amount and timing of any future dividends are subject to declaration by our Board of Directors. Additional information is included in Consolidated Statements of Stockholders’ Equity of Part II, Item 8 of this Annual Report on Form 10-K and “Liquidity and Capital Resources” of Part II, Item 7 of this Annual Report on Form 10-K.\nSecurities Authorized For Issuance Under Equity Compensation Plans\nThe following table provides certain information with respect to our equity compensation plans in effect as of December 31, 2024:\n(in millions, except exercise price)\nNumber of Common Shares to be Issued Upon Exercise of Outstanding Options and Rights\n(1)\nWeighted-average Exercise Price of Outstanding Options and Rights\n(1)\nNumber of Common Shares Remaining Available for Future Issuance Under Equity Compensation Plans (Excluding Securities Reflected in Column (a)) \nPlan Category\n (a)\n (b)\n(c) \nEquity compensation plans approved by security holders:\n2022 Equity Incentive Plan\n34.7 \n$\n69.85 \n69.9 \nEmployee Stock Purchase Plan\n(2)\n23.8 \nTotal equity compensation plans approved by security holders\n34.7 \n$\n69.85 \n93.7 \nEquity compensation plans not approved by security holders\n— \n$\n— \n— \nTotal\n34.7 \n$\n69.85 \n93.7 \n_______________________________\n \n(1)\n    Includes 23 million restricted stock units and performance share units. These awards have no exercise price and are not included in the weighted-average exercise price of outstanding awards. \n(2)\n    Under our Employee Stock Purchase Plan, participants are permitted to purchase our common stock at a discount on certain dates through payroll deductions within a pre-determined purchase period. Accordingly, these numbers are not determinable.\n34\nPerformance Graph\n(1) \nThe following graph compares our cumulative total stockholder return for the past five years to two indices: the Standard & Poor’s 500 Stock Index (“S&P 500 Index”) and the Nasdaq Biotechnology Index (“NBI Index”). The stockholder return shown on the graph below is not necessarily indicative of future performance, and we do not make or endorse any predictions as to future stockholder returns. \nComparison of Cumulative Total Return on Investment for the Past Five Years\n(2)\n \n_______________________________\n \n(1)\n    This section is not “soliciting material,” is not deemed “filed” with U.S. Securities and Exchange Commission and is not to be incorporated by reference in any of our filings under the Securities Act of 1933, as amended or the Securities Exchange Act of 1934, as amended, whether made before or after the date hereof and irrespective of any general incorporation language in any such filing. \n(2)\n    Shows the cumulative return on investment assuming an investment of $100 in our common stock, the NBI Index and the S&P 500 Index on December 31, 2019, and assuming that all dividends were reinvested.\n35\nIssuer Purchases of Equity Securities\nIn the first quarter of 2020, our Board of Directors authorized a $5.0 billion stock repurchase program (“2020 Program”), with no fixed expiration. Purchases under the 2020 Program may be made in the open market or in privately negotiated transactions, but the program does not obligate us to repurchase any specific number of shares and may be amended, suspended or discontinued at any time. We started repurchases under the 2020 Program in December 2022. \nThe table below summarizes our stock repurchase activity for the three months ended December 31, 2024:\nTotal Number of Shares Purchased (in thousands)\nAverage Price Paid per Share\nTotal Number of Shares Purchased as Part of Publicly Announced Programs (in thousands)\nApproximate Dollar Value of Shares that May Yet Be Purchased Under the Programs (in millions)\nOctober 1 - October 31, 2024\n509 \n$\n86.22 \n468 \n$\n3,034 \nNovember 1 - November 30, 2024\n386 \n$\n91.54 \n334 \n$\n3,003 \nDecember 1 - December 31, 2024\n3,444 \n$\n92.38 \n3,023 \n$\n2,724 \nTotal\n(1)\n4,339 \n$\n91.58 \n3,825 \n_______________________________\n \n(1)\n    The difference between the total number of shares purchased and the total number of shares purchased as part of a publicly announced program is due to shares of common stock withheld by us from employee restricted stock awards in order to satisfy applicable tax withholding obligations.\nITEM 6. \n    \n[RESERVED]\n36\nITEM 7. \n    \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis is intended to provide material information around events and uncertainties known to management that are relevant to an assessment of the financial condition and results of operations of Gilead and should therefore be read in conjunction with our audited Consolidated Financial Statements and the related notes thereto and other disclosures included as part of this Annual Report on Form 10-K (including the disclosures under Part I,",
    "item1a": "Item 1A. Risk Factors of this Annual Report on Form 10-K for a listing of risk factors that could materially and adversely affect our results of operations and financial condition.\n38\nResults of Operations\nRevenues\nThe following table summarizes our Total revenues and period-over-period changes:\nYear Ended December 31, 2024\nYear Ended December 31, 2023\n(in millions)\nU.S.\nEurope\nRest of World\nTotal\nU.S.\nEurope\nRest of World\nTotal\nChange\nProduct sales:\nHIV\nBiktarvy\n$\n10,855 \n$\n1,509 \n$\n1,060 \n$\n13,423 \n$\n9,692 \n$\n1,253 \n$\n905 \n$\n11,850 \n13 \n%\nDescovy\n1,902 \n100 \n110 \n2,113 \n1,771 \n100 \n114 \n1,985 \n6 \n%\nGenvoya\n1,498 \n180 \n84 \n1,762 \n1,752 \n205 \n103 \n2,060 \n(14)\n%\nOdefsey\n957 \n290 \n41 \n1,288 \n1,012 \n294 \n44 \n1,350 \n(5)\n%\nSymtuza - Revenue share\n(1)\n450 \n130 \n12 \n592 \n382 \n133 \n13 \n529 \n12 \n%\nOther HIV\n(2)\n257 \n129 \n48 \n434 \n238 \n116 \n47 \n401 \n8 \n%\nTotal HIV\n15,918 \n2,339 \n1,355 \n19,612 \n14,848 \n2,102 \n1,226 \n18,175 \n8 \n%\nLiver Disease\nSofosbuvir/Velpatasvir\n(3)\n922 \n299 \n374 \n1,596 \n859 \n323 \n355 \n1,537 \n4 \n%\nVemlidy\n486 \n44 \n428 \n959 \n410 \n38 \n414 \n862 \n11 \n%\nOther Liver Disease\n(4)\n192 \n202 \n73 \n467 \n152 \n150 \n83 \n385 \n21 \n%\nTotal Liver Disease\n1,601 \n545 \n876 \n3,021 \n1,421 \n511 \n852 \n2,784 \n9 \n%\nVeklury\n892 \n284 \n623 \n1,799 \n972 \n408 \n805 \n2,184 \n(18)\n%\nOncology\nCell Therapy\nTecartus\n234 \n138 \n31 \n403 \n245 \n110 \n15 \n370 \n9 \n%\nYescarta\n662 \n666 \n242 \n1,570 \n811 \n547 \n140 \n1,498 \n5 \n%\nTotal Cell Therapy\n896 \n804 \n274 \n1,973 \n1,055 \n658 \n156 \n1,869 \n6 \n%\nTrodelvy\n902 \n294 \n119 \n1,315 \n777 \n217 \n68 \n1,063 \n24 \n%\nTotal Oncology\n1,798 \n1,098 \n393 \n3,289 \n1,833 \n875 \n224 \n2,932 \n12 \n%\nOther\nAmBisome\n44 \n276 \n212 \n533 \n43 \n260 \n189 \n492 \n8 \n%\nOther\n(5)\n255 \n34 \n68 \n356 \n261 \n40 \n66 \n367 \n(3)\n%\nTotal Other\n299 \n310 \n280 \n889 \n304 \n301 \n255 \n859 \n3 \n%\nTotal product sales\n20,508 \n4,576 \n3,526 \n28,610 \n19,377 \n4,197 \n3,361 \n26,934 \n6 \n%\nRoyalty, contract and other revenues\n82 \n58 \n4 \n144 \n62 \n114 \n7 \n182 \n(21)\n%\nTotal revenues\n$\n20,591 \n$\n4,634 \n$\n3,529 \n$\n28,754 \n$\n19,438 \n$\n4,310 \n$\n3,368 \n$\n27,116 \n6 \n%\n_______________________________\n(1)\n    Represents our revenue from cobicistat (“C”), emtricitabine (“FTC”) and tenofovir alafenamide (“TAF”) in Symtuza (darunavir/C/FTC/TAF), a fixed dose combination product commercialized by Janssen Sciences Ireland Unlimited Company (“Janssen”). See Note 7. Collaborations and Other Arrangements of the Notes to Consolidated Financial Statements\n \nincluded\n \nin\n \nPart II, Item 8 of this Annual Report on Form 10-K.\n(2)\n    Includes Atripla, Complera/Eviplera, Emtriva, Stribild, Sunlenca, Truvada and Tybost.\n(3)\n    Includes Epclusa and the authorized generic version of Epclusa sold by Gilead’s separate subsidiary, Asegua Therapeutics LLC (“Asegua”).\n(4)\n    Includes ledipasvir/sofosbuvir (Harvoni and the authorized generic version of Harvoni sold by Asegua), Hepcludex, Hepsera, Livdelzi, Sovaldi, Viread and Vosevi.\n(5)\n    Includes Cayston, Jyseleca, Letairis, Ranexa and Zydelig.\nHIV\nHIV product sales increased 8% to $19.6 billion in 2024, compared to 2023, primarily due to higher demand and higher average realized price. In particular:\n•\nBiktarvy sales increased primarily due to higher demand, including patients switching from Genvoya and other Gilead HIV products. To a lesser extent, the increase was also due to higher average realized price.\n•\nDescovy sales increased primarily due to higher demand, partially offset by lower average realized price.\n39\nLiver Disease\nLiver Disease product sales increased 9% to $3.0 billion in 2024, compared to 2023, primarily due to higher demand in products for chronic hepatitis C virus, HBV and, in Europe, chronic hepatitis delta virus, as well as the launch of Livdelzi for treatment of PBC.\nVeklury\nVeklury product sales decreased 18% to $1.8 billion in 2024, compared to 2023, primarily due to decreased rates of COVID-19-related hospitalizations.\nOncology\nCell Therapy\nCell Therapy product sales increased 6% to $2.0 billion in 2024, compared to 2023, primarily due to increased demand outside the U.S. for Yescarta and Tecartus and higher average realized price, partially offset by lower demand in the U.S.\nTrodelvy\nTrodelvy product sales increased 24% to $1.3 billion in 2024, compared to 2023, primarily due to higher demand across all regions.\nGross-to-Net Deductions\nA substantial portion of our product sales is subject to significant discounts from list price, including government and commercial rebates and chargebacks, as well as other deductions, including patient co-pay assistance, cash discounts for prompt payment, distributor fees, and sales return provisions. These deductions to product sales are generally referred to as gross-to-net deductions and are primarily a function of product sales volume, product mix, contractual or statutory discounts and estimated payer mix. \nRebates and chargebacks are based on contractual arrangements or statutory requirements and include amounts due to payers and healthcare providers under various programs. These amounts may vary by product, payer and individual plans. Providers qualified under certain programs can purchase our products through wholesalers or other distributors at a discount. The wholesalers or distributors then charge the discount back to us.\nOther gross-to-net deductions include patient co-pay assistance, cash discounts for prompt payment, distributor fees that we pay under our inventory management agreements with our significant U.S. wholesalers and are based on contractually-determined fixed percentage of sales, and sales return provisions.\nOur gross-to-net deductions totaled $17.8 billion, or 38%, of gross product sales in 2024, compared to $16.4 billion, or 38%, of gross product sales in 2023. Of the $17.8 billion in 2024, $15.5 billion, or 33%, of gross product sales was related to rebates and chargebacks, and $2.3 billion, or 5%, was related to other gross-to-net deductions. Of the $16.4 billion in 2023, $14.3 billion, or 33%, of gross product sales was related to rebates and chargebacks, and $2.2 billion, or 5%, was related to other gross-to-net deductions. \nCurrent year gross-to-net deductions as a percent of gross product sales may not be indicative of future results.\nForeign Currency Exchange Impact\nWe generally face exposure to movements in foreign currency exchange rates, primarily in the Euro. We use foreign currency exchange contracts to hedge a portion of our foreign currency exposures.\nApproximately 27% and 26% of our product sales were denominated in foreign currencies during 2024 and 2023, respectively. Foreign currency exchange, net of hedges, had an unfavorable impact on our total product sales of $163 million in 2024, based on a comparison using foreign currency exchange rates from 2023.\n40\nCosts and Expenses\nThe following table summarizes our costs and expenses and period-over-period changes: \nYear Ended December 31,\n(in millions, except percentages)\n2024\n2023\nChange\nCost of goods sold\n$\n6,251 \n$\n6,498 \n(4)\n%\nProduct gross margin\n78.2 \n%\n75.9 \n%\n228 bps\nResearch and development expenses\n$\n5,907 \n$\n5,718 \n3 \n%\nAcquired in-process research and development expenses\n$\n4,663 \n$\n1,155 \nNM\nIn-process research and development impairments\n$\n4,180 \n$\n50 \nNM\nSelling, general and administrative expenses\n$\n6,091 \n$\n6,090 \n— \n%\n_______________________________\nNM - Not Meaningful\nProduct Gross Margin\nProduct gross margin increased to 78.2% in 2024, compared to 2023, primarily due to prior year restructuring expenses related to changes in our manufacturing strategy, which resulted in write-offs of certain manufacturing facilities, related inventories and other costs totaling $479 million.\nResearch and Development Expenses\nResearch and development expenses consist primarily of personnel costs including salaries, benefits and stock-based compensation expense, infrastructure, materials and supplies and other support costs, research and clinical studies performed by contract research organizations and our collaboration partners and other outside services.\nWe manage our R&D expenses by identifying the R&D activities we expect to be performed during a given period and then prioritizing efforts based on scientific data, probability of successful technical development and regulatory approval, market potential, available human and capital resources and other considerations. We regularly review our R&D activities based on unmet medical need and, as necessary, reallocate resources among our internal R&D portfolio and external opportunities that we believe will best support the long-term growth of our business. We do not track total R&D expenses by product candidate, therapeutic area or development phase.\nThe following table provides a breakout of expenses by major cost type:\nYear Ended December 31,\n(in millions)\n2024\n2023\nPersonnel, infrastructure and other support costs\n$\n3,555 \n$\n3,204 \nClinical studies and other costs\n2,352 \n2,514 \nTotal\n$\n5,907 \n$\n5,718 \nResearch and development expenses increased 3% to $5.9 billion in 2024, compared to 2023. \nPersonnel, infrastructure and other support costs increased mainly due to higher compensation expenses, increases in restructuring costs, and stock-based compensation expenses and other integration costs related to the acquisition of CymaBay. \nClinical studies and other costs decreased mainly due to timing of clinical activities, including the wind-down of studies for magrolimab and obeldesivir for treatment of COVID-19, and higher R&D reimbursements, partially offset by increases related to the progression of other studies.\nAcquired In-Process Research and Development Expenses\nAcquired in-process research and development expenses are recorded when incurred and reflect costs of externally-developed IPR&D projects, acquired directly in a transaction other than a business combination, that do not have an alternative future use, including upfront and pre-commercialization milestone payments related to various collaborations and the costs of rights to IPR&D projects.\n41\nAcquired in-process research and development expenses were $4.7 billion in 2024, primarily related to the following transactions: \n•\n$3.8 billion CymaBay acquisition;\n•\n$320 million Janssen Pharmaceutica NV future royalty obligation extinguishment related to seladelpar;\n•\n$100 million Arcus Biosciences, Inc. collaboration continuation fee;\n•\n$68 million Arcellx, Inc. (“Arcellx”) collaboration milestones met; and\n•\n$47 million Tmunity Therapeutics, Inc. (“Tmunity”) acquisition milestones met.\nAcquired in-process research and development expenses were $1.2 billion in 2023, primarily related to the following transactions:\n•\n$313 million Arcellx collaboration;\n•\n$269 million Tmunity acquisition; \n•\n$218 million XinThera, Inc. acquisition;\n•\n$97 million Assembly Biosciences, Inc. collaboration; and\n•\n$60 million Compugen Ltd. licensing agreement.\nSee Note 6. Acquisitions and Note 7. Collaborations and Other Arrangements of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K for additional information.\nIn-Process Research and Development Impairments\nAs of December 31, 2023, our indefinite-lived IPR&D intangible asset related to Trodelvy for metastatic NSCLC was approximately $5.9 billion. In addition to NSCLC, Trodelvy is being explored for potential investigational use in a range of tumor types where Trop-2 is highly expressed. Gilead’s clinical development program in metastatic NSCLC includes ongoing Phase 2 and registrational Phase 3 studies for Trodelvy as a first- or second-line indication.\nIn January 2024, we received data from our Phase 3 EVOKE-01 study of Trodelvy evaluating sacituzumab govitecan-hziy (“SG”) indicating that the study did not meet its primary endpoint of overall survival in previously treated metastatic NSCLC, thus triggering a review for potential impairment of the NSCLC IPR&D intangible asset. Based on our evaluation of the study results and all other data currently available, and in connection with the preparation of the financial statements for the first quarter, we performed an interim impairment test and determined that the revised estimated fair value of the NSCLC IPR&D intangible asset was below its carrying value. As a result, we recognized a partial impairment charge of $2.4 billion in In-process research and development impairments on our Consolidated Statements of Operations during the first quarter of 2024.\nIn September 2024, based on discussions with regulators and external opinion leaders and the completed evaluation of the Phase 3 EVOKE-01 study data, we made a strategic decision to discontinue our clinical development program in metastatic NSCLC for Trodelvy in the second-line indication. This decision triggered a review for potential impairment of the NSCLC IPR&D intangible asset. Based on our evaluation, and in connection with the preparation of the financial statements for the third quarter, we performed an interim impairment test and determined that the revised estimated fair value of the NSCLC IPR&D intangible asset was below its carrying value. As a result, we recognized a partial impairment charge of $1.8 billion in In-process research and development impairments on our Consolidated Statements of Operations during the third quarter of 2024.\nTo arrive at the revised estimated fair value, we used a probability-weighted income approach that discounts expected future cash flows to present value, which requires the use of Level 3 fair value measurements and inputs, including critical estimated inputs, such as: revenues and operating profits related to the planned utilization of SG in NSCLC, which, include inputs such as addressable patient population, projected market share, treatment duration, and the life of the potential commercialized product; the probability of technical and regulatory success; the time and resources needed to complete the development and approval of SG in NSCLC; an appropriate discount rate based on the estimated weighted-average cost of capital for companies with profiles similar to our profile; and risks related to the viability of and potential alternative treatments in any future target markets. Our revised discounted cash flows for the March 31, 2024 fair value estimation primarily reflected the smaller addressable market that Trodelvy could serve among metastatic NSCLC patients and a delay in expected launch timing for second-line plus patients. Our revised discounted cash flows for the September 30, 2024 fair value estimation primarily reflected the removal of cash flows associated with second-line plus patients.\nThere were no IPR&D impairment charges in the three months ended December 31, 2024. Therefore, total In-process research and development impairments on our Consolidated Statements of Operations were $4.2 billion in 2024, and the revised estimated fair value of the NSCLC IPR&D intangible asset was $1.8 billion as of December 31, 2024, which reflects Trodelvy’s opportunity as a combination therapy in first-line metastatic NSCLC patients supported by its ongoing Phase 3 clinical trial in this patient population.\n42\nIn 2023, In-process research and development impairments included $50 million related to a partial impairment charge on our bulevirtide IPR&D intangible asset due to a change in assumptions primarily around probability and timing of regulatory approval.\nIf future events result in adverse changes in the key assumptions used in determining fair value, including the timing of product launches, information on the competitive landscape of treatments in this indication, changes to the probability of technical or regulatory success, failure to obtain anticipated regulatory approval or discount rate, among others, additional impairments may be recorded and could be material to our financial statements.\nSelling, General and Administrative Expenses\nSelling, general and administrative expenses are recorded when incurred and consist primarily of personnel costs, facilities and overhead costs, and selling, marketing and advertising expenses, as well as other general and administrative costs related to finance, human resources, legal and other administrative activities.\nThe following table summarizes our Selling, general and administrative expenses and period-over-period changes:\nYear Ended December 31,\n(in millions, except percentages)\n2024\n2023\nChange\nSelling and marketing expenses\n$\n3,453 \n$\n3,272 \n6 \n%\nGeneral and administrative expenses\n2,638 \n2,818 \n(6)\n%\nSelling, general and administrative expenses\n$\n6,091 \n$\n6,090 \n— \n%\nSelling, general and administrative expenses were $6.1 billion and remained relatively flat in 2024, compared to 2023.\nSelling and marketing expenses increased mainly due to:\n•\nmedia spend across multiple therapeutic areas, including launch preparation activities for lenacapavir for the investigational use of HIV PrEP as well as for Livdelzi;\n•\nintegration costs related to the acquisition of CymaBay; and \n•\nhigher restructuring costs; partially offset by\n•\na decrease in our allocation of the branded prescription drug fee. \nGeneral and administrative expenses decreased mainly due to lower expenses related to legal matters, partially offset by stock-based compensation expenses and other integration costs related to the acquisition of CymaBay, and higher restructuring costs.\nInterest Expense and Other (Income) Expense, Net\nThe following table summarizes our Interest expense and Other (income) expense, net and period-over-period changes:\nYear Ended December 31,\n(in millions, except percentages)\n2024\n2023\nChange\nInterest expense\n$\n977 \n$\n944 \n3 \n%\nOther (income) expense, net\n$\n(6)\n$\n(198)\n(97)\n%\nLoss from equity securities, net\n$\n274 \n$\n167 \n64 \n%\nInterest income\n$\n(281)\n$\n(376)\n(25)\n%\nOther, net\n$\n2 \n$\n11 \n(84)\n%\nInterest expense increased 3% to $977 million in 2024, compared to 2023, primarily due to a higher average interest rate on long-term debt. See Note 11. Debt and Credit Facilities of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K for additional information on our long-term debt and related interest rates.\nUnfavorable movements in Other (income) expense, net in 2024, compared to 2023, primarily related to higher net losses from equity securities and lower interest income due to lower average cash balances.\n43\nIncome Taxes\nThe following table summarizes our Income tax expense and period-over-period changes:\nYear Ended December 31,\n(in millions, except percentages)\n2024\n2023\nChange\nIncome before income taxes\n$\n690 \n$\n6,859 \n$\n(6,169)\nIncome tax expense\n$\n211 \n$\n1,247 \n$\n(1,036)\nEffective tax rate\n30.5 \n%\n18.2 \n%\n12.4 \n%\nOur effective tax rate increased in 2024, compared to 2023, primarily due to:\n•\nThe non-deductible acquired IPR&D expense recorded in connection with our first quarter 2024 acquisition of CymaBay; \n•\nA decrease in unrecognized tax benefits as a result of reaching agreement with a tax authority on certain tax positions in 2023; partially offset by\n•\nA non-recurring tax benefit associated with a legal entity restructuring;\n•\nA decrease in state deferred tax liabilities associated with the $4.2 billion NSCLC IPR&D intangible asset impairment charge; \n•\nSettlements with tax authorities in 2024; and\n•\nRemeasurement of certain deferred tax liabilities related to acquired intangible assets.\nThe Organisation for Economic Co-operation and Development has a framework to implement a global minimum corporate tax of 15% for companies with global revenues and profits above certain thresholds (referred to as Pillar Two), with certain aspects effective January 1, 2024 and other aspects effective January 1, 2025. Certain countries in which we operate have adopted Pillar Two legislation and other countries are in the process of introducing legislation to implement Pillar Two. We do not expect Pillar Two to have a material impact on our results of operations, liquidity or capital resources.\nLiquidity and Capital Resources\nWe regularly analyze our ability to generate and obtain adequate amounts of cash to meet our short-term and long-term requirements and plans. Our capital priorities include: (i) investing in our business and R&D pipeline, (ii) continuing select partnerships and business development transactions, (iii) growing our dividend over time, and (iv) repurchasing shares to offset dilution and opportunistically reduce share count. Based on our evaluation of our current position of liquidity, available capital resources and our material cash requirements, we believe that we can satisfy our capital needs for the next 12 months and the foreseeable future.\nLiquidity\nCash and cash equivalents were $10.0 billion as of December 31, 2024. The table below summarizes our cash flow activities, followed by our analysis of changes and trends:\nYear Ended December 31,\n(in millions)\n2024\n2023\nNet cash provided by (used in):\n \n \nOperating activities\n$\n10,828 \n$\n8,006 \nInvesting activities\n(3,449)\n(2,265)\nFinancing activities\n(3,433)\n(5,125)\nEffect of exchange rate changes on cash and cash equivalents\n(40)\n57 \nNet change in cash and cash equivalents\n$\n3,906 \n$\n673 \nOperating Activities\nNet cash provided by operating activities is our primary source of funds, driven mainly by collections on product sales, partially offset by operating spend. Changes in working capital balances, generally associated with the timing of collections and payments, as well as unanticipated payments related to litigation, taxes or other matters, may create some variation in any given year. Net cash provided by operating activities increased in 2024 mainly due to higher collections on sales and lower income tax and operating payments. Net cash provided by operating activities included $0.5 billion in HIV antitrust litigation settlement payments in 2023, as well as transition tax payments associated with the 2017 Tax Cuts and Jobs Act of $1.2 billion and $0.9 billion in 2024 and 2023, respectively. \n44\nWe expect Net cash provided by operating activities in 2025 to include the effect of an approximately $1.3 billion transition tax payment.\nInvesting Activities\nNet cash used in investing activities was notably higher in 2024 primarily related to the $3.9 billion net cash payment for the CymaBay acquisition, partially offset by proceeds from the liquidation of marketable debt securities to fund that acquisition. Net cash used in investing activities may vary in any given year depending on the favorability of strategic opportunities for the business.\nFinancing Activities\nNet cash used in financing activities in 2024 was primarily the result of $2.0 billion for debt repayments, $3.9 billion for dividend payments and $1.2 billion for common stock repurchases, partially offset by $3.5 billion in net proceeds from the issuance of senior unsecured notes in November 2024. In 2023, we utilized cash of $2.3 billion for debt repayments, $3.8 billion for dividend payments and $1.0 billion for common stock repurchases, partially offset by $2.0 billion in net proceeds from the issuance of senior unsecured notes in September 2023. The year-over-year changes were due mostly to higher cash provided by new debt issuances. Net cash used in financing activities may vary in any given year depending primarily on the timing of debt repayments and proceeds from debt offerings and the amount of common stock repurchases. \nSubsequently, in February 2025, we repaid $1.75 billion of principal balance related to our senior unsecured notes due February 2025. Also, on February 11, 2025, we announced that our Board of Directors declared a quarterly dividend of $0.79 per share of our common stock, with a payment date of March 28, 2025 to all stockholders of record as of the close of business on March 14, 2025. Future dividends are subject to declaration by our Board of Directors.\nCapital Resources\nAs of December 31, 2024, our material cash requirements for the operations of our business consisted primarily of the current and long-term liabilities noted on our Consolidated Balance Sheets as well as other commitments, including the following notable items:\n•\npayments of outstanding borrowings, including interest on long-term debt (see Note 11. Debt and Credit Facilities);\n•\nincome tax payments, including the remaining obligations for the one-time repatriation transition tax from the Tax Cuts and Jobs Act, as well as potential payments related to uncertain tax positions (see Note 16. Income Taxes);\n•\npayments of operating lease obligations (see Note 12. Leases);\n•\npayments related to certain unconditional inventory purchase obligations and capital expenditures. There were no changes to such commitments in the current year that would have a material impact on our ability to meet short- or long-term cash requirements;\n•\npayments related to our acquisitions, including contingent consideration (see Notes 3. Fair Value Measurements and 6. Acquisitions); and\n•\nmilestone and other payments related to collaboration agreements (see Note 7. Collaborations and Other Arrangements). We are contractually obligated to make payments to our collaboration partners upon the achievement of various development, regulatory and commercial milestones as well as royalty payments. These payments are contingent upon the occurrence of various future events, substantially all of which have a high degree of uncertainty of occurring. If milestones for multiple products covered by these arrangements happen to be reached in the same reporting period, the aggregate cash requirement could be material. It is not possible to predict with reasonable certainty whether these milestones will be achieved or the timing for achievement. As such, these obligations are not recorded on our Consolidated Balance Sheets until the events triggering milestone payments occur.\nOur anticipated sources of funds to satisfy the above material cash requirements for the short- and long-term include our current balances of cash and cash equivalents as well as future cash flows from operations. If needed, we also have the ability to utilize our $2.5 billion revolving credit facility (see Note 11. Debt and Credit Facilities) and access other external capital through future debt or equity offerings.\nWhile we are not aware of any trends at this time that are reasonably likely to materially impact our future cash requirements and sources of funds, such requirements and funds will depend on many factors, including but not limited to the following:\n•\nthe commercial performance of our current and future products;\n•\nthe progress and scope of our R&D efforts and those of our collaboration partners, including preclinical studies and clinical trials;\n•\nthe cost, timing and outcome of regulatory reviews;\n•\nthe expansion of our sales and marketing capabilities;\n45\n•\nthe acquisition of additional manufacturing capabilities or office facilities on acceptable terms;\n•\nthe acquisition of other companies or new products on acceptable terms;\n•\nthe issuance of new debt or equity in the market on acceptable terms;\n•\nthe favorability of repaying certain long-term debt obligations prior to maturity dates;\n•\nfuture dividends subject to declaration by our Board of Directors (see “Dividends” in Part II, Item 5 of this 10-K);\n•\nthe favorability of repurchasing shares (see “Issuer Purchases of Equity Securities” in Part II, Item 5 of this 10-K);\n•\nthe establishment of additional collaborative relationships with other companies on acceptable terms; and\n•\ncosts associated with the defense, settlement and adverse results of government investigations and litigation (see Note 13. Commitments and Contingencies).\nCritical Accounting Estimates\nSee Note 1. Summary of Business and Significant Accounting Policies of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K for information about our significant accounting policies and how estimates are involved in the preparation of our financial statements. We believe the following reflect the critical accounting estimates used in the preparation of our Consolidated Financial Statements.\nRebates and Chargebacks \nRebates and chargebacks are determined using a complex estimation process which requires significant judgment by management in part due to the lag between the date of the product sales and the date the related rebates or chargeback claims are settled. Rebates and chargebacks are based on contractual arrangements or statutory requirements and include amounts due to payers and healthcare providers under various programs. These amounts may vary by product, payer and individual plans. Rebates and chargebacks are estimated primarily based on product sales, and expected payer mix and discount rates, which require significant estimates and judgment. In developing our estimates of rebates and chargebacks, we consider the following: \n•\nproduct sales, including product mix and pricing;\n•\nhistorical and estimated payer mix;\n•\nstatutory discount requirements and contractual terms;\n•\nhistorical claims experience and processing time lags;\n•\nestimated patient population;\n•\nknown market events or trends; \n•\nmarket research;\n•\nchannel inventory data obtained from our major U.S. wholesalers; and\n•\nother pertinent internal or external information.\nThe following table summarizes the consolidated activities and ending balances in our rebates and chargebacks accounts, including adjustments made relating to previous years’ sales as a result of changes in estimates:\n(in millions)\nBalance at Beginning of Year\nDecrease/(Increase) to Product Sales\nPayments\nBalance at End of Year\nYear ended December 31, 2024:\n \n \n \n \nActivity related to 2024 sales\n$\n— \n$\n15,808 \n$\n(11,508)\n$\n4,300 \nActivity related to sales prior to 2024\n4,493 \n(350)\n(3,797)\n345 \nTotal\n$\n4,493 \n$\n15,458 \n$\n(15,305)\n$\n4,646 \nYear ended December 31, 2023:\n \n \n \n \nActivity related to 2023 sales\n$\n— \n$\n14,577 \n$\n(10,389)\n$\n4,187 \nActivity related to sales prior to 2023\n4,028 \n(302)\n(3,421)\n306 \nTotal\n$\n4,028 \n$\n14,275 \n$\n(13,810)\n$\n4,493 \nWe assess and update our estimates each reporting period to reflect actual claims and other current information. Historically, our actual rebates and chargebacks claimed for prior years have varied by less than 5% from our estimates. However, historical results are not indicative of future results.\n46\nValuation of Intangible Assets\nDetermining the fair values of intangible assets, whether as part of a business combination or impairment assessment, involves the use of a probability-weighted income approach that discounts expected future cash flows to present value and requires the use of critical estimated inputs, including:\n•\nidentification of product candidates with sufficient substance requiring separate recognition;\n•\nestimates of projected future cash flows, including revenues and operating profits related to the products or product candidates, which, for example, include significant inputs such as addressable patient population, treatment duration and projected market share;\n•\nthe probability of technical and regulatory success for unapproved product candidates considering their stages of development;\n•\nthe time and resources needed to complete the development and approval of product candidates;\n•\nan appropriate discount rate based on the estimated weighted-average cost of capital for companies with profiles similar to our profile, representing the rate that market participants would use to value the intangible assets;\n•\nthe life of the potential commercialized products and associated risks, including the inherent difficulties and uncertainties in developing a product candidate such as obtaining FDA and other regulatory approvals; and\n•\nrisks related to the viability of and potential alternative treatments in any future target markets.\nThese estimates are subject to uncertainty due to the high rate of failure inherent in the discovery and development of new products; delays that can occur in development, approval and product launch processes; unanticipated decisions made by regulatory agencies; advent of competing products; unexpected changes in U.S. and global financial markets and other unanticipated events and circumstances. If future events result in adverse changes in the critical assumptions used in determining fair value, impairment charges on our intangible assets may be recorded and could be material to our financial statements. For example, in 2024, upon receiving data from our Phase 3 EVOKE-01 study of Trodelvy, which indicated the study did not meet its primary endpoint, and further discussions with regulators and external opinion leaders and completion of the evaluation of the trial data which led to the strategic decision to end the second-line indication program, we recognized in aggregate $4.2 billion in impairment charges related to our NSCLC IPR&D intangible asset, reflecting, amongst other changes, the removal of expected future cash flows associated with second-line plus patients from our valuation model.\nLegal Contingencies\nWe are a party to various legal actions. Certain significant matters are described in Note 13. Commitments and Contingencies of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K. \nCritical inputs to the accruals recorded and disclosures provided in relation to these matters include the probability of a certain outcome of the case, the determination as to whether an exposure is reasonably estimable and the amount of potential exposure. These inputs are subject to uncertainty due to changes in the legal facts and circumstances of the case, status of the proceedings, applicable law, the views of legal counsel and the views of any judges or jury involved in the case. Upon the final resolution of such matters, it is possible that there may be a loss in excess of the amount recorded, and such amounts could have a material adverse effect on our results of operations, cash flows or financial position. We periodically reassess these matters when additional information becomes available and adjust our estimates and assumptions when facts and circumstances indicate the need for any changes. For example, in the second quarter of 2023, we recorded an accrual of $525 million in Other current liabilities on our Consolidated Balance Sheets for settlements with certain plaintiffs in the HIV antitrust litigation, which we paid in the second half of 2023. Also, we accrued approximately $200 million for a potential settlement with the U.S. Attorney’s Office for the Southern District of New York, on our Consolidated Balance Sheets as of December 31, 2024.\nIncome Taxes\nWe are subject to income taxes in the U.S. and various foreign jurisdictions, including Ireland. Critical inputs in determining our provision for income taxes and related tax balances include forecasts of our future income and expenses, potential tax planning strategies and determination of the probability of certain tax positions being sustained upon examination by tax authorities. These inputs are subject to uncertainty due to potential changes in facts and circumstances, economic and political conditions, changes to existing tax laws and new regulations or interpretations by tax authorities. Changes in these conditions could have a material adverse impact on our results of operations and financial position. See Note 16. Income Taxes of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K for additional information. \n47\nITEM 7A.\n    \nQUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nWe are exposed to market risks that may result from changes in foreign currency exchange rates, interest rates and equity prices. To reduce certain of these risks, we enter into various types of foreign currency derivative hedging transactions, follow investment guidelines and monitor outstanding receivables as part of our risk management program.\nForeign Currency Exchange Rate Risk \nWe have operations in more than 35 countries worldwide. As a result, our financial results could be significantly affected by factors such as changes in foreign currency exchange rates or weak economic conditions in the foreign markets in which we distribute our products. Our operating results are exposed to changes in foreign currency exchange rates between the U.S. dollar and various foreign currencies, the most significant of which is the Euro. When the U.S. dollar strengthens against these currencies, the relative value of sales made in the respective foreign currency decreases. Conversely, when the U.S. dollar weakens against these currencies, the relative value of such sales increases. Overall, we are a net receiver of foreign currencies and, therefore, we benefit from a weaker U.S. dollar and are adversely affected by a stronger U.S. dollar. \nApproximately 27% of our product sales were denominated in foreign currencies during 2024. To partially mitigate the impact of changes in currency exchange rates on net cash flows from our foreign currency denominated sales, we enter into foreign currency exchange forward contracts. We also hedge certain monetary assets and liabilities denominated in foreign currencies, which reduces but does not eliminate our exposure to currency fluctuations between the date a transaction is recorded and the date that cash is collected or paid. In general, the market risks of these contracts are offset by corresponding gains and losses on the transactions being hedged. \nAs of December 31, 2024 and 2023, we had open foreign currency forward contracts with notional amounts of $2.9 billion and $2.5 billion, respectively. A hypothetical 10% adverse movement in foreign currency exchange rates compared with the U.S. dollar relative to exchange rates as of December 31, 2024 and 2023 would have resulted in a reduction in fair value of these contracts of approximately $364 million and $328 million, respectively, and if realized, would have negatively affected earnings over the remaining life of the contracts. The analysis does not consider the impact that hypothetical changes in foreign currency exchange rates would have on anticipated transactions that these foreign currency sensitive instruments were designed to offset.\nInterest Rate Risk\nWe occasionally invest in available-for-sale debt securities, adhering to a policy that requires us to limit invested amounts based on credit rating, maturity, industry group and investment type and issuer, except for securities issued by the U.S. government. The goals of our investment policy, in order of priority, are as follows: \n•\n safety and preservation of principal and diversification of risk; \n•\n liquidity of investments sufficient to meet cash flow requirements; and \n•\n a competitive after-tax rate of return. \nThe fair value of any available-for-sale debt securities is subject to change as a result of potential changes in market interest rates. However, primarily due to the typically short-term nature of our portfolio, we do not believe that future market risks, including a hypothetical 10% increase or decrease in interest rates related to any securities, would have a material adverse impact on our financial position, results of operations, or liquidity.\nOur senior unsecured notes have fixed interest rates. As such, there is no financial interest rate exposure. The fair value of these senior unsecured notes and our liability related to future royalties as part of our 2020 acquisition of Immunomedics, Inc. are exposed to fluctuations in interest rates. The current fair value of our debt portfolio and liability related to future royalties are $23.3 billion and $0.9 billion, respectively. The fair value will decrease as interest rates increase. The fair value will increase as interest rates decrease. Additionally, we have a $2.5 billion five-year revolving credit facility that matures in June 2029. Loans under our revolving credit facility bear interest at either (i) Term Secured Overnight Financing Rate plus the Applicable Percentage, (ii) the Alternative Currency Term Rate plus the Applicable Percentage, or (iii) the Base Rate plus the Applicable Percentage, each as defined in the revolving credit facility agreement. There were no amounts outstanding under the revolving credit facility as of December 31, 2024. As such, there is currently no financial interest rate exposure.\nEquity Price Risk \nWe hold shares of common stock of certain publicly traded biotechnology companies primarily in connection with license and collaboration agreements. These equity securities are measured at fair value with any changes in fair value recognized in earnings. \n48\nThe fair value of these equity securities was approximately $1.6 billion and $1.5 billion as of December 31, 2024 and 2023, respectively. Changes in fair value of these equity securities are impacted by the volatility of the stock market and changes in general economic conditions, among other factors. A hypothetical 20% increase or decrease in the stock prices of these equity securities would have increased or decreased their fair value as of December 31, 2024 and 2023 by approximately $312 million and $292 million, respectively.\n49\nITEM 8.    FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA \nGILEAD SCIENCES, INC.\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nYears Ended December 31, 2024, 2023 and 2022 \nCONTENTS\nReport of Independent Registered Public Accounting Firm (PCAOB ID: \n42\n)\n51\nAudited Consolidated Financial Statements:\nConsolidated Balance Sheets\n53\nConsolidated Statements of\n Oper\nations\n54\nConsolidated Statements of Comprehensive Income\n55\nConsolidated Statements of Stockholders’ Equity\n56\nConsolidated Statements of Cash Flows\n57\nNotes to Consolidated Financial Statements\n58\n`\n50\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and the Board of Directors of Gilead Sciences, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Gilead Sciences, Inc. (the Company) as of December 31, 2024 and 2023, the related consolidated statements of operations, comprehensive income, stockholders’ equity and cash flows for each of the three years in the period ended December 31, 2024, and the related notes (collectively referred to as the “consolidated financial statements”). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company’s internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework), and our report dated February 28, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\n \nThese financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate. \nGovernment and commercial rebates\nDescription of the Matter\nAs more fully described in Note 1, the Company estimates reductions to its revenues for amounts payable to payers and healthcare providers in the United States under various government and commercial rebate programs in the period that the related sales occur. Rebates may vary by product, payer and individual payer plans, some of which may not be known at the point of sale. Estimated reductions to revenue are based on product sales, historical and expected payer mix, discount rates, and various other estimated and actual data, adjusted for current period expectations.\nAuditing the Company’s estimated reductions to revenue for rebates was complex and involved significant judgment, particularly in assessing the reasonableness of estimated payer mix applied to sales during the period. This estimate relies heavily on historical data that is adjusted for changes in payer mix expectations over time.\n51\nHow We Addressed the Matter in Our Audit\nWe evaluated and tested the design and operating effectiveness of the Company’s internal controls over management’s estimation and review of reductions from revenue for rebate programs, including controls to assess the payer mix assumption. We also tested the completeness and accuracy of data utilized in the controls, and the accuracy of calculations supporting management’s estimates.\nTo test management’s estimation methodology for determining the payer mix, our audit procedures included, among others, analytically evaluating management’s estimates, evaluating evidence contrary to the estimated amounts, performing a sensitivity analysis on the rates used in the estimates and performing a comparison of actual payments related to amounts accrued during the current and prior years.\nValuation of in-process research and development intangible asset\nDescription of the Matter\nAs discussed in Note 1, the Company tests indefinite-lived intangible assets for impairment on an annual basis and in between annual tests if they become aware of any events or changes that would indicate the fair values of the assets are below their carrying amounts. An impairment charge is recognized to the degree the carrying value exceeds the fair value. The Company recorded interim impairments totaling $4.2 billion related to the in-process research and development (IPR&D) intangible asset related to Trodelvy for patients with non-small cell lung cancer (NSCLC) during the year ended December 31, 2024. This IPR&D intangible asset had a carrying value of $1.8 billion at December 31, 2024.\nAuditing the fair value of this IPR&D intangible asset was complex due to the significant judgment required in estimating the fair value. In particular, the fair value estimate required the use of a valuation methodology that was sensitive to certain significant revenue assumptions, including addressable patient population, projected market share, life of the potential commercialized product, and probability of technical and regulatory success.\nHow We Addressed the Matter in Our Audit\nWe evaluated and tested the design and operating effectiveness of the Company's internal controls over the determination of the estimated fair value of the IPR&D intangible asset related to Trodelvy for patients with NSCLC. For example, we tested controls over management's review of the valuation methodology, the significant revenue assumptions, as discussed above, used to develop the fair value estimate, and the data inputs utilized in the fair value estimate. \nTo test the estimated fair value of this indefinite-lived intangible asset, our audit procedures included, among others, assessing the methodology and testing the significant assumptions discussed above and the underlying data used by the Company. With assistance from a valuation specialist, we evaluated the valuation methodology used by the Company to measure the fair value of this indefinite-lived intangible asset. We also performed sensitivity analyses of significant assumptions to evaluate the changes in the fair value of this indefinite-lived intangible asset that would result from changes in the assumptions and tested the completeness and accuracy of the underlying data used by the Company. For the most significant revenue assumptions, we compared the assumptions used by the Company to relevant external market and industry data and considered whether the assumptions were consistent with evidence obtained in other areas of the audit.\n/s/ \nErnst & Young LLP\nWe have served as the Company’s auditor since 1988.\nSan Mateo, California\n \nFebruary 28, 2025\n52\nGILEAD SCIENCES, INC. \nCONSOLIDATED BALANCE SHEETS\nDecember 31,\n(in millions, except per share amounts)\n2024\n2023\nAssets\nCurrent assets:\nCash and cash equivalents\n$\n9,991\n \n$\n6,085\n \nShort-term marketable debt securities\n—\n \n1,179\n \nAccounts receivable, net\n4,420\n \n4,660\n \nInventories\n1,710\n \n1,787\n \nPrepaid and other current assets\n3,052\n \n2,374\n \nTotal current assets\n19,173\n \n16,085\n \nProperty, plant and equipment, net\n5,414\n \n5,317\n \nLong-term marketable debt securities\n—\n \n1,163\n \nIntangible assets, net\n19,948\n \n26,454\n \nGoodwill\n8,314\n \n8,314\n \nOther long-term assets\n6,146\n \n4,792\n \nTotal assets\n$\n58,995\n \n$\n62,125\n \nLiabilities and Stockholders’ Equity\n \n \nCurrent liabilities:\n \n \nAccounts payable\n$\n833\n \n$\n550\n \nAccrued rebates\n3,892\n \n3,802\n \nCurrent portion of long-term debt and other obligations, net\n1,815\n \n1,798\n \nOther current liabilities\n5,464\n \n5,130\n \nTotal current liabilities\n12,004\n \n11,280\n \nLong-term debt, net\n24,896\n \n23,189\n \nLong-term income taxes payable\n830\n \n2,039\n \nDeferred tax liability\n724\n \n1,588\n \nOther long-term obligations\n1,295\n \n1,280\n \nCommitments and contingencies (Note 13)\nStockholders’ equity:\n \n \nPreferred stock, par value $\n0.001\n per share; \n5\n shares authorized; \nno\nne outstanding\n—\n \n—\n \nCommon stock, par value $\n0.001\n per share; \n5,600\n authorized; \n1,246\n shares issued and outstanding\n1\n \n1\n \nAdditional paid-in capital\n7,700\n \n6,500\n \nAccumulated other comprehensive income\n132\n \n28\n \nRetained earnings\n11,497\n \n16,304\n \nTotal Gilead stockholders’ equity\n19,330\n \n22,833\n \nNoncontrolling interest\n(\n84\n)\n(\n84\n)\nTotal stockholders’ equity\n19,246\n \n22,749\n \nTotal liabilities and stockholders’ equity\n$\n58,995\n \n$\n62,125\n \nSee accompanying notes.\n53\nGILEAD SCIENCES, INC. \nCONSOLIDATED STATEMENTS OF OPERATIONS \nYear Ended December 31,\n(in millions, except per share amounts)\n2024\n2023\n2022\nRevenues:\nProduct sales\n$\n28,610\n \n$\n26,934\n \n$\n26,982\n \nRoyalty, contract and other revenues\n144\n \n182\n \n299\n \nTotal revenues\n28,754\n \n27,116\n \n27,281\n \nCosts and expenses:\nCost of goods sold\n6,251\n \n6,498\n \n5,657\n \nResearch and development expenses\n5,907\n \n5,718\n \n4,977\n \nAcquired in-process research and development expenses\n4,663\n \n1,155\n \n944\n \nIn-process research and development impairments\n4,180\n \n50\n \n2,700\n \nSelling, general and administrative expenses\n6,091\n \n6,090\n \n5,673\n \nTotal costs and expenses\n27,092\n \n19,511\n \n19,951\n \nOperating income\n1,662\n \n7,605\n \n7,330\n \nInterest expense\n977\n \n944\n \n935\n \nOther (income) expense, net\n(\n6\n)\n(\n198\n)\n581\n \nIncome before income taxes\n690\n \n6,859\n \n5,814\n \nIncome tax expense\n211\n \n1,247\n \n1,248\n \nNet income\n480\n \n5,613\n \n4,566\n \nNet loss attributable to noncontrolling interest\n—\n \n(\n52\n)\n(\n26\n)\nNet income attributable to Gilead\n$\n480\n \n$\n5,665\n \n$\n4,592\n \nBasic earnings per share attributable to Gilead\n$\n0.38\n \n$\n4.54\n \n$\n3.66\n \nShares used in basic earnings per share attributable to Gilead calculation\n1,247\n \n1,248\n \n1,255\n \nDiluted earnings per share attributable to Gilead\n$\n0.38\n \n$\n4.50\n \n$\n3.64\n \nShares used in diluted earnings per share attributable to Gilead calculation\n1,255\n \n1,258\n \n1,262\n \nSee accompanying notes.\n54\nGILEAD SCIENCES, INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nNet income:\n$\n480\n \n$\n5,613\n \n$\n4,566\n \nOther comprehensive income (loss), net of reclassifications and taxes:\nNet (loss) gain on foreign currency translation\n(\n26\n)\n60\n \n(\n11\n)\nNet gain (loss) on available-for-sale debt securities\n5\n \n28\n \n(\n29\n)\nNet gain (loss) on cash flow hedges\n125\n \n(\n62\n)\n(\n41\n)\nOther comprehensive income (loss), net\n104\n \n26\n \n(\n81\n)\nComprehensive income, net\n584\n \n5,639\n \n4,485\n \nComprehensive loss attributable to noncontrolling interest, net\n—\n \n(\n52\n)\n(\n26\n)\nComprehensive income attributable to Gilead, net\n$\n584\n \n$\n5,691\n \n$\n4,511\n \nSee accompanying notes. \n55\nGILEAD SCIENCES, INC. \nCONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY \n(in millions, except per share amounts)\nGilead Stockholders’ Equity \nNoncontrolling\nInterest\nTotal\nStockholders’ \nEquity\nCommon Stock\n \nAdditional\nPaid-In\nCapital\nAccumulated Other Comprehensive Income\nRetained\nEarnings\nShares\nAmount\nBalance as of December 31, 2021\n1,254\n \n$\n1\n \n$\n4,661\n \n$\n83\n \n$\n16,324\n \n$\n(\n5\n)\n$\n21,064\n \nNet income (loss)\n— \n— \n— \n— \n4,592\n \n(\n26\n)\n4,566\n \nOther comprehensive loss, net\n— \n— \n— \n(\n81\n)\n— \n— \n(\n81\n)\nIssuances under employee stock purchase plan\n2\n \n— \n103\n \n— \n— \n— \n103\n \nIssuances under equity incentive plans\n13\n \n— \n211\n \n— \n— \n— \n211\n \nStock-based compensation\n— \n— \n640\n \n— \n— \n— \n640\n \nRepurchases of common stock under repurchase programs ($\n73.77\n average price per share)\n(\n19\n)\n— \n(\n65\n)\n— \n(\n1,331\n)\n— \n(\n1,396\n)\nRepurchases of common stock for employee tax withholding under equity incentive plans and other\n(\n3\n)\n— \n— \n(\n173\n)\n(\n173\n)\nDividends declared ($\n2.92\n per share)\n— \n— \n— \n— \n(\n3,725\n)\n— \n(\n3,725\n)\nBalance as of December 31, 2022\n1,247\n \n1\n \n5,550\n \n2\n \n15,687\n \n(\n31\n)\n21,209\n \nNet income (loss)\n— \n— \n— \n— \n5,665\n \n(\n52\n)\n5,613\n \nOther comprehensive income, net\n— \n— \n— \n26\n \n— \n— \n26\n \nIssuances under employee stock purchase plan\n2\n \n— \n129\n \n— \n— \n— \n129\n \nIssuances under equity incentive plans\n13\n \n— \n99\n \n— \n— \n— \n99\n \nStock-based compensation\n— \n— \n767\n \n— \n— \n— \n767\n \nRepurchases of common stock under repurchase programs ($\n79.52\n average price per share)\n(\n13\n)\n— \n(\n45\n)\n— \n(\n955\n)\n— \n(\n1,000\n)\nRepurchases of common stock for employee tax withholding under equity incentive plans and other\n(\n4\n)\n— \n— \n(\n279\n)\n(\n279\n)\nDividends declared ($\n3.00\n per share)\n— \n— \n— \n— \n(\n3,814\n)\n— \n(\n3,814\n)\nBalance as of December 31, 2023\n1,246\n \n1\n \n6,500\n \n28\n \n16,304\n \n(\n84\n)\n22,749\n \nNet income\n— \n— \n— \n— \n480\n \n—\n \n480\n \nOther comprehensive income, net\n— \n— \n— \n104\n \n— \n— \n104\n \nIssuances under employee stock purchase plan\n2\n \n— \n139\n \n— \n— \n— \n139\n \nIssuances under equity incentive plans\n16\n \n— \n282\n \n— \n— \n— \n282\n \nStock-based compensation\n— \n— \n834\n \n— \n— \n— \n834\n \nRepurchases of common stock under repurchase programs ($\n79.54\n average price per share)\n(\n14\n)\n— \n(\n55\n)\n— \n(\n1,095\n)\n— \n(\n1,150\n)\nRepurchases of common stock for employee tax withholding under equity incentive plans and other\n(\n4\n)\n— \n— \n— \n(\n280\n)\n— \n(\n280\n)\nDividends declared ($\n3.08\n per share)\n— \n— \n— \n— \n(\n3,911\n)\n— \n(\n3,911\n)\nBalance as of December 31, 2024\n1,246\n \n$\n1\n \n$\n7,700\n \n$\n132\n \n$\n11,497\n \n$\n(\n84\n)\n$\n19,246\n \nSee accompanying notes.\n56\nGILEAD SCIENCES, INC. \nCONSOLIDATED STATEMENTS OF CASH FLOWS \nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nOperating Activities:\nNet income\n$\n480\n \n$\n5,613\n \n$\n4,566\n \nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation expense\n381\n \n354\n \n323\n \nAmortization expense\n2,386\n \n2,339\n \n1,780\n \nStock-based compensation expense\n835\n \n766\n \n637\n \nDeferred income taxes\n(\n1,844\n)\n(\n962\n)\n(\n1,552\n)\nNet loss from equity securities\n274\n \n167\n \n657\n \nAcquired in-process research and development expenses\n4,663\n \n1,155\n \n944\n \nIn-process research and development impairments\n4,180\n \n50\n \n2,700\n \nOther\n353\n \n826\n \n780\n \nChanges in operating assets and liabilities:\nAccounts receivable, net\n139\n \n157\n \n(\n406\n)\nInventories\n(\n426\n)\n(\n842\n)\n(\n310\n)\nPrepaid expenses and other\n(\n259\n)\n39\n \n(\n134\n)\nAccounts payable\n290\n \n(\n347\n)\n226\n \nIncome tax assets and liabilities, net\n(\n732\n)\n(\n1,768\n)\n(\n364\n)\nAccrued and other liabilities\n108\n \n458\n \n(\n775\n)\nNet cash provided by operating activities\n10,828\n \n8,006\n \n9,072\n \nInvesting Activities:\nPurchases of marketable debt securities\n(\n244\n)\n(\n1,930\n)\n(\n1,770\n)\nProceeds from sales of marketable debt securities\n2,265\n \n510\n \n412\n \nProceeds from maturities of marketable debt securities\n327\n \n1,334\n \n1,590\n \nAcquisitions, including in-process research and development, net of cash acquired\n(\n4,840\n)\n(\n1,152\n)\n(\n1,797\n)\nPurchases of equity securities\n(\n492\n)\n(\n442\n)\n(\n172\n)\nCapital expenditures\n(\n523\n)\n(\n585\n)\n(\n728\n)\nOther\n58\n \n(\n1\n)\n(\n1\n)\nNet cash used in investing activities\n(\n3,449\n)\n(\n2,265\n)\n(\n2,466\n)\nFinancing Activities:\nProceeds from debt financing, net of issuance costs\n3,464\n \n1,980\n \n—\n \nProceeds from issuances of common stock\n422\n \n232\n \n309\n \nRepurchases of common stock under repurchase programs\n(\n1,150\n)\n(\n1,000\n)\n(\n1,396\n)\nRepayments of debt and other obligations\n(\n1,970\n)\n(\n2,250\n)\n(\n1,500\n)\nPayments of dividends\n(\n3,918\n)\n(\n3,809\n)\n(\n3,709\n)\nOther\n(\n281\n)\n(\n279\n)\n(\n173\n)\nNet cash used in financing activities\n(\n3,433\n)\n(\n5,125\n)\n(\n6,469\n)\nEffect of exchange rate changes on cash and cash equivalents\n(\n40\n)\n57\n \n(\n63\n)\nNet change in cash and cash equivalents\n3,906\n \n673\n \n74\n \nCash and cash equivalents at beginning of period\n6,085\n \n5,412\n \n5,338\n \nCash and cash equivalents at end of period\n$\n9,991\n \n$\n6,085\n \n$\n5,412\n \nSupplemental disclosure of cash flow information:\nInterest paid, net of amounts capitalized\n$\n951\n \n$\n891\n \n$\n907\n \nIncome taxes paid\n$\n2,779\n \n$\n3,990\n \n$\n3,136\n \nSee accompanying notes.\n57\nGILEAD SCIENCES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1.    \nSUMMARY OF BUSINESS AND SIGNIFICANT ACCOUNTING POLICIES\nBusiness\nGilead Sciences, Inc. (including its consolidated subsidiaries, referred to as “Gilead,” the “company,” “we,” “our” or “us”) is a biopharmaceutical company that has pursued and achieved breakthroughs in medicine for more than three decades, with the goal of creating a healthier world for all people. We are committed to advancing innovative medicines to prevent and treat life-threatening diseases, including HIV, viral hepatitis, coronavirus disease 2019 (“COVID-19”), cancer and inflammation. We operate in more than \n35\n countries worldwide, with headquarters in Foster City, California. \nOur portfolio of marketed products includes AmBisome\n®\n, Atripla\n®\n, Biktarvy\n®\n, Cayston\n®\n, Complera\n®\n, Descovy\n®\n, Descovy for PrEP\n®\n, Emtriva\n®\n, Epclusa\n®\n, Eviplera\n®\n, Genvoya\n®\n, Harvoni\n®\n, Hepcludex\n®\n, Hepsera\n®\n, Jyseleca\n®\n, Letairis\n®\n, Livdelzi\n®\n, Odefsey\n®\n, Sovaldi\n®\n, Stribild\n®\n, Sunlenca\n®\n, Tecartus\n®\n, Trodelvy\n®\n, Truvada\n®\n, Truvada for PrEP\n®\n, Tybost\n®\n, Veklury\n®\n, Vemlidy\n®\n, Viread\n®\n, Vosevi\n®\n, Yescarta\n®\n and Zydelig\n®\n. The approval status of Hepcludex and Jyseleca vary worldwide, and Hepcludex and Jyseleca are not approved in the U.S. We also sell and distribute authorized generic versions of Epclusa and Harvoni in the U.S. through our separate subsidiary, Asegua Therapeutics, LLC. In addition, we sell and distribute certain products through our corporate partners under collaborative agreements. See Note 2. Revenues for a summary of disaggregated revenues by product and geographic region.\nWe have \none\n operating segment which primarily focuses on the discovery, development and commercialization of innovative medicines in areas of unmet medical need. See Note 17. Segment Information for further details.\nSignificant Accounting Policies\nBasis of Presentation\nThe accompanying Consolidated Financial Statements have been prepared in accordance with U.S. generally accepted accounting principles and include the accounts of Gilead, our wholly-owned subsidiaries and any variable interest entities (“VIEs”) for which we are the primary beneficiary. All intercompany transactions have been eliminated. For any consolidated entities where we own or are exposed to less than 100% of the economics, we record net income or loss attributable to noncontrolling interests in our Consolidated Statements of Operations equal to the attributable economic or ownership interest retained in such entities by the respective noncontrolling parties. \nWhen we obtain a variable interest in another entity, we assess at the inception of the relationship and upon occurrence of certain significant events whether the entity is a VIE and, if so, whether we are the primary beneficiary of the VIE based on our power to direct the activities of the VIE that most significantly impact the VIE’s economic performance and our obligation to absorb losses or the right to receive benefits from the VIE that could potentially be significant to the VIE. \nThe preparation of these Consolidated Financial Statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses and related disclosures. On an ongoing basis, we evaluate our significant accounting policies and estimates. We base our estimates on historical experience and on various market-specific and other relevant assumptions that we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Estimates are assessed each period and updated to reflect current information. Actual results may differ significantly from these estimates. \nCertain amounts and percentages herein may not sum or recalculate due to rounding.\n58\nRevenue Recognition\nProduct Sales\nWe recognize revenue from product sales when control of the product transfers to the customer, which is generally upon shipment or delivery, or in certain cases, upon the corresponding sales by our customer to a third party. Revenues are recognized net of estimated rebates and chargebacks, patient co-pay assistance, prompt pay discounts, distributor fees, sales return provisions and other related deductions. These deductions to product sales are referred to as gross-to-net deductions and are estimated and recorded in the period in which the related product sales occur. Our payment terms to customers generally range from 30 to 90 days; however, payment terms differ by jurisdiction, by customer and, in some instances, by type of product. Revenues from product sales, net of gross-to-net deductions, are recorded only to the extent a significant reversal in the amount of cumulative revenue recognized is not probable of occurring when the uncertainty associated with gross-to-net deductions is subsequently resolved. Taxes assessed by governmental authorities and collected from customers are excluded from product sales. If we expect, at contract inception, that the period between the transfer of control and corresponding payment from the customer will be one year or less, we do not adjust the amount of consideration for the effects of a financing component. Shipping and handling activities are considered to be fulfillment activities and not a separate performance obligation.\nGross-to-Net Deductions \nRebates and Chargebacks\nRebates and chargebacks are based on contractual arrangements or statutory requirements and include amounts due to payers and healthcare providers under various programs. These amounts may vary by product, payer and individual plans. Providers qualified under certain programs can purchase our products through wholesalers or other distributors at a discount. The wholesalers or distributors then charge the discount back to us.\nRebates and chargebacks are estimated primarily based on product sales, including product mix and pricing, historical and estimated payer mix and discount rates, among other inputs, which require significant estimates and judgment. We assess and update our estimates each reporting period to reflect actual claims and other current information.\nChargebacks that are payable to our direct customers are generally classified as reductions of Accounts receivable on our Consolidated Balance Sheets. Rebates that are payable to third party payers and healthcare providers are recorded in Accrued rebates on our Consolidated Balance Sheets.\nPatient Co-Pay Assistance\nCo-pay assistance represents financial assistance to qualified patients, assisting them with prescription drug co-payments required by insurance. Our accrual for co-pay is based on an estimate of claims and the cost per claim that we expect to receive associated with inventory that exists in the distribution channel at period end.\nCash Discounts\nWe estimate cash discounts based on contractual terms, historical customer payment patterns and our expectations regarding future customer payment patterns. \nDistributor Fees\nUnder our inventory management agreements with our significant U.S. wholesalers, we pay the wholesalers a fee primarily for compliance with certain contractually-determined covenants such as the maintenance of agreed-upon inventory levels. These distributor fees are based on a contractually-determined fixed percentage of sales.\nAllowance for Sales Returns\nAllowances are made for estimated sales returns by our customers and are recorded in the period the related revenue is recognized. We typically permit returns if the product is damaged, defective, or otherwise cannot be used by the customer. In the U.S., we typically permit returns six months prior to and up to one year after the product expiration date. Outside the U.S., returns are only allowed in certain countries on a limited basis.\nOur estimates of sales returns are based primarily on analysis of our historical product return patterns, industry information reporting the return rates for similar products and contractual agreement terms. We also take into consideration known or expected changes in the marketplace specific to each product. \nRoyalty, Contract and Other Revenues\nRoyalty revenue is recognized in the period in which the obligation is satisfied and the corresponding sales by our corporate partners occur. Contract and other revenues are recognized when the performance obligation is satisfied.\n59\nResearch and Development Expenses\nResearch and development expenses are recorded when incurred and consist primarily of personnel costs including salaries, benefits and stock-based compensation expense, infrastructure, materials and supplies and other support costs, research and clinical studies performed by contract research organizations (“CROs”) and our collaboration partners and other outside services. From time to time, we enter into development and collaboration agreements in which we share expenses with a collaboration partner. We record payments received from our collaborative partners for their share of the development costs as a reduction of Research and development expenses.\nClinical study costs are a significant component of Research and development expenses. Most of our clinical studies are performed by third-party CROs. We monitor levels of performance under each significant contract including the extent of patient enrollment and other activities through communications with our CROs. We accrue costs for clinical studies performed by CROs over the service periods specified in the contracts and adjust our estimates, if required, based upon our ongoing review of the level of effort and costs actually incurred by the CROs. All of our material CRO contracts are terminable by us upon written notice and we are generally only liable for actual services completed by the CRO and certain non-cancelable expenses incurred at any point of termination. Payments we make for research and development (“R&D”) services prior to the services being rendered are recorded as prepaid assets within Prepaid and other current assets on our Consolidated Balance Sheets and are expensed as the services are provided.\nAcquired In-Process Research and Development Expenses\nAcquired in-process research and development expenses are recorded when incurred and reflect costs of externally-developed in-process research and development (“IPR&D”) projects, acquired directly in a transaction other than a business combination, that do not have an alternative future use, including upfront and pre-commercialization milestone payments related to various collaborations and the costs of rights to IPR&D projects.\n \nSelling, General and Administrative Expenses\nSelling, general and administrative expenses are recorded when incurred and consist primarily of personnel costs, facilities and overhead costs, and selling, marketing and advertising expenses, as well as other general and administrative costs related to finance, human resources, legal and other administrative activities.\nAdvertising expenses within Selling, general and administrative expenses, including promotional expenses, are recorded when incurred\n and were $\n869\n million, $\n826\n million and $\n778\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\nStock-Based Compensation\nWe provide stock-based compensation in the form of various types of equity-based awards, including restricted stock units (“RSUs”), performance share units (“PSUs”) and stock options, and through our Employee Stock Purchase Plan and the International Employee Stock Purchase Plan (together, as amended, the “ESPP”). Stock-based compensation expense is based on the estimated fair value of the award on the grant date, or the first date of the ESPP purchase period, and recognized over the requisite service periods on our Consolidated Statements of Operations using the straight-line expense attribution approach, reduced for estimated forfeitures. We estimate forfeitures based on our historical experience. The requisite service period could be shorter than the vesting period if an employee is retirement eligible or if an employee terminates due to death or disability.\nThe estimated fair value of RSUs is based on the closing price of our common stock on the grant date. For PSUs, depending on the terms of the award, estimated fair value is based on either the Monte Carlo valuation methodology or the closing stock price on the grant date. For stock option and ESPP awards, estimated fair value is based on the Black-Scholes option valuation model. Estimated inputs to that model include (i) expected volatility, based on a blend of historical volatility of our common stock price along with implied volatility for traded options on our common stock, (ii) expected term in years, based on the weighted-average period awards are expected to remain outstanding using historical cancellation and exercise data, contractual terms and vesting terms of the award, (iii) risk-free interest rate, based on observed interest rates appropriate for the term of the stock-based awards, and (iv) expected dividend yield, based on our history and expectation of dividend payments.\nEarnings Per Share\nBasic earnings per share attributable to Gilead is calculated based on Net income attributable to Gilead on our Consolidated Statements of Operations divided by the weighted-average number of shares of our common stock outstanding during the period. Diluted earnings per share attributable to Gilead is calculated based on Net income attributable to Gilead on our Consolidated Statements of Operations divided by the weighted-average number of shares of our common stock and other dilutive securities outstanding during the period. The potentially dilutive shares of our common stock resulting from the assumed exercise of outstanding stock options and equivalents are determined under the treasury stock method.\n60\nCash and Cash Equivalents \nWe consider highly liquid investments with insignificant interest rate risk and an original maturity of three months or less on the purchase date to be cash equivalents.\n \nMarketable Debt Securities\nAll of our marketable debt securities are classified as available-for-sale and recorded at estimated fair values. We determine the appropriate classification of our marketable debt securities at the time of purchase and reevaluate such designation at each balance sheet date. We regularly review our investments for declines in fair value below their amortized cost basis to determine whether the impairment is due to credit-related factors or noncredit-related factors. Our review includes the creditworthiness of the security issuers, the severity of the unrealized losses, whether we have the intent to sell the securities and whether it is more likely than not that we will be required to sell the securities before the recovery of their amortized cost bases. When we determine that a portion of the unrealized loss is due to an expected credit loss, we recognize the loss amount in Other (income) expense, net, with a corresponding allowance against the carrying value of the security we hold. The portion of any unrealized loss related to factors other than credit losses, as well as any unrealized gains, are recognized in Accumulated other comprehensive income on our Consolidated Balance Sheets until realized, at which point they are reclassified into Other (income) expense, net on our Consolidated Statements of Operations. Interest and amortization of purchase premiums and discounts are also recorded in Other (income) expense, net on our Consolidated Statements of Operations. The cost of securities sold is based on the specific identification method.\n \nAccounts Receivable\nTrade accounts receivable are recorded net of allowances for wholesaler chargebacks related to government and other programs, cash discounts for prompt payment and estimated credit losses. Estimates of our allowance for credit losses consider a number of factors, including existing contractual payment terms, individual customer circumstances, historical payment patterns of our customers, a review of the local economic environment and its potential impact on expected future customer payment patterns and government funding and reimbursement practices.\n \nInventories\nInventories are recorded at the lower of cost or net realizable value, with cost determined on a first-in, first-out basis. We periodically review our inventories to identify obsolete, slow-moving, excess or otherwise unsaleable items. If obsolete, slow-moving, excess or unsaleable items are observed and there are no alternate uses for the inventory, we record a write-down to net realizable value through a charge to Cost of goods sold on our Consolidated Statements of Operations. The determination of net realizable value requires judgment, including consideration of many factors, such as estimates of future product demand, product net selling prices, current and future market conditions and potential product obsolescence, among others. Inventories that are not expected to be sold within 12 months are classified in Other long-term assets on our Consolidated Balance Sheets.\nWhen future commercialization of a product is considered probable and the future economic benefit is expected to be realized, based on management’s judgment, we capitalize pre-launch inventory costs prior to regulatory approval. A number of factors are considered, including the current status in the regulatory approval process, potential impediments to the approval process such as safety or efficacy, anticipated R&D initiatives that could impact the indication in which the compound will be used, viability of commercialization and marketplace trends.\nEquity\n \nSecurities\nEquity securities with readily determinable fair values, including those for which we have elected the fair value option, are recorded at fair market value, and unrealized gains and losses are included in Other (income) expense, net on our Consolidated Statements of Operations.\nEquity securities without readily determinable fair values are recorded using the measurement alternative of cost less impairment, if any, adjusted for observable price changes in orderly transactions for identical or similar investments of the same issuer. Any impairments or adjustments are recorded in Other (income) expense, net on our Consolidated Statements of Operations.\nFor investments in entities over which we have significant influence but do not meet the requirements for consolidation and have not elected the fair value option, we use the equity method of accounting, with our share of the underlying income or loss of such entities reported in Other (income) expense, net on our Consolidated Statements of Operations. \nOur investments in equity securities are classified in Prepaid and other current assets or Other long-term assets on our Consolidated Balance Sheets, generally depending on marketability and whether the securities are subject to lock-up provisions. We regularly review our securities for indicators of impairment.\n61\nProperty, Plant and Equipment\nProperty, plant and equipment is stated at cost less accumulated depreciation and amortization. Depreciation and amortization are recognized using the straight-line method. Repairs and maintenance costs are expensed as incurred. \nEstimated useful lives in years are generally as follows: \nDescription\nEstimated Useful Life\n \nBuildings and improvements\nShorter of \n35\n years or useful life\nLaboratory and manufacturing equipment\n4\n-\n10\nOffice, computer equipment and other\n3\n-\n15\nLeasehold improvements\nShorter of useful life or lease term\nSee “Impairment of Long-Lived Assets” for additional information.\nLeases\nWe determine if an arrangement contains a lease at inception and classify each lease as operating or financing. Right-of-use assets and lease liabilities are recognized at the commencement date based on the present value of the lease payments over the lease term, which is the non-cancelable period stated in the contract adjusted for any options to extend or terminate when it is reasonably certain that we will exercise that option. Right-of-use assets are adjusted for prepaid lease payments, lease incentives and initial direct costs incurred. Operating lease expense for the minimum lease payments is recognized on a straight-line basis over the lease term.\nWe account for lease and nonlease components in our lease agreements as a single lease component in determining lease assets and liabilities. In addition, we do not recognize the right-of-use assets and liabilities for leases with lease terms of one year or less.\nAs most of our operating leases do not provide an implicit interest rate, we generally utilize a collateralized incremental borrowing rate, applied in a portfolio approach when relevant, based on the information available at the commencement date to determine the lease liability.\n \nAcquisitions, including Goodwill, Intangible Assets and Contingent Consideration\nWe account for business combinations using the acquisition method of accounting, which generally requires that assets acquired, including IPR&D projects, and liabilities assumed be recorded at their fair values as of the acquisition date on our Consolidated Balance Sheets. Any excess of consideration over the fair value of net assets acquired is recorded as goodwill. The determination of estimated fair value requires us to make significant estimates and assumptions. As a result, we may record adjustments to the fair values of assets acquired and liabilities assumed within the measurement period, which may be up to one year from the acquisition date, with the corresponding offset to goodwill. Transaction costs associated with business combinations are expensed as they are incurred.\nIntangible assets related to IPR&D projects are considered to be indefinite-lived until the abandonment or completion of the associated R&D efforts, which generally occurs when regulatory approval is obtained. Goodwill and indefinite-lived intangible assets are not amortized and, instead, are tested for impairment annually or more frequently if events or changes in circumstances indicate that it is more likely than not that the assets are impaired. \nIntangible assets with finite useful lives are amortized over their estimated useful lives, primarily on a straight-line basis, and are also periodically reviewed for changes in facts or circumstances resulting in a reduction to the estimated useful life of the asset, requiring the acceleration of amortization. See “Impairment of Long-Lived Assets” for additional information.\nIn determining the initial fair value of an intangible asset, or when quantitative analysis is required to determine any impairment, we use a probability-weighted income approach that discounts expected future cash flows to present value using a discount rate that is based on the estimated weighted-average cost of capital for companies with profiles similar to ours and represents the rate that market participants would use to value the intangible assets. These cash flow models require the use of Level 3 fair value measurements and inputs, including estimated revenues, which, for example, include significant inputs such as addressable patient population, treatment duration, projected market share, assessment of the asset’s life cycle, and competitive trends impacting the asset; costs and probability of technical and regulatory success, among other factors.\nIn connection with certain acquisitions, we may be required to pay future consideration that is contingent upon the achievement of specified development, regulatory approval or sales-based milestone events. We record contingent consideration resulting from a business combination at its fair value on the acquisition date. Each reporting period thereafter, we revalue these obligations and record increases or decreases in their fair value on our Consolidated Statements of Operations until such time that the payment is made. Increases or decreases in fair value of the contingent consideration liabilities can result from updates to assumptions such as the expected timing or probability of achieving the specified milestones, changes in projected revenues or changes in discount rates.\n62\nWhen we determine net assets acquired do not meet the definition of a business combination under the acquisition method of accounting, the transaction is accounted for as an asset acquisition and, therefore, no goodwill is recorded and contingent consideration generally is not recognized at the acquisition date. In an asset acquisition, upfront payments allocated to IPR&D projects at the acquisition date and subsequent pre-commercialization milestone payments are expensed as incurred on our Consolidated Statements of Operations unless there is an alternative future use.\nImpairment of Long-Lived Assets\nLong-lived assets, including property, plant and equipment and finite-lived intangible assets, are reviewed for impairment whenever facts or circumstances either internally or externally may indicate that the carrying value of an asset may not be recoverable. Should there be an indication of impairment, we test for recoverability by comparing the estimated undiscounted future cash flows expected to result from the use of the asset over its useful life to the carrying amount of the asset or asset group. If the asset or asset group is determined to be impaired, any excess of the carrying value of the asset or asset group over its estimated fair value is recognized as an impairment loss.\n \nDerivatives\nWe recognize all derivative instruments as either assets or liabilities at fair value on our Consolidated Balance Sheets. Unrealized changes in the fair value of derivatives designated as part of a hedge transaction are recorded in Accumulated other comprehensive income. For our hedges related to forecasted product sales, the unrealized gains or losses in Accumulated other comprehensive income are reclassified into Product sales on our Consolidated Statements of Operations when the respective hedged transactions affect earnings. Changes in the fair value of derivatives that are not part of a hedge transaction are recorded each period in Other (income) expense, net on our Consolidated Statements of Operations.\nUsing regression analysis, we assess, both at inception and on an ongoing basis, whether the derivatives that are used in hedging transactions are effective in offsetting the changes in cash flows or fair values of the hedged items. If we determine that a forecasted transaction is probable of not occurring, we discontinue hedge accounting for the affected portion of the hedge instrument, and any related unrealized gain or loss on the contract is recognized in Other (income) expense, net on our Consolidated Statements of Operations.\nContingencies\nWe recognize accruals for loss contingencies to the extent that we conclude that a loss is both probable and reasonably estimable. We accrue the best estimate of loss within a range; however, if no estimate in the range is better than any other, then we accrue the minimum amount in the range. If we determine that a material loss is reasonably possible, we disclose the possible loss or range of loss, or that the amount of loss cannot be estimated at this time.\nIncome Taxes\nOur income tax provision is computed under the liability method. Significant estimates are required in determining our provision for income taxes. Some of these estimates are based on interpretations of applicable tax laws or regulations.\nDeferred tax assets and liabilities are determined based on the difference between the financial statement and tax basis of assets and liabilities using enacted tax rates in effect for the year in which the differences are expected to reverse. We record a valuation allowance to reduce our deferred tax assets to the amounts that are more likely than not to be realized. We consider future taxable income, ongoing tax planning strategies and our historical financial performance in assessing the need for a valuation allowance. If we expect to realize deferred tax assets for which we have previously recorded a valuation allowance, we will reduce the valuation allowance in the period in which such determination is first made.\nWe recognize the tax benefit from an uncertain tax position only if it is more likely than not that the tax position will be sustained upon examination by tax authorities based on the technical merits of the position. The tax benefit recognized in the Consolidated Financial Statements for a particular tax position is based on the largest benefit that is more likely than not to be realized. The amount of unrecognized tax benefits (“UTB”) is adjusted as appropriate for changes in facts and circumstances, such as significant amendments to existing tax law, new regulations or interpretations by tax authorities, new information obtained during a tax examination or resolution of an examination. We recognize both accrued interest and penalties, where appropriate, related to UTB in Income tax expense on our Consolidated Statements of Operations. \nWe have elected to account for the tax on Global Intangible Low-Taxed Income, enacted as part of the Tax Cuts and Jobs Act, as a component of tax expense in the period in which the tax is incurred.\n63\nStock Repurchases\nWe use the par value method of accounting for our stock repurchases made under repurchase programs. Under the par value method, we record the par value of the shares repurchased to Common stock and the historical issuance cost over par value of the shares repurchased to Additional paid-in capital. The excess of the cost of the shares repurchased over these two amounts is then recorded to Retained earnings\n.\nForeign Currency Translation and Transactions\nOur Consolidated Financial Statements are presented in U.S. dollars. The functional currency for most of our foreign subsidiaries is their local currency. Revenues, expenses, gains and losses for non-U.S. dollar functional currency entities are translated into U.S. dollars using average currency exchange rates for the period. Assets and liabilities for such entities are translated using exchange rates that approximate the rate at the balance sheet date. Foreign currency translation adjustments are recorded as a component of Accumulated other comprehensive income on our Consolidated Balance Sheets. Foreign currency transaction gains and losses on transactions not denominated in functional currency are recorded in Other (income) expense, net, on our Consolidated Statements of Operations.\nFair Value Measurements\nWe apply fair value accounting for all financial and non-financial assets and liabilities that are recognized or disclosed at fair value in the financial statements on a recurring basis. We define fair value as the price that would be received from selling an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. When determining the fair value measurements for assets and liabilities which are required to be recorded at fair value, we consider the principal or most advantageous market in which we would transact and the market-based risk measurements or assumptions that market participants would use in pricing the asset or liability, such as risks inherent in valuation techniques, transfer restrictions and credit risks.\nWe determine the fair value using the fair value hierarchy, which establishes three levels of inputs that may be used to measure fair value, as follows:\n•\nLevel 1 inputs include quoted prices in active markets for identical assets or liabilities;\n•\nLevel 2 inputs include observable inputs other than Level 1 inputs, such as quoted prices for similar assets or liabilities in active markets; quoted prices for identical or similar assets or liabilities in markets that are not active; or other inputs that are observable or can be corroborated by observable market data for substantially the full term of the asset or liability; and\n•\nLevel 3 inputs include unobservable inputs that are supported by little or no market activity and that are significant to the fair value of the underlying asset or liability. Our Level 3 assets and liabilities include those whose fair value measurements are determined using pricing models, discounted cash flow methodologies or similar valuation techniques and significant management judgment or estimation.\nRecently Adopted Accounting Pronouncements\nIn November 2023, Financial Accounting Standards Board (“FASB”) issued Accounting Standards Update (“ASU”) No. 2023-07 “Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures.” ASU 2023-07 requires incremental annual and quarterly disclosures about segment measures of profit or loss as well as significant segment expenditures. It also requires public entities with a single reportable segment to provide all segment disclosures required by the amendments in the update and all existing segment disclosures in Topic 280. Beginning with this Annual Report on Form 10-K, we adopted this standard using a retrospective approach, resulting in increased disclosures in our Notes to Consolidated Financial Statements. See Note 17. Segment Information for additional information.\nRecently Issued Accounting Pronouncements Not Yet Adopted\nIn November 2024, FASB issued ASU No. 2024-03 “Income Statement — Reporting Comprehensive Income — Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses.” ASU 2024-03 requires disclosure, in the notes to financial statements, of specified information about certain costs and expenses, and can be applied prospectively or retrospectively. We plan to adopt this guidance beginning with our 2027 annual report to be filed in early 2028 and all quarterly and annual reports thereafter. We expect the adoption of this standard to result in increased disclosures in our Notes to Consolidated Financial Statements.\nIn December 2023, FASB issued ASU No. 2023-09 “Income Taxes (Topic 740): Improvements to Income Tax Disclosures.” ASU 2023-09 requires incremental annual disclosures around income tax rate reconciliations, income taxes paid and other related disclosures. This guidance requires prospective application and permits retrospective application to prior periods presented. We plan to adopt it beginning with our 2025 annual report to be filed in early 2026. We expect the adoption of this standard to result in increased disclosures in our Notes to Consolidated Financial Statements.\n64\n2.    \nREVENUES\nDisaggregation of Revenues\n \nThe following table summarizes our Total revenues:\nYear Ended December 31, 2024\nYear Ended December 31, 2023\nYear Ended December 31, 2022\n(in millions)\nU.S.\nEurope\n(6)\nRest of World\n(6)\nTotal\nU.S.\nEurope\n(6)\nRest of World\n(6)\nTotal\nU.S.\nEurope\n(6)\nRest of World\n(6)\nTotal\nProduct sales:\nHIV\nBiktarvy\n$\n10,855\n \n$\n1,509\n \n$\n1,060\n \n$\n13,423\n \n$\n9,692\n \n$\n1,253\n \n$\n905\n \n$\n11,850\n \n$\n8,510\n \n$\n1,103\n \n$\n777\n \n$\n10,390\n \nDescovy\n1,902\n \n100\n \n110\n \n2,113\n \n1,771\n \n100\n \n114\n \n1,985\n \n1,631\n \n118\n \n123\n \n1,872\n \nGenvoya\n1,498\n \n180\n \n84\n \n1,762\n \n1,752\n \n205\n \n103\n \n2,060\n \n1,983\n \n284\n \n136\n \n2,404\n \nOdefsey\n957\n \n290\n \n41\n \n1,288\n \n1,012\n \n294\n \n44\n \n1,350\n \n1,058\n \n364\n \n47\n \n1,469\n \nSymtuza - Revenue share\n(1)\n450\n \n130\n \n12\n \n592\n \n382\n \n133\n \n13\n \n529\n \n348\n \n168\n \n14\n \n530\n \nOther HIV\n(2)\n257\n \n129\n \n48\n \n434\n \n238\n \n116\n \n47\n \n401\n \n290\n \n182\n \n59\n \n530\n \nTotal HIV \n15,918\n \n2,339\n \n1,355\n \n19,612\n \n14,848\n \n2,102\n \n1,226\n \n18,175\n \n13,820\n \n2,219\n \n1,155\n \n17,194\n \nLiver Disease\nSofosbuvir/Velpatasvir\n(3)\n922\n \n299\n \n374\n \n1,596\n \n859\n \n323\n \n355\n \n1,537\n \n844\n \n355\n \n331\n \n1,530\n \nVemlidy\n486\n \n44\n \n428\n \n959\n \n410\n \n38\n \n414\n \n862\n \n429\n \n35\n \n379\n \n842\n \nOther Liver Disease\n(4)\n192\n \n202\n \n73\n \n467\n \n152\n \n150\n \n83\n \n385\n \n167\n \n135\n \n124\n \n426\n \nTotal Liver Disease\n1,601\n \n545\n \n876\n \n3,021\n \n1,421\n \n511\n \n852\n \n2,784\n \n1,440\n \n525\n \n833\n \n2,798\n \nVeklury\n892\n \n284\n \n623\n \n1,799\n \n972\n \n408\n \n805\n \n2,184\n \n1,575\n \n702\n \n1,628\n \n3,905\n \nOncology\nCell Therapy\nTecartus\n234\n \n138\n \n31\n \n403\n \n245\n \n110\n \n15\n \n370\n \n221\n \n75\n \n3\n \n299\n \nYescarta\n662\n \n666\n \n242\n \n1,570\n \n811\n \n547\n \n140\n \n1,498\n \n747\n \n355\n \n57\n \n1,160\n \nTotal Cell Therapy\n896\n \n804\n \n274\n \n1,973\n \n1,055\n \n658\n \n156\n \n1,869\n \n968\n \n430\n \n60\n \n1,459\n \nTrodelvy\n902\n \n294\n \n119\n \n1,315\n \n777\n \n217\n \n68\n \n1,063\n \n525\n \n143\n \n12\n \n680\n \nTotal Oncology\n1,798\n \n1,098\n \n393\n \n3,289\n \n1,833\n \n875\n \n224\n \n2,932\n \n1,494\n \n573\n \n73\n \n2,139\n \nOther\nAmBisome\n44\n \n276\n \n212\n \n533\n \n43\n \n260\n \n189\n \n492\n \n57\n \n258\n \n182\n \n497\n \nOther\n(5)\n255\n \n34\n \n68\n \n356\n \n261\n \n40\n \n66\n \n367\n \n331\n \n65\n \n53\n \n449\n \nTotal Other\n299\n \n310\n \n280\n \n889\n \n304\n \n301\n \n255\n \n859\n \n388\n \n323\n \n235\n \n946\n \nTotal product sales\n20,508\n \n4,576\n \n3,526\n \n28,610\n \n19,377\n \n4,197\n \n3,361\n \n26,934\n \n18,716\n \n4,342\n \n3,924\n \n26,982\n \nRoyalty, contract and other revenues\n82\n \n58\n \n4\n \n144\n \n62\n \n114\n \n7\n \n182\n \n168\n \n127\n \n4\n \n299\n \nTotal revenues\n$\n20,591\n \n$\n4,634\n \n$\n3,529\n \n$\n28,754\n \n$\n19,438\n \n$\n4,310\n \n$\n3,368\n \n$\n27,116\n \n$\n18,884\n \n$\n4,469\n \n$\n3,928\n \n$\n27,281\n \n_______________________________\n(1)    \nRepresents our revenue from cobicistat (“C”), emtricitabine (“FTC”) and tenofovir alafenamide (“TAF”) in Symtuza (darunavir/C/FTC/TAF), a fixed dose combination product commercialized by Janssen Sciences Ireland Unlimited Company (“Janssen”). See Note 7. Collaborations and Other Arrangements for additional information.\n(2)    \nIncludes Atripla, Complera/Eviplera, Emtriva, Stribild, Sunlenca, Truvada and Tybost.\n(3)\n    Includes Epclusa and the authorized generic version of Epclusa sold by Gilead’s separate subsidiary, Asegua Therapeutics LLC (“Asegua”).\n(4)\n    Includes ledipasvir/sofosbuvir (Harvoni and the authorized generic version of Harvoni sold by Asegua), Hepcludex, Hepsera, Livdelzi, Sovaldi, Viread and Vosevi.\n(5)\n    Includes Cayston, Jyseleca, Letairis, Ranexa and Zydelig.\n(6)\n    All individual international locations accounted for less than 10% of Total revenues\n.\nRevenues from Major Customers\nThe following table summarizes revenues from each of our customers who individually accounted for 10% or more of our Total revenues:\nYear Ended December 31,\n(as a percentage of total revenues)\n2024\n2023\n2022\nCardinal Health, Inc.\n26\n \n%\n26\n \n%\n25\n \n%\nCencora, Inc.\n18\n \n%\n19\n \n%\n18\n \n%\nMcKesson Corporation\n20\n \n%\n21\n \n%\n20\n \n%\n65\nRevenues Recognized from Performance Obligations Satisfied in Prior Years\nThe following table summarizes revenues recognized from performance obligations satisfied in prior years:\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nRevenue share with Janssen\n(1)\n and royalties for licenses of intellectual property\n$\n727\n \n$\n680\n \n$\n783\n \nChanges in estimates\n$\n452\n \n$\n340\n \n$\n582\n \n_______________________________\n(1)    \nSee Note 7. Collaborations and Other Arrangements for additional information.\nContract Balances\nThe following table summarizes our contract balances:\nDecember 31,\n(in millions)\n2024\n2023\nContract assets\n$\n277\n \n$\n117\n \nContract liabilities\n(1)\n$\n58\n \n$\n109\n \n_______________________________\n(1)    \nFuture revenues recognized from contract liabilities are not expected to be material in any one year.\n3.\n    \nFAIR VALUE MEASUREMENTS \nRecurring Fair Value Measurements\nThe following table summarizes the types of assets and liabilities measured at fair value on a recurring basis by level within the fair value hierarchy: \n \nDecember 31, 2024\nDecember 31, 2023\n(in millions)\nLevel 1\nLevel 2\nLevel 3\nTotal\nLevel 1\nLevel 2\nLevel 3\nTotal\nAssets:\n \n \n \n \n \n \n \n \nAvailable-for-sale debt securities\n(1)\n:\nU.S. treasury securities\n$\n—\n \n$\n—\n \n$\n—\n \n$\n—\n \n$\n426\n \n$\n—\n \n$\n—\n \n$\n426\n \nU.S. government agencies securities\n—\n \n—\n \n—\n \n—\n \n—\n \n127\n \n—\n \n127\n \nNon-U.S. government securities\n—\n \n—\n \n—\n \n—\n \n—\n \n10\n \n—\n \n10\n \nCertificates of deposit\n—\n \n—\n \n—\n \n—\n \n—\n \n45\n \n—\n \n45\n \nCorporate debt securities\n—\n \n—\n \n—\n \n—\n \n—\n \n1,451\n \n—\n \n1,451\n \nResidential mortgage and asset-backed securities\n—\n \n—\n \n—\n \n—\n \n—\n \n367\n \n—\n \n367\n \nEquity securities:\nMoney market funds\n8,502\n \n—\n \n—\n \n8,502\n \n4,465\n \n—\n \n—\n \n4,465\n \nPublicly traded equity securities\n(2)\n1,561\n \n—\n \n—\n \n1,561\n \n1,458\n \n—\n \n—\n \n1,458\n \nDeferred compensation plan\n343\n \n—\n \n—\n \n343\n \n284\n \n—\n \n—\n \n284\n \nForeign currency derivative contracts\n—\n \n128\n \n—\n \n128\n \n—\n \n7\n \n—\n \n7\n \nTotal\n$\n10,405\n \n$\n128\n \n$\n—\n \n$\n10,533\n \n$\n6,633\n \n$\n2,007\n \n$\n—\n \n$\n8,639\n \nLiabilities:\nContingent consideration liability\n$\n—\n \n$\n—\n \n$\n206\n \n$\n206\n \n$\n—\n \n$\n—\n \n$\n228\n \n$\n228\n \nDeferred compensation plan\n343\n \n—\n \n—\n \n343\n \n283\n \n—\n \n—\n \n283\n \nForeign currency derivative contracts\n—\n \n3\n \n—\n \n3\n \n—\n \n59\n \n—\n \n59\n \nTotal\n$\n343\n \n$\n3\n \n$\n206\n \n$\n552\n \n$\n283\n \n$\n59\n \n$\n228\n \n$\n570\n \n_______________________________\n(1)    \nDuring the three months ended March 31, 2024, we sold all of our available-for-sale debt securities and used the proceeds to partially fund our acquisition of CymaBay Therapeutics, Inc. (“CymaBay”) discussed in Note 6. Acquisitions.\n(2)    \nPublicly traded equity securities include our investment in Arcellx, Inc. (“Arcellx”) of $\n515\n million as of December 31, 2024, which is subject to contractual sale restrictions until June 2025. See Note 7. Collaborations and Other Arrangements for additional information.\n66\nLevel 2 Inputs\nAvailable-for-Sale Debt Securities\nFor our available-for-sale debt securities, we estimate the fair values by reviewing trading activity and pricing as of the measurement date and by taking into consideration valuations obtained from third-party pricing services. The pricing services utilize industry standard valuation models, including both income-based and market-based approaches, for which all significant inputs are observable, either directly or indirectly, to estimate the fair value. These inputs include reported trades of and broker/dealer quotes on the same or similar securities, issuer credit spreads, benchmark securities, prepayment/default projections based on historical data and other observable inputs.\nForeign Currency Derivative Contracts\nOur foreign currency derivative contracts have maturities of \n18\n months or less and all are with counterparties that have a minimum credit rating of A- or equivalent by S&P Global Ratings, Moody’s Investors Service, Inc. or Fitch Ratings, Inc. We estimate the fair values of these contracts by utilizing an income-based industry standard valuation model for which all significant inputs are observable, either directly or indirectly. These inputs include foreign currency exchange rates, Secured Overnight Financing Rate (“SOFR”) and swap rates. These inputs, where applicable, are observable at commonly quoted intervals.\nLevel 3 Inputs\nContingent Consideration Liability\nIn connection with our first quarter 2021 acquisition of MYR GmbH (“MYR”), we are subject to a potential contingent consideration payment of up to €\n300\n million, subject to customary adjustments, which is revalued each reporting period using probability-weighted scenarios for U.S. Food and Drug Administration (“FDA”) approval of Hepcludex until the related contingency is resolved.\nThe following table summarizes the change in fair value of our contingent consideration liability: \nYear Ended December 31,\n(in millions)\n2024\n2023\nBeginning balance\n$\n228\n \n$\n275\n \nChanges in valuation assumptions\n(1)\n(\n7\n)\n(\n60\n)\nEffect of foreign exchange remeasurement\n(2)\n(\n14\n)\n12\n \nEnding balance\n(3)\n$\n206\n \n$\n228\n \n_______________________________\n(1)    \nIncluded in Research and development expenses on our Consolidated Statements of Operations. The change in 2023 primarily related to changes in assumptions around probability and timing of regulatory approval.\n(2)    \nIncluded in Other (income) expense, net on our Consolidated Statements of Operations.\n(3)    \nIncluded in Other long-term obligations on our Consolidated Balance Sheets.\nFair Value Level Transfers\nThere were no transfers between Level 1, Level 2 and Level 3 in the periods presented.\nNonrecurring Fair Value Measurements\nIn 2024, 2023 and 2022, we recorded partial impairment charges of $\n4.2\n billion, $\n50\n million and $\n2.7\n billion, respectively, related to certain IPR&D assets. See Note 9. Goodwill and Intangible Assets for additional information. \nIn 2023, we recorded a $\n51\n million write-off of our finite-lived intangible asset related to filgotinib as discussed in Note 9. Goodwill and Intangible Assets, as well as a $\n381\n million write-off of manufacturing assets related to changes in our manufacturing strategy as discussed in Note 10. Other Financial Information. Both charges were recorded within Cost of goods sold on our Consolidated Statements of Operations.\n67\nOther Fair Value Disclosures\nSenior Unsecured Notes\nThe following table summarizes the total estimated fair value and carrying value of our senior unsecured notes, determined using Level 2 inputs based on their quoted market values:\nDecember 31,\n(in millions)\n2024\n2023\nFair value\n$\n23,335\n \n$\n22,567\n \nCarrying value\n$\n25,562\n \n$\n23,834\n \nLiability Related to Future Royalties\nWe recorded a liability related to future royalties as part of our 2020 acquisition of Immunomedics, Inc. (“Immunomedics”), which is subsequently amortized using the effective interest method over the remaining estimated life. The fair value of the liability related to future royalties, determined using Level 3 inputs, was approximately $\n0.9\n billion and $\n1.2\n billion as of December 31, 2024 and 2023, respectively, and the carrying value was $\n1.1\n billion and $\n1.2\n billion as of December 31, 2024 and 2023, respectively. See Note 11. Debt and Credit Facilities for additional information.\n4.    \nAVAILABLE-FOR-SALE DEBT SECURITIES AND EQUITY SECURITIES \nAvailable-for-Sale Debt Securities\nDuring the three months ended March 31, 2024, we sold all of our available-for-sale debt securities and used the proceeds to partially fund our acquisition of CymaBay discussed in Note 6. Acquisitions. As such, there are no balances as of December 31, 2024 in the following tables.\nThe following table summarizes our available-for-sale debt securities as of December 31, 2023:\nDecember 31, 2023\n(in millions)\nAmortized Cost\nGross Unrealized Gains\nGross Unrealized Losses\nEstimated Fair Value\nU.S. treasury securities\n$\n427\n \n$\n—\n \n$\n(\n1\n)\n$\n426\n \nU.S. government agencies securities\n127\n \n—\n \n—\n \n127\n \nNon-U.S. government securities\n10\n \n—\n \n—\n \n10\n \nCertificates of deposit\n45\n \n—\n \n—\n \n45\n \nCorporate debt securities\n1,455\n \n4\n \n(\n8\n)\n1,451\n \nResidential mortgage and asset-backed securities\n366\n \n1\n \n—\n \n367\n \nTotal\n$\n2,430\n \n$\n5\n \n$\n(\n10\n)\n$\n2,426\n \nThe following table summarizes information related to available-for-sale debt securities that have been in a continuous unrealized loss position, classified by length of time, as of December 31, 2023:\nDecember 31, 2023\nLess Than 12 Months\n12 Months or Longer\nTotal\n(in millions)\nGross Unrealized Losses\nEstimated Fair Value\nGross Unrealized Losses\nEstimated Fair Value\nGross Unrealized Losses\nEstimated Fair Value\nU.S. treasury securities\n$\n—\n \n$\n161\n \n$\n(\n1\n)\n$\n48\n \n$\n(\n1\n)\n$\n209\n \nU.S. government agencies securities\n—\n \n106\n \n—\n \n2\n \n—\n \n108\n \nNon-U.S. government securities\n—\n \n5\n \n—\n \n5\n \n—\n \n10\n \nCorporate debt securities\n(\n1\n)\n333\n \n(\n7\n)\n546\n \n(\n8\n)\n878\n \nResidential mortgage and asset-backed securities\n—\n \n123\n \n—\n \n24\n \n—\n \n147\n \nTotal\n$\n(\n2\n)\n$\n727\n \n$\n(\n8\n)\n$\n624\n \n$\n(\n10\n)\n$\n1,351\n \n68\nThe following table summarizes the classification of our available-for-sale debt securities in our Consolidated Balance Sheets as of December 31, 2023: \n(in millions)\nDecember 31, 2023\nCash and cash equivalents\n$\n83\n \nShort-term marketable debt securities\n1,179\n \nLong-term marketable debt securities\n1,163\n \nTotal\n$\n2,426\n \nEquity Securities\nThe following table summarizes the classification of our equity securities on our Consolidated Balance Sheets:\nDecember 31,\n(in millions)\n2024\n2023\nEquity securities measured at fair value:\nCash and cash equivalents\n$\n8,502\n \n$\n4,465\n \nPrepaid and other current assets\n1,577\n \n1,086\n \nOther long-term assets\n327\n \n656\n \nEquity method investments and other equity investments without readily determinable fair values:\nOther long-term assets\n(1)\n386\n \n340\n \nTotal\n$\n10,791\n \n$\n6,547\n \n_______________________________\n(1)    \nMostly comprised of equity interests in certain collaboration partners and investment funds that are considered to be VIEs for which we are not the primary beneficiary. Our maximum exposure to loss as a result of our involvement in these VIEs is limited to the value of our investment.\nFor our equity method investments in Galapagos NV (“Galapagos”) and Arcus Biosciences, Inc. (“Arcus”), we elected and applied the fair value option as we believe it best reflects the underlying economics of these investments. Our investment in Galapagos was classified in Prepaid and other current assets as of December 31, 2024 and 2023 at $\n462\n million and $\n686\n million, respectively. Our investment in Arcus was classified in Prepaid and other current assets as of December 31, 2024 and 2023 at $\n448\n million and $\n283\n million, respectively. \nUnrealized Gains and Losses\n \nThe following table summarizes net unrealized gains and losses on equity securities still held as of the respective balance sheet dates, included in Other (income) expense, net on our Consolidated Statements of Operations:\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nUnrealized loss, net\n$\n284\n \n$\n60\n \n$\n684\n \nRelated Party Transaction\nDuring the year ended December 31, 2022, Gilead donated certain equity securities at fair value to the Gilead Foundation, a California nonprofit public benefit corporation (the “Foundation”). The Foundation is a related party as certain of our officers also serve as directors of the Foundation. The donation expense of $\n85\n million was recorded within Selling, general and administrative expenses on our Consolidated Statements of Operations during the year ended December 31, 2022.\n69\n5.\n    \nDERIVATIVE FINANCIAL INSTRUMENTS\nOur operations in foreign countries expose us to market risk associated with foreign currency exchange rate fluctuations between the U.S. dollar and various foreign currencies, primarily the Euro. To manage this risk, we hedge a portion of our foreign currency exposures related to outstanding monetary assets and liabilities as well as forecasted product sales using foreign currency exchange forward contracts. In general, the market risk related to these contracts is offset by corresponding gains and losses on the hedged transactions. The credit risk associated with these contracts is driven by changes in interest and currency exchange rates and, as a result, varies over time. By working only with major banks and closely monitoring current market conditions, we seek to limit the risk that counterparties to these contracts may be unable to perform. We also seek to limit our risk of loss by entering into contracts that permit net settlement at maturity. Therefore, our overall risk of loss in the event of a counterparty default is limited to the amount of any unrealized gains on outstanding contracts (i.e., those contracts that have a positive fair value) at the date of default. We do not enter into derivative contracts for trading purposes.\nThe derivative instruments we use to hedge our exposures for certain monetary assets and liabilities that are denominated in a non-functional currency are not designated as hedges. The derivative instruments we use to hedge our exposures for forecasted product sales are designated as cash flow hedges and have maturities of \n18\n months or less. \nWe held foreign currency exchange contracts with outstanding notional amounts of $\n2.9\n billion and $\n2.5\n billion as of December 31, 2024 and 2023, respectively.\nWhile all our derivative contracts allow us the right to offset assets and liabilities, we have presented amounts in our Consolidated Balance Sheets on a gross basis. \nThe following table summarizes the classification and fair values of derivative instruments, including the potential effect of offsetting:\nDecember 31, 2024\n(in millions)\nPrepaid and other current assets\nOther long-term assets\nTotal Derivative Assets\nOther current liabilities\nOther long-term obligations\nTotal Derivative Liabilities\nForeign currency exchange contracts designated as hedges\n$\n90\n \n$\n10\n \n$\n100\n \n$\n—\n \n$\n—\n \n$\n—\n \nForeign currency exchange contracts not designated as hedges\n28\n \n—\n \n28\n \n3\n \n—\n \n3\n \nTotal derivatives presented gross on the Consolidated Balance Sheets\n$\n128\n \n$\n3\n \nGross amounts not offset on the Consolidated Balance Sheets:\nDerivative financial instruments\n$\n(\n3\n)\n$\n(\n3\n)\nCash collateral received / pledged\n—\n \n—\n \nNet amount (legal offset)\n$\n125\n \n$\n—\n \nDecember 31, 2023\n(in millions)\nPrepaid and other current assets\nOther long-term assets\nTotal Derivative Assets\nOther current liabilities\nOther long-term obligations\nTotal Derivative Liabilities\nForeign currency exchange contracts designated as hedges\n$\n6\n \n$\n—\n \n$\n6\n \n$\n38\n \n$\n7\n \n$\n45\n \nForeign currency exchange contracts not designated as hedges\n1\n \n—\n \n1\n \n15\n \n—\n \n15\n \nTotal derivatives presented gross on the Consolidated Balance Sheets\n$\n7\n \n$\n59\n \nGross amounts not offset on the Consolidated Balance Sheets:\nDerivative financial instruments\n$\n(\n7\n)\n$\n(\n7\n)\nCash collateral received / pledged\n—\n \n—\n \nNet amount (legal offset)\n$\n—\n \n$\n52\n \n70\nThe following table summarizes the effect of our derivative contracts on our Consolidated Financial Statements:\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nDerivatives designated as hedges:\nNet gain (loss) recognized in Accumulated other comprehensive income \n$\n171\n \n$\n(\n14\n)\n$\n150\n \nNet gain reclassified from Accumulated other comprehensive income into Product sales\n$\n27\n \n$\n58\n \n$\n196\n \nDerivatives not designated as hedges:\nNet gain recognized in Other (income) expense, net\n$\n44\n \n$\n57\n \n$\n67\n \nThe majority of gains and losses related to the hedged forecasted transactions reported in Accumulated other comprehensive income as of December 31, 2024 are expected to be reclassified to Product sales within \n12\n months. There were \nno\n discontinuances of cash flow hedges for the years ended December 31, 2024, 2023 and 2022.\nThe cash flow effects of our derivative contracts for the years ended December 31, 2024, 2023 and 2022 were included within Net cash provided by operating activities on our Consolidated Statements of Cash Flows.\n6.    \nACQUISITIONS\nCymaBay\nIn March 2024,\n \nwe completed the acquisition of CymaBay Therapeutics, Inc. (“CymaBay”) for total consideration of $\n3.9\n billion, net of cash acquired. Upon closing, CymaBay became our wholly-owned subsidiary.\nWe accounted for this transaction as an asset acquisition since the lead asset, seladelpar, an investigational, oral, peroxisome proliferator-activated receptor delta agonist shown to regulate critical metabolic and liver disease pathways, represented substantially all of the fair value of the gross assets acquired. In 2024, we recorded a $\n3.8\n billion charge, representing an acquired IPR&D asset with no alternative future use, to Acquired in-process research and development expenses, as well as share-based compensation expense of $\n133\n million related to the cash settlement of unvested CymaBay employee stock awards attributable to post-acquisition services, with $\n67\n million being recorded in Research and development expenses and $\n67\n million in Selling, general and administrative expenses on our Consolidated Statements of Operations. In connection with this acquisition, we recorded $\n333\n million of assets acquired, primarily consisting of net deferred tax assets, and $\n228\n million of liabilities assumed, primarily related to an assumed financing arrangement which we subsequently settled during the year through various payments totaling $\n209\n million.\nIn July 2024, we paid $\n320\n million to Janssen Pharmaceutica NV to extinguish a future royalty obligation related to seladelpar, which was recorded to Acquired in-process research and development expenses on our Consolidated Statements of Operations.\nIn August 2024, FDA granted accelerated approval for Livdelzi (seladelpar) for the treatment of primary biliary cholangitis in combination with ursodeoxycholic acid (“UDCA”) in adults who have had an inadequate response to UDCA, or as monotherapy in patients unable to tolerate UDCA.\nXinThera\nIn May 2023, we closed an agreement to acquire XinThera, Inc. (“XinThera”), a privately held biotechnology company focused on small molecule drugs to treat cancer and immunologic diseases, for approximately $\n200\n million in cash consideration, net of cash acquired. As a result, XinThera became our wholly-owned subsidiary.\nWe accounted for the transaction as an asset acquisition and recorded a $\n170\n million charge to Acquired in-process research and development expenses on our Consolidated Statements of Operations in 2023. The remaining purchase price related to various other assets acquired and liabilities assumed. Under the agreement, the former shareholders of XinThera are eligible to receive performance-based development and regulatory milestone payments of up to approximately $\n760\n million, with the first $\n50\n million of such milestones paid and charged primarily to Acquired in-process research and development expenses in October 2023.\n71\nTmunity\nIn February 2023, we closed an agreement to acquire Tmunity Therapeutics, Inc. (“Tmunity”), a clinical-stage, private biotechnology company focused on next-generation chimeric antigen receptor (“CAR”) T-therapies and technologies. Under the terms of the agreement, we acquired all outstanding shares of Tmunity other than those already owned by Gilead for approximately $\n300\n million in cash consideration. As a result, Tmunity became our wholly-owned subsidiary.\nWe accounted for the transaction as an asset acquisition and recorded a $\n244\n million charge to Acquired in-process research and development expenses on our Consolidated Statements of Operations in 2023. The remaining purchase price related to various other assets acquired and liabilities assumed, consisting primarily of deferred tax assets. Under the agreement, the former shareholders of Tmunity and the University of Pennsylvania are eligible to receive a mix of up to approximately $\n1.0\n billion in potential future payments upon achievement of certain development, regulatory and sales-based milestones, as well as royalty payments on sales, with the first $\n25\n million of milestones charged to Acquired in-process research and development expenses in 2023 and paid in January 2024. In 2024, we paid an additional $\n47\n million for development milestones met, which was charged to Acquired in-process research and development expenses on our Consolidated Statements of Operations.\nMiroBio\nIn September 2022, we acquired all of the outstanding share capital of MiroBio Ltd. (“MiroBio”), a privately-held U.K.-based biotechnology company focused on restoring immune balance with agonists targeting immune inhibitory receptors, for $\n414\n million in cash. As a result, MiroBio became our wholly-owned subsidiary. \nWe accounted for the transaction as an asset acquisition and recorded a $\n389\n million charge to Acquired in-process research and development expenses on our Consolidated Statements of Operations in 2022. The remaining purchase price related to various other assets acquired and liabilities assumed.\n7.    \nCOLLABORATIONS AND OTHER ARRANGEMENTS \nWe enter into licensing and strategic collaborations and other similar arrangements with third parties for the research, development and commercialization of certain products and product candidates. The collaborations involve two or more parties who are active participants in the operating activities of the collaboration and are exposed to significant risks and rewards depending on the commercial success of the activities. The financial terms of these arrangements may include non-refundable upfront payments, expense reimbursements, payments by us for options to acquire certain rights, contingent obligations by us for potential development and regulatory milestone payments and/or sales-based milestone payments, royalty payments, revenue or profit-sharing arrangements and cost-sharing arrangements. Certain payments are contingent upon the occurrence of various future events that have a high degree of uncertainty. Development milestone payments are recorded in our Consolidated Statements of Operations as incurred. Regulatory milestone payments are capitalized as intangible assets and amortized to Cost of goods sold over the term of the respective collaboration arrangement. In conjunction with these arrangements, we occasionally purchase shares of the collaboration partner and record such equity investments in either Prepaid and other current assets or Other long-term assets on our Consolidated Balance Sheets, generally depending on marketability and whether the securities are subject to lock-up provisions.\n72\nArcellx\nIn January 2023, we closed an agreement to enter into a global strategic collaboration with Arcellx, a public company, to co-develop and co-commercialize Arcellx’s lead late-stage product candidate, CART-ddBCMA, for the treatment of patients with relapsed or refractory multiple myeloma, and potential future next-generation autologous and non-autologous products. In December 2023, we amended the agreement and expanded the scope of the collaboration to include lymphomas and exercised our option to negotiate a license for Arcellx’s ARC-SparX program, ACLX-001, in multiple myeloma. In conjunction with the collaboration, we recorded a combined $\n313\n million charge to Acquired in-process research and development expenses on our Consolidated Statements of Operations in 2023, primarily related to upfront payments. We also recorded a combined equity investment of $\n299\n million. Our equity investment is subject to lock-up provisions until June 2025 and is included in Prepaid and other current assets on our Consolidated Balance Sheets as of December 31, 2024. The companies will share development, clinical trial and commercialization costs for CART-ddBCMA and will jointly commercialize the product and split U.S. profits \n50\n/\n50\n. Outside the U.S., we will commercialize the product and Arcellx will receive royalties on sales. Under the agreement, Arcellx is eligible to receive performance-based development and regulatory milestone payments of up to $\n1.5\n billion related to CART-ddBCMA, a potential future next-generation autologous product and a potential future non-autologous product, with further commercial milestone payments, profit split payments on co-promoted products and royalties on at least a portion of worldwide net sales, depending on whether Arcellx opts in to co-promote the future products. During the year ended December 31, 2024, we paid $\n68\n million for development milestones met, which was charged to Acquired in-process research and development expenses on our Consolidated Statements of Operations. If additional future products are developed, Arcellx would be eligible to receive additional milestone payments, profit split payments on co-promoted products and royalties on at least a portion of worldwide net sales, depending on whether Arcellx opts in to co-promote these additional future products as well. \nDragonfly\nIn April 2022, we entered into a strategic research collaboration agreement (the “Dragonfly Collaboration Agreement”) with Dragonfly Therapeutics, Inc. (“Dragonfly”) to develop natural killer (“NK”) cell engager-based immunotherapies for oncology and inflammation indications. Under the terms of the Dragonfly Collaboration Agreement, we received an exclusive, worldwide license from Dragonfly for the 5T4-targeting investigational immunotherapy program, DF7001, as well as options, after the completion of certain preclinical activities, to license exclusive, worldwide rights to develop and commercialize additional NK cell engager programs using the Dragonfly Tri-specific NK Engager platform. Upon the closing of the Dragonfly Collaboration Agreement, we made a $\n300\n million upfront payment to Dragonfly, and we made an additional $\n15\n million payment related to a target selection in connection with an August 2022 amendment to the agreement, which were recorded in Acquired in-process research and development expenses on our Consolidated Statements of Operations during the year ended December 31, 2022. In July 2023, we mutually agreed to terminate the DF7001 program. If we exercise our options on additional NK cell engager programs, Dragonfly would be eligible to receive opt-in payments and performance-based development, regulatory and commercial milestone payments and royalties on worldwide net sales on these optioned programs.\nMerck\nIn March 2021, we entered into a license and collaboration agreement with Merck Sharp & Dohme Corp., a subsidiary of Merck & Co., Inc. (“Merck”) to jointly develop and commercialize long-acting investigational treatments in HIV that combine Gilead’s investigational capsid inhibitor, lenacapavir, and Merck’s investigational nucleoside reverse transcriptase translocation inhibitor, islatravir, with other formulations potentially added to the collaboration as mutually agreed. The collaboration is initially focused on long-acting oral and injectable formulations.\nUnder the terms of the agreement, as amended, Gilead and Merck will mostly share global development and commercialization costs at \n60\n% and \n40\n%, respectively, across the oral and injectable formulation programs. For long-acting oral products, if approved, Gilead would lead commercialization in the U.S., and Merck would lead commercialization in the European Union (“EU”) and rest of the world. For long-acting injectable products, if approved, Merck would lead commercialization in the U.S. and Gilead would lead commercialization in the EU and rest of the world. Under the terms of the agreement, Gilead and Merck would jointly promote the combination products in the U.S. and certain other major markets. If successful, we would share global product revenues with Merck equally until product revenues surpass certain pre-determined per formulation revenue tiers. Upon passing $\n2.0\n billion in net product sales for the oral combination in a given calendar year, our share of revenue would increase to \n65\n% for any revenues above the threshold for such calendar year. Upon passing $\n3.5\n billion in net product sales for the injectable combination in a given calendar year, our share of revenue will increase to \n65\n% for any revenues above the threshold for such calendar year. Reimbursements of R&D costs to or from Merck are recorded within Research and development expenses on our Consolidated Statements of Operations. Expenses recognized under the agreement were \nnot\n material for the years ended December 31, 2024, 2023 and 2022. \nNo\n revenues have been recognized under the agreement for the years ended December 31, 2024, 2023 and 2022.\n73\nWe will also have the option to license certain of Merck’s investigational oral integrase inhibitors to develop in combination with lenacapavir. Reciprocally, Merck will have the option to license certain of Gilead’s investigational oral integrase inhibitors to develop in combination with islatravir. Each company may exercise its option for such investigational oral integrase inhibitor of the other company within the first \nfive years\n after execution of the agreement, following completion of the first Phase 1 clinical trial of that integrase inhibitor. Upon exercise of an option, the companies will split development costs and revenues, unless the non-exercising company decides to opt out, in which case the non-exercising company will be paid a royalty.\nArcus\nIn May 2020, we entered into a transaction, and have since entered into various amending transactions, with Arcus, a publicly traded oncology-focused biopharmaceutical company, which included entry into an option, license and collaboration agreement (as amended, the “Collaboration Agreement”), with Gilead having the right to opt in to all current and future clinical-stage product candidates for up to \nten years\n following the closing of the initial transaction, and a common stock purchase agreement and an investor rights agreement (together, as amended, the “Stock Purchase Agreements”). \nAs part of the November 2021 amendment, we exercised our options to \nthree\n of Arcus’ clinical stage programs and made related collaboration opt-in payments of $\n725\n million to Arcus in 2022, which were included within Net cash used in investing activities on our Consolidated Statements of Cash Flows.\nAs part of the May 2023 amendment, we paid a $\n35\n million upfront fee to initiate research programs against up to four targets jointly selected by the parties that are applicable to inflammatory diseases, which was charged to Acquired in-process research and development expenses on our Consolidated Statements of Operations.\nAs part of the January 2024 amendment, we committed to a $\n100\n million continuation fee, which was charged to Acquired in-process research and development expenses on our Consolidated Statements of Operations and paid later in 2024.\nUnder the Collaboration Agreement, the companies co-develop and share the global costs related to these clinical programs. We recorded $\n243\n million, $\n189\n million\n \nand $\n187\n million of such costs primarily in Research and development expenses on our Consolidated Statements of Operations for the years ended December 31, 2024, 2023 and 2022, respectively. If the optioned molecules achieve regulatory approval, the companies will co-commercialize and equally share profits in the U.S. Gilead will hold exclusive commercialization rights outside the U.S., subject to any rights of Arcus’s existing collaboration partners, and will pay to Arcus tiered royalties as a percentage of net sales ranging from the mid teens to low twenties. For the research programs applicable to inflammatory diseases, Gilead may exercise an option to license each program at two separate, prespecified time points. If Gilead exercises its option at the earlier time point for the first two target programs, Arcus would be eligible to receive up to $\n420\n million in future option and milestone payments and tiered royalties for each optioned program. For any other option exercise by Gilead for the four target programs, the parties would have rights to co-develop and share global development costs and to co-commercialize and share profits in the U.S. for optioned programs. We may also pay as much as an additional $\n100\n million at our option in 2026 and again in 2028, unless terminated early, to maintain the rights to opt in to future Arcus programs for the duration of the contact term.\nUnder the Stock Purchase Agreements, we have the right to purchase from Arcus additional shares up to a maximum of \n35\n% of the outstanding voting stock of Arcus over a \nfive-year\n period ending in the third quarter of 2025. We have made various purchases of shares since the original closing of the agreement, including a purchase of shares at a premium for $\n320\n million in 2024 whereby we recorded $\n233\n million for the fair value of the equity investment in Prepaid and other current assets on our Consolidated Balance Sheets and $\n87\n million for the premium in Other (income) expense, net on our Consolidated Statements of Operations for the year ended December 31, 2024. Following this transaction, we owned a total of \n30.1\n million shares, which represented approximately \n33\n% of the issued and outstanding voting stock of Arcus at that time. As of December 31, 2024, we had \nthree\n designees on Arcus’ board of directors.\nGalapagos\nIn August 2019, we closed a \n10-year\n option, license and collaboration agreement (the “OLCA”) and a subscription agreement (the “Subscription Agreement”), each with Galapagos, a clinical-stage biotechnology company based in Belgium, pursuant to which the parties entered into a global collaboration that covers certain programs in Galapagos’ current and future product portfolio.\nUnder the OLCA, if we exercise our option to a program, we will pay a $\n150\n million option exercise fee per program. In addition, Galapagos will receive tiered royalties ranging from \n20\n% to \n24\n% on net sales in our territories of each Galapagos product optioned by us. If we exercise our option for a program, the parties will share equally in development costs and mutually agreed commercialization costs incurred subsequent to our exercise of the option. We may terminate the collaboration in its entirety or on a program-by-program and country-by-country basis with advance notice as well as following other customary termination events.\n74\nPursuant to the Subscription Agreement, we purchased new ordinary shares of Galapagos and were issued warrants that confer the right to subscribe, from time to time, for a number of new shares to be issued by Galapagos sufficient to bring the number of shares owned by us to \n29.9\n% of the issued and outstanding shares at the time of our exercises. We currently own \n16.7\n million shares or approximately \n25.8\n% of the shares issued and outstanding at the time of last purchase in 2019. We are subject to a \n10-year\n standstill restricting our ability to acquire voting securities of Galapagos exceeding more than \n29.9\n% of the then-issued and outstanding voting securities of Galapagos. We have \ntwo\n designees appointed to Galapagos’ board of directors as of December 31, 2024.\nIn January 2025, we agreed to amend the OLCA commensurate with Galapagos’ announcement for a planned separation of Galapagos into two entities: a newly to be formed company (to be named at a later date, herein “SpinCo”) with an initial capital allocation of up to approximately €\n2.45\n billion (approximately $\n2.54\n billion) and Galapagos. At the time of separation, should it occur, Galapagos’ and our rights and responsibilities under the OLCA would transfer to SpinCo, and Galapagos would gain full global development and commercialization rights to its pipeline, subject to payment of single digit royalties to Gilead on net sales of certain products. This separation is expected to occur by mid-2025. With respect to Gilead’s ownership stake in Galapagos, upon separation, Gilead will hold approximately \n25\n% of the outstanding shares in both Galapagos and SpinCo and will be subject to a lock-up of Galapagos shares through March 2027 and of SpinCo shares until six months after the separation, subject to certain customary exceptions and early termination provisions. The two Gilead designees appointed to Galapagos’ board of directors will step down upon the separation and Gilead will be entitled to nominate two directors to SpinCo’s board.\nJanssen\nComplera/Eviplera and Odefsey\nIn 2009, we entered into a license and collaboration agreement with Janssen to develop and commercialize a fixed-dose combination of our Truvada and Janssen’s non-nucleoside reverse transcriptase inhibitor, rilpivirine. This combination was approved in the U.S. and EU in 2011, and is sold under the brand name Complera in the U.S. and Eviplera in the EU. The agreement was amended in 2014 to expand the collaboration to include another product containing Janssen’s rilpivirine and our emtricitabine and tenofovir alafenamide (“Odefsey”). \nUnder the amended agreement, Janssen granted us an exclusive license to Complera/Eviplera and Odefsey worldwide, but retained rights to distribute both combination products in certain countries outside of the U.S. Neither party is restricted from combining its drugs with any other drug products except those which are similar to the components of Complera/Eviplera and Odefsey.\nWe are responsible for manufacturing Complera/Eviplera and Odefsey and have the lead role in registration, distribution and commercialization of both products except in the countries where Janssen distributes. Janssen has exercised a right to co-detail the combination product in some of the countries where we are the selling party.\nUnder the financial provisions of the 2014 amendment, the selling party sets the price of the combined products and the parties share revenues based on the ratio of the net selling prices of the party’s component(s), subject to certain restrictions and adjustments. We retain a specified percentage of Janssen’s share of revenues, including up to \n30\n% in major markets. Sales of these products are included in Product sales and Janssen’s share of revenues is included in Cost of goods sold on our Consolidated Statements of Operations. Cost of goods sold relating to Janssen’s share was $\n403\n million, $\n430\n million and $\n483\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\nTermination of the agreement may be on a product or country basis and will depend on the circumstances, including withdrawal of a product from the market, material breach by either party or expiry of the revenue share payment term. We may terminate the agreement without cause with respect to the countries where we sell the products.\nSymtuza\nIn 2014, we amended a license and collaboration agreement with Janssen to develop and commercialize a fixed-dose combination of Janssen’s darunavir and our cobicistat, emtricitabine and tenofovir alafenamide (“Gilead Compounds”). This combination was approved in the U.S. and EU in July 2018 and September 2017, respectively, and is sold under the brand name Symtuza. \nUnder the terms of the 2014 amendment, we granted Janssen an exclusive license to Symtuza worldwide. Janssen is responsible for manufacturing, registration, distribution and commercialization of Symtuza worldwide. We are responsible for the intellectual property related to the Gilead Compounds and are the exclusive supplier of the Gilead Compounds. Neither party is restricted from combining its drugs with any other drug products except those which are similar to the components of Symtuza. \n75\nJanssen sets the price of Symtuza and the parties share revenue based on the ratio of the net selling prices of the party’s component(s), subject to certain restrictions and adjustments. The intellectual property license and supply obligations related to the Gilead Compounds are accounted for as a single performance obligation. As the license was deemed to be the predominant item to which the revenue share relates, we recognize our share of the Symtuza revenue in the period when the corresponding sales of Symtuza by Janssen occur. We record our share of the Symtuza revenue as Product sales on our Consolidated Statements of Operations primarily because we supply the Gilead Compounds to Janssen for Symtuza.\nTermination of the agreement may be on a product or country basis and will depend on the circumstances, including withdrawal of a product from the market, material breach by either party or expiry of the revenue share payment term. Janssen may terminate the agreement without cause on a country-by-country basis, in which case Gilead has the right to become the selling party for such country(ies) if the product has launched but has been on the market for fewer than \n10\n years. Janssen may also terminate the entire agreement without cause. \nJapan Tobacco\nIn 2005, Japan Tobacco, Inc. (“Japan Tobacco”) granted us exclusive rights to develop and commercialize elvitegravir, a novel HIV integrase inhibitor, in all countries of the world, excluding Japan, where Japan Tobacco retained such rights. Effective December 2018, we entered into an agreement with Japan Tobacco to acquire the rights to market and distribute certain products in our HIV portfolio in Japan and to expand our rights to develop and commercialize elvitegravir to include Japan. We are responsible for the marketing of the products as of January 1, 2019.\nWe are responsible for seeking regulatory approval in our territories and are required to use diligent efforts to commercialize elvitegravir for the treatment of HIV infection. We bear all costs and expenses associated with such commercialization efforts and pay a royalty to Japan Tobacco based on our product sales. Our sales of these products are included in Product sales on our Consolidated Statements of Operations. Royalties due to Japan Tobacco are included in Cost of goods sold on our Consolidated Statements of Operations. Royalty expenses recognized were $\n139\n million, $\n167\n million and $\n198\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\nUnder the terms of the 2018 agreement, we paid Japan Tobacco $\n559\n million in cash and recognized an intangible asset of $\n550\n million reflecting the estimated fair value of the marketing-related rights acquired from Japan Tobacco. The intangible asset is being amortized over \nnine years\n, representing the period over which the majority of the benefits are expected to be derived from the applicable products in our HIV portfolio. The amortization expense is classified as selling expense and recorded in Selling, general and administrative expenses on our Consolidated Statements of Operations. \nTermination of the agreement may be on a product or country basis and will depend on the circumstances, including material breach by either party or expiry of royalty payment term. We may also terminate the entire agreement without cause.\nEverest\nIn April 2019, Everest Medicines (“Everest”) and Immunomedics entered into an agreement granting Everest an exclusive license to develop and commercialize Trodelvy in Greater China, South Korea, Singapore, Indonesia, Philippines, Vietnam, Thailand, Malaysia and Mongolia (the “Territories”). Gilead subsequently acquired Immunomedics in October 2020 and assumed the Everest license and supply agreement, which provided for certain sales milestones and royalties payments to be made to Gilead and was recorded as a $\n175\n million finite-lived asset as part of the purchase accounting. In the fourth quarter of 2022, we reacquired all development and commercialization rights for Trodelvy from Everest and terminated the previous agreement. Under the terms of the new agreement, Gilead made $\n280\n million in upfront termination payments to Everest, of which $\n84\n million was made in 2022 and $\n196\n million was made in 2023. In addition, Everest is eligible to receive up to $\n175\n million in potential additional payments upon achievement of certain regulatory and commercial milestones. We accounted for the new agreement as a contract termination, which includes the reacquisition of commercial rights and the settlement of our pre-existing relationship with Everest. As a result, we recorded an expense of $\n406\n million in Selling, general and administrative expenses on our Consolidated Statements of Operations during the year ended December 31, 2022, which primarily represents the upfront costs and write-off of the remaining value of the pre-existing asset related to the prior agreement. Simultaneously, we recorded an acquired finite-lived asset with a fair value of $\n50\n million for the commercial rights reacquired for products approved in the Territories.\n76\nAbingworth\nIn December 2023, we entered into an arrangement with funds managed by Abingworth LLP (“Abingworth”) under which we will receive up to $\n210\n million to co-fund our development costs for Trodelvy for non-small cell lung cancer in 2023 through 2026. As there is substantive transfer of risk to the financial partner, the development funding is recognized by us as an obligation to perform contractual services. We received $\n50\n million from Abingworth in 2023 and additional amounts subsequently as incurred. We are recognizing the funding as a reduction of Research and development expenses using an attribution model over the period of the related expenses, with $\n78\n million of such reductions recorded during the year ended December 31, 2024. If successful, upon regulatory approval in the U.S. for the specified indication, Abingworth will be eligible to receive an approval-based fixed milestone payment of up to $\n84\n million and royalties based on the applicable net sales.\nLEO\n \nPharma\nIn January 2025, we entered into a strategic partnership with LEO Pharma A/S (“LEO Pharma”) to accelerate the development and commercialization of LEO Pharma’s small molecule oral signal transducer and activator of transcription 6 (“STAT6”) programs for the potential treatment of patients with inflammatory diseases. Gilead will have global rights to develop, manufacture, and commercialize the small molecule oral STAT6 program. LEO Pharma will have the option to potentially co-commercialize oral programs for dermatology outside the U.S. LEO Pharma will hold exclusive global rights to STAT6 topical formulations in dermatology. Upon closing of the agreement, we made a $\n250\n million upfront payment to LEO Pharma. In addition, LEO Pharma is eligible to receive up to approximately $\n1.5\n billion in additional payments and may also receive tiered royalties on sales of oral STAT6 products.\n8.    \nPROPERTY, PLANT AND EQUIPMENT\nThe following table summarizes our Property, plant and equipment, net by asset type: \nDecember 31,\n(in millions)\n2024\n2023\nLand and land improvements\n$\n561\n \n$\n561\n \nBuildings and improvements (including leasehold improvements)\n4,539\n \n4,328\n \nLaboratory and manufacturing equipment\n1,192\n \n1,147\n \nOffice, computer equipment and other\n1,090\n \n1,069\n \nConstruction in progress\n501\n \n661\n \nSubtotal\n7,884\n \n7,766\n \nLess: accumulated depreciation \n2,470\n \n2,449\n \nTotal\n$\n5,414\n \n$\n5,317\n \nThe following table summarizes our Property, plant and equipment, net by geography:\nDecember 31,\n(in millions)\n2024\n2023\nU.S.\n$\n4,787\n \n4,691\n \nInternational\n(1)\n627\n \n626\n \nTotal\n$\n5,414\n \n$\n5,317\n \n_______________________________\n(1)    \nAll individual international locations accounted for less than 10% of the total balances.\n77\n9.    \nGOODWILL AND INTANGIBLE ASSETS \nGoodwill\nThere were no changes in the carrying value of goodwill for the years ended December 31, 2024 and 2023. In addition, as of December 31, 2024, there were \nno\n accumulated goodwill impairment losses.\nIntangible Assets\nThe following table summarizes our Intangible assets, net:\n \nDecember 31, 2024\nDecember 31, 2023\n(in millions)\nGross \nCarrying\nAmount\nAccumulated\nAmortization\nForeign Currency Translation Adjustment\nNet Carrying Amount\nGross \nCarrying\nAmount\nAccumulated\nAmortization\nForeign Currency Translation Adjustment\nNet Carrying Amount\nFinite-lived assets:\nIntangible asset – sofosbuvir\n$\n10,720\n \n$\n(\n7,749\n)\n$\n—\n \n$\n2,971\n \n$\n10,720\n \n$\n(\n7,050\n)\n$\n—\n \n$\n3,670\n \nIntangible asset – axicabtagene ciloleucel\n7,110\n \n(\n2,721\n)\n—\n \n4,389\n \n7,110\n \n(\n2,314\n)\n—\n \n4,796\n \nIntangible asset – Trodelvy\n11,730\n \n(\n3,083\n)\n—\n \n8,647\n \n11,730\n \n(\n2,002\n)\n—\n \n9,728\n \nIntangible asset – Hepcludex\n845\n \n(\n329\n)\n—\n \n516\n \n845\n \n(\n243\n)\n—\n \n602\n \nOther\n1,474\n \n(\n940\n)\n1\n \n535\n \n1,414\n \n(\n827\n)\n1\n \n588\n \nTotal finite-lived assets\n31,879\n \n(\n14,822\n)\n1\n \n17,058\n \n31,819\n \n(\n12,436\n)\n1\n \n19,384\n \nIndefinite-lived assets – IPR&D\n(1)\n2,890\n \n— \n—\n \n2,890\n \n7,070\n \n— \n—\n \n7,070\n \nTotal intangible assets\n$\n34,769\n \n$\n(\n14,822\n)\n$\n1\n \n$\n19,948\n \n$\n38,889\n \n$\n(\n12,436\n)\n$\n1\n \n$\n26,454\n \n_______________________________\n(1)\n    The Indefinite-lived assets – IPR&D balance as of December 31, 2023 was comprised of $\n5.9\n billion related to sacituzumab govitecan-hziy (“SG”) for non-small cell lung cancer (“NSCLC”) and $\n1.1\n billion related to bulevirtide. See “2024 IPR&D Impairments” below for 2024 activity. The Indefinite-lived assets – IPR&D balance as of December 31, 2024 was comprised of $\n1.8\n billion related to SG for NSCLC and $\n1.1\n billion related to bulevirtide.\n \nAmortization Expense\nAggregate amortization expense related to finite-lived intangible assets was $\n2.4\n billion, $\n2.3\n billion and $\n1.8\n billion for the years ended December 31, 2024, 2023 and 2022, respectively, primarily included in Cost of goods sold on our Consolidated Statements of Operations.\nThe following table summarizes the estimated future amortization expense associated with our finite-lived intangible assets as of December 31, 2024:\n(in millions)\nAmount\n2025\n$\n2,388\n \n2026\n2,379\n \n2027\n2,379\n \n2028\n2,318\n \n2029\n1,790\n \nThereafter\n5,805\n \nTotal\n$\n17,058\n \nImpairment Assessments\nNo indicators of impairment were noted for the years ended December 31, 2024, 2023 and 2022, except as described in “2024 Impairments”, “2023 Impairments” and “2022 Impairment” below.\nIn October 2024, we announced plans to voluntarily withdraw the U.S. accelerated approval for Trodelvy for treatment of adult patients with locally advanced or metastatic urothelial cancer who have previously received a platinum-containing chemotherapy and either programmed death receptor-1 (PD-1) or programmed death-ligand 1 (PD-L1) inhibitor. We analyzed the implications of this and determined that it did not have an impact on the carrying amount of our finite-lived intangible asset related to Trodelvy.\nThe weighted-average discount rates used in our quantitative assessments for IPR&D intangible assets during the years ended December 31, 2024, 2023 and 2022, other than for the assessments described below, were \n7.25\n%, \n7.5\n% and \n7.5\n%, respectively.\n78\n2024 Impairments\nIn January 2024, we received data from our Phase 3 EVOKE-01 study of Trodelvy evaluating SG indicating that the study did not meet its primary endpoint of overall survival in previously treated metastatic NSCLC, thus triggering a review for potential impairment of the NSCLC IPR&D intangible asset. Based on our evaluation of the study results and all other data currently available, and in connection with the preparation of the financial statements for the first quarter, we performed an interim impairment test and determined that the revised estimated fair value of the NSCLC IPR&D intangible asset was below its carrying value. As a result, we recognized a partial impairment charge of $\n2.4\n billion in In-process research and development impairments on our Consolidated Statements of Operations during the first quarter of 2024.\nIn September 2024, based on discussions with regulators and external opinion leaders and the completed evaluation of the Phase 3 EVOKE-01 study data, we made a strategic decision to discontinue our clinical development program in metastatic NSCLC for Trodelvy in the second-line indication. This decision triggered a review for potential impairment of the NSCLC IPR&D intangible asset. Based on our evaluation, and in connection with the preparation of the financial statements for the third quarter, we performed an interim impairment test and determined that the revised estimated fair value of the NSCLC IPR&D intangible asset was below its carrying value. As a result, we recognized a partial impairment charge of $\n1.8\n billion in In-process research and development impairments on our Consolidated Statements of Operations during the third quarter of 2024.\nTo arrive at the revised estimated fair values as of March 31, 2024 and September 30, 2024, we used a probability-weighted income approach that discounts expected future cash flows to present value, which requires the use of Level 3 fair value measurements and inputs, including critical estimated inputs, such as: revenues and operating profits related to the planned utilization of SG in NSCLC, which includes inputs such as addressable patient population, projected market share, treatment duration, and the life of the potential commercialized product; the probability of technical and regulatory success; the time and resources needed to complete the development and approval of SG in NSCLC; an appropriate discount rate based on the estimated weighted-average cost of capital for companies with profiles similar to our profile; and risks related to the viability of and potential alternative treatments in any future target markets. We used a discount rate of \n7.00\n%\n \nwhich is based on the\n \nestimated weighted-average cost of capital for companies with profiles similar to ours.\n2023 Impairments\nIn 2023, we wrote off the remaining $\n51\n million balance of a finite-lived intangible asset, charged to Cost of goods sold on our Consolidated Statements of Operations, due to the termination of a global development cost-sharing arrangement with Galapagos related to filgotinib and their obligation to pay tiered royalties to us on net sales in Europe.\nDue to a change in anticipated timing of FDA approval, we also recognized a $\n50\n million partial impairment of our bulevirtide IPR&D intangible asset in In-process research and development impairments on our Consolidated Statements of Operations in 2023.\n2022 Impairment\nIn connection with our acquisition of Immunomedics in 2020, we allocated a portion of the purchase price to acquired IPR&D intangible assets. Approximately $\n8.8\n billion was assigned to IPR&D intangible assets related to Trodelvy for treatment of patients with hormone receptor-positive, human epidermal growth factor receptor 2-negative (“HR+/HER2-”) breast cancer. In March 2022, we received data from the Phase 3 TROPiCS-02 study evaluating Trodelvy in patients with HR+/HER2- metastatic breast cancer who have received prior endocrine therapy, cyclin-dependent kinase 4/6 inhibitors and two to four lines of chemotherapy (“third-line plus patients”). Based on our evaluation of the study results, and in connection with the preparation of the financial statements for the first quarter, we updated our estimate of the fair value of our HR+/HER2- IPR&D intangible asset to $\n6.1\n billion as of March 31, 2022. Our estimate of fair value used a probability-weighted income approach that discounts expected future cash flows to the present value, which requires the use of Level 3 fair value measurements and inputs, including estimated revenues, costs, and probability of technical and regulatory success. The expected cash flows included cash flows from HR+/HER2- metastatic breast cancer for third-line plus patients and patients in earlier lines of therapy which are the subject of separate clinical studies. Our revised discounted cash flows were lower primarily due to a delay in launch timing for third-line plus patients which caused a decrease in our market share assumptions based on the expected competitive environment. As of March 2022, there were no changes in our plans or assumptions related to our estimated cash flows for patients in the earlier lines of therapy. We used a discount rate of \n6.75\n% which is based on the estimated weighted-average cost of capital for companies with profiles similar to ours and represents the rate that market participants would use to value the intangible assets. We determined the revised estimated fair value was below the carrying value of the asset and, as a result, we recognized a partial impairment charge of $\n2.7\n billion in In-process research and development impairments on our Consolidated Statements of Operations during the first quarter of 2022.\n79\n10.\n    \nOTHER FINANCIAL INFORMATION\nAccounts Receivable, Net\nThe following table summarizes our Accounts receivable, net: \nDecember 31,\n(in millions)\n2024\n2023\nAccounts receivable\n$\n5,319\n \n$\n5,495\n \nLess: allowances for chargebacks\n759\n \n679\n \nLess: allowances for cash discounts and other\n89\n \n101\n \nLess: allowances for credit losses\n52\n \n56\n \nAccounts receivable, net\n$\n4,420\n \n$\n4,660\n \nThe majority of our trade accounts receivable arises from product sales in the U.S. and Europe.\nInventories\nThe following table summarizes our Inventories:\nDecember 31,\n(in millions)\n2024\n2023\nRaw materials\n$\n1,295\n \n$\n1,246\n \nWork in process\n847\n \n847\n \nFinished goods\n1,447\n \n1,272\n \nTotal\n$\n3,589\n \n$\n3,366\n \nReported as:\nInventories\n$\n1,710\n \n$\n1,787\n \nOther long-term assets\n(1)\n1,879\n \n1,578\n \nTotal\n$\n3,589\n \n$\n3,366\n \n_______________________________\n(1)\n     Amounts primarily consist of raw materials.\nPrepaid and Other Current Assets\nThe following table summarizes the components of Prepaid and other current assets:\nDecember 31,\n(in millions)\n2024\n2023\nPrepaid taxes\n$\n480\n \n$\n559\n \nEquity securities\n1,577\n \n1,086\n \nOther\n995\n \n728\n \nPrepaid and other current assets\n$\n3,052\n \n$\n2,374\n \nOther Current Liabilities\nThe following table summarizes the components of Other current liabilities:\nDecember 31,\n(in millions)\n2024\n2023\nCompensation and employee benefits\n$\n1,228\n \n$\n1,201\n \nIncome taxes payable\n1,646\n \n1,208\n \nAllowance for sales returns\n321\n \n387\n \nOther\n2,269\n \n2,334\n \nOther current liabilities\n$\n5,464\n \n$\n5,130\n \n80\nAccumulated Other Comprehensive Income\nThe following table summarizes the changes in Accumulated other comprehensive income by component, net of tax:\n(in millions)\nForeign Currency Translation\nAvailable-for-Sale Debt Securities\n(1)\nCash Flow Hedges\n(2)\nTotal\nBalance as of December 31, 2021\n$\n13\n \n$\n(\n4\n)\n$\n74\n \n$\n83\n \nNet unrealized (loss) gain, net of tax impact of $\n0\n, $\n0\n, and $\n20\n, respectively\n$\n(\n11\n)\n$\n(\n30\n)\n$\n130\n \n$\n88\n \nReclassifications to net income, net of tax impact of $\n0\n, $\n0\n, and $\n25\n, respectively\n(3)\n—\n \n1\n \n(\n171\n)\n(\n170\n)\nOther comprehensive loss, net\n(\n11\n)\n(\n29\n)\n(\n41\n)\n(\n81\n)\nBalance as of December 31, 2022\n$\n2\n \n$\n(\n33\n)\n$\n33\n \n$\n2\n \nNet unrealized gain (loss), net of tax impact of $\n0\n, $\n0\n, and $(\n2\n), respectively\n$\n60\n \n$\n26\n \n$\n(\n12\n)\n$\n75\n \nReclassifications to net income, net of tax impact of $\n0\n, $\n0\n, and $\n7\n, respectively\n(3)\n—\n \n2\n \n(\n51\n)\n(\n49\n)\nOther comprehensive income (loss), net\n60\n \n28\n \n(\n62\n)\n26\n \nBalance as of December 31, 2023\n$\n62\n \n$\n(\n5\n)\n$\n(\n29\n)\n$\n28\n \nNet unrealized (loss) gain, net of tax impact of $\n0\n, $\n0\n, and $\n21\n, respectively\n$\n(\n26\n)\n$\n—\n \n$\n149\n \n$\n124\n \nReclassifications to net income, net of tax impact of $\n0\n, $\n0\n, and $\n3\n, respectively\n(3)\n—\n \n5\n \n(\n24\n)\n(\n19\n)\nOther comprehensive (loss) income, net\n(\n26\n)\n5\n \n125\n \n104\n \nBalance as of December 31, 2024\n$\n36\n \n$\n—\n \n$\n96\n \n$\n132\n \n_______________________________\n(1)\n     Reclassifications before tax were $\n5\n million, $\n2\n million and $\n1\n million and are included in Other (income) expense, net on our Consolidated Statements of Operations for the years ended December 31, 2024, 2023 and 2022, respectively.\n(2)    \nReclassifications before tax were $\n27\n million, $\n58\n million and $\n196\n million and are included in Product sales on our Consolidated Statements of Operations for the years ended December 31, 2024, 2023 and 2022, respectively. See Note 5. Derivative Financial Instruments.\n(3)    \nTax impacts of reclassifications are included in Income tax expense on our Consolidated Statements of Operations.\nRestructuring\nDuring 2024, we incurred \nrestructuring charges\n of $\n188\n million, primarily related to the initiation of reductions in our commercial and R&D workforce. We recorded $\n98\n million of these charges in Research and development expenses and $\n91\n million of these charges in Selling, general and administrative expenses on our Consolidated Statements of Operations. As of December 31, 2024, we have recorded a liability of $\n93\n million on our Consolidated Balance Sheets associated with these restructuring charges, a majority of which we anticipate will be paid in the next 12 months.\nDuring 2023, we incurred \nrestructuring charges\n of $\n527\n million primarily related to changes in our manufacturing strategy which included a decision to no longer utilize certain facilities. As a result of this decision, we determined that the related assets were fully impaired based on the difference between fair value and the carrying amount. The total charges consisted of write-offs of manufacturing assets of $\n381\n million, write-offs of inventory of $\n89\n million and other costs of $\n57\n million. We recorded $\n479\n million of these charges in Cost of goods sold, $\n20\n million of these charges in Research and development expenses and $\n28\n million of these charges in Selling, general and administrative expenses on our Consolidated Statements of Operations.\nOther (Income) Expense, Net\nThe following table summarizes the components of Other (income) expense, net:\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nLoss from equity securities, net\n$\n274\n \n$\n167\n \n$\n657\n \nInterest income\n(\n281\n)\n(\n376\n)\n(\n106\n)\nOther, net\n2\n \n11\n \n29\n \nOther (income) expense, net\n$\n(\n6\n)\n$\n(\n198\n)\n$\n581\n \n81\n11.\n    \nDEBT AND CREDIT FACILITIES\nThe following table summarizes the carrying amount of our borrowings under various financing arrangements:\n(in millions)\nCarrying Amount\nType of Borrowing\nIssue Date\nMaturity Date\nInterest Rate\nDecember 31, 2024\nDecember 31, 2023\nSenior Unsecured\nMarch 2014\nApril 2024\n3.70\n%\n—\n \n1,750\n \nSenior Unsecured\nNovember 2014\nFebruary 2025\n3.50\n%\n1,750\n \n1,749\n \nSenior Unsecured\nSeptember 2015\nMarch 2026\n3.65\n%\n2,747\n \n2,744\n \nSenior Unsecured\nSeptember 2016\nMarch 2027\n2.95\n%\n1,249\n \n1,248\n \nSenior Unsecured\nSeptember 2020\nOctober 2027\n1.20\n%\n748\n \n747\n \nSenior Unsecured\nNovember 2024\nNovember 2029\n4.80\n%\n746\n \n—\n \nSenior Unsecured\nSeptember 2020\nOctober 2030\n1.65\n%\n995\n \n994\n \nSenior Unsecured\nSeptember 2023\nOctober 2033\n5.25\n%\n993\n \n992\n \nSenior Unsecured\nNovember 2024\nJune 2035\n5.10\n%\n991\n \n—\n \nSenior Unsecured\nSeptember 2015\nSeptember 2035\n4.60\n%\n994\n \n993\n \nSenior Unsecured\nSeptember 2016\nSeptember 2036\n4.00\n%\n744\n \n743\n \nSenior Unsecured\nSeptember 2020\nOctober 2040\n2.60\n%\n989\n \n988\n \nSenior Unsecured\nDecember 2011\nDecember 2041\n5.65\n%\n997\n \n996\n \nSenior Unsecured\nMarch 2014\nApril 2044\n4.80\n%\n1,738\n \n1,737\n \nSenior Unsecured\nNovember 2014\nFebruary 2045\n4.50\n%\n1,735\n \n1,734\n \nSenior Unsecured\nSeptember 2015\nMarch 2046\n4.75\n%\n2,224\n \n2,222\n \nSenior Unsecured\nSeptember 2016\nMarch 2047\n4.15\n%\n1,730\n \n1,729\n \nSenior Unsecured\nSeptember 2020\nOctober 2050\n2.80\n%\n1,479\n \n1,478\n \nSenior Unsecured\nSeptember 2023\nOctober 2053\n5.55\n%\n988\n \n988\n \nSenior Unsecured\nNovember 2024\nNovember 2054\n5.50\n%\n989\n \n—\n \nSenior Unsecured\nNovember 2024\nNovember 2064\n5.60\n%\n738\n \n—\n \nTotal senior unsecured notes\n25,562\n \n23,834\n \nLiability related to future royalties\n1,148\n \n1,153\n \nTotal debt, net\n26,710\n \n24,987\n \nLess: Current portion of long-term debt, net\n1,815\n \n1,798\n \nTotal Long-term debt, net\n$\n24,896\n \n$\n23,189\n \nSenior Unsecured Notes\nIn November 2024, we issued $\n3.5\n billion aggregate principal amount of senior unsecured notes in a registered offering consisting of $\n750\n million principal amount of \n4.80\n% senior unsecured notes due November 2029, $\n1.0\n billion principal amount of \n5.10\n% senior unsecured notes due June 2035, $\n1.0\n billion principal amount of \n5.50\n% senior unsecured notes due November 2054 and $\n750\n million principal amount of \n5.60\n% senior unsecured notes due November 2064. Additionally, in April 2024, we repaid at maturity $\n1.75\n billion of principal balance related to our senior unsecured notes due April 2024, and in February 2025, we repaid $\n1.75\n billion of principal balance related to our senior unsecured notes due February 2025.\nOur senior unsecured notes may be redeemed at our option at a redemption price equal to the greater of (i) \n100\n% of the principal amount of the notes to be redeemed and (ii) the sum, as determined by an independent investment banker, of the present values of the remaining scheduled payments of principal and interest on the notes to be redeemed (exclusive of interest accrued to the date of redemption) discounted to the redemption date on a semiannual basis at the Treasury Rate, plus a make-whole premium, which are defined in the terms of the notes. The senior unsecured notes also have a par call feature, exercisable at our option, to redeem the notes at par in whole, or in part, on dates ranging from \none\n to \nsix months\n prior to maturity. In each case, accrued and unpaid interest is also required to be redeemed to the date of redemption.\nIn the event of a change in control and a downgrade in the rating of our senior unsecured notes below investment grade by Moody’s Investors Service, Inc. and S&P Global Ratings, the holders may require us to purchase all or a portion of their notes at a price equal to \n101\n% of the aggregate principal amount of the notes repurchased, plus accrued and unpaid interest to the date of repurchase. We are required to comply with certain covenants under our note indentures governing our senior unsecured notes. As of December 31, 2024 and 2023, we were not in violation of any covenants.\n82\nLiability Related to Future Royalties\nIn connection with our acquisition of Immunomedics, we assumed a liability related to a funding arrangement, which was originally entered into by Immunomedics and RPI Finance Trust (“RPI”), prior to our acquisition of Immunomedics. Under the funding agreement, RPI has the right to receive certain royalty amounts, subject to certain reductions, based on the net sales of Trodelvy for each calendar quarter during the term of the agreement through approximately 2036. The liability is amortized using the effective interest rate method, resulting in recognition of interest expense over \n16\n years. The estimated timing and amount of future expected royalty payments over the estimated term will be re-assessed each reporting period. The impact from changes in estimates will be recognized in the liability and the related interest expense prospectively.\nRevolving Credit Facilities\nIn June 2024, we terminated our $\n2.5\n billion revolving credit facility maturing in June 2025 (the “2020 Revolving Credit Facility”) and entered into a new $\n2.5\n billion revolving credit facility maturing in June 2029 (the “2024 Revolving Credit Facility”), which has terms substantially similar to the 2020 Revolving Credit Facility. The 2024 Revolving Credit Facility can be used for working capital requirements and for general corporate purposes, including, without limitation, acquisitions. As of December 31, 2024 and 2023, there were \nno\n amounts outstanding under these revolving credit facilities.\nThe 2024 Revolving Credit Facility contains customary representations, warranties, affirmative and negative covenants and events of default. As of December 31, 2024, we were in compliance with all covenants. Loans under the 2024 Revolving Credit Facility bear interest at either (i) Term SOFR plus the Applicable Percentage, (ii) the Alternative Currency Term Rate plus the Applicable Percentage, or (iii) the Base Rate plus the Applicable Percentage, each as defined in the 2024 Revolving Credit Facility agreement. We may terminate or reduce the commitments and may prepay any loans under the 2024 Revolving Credit Facility in whole or in part at any time without premium or penalty.\nContractual Maturities of Financing Obligations\nThe following table summarizes the aggregate future principal maturities of our senior unsecured notes as of December 31, 2024:\n(in millions)\nAmount\n2025\n$\n1,750\n \n2026\n2,750\n \n2027\n2,000\n \n2028\n—\n \n2029\n750\n \nThereafter\n18,500\n \nTotal\n$\n25,750\n \n12.    \nLEASES\nOur operating leases consist primarily of properties and equipment for our administrative, manufacturing and R&D activities. Some of our leases include options to extend the terms for up to \n15\n years and some include options to terminate the lease within \none year\n after the lease commencement date. As of December 31, 2024 and 2023, we did not have material finance leases. Operating lease expense, including variable costs and short-term leases, was $\n163\n million, $\n165\n million and $\n162\n million for the years ended December 31, 2024, 2023 and 2022, respectively. \nThe following table summarizes balance sheet and other information related to our operating leases:\nDecember 31,\n(in millions, except weighted average amounts)\nClassification\n2024\n2023\nRight-of-use assets, net\nOther long-term assets\n$\n515\n \n$\n581\n \nLease liabilities – current\nOther current liabilities\n$\n113\n \n$\n125\n \nLease liabilities – noncurrent\nOther long-term obligations\n$\n498\n \n$\n546\n \nWeighted average remaining lease term\n8.0\n years\n7.5\n years\nWeighted average discount rate\n3.37\n \n%\n3.22\n \n%\n83\nThe following table summarizes other supplemental information related to our operating leases:\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nCash paid for amounts included in the measurement of lease liabilities\n$\n141\n \n$\n88\n \n$\n98\n \nRight-of-use assets obtained in exchange for lease liabilities\n(1)\n$\n86\n \n$\n214\n \n$\n97\n \n_______________________________\n(1)\n     These represent noncash activities and were therefore not included on our Consolidated Statements of Cash Flows.\nThe following table summarizes a maturity analysis of our operating lease liabilities showing the aggregate lease payments as of December 31, 2024:\n(in millions)\nAmount\n2025\n$\n132\n \n2026\n109\n \n2027\n88\n \n2028\n77\n \n2029\n64\n \nThereafter\n228\n \nTotal undiscounted lease payments\n698\n \nLess: imputed interest\n87\n \nTotal discounted lease payments\n$\n611\n \n13.\n    \nCOMMITMENTS AND CONTINGENCIES \nLegal Proceedings\nWe are a party to various legal actions. Certain significant matters are described below. We recognize accruals for such actions to the extent that we conclude that a loss is both probable and reasonably estimable. We accrue for the best estimate of a loss within a range; however, if no estimate in the range is better than any other, then we accrue the minimum amount in the range. If we determine that a material loss is reasonably possible and the loss or range of loss can be estimated, we disclose the possible loss. Unless otherwise noted, the outcome of these matters either is not expected to be material or is not possible to determine such that we cannot reasonably estimate the maximum potential exposure or the range of possible loss. We have recorded approximately $\n242\n million of accruals for the matters described herein, with approximately $\n200\n million accrued for a potential settlement with the U.S. Attorney’s Office for the Southern District of New York, on our Consolidated Balance Sheets as of December 31, 2024. We did \nnot\n have any material accruals for the matters described below as of December 31, 2023.\n84\nLitigation Relating to Pre-Exposure Prophylaxis\nIn August 2019, we filed petitions requesting inter partes review of U.S. Patent Nos. 9,044,509, 9,579,333, 9,937,191 and 10,335,423 (collectively, “HHS Patents”) by the Patent Trial and Appeal Board (“PTAB”). The HHS Patents are assigned to the U.S. Department of Health and Human Services (“HHS”) and purport to claim a process of protecting a primate host from infection by an immunodeficiency retrovirus by administering a combination of FTC and tenofovir disoproxil fumarate (“TDF”) or tenofovir alafenamide (“TAF”) prior to exposure of the host to the immunodeficiency retrovirus, a process commonly known as pre-exposure prophylaxis (“PrEP”). In November 2019, the U.S. Department of Justice filed a lawsuit against us in the U.S. District Court of Delaware, alleging that the use of Truvada and Descovy for PrEP infringes the HHS Patents. In February 2020, PTAB declined to institute our petitions for inter partes review of the HHS Patents. In April 2020, we filed a lawsuit against the U.S. federal government in the U.S. Court of Federal Claims (“CFC”), alleging breach of \nthree\n material transfer agreements (“MTAs”) related to the research underlying the HHS Patents and two clinical trial agreements (“CTAs”) by the U.S. Centers for Disease Control and Prevention related to PrEP research. A trial for the bifurcated portion of the lawsuit in the CFC was held in June 2022, and in November 2022, the CFC determined that the government breached the MTAs. In January 2024, the CFC found the government liable for breach of both CTAs. In May 2023, the District Court held a trial regarding the government’s patent infringement claims, and the jury rendered a full defense verdict in favor of Gilead, finding that the asserted claims of the HHS Patents are invalid and the HHS patents are not infringed. In March 2024, the District Court upheld the jury’s verdict that the government’s patents are invalid, denied the government’s request for a new trial and then entered final judgment. In July 2024, the government filed a notice of appeal. In January 2025, we entered into a settlement agreement with the government to resolve these litigation matters relating to PrEP. The settlement includes the dismissal of both lawsuits, including the government’s appeal of the jury verdict that its patents are invalid, as well as a license to the government’s existing PrEP patents.\nLitigation with Generic Manufacturers\nAs part of the approval process for some of our products, FDA granted us a New Chemical Entity (“NCE”) exclusivity period during which other manufacturers’ applications for approval of generic versions of our products will not be approved. Generic manufacturers may challenge the patents protecting products that have been granted NCE exclusivity one year prior to the end of the NCE exclusivity period. Generic manufacturers have sought and may continue to seek FDA approval for a similar or identical drug through an abbreviated new drug application (“ANDA”), the application form typically used by manufacturers seeking approval of a generic drug. The sale of generic versions of our products prior to their patent expiration would have a significant negative effect on our revenues and results of operations. To seek approval for a generic version of a product having NCE status, a generic company may submit its ANDA to FDA four years after the branded product’s approval.\nIn October 2021, we received a letter from Lupin Ltd. (“Lupin”) indicating that it has submitted an ANDA to FDA requesting permission to market and manufacture a generic version of Symtuza, a product commercialized by Janssen Products L.P. and for which Gilead shares in revenues. In November 2021, we, along with Janssen Products, L.P. and Janssen Sciences Ireland Unlimited Company (together, “Janssen”), filed a patent infringement lawsuit against Lupin as co-plaintiffs in the U.S. District Court of Delaware. In September 2022, we received a letter from Apotex Inc. and Apotex Corp. (together, “Apotex”) stating that they have submitted an ANDA for a generic version of Symtuza. In October 2022, we, along with Janssen, filed a patent infringement lawsuit against Apotex as co-plaintiffs in the U.S. District Court of Delaware. The cases against Lupin and Apotex were consolidated into a single trial scheduled for February 2025. In February 2025, we, along with Janssen, entered into a settlement agreement with Lupin and its manufacturer of cobicistat on silicon dioxide, MSN Laboratories Private Limited, MSN Life Sciences Private Ltd., and MSN Pharmaceuticals Inc. (collectively, “MSN”), to resolve the litigation and patent challenges associated with Symtuza in the U.S. District Court for the District of Delaware. Pursuant to the settlement agreement, Lupin and MSN were granted a non-exclusive license for Lupin’s ANDA product in the U.S. to our patent, jointly owned with Janssen, relating to a use of Symtuza, beginning on an agreed-upon date in the future, or earlier in certain circumstances. The terms of the settlement agreement are confidential. In February 2025, we, along with Janssen, entered into a settlement agreement with Apotex to resolve the litigation and patent challenges associated with Symtuza in the U.S. District Court for the District of Delaware. Pursuant to the settlement agreement, Apotex was granted a non-exclusive license for Apotex’s ANDA product in the U.S. to our patent, jointly owned with Janssen, relating to a use of Symtuza, beginning on an agreed-upon date in the future, or earlier in certain circumstances. The terms of the settlement agreement are confidential. Both settlement agreements with Lupin and Apotex have been filed with the U.S. Federal Trade Commission and the U.S. Department of Justice as required by law.\n85\nStarting in March 2022, we received letters from Lupin, Laurus Labs (“Laurus”) and Cipla Ltd. (“Cipla”), indicating that they have submitted ANDAs to FDA requesting permission to market and manufacture generic versions of the adult dosage strength of Biktarvy. Lupin, Laurus, and Cipla have challenged the validity of \nfour\n of the \nsix\n patents listed in the Orange Book as associated with Biktarvy. We filed a lawsuit against Lupin, Laurus and Cipla in May 2022 in the U.S. District Court of Delaware and intend to enforce and defend our intellectual property. Additionally, in November 2023, we received a letter from Cipla indicating that it has submitted an ANDA to FDA requesting permission to market and manufacture a generic version of the pediatric dosage strength of Biktarvy. Cipla challenged the validity of \ntwo\n of the patents listed in the Orange Book as associated with Biktarvy. We filed a separate lawsuit against Cipla in December 2023 in the U.S. District Court of Delaware. This lawsuit has been consolidated with the first lawsuit, with a single trial scheduled for October 2025. In October 2024, Cipla separately filed a petition at the U.S. Patent & Trademark Office (“USPTO”) for Inter Partes Review (IPR) of one of the patents at issue in District Court litigation. We intend to defend this patent at the USPTO.\nIn June 2023, we received a letter from Apotex indicating that it has submitted an ANDA to FDA requesting permission to market and manufacture a generic version of Genvoya. In July 2023, we filed a patent infringement lawsuit against Apotex in the U.S. District Court of Delaware and to enforce and defend our intellectual property. This case was consolidated with the Symtuza matters discussed above, and a trial was scheduled for February 2025. In February 2025, we entered into a settlement agreement with Apotex and its manufacturer of cobicistat on silicon dioxide, MSN, to resolve the litigation and patent challenges associated with Genvoya in the U.S. District Court for the District of Delaware. Pursuant to the settlement agreement, Apotex and MSN were granted a non-exclusive license for Apotex’s ANDA product in the U.S. to certain of our patents on cobicistat on silicon dioxide and TAF relating to Genvoya beginning on August 6, 2032, or earlier in certain circumstances. The settlement agreement has been filed with the U.S. Federal Trade Commission and the U.S. Department of Justice as required by law. \nAntitrust and Consumer Protection\nWe, along with Bristol-Myers Squibb Company (“BMS”), Johnson & Johnson, Inc. (“Johnson & Johnson”), and Teva Pharmaceutical Industries Ltd. (“Teva”) have been named as defendants in class action lawsuits filed in 2019 and 2020 related to various drugs used to treat HIV, including drugs used in combination antiretroviral therapy. Plaintiffs allege that we (and the other defendants) engaged in various conduct to restrain competition in violation of federal and state antitrust laws and state consumer protection laws. The lawsuits, which have been consolidated, are pending in the U.S. District Court for the Northern District of California. The lawsuits seek to bring claims on behalf of direct purchasers consisting largely of wholesalers and indirect or end-payor purchasers, including health insurers and individual patients. Plaintiffs seek damages, permanent injunctive relief and other relief. In the second half of 2021 and first half of 2022, several plaintiffs consisting of retail pharmacies, individual health plans and United Healthcare, filed separate lawsuits effectively opting out of the class action cases, asserting claims that are substantively the same as the classes. These cases have been coordinated with the class actions. In March 2023, the District Court granted our motion to hold separate trials as to (i) the allegations against us and Teva seeking monetary damages relating to Truvada and Atripla (“Phase I”) and (ii) the allegations against us and, in part, Johnson & Johnson, seeking monetary damages and injunctive relief relating to Complera (“Phase II”). In May 2023, we settled claims with the direct purchaser class and the retailer opt-out plaintiffs for $\n525\n million, which we paid in the second half of 2023. The settlement agreements are not an admission of liability or fault by us. In June 2023, the jury returned a complete verdict in Gilead’s favor on the remaining plaintiffs’ Phase I allegations. In November 2023, the court denied plaintiffs’ motion to set aside the verdict, and in February 2024, the court entered final judgment on the Phase I verdict and certain summary judgment rulings. In September 2024, plaintiffs filed their opening appellate briefs challenging the Phase I verdict and those summary judgment rulings. We filed our responsive briefs in January 2025. The court has stayed Phase II pending the appeal of Phase I. While we intend to vigorously oppose the appeal and defend against the Phase II claims, we cannot predict the ultimate outcome. If plaintiffs are successful in their appeal or Phase II claims, we could be required to pay monetary damages or could be subject to permanent injunctive relief in favor of plaintiffs.\nIn January 2022, we, along with BMS and Janssen Products, L.P., were named as defendants in a lawsuit filed in the Superior Court of the State of California, County of San Mateo, by Aetna, Inc. on behalf of itself and its affiliates and subsidiaries that effectively opts the Aetna plaintiffs out of the above class actions. The allegations are substantively the same as those in the class actions. The Aetna plaintiffs seek damages, permanent injunctive relief and other relief. In March 2024, the court denied our motion for judgment on the pleadings to preclude Aetna from re-litigating claims that were dismissed at summary judgment in the above class action cases. We filed a writ petition appealing the denial of our motion for judgment on the pleadings, which the appellate court denied in May 2024. In April 2024, the court granted our motion to bifurcate the case to adjudicate the issue of preclusion before litigating the merits of the case. In July 2024, Aetna filed a request to voluntarily dismiss \ntwo\n of its claims with prejudice, which the court subsequently granted, leaving only the claims related to Truvada and Atripla. In September 2024, Aetna filed an amended complaint with respect to these claims. In October 2024, we filed a demurrer and motion to strike plaintiff’s claims.\n86\nIn February 2021, we, along with BMS and Teva, were named as defendants in a lawsuit filed in the First Judicial District Court for the State of New Mexico, County of Santa Fe by the New Mexico Attorney General. The New Mexico Attorney General alleges that we (and the other defendants) restrained competition in violation of New Mexico antitrust and consumer protection laws. The New Mexico Attorney General seeks damages, permanent injunctive relief and other relief. We moved to dismiss the case based on lack of personal jurisdiction and, in July 2023, the New Mexico Supreme Court remanded the case back to the trial court for limited jurisdictional discovery.\nWe intend to vigorously defend ourselves in these actions, however, we cannot predict the ultimate outcome. If plaintiffs are successful in their claims, we could be required to pay significant monetary damages or could be subject to permanent injunctive relief awarded in favor of plaintiffs, which may result in a material, adverse effect on our results of operations and financial condition, including in a particular reporting period in which any such outcome becomes probable and estimable.\nProduct Liability\nWe have been named as a defendant in \none\n putative class action lawsuit and various product liability lawsuits related to Viread, Truvada, Atripla, Complera and Stribild. Plaintiffs allege that Viread, Truvada, Atripla, Complera and/or Stribild caused them to experience kidney, bone and/or tooth injuries. The lawsuits, which are pending in state or federal court in California and Missouri, involve approximately \n22,000\n active plaintiffs. Plaintiffs in these cases seek damages and other relief on various grounds for alleged personal injury and economic loss. The first bellwether trial in California state court was scheduled to begin in October 2022 but is currently stayed pending the conclusion of appellate proceedings in the California Supreme Court. In the California federal case, Gilead agreed to make a one-time payment of approximately $\n39\n million to a group of plaintiffs (approximately \n2,470\n plaintiffs). The federal court set a trial date of March 2027 for the first bellweather trial of the remaining cases. Briefing is ongoing in the putative class action in Missouri regarding whether the court should certify the proposed class. We intend to vigorously defend ourselves in these actions, however, we cannot predict the ultimate outcome. If plaintiffs are successful in their claims, we could be required to pay significant monetary damages, which may result in a material, adverse effect on our results of operations and financial condition, including in a particular reporting period in which any such outcome becomes probable and estimable.\nGovernment Investigation\nIn 2017, we received a subpoena from the U.S. Attorney’s Office for the Southern District of New York requesting documents related to our promotional speaker programs for HIV. We have recorded an accrual of approximately $\n200\n million for a potential settlement of this matter.\nQui Tam Litigation\nA former sales employee filed a qui tam lawsuit against Gilead in March 2017 in U.S. District Court for the Eastern District of Pennsylvania. Following the government’s decision not to intervene in the suit, the case was unsealed in December 2020. The lawsuit alleges that certain of Gilead’s HCV sales and marketing activities and donations to an independent charitable foundation violated the federal False Claims Act and various state false claims acts. The lawsuit seeks all available relief under these statutes. \nHealth Choice Advocates, LLC (“Health Choice”) filed a qui tam lawsuit against Gilead in May 2020 in Texas state court. The lawsuit alleged that Gilead violated the Texas Medicare Fraud Prevention Act (“TMFPA”) through our clinical educator programs for Sovaldi and Harvoni and our HCV and HIV patient support programs. The lawsuit sought all available relief under the TMFPA. Health Choice voluntarily dismissed the case without prejudice in August 2023, and commenced a new action in October 2023, asserting largely identical allegations and claims. In the newly filed action, the Texas Attorney General has intervened as a plaintiff. \nWe intend to vigorously defend ourselves in these actions, however, we cannot predict the ultimate outcomes. If any of these plaintiffs are successful in their claims, we could be required to pay significant monetary damages, which may result in a material, adverse effect on our results of operations and financial condition, including in a particular reporting period in which any such outcome becomes probable and estimable.\nOther Matters\nWe are a party to various legal actions that arose in the ordinary course of our business. We do not believe that it is probable or reasonably possible that these other legal actions will have a material adverse impact on our consolidated financial position, results of operations or cash flows.\n87\n14.\n    \nEMPLOYEE BENEFITS \nStock-Based Compensation\nEquity Incentive Plans and ESPP Summary\nIn May 2004, our stockholders approved and we adopted the Gilead Sciences, Inc. 2004 Equity Incentive Plan (as amended, the “2004 Plan”). As part of the Forty Seven, Inc. acquisition in 2020, we assumed the Forty Seven, Inc. 2018 Equity Incentive Plan, which we subsequently amended and restated as the Gilead Sciences, Inc. 2018 Equity Incentive Plan (as amended and restated, the “2018 Plan”). As part of the Immunomedics acquisition in 2020, we assumed the Immunomedics Amended and Restated 2014 Long-Term Incentive Plan, which we subsequently merged into the 2004 Plan.\nIn May 2022, our stockholders approved and we adopted the Gilead Sciences, Inc. 2022 Equity Incentive Plan (the “2022 Plan”). The 2022 Plan authorized the issuance of a total of \n132\n million shares of common stock. No awards may be granted under the 2004 Plan or the 2018 Plan since the approval of the 2022 Plan.\nThese are broad-based incentive plans that provide for the grant of equity-based awards, including RSUs, PSUs, stock options and other restricted stock and performance awards, to employees, directors and consultants. As of December 31, 2024, a total of \n70\n million shares remain available for future grant under the 2022 Plan. Also, under our ESPP, a total of \n104\n million shares of common stock have been authorized for issuance, and there were \n24\n million shares available for issuance as of December 31, 2024.\nStock-Based Compensation Expense\nThe following tables summarize total stock-based compensation expense included on our Consolidated Statements of Operations, classified by award type and expense type:\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nRSUs\n$\n732\n \n$\n666\n \n$\n557\n \nPSUs\n37\n \n32\n \n25\n \nStock options\n30\n \n30\n \n28\n \nESPP\n36\n \n37\n \n26\n \nAcquisition-related expense\n(1)\n133\n \n29\n \n8\n \nStock-based compensation expense included in total costs and expenses\n$\n969\n \n$\n796\n \n$\n645\n \n_______________________________\n(1)\n    Accelerated post-acquisition stock-based compensation expenses of $\n133\n million related to the 2024 CymaBay acquisition, $\n19\n million and $\n10\n million related to the 2023 XinThera and Tmunity acquisitions, respectively, and\n \n$\n8\n million\n \nrelated to the 2022 MiroBio acquisition.\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nCost of goods sold\n$\n61\n \n$\n57\n \n$\n46\n \nResearch and development expenses\n458\n \n377\n \n285\n \nSelling, general and administrative expenses\n450\n \n361\n \n313\n \nStock-based compensation expense included in total costs and expenses\n969\n \n796\n \n645\n \nIncome tax effect\n(\n192\n)\n(\n165\n)\n(\n91\n)\nStock-based compensation expense, net of tax\n$\n777\n \n$\n630\n \n$\n553\n \nRSUs\nWe grant time-based RSUs to certain employees as part of our annual employee equity compensation review program as well as to new hire employees and to non-employee members of our Board. RSUs are share-based awards that entitle the holder to receive freely tradable shares of our common stock upon vesting. RSUs generally vest over \nthree\n or \nfour years\n from the date of grant. RSUs have dividend equivalent rights entitling holders to dividend equivalents to be paid upon vesting for each share of the underlying unit.\n88\nThe following tables summarize our RSU activity:\nRSUs\n(in millions, except per share amounts)\nShares\nWeighted-\nAverage\nGrant Date Fair Value Per Share\nOutstanding as of December 31, 2023\n22.7\n \n$\n71.24\n \nGranted\n12.4\n \n$\n74.82\n \nVested\n(\n11.0\n)\n$\n70.49\n \nForfeited\n(\n2.2\n)\n$\n72.52\n \nOutstanding as of December 31, 2024\n21.8\n \n$\n73.52\n \nYear Ended December 31,\n(in millions, except per share amounts)\n2024\n2023\n2022\nWeighted-average grant date fair value of RSUs granted\n$\n74.82\n \n$\n79.66\n \n$\n60.36\n \nTotal fair value of RSUs vested\n$\n847\n \n$\n849\n \n$\n554\n \nAs of December 31, 2024, there was $\n1.1\n billion of unrecognized compensation cost related to unvested RSUs, which is expected to be recognized over a weighted-average period of \n2.2\n years.\nPSUs\nWe grant PSUs that vest upon the achievement of specified market or performance goals, which could include achieving a total shareholder return compared to a pre-determined peer group or achieving revenue targets. The actual number of common shares ultimately issued is calculated by multiplying the number of PSUs by a payout percentage ranging from \n0\n% to \n200\n%, and these awards generally vest only when a committee (or subcommittee) of our Board has determined that the specified market and performance goals have been achieved. PSUs have dividend equivalent rights entitling holders to dividend equivalents to be paid upon vesting for each share of the underlying unit.\nThe following tables summarize our PSU activity:\nPSUs\n(in millions, except per share amounts)\nShares\nWeighted-\nAverage\nGrant Date Fair Value Per Share\nOutstanding as of December 31, 2023\n1.0\n \n$\n67.48\n \nGranted\n0.6\n \n$\n72.24\n \nVested\n(\n0.5\n)\n$\n71.86\n \nForfeited\n—\n \n$\n72.10\n \nOutstanding as of December 31, 2024\n1.1\n \n$\n72.24\n \nYear Ended December 31,\n(in millions, except per share amounts)\n2024\n2023\n2022\nWeighted-average grant date fair value of PSUs granted\n$\n72.24\n \n$\n81.39\n \n$\n60.04\n \nTotal fair value of PSUs vested\n$\n43\n \n$\n35\n \n$\n14\n \nAs of December 31, 2024, there was $\n31\n million of unrecognized compensation cost related to unvested PSUs, which is expected to be recognized over a weighted-average period of \n1.1\n years.\nStock Options\nOption grants are designated as either non-statutory or incentive stock options. The exercise price of stock options may not be less than the fair market value of our common stock on the grant date and no stock option may have a term in excess of \n10\n years. Employee stock options generally vest over \nthree\n or \nfour years\n. Stock options may be settled in cash or in shares of our common stock, including a net issuance using shares otherwise purchasable under the option to pay the exercise price. \n89\nThe following tables summarize activity and other information related to our stock options: \nShares\n(in millions)\nWeighted-\nAverage\nExercise Price\n(in dollars)\nWeighted-Average\nRemaining\nContractual Term\n(years)\nAggregate\n Intrinsic\nValue\n(in millions)\n(1)\nOutstanding as of December 31, 2023\n14.3\n \n$\n69.38\n \nGranted\n2.5\n \n$\n74.70\n \nExercised\n(\n4.1\n)\n$\n69.28\n \nForfeited\n(\n0.5\n)\n$\n71.65\n \nExpired\n(\n0.3\n)\n$\n89.27\n \nOutstanding as of December 31, 2024\n11.8\n \n$\n69.85\n \n6.38\n$\n268\n \nExercisable as of December 31, 2024\n7.4\n \n$\n68.72\n \n5.26\n$\n178\n \nExpected to vest, net of estimated forfeitures as of December 31, 2024\n4.2\n \n$\n71.67\n \n8.26\n$\n86\n \n_______________________________\n(1)\n     Aggregate intrinsic value represents the value of our closing stock price on the last trading day of the year in excess of the weighted-average exercise price multiplied by the number of options outstanding or exercisable\n. \nYear Ended December 31,\n(in millions, except per share amounts)\n2024\n2023\n2022\nWeighted-average grant date fair value of stock options granted\n$\n13.70\n \n$\n16.11\n \n$\n9.08\n \nTotal intrinsic value of options exercised\n$\n77\n \n$\n25\n \n$\n59\n \nWe used the following weighted-average assumptions in the Black-Scholes model to calculate the estimated fair value of the stock option awards:\nYear Ended December 31,\n2024\n2023\n2022\nExpected volatility\n25\n \n%\n26\n \n%\n27\n \n%\nExpected terms in years\n5\n5\n5\nRisk-free interest rate\n4.1\n \n%\n4.1\n \n%\n1.9\n \n%\nExpected dividend yield\n3.9\n \n%\n3.5\n \n%\n4.3\n \n%\nAs of December 31, 2024, there was $\n43\n million of unrecognized compensation cost related to stock options, which is expected to be recognized over an estimated weighted-average period of \n2.1\n years.\nESPP\nUnder our ESPP, employees can purchase shares of our common stock based on a percentage of their compensation subject to certain limits. The purchase price per share is equal to the lower of \n85\n% of the fair market value of our common stock on the offering date or the purchase date. The ESPP offers a six-month look-back feature. ESPP purchases are settled with common stock from the ESPP’s previously authorized and available pool of shares. \nThe following table summarizes our ESPP activity:\nYear Ended December 31,\n(in millions, except per share amounts)\n2024\n2023\n2022\nShares issued\n2\n2\n2\nAmount paid by employees for shares\n$\n139\n \n$\n129\n \n$\n103\n \nWeighted-average grant date fair value of ESPP shares granted\n$\n15.76\n \n$\n17.31\n \n$\n13.40\n \nTotal fair value of ESPP shares vested\n$\n27\n \n$\n45\n \n$\n21\n \n90\nWe used the following weighted-average assumptions in the Black-Scholes model to calculate the estimated fair value of the ESPP awards:\nYear Ended December 31,\n2024\n2023\n2022\nExpected volatility\n25\n \n%\n24\n \n%\n23\n \n%\nExpected terms in years\n0.5\n0.5\n0.5\nRisk-free interest rate\n5.2\n \n%\n5.1\n \n%\n1.8\n \n%\nExpected dividend yield\n4.3\n \n%\n3.7\n \n%\n4.5\n \n%\nDeferred Compensation\nWe maintain a retirement saving plan under which eligible U.S. employees may defer compensation for income tax purposes under Section 401(k) of the Internal Revenue Code (the “Gilead Sciences 401k Plan”). In certain foreign subsidiaries, we maintain defined benefit plans as required by local regulatory requirements. Our total matching contribution expense under the Gilead Sciences 401k Plan and other defined benefit plans was $\n204\n million, $\n208\n million and $\n176\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\nWe maintain a deferred compensation plan under which our directors and key employees may defer compensation. Amounts deferred by participants are deposited into a rabbi trust. The total assets and liabilities associated with the deferred compensation plan were both approximately $\n343\n million and $\n284\n million as of December 31, 2024 and 2023, respectively.\n15.\n    \nEARNINGS PER SHARE\nThe following table shows the calculation of basic and diluted earnings per share attributable to Gilead:\nYear Ended December 31,\n(in millions, except per share amounts)\n2024\n2023\n2022\nNet income attributable to Gilead\n$\n480\n \n$\n5,665\n \n$\n4,592\n \nShares used in basic earnings per share attributable to Gilead calculation\n1,247\n \n1,248\n \n1,255\n \nDilutive effect of stock options and equivalents\n8\n \n10\n \n7\n \nShares used in diluted earnings per share attributable to Gilead calculation\n1,255\n \n1,258\n \n1,262\n \nBasic earnings per share attributable to Gilead\n$\n0.38\n \n$\n4.54\n \n$\n3.66\n \nDiluted earnings per share attributable to Gilead\n$\n0.38\n \n$\n4.50\n \n$\n3.64\n \nPotential shares of common stock excluded from the computation of Diluted earnings per share attributable to Gilead because their effect would have been antidilutive were \n5\n million, \n4\n million and \n12\n million for the years ended December 31, 2024, 2023 and 2022, respectively.\n16.    \nINCOME TAXES\nIncome before income taxes consists of the following:\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nDomestic\n$\n(\n876\n)\n$\n5,467\n \n$\n4,439\n \nForeign\n1,566\n \n1,392\n \n1,375\n \nIncome before income taxes\n$\n690\n \n$\n6,859\n \n$\n5,814\n \n91\nIncome tax expense consists of the following:\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nFederal:\nCurrent\n$\n1,495\n \n$\n1,781\n \n$\n2,539\n \nDeferred\n(\n1,562\n)\n(\n1,126\n)\n(\n1,502\n)\n(\n67\n)\n655\n \n1,037\n \nState:\nCurrent\n39\n \n80\n \n32\n \nDeferred\n(\n386\n)\n170\n \n(\n154\n)\n(\n347\n)\n250\n \n(\n122\n)\nForeign:\nCurrent\n519\n \n381\n \n232\n \nDeferred\n106\n \n(\n39\n)\n101\n \n625\n \n342\n \n333\n \nIncome tax expense\n$\n211\n \n$\n1,247\n \n$\n1,248\n \nThe reconciliation between the federal statutory tax rate applied to Income before income taxes and our effective tax rate is summarized as follows\n(1)\n:\nYear Ended December 31,\n2024\n2023\n2022\nFederal statutory rate\n21.0\n \n%\n21.0\n \n%\n21.0\n \n%\nState taxes, net of federal benefit\n(\n43.6\n)\n%\n2.3\n \n%\n(\n2.0\n)\n%\nForeign earnings at different rates\n10.9\n \n%\n(\n0.2\n)\n%\n(\n0.6\n)\n%\nResearch and other credits\n(\n31.6\n)\n%\n(\n4.3\n)\n%\n(\n2.7\n)\n%\nUS tax on foreign earnings\n12.1\n \n%\n1.0\n \n%\n2.7\n \n%\nForeign-derived intangible income deduction\n(\n19.3\n)\n%\n(\n2.1\n)\n%\n(\n3.8\n)\n%\nTax examinations\n(\n33.7\n)\n%\n(\n4.7\n)\n%\n(\n0.2\n)\n%\nAcquired IPR&D & related charges\n117.3\n \n%\n1.3\n \n%\n1.4\n \n%\nChanges in valuation allowance\n15.6\n \n%\n0.9\n \n%\n1.2\n \n%\nNon-taxable unrealized loss on investment\n6.8\n \n%\n0.2\n \n%\n0.7\n \n%\nLegal entity restructuring\n(\n52.6\n)\n%\n—\n \n%\n—\n \n%\nOther\n27.6\n \n%\n2.8\n \n%\n3.8\n \n%\nEffective tax rate\n30.5\n \n%\n18.2\n \n%\n21.5\n \n%\n_______________________________\n(1)\n     Recurring items in this rate reconciliation table for 2024 are significantly impacted by the lower Income before income taxes for that year.\n92\nSignificant components of our deferred tax4 assets and liabilities are as follows:\nDecember 31,\n(in millions)\n2024\n2023\nDeferred tax assets:\n \n \nNet operating loss carryforwards\n$\n288\n \n$\n417\n \nStock-based compensation\n84\n \n94\n \nReserves and accruals not currently deductible\n685\n \n644\n \nExcess of tax basis over book basis of intangible assets\n910\n \n1,041\n \nUpfront and milestone payments\n1,312\n \n1,271\n \nResearch and other credit carryforwards\n428\n \n283\n \nEquity investments\n237\n \n221\n \nLiability related to future royalties\n287\n \n296\n \nCapitalized R&D expenditures\n2,173\n \n1,623\n \nCapital losses\n590\n \n17\n \nOther, net\n213\n \n303\n \nTotal deferred tax assets before valuation allowance\n7,207\n \n6,210\n \nValuation allowance\n(\n1,217\n)\n(\n663\n)\nTotal deferred tax assets\n5,990\n \n5,547\n \nDeferred tax liabilities:\nProperty, plant and equipment\n(\n276\n)\n(\n274\n)\nExcess of book basis over tax basis of intangible assets\n(\n3,836\n)\n(\n5,481\n)\nOther\n(\n224\n)\n(\n184\n)\nTotal deferred tax liabilities\n(\n4,336\n)\n(\n5,939\n)\nNet deferred tax assets (liabilities)\n$\n1,654\n \n$\n(\n392\n)\nThe valuation allowance increased $\n554\n million for the year ended December 31, 2024, primarily due to capital losses, state research credits, and unrealized losses on our equity investments, partially offset by utilization of foreign net operating losses. \nThe valuation allowance increased $\n64\n million for the year ended December 31, 2023, primarily due to unrealized losses on our equity investments.\nAs of December 31, 2024, we had U.S. federal net operating loss and tax credit carryforwards of approximately $\n602\n million and $\n45\n million, respectively, which will start to expire in 2025 if not utilized. In addition, we had state net operating loss and tax credit carryforwards of approximately $\n3.0\n billion and $\n1.1\n billion, respectively, which will start to expire in 2025 and 2027, respectively, if not utilized. Utilization of net operating losses and tax credits may be subject to an annual limitation due to ownership change limitations provided in the Internal Revenue Code of 1986, as amended, and similar state provisions. This annual limitation may result in the expiration of the net operating losses and credits before utilization.\nWe file federal, state and foreign income tax returns in the U.S. and in many foreign jurisdictions. For federal income tax purposes, the statute of limitations is open for 2019 and onwards and 2016 and onwards for California income tax purposes. For certain acquired entities, the statute of limitations is open for all years from inception due to our utilization of their net operating losses and credits carried over from prior years.\nOur income tax returns are subject to audit by federal, state and foreign tax authorities. We are currently under examination by the Internal Revenue Service for our 2019 to 2021 tax years. There are differing interpretations of tax laws and regulations, and as a result, significant disputes may arise with these tax authorities involving issues of the timing and amount of deductions and allocations of income among various tax jurisdictions. We periodically evaluate our exposures associated with our tax filing positions.\n \nOf the total unrecognized tax benefits, $\n1.4\n billion and $\n929\n million as of December 31, 2024 and 2023, respectively, if recognized, would reduce our effective tax rate in the period of recognition. Interest and penalties related to unrecognized tax benefits included income tax benefits of $\n46\n million, $\n35\n million and $\n3\n million on our Consolidated Statements of Operations for the years ended December 31, 2024, 2023 and 2022, respectively. Accrued interest and penalties related to unrecognized tax benefits were $\n133\n million and $\n180\n million as of December 31, 2024 and 2023, respectively. As of December 31, 2024, we do not believe that it is reasonably possible that our unrecognized tax benefits will significantly change in the next 12 months.\n93\nThe following is a rollforward of our total gross unrecognized tax benefits:\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nBeginning balance\n$\n1,962\n \n$\n1,959\n \n$\n1,713\n \nTax positions related to current year:\nAdditions\n743\n \n265\n \n129\n \nReductions\n—\n \n—\n \n—\n \nTax positions related to prior years:\nAdditions\n190\n \n109\n \n225\n \nReductions\n(\n298\n)\n(\n315\n)\n(\n31\n)\nSettlements\n(\n270\n)\n(\n42\n)\n(\n10\n)\nLapse of statute of limitations\n(\n2\n)\n(\n13\n)\n(\n68\n)\nEnding balance\n$\n2,325\n \n$\n1,962\n \n$\n1,959\n \nIn connection with the Tax Cuts and Jobs Act, we recorded a federal income tax payable for transition tax on the mandatory deemed repatriation of foreign earnings that is payable over an eight-year period. Federal income tax payable for transition tax was $\n1.3\n billion\n \nand $\n2.4\n billion as of December 31, 2024 and 2023, respectively. We anticipate making a payment for the remaining $\n1.3\n billion in 2025.\n \n17.    \nSEGMENT INFORMATION\nWe have \none\n operating segment which primarily focuses on the discovery, development and commercialization of innovative medicines in areas of unmet medical need. Our Chief Executive Officer, as the chief operating decision-maker (“CODM”), manages and allocates resources to the operations of our company on an entity-wide basis, using Net income attributable to Gilead as the primary performance measure. Managing and allocating resources on this basis enables our CODM to assess the overall level of resources available and how to best deploy these resources across functions and R&D projects based on unmet medical need, scientific data, probability of technical and regulatory successful development, market potential and other considerations, and, as necessary, reallocate resources among our internal R&D portfolio and external opportunities to best support the long-term growth of our business. \nOur CODM is regularly provided with entity-wide expense categories similar to those found on our Consolidated Statements of Operations, as well as the following:\nYear Ended December 31,\n(in millions)\n2024\n2023\n2022\nSelling and marketing expenses\n$\n3,453\n \n$\n3,272\n \n$\n3,331\n \nGeneral and administrative expenses\n2,638\n \n2,818\n \n2,342\n \nSelling, general and administrative expenses\n$\n6,091\n \n$\n6,090\n \n$\n5,673\n \nAsset information is not regularly provided to the CODM for assessing performance and allocating resources other than consolidated cash, cash equivalents and marketable debt securities, which can be found on our Consolidated Balance Sheets.\n18.    \nSUBSEQUENT EVENTS\nWe have evaluated subsequent events and determined that there are no further events or transactions to be disclosed other than those already disclosed elsewhere in the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K.\nITEM 9.\n    \nCHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE \nNot applicable. \n94\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and the Board of Directors of Gilead Sciences, Inc. \nOpinion on Internal Control Over Financial Reporting \nWe have audited Gilead Sciences, Inc.’s internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Gilead Sciences, Inc. (the Company) maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of December 31, 2024 and 2023, the related consolidated statements of operations, comprehensive income, stockholders’ equity and cash flows for each of the three years in the period ended December 31, 2024, and the related notes and our report dated February 28, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion \nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting \nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nSan Mateo, California\nFebruary 28, 2025\n95\nITEM 9A.\n    \nCONTROLS AND PROCEDURES\n(a) Evaluation of Disclosure Controls and Procedures \nAn evaluation as of December 31, 2024 was carried out under the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, of the effectiveness of our “disclosure controls and procedures,” which are defined in Rule 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the “Exchange Act”), as controls and other procedures of a company that are designed to ensure that the information required to be disclosed by a company in the reports that it files or submits under the Exchange Act is recorded, processed, summarized and reported, within the time periods specified in the Securities and Exchange Commission’s rules and forms, and that such information is accumulated and communicated to the company’s management, including its Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure. Based upon that evaluation, our Chief Executive Officer and Chief Financial Officer concluded that our disclosure controls and procedures were effective as of December 31, 2024. \n(b) Management’s Report on Internal Control over Financial Reporting \nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Rule 13a-15(f) and 15d-15(f) of the Exchange Act. Our internal control system is designed to provide reasonable assurance regarding the preparation and fair presentation of financial statements for external purposes in accordance with generally accepted accounting principles. All internal control systems, no matter how well designed, have inherent limitations and can provide only reasonable assurance that the objectives of the internal control system are met. \nUnder the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting, based on criteria established by the Committee of Sponsoring Organizations of the Treadway Commission (“COSO”) in its 2013 Internal Control-Integrated Framework. Based on our evaluation, we concluded that our internal control over financial reporting was effective as of December 31, 2024. \nOur independent registered public accounting firm, Ernst & Young LLP, has audited our Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K and have issued a report on our internal control over financial reporting as of December 31, 2024. Its report on the audit of internal control over financial reporting appears above. \n(c) Changes in Internal Control over Financial Reporting \nOur management, including our Chief Executive Officer and Chief Financial Officer, has evaluated any changes in our internal control over financial reporting during the quarter ended December 31, 2024, to identify any change that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. In August 2023, we began deploying a new enterprise resource planning system (“ERP”) as well as other related systems. We have made changes to our internal control over financial reporting to address the related processes and systems. We will continue to evaluate any further changes in our internal control over financial reporting over the course of the implementation of the new ERP and other related systems, which is scheduled to occur in phases over the next few years.\nITEM 9B.\n    \nOTHER INFORMATION\nNone of our directors or officers \nadopted\n or \nterminated\n a Rule 10b5-1 trading arrangement or a non-Rule 10b5-1 trading arrangement during the quarter ended December 31, 2024, as such terms are defined under Item 408(a) of Regulation S-K.\nITEM 9C.\n    \nDISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable. \n96\nPART III \nITEM 10.\n    \nDIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE \nThe information required by this Item concerning our directors and executive officers is incorporated by reference to the sections of our Definitive Proxy Statement to be filed with the Securities and Exchange Commission pursuant to Regulation 14A in connection with our 2025 Annual Meeting of Stockholders (the “Proxy Statement”) under the headings “The Gilead Board of Directors - Nominees,” “Committees of Our Board of Directors,” “Executive Officers,” and, if applicable, “Delinquent Section 16(a) Reports.” \nOur written Code of Ethics applies to all of our directors and employees, including our executive officers, including without limitation our principal executive officer, principal financial officer, principal accounting officer or controller or persons performing similar functions. The Code of Ethics is available on our website at www.gilead.com in the “Investors” section under “Governance - Governance Documents.” We intend to disclose future amendments to certain provisions of the Code of Ethics, and waivers of the Code of Ethics granted to executive officers and directors, on the website within four business days following the date of the amendment or waiver.\nWe have adopted policies and procedures, including an Insider Trading Policy\n, which together govern the purchase, sale, and/or other dispositions of our securities by directors, officers, employees and other covered persons, as well as by the Company. These policies and procedures are designed to promote compliance with insider trading laws, rules and regulations and any applicable listing standards. Our Insider Trading Policy is included as Exhibit 19.1 to this Annual Report on Form 10-K.\nITEM 11.\n    \nEXECUTIVE COMPENSATION \nThe information required by this Item is incorporated by reference to the sections of the Proxy Statement under the headings “Executive Compensation,” “Committees of our Board of Directors,” “Compensation and Talent Committee Report,” and “Compensation of Non-Employee Board Members.” \nITEM 12.    SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by this Item is incorporated by reference to Item 5 of our Annual Report on Form 10-K under the heading “Securities Authorized For Issuance Under Equity Compensation Plans” and the section of the Proxy Statement under the heading “Security Ownership of Certain Beneficial Owners and Management.”\nITEM 13.    CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE \nThe information required by this Item is incorporated by reference to the sections of the Proxy Statement under the headings “The Gilead Board of Directors” and “Board Processes.”\nITEM 14.\n    \nPRINCIPAL ACCOUNTANT FEES AND SERVICES \nThe information required by this Item is incorporated by reference to the section of the Proxy Statement under the heading “Principal Accountant Fees and Services.” \nPART IV \nITEM 15.\n    \nEXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n97\n(a) The following documents are filed as part of this Annual Report on Form 10-K: \n(1) Index list to Consolidated Financial Statements:\nReport of Independent Registered Public Accounting Firm (PCAOB ID: 42)\n51\nAudited Consolidated Financial Statements:\n \nConsolidated Balance Sheets\n53\nConsolidated Statements of Operations\n54\nConsolidated Statements of Comprehensive Income\n55\nConsolidated Statements of Stockholders’ Equity\n56\nConsolidated Statements of Cash Flows\n57\nNotes to Consolidated Financial Statements\n58\n(2) All other schedules are omitted because they are not required or the required information is included in the financial statements or notes thereto. \n(3) Exhibits.\nThe following exhibits are filed herewith or incorporated by reference:\nExhibit\nFootnote\nExhibit Number\nDescription of Document\n(1)\n2.1\nAgreement and Plan of Merger, dated February 11, 2024, among CymaBay Therapeutics, Inc., Registrant and Pacific Merger Sub, Inc.\n(2)\n3.1\nRestated Certificate of Incorporation of Registrant\n(3)\n3.2\nAmended and Restated Bylaws of Registrant\n4.1\nReference is made to Exhibit 3.1 and Exhibit 3.2\n(4)\n4.2\nIndenture related to Senior Notes, dated as of March 30, 2011, between Registrant and Wells Fargo, National Association, as Trustee\n(4)\n4.3\nFirst Supplemental Indenture related to Senior Notes, dated as of March 30, 2011, between Registrant and Wells Fargo, National Association, as Trustee (including form of Senior Notes)\n(5)\n4.4\nSecond Supplemental Indenture related to Senior Notes, dated as of December 13, 2011, between Registrant and Wells Fargo, National Association, as Trustee (including Form of 2041 Note)\n(6)\n4.5\nThird Supplemental Indenture related to Senior Notes, dated as of March 7, 2014, between Registrant and Wells Fargo, National Association, as Trustee (including Form of 2044 Note)\n(7)\n4.6\nFourth Supplemental Indenture related to Senior Notes, dated as of November 17, 2014, between Registrant and Wells Fargo, National Association, as Trustee (including Form of 2025 Note and Form of 2045 Note)\n(8)\n4.7\nFifth Supplemental Indenture, dated as of September 14, 2015, between Registrant and Wells Fargo Bank, National Association, as Trustee (including Form of 2026 Note, Form of 2035 Note and Form of 2046 Note)\n(9)\n4.8\nSixth Supplemental Indenture, dated as of September 20, 2016, between Registrant and Wells Fargo Bank, National Association, as Trustee (including Form of 2027 Note, Form of 2036 Note and Form of 2047 Note)\n(10)\n4.9\nEighth Supplemental Indenture, dated as of September 30, 2020, between the Registrant and Wells Fargo Bank, National Association, as Trustee (including Form of 2027 Note, Form of 2030 Note, Form of 2040 Note, and Form of 2050 Note)\n(11)\n4.10\nNinth Supplemental Indenture, dated as of September 14, 2023, between the Registrant and Computershare Trust Company, National Association, as successor to Wells Fargo Bank, National Association, as Trustee (including Form of 2033 Note and Form of 2053 Note)\n(44)\n4.11\nTenth Supplemental Indenture, dated as of November 20, 2024, between the Company and Computershare Trust Company, National Association, as successor to Wells Fargo Bank, National Association, as Trustee (including Form of 2029 Note, Form of 2035 Note, Form of 2054 Note and Form 2064 Note\n)\n(12)\n4.12\nDescription of Registrant’s Securities\n(13)\n10.1*\nGilead Sciences, Inc. 2004 Equity Incentive Plan, amended and restated May 10, 2017\n(14)\n10.2*\nAmendment No. 1 to Gilead Sciences, Inc. 2004 Equity Incentive Plan, amended and restated May 10, 2017\n(15)\n10.3*\nGilead Sciences, Inc. 2022 Equity Incentive Plan\n(16)\n10.4*\nForm of employee stock option agreement under 2004 Equity Incentive Plan (for grants made in 2011 through 2018)\n(17)\n10.5*\nForm of global employee stock option agreement under 2004 Equity Incentive Plan (for grants made in 2019)\n(18)\n10.6*\nForm of global employee stock option agreement under 2004 Equity Incentive Plan (4 year vest) (for grants made in 2019)\n(19)\n10.7*\nForm of global employee stock option agreement under 2004 Equity Incentive Plan (4 year vest) (for grants made in 2020)\n(20)\n10.8*\nForm of global employee stock option agreement under 2004 Equity Incentive Plan (4 year vest) (for grants made in 2021)\n(21)\n10.9*\nForm of global employee stock option agreement under 2004 Equity Incentive Plan (4 year vest) (for certain grants made in 2022)\n98\n(22)\n10.10*\nForm of global employee stock option agreement under 2022 Equity Incentive Plan (4 year vest) (for certain grants made in 2022)\n(23)\n10.11*\nForm of global employee stock option agreement under 2022 Equity Incentive Plan (4 year vest) (for certain grants made in 2023)\n(42)\n10.12*\nForm of global employee stock option agreement under 2022 Equity Incentive Plan (4 year vest) (for certain grants commencing in 2024)\n(24)\n10.13*\nForm of non-employee director stock option agreement under 2004 Equity Incentive Plan (for grants made in 2014 through 2018)\n(17)\n10.14*\nForm of non-employee director stock option agreement under 2004 Equity Incentive Plan (for grants made in 2019)\n(25)\n10.15*\nForm of non-employee director stock option agreement under 2004 Equity Incentive Plan (for grants made in 2020 and 2021)\n(22)\n10.16*\nForm of non-employee director stock option agreement under 2022 Equity Incentive Plan (for grants made in 2022)\n(26)\n10.17*\nForm of non-employee director stock option agreement under 2022 Equity Incentive Plan (for grants made in 2023)\n(43)\n10.18*\nForm of non-employee director stock option agreement under 2022 Equity Incentive Plan (for grants commencing in 2024)\n(19)\n10.19*\nForm of performance share award agreement - TSR Goals (U.S.) under 2004 Equity Incentive Plan (for grants made in 2020)\n(20)\n10.20*\nForm of performance share award agreement - TSR Goals (U.S.) under 2004 Equity Incentive Plan (for grants made in 2021)\n(21)\n10.21*\nForm of performance share award agreement - TSR Goals (U.S.) under 2004 Equity Incentive Plan (for grants made in 2022)\n(23)\n10.22*\nForm of performance share award agreement - TSR Goals (U.S.) under 2022 Equity Incentive Plan (for grants made in 2023)\n(42)\n10.23*\nForm of performance share award agreement - TSR Goals (U.S.) under 2022 Equity Incentive Plan (for grants commencing in 2024)\n(19)\n10.24*\nForm of performance share award agreement - Revenue Goals (U.S.) under 2004 Equity Incentive Plan (for grants made in 2020)\n(20)\n10.25*\nForm of performance share award agreement - Revenue Goals (U.S.) under 2004 Equity Incentive Plan (for grants made in 2021)\n(21)\n10.26*\nForm of performance share award agreement - Revenue Goals (U.S.) under 2004 Equity Incentive Plan (for grants made in 2022)\n(23)\n10.27*\nForm of performance share award agreement - Revenue Goals (U.S.) under 2022 Equity Incentive Plan (for grants made in 2023)\n(42)\n10.28*\nForm of performance share award agreement - Revenue Goals (U.S.) under 2022 Equity Incentive Plan (for grants commencing in 2024)\n(17)\n10.29*\nForm of global employee restricted stock unit issuance agreement under 2004 Equity Incentive Plan (for grants made in 2019)\n(18)\n10.30*\nForm of global employee restricted stock unit issuance agreement under 2004 Equity Incentive Plan (4 year vest) (for grants made in 2019)\n(19)\n10.31*\nForm of global employee restricted stock unit issuance agreement under 2004 Equity Incentive Plan (4 year vest) (for grants made in 2020)\n(20)\n10.32*\nForm of global employee restricted stock unit issuance agreement under 2004 Equity Incentive Plan (4 year vest) (for grants made in 2021)\n(21)\n10.33*\nForm of global employee restricted stock unit issuance agreement under 2004 Equity Incentive Plan (4 year vest) (for certain grants made in 2022)\n(22)\n10.34*\nForm of global employee restricted stock unit agreement under 2022 Equity Incentive Plan (4 year vest) (for certain grants made in 2022)\n(23)\n10.35*\nForm of global employee restricted stock unit agreement under 2022 Equity Incentive Plan (4 year vest) (for grants made in 2023)\n(42)\n10.36*\nForm of global employee restricted stock unit agreement under 2022 Equity Incentive Plan (4 year vest) (for grants commencing in 2024)\n(43)\n10.37*\nForm of non-employee director restricted stock unit agreement under 2022 Equity Incentive Plan (for grants commencing in 2024)\n(25)\n10.38*\nGilead Sciences, Inc. 2018 Equity Incentive Plan, amended and restated April 7, 2020\n(27) \n10.39*\nGilead Sciences, Inc. Employee Stock Purchase Plan, amended and restated January 25, 2023\n(17)\n10.40*\nGilead Sciences, Inc. 2005 Deferred Compensation Plan, amended and restated April 19, 2016\n(45)\n10.41*\nGilead Sciences, Inc. Severance Plan, amended and restated August 1, 2024\n(28)\n10.42*\nGilead Sciences, Inc. Corporate Annual Incentive Plan, amended and restated August 1, 2023\n(29)\n10.43*\nOffer Letter between Registrant and Daniel O’Day, dated November 30, 2018\n(17)\n10.44*\nStock option agreement for Daniel O’Day under 2004 Equity Incentive Plan\n(17)\n10.45*\nForm of restricted stock unit issuance agreement for Daniel O’Day (in 2019) under 2004 Equity Incentive Plan\n(17)\n10.46*\nOffer Letter between Registrant and Johanna Mercier, dated May 21, 2019\n(19)\n10.47*\nGlobal stock option agreement for Johanna Mercier (in 2019) under 2004 Equity Incentive Plan\n(19)\n10.48*\nRestricted stock unit issuance agreement for Johanna Mercier (for Performance Objectives in 2019-2020) under 2004 Equity Incentive Plan\n(19)\n10.49*\nOffer Letter between Registrant and Merdad Parsey, dated September 29, 2019\n(19)\n10.50*\nGlobal stock option agreement for Merdad Parsey (in 2019) under 2004 Equity Incentive Plan\n99\n(45)\n10.51*\nTransition Services and General Release Agreement for Merdad Parsey, dated July 16, 2024\n(23)\n10.52*\nOffer Letter between Registrant and Deborah Telman, dated June 2, 2022\n(23)\n10.53*\nGlobal stock option agreement for Deborah Telman under 2022 Equity Incentive Plan\n(23)\n10.54*\nGlobal restricted stock unit issuance agreement for Deborah Telman under 2022 Equity Incentive Plan (3 year vest)\n(23)\n10.55*\nGlobal restricted stock unit issuance agreement for Deborah Telman under 2022 Equity Incentive Plan (4 year vest)\n(30)\n10.56*\nForm of Indemnity Agreement entered into between Registrant and its directors and executive officers\n(30)\n10.57*\nForm of Employee Proprietary Information and Invention Agreement entered into between Registrant and certain of its officers and key employees\n(31)\n10.58*\nForm of Employee Proprietary Information and Invention Agreement entered into between Registrant and certain of its officers and key employees (revised September 2006)\n +(32)\n10.59*\nAmendment Agreement, dated October 25, 1993, between Registrant, the Institute of Organic Chemistry and Biochemistry (IOCB) and Rega Stichting v.z.w. (REGA), together with the following exhibits: the License Agreement, dated December 15, 1991, between Registrant, IOCB and REGA (the 1991 License Agreement); the License Agreement, dated October 15, 1992, between Registrant, IOCB and REGA (the October 1992 License Agreement); and the License Agreement, dated December 1, 1992, between Registrant, IOCB and REGA (the December 1992 License Agreement)\n +(33)\n10.60*\nAmendment Agreement between Registrant and IOCB/REGA, dated December 27, 2000, amending the 1991 License Agreement and the December 1992 License Agreement\n +(34)\n10.61\nSixth Amendment Agreement to the License Agreement, between IOCB/REGA and Registrant, dated August 18, 2006, amending the October 1992 License Agreement and the December 1992 License Agreement\n +(35)\n10.62\nSeventh Amendment Agreement to the License Agreement, between IOCB/REGA and Registrant, dated July 1, 2013, amending the October 1992 License Agreement and the December 1992 License Agreement\n +(36)\n10.63\nExclusive License Agreement by and between Registrant (as successor to Triangle Pharmaceuticals, Inc.), Glaxo Group Limited, The Wellcome Foundation Limited, Glaxo Wellcome Inc. and Emory University, dated May 6, 1999\n +(37)\n10.64\nRoyalty Sale Agreement by and among Registrant, Emory University and Investors Trust & Custodial Services (Ireland) Limited, solely in its capacity as Trustee of Royalty Pharma, dated July 18, 2005\n +(37)\n10.65\nAmended and Restated License Agreement by and between Registrant, Emory University and Investors Trust & Custodial Services (Ireland) Limited, solely in its capacity as Trustee of Royalty Pharma, dated July 21, 2005\n ++(38)\n10.66\nAmended and Restated EVG License Agreement by and between Japan Tobacco Inc. and Registrant, dated November 29, 2018\n++(38)\n10.67\nMaster Agreement by and between Registrant, Gilead Sciences K.K. and Japan Tobacco Inc., dated November 29, 2018\n +(39)\n10.68\nAmended and Restated Collaboration Agreement by and among Registrant, Gilead Sciences Ireland UC (formerly Gilead Sciences Limited) and Janssen R&D Ireland, dated December 23, 2014\n +(40)\n10.69\nLicense Agreement by and among Kite Pharma, Inc., Cabaret Biotech Ltd. and Dr. Zelig Eshhar, dated December 12, 2013\n++(18)\n10.70\nOption, License and Collaboration Agreement by and between Galapagos NV and Registrant, dated July 14, 2019\n19.1**\nInsider Trading Policy\n21.1**\nSubsidiaries of Registrant\n23.1**\nConsent of Independent Registered Public Accounting Firm\n24.1**\nPower of Attorney (included on the signature page of this report)\n31.1**\nCertification of Chief Executive Officer, as required by Rule 13a-14(a) or Rule 15d-14(a) of the Securities Exchange Act of 1934, as amended\n31.2**\nCertification of Chief Financial Officer, as required by Rule 13a-14(a) or Rule 15d-14(a) of the Securities Exchange Act of 1934, as amended\n32***\nCertifications of Chief Executive Officer and Chief Financial Officer, as required by Rule 13a-14(b) or Rule 15d-14(b) and Section 1350 of Chapter 63 of Title 18 of the United States Code (18 U.S.C. §1350)\n(41)\n97.1\nGilead Sciences, Inc. Compensation Recovery Policy\n101.INS**\nXBRL Instance Document - The instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document\n101.SCH**\nInline XBRL Taxonomy Extension Schema Document\n101.CAL**\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF**\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB**\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE**\nInline XBRL Taxonomy Extension Presentation Linkbase Document\n104\nCover Page Interactive Data File, formatted in Inline XBRL (included as Exhibit 101)\n100\n(1)    Filed as an exhibit to Registrant’s Current Report on Form 8-K filed on February 12, 2024, and incorporated herein by reference.\n(2)    Filed as an exhibit to Registrant’s Current Report on Form 8-K filed on May 9, 2024, and incorporated herein by reference.\n(3)    Filed as an exhibit to Registrant’s Current Report on Form 8-K filed on February 6, 2023, and incorporated herein by reference.\n(4)    Filed as an exhibit to Registrant’s Current Report on Form 8-K filed on April 1, 2011, and incorporated herein by reference.\n(5)    Filed as an exhibit to Registrant’s Current Report on Form 8-K filed on December 13, 2011, and incorporated herein by reference.\n(6)    Filed as an exhibit to Registrant’s Current Report on Form 8-K filed on March 7, 2014, and incorporated herein by reference.\n(7)    Filed as an exhibit to Registrant’s Current Report on Form 8-K filed on November 17, 2014, and incorporated herein by reference.\n(8)    Filed as an exhibit to Registrant’s Current Report on Form 8-K filed on September 14, 2015, and incorporated herein by reference.\n(9)    Filed as an exhibit to Registrant’s Current Report on Form 8-K filed on September 20, 2016, and incorporated herein by reference.\n(10)    Filed as an exhibit to Registrant’s Current Report on Form 8-K filed on September 30, 2020, and incorporated herein by reference.\n(11)    Filed as an exhibit to Registrant’s Current Report on Form 8-K filed on September 14, 2023, and incorporated herein by reference.\n(12)    Filed as an exhibit to Registrant’s Annual Report on Form 10-K for the fiscal year ended December 31, 2019, and incorporated herein by reference.\n(13)    Filed as an exhibit to Registrant’s Current Report on Form 8-K filed on May 12, 2017, and incorporated herein by reference.\n(14)    Filed as an exhibit to Registrant’s Annual Report on Form 10-K for the fiscal year ended December 31, 2020, and incorporated herein by reference.\n(15)    Filed as an exhibit to Registrant’s Current Report on Form 8-K filed on May 5, 2022, and incorporated herein by reference.\n(16)    Filed as an exhibit to Registrant’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2011, and incorporated herein by reference.\n(17)    Filed as an exhibit to Registrant’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2019, and incorporated herein by reference.\n(18)    Filed as an exhibit to Registrant’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2019, and incorporated herein by reference.\n(19)    Filed as an exhibit to Registrant’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2020, and incorporated herein by reference.\n(20)    Filed as an exhibit to Registrant’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2021, and incorporated herein by reference.\n(21)    Filed as an exhibit to Registrant’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2022, and incorporated herein by reference.\n(22)    Filed as an exhibit to Registrant’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2022, and incorporated herein by reference.\n(23)    Filed as an exhibit to Registrant’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2023, and incorporated herein by reference.\n(24)    Filed as an exhibit to Registrant’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2014, and incorporated herein by reference.\n(25)    Filed as an exhibit to Registrant’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2020, and incorporated herein by reference.\n(26)    Filed as an exhibit to Registrant’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2023, and incorporated herein by reference.\n(27)    Filed as an exhibit to Registrant’s Current Report on Form 8-K filed on May 5, 2023, and incorporated herein by reference.\n(28)    Filed as an exhibit to Registrant’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2023, and incorporated herein by reference.\n(29)    Filed as an exhibit to Registrant’s Current Report on Form 8-K filed on December 10, 2018, and incorporated herein by reference.\n(30)    Filed as an exhibit to Registrant’s Registration Statement on Form S-1 (No. 33-55680), as amended, and incorporated herein by reference.\n(31)    Filed as an exhibit to Registrant’s Annual Report on Form 10-K for the fiscal year ended December 31, 2006, and incorporated herein by reference.\n(32)    Filed as an exhibit to Registrant’s Annual Report on Form 10-K for the fiscal year ended March 31, 1994, and incorporated herein by reference.\n(33)    Filed as an exhibit to Registrant’s Annual Report on Form 10-K for the fiscal year ended December 31, 2000, and incorporated herein by reference.\n(34)    Filed as an exhibit to Registrant’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2006, and incorporated herein by reference.\n(35)    Filed as an exhibit to Registrant’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2013, and incorporated herein by reference.\n(36)    Filed as an exhibit to Triangle Pharmaceuticals, Inc.’s Quarterly Report on Form 10-Q/A filed on November 3, 1999, and incorporated herein by reference.\n(37)    Filed as an exhibit to Registrant’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2005, and incorporated herein by reference.\n(38)    Filed as an exhibit to Registrant’s Amendment No. 1 to Annual Report on Form 10-K/A filed on April 18, 2019, and incorporated herein by reference.\n(39)    Filed as an exhibit to Registrant’s Annual Report on Form 10-K for the fiscal year ended December 31, 2014, and incorporated herein by reference.\n(40)    Filed as an exhibit to Kite Pharma, Inc.’s Registration Statement on Form S-1/A (No. 333-196081) filed on June 17, 2014, and incorporated herein by reference.\n(41)    Filed as an exhibit to Registrant’s Annual Report on Form 10-K for the fiscal year ended December 31, 2023, and incorporated herein by reference.\n(42)    Filed as an exhibit to Registrant’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2024, and incorporated herein by reference.\n(43)    Filed as an exhibit to Registrant’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2024, and incorporated herein by reference.\n(44)    Filed as an exhibit to Registrant’s Current Report on Form 8-K filed on November 20, 2024, and incorporated herein by reference.\n(45)    Filed as an exhibit to Registrant’s Quarterly Report on Form 10-Q for the quarter ended September 30, 2024, and incorporated herein by reference.\n*    Management contract or compensatory plan or arrangement.\n**    Filed herewith.\n***    Furnished herewith.\n+    Certain confidential portions of this Exhibit were omitted by means of marking such portions with an asterisk (the Mark). This Exhibit has been filed separately with the Secretary of the Securities and Exchange Commission without the Mark pursuant to Registrant’s Application Requesting Confidential Treatment under Rule 24b-2 under the Securities Exchange Act of 1934, as amended.\n++    Certain portions of this Exhibit were omitted by means of marking such portions with the Mark because the identified portions are (i) private or confidential and (ii) not material.\nITEM 16.    FORM 10-K SUMMARY\nNone. \n101\nSIGNATURES \nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized. \nGILEAD SCIENCES, INC.\nBy:\n/s/    DANIEL P. O’DAY\n \nDaniel P. O\n’\nDay\nChairman and Chief Executive Officer\nDate:\nFebruary 28, 2025\nPOWER OF ATTORNEY \nKNOW ALL PERSONS BY THESE PRESENTS, that each person whose signature appears below constitutes and appoints Daniel P. O’Day and Deborah H. Telman, and each of them, as his or her true and lawful attorneys-in-fact and agents, with full power of substitution and resubstitution, for him or her and in his or her name, place, and stead, in any and all capacities, to sign any and all amendments to this Report, and to file the same, with all exhibits thereto, and other documents in connection therewith, with the Securities and Exchange Commission, granting unto said attorneys-in-fact and agents, and each of them, full power and authority to do and perform each and every act and thing requisite and necessary to be done in connection therewith, as fully to all intents and purposes as he or she might or could do in person, hereby ratifying and confirming that all said attorneys-in-fact and agents, or any of them or their or his or her substitute or substitutes, may lawfully do or cause to be done by virtue hereof. \nPursuant to the requirements of the Securities Exchange Act of 1934, as amended, this Report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\n102\nSignature\nTitle\nDate\n/s/    DANIEL P. O’DAY\nChairman and Chief Executive Officer\nFebruary 28, 2025\nDaniel P. O’Day\n(Principal Executive Officer)\n/s/    ANDREW D. DICKINSON\nChief Financial Officer\nFebruary 28, 2025\nAndrew D. Dickinson\n(Principal Financial Officer)\n/s/    SANDRA PATTERSON\nSenior Vice President, Corporate Controller and CAO\nFebruary 28, 2025\nSandra Patterson\n(Principal Accounting Officer)\n/s/   JACQUELINE K. BARTON\nDirector\nFebruary 28, 2025\nJacqueline K. Barton, Ph.D.\n/s/   JEFFREY A. BLUESTONE\nDirector\nFebruary 28, 2025\nJeffrey A. Bluestone, Ph.D.\n/s/   SANDRA J. HORNING\nDirector\nFebruary 28, 2025\nSandra J. Horning, M.D.\n/s/   KELLY A. KRAMER\nDirector\nFebruary 28, 2025\nKelly A. Kramer\n/s/    TED W. LOVE\nDirector\nFebruary 28, 2025\nTed W. Love, M.D.\n/s/    HARISH MANWANI\nDirector\nFebruary 28, 2025\nHarish Manwani\n/s/    JAVIER J. RODRIGUEZ\nDirector\nFebruary 28, 2025\nJavier J. Rodriguez\n/s/    ANTHONY WELTERS\nDirector\nFebruary 28, 2025\nAnthony Welters\n103"
  }
}