{
  "ticker": "GL",
  "cik": "0000320335",
  "company_name": "GLOBE LIFE INC.",
  "filing_date": "2025-02-26",
  "accession": "0000320335-25-000013",
  "primary_doc": "gl-20241231.htm",
  "item_sections": {
    "item1": "Item 1. Business \nGlobe Life and the Company refer to Globe Life Inc., an insurance holding company incorporated in Delaware in 1979, and its subsidiaries and affiliates. Its primary subsidiaries are Globe Life And Accident Insurance Company, American Income Life Insurance Company, Liberty National Life Insurance Company, Family Heritage Life Insurance Company of America, and United American Insurance Company.\nGlobe Life's website is: www.globelifeinsurance.com. Globe Life makes available free of charge through its website, its annual report on Form 10-K, its quarterly reports on Form 10-Q, current reports on Form 8-K, and amendments to those reports as soon as reasonably practicable after they have been electronically filed with or furnished to the Securities and Exchange Commission. Other information included in Globe Life's website is not incorporated into this filing.\n \n1\nGL 2024 FORM 10-K\nTable of \nContents\nThe following table presents Globe Life's business by primary marketing distribution channel. Additional information concerning industry segments may be found in \nManagement’s Discussion and Analysis\n and in \nNote 15—Business Segments\n within the \nNotes to the Consolidated Financial Statements\n. \nPrimary Distribution Method\nUnderwriting Company\nProducts and Target Markets\nDistribution\nDirect to Consumer Division\nGlobe Life And Accident Insurance Company\nMcKinney, Texas\nIndividual life and supplemental health limited-benefit insurance including juvenile and senior life coverage and Medicare Supplement to lower middle-income to middle-income Americans.\nNationwide distribution through direct to consumer channels: including direct mail, electronic media, and insert media.\nAmerican Income Life Division\nAmerican Income Life Insurance Company\nWaco, Texas\nIndividual life and supplemental health limited-benefit insurance marketed to working families.\n11,741 average producing agents in the U.S., Canada, and New Zealand.\nLiberty National Division\nLiberty National Life Insurance Company\nMcKinney, Texas\nLife and supplemental health limited-benefit insurance distributed through in-home and worksite channels.\n3,664 average producing agents in the U.S.\nFamily Heritage Division\nFamily Heritage Life Insurance Company of America\nCleveland, Ohio\nSupplemental limited-benefit health insurance to lower middle-income to middle-income families.\n1,399 average producing agents in the U.S.\nUnited American Division\nUnited American Insurance Company\nMcKinney, Texas\nSupplemental health Medicare coverage to beneficiaries and, to a lesser extent, supplemental limited-benefit coverage to people under age 65.\n3,355 independent producing agents in the U.S.\n2\n   GL 2024 FORM 10-K\nTable of \nContents\nInsurance\nLife Insurance\n—The distribution channels for life insurance products include direct to consumer, exclusive agents, and independent agents. These methods are described in greater detail within the primary marketing distribution channel chart as shown above. The following table presents annualized premium in force for the three years ended December 31, 2024 by distribution method:\n \nAnnualized Premium in Force\n(1)\n(Dollar amounts in thousands)\n2024\n2023\n2022\nDirect to Consumer\n \n$\n922,508 \n$\n933,057 \n$\n936,507 \nExclusive agents:\nAmerican Income\n1,761,713 \n1,654,197 \n1,553,003 \nLiberty National\n410,912 \n390,693 \n360,963 \nIndependent agents:\nUnited American\n6,499 \n6,958 \n7,609 \nOther\n197,629 \n200,840 \n203,438 \n$\n3,299,261 \n$\n3,185,745 \n$\n3,061,520 \n(1)\nSee definition of annualized premium in force under \nResults of Operations\n \ni\nn\n Management's Discussion & Analysis\n.\nGlobe Life's insurance subsidiaries write a variety of nonparticipating ordinary life insurance products. These include traditional whole life, term life, and other life insurance. The Company does not currently sell interest-sensitive whole life products. The following tables present selected information about Globe Life's life insurance products.\nAnnualized Premium in Force\n(Dollar amounts in thousands)\n \n2024\n2023\n2022\nAmount\n% of\nTotal\nAmount\n% of\nTotal\nAmount  \n% of\nTotal\nWhole life:\nTraditional\n$\n2,321,947 \n70 \n$\n2,213,816 \n69 \n$\n2,106,878 \n69 \nInterest-sensitive\n28,105 \n1 \n29,929 \n1 \n31,838 \n1 \nTerm\n \n745,231 \n23 \n753,261 \n24 \n756,471 \n25 \nOther\n \n203,978 \n6 \n188,739 \n6 \n166,333 \n5 \n$\n3,299,261 \n100 \n$\n3,185,745 \n100 \n$\n3,061,520 \n100 \nPolicy Count and Average Face Amount Per Policy\n(Dollar amounts in thousands)\n2024\n2023\n2022\nPolicy Count\nAverage Face Amount per Policy\nPolicy Count\nAverage Face Amount per Policy\nPolicy Count\nAverage Face Amount per Policy\nWhole life:\nTraditional\n9,092,122 \n$\n16.2 \n9,050,091 \n$\n16.0 \n9,011,227 \n$\n15.7 \nInterest-sensitive\n169,054 \n20.4 \n176,339 \n20.4 \n183,887 \n20.4 \nTerm\n \n4,600,839 \n15.2 \n4,680,364 \n15.1 \n4,720,870 \n15.3 \nOther\n \n495,894 \n18.1 \n479,664 \n17.3 \n453,515 \n16.1 \n14,357,909 \n$\n16.0 \n14,386,458 \n$\n15.8 \n14,369,499 \n$\n15.6 \n3\n   GL 2024 FORM 10-K\nTable of \nContents\nHealth Insurance\n—The following table presents Globe Life's health insurance annualized premium in force for the three years ended December 31, 2024 by distribution channel.\n \nAnnualized Premium in Force\n(Dollar amounts in thousands)\n2024\n2023\n2022\nDirect to Consumer\n \n$\n74,815 \n$\n70,249 \n$\n72,161 \nExclusive agents:\nLiberty National\n201,874 \n200,160 \n196,336 \nAmerican Income\n119,986 \n116,962 \n113,087 \nFamily Heritage\n454,725 \n418,693 \n387,897 \nIndependent agents:\nUnited American\n624,446 \n579,237 \n558,373 \n$\n1,475,846 \n$\n1,385,301 \n$\n1,327,854 \nGlobe Life offers Medicare Supplement and limited-benefit supplemental health insurance products that include accident, cancer, critical illness, heart, intensive care, and other health products. These products are designed to supplement health coverage that applicants already own. Medicare Supplements are offered to enrollees in the traditional fee-for-service Medicare program. Medicare Supplement plans are standardized by federal regulation and are designed to pay deductibles and co-payments not paid by Medicare. \nThe following table presents supplemental health annualized premium in force information for the three years ended December 31, 2024 by product category.\n \nAnnualized Premium in Force\n(Dollar amounts in thousands)\n2024\n2023\n2022\nAmount\n% of\nTotal\nAmount\n% of\nTotal\nAmount\n% of\nTotal\nLimited-benefit plans\n$\n824,844 \n56 \n$\n782,424 \n56 \n$\n735,858 \n55 \nMedicare Supplement\n651,002 \n44 \n602,877 \n44 \n591,996 \n45 \n$\n1,475,846 \n100 \n$\n1,385,301 \n100 \n$\n1,327,854 \n100 \nPricing\n—Premium rates for life and health insurance products are established using assumptions as to future mortality, morbidity, persistency, investment income, expenses, and target profit margins. These assumptions are based on Company experience and projected investment earnings rates. Revenues for individual life and health insurance products are primarily derived from premium income, and, to a lesser extent, through policy charges to the policyholder account values on annuity products and certain individual life products. Profitability is affected by actual experience deviations from the established assumptions and to the extent investment income varies from that required for policy reserves.\n \nCollections for certain life products are not recognized as revenues, but are added to policyholder account values. Revenues from these products are derived from charges to the account balances for insurance risk and administrative costs. Profits are earned to the extent these revenues exceed actual costs. Profits are also earned from investment income in excess of the amounts required for policy reserves.\nUnderwriting\n—The underwriting standards of Globe Life's insurance subsidiaries are established by management. Each subsidiary uses information obtained from the application, and in some cases additional information such as, telephone interviews with applicants, inspection reports, pharmacy data, motor vehicle records, responses to both medical and non-medical questions, doctors’ statements and/or medical records and examinations. This information is used to determine whether a policy should be issued in accordance with the application, with a different rating, with a rider, with reduced coverage, or rejected.\nReserves\n—The life insurance policy reserves reflected in Globe Life's consolidated financial statements as future policy benefits are calculated based on accounting principles generally accepted in the United States of America (GAAP). These reserves, with future premiums and the associated interest compounded at assumed rates, are expected to be sufficient to cover policy and contract obligations as they mature. Generally, the mortality and lapse \n4\n   GL 2024 FORM 10-K\nTable of \nContents\nassumptions used in the calculations of reserves are based on Company experience. Similar reserves are held on most of the health insurance policies written by Globe Life's insurance subsidiaries, since these policies generally are issued on a guaranteed-renewable basis. The assumptions used in the calculation of Globe Life's reserves are reported in \nNote 1—Significant Accounting Policies\n.\n Reserves for certain life products consist of the policyholders’ account values and are increased by policyholder deposits and interest credited and are decreased by policy charges and benefit payments.\nReinsurance\n—Globe Life has historically participated in third-party reinsurance. See \nSchedule IV\n, \nNote 1—Significant Accounting Policies\n, \nNote 5—Commitments and Contingencies\n, \nNote 6—Policy Liabilities\n, \nand\n \nNote 8—Liability for Unpaid Claims\n \n for more information.\nInvestments\n—The nature, quality, and percentage mix of insurance company investments are regulated by state laws. The investments of Globe Life insurance subsidiaries consist predominantly of high-quality, investment-grade securities. Approximately 88% of our invested assets, at fair value, are fixed maturities at December 31, 2024 (see \nNote 4—Investments\n and \nManagement’s Discussion and Analysis\n).\nCompetition\n—Globe Life competes with other life and health insurance carriers through policyholder service, price, product design, and sales efforts. While there are insurance companies competing with Globe Life, no individual company dominates any of Globe Life's life or health insurance markets.\n \nGlobe Life's health insurance products compete with, in addition to the products of other health insurance carriers, health maintenance organizations, preferred provider organizations, and other health care-related institutions which provide medical benefits based on contractual agreements.\n \nThe Company effectively competes with other carriers, in part, due to its ability to operate at lower policy acquisition and administrative expense levels than peer companies. This allows Globe Life to have competitive rates while maintaining higher underwriting margins.\nRegulation\nInsurance\n—Insurance companies are subject to regulation and supervision in the states in which they do business. The laws of the various states establish agencies with broad administrative and supervisory powers which include, among other things, granting and revoking licenses to transact business, regulating trade practices, licensing agents, approving policy forms, approving certain premium rates, setting minimum reserve and loss ratio requirements, determining the form and content of required financial statements, and prescribing the type and amount of investments permitted. Insurance companies are also required to file detailed annual reports with supervisory agencies, and records of their business are subject to examination at any time. Under the rules of the National Association of Insurance Commissioners (NAIC), insurance companies are examined periodically by one or more of the supervisory agencies.\nRisk-Based Capital (RBC)\n—The NAIC requires that a risk-based capital formula be applied to all life and health insurers. The risk-based capital formula is a threshold formula rather than a target capital formula. It is designed only to identify companies that require regulatory attention and is not to be used to rate or rank companies that are adequately capitalized. All Globe Life's insurance subsidiaries are more than adequately capitalized under the risk-based capital formula. See further discussion of RBC in \nCapital Resources\n.\nHolding Company\n—States have enacted legislation requiring registration and periodic reporting by insurance companies domiciled within their respective jurisdictions that control or are controlled by other corporations so as to constitute a holding company system. Globe Life Inc. and its subsidiaries have registered as a holding company system pursuant to such legislation in Indiana, Nebraska, Ohio, Texas, and New York.\nInsurance holding company system statutes and regulations impose various limitations on investments in subsidiaries, and may require prior regulatory approval for material transactions between insurers and affiliates and for the payment of certain dividends and other distributions.\n5\n   GL 2024 FORM 10-K\nTable of \nContents\nSustainable Business Practices\nGlobe Life’s sustainable business practices are a driver of the success and longevity that our Company has experienced since its origin. We plan to advance our sustainable business practices by further developing the Company's sustainability strategy and have substantially aligned disclosures with the Sustainability Accounting Standards Board (SASB) standards and the Task Force on Climate-related Financial Disclosures (TCFD) recommendations. \nEnvironmental responsibility and sustainability are key components of our overall corporate responsibility efforts. We strive to reduce our impact on the environment by placing a company-wide emphasis on recycling and reducing waste at our corporate facilities, focusing on efforts to reduce the use of paper and water. With respect to social matters, our focus continues to be on supporting a culture that is inclusive and attractive for all of our employees and independent sales agents. We are committed to maintaining a diverse workforce that reflects the communities in which we work. In addition, to enable the Company to appropriately respond to related challenges and opportunities, the Company has in place a Sustainability Committee, and the Board and its committees regularly engage with senior management on relevant and related issues. \nHuman Capital Management\nGlobe Life's talent base encompasses a broad range of experience that possesses the depth of critical skills to efficiently and effectively accomplish our business purpose and mission, serve our policyholders, and protect our shareholders' interests. Maintaining superior human capital is a key driver to the success and longevity that our Company has experienced since its origins dating back to the early 1900s. As of December 31, 2024, the Company had 3,732 full-time, part-time, and temporary employees, a 3% increase over the prior year. The increase in headcount in 2024 was primarily to support the increased growth in recent periods, as well as lower attrition levels than normal. The Company engages over 16,400 independently-contracted insurance agents. Refer to Management's Discussion & Analysis for exclusive agent counts.\nPeople, Culture, and Community\nAt Globe Life, we are united by our mission to—\nMake Tomorrow Better\n1\n \nand this starts with our employees and agents. Beyond providing insurance protection for millions of individuals, serving our policyholders and generating financial results for our shareholders, we focus on cultivating a healthy, positive culture and a thriving community within and among our campuses that is inclusive of and attractive for all. Globe Life promotes a diverse and inclusive work force to better enable our employees to consistently achieve outstanding individual and collective results. Our commitment to diversity starts at the top; of the 9 independent Board members, 56% are women and 33% are racial/ethnic minorities as of December 31, 2024. \nAs of December 31, 2024 and 2023, the Globe Life employees, (excluding independently-contracted agents) identify as follows:\n2024\nEthnicity/Race\nGender\nGenerations\nWhite\n51 \n%\nFemale\n68 \n%\nBaby Boomers (1946-1964)\n14 \n%\nBlack or African American\n25 \nMale\n32 \nGen X (1965-1977)\n29 \nHispanic or Latino\n13 \nMillennials (1978-1995)\n44 \nAsian\n9 \nGen Z (1996-2012)\n13 \nAmerican Indian or Alaskan Native\n1 \nNative Hawaiian or Pacific Islander\n— \nOther or Not Specified\n1 \nTotal\n100 \n%\n100 \n%\n100 \n%\n1\nPer the Globe Life Employee Handbook, the Globe Life mission statement is \"We help families \nMake Tomorrow Better\n by working to protect their financial future.\"\n6\n   GL 2024 FORM 10-K\nTable of \nContents\n2023\nEthnicity/Race\nGender\nGenerations\nWhite\n52 \n%\nFemale\n68 \n%\nBaby Boomers (1946-1964)\n16 \n%\nBlack or African American\n24 \nMale\n32 \nGen X (1965-1977)\n29 \nHispanic or Latino\n13 \nMillennials (1978-1995)\n45 \nAsian\n9 \nGen Z (1996-2012)\n10 \nAmerican Indian or Alaskan Native\n1 \nNative Hawaiian or Pacific Islander\n— \nOther or Not Specified\n1 \nTotal\n100 \n%\n100 \n%\n100 \n%\nWe conduct a confidential survey biennially to give our employees the opportunity to provide candid feedback about their experiences at the Company, including but not limited to, confidence in the Company and leadership, competitiveness of our compensation and benefit package, and departmental relationships. The results are shared with our employees, reviewed by senior leadership, and used to identify areas for improvement and create action plans based on the employee feedback received.\nWe strive to\n Make Tomorrow Bette\nr, in part by giving financial and service contributions to programs that provide hands-on assistance in the communities where we live, work, serve, and visit. We focus our charitable giving on organizations that support children, families, veterans, and seniors, as well as those that work to ensure people are able to live full, healthy lives. These categories align with our mission to help families \nMake Tomorrow Better\n by working to protect their financial future. In 2024, we provided financial support of more than $7 million to organizations within that focus, including charities that support underserved communities, provide scholarships to youth, and advance equity and diversity efforts. \nTalent Development\nAt Globe Life, we believe investing in our employees through training and development is paramount to their success. We have developed a learning ecosystem that includes a multitude of professional development opportunities, including online, self-directed, and instructor-led courses on a variety of topics. An education assistance program is also offered to facilitate growth in an area related to one's current position with the Company. \nHealth, Safety, and Wellness \nWe strive to provide a safe and healthy work environment for every employee. We furnish employees with numerous tools and trainings throughout the year to help ensure they have, at their fingertips, the best information to safely engage with co-workers, customers, and third parties. In furtherance of our commitment to our employees, we offer a comprehensive employee benefits package that includes competitive monetary benefits, retirement benefits through a Section 401(k) plan and a qualified pension to eligible employees, fitness center reimbursement, paid-time-off (based on years of service), health insurance, dental and vision insurance, employee resource program, health savings and flexible spending accounts, family leave, and tuition assistance.\nThe Company remains committed to the well-being and safety of its employees, agents, customers, guests, vendors, and shareholders in our resolve to maintain a stable and secure business environment. \n7\n   GL 2024 FORM 10-K\nTable of \nContents",
    "item1a": "Item 1A. Risk Factors\n, General Risk Factors, “The failure to maintain effective and efficient information systems at the Company could adversely affect our financial condition and results of operations.”\nGovernance\nOur Board of Directors considers information security to be an enterprise-wide risk management issue and oversees material cybersecurity risks through the \nAudit Committee\n. The Audit Committee is designated with the responsibility to monitor and periodically report to the full Board regarding management’s risk management and information security processes. The ERM Committee and the Operational Risk Committee (“ORC”) are the senior management-level entities designated with the responsibility to oversee the execution of our risk strategy, including as it relates to cyber risk. These Committees are composed of an enterprise-wide representative group of the Company’s Executive and Senior Vice Presidents, as well as other essential directors and personnel. The ERM Committee is chaired by our CRO, and the ORC is chaired by our Chief Security Officer (“CSO”). The Chief Information Officer (“CIO”) and CISO serve on both Committees.\n \nOur CRO has over a decade of experience managing risks at the Company, including risks from cybersecurity threats. Our current CIO has over 15 years of experience managing risks, including risks from cybersecurity threats. Our current CSO has a Certified Information Systems Security Professional certification, a Certified Information Systems Auditor certification, a Certified in Risk and Information Systems Control certification, and over 20 years of experience in cybersecurity. The CISO serves on both Committees and leads cyber governance and strategy, as well as cyber risk and incident management. The current CISO holds a master’s degree in cybersecurity, has a Certified Information Systems Security Professional certification, and has over a decade of experience in cybersecurity.\n \nThe \nCISO\n assesses cyber risk and provides recommendations for management decision(s) by the ORC on a routine basis. The CISO briefs the Audit Committee on a quarterly basis. These updates include compliance measures designed to meet applicable regulations as well as current or planned changes to the regulations, an overview of the current cyber threats, risk management activities, and discussions of cyber incident investigations that warrant the attention of the Board. The CISO also provides an annual update to the entire Board of Directors on topics such as changes in cybersecurity, top threats facing the Company, key risks and mitigation efforts, and any potential material cybersecurity incidents. The Chair of the Audit Committee also provides a quarterly report to the Board on any information security topics presented to the Audit Committee by management.\nIncident Management\nThe Company maintains and tests a cybersecurity incident response plan that outlines steps for the containment, investigation of, response to and recovery from cyber events. The plan also includes information pertaining to roles and responsibilities, escalation, third-party support, documentation, reporting, and law enforcement engagement. Escalation is designed to raise awareness of events that may require disclosure to help ensure assessments are performed without unreasonable delay. In alignment with our plan, we maintain playbooks that outline processes for responding to certain incidents commonly observed in the insurance industry. In addition, we have implemented a formal crisis management process, which outlines an incident response communication plan with executive leadership as well as criteria for communication with the chair of the Audit Committee and the Lead Director of the Board.\n17\n   GL 2024 FORM 10-K\nTable of \nContents",
    "item1b": "Item 1B. Unresolved Staff Comments \n \nAs of December 31, 2024, Globe Life had no unresolved SEC staff comments.",
    "item1c": "Item 1C. Cybersecurity \nRisk Management and Strategy\nWe have implemented a comprehensive Enterprise Risk Management (“ERM”) process to identify, assess and manage risks related to our overall organization, including material risks from cybersecurity threats. Our ERM process takes a holistic view of our specific risks and our strategy to anticipate and manage possible risks. Our Executive Vice President, General Counsel and Chief Risk Officer (“CRO”) oversees our ERM program and execution of our risk strategy, including as it relates to cyber risk. The Chief Information Security Officer (\"CISO\"), who reports to the General Counsel and CRO, leads our cyber risk management and strategy and the Information Security Department.\nOur cyber risk management and information security strategy includes elements to identify threats, assess risks, implement protective controls, detect attempts from threat actors to compromise the confidentiality, integrity, and availability of information and information systems, respond to those events and ultimately recover from incidents. We use a threat-based approach to identify and assess cyber risks.\n This approach includes membership in threat intelligence organizations such as the FS-ISAC (Financial Services Information Sharing and Analysis Center) to identify standard and emerging cyber-threats to financial services organizations and specifically to insurance companies. We also monitor for threats through vendor alerts, manufacturer bulletins, and government advisories. \nIdentified threats are analyzed using a recognized risk assessment model to consistently assess the likelihood and impact of these threats. We then map these threats to a well-established industry model called MITRE ATT&CK to identify areas of vulnerability. This analysis produces a likelihood score that is used in conjunction with an impact analysis to calculate the preliminary level of risk. The impact analysis includes factors such as disruption to business operations, employee and customer data, legal issues, reputational harm, and regulatory compliance. Based on the preliminary level of risk, we also analyze compensating controls and other factors to arrive at a residual risk level. If appropriate, additional mitigations may be planned based on this risk level.\nWe manage identified cyber risks by designing and implementing information security policies and controls addressing a wide range of current cyber threats. These policies and associated standards are designed to comply with current applicable legal and regulatory requirements and align with recognized frameworks for cybersecurity risk management. We review and update these policies and controls regularly in order to confirm ongoing alignment with the constantly changing threat landscape and evolving compliance requirements.  \nWe assess the effectiveness of our corporate policies and controls internally, as well as through the engagement of external advisors to conduct regular reviews, penetration tests, and vulnerability scans of Company information systems and applications. Results from these assessments help inform updates to risk assessments, changes to security controls and processes, and updates to policies and standards as appropriate. We employ a variety of internal measures to detect, prevent, and reduce the frequency and severity of cybersecurity incidents on the Company’s infrastructure, which may include, but are not limited to, the use of encryption, intrusion prevention, endpoint security, password protection, multi-factor authentication, internal phishing testing, security awareness training, and vulnerability scanning and penetration testing.\n \nIn addition, cybersecurity is \nincorporated\n into our third-party risk management program.  We assess the ability of our  vendors as appropriate to adequately protect information, which includes requiring agreements that address cybersecurity. We periodically review and assess vendors’ adherence to these agreements and review for information security (including cybersecurity) incidents experienced by our third-party vendors. With respect to our independent sales agents, we require each agent to execute an agent agreement containing terms governing the ownership, use and confidentiality of policyholder and proprietary information.  We also engage with agency offices to support their use of measures and safeguards to protect information.\nDue to the type and volume of information that we collect and store to support our business, including to provide insurance coverage to prospective, current and former policyholders, we are an attractive target for cyber threat actors seeking financial gain. Our failure to maintain the safety of our policyholder’s information could have a \n16\n   GL 2024 FORM 10-K\nTable of \nContents\nmaterial adverse effect on our reputation, financial condition and results of operations. \nTo date, we have not experienced a cybersecurity incident that resulted in a material adverse effect on our business strategy, results of operations, or financial condition; however, we anticipate that our systems and data will continue to face attacks or other cybersecurity risks and there can be no guarantee that we will not experience such an incident in the future.\n Although we maintain cybersecurity insurance, the costs and expenses related to cybersecurity incidents may not be fully insured. We describe whether and how risks from identified cybersecurity threats, including as a result of previous cybersecurity incidents, have materially affected or are reasonably likely to materially affect us, including our business strategy, results of operations, or financial condition under"
  }
}