{
  "ticker": "GLW",
  "cik": "0000024741",
  "company_name": "CORNING INC /NY",
  "filing_date": "2025-02-13",
  "accession": "0001628280-25-005347",
  "primary_doc": "glw-20241231.htm",
  "item_sections": {
    "item1": "Item 1. Business\nGeneral\nCorning traces its origins to a glass business established in 1851. The present corporation was incorporated in the State of New York in December 1936. The Company’s name was changed from Corning Glass Works to Corning Incorporated on April 28, 1989.\nCorning is vital to progress – in the industries we help advance and in the world we share. For more than 170 years, Corning has combined its unparalleled expertise in glass science, ceramic science and optical physics with deep manufacturing and engineering capabilities to develop category-defining products that transform industries and enhance people’s lives. Our materials science and manufacturing expertise, boundless curiosity and commitment to purposeful invention place us at the center of the way the world works, learns and lives. In addition, our sustained investment in research, development and engineering capabilities means we are always ready to solve the toughest challenges alongside our customers.\nOur capabilities are versatile and synergistic, allowing Corning to evolve to meet changing market needs, while also helping customers capture new opportunities in dynamic industries. Today, Corning’s markets include optical communications, mobile consumer electronics, display, automotive, solar, semiconductor and life sciences. Corning’s industry-leading products include damage-resistant cover materials for mobile devices; precision glass for advanced displays; optical fiber, cable and connectivity solutions for advanced communications networks, such as fiber to the home and data centers, enabling artificial intelligence and connections around the world; trusted products to accelerate drug discovery and delivery; and clean-air technologies and technical glass for cars and trucks.\nCorning manufactures products at 124 plants in 15 countries and operates in five reportable segments: Optical Communications, Display Technologies, Specialty Materials, Environmental Technologies and Life Sciences.\nOptical Communications Segment\nWe invented the world’s first low-loss optical fiber in 1970. Since that milestone, we have continued to pioneer optical fiber, cable and connectivity solutions. As global demand driven by video usage grows exponentially, telecommunications networks continue to migrate from copper to optical-based systems that can deliver the required cost-effective capacity. Additionally, the rapid acceleration of artificial intelligence (“AI”) is driving strong demand for fiber and connectivity products inside and between data centers. Our experience puts us in a unique position to design and deliver optical solutions that reach every edge of the communications network. \nThe Optical Communications segment is divided into two main product groupings – carrier network and enterprise network. The carrier network group consists primarily of products and solutions for optical-based communications infrastructure for services such as video, data and voice communications. The enterprise network group consists primarily of optical-based communication networks sold to businesses, governments and individuals for their own use. \nOur carrier network product portfolio encompasses an array of optical fiber products, including Vascade® optical fibers for use in submarine networks; LEAF® optical fiber for long-haul, regional and metropolitan networks; SMF-28® ULL and TXF® fiber for more scalable long-haul and regional networks; SMF-28e+™ single-mode optical fiber providing additional transmission wavelengths in metropolitan and access networks and ClearCurve® ultra-bendable single-mode fiber for use in multiple-dwelling units and fiber-to-the-home applications. For high performance across the range of long-haul, metro, access and fiber-to-the-home network applications, SMF-28® Ultra and SMF-28® Contour fibers deliver industry-leading attenuation, compatibility and improved macrobend performance in one fiber. A portion of our optical fiber is sold directly to end users and third-party cablers globally. Our remaining fiber production is cabled internally and sold to end users as either bulk cable or as part of an integrated optical solution. Our cable products, including the RocketRibbon® and miniXtend® portfolios, support various outdoor, indoor/outdoor and indoor applications and include a broad range of loose tube, ribbon and drop cable designs with flame-retardant versions available for indoor and indoor/outdoor use including 5G networks.\n2\nTable of  Contents\nIn addition to optical fiber and cable, our carrier network product portfolio also includes hardware and equipment products, including cable assemblies, fiber-optic hardware, fiber-optic connectors, optical components and couplers, closures, network interface devices and other accessories. These products may be sold as individual components or as part of integrated optical connectivity solutions designed for various carrier network applications. Examples of these solutions include our Evolv™ platform, which provides pre-connectorized solutions for cost-effectively deploying fiber-to-the-home and 5G networks; and the Centrix platform, which provides a fiber management system with industry-leading density and innovative jumper routing that can be deployed in a wide variety of carrier switching centers.\nOur enterprise network portfolio leverages optical fiber products, including ClearCurve® ultra-bendable multimode fiber for private and hyperscale data centers and other enterprise network applications. \nOur hardware and equipment for enterprise network applications include cable assemblies, fiber-optic hardware, fiber-optic connectors, optical components and couplers, closures and other accessories. These products may be sold as individual components or as part of integrated optical connectivity solutions designed for various network applications, including hyperscale data centers. Examples of enterprise network solutions include the EDGE® platform, which provides high-density pre-connectorized cabling solutions for data center applications, supporting a path to speeds of 400G and beyond and Everon™ Network Solutions, which provide next-generation cellular connectivity products for interior spaces of all sizes. \nWe invented new fibers, cables and connectors to capture the generative AI enterprise demand. These components are being adopted by hyperscale data centers and others focusing on key technology vectors such as density, latency and sustainability. \nOur optical fiber manufacturing facilities are in North Carolina, China, India and Poland. Cabling operations are in North Carolina, Poland and smaller regional locations. Our manufacturing operations for hardware and equipment products are in Texas, Mexico, Brazil, Germany, Poland and China. \nPatent protection is important to the segment’s operations. The segment has an extensive portfolio of patents relating to its products, technologies and manufacturing processes. The segment licenses certain of its patents to third parties and generates revenue from these licenses, although the royalty income is not currently material to this segment’s operating results. We are licensed to use certain patents owned by others, which are considered important to the segment’s operations. Refer to the material under the heading “Patents and Trademarks” for more information. \nThe Optical Communications segment represented 32% of Corning’s total segment net sales in 2024. \nDisplay Technologies Segment\nThe Display Technologies segment manufactures glass substrates for flat panel displays, including liquid crystal displays (“LCDs”) and organic light-emitting diodes (“OLEDs”) that are used primarily in televisions, notebook computers, desktop monitors, tablets and handheld devices. This segment develops, manufactures and supplies high quality glass substrates using technology expertise and a proprietary fusion manufacturing process, which we invented and is the cornerstone of our technology leadership in the display glass industry. Our highly automated process yields glass substrates with a pristine surface and excellent thermal stability and dimensional uniformity – essential attributes in the production of large, high-performance display panels. Our fusion process is scalable and we believe it is the most cost-effective process for producing large size substrates.\nWe are recognized as a world leader in precision glass innovations that enable our customers to produce larger, thinner, more flexible and higher-resolution displays. Some of the product innovations we have launched over the past ten years utilizing our world-class processes and capabilities include the following:\n•\nCorning® EAGLE XG® Slim Glass, Corning’s flagship display glass product enabling thinner televisions and monitors with larger-sized screens; it is trusted by the world’s leading panel makers for LCD displays with more than 30 billion square feet sold;\n•\nCorning® Astra® Glass, an innovative glass solution designed to meet the emerging needs for high-resolution displays. This glass has been optimized for oxide thin-film transistor (“TFT”) backplanes, but enables a range of high-resolution applications from the top end of amorphous silicon (“s-Si”) TFT backplanes through low temperature poly-silicon (“LTPS”) backplanes, as well as other applications requiring precision glass;\n•\nCorning® Lotus™ NXT Glass, a high-performance display glass designed to withstand the harshest panel manufacturing process enabling highest-resolution displays in smaller and flexible devices; and\n•\nThe world’s first Gen 10 and Gen 10.5 glass substrate sizes in support of improved efficiency in manufacturing large-sized displays.\n3\nTable of  Contents\nWe have display glass manufacturing operations in China, South Korea and Taiwan, and service our glass customers in all regions, utilizing our manufacturing facilities throughout Asia.\nPatent protection and proprietary trade secrets are important to the Display Technologies segment’s operations. Refer to the material under the heading “Patents and Trademarks” for more information.\nThe Display Technologies segment represented 27% of Corning’s total segment net sales in 2024. \nSpecialty Materials Segment\nThe Specialty Materials segment manufactures products that provide more than 150 material formulations for glass, glass ceramics and crystals, as well as precision metrology instruments and software to meet requirements for unique customer needs. Consequently, this segment operates in a wide variety of commercial and industrial markets including materials optimized for mobile consumer electronics, semiconductor equipment optics and consumables, aerospace and defense optics, radiation shielding products, sunglasses and telecommunications components.\nOur highly durable glass, known as Corning® Gorilla® Glass, is a chemically strengthened thin glass designed specifically to function as a cover, or back-enclosure glass, for mobile consumer electronic devices such as mobile phones, tablets, laptops and smartwatches. Elegant and lightweight, Corning® Gorilla® Glass is durable enough to resist many real-world events that commonly cause wear or scratch damage and glass failure, while providing optical clarity, touch sensitivity and RF transparency, thus enabling exciting new applications in technology and design. In 2022, Corning unveiled its newest glass innovation, Corning® Gorilla® Glass Victus® 2, which delivers improved cover glass drop performance on rough surfaces like concrete, while preserving the scratch resistance of Corning® Gorilla® Glass Victus®. Corning® Gorilla® Glass is manufactured in the United States (“U.S.”), South Korea and Taiwan.\nWe collaborated with Apple to deliver durable glass with infused color for the back of Apple's iPhone 15 and iPhone 15 Plus devices. These devices also feature Ceramic Shield, a highly transparent, color-free glass-ceramic, which offers unparalleled durability and toughness for smartphones.\nOur semiconductor optics include high-performance optical materials including Corning® HPFS® Fused Silica and Corning® ULE® Ultra-Low Expansion Glass, optical-based metrology instruments and custom optical assemblies for applications in the global semiconductor industry. Additionally, in 2024, we introduced Corning® EXTREME ULE® Glass, a next-generation material that will support chip manufacturers in meeting the rapidly growing demand for advanced and intelligent technologies. Our semiconductor optics products are manufactured in New York.\nWe also manufacture ultra-flat, ultra-thin glass wafers and substrates for a variety of applications including augmented reality, advanced semiconductor packaging, 3D sensing and more. These products are manufactured in New York, France and China. \nOther specialty glass products include tinted sunglasses and radiation shielding products that are made in France.\nPatent protection is important to the segment’s operations. The segment has a growing portfolio of patents relating to its products, technologies and manufacturing processes. Brand recognition and loyalty, through well-known trademarks, are important to the segment. Refer to the material under the heading “Patents and Trademarks” for more information.\nThe Specialty Materials segment represented 14% of Corning’s total segment net sales in 2024.\nEnvironmental Technologies Segment\nThe Environmental Technologies segment manufactures ceramic substrates and filter products for emissions control in mobile applications around the world. In the early 1970s, we developed an economical, high-performance cellular ceramic substrate that is now the standard for catalytic converters in vehicles worldwide. As global emissions control regulations tighten, we have continued to develop more effective and durable ceramic substrate and filter products for gasoline and diesel applications, most recently launching low-mass Corning® FLORA® substrates and Corning® DuraTrap® GC gasoline particulate filters. We manufacture substrate and filter products in New York, Virginia, China and Germany. We sell our ceramic substrate and filter products worldwide to catalyzers and manufacturers of emission control systems who then sell to automotive and diesel vehicle or engine manufacturers. Although most sales are made to the emission control systems manufacturers, the use of our substrates and filters is generally required by the specifications of the automotive and diesel vehicle or engine manufacturers.\n4\nTable of  Contents\nPatent protection is important to the segment’s operations. The segment has an extensive portfolio of patents relating to its products, technologies and manufacturing processes. We are licensed to use certain patents owned by others, which are also considered important to the segment’s operations. Refer to the material under the heading “Patents and Trademarks” for more information.\nThe Environmental Technologies segment represented 12% of Corning’s total segment net sales in 2024.\nLife Sciences Segment\nAs a leading developer, manufacturer and global supplier of laboratory products for over 105 years, the Life Sciences segment works with researchers and drug manufacturers seeking to drive innovation, increase efficiencies, reduce costs and compress timelines. Using unique expertise in the fields of materials science, polymer surface science, cell culture and cell biology, the segment provides innovative solutions that improve productivity and enable breakthrough research for traditional small molecule, or chemical, drugs, biologics, vaccines and emerging cell and gene therapies.\nLife Sciences products include consumables, such as plastic vessels, liquid handling plastics, specialty surfaces, cell culture media and serum, as well as general labware, glassware and equipment. These products are used for drug discovery research and development, compound screening, diagnostics, advanced cell culture research, genomics applications and mass production of cells for clinical trials and bioproduction. \nWe sell life sciences products under the Corning®, Falcon®, PYREX® and Axygen® brands. The products are marketed globally, primarily through distributors, to pharmaceutical and biotechnology companies, contract manufacturing organizations, central testing labs, academic institutions, hospitals, government entities and other facilities. We manufacture these products in California, Illinois, Maine, Massachusetts, New York, North Carolina, Utah, Virginia, China, France, Mexico, Brazil and Poland.\nPatent protection is important to the segment’s operations. The segment has a growing portfolio of patents relating to its products, technologies and manufacturing processes. Brand recognition and loyalty, through well-known trademarks, are important to the segment. Refer to the material under the heading “Patents and Trademarks” for more information.\nThe Life Sciences segment represented 7% of Corning’s total segment net sales in 2024.\nHemlock and Emerging Growth Businesses\nAll other businesses that do not meet the quantitative threshold for separate reporting have been grouped as Hemlock and Emerging Growth Businesses. This group is primarily comprised of the results of Hemlock Semiconductor Group (“HSG”). HSG is a leading provider of high-purity polysilicon products for the solar power and electronics industries. HSG operates in the solar power market, as polysilicon is needed in the manufacturing process to produce sustainable solar power cell, panels and arrays, and the electronics markets, as polysilicon is used to create fabricated wafers and integrated circuit chips used by leading semiconductor manufacturers.\nHemlock and Emerging Growth Businesses also includes our pharmaceutical technologies business, which produces high-quality pharmaceutical glass tubing and vials to meet the rigorous needs of the pharmaceutical industry; our automotive glass solutions business, which enhances vehicle exteriors and interiors with innovations that enable lightweight, damage-resistant windows and displays; as well as other businesses and certain corporate investments.\nHemlock and Emerging Growth Businesses represented 8% of Corning’s total segment net sales in 2024.\nAdditional explanation regarding Corning and its five reportable segments, as well as financial information about geographic areas, is presented in Management’s Discussion and Analysis of Financial Condition and Results of Operations and Note 17 (Reportable Segments) in the accompanying notes to the consolidated financial statements.\n5\nTable of  Contents\nCompetition\nWe compete with many large and varied manufacturers, both domestic and foreign. Some of these competitors are larger than we are, and some have broader product lines. We strive to maintain and improve our market position through technology and product innovation. For the foreseeable future, our competitive advantage lies in our commitment to research and development, deep customer relationships, reliability of supply, product quality, superior customer service and technical specification of our products. There is no assurance that we will be able to maintain or improve our market position or competitive advantage.\nOptical Communications Segment\nWe maintain a leadership position in the segment’s principal product groups, which include carrier and enterprise networks. The competitive landscape includes industry consolidation, pricing pressure and competition for the innovation of new products. These competitive conditions are likely to persist. Our large-scale manufacturing experience, fiber process, technology leadership and intellectual property provide cost advantages relative to several of our competitors. Our principal competitors include CommScope Holding Company, Inc. and Prysmian Group S.p.A.\nDisplay Technologies Segment\nWe are the largest worldwide producer of glass substrates for flat panel displays. The environment for high-performance display glass substrate products is very competitive and we have maintained our competitive advantages by investing in new products, continually improving our proprietary fusion manufacturing process and providing a consistent and reliable supply of high-quality products. Our process allows us to deliver glass that is larger, thinner and lighter, with exceptional surface quality and without heavy metals. Our principal competitors include AGC Inc. and Nippon Electric Glass Co., Ltd.\nSpecialty Materials Segment\nWe have deep capabilities in materials science, optical design, shaping, coating, finishing, metrology and optical system assembly. Our products and capabilities in this segment position us to meet the needs of a broad array of markets, including semiconductor, aerospace, defense, industrial, commercial and telecommunications. Our principal competitors include Schott AG, AGC Inc., Nippon Electric Glass Co., Ltd. and Heraeus.\nEnvironmental Technologies Segment\nWe maintain a strong position in the worldwide market for automotive ceramic substrate and filter products, as well as in the heavy-duty and light-duty diesel vehicle markets. Our competitive advantage in automotive ceramic substrate products for catalytic converters and filter products for particulate emissions in exhaust systems is based on an advantaged product portfolio, collaborative engineering design services, customer service and support, strategic global presence and continued product innovation. Our principal competitors include NGK Insulators, Ltd. and Ibiden Co., Ltd.\nLife Sciences Segment\nWe seek to maintain a competitive advantage by emphasizing product quality, global distribution, supply chain efficiency, a broad product line, technical support and superior product attributes. Our principal competitors include Thermo Fisher Scientific Inc., Avantor, Inc., Greiner AG, Eppendorf SE, Sarstedt AG & Co. KG and Danaher Corporation. Corning also faces competition from large distributors that have pursued backward integration or introduced private label products.\nRaw Materials\nOur manufacturing processes and products require access to uninterrupted power sources, significant quantities of industrial water, certain precious metals and various batch materials. Availability of resources, such as ores, minerals, polymers, lithium, helium and processed chemicals, required in our manufacturing operations appear to be adequate. From time to time, our suppliers may experience capacity limitations in their own operations or may eliminate certain product lines. We have adequate programs to ensure a reliable supply of raw and batch materials, as well as precious metals which are used in our production processes. For many of our materials, we have alternate suppliers that would allow operations to continue without interruption in the event of specific materials shortages.\nCertain key materials and proprietary equipment used in the manufacturing of products are currently sole-sourced or available only from a limited number of suppliers. To minimize this risk, we closely monitor raw materials and equipment with limited availability or sole-sourced suppliers. However, any future difficulty in obtaining sufficient and timely delivery, or inflationary pricing, of components and/or raw materials could result in lost revenue due to delays or reductions in product shipments, or reductions in gross margin.\n6\nTable of  Contents\nPatents and Trademarks\nInventions by members of our research and engineering staff continue to be important to our growth. Patents have been granted on many of these inventions in the U.S. and other countries. Some of these patents have been licensed to other manufacturers. Many of our earlier patents have now expired, but we continue to seek and obtain patents protecting our innovations. In 2024, we were granted about 490 patents in the U.S. and over 1,240 patents in countries outside the U.S.\nEach business segment possesses a patent portfolio that provides certain competitive advantages in protecting our innovations. We have historically enforced, and will continue to enforce, our intellectual property rights. At the end of 2024, we owned about 12,000 unexpired patents in various countries, of which about 4,510 were U.S. patents. Between 2025 and 2027, approximately 730, or 6%, of these worldwide patents will expire, while at the same time we intend to seek patents protecting our newer innovations. Worldwide, we have about 5,880 patent applications in process, with about 1,780 in process in the U.S. Our patent portfolio will continue to provide a competitive advantage in protecting our innovation, although our competitors in each of our businesses are actively seeking patent protection as well.\nWhile each of our reportable segments has numerous patents in various countries, no one patent is considered material to any segment. Important U.S. issued patents in our reportable segments include the following:\n•\nOptical Communications: patents relating to (i) multimode and single mode optical fiber products including low-loss optical fiber, large effective area optical fiber and other high data rate optical fiber, and processes and equipment for manufacturing optical fiber, including methods for making optical fiber preforms and methods for drawing, cooling and winding optical fiber; (ii) optical fiber ribbons and methods for making such ribbon, indoor and outdoor fiber optic cable products and methods for making and installing optical fiber cable; (iii) optical fiber connectors and factory-terminated assemblies, hardware, termination and storage and associated methods of manufacture; and (iv) optical fiber and hybrid fiber-coax wireless communication systems.\n•\nDisplay Technologies: patents relating to glass compositions and methods for the use and manufacture of glass substrates for display applications.\n•\nSpecialty Materials: patents relating to protective cover glass materials and coatings, ophthalmic glasses and polarizing dyes and semiconductor/microlithography optics and blanks, metrology instrumentation and laser/precision optics, glass polarizers, specialty fiber and refractories.\n•\nEnvironmental Technologies: patents relating to cellular ceramic honeycomb products, together with ceramic batch and binder system compositions, honeycomb extrusion and firing processes, and honeycomb extrusion dies and equipment for the high-volume, low-cost manufacture of such products.\n•\nLife Sciences: patents relating to methods and apparatus for the manufacture and use of scientific laboratory equipment including multiwell plates and cell culture products, as well as equipment and processes for cell and gene therapy research.\nThe following table presents the approximate number of patents granted to our reportable segments:\nNumber of patents worldwide\nU.S. patents\nImportant U.S. patents expiring between\n2025 and 2027\nOptical Communications\n4,652\n2,089\n25\nDisplay Technologies\n1,320\n173\n12\nSpecialty Materials\n2,426\n883\n13\nEnvironmental Technologies\n847\n360\n12\nLife Sciences\n547\n161\n6\nMany of our patents are used in operations or are licensed for use by others, and we are licensed to use patents owned by others. We have entered into cross-licensing arrangements with some major competitors, but the scope of such licenses has been limited to specific product areas or technologies.\nOur principal trademarks include the following: Axygen, Celcor, ClearCurve, Contour, Corning, DuraTrap, Eagle XG, Edge8, Everon, Evolv, Falcon, Gorilla, HPFS, Leaf, PYREX, RocketRibbon, SMF-28e, Steuben, UniCam, Valor, Velocity, Victus and Viridian.\n7\nTable of  Contents\nProtection of the Environment\nWe have an extensive program to ensure that our facilities comply with state, federal and foreign pollution-control regulations. This program has resulted in capital and operating expenditures each year. To maintain compliance with such regulations, capital expenditures for pollution control in operations were approximately $10.4 million in 2024 and are estimated to be $14.2 million in 2025.\nOur 2024 consolidated operating results reflect approximately $64.0 million for depreciation, maintenance, waste disposal and other operating expenses associated with pollution control.\nHuman Capital Management Overview\nAt Corning, we are proud of the life-changing innovations we bring to the world. Our unparalleled expertise in our core technologies along with deep manufacturing and engineering capabilities require a talent strategy focused on attracting and retaining exceptional people, building a culture that enables innovation and collaboration and supporting long and successful careers. \nEach of our 56,300 full- and part-time employees in 44 countries make an important contribution, whether in one of our manufacturing or processing facilities, research labs, sales offices or other facilities. Approximately 59% of all employees are in production and maintenance roles and more than 60% of all employees are represented by a union, works council or other representative group.\nValues\nCorning is guided by an enduring set of Values that defines our relationship with employees, customers and our communities: Quality, Integrity, Performance, Leadership, Innovation, Independence and the Individual. Our Values are the key to our business success, a source of pride and excitement for our employees and the factor that ultimately sets us apart from our competitors. In short, we believe that how we do things is as important as what we do. We measure how we live our Values through our annual “Voice to Action” Workplace Culture Survey. In 2024, we had an 85% response rate with survey participation worldwide. We use the results to pinpoint recurring global themes and develop plans to drive action based on employee feedback. Corning employees all contribute to the success of the Company by Living our Values—all seven, all the time, all around the world. \nCorning operates around the globe and builds strong, multifaceted teams in which all employees feel included at work. Our efforts are rooted in our Value of the Individual, by which we acknowledge the belief that the commitment and contributions of all of our employees determines our success. The rich diversity of our experiences, thoughts, and who we are as individuals strengthens the impact of our collective achievements. We value the unique ability of each individual to contribute, and we intend that all employees shall have the opportunity to participate fully, to grow professionally, and to develop to their highest potential.\nOur global workforce is comprised of 60.5% men and 39.5% women. In all regions of the world, we maintain a talent pipeline that includes people of all backgrounds through our effective recruitment process, mentoring and coaching programs, networking opportunities, and proactive career discussions. As a result of these efforts, we have expanded the quality and depth of experience within our leadership teams.\nTalent Management\nEach year we formally evaluate the talent implications of our strategic business plans and align our actions and objectives accordingly. As business needs change, we create human capital objectives to ensure we have the right people with the right skills in place to deliver that growth.\nCorning is committed to attracting and recruiting highly qualified candidates of all backgrounds to sustain our culture of innovation and to stimulate creativity. We have established a strategic talent pipeline by partnering with schools around the world with exceptional strength in the material sciences and other fields relevant to our Company's business, including renowned MBA schools and top engineering and scientific schools. We engage with professional organizations, engineering societies and other industry organizations to connect us with talented candidates from a multitude of backgrounds and disciplines. We offer internships, co-ops, rotational leadership programs and other developmental opportunities to talented candidates. Our recruitment strategy is centered on the belief that when a workforce fosters rich and varied ideas, the overall quality of our solutions is enhanced.\n8\nTable of  Contents\nIt is important to Corning that employees continue to grow and develop. We offer a variety of enterprise and on-demand developmental programs and experiences, targeted to all levels in the organization. We provide on-the-job learning experience, mentoring and career planning to ensure immediate application and lasting impact. Talent retention is an ongoing focus area which aligns with our strategy of encouraging and supporting longer-term careers with Corning. Historically, our salaried voluntary turnover has been consistently lower than the markets in which we compete for talent. Salaried talent retention in 2024 remained strong at 95.7%.\nAt Corning, the health and safety of our workforce is always of paramount consideration. Our safety standards meet, and often exceed, local regulatory standards. Corning continued managing Total Recordable Incident Rate (“TRIR”) performance to world class levels with an annual TRIR of just 0.29 in 2024. Globally, we promote employee health and wellbeing through wellness programs which vary by region such as nutrition and fitness-related offerings, smoking cessation programs and smoke free campuses. Corning also promotes healthy behaviors with its employees and has introduced global programs emphasizing mental health and wellness programs.\n9\nTable of  Contents\nExecutive Officers of the Registrant \nJaymin Amin\n Senior Vice President and Chief Technology Officer\nDr. Amin joined Corning in 1997 as a senior research scientist. He held numerous operational roles within Photonics before joining Corning Specialty Materials in 2004. He led product and process development, product engineering and commercial technology for Gorilla Glass and later for Mobile Consumer Electronics. In 2020, Dr. Amin was appointed vice president and general manager, Corning Gorilla Glass, Mobile Consumer Electronics, and in June 2022 he was appointed senior vice president and chief technology officer. Age 56. \nStefan Becker\n Senior Vice President, Finance and Corporate Controller\nMr. Becker joined Corning in 2000 through Corning’s acquisition of Siemens Communication Cable Division. From 2001 to 2005, he held positions as manager, Planning and Analysis and later director of Finance, Corning Cable Systems. He joined the Display Technologies division in 2005 as U.S. Controller. In 2007 he was appointed CFO, Corning Display Technologies Taiwan. In 2009 he was named director of Finance, Corning Display Technologies (“CDT”) and in 2010 was appointed division controller, CDT. Between 2012 and 2015, he served as international division vice president, Finance, Corning Glass Technologies. Mr. Becker was appointed Corning’s operations controller in 2015 and senior vice president in 2019. In 2021 he was appointed senior vice president, Finance, and corporate controller and in February 2022 he was named principal accounting officer. Age 53.\nLi Fang \nSenior Vice President, Corning International and New Business Development, Solar\nMr. Fang joined Corning International in 1997 as business development manager, China. In 1999 he transferred to the Environmental Products Division and became production manager of Corning Environmental Technologies’ (“CET”) China Plant - Corning (Shanghai) Company Ltd. In July 2004, he was appointed operations manager and in October 2004 he was appointed director of operations and plant manager of Corning (Shanghai) Company Ltd. In 2007, Mr. Fang was appointed vice president, Corning Display Technologies China, and director of commercial operations, government affairs and supply chain. In 2009 he was named president, Corning Display Technologies China. From 2012-2021 Mr. Fang served as president and general manager of Corning Greater China. In 2021 he was appointed as president and general manager, International, Corning Incorporated and in 2023 he was appointed senior vice president, Corning International and new business development, Solar. Age 62.\nJordana D. Kammerud \nSenior Vice President and Chief Human Resources Officer\nMs. Kammerud joined Corning in 2023 with more than 20 years of experience leading progressive HR functions and has deep expertise in people, technology, and change on a global scale and across multiple industries. Prior to joining Corning, she served as executive vice president and chief human resources officer at Claire’s, where she was responsible for global human resources, as well as corporate strategy, and enterprise transformation management. Additionally, she led numerous technology, capability, and culture investments. Prior to that role, Ms. Kammerud served as senior vice president, chief human resources officer, at Core-Mark. She has also held human resources leadership positions with SC Johnson, American Express, and DaimlerChrysler. Age 48.\nEric S. Musser \nPresident and Chief Operating Officer\nMr. Musser joined Corning in 1986 and served in a variety of manufacturing and general management roles in Corning’s Optical Communications businesses. In 2005, he was named vice president and general manager of Optical Fiber. Mr. Musser served as general manager, Corning Greater China from 2007 to 2012 and president of Corning International from 2012 to 2014. In 2014, he was appointed executive vice president, Corning Technologies and International. In 2020, he was appointed president & chief operating officer. Age 65.\nAvery H. Nelson III \nSenior Vice President and General Manager, Automotive, Life Sciences & Solar\nMr. Nelson joined Corning in 1991 as shift supervisor at the Harrodsburg, Kentucky plant and subsequently served in progressive roles in Corning Display Technologies. In 2007, he joined CET as general manager, Corning (Shanghai) Company Limited. In 2009, he became general manager and regional director of China and India, CET. In 2010 he returned to the U.S. as program director, CET. In 2011, he assumed the role of business director, AAA Corning® Gorilla® Glass, New Business Development. Later that year, he was appointed division vice president, Heavy Duty Diesel. In 2014, Mr. Nelson was appointed vice president and general manager for CET and was named senior vice president and general manager, CET, in 2018. In 2020 he was appointed senior vice president and general manager, Automotive. His role was expanded in 2023 to include development of new business opportunities in solar markets. He was appointed senior vice president and general manager, Automotive, Life Sciences & Solar in 2024. Age 56.\nMichael P. O’Day \nSenior Vice President & General Manager Optical Communications\nMr. O’Day joined Corning in 1998 with Siecor, which later became Corning Cable Systems (“CCS”). He worked in both the Strategy and Marketing organizations for CCS through 2003. From 2004 to 2010 he served in CCS’s Optical Connectivity Product Line Management organization. In 2010 Mr. O’Day was appointed program manager for Corning’s IDAS Wireless Program. In 2017 he became the head of Product Line Management for Optical Connectivity Solutions. Prior to his current role, Mr. O’Day served as vice president of Corning Optical Communications (“COC”) Technology and Program Management Office. He was appointed senior vice president & general manager, Optical Communications in 2024. Age 55.\n10\nTable of  Contents\nEdward A. Schlesinger \nExecutive Vice President and Chief Financial Officer\nMr. Schlesinger joined Corning in 2013 as senior vice president and chief financial officer of Corning Optical Communications. He was appointed vice president and corporate controller in September 2015 and principal accounting officer in December 2015. He was named senior vice president in 2019. In 2022, he was appointed executive vice president and chief financial officer. Prior to joining Corning, Mr. Schlesinger served in various finance leadership roles with American Standard and Ingersoll Rand. Age 57.\nSoumya Seetharam \nSenior Vice President and Chief Digital & Information Officer\n \nMs. Seetharam joined Corning in November 2022 as senior vice president and chief digital & information officer. Prior to joining Corning, she was vice president and general manager of Information Technology at Intel Corporation driving information technology (“IT”) vision and strategy for Corporate Functions. She also served as chief systems officer at Anadarko Petroleum Corporation. Ms. Seetharam brings deep experience in information technology, digital and systems transformation and risk governance to Corning. Age 49. \nLewis A. Steverson \nExecutive Vice President and Chief Legal & Administrative Officer\nMr. Steverson joined Corning in 2013 as senior vice president and general counsel. In 2018 he was named executive vice president and general counsel. He was appointed chief legal & administrative officer in 2020. Prior to joining Corning, Mr. Steverson served as senior vice president, general counsel, and corporate secretary of Motorola Solutions, Inc. During his 18 years with Motorola, he held a variety of law leadership roles across the company’s numerous business units. Prior to Motorola, Mr. Steverson was in private practice at the law firm of Arnold & Porter. Age 61.\nMichaune D. Tillman \nSenior Vice President and General Counsel\nMs. Tillman joined Corning in 2024 with more than 25 years of domestic and international experience as an attorney and trusted advisor. Prior to joining Corning, she served as General Counsel and Corporate Secretary of Worthington Steel, Inc. She also previously served as General Counsel at Worthington Steel Processing and Worthington Armstrong Venture (“WAVE”). Across these roles, Ms. Tillman led corporate governance matters, litigation, commercial transactions, regulatory, antitrust, environmental health and safety, cyber security, data privacy, import/export, labor and employment, intellectual property and compliance. Prior to WAVE, she served in executive leadership roles at Ricoh Americas Corporation including deputy general counsel and as employment and commercial litigation counsel at IKON Office Solutions. Age 53.\nRonald L. Verkleeren \nSenior Vice President, Emerging Innovations Group \nMr. Verkleeren joined Corning in 2001 in the Optical Communications segment. He joined the Life Sciences segment in 2004 and has held a variety of progressive roles in that segment. In 2010, he was named division vice president and director of Advanced Life Sciences. In 2012 he was named division vice president and program director for Corning Pharmaceutical Technologies. In 2015, Mr. Verkleeren became vice president and general manager of the Pharmaceutical Technologies division. In 2020 he was appointed senior vice president & general manager, Life Sciences Technologies. He was appointed senior vice president, Emerging Innovations Group in 2024. Age 54.\nWendell P. Weeks \nChairman and Chief Executive Officer\nMr. Weeks joined Corning in 1983 in the finance group. He has held a variety of financial, business development, commercial and general management roles. He was named vice president and general manager of the Optical Fiber business in 1996 and president of Corning’s Optical Communications division in 2001. He became Corning’s president and chief operating officer in 2002. Mr. Weeks has been a member of Corning’s Board of Directors since December 2000. He was named chief executive officer in 2005 and chairman of the board in 2007. Mr. Weeks is a director of Amazon.com, Inc. Age 65.\nJohn Z. Zhang \nSenior Vice President and General Manager, Corning Glass Innovations & Corning Asia\nMr. Zhang joined Corning in 2008 and has held a variety of progressive roles in Strategy, Mergers & Acquisitions, and Business Development. In 2010, he further expanded his role, leading the Strategy & Corporate Development organization of Corning International. In 2014, he was named deputy general manager, Corning Display Technologies. In 2020, Mr. Zhang was appointed senior vice president and general manager, Corning Display and was appointed as senior vice president and general manager, Display & Corning Asia in 2023. He was appointed senior vice president and general manager, Corning Glass Innovations & Corning Asia in 2024. Age 52.\n11\nTable of  Contents\nDocument Availability\nA copy of Corning’s 2024 Annual Report on Form 10-K filed with the United States Securities and Exchange Commission (the “SEC”) is available upon written request to Corporate Secretary, Corning Incorporated, One Riverfront Plaza, Corning, NY 14831. The Annual Report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments pursuant to Section 13(a) or 15(d) of the Exchange Act of 1934 and other filings are available as soon as reasonably practicable after such material is electronically filed or furnished to the SEC, and can be accessed electronically free of charge at www.SEC.gov, or through the Investor Relations page on Corning’s website at www.corning.com. The information contained on the Company’s website is not included in, or incorporated by reference into, this Annual Report on Form 10-K.\nOther\nAdditional information in response to Item 1 is found in Note 17 (Reportable Segments) in the accompanying notes to the consolidated financial statements.\n12\nTable of  Contents",
    "item1a": "Item 1A. Risk Factors \nWe operate globally in a rapidly changing economic, political and technological environment that presents numerous risks. Our operations and financial results are subject to risks and uncertainties, including those described below, that could adversely affect our business, financial condition, results of operations, cash flows, our ability to successfully execute our strategy and the trading price of our common stock or debt. The following discussion identifies the most significant factors that may adversely affect the Company. This information should be read in conjunction with Management’s Discussion and Analysis of Financial Conditions and Results of Operations (“MD&A”) and the consolidated financial statements and related notes incorporated by reference into this report. The following discussion of risks is not all inclusive but is designed to highlight what we believe are important factors to consider, as these factors could cause our future results to differ from those in our forward-looking statements and from historical trends.\nRisks Related to Our Business\nInflationary price pressures and uncertain availability of commodities, raw materials, utilities, labor or other inputs used by us and our suppliers, or instability in logistics and related costs, among other factors, could negatively impact our profitability \nIncreases in the price of commodities, raw materials, utilities, labor or other inputs that we or our suppliers use in manufacturing and supplying products, components and parts, along with logistics and other related costs, may lead to higher production and shipping costs for our products, parts and components. Further, increasing global demand for, and uncertain supply of, such materials could disrupt our or our suppliers’ ability to obtain such materials in a timely manner to meet our supply needs and/or could lead to increased costs. Any increase in the cost of inputs to our production could lead to higher costs for our products and could negatively impact our operating results, future profitability and ability to successfully deliver on our strategy. Increasing our prices to our customers may cause certain of our customers to push out, cancel or refrain from purchasing our products, which could materially adversely impact demand for our products, and thereby also negatively impact our operating results, future profitability and ability to successfully deliver on our strategy.\nFactors such as supply chain disruptions, manufacturing interruptions or delays, or the failure to accurately forecast customer demand, could affect our ability to meet customer demand, lead to higher costs, or result in excess or obsolete inventory; if we are unable to obtain the necessary equipment, raw and batch materials, natural resources, utilities and other essentials required in our products or processes, our business will be negatively impacted\nCorning’s business relies on the timely supply of raw materials, precious metals, natural resources or utilities including energy and industrial water, equipment, parts and components, services and related products to meet the changing technical and volume requirements of its customers, which depends in part on the timely delivery of materials, equipment and services, from suppliers and contract manufacturers. Significant or sudden increases in demand for such materials, equipment and services, as well as delays in and unpredictability of shipments due to transportation interruptions, have resulted in, and may continue to result in, a shortage of materials, equipment and services needed to manufacture Corning’s products. Such shortages have adversely impacted, and may continue to adversely impact, our suppliers’ ability to meet our demand requirements and Corning’s manufacturing operations and its ability to meet customer demand. Some key materials, equipment and services are subject to long lead-times or are available only from a single supplier or limited group of suppliers and we may not be able to find alternate sources in a timely manner. Volatility of demand for manufacturing equipment can increase capital, technical, operational and other risks for Corning and for companies throughout our supply chain, and may cause some suppliers to exit businesses, scale back or cease operations, which could impact our ability to meet customer demand and could have a material adverse effect on our business.\nCorning may also experience significant interruptions of its manufacturing operations, delays in its ability to deliver products or services, increased costs or customer order cancellations as a result of:\n•\nThe failure or inability to accurately forecast demand and obtain sufficient quantities of materials, equipment and services on a cost-effective basis;\n•\nVolatility in the availability and cost of materials, equipment and services, including rising prices due to inflation or scarcity of availability;\n•\nDifficulties or delays in obtaining required import or export approvals;\n•\nShipment delays due to transportation interruptions, labor strife or capacity constraints;\n•\nA worldwide shortage of semiconductor components or other issues;\n•\nInformation technology or infrastructure failures, including those of a third-party supplier or service provider; and\n•\nNatural disasters, the impacts of climate change, or other events beyond Corning’s control (such as earthquakes, utility interruptions, tsunamis, hurricanes, typhoons, floods, storms or extreme weather conditions, fires, regional economic downturns, regional or global health crisis events, geopolitical turmoil, increased trade restrictions between the U.S. and China and other countries, social unrest, political instability, terrorism, or acts of war) in locations where it or its customers or suppliers have manufacturing, research, engineering or other operations.\n13\nTable of  Contents\nHealth crisis events, such as epidemics or pandemics, have adversely impacted, and may continue to impact, the economy and disrupt our operations and supply chains, which may have an adverse effect on our results of operations\nHealth crisis events, including epidemics or pandemics, such as COVID-19, have impacted and may further impact the economy and could have additional impacts on economic growth, supply chains, the proper functioning of financial and capital markets, foreign currency exchange rates and interest rates. Recently, the COVID-19 pandemic resulted in authorities around the world implementing numerous unprecedented measures such as travel restrictions, quarantines, shelter in place orders, vaccine mandates and facility shutdowns. These measures have impacted our workforce, operations and supply chains, and those of our customers, contract manufacturers and suppliers, and may continue to have an impact particularly in the event of another significant global health crisis. There is considerable uncertainty regarding the duration, scope and severity of a health crisis event and the impacts on our business and the economy from the effects of such an event and response measures. \nCorning’s Display Technologies segment generates a significant amount of the Company’s profits and cash flow; any significant decrease in display glass pricing, volume or market share could have a material and negative impact on our financial results\nCorning’s ability to generate profits and operating cash flow could be significantly impacted by the profitability of our display glass business, which is subject to pricing pressure, exchange rate movements, industry competition, potential over-capacity, development of new technologies and operational and regulatory risks. If we are not able to achieve proportionate reductions in costs and/or increases in volume or price to offset the aforementioned factors, it could have a material adverse impact on our financial results.\nBecause we have a concentrated customer base, future sales and cash flows could be negatively impacted by the actions or loss of one or more key customers\nA relatively small number of end customers account for a high percentage of our net sales in each of our business segments. This concentration subjects us to a variety of risks including:\n•\nThe loss or insolvency of one or more of our key customers, could result in a substantial loss of sales and reduction in anticipated cash flows;\n•\nCustomers may possess substantial leverage in negotiating contractual obligations, including liability provisions; and \n•\nMergers and consolidations between customers could result in further concentration of the customer base.\nThe following table details the number of combined customers of our reportable segments that accounted for a large percentage of segment net sales, not adjusted for constant currency:\nNumber of combined end customers\n% of total segment net sales in 2024\nOptical Communications\n2\n27 \n%\nDisplay Technologies\n4\n67 \n%\nSpecialty Materials\n2\n43 \n%\nEnvironmental Technologies\n3\n71 \n%\nLife Sciences\n2\n42 \n%\nEvents outside of Corning’s control, or those of our contract manufacturers, could cause a disruption to our manufacturing operations and our ability to serve our customers, resulting in a negative impact to Corning’s net sales, net income, asset values and liquidity\nDisruption to our manufacturing operations, or those of our contract manufacturers, could significantly impact Corning’s ability to supply its customers and could produce a near-term severe impact on our individual business units and the Company. Given the geographical concentration of certain of the Company’s and our contract manufacturers’ plants in Asia Pacific, the highly engineered nature of the facilities and the globally dispersed talent required to run these facilities, any event that adversely affects or restricts movement into or out of a specific geographic area where we, our contract manufacturers, suppliers, or customers have a presence, could adversely impact our results. Due to the specialized nature of our products and single-site manufacturing locations, in the event such a location experiences disruption, it may not be possible to find replacement capacity or substitute production from other facilities. \n14\nTable of  Contents\nWe may experience difficulties in enforcing our intellectual property rights, which could result in loss of market share and decreased sales and profits, and we may be subject to claims of infringement of the intellectual property rights of others\nWe rely on patent and trade secret laws, copyright, trademark, confidentiality procedures, controls and contractual commitments to protect our intellectual property rights. Despite our efforts, these protections may be limited and we may encounter difficulties in protecting our intellectual property rights or obtaining rights to additional intellectual property necessary to permit us to continue or expand our businesses. We cannot provide assurance that the patents we hold or may obtain will provide meaningful protection against our competitors. Changes in or enforcement of laws concerning intellectual property may affect our ability to prevent or address the misappropriation of, or the unauthorized use of, our intellectual property, potentially resulting in loss of market share. Litigation may be necessary to enforce our intellectual property rights. Litigation is inherently uncertain and outcomes are unpredictable. If we cannot protect our intellectual property rights against unauthorized copying or use, or other misappropriation, we may not remain competitive.\nThe intellectual property rights of others could inhibit our ability to introduce new products. Other companies hold patents on technologies used in our industries and are aggressively seeking to expand, enforce and license their patent portfolios. We periodically receive notices from, or have lawsuits filed against us, by third parties claiming infringement, misappropriation or other misuse of their intellectual property rights and/or breach of our agreements with them. These third parties often include entities that do not have the capabilities to design, manufacture, or distribute products or entities that acquire intellectual property, including patents, for the sole purpose of monetizing their acquired intellectual property through asserting claims of infringement and misuse. Such claims of infringement or misappropriation may result in loss of revenue, substantial costs, or lead to monetary damages or injunctive relief against us.\nInformation technology dependency and cybersecurity vulnerabilities could lead to reduced revenue, liability claims, competitive or reputational harm, and result in material adverse effects on our operations and financial results\nThe Company is dependent on information technology systems and infrastructure (“IT systems”) owned and operated by the Company or managed by third-party service providers, suppliers and contract manufacturers. IT systems enable us to conduct, monitor and/or protect our business, operations, systems, data and other assets. In the ordinary course of our business, we and our providers collect, process, transmit and store sensitive data, including intellectual property, our proprietary information and that of our customers, suppliers and business partners, as well as personally identifiable information. Intrusion into a supplier or contract manufacturer system not integrated with a Corning IT system could result in service disruption and/or loss of financial control. \nOur IT systems, and those of our providers, may be vulnerable to compromise or disruption due to human error or malfeasance, outdated applications, computer viruses or malware (e.g., ransomware), natural disasters, unauthorized access, cyber-attacks and other similar incidents and disruptions. Inadequate account security or organizational security practices may also result in unauthorized access. Increased work-from-home, at both the Company and our providers, presents additional operational risk. Companies that provide utilities, water, transportation, natural gas and other resources and services across our supply chain, are critical to our manufacturing ope\nrations and are vulnerable to cyber-attacks. From time to time, both we and certain of our providers, have been subject to cyberattacks and security incidents. Our security processes and initiatives may not be capable of anticipating, detecting, preventing or remediating all attacks, particularly as attackers are becoming more sophisticated in their ability to circumvent controls and remove forensic evidence. The rapid development and increasing adoption of emerging technologies, such as artificial intelligence and machine learning, may further complicate our ability to anticipate and implement effective protective measures against cyber events.\nAny significant disruption, br\neakdown, intrusion, interruption or corruption, data breach, or compromise to the accessibility, security or integrity of our or our providers’ IT systems, or the misappropriation or disclosure of any confidential, proprietary or personally identifiable information, could result in the loss of data or intellectual property, equipment or systems damage, downtime, safety related issues and could have a material adverse effect on our business, including by harming our competitive position and reputation, disrupting our manufacturing, reducing the value of our investment in research and development and other strategic initiatives, impairing our ability to access suppliers, contract manufacturers, customers and cloud-based services, subjecting us to litigation or regulatory investigations or fines, increasing the costs of compliance and remediation, or otherwise adversely affecting our business. We may be required to invest significant additional resources to comply with evolving cybersecurity regulations and to modify and enhance our IT systems, information security and controls, and to investigate and remediate any security vulnerabilities. Any losses, costs or liabilities may not be covered by, or may exceed the coverage limits of, any, or all, of our applicable insurance policies. \nWe may not earn a positive return from our research, development and engineering investments \nDeveloping our products through our innovation model of research and development is costly and often involves a long investment cycle. We make significant investments in research, development and engineering that may not earn an economic return. If our investments do not provide a pipeline of products or technologies that our customers demand or lower our manufacturing costs, or if our products or technologies become obsolete or disrupted by emerging technologies, it could negatively impact our revenue and operating margins for both near- and long-term.\n15\nTable of  Contents\nOur innovation model depends on our ability to attract and retain specialized expertise\nOur innovation model requires us to employ highly specialized experts in glass science, ceramic science and optical physics to conduct our research and development and engineer our products and design our manufacturing facilities. The loss of the services of any member of our key research and development or engineering team without adequate replacement, or the inability to attract new qualified personnel, could have a material adverse effect on our operations and financial performance.\nWe are subject to strict environmental regulations and regulatory changes that could result in fines or restrictions that interrupt our operations\nSome of our manufacturing processes generate chemical waste, wastewater, other industrial waste or greenhouse gases, and we are subject to numerous laws and regulations relating to the use, storage, discharge and disposal of such substances. We have installed anti-pollution equipment for the treatment of chemical waste and wastewater at our facilities. We have taken steps to control and reduce the amount of greenhouse gases created by our manufacturing operations. However, we cannot provide assurance that environmental claims will not be brought against us or that government regulators will not take steps to adopt more stringent environmental standards.\nAny failure on our part to comply with any present or future environmental regulations could result in the assessment of damages or imposition of fines against us, or the suspension/cessation of production or operations. In addition, environmental regulations could require us to acquire costly equipment, incur other significant compliance expenses or limit or restrict production or operations and thus materially and negatively affect our financial condition and results of operations.\nChanges in regulations and the regulatory environment in the U.S. and the many other countries in which we operate, such as those resulting from the regulation and impact of climate change, CO\n2\n abatement and emission reduction targets, may affect our businesses and results in adverse ways by, among other things, substantially increasing manufacturing costs, limiting availability of scarce resources, especially energy, or requiring limitations on production or sales of our products or those of our customers.\nGeneral Risk Factors\nWe may have additional tax liabilities\nWe are subject to income taxes in the U.S. and many foreign jurisdictions and are commonly audited by various tax authorities. There are many transactions and calculations where the ultimate tax treatment is uncertain. Judgment is required in determining our worldwide provision for income taxes. Although we believe our tax estimates are reasonable, the final determination of tax, assessments, audits and any related litigation could be materially different from our historical income tax provisions and accruals, or result in the forfeiture of funds deposited with the relevant government authorities. The results of an audit or litigation could have a material effect on our financial statements in the period or periods for which such a determination is made. \nThe U.S., other countries and international organizations, such as Organisation for Economic Co-operation and Development, may change their laws or issue new international tax standards that may also impact our taxes. \nAs a global company, we face many risks which could adversely impact our operations and financial results \nWe are a global company and derive a substantial portion of our revenue from, and have significant operations, outside of the U.S. Our international operations include manufacturing, assembly, sales, research and development, customer support and shared administrative service centers. Additionally, we rely on a global supply chain for key components and capabilities that are central to our ability to invent, make and sell products.\nCompliance with multiple legal and regulatory requirements increases our costs. We are subject to both U.S. laws and the local laws where we operate which, among other things, include data privacy requirements, employment and labor laws, tax laws, anti-competition regulations, prohibitions on payments to governmental officials, import and trade restrictions and export requirements. Non-compliance or violations could result in fines, criminal sanctions against us, our officers or employees, and prohibitions on the conduct of our business. Such violations could result in prohibitions on our ability to offer our products and services in one or more countries and could also materially damage our reputation, our brand, our international expansion efforts, our ability to attract and retain employees, our businesses and operating results. Our success depends, in part, on our ability to anticipate and manage these risks.\n16\nTable of  Contents\nCorning is exposed to risks associated with a global economy, including government fiscal and monetary policies\nUncertain or adverse economic and business conditions, including uncertainties and volatility in the financial markets, national debt, fiscal or monetary concerns, availability of government incentives, inflation and rising interest rates in various regions, could materially adversely impact Corning’s operating results. Markets for our products depend largely on business and consumer spending and demand for network capacity, electronics and automotive products. Uncertain or adverse economic and recessionary business conditions, among other factors, that could result in decreases in consumer spending and demand, or cause us to pass on increased costs to our customers, may cause certain of our customers to push out, cancel or refrain from purchasing our products, which could materially adversely impact demand for our products and our operating results.\nSimilarly, changes that result in sudden increases in consumer demand for electronic products have resulted in, and may continue to result in, a shortage of parts and materials needed to manufacture our products or the products in which our products are used. Such shortages, as well as shipment delays due to transportation interruptions, have adversely impacted, and may continue to adversely impact, our ability to meet our demand requirements.\nUncertain economic and industry conditions also make it more challenging for Corning to forecast its operating results, make business decisions and identify and prioritize the risks that may affect its businesses, sources and uses of cash, financial condition and results of operations. If Corning does not appropriately manage its business operations in response to changing economic and industry conditions, it could have a significant negative impact on its business performance and financial condition. Even during periods of economic uncertainty or lower revenues, Corning must continue to invest in research and development and maintain a global business infrastructure to compete effectively and support its customers, which can have a negative impact on its operating margins and earnings.\nWe are also subject to a variety of other risks in managing a global organization, including those related to:\n•\nThe economic and political conditions in each country or region and relationships among countries;\n•\nComplex regulatory requirements affecting international trade and investment, including anti-dumping laws, export controls, the Foreign Corrupt Practices Act and local laws prohibiting improper payments. Our operations may be adversely affected by changes in the substance or enforcement of these regulatory requirements, and by actual or alleged violations of them;\n•\nFluctuations in currency exchange rates, convertibility of currencies and restrictions involving the movement of funds between jurisdictions and countries;\n•\nGovernmental protectionist policies and sovereign and political risks that may adversely affect Corning’s profitability and assets;\n•\nAdverse changes relating to government grants, tax credits or other government incentives;\n•\nTariffs, trade duties and other trade barriers including anti-dumping and countervailing duties;\n•\nGeographical concentration of our factories and operations, and regional shifts in our customer base;\n•\nHealth crisis events, including epidemic or pandemic concerns;\n•\nPolitical unrest, geopolitical tensions, confiscation or expropriation of assets by foreign governments, terrorism and the potential for other hostilities;\n•\nDifficulty in protecting intellectual property, sensitive commercial and operations data and information technology systems;\n•\nDiffering legal systems, including protection and treatment of intellectual property and patents;\n•\nComplex, changing or competing tax regimes;\n•\nDifficulty in collecting obligations owed to us;\n•\nNatural disasters such as floods, earthquakes, tsunamis and windstorms; and\n•\nPotential loss of utilities or other disruptions affecting manufacturing.\nWe have significant exposure to foreign currency movements \nA large portion of our sales, profit and cash flows are transacted in non-U.S. dollar currencies, primarily the Japanese yen, South Korean won, New Taiwan dollar, Mexican peso, Chinese yuan and euro. The Company expects to continue to experience fluctuations in the U.S. dollar value of these activities if it is not possible, cost-effective or should we not elect to hedge certain currency exposure. Additionally, gains or losses may be experienced if the underlying exposure which has been hedged increases or decreases significantly.\nThe ultimate realized gain or loss with respect to currency fluctuations will generally depend on the size and type of cross-currency exposure that we have, the changes in exchange rates associated with those exposures, whether we have entered into foreign currency contracts to offset these exposures and other factors. \nThese factors could materially impact our results of operations, anticipated future results, financial position and cash flows.\n17\nTable of  Contents\nWe may have significant exposure to counterparties of our related derivatives portfolio \nWe maintain a significant portfolio of over-the-counter derivatives to hedge our projected currency exposure. We are exposed to potential losses in the event of non-performance by our counterparties to these derivative contracts. Any failure of a counterparty to pay on such a contract when due could materially impact our results of operations, financial position and cash flows.\nCurrent or future litigation or regulatory investigations may harm our financial condition or results of operations\nAs a global technology and manufacturing company, we are engaged in various litigation and regulatory matters. Litigation and regulatory proceedings may be uncertain, and adverse rulings could occur, resulting in significant liabilities, penalties or damages. Any such substantial legal liability or regulatory action could have a material adverse effect on our business, financial condition, cash flows and reputation.\nOur business is subject to various governmental regulations, and compliance with these regulations may cause us to incur significant expense. If we fail to maintain compliance with applicable regulations, we may be forced to cease the manufacture and distribution of certain products, and we could be subject to administrative proceedings and civil or criminal penalties\nOur products and operations are also subject to regulation by U.S. and non‐U.S. regulatory agencies, such as the U.S. Federal Trade Commission. From time to time, we may also be involved or required to participate in regulatory investigations or inquiries, into certain of our contracting and business practices, which may evolve into legal or other administrative proceedings. Growing public concern over concentration of economic power in corporations is likely to result in increased anti‐competition legislation, regulation, administrative rule making and enforcement activity. Involvement in regulatory investigations or inquiries, can be costly, lengthy, complex and time consuming, diverting the attention and energies of our management and technical personnel. If any pending or future governmental investigations result in an unfavorable resolution, we could be required to cease the manufacture and sale of the subject products or technology, pay fines or disgorge profits or other payments and/or cease certain conduct and/or modify our contracting or business practices, which could have a material adverse effect on our business, financial condition and results of operations. We may be obligated to indemnify our current or former directors or employees, or former directors or employees of companies that we have acquired, in connection with regulatory investigations. These liabilities could be substantial and may include, among other things, the cost of government, law enforcement or regulatory investigations and civil or criminal fines and penalties.\nOur global operations are subject to extensive trade and anti-corruption laws and regulations\nDue to the international scope of our operations, we are subject to a complex system of import- and export-related laws and regulations, including U.S. regulations issued by Customs and Border Protection, the Bureau of Industry and Security, the Office of Anti-boycott Compliance, the Directorate of Defense Trade Controls and the Office of Foreign Assets Control, as well as the counterparts of these agencies in other countries. Any alleged or actual violation by an employee or the Company may subject us to government scrutiny, investigation and civil and criminal penalties, and may limit our ability to import or export our products or to provide services outside the U.S. We cannot predict the nature, scope or effect of future regulatory requirements to which our operations might be subject to, based on the way existing laws might be administered or interpreted.\nIn addition, the U.S. Foreign Corrupt Practices Act and similar foreign anti-corruption laws generally prohibit companies and their intermediaries from making improper payments or providing anything of value to improperly influence foreign government officials to obtain or retain business or obtain an unfair advantage. Recent years have seen a substantial increase in the global enforcement of anti-corruption laws. Our continued operation and expansion outside the U.S., including in developing countries, could increase the risk of alleged violations. Violations of these laws may result in severe criminal or civil sanctions, could disrupt our business, and result in an adverse effect on our reputation, business and results of operations or financial condition.\nMoreover, several of our key customers are domiciled in areas of the world with laws, rules and business practices that may notably differ from those in the U.S., and we face the reputational and legal risk that our related partners may violate applicable laws, rules and business practices.\n18\nTable of  Contents\nInternational trade policies may negatively impact our ability to sell and manufacture our products outside of the U.S.\nGovernment policies on international trade and investment such as import quotas, tariffs and capital controls, whether adopted by individual governments or addressed by regional trade blocs, can affect the demand for our products and services, impact the competitive position of our products or prevent us, our equity affiliates or joint ventures, from being able to sell and manufacture products in certain countries. The implementation of more restrictive trade policies, such as higher tariffs or new barriers to entry, together with anti-dumping claims, duties, slowed regulatory approvals and other restrictions, in countries in which we import raw materials and components or sell large quantities of products and services could negatively impact our business, results of operations and financial condition. For example, a country’s adoption of nationalistic policies or retaliation by another government against such policies could have a negative impact on our results of operations. Further, these actions in conjunction with any trade tensions may restrict us from participating in a specific market or may prevent us from competing effectively.\n19\nTable of  Contents",
    "item1b": "Item 1B. Unresolved Staff Comments\nNone.",
    "item1c": "Item 1C. Cybersecurity\nCybersecurity Risk Management\nWe developed and implemented a cybersecurity risk management program intended to protect the confidentiality, integrity, and availability of our critical information technology (“IT”) systems and information.\nOur cybersecurity risk management program is integrated into our overall enterprise risk management program, and shares common methodologies, incident reporting channels and governance processes that apply across the enterprise risk management program to other legal, compliance, strategic, operational and financial risk areas.\n We designed and continue to assess our cybersecurity program based on the National Institute of Standards and Technology Cybersecurity Framework (“NIST CSF”), which we use as a guide to help us identify, prioritize and manage the cybersecurity risks that could materially affect our business, financial condition or results of operations.\nOur cybersecurity risk management program includes a cybersecurity incident response plan (“CIRP”). Corning’s CIRP provides the Company with the capability for responding, reporting and remediating cybersecurity incidents. It has been established to reduce or minimize the impact of cybersecurity incidents on the Company’s networks, IT systems, users or business processes. Corning’s Cyber Security Incident Response Team, led by the Chief Information Security Officer (“CISO”), handles the response process for all cybersecurity incidents and Corning’s Corporate Crisis Response Team (“CCRT”) is mobilized and involved in any significant incidents.\nOur cybersecurity risk management program also includes:\n•\na continuous vulnerability management process to monitor and identify threats in our environment, including our IT networks and legacy systems, that could potentially have a materially adverse impact on our critical systems, information and broader enterprise IT environment;\n•\nthe use of reputable cybersecurity consultants and other third-party experts to enhance our cybersecurity posture, assist us in evaluating risks, conduct security assessments and provide guidance so the Company can maintain a posture of continual enhancement of our cybersecurity management and strategy;\n•\ncybersecurity awareness training for our employees, incident response personnel and senior management; and\n•\na risk management process for critical third-party service providers, suppliers and vendors that includes due diligence in selection and periodic monitoring to ensure that they adhere to applicable cybersecurity standards.\nCybersecurity Governance\nCorning’s \nBoard of Directors\n (“Board”) plays a role in overseeing risks associated with cybersecurity threats. In particular, the IT Committee of the Board is responsible for cybersecurity governance and has information security oversight as a key component of its charter.\n In all meetings, the IT Committee reviews the Company’s cybersecurity posture as well as significant cybersecurity events. Corning’s Chief Digital and Information Officer (“CDIO”), in combination with Corning’s CISO, briefs the IT Committee on cybersecurity activities and long-term cybersecurity strategies, as well as general cybersecurity trends that could have a material impact on the Company.\n \nOn an annual basis, the CISO provides a cybersecurity update to the Board to review significant cybersecurity risks and their impact, if any, on internal controls. At any time, Board members may raise concerns regarding the Company’s cybersecurity posture and recommend future changes to controls or procedures. Should a cybersecurity incident rise to the level of a corporate crisis, consistent with the Company’s CCRT escalation protocols, the Board would be engaged.\nOur CDIO and our CISO lead our management team in assessing and managing our response to cybersecurity threats and incidents. Our CDIO and CISO together have over 50 years of combined experience in information technology, digital and systems transformation, cybersecurity and related risk management and governance.\n This team has primary responsibility for our overall cybersecurity risk management program and supervises both our internal cybersecurity personnel and our retained external cybersecurity consultants, and works with all divisional, manufacturing and functional teams within Corning on cybersecurity issues. The team’s efforts to prevent, detect, mitigate and remediate cybersecurity risks and incidents are enhanced by briefings from internal security personnel, by receipt of threat intelligence and other information obtained from governmental, public or private sources, including external consultants engaged by us, periodic assessments against the NIST CSF and through alerts and reports produced by security tools deployed in our IT environment.\n \nWhile Corning has had to address various cybersecurity threats in the ordinary course of its business, we have not identified risks from cybersecurity threats, including as a result of any prior cybersecurity incidents, that have or are reasonably likely to materially affect us, including our operations, business strategy, results of operations, or financial condition.\n20\nTable of  Contents"
  }
}