{
  "ticker": "GM",
  "cik": "0001467858",
  "company_name": "General Motors Co",
  "filing_date": "2025-01-28",
  "accession": "0001467858-25-000032",
  "primary_doc": "gm-20241231.htm",
  "item_sections": {
    "item1": "Item 1. Business for a further discussion on Cruise. In conjunction with our announcement to no longer fund Cruise’s robotaxi development work and our plans to combine the Cruise and GM technical efforts to advance autonomous and assisted driving, Cruise recorded net charges of $0.5 billion. These charges primarily relate to anticipated headcount reductions and impairments of real estate lease assets and certain intangible assets.\nAutomotive Financing - GM Financial Summary and Outlook  \nWe believe that offering a comprehensive suite of financing products will generate incremental sales of our vehicles, drive incremental GM Financial earnings and help support our sales throughout various economic cycles. GM Financial's penetration of our retail sales in the U.S. was 39% in the year ended December 31, 2024 and 42% in the corresponding period in 2023. Penetration levels vary depending on incentive financing programs available and competing third-party financing products in the market. GM Financial's prime loan originations as a percentage of total loan originations in North America was 81% in the year ended December 31, 2024 and 82% in the corresponding period in 2023. In the year ended December 31, 2024, GM Financial's revenue consisted of leased vehicle income of 46%, retail finance charge income of 40% and commercial finance charge income of 8%.\nGM Financial's leasing program is exposed to residual values, which are heavily dependent on used vehicle prices. Gains on terminations of leased vehicles of $0.8 billion and $0.9 billion were included in GM Financial interest, operating and other expenses in the years ended December 31, 2024 and 2023. The decrease in gains is primarily due to fewer terminated leases in 2024 compared to 2023. The following table summarizes the estimated residual value based on GM Financial's most recent \n28\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nestimates and the number of units included in GM Financial Equipment on operating leases, net by vehicle type (units in thousands):\nDecember 31, 2024\nDecember 31, 2023\nResidual Value\nUnits\nPercentage\nResidual Value\nUnits\nPercentage\nCrossovers\n$\n13,184 \n635 \n67.3 \n%\n$\n12,830 \n648 \n67.5 \n%\nTrucks\n7,458 \n224 \n23.7 \n%\n6,793 \n210 \n21.9 \n%\nSUVs\n2,260 \n53 \n5.6 \n%\n2,304 \n58 \n6.0 \n%\nCars\n590 \n31 \n3.3 \n%\n734 \n44 \n4.6 \n%\nTotal\n$\n23,492 \n943 \n100.0 \n%\n$\n22,661 \n960 \n100.0 \n%\nAs a result of the market challenges and competitive conditions in China, GM Financial recorded a $0.3 billion other-than-temporary impairment charge to write down its SAIC-GMAC investment to its fair value. Refer to the \"Overview – GMI\" section of this MD&A for discussion of the China market and associated restructuring actions being taken.\nConsolidated Results  \nWe review changes in our results of operations under five categories: Volume, Mix, Price, Cost and Other. Volume measures the impact of changes in wholesale vehicle volumes driven by industry volume, market share and changes in dealer stock levels. Mix measures the impact of changes to the regional portfolio due to product, model, trim, country and option penetration in current year wholesale vehicle volumes. Price measures the impact of changes related to Manufacturer’s Suggested Retail Price and various sales allowances. Cost primarily includes: (1) material and freight; (2) manufacturing, engineering, advertising, administrative and selling and warranty expense; and (3) non-vehicle related activity. Other primarily includes foreign exchange and non-vehicle related automotive revenues as well as equity income or loss from our nonconsolidated affiliates. Refer to the regional sections of this MD&A for additional information. \nTotal Net Sales and Revenue\n \nYears Ended December 31,\nFavorable/ (Unfavorable)\nVariance Due To\n2024\n2023\n%\nVolume\nMix\nPrice\nOther\n(Dollars in billions)\nGMNA\n$\n157,509 \n$\n141,445 \n$\n16,064 \n11.4 \n%\n$\n12.8 \n$\n2.5 \n$\n0.7 \n$\n— \nGMI\n13,890 \n15,949 \n(2,059)\n(12.9)\n%\n$\n(1.6)\n$\n0.4 \n$\n0.2 \n$\n(1.1)\nCorporate\n206 \n273 \n(67)\n(24.5)\n%\n$\n— \n$\n(0.1)\nAutomotive \n171,605 \n157,667 \n13,938 \n8.8 \n%\n$\n11.2 \n$\n2.9 \n$\n0.9 \n$\n(1.1)\nCruise\n257 \n102 \n155 \nn.m.\n$\n— \n$\n0.2 \nGM Financial\n15,875 \n14,225 \n1,650 \n11.6 \n%\n$\n1.7 \nEliminations/reclassifications\n(296)\n(151)\n(145)\n(96.0)\n%\n$\n— \n$\n(0.1)\nTotal net sales and revenue\n$\n187,442 \n$\n171,842 \n$\n15,598 \n9.1 \n%\n$\n11.2 \n$\n2.9 \n$\n0.9 \n$\n0.6 \n__________\nn.m. = not meaningful\nRefer to the regional sections of this MD&A for additional information on Volume, Mix, Price and Other.\n29\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nAutomotive and Other Cost of Sales \nYears Ended December 31,\nFavorable/ (Unfavorable)\nVariance Due To\n2024\n2023\n%\nVolume\nMix\nCost\nOther\n(Dollars in billions)\nGMNA\n$\n135,818 \n$\n123,577 \n$\n(12,241)\n(9.9)\n%\n$\n(8.9)\n$\n(5.5)\n$\n2.2 \n$\n0.1 \nGMI\n12,552 \n14,164 \n1,612 \n11.4 \n%\n$\n1.2 \n$\n(0.3)\n$\n(0.2)\n$\n0.8 \nCorporate\n132 \n513 \n381 \n74.3 \n%\n$\n— \n$\n0.4 \n$\n— \nCruise\n2,566 \n3,088 \n522 \n16.9 \n%\n$\n— \n$\n0.5 \nEliminations\n(3)\n(12)\n(9)\n(75.0)\n%\n$\n— \n$\n— \nTotal automotive and other cost of sales\n$\n151,065 \n$\n141,330 \n$\n(9,735)\n(6.9)\n%\n$\n(7.7)\n$\n(5.8)\n$\n2.9 \n$\n0.9 \nThe most significant element of our Automotive and other cost of sales is material cost, which makes up approximately two-thirds of the total amount. The remaining portion includes labor costs, depreciation and amortization, engineering, freight and product warranty and recall campaigns.\nFactors that most significantly influence a region's profitability are industry volume, market share and the relative mix of vehicles (trucks, crossovers, cars) sold. Variable profit is a key indicator of product profitability. Variable profit is defined as revenue less material cost, freight, the variable component of manufacturing expense and warranty and recall-related costs. Vehicles with higher selling prices generally have higher variable profit. Refer to the regional sections of this MD&A for additional information on Volume and Mix.\nIn the year ended December 31, 2024, decreased Cost was primarily due to: (1) decreased inventory adjustments of $2.2 billion, primarily EV-related, to reflect the net realizable value at period end; (2) the absence of charges related to the voluntary separation program (VSP) of $0.7 billion; (3) decreased engineering costs of $0.7 billion, driven primarily by lower AV engineering costs; (4) increased equity earnings related to Ultium Cells Holdings LLC of $0.7 billion; (5) decreased material and freight costs of $0.3 billion; partially offset by (6) increased other employee-related costs of $0.6 billion; (7) increased charges of $0.5 billion related to restructuring costs resulting from the plan to realign Cruise with our existing GM technical teams to develop personal AV technology; (8) increased warranty-related costs of $0.4 billion; and (9) increased information technology costs of $0.3 billion. In the year ended December 31, 2024, favorable Other was primarily due to net foreign currency changes in the Brazilian real and the Korean won.\nAutomotive and Other Selling, General and Administrative Expense\nYears Ended December 31,\nYear Ended \n2024 vs. 2023 Change\n2024\n2023\n2022\nFavorable/ (Unfavorable)\n%\nAutomotive and other selling, general and administrative expense\n$\n10,621 \n$\n9,840 \n$\n10,667 \n$\n(781)\n(7.9)\n%\nIn the year ended December 31, 2024, Automotive and other selling, general and administrative expense increased primarily due to: (1) increased charges of $0.4 billion related to strategic activities to transition certain Buick dealerships; and (2) increased advertising, selling and administrative costs of $0.3 billion.\n30\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nInterest Income and Other Non-operating Income, net\nYears Ended December 31,\nYear Ended \n2024 vs. 2023 Change\n2024\n2023\n2022\nFavorable/ (Unfavorable)\n%\nInterest income and other non-operating income, net\n$\n1,257 \n$\n1,537 \n$\n1,432 \n$\n(280)\n(18.2)\n%\nIn the year ended December 31, 2024, Interest income and other non-operating income, net decreased primarily due to several insignificant items.\nIncome Tax Expense\nYears Ended December 31,\nYear Ended \n2024 vs. 2023 Change\n2024\n2023\n2022\nFavorable/ (Unfavorable)\n%\nIncome tax expense\n$\n2,556 \n$\n563 \n$\n1,888 \n$\n(1,993)\nn.m.\n__________\nn.m. = not meaningful\nIn the year ended December 31, 2024, Income tax expense \nincreased \nprimarily d\nue to jurisdictional mix of earnings and valuation allowance adjustments that occurred in the year ended \nDecember 31, 2023\n. \nFor the year ended December 31, 2024, our effective tax rate-adjusted (ETR-adjusted) was\n 20.1%.\n We expect our adjusted effective tax rate to be between 18% and 20% for the year ending December 31, 2025. \nRefer to Note 17 to our consolidated financial statements for additional information related to Income tax expense.\nGM North America \nYears Ended December 31,\nFavorable/ (Unfavorable)\nVariance Due To\n2024\n2023\n%\nVolume\nMix\nPrice\nCost\nOther\n(Dollars in billions)\nTotal net sales and revenue\n$\n157,509 \n$\n141,445 \n$\n16,064 \n11.4 \n%\n$\n12.8 \n$\n2.5 \n$\n0.7 \n$\n— \nEBIT-adjusted\n$\n14,528 \n$\n12,306 \n$\n2,222 \n18.1 \n%\n$\n3.9 \n$\n(3.1)\n$\n0.7 \n$\n1.3 \n$\n(0.6)\nEBIT-adjusted margin\n9.2 \n%\n8.7 \n%\n0.5 \n%\n(Vehicles in thousands)\nWholesale vehicle sales\n3,464 \n3,147 \n317 \n10.1 \n%\nGMNA Total Net Sales and Revenue  \nIn the year ended December 31, 2024, Total net sales and revenue increased primarily due to: (1) increased net wholesale volumes primarily due to increased sales of full-size pickup trucks, mid-size pickup trucks and other vehicles; (2) favorable Mix associated with increased sales of full-size pickup trucks and full-size SUVs, partially offset by increased sales of crossover vehicles; and (3) favorable Price as a result of stable dealer inventory levels and strong demand for our products.\nGMNA EBIT-Adjusted  \nThe most significant factors that influence profitability are industry volume and market share. While not as significant as industry volume and market share, another factor affecting profitability is the relative mix of vehicles sold. Trucks, crossovers and cars sold currently have a variable profit of approximately 160%, 40% and 50% of our GMNA portfolio on a weighted-average basis. \nIn the year ended December 31, 2024, EBIT-adjusted increased primarily due to: (1) increased net wholesale volumes primarily due to increased sales of full-size pickup trucks, mid-size pickup trucks and crossover vehicles; (2) favorable Cost primarily due to decreased inventory adjustments of $2.1 billion, primarily EV-related, to reflect the net realizable value at period end, increased equity earnings related to Ultium Cells Holdings LLC of $0.7 billion and decreased material and freight costs of $0.6 billion, partially offset by increased other employee-related costs of $0.7 billion, increased engineering costs of $0.5 billion, primarily due to a decrease in cost sharing arrangements with our Automotive China JVs, increased warranty-\n31\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nrelated costs of $0.4 billion, increased information technology costs of $0.3 billion and increased other cost of sales of $0.3 billion; and (3) favorable Price; partially offset by (4) unfavorable Mix associated with increased sales of crossover vehicles and EVs; and (5) unfavorable Other due to net foreign currency changes primarily in the Mexican peso.\nGM International\nYears Ended December 31,\nFavorable/ (Unfavorable)\nVariance Due To\n2024\n2023\n%\nVolume\nMix\nPrice\nCost\nOther\n(Dollars in billions)\nTotal net sales and revenue\n$\n13,890 \n$\n15,949 \n$\n(2,059)\n(12.9)\n%\n$\n(1.6)\n$\n0.4 \n$\n0.2 \n$\n(1.1)\nEBIT-adjusted\n$\n303 \n$\n1,210 \n$\n(907)\n(75.0)\n%\n$\n(0.4)\n$\n0.1 \n$\n0.2 \n$\n(0.2)\n$\n(0.7)\nEBIT-adjusted margin\n2.2 \n%\n7.6 \n%\n(5.4)\n%\nEquity income (loss) — Automotive China\n$\n(4,407)\n$\n446 \n$\n(4,853)\nn.m.\nEBIT-adjusted — excluding Equity income (loss)(a)\n$\n633 \n$\n764 \n$\n(131)\n(17.1)\n%\n(Vehicles in thousands)\nWholesale vehicle sales\n547 \n621 \n(74)\n(11.9)\n%\n__________\nn.m. = not meaningful\n(a)    Excludes adjustments related to Automotive China JVs restructuring recorded in GMI. Refer to the \"Overview – GMI\" section of this MD&A for discussion of these adjustments.\nThe vehicle sales of our Automotive China JVs are not recorded in Total net sales and revenue. The results of our joint ventures are recorded in Equity income (loss), which is included in EBIT-adjusted above.\nGMI Total Net Sales and Revenue \n In the year ended December 31, 2024, Total net sales and revenue decreased primarily due to: (1) decreased net wholesale volumes in South America, in Asia/Pacific and in the Middle East primarily due to decreased sales of passenger cars and crossover vehicles, partially offset by higher sales of trucks; and (2) unfavorable Other primarily due to the foreign currency effect resulting from the weakening of the Brazilian real and Egyptian pound against the U.S. dollar and decreased components sales; partially offset by (3) favorable Mix primarily in Brazil and in the Middle East; and (4) favorable pricing across multiple vehicle lines in the Middle East and in Brazil.\nGMI EBIT-Adjusted \n In the year ended December 31, 2024, EBIT-adjusted decreased primarily due to: (1) unfavorable Other primarily due to decreased Automotive China JVs equity income (loss); (2) decreased net wholesale volumes; and (3) unfavorable Cost primarily due to increased material costs and unfavorable impact due to nonrecurring asset sale in Korea, partially offset by favorable fixed cost; partially offset by (4) favorable Price; and (5) favorable Mix in South America.\nOur Automotive China JVs’ ability to grow vehicle sales in China and generate sustainable equity income continues to be a challenge due to intense competition from our domestic competitors in the Chinese market. In the year ended December 31, 2024, we recognized equity losses of $4.4 billion driven primarily by impairment and restructuring charges of $4.1 billion for certain of our Automotive China JVs. Refer to Note 8 to our consolidated financial statements for additional information. The following table summarizes certain key operational and financial data for the Automotive China JVs (vehicles in thousands): \nYears Ended December 31,\n2024\n2023\n2022\nWholesale vehicle sales including vehicles exported to markets outside of China\n1,843 \n2,334 \n2,639 \nTotal net sales and revenue\n$\n21,740 \n$\n31,435 \n$\n35,857 \nNet income (loss)\n$\n(4,466)\n$\n1,122 \n$\n1,407 \nDecember 31, 2024\nDecember 31, 2023\nCash and cash equivalents\n$\n6,389 \n$\n6,875 \nDebt\n$\n104 \n$\n202 \n32\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nCruise\nYears Ended December 31,\n2024 vs. 2023 Change\n2024\n2023\n2022\nFavorable/ (Unfavorable)\n%\nTotal net sales and revenue(a)\n$\n257 \n$\n102 \n$\n102 \n$\n155 \nn.m.\nEBIT (loss)-adjusted\n$\n(1,701)\n$\n(2,695)\n$\n(1,890)\n$\n994 \n36.9 \n%\n__________\nn.m. = not meaningful\n(a)    Primarily reclassified to Interest income and other non-operating income, net in our consolidated income statements in each of the years ended \nDecember 31, 2024\n, \n2023\n and \n2022\n.\nCruise EBIT (Loss)-Adjusted  \nIn the year ended December 31, 2024, EBIT (loss)-adjusted decreased primarily due to the restructuring actions taken in the year ended December 31, 2023 that resulted in a decrease in the development costs associated with Cruise's refocused operating strategy. Following the acquisition of the noncontrolling interests and subject to the approval of the Cruise Board of Directors, we expect that the plans to combine the Cruise and GM technical efforts to advance autonomous and assisted driving will reduce Cruise's costs going forward.\nGM Financial\nYears Ended December 31,\n2024 vs. 2023 Change\n2024\n2023\n2022\nAmount\n%\nTotal revenue\n$\n15,875 \n$\n14,225 \n$\n12,766 \n$\n1,650 \n11.6 \n%\nProvision for loan losses\n$\n1,029 \n$\n826 \n$\n654 \n$\n203 \n24.6 \n%\nEBT-adjusted\n$\n2,965 \n$\n2,985 \n$\n4,076 \n$\n(20)\n(0.7)\n%\nAverage debt outstanding (dollars in billions)\n$\n109.0 \n$\n100.4 \n$\n93.8 \n$\n8.6 \n8.6 \n%\nEffective rate of interest paid\n5.5 \n%\n4.7 \n%\n3.1 \n%\n0.8 \n%\nGM Financial Revenue  \nIn the year ended December 31, 2024, total revenue increased primarily due to: (1) increased finance charge income of $1.5 billion primarily due to an increase in the effective yield resulting from higher average interest rates on new loans and growth in the size of the portfolio; and (2) increased other income of $0.2 billion primarily due to higher investment income resulting from an increase in the average investment balance and growth in vehicle protection contracts.\nGM Financial EBT-Adjusted  \nIn the year ended December 31, 2024, earnings before income taxes-adjusted (EBT-adjusted) decreased primarily due to: (1) increased interest expense of $1.3 billion primarily due to an increased effective rate of interest on debt, resulting from higher benchmark interest rates on new issuances relative to maturing debt, as well as an increase in average debt outstanding; (2) increased provision for loan losses of $0.2 billion primarily due to increased loan origination volume and moderating credit performance and recovery rates; and (3) decreased equity income of $0.1 billion primarily due to lower earning asset levels at its joint ventures in China; partially offset by (4) increased finance charge income of $1.5 billion primarily due to an increase in the effective yield resulting from higher average interest rates on new loans and growth in the size of the portfolio; and (5) increased other income of $0.2 billion primarily due to higher investment income resulting from an increase in the average investment balance and growth in vehicle protection contracts.\nLiquidity and Capital Resources  \nWe believe our current levels of cash, cash equivalents, marketable debt securities, available borrowing capacity under our credit facilities and other liquidity actions currently available to us are sufficient to meet our liquidity requirements in the short- and long-term. We also maintain access to the capital markets and may issue debt or equity securities, which may provide an additional source of liquidity. We have substantial cash requirements going forward, which we plan to fund through our total available liquidity, cash flows from operating activities and additional liquidity measures, if determined to be necessary. \nOur known current material uses of cash include, among other possible demands: (1) capital spending and our investments in our battery cell manufacturing joint ventures of approximately $10.0 billion to $11.0 billion in 2025; (2) payments for engineering and product development activities\n,\n including the development of AV technology and software-enabled services; (3) payments associated with previously announced vehicle recalls and any other recall-related contingencies; (4) payments to service debt and other long-term obligations, including discretionary and mandatory contributions to our pension plans; (5) dividend payments on our common stock that are declared by our Board of Directors; (6) payments to purchase shares of our \n33\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\ncommon stock authorized by our Board of Directors; and (7) payments of emissions-related regulatory compliance costs. Refer to Note 7, Note 13 and Note 15 to our consolidated financial statements for additional funding requirements for our operating leases, debt and pension plans. Our material future uses of cash, which may vary from time to time based on market conditions and other factors, are focused on the three objectives of our capital allocation program: (1) grow our business at an average target return on invested capital-adjusted (ROIC-adjusted) rate of 20% or greater; (2) maintain a strong investment-grade balance sheet, including a target average automotive cash balance of $18.0 billion; and (3) after the first two objectives are met, return available cash to shareholders. Our senior management evaluates our capital allocation program on an ongoing basis and recommends any modifications to the program to our Board of Directors not less than once annually. \nWe continue to monitor and evaluate opportunities to strengthen our competitive position over the long term while maintaining a strong investment-grade balance sheet. These actions may include opportunistic payments to reduce our long-term obligations, as well as the possibility of acquisitions, dispositions and investments with joint venture partners, as well as strategic alliances that we believe would generate significant advantages and substantially strengthen our business. To support our transition to EVs, we anticipate making investments in suppliers or providing funding towards the execution of strategic, multi-year supply agreements to secure critical materials. In addition, we have entered, and plan to continue to enter, into offtake agreements that generally obligate us to purchase defined quantities of output. These arrangements could have a short-term adverse impact on our cash and increase our inventory.\nOur liquidity plans are subject to a number of risks and uncertainties, including those described in the \"Forward-Looking Statements\" section of this MD&A and Part I,",
    "item1a": "Item 1A. Risk Factors.\nWe caution readers not to place undue reliance on forward-looking statements. Forward-looking statements speak only as of the date they are made, and we undertake no obligation to update publicly or otherwise revise any forward-looking statements, whether as a result of new information, future events or other factors, except where we are expressly required to do so by law.\n*  *  *  *  *  *  *\nItem 7A.\n \nQuantitative and Qualitative Disclosures About Market Risk\nThe overall financial risk management program is under the responsibility of the Chief Financial Officer with support from the Financial Risk Council, which reviews and, where appropriate, approves strategies to be pursued to mitigate these risks. The Financial Risk Council comprises members of our management and functions under the oversight of the Audit Committee and Finance Committee of the Board of Directors. The Audit Committee and Finance Committee assist and guide the Board of Directors in its oversight of our financial and risk management strategies. A risk management control framework is utilized to monitor the strategies, risks and related hedge positions in accordance with the policies and procedures approved by the Financial Risk Council. Our financial risk management policy is designed to protect against risk arising from large adverse market movements on our key exposures. \nAutomotive  \nThe following analyses provide quantitative information regarding exposure to foreign currency exchange rate risk, interest rate risk and commodity risk. Sensitivity analysis is used to measure the potential loss in the fair value of financial instruments with exposure to market risk. The models used assume instantaneous, parallel shifts in exchange rates, interest rate yield curves and commodity prices. For options and other instruments with nonlinear returns, models appropriate to these types of instruments are utilized to determine the effect of market shifts. There are certain shortcomings inherent in the sensitivity analyses presented, primarily due to the assumption that interest rates change in a parallel fashion and that spot exchange rates and commodity prices change instantaneously. In addition, the analyses are unable to reflect the complex market reactions that normally would arise from the market shifts modeled and do not contemplate the effects of correlations between foreign currency exposures and offsetting long-short positions in currency or other exposures, such as interest rates and commodity prices, which may significantly reduce the potential loss in value.\nForeign Currency Exchange Rate Risk  \nWe have foreign currency exposures related to buying, selling and financing in currencies other than the functional currencies of our operations. At December 31, 2024, our most significant foreign currency exposures were between the U.S. dollar and the Canadian dollar, Chinese yuan, Korean won, Mexican peso and Brazilian real. Derivative instruments such as foreign currency forwards, swaps and options are primarily used to hedge exposures with respect to forecasted revenues, costs and commitments denominated in foreign currencies. Such contracts had remaining maturities of up to 12 months at December 31, 2024.\n \nThe net fair value liability of financial instruments with exposure to foreign currency risk was $0.2 billion and $0.4 billion at December 31, 2024 and 2023. These amounts are calculated utilizing a population of foreign currency exchange derivatives and foreign currency denominated debt and exclude the offsetting effect of foreign currency cash, cash equivalents and other assets. The potential loss in fair value for such financial instruments from a 10% adverse change in all quoted foreign currency exchange rates would have been $0.3 billion and insignificant at December 31, 2024 and 2023.\nWe are exposed to foreign currency risk due to the translation and remeasurement of the results of certain international operations into U.S. dollars as part of the consolidation process. Fluctuations in foreign currency exchange rates can therefore create volatility in the results of operations and may adversely affect our financial condition.\n47\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nThe following table summarizes the amounts of automotive foreign currency translation, transaction and remeasurement (gains) losses:\nYears Ended December 31,\n2024\n2023\nTranslation (gains) losses recorded in Accumulated other comprehensive loss\n$\n765 \n$\n(169)\nTransaction and remeasurement (gains) losses recorded in earnings\n$\n(314)\n$\n344 \nInterest Rate Risk  \nWe are subject to market risk from exposure to changes in interest rates related to certain financial instruments, primarily debt, finance lease obligations and certain marketable debt securities. At December 31, 2024, interest rate swap positions were used to manage interest rate exposures in our automotive operations and were insignificant. The fair value of debt and finance leases was $15.2 billion and $16.5 billion at December 31, 2024 and 2023. The potential increase in fair value resulting from a 10% decrease in quoted interest rates would have been $0.7 billion at December 31, 2024 and 2023.     \nWe had marketable debt securities of $7.3 billion and $7.6 billion classified as available-for-sale at December 31, 2024 and 2023. The potential decrease in fair value from a 50 basis point increase in interest rates would have been insignificant at December 31, 2024 and 2023.\nCommodity Risk\n  We have commodity price risk which could have an impact of our financial results as result of fluctuations in the prices of commodities used in vehicle production. At December 31, 2024 we used derivative instruments such as commodity forwards, swaps and options to hedge a portion of our exposures with respect to forecasted commodity purchases of steel, copper, aluminum, palladium, lithium and nickel.\nThe net fair value liability of financial instruments with exposure to commodity price movements was insignificant at December 31, 2024 and 2023. The potential change in fair value for such financial instruments from a 10% adverse change in the underlying commodity prices would have been $0.2 billion and insignificant at December 31, 2024 and 2023.\nAutomotive Financing - GM Financial\nInterest Rate Risk\n  Fluctuations in market interest rates can affect GM Financial's gross interest rate spread, which is the difference between interest earned on finance receivables and interest paid on debt. GM Financial is exposed to interest rate risks as financial assets and liabilities have different characteristics that may impact financial performance. These differences may include tenor, yield, repricing timing and prepayment expectations. Typically, retail finance receivables and leases purchased by GM Financial earn fixed interest and commercial finance receivables originated by GM Financial earn variable interest. GM Financial funds its business with variable or fixed rate debt. The variable rate debt is subject to adjustments to reflect prevailing market interest rates. To help mitigate interest rate risk or mismatched funding, GM Financial may employ hedging.\nQuantitative Disclosure \n GM Financial measures the sensitivity of its net interest income to changes in interest rates by using interest rate scenarios that assume a hypothetical, instantaneous parallel shift of one hundred basis points in all interest rates across all maturities, as well as a base case that assumes that rates perform at the current market forward curve. However, interest rate changes are rarely instantaneous or parallel and rates could move more or less than the one percentage point assumed in GM Financial's analysis. Therefore, the actual impact to net interest income could be higher or lower than the results detailed in the table below. These interest rate scenarios are purely hypothetical and do not represent GM Financial's view of future interest rate movements. \n48\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nAt December 31, 2024, GM Financial moved to an asset-sensitive profile from a liability-sensitive profile in 2023, meaning that more assets than liabilities were expected to reprice within the next 12 months. During a period of rising interest rates, the interest earned on assets would increase more than the interest paid on liabilities, which would initially increase net interest income. During a period of falling interest rates, net interest income would be expected to initially decrease.\nThe following table presents GM Financial's net interest income sensitivity to interest rate movement:\nYears Ended December 31,\n2024\n2023\nOne hundred basis points instantaneous increase in interest rates\n$\n5.6 \n$\n(7.7)\nOne hundred basis points instantaneous decrease in interest rates(a)\n$\n(5.6)\n$\n7.7 \n__________\n(a)    Net interest income sensitivity given a one hundred basis point decrease in interest rates requires an assumption of negative interest rates in markets where existing interest rates are below one percent.\nAdditional Model Assumptions\n  The sensitivity analysis presented is GM Financial's best estimate of the effect of the hypothetical interest rate scenarios; however, actual results could differ. The estimates are also based on assumptions including the amortization and prepayment of the finance receivable portfolio, originations of finance receivables and leases, refinancing of maturing debt, replacement of maturing derivatives and exercise of options embedded in debt and derivatives. The prepayment projections are based on historical experience. If interest rates or other factors change, actual prepayment experience could be different than projected.\nForeign Currency Exchange Rate Risk  \nGM Financial is exposed to foreign currency risk due to the translation and remeasurement of the results of certain international operations into U.S. dollars as part of the consolidation process. Fluctuations in foreign currency exchange rates can therefore create volatility in the results of operations and may adversely affect GM Financial's financial condition.\nGM Financial primarily finances its receivables and leased assets with debt in the same currency. When a different currency is used, GM Financial may use foreign currency swaps to convert substantially all of its foreign currency debt obligations to the local currency of the receivables and leased assets to minimize any impact to earnings. As a result, GM Financial believes its market risk exposure relating to changes in currency exchange rates at December 31, 2024 was insignificant.\nGM Financial had foreign currency swaps with notional amounts of $8.4 billion and $8.0 billion at December 31, 2024 and 2023. The net fair value of these derivative financial instruments was a liability of $0.4 billion and $0.2 billion at December 31, 2024 and 2023.\nThe following table summarizes GM Financial's foreign currency translation, transaction and remeasurement (gains) losses:\nYears Ended December 31,\n2024\n2023\nTranslation (gains) losses recorded in Accumulated other comprehensive loss\n$\n403 \n$\n(147)\nTransaction and remeasurement (gains) losses recorded in earnings\n$\n(7)\n$\n5 \n*  *  *  *  *  *  *\n49\nTable of Contents\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\n \nTo the Shareholders and the Board of Directors of General Motors Company\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of General Motors Company and subsidiaries (the Company) as of December 31, 2024 and 2023, the related consolidated income statements and consolidated statements of comprehensive income, cash flows and equity for each of the three years in the period ended December 31, 2024, and the related notes (collectively referred to as the “financial statements”). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated January 28, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate. \nProduct warranty and recall campaigns\nDescription of the matter\nAs discussed in Note 12 to the financial statements, the liabilities for product warranty and recall campaigns amount to $10.6 billion at December 31, 2024. The Company accrues for costs related to product warranty at the time of vehicle sale and accrues the estimated cost of recall campaigns when they are probable and estimable.\nAuditing these liabilities involved a high degree of subjectivity in evaluating management’s estimates due to the size, uncertainties, and potential volatility related to the estimated liabilities. Management’s estimates consider historical claims experience, including the nature, frequency, and average cost of claims of each vehicle line or each model year of the vehicle line, and the key assumptions of historical data being predictive of future activity and events, specifically the number of historical periods used and the weighting of historical data in the reserve studies.\n50\nTable of Contents\nHow we addressed the matter in our audit\nWe evaluated the design and tested the operating effectiveness of internal controls over the Company’s product warranty and recall campaign processes. We tested internal controls over management’s review of the valuation models and significant assumptions for product warranty and recall, including the warranty claims forecasted based on the frequency and average cost per warranty claim for product warranty, and the cost estimates related to recall campaigns. Our audit also included the evaluation of controls that address the completeness and accuracy of the data utilized in the valuation models.\nOur audit procedures related to product warranty and recall campaigns also included, among others, evaluating the Company’s estimation methodology, the related significant assumptions and underlying data, and performing analytical procedures to corroborate cost per vehicle based on historical claims data. Furthermore, we performed sensitivity analyses to evaluate the significant judgments made by management, including cost estimates to evaluate the impact on reserves from changes in assumptions. We performed analysis over the vehicle lines and model years that had little or no claims experience to ensure the vehicle and model substitutions are comparable. We also involved actuarial specialists to evaluate the methodologies and assumptions, and to test the actuarial calculations used by the Company.\nSales incentives\nDescription of the matter\nAs discussed in Note 2 to the financial statements, Automotive net sales and revenue represents the amount of consideration to which the Company expects to be entitled in exchange for transferring goods or providing services, which is net of estimated dealer and customer sales incentives the Company reasonably expects to pay. Provisions for dealer and customer sales incentives are recorded as a reduction to Automotive net sales and revenue at the time of vehicle sale. The liabilities for dealer and customer allowances, claims and discounts amount to $7.3 billion at December 31, 2024. \nAuditing the estimate of sales incentives involved a high degree of judgment. Significant factors used by the Company in estimating its liability for sales incentives include type of program, forecasted sales volume, product mix, and the rate of customer acceptance of incentive programs, all of which are estimated based on historical experience and assumptions concerning future customer behavior and market conditions. The Company’s estimation model reflects the best estimate of the total incentive amount that the Company reasonably expects to pay at the time of sale. The estimated cost of incentives is forward-looking, and could be materially affected by future economic and market conditions.\nHow we addressed the matter in our audit\nWe evaluated the design and tested the operating effectiveness of internal controls over the Company’s sales incentive process, including management’s review of the estimation model, the significant assumptions (e.g., incentive cost per unit, customer take rate, and market conditions), and the data inputs used in the model. \nOur audit procedures included, among others, the performance of analytical procedures to develop an independent range of the liability for sales incentives as of the balance sheet date. Our independent range was developed for comparison to the Company’s recorded liability, and is based on historical claims, forecasted spend, and the specific vehicle mix of current dealer stock. In addition, we performed sensitivity analyses over the cost per unit assumption developed by management to evaluate the impact on the liability resulting from a change in the assumption. Lastly, we assessed management’s forecasting process by performing quarterly hindsight analyses to assess the adequacy of prior forecasts.\nValuation of GM Financial equipment on operating leases\nDescription of the matter\nGM Financial has recorded investments in vehicles leased to retail customers under operating leases. As discussed in Note 2 to the financial statements, at the beginning of the lease, management establishes an expected residual value for each vehicle at the end of the lease term. During the term of a lease, management periodically evaluates the estimated residual value and may adjust the value downward or upward. The Company’s estimated residual value of leased vehicles at the end of lease term was $23.5 billion as of December 31, 2024. \n51\nTable of Contents\nAuditing management’s estimate of the residual value of leased vehicles involved a high degree of judgment. Management’s estimate is based, in part, on third-party data which considers inputs including recent auction values and assumptions regarding the expected future volume of leased vehicles that will be returned to the Company, used car prices, manufacturer incentive programs and fuel prices. Realization of the residual values is dependent on the future ability to market the vehicles under future prevailing market conditions.\nHow we addressed the matter in our audit\nWe evaluated the design and tested the operating effectiveness of the Company’s controls over the lease residual estimation process, including controls over management’s review of residual value estimates obtained from the Company’s third-party provider and other significant assumptions.\n \nOur procedures also included, among others, independently recalculating depreciation related to equipment on operating leases and performing sensitivity analyses related to significant assumptions. We also performed hindsight analyses to assess the propriety of management’s estimate of residual values, as well as tested the completeness and accuracy of data from underlying systems and data warehouses that are used in the estimation models.\n/\ns\n/ Ernst & Young LLP\nWe have served as the Company's auditor since 2017.\nDetroit, Michigan\nJanuary 28, 2025\n52\nTable of Contents\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\n \n \nTo the Shareholders and the Board of Directors of General Motors Company \nOpinion on Internal Control Over Financial Reporting\nWe have audited General Motors Company and subsidiaries’ internal control over financial reporting as of December 31, 2024, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, General Motors Company and subsidiaries (the Company) maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of December 31, 2024 and 2023, the related consolidated income statements and consolidated statements of comprehensive income, cash flows and equity for each of the three years in the period ended December 31, 2024, and the related notes and our report dated January 28, 2025 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management’s Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/\ns\n/ Ernst & Young LLP\nDetroit, Michigan\nJanuary 28, 2025\n53\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nItem 8.\n \nFinancial Statements and Supplementary Data\nCONSOLIDATED INCOME STATEMENTS\n(In millions, except per share amounts)\n \nYears Ended December 31,\n \n2024\n2023\n2022\nNet sales and revenue\nAutomotive\n$\n171,606\n \n$\n157,658\n \n$\n143,975\n \nGM Financial\n15,836\n \n14,184\n \n12,760\n \nTotal net sales and revenue (Note 3)\n187,442\n \n171,842\n \n156,735\n \nCosts and expenses\nAutomotive and other cost of sales\n151,065\n \n141,330\n \n126,892\n \nGM Financial interest, operating and other expenses\n12,972\n \n11,374\n \n8,862\n \nAutomotive and other selling, general and administrative expense\n10,621\n \n9,840\n \n10,667\n \nTotal costs and expenses\n174,658\n \n162,544\n \n146,421\n \nOperating income (loss)\n12,784\n \n9,298\n \n10,315\n \nAutomotive interest expense\n846\n \n911\n \n987\n \nInterest income and other non-operating income, net (Note 19)\n1,257\n \n1,537\n \n1,432\n \nEquity income (loss) (Note 8)\n(\n4,675\n)\n480\n \n837\n \nIncome (loss) before income taxes\n8,519\n \n10,403\n \n11,597\n \nIncome tax expense (benefit) (Note 17)\n2,556\n \n563\n \n1,888\n \nNet income (loss)\n5,963\n \n9,840\n \n9,708\n \nNet loss (income) attributable to noncontrolling interests\n45\n \n287\n \n226\n \nNet income (loss) attributable to stockholders\n$\n6,008\n \n$\n10,127\n \n$\n9,934\n \nNet income (loss) attributable to common stockholders\n$\n7,189\n \n$\n10,022\n \n$\n8,915\n \nEarnings per share (Note 21)\nBasic earnings per common share\n$\n6.45\n \n$\n7.35\n \n$\n6.17\n \nWeighted-average common shares outstanding – basic\n1,115\n \n1,364\n \n1,445\n \nDiluted earnings per common share\n$\n6.37\n \n$\n7.32\n \n$\n6.13\n \nWeighted-average common shares outstanding – diluted\n1,129\n \n1,369\n \n1,454\n \nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(In millions)\n \nYears Ended December 31,\n \n2024\n2023\n2022\nNet income (loss)\n$\n5,963\n \n$\n9,840\n \n$\n9,708\n \nOther comprehensive income (loss), net of tax (Note 20)\nForeign currency translation adjustments and other\n(\n1,133\n)\n458\n \n(\n340\n)\nDefined benefit plans\n(\n4\n)\n(\n2,814\n)\n1,677\n \nOther comprehensive income (loss), net of tax\n(\n1,137\n)\n(\n2,355\n)\n1,337\n \nComprehensive income (loss)\n4,826\n \n7,485\n \n11,045\n \nComprehensive loss (income) attributable to noncontrolling interests\n176\n \n297\n \n257\n \nComprehensive income attributable to stockholders (loss)\n$\n5,002\n \n$\n7,781\n \n$\n11,303\n \nReference should be made to the notes to consolidated financial statements.\nAmounts may not add due to rounding.\n54\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\n(In millions, except per share amounts)\nDecember 31, 2024\nDecember 31, 2023\nASSETS\nCurrent Assets\nCash and cash equivalents (Note 4)\n$\n19,872\n \n$\n18,853\n \nMarketable debt securities (Note 4)\n7,265\n \n7,613\n \nAccounts and notes receivable, net of allowance of $\n313\n and $\n298\n12,827\n \n12,378\n \nGM Financial receivables, net of allowance of $\n991\n and $\n906\n (Note 5; Note 11)\n46,362\n \n39,076\n \nInventories (Note 6)\n14,564\n \n16,461\n \nOther current assets (Note 4; Note 11)\n7,655\n \n7,238\n \nTotal current assets\n108,545\n \n101,618\n \nNon-current Assets\nGM Financial receivables, net of allowance of $\n1,467\n and $\n1,438\n (Note 5; Note 11)\n46,474\n \n45,043\n \nEquity in net assets of nonconsolidated affiliates (Note 8)\n7,102\n \n10,613\n \nProperty, net (Note 9)\n51,904\n \n50,321\n \nGoodwill and intangible assets, net (Note 10)\n4,551\n \n4,862\n \nEquipment on operating leases, net (Note 7; Note 11)\n31,586\n \n30,582\n \nDeferred income taxes (Note 17)\n21,254\n \n22,339\n \nOther assets (Note 4; Note 11)\n8,346\n \n7,686\n \nTotal non-current assets\n171,216\n \n171,446\n \nTotal Assets\n$\n279,761\n \n$\n273,064\n \nLIABILITIES AND EQUITY\nCurrent Liabilities\nAccounts payable (principally trade)\n$\n25,680\n \n$\n28,114\n \nShort-term debt and current portion of long-term debt (Note 13)\nAutomotive\n2,141\n \n428\n \nGM Financial (Note 11)\n37,291\n \n38,540\n \nAccrued liabilities (Note 12)\n31,154\n \n27,364\n \nTotal current liabilities\n96,265\n \n94,445\n \nNon-current Liabilities\nLong-term debt (Note 13)\nAutomotive\n13,327\n \n15,985\n \nGM Financial (Note 11)\n76,973\n \n66,788\n \nPostretirement benefits other than pensions (Note 15)\n3,990\n \n4,345\n \nPensions (Note 15)\n5,779\n \n6,680\n \nOther liabilities (Note 12)\n17,836\n \n16,515\n \nTotal non-current liabilities\n117,906\n \n110,312\n \nTotal Liabilities\n214,171\n \n204,757\n \nCommitments and contingencies (Note 16)\nNoncontrolling interest - Cruise stock incentive awards (Note 20)\n—\n \n118\n \nEquity (Note 20)\nCommon stock, $\n0.01\n par value \n10\n \n12\n \nAdditional paid-in capital\n20,843\n \n19,130\n \nRetained earnings\n53,472\n \n55,391\n \nAccumulated other comprehensive loss\n(\n11,253\n)\n(\n10,247\n)\nTotal stockholders’ equity\n63,072\n \n64,286\n \nNoncontrolling interests\n2,518\n \n3,903\n \nTotal Equity\n65,590\n \n68,189\n \nTotal Liabilities and Equity\n$\n279,761\n \n$\n273,064\n \nReference should be made to the notes to consolidated financial statements.\nAmounts may not add due to rounding.\n55\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(In millions)\nYears Ended December 31,\n2024\n2023\n2022\nCash flows from operating activities\nNet income (loss)\n$\n5,963\n \n$\n9,840\n \n$\n9,708\n \nDepreciation and impairment of Equipment on operating leases, net\n4,844\n \n4,904\n \n4,839\n \nDepreciation, amortization and impairment charges on Property, net\n7,545\n \n6,984\n \n6,451\n \nForeign currency remeasurement and transaction (gains) losses\n(\n321\n)\n349\n \n172\n \nUndistributed earnings and impairment of nonconsolidated affiliates, net\n4,118\n \n245\n \n193\n \nPension contributions and OPEB payments\n(\n1,518\n)\n(\n1,100\n)\n(\n790\n)\nPension and OPEB income, net\n89\n \n90\n \n(\n1,189\n)\nProvision (benefit) for deferred taxes\n1,368\n \n(\n1,041\n)\n425\n \nChange in other operating assets and liabilities (Note 24)\n(\n1,529\n)\n1,822\n \n(\n2,977\n)\nOther operating activities\n(\n433\n)\n(\n1,163\n)\n(\n790\n)\nNet cash provided by (used in) operating activities\n20,129\n \n20,930\n \n16,043\n \nCash flows from investing activities\nExpenditures for property\n(\n10,830\n)\n(\n10,970\n)\n(\n9,238\n)\nAvailable-for-sale marketable securities, acquisitions\n(\n3,986\n)\n(\n4,429\n)\n(\n11,837\n)\nAvailable-for-sale marketable securities, liquidations\n4,331\n \n9,345\n \n8,057\n \nPurchases of finance receivables\n(\n36,348\n)\n(\n35,379\n)\n(\n33,974\n)\nPrincipal collections and recoveries on finance receivables\n31,784\n \n28,346\n \n26,887\n \nPurchases of leased vehicles\n(\n15,279\n)\n(\n13,640\n)\n(\n11,949\n)\nProceeds from termination of leased vehicles\n10,892\n \n13,033\n \n14,234\n \nOther investing activities\n(\n1,081\n)\n(\n969\n)\n(\n62\n)\nNet cash provided by (used in) investing activities\n(\n20,517\n)\n(\n14,663\n)\n(\n17,882\n)\nCash flows from financing activities\nNet increase (decrease) in short-term debt\n128\n \n(\n156\n)\n373\n \nProceeds from issuance of debt (original maturities greater than three months)\n53,435\n \n50,963\n \n45,813\n \nPayments on debt (original maturities greater than three months)\n(\n43,399\n)\n(\n44,675\n)\n(\n39,606\n)\nPayments to purchase common stock (Note 20)\n(\n7,064\n)\n(\n11,115\n)\n(\n2,500\n)\nIssuance (redemption) of subsidiary stock (Note 20)\n(\n101\n)\n—\n \n(\n2,121\n)\nDividends paid\n(\n653\n)\n(\n597\n)\n(\n397\n)\nOther financing activities\n(\n407\n)\n(\n774\n)\n(\n1,178\n)\nNet cash provided by (used in) financing activities\n1,938\n \n(\n6,353\n)\n383\n \nEffect of exchange rate changes on cash, cash equivalents and restricted cash\n(\n503\n)\n54\n \n(\n138\n)\nNet increase (decrease) in cash, cash equivalents and restricted cash\n1,047\n \n(\n31\n)\n(\n1,594\n)\nCash, cash equivalents and restricted cash at beginning of period\n21,917\n \n21,948\n \n23,542\n \nCash, cash equivalents and restricted cash at end of period\n$\n22,964\n \n$\n21,917\n \n$\n21,948\n \nSignificant Non-cash Investing and Financing Activity\nNon-cash property additions\n$\n3,864\n \n$\n6,013\n \n$\n5,376\n \nReference should be made to the notes to consolidated financial statements.\nAmounts may not add due to rounding.\n56\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF EQUITY\n(In millions)\n \nCommon Stockholders’\nNoncontrolling Interests\nTotal Equity\nNoncontrolling Interest\nCruise Stock Incentive Awards\n(Temporary Equity)\nCommon Stock\nAdditional Paid-in Capital\nRetained Earnings\nAccumulated Other Comprehensive Loss\nBalance at January 1, 2022\n$\n15\n \n$\n27,061\n \n$\n41,937\n \n$\n(\n9,269\n)\n$\n6,071\n \n$\n65,815\n \n$\n— \nNet income (loss)\n— \n— \n9,934\n \n— \n(\n226\n)\n9,708\n \n— \nOther comprehensive income (loss)\n— \n— \n— \n1,368\n \n(\n31\n)\n1,337\n \n— \nIssuance (redemption) of subsidiary stock (Note 20)\n— \n— \n(\n909\n)\n— \n(\n1,212\n)\n(\n2,121\n)\n— \nPurchase of common stock (Note 20)\n(\n1\n)\n(\n1,153\n)\n(\n1,347\n)\n— \n— \n(\n2,500\n)\n— \nStock based compensation\n— \n299\n \n(\n5\n)\n— \n— \n294\n \n299\n \nCash dividends paid on common stock\n— \n— \n(\n257\n)\n— \n— \n(\n257\n)\n— \nDividends to noncontrolling interests\n— \n— \n(\n12\n)\n— \n(\n127\n)\n(\n140\n)\n— \nOther\n— \n221\n \n(\n90\n)\n— \n(\n340\n)\n(\n208\n)\n59\n \nBalance at December 31, 2022\n14\n \n26,428\n \n49,251\n \n(\n7,901\n)\n4,135\n \n71,927\n \n357\n \nNet income (loss)\n— \n— \n10,127\n \n— \n(\n287\n)\n9,840\n \n— \nOther comprehensive income (loss)\n— \n— \n— \n(\n2,346\n)\n(\n9\n)\n(\n2,355\n)\n— \nPurchase of common stock (Note 20)\n(\n2\n)\n(\n7,686\n)\n(\n3,426\n)\n— \n— \n(\n11,115\n)\n— \nStock based compensation\n— \n259\n \n(\n6\n)\n— \n— \n253\n \n24\n \nCash dividends paid on common stock\n— \n— \n(\n477\n)\n— \n— \n(\n477\n)\n— \nDividends to noncontrolling interests\n— \n— \n— \n— \n(\n120\n)\n(\n120\n)\n— \nOther\n— \n129\n \n(\n77\n)\n— \n185\n \n237\n \n(\n263\n)\nBalance at December 31, 2023\n12\n \n19,130\n \n55,391\n \n(\n10,247\n)\n3,903\n \n68,189\n \n118\n \nNet income (loss)\n— \n— \n6,008\n \n— \n(\n45\n)\n5,963\n \n— \nOther comprehensive income (loss)\n— \n— \n— \n(\n1,006\n)\n(\n131\n)\n(\n1,137\n)\n— \nIssuance (redemption) of subsidiary stock (Note 20)\n— \n973\n \n— \n— \n(\n1,074\n)\n(\n101\n)\n— \nPurchase of common stock (Note 20)\n(\n2\n)\n245\n \n(\n7,307\n)\n— \n— \n(\n7,064\n)\n— \nStock based compensation\n— \n552\n \n(\n9\n)\n— \n— \n543\n \n—\n \nCash dividends paid on common stock\n— \n— \n(\n530\n)\n— \n— \n(\n530\n)\n— \nDividends to noncontrolling interests\n— \n— \n— \n— \n(\n123\n)\n(\n123\n)\n— \nOther\n— \n(\n57\n)\n(\n80\n)\n— \n(\n13\n)\n(\n150\n)\n(\n118\n)\nBalance at December 31, 2024\n$\n10\n \n$\n20,843\n \n$\n53,472\n \n$\n(\n11,253\n)\n$\n2,518\n \n$\n65,590\n \n$\n—\n \nReference should be made to the notes to consolidated financial statements.\nAmounts may not add due to rounding.\n57\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote 1. \nNature of Operations and Basis of Presentation\nGeneral Motors Company was incorporated as a Delaware corporation in 2009. We design, build and sell trucks, crossovers, cars and automobile parts and provide software-enabled services and subscriptions worldwide. We also provide automotive financing services through GM Financial. We analyze the results of our operations through the following segments: GMNA, GMI, Cruise and GM Financial. Cruise is our global segment responsible for the development of AV technology. Corporate includes certain centrally recorded income and costs such as interest, income taxes, corporate expenditures and certain revenues and expenses that are not part of a reportable segment. The consolidated financial statements are prepared in conformity with U.S. GAAP. Except for per share amounts or as otherwise specified, amounts presented within tables are stated in millions. Certain columns and rows may not add due to rounding.\nThroughout this report, we refer to General Motors Company and its consolidated subsidiaries in a simplified manner and on a collective basis, using words like \"we\", \"our\", \"us\" and \"the Company.\" This drafting style is suggested by the SEC and is not meant to indicate that General Motors Company, the publicly traded parent company, or any particular subsidiary of the parent company, owns or operates any particular asset, business or property. The operations and businesses described in this report are owned and operated by distinct subsidiaries of General Motors Company.\nPrinciples of Consolidation  \nWe consolidate entities that we control due to ownership of a majority voting interest and we consolidate variable interest entities (VIEs) when we are the primary beneficiary. All intercompany balances and transactions are eliminated in consolidation. Our share of earnings or losses of nonconsolidated affiliates is included in our consolidated operating results using the equity method of accounting when we are able to exercise significant influence over the operating and financial decisions of the affiliate.\nUse of Estimates in the Preparation of the Financial Statements  \nAccounting estimates are an integral part of the consolidated financial statements. These estimates require the use of judgments and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses in the periods presented. We believe that the accounting estimates employed are appropriate and the resulting balances are reasonable; however, due to the inherent uncertainties in making estimates, actual results could differ from the original estimates, requiring adjustments to these balances in future periods.\n \nGM Financial  \nThe amounts presented for GM Financial are adjusted to reflect the impact on GM Financial's deferred tax positions and provision for income taxes resulting from the inclusion of GM Financial in our consolidated tax return and to eliminate the effect of transactions between GM Financial and the other members of the consolidated group. Accordingly, the amounts presented will differ from those presented by GM Financial on a stand-alone basis.\nNote 2. \nSignificant Accounting Policies\nThe accounting policies that follow are utilized by our automotive, automotive financing and Cruise operations, unless otherwise indicated.\nRevenue Recognition\nAutomotive  \nAutomotive net sales and revenue represents the amount of consideration to which we expect to be entitled in exchange for vehicle, parts and accessories and services and other sales. The consideration recognized represents the amount received, typically shortly after the sale to a customer, net of estimated dealer and customer sales incentives we reasonably expect to pay. Significant factors in determining our estimates of incentives include forecasted sales volume, product mix and the rate of customer acceptance of incentive programs, all of which are estimated based on historical experience and assumptions concerning future customer behavior and market conditions. Subsequent adjustments to incentive estimates are possible as facts and circumstances change over time. A portion of the consideration received is deferred for separate performance obligations, such as maintenance, services and vehicle connectivity, that will be provided to our customers at a future date. Taxes assessed by various government entities, such as sales, use and value-added taxes, collected at the time of the vehicle sale are excluded from Automotive net sales and revenue. Costs for shipping and handling activities that occur after control of the vehicle transfers to the dealer are recognized at the time of sale and presented in Automotive and other cost of sales.\n58\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nV\ne\nhicle, Parts and Accessories  \nFor the majority of vehicle and accessories sales, our customers obtain control and we recognize revenue when the vehicle transfers to the dealer, which typically occurs either when the vehicle is released to the carrier responsible for transporting it to a dealer or upon delivery to a dealer. Revenue, net of estimated returns, is recognized on the sale of parts upon delivery to the customer. When our customers have a right to return eligible parts and accessories, we consider the returns in our estimation of the transaction price.\nTypically, transfers to daily rental companies are accounted for as sales, with revenue recognized at the time of transfer. We defer revenue for remarketing obligations, record a residual value guarantee and reflect a liability for amounts expected to be paid once the remarketing services are complete at the time of sale and recognize deferred revenue in earnings upon completion of the remarketing service.  \nUsed Vehicles  \nProceeds from the auction of vehicles utilized by our employees are recognized in Automotive net sales and revenue upon transfer of control of the vehicle to the customer and the related vehicle carrying value is recognized in Automotive and other cost of sales. \nServices and Other\n  Services and other revenue primarily consists of revenue from vehicle-related service arrangements and after-sale services such as maintenance, OnStar, Super Cruise, vehicle connectivity and extended service warranties. For those service arrangements that are bundled with a vehicle sale, a portion of the revenue from the sale is allocated to the service component and recognized as deferred revenue within Accrued liabilities or Other liabilities. We recognize revenue for bundled services and services sold separately as services are performed, typically over a period of up to \neight years\n. \nAutomotive Financing - GM Financial  \nFinance charge income earned on finance receivables is recognized using the effective interest method. Fees and commissions received (including manufacturer subvention) and direct costs of originating loans are deferred and amortized over the term of the related finance receivables using the effective interest method and are removed from the consolidated balance sheets when the related finance receivables are fully charged off or paid in full. Accrual of finance charge income on retail finance receivables is generally suspended on accounts that are more than \n60\n days delinquent, accounts in bankruptcy and accounts in repossession. Payments received on nonaccrual loans are first applied to any fees due, then to any interest due and then any remaining amounts are applied to principal. Interest accrual generally resumes once an account has received payments bringing the delinquency to less than \n60\n days past due. Accrual of finance charge income on commercial finance receivables is generally suspended on accounts that are more than \n90\n days delinquent, upon receipt of a bankruptcy notice from a borrower, or where reasonable doubt exists about the full collectability of contractually agreed upon principal and interest. Payments received on nonaccrual loans are first applied to principal. Interest accrual resumes once an account has received payments bringing the account fully current and collection of contractual principal and interest is reasonably assured (including amounts previously charged off).\nIncome from operating lease assets, which includes lease origination fees, net of lease origination costs, is recorded as operating lease revenue on a straight-line basis over the term of the lease agreement. Gains or losses realized upon disposition of off-lease assets including any payments received from lessees upon lease termination, are included in GM Financial interest, operating and other expenses.\nAdvertising and Promotion Expenditures  \nAdvertising and promotion expenditures, which are expensed as incurred in Automotive and other selling, general and administrative expense, were $\n3.3\n billion, $\n3.6\n billion and $\n4.0\n billion in the years ended December 31, 2024, 2023 and 2022.\nResearch and Development Expenditures  \nResearch and development expenditures, which are expensed as incurred in Automotive and other cost of sales, were $\n9.2\n billion, $\n9.9\n billion and $\n9.8\n billion in the years ended December 31, 2024, 2023 and 2022. These expenditures include cost sharing payments and fees we receive when we enter into cost sharing arrangements with third parties or nonconsolidated affiliates for product-related research, engineering, design and development activities and use of intellectual property.\n \nCash Equivalents and Restricted Cash  \nCash equivalents are defined as short-term, highly-liquid investments with original maturities of \n90\n days or less. Certain operating agreements require us to post cash as collateral. Cash and cash equivalents subject to contractual restrictions and not readily available are classified as restricted cash. Restricted cash is invested in accordance with the terms of the underlying agreements and include amounts related to various deposits, escrows and other cash collateral. Restricted cash is included in Other current assets and Other assets in the consolidated balance sheets.\n59\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nFair Value Measurements  \nA three-level valuation hierarchy, based upon observable and unobservable inputs, is used for fair value measurements. Observable inputs reflect market data obtained from independent sources, while unobservable inputs reflect market assumptions based on the best evidence available. These two types of inputs create the following fair value hierarchy: Level 1 – Quoted prices for identical instruments in active markets; Level 2 – Quoted prices for similar instruments in active markets, quoted prices for identical or similar instruments in markets that are not active and model-derived valuations whose significant inputs are observable; and Level 3 – Instruments whose significant inputs are unobservable.\nMarketable Debt Securities  \nWe generally classify marketable debt securities as available-for-sale. Various factors, including turnover of holdings and investment guidelines, are considered in determining the classification of securities. Available-for-sale debt securities are recorded at fair value with non-credit related unrealized gains and losses recorded in Accumulated other comprehensive loss until realized. Credit losses are recorded in Interest income and other non-operating income, net. An evaluation is made quarterly to determine if any portion of unrealized losses recorded in Accumulated other comprehensive loss needs to be reclassified. Non-credit related unrealized losses are reclassified to Interest income and other non-operating income, net if we intend to sell the security or it is more likely than not that we will be required to sell the security before the recovery of the unrealized loss. \nWe determine realized gains and losses for all debt securities using the specific identification method and measure the fair value of our marketable debt securities using a market approach where identical or comparable prices are available and an income approach in other cases. If quoted market prices are not available, fair values of securities are determined using prices from a pricing service, pricing models, quoted prices of securities with similar characteristics or discounted cash flow models. These prices represent non-binding quotes. Our pricing service utilizes industry-standard pricing models that consider various inputs. We review our pricing service quarterly and believe the prices received from our pricing service are a reliable representation of exit prices.\nAccounts and Notes Receivable  \nAccounts and notes receivable primarily consists of amounts that are due and payable from our customers for the sale of vehicles, parts and accessories. We evaluate the collectability of receivables each reporting period and record an allowance for doubtful accounts to present the net amount expected to be collected on our receivables. Additions to the allowance are charged to bad debt expense reported in Automotive and other selling, general and administrative expense and were insignificant in the years ended December 31, 2024, 2023 and 2022.\nGM Financial Receivables  \nFinance receivables are carried at amortized cost, net of allowance for loan losses. Provisions for loan losses are charged to operations in amounts sufficient to maintain the allowance for loan losses at levels considered adequate to cover expected credit losses on the finance receivables. For retail finance receivables, GM Financial uses static pool modeling techniques to determine the allowance for loan losses expected over the remaining life of the receivables, which is supplemented by management judgment. The modeling techniques incorporate reasonable and supportable forecasts of economic conditions over the expected remaining life of the finance receivables. The economic forecasts incorporate factors which vary by region that GM Financial believes will have the largest impact on expected losses, including unemployment rates, interest rate spreads, disposable personal income and growth rates in gross domestic product. \nCommercial finance receivables are carried at amortized cost, net of allowance for loan losses and amounts held under a cash management program. GM Financial establishes the allowance for loan losses based on historical loss experience, as well as forecasted auto industry conditions, which is the economic indicator believed to have the largest impact on expected losses.\nInventories  \nInventories are stated at the lower of cost or net realizable value. Cost is determined on a first-in, first-out (FIFO) basis. Net realizable value is the estimated selling price in the ordinary course of business less cost to sell, and considers general market and economic conditions, periodic reviews of current profitability of vehicles, product warranty costs and the effect of estimated sales incentives. Net realizable value for off-lease and other vehicles is current auction sales proceeds less disposal and warranty costs. Inventories are reviewed to determine if inventory quantities are in excess of forecasted usage or if they have become obsolete, with a primary focus on productive material, supplies, work in process and parts and accessories.\nEquipment on Operating Leases  \nEquipment on operating leases, net consists of vehicle leases to retail customers with lease terms of typically \ntwo\n to \nfive years\n. We are exposed to changes in the residual values of these assets. The residual values represent estimates of the values of the leased vehicles at the end of the lease agreements and are determined based on forecasted auction proceeds when there is a reliable basis to make such a determination. Realization of the residual values is dependent on the future ability to market the vehicles under prevailing market conditions. The estimate of the residual value is evaluated over the life of the arrangement and adjustments may be made to the extent the expected value of the vehicle changes. \n60\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nAdjustments may be in the form of revisions to the depreciation rate or recognition of an impairment charge. A lease vehicle asset group is determined to be impaired if an impairment indicator exists and the expected future cash flows, which include estimated residual values, are lower than the carrying amount of the vehicle asset group. If the carrying amount is considered impaired, an impairment charge is recorded for the amount by which the carrying amount exceeds fair value of the vehicle asset group. Fair value is determined primarily using the anticipated cash flows, including estimated residual values. In our automotive finance operations, when a leased vehicle is returned or repossessed, the asset is recorded in Other assets at the lower of amortized cost or net realizable value. Upon disposition a gain or loss is recorded in GM Financial interest, operating and other expenses for any difference between the net book value of the leased asset and the proceeds from the disposition of the asset.\nEquity Investments  \nWhen events and circumstances warrant, equity investments accounted for under the equity method of accounting are evaluated for impairment. An impairment charge is recorded whenever a decline in value of an equity investment below its carrying amount is determined to be other-than-temporary. Impairment charges related to equity method investments are recorded in Equity income. Equity investments that are not accounted for under the equity method of accounting are measured at fair value or in certain cases adjusted to fair value upon an observable price change, with changes in fair value recorded in Interest income and other non-operating income, net.\nProperty, net  \nProperty, plant and equipment, including internal use software, is recorded at cost. The gross amount of assets under finance leases is included in property, plant and equipment. Major improvements that extend the useful life or add functionality are capitalized. Expenditures for repairs and maintenance are charged to expense as incurred. We depreciate depreciable property using the straight-line method. Leasehold improvements are amortized over the period of lease or the life of the asset, whichever is shorter. The amortization of the assets under finance leases is included in depreciation expense. Upon retirement or disposition of property, plant and equipment, the cost and related accumulated depreciation are eliminated and any resulting gain or loss is recorded in earnings. Impairment charges related to property are recorded in Automotive and other cost of sales, Automotive and other selling, general and administrative expense or GM Financial interest, operating and other expenses.\nSpecial Tools  \nSpecial tools represent product-specific propulsion and non-propulsion related tools, dies, molds and other items used in the vehicle manufacturing process. Expenditures for special tools are recorded at cost and are capitalized. We amortize special tools over their estimated useful lives using the straight-line method or an accelerated amortization method based on their historical and estimated production volume. Impairment charges related to special tools are recorded in Automotive and other cost of sales.\nGoodwill  \nGoodwill is not amortized but rather tested for impairment annually on October 1 and when events warrant such a review. The impairment test entails an assessment of qualitative factors to determine whether it is more likely than not that an impairment exists. If it is more likely than not that an impairment exists, then a quantitative impairment test is performed. Impairment exists when the carrying amount of a reporting unit exceeds its fair value.\n \nIntangible Assets, net  \nIntangible assets, excluding goodwill, primarily include brand names, technology and intellectual property, customer relationships and dealer networks. Intangible assets are amortized on a straight-line or an accelerated method of amortization over their estimated useful lives. Amortization of developed technology and intellectual property is recorded in Automotive and other cost of sales. Amortization of brand names, customer relationships and our dealer networks is recorded in Automotive and other selling, general and administrative expense or GM Financial interest, operating and other expenses. Impairment charges, if any, related to intangible assets are recorded in Automotive and other selling, general and administrative expense or Automotive and other cost of sales.\nValuation of Long-Lived Assets  \nThe carrying amount of long-lived assets and finite-lived intangible assets to be held and used in the business is evaluated for impairment when events and circumstances warrant. If the carrying amount of a long-lived asset group is considered impaired, a loss is recorded based on the amount by which the carrying amount exceeds fair value. Product-specific long-lived asset groups and non-product specific long-lived assets are separately tested for impairment on an asset group basis. Fair value is determined using either the market or sales comparison approach, cost approach or anticipated cash flows discounted at a rate commensurate with the risk involved. Long-lived assets to be disposed of other than by sale are considered held for use until disposition.\nGovernment Incentives and Grants\n  We receive incentives from federal, state and local governments in different regions of the world that encourage us to establish, maintain, or increase investment, employment or production in the region. We are also \n61\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nentitled to certain advanced manufacturing production credits under the IRA. We account for government incentives as a reduction of expense, a reduction of the cost of the capital investment or other income based on the substance of the incentive received. The benefit from advanced manufacturing production credits are not accounted for or classified as an income tax credit. Benefits are generally recorded when there is reasonable assurance of receipt or, as it relates to advanced manufacturing production credits, upon the generation of the credit. Amounts are recorded in earnings as the expenses in which the incentive is meant to offset are incurred, as we meet the conditions of the grant or as the capital investment is depreciated or, as it relates to advanced manufacturing production credits, upon generation of the credit.\n At December 31, 2024, cash incentives receivable in Accounts and notes receivable, net of allowance was $\n343\n million, cash incentives credited to Property, net were $\n480\n million, cash incentives receivable in Other assets was $\n292\n million and deferred incentive income in Other liabilities was $\n212\n million. In the year ended December 31, 2024, we recognized $\n524\n million in Automotive and other cost of sales associated with incentives. Current agreements expire at various dates through 2032 and we consider the risk that any amounts recognized will be returned to be remote.\nEmissions Credits\n  We periodically enter into agreements to purchase credits to facilitate our compliance with emission and fuel economy regulations. Purchased credits are recorded at cost in Other current assets and Other assets and are recognized in expense over the periods in which the acquired credits facilitate our compliance with emission and fuel economy regulations.\n In the years ended December 31, 2024, 2023 and 2022, we paid $\n2.0\n billion, $\n0.5\n billion and $\n1.0\n billion to purchase credits to facilitate our compliance with regulations. At December 31, 2024 and 2023, the carrying amount of acquired credits were $\n2.1\n billion and $\n1.0\n billion. Compliance-related costs of $\n1.0\n billion, $\n0.7\n billion and $\n0.5\n billion were recorded in Automotive and other costs of sales in the years ended December 31, 2024, 2023 and 2022.\nPension and OPEB Plans \nAttribution, Methods and Assumptions  \nThe cost of benefits provided by defined benefit pension plans is recorded in the period employees provide service. The cost of pension plan amendments that provide for benefits already earned by plan participants is amortized over the expected period of benefit which may be the duration of the applicable collective bargaining agreement specific to the plan, the expected future working lifetime or the life expectancy of the plan participants. \nThe cost of medical, dental, legal service and life insurance benefits provided through postretirement benefit plans is recorded in the period employees provide service. The cost of postretirement plan amendments that provide for benefits already earned by plan participants is amortized over the expected period of benefit which may be the average period to full eligibility or the average life expectancy of the plan participants.\nAn expected return on plan asset methodology is utilized to calculate future pension expense for certain significant funded benefit plans. A market-related value of plan assets methodology is also utilized that averages gains and losses on the plan assets over a period of years to determine future pension expense. The methodology recognizes \n60\n% of the difference between the fair value of assets and the expected calculated value in the first year and \n10\n% of that difference over each of the next \nfour years\n. \nThe discount rate assumption is established for each of the retirement-related benefit plans at their respective measurement dates. In the U.S., we use a cash flow matching approach that uses projected cash flows matched to spot rates along a high-quality corporate bond yield curve to determine the present value of cash flows to calculate a single equivalent discount rate. We apply individual annual yield curve rates to determine the service cost and interest cost for our pension and OPEB plans to more specifically link the cash flows related to service cost and interest cost to bonds maturing in their year of payment. \nThe benefit obligation for pension plans in Canada, the United Kingdom (UK) and Germany represents \n89\n% of the non-U.S. pension benefit obligation at December 31, 2024. The discount rates for plans in Canada, the UK and Germany are determined using a cash flow matching approach like the U.S.\nPlan Asset Valuation  \nDue to the lack of timely available market information for certain investments in the asset classes described below as well as the inherent uncertainty of valuation, reported fair values may differ from fair values that would have been used had timely available market information been available.\nCash Equivalents and Other Short-Term Investments  \nCash equivalents, including reverse repurchase agreements, trade deposits and other short-term investments, are valued based on pricing received from independent pricing services, dealers who \n62\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nmake markets in such securities or held at amortized cost. Cash equivalent pricing utilizes observable inputs and are classified in Level 2.\nCommon and Preferred Stock  \nCommon and preferred stock for which market prices are readily available at the measurement date are valued at the last reported sale price or official closing price on the primary market or exchange on which they are actively traded and are classified in Level 1. Such equity securities for which the market is not considered to be active are valued via the use of observable inputs, which may include the use of adjusted market prices last available, bids or last available sales prices and/or other observable inputs and are classified in Level 2. Common and preferred stock classified in Level 3 are privately issued securities or other issues that are valued via the use of valuation models using significant unobservable inputs that generally consider aged (stale) pricing, earnings multiples, discounted cash flows and/or other qualitative and quantitative factors. \nDebt Securities  \nValuations for debt securities are based on quotations received from independent pricing services or from dealers who make markets in such securities. Debt securities priced via pricing services that utilize matrix pricing which considers readily observable inputs such as the yield or price of bonds of comparable quality, coupon, maturity and type as well as dealer supplied prices, are classified in Level 2. Debt securities that are typically priced by dealers and pricing services via the use of proprietary pricing models which incorporate significant unobservable inputs are classified in Level 3. These inputs primarily consist of yield and credit spread assumptions, discount rates, prepayment curves, default assumptions and recovery rates. \nInvestment Funds, Private Equity and Debt Investments and Real Estate Investments  \nInvestment funds, private equity and debt investments and real estate investments are valued based on the Net Asset Value (NAV) per Share (or its equivalent) as a practical expedient to estimate fair value due to the absence of readily available market prices. \nNAVs are provided by the respective investment sponsors or investment advisers and are subsequently reviewed and approved by management. In the event management concludes a reported NAV does not reflect fair value or is not determined as of the financial reporting measurement date, we will consider whether and when deemed necessary to make an adjustment at the balance sheet date. In determining whether an adjustment to the external valuation is required, we will review material factors that could affect the valuation, such as changes in the composition or performance of the underlying investments or comparable investments, overall market conditions, expected sale prices for private investments which are probable of being sold in the short-term and other economic factors that may possibly have a favorable or unfavorable effect on the reported external valuation.\nStock Incentive Plans  \nOur stock incentive plans include RSUs, PSUs, stock options and awards that may be settled in our stock, the stock of our subsidiaries or in cash. We measure and record compensation expense based on the fair value of GM or Cruise's common stock on the date of grant for RSUs and PSUs and the grant date fair value, determined utilizing the Black-Scholes formula or a lattice model, for stock options and PSUs. We record compensation cost for service-based RSUs, PSUs and service-based stock options on a straight-line basis over the entire vesting period, or for retirement eligible employees over the requisite service period. Compensation cost for awards that do not have an established accounting grant date, but for which the service inception date has been established or are settled in cash is based on the fair value of GM or Cruise's common stock at the end of each reporting period.\nIn March 2022, all outstanding RSUs that settle in Cruise's common stock were modified to remove the liquidity vesting condition. Prospectively,\n \nRSUs that will settle in Cruise's common stock will vest solely upon satisfaction of a service condition. In April 2024, substantially all remaining outstanding unvested Cruise RSUs were exchanged by participants for unvested cash payment rights. The remaining outstanding Cruise RSUs are insignificant and are presented in permanent equity. Prior to the April 2024 modification, compensation cost was recorded on stock issued to settle awards based on the fair value of Cruise's common stock until such time that the stock had been issued for more than six months.\nProduct Warranty and Recall Campaigns  \nThe estimated costs related to product warranties are accrued at the time products are sold and are charged to Automotive and other cost of sales. These estimates are established using historical information on the nature, frequency and average cost of claims of each vehicle line or each model year of the vehicle line and assumptions about future activity and events. Revisions are made when necessary and are based on changes in these factors. \nThe estimated costs related to recall campaigns are accrued when probable and estimable. In GMNA, we estimate the costs related to recall campaigns by applying a paid loss approach that considers the number of historical recall campaigns and the \n63\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nestimated cost for each recall campaign. The estimated costs associated with recall campaigns in other geographical regions are determined using the estimated costs of repairs and the estimated number of vehicles to be repaired. Costs associated with recall campaigns are charged to Automotive and other cost of sales. Revisions are made when necessary based on changes in these factors.\n \nIncome Taxes  \nThe liability method is used in accounting for income taxes. Deferred tax assets and liabilities are recorded for temporary differences between the tax basis of assets and liabilities and their reported amounts in the consolidated financial statements using the statutory tax rates in effect for the year in which the differences are expected to reverse. The effect on deferred tax assets and liabilities of a change in tax laws or rates is recorded in the results of operations in the period that includes the enactment date under the law. We record Global Intangible Low Tax Income as a current period expense when incurred. Income tax effects are released from Accumulated other comprehensive loss using the specific-identification method.\nWe establish valuation allowances for deferred tax assets based on a more likely than not standard. Deferred income tax assets are evaluated quarterly to determine if valuation allowances are required or should be adjusted. The ability to realize deferred tax assets depends on the ability to generate sufficient taxable income within the carryback or carryforward periods provided for in the tax law for each applicable tax jurisdiction. The assessment regarding whether a valuation allowance is required or should be adjusted also considers all available positive and negative evidence factors. It is difficult to conclude a valuation allowance is not required when there is significant objective and verifiable negative evidence, such as cumulative losses in recent years. We utilize a rolling \nthree years\n of actual and current year results as the primary measure of cumulative losses in recent years.\nWe record uncertain tax positions on the basis of a two-step process whereby we determine whether it is more likely than not that the tax positions will be sustained based on the technical merits of the position, and for those tax positions that meet the more likely than not criteria, we recognize the largest amount of tax benefit that is greater than \n50\n% likely to be realized upon ultimate settlement with the related tax authority. We record interest and penalties on uncertain tax positions in Income tax expense.\n \nForeign Currency Transactions and Translation  \nThe assets and liabilities of foreign subsidiaries that use the local currency as their functional currency are translated to U.S. dollars based on the current exchange rate prevailing at each balance sheet date and any resulting translation adjustments are included in Accumulated other comprehensive loss. The assets and liabilities of foreign subsidiaries whose local currency is not their functional currency are remeasured from their local currency to their functional currency and then translated to U.S. dollars. Revenues and expenses are translated into U.S. dollars using the average exchange rates prevailing for each period presented. The financial statements of any foreign subsidiary that has been identified as having a highly inflationary economy are remeasured as if the functional currency were the U.S. dollar.\nGains and losses arising from foreign currency transactions and the effects of remeasurements discussed in the preceding paragraph are recorded in Automotive and other cost of sales and GM Financial interest, operating and other expenses unless related to Automotive debt, which are recorded in Interest income and other non-operating income, net.\n Foreign currency transactions and remeasurements in the years ended December 31, 2024, 2023 and 2022 were gains of $\n321\n million, losses of $\n349\n million and losses of $\n172\n million.\nDerivative Financial Instruments  \nDerivative financial instruments are recognized as either assets or liabilities at fair value. The accounting for changes in the fair value of each derivative financial instrument depends on whether it has been designated and qualifies as an accounting hedge, as well as the type of hedging relationship identified. Cash flows for all derivative financial instruments are typically classified in cash flows from operating activities. Derivative instruments are not used for trading or speculative purposes.\nAutomotive\n  We utilize options, swaps and forward contracts to manage foreign currency, commodity price and interest rate risks. The change in the fair value of option, swap and forward contracts not designated as an accounting hedge is recorded in Interest income and other non-operating income, net.\nCertain foreign currency and commodity forward contracts have been designated and qualify as cash flow hedges. The risks being hedged are foreign currency and commodity price risks related to forecasted transactions that are generally expected to occur in the next 12 months. The change in the fair value of these forward contracts is recorded in Accumulated other comprehensive loss and will be recognized in Automotive net sales and revenue or Automotive and other cost of sales when the \n64\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nhedged transaction impacts earnings. Forward contracts designated as cash flow hedges are evaluated for effectiveness using regression analysis at inception and throughout the hedge period.\nCertain receive-fixed, pay-float interest rate swap agreements have been designated and qualify as fair value hedges of our fixed-rate debt. The risk being hedged is the risk of changes in the fair value of the hedged debt attributable to changes in the benchmark interest rate. The changes in both the fair value of the hedged debt and the hedging instrument are recorded in Automotive interest expense. When a fair value hedge is de-designated, or when the derivative is terminated prior to maturity, the fair value adjustment to the hedged debt continues to be reported as part of the carrying value of the debt and is recognized in Automotive interest expense over its remaining life.\nAutomotive Financing - GM Financial\n  GM Financial utilizes interest rate derivative instruments to manage interest rate risk and foreign currency derivative instruments to manage foreign currency risk. The change in fair value of the derivative instruments not designated as an accounting hedge is recorded in GM Financial interest, operating and other expenses.\nCertain interest rate and foreign currency swap agreements have been designated as fair value hedges. The risk being hedged is the risk of changes in the fair value of the hedged debt attributable to changes in the benchmark interest rate or the risk of changes in fair value attributable to changes in foreign currency exchange rates. If the swap has been designated as a fair value hedge, the changes in the fair value of the hedged item are recorded in GM Financial interest, operating and other expenses. The change in fair value of the related hedge is also recorded in GM Financial interest, operating and other expenses. \nCertain interest rate swap and foreign currency swap agreements have been designated as cash flow hedges. The risk being hedged is the interest rate and foreign currency risk related to forecasted transactions. If the contract has been designated as a cash flow hedge, the change in the fair value of the cash flow hedge is deferred in Accumulated other comprehensive loss and is recognized in GM Financial interest, operating and other expenses along with the earnings effect of the hedged item when the hedged item affects earnings. Changes in the fair value of amounts excluded from the assessment of effectiveness are recorded currently in earnings and are presented in the same income statement line as the earnings effect of the hedged item.\nNote 3. \nRevenue \nThe following table disaggregates our revenue by major source\n:\nYear Ended December 31, 2024\nGMNA\nGMI\nCorporate\nTotal Automotive\nCruise\nGM Financial\nEliminations/ Reclassifications\nTotal\nVehicle, parts and accessories\n$\n152,306\n \n$\n12,775\n \n$\n90\n \n$\n165,171\n \n$\n— \n$\n— \n$\n(\n1\n)\n$\n165,170\n \nUsed vehicles\n1,259\n \n31\n \n—\n \n1,290\n \n— \n— \n—\n \n1,290\n \nServices and other\n3,944\n \n1,084\n \n116\n \n5,145\n \n257\n \n— \n(\n255\n)\n5,147\n \nAutomotive net sales and revenue\n157,509\n \n13,890\n \n206\n \n171,605\n \n257\n \n— \n(\n256\n)\n171,606\n \nLeased vehicle income\n— \n— \n— \n— \n— \n7,297\n \n—\n \n7,297\n \nFinance charge income\n— \n— \n— \n— \n— \n7,669\n \n(\n33\n)\n7,636\n \nOther income\n— \n— \n— \n— \n— \n910\n \n(\n7\n)\n903\n \nGM Financial net sales and revenue\n— \n— \n— \n— \n— \n15,875\n \n(\n40\n)\n15,836\n \nNet sales and revenue\n$\n157,509\n \n$\n13,890\n \n$\n206\n \n$\n171,605\n \n$\n257\n \n$\n15,875\n \n$\n(\n296\n)\n$\n187,442\n \nYear Ended December 31, 2023\nGMNA\nGMI\nCorporate\nTotal Automotive\nCruise\nGM Financial\nEliminations/ Reclassifications\nTotal\nVehicle, parts and accessories\n$\n136,983\n \n$\n14,424\n \n$\n113\n \n$\n151,520\n \n$\n— \n$\n— \n$\n(\n10\n)\n$\n151,510\n \nUsed vehicles\n954\n \n37\n \n—\n \n991\n \n— \n— \n—\n \n991\n \nServices and other\n3,508\n \n1,487\n \n160\n \n5,155\n \n102\n \n— \n(\n100\n)\n5,157\n \nAutomotive net sales and revenue\n141,445\n \n15,949\n \n273\n \n157,667\n \n102\n \n— \n(\n110\n)\n157,658\n \nLeased vehicle income\n— \n— \n— \n— \n— \n7,266\n \n—\n \n7,266\n \nFinance charge income\n— \n— \n— \n— \n— \n6,204\n \n(\n18\n)\n6,187\n \nOther income\n— \n— \n— \n— \n— \n754\n \n(\n23\n)\n732\n \nGM Financial net sales and revenue\n— \n— \n— \n— \n— \n14,225\n \n(\n41\n)\n14,184\n \nNet sales and revenue\n$\n141,445\n \n$\n15,949\n \n$\n273\n \n$\n157,667\n \n$\n102\n \n$\n14,225\n \n$\n(\n151\n)\n$\n171,842\n \n65\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nYear Ended December 31, 2022\nGMNA\nGMI\nCorporate\nTotal Automotive\nCruise\nGM Financial\nEliminations/ Reclassifications\nTotal\nVehicle, parts and accessories\n$\n124,657\n \n$\n13,993\n \n$\n42\n \n$\n138,692\n \n$\n— \n$\n— \n$\n—\n \n$\n138,692\n \nUsed vehicles\n483\n \n33\n \n—\n \n516\n \n— \n— \n—\n \n516\n \nServices and other\n3,238\n \n1,393\n \n134\n \n4,765\n \n102\n \n— \n(\n101\n)\n4,766\n \nAutomotive net sales and revenue\n128,378\n \n15,420\n \n177\n \n143,974\n \n102\n \n— \n(\n101\n)\n143,975\n \nLeased vehicle income\n— \n— \n— \n— \n— \n7,811\n \n—\n \n7,811\n \nFinance charge income\n— \n— \n— \n— \n— \n4,521\n \n(\n2\n)\n4,519\n \nOther income\n— \n— \n— \n— \n— \n435\n \n(\n4\n)\n431\n \nGM Financial net sales and revenue\n— \n— \n— \n— \n— \n12,766\n \n(\n6\n)\n12,760\n \nNet sales and revenue\n$\n128,378\n \n$\n15,420\n \n$\n177\n \n$\n143,974\n \n$\n102\n \n$\n12,766\n \n$\n(\n107\n)\n$\n156,735\n \nRevenue is measured as the amount of consideration we expect to receive in exchange for transferring goods or providing services. Adjustments to sales incentives for previously recognized sales were insignificant during the years ended December 31, 2024, 2023 and 2022.\nContract liabilities in our Automotive segments primarily consist of vehicle connectivity, customer rewards programs, maintenance, extended warranty and other contracts of $\n6.6\n billion and $\n5.0\n billion at December 31, 2024 and 2023, which are included in Accrued liabilities and Other liabilities. We recognized revenue of $\n2.0\n billion and $\n1.4\n billion related to contract liabilities during the years ended December 31, 2024 and 2023. We expect to recognize revenue of $\n2.2\n billion, $\n1.4\n billion and $\n3.0\n billion in the years ending December 31, 2025, 2026 and thereafter related to contract liabilities at December 31, 2024.\n \n66\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nNote 4. \nMarketable and Other Securities \nThe following table summarizes the fair value of cash equivalents and marketable debt securities, which approximates cost:\nFair Value Level\nDecember 31, 2024\nDecember 31, 2023\nCash and cash equivalents\nCash and time deposits\n$\n12,471\n \n$\n8,977\n \nAvailable-for-sale debt securities\nU.S. government and agencies\n2\n26\n \n211\n \nCorporate debt\n2\n1,541\n \n1,439\n \nSovereign debt\n2\n785\n \n734\n \nTotal available-for-sale debt securities – cash equivalents\n2,351\n \n2,384\n \nMoney market funds\n1\n5,050\n \n7,491\n \nTotal cash and cash equivalents\n$\n19,872\n \n$\n18,853\n \nMarketable debt securities\nU.S. government and agencies\n2\n$\n3,082\n \n$\n3,495\n \nCorporate debt and other\n2\n3,592\n \n3,529\n \nMortgage and asset-backed\n2\n591\n \n589\n \nTotal available-for-sale debt securities – marketable securities\n$\n7,265\n \n$\n7,613\n \nRestricted cash\nCash and cash equivalents \n$\n294\n \n$\n277\n \nMoney market funds\n1\n2,798\n \n2,787\n \nTotal restricted cash\n$\n3,092\n \n$\n3,064\n \nAvailable-for-sale debt securities included above with contractual maturities(a)\nDue in one year or less\n$\n3,590\n \nDue between one and five years\n5,386\n \nTotal available-for-sale debt securities with contractual maturities\n$\n8,976\n \n__________\n(a)\n    Excludes mortgage and asset-backed securities of $\n591\n million at December 31, 2024 as these securities are not due at a single maturity date.\nProceeds from the sale of available-for-sale debt securities sold prior to maturity were $\n2.5\n billion, $\n2.1\n billion and $\n1.8\n billion in the years ended December 31, 2024, 2023 and 2022. Available-for-sale debt securities had net unrealized gains of $\n86\n million and $\n196\n million in the years ended December 31, 2024 and 2023 and net unrealized losses of $\n319\n million in the year ended December 31, 2022. Cumulative unrealized losses on available-for-sale debt securities were $\n74\n million and $\n160\n million at December 31, 2024 and 2023.\nThe following table provides a reconciliation of cash, cash equivalents and restricted cash reported within the consolidated balance sheets that sum to the total of the same amounts shown in the consolidated statements of cash flows:\nDecember 31, 2024\nDecember 31, 2023\nCash and cash equivalents\n$\n19,872\n \n$\n18,853\n \nRestricted cash included in Other current assets\n2,608\n \n2,604\n \nRestricted cash included in Other assets\n484\n \n460\n \nTotal\n$\n22,964\n \n$\n21,917\n \n67\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nNote 5. \nGM Financial Receivables and Transactions \nDecember 31, 2024\nDecember 31, 2023\nRetail\nCommercial(a)\nTotal\nRetail\nCommercial(a)\nTotal\nGM Financial receivables\n$\n76,066\n \n$\n19,228\n \n$\n95,294\n \n$\n72,729\n \n$\n13,734\n \n$\n86,463\n \nLess: allowance for loan losses\n(\n2,400\n)\n(\n58\n)\n(\n2,458\n)\n(\n2,308\n)\n(\n36\n)\n(\n2,344\n)\nGM Financial receivables, net\n$\n73,667\n \n$\n19,169\n \n$\n92,836\n \n$\n70,421\n \n$\n13,698\n \n$\n84,119\n \nFair value of GM Financial receivables utilizing Level 2 inputs\n$\n19,169\n \n$\n13,698\n \nFair value of GM Financial receivables utilizing Level 3 inputs\n$\n74,729\n \n$\n70,911\n \n__________\n \n(a)\nCommercial finance receivables include dealer financing of $\n18.6\n billion and $\n13.3\n billion, and other financing of $\n604\n million and $\n476\n million at December 31, 2024 and 2023. Commercial finance receivables are presented net of dealer cash management balances of $\n3.4\n billion and $\n2.6\n billion at December 31, 2024 and 2023. Under the cash management program, subject to certain conditions, a dealer may choose to reduce the amount of interest on its floorplan line by making principal payments to GM Financial in advance.\nYears Ended December 31,\n2024\n2023\n2022\nAllowance for loan losses at beginning of period\n$\n2,344\n \n$\n2,096\n \n$\n1,886\n \nProvision for loan losses\n1,029\n \n826\n \n654\n \nCharge-offs\n(\n1,756\n)\n(\n1,423\n)\n(\n1,138\n)\nRecoveries\n903\n \n768\n \n686\n \nEffect of foreign currency and other\n(\n61\n)\n76\n \n9\n \nAllowance for loan losses at end of period\n$\n2,458\n \n$\n2,344\n \n$\n2,096\n \nThe allowance for loan losses as a percentage of finance receivables was \n2.6\n% and \n2.7\n% at December 31, 2024 and 2023.\nRetail Finance Receivables\n \nGM Financial's retail finance receivable portfolio includes loans made to consumers and businesses to finance the purchase of vehicles for personal and commercial use. \nThe following tables are consolidated summaries of the retail finance receivables by FICO score or its equivalent, determined at origination, for each vintage of the retail finance receivables portfolio at December 31, 2024 and 2023:\nYear of Origination\nDecember 31, 2024\n2024\n2023\n2022\n2021\n2020\nPrior\nTotal\nPercent\nPrime – FICO score 680 and greater\n$\n24,155\n \n$\n15,814\n \n$\n9,749\n \n$\n5,424\n \n$\n2,559\n \n$\n366\n \n$\n58,067\n \n76.3\n \n%\nNear-prime – FICO score 620 to 679\n3,547\n \n2,227\n \n1,507\n \n1,077\n \n473\n \n159\n \n8,990\n \n11.8\n \n%\nSub-prime – FICO score less than 620\n3,399\n \n2,059\n \n1,546\n \n1,141\n \n543\n \n322\n \n9,008\n \n11.8\n \n%\nRetail finance receivables\n$\n31,101\n \n$\n20,100\n \n$\n12,802\n \n$\n7,642\n \n$\n3,575\n \n$\n847\n \n$\n76,066\n \n100.0\n \n%\n68\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nYear of Origination\nDecember 31, 2023\n2023\n2022\n2021\n2020\n2019\nPrior\nTotal\nPercent\nPrime – FICO score 680 and greater\n$\n23,940\n \n$\n15,581\n \n$\n9,039\n \n$\n4,926\n \n$\n1,076\n \n$\n320\n \n$\n54,882\n \n75.5\n \n%\nNear-prime – FICO score 620 to 679\n3,234\n \n2,281\n \n1,746\n \n906\n \n350\n \n129\n \n8,647\n \n11.9\n \n%\nSub-prime – FICO score less than 620\n3,079\n \n2,397\n \n1,884\n \n1,010\n \n573\n \n257\n \n9,200\n \n12.6\n \n%\nRetail finance receivables\n$\n30,253\n \n$\n20,259\n \n$\n12,670\n \n$\n6,842\n \n$\n2,000\n \n$\n707\n \n$\n72,729\n \n100.0\n \n%\nGM Financial reviews the ongoing credit quality of retail finance receivables based on customer payment activity. A retail account is considered delinquent if a substantial portion of a scheduled payment has not been received by the date the payment was contractually due. Retail finance receivables are collateralized by vehicle titles and, subject to local laws, GM Financial generally has the right to repossess the vehicle in the event the customer defaults on the payment terms of the contract. The accrual of finance charge income had been suspended on delinquent retail finance receivables with contractual amounts due of $\n958\n million and $\n809\n million at December 31, 2024 and 2023. \nThe following tables are consolidated summaries of the delinquency status of the outstanding amortized cost of retail finance receivables for each vintage of the portfolio at December 31, 2024 and 2023:\nYear of Origination\nDecember 31, 2024\n2024\n2023\n2022\n2021\n2020\nPrior\nTotal\nPercent\n0-to-30 days\n$\n30,581\n \n$\n19,411\n \n$\n12,207\n \n$\n7,178\n \n$\n3,350\n \n$\n710\n \n$\n73,438\n \n96.5\n \n%\n31-to-60 days\n374\n \n481\n \n425\n \n340\n \n166\n \n99\n \n1,885\n \n2.5\n \n%\nGreater-than-60 days\n128\n \n188\n \n155\n \n115\n \n55\n \n36\n \n677\n \n0.9\n \n%\nFinance receivables more than 30 days delinquent\n502\n \n669\n \n580\n \n455\n \n221\n \n135\n \n2,562\n \n3.4\n \n%\nIn repossession\n17\n \n19\n \n14\n \n10\n \n3\n \n2\n \n66\n \n0.1\n \n%\nFinance receivables more than 30 days delinquent or in repossession\n519\n \n689\n \n595\n \n464\n \n225\n \n136\n \n2,628\n \n3.5\n \n%\nRetail finance receivables\n$\n31,101\n \n$\n20,100\n \n$\n12,802\n \n$\n7,642\n \n$\n3,575\n \n$\n847\n \n$\n76,066\n \n100.0\n \n%\nYear of Origination\nDecember 31, 2023\n2023\n2022\n2021\n2020\n2019\nPrior\nTotal\nPercent\n0-to-30 days\n$\n29,816\n \n$\n19,602\n \n$\n12,098\n \n$\n6,533\n \n$\n1,825\n \n$\n599\n \n$\n70,472\n \n96.9\n \n%\n31-to-60 days\n318\n \n470\n \n415\n \n227\n \n130\n \n78\n \n1,637\n \n2.3\n \n%\nGreater-than-60 days\n102\n \n168\n \n142\n \n76\n \n42\n \n29\n \n559\n \n0.8\n \n%\nFinance receivables more than 30 days delinquent\n421\n \n637\n \n557\n \n302\n \n172\n \n107\n \n2,196\n \n3.0\n \n%\nIn repossession\n17\n \n20\n \n14\n \n6\n \n3\n \n1\n \n61\n \n0.1\n \n%\nFinance receivables more than 30 days delinquent or in repossession\n437\n \n657\n \n572\n \n308\n \n175\n \n108\n \n2,257\n \n3.1\n \n%\nRetail finance receivables\n$\n30,253\n \n$\n20,259\n \n$\n12,670\n \n$\n6,842\n \n$\n2,000\n \n$\n707\n \n$\n72,729\n \n100.0\n \n%\n69\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nCommercial Finance Receivables\n \nGM Financial's commercial finance receivables consist of dealer financing, primarily for dealer inventory purchases, and other financing, which includes loans to commercial vehicle upfitters. For dealer financing, proprietary models are used to assign a risk rating to each dealer. GM Financial performs periodic credit reviews of each dealership and adjusts the dealership's risk rating, if necessary. The credit risk associated with other financing is limited due to the structure of the business relationships. \nGM Financial's dealer risk model and risk rating categories are as follows:\nRating\nDescription\nI\nPerforming accounts with strong to acceptable financial metrics with at least satisfactory capacity to meet financial commitments.\nII\nPerforming accounts experiencing potential weakness in financial metrics and repayment prospects resulting in increased monitoring.\nIII\nNon-Performing accounts with inadequate paying capacity for current obligations and have the distinct possibility of creating a loss if deficiencies are not corrected.\nIV\nNon-Performing accounts with inadequate paying capacity for current obligations and inherent weaknesses that make collection of liquidation in full highly questionable or improbable.\nDealers with III and IV risk ratings are subject to additional monitoring and restrictions on funding, including suspension of lines of credit and liquidation of assets.\n The following tables summarize the dealer credit risk profile by dealer risk rating at December 31, 2024 and 2023:\nYear of Origination(a)\nDecember 31, 2024\nDealer Risk Rating\nRevolving\n2024\n2023\n2022\n2021\n2020\nPrior\nTotal\nPercent\nI\n$\n16,190\n \n$\n321\n \n$\n209\n \n$\n360\n \n$\n237\n \n$\n267\n \n$\n22\n \n$\n17,606\n \n94.5\n \n%\nII\n621\n \n—\n \n10\n \n26\n \n3\n \n2\n \n—\n \n663\n \n3.6\n \n%\nIII\n305\n \n10\n \n4\n \n—\n \n22\n \n—\n \n12\n \n354\n \n1.9\n \n%\nIV\n1\n \n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n1\n \n—\n \n%\nBalance at end of period\n$\n17,117\n \n$\n331\n \n$\n223\n \n$\n385\n \n$\n263\n \n$\n269\n \n$\n35\n \n$\n18,623\n \n100.0\n \n%\n__________\n \n(a)\nFloorplan advances comprise \n99.5\n% of the total revolving balance. Dealer term loans are presented by year of origination.\nYear of Origination(a)\nDecember 31, 2023\nDealer Risk Rating\nRevolving\n2023\n2022\n2021\n2020\n2019\nPrior\nTotal\nPercent\nI\n$\n11,513\n \n$\n279\n \n$\n403\n \n$\n297\n \n$\n301\n \n$\n75\n \n$\n11\n \n$\n12,879\n \n97.1\n \n%\nII\n182\n \n—\n \n2\n \n2\n \n—\n \n—\n \n—\n \n187\n \n1.4\n \n%\nIII\n152\n \n1\n \n15\n \n12\n \n—\n \n11\n \n—\n \n192\n \n1.4\n \n%\nIV\n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n—\n \n%\nBalance at end of period\n$\n11,846\n \n$\n281\n \n$\n421\n \n$\n311\n \n$\n301\n \n$\n86\n \n$\n11\n \n$\n13,257\n \n100.0\n \n%\n \n__________ \n(a)\nFloorplan advances comprise \n99.7\n% of the total revolving balance. Dealer term loans are presented by year of origination.\nThere were \nno\n commercial finance receivables on nonaccrual status at December 31, 2024 and 2023.\n70\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nTransactions with GM Financial\n \nThe following tables show transactions between our Automotive segments, Cruise and GM Financial. These amounts are presented in GM Financial's consolidated balance sheets and statements of income. \nDecember 31, 2024\nDecember 31, 2023\nConsolidated Balance Sheets(a)\nCommercial finance receivables due from GM consolidated dealers\n$\n279\n \n$\n164\n \nCommercial finance receivables due from Cruise\n$\n395\n \n$\n353\n \nSubvention receivable from GM(b)\n$\n360\n \n$\n508\n \nCommercial loan funding payable to GM\n$\n100\n \n$\n55\n \nYears Ended December 31,\n2024\n2023\n2022\nConsolidated Statements of Income\nInterest subvention earned on finance receivables\n$\n1,385\n \n$\n1,234\n \n$\n984\n \nLeased vehicle subvention earned\n$\n1,511\n \n$\n1,537\n \n$\n1,916\n \n__________ \n(a)\nAll balance sheet amounts are eliminated upon consolidation.\n(b)\nOur Automotive segments made cash payments to GM Financial for subvention of $\n3.8\n billion, $\n3.5\n billion and $\n2.4\n billion in the years ended December 31, 2024, 2023 and 2022.\nGM Financial's Board of Directors declared and paid dividends on its common stock of $\n1.8\n billion in the years ended December 31, 2024 and 2023 and $\n1.7\n billion in the year ended December 31, 2022.\nNote 6.\n \nInventories\nDecember 31, 2024\nDecember 31, 2023\nTotal productive material, supplies and work in process\n$\n6,444\n \n$\n7,422\n \nFinished product, including service parts\n8,120\n \n9,039\n \nTotal inventories\n$\n14,564\n \n$\n16,461\n \nInventories are reflected net of allowances totaling $\n2.0\n billion and $\n2.2\n billion, of which $\n1.4\n billion and $\n1.9\n billion are EV-related, to remeasure inventory on-hand to net realizable value at December 31, 2024 and 2023.\nNote 7. \nOperating Leases\nOperating Leases  \nOur portfolio of leases primarily consists of real estate office space, manufacturing and warehousing facilities, land and equipment. Certain leases contain escalation clauses and renewal or purchase options, and generally our leases have no residual value guarantees or material covenants. We exclude leases with a term of one year or less from our balance sheet, and do not separate non-lease components from our real estate leases.\nRent expense under operating leases was $\n369\n million, $\n346\n million and $\n317\n million in the years ended December 31, 2024, 2023 and 2022. Variable lease costs were insignificant in the years ended December 31, 2024, 2023 and 2022. At December 31, 2024 and 2023, \noperating lease right of use assets\n in Other assets were $\n919\n million and $\n979\n million, \noperating lease liabilities\n in Accrued liabilities were $\n254\n million and $\n264\n million and \nnon-current operating lease liabilities\n in Other liabilities were $\n961\n million and $\n907\n million. Operating lease right of use assets obtained in exchange for lease obligations were $\n368\n million and $\n225\n million in the years ended December 31, 2024 and 2023. Our undiscounted future lease obligations related to operating leases having initial terms in excess of one year are $\n290\n million, $\n255\n million, $\n209\n million, $\n183\n million, $\n156\n million and $\n296\n million for the years 2025, 2026, 2027, 2028, 2029 and thereafter, with imputed interest of $\n174\n million as of December 31, 2024. The weighted-average discount rate was \n4.6\n% and \n4.3\n% and the weighted-average remaining lease term was \n5.9\n years and \n6.0\n years at December 31, 2024 and 2023. Payments for operating leases included in Net cash provided by (used in) operating activities were $\n416\n million, $\n359\n million and $\n314\n million in the years ended December 31, 2024, 2023 and 2022. Lease agreements that have not yet commenced were $\n746\n million at December 31, 2024.\n71\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nEquipment on Operating Leases  \nEquipment on operating leases primarily consists of leases to retail customers of GM Financial.\nDecember 31, 2024\nDecember 31, 2023\nEquipment on operating leases\n$\n38,187\n \n$\n37,921\n \nLess: accumulated depreciation\n(\n6,601\n)\n(\n7,338\n)\nEquipment on operating leases, net\n$\n31,586\n \n$\n30,582\n \nAt December 31, 2024, the estimated residual value of our leased assets at the end of the lease term was $\n23.5\n billion.\nDepreciation expense related to Equipment on operating leases, net was $\n4.8\n billion, $\n4.9\n billion and $\n4.8\n billion in the years ended December 31, 2024, 2023 and 2022.\nThe following table summarizes lease payments due to GM Financial on leases to retail customers:\nYears Ending December 31,\n2025\n2026\n2027\n2028\n2029\nTotal\nLease receipts under operating leases\n$\n5,195\n \n$\n3,371\n \n$\n1,257\n \n$\n135\n \n$\n1\n \n$\n9,959\n \nNote 8. \nEquity in Net Assets of Nonconsolidated Affiliates \nNonconsolidated affiliates are entities in which we maintain an equity ownership interest and for which we use the equity method of accounting due to our ability to exert significant influence over decisions relating to their operating and financial affairs. \nRevenue and expenses of our joint ventures are not consolidated into our financial statements; rather, our proportionate share of the earnings of each joint venture is reflected as Equity income (loss) or Automotive and other cost of sales. \nYears Ended December 31,\n2024\n2023\n2022\nAutomotive China JVs equity income (loss)\n$\n(\n4,407\n)\n$\n446\n \n$\n677\n \nUltium Cells Holdings LLC equity income (loss)(a)\n975\n \n293\n \n8\n \nOther joint ventures equity income (loss)\n(\n268\n)\n34\n \n151\n \nTotal Equity income (loss)\n$\n(\n3,701\n)\n$\n773\n \n$\n837\n \n__________\n(a)    Equity earnings related to Ultium Cells Holdings LLC are presented in Automotive and other cost of sales as this entity is integral to the operations of our business by providing battery cells for our EVs.\nInvestments in Nonconsolidated Affiliates\nDecember 31, 2024\nDecember 31, 2023\nAutomotive China JVs carrying amount\n$\n1,474\n \n$\n6,373\n \nUltium Cells Holdings LLC carrying amount\n3,749\n \n2,268\n \nOther investments carrying amount\n1,879\n \n1,972\n \nTotal equity in net assets of nonconsolidated affiliates\n$\n7,102\n \n$\n10,613\n \nThe carrying amount of our investments in certain joint ventures exceeded our share of the underlying net assets by $\n1.9\n billion and $\n4.2\n billion at December 31, 2024 and 2023 primarily due to goodwill from the application of fresh-start reporting and the purchase of additional interests in nonconsolidated affiliates. \n72\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nThe following table summarizes our direct ownership interests in our China JVs:\nDecember 31, 2024\nDecember 31, 2023\nAutomotive China JVs\nSAIC General Motors Corp., Ltd. (SGM)\n50\n \n%\n50\n \n%\nPan Asia Technical Automotive Center Co., Ltd.\n50\n \n%\n50\n \n%\nSAIC General Motors Sales Co., Ltd. (SGMS)\n49\n \n%\n49\n \n%\nSAIC GM Wuling Automobile Co., Ltd. (SGMW)\n44\n \n%\n44\n \n%\nShanghai OnStar Telematics Co., Ltd. (Shanghai OnStar)\n40\n \n%\n40\n \n%\nSAIC GM (Shenyang) Norsom Motors Co., Ltd. (SGM Norsom)\n25\n \n%\n25\n \n%\nSAIC GM Dong Yue Motors Co., Ltd. (SGM DY)\n25\n \n%\n25\n \n%\nSAIC GM Dong Yue Powertrain Co., Ltd. (SGM DYPT)\n25\n \n%\n25\n \n%\nOther joint ventures\nSAIC-GMAC Automotive Finance Company Limited (SAIC-GMAC)\n35\n \n%\n35\n \n%\nSAIC-GMF Leasing Co., Ltd. \n35\n \n%\n35\n \n%\nSGM is a joint venture we established with Shanghai Automotive Industry Corporation (SAIC) (\n50\n%). SGM has interests in \nthree\n other joint ventures in China: SGM Norsom, SGM DY and SGM DYPT. These \nthree\n joint ventures are jointly held by SGM (\n50\n%), SAIC (\n25\n%) and ourselves. These \nfour\n joint ventures are engaged in the production, import and sale of a range of products under the Buick, Chevrolet and Cadillac brands. SGM also has interests in Shanghai OnStar (\n20\n%), SAIC-GMAC (\n20\n%) and SAIC-GMF Leasing Co., Ltd. (\n20\n%). Shanghai Automotive Group Finance Company Ltd., a subsidiary of SAIC, owns \n45\n% of SAIC-GMAC. SAIC Financial Holdings Company, a subsidiary of SAIC, owns \n45\n% of SAIC-GMF Leasing Co., Ltd.\nImpairment Charges  \nOur Automotive China JVs generated an equity loss of $\n4.4\n billion in the year ended December 31, 2024, which includes $\n2.0\n billion of impairments and restructuring-related charges recorded by certain of the China JVs and a $\n2.1\n billion other-than-temporary impairment charge to write down certain of our automotive investments to their fair values. In response to intense competition in a market with significant excess capacity and an increasingly challenging regulatory environment related to emissions, fuel consumption and NEVs, we and our JV partners are restructuring our operations in China. The charges recorded by the China JVs were primarily related to asset impairments associated with plant closures and portfolio optimization actions and the recognition of a valuation allowance on deferred tax assets. As a result of the market challenges and competitive conditions, GM Financial also recorded a $\n0.3\n billion other-than-temporary impairment charge to write down its SAIC-GMAC investment to its fair value.\nFair Value Measurements  \nIn performing our impairment testing, we utilize a third-party valuation specialist to assist in determining the fair values of our investments based on valuation techniques using the best available information. The fair values of the investments in the China JVs are estimated based on their discounted cash flows (income approach). We make significant assumptions and estimates about the extent and timing of future cash flows, growth rates, market share and discount rates that represent unobservable, Level 3, inputs into our valuation methodologies. Where available and as appropriate, comparative market multiples are used to corroborate the results of the discounted cash flow method. \nThe investment balance for SGM, SGM Norsom, SGM DY and SGM DYPT that was tested for impairment was $\n2.4\n billion and the estimated key assumptions utilized in our impairment testing were: \n16.5\n% discount rate; \n0.5\n% long-term growth rate; passenger vehicle industry volumes of \n23.3\n-\n24.0\n million and a market share of \n2.0\n-\n2.2\n% in 2024 through 2028. The investment balance for SAIC-GMAC that was tested for impairment was $\n1.5\n billion and the estimated key assumptions utilized in our impairment testing were: \n13.0\n% discount rate; \n3.5\n% long-term growth rate; and alignment with the Automotive China JVs on vehicle volumes and market share.\nThe discount rate considered various factors including bond yields, cost of equity, risk premiums and tax rates; the terminal values were determined using a growth model that applied an investee's long-term growth rate to its projected cash flows beyond the forecast period; and industry volumes and market share included annual estimates through the forecast period. In addition, minimum operating cash needs that incorporate specific business, economic and regulatory factors giving rise to varying cash needs were estimated. Our fair value estimates assume the achievement of the future financial results \n73\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\ncontemplated in our forecasted cash flows which is subject to significant uncertainties. There is no assurance that anticipated financial results will be achieved.\nSummarized Financial Data of Nonconsolidated Affiliates\n \nDecember 31, 2024\nDecember 31, 2023\nAutomotive China JVs\nOthers\nTotal\nAutomotive China JVs\nOthers\nTotal\nSummarized Balance Sheet Data\nCurrent assets\n$\n11,203\n \n$\n10,862\n \n$\n22,065\n \n$\n15,963\n \n$\n17,435\n \n$\n33,398\n \nNon-current assets\n6,518\n \n11,434\n \n17,952\n \n11,585\n \n11,535\n \n23,120\n \nTotal assets\n$\n17,721\n \n$\n22,296\n \n$\n40,017\n \n$\n27,548\n \n$\n28,970\n \n$\n56,518\n \nCurrent liabilities\n$\n17,076\n \n$\n7,722\n \n$\n24,798\n \n$\n22,104\n \n$\n15,308\n \n$\n37,412\n \nNon-current liabilities\n887\n \n2,562\n \n3,449\n \n1,070\n \n4,174\n \n5,244\n \nTotal liabilities\n$\n17,963\n \n$\n10,284\n \n$\n28,247\n \n$\n23,174\n \n$\n19,482\n \n$\n42,656\n \nNoncontrolling interests\n$\n279\n \n$\n—\n \n$\n279\n \n$\n868\n \n$\n—\n \n$\n868\n \nYears Ended December 31,\n2024\n2023\n2022\nSummarized Operating Data\nAutomotive China JVs' net sales\n$\n21,740\n \n$\n31,435\n \n$\n35,857\n \nOthers' net sales\n5,545\n \n4,311\n \n2,029\n \nTotal net sales\n$\n27,285\n \n$\n35,746\n \n$\n37,886\n \nAutomotive China JVs' net income (loss)\n$\n(\n4,466\n)\n$\n1,122\n \n$\n1,407\n \nOthers' net income\n1,315\n \n771\n \n426\n \nTotal net income (loss)\n$\n(\n3,151\n)\n$\n1,893\n \n$\n1,833\n \nTransactions with Nonconsolidated Affiliates\n \nOur nonconsolidated affiliates are involved in various aspects of the development, production and marketing of trucks, crossovers, cars and automobile parts. We enter into transactions with certain nonconsolidated affiliates to purchase and sell component parts and vehicles. \nThe following tables summarize transactions with and balances related to our nonconsolidated affiliates:\nYears Ended December 31,\n2024\n2023\n2022\nAutomotive sales and revenue\n$\n90\n \n$\n209\n \n$\n218\n \nAutomotive purchases, net\n$\n4,875\n \n$\n2,766\n \n$\n2,637\n \nDividends received\n$\n418\n \n$\n1,018\n \n$\n1,030\n \nOperating cash flows\n$\n(\n4,422\n)\n$\n(\n941\n)\n$\n(\n1,133\n)\nDecember 31, 2024\nDecember 31, 2023\nAccounts and notes receivable, net\n$\n1,056\n \n$\n589\n \nAccounts payable\n$\n892\n \n$\n806\n \nUndistributed earnings\n$\n6\n \n$\n1,719\n \n74\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nNote 9. \nProperty \nEstimated Useful Lives in Years\nDecember 31, 2024\nDecember 31, 2023\nLand\n$\n1,253\n \n$\n1,293\n \nBuildings and improvements\n5\n-\n40\n14,915\n \n13,256\n \nMachinery and equipment\n3\n-\n27\n39,575\n \n37,074\n \nSpecial tools\n1\n-\n16\n25,813\n \n26,086\n \nConstruction in progress\n7,176\n \n8,135\n \nTotal property\n88,732\n \n85,845\n \nLess: accumulated depreciation\n(\n36,828\n)\n(\n35,524\n)\nTotal property, net\n$\n51,904\n \n$\n50,321\n \nThe amount of capitalized software included in Property, net was $\n2.3\n billion and $\n2.2\n billion at December 31, 2024 and 2023. The amount of interest capitalized and excluded from Automotive interest expense was $\n215\n million in the year ended December 31, 2024 and insignificant in the years ended December 31, 2023 and 2022. \nYears Ended December 31,\n2024\n2023\n2022\nDepreciation and amortization expense\n$\n6,466\n \n$\n6,719\n \n$\n6,297\n \nImpairment charges(a)\n$\n635\n \n$\n115\n \n$\n12\n \nCapitalized software amortization expense(b)\n$\n798\n \n$\n705\n \n$\n614\n \n__________\n(a)    In the year ended December 31, 2024, we recognized impairment charges primarily related to the indefinite delay of the Cruise Origin.\n(b)    Included in Depreciation and amortization expense.\nNote 10. \nGoodwill and Intangible Assets \nGoodwill of $\n1.9\n billion consisted of $\n1.3\n billion in GM Financial at December 31, 2024 and 2023, and $\n569\n million and $\n573\n million in Cruise at December 31, 2024 and 2023. In the three months ended December 31, 2024, we performed a goodwill impairment test for Cruise and determined that the goodwill was not impaired.\nDecember 31, 2024\nDecember 31, 2023\nGross Carrying Amount\nAccumulated Amortization\nNet Carrying Amount\nGross Carrying Amount\nAccumulated Amortization\nNet Carrying Amount\nTechnology and intellectual property\n$\n554\n \n$\n483\n \n$\n71\n \n$\n749\n \n$\n517\n \n$\n231\n \nBrands\n4,288\n \n1,873\n \n2,415\n \n4,293\n \n1,768\n \n2,526\n \nDealer network, customer relationships and other\n957\n \n793\n \n164\n \n968\n \n784\n \n184\n \nTotal intangible assets\n$\n5,799\n \n$\n3,149\n \n$\n2,649\n \n$\n6,010\n \n$\n3,069\n \n$\n2,941\n \nOur amortization expense related to intangible assets was $\n146\n million, $\n114\n million\n and $\n139\n million\n in the years ended December 31, 2024, 2023 and 2022. In the year ended December 31, 2024, we recorded $\n142\n million of \nimpairment charges\n related to the write-off of technology and intellectual property associated with Cruise.\nAmortization expense related to intangible assets is estimated to be approximately $\n141\n million in each of the next five years.\n75\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nNote 11. \nVariable Interest Entities\nConsolidated VIEs\nAutomotive Financing - GM Financial\n \nGM Financial uses special purpose entities (SPEs) that are considered VIEs to issue variable funding notes to third party, bank-sponsored warehouse facilities or asset-backed securities to investors in securitization transactions. The debt issued by these VIEs is backed by finance receivables and leasing-related assets transferred to the VIEs (Securitized Assets). GM Financial determined that it is the primary beneficiary of the SPEs because the servicing responsibilities for the Securitized Assets give GM Financial the power to direct the activities that most significantly impact the performance of the VIEs and the variable interests in the VIEs give GM Financial the obligation to absorb losses and the right to receive residual returns that could potentially be significant. The assets of the VIEs serve as the sole source of repayment for the debt issued by these entities. Investors in the notes issued by the VIEs do not have recourse to GM Financial or its other assets, with the exception of customary representation and warranty repurchase provisions and indemnities that GM Financial provides as the servicer. GM Financial is not required to provide additional financial support to these SPEs. While these subsidiaries are included in GM Financial's consolidated financial statements, they are separate legal entities and their assets are legally owned by them and are not available to GM Financial's creditors or creditors of GM Financial's other subsidiaries.\nThe following table summarizes the assets and liabilities related to GM Financial's consolidated VIEs:\nDecember 31, 2024\nDecember 31, 2023\nRestricted cash \n–\n current\n$\n2,410\n \n$\n2,398\n \nRestricted cash \n–\n non-current\n$\n350\n \n$\n367\n \nGM Financial receivables \n–\n current\n$\n27,631\n \n$\n22,990\n \nGM Financial receivables \n–\n non-current\n$\n27,619\n \n$\n23,535\n \nGM Financial equipment on operating leases, net\n$\n14,252\n \n$\n15,794\n \nGM Financial short-term debt and current portion of long-term debt\n$\n18,008\n \n$\n22,088\n \nGM Financial long-term debt\n$\n31,638\n \n$\n23,210\n \nGM Financial recognizes finance charge, leased vehicle and fee income on the Securitized Assets and interest expense on the secured debt issued in a securitization transaction and records a provision for loan losses to recognize loan losses expected over the remaining life of the finance receivables.\nNonconsolidated VIEs\nAutomotive\n \nNonconsolidated VIEs primarily include our battery cell manufacturing joint ventures to which we provided financial support to ensure that our supply needs for production are met or are not disrupted. Our variable interests in these nonconsolidated VIEs include equity investments, accounts and loans receivable, committed financial support and other off-balance sheet arrangements. The carrying amounts of assets were approximately $\n4.3\n billion and $\n2.4\n billion and liabilities were insignificant related to our nonconsolidated VIEs at December 31, 2024 and 2023. Our maximum exposure to loss as a result of our involvement with these VIEs was $\n7.0\n billion and $\n3.5\n billion, inclusive of $\n2.3\n billion and $\n0.8\n billion in committed capital contributions to our battery cell manufacturing joint ventures, at December 31, 2024 and 2023. Our maximum exposure to loss, and required capital contributions, could vary depending on our battery cell joint ventures' requirements and access to capital. We currently lack the power through voting or similar rights to direct the activities of these entities that most significantly affect their economic performance.\n76\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nNote 12. \nAccrued and Other Liabilities \nDecember 31, 2024\nDecember 31, 2023\nAccrued liabilities\nDealer and customer allowances, claims and discounts\n$\n7,270\n \n$\n6,065\n \nDeferred revenue\n3,371\n \n2,802\n \nProduct warranty and related liabilities \n4,555\n \n3,285\n \nPayrolls and employee benefits excluding postemployment benefits\n3,221\n \n3,099\n \nOther(a)\n12,737\n \n12,113\n \nTotal accrued liabilities\n$\n31,154\n \n$\n27,364\n \nOther liabilities\nDeferred revenue\n$\n5,940\n \n$\n5,019\n \nProduct warranty and related liabilities\n6,016\n \n6,011\n \nOperating lease liabilities\n961\n \n907\n \nEmployee benefits excluding postemployment benefits\n501\n \n518\n \nPostemployment benefits including facility idling reserves\n154\n \n151\n \nOther(a)\n4,265\n \n3,909\n \nTotal other liabilities\n$\n17,836\n \n$\n16,515\n \n__________\n(a)\nIncludes amounts related to product liability, breach of warranty and other legal and environmental-related accruals of $\n3.4\n billion and $\n2.9\n billion at December 31, 2024 and 2023\n.\nYears Ended December 31,\n2024\n2023\n2022\nProduct Warranty and Related Liabilities\nWarranty balance at beginning of period\n$\n9,295\n \n$\n8,530\n \n$\n9,774\n \nWarranties issued and assumed in period – recall campaigns \n997\n \n864\n \n651\n \nWarranties issued and assumed in period – product warranty\n3,621\n \n2,418\n \n1,943\n \nPayments\n(\n4,474\n)\n(\n4,009\n)\n(\n4,097\n)\nAdjustments to pre-existing warranties\n1,237\n \n1,462\n \n297\n \nEffect of foreign currency and other\n(\n106\n)\n31\n \n(\n37\n)\nWarranty balance at end of period\n10,571\n \n9,295\n \n8,530\n \nLess: Supplier recoveries balance at end of period(a)\n438\n \n646\n \n1,184\n \nWarranty balance, net of supplier recoveries at end of period\n$\n10,133\n \n$\n8,649\n \n$\n7,345\n \n__________\n(a)\nThe current portion of supplier recoveries is recorded in Accounts and notes receivable, net of allowance and the non-current portion is recorded in Other assets.\nYears Ended December 31,\n2024\n2023\n2022\nProduct warranty expense, net of recoveries\nWarranties issued and assumed in period\n$\n4,618\n \n$\n3,282\n \n$\n2,593\n \nSupplier recoveries accrued in period\n(\n297\n)\n3\n \n(\n261\n)\nAdjustments and other\n1,131\n \n1,493\n \n260\n \nWarranty expense, net of supplier recoveries\n$\n5,452\n \n$\n4,778\n \n$\n2,592\n \nFor estimates related to reasonably possible losses in excess of amounts accrued for recall campaigns, refer to Note 16 for additional information.\n77\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nNote 13. \nDebt \nAutomotive\n \nThe following table presents debt in our automotive operations:\nDecember 31, 2024\nDecember 31, 2023\nCarrying Amount\nFair Value\nCarrying Amount\nFair Value\nSecured debt\n$\n105\n \n$\n105\n \n$\n134\n \n$\n132\n \nUnsecured debt(a)\n14,980\n \n14,709\n \n15,842\n \n15,911\n \nFinance lease liabilities\n383\n \n391\n \n437\n \n447\n \nTotal automotive debt(b)\n$\n15,467\n \n$\n15,204\n \n$\n16,413\n \n$\n16,490\n \nFair value utilizing Level 1 inputs\n$\n14,366\n \n$\n15,457\n \nFair value utilizing Level 2 inputs\n$\n838\n \n$\n1,033\n \nAvailable under credit facility agreements(c)\n$\n13,793\n \n$\n16,446\n \nWeighted-average interest rate on outstanding short-term debt(d)\n7.3\n \n%\n16.2\n \n%\nWeighted-average interest rate on outstanding long-term debt(d)\n5.8\n \n%\n5.8\n \n%\n__________\n(a)\nPrimarily consist of senior notes.\n(b)\nIncludes net discount and debt issuance costs of $\n439\n million and $\n527\n million at December 31, 2024 and 2023. \n(c)\nExcludes our \n364\n-day, $\n2.0\n billion facility designated for exclusive use by GM Financial.\n(d)\nInc\nludes coupon rates on debt denominated in various foreign currencies and interest free loans.\nIn March 2024, we renewed our \n364\n-day, $\n2.0\n billion revolving credit facility allocated for the exclusive use of GM Financial, which now matures March 27, 2025. Interest rates on obligations under the renewed credit facility are based on Term SOFR.\nIn March 2024, we terminated our unsecured \n364\n-day delayed draw term loan credit agreement that permitted the Company to borrow up to $\n3.0\n billion executed in November 2023, resulting in an insignificant loss.\nIn December 2024, we exercised the make-whole provision on a portion of our $\n2.0\n billion senior unsecured notes with a maturity date of October 2025, redeeming $\n750\n million in aggregate principal amount. Upon settlement in December 2024, we recorded an \ninsignificant\n early extinguishment of debt loss.\nGM Financial\n \nThe following table presents debt of GM Financial:\nDecember 31, 2024\nDecember 31, 2023\nCarrying Amount\nFair Value\nCarrying Amount\nFair Value\nSecured debt\n$\n49,573\n \n$\n49,753\n \n$\n45,243\n \n$\n44,971\n \nUnsecured debt\n64,691\n \n65,258\n \n60,084\n \n59,651\n \nTotal GM Financial debt\n$\n114,264\n \n$\n115,010\n \n$\n105,327\n \n$\n104,622\n \nFair value utilizing Level 2 inputs\n$\n112,941\n \n$\n102,262\n \nFair value utilizing Level 3 inputs\n$\n2,070\n \n$\n2,360\n \nSecured debt consists of revolving credit facilities and securitization notes payable. Most of the secured debt was issued by VIEs and is repayable only from proceeds related to the underlying pledged assets. Refer to Note 11 for additional information on GM Financial's involvement with VIEs. GM Financial is required to hold certain funds in restricted cash accounts to provide additional collateral for borrowings under certain secured credit facilities. The weighted-average interest rate on secured debt was \n5.17\n% at December 31, 2024. The revolving credit facilities have maturity dates ranging from 2025 to 2028 and securitization notes payable have maturity dates ranging from 2025 to 2037. At the end of the revolving period, if not renewed, the debt of revolving credit facilities will amortize over a defined period. In the year ended December 31, 2024, GM Financial renewed revolving credit facilities with total borrowing capacity of $\n27.4\n billion and issued $\n24.8\n billion in aggregate principal \n78\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\namount of securitization notes payable with an initial weighted-average interest rate of \n5.30\n% and maturity dates ranging from 2024 to 2037.\nUnsecured debt consists of senior notes, credit facilities and other unsecured debt. Senior notes outstanding at December 31, 2024 have maturity dates ranging from 2025 to 2034 and have a weighted-average interest rate of \n4.20\n%. In the year ended December 31, 2024, GM Financial issued $\n12.5\n billion in aggregate principal amount of senior notes with an initial weighted-average interest rate of \n5.39\n% and maturity dates ranging from 2027 to 2034.\nUnsecured credit facilities and other unsecured debt have original maturities of up to \nfive years\n. The weighted-average interest rate on these credit facilities and other unsecured debt was \n7.15\n% at December 31, 2024.\nYears Ended December 31,\n2024\n2023\n2022\nAutomotive interest expense\n$\n846\n \n$\n911\n \n$\n987\n \nAutomotive Financing - GM Financial interest expense\n6,030\n \n4,685\n \n2,881\n \nTotal interest expense\n$\n6,876\n \n$\n5,596\n \n$\n3,868\n \nThe following table summarizes contractual maturities including finance leases at December 31, 2024: \nAutomotive\nAutomotive Financing\nTotal\n2025\n$\n2,143\n \n$\n37,388\n \n$\n39,531\n \n2026\n99\n \n24,129\n \n24,228\n \n2027\n1,830\n \n19,330\n \n21,160\n \n2028\n833\n \n11,567\n \n12,400\n \n2029\n1,051\n \n10,140\n \n11,191\n \nThereafter\n9,998\n \n13,249\n \n23,247\n \n$\n15,955\n \n$\n115,804\n \n$\n131,758\n \nCompliance with Debt Covenants\n \nSeveral of our loan facilities, including our revolving credit facilities, require compliance with certain financial and operational covenants as well as regular reporting to lenders, including providing certain subsidiary financial statements. Certain of GM Financial’s secured debt agreements also contain various covenants, including maintaining portfolio performance ratios as well as limits on deferment levels. GM Financial’s unsecured debt obligations contain covenants including limitations on GM Financial's ability to incur certain liens. Failure to meet certain of these requirements may result in a covenant violation or an event of default depending on the terms of the agreement. An event of default may allow lenders to declare amounts outstanding under these agreements immediately due and payable, to enforce their interests against collateral pledged under these agreements or restrict our ability or GM Financial's ability to obtain additional borrowings. No technical defaults or covenant violations existed at December 31, 2024.\n79\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nNote 14. \nDerivative Financial Instruments \nAutomotive\n \nThe following table presents the gross fair value amounts of derivative financial instruments and the associated notional amounts in our automotive operations:\nFair Value Level\nDecember 31, 2024\nDecember 31, 2023\nNotional\nFair Value of Assets\nFair Value of Liabilities\nNotional\nFair Value of Assets\nFair Value of Liabilities\nDerivatives designated as hedges(a)\nFair value hedges\nInterest rate swaps(b)\n2\n$\n4,405\n \n$\n13\n \n$\n61\n \n$\n670\n \n$\n38\n \n$\n4\n \nCash flow hedges(c)\nForeign exchange contracts\n2\n6,555\n \n190\n \n124\n \n809\n \n6\n \n12\n \nCommodity contracts\n2\n2,323\n \n24\n \n103\n \n528\n \n17\n \n17\n \nTotal derivative financial instruments\n$\n13,283\n \n$\n227\n \n$\n288\n \n$\n2,007\n \n$\n60\n \n$\n32\n \n__________\n(a)\nThe gains/losses included in our consolidated income statements and consolidated statements of comprehensive income for the years ended December 31, 2024, 2023 and 2022 were insignificant. \n(b)\nAmounts accrued for interest payments in a net receivable position are included in Other assets. Amounts accrued for interest payments in a net payable position are included in Other liabilities. \n(c)\nThe effect of cash flow hedges recognized in the consolidated statements of comprehensive income were insignificant for the years ended December 31, 2024, 2023 and 2022. The effect of cash flow hedges reclassified from Accumulated other comprehensive loss to the consolidated income statements were insignificant for the years ended December 31, 2024, 2023 and 2022. We expect to recognize insignificant revenues and costs of goods sold over the next 12 months related to amounts included in Accumulated other comprehensive loss.\nThe fair value for Level 2 instruments was derived using the market approach based on observable market inputs including quoted prices of similar instruments and foreign exchange and interest rate forward curves.\nThe following amounts were recorded in the consolidated balance sheets related to items designated and qualifying as hedged items in fair value hedging relationships:\nDecember 31, 2024\nDecember 31, 2023\nCarrying Amount of Hedged Items\nCumulative Amount of Fair Value Hedging Adjustments\nCarrying Amount of Hedged Items\nCumulative Amount of Fair Value Hedging Adjustments\nShort-term unsecured debt\n$\n—\n \n$\n—\n \n$\n—\n \n$\n—\n \nLong-term unsecured debt\n4,405\n \n48\n \n670\n \n(\n34\n)\nAutomotive unsecured debt\n$\n4,405\n \n$\n48\n \n$\n670\n \n$\n(\n34\n)\n80\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nGM Financial\n \nThe following table presents the gross fair value amounts of GM Financial's derivative financial instruments and the associated notional amounts:\nFair Value Level\nDecember 31, 2024\nDecember 31, 2023\nNotional\nFair Value of Assets\nFair Value of Liabilities\nNotional\nFair Value of Assets\nFair Value of Liabilities\nDerivatives designated as hedges(a)\nFair value hedges\nInterest rate swaps(b)\n2\n$\n36,145\n \n$\n32\n \n$\n621\n \n$\n18,379\n \n$\n75\n \n$\n238\n \n Cash flow hedges\nInterest rate swaps\n2\n1,873\n \n35\n \n4\n \n2,381\n \n17\n \n16\n \nForeign currency swaps(c)\n2\n8,363\n \n80\n \n508\n \n8,003\n \n144\n \n311\n \nDerivatives not designated as hedges(a)\nInterest rate contracts\n2\n123,346\n \n833\n \n1,294\n \n134,683\n \n1,573\n \n1,997\n \nTotal derivative financial instruments(d)\n$\n169,727\n \n$\n981\n \n$\n2,427\n \n$\n163,446\n \n$\n1,809\n \n$\n2,563\n \n__________\n(a)\nThe gains/losses included in our consolidated income statements and statements of comprehensive income for the years ended December 31, 2024\n, \n2023 and 2022 were insignificant, unless otherwise noted. Amounts accrued for interest payments in a net receivable position are included in Other assets. Amounts accrued for interest payments in a net payable position are included in Other liabilities.\n(b)\nThe effect of fair value hedges in the consolidated income statements include losses of $\n200\n million, an insignificant loss and an insignificant gain for the years ended December 31, 2024\n, \n2023 and 2022.  \n(c)\nThe effect of foreign currency cash flow hedges in the consolidated statements of comprehensive income include losses of $\n375\n million, gains of $\n139\n million and losses of $\n529\n million recognized in Accumulated other comprehensive loss and losses of $\n422\n million, gains of $\n92\n million and losses of $\n578\n million reclassified from Accumulated other comprehensive loss into income for the years ended December 31, 2024, 2023 and 2022.\n(d)\nGM Financial held $\n190\n million and $\n457\n million of collateral from counterparties available for netting against GM Financial's asset positions, and posted $\n1.2\n billion of collateral to counterparties available for netting against GM Financial's liability positions at December 31, 2024 and 2023.\nThe fair value for Level 2 instruments was derived using the market approach based on observable market inputs including quoted prices of similar instruments and foreign exchange and interest rate forward curves.\nThe following amounts were recorded in the consolidated balance sheets related to items designated and qualifying as hedged items in fair value hedging relationships:\nDecember 31, 2024\nDecember 31, 2023\nCarrying Amount of Hedged Items\nCumulative Amount of Fair Value Hedging Adjustments(a)\nCarrying Amount of Hedged Items\nCumulative Amount of Fair Value Hedging Adjustments(a)\nShort-term unsecured debt\n$\n6,406\n \n$\n(\n6\n)\n$\n3,508\n \n$\n(\n8\n)\nLong-term unsecured debt\n30,258\n \n1,287\n \n30,043\n \n1,037\n \nGM Financial unsecured debt\n$\n36,664\n \n$\n1,281\n \n$\n33,551\n \n$\n1,029\n \n__________\n(a)\nIncludes $\n719\n million and $\n872\n million of unamortized losses remaining on hedged items for which hedge accounting has been discontinued at December 31, 2024 and 2023.\nNote 15. \nPensions and Other Postretirement Benefits \nEmployee Pension and Other Postretirement Benefit Plans \nDefined Benefit Pension Plans  \nDefined benefit pension plans covering eligible U.S. hourly employees (hired prior to October 2007) and Canadian hourly employees (hired prior to October 2016) generally provide benefits of negotiated, stated amounts for each year of service and supplemental benefits for employees who retire with \n30\n years of service before normal retirement age. The benefits provided by the defined benefit pension plans covering eligible U.S. (hired prior to January 1, 2001) and Canadian salaried employees and employees in certain other non-U.S. locations are generally based on years of \n81\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nservice and compensation history. Accrual of defined pension benefits ceased in 2012 for U.S. and Canadian salaried employees. There is also an unfunded nonqualified pension plan primarily covering U.S. executives for service prior to January 1, 2007 and it is based on an “excess plan” for service after that date. \nThe funding policy for qualified defined benefit pension plans is to contribute annually not less than the minimum required by applicable laws and regulations or to directly pay benefit payments where appropriate. In the year ended December 31, 2024, all legal funding requirements were met. \nThe following table summarizes contributions made to the defined benefit pension plans: \nYears Ended December 31,\n2024\n2023\n2022\nU.S. hourly and salaried\n$\n526\n \n$\n357\n \n$\n71\n \nNon-U.S.\n653\n \n395\n \n332\n \nTotal\n$\n1,179\n \n$\n753\n \n$\n403\n \nWe expect to make insignificant contributions to our U.S. pension plans and up to $\n120\n million in contributions to our non-U.S. pension plans in 2025.\nOther Postretirement Benefit Plans  \nCertain hourly and salaried defined benefit plans provide postretirement medical, dental, legal service and life insurance to eligible U.S. and Canadian retirees and their eligible dependents. Certain other non-U.S. subsidiaries have postretirement benefit plans, although most non-U.S. employees are covered by government sponsored or administered programs. We made contributions to the U.S. OPEB plans of $\n285\n million, $\n295\n million and $\n335\n million in the years ended December 31, 2024, 2023 and 2022. Plan participants' contributions were insignificant in the years ended December 31, 2024, 2023 and 2022. \nDefined Contribution Plans  \nWe have defined contribution plans for eligible U.S. salaried and hourly employees that provide discretionary matching contributions. Contributions are also made to certain non-U.S. defined contribution plans. We made contributions to our defined contribution plans of $\n908\n million, $\n742\n million and $\n724\n million in the years ended December 31, 2024, 2023 and 2022. \nSignificant Plan Amendments, Benefit Modifications and Related Events \nOther Remeasurements\n  As part of our collective bargaining agreement with the UAW in 2023 we amended the U.S. Hourly Pension Plan to increase the monthly basic benefit by $\n5.00\n a month for active plan members and to provide an annual contribution of $\n500\n to eligible retirees and surviving spouses for the duration of the contract. These changes increased our pension obligation by $\n791\n million for the year ended December 31, 2023.\nIn the three months ended December 31, 2024, we completed a $\n699\n million annuity purchase for salaried retirees in the U.S. This resulted in an insignificant non-operating pension settlement.\n82\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nPension and OPEB Obligations and Plan Assets\nYear Ended December 31, 2024\nYear Ended December 31, 2023\nPension Benefits\nGlobal OPEB Plans\nPension Benefits\nGlobal OPEB Plans\nU.S. \nNon-U.S. \nU.S. \nNon-U.S. \nChange in benefit obligations\nBeginning benefit obligation\n$\n44,481\n \n$\n13,140\n \n$\n4,701\n \n$\n44,817\n \n$\n12,582\n \n$\n4,543\n \nService cost\n113\n \n156\n \n10\n \n103\n \n161\n \n9\n \nInterest cost\n2,132\n \n505\n \n226\n \n2,273\n \n551\n \n236\n \nAmendments\n15\n \n51\n \n—\n \n795\n \n17\n \n—\n \nActuarial (gains) losses\n(\n1,600\n)\n(\n350\n)\n(\n179\n)\n1,185\n \n453\n \n204\n \nBenefits paid\n(\n4,140\n)\n(\n931\n)\n(\n363\n)\n(\n4,186\n)\n(\n1,001\n)\n(\n371\n)\nForeign currency translation adjustments\n—\n \n(\n882\n)\n(\n95\n)\n—\n \n453\n \n32\n \nCurtailments, settlements and other\n(\n859\n)\n(\n85\n)\n37\n \n(\n506\n)\n(\n76\n)\n48\n \nEnding benefit obligation\n40,142\n \n11,604\n \n4,337\n \n44,481\n \n13,140\n \n4,701\n \nChange in plan assets\nBeginning fair value of plan assets\n42,287\n \n9,819\n \n—\n \n44,901\n \n9,530\n \n—\n \nActual return on plan assets\n487\n \n288\n \n—\n \n1,829\n \n640\n \n—\n \nEmployer contributions\n526\n \n653\n \n338\n \n357\n \n395\n \n348\n \nBenefits paid\n(\n4,140\n)\n(\n931\n)\n(\n363\n)\n(\n4,186\n)\n(\n1,001\n)\n(\n371\n)\nForeign currency translation adjustments\n—\n \n(\n610\n)\n—\n \n—\n \n354\n \n—\n \nSettlements and other\n(\n862\n)\n(\n98\n)\n25\n \n(\n614\n)\n(\n99\n)\n23\n \nEnding fair value of plan assets\n38,298\n \n9,121\n \n—\n \n42,287\n \n9,819\n \n—\n \nEnding funded status\n$\n(\n1,844\n)\n$\n(\n2,483\n)\n$\n(\n4,337\n)\n$\n(\n2,194\n)\n$\n(\n3,321\n)\n$\n(\n4,701\n)\nAmounts recorded in the consolidated balance sheets\nNon-current assets\n$\n—\n \n$\n1,575\n \n$\n—\n \n$\n—\n \n$\n1,557\n \n$\n—\n \nCurrent liabilities\n(\n68\n)\n(\n54\n)\n(\n347\n)\n(\n62\n)\n(\n330\n)\n(\n356\n)\nNon-current liabilities\n(\n1,776\n)\n(\n4,004\n)\n(\n3,990\n)\n(\n2,132\n)\n(\n4,548\n)\n(\n4,345\n)\nNet amount recorded\n$\n(\n1,844\n)\n$\n(\n2,483\n)\n$\n(\n4,337\n)\n$\n(\n2,194\n)\n$\n(\n3,321\n)\n$\n(\n4,701\n)\nAmounts recorded in Accumulated other comprehensive loss\nNet actuarial loss\n$\n(\n3,953\n)\n$\n(\n2,242\n)\n$\n(\n152\n)\n$\n(\n3,372\n)\n$\n(\n2,560\n)\n$\n(\n332\n)\nNet prior service (cost) credit\n(\n747\n)\n(\n117\n)\n(\n5\n)\n(\n793\n)\n(\n74\n)\n8\n \nTotal recorded in Accumulated other comprehensive loss\n$\n(\n4,700\n)\n$\n(\n2,359\n)\n$\n(\n157\n)\n$\n(\n4,165\n)\n$\n(\n2,634\n)\n$\n(\n324\n)\nIn the year ended December 31, 2024, the actuarial gain included in the benefit obligations was primarily due to an increase in discount rates.\nIn the year ended December 31, 2023, the actuarial loss included in the benefit obligations was primarily due to a decrease in discount rates.\n83\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nThe following table summarizes the total accumulated benefit obligations (ABO), the ABO and fair value of plan assets for defined benefit pension plans with ABO in excess of plan assets, and the projected benefit obligation (PBO) and fair value of plan assets for defined benefit pension plans with PBO in excess of plan assets: \nDecember 31, 2024\nDecember 31, 2023\nU.S. \nNon-U.S. \nU.S. \nNon-U.S. \nABO\n$\n40,126\n \n$\n11,516\n \n$\n44,464\n \n$\n13,050\n \nPlans with ABO in excess of plan assets\nABO\n$\n40,126\n \n$\n4,267\n \n$\n44,464\n \n$\n4,863\n \nFair value of plan assets\n$\n38,298\n \n$\n298\n \n$\n42,287\n \n$\n74\n \nPlans with PBO in excess of plan assets\nPBO\n$\n40,141\n \n$\n4,396\n \n$\n44,481\n \n$\n4,953\n \nFair value of plan assets\n$\n38,298\n \n$\n338\n \n$\n42,287\n \n$\n74\n \nThe following table summarizes the components of net periodic pension and OPEB expense along with the assumptions used to determine benefit obligations:\nYear Ended December 31, 2024\nYear Ended December 31, 2023\nYear Ended December 31, 2022\nPension Benefits\nGlobal OPEB Plans\nPension Benefits\nGlobal OPEB Plans\nPension Benefits\nGlobal OPEB Plans\nU.S. \nNon-U.S. \nU.S. \nNon-U.S. \nU.S. \nNon-U.S. \nComponents of expense\nService cost\n$\n185\n$\n165\n$\n10\n$\n173\n$\n173\n$\n9\n$\n233\n$\n157\n$\n16\nInterest cost\n2,132\n505\n226\n2,273\n551\n236\n1,292\n293\n148\nExpected return on plan assets\n(\n2,740\n)\n(\n521\n)\n—\n(\n2,922\n)\n(\n573\n)\n—\n(\n3,000\n)\n(\n534\n)\n—\nAmortization of net actuarial (gains) losses\n8\n46\n1\n—\n32\n(\n23\n)\n18\n133\n67\nCurtailments, settlements and other\n56\n18\n(\n1\n)\n126\n33\n2\n(\n17\n)\n10\n(\n5\n)\nNet periodic pension and OPEB (income) expense\n$\n(\n359\n)\n$\n213\n$\n236\n$\n(\n350\n)\n$\n216\n$\n224\n$\n(\n1,474\n)\n$\n59\n$\n226\nWeighted-average assumptions used to determine benefit obligations(a)\nDiscount rate\n5.56\n \n%\n4.68\n \n%\n5.51\n \n%\n5.12\n \n%\n4.41\n \n%\n5.13\n \n%\n5.47\n \n%\n4.85\n \n%\n5.51\n \n%\nWeighted-average assumptions used to determine net expense(a)\nDiscount rate\n5.08\n \n%\n5.10\n \n%\n5.13\n \n%\n5.37\n \n%\n5.33\n \n%\n5.48\n \n%\n2.34\n \n%\n2.98\n \n%\n2.84\n \n%\nExpected rate of return on plan assets\n6.27\n \n%\n5.25\n \n%\nN/A\n6.30\n \n%\n5.65\n \n%\nN/A\n5.38\n \n%\n4.39\n \n%\nN/A\n__________\n(a)    The rate of compensation increase and the cash balance interest crediting rates do not have a significant effect on our U.S. pension and OPEB plans.\nThe non-service cost components of the net periodic pension and OPEB income are presented in Interest income and other non-operating income, net. Refer to Note 19 for additional information.\nU.S. pension plan service cost, which includes administrative expenses and Pension Benefit Guarantee Corporation premiums, were insignificant for the years ended December 31, 2024, 2023 and 2022. Weighted-average assumptions used to determine net expense are determined at the beginning of the period and updated for remeasurements. Non-U.S. pension plan administrative expenses included in service cost were insignificant in the years ended December 31, 2024, 2023 and 2022.\n84\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nAssumptions\nInvestment Strategies and Long-Term Rate of Return  \nDetailed periodic studies are conducted by our internal asset management group as well as outside actuaries and are used to determine the long-term strategic mix among asset classes, risk mitigation strategies and the expected long-term ROA assumptions for the U.S. pension plans. The U.S. study includes a review of alternative asset allocation and risk mitigation strategies, anticipated future long-term performance and risk of the individual asset classes that comprise the plans' asset mix. Similar studies are performed for the significant non-U.S. pension plans with the assistance of outside actuaries and asset managers. While the studies incorporate data from recent plan performance and historical returns, the expected rate of return on plan assets represents our estimate of long-term prospective rates of return. \nWe continue to pursue various options to fund and to manage risk in our pension plans, including continued changes to the pension asset portfolio mix to manage funded status volatility. The strategic asset mix and risk mitigation strategies for the plans are tailored specifically for each plan. Individual plans have distinct liabilities, liquidity needs and regulatory requirements. Consequently, there are different investment policies set by individual plan fiduciaries. Although investment policies and risk mitigation strategies may differ among plans, each investment strategy is considered to be appropriate in the context of the specific factors affecting each plan. \nIn setting new strategic asset mixes, consideration is given to the likelihood that the selected asset mixes will effectively fund the projected pension plan liabilities, while aligning with the risk tolerance of the plans' fiduciaries. The strategic asset mixes for U.S. defined benefit pension plans are increasingly designed to satisfy the competing objectives of improving funded positions (market value of assets equal to or greater than the present value of the liabilities) and mitigating the possibility of a deterioration in funded status. \nDerivatives may be used to provide cost effective solutions for rebalancing investment portfolios, increasing or decreasing exposure to various asset classes and for mitigating risks, primarily interest rate, equity and currency risks. Equity and fixed income managers are permitted to utilize derivatives as efficient substitutes for traditional securities. Interest rate derivatives may be used to adjust portfolio duration to align with a plan's targeted investment policy and equity derivatives may be used to protect equity positions from downside market losses. Alternative investment managers are permitted to employ leverage, including through the use of derivatives, which may alter economic exposure.\nIn\n December 2024\n, an investment policy study was completed for the U.S. pension plans. As a result, the weighted-average long-term rate of ROA increased from \n6.3\n% at December 31, 2023 to \n6.5\n% at December 31, 2024. The expected long-term rate of return on plan assets used in determining pension expense for non-U.S. plans is determined in a similar manner to the U.S. plans.\nTarget Allocation Percentages  \nThe following table summarizes the target allocations by asset category for U.S. and non-U.S. defined benefit pension plans:\nDecember 31, 2024\nDecember 31, 2023\nU.S.\nNon-U.S.\nU.S.\nNon-U.S.\nEquity\n11\n \n%\n9\n \n%\n11\n \n%\n10\n \n%\nDebt\n60\n \n%\n74\n \n%\n60\n \n%\n75\n \n%\nOther(a)\n29\n \n%\n17\n \n%\n29\n \n%\n15\n \n%\nTotal\n100\n \n%\n100\n \n%\n100\n \n%\n100\n \n%\n__________\n(a)    \nPrimarily includes private equity, real estate and absolute return strategies, which mainly consis\nt of hedge funds.\n85\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nAssets and Fair Value Measurements  \nThe following tables summarize the fair value of U.S. and non-U.S. defined benefit pension plan assets by asset class: \nDecember 31, 2024\nDecember 31, 2023\nLevel 1\nLevel 2\nLevel 3\nTotal\nLevel 1\nLevel 2\nLevel 3\nTotal\nU.S. Pension Plan Assets\nCommon and preferred stocks\n$\n15\n \n$\n—\n \n$\n—\n \n$\n15\n \n$\n850\n \n$\n—\n \n$\n—\n \n$\n850\n \nGovernment and agency debt securities(a)\n—\n \n11,728\n \n—\n \n11,728\n \n—\n \n9,822\n \n—\n \n9,822\n \nCorporate and other debt securities\n—\n \n15,155\n \n—\n \n15,155\n \n—\n \n20,957\n \n3\n \n20,960\n \nOther investments, net(b)(c)\n(\n75\n)\n(\n3,662\n)\n389\n \n(\n3,348\n)\n545\n \n(\n269\n)\n328\n \n604\n \nNet plan assets subject to leveling\n$\n(\n60\n)\n$\n23,221\n \n$\n389\n \n23,550\n \n$\n1,395\n \n$\n30,510\n \n$\n331\n \n32,236\n \nPlan assets measured at net asset value\nInvestment funds\n10,025\n \n5,322\n \nPrivate equity and debt investments\n2,961\n \n2,864\n \nReal estate investments\n2,655\n \n2,976\n \nTotal plan assets measured at net asset value\n15,641\n \n11,162\n \nOther plan assets (liabilities), net(d)\n(\n893\n)\n(\n1,111\n)\nNet plan assets\n$\n38,298\n \n$\n42,287\n \nDecember 31, 2024\nDecember 31, 2023\nLevel 1\nLevel 2\nLevel 3\nTotal\nLevel 1\nLevel 2\nLevel 3\nTotal\nNon-U.S. Pension Plan Assets\nCommon and preferred stocks\n$\n98\n \n$\n—\n \n$\n—\n \n$\n98\n \n$\n160\n \n$\n—\n \n$\n—\n \n$\n160\n \nGovernment and agency debt securities(a)\n—\n \n2,262\n \n5\n \n2,267\n \n—\n \n2,310\n \n—\n \n2,310\n \nCorporate and other debt securities\n—\n \n2,336\n \n8\n \n2,344\n \n—\n \n2,738\n \n7\n \n2,745\n \nOther investments, net(b)(c)\n8\n \n(\n151\n)\n35\n \n(\n108\n)\n(\n4\n)\n(\n55\n)\n43\n \n(\n16\n)\nNet plan assets subject to leveling\n$\n106\n \n$\n4,447\n \n$\n48\n \n4,601\n \n$\n156\n \n$\n4,993\n \n$\n50\n \n5,199\n \nPlan assets measured at net asset value\nInvestment funds\n3,303\n \n3,265\n \nPrivate equity and debt investments\n406\n \n431\n \nReal estate investments\n689\n \n781\n \nTotal plan assets measured at net asset value\n4,398\n \n4,477\n \nOther plan assets (liabilities), net(d)\n122\n \n143\n \nNet plan assets\n$\n9,121\n \n$\n9,819\n \n__________\n(a)\nIncludes U.S. and sovereign government and agency issues. \n(b)\nIncludes net derivative assets (liabilities).\n(c)\nLevel 2 Other investments, net includes approximately $\n3.6\n billion of U.S. reverse repurchase agreements at December 31, 2024, and approximately \n$\n185\n million\n and $\n137\n million of Canadian reverse repurchase agreements at December 31, 2024 and 2023.\n(d)\nCash held by the plans, net of amounts receivable/payable for unsettled security transactions and payables for investment manager fees, custody fees and other expenses.\nThe activity attributable to U.S. and non-U.S. Level 3 defined benefit pension plan investments was \ninsignificant\n in the years ended December 31, 2024 and 2023.\nInvestment Fund Strategies  \nInvestment funds include hedge funds, funds of hedge funds, equity funds and fixed income funds. Hedge funds and funds of hedge funds managers typically seek to achieve their objectives by allocating capital across a broad array of funds and/or investment managers. Equity funds invest in U.S. common and preferred stocks as well as similar equity securities issued by companies incorporated, listed or domiciled in developed and/or emerging market countries. Fixed income funds include investments in high quality funds and, to a lesser extent, high yield funds. High quality fixed income \n86\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nfunds invest in government securities, investment-grade corporate bonds and mortgage and asset-backed securities. High yield fixed income funds invest in high yield fixed income securities issued by corporations, which are rated below investment grade. Other investment funds also included in this category primarily represent multi-strategy funds that invest in broadly diversified portfolios of equity, fixed income and derivative instruments. \nPrivate equity and debt investments primarily consist of investments in private equity and debt funds. These investments provide exposure to and benefit from long-term equity investments in private companies, including leveraged buy-outs, venture capital and distressed debt strategies.\nReal estate investments include funds that invest in entities that are primarily engaged in the ownership, acquisition, development, financing, sale and/or management of income-producing real estate properties, both commercial and residential. These funds typically seek long-term growth of capital and current income that is above average relative to public equity funds.\nSignificant Concentrations of Risk  \nThe assets of the pension plans include certain investment funds, private equity and debt investments and real estate investments. Investment managers may be unable to quickly sell or redeem some or all of these investments at an amount close or equal to fair value in order to meet a plan's liquidity requirements or to respond to specific events such as deterioration in the creditworthiness of any particular issuer or counterparty. \nIlliquid investments held by the plans are generally long-term investments that complement the long-term nature of pension obligations and are not used to fund benefit payments when currently due. Plan management monitors liquidity risk on an ongoing basis and has procedures in place that are designed to maintain flexibility in addressing plan-specific, broader industry and market liquidity events. \nThe pension plans may invest in financial instruments denominated in foreign currencies and may be exposed to risks that the foreign currency exchange rates might change in a manner that has an adverse effect on the value of the foreign currency denominated assets or liabilities. Forward currency contracts may be used to manage and mitigate foreign currency risk. \nThe pension plans may invest in debt securities for which any change in the relevant interest rates for particular securities might result in an investment manager being unable to secure similar returns upon the maturity or the sale of securities. In addition, changes to prevailing interest rates or changes in expectations of future interest rates might result in an increase or decrease in the fair value of the securities held. Interest rate swaps and other financial derivative instruments may be used to manage interest rate risk. \nBenefit Payments  \nBenefits for most U.S. pension plans and certain non-U.S. pension plans are paid out of plan assets rather than our Cash and cash equivalents. \nThe following table summarizes net benefit payments expected to be paid in the future, which include assumptions related to estimated future employee service: \nPension Benefits\nGlobal OPEB Plans\nU.S. Plans\nNon-U.S. Plans\n2025\n$\n4,282\n \n$\n973\n \n$\n354\n \n2026\n$\n4,036\n \n$\n870\n \n$\n350\n \n2027\n$\n3,919\n \n$\n855\n \n$\n347\n \n2028\n$\n3,771\n \n$\n840\n \n$\n343\n \n2029\n$\n3,580\n \n$\n824\n \n$\n341\n \n2030–2034\n$\n15,900\n \n$\n3,909\n \n$\n1,644\n \nNote 16. \nCommitments and Contingencies \nLitigation-Related Liability and Tax Administrative Matters  \nIn the normal course of our business, we are named from time to time as a defendant in various legal actions, including arbitrations, class actions and other litigation. We identify below the material individual proceedings and investigations where we believe a material loss is reasonably possible or probable. We accrue for matters when we believe that losses are probable and can be reasonably estimated. At December 31, 2024 and 2023, we had accruals of $\n1.1\n billion and $\n1.2\n billion for such legal actions in Accrued liabilities and Other liabilities. In many matters, it is inherently difficult to determine whether a loss is probable or reasonably possible or to estimate the size or range \n87\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nof the potential loss. Some matters may involve compensatory, punitive or other treble damage claims, environmental remediation programs or sanctions that, if granted, could require us to pay damages or make other expenditures in amounts that cannot be reasonably estimated. Accordingly, while we believe that appropriate accruals have been established for losses that are probable and can be reasonably estimated, it is possible that adverse outcomes from such proceedings could exceed the amounts accrued by an amount that could be material to our results of operations or cash flows in any particular reporting period. \nGM Korea Subcontract Workers Litigation  \nGM Korea Company (GM Korea) is party to litigation with current and former subcontract workers over allegations that they are entitled to the same wages and benefits provided to full-time employees, and to be hired as full-time employees. In May 2018 and September 2020, the Korean labor authorities issued adverse administrative orders finding that GM Korea must hire certain current subcontract workers as full-time employees. GM Korea appealed the May 2018 and September 2020 orders. Since June 2020, the Seoul High Court (an intermediate-level appellate court) ruled against GM Korea in \neight\n subcontract worker claims. While GM Korea's appeals were pending in the Supreme Court of the Republic of Korea (Korea Supreme Court), GM Korea hired certain of its subcontract workers as full-time employees. During the third quarter of 2024, the Korea Supreme Court issued its decisions with respect to the appeal. While the Korea Supreme Court ruled against GM Korea on most of the appeals, the Korea Supreme Court ruled in favor of GM Korea with regard to certain subcontract workers. At December 31, 2024, our accrual covering certain asserted claims and claims that we believe are probable of assertion and for which liability is probable was insignificant. We estimate the reasonably possible loss in excess of amounts accrued for other current subcontract workers who may assert similar claims to be insignificant at December 31, 2024.\nOther Litigation-Related Liability and Tax Administrative Matters  \nVarious other legal actions, including class actions, governmental investigations, claims and proceedings are pending against us or our related companies or joint ventures, including, but not limited to, matters arising out of alleged product defects; employment-related matters; product and workplace safety, vehicle emissions and fuel economy regulations; product warranties; financial services; dealer, supplier and other contractual relationships; competition issues; tax-related matters not subject to the provision of Accounting Standards Codification 740, \"Income Taxes\" (indirect tax-related matters); product design, manufacture and performance; consumer protection laws; and environmental protection laws, including laws regulating air emissions, water discharges, waste management and environmental remediation from stationary sources. We also from time to time receive subpoenas and other inquiries or requests for information from agencies or other representatives of U.S. federal, state and foreign governments on a variety of issues.\nThere are several putative class actions pending against GM in the U.S. and Canada alleging that various vehicles sold, including model year 2011–2016 Duramax Diesel Chevrolet Silverado and GMC Sierra vehicles, violate federal and state laws because they release more emissions than a reasonable customer would expect. In July 2023, the \ntwo\n putative class actions pending in the U.S. were dismissed with prejudice and judgment entered in favor of GM, and plaintiffs appealed the dismissal. In August 2024, the Sixth Circuit reversed the dismissal in one of the cases. In October 2024, a panel of the Sixth Circuit vacated the judgment in favor of GM in one of the class actions, but a different panel has yet to rule in the other class action. We are currently unable to estimate any reasonably possible material loss or range of loss that may result from these actions. GM has also faced a series of additional lawsuits in the U.S. based on these allegations, including a shareholder demand lawsuit that remains pending.\nThere are several putative class actions and \ntwo\n certified class actions pending against GM in the U.S. alleging that various 2011–2014 model year vehicles are defective because they excessively consume oil. While many of these proceedings have been dismissed or have been settled for insignificant amounts, several remain outstanding. In October 2022, we received an adverse jury verdict in a certified class action proceeding involving three states. We have reached an agreement in principle to resolve these matters and have accrued an immaterial amount related to these proceedings.\nThere is \none\n putative class action and \none\n certified class action pending against GM in the U.S. alleging that various 2015–2022 model year vehicles are defective because they are equipped with faulty 8-speed transmissions. In March 2023, the judge overseeing the class action concerning 2015–2019 model year vehicles certified 26 state subclasses. In October 2024, a panel of the Sixth Circuit affirmed certification of these state subclasses; in December 2024, the Sixth Circuit granted our petition for rehearing en banc. The putative class action concerning 2020–2022 model year vehicles is pending in front of a different judge that has not yet addressed class certification. We have similar cases pending in Canada concerning these vehicles. We are \n88\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\ncurrently unable to estimate any reasonably possible or probable material loss or range of loss that may result from these proceedings in excess of amounts accrued.\nThere is a class action pending against GM in the U.S., and a putative class action in Canada, alleging that 2011–2016 model year Duramax Diesel Chevrolet Silverado and GMC Sierra vehicles are equipped with defective fuel pumps that are prone to failure. In March 2023, the U.S. court certified seven state subclasses. We reached an agreement to settle this matter on terms consistent with our accrual and the settlement agreement is pending final court approval.\nBeyond the class action litigations disclosed, we have several other class action litigations pending at any given time. Historically, relatively few classes have been certified in these types of cases. Therefore, we will generally only disclose specific class actions if a class is certified and we believe there is a reasonably possible material exposure to the Company. \nIndirect tax-related matters are being evaluated globally pertaining to value added taxes, customs, duties, sales tax, property taxes and other non-income tax exposures. Certain administrative proceedings are indirect tax-related and may require that we deposit funds in escrow or provide an alternative form of security. For indirect tax-related matters, we estimate our reasonably possible loss in excess of amounts accrued to be up to approximately $\n5.6\n billion at December 31, 2024.\nTakata Matters \n In November 2020, NHTSA directed that we replace the Takata Corporation (Takata) airbag inflators in our GMT900 vehicles, which are full-size pickup trucks and SUVs, and we decided not to contest NHTSA's decision. While we have already begun the process of executing the recall, given the number of vehicles in this population, the recall will take several years to be completed. Accordingly, in the year ended December 31, 2020, we recorded a warranty accrual of $\n1.1\n billion for the expected costs of complying with the recall remedy. At December 31, 2024, our remaining accrual for these matters was $\n555\n million, and we believe the currently accrued amount remains reasonable.\nGM has recalled certain vehicles sold outside of the U.S. to replace Takata inflators in those vehicles. There are significant differences in vehicle and inflator design between the relevant vehicles sold internationally and those sold in the U.S. We continue to gather and analyze evidence about these inflators and to share our findings with regulators. Any additional recalls relating to these inflators could be material to our results of operations and cash flows.\nThere are several putative class actions that have been filed against GM, including in the U.S. and Canada, arising out of allegations that airbag inflators manufactured by Takata are defective. In March 2023, a U.S. court overseeing \none\n of the putative class actions issued a final judgment in favor of GM on all claims in eight states at issue in that proceeding. In August 2023, the U.S. court granted class certification as to a Louisiana claim, but denied certification as to seven other states. At this stage of these proceedings, we are unable to provide an estimate of the amounts or range of reasonably possible material loss.\nARC Matters\n  In May 2023, we initiated a voluntary recall covering nearly \none\n million 2014–2017 model year Buick Enclave, Chevrolet Traverse and GMC Acadia SUVs equipped with driver front airbag inflators manufactured by ARC Automotive, Inc. (ARC), and accrued an insignificant amount for the expected costs of the recall. As part of its ongoing investigation into ARC airbag inflators, on September 5, 2023, NHTSA issued an Initial Decision that approximately \n52\n million frontal driver and passenger airbag inflators manufactured by ARC and Delphi Automotive Systems LLC over a roughly \n20-year\n period contain a safety-related defect and must be recalled. On July 31, 2024, NHTSA issued a Supplemental Initial Decision reaffirming its September 2023 Initial Decision and reopening the administrative record to additional public comments. The Initial Decision and the Supplemental Initial Decision are primarily based on the occurrence of seven field ruptures involving ARC-manufactured frontal airbag inflators. We are continuing to investigate the cause of the ruptures in GM vehicles in connection with our existing recalls. On December 13, 2024, NHTSA issued a memorandum indicating that, based on the public comments it had received to date, the agency would be \"conducting additional investigation of the issues related to the Supplemental Initial Decision.\" As indicated in GM's filed comments in the record, we do not believe that further GM vehicle recalls are necessary or appropriate at this time. However, depending on the outcome of the dispute between NHTSA and ARC, and the possibility of additional recalls, the cost of which may not be fully recoverable, it is reasonably possible that the costs associated with these matters in excess of amounts accrued could be material, but we are unable to provide an estimate of the amounts or range of reasonably possible material loss at this time.\nThere are several putative class actions that have been filed against GM, including in the U.S., Canada and Israel, arising out of allegations that airbag inflators manufactured by ARC are defective. At this stage of these proceedings, we are unable to provide an estimate of the amounts or range of reasonably possible material loss.\n89\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nChevrolet Bolt Recall  \nIn July 2021, we initiated a voluntary recall for certain 2017–2019 model year Chevrolet Bolt EVs due to the risk that \ntwo\n manufacturing defects present in the same battery cell could cause a high voltage battery fire in certain of these vehicles. After further investigation into the manufacturing processes at our battery supplier, LG Energy Solution (LGES), and disassembling battery packs, we determined that the risk of battery cell defects was not confined to the initial recall population. As a result, in August 2021, we expanded the recall to include all 2017–2022 model year Chevrolet Bolt EV and Chevrolet Bolt Electric Utility Vehicles (EUVs). LG Electronics, Inc. (LGE) and LGES (collectively, LG), have agreed to reimburse GM for certain costs and expenses associated with the recall. The commercial negotiations with LG also resolved other commercial matters associated with our Ultium Cells Holdings LLC joint venture with LGES. Accordingly, as of December 31, 2024, we had accrued a total of $\n2.6\n billion and recognized receivables totaling $\n1.6\n billion in connection with these matters. At December 31, 2024, our remaining accrual for these matters was $\n0.3\n billion. These charges reflect our current best estimate for the cost of the recall remedy, which includes non-traditional recall remedies provided by GM to enhance customer satisfaction. The actual costs of the recall could be materially higher or lower. \nIn addition, putative class actions have been filed against GM in the U.S. and Canada alleging that the batteries contained in the Bolt EVs and EUVs included in the recall population are defective. GM has agreed to settle the U.S. class actions for an immaterial amount and the settlement agreement is pending final court approval.\nOpel/Vauxhall Sale\n  In 2017, we sold the Opel/Vauxhall Business to PSA Group (now Stellantis) under a Master Agreement (the Agreement). We also sold the European financing subsidiaries and branches to Banque PSA Finance S.A. and BNP Paribas Personal Finance S.A. Although the sale reduced our new vehicle presence in Europe, we may still be impacted by actions taken by regulators related to vehicles sold before the sale. General Motors Holdings LLC agreed, on behalf of our wholly owned subsidiary (the Seller), to indemnify Stellantis for certain losses resulting from any inaccuracy of the representations and warranties or breaches of our covenants included in the Agreement and for certain other liabilities, including costs related to certain emissions claims, product liabilities and recalls. We are unable to estimate any reasonably possible material loss or range of loss that may result from these actions either directly or through an indemnification claim from Stellantis. Certain of these indemnification obligations are subject to time limitations, thresholds and/or caps as to the amount of required payments.\nCurrently, various consumer lawsuits have been filed against the Seller and Stellantis in Germany, the UK, Austria and the Netherlands alleging that Opel and Vauxhall vehicles sold by the Seller violated applicable emissions standards. In addition, we indemnified Stellantis for an immaterial amount for certain recalls that Stellantis has conducted or will conduct, including recalls in certain geographic locations that Stellantis intends to conduct related to Takata inflators in legacy Opel vehicles. We may in the future be required to further indemnify Stellantis relating to its Takata recalls, but we believe such further indemnification to be remote at this time.\nEuropean Commission and UK Competition and Markets Authority Matter\n  In March 2022, the European Commission and UK Competition and Markets Authority (CMA) conducted inspections at the premises of, and sent out formal requests for information to, several companies and associations active in the automotive sector. The investigations concern conduct related to coordination regarding the collection, treatment and recovery of end-of-life cars and vans, which are considered waste. GM was not the subject of the inspections but has since received requests for information related to activities conducted by Opel, a former subsidiary business we sold to Stellantis in 2017. GM has replied to the European Commission's and CMA's requests for information. The inspections and requests for information are preliminary investigatory steps and do not prejudge the outcome of the investigations, and as of December 31, 2024, we had accrued an immaterial amount related to this matter. If an infringement is established as to Opel's conduct, there are a range of possible outcomes, including fines, which could be material.\nPrivacy and Consumer Protection Matters\n  There are putative class actions pending against GM in federal courts in the U.S. alleging violations of state and federal privacy and consumer protection laws related to the collection and use of certain consumer data obtained through our former OnStar Smart Driver product. In June 2024, those class actions were consolidated into a multi-district litigation proceeding in the Northern District of Georgia. In addition, a number of federal and state agencies and attorneys general have opened investigations or made inquiries of us relating to these alleged consumer protection and privacy issues. The Company is fully cooperating with these agencies and attorneys general. At this stage, we are not able to estimate any reasonably possible or probable material loss or range of loss that may result from these actions.\nProduct Liability and Breach of Warranty  \nWe record liabilities related to product liability claims in Accrued liabilities and Other liabilities for the expected cost of all known product liability claims, plus an estimate of the expected cost for product liability claims that have already been incurred and are expected to be filed in the future for which we are self-insured. It is \n90\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nreasonably possible that our accruals for product liability claims may increase in future periods in material amounts, although we cannot estimate a reasonable range of incremental loss based on currently available information. We believe that any judgment against us involving our products for actual damages will be adequately covered by our recorded accruals and, where applicable, excess liability insurance coverage.\nWe are also subject to breach of warranty claims resulting from state and federal consumer protection laws which allow consumers to hold manufacturers legally responsible for \"breaches\" of implied or express warranties. Claims can include but are not limited to a refund, a replacement vehicle, a recovery of legal and administrative fees or other monetary damages. Losses that we believe to be probable and estimable based on evaluation of historical transactions are included in Accrued liabilities and Other liabilities and are reviewed regularly for adequacy. We believe that any judgment against us involving our warranties for actual damages will be adequately covered by our recorded accruals.\nGuarantees  \nWe enter into indemnification agreements for liability claims involving products manufactured primarily by certain joint ventures. These guarantees terminate in years ranging from 2025 to 2029, or upon the occurrence of specific events or are ongoing. We believe that the related potential costs incurred are adequately covered by our recorded accruals, which are insignificant. The maximum future undiscounted payments mainly based on royalties received associated with vehicles sold to date were $\n3.7\n billion and $\n3.5\n billion for these guarantees at December 31, 2024 and 2023, the majority of which relates to the indemnification agreements.\nWe provide payment guarantees on commercial loans outstanding with third parties such as dealers. In some instances, certain assets of the party or our payables to the party whose debt or performance we have guaranteed may offset, to some degree, the amount of any potential future payments. We are also exposed to residual value guarantees associated with certain sales to rental car companies.\nWe periodically enter into agreements that incorporate indemnification provisions in the normal course of business. It is not possible to estimate our maximum exposure under these indemnifications or guarantees due to the conditional nature of these obligations. Insignificant amounts have been recorded for such obligations as the majority of them are not probable or estimable at this time and the fair value of the guarantees at issuance was insignificant. Refer to the Opel/Vauxhall Sale section of this note for additional information on our indemnification obligations to Stellantis under the Agreement.\nCredit Cards  \nCredit card programs offer rebates that can be applied primarily against the purchase or lease of our vehicles. At December 31, 2024 and 2023, our redemption liability was insignificant, our deferred revenue was $\n425\n million and $\n384\n million, and qualified cardholders had rebates available, net of deferred program revenue, of $\n1.1\n billion and $\n1.2\n billion. Our redemption liability and deferred revenue are recorded in Accrued liabilities and Other liabilities.\nSupplier Finance Programs  \nThird-party finance providers offer certain suppliers the option for payment in advance of their invoice due date through financing programs that we established. We retain our obligation to the participating suppliers, and we make payments directly to the third-party finance providers on the original invoice due date pursuant to the original invoice terms. There are no assets pledged as security or other forms of guarantees provided for committed payments. Our outstanding eligible balances under our supplier finance programs were $\n0.9\n billion and $\n1.3\n billion at December 31, 2024 and 2023, which are recorded in \nAccounts payable\n (principally trade).\nThe following table represents the change in the supplier finance program obligation (dollars in billions):\nYear Ended December 31, 2024\nConfirmed obligations outstanding at the beginning of the year\n$\n1.3\n \nInvoices confirmed during the year\n11.8\n \nConfirmed paid during the year\n(\n12.2\n)\nConfirmed obligations outstanding at the end of the year\n$\n0.9\n \n91\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nNote 17. \nIncome Taxes \nYears Ended December 31,\n2024\n2023\n2022\nU.S. income (loss)\n$\n9,729\n \n$\n6,388\n \n$\n9,454\n \nNon-U.S. income (loss)\n3,465\n \n3,535\n \n1,306\n \nIncome (loss) before income taxes and equity income (loss)\n$\n13,194\n \n$\n9,924\n \n$\n10,760\n \nYears Ended December 31,\n2024\n2023\n2022\nCurrent income tax expense (benefit)\nU.S. federal\n$\n202\n \n$\n240\n \n$\n389\n \nU.S. state and local\n309\n \n490\n \n368\n \nNon-U.S.\n676\n \n874\n \n707\n \nTotal current income tax expense (benefit)\n1,188\n \n1,605\n \n1,464\n \nDeferred income tax expense (benefit)\nU.S. federal\n891\n \n(\n120\n)\n263\n \nU.S. state and local\n101\n \n(\n43\n)\n109\n \nNon-U.S.\n376\n \n(\n878\n)\n53\n \nTotal deferred income tax expense (benefit)\n1,368\n \n(\n1,041\n)\n425\n \nTotal income tax expense (benefit)\n$\n2,556\n \n$\n563\n \n$\n1,888\n \nThe Non-U.S. deferred income tax benefit in the year ended December 31, 2023 relates primarily to the release of a valuation allowance in Korea.\nProvisions are made for estimated U.S. and non-U.S. income taxes which may be incurred on the reversal of our basis differences in investments in foreign subsidiaries and corporate joint ventures not deemed to be indefinitely reinvested. Taxes have not been provided on basis differences in investments primarily as a result of earnings in foreign subsidiaries which are deemed indefinitely reinvested of $\n6.1\n billion and $\n4.3\n billion at December 31, 2024 and 2023. We have indefinitely reinvested basis differences related to investments in non-consolidated China JVs of $\n1.4\n billion and $\n3.4\n billion at December 31, 2024 and 2023 as a result of fresh-start reporting. Quantification of the deferred tax liability, if any, associated with indefinitely reinvested basis differences is not practicable. Refer to Note 8 for additional information regarding the decrease in our basis differences related to investments in nonconsolidated affiliates from fresh-start reporting.\nYears Ended December 31,\n2024\n2023\n2022\nIncome tax expense at U.S. federal statutory income tax rate\n$\n2,771\n \n$\n2,084\n \n$\n2,260\n \nState and local tax expense (benefit)\n323\n \n348\n \n388\n \nNon-U.S. income taxed at other than the U.S. federal statutory tax rate\n130\n \n203\n \n32\n \nU.S. tax impact on Non-U.S. income and activities\n(\n49\n)\n(\n62\n)\n5\n \nChange in valuation allowances\n46\n \n(\n1,061\n)\n(\n392\n)\nChange in tax laws\n9\n \n25\n \n78\n \nGeneral business credits and manufacturing incentives\n(\n906\n)\n(\n966\n)\n(\n829\n)\nSettlements of prior year tax matters\n—\n \n23\n \n—\n \nRealization of basis differences in affiliates\n(\n45\n)\n—\n \n209\n \nForeign currency remeasurement\n73\n \n(\n62\n)\n36\n \nOther adjustments\n204\n \n31\n \n102\n \nTotal income tax expense (benefit)\n$\n2,556\n \n$\n563\n \n$\n1,888\n \n92\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nDeferred Income Tax Assets and Liabilities  \nDeferred income tax assets and liabilities at December 31, 2024 and 2023 reflect the effect of temporary differences between amounts of assets, liabilities and equity for financial reporting purposes and the bases of such assets, liabilities and equity as measured based on tax laws, as well as tax loss and tax credit carryforwards. \nThe following table summarizes the components of temporary differences and carryforwards that give rise to deferred tax assets and liabilities:\nDecember 31, 2024\nDecember 31, 2023\nDeferred tax assets\nPostretirement benefits other than pensions\n$\n1,024\n \n$\n1,119\n \nPension and other employee benefit plans\n1,421\n \n1,522\n \nWarranties, dealer and customer allowances, claims and discounts\n4,215\n \n3,684\n \nU.S. capitalized research expenditures\n10,111\n \n9,879\n \nU.S. operating loss and tax credit carryforwards(a)\n6,582\n \n6,033\n \nNon-U.S. operating loss and tax credit carryforwards(b)\n5,239\n \n6,204\n \nMiscellaneous\n4,302\n \n5,121\n \nTotal deferred tax assets before valuation allowances\n32,894\n \n33,562\n \nLess: valuation allowances\n(\n6,529\n)\n(\n6,979\n)\nTotal deferred tax assets\n26,365\n \n26,583\n \nDeferred tax liabilities\nProperty, plant and equipment\n5,111\n \n4,233\n \nIntangible assets\n635\n \n699\n \nTotal deferred tax liabilities\n5,746\n \n4,932\n \nNet deferred tax assets\n$\n20,619\n \n$\n21,651\n \n__________\n(a)\nAt December 31, 2024, U.S. operating loss deferred tax assets were $\n411\n million, where $\n129\n million can be carried forward indefinitely and $\n282\n million will expire by 2042, if not utilized. At December 31, 2024, U.S. tax credit carryforwards were $\n6.2\n billion, where $\n462\n million can be carried forward indefinitely and $\n5.7\n billion will expire by 2044, if not utilized.\n(b)\nAt December 31, 2024, Non-U.S. operating loss deferred tax assets were $\n5.2\n billion, where $\n4.8\n billion can be carried forward indefinitely and $\n342\n million will expire by 2044, if not utilized. At December 31, 2024, Non-U.S. tax credit carryforwards were $\n68\n million, where $\n45\n million can be carried forward indefinitely and $\n23\n million will expire by 2043, if not utilized.\nValuation Allowances  \nAs a result of improving profitability in the Korean operating business evidenced by cumulative earnings in recent years and the completion of our near-and long-term business plans in the three months ended December 31, 2023 that forecasted continuing profitability, we determined that it was more likely than not that future earnings would be sufficient to realize the deferred tax assets in Korea. Accordingly, we released Korea's $\n870\n million valuation allowance during 2023 resulting in an income tax benefit. \nDuring the years ended December 31, 2024 and 2023, valuation allowances against deferred tax assets of $\n6.5\n billion and $\n7.0\n billion were comprised of cumulative losses, credits and other timing differences, primarily in Germany, Spain, the U.S. and Brazil.\n93\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nUncertain Tax Positions  \nThe following table summarizes activity of the total amounts of unrecognized tax benefits: \nYears Ended December 31,\n2024\n2023\n2022\nBalance at beginning of period\n$\n585\n \n$\n520\n \n$\n634\n \nAdditions to current year tax positions\n108\n \n45\n \n12\n \nAdditions to prior years' tax positions\n28\n \n72\n \n14\n \nReductions to prior years' tax positions\n(\n109\n)\n(\n15\n)\n(\n98\n)\nReductions in tax positions due to lapse of statutory limitations\n(\n7\n)\n(\n19\n)\n(\n20\n)\nSettlements\n(\n8\n)\n(\n18\n)\n(\n10\n)\nOther\n(\n11\n)\n—\n \n(\n12\n)\nBalance at end of period\n$\n586\n \n$\n585\n \n$\n520\n \nAt December 31, 2024 and 2023, there were $\n415\n million and $\n386\n million of unrecognized tax benefits that if recognized would favorably affect our effective tax rate in the future. In the years ended December 31, 2024, 2023 and 2022, income tax-related interest and penalties were insignificant. At December 31, 2024 and 2023, liabilities for income tax-related interest and penalties were insignificant.\nAt December 31, 2024, it is not possible to reasonably estimate the expected change to the total amount of unrecognized tax benefits in the next twelve months.\nOther Matters  \nIncome tax returns are filed in multiple jurisdictions and are subject to examination by taxing authorities throughout the world. We have open tax years from 2011 to 2024 with various significant tax jurisdictions. Tax authorities may have the ability to review and adjust net operating loss or tax credit carryforwards that were generated prior to these periods if utilized in an open tax year. These open years contain matters that could be subject to differing interpretations of applicable tax laws and regulations as they relate to the amount, character, timing or inclusion of revenue and expenses or the sustainability of income tax credits for a given audit cycle.\n \nNote 18. \nRestructuring and Other Initiatives \nWe have executed various restructuring and other initiatives and we may execute additional initiatives in the future, if necessary, to streamline manufacturing capacity and reduce other costs to improve the utilization of remaining facilities. To the extent these programs involve voluntary separations, a liability is generally recorded at the time offers to employees are accepted. To the extent these programs provide separation benefits in accordance with pre-existing agreements, a liability is recorded once the amount is probable and reasonably estimable. If employees are involuntarily terminated, a liability is generally recorded at the communication date. Related charges are recorded in Automotive and other cost of sales and Automotive and other selling, general and administrative expense.\nThe following table summarizes the reserves and charges related to restructuring and other initiatives, including postemployment benefit reserves and charges: \nYears Ended December 31,\n2024\n2023\n2022\nBalance at beginning of period\n$\n779\n \n$\n520\n \n$\n285\n \nAdditions, interest accretion and other\n1,790\n \n1,831\n \n522\n \nPayments\n(\n1,303\n)\n(\n1,597\n)\n(\n275\n)\nRevisions to estimates and effect of foreign currency\n(\n22\n)\n25\n \n(\n12\n)\nBalance at end of period\n$\n1,243\n \n$\n779\n \n$\n520\n \nIn the years ended December 31, 2024, 2023 and 2022, restructuring and other initiatives included strategic activities in GMNA related to Buick dealerships. We recorded charges of $\n964\n million in the year ended December 31, 2024, which are included in the table above, and incurred $\n530\n million in net cash outflows resulting from these dealer restructurings, in \n94\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\naddition to the charges of $\n569\n million and $\n511\n million and net cash outflows of $\n674\n million and $\n120\n million in the years ended December 31, 2023 and 2022. We expect remaining cash outflows related to these activities of $\n719\n million to be substantially completed by the end of 2025.\nIn April 2024, we announced restructuring actions in GMI related to the closure of manufacturing operations in Colombia and Ecuador. In the year ended December 31, 2024, we recorded $\n170\n million before noncontrolling interest primarily related to employee separations and supplier-related charges of $\n88\n million, which are included in the table above, and non-cash restructuring charges of $\n79\n million primarily related to accelerated depreciation and amortization, which are not reflected in the table above. As of December 31, 2024, we have incurred $\n48\n million of cash outflows resulting from these restructuring activities. We expect the remaining cash outflows related to these activities to be substantially completed by the end of 2025.\nIn the year ended December 31, 2024, we recorded restructuring charges of $\n200\n million, primarily in GMNA, related to employee separations. As of December 31, 2024, we have incurred $\n163\n million of cash outflows resulting from these restructuring actions. We expect the remaining cash outflows related to these activities to be substantially completed by the end of 2025.\nIn March 2023, we announced a VSP to accelerate attrition related to the cost reduction program announced in January 2023. We recorded charges in GMNA of $\n1.0\n billion in the year ended December 31, 2023, primarily related to employee separation charges of $\n905\n million, which are reflected in the table above, and non-cash pension curtailment and settlement charges of approximately $\n130\n million, not reflected in the table above. We incurred cash outflows of $\n58\n million and $\n820\n million in the years ended December 31, 2024 and 2023. This program is complete as of December 31, 2024.\nIn October 2023, Cruise voluntarily paused all of its driverless, supervised and manual AV operations in the U.S. while it examined its processes, systems and tools. In conjunction with these actions, Cruise recorded charges before noncontrolling interest of $\n529\n million in the year ended December 31, 2023, which included non-cash restructuring charges of $\n250\n million. In June 2024, Cruise indefinitely delayed the Cruise Origin and recognized primarily non-cash charges before noncontrolling interest of $\n631\n million. In December 2024, in conjunction with GM’s announcement of its decision to no longer fund Cruise’s robotaxi development work and its plans, subject to approval by the Cruise Board of Directors, to combine the Cruise and GM technical efforts to advance autonomous and assisted driving, Cruise recorded net charges before noncontrolling interest of $\n522\n million, which included net non-cash restructuring charges of $\n173\n million. The non-cash restructuring charges are not reflected in the table above. Cumulatively, we have incurred $\n287\n million of cash outflows resulting from these restructuring activities. We expect the remaining cash outflows related to these activities of approximately $\n389\n million to be completed by the end of 2025.\n \nNote 19.\n \nInterest Income and Other Non-Operating Income\nYears Ended December 31,\n2024\n2023\n2022\nNon-service pension and OPEB income (loss)\n$\n191\n \n$\n184\n \n$\n1,512\n \nInterest income\n967\n \n1,109\n \n460\n \nLicensing agreements income\n211\n \n172\n \n238\n \nRevaluation of investments\n(\n225\n)\n(\n77\n)\n(\n236\n)\nOther\n112\n \n149\n \n(\n542\n)\nTotal interest income and other non-operating income, net\n$\n1,257\n \n$\n1,537\n \n$\n1,432\n \nIn the year ended December 31, 2022, we shut down our Russia business and recorded a $\n657\n million charge, included in Other in the table above, to write off our net investment and release accumulated translation losses into earnings.\nNote 20. \nStockholders’ Equity and Noncontrolling Interests \nWe have \n2.0\n billion shares of preferred stock and \n5.0\n billion shares of common stock authorized for issuance. We had \nno\n shares of preferred stock issued and outstanding at December 31, 2024 and 2023. We had \n1.0\n billion and \n1.2\n billion shares of common stock issued and outstanding at December 31, 2024 and 2023. \n95\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nCommon Stock\n \nHolders of our common stock are entitled to dividends at the sole discretion of our Board of Directors. Our dividends declared per common share were $\n0.48\n, $\n0.36\n and $\n0.18\n and our total dividends paid on common stock were $\n530\n million, $\n477\n million and $\n257\n million for the years ended December 31, 2024, 2023 and 2022. Holders of common stock are entitled to \none\n vote per share on all matters submitted to our stockholders for a vote. The liquidation rights of holders of our common stock are secondary to the payment or provision for payment of all our debts and liabilities and to holders of our preferred stock, if any such shares are then outstanding. \nIn November 2023, our Board of Directors increased the capacity under our share repurchase program by $\n10.0\n billion to an aggregate of $\n11.4\n billion and we entered into the ASR Agreements to repurchase an aggregate amount of $\n10.0\n billion of our common stock under the authorized share repurchase program. In December 2023, we advanced the $\n10.0\n billion and received approximately \n215\n million shares of our common stock with a value of $\n6.8\n billion, which were immediately retired. In the year ended December 31, 2024, we received and retired approximately \n29\n million additional shares upon settlement of the transactions contemplated under the ASR Agreements. The final number of shares received was based on the average of the daily volume-weighted average prices of our common stock during the term of the ASR Agreements, less a discount pursuant to the terms and conditions of the ASR Agreements. Because of our ability to settle in shares, the $\n3.2\n billion prepaid forward contract was classified as a reduction to Additional paid-in capital within the consolidated statement of equity at December 31, 2023. Upon settlement, the amount over par was allocated on a pro-rata basis, between Additional paid-in capital and Retained earnings.\nIn June 2024, our Board of Directors approved a new share repurchase authorization to repurchase up to an additional $\n6.0\n billion of our outstanding common stock.\nIn the years ended December 31, 2024 and 2023, in addition to shares received under the ASR program, we purchased approximately \n140\n million and \n30\n million shares of our outstanding common stock for $\n7.1\n billion and $\n1.1\n billion. In the year ended December 31, 2022, we purchased approximately \n64\n million shares of our outstanding common stock for $\n2.5\n billion. Shares are immediately retired upon purchase and the amount of the purchase price over par is allocated on a pro-rata basis, subject to the availability of paid-in capital calculated on a per-share basis, between Additional paid-in capital and Retained earnings.\nCruise Preferred Shares\n \nIn March 2022, we acquired SoftBank Vision Fund (AIV M2) L.P.’s (SoftBank) Cruise Class A-1, Class F and Class G Preferred Shares for $\n2.1\n billion and made an additional $\n1.35\n billion investment in Cruise in place of SoftBank. In December 2024, we acquired Class F and Class G Preferred Shares from noncontrolling shareholders for an insignificant amount.\nCruise Common Shares\n  During the years ended December 31, 2024, 2023 and 2022, Cruise Holdings issued an insignificant amount, $\n0.4\n billion and $\n0.8\n billion of Class B Common Shares to net settle vested awards under Cruise's 2018 Employee Incentive Plan and issued an insignificant amount, $\n0.2\n billion and $\n0.5\n billion of Class B Common Shares, primarily to us, to fund the payment of statutory tax withholding obligations resulting from the settlement or exercise of vested awards. GM conducted quarterly tender offers and paid approximately $\n0.2\n billion, $\n0.3\n billion and $\n0.6\n billion in cash to purchase tendered Cruise Class B Common Shares during the years ended December 31, 2024, 2023 and 2022. The Class B Common Shares are classified as noncontrolling interests in our consolidated financial statements except for certain shares that are liability classified that have a recorded value of approximately $\n42\n million at December 31, 2023. Refer to Note 22 for additional information on Cruise stock incentive awards. In December 2024, we acquired Class E Common Shares from a noncontrolling shareholder for an insignificant amount.\nDuring the year ended December 31, 2024, the effect on the equity attributable to us for changes in our ownership interest in Cruise was a decrease in Additional paid-in capital of $\n0.9\n billion and during the years ended December 31, 2023 and 2022 was insignificant. For the year ended December 31, 2024, net income attributable to shareholders and transfers to the noncontrolling interest in Cruise and other subsidiaries were $\n7.0\n billion, which included a $\n1.0\n billion increase in equity attributable to us, mainly due to the redemption of Cruise preferred shares. For the year ended December 31, 2023, net income attributable to shareholders and transfers to the noncontrolling interest in Cruise and other subsidiaries were $\n10.3\n billion. For the year ended December 31, 2022, net income attributable to shareholders and transfers to the noncontrolling interest in Cruise and other subsidiaries were $\n9.2\n billion, which included a $\n0.7\n billion decrease in equity attributable to us, mainly due to the redemption of Cruise preferred shares.\n96\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nThe following table summarizes the significant components of Accumulated other comprehensi\nve loss:\nYears Ended December 31,\n2024\n2023\n2022\nForeign Currency Translation Adjustments\nBalance at beginning of period\n$\n(\n2,457\n)\n$\n(\n2,776\n)\n$\n(\n2,654\n)\nOther comprehensive income (loss) and noncontrolling interests, net of reclassification adjustment and tax(a)(b)(c)\n(\n1,173\n)\n319\n \n(\n123\n)\nBalance at end of period\n$\n(\n3,630\n)\n$\n(\n2,457\n)\n$\n(\n2,776\n)\nDefined Benefit Plans\nBalance at beginning of period\n$\n(\n7,665\n)\n$\n(\n4,851\n)\n$\n(\n6,528\n)\nOther comprehensive income (loss) and noncontrolling interests before reclassification adjustment(a)\n(\n207\n)\n(\n3,706\n)\n1,487\n \nTax benefit (expense)\n(\n91\n)\n838\n \n2\n \nOther comprehensive income (loss) and noncontrolling interests before reclassification adjustment, net of tax(a)\n(\n298\n)\n(\n2,868\n)\n1,488\n \nReclassification adjustment, net of tax(c)\n294\n \n54\n \n188\n \nOther comprehensive income (loss), net of tax\n(\n4\n)\n(\n2,814\n)\n1,677\n \nBalance at end of period(d)\n$\n(\n7,669\n)\n$\n(\n7,665\n)\n$\n(\n4,851\n)\n__________\n(a)    \nThe noncontrolling interests were insignificant in the years ended December 31, 2024, 2023 and 2022.\n(b)    The reclassification adjustment was insignificant in the years ended December 31, 2024, 2023 and 2022.\n(c)    The income tax effect was insignificant in the\n years ended December 31, 2024, 2023 and 2022.\n(d)    Primarily consists of unamortized actuarial loss on our defined benefit plans.\n97\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nNote 21. \nEarnings Per Share \nBasic and diluted earnings per share are computed by dividing Net income attributable to common stockholders by the weighted-average common shares outstanding in the period. Diluted earnings per share is computed by giving effect to all potentially dilutive securities that are outstanding using the treasury stock method for awards under stock incentive plans. \nYears Ended December 31,\n2024\n2023\n2022\nBasic earnings per share\nNet income (loss) attributable to stockholders\n$\n6,008\n \n$\n10,127\n \n$\n9,934\n \nAdjustments(a)\n1,181\n \n(\n106\n)\n(\n1,019\n)\nNet income (loss) attributable to common stockholders\n$\n7,189\n \n$\n10,022\n \n$\n8,915\n \nWeighted-average common shares outstanding\n1,115\n \n1,364\n \n1,445\n \nBasic earnings per common share\n$\n6.45\n \n$\n7.35\n \n$\n6.17\n \nDiluted earnings per share\nNet income (loss) attributable to common stockholders – diluted\n$\n7,189\n \n$\n10,022\n \n$\n8,915\n \nWeighted-average common shares outstanding – basic\n1,115\n \n1,364\n \n1,445\n \nDilutive effect of awards under stock incentive plans\n13\n \n6\n \n10\n \nWeighted-average common shares outstanding – diluted\n1,129\n \n1,369\n \n1,454\n \nDiluted earnings per common share\n$\n6.37\n \n$\n7.32\n \n$\n6.13\n \nPotentially dilutive securities(b)\n—\n \n23\n \n10\n \n__________\n(a)\nIncludes a $\n1.2\n billion and $(\n909\n) million return from (return to) the preferred shareholders related to the redemption of Cruise preferred shares from noncontrolling interest holders and an insignificant amount in participating securities income from a subsidiary for the years ended December 31, 2024 and 2022.\n(b)\nPotentially dilutive securities attributable to outstanding stock options and RSUs at December 31, 2023 and 2022, were excluded from the computation of diluted EPS because the securities would have had an antidilutive effect.\nNote 22. \nStock Incentive Plans \nGM Stock Incentive Awards\n \nWe grant to certain employees RSUs, PSUs and stock options (collectively, stock incentive awards) under our 2020 LTIP and prior to the 2020 LTIP, under our 2017 and 2014 LTIP. The 2020 LTIP was approved by stockholders in June 2020. Any new awards granted after the approval of the 2020 LTIP in June 2020 will be issued under the 2020 LTIP. To the extent any shares remain available for issuance under the 2017 LTIP and/or the 2014 LTIP, such shares will only be used to settle outstanding awards that were previously granted under such plans prior to June 2020. The awards under the plans are subject to forfeiture if the participant leaves the company for reasons other than those permitted under the plans such as retirement, death or disability. \nRSU awards granted either cliff vest or ratably vest generally over a \nthree-year\n service period, as defined in the terms of each award. PSU awards vest at the end of a \nthree-year\n performance period, based on performance criteria determined by the Executive Compensation Committee of the Board of Directors at the time of award. The number of shares earned, or units paid in cash, may equal, exceed or be less than the targeted number depending on whether the performance criteria are met, surpassed or not met. Our service-based stock options vest ratably over \nthree years\n. Stock options expire \n10\n years from the grant date. \n98\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nEquity-Classified Awards  \nShares (in millions)\nWeighted-Average Grant Date Fair Value\nWeighted-Average Remaining Contractual Term in Years\nUnits outstanding at January 1, 2024\n39.9\n \n$\n27.53\n \n0.9\nGranted\n10.0\n \n$\n41.76\n \nSettled\n(\n11.6\n)\n$\n22.65\n \nForfeited or expired\n(\n3.4\n)\n$\n45.26\n \nUnits outstanding at December 31, 2024(a)\n34.9\n \n$\n31.52\n \n3.0\n__________\n(a)     Includes the target amount of PSUs.\nThere were no stock options issued during the year ended December 31, 2024. Our weighted-average assumptions used to value our stock options are a dividend yield of \n1.90\n% and \n1.60\n%, expected volatility of \n34.0\n% and \n41.0\n%, a risk-free interest rate of \n3.70\n% and \n1.88\n%, and an expected option life of \n6.00\n years for options issued during the years ended December 31, 2023 and 2022. The expected volatility is based on the average of the implied volatility of publicly traded options for our common stock.\nTotal compensation expense related to the above awards was $\n332\n million, $\n340\n million and $\n419\n million in the years ended December 31, 2024, 2023 and 2022. \nAt December 31, 2024, the total unrecognized compensation expense for nonvested equity awards granted was $\n273\n million. This expense is expected to be recorded over a weighted-average period of \n1.6\n years. The total fair value of stock incentive awards vested was $\n257\n million, $\n425\n million and $\n307\n million in the years ended December 31, 2024, 2023 and 2022. \nLiability-Classified Awards  \nWe grant certain employees stock incentive awards that are payable in cash. The total compensation expense and cash paid to settle these awards was insignificant in the years ended December 31, 2024, 2023 and 2022.\nCruise Stock Incentive Awards\n  Cruise granted RSUs that will settle in common shares of Cruise Holdings in the years ended December 31, 2024, 2023 and 2022. Stock options were granted in common shares of Cruise Holdings in the year ended December 31, 2022. These awards were granted under Cruise's 2018 Employee Incentive Plan approved by Cruise Holdings' Board of Directors in August 2018. Shares awarded under the plan are subject to forfeiture if the participant leaves the company for reasons other than those permitted under the plan. In March 2022, Cruise modified its RSUs that settle in Cruise Class B Common Shares to remove the liquidity vesting condition such that all granted RSU awards vest solely upon satisfaction of a service condition. The service condition for the majority of these awards is satisfied over \nfour years\n. Upon modification, \n31\n million RSUs whose service condition was previously met became immediately vested, thereby resulting in the immediate recognition of compensation expense. Subsequent to the modification, holders of Cruise Class B Common Shares issued to settle vested awards could tender their shares generally at the fair value of Cruise’s common stock. The ability to tender the Class B Common Shares results in certain awards to be classified as liabilities and other awards to be presented in temporary equity. A final tender offer was completed in April 2024, after which substantially all remaining outstanding unvested Cruise RSUs were exchanged by participants for unvested cash payment rights. The remaining outstanding Cruise RSUs are insignificant and are now presented in permanent equity.\nTotal compensation expense related to Cruise Holdings' share-based awards was insignificant, $\n0.4\n billion and $\n1.6\n billion for the years ended December 31, 2024, 2023 and 2022. GM conducted quarterly tender offers for the years ended December 31, 2023 and 2022 and paid approximately $\n0.2\n billion, $\n0.3\n billion and $\n0.6\n billion in cash to settle tendered Cruise Class B Common Shares during the years ended December 31, 2024, 2023 and 2022.\n99\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nNote 23. \nSegment Reporting\nOur chief operating decision-maker, who is our Chair and Chief Executive Officer, analyzes the results of our business through the following reportable segments: GMNA, GMI, Cruise and GM Financial. Our chief operating decision-maker evaluates the operating results and performance of our automotive segments and Cruise through EBIT-adjusted, which is presented net of noncontrolling interests. Our chief operating decision-maker evaluates GM Financial through EBT-adjusted because interest income and interest expense are an integral part of its operational and financial performance. These financial metrics are used to view operating trends, perform analytical comparisons and benchmark performance between periods and among geographic regions and to monitor budget-to-actual variances on a monthly basis. To manage operations and make decisions regarding resource allocations, our chief operating decision-maker is regularly provided and reviews expense information at a consolidated, functional level for our global purchasing and supply chain, manufacturing and engineering functions. Warranty and quality metrics are also viewed on a consolidated basis. Currently, a focus is being placed on driving an efficient, consolidated fixed cost structure and managing overall global headcount. Vehicle-level profitability metrics are also reviewed during the planning stage and throughout a program's life cycle on a forecasted basis, and not on an actual basis. Each segment has a manager responsible for executing our strategic initiatives. \nSubstantially all of the trucks, crossovers, cars and automobile parts produced are marketed through retail dealers in North America and through distributors and dealers outside of North America, the substantial majority of which are independently owned. In addition to the products sold to dealers for consumer retail sales, trucks, crossovers and cars are also sold to fleet customers, including daily rental car companies, commercial fleet customers, leasing companies and governments. Fleet sales are completed through the dealer network and in some cases directly with fleet customers. Retail and fleet customers can obtain a wide range of after-sale vehicle services and products through the dealer network, such as maintenance, light repairs, collision repairs, vehicle accessories and extended service warranties.\nGMNA meets the demands of customers in North America and GMI primarily meets the demands of customers outside North America, with vehicles developed, manufactured and/or marketed under the Buick, Cadillac, Chevrolet and GMC brands. We also have equity ownership stakes in entities that meet the demands of customers in other countries, primarily China, with vehicles developed, manufactured and/or marketed under the Baojun, Buick, Cadillac, Chevrolet and Wuling brands. Cruise is our global segment responsible for the development of AV technology, and includes AV-related engineering and other costs. We provide automotive financing services through our GM Financial segment.\nOur automotive interest income and interest expense, legacy costs from the Opel/Vauxhall Business (primarily pension costs), corporate expenditures and certain revenues and expenses that are not part of a reportable segment are recorded centrally in Corporate. Corporate assets primarily consist of cash and cash equivalents, marketable debt securities and intersegment balances. All intersegment balances and transactions have been eliminated in consolidation. \n100\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nThe following tables summarize key financial information by segment: \nAt and For the Year Ended December 31, 2024\nGMNA\nGMI\nCorporate\nEliminations\nTotal Automotive\nCruise\nGM Financial\nEliminations/Reclassifications\nTotal\nNet sales and revenue\n$\n157,509\n \n$\n13,890\n \n$\n206\n \n$\n—\n \n$\n171,605\n \n$\n257\n \n$\n15,875\n \n$\n(\n296\n)\n$\n187,442\n \nSegment expenses and other items(a)\n(\n143,719\n)\n(\n17,849\n)\n(\n1,398\n)\n—\n \n(\n162,966\n)\n(\n3,065\n)\n(\n13,231\n)\n263\n \n(\n178,999\n)\nAdjustments(b)\n738\n \n4,262\n \n64\n \n—\n \n5,064\n \n1,107\n \n320\n \n—\n \n6,491\n \nEarnings (loss) before interest and taxes-adjusted\n$\n14,528\n \n$\n303\n \n$\n(\n1,129\n)\n$\n—\n \n$\n13,703\n \n$\n(\n1,701\n)\n$\n2,965\n \n$\n(\n33\n)\n$\n14,934\n \nAdjustments(b)\n(\n6,491\n)\nAutomotive interest income\n967\n \nAutomotive interest expense\n(\n846\n)\nNet income (loss) attributable to noncontrolling interests\n(\n45\n)\nIncome (loss) before income taxes\n8,519\n \nIncome tax benefit (expense)\n(\n2,556\n)\nNet income (loss)\n5,963\n \nNet loss (income) attributable to noncontrolling interests\n45\n \nNet income (loss) attributable to stockholders\n$\n6,008\n \nEquity in net assets of nonconsolidated affiliates\n$\n4,447\n \n$\n1,449\n \n$\n—\n \n$\n—\n \n$\n5,896\n \n$\n—\n \n$\n1,206\n \n$\n—\n \n$\n7,102\n \nGoodwill and intangibles\n$\n1,966\n \n$\n676\n \n$\n—\n \n$\n—\n \n$\n2,642\n \n$\n570\n \n$\n1,339\n \n$\n—\n \n$\n4,551\n \nTotal assets\n$\n165,905\n \n$\n21,769\n \n$\n38,817\n \n$\n(\n85,117\n)\n$\n141,374\n \n$\n2,948\n \n$\n139,156\n \n$\n(\n3,717\n)\n$\n279,761\n \nExpenditures for property\n$\n10,266\n \n$\n415\n \n$\n30\n \n$\n—\n \n$\n10,711\n \n$\n7\n \n$\n24\n \n$\n88\n \n$\n10,830\n \nDepreciation and amortization\n$\n5,963\n \n$\n506\n \n$\n80\n \n$\n—\n \n$\n6,548\n \n$\n25\n \n$\n4,883\n \n$\n—\n \n$\n11,456\n \nImpairment charges\n$\n—\n \n$\n—\n \n$\n—\n \n$\n—\n \n$\n—\n \n$\n933\n \n$\n—\n \n$\n—\n \n$\n934\n \nEquity income (loss)(c)\n$\n955\n \n$\n(\n4,400\n)\n$\n—\n \n$\n—\n \n$\n(\n3,445\n)\n$\n—\n \n$\n(\n256\n)\n$\n—\n \n$\n(\n3,701\n)\n__________\n(a)\nSegment expenses and other items for Automotive segments primarily include material and logistics; manufacturing; equity income; selling, general and administrative people-related costs; advertising; information technology; engineering; professional services; and policy, campaign, and warranty. GM Financial items consist primarily of GM Financial interest expense; leased vehicle depreciation; people-related costs; provision for loan losses and gains and losses on termination of leased vehicles. Cruise items primarily consist of people-related costs.\n(b)\nConsists of charges related to the Buick dealerships and restructuring actions in GMNA; charges related to manufacturing operations wind down in GMI; China restructuring actions in GMI, GMNA and GM Financial; headquarters relocation in Corporate; and charges related to Cruise restructuring and Cruise realignment.\n(c)\nEquity loss associated with our Automotive China JVs include impacts of the other-than-temporary impairment and our portion of restructuring charges. Equity earnings related to Ultium Cells Holdings LLC are presented in Automotive and other cost of sales as this entity is integral to the operations of our business by providing battery cells for our EVs. Refer to Note 8 for additional information.\n101\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nAt and For the Year Ended December 31, 2023\nGMNA\nGMI\nCorporate\nEliminations\nTotal Automotive\nCruise\nGM Financial\nEliminations/Reclassifications\nTotal\nNet sales and revenue\n$\n141,445\n \n$\n15,949\n \n$\n273\n \n$\n—\n \n$\n157,667\n \n$\n102\n \n$\n14,225\n \n$\n(\n151\n)\n$\n171,842\n \nSegment expenses and other items(a)\n(\n130,743\n)\n(\n14,522\n)\n(\n1,686\n)\n—\n \n(\n146,951\n)\n(\n3,275\n)\n(\n11,239\n)\n116\n \n(\n161,350\n)\nAdjustments(b)\n1,604\n \n(\n217\n)\n—\n \n—\n \n1,387\n \n478\n \n—\n \n—\n \n1,865\n \nEarnings (loss) before interest and taxes-adjusted\n$\n12,306\n \n$\n1,210\n \n$\n(\n1,413\n)\n$\n—\n \n$\n12,103\n \n$\n(\n2,695\n)\n$\n2,985\n \n$\n(\n35\n)\n$\n12,357\n \nAdjustments(b)\n(\n1,865\n)\nAutomotive interest income\n1,109\n \nAutomotive interest expense\n(\n911\n)\nNet income (loss) attributable to noncontrolling interests\n(\n287\n)\nIncome (loss) before income taxes\n10,403\n \nIncome tax benefit (expense)\n(\n563\n)\nNet income (loss)\n9,840\n \nNet loss (income) attributable to noncontrolling interests\n287\n \nNet income (loss) attributable to stockholders\n$\n10,127\n \nEquity in net assets of nonconsolidated affiliates\n$\n2,595\n \n$\n6,348\n \n$\n—\n \n$\n—\n \n$\n8,943\n \n$\n—\n \n$\n1,670\n \n$\n—\n \n$\n10,613\n \nGoodwill and intangibles\n$\n2,083\n \n$\n710\n \n$\n—\n \n$\n—\n \n$\n2,793\n \n$\n715\n \n$\n1,354\n \n$\n—\n \n$\n4,862\n \nTotal assets\n$\n155,908\n \n$\n26,225\n \n$\n41,271\n \n$\n(\n82,858\n)\n$\n140,546\n \n$\n4,555\n \n$\n130,780\n \n$\n(\n2,817\n)\n$\n273,064\n \nExpenditures for property\n$\n10,147\n \n$\n522\n \n$\n15\n \n$\n—\n \n$\n10,684\n \n$\n63\n \n$\n24\n \n$\n198\n \n$\n10,970\n \nDepreciation and amortization\n$\n6,146\n \n$\n589\n \n$\n21\n \n$\n—\n \n$\n6,755\n \n$\n38\n \n$\n4,944\n \n$\n—\n \n$\n11,737\n \nImpairment charges\n$\n—\n \n$\n—\n \n$\n—\n \n$\n—\n \n$\n—\n \n$\n209\n \n$\n—\n \n$\n—\n \n$\n209\n \nEquity income (loss)(c)\n$\n196\n \n$\n440\n \n$\n—\n \n$\n—\n \n$\n635\n \n$\n—\n \n$\n138\n \n$\n—\n \n$\n773\n \n__________\n(a)\nSegment expenses and other items for Automotive segments primarily include material and logistics; manufacturing; equity income; selling, general and administrative people-related costs; advertising; information technology; engineering; professional services; and policy, campaign, and warranty. GM Financial items consist primarily of GM Financial interest expense; leased vehicle depreciation; people-related costs; provision for loan losses and gains and losses on termination of leased vehicles. Cruise items primarily consist of people-related costs.\n(b)\nConsists of charges related to the VSP and strategic activities related to Buick dealerships in GMNA; the gain associated with India asset sales and the partial resolution of Korean subcontractor matters in GMI; and charges related to Cruise restructuring.\n(c)\nEquity earnings related to Ultium Cells Holdings LLC are presented in Automotive and other cost of sales as this entity is integral to the operations of our business by providing battery cells for our EVs. \nRefer to \nNote 8\n for additional information.\n102\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nAt and For the Year Ended December 31, 2022\nGMNA\nGMI\nCorporate\nEliminations\nTotal Automotive\nCruise\nGM Financial\nEliminations/Reclassifications\nTotal\nNet sales and revenue\n$\n128,378\n \n$\n15,420\n \n$\n177\n \n$\n—\n \n$\n143,974\n \n$\n102\n \n$\n12,766\n \n$\n(\n107\n)\n$\n156,735\n \nSegment expenses and other items(a)\n(\n115,801\n)\n(\n14,934\n)\n(\n2,023\n)\n—\n \n(\n132,756\n)\n(\n3,049\n)\n(\n8,690\n)\n109\n \n(\n144,386\n)\nAdjustments(b)\n411\n \n657\n \n—\n \n—\n \n1,068\n \n1,057\n \n—\n \n—\n \n2,125\n \nEarnings (loss) before interest and taxes-adjusted\n$\n12,988\n \n$\n1,143\n \n$\n(\n1,846\n)\n$\n—\n \n$\n12,286\n \n$\n(\n1,890\n)\n$\n4,076\n \n$\n2\n \n$\n14,474\n \nAdjustments(b)\n(\n2,125\n)\nAutomotive interest income\n460\n \nAutomotive interest expense\n(\n987\n)\nNet income (loss) attributable to noncontrolling interests\n(\n226\n)\nIncome (loss) before income taxes\n11,597\n \nIncome tax benefit (expense)\n(\n1,888\n)\nNet income (loss)\n9,708\n \nNet loss (income) attributable to noncontrolling interests\n226\n \nNet income (loss) attributable to stockholders\n$\n9,934\n \nEquity in net assets of nonconsolidated affiliates\n$\n1,820\n \n$\n6,691\n \n$\n—\n \n$\n—\n \n$\n8,511\n \n$\n—\n \n$\n1,665\n \n$\n—\n \n$\n10,176\n \nGoodwill and intangibles\n$\n2,134\n \n$\n740\n \n$\n4\n \n$\n—\n \n$\n2,877\n \n$\n727\n \n$\n1,341\n \n$\n—\n \n$\n4,945\n \nTotal assets\n$\n157,250\n \n$\n24,808\n \n$\n60,518\n \n$\n(\n104,157\n)\n$\n138,419\n \n$\n5,510\n \n$\n121,544\n \n$\n(\n1,436\n)\n$\n264,037\n \nExpenditures for property\n$\n8,280\n \n$\n706\n \n$\n20\n \n$\n—\n \n$\n9,007\n \n$\n197\n \n$\n44\n \n$\n(\n10\n)\n$\n9,238\n \nDepreciation and amortization\n$\n5,800\n \n$\n513\n \n$\n21\n \n$\n—\n \n$\n6,335\n \n$\n53\n \n$\n4,888\n \n$\n—\n \n$\n11,276\n \nImpairment charges\n$\n11\n \n$\n1\n \n$\n—\n \n$\n—\n \n$\n12\n \n$\n—\n \n$\n—\n \n$\n—\n \n$\n12\n \nEquity income (loss)\n$\n(\n9\n)\n$\n672\n \n$\n—\n \n$\n—\n \n$\n663\n \n$\n—\n \n$\n173\n \n$\n—\n \n$\n837\n \n__________\n(a)\nSegment expenses and other items for Automotive segments primarily include material and logistics; manufacturing; equity income; selling, general and administrative people-related costs; advertising; information technology; engineering; professional services; and policy, campaign, and warranty. GM Financial items consist primarily of GM Financial interest expense; leased vehicle depreciation; people-related costs; provision for loan losses and gains and losses on termination of leased vehicles. Cruise items primarily consist of people-related costs.\n(b)\nConsists of charges for strategic activities related to Buick dealerships and the resolution of substantially all royalty matters accrued with respect to past-year vehicle sales in GMNA; charges related to the shutdown of our Russia business in GMI; and charges related to the one-time modification of Cruise stock incentive awards.\nAutomotive revenue is attributed to geographic areas based on the country of sale. GM Financial revenue is attributed to the geographic area where the financing is originated. \nThe following table summarizes information concerning principal geographic areas:\nAt and For the Years Ended December 31,\n2024\n2023\n2022\nNet Sales and Revenue\nLong-Lived Assets\nNet Sales and Revenue\nLong-Lived Assets\nNet Sales and Revenue\nLong-Lived Assets\nAutomotive\nU.S.\n$\n140,536\n \n$\n35,986\n \n$\n127,472\n \n$\n34,142\n \n$\n116,798\n \n$\n30,201\n \nNon-U.S.\n31,070\n \n15,811\n \n30,186\n \n16,054\n \n27,177\n \n14,907\n \nGM Financial\nU.S.\n13,575\n \n28,129\n \n12,133\n \n27,397\n \n11,035\n \n29,411\n \nNon-U.S.\n2,261\n \n3,563\n \n2,051\n \n3,309\n \n1,725\n \n3,431\n \nTotal consolidated\n$\n187,442\n \n$\n83,490\n \n$\n171,842\n \n$\n80,903\n \n$\n156,735\n \n$\n77,950\n \nNo individual country other than the U.S. represented more than 10% of our total net sales and revenue or long-lived assets, other than Mexico, whose long-lived assets were approximately \n12\n%, \n12\n% and \n11\n% of our total long-lived assets at December 31, 2024, 2023 and 2022.\n103\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS – (Continued)\nNote 24. \nSupplemental Information for the Consolidated Statements of Cash Flows \nThe following table summarizes the sources (uses) of cash provided by Change in other operating assets and liabilities and Cash paid for income taxes and interest: \nChange in other operating assets and liabilities\nYears Ended December 31,\n2024\n2023\n2022\nAccounts receivable\n$\n(\n846\n)\n$\n1,183\n \n$\n(\n4,483\n)\nWholesale receivables funded by GM Financial, net\n(\n6,341\n)\n(\n2,982\n)\n(\n5,000\n)\nInventories\n666\n \n(\n757\n)\n(\n2,581\n)\nChange in other assets\n(\n2,022\n)\n(\n685\n)\n(\n248\n)\nAccounts payable\n1,284\n \n(\n398\n)\n6,144\n \nIncome taxes payable\n(\n288\n)\n(\n121\n)\n273\n \nAccrued and other liabilities\n6,018\n \n5,582\n \n2,918\n \nTotal\n$\n(\n1,529\n)\n$\n1,822\n \n$\n(\n2,977\n)\nCash paid for income taxes and interest\nCash paid for income taxes, net\n$\n1,475\n \n$\n1,726\n \n$\n1,191\n \nCash paid for interest (net of amounts capitalized) – Automotive\n$\n777\n \n$\n863\n \n$\n933\n \nCash paid for interest (net of amounts capitalized) – GM Financial\n5,406\n \n4,652\n \n2,673\n \nTotal cash paid for interest (net of amounts capitalized)\n$\n6,183\n \n$\n5,515\n \n$\n3,606\n \n104\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nItem 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.\n*  *  *  *  *  *  *\nItem 9A. Controls and Procedures \nDisclosure Controls and Procedures  \nWe maintain disclosure controls and procedures designed to provide reasonable assurance that information required to be disclosed in reports filed under the Exchange Act is recorded, processed, summarized and reported within the specified time periods and accumulated and communicated to our management, including our principal executive officer and principal financial officer, as appropriate, to allow timely decisions regarding required disclosures. \nOur management, with the participation of our CEO and CFO, evaluated the effectiveness of our disclosure controls and procedures (as defined in Rules 13a-15(e) or 15d-15(e) promulgated under the Exchange Act) as of December 31, 2024 as required by paragraph (b) of Rules 13a-15 or 15d-15. Based on this evaluation, our CEO and CFO concluded that our disclosure controls and procedures were effective as of December 31, 2024. \nManagement's Report on Internal Control over Financial Reporting  \nOur management is responsible for establishing and maintaining effective internal control over financial reporting as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act. This system is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of consolidated financial statements for external purposes in accordance with U.S. GAAP. Because of the inherent limitations of internal control over financial reporting, including the possibility of collusion or improper management override of controls, misstatements due to error or fraud may not be prevented or detected on a timely basis. \nOur management performed an assessment of the effectiveness of our internal control over financial reporting at December 31, 2024, utilizing the criteria discussed in the “Internal Control – Integrated Framework (2013)” issued by the Committee of Sponsoring Organizations of the Treadway Commission. The objective of this assessment was to determine whether our internal control over financial reporting was effective as of December 31, 2024. Based on management's assessment, we have concluded that our internal control over financial reporting was effective as of December 31, 2024. \nThe effectiveness of our internal control over financial reporting has been audited by \nErnst & Young LLP\n (PCAOB ID: \n42\n), an independent registered public accounting firm, as stated in its report included herein. \nChanges in Internal Control over Financial Reporting  \nThere have not been any changes in our internal control over financial reporting during the three months ended December 31, 2024 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. \n*  *  *  *  *  *  *\n105\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nItem 9B.\n \nOther Information\nNone\n.\n*  *  *  *  *  *  *\n \nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\n*  *  *  *  *  *  *\nPART III\nItems 10, 11, 12, 13 and 14\nInformation required by Items 10, 11, 12, 13 and 14 of this Form 10-K is incorporated by reference from our definitive Proxy Statement for our 2025 Annual Meeting of Stockholders, which will be filed with the SEC, pursuant to Regulation 14A, not later than 120 days after the end of the 2024 fiscal year, all of which information is hereby incorporated by reference in, and made part of, this Form 10-K, except disclosure of our executive officers, which is included in Part I, Item 1 of this report.\n*  *  *  *  *  *  *\n106\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nPART IV\nItem 15. Exhibit and Financial Statement Schedules\n \n(a)\n1. All Financial Statements and Supplemental Information\n2. Financial Statement Schedules\nAll financial statement schedules are omitted as the required information is inapplicable or the information is presented in the consolidated financial statements and notes thereto in Item 8.    \n3. Exhibits\n(b)\nExhibits\nExhibit Number\nExhibit Name\n \n2.1\nMaster Agreement, dated as of March 5, 2017, between General Motors Holdings LLC and Peugeot S.A., incorporated by reference to Exhibit 2.1 to the Quarterly Report on Form 10-Q of General Motors Company filed April 28, 2017\nIncorporated by Reference\n3.1\nRestated Certificate of Incorporation of General Motors Company dated December 9, 2010, incorporated by reference to Exhibit 3.2 to the Current Report on Form 8-K of General Motors Company filed December 13, 2010\nIncorporated by Reference\n3.2\nGeneral Motors Company Amended and Restated Bylaws, as amended October 4, 2024, incorporated by reference to Exhibit 3.1 to the Current Report on Form 8-K of General Motors Company filed October 9, 2024\nIncorporated by Reference\n4.1\nDescription of Securities\nFiled Herewith\n4.2\nIndenture, dated as of September 27, 2013, between General Motors Company and the Bank of New York Mellon, as Trustee, incorporated by reference to Exhibit 4.2 to the Registration Statement on Form S-3 of General Motors Company filed April 30, 2014\nIncorporated by Reference\n4.3\nFirst Supplemental Indenture, dated as of September 27, 2013 to the Indenture dated as of September 27, 2013 between General Motors Company and the Bank of New York Mellon, as Trustee, incorporated by reference to Exhibit 4.3 to the Registration Statement on Form S-4 of General Motors Company filed May 22, 2014\nIncorporated by Reference\n4.4\nSecond Supplemental Indenture, dated as of November 12, 2014 to the Indenture dated as of September 27, 2013 between General Motors Company and the Bank of New York Mellon, as Trustee, incorporated by reference to Exhibit 4.4 to the Current Report on Form 8-K of General Motors Company filed November 12, 2014\nIncorporated by Reference\n4.5\nThird Supplemental Indenture, dated as of February 23, 2016, to the Indenture, dated as of September 27, 2013, between General Motors Company, as issuer, and The Bank of New York Mellon, as Trustee, incorporated by reference to Exhibit 4.1 to the Current Report on Form 8-K of General Motors Company filed February 23, 2016\nIncorporated by Reference\n4.6\nFourth Supplemental Indenture, dated as of August 7, 2017, to the Indenture, dated as of September 27, 2013, between General Motors Company, as issuer, and The Bank of New York Mellon, as Trustee, incorporated by reference to Exhibit 4.1 to the Current Report on Form 8-K of General Motors Company filed August 8, 2017\nIncorporated by Reference\n4.7\nFifth Supplemental Indenture, dated as of September 10, 2018, to the Indenture, dated as of September 27, 2013, between General Motors Company, as issuer, and The Bank of New York Mellon, as Trustee, incorporated by reference to Exhibit 4.2 to the Current Report on Form 8-K of General Motors Company filed September 10, 2018\nIncorporated by Reference\n4.8\nSixth Supplemental Indenture, dated as of May 12, 2020, to the Indenture. dated as of September 27, 2013, between General Motors Company, as issuer, and The Bank of New York Mellon, as Trustee, incorporated by reference to Exhibit 4.2 to the Current Report on Form 8-K of General Motors Company filed May 12, 2020\nIncorporated by Reference \n4.9\nSeventh Supplemental Indenture, dated as of August 2, 2022, to the Indenture. dated as of September 27, 2013, between General Motors Company, as issuer, and The Bank of New York Mellon, as Trustee, incorporated by reference to Exhibit 4.2 to the Current Report on Form 8-K of General Motors Company filed August 2, 2022\nIncorporated by Reference\n4.10\nCalculation Agency Agreement, dated as of September 10, 2018 between General Motors Company and the Bank of New York Mellon, as calculation agent, incorporated by reference to Exhibit 4.3 to the Current Report on Form 8-K of General Motors Company filed September 10, 2018\nIncorporated by Reference\n10.1*\nForm of Compensation Statement, incorporated by reference to Exhibit 10.14 to the Annual Report on Form 10-K of General Motors Company filed April 7, 2010\nIncorporated by Reference\n10.2*\nGeneral Motors Company Executive Retirement Plan, with modifications through October 10, 2012, incorporated by reference to Exhibit 10.12 to the Annual Report on Form 10-K of General Motors Company filed February 15, 2013\nIncorporated by Reference\n107\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nExhibit Number\nExhibit Name\n \n10.3*\nAmendment No. 1 to General Motors Company Executive Retirement Plan, with modifications through October 10, 2012, incorporated \nby reference to Exhibit 10.2 to the Current Report on Form 8-K of General Motors Company filed February 3, 2016\nIncorporated by Reference\n10.4*\nGeneral Motors Company Vehicle Operations - Senior Management Vehicle Program (SMVP) Supplement, revised December 15, 2005, incorporated by reference to Exhibit 10(g) to the Annual Report on Form 10-K of Motors Liquidation Company filed March 28, 2006\nIncorporated by Reference\n10.5*\nGeneral Motors Company 2014 Long-Term Incentive Plan, incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K of General Motors Company filed June 12, 2014\nIncorporated by Reference\n10.6*\nForm of Non-Qualified Stock Option Agreement under the 2014 Long-Term Incentive Plan, incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K of General Motors Company filed July 30, 2015\nIncorporated by Reference\n10.7*\nForm of Director and Officer Indemnification Agreement, incorporated \nby reference to Exhibit 10.6 to the Quarterly Report on Form 10-Q of General Motors Company filed April 21, 2016\nIncorporated by Reference\n10.8*\nGeneral Motors Company 2017 Short-Term Incentive Plan, incorporated by reference to Exhibit 10.25 to the Annual Report on Form 10-K of General Motors Company filed February 6, 2018\nIncorporated by Reference\n10.9*\nGeneral Motors Company 2017 Long-Term Incentive Plan, incorporated \nby reference to Exhibit 4.1 to the Registration Statement on Form S-8 of General Motors Company filed June 16, 2017\nIncorporated by Reference\n10.10*\nForm of Non-Qualified Stock Option Award Agreement No. 1 under the General Motors Company 2017 Long-Term Incentive Plan, incorporated by reference to Exhibit 10.2 to the Quarterly Report on Form 10-Q of General Motors Company filed April 26, 2018\nIncorporated by Reference\n10.11*\nForm of Non-Qualified Stock Option Award Agreement\n No.\n \n2\n under the General Motors Company 2017 Long-Term Incentive Plan, incorporated by reference to Exhibit 10.2 to the Quarterly Report on Form 10-Q of General Motors Company filed May 6, 2020\nIncorporated by Reference\n10.12*\nAmended and Restated General Motors LLC U.S. Executive Severance Program, incorporated by reference to Exhibit 10.23 to the Annual Report on Form 10-K of General Motors Company filed February 6, 2019\nIncorporated by Reference\n10.13*\nForm of Time Sharing Agreement, incorporated by reference to Exhibit 10.2 to the Quarterly Report on Form 10-Q of General Motors Company filed October 29, 2019\nIncorporated by Reference\n10.14*\nThe General Motors Company Deferred Compensation Plan for Non-Employee Directors, incorporated by reference to Exhibit 10.19 to the Annual Report on Form 10-K of General Motors Company filed February 5, 2020\nIncorporated by Reference \n10.15*\nGeneral Motors Company 2020 Long-Term Incentive Plan, incorporated by reference to Exhibit 4.1 to the Registration Statement on Form S-8 of General Motors Company filed June 25, 2020 \nIncorporated by Reference\n10.16*\nAmendment No. 1 to the General Motors Company 2020 Long-Term Incentive Plan, incorporated by reference to Appendix B of the Definitive Proxy Statement of General Motors Company filed April 28, 2023\nIncorporated by Reference\n10.17*\nForm of Performance Share Unit Award Agreement No.1 under the General Motors Company 2020 Long-Term Incentive Plan, incorporated by reference to Exhibit 10.1 to the Quarterly Report on Form 10-Q of General Motors Company filed May 5, 2021\nIncorporated by Reference\n10.18*\nForm of Performance Share Unit Award Agreement No.3 under the General Motors Company 2020 Long-Term Incentive Plan, incorporated by reference to Exhibit 10.1 to the Quarterly Report on Form 10-Q of General Motors Company, filed April 27, 2022\nIncorporated by Reference\n10.19*\nForm of Non-Qualified Stock Option Award Agreement\n \nNo. 1\n under the General Motors Company 2020 Long- Term Incentive Plan, incorporated by reference to Exhibit 10.2 to the Quarterly Report on Form 10-Q of General Motors Company filed May 5, 2021\nIncorporated by Reference\n10.20*\nForm of Non-Qualified Stock Option Award Agreement No.2 under the General Motors Company 2020 Long-Term Incentive Plan incorporated by reference to Exhibit 10.2 to the Quarterly Report on Form 10-Q of General Motors Company, filed April 27, 2022\nIncorporated by Reference\n10.21*\nForm of Restricted Stock Unit Award Agreement No. 2 under the General Motors Company 2020 Long-Term Incentive Plan, incorporated by reference to Exhibit 10.1 to the Quarterly Report on Form 10-Q of General Motors Company, filed October 24, 2023\nIncorporated by Reference\n10.22*\nForm of Restricted Stock Unit Award Agreement No. 3 under the General Motors Company 2020 Long-Term Incentive Plan, incorporated by reference to Exhibit 10.24 to the Annual Report on Form 10-K of General Motors Company, filed January 30, 2024\nIncorporated by Reference\n10.23*\nForm of Restricted Stock Unit Award Agreement No. 4 under the General Motors Company 2020 Long-Term Incentive Plan, incorporated by reference to Exhibit 10.1 to the Quarterly Report on Form 10-Q of General Motors Company, filed April 23, 2024\nIncorporated by Reference\n10.24*\nForm of Performance Stock Unit Award Agreement No. 4 under the General Motors Company 2020 Long-Term Incentive Plan, incorporated by reference to Exhibit 10.2 to the Quarterly Report on Form 10-Q of General Motors Company, filed April 23, 2024\nIncorporated by Reference\n108\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nExhibit Number\nExhibit Name\n \n10.25*\nSenior Advisor Consulting Agreement between General Motors LLC and Michael Abbott, incorporated by reference to Exhibit 10.1 to the Quarterly Report on Form 10-Q of General Motors Company, filed July 23, 2024\nIncorporated by Reference\n10.26*\nAmended Senior Advisor Consulting Agreement between General Motors LLC and Michael Abbott, incorporated by reference to Exhibit 10.1 to the Quarterly Report on Form 10-Q of General Motors Company, filed October 22, 2024\nIncorporated by Reference\n10.27†\nFourth Amended and Restated 5-Year Revolving Credit Agreement among General Motors Company, General Motors Financial Company, Inc., the subsidiary borrowers from time to time parties thereto, the several lenders from time to time parties thereto, JPMorgan Chase Bank, N.A., as administrative agent, and Citibank, N.A., as syndication agent, incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K of General Motors Company filed March 31, 2023\nIncorporated by Reference \n10.28†\nFifth Amended and Restated 3-Year Revolving Credit Agreement among General Motors Company, General Motors Financial Company, Inc., the subsidiary borrowers from time to time parties thereto, the several lenders from time to time parties thereto, JPMorgan Chase Bank, N.A., as administrative agent, and Citibank, N.A., as syndication agent, incorporated by reference to Exhibit 10.2 to the Current Report on Form 8-K of General Motors Company filed March 31, 2023\nIncorporated by Reference\n10.29†\nFifth Amended and Restated 364-Day Revolving Credit Agreement among General Motors Company, General Motors Financial Company, Inc., the subsidiary borrowers from time to time parties thereto, the several lenders from time to time parties thereto, JPMorgan Chase Bank, N.A., as administrative agent, and Citibank, N.A., as syndication agent, incorporated by reference to Exhibit 10.3 to the Current Report on Form 8-K of General Motors Company filed March 31, 2023\nIncorporated by Reference\n10.30†\nSixth Amended and Restated 364-Day Revolving Credit Agreement among General Motors Company, General Motors Financial Company, Inc., the subsidiary borrowers from time to time parties thereto, the several lenders from time to time parties thereto, JPMorgan Chase Bank, N.A., as administrative agent, Citibank, N.A., as syndication agent, and Bank of America, N.A., as co-syndication agent, incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K of General Motors Company filed March 28, 2024\nIncorporated by Reference\n10.31\nEighth \nAmended and Restated Limited Liability Company Agreement of GM Cruise Holdings LLC, dated \nMarch 1\n8\n, 20\n2\n2\n, incorporated by reference to Exhibit 10.\n2\n to the \nQuarterly\n Report on Form \n10\n-\nQ\n of General Motors Company filed \nJuly 26, 2022\nIncorporated by Reference\n10.32\nForm of Master Confirmation - Uncollared Accelerated Share Repurchase, dated November 29, 2023, incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K of General Motors Company filed November 29, 2023\nIncorporated by Reference\n19\nGeneral Motors Company Amended and Restated Insider Trading Policy, dated March 9, 2023, incorporated by reference to Exhibit 19 to the Annual Report on Form 10-K of General Motors Company, filed January 30, 2024\nIncorporated by Reference\n21\nSubsidiaries and Joint Ventures of the Registrant as of December 31, 2024\nFiled Herewith\n23\nConsent of Ernst & Young LLP\nFiled Herewith\n24\nPower of Attorney for Directors of General Motors Company\nFiled Herewith\n31.1\nSection 302 Certification of the Chief Executive Officer\nFiled Herewith\n31.2\nSection 302 Certification of the Chief Financial Officer\nFiled Herewith\n32\nCertification Pursuant to 18 U.S.C. Section 1350, As Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nFurnished with this Report\n97\nGeneral Motors Company Amended and Restated Policy on Recoupment of Incentive Compensation, dated August 14, 2023, incorporated by reference to Exhibit 97 to the Annual Report on Form 10-K of General Motors Company filed January 30, 2024 \nIncorporated by Reference\n101\nThe following financial information from the Company’s Annual Report on Form 10-K for the year ended December 31, 2024 formatted in Inline Extensible Business Reporting Language (iXBRL) includes: (i) the Consolidated Income Statements, (ii) the Consolidated Statements of Comprehensive Income, (iii) the Consolidated Balance Sheets, (iv) the Consolidated Statements of Cash Flows, (v) the Consolidated Statements of Equity and (vi) Notes to the Consolidated Financial Statements\nFiled Herewith\n104\nThe cover page from the Company's Annual Report on Form 10-K for the year ended December 31, 2024, formatted as Inline XBRL and contained in Exhibit 101\nFiled Herewith\n__________\n†\nPortions of this exhibit have been omitted pursuant to Rule 601(b)(10) of Regulation S-K. The omitted information is not material and would likely cause competitive harm to the registrant if publicly disclosed.\n*\nManagement contracts and compensatory plans and arrangements required to be filed as exhibits pursuant to Item 15(b) of this Report.\n*  *  *  *  *  *  *\n109\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nItem 16. Form 10-K Summary\nNone.\n*  *  *  *  *  *  *\n110\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nGENERAL MOTORS COMPANY (Registrant)\nBy:\n/s/  MARY T. BARRA\nMary T. Barra\nChair and Chief Executive Officer\nDate:\nJanuary 28, 2025\n111\nTable of Contents\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below on this 28th day of January 2025 by the following persons on behalf of the registrant and in the capacities indicated, including a majority of the directors.\nSignature\nTitle\n/s/  MARY T. BARRA\nChair and Chief Executive Officer\nMary T. Barra\n/s/  PAUL A. JACOBSON\nExecutive Vice President and Chief Financial Officer\nPaul A. Jacobson\n/s/  CHRISTOPHER T. HATTO\nVice President, Global Business Solutions and Chief\nChristopher T. Hatto\nAccounting Officer\n/s/  PATRICIA F. RUSSO*\nIndependent Lead Director\nPatricia F. Russo\n/s/  WESLEY G. BUSH*\nDirector\nWesley G. Bush\n/s/  JOANNE C. CREVOISERAT*\nDirector\nJoanne C. Crevoiserat\n/s/  LINDA R. GOODEN*\nDirector\nLinda R. Gooden\n/s/  JOSEPH JIMENEZ*\nDirector\nJoseph Jimenez\n/s/  ALFRED F. KELLY JR.*\nDirector\nAlfred F. Kelly Jr.\n/s/  JONATHAN MCNEILL*\nDirector\nJonathan McNeill\n/s/  JUDITH A. MISCIK*\nDirector\nJudith A. Miscik\n/s/  THOMAS M. SCHOEWE*\nDirector\nThomas M. Schoewe\n/s/  MARK A. TATUM*\nDirector\nMark A. Tatum\n/s/  JAN E. TIGHE*\nDirector\nJan E. Tighe\n/s/  DEVIN N. WENIG*\nDirector\nDevin N. Wenig\n*By:\n/s/ GRANT DIXTON\n \nGrant Dixton\nAttorney-in-Fact\n112"
  }
}