{
  "ticker": "GNRC",
  "cik": "0001474735",
  "company_name": "GENERAC HOLDINGS INC.",
  "filing_date": "2025-02-19",
  "accession": "0001437749-25-004353",
  "primary_doc": "gnrc20241231_10k.htm",
  "item_sections": {
    "item1": "Item 1 – Business,” the consolidated financial statements, and the related notes thereto in Item 8 of this Annual Report on Form 10-K. This discussion contains forward-looking statements, based on our expectations at the time of filing this Annual Report on Form 10-K and related to future events and our future financial performance, that involve risks and uncertainties. Our actual results may differ materially from those anticipated in these forward-looking statements as a result of many factors, including those set forth under “",
    "item1a": "Item 1A. - Risk Factors.” of this Annual Report on Form 10-K. \n\n\n \n\n\nOverview \n\n\n \n\n\nGenerac is a total energy solutions company that empowers people to use energy on their own terms. Founded in 1959, Generac is a leading global designer, manufacturer, and provider of a wide range of energy technology solutions. The Company provides power generation equipment, energy storage systems, energy management devices & solutions, and other power products serving the residential, light commercial, and industrial markets. The Company continues to expand its energy technology offerings for homes and businesses in its mission to Power a Smarter World and lead the evolution to more resilient, efficient, and sustainable energy solutions.\n\n\n \n\n\nFurther information regarding our business is provided in “Part I, Item 1. Business” of this Annual Report on Form 10-K.\n\n\n \n\n\nBusiness D\nrivers\n and Operational Factors\n\n\n \n\n\n“Part I, Item 1. Business” of this Annual Report on Form 10-K contains information regarding business drivers, including key mega-trends and strategic growth themes under the subheading “Mega-Trends, Strategic Growth Themes, and Additional Business Drivers.”\n\n\n \n\n\n \nF\nactors\n Affecting Results of O\nperations\n\n\n \n\n\nWe are subject to various factors that can affect our results of operations, which we attempt to mitigate through factors we can control, including continued product development, expanded distribution, pricing, cost control, and hedging. Certain operational and other factors that affect our business include the following:\n\n\n \n\n\nEffect of commodity, currency, component price fluctuations, and resource availability.\n    Industry-wide price fluctuations of key commodities, such as steel, copper and aluminum, along with other components we use in our products, as well as changes in labor costs required to produce our products, can have a material impact on our results of operations. Acquisitions in recent years have increased our use of advanced electronic components and battery cells, as well as further expanded our commercial and operational presence outside of the United States. Our international acquisitions, along with our existing global supply chain, expose us to fluctuations in foreign currency exchange rates and regulatory tariffs that can also have a material impact on our results of operations. \n\n\n \n\n\nWe have historically attempted to mitigate the impact of any inflationary pressures through improved product design and sourcing, manufacturing efficiencies, price increases, and select hedging transactions. Our results are also influenced by changes in fuel prices in the form of freight rates, which in some cases are accepted by our customers and in other cases are paid by us.\n\n\n \n\n\nSeasonality.\n    Although there is demand for our products throughout the year, in each of the past five years, approximately 19% to 25% of our net sales occurred in the first quarter, 22% to 28% in the second quarter, 24% to 28% in the third quarter and 23% to 31% in the fourth quarter, with different seasonality depending primarily on the occurrence, timing and severity of major power outage activity in each year. Major outage activity is unpredictable by nature and, as a result, our sales levels and profitability may fluctuate from period to period. The seasonality experienced during a major power outage, and for the subsequent quarters following the event, will vary relative to other periods where no major outage events occurred. \n\n\n \n\n\nAcquisitions.\n   Over the years, we have executed a number of acquisitions that support our strategic plan. A summary of the recent acquisitions can be found in Note 1, “Description of Business\" to the consolidated financial statements included in Item 8 of this Annual Report on Form 10-K. \n\n\n \n\n\n\n\n\n\n\n\n\n       23\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n     \n  \n\n\nFactors Influencing Interest Expense\n\n\n \n\n\nInterest expense can be impacted by a variety of factors, including market fluctuations in SOFR, interest rate election periods, interest rate swap agreements, repayments or borrowings of indebtedness, and amendments to our credit agreements. In connection with our credit agreement amendment in June 2022, SOFR became the new benchmark interest rate for the new Tranche A Term Loan Facility and the Revolving Facility, and all LIBOR provisions in the existing Tranche B Term Loan Facility were replaced with SOFR provisions. Refer to Note 12, “Credit Agreements,” to the consolidated financial statements included in Item 8 of this Annual Report on Form 10-K for further information. The decrease in interest expense in the current year was primarily driven by lower borrowings and lower SOFR interest rates during the year. \n\n\n \n\n\nFactors Influencing Provision for Income Taxes and Cash Income Taxes Paid \n\n\n \n\n\nThe effective income tax rates for the years ended December 31, 2024 and 2023 were 22.6% and 25.2%, respectively. The decrease in our 2024 effective tax rate was primarily due to unfavorable discrete tax items in the prior year that did not repeat in the current year, as well as favorable earnings mix with higher earnings in lower tax jurisdictions in the current year. \n\n\n \n\n\nOn August 16, 2022, the U.S. government enacted the Inflation Reduction Act (the Act). The Act in part provides funding and tax incentives for certain clean energy products and projects. While the Act did not have a material impact on the financial results of the current period, we will continue to review the Act and any regulations or guidance issued by the U.S. Treasury Department or by a state which may provide a tax benefit or expense. We will also monitor any changes to the Act under the new policy environment.\n\n\n \n\n\nIn 2021, the Organization for Economic Cooperation and Development (OECD) released Pillar Two Global Anti-Base Erosion model rules, designed to ensure large corporations are taxed at a minimum rate of 15% in all countries of operation. The OECD continues to release guidance and countries are implementing legislation to adopt the rules, some of which became effective on January 1, 2024. The United States has not yet enacted legislation implementing Pillar Two. We are continuing to evaluate the Pillar Two rules and their potential impact on future periods. There was no impact to the financial results of the year ended December 31, 2024, and we do not expect the rules to have a material impact on our effective tax rate for the following year. We will update our future tax provisions based on new regulations or guidance accordingly. \n\n\n \n\n\nComponents of Net Sales and Expenses\n\n\n \n\n\nNet Sales\n\n\n \n\n\nOur net sales primarily consist of the sale of products to our customers. This includes sales of our power generation equipment, energy storage systems, and other power products to the residential, commercial and industrial markets, as well as service parts to our dealer network. Net sales also include shipping and handling charges billed to customers, with the related freight costs included in cost of goods sold. Additionally, we offer other services, including extended warranties, installation, maintenance, data center and telecom facility design and build, remote monitoring, and grid services to utilities in certain circumstances. These services accounted for less than 4% of our net sales for the year ended December 31, 2024. Refer to Note 2, “Summary of Accounting Policies - Revenue Recognition,” to the consolidated financial statements in Item 8 of this Annual Report on Form 10-K for further information on our revenue streams and related revenue recognition accounting policies.\n\n\n \n\n\nWe are not dependent on any one channel or customer for our net sales, with no single customer representing more than 5% of our net sales, and our top ten customers representing less than 16% of our net sales in aggregate for the year ended December 31, 2024.\n\n\n \n\n\nCosts of Goods Sold\n\n\n \n\n\nThe principal elements of costs of goods sold are component parts, raw materials, inbound and outbound freight, factory overhead and labor. The principal component parts are engines, alternators, batteries, electronic controls, and steel enclosures. We design and manufacture air-cooled engines for certain of our generators up to 26kW, along with certain liquid-cooled, natural gas engines. We source engines for certain of our smaller products and all of our diesel products. For certain natural gas engines, we source the base engine block, and then add a significant amount of value engineering, sub-systems and other content to the point that we are recognized as the original equipment manufacturer (OEM) of those engines. We design and manufacture many of the alternators for our generators. We also manufacture other generator components where we believe we have a design and cost advantage. We source component parts from an extensive global network of reliable, high-quality suppliers. In some cases, these relationships are proprietary. For certain energy technology products, we source these products complete from certain contract manufacturers using our designs.\n\n\n \n\n\nThe principal sourced raw materials used in the manufacturing process are steel, copper and aluminum. We are susceptible to fluctuations in the cost of these commodities, impacting our costs of goods sold. We seek to mitigate the impact of commodity price changes on our business through a continued focus on global sourcing, product design improvements, manufacturing efficiencies, price increases and select hedging transactions. We are also impacted by foreign currency fluctuations given our global supply chain. There is typically a lag between raw material price fluctuations and their effect on our costs of goods sold.\n\n\n \n\n\nOur results are also influenced by changes in fuel prices in the form of freight rates, which in some cases are accepted by our customers and in other cases are paid by us.\n\n\n \n\n\nThe balance of cost of goods sold include our manufacturing and warehousing facilities, factory overhead, labor and shipping costs. Factory overhead includes utilities, insurance, support personnel, depreciation, general supplies, and maintenance. Although we attempt to maintain a flexible manufacturing cost structure, our margins can be impacted if we cannot timely adjust labor and manufacturing costs to match fluctuations in net sales.\n\n\n\n     \n  \n\n\n \n\n\n\n\n\n\n\n\n\n       24\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nOperating E\nxpenses\n\n\n \n\n\nOur operating expenses consist of costs incurred to support our sales, marketing, distribution, service parts, warranty, engineering, information systems, human resources, accounting, finance, risk management, legal and tax functions, among others. These expenses include, among others, personnel costs such as salaries, bonuses, employee benefit costs, payroll taxes, and share-based compensation cost, and are classified into three categories: selling and service, research and development, and general and administrative. Additionally, the amortization expense related to our finite-lived intangible assets is included within operating expenses.\n\n\n \n\n\nSelling and service.\n    Our selling and service expenses consist primarily of personnel costs, marketing expense, standard assurance warranty expense, bad debt provisions, and other sales expenses. Our personnel costs recorded in selling and services expenses include the expense of our sales force, customer support teams, outbound shipping and distribution functions, and other personnel involved in the marketing, sales and service of our products. Standard warranty expense is estimated based on historical trends or based on specific warranty matters as they become known and reasonably estimable. Our marketing expenses include media advertising, promotional expenses, co-op advertising costs, direct mail costs, printed material costs, product display costs, market research expenses, and trade show expenses. Marketing expenses are generally related to the launch of new product offerings, opportunities to create market awareness for our products, and general brand awareness marketing efforts. Our marketing campaigns are an important source for lead generation.\n\n\n \n\n\nResearch and \ndevelopment.\n    Our research and development expenses include mechanical engineering, electronics engineering, and software development costs and support numerous projects covering all of our product lines. They also support our connectivity, grid services, remote monitoring, and energy management initiatives. We operate engineering facilities with extensive capabilities at many locations around the world with a focus on new product development, existing product improvement and cost containment. We are committed to innovation, research and development and rely on a combination of patents and trademarks to establish and protect our proprietary rights. Our research and development costs are expensed as incurred.\n\n\n \n\n\nGeneral and administrative.\n    Our general and administrative expenses include personnel costs for accounting, information technology, human resources, legal, general and administrative employees; legal and professional services fees; information technology costs; insurance; travel and entertainment expense; adjustments to contingent acquisition consideration; share-based compensation costs; and other corporate expenses.\n\n\n \n\n\nAmortization of intangibles.\n    Our amortization of intangibles expense includes the straight-line amortization of finite-lived tradenames, customer lists, patents and technology, and other intangibles assets.\n\n\n \n\n\nOther \n(Expense) Income\n\n\n \n\n\nOther (expense) income includes the interest expense on our outstanding borrowings, amortization of deferred financing costs and original issue discount, credit facility commitment fees, and interest accretion on contingent acquisition consideration. Other (expense) income also includes other financial items such as losses on extinguishment of debt, investment income earned on our cash and cash equivalents, gains/losses on the sale of certain investments, and changes in the fair value of our investment in Wallbox N.V. warrants and equity securities. \n\n\n \n\n\nResults of O\nperations\n\n\n \n\n\nA detailed discussion of the year-over-year changes from the Company's fiscal 2022 results of operations to fiscal 2023 results of operations can be found in the Management's Discussion and Analysis section of the Company's fiscal 2023 Annual Report on Form 10-K filed February 21, 2024. \n\n\n \n\n\nYear ended December 31, 2024 compared to year ended December 31, 2023\n\n\n \n\n\nThe following table sets forth our consolidated statement of operations data for the periods indicated:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \nYear Ended December 31,\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n(U.S. Dollars in thousands)\n \n\n\n \n\n\n \n2024\n \n\n\n \n\n\n \n\n\n \n2023\n \n\n\n \n\n\n \n\n\n \n$ Change\n \n\n\n \n\n\n \n\n\n \n% Change\n \n\n\n \n\n\n\n\n\n\n \nNet sales\n \n\n\n \n\n\n$\n\n\n4,295,834\n\n\n \n\n\n \n\n\n$\n\n\n4,022,667\n\n\n \n\n\n \n\n\n$\n\n\n273,167\n\n\n \n\n\n \n\n\n \n\n\n6.8\n\n\n%\n\n\n\n\n\n\n \nCost of goods sold\n \n\n\n \n\n\n \n\n\n2,630,208\n\n\n \n\n\n \n\n\n \n\n\n2,657,236\n\n\n \n\n\n \n\n\n \n\n\n(27,028\n\n\n)\n\n\n \n\n\n \n\n\n-1.0\n\n\n%\n\n\n\n\n\n\n \nGross profit\n \n\n\n \n\n\n \n\n\n1,665,626\n\n\n \n\n\n \n\n\n \n\n\n1,365,431\n\n\n \n\n\n \n\n\n \n\n\n300,195\n\n\n \n\n\n \n\n\n \n\n\n22.0\n\n\n%\n\n\n\n\n\n\n \nOperating expenses:\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nSelling and service\n \n\n\n \n\n\n \n\n\n526,446\n\n\n \n\n\n \n\n\n \n\n\n448,199\n\n\n \n\n\n \n\n\n \n\n\n78,247\n\n\n \n\n\n \n\n\n \n\n\n17.5\n\n\n%\n\n\n\n\n\n\n \nResearch and development\n \n\n\n \n\n\n \n\n\n219,600\n\n\n \n\n\n \n\n\n \n\n\n173,443\n\n\n \n\n\n \n\n\n \n\n\n46,157\n\n\n \n\n\n \n\n\n \n\n\n26.6\n\n\n%\n\n\n\n\n\n\n \nGeneral and administrative\n \n\n\n \n\n\n \n\n\n285,095\n\n\n \n\n\n \n\n\n \n\n\n253,396\n\n\n \n\n\n \n\n\n \n\n\n31,699\n\n\n \n\n\n \n\n\n \n\n\n12.5\n\n\n%\n\n\n\n\n\n\n \nAmortization of intangible assets\n \n\n\n \n\n\n \n\n\n97,743\n\n\n \n\n\n \n\n\n \n\n\n104,194\n\n\n \n\n\n \n\n\n \n\n\n(6,451\n\n\n)\n\n\n \n\n\n \n\n\n-6.2\n\n\n%\n\n\n\n\n\n\n \nTotal operating expenses\n \n\n\n \n\n\n \n\n\n1,128,884\n\n\n \n\n\n \n\n\n \n\n\n979,232\n\n\n \n\n\n \n\n\n \n\n\n149,652\n\n\n \n\n\n \n\n\n \n\n\n15.3\n\n\n%\n\n\n\n\n\n\n \nIncome from operations\n \n\n\n \n\n\n \n\n\n536,742\n\n\n \n\n\n \n\n\n \n\n\n386,199\n\n\n \n\n\n \n\n\n \n\n\n150,543\n\n\n \n\n\n \n\n\n \n\n\n39.0\n\n\n%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nTotal other expense, net\n \n\n\n \n\n\n \n\n\n(127,304\n\n\n)\n\n\n \n\n\n \n\n\n(95,899\n\n\n)\n\n\n \n\n\n \n\n\n(31,405\n\n\n)\n\n\n \n\n\n \n\n\n-32.7\n\n\n%\n\n\n\n\n\n\n \nIncome before provision for income taxes\n \n\n\n \n\n\n \n\n\n409,438\n\n\n \n\n\n \n\n\n \n\n\n290,300\n\n\n \n\n\n \n\n\n \n\n\n119,138\n\n\n \n\n\n \n\n\n \n\n\n41.0\n\n\n%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nProvision for income taxes\n \n\n\n \n\n\n \n\n\n92,460\n\n\n \n\n\n \n\n\n \n\n\n73,180\n\n\n \n\n\n \n\n\n \n\n\n19,280\n\n\n \n\n\n \n\n\n \n\n\n26.3\n\n\n%\n\n\n\n\n\n\n \nNet income\n \n\n\n \n\n\n \n\n\n316,978\n\n\n \n\n\n \n\n\n \n\n\n217,120\n\n\n \n\n\n \n\n\n \n\n\n99,858\n\n\n \n\n\n \n\n\n \n\n\n46.0\n\n\n%\n\n\n\n\n\n\n \nNet income attributable to noncontrolling interests\n \n\n\n \n\n\n \n\n\n663\n\n\n \n\n\n \n\n\n \n\n\n2,514\n\n\n \n\n\n \n\n\n \n\n\n(1,851\n\n\n)\n\n\n \n\n\n \n\n\n-73.6\n\n\n%\n\n\n\n\n\n\n \nNet income attributable to Generac Holdings Inc.\n \n\n\n \n\n\n$\n\n\n316,315\n\n\n \n\n\n \n\n\n$\n\n\n214,606\n\n\n \n\n\n \n\n\n$\n\n\n101,709\n\n\n \n\n\n \n\n\n \n\n\n47.4\n\n\n%\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n       25\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nThe following sets forth our reportable segment information for the periods indicated:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \nNet Sales by Reportable Segment\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \nYear Ended December 31,\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n(U.S. Dollars in thousands)\n \n\n\n \n\n\n \n2024\n \n\n\n \n\n\n \n\n\n \n2023\n \n\n\n \n\n\n \n\n\n \n$ Change\n \n\n\n \n\n\n \n\n\n \n% Change\n \n\n\n \n\n\n\n\n\n\n \nDomestic\n \n\n\n \n\n\n$\n\n\n3,599,149\n\n\n \n\n\n \n\n\n$\n\n\n3,276,324\n\n\n \n\n\n \n\n\n$\n\n\n322,825\n\n\n \n\n\n \n\n\n \n\n\n9.9\n\n\n%\n\n\n\n\n\n\n \nInternational\n \n\n\n \n\n\n \n\n\n696,685\n\n\n \n\n\n \n\n\n \n\n\n746,343\n\n\n \n\n\n \n\n\n \n\n\n(49,658\n\n\n)\n\n\n \n\n\n \n\n\n-6.7\n\n\n%\n\n\n\n\n\n\n \nTotal net sales\n \n\n\n \n\n\n$\n\n\n4,295,834\n\n\n \n\n\n \n\n\n$\n\n\n4,022,667\n\n\n \n\n\n \n\n\n$\n\n\n273,167\n\n\n \n\n\n \n\n\n \n\n\n6.8\n\n\n%\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \nTotal Sales by Reportable Segment\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \nYear Ended December 31, 2024\n \n\n\n \n\n\n \n\n\n \nYear Ended December 31, 2023\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \nExternal Net Sales\n \n\n\n \n\n\n \n\n\n \nIntersegment Sales\n \n\n\n \n\n\n \n\n\n \nTotal Sales\n \n\n\n \n\n\n \n\n\n \nExternal Net Sales\n \n\n\n \n\n\n \n\n\n \nIntersegment Sales\n \n\n\n \n\n\n \n\n\n \nTotal Sales\n \n\n\n \n\n\n\n\n\n\n \nDomestic\n \n\n\n \n\n\n$\n\n\n3,599,149\n\n\n \n\n\n \n\n\n$\n\n\n35,932\n\n\n \n\n\n \n\n\n$\n\n\n3,635,081\n\n\n \n\n\n \n\n\n$\n\n\n3,276,324\n\n\n \n\n\n \n\n\n$\n\n\n43,937\n\n\n \n\n\n \n\n\n$\n\n\n3,320,261\n\n\n \n\n\n\n\n\n\n \nInternational\n \n\n\n \n\n\n \n\n\n696,685\n\n\n \n\n\n \n\n\n \n\n\n28,700\n\n\n \n\n\n \n\n\n \n\n\n725,385\n\n\n \n\n\n \n\n\n \n\n\n746,343\n\n\n \n\n\n \n\n\n \n\n\n91,552\n\n\n \n\n\n \n\n\n \n\n\n837,895\n\n\n \n\n\n\n\n\n\n \nIntercompany elimination\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n(64,632\n\n\n)\n\n\n \n\n\n \n\n\n(64,632\n\n\n)\n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n(135,489\n\n\n)\n\n\n \n\n\n \n\n\n(135,489\n\n\n)\n\n\n\n\n\n\n \nTotal net sales\n \n\n\n \n\n\n$\n\n\n4,295,834\n\n\n \n\n\n \n\n\n$\n\n\n-\n\n\n \n\n\n \n\n\n$\n\n\n4,295,834\n\n\n \n\n\n \n\n\n$\n\n\n4,022,667\n\n\n \n\n\n \n\n\n$\n\n\n-\n\n\n \n\n\n \n\n\n$\n\n\n4,022,667\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \nAdjusted EBITDA by Reportable Segment\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \nYear Ended December 31,\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n2024\n \n\n\n \n\n\n \n\n\n \n2023\n \n\n\n \n\n\n \n\n\n \n$ Change\n \n\n\n \n\n\n \n\n\n \n% Change\n \n\n\n \n\n\n\n\n\n\n \nDomestic\n \n\n\n \n\n\n$\n\n\n693,203\n\n\n \n\n\n \n\n\n$\n\n\n523,337\n\n\n \n\n\n \n\n\n$\n\n\n169,866\n\n\n \n\n\n \n\n\n \n\n\n32.5\n\n\n%\n\n\n\n\n\n\n \nInternational\n \n\n\n \n\n\n \n\n\n95,898\n\n\n \n\n\n \n\n\n \n\n\n114,522\n\n\n \n\n\n \n\n\n \n\n\n(18,624\n\n\n)\n\n\n \n\n\n \n\n\n-16.3\n\n\n%\n\n\n\n\n\n\n \nTotal Adjusted EBITDA\n \n\n\n \n\n\n$\n\n\n789,101\n\n\n \n\n\n \n\n\n$\n\n\n637,859\n\n\n \n\n\n \n\n\n$\n\n\n151,242\n\n\n \n\n\n \n\n\n \n\n\n23.7\n\n\n%\n\n\n\n\n\n\n\n\n \n\n\nThe following table sets forth our net sales by product class for the periods indicated:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n\n\nNet Sales by Product Class\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \nYear Ended December 31,\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n(U.S. Dollars in thousands)\n \n\n\n \n\n\n \n2024\n \n\n\n \n\n\n \n\n\n \n2023\n \n\n\n \n\n\n \n\n\n \n$ Change\n \n\n\n \n\n\n \n\n\n \n% Change\n \n\n\n \n\n\n\n\n\n\n \nResidential products\n \n\n\n \n\n\n$\n\n\n2,433,474\n\n\n \n\n\n \n\n\n$\n\n\n2,062,929\n\n\n \n\n\n \n\n\n$\n\n\n370,545\n\n\n \n\n\n \n\n\n \n\n\n18.0\n\n\n%\n\n\n\n\n\n\n \nCommercial & Industrial products\n \n\n\n \n\n\n \n\n\n1,389,469\n\n\n \n\n\n \n\n\n \n\n\n1,494,799\n\n\n \n\n\n \n\n\n \n\n\n(105,330\n\n\n)\n\n\n \n\n\n \n\n\n-7.0\n\n\n%\n\n\n\n\n\n\n \nOther\n \n\n\n \n\n\n \n\n\n472,891\n\n\n \n\n\n \n\n\n \n\n\n464,939\n\n\n \n\n\n \n\n\n \n\n\n7,952\n\n\n \n\n\n \n\n\n \n\n\n1.7\n\n\n%\n\n\n\n\n\n\n \nTotal net sales\n \n\n\n \n\n\n$\n\n\n4,295,834\n\n\n \n\n\n \n\n\n$\n\n\n4,022,667\n\n\n \n\n\n \n\n\n$\n\n\n273,167\n\n\n \n\n\n \n\n\n \n\n\n6.8\n\n\n%\n\n\n\n\n\n\n\n\n \n\n\nNet sales.    \nThe increase in domestic segment sales for the year ended December 31, 2024, was primarily driven by an increase in residential product sales, most notably in home standby and portable generators following the elevated power outage activity in the second half of the year. This was partially offset by a decline in C&I product sales for telecom, rental, and \"beyond standby\" applications. \n\n\n  \n\n\nThe decrease in international segment sales for the year ended December 31, 2024, was primarily driven by lower intersegment sales related to softness in the telecom market and a decline in portable generator and C&I product sales in Europe, partially offset by growth in Latin America. \n\n\n \n\n\n\n    In addition, total net sales from non-annualized acquisitions for the year ended December 31, 2024, were $16.5 million, mostly in the domestic segment. \n  \n\n\n\n     \n  \n\n\nGross profit.    \nGross profit margin for the year ended December 31, 2024, was 38.8% compared to 33.9% for the year ended December 31, 2023. The increase in gross profit margin was primarily driven by favorable sales mix, including higher home standby generator sales, the realization of lower input costs, and plant efficiencies.\n\n\n \n\n\nOperating expenses.    \nOperating expenses increased $149.7 million, or 15.3%, as compared to the prior year. The increase in operating expenses was primarily driven by higher employee and marketing costs, and increased incentive compensation and variable expenses related to higher shipment volumes and profitability. 2024 operating expenses also include $10.5 million of legal provisions and other costs related to patent and other litigation (see Note 18, “Commitments and Contingencies” to the consolidated financial statements in Item 8 of this Annual Report on Form 10-K for additional information). 2023 operating expenses included a $5.8 million provision for a regulatory matter with the CPSC, $28.3 million of legal charges related to patent and other litigation (see Note 18, “Commitments and Contingencies” for additional information), $4.4 million of additional customer support costs related to a clean energy product customer that filed for bankruptcy.\n\n\n \n\n\nOther expense.    \nThe increase in other expense, net in 2024 was driven primarily by a $38.0 million expense for the change in fair value of our investment in warrants and equity securities of Wallbox N.V., and a $4.9 million loss on extinguishment of debt. This was partially offset by a $3.3 million increase in investment income driven by higher cash on hand and a $7.9 million decrease in interest expense driven by decreased borrowings and interest rates compared to the prior year comparable period.\n\n\n \n\n\nProvision for income taxes.\n    The effective income tax rates for the years ended December 31, 2024 and 2023 were 22.6% and 25.2%, respectively. The decrease in the effective tax rate was primarily due to unfavorable discrete tax items in 2023 that did not repeat in the current year, as well as favorable 2024 earnings mix with higher earnings in lower tax jurisdictions.\n\n\n \n\n\nNet income attributable to Generac Holdings Inc.\n    Net income attributable to Generac Holdings Inc. was $316.3 million as compared to $214.6 million in the prior year period. The increase was primarily driven by higher sales and gross margin, as noted above. \n\n\n \n\n\nAdjusted EBITDA.    \nAdjusted EBITDA is defined and reconciled to net income in, “Non-GAAP Measures – Adjusted EBITDA” included below in Item 7 of this Annual Report on Form 10-K. Adjusted EBITDA margins for the domestic segment for the year ended December 31, 2024, were 19.1% of domestic segment total sales compared to 15.8% for the year ended December 31, 2023. This margin improvement was primarily driven by favorable sales mix and lower input costs, partially offset by higher operating expense investments to support future growth initiatives. \n\n\n \n\n\nAdjusted EBITDA margins for the international segment, before deducting for non-controlling interests, for the year ended December 31, 2024, were 13.2% of international segment total sales compared to 13.7% in the prior year. This margin decrease was primarily due to reduced operating leverage on lower shipments during the year. \n\n\n \n\n\nAdjusted net income.    \nAdjusted Net Income is defined and reconciled to net income in, “Non-GAAP Measures – Adjusted Net Income” included below in Item 7 of this Annual Report on Form 10-K. Adjusted Net Income was $438.5 million for the year ended December 31, 2024, compared to $335.3 million for the year ended December 31, 2023, with the increase primarily due to higher net income in the current year as outlined above, together with the impact of various add-backs in the current and prior years.\n\n\n \n\n\n\n\n\n\n\n\n\n       26\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nLiquidity and Financial Position\n\n\n \n\n\nOur primary cash requirements include payment for raw materials and components, salaries and benefits, facility and lease costs, operating expenses, interest and principal payments on debt, and capital expenditures. We finance our operations primarily from cash flow generated from operations and, if necessary, borrowings under our revolving credit facility.\n\n\n \n\n\nAs of December 31, 2024, there was $498.8 million outstanding under the Tranche B Term Loan Facility, $712.5 million outstanding under the Tranche A Term Loan Facility, and no borrowings on the Revolving Facility, leaving $1,249.2 million of unused capacity, net of outstanding letters of credit. The Tranche B Term Loan Facility bears interest at the adjusted SOFR rate plus an applicable margin of 1.75%, subject to a SOFR floor of 0.0%. As of December 31, 2024, the interest rate for the Tranche B Term Loan Facility is 6.34%. The Tranche A Term Loan Facility and the Revolving Facility bear interest at a rate based on adjusted SOFR plus an applicable margin between 1.25% and 1.75%, based on the Company's total leverage ratio and subject to a SOFR floor of 0.0%. As of December 31, 2024, the interest rates for the Tranche A Term Loan Facility and Revolving Facility are 6.15% and 6.19%, respectively. See Note 5, \"Derivative Instruments and Hedging Activities\" to the consolidated financial statements in Item 8 of this Annual Report on Form 10-K and Item 7A \"Quantitative and Qualitative Disclosures About Market Risk\" for further information on interest rate swaps, which help to reduce our borrowing costs.\n\n\n \n\n\nThe Tranche A Term Loan Facility and Revolving Facility mature on June 29, 2027. The Tranche A Term Loan Facility is repayable in installments maturing at the end of each quarter commencing September 2023, with a balloon payment due June 2027. The Tranche B Term Loan Facility matures on July 3, 2031, and is repayable in installments maturing at the end of each quarter commencing September 2024, with a balloon payment due July 2031.\n\n\n \n\n\nAs of December 31, 2024, we had total liquidity of $1,530.5 million, which consists of $281.3 million of cash and cash equivalents and $1,249.2 million available under our Revolving Facility. We believe we have a strong liquidity position that allows us to execute our strategic plan and provides flexibility to continue to invest in future growth opportunities.\n\n\n \n\n\nIn July 2022, our Board approved a stock repurchase program, which commenced on August 5, 2022, and allowed for the repurchase of up to $500.0 million of our common stock over a 24-month period. Additionally, on February 12, 2024, our Board approved a new stock repurchase program that allows for the repurchase of up to $500.0 million of our common stock over the next twenty-four months. The new program replaced the prior share repurchase program, which had approximately $26.3 million remaining available for repurchase when the new program was approved. Pursuant to the approved program, we may repurchase our common stock from time to time, in amounts and at prices we deem appropriate, subject to market conditions and other considerations. The repurchases may be executed using a combination of Rule 10b5-1 trading plans, open market purchases, privately negotiated agreements, or other transactions. The actual timing, number and value of shares repurchased under the program will be determined by management at its discretion and in compliance with the terms of our credit agreements. The repurchases may be funded with cash on hand, available borrowings, or proceeds from potential debt or other capital markets sources. The stock repurchase program may be suspended or discontinued at any time without prior notice. As of December 31, 2024, the remaining unused buyback authorization was $347,257. \n\n\n \n\n\nDuring the years ended December 31, 2024 and 2023, we repurchased 1,046,351 shares of our common stock for $152.7 million, and 2,188,475 shares for $251.5 million, respectively. We have periodically reissued shares out of Treasury stock, including for acquisition contingent consideration payments and some equity grants. \n\n\n \n\n\nWe have an arrangement with a finance company to provide floor plan financing for selected dealers. This arrangement provides liquidity for our dealers by financing dealer purchases of Generac products with credit availability from the finance company. We receive payment from the finance company after shipment of product to the dealer, and our dealers are given a longer period of time to pay the finance company. If our dealers do not pay the finance company, we may be required to repurchase the applicable inventory held by the dealer. We do not indemnify the finance company for any credit losses they may incur. Total dealer purchases financed under this arrangement accounted for approximately 13% and 12% of net sales for the years ended December 31, 2024 and 2023, respectively. The amount financed by dealers which remained outstanding was $165.4 million and $158.0 million as of December 31, 2024 and 2023, respectively.\n\n\n \n\n\nSee Note 12, “Credit Agreements,” and Note 13, “Stock Repurchase Program,” to the consolidated financial statements included in Item 8 of this Annual Report on Form 10-K for more information on our credit agreements and stock repurchase programs. See Note 10, “Leases,” to the consolidated financial statements included in Item 8 of this Annual Report on Form 10-K for the maturity schedule of our lease liabilities. \n\n\n \n\n\nLong-term Liquidity\n\n\n \n\n\nWe believe our cash and cash equivalents, cash flow from operations, and availability under our Revolving Facility and other short-term lines of credit will provide us with sufficient capital to continue to run our operations. We may use a portion of our cash flow for debt repayments and common stock buybacks, impacting the amount available for working capital, capital expenditures, acquisitions, and other general corporate purposes. As we continue to expand our business, we may require additional capital to fund other shareholder value enhancing activities.\n\n\n \n\n\n\n\n\n\n\n\n\n       27\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nCash F\nlow\n\n\n \n\n\nYear ended December 31, 2024 compared to year ended December 31, 2023\n\n\n \n\n\nThe following table summarizes our cash flows by source (use) for the periods presented:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \nYear Ended December 31,\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n(U.S. Dollars in thousands)\n \n\n\n \n\n\n \n2024\n \n\n\n \n\n\n \n\n\n \n2023\n \n\n\n \n\n\n \n\n\n \n$ Change\n \n\n\n \n\n\n \n\n\n \n% Change\n \n\n\n \n\n\n\n\n\n\n \nNet cash provided by operating activities\n \n\n\n \n\n\n$\n\n\n741,301\n\n\n \n\n\n \n\n\n$\n\n\n521,670\n\n\n \n\n\n \n\n\n$\n\n\n219,631\n\n\n \n\n\n \n\n\n \n\n\n42.1\n\n\n%\n\n\n\n\n\n\n \nNet cash used in investing activities\n \n\n\n \n\n\n \n\n\n(208,712\n\n\n)\n\n\n \n\n\n \n\n\n(178,063\n\n\n)\n\n\n \n\n\n \n\n\n(30,649\n\n\n)\n\n\n \n\n\n \n\n\n-17.2\n\n\n%\n\n\n\n\n\n\n \nNet cash used in financing activities\n \n\n\n \n\n\n \n\n\n(448,835\n\n\n)\n\n\n \n\n\n \n\n\n(277,137\n\n\n)\n\n\n \n\n\n \n\n\n(171,698\n\n\n)\n\n\n \n\n\n \n\n\n-62.0\n\n\n%\n\n\n\n\n\n\n \nEffect of foreign exchange rate changes on cash and cash equivalents\n \n\n\n \n\n\n \n\n\n(3,471\n\n\n)\n\n\n \n\n\n \n\n\n1,801\n\n\n \n\n\n \n\n\n \n\n\n(5,272\n\n\n)\n\n\n \n\n\n \n\n\n-292.7\n\n\n%\n\n\n\n\n\n\n \nNet increase in cash and cash equivalents\n \n\n\n \n\n\n$\n\n\n80,283\n\n\n \n\n\n \n\n\n$\n\n\n68,271\n\n\n \n\n\n \n\n\n$\n\n\n12,012\n\n\n \n\n\n \n\n\n \n\n\n17.6\n\n\n%\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n     The increase in net cash provided by operating activities was primarily driven by higher operating earnings coupled with a larger decrease in working capital in the current year period, as compared to the prior year. \n   \n\n\n\n\n \n\n\n\n\n\n     The $208.7 million net cash used in investing activities for the year ended\n    December 31, 2024 primarily represents cash payments of $136.7 million for the purchase of property and equipment (net of $11.1 million of capital expenditures in accounts payable as of December 31, 2024), $35.0 million for an incremental minority investment in Wallbox N.V., $2.8 million for a minority investment in Earth Foundry Fund, $1.6 million for a tax equity investment, and $34.7 million collectively for the acquisitions of Huntington, C&I BESS, Ageto, and Wolverine. These were partially offset by $2.0 million of cash proceeds from the sale of our minority interest in Rolling Energy Resources. \n   \n\n\n\n      \n   \n\n\n\n\n\n\n\n     The $178.1 million net cash used in investing activities for the year ended\n    December 31, 2023 primarily represents cash payments of $129.1 million for the purchase of property and equipment (net of $10.9 million of capital expenditures in accounts payable as of December 31, 2023), $30.0 million for a minority investment in Wallbox, $16.0 million for the acquisition of REFU, $6.6 million for a tax equity investment, and a $2.6 million minority investment in Rolling Energy Resources and Earth Foundry Fund. \n   \n\n\n\n      \n   \n\n\n\n     The $448.8 million net cash used in financing activities for the year ended \n    December 31, 2024 primarily represents $849.1 million of debt repayments ($54.5 million of short-term borrowings and $794.6 million of long-term borrowings and finance lease obligations), $152.7 million of stock repurchases, a $9.1 million payment for the remaining ownership interest in Captiva, $7.4 million of payments for deferred acquisition consideration, $24.8 million for taxes paid related to equity awards, and $3.6 million of payments for debt issuance costs related to our amended Tranche B Term Loan credit agreement refinancing. These uses of cash were partially offset by proceeds of $29.2 million from short-term borrowings, $541.5 million from long-term borrowings, and $27.6 million from the exercise of stock options. \n   \n\n\n\n      \n   \n\n\n\n\n\n\n\n     The $277.1 million net cash used in financing activities for the year ended\n    December 31, 2023 primarily consisted of $104.8 million in cash payments used to purchase the remaining ownership interest in Pramac, $251.5 million used for stock repurchases, $325.8 million of debt repayments ($37.1 million of short-term borrowings and $288.7 million of long-term borrowings and finance lease obligations), $10.9 million of taxes paid related to equity awards, and $5.0 million for payment of contingent acquisition consideration. These uses of cash were partially offset by proceeds of $348.8 million from long-term borrowings, $64.3 million from short-term borrowings, and $7.8 million proceeds from the exercise of employee stock options. \n   \n\n\n\n\n \n\n\nSenior Secured Credit Facilities\n\n\n \n\n\nRefer to Note 12, “Credit Agreements,” to the consolidated financial statements in Item 8 of this Annual Report on Form 10-K for information on our senior secured credit facilities.\n\n\n \n\n\nCovenant Compliance\n\n\n \n\n\nOur Term Loans restrict the aggregate amount of dividends and distributions that can be paid and, in certain circumstances, requires pro forma compliance with certain fixed charge coverage ratios or gross leverage ratios, as applicable, in order to pay certain dividends and distributions. Our Term Loans also contain other affirmative and negative covenants that, among other things, limit the incurrence of additional indebtedness, liens on property, sale and leaseback transactions, investments, loans and advances, mergers or consolidations, asset sales, acquisitions, transactions with affiliates, prepayments of certain other indebtedness, and modifications of our organizational documents. The Tranche A Term Loan Facility and the Revolving Facility contain certain financial covenants that require the Company to maintain a total leverage ratio below 3.75 to 1.00, an interest coverage ratio above 3.00 to 1.00, and may require an excess cash flow payment. As of December 31, 2024, the Company’s total leverage ratio was 1.33 to 1.00, and the Company's interest coverage ratio was 10.03 to 1.00. The Company was not required to make an excess cash flow payment as of December 31, 2024. The Company was also in compliance with all other covenants of the Amended Credit Agreement as of December 31, 2024.\n\n\n \n\n\nOur Term Loans contain customary events of default, including, among others, nonpayment of principal, interest or other amounts, failure to perform covenants, inaccuracy of representations or warranties in any material respect, cross-defaults with other material indebtedness, certain undischarged judgments, the occurrence of certain ERISA, bankruptcy or insolvency events, or the occurrence of a change in control (as defined in the Amended Credit Agreement). A bankruptcy or insolvency event of default will cause the obligations under the Term Loans to automatically become immediately due and payable.\n\n\n \n\n\nThe Revolving Facility also contains covenants and events of default substantially similar to those in the Term Loans, as described above. \n\n\n\n\n\n\n \n\n\nCapital Expenditures\n\n\n \n\n\nOur operations require capital expenditures for facilities and related improvements, technology, research & development, tooling, equipment, capacity expansion, internal use software, IT systems & infrastructure, and upgrades. Capital expenditures were $136.7 million, $129.1 million, and $86.2 million in the years ended December 31, 2024, 2023 and 2022, respectively, and were funded primarily through cash from operations. \n\n\n \n\n\n\n\n\n\n\n\n\n       28\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nCritical Accounting P\nolicies and Estimates\n\n\n \n\n\nIn preparing the financial statements, management is required to make estimates and assumptions that have an impact on the asset, liability, revenue and expense amounts reported. These estimates can also affect our supplemental information disclosures, including information about contingencies, risk and financial condition. We believe, given current facts and circumstances, that our estimates and assumptions are reasonable, adhere to U.S. GAAP, and are consistently applied. Inherent in the nature of an estimate or assumption is the fact that actual results may differ from estimates and estimates may vary as new facts and circumstances arise. We make routine estimates and judgments in determining net realizable value of accounts receivable, inventories, property and equipment, prepaid expenses, product warranties and other reserves. Management believes our most critical accounting estimates and assumptions are in the following areas: goodwill and other indefinite-lived intangible asset impairment assessment; and income taxes. The following is a discussion of critical accounting estimates in each of these areas. \n\n\n \n\n\nGoodwill and Other \nIndefinite-Lived \nI\nntangible\n A\nssets\n\n\n \n\n\nWhen preparing a discounted cash flow analysis for purposes of our annual impairment test, we make a number of key estimates and assumptions. We estimate the future cash flows of the business based on historical and forecasted revenues and operating costs. In addition, we apply a discount rate to the estimated future cash flows for the purpose of the valuation. This discount rate is based on the estimated weighted average cost of capital for the business and may change from year to year. Weighted average cost of capital includes certain assumptions such as market capital structures, market betas, risk-free rate of return and estimated costs of borrowing.\n\n\n \n\n\nFor all reporting units, a considerable amount of management judgment and assumptions are required in performing the goodwill and indefinite-lived intangible asset impairment tests. While we believe our judgments and assumptions are reasonable, different assumptions could change the estimated fair values. A number of factors, many of which we have no ability to control, could cause actual results to differ from the estimates and assumptions we employed. These factors include:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n●\n\n\na rising interest rate environment;\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \na prolonged global or regional economic downturn;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \na significant decrease in the demand for our products;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nthe inability to develop new and enhanced products and services in a timely manner;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \na significant adverse change in legal factors, the business climate, or regulatory environment;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nan adverse action or assessment by a regulator;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nsuccessful efforts by our competitors to gain market share in our markets;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \ndisruptions to the Company’s business;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \ninability to effectively integrate acquired businesses;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n●\n\n\nloss of key management and employees\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nunexpected or unplanned changes in the use of assets or entity structure; and\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nbusiness divestitures.\n \n\n\n\n\n\n\n\n\n \n\n\nIf management's estimates of future operating results change or if there are changes to other assumptions due to these factors, the estimate of the fair values may change significantly. Such change could result in impairment charges in future periods, which could have a significant impact on our operating results and financial condition. We performed the required annual impairment tests for goodwill and other indefinite-lived intangible assets for the fiscal years 2024, 2023 and 2022, and found no impairment.\n\n\n \n\n\nRefer to Note 2, “Summary of Accounting Policies – Goodwill and Other Indefinite-Lived Intangible Assets,” to the consolidated financial statements in Item 8 of this Annual Report on Form 10-K for further information on the Company’s policy regarding the accounting for goodwill and other indefinite-lived intangible assets.\n\n\n \n\n\nIncome T\naxes\n\n\n \n\n\nWe account for income taxes in accordance with Accounting Standards Codification (ASC) 740, \nIncome Taxes\n. Our estimates of income taxes payable, deferred income taxes and the effective tax rate are based on an analysis of many factors including interpretations of federal, state and international income tax laws; the difference between tax and financial reporting bases of assets and liabilities; estimates of amounts currently due or owed in various jurisdictions; and current accounting standards. We review and update our estimates on a quarterly basis as facts and circumstances change and actual results are known. In assessing the net realizable value of the deferred tax assets on our balance sheet, we consider whether it is more likely than not that some portion or all of the deferred tax assets will not be realized. The ultimate realization of deferred tax assets is dependent on the generation of future taxable income during the years in which those temporary differences become deductible. We consider the taxable income in prior carryback years, scheduled reversal of deferred tax liabilities, projected future taxable income and tax planning strategies in making this assessment.\n\n\n \n\n\nRefer to Note 15, “Income Taxes,” to the consolidated financial statements in Item 8 of this Annual Report on Form 10-K for further information on the Company’s income taxes and income tax positions.\n\n\n \n\n\nNew Accounting Standards\n\n\n \n\n\nFor information on new accounting pronouncements and the impact of these pronouncements on our consolidated financial statements, refer to Note 2, “Summary of Accounting Policies - New Accounting Pronouncements,” to the consolidated financial statements in Item 8 of this Annual Report on Form 10-K.\n\n\n \n\n\n\n\n\n\n\n\n\n       29\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nNon-GAAP Measures\n\n\n \n\n\nAdjusted EBITDA\n\n\n \n\n\nTo supplement our consolidated financial statements presented in accordance with U.S. GAAP, the Company provides the computation of Adjusted EBITDA attributable to the Company, which is defined as net income before noncontrolling interests adjusted for the following items: interest expense, depreciation expense, amortization of intangible assets, income tax expense, certain non-cash gains and losses including certain purchase accounting adjustments and contingent consideration adjustments, share-based compensation expense, certain transaction costs and credit facility fees, business optimization expenses, provision for certain legal and regulatory charges, certain other specific provisions, mark-to-market gains and losses on a minority investment, and Adjusted EBITDA attributable to noncontrolling interests. The provision for legal and regulatory charges adjusts for matters that are significant and not part of the ordinary routine litigation or regulatory matters incidental to the Company’s business, such as large suits and settlements, class action lawsuits, government inquiries, and certain intellectual property litigation. The adjustments to net income in computing Adjusted EBITDA are set forth in the reconciliation table below. The computation of Adjusted EBITDA is based primarily on the definition included in our Amended Credit Agreement.\n\n\n\n     \n  \n\n\nWe view Adjusted EBITDA as a key measure of our performance. We present Adjusted EBITDA not only due to its importance for purposes of our credit agreements, but also because it assists us in comparing our performance across reporting periods on a consistent basis as it excludes certain items that we do not believe are indicative of our core operating performance. Our management uses Adjusted EBITDA:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nfor planning purposes, including the preparation of our annual operating budget and developing and refining our internal projections for future periods;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nto allocate resources to enhance the financial performance of our business;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nas a target for the determination of the bonus component of compensation for our senior executives under our management incentive plan, as described further in our Proxy Statement;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nto evaluate the effectiveness of our business strategies and as a supplemental tool in evaluating our performance against our budget for each period; and\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nin communications with our Board and investors concerning our financial performance.\n \n\n\n\n\n\n\n\n\n \n\n\nWe believe Adjusted EBITDA is used by securities analysts, investors and other interested parties in the evaluation of the Company. Management believes the disclosure of Adjusted EBITDA offers an additional financial metric that, when coupled with results prepared in accordance with U.S. generally accepted accounting principles (U.S. GAAP) and the reconciliation to U.S. GAAP results, provides a more complete understanding of our results of operations and the factors and trends affecting our business. We believe Adjusted EBITDA is useful to investors for the following reasons:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nAdjusted EBITDA and similar non-GAAP measures are widely used by investors to measure a company's operating performance without regard to items that can vary substantially from company to company depending upon financing and accounting methods, book values of assets, tax jurisdictions, capital structures and the methods by which assets were acquired;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \ninvestors can use Adjusted EBITDA as a supplemental measure to evaluate the overall operating performance of our Company, including our ability to service our debt and other cash needs; and\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nby comparing our Adjusted EBITDA in different historical periods, our investors can evaluate our operating performance excluding the impact of items described below.\n \n\n\n\n\n\n\n\n\n \n\n\nThe adjustments included in the reconciliation table listed below are presented to illustrate the operating performance of our business in a manner consistent with the presentation used by our management and Board. These adjustments eliminate the impact of a number of items that:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nwe do not consider indicative of our ongoing operating performance, such as non-cash write-downs and other charges, non-cash gains, write-offs relating to the retirement of debt, severance costs and other restructuring-related business optimization expenses, provision for certain legal and regulatory charges, certain other specific provisions, and mark-to-market gains and losses on a minority investment;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nwe believe to be akin to, or associated with, interest expense, such as administrative agent fees, revolving credit facility commitment fees and letter of credit fees; or\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nare non-cash in nature, such as share-based compensation expense.\n \n\n\n\n\n\n\n\n\n \n\n\nWe explain in more detail in footnotes (a) through (g) below why we believe these adjustments are useful in calculating Adjusted EBITDA as a measure of our operating performance.\n\n\n \n\n\nAdjusted EBITDA does not represent, and should not be a substitute for, net income or cash flows from operations as determined in accordance with U.S. GAAP. Adjusted EBITDA has limitations as an analytical tool, and you should not consider it in isolation, or as a substitute for analysis of our results as reported under U.S. GAAP. Some of the limitations are:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nAdjusted EBITDA does not reflect our cash expenditures, or future requirements for capital expenditures or contractual commitments;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nAdjusted EBITDA does not reflect changes in, or cash requirements for, our working capital needs;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nAdjusted EBITDA does not reflect the significant interest expense, or the cash requirements necessary to service interest or principal payments on our debt;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nalthough depreciation and amortization are non-cash charges, the assets being depreciated and amortized will often have to be replaced in the future, and Adjusted EBITDA does not reflect any cash requirements for such replacements;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nseveral of the adjustments that we use in calculating Adjusted EBITDA, such as non-cash write-downs and other charges, while not involving cash expense, do have a negative impact on the value of our assets as reflected in our consolidated balance sheet prepared in accordance with U.S. GAAP; and\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nother companies may calculate Adjusted EBITDA differently than we do, limiting its usefulness as a comparative measure.\n \n\n\n\n\n\n\n\n\n \n\n\nFurthermore, as noted above, one of our uses of Adjusted EBITDA is as a target for determining elements of compensation for our senior executives. At the same time, some or all of these senior executives have responsibility for monitoring our financial results, generally including the adjustments in calculating Adjusted EBITDA (subject ultimately to review by our Board in the context of the Board's review of our financial statements). While many of the adjustments (for example, transaction costs and credit facility fees), involve mathematical application of items reflected in our financial statements, others involve a degree of judgment and discretion. While we believe all of these adjustments are appropriate, and while the calculations are subject to review by our Board in the context of the Board's review of our financial statements, and certification by our Chief Financial Officer in a compliance certificate provided to the lenders under our Amended Credit Agreement, this discretion may be viewed as an additional limitation on the use of Adjusted EBITDA as an analytical tool.\n\n\n \n\n\nBecause of these limitations, Adjusted EBITDA should not be considered as a measure of discretionary cash available to us to invest in the growth of our business. We compensate for these limitations by relying primarily on our U.S. GAAP results and using Adjusted EBITDA only supplementally.\n\n\n \n\n\n\n\n\n\n\n\n\n       30\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nThe following table presents a reconciliation of net income to Adjusted EBITDA attributable to Generac Holdings Inc.:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \nYear Ended December 31,\n \n\n\n \n\n\n\n\n\n\n \n(U.S. Dollars in thousands)\n \n\n\n \n\n\n \n2024\n \n\n\n \n\n\n \n\n\n \n2023\n \n\n\n \n\n\n \n\n\n \n2022\n \n\n\n \n\n\n\n\n\n\n \nNet income attributable to Generac Holdings Inc.\n \n\n\n \n\n\n$\n\n\n316,315\n\n\n \n\n\n \n\n\n$\n\n\n214,606\n\n\n \n\n\n \n\n\n$\n\n\n399,502\n\n\n \n\n\n\n\n\n\n \nNet income attributable to noncontrolling interests\n \n\n\n \n\n\n \n\n\n663\n\n\n \n\n\n \n\n\n \n\n\n2,514\n\n\n \n\n\n \n\n\n \n\n\n9,368\n\n\n \n\n\n\n\n\n\n \nNet income\n \n\n\n \n\n\n \n\n\n316,978\n\n\n \n\n\n \n\n\n \n\n\n217,120\n\n\n \n\n\n \n\n\n \n\n\n408,870\n\n\n \n\n\n\n\n\n\n \nInterest expense\n \n\n\n \n\n\n \n\n\n89,713\n\n\n \n\n\n \n\n\n \n\n\n97,627\n\n\n \n\n\n \n\n\n \n\n\n54,826\n\n\n \n\n\n\n\n\n\n \nDepreciation and amortization\n \n\n\n \n\n\n \n\n\n171,768\n\n\n \n\n\n \n\n\n \n\n\n166,602\n\n\n \n\n\n \n\n\n \n\n\n156,141\n\n\n \n\n\n\n\n\n\n \nProvision for income taxes\n \n\n\n \n\n\n \n\n\n92,460\n\n\n \n\n\n \n\n\n \n\n\n73,180\n\n\n \n\n\n \n\n\n \n\n\n99,596\n\n\n \n\n\n\n\n\n\n \nNon-cash write-down and other adjustments (a)\n \n\n\n \n\n\n \n\n\n4,757\n\n\n \n\n\n \n\n\n \n\n\n(5,953\n\n\n)\n\n\n \n\n\n \n\n\n(2,091\n\n\n)\n\n\n\n\n\n\n \nNon-cash share-based compensation expense (b)\n \n\n\n \n\n\n \n\n\n49,248\n\n\n \n\n\n \n\n\n \n\n\n35,492\n\n\n \n\n\n \n\n\n \n\n\n29,481\n\n\n \n\n\n\n\n\n\n \nTransaction costs and credit facility fees (c)\n \n\n\n \n\n\n \n\n\n5,097\n\n\n \n\n\n \n\n\n \n\n\n4,054\n\n\n \n\n\n \n\n\n \n\n\n5,026\n\n\n \n\n\n\n\n\n\n \nBusiness optimization and other charges (d)\n \n\n\n \n\n\n \n\n\n4,752\n\n\n \n\n\n \n\n\n \n\n\n10,551\n\n\n \n\n\n \n\n\n \n\n\n4,371\n\n\n \n\n\n\n\n\n\n \nProvision for legal, regulatory, and clean energy product charges (e)\n \n\n\n \n\n\n \n\n\n10,931\n\n\n \n\n\n \n\n\n \n\n\n38,490\n\n\n \n\n\n \n\n\n \n\n\n65,265\n\n\n \n\n\n\n\n\n\n \nChange in fair value of investment (f)\n \n\n\n \n\n\n \n\n\n38,006\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n\n\n\n\n \nLoss on extinguishment of debt (g)\n \n\n\n \n\n\n \n\n\n4,861\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n3,743\n\n\n \n\n\n\n\n\n\n \nOther\n \n\n\n \n\n\n \n\n\n530\n\n\n \n\n\n \n\n\n \n\n\n696\n\n\n \n\n\n \n\n\n \n\n\n139\n\n\n \n\n\n\n\n\n\n \nAdjusted EBITDA\n \n\n\n \n\n\n \n\n\n789,101\n\n\n \n\n\n \n\n\n \n\n\n637,859\n\n\n \n\n\n \n\n\n \n\n\n825,367\n\n\n \n\n\n\n\n\n\n \nAdjusted EBITDA attributable to noncontrolling interests\n \n\n\n \n\n\n \n\n\n1,175\n\n\n \n\n\n \n\n\n \n\n\n4,687\n\n\n \n\n\n \n\n\n \n\n\n15,087\n\n\n \n\n\n\n\n\n\n \nAdjusted EBITDA attributable to Generac Holdings Inc.\n \n\n\n \n\n\n$\n\n\n787,926\n\n\n \n\n\n \n\n\n$\n\n\n633,172\n\n\n \n\n\n \n\n\n$\n\n\n810,280\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n(a) Represents the following non-cash charges, gains, and other adjustments: (gains)/losses on the disposition of assets other than in the ordinary course of business, (gains)/losses on sales of certain investments, unrealized mark-to-market adjustments on commodity contracts, certain foreign currency related adjustments, and certain purchase accounting and contingent consideration adjustments. We believe that adjusting net income for these items is useful for the following reasons:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nThe gains/losses on disposition of assets other than in the ordinary course of business and sales of certain investments result from the sale of assets that are no longer useful in our business and therefore represent gains or losses that are not from our core operations;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nThe adjustments for unrealized mark-to-market gains and losses on commodity contracts represent non-cash items to reflect changes in the fair value of forward contracts that have not been settled or terminated. We believe it is useful to adjust net income for these items because the charges do not represent a cash outlay in the period in which the charge is incurred, although Adjusted EBITDA must always be used together with our U.S. GAAP statements of comprehensive income and cash flows to capture the full effect of these contracts on our operating performance;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nThe purchase accounting adjustments represent non-cash items to reflect fair value of certain assets at the date of acquisition, and therefore do not reflect our ongoing operations. Fair value adjustments to contingent consideration obligations related to business acquisitions are added back as they are akin to purchase price. \n \n\n\n\n\n\n\n\n\n \n\n\n(b) Represents share-based compensation expense to account for stock options, restricted stock, and other stock awards over their respective vesting period.\n\n\n \n\n\n(c) Represents transaction costs incurred directly in connection with any investment, as defined in our credit agreement, equity issuance or debt issuance or refinancing, together with certain fees relating to our senior secured credit facilities, such as administrative agent fees and credit facility commitment fees under our Amended Credit Agreement.\n\n\n \n\n\n(d) Represents severance and other restructuring charges related to the consolidation of certain operating facilities and organizational functions.\n\n\n \n\n\n(e) Represents the following litigation, regulatory, and other matters that are not indicative of our ongoing operations:\n\n\n   •  A provision for judgments, settlements, and legal expenses related to certain patent lawsuits - $9.2 million in 2024; $27.3 million in 2023. \n    •  Legal expenses related to certain class action lawsuits - $1.3 million in 2024; $1.0 million in 2023. \n    •  A bad debt provision and additional customer support costs related to a clean energy product customer that filed for bankruptcy in 2022 – $0.4 million additional customer support costs in 2024; $4.4 million additional customer support costs in 2023; $17.9 million bad debt provision in 2022. \n    •  A provision for a matter with the CPSC concerning the imposition of civil fines for allegedly failing to timely submit a report under the Consumer Product Safety Act (CPSA) in relation to certain portable generators that were subject to a voluntary recall previously announced on July 29, 2021 - $5.8 million in 2023; $10.0 million in 2022. \n\n\n   •  A warranty provision to address certain clean energy product warranty-related matters - $37.3 million in 2022.\n\n\n \n\n\n(f) Represents non-cash losses from changes in the fair value of the Company's investment in Wallbox N.V. warrants and equity securities.\n\n\n \n\n\n(g) Represents fees paid to creditors and the write-off of the unamortized original issue discount and deferred financing costs in connection with the 2024 and 2022 credit agreement refinancings. Refer to Note 12, “Credit Agreements,” to the consolidated financial statements in Item 8 of this Annual Report on Form 10-K for further information on the losses on extinguishment of debt.\n\n\n \n\n\n\n\n\n\n\n\n\n       31\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nAdjusted Net Income\n\n\n \n\n\nTo further supplement our consolidated financial statements in accordance with U.S. GAAP, we provide the computation of Adjusted Net Income attributable to the Company, which is defined as net income before noncontrolling interests adjusted for the following items: amortization of intangible assets, amortization of deferred financing costs and original issue discount related to the Company's debt, intangible impairment charges, certain transaction costs and other purchase accounting adjustments, business optimization expenses, provision for certain legal and regulatory charges, certain other specific provisions, mark-to-market gains and losses on a minority investment, other non-cash gains and losses, and adjusted net income attributable to non-controlling interests, as set forth in the reconciliation table below.\n\n\n \n\n\nWe believe Adjusted Net Income is used by securities analysts, investors and other interested parties in the evaluation of our company’s operations. Management believes the disclosure of Adjusted Net Income offers an additional financial metric that, when used in conjunction with U.S. GAAP results and the reconciliation to U.S. GAAP results, provides a more complete understanding of our ongoing results of operations, and the factors and trends affecting our business.\n\n\n \n\n\nThe adjustments included in the reconciliation table listed below are presented to illustrate the operating performance of our business in a manner consistent with the presentation used by investors and securities analysts. Similar to the Adjusted EBITDA reconciliation, these adjustments eliminate the impact of a number of items we do not consider indicative of our ongoing operating performance or cash flows, such as amortization costs, transaction costs and write-offs relating to the retirement of debt. \n\n\n \n\n\nSimilar to Adjusted EBITDA, Adjusted Net Income does not represent, and should not be a substitute for, net income or cash flows from operations as determined in accordance with U.S. GAAP. Adjusted Net Income has limitations as an analytical tool, and you should not consider it in isolation, or as a substitute for analysis of our results as reported under U.S. GAAP. Some of the limitations are:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nAdjusted Net Income does not reflect changes in, or cash requirements for, our working capital needs;\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nalthough amortization is a non-cash charge, the assets being amortized may have to be replaced in the future, and Adjusted Net Income does not reflect any cash requirements for such replacements; and\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n●\n \n\n\n \nother companies may calculate Adjusted Net Income differently than we do, limiting its usefulness as a comparative measure.\n \n\n\n\n\n\n\n\n\n \n\n\nThe following table presents a reconciliation of net income to Adjusted Net Income attributable to Generac Holdings Inc.:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \nYear Ended December 31,\n \n\n\n \n\n\n\n\n\n\n \n(U.S. Dollars in thousands)\n \n\n\n \n\n\n \n2024\n \n\n\n \n\n\n \n\n\n \n2023\n \n\n\n \n\n\n \n\n\n \n2022\n \n\n\n \n\n\n\n\n\n\n \nNet income attributable to Generac Holdings Inc.\n \n\n\n \n\n\n$\n\n\n316,315\n\n\n \n\n\n \n\n\n$\n\n\n214,606\n\n\n \n\n\n \n\n\n$\n\n\n399,502\n\n\n \n\n\n\n\n\n\n \nNet income attributable to noncontrolling interests\n \n\n\n \n\n\n \n\n\n663\n\n\n \n\n\n \n\n\n \n\n\n2,514\n\n\n \n\n\n \n\n\n \n\n\n9,368\n\n\n \n\n\n\n\n\n\n \nNet income\n \n\n\n \n\n\n \n\n\n316,978\n\n\n \n\n\n \n\n\n \n\n\n217,120\n\n\n \n\n\n \n\n\n \n\n\n408,870\n\n\n \n\n\n\n\n\n\n \nAmortization of intangible assets\n \n\n\n \n\n\n \n\n\n97,743\n\n\n \n\n\n \n\n\n \n\n\n104,194\n\n\n \n\n\n \n\n\n \n\n\n103,320\n\n\n \n\n\n\n\n\n\n \nAmortization of deferred financing costs and original issue discount\n \n\n\n \n\n\n \n\n\n3,242\n\n\n \n\n\n \n\n\n \n\n\n3,885\n\n\n \n\n\n \n\n\n \n\n\n3,234\n\n\n \n\n\n\n\n\n\n \nTransaction costs and other purchase accounting adjustments (a)\n \n\n\n \n\n\n \n\n\n2,717\n\n\n \n\n\n \n\n\n \n\n\n2,089\n\n\n \n\n\n \n\n\n \n\n\n3,588\n\n\n \n\n\n\n\n\n\n \nLoss/(gain) attributable to business or asset dispositions (b)\n \n\n\n \n\n\n \n\n\n65\n\n\n \n\n\n \n\n\n \n\n\n(119\n\n\n)\n\n\n \n\n\n \n\n\n(229\n\n\n)\n\n\n\n\n\n\n \nBusiness optimization and other charges (c)\n \n\n\n \n\n\n \n\n\n4,752\n\n\n \n\n\n \n\n\n \n\n\n10,551\n\n\n \n\n\n \n\n\n \n\n\n4,371\n\n\n \n\n\n\n\n\n\n \nProvision for legal, regulatory, and clean energy product charges (c)\n \n\n\n \n\n\n \n\n\n10,931\n\n\n \n\n\n \n\n\n \n\n\n38,490\n\n\n \n\n\n \n\n\n \n\n\n65,265\n\n\n \n\n\n\n\n\n\n \nChange in fair value of investment (c)\n \n\n\n \n\n\n \n\n\n38,006\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n\n\n\n\n \nLoss on extinguishment of debt (c)\n \n\n\n \n\n\n \n\n\n4,861\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n3,743\n\n\n \n\n\n\n\n\n\n \nTax effect of add backs\n \n\n\n \n\n\n \n\n\n(40,173\n\n\n)\n\n\n \n\n\n \n\n\n(38,384\n\n\n)\n\n\n \n\n\n \n\n\n(43,638\n\n\n)\n\n\n\n\n\n\n \nAdjusted net income\n \n\n\n \n\n\n \n\n\n439,122\n\n\n \n\n\n \n\n\n \n\n\n337,826\n\n\n \n\n\n \n\n\n \n\n\n548,524\n\n\n \n\n\n\n\n\n\n \nAdjusted net income attributable to noncontrolling interests\n \n\n\n \n\n\n \n\n\n663\n\n\n \n\n\n \n\n\n \n\n\n2,514\n\n\n \n\n\n \n\n\n \n\n\n9,675\n\n\n \n\n\n\n\n\n\n \nAdjusted net income attributable to Generac Holdings Inc.\n \n\n\n \n\n\n$\n\n\n438,459\n\n\n \n\n\n \n\n\n$\n\n\n335,312\n\n\n \n\n\n \n\n\n$\n\n\n538,849\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n(a) Represents transaction costs incurred directly in connection with any investment, as defined in our credit agreement, equity issuance or debt issuance or refinancing, and certain purchase accounting and contingent consideration adjustments.\n\n\n \n\n\n(b) Represents losses/(gains) attributable to the disposition of a business or assets occurring in other than ordinary course, as defined in our credit agreement.\n\n\n \n\n\n(c) See reconciliation of net income to Adjusted EBITDA attributable to Generac Holdings Inc. above. \n\n\n \n\n\n\n\n\n\n\n\n\n       32\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nItem 7A. Quantitative and Qualitative Disclosures About Market Risk\n\n\n \n\n\nWe are exposed to market risk from changes in foreign currency exchange rates, commodity prices and interest rates. To reduce the risk from these changes, we use financial instruments from time to time. We do not hold or issue financial instruments for trading purposes.\n\n\n \n\n\nForeign C\nurrency\n\n\n \n\n\nWe are exposed to foreign currency exchange risk as a result of transactions denominated in currencies other than the U.S. Dollar, as well as operating businesses and supply chains in foreign countries. Periodically, we utilize foreign currency forward purchase and sales contracts to manage the volatility associated with certain foreign currency purchases and sales in the normal course of business. Contracts typically have maturities of twelve months or less. Realized gains and losses on transactions denominated in foreign currency are recorded as a component of cost of goods sold in the statements of comprehensive income.\n\n\n \n\n\nThe following is a summary of the 41 foreign currency forward contracts outstanding as of December 31, 2024 (notional amounts in thousands of U.S. dollars). \n\n\n \n\n\n\n\n\n\n\n\n \nCurrency Denomination\n \n\n\n \n\n\n \nTrade Dates\n \n\n\n \n\n\n \nEffective Dates\n \n\n\n \n\n\n \nNotional Amount\n \n\n\n \n\n\n \nExpiration Dates\n \n\n\n\n\n\n\nUSD\n\n\n \n\n\n11/4/24\n\n\n \n\n\n11/4/24\n\n\n \n\n\n$6,000\n\n\n \n\n\n10/1/25 - 11/3/25\n\n\n\n\n\n\nAUD\n\n\n \n\n\n11/14/24 - 12/18/24\n\n\n \n\n\n11/14/24 - 12/18/24\n\n\n \n\n\n$13,250\n\n\n \n\n\n1/15/25 - 2/5/25\n\n\n\n\n\n\nGBP\n\n\n \n\n\n11/14/24\n\n\n \n\n\n11/14/24\n\n\n \n\n\n$1,750\n\n\n \n\n\n1/15/25\n\n\n\n\n\n\n\n\n \n\n\nCommodity P\nrices\n\n\n \n\n\nWe are a purchaser of commodities and components manufactured from commodities including steel, aluminum, copper and others. As a result, we are exposed to fluctuating market prices for those commodities. While such materials are typically available from numerous suppliers, commodity raw materials are subject to price fluctuations. We generally buy these commodities and components based on market prices that are established with the supplier as part of the purchase process. Depending on the supplier, these market prices may reset on a periodic basis based on negotiated lags and calculations. To the extent that commodity prices increase and we do not have firm pricing from our suppliers, or our suppliers are not able to honor such prices, we may experience a decline in our gross margins to the extent we are not able to increase selling prices of our products or obtain manufacturing efficiencies or supply chain savings to offset increases in commodity costs.\n\n\n \n\n\nPeriodically, we engage in certain commodity risk management activities to mitigate the impact of potential price fluctuations on our financial results. These derivatives typically have maturities of less than eighteen months. As of December 31, 2024, we had the following commodity forward contracts outstanding (notional amounts in thousands of U.S. dollars):\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n \nHedged Item\n \n\n\n \n\n\n \nContract Date\n \n\n\n \n\n\n \nEffective Date\n \n\n\n \n\n\n \nNotional Amount\n \n\n\n \n\n\n \nExpiration Date\n \n\n\n\n\n\n\nHigh Grade Copper\n\n\n \n\n\nJuly 22, 2024\n\n\n \n\n\nAugust 1, 2024\n\n\n \n\n\n$947\n\n\n \n\n\nJanuary 31, 2025\n\n\n\n\n\n\nHigh Grade Copper\n\n\n \n\n\nJuly 30, 2024\n\n\n \n\n\nAugust 1, 2024\n\n\n \n\n\n$923\n\n\n \n\n\nJanuary 31, 2025\n\n\n\n\n\n\n\n\n \n\n\nInterest R\nates\n\n\n \n\n\nAs of December 31, 2024, all of the outstanding debt under our Term Loans and Revolving Facility was subject to floating interest rate risk. As of December 31, 2024, we had the following interest rate swap contracts outstanding to help minimize our borrowing costs (notional amount in thousands of U.S. dollars):\n\n\n \n\n\n\n\n\n\n\n\n \nHedged Item\n \n\n\n \n\n\n \nContract Date\n \n\n\n \n\n\n \nEffective Date\n \n\n\n \n\n\n \nNotional Amount\n \n\n\n \n\n\n \nFixed SOFR Rate\n \n\n\n \n\n\n \nExpiration Date\n \n\n\n\n\n\n\nSOFR Interest Rate\n\n\n \n\n\nMarch 4, 2020\n\n\n \n\n\nMay 31, 2023\n\n\n \n\n\n$200,000\n\n\n \n\n\n1.1360%\n\n\n \n\n\nDecember 14, 2026\n\n\n\n\n\n\nSOFR Interest Rate\n\n\n \n\n\nMarch 5, 2020\n\n\n \n\n\nMay 31, 2023\n\n\n \n\n\n$100,000\n\n\n \n\n\n1.0700%\n\n\n \n\n\nDecember 14, 2026\n\n\n\n\n\n\nSOFR Interest Rate\n\n\n \n\n\nMarch 6, 2020\n\n\n \n\n\nMay 31, 2023\n\n\n \n\n\n$200,000\n\n\n \n\n\n0.9560%\n\n\n \n\n\nDecember 14, 2026\n\n\n\n\n\n\n\n\n \n\n\nIn June 2022, in conjunction with the amendments to the Company's credit agreements discussed further in Note 12, “Credit Agreements,” to our consolidated financial statements in Item 8 of this Annual Report on Form 10-K, the Company amended its interest rate swaps to match that of the underlying debt and reconfirmed hedge effectiveness. The Company formally documented all relationships between interest rate hedging instruments and the related hedged items, as well as its risk-management objectives and strategies for undertaking various hedge transactions. These interest rate swap agreements qualify as cash flow hedges and therefore, the effective portions of their gains or losses are reported as a component of accumulated other comprehensive loss (AOCL) in the consolidated balance sheets. As of December 31, 2024, the fair value of these interest rate swaps was an asset of $29.3 million, excluding the impact of credit risk. Even after giving effect to these swaps, we are exposed to risks due to changes in interest rates with respect to the portions of our Term Loans and Revolving Facility that are not covered by the swaps. A hypothetical change in the SOFR interest rate of 100 basis points would have changed annual interest expense by approximately $8.5 million (or, without the swaps in place, approximately $13.5 million) in 2024.\n\n\n \n\n\nFor additional information on the Company’s foreign currency and commodity forward contracts and interest rate swaps, including amounts charged to the statements of comprehensive income during 2024, 2023, and 2022, refer to Note 5, “Derivative Instruments and Hedging Activities,” and Note 6, “Accumulated Other Comprehensive Loss,” to our consolidated financial statements in Item 8 of this Annual Report on Form 10-K.\n\n\n \n\n\n\n\n\n\n\n\n\n       33\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nItem 8. Financial Statements and Supplementary Data\n\n\n \n\n\n\n     \n  \n\n\nReport of Independent Registered Public Accounting Firm\n\n\n \n\n\nTo the stockholders and the Board of Directors of Generac Holdings Inc.\n\n\n \n\n\nOpinion on the Financial Statements\n\n\n \n\n\nWe have audited the accompanying consolidated balance sheets of Generac Holdings Inc. and subsidiaries (the \"Company\") as of December 31, 2024 and 2023, the related consolidated statements of comprehensive income, stockholders' equity, and cash flows, for each of the three years in the period ended December 31, 2024, and the related notes (collectively referred to as the \"financial statements\"). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2024 and 2023, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2024, in conformity with accounting principles generally accepted in the United States of America.\n\n\n \n\n\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control \n—\n Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated February 19, 2025, expressed an unqualified opinion on the Company's internal control over financial reporting.\n\n\n \n\n\nBasis for Opinion\n\n\n \n\n\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\n\n\n \n\n\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\n\n\n \n\n\nCritical Audit Matter\n\n\n \n\n\nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\n\n\n \n\n\nRevenue \n–\n Refer to Note 2 to the Consolidated Financial Statements\n\n\n \n\n\nCritical Audit Matter Description\n\n\n \n\n\nThe Company has a wide range of products and services that are offered in various markets throughout the world. The Company’s business activities are carried out by numerous individual business units, which offer a unique set of products and services within specific geographic areas.\n\n\n \n\n\nWe identified revenue as a critical audit matter given the disaggregated nature of the Company’s operations and business units generating revenue. This required extensive audit effort due to the volume of the underlying transactions and distinctiveness of each individual business unit. High levels of auditor judgment were necessary to determine the nature, timing, and extent of audit procedures.\n\n\n \n\n\n\n\n\n\n\n\n\n    34\n   \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nHow the Critical Audit Matter Was Addressed in the Audit\n\n\n \n\n\nOur audit procedures related to the Company’s revenue transactions included the following, among others:\n\n\n \n\n\n \n \n●\n \nEvaluated the design and effectiveness of the controls within the relevant revenue business processes, including controls over revenue recognition and operating results.\n\n\n\n\n \n \n●\n \nFor a sample of revenue transactions, we performed detail transaction testing by agreeing the amounts recorded to source documents and determined that revenue was recognized appropriately.\n\n\n\n\n \n \n●\n \nFor the revenue populations subject to detail transaction testing, we tested the completeness of revenue by making selections from reciprocal populations and determined whether the transaction was recorded as a sale in the general ledger.\n\n\n\n\n \n \n●\n \nFor revenue transactions not subject to detail transaction testing we evaluated recorded activity based on analytical procedures using regression analyses to develop an expectation of the revenue balance at the product class level.\n\n\n\n\n \n\n\n \n\n\n/s/ \nDeloitte & Touche LLP\n\n\n \n\n\nMilwaukee, Wisconsin\n\n\nFebruary 19, 2025\n\n\n \n\n\nWe have served as the Company’s auditor since 2016.\n\n\n \n\n\n\n\n\n\n\n\n\n    35\n   \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n  \n\n\nReport of Independent Registered Public Accounting Firm\n\n\n \n\n\nTo the stockholders and the Board of Directors of Generac Holdings Inc.\n\n\n \n\n\nOpinion on Internal Control over Financial Reporting\n\n\n \n\n\nWe have audited the internal control over financial reporting of Generac Holdings Inc. and subsidiaries (the “Company”) as of December 31, 2024, based on criteria established in \nInternal Control \n—\n Integrated Framework (2013)\n issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2024, based on criteria established in \nInternal Control \n—\n Integrated Framework (2013)\n issued by COSO.\n\n\n \n\n\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated financial statements as of and for the year ended December 31, 2024, of the Company and our report dated February 19, 2025, expressed an unqualified opinion on those financial statements.\n\n\n \n\n\nBasis for Opinion \n\n\n \n\n\nThe Company’s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management’s Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company’s internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\n\n\n \n\n\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\n\n\n \n\n\nDefinition and Limitations of Internal Control over Financial Reporting\n\n\n \n\n\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\n\n\n \n\n\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n\n\n \n\n\n/s/ Deloitte & Touche LLP\n\n\n \n\n\nMilwaukee, Wisconsin\n\n\nFebruary 19, 2025\n\n\n \n\n\n\n\n\n\n\n\n\n       36\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n     \n  \n\n\n\n\n\n\n\n\n \nGenerac Holdings Inc.\n \n\n\n\n\n\n\n \nConsolidated Balance Sheets\n \n\n\n\n\n\n\n \n(U.S. Dollars in Thousands, Except Share and Per Share Data)\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n \n \n \nDecember 31,\n \n \n\n\n \n \n \n2024\n \n \n \n \n2023\n \n \n\n\n \nAssets\n \n \n \n \n \n \n \n \n \n\n\n \nCurrent assets:\n \n \n \n \n \n \n \n \n \n\n\n \nCash and cash equivalents\n \n \n$\n281,277\n \n \n$\n200,994\n \n\n\n \nAccounts receivable, less allowance for credit losses of $\n35,465\n and $\n33,925\n as of December 31, 2024 and 2023, respectively\n \n \n \n612,107\n \n \n \n537,316\n \n\n\n \nInventories\n \n \n \n1,031,647\n \n \n \n1,167,484\n \n\n\n \nPrepaid expenses and other assets\n \n \n \n107,139\n \n \n \n91,898\n \n\n\n \nTotal current assets\n \n \n \n2,032,170\n \n \n \n1,997,692\n \n\n\n \n \n \n \n \n \n \n \n \n\n\n \nProperty and equipment, net\n \n \n \n690,023\n \n \n \n598,577\n \n\n\n \n \n \n \n \n \n \n \n \n\n\n \nCustomer lists, net\n \n \n \n152,737\n \n \n \n184,513\n \n\n\n \nPatents and technology, net\n \n \n \n379,095\n \n \n \n417,441\n \n\n\n \nOther intangible assets, net\n \n \n \n20,026\n \n \n \n27,127\n \n\n\n \nTradenames, net\n \n \n \n206,664\n \n \n \n216,995\n \n\n\n \nGoodwill\n \n \n \n1,436,261\n \n \n \n1,432,384\n \n\n\n \nDeferred income taxes\n \n \n \n24,132\n \n \n \n15,532\n \n\n\n \nOperating lease and other assets\n \n \n \n168,223\n \n \n \n203,051\n \n\n\n \nTotal assets\n \n \n$\n5,109,331\n \n \n$\n5,093,312\n \n\n\n \n \n \n \n \n \n \n \n \n\n\n \nLiabilities and stockholders’ equity\n \n \n \n \n \n \n \n \n \n\n\n \nCurrent liabilities:\n \n \n \n \n \n \n \n \n \n\n\n \nShort-term borrowings\n \n \n$\n55,848\n \n \n$\n81,769\n \n\n\n \nAccounts payable\n \n \n \n458,693\n \n \n \n340,719\n \n\n\n \nAccrued wages and employee benefits\n \n \n \n81,485\n \n \n \n54,970\n \n\n\n \nAccrued product warranty\n \n \n \n56,127\n \n \n \n65,298\n \n\n\n \nOther accrued liabilities\n \n \n \n313,401\n \n \n \n292,120\n \n\n\n \nCurrent portion of long-term borrowings and finance lease obligations\n \n \n \n67,598\n \n \n \n45,895\n \n\n\n \nTotal current liabilities\n \n \n \n1,033,152\n \n \n \n880,771\n \n\n\n \n \n \n \n \n \n \n \n \n\n\n \nLong-term borrowings and finance lease obligations\n \n \n \n1,210,776\n \n \n \n1,447,553\n \n\n\n \nDeferred income taxes\n \n \n \n33,185\n \n \n \n90,012\n \n\n\n \nDeferred revenue\n \n \n \n193,260\n \n \n \n167,008\n \n\n\n \nOperating lease and other long-term liabilities\n \n \n \n141,515\n \n \n \n158,349\n \n\n\n \nTotal liabilities\n \n \n \n2,611,888\n \n \n \n2,743,693\n \n\n\n \n \n \n \n \n \n \n \n \n\n\n \nRedeemable noncontrolling interest\n \n \n \n–\n \n \n \n6,549\n \n\n\n \n \n \n \n \n \n \n \n \n\n\n \nStockholders’ equity:\n \n \n \n \n \n \n \n \n \n\n\n \nCommon stock, par value $\n0.01\n, \n500,000,000\n shares authorized, \n73,785,631\n and \n73,195,055\n shares issued as of December 31, 2024 and 2023, respectively\n \n \n \n738\n \n \n \n733\n \n\n\n \nAdditional paid-in capital\n \n \n \n1,133,756\n \n \n \n1,070,386\n \n\n\n \nTreasury stock, at cost, \n14,173,697\n and \n13,057,298\n shares as of December 31, 2024 and 2023, respectively\n \n \n \n(\n1,196,997\n)\n \n \n(\n1,032,921\n)\n\n\n \nExcess purchase price over predecessor basis\n \n \n \n(\n202,116\n)\n \n \n(\n202,116\n)\n\n\n \nRetained earnings\n \n \n \n2,844,296\n \n \n \n2,519,313\n \n\n\n \nAccumulated other comprehensive loss\n \n \n \n(\n85,399\n)\n \n \n(\n15,143\n)\n\n\n \nStockholders’ equity attributable to Generac Holdings Inc.\n \n \n \n2,494,278\n \n \n \n2,340,252\n \n\n\n \nNoncontrolling interests\n \n \n \n3,165\n \n \n \n2,818\n \n\n\n \nTotal stockholders’ equity\n \n \n \n2,497,443\n \n \n \n2,343,070\n \n\n\n \nTotal liabilities and stockholders’ equity\n \n \n$\n5,109,331\n \n \n$\n5,093,312\n \n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \nSee notes to consolidated financial statements.\n \n\n\n\n\n\n\n\n\n \n\n\n\n     \n  \n\n\n\n\n\n     37\n   \n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \nGenerac Holdings Inc.\n \n\n\n\n\n\n\n \nConsolidated Statements of Comprehensive Income\n \n\n\n\n\n\n\n \n(U.S. Dollars in Thousands, Except Share and Per Share Data)\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \nYear Ended December 31,\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n2024\n \n\n\n \n\n\n \n\n\n \n2023\n \n\n\n \n\n\n \n\n\n \n2022\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nNet sales\n \n\n\n \n\n\n$\n\n\n4,295,834\n\n\n \n\n\n \n\n\n$\n\n\n4,022,667\n\n\n \n\n\n \n\n\n$\n\n\n4,564,737\n\n\n \n\n\n\n\n\n\n \nCosts of goods sold\n \n\n\n \n\n\n \n\n\n2,630,208\n\n\n \n\n\n \n\n\n \n\n\n2,657,236\n\n\n \n\n\n \n\n\n \n\n\n3,042,733\n\n\n \n\n\n\n\n\n\n \nGross profit\n \n\n\n \n\n\n \n\n\n1,665,626\n\n\n \n\n\n \n\n\n \n\n\n1,365,431\n\n\n \n\n\n \n\n\n \n\n\n1,522,004\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nOperating expenses:\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nSelling and service\n \n\n\n \n\n\n \n\n\n526,446\n\n\n \n\n\n \n\n\n \n\n\n448,199\n\n\n \n\n\n \n\n\n \n\n\n496,260\n\n\n \n\n\n\n\n\n\n \nResearch and development\n \n\n\n \n\n\n \n\n\n219,600\n\n\n \n\n\n \n\n\n \n\n\n173,443\n\n\n \n\n\n \n\n\n \n\n\n159,774\n\n\n \n\n\n\n\n\n\n \nGeneral and administrative\n \n\n\n \n\n\n \n\n\n285,095\n\n\n \n\n\n \n\n\n \n\n\n253,396\n\n\n \n\n\n \n\n\n \n\n\n196,320\n\n\n \n\n\n\n\n\n\n \nAmortization of intangibles\n \n\n\n \n\n\n \n\n\n97,743\n\n\n \n\n\n \n\n\n \n\n\n104,194\n\n\n \n\n\n \n\n\n \n\n\n103,320\n\n\n \n\n\n\n\n\n\n \nTotal operating expenses\n \n\n\n \n\n\n \n\n\n1,128,884\n\n\n \n\n\n \n\n\n \n\n\n979,232\n\n\n \n\n\n \n\n\n \n\n\n955,674\n\n\n \n\n\n\n\n\n\n \nIncome from operations\n \n\n\n \n\n\n \n\n\n536,742\n\n\n \n\n\n \n\n\n \n\n\n386,199\n\n\n \n\n\n \n\n\n \n\n\n566,330\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nOther (expense) income:\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nInterest expense\n \n\n\n \n\n\n \n\n\n(\n89,713\n\n\n)\n\n\n \n\n\n \n\n\n(\n97,627\n\n\n)\n\n\n \n\n\n \n\n\n(\n54,826\n\n\n)\n\n\n\n\n\n\n \nInvestment income\n \n\n\n \n\n\n \n\n\n7,605\n\n\n \n\n\n \n\n\n \n\n\n4,272\n\n\n \n\n\n \n\n\n \n\n\n1,129\n\n\n \n\n\n\n\n\n\n \nChange in fair value of investment\n \n\n\n \n\n\n \n\n\n(\n38,006\n\n\n)\n\n\n \n\n\n \n\n\n–\n\n\n \n\n\n \n\n\n \n\n\n–\n\n\n \n\n\n\n\n\n\n \nLoss on extinguishment of debt\n \n\n\n \n\n\n \n\n\n(\n4,861\n\n\n)\n\n\n \n\n\n \n\n\n–\n\n\n \n\n\n \n\n\n \n\n\n(\n3,743\n\n\n)\n\n\n\n\n\n\n \nOther, net\n \n\n\n \n\n\n \n\n\n(\n2,329\n\n\n)\n\n\n \n\n\n \n\n\n(\n2,544\n\n\n)\n\n\n \n\n\n \n\n\n(\n424\n\n\n)\n\n\n\n\n\n\n \nTotal other expense, net\n \n\n\n \n\n\n \n\n\n(\n127,304\n\n\n)\n\n\n \n\n\n \n\n\n(\n95,899\n\n\n)\n\n\n \n\n\n \n\n\n(\n57,864\n\n\n)\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nIncome before provision for income taxes\n \n\n\n \n\n\n \n\n\n409,438\n\n\n \n\n\n \n\n\n \n\n\n290,300\n\n\n \n\n\n \n\n\n \n\n\n508,466\n\n\n \n\n\n\n\n\n\n \nProvision for income taxes\n \n\n\n \n\n\n \n\n\n92,460\n\n\n \n\n\n \n\n\n \n\n\n73,180\n\n\n \n\n\n \n\n\n \n\n\n99,596\n\n\n \n\n\n\n\n\n\n \nNet income\n \n\n\n \n\n\n \n\n\n316,978\n\n\n \n\n\n \n\n\n \n\n\n217,120\n\n\n \n\n\n \n\n\n \n\n\n408,870\n\n\n \n\n\n\n\n\n\n \nNet income attributable to noncontrolling interests\n \n\n\n \n\n\n \n\n\n663\n\n\n \n\n\n \n\n\n \n\n\n2,514\n\n\n \n\n\n \n\n\n \n\n\n9,368\n\n\n \n\n\n\n\n\n\n \nNet income attributable to Generac Holdings Inc.\n \n\n\n \n\n\n$\n\n\n316,315\n\n\n \n\n\n \n\n\n$\n\n\n214,606\n\n\n \n\n\n \n\n\n$\n\n\n399,502\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nOther comprehensive income (loss):\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nForeign currency translation adjustment\n \n\n\n \n\n\n$\n\n\n(\n62,842\n\n\n)\n\n\n \n\n\n$\n\n\n57,963\n\n\n \n\n\n \n\n\n$\n\n\n(\n48,841\n\n\n)\n\n\n\n\n\n\n \nNet unrealized (loss) gain on derivatives\n \n\n\n \n\n\n \n\n\n(\n7,672\n\n\n)\n\n\n \n\n\n \n\n\n(\n8,004\n\n\n)\n\n\n \n\n\n \n\n\n38,494\n\n\n \n\n\n\n\n\n\n \nOther comprehensive income (loss)\n \n\n\n \n\n\n \n\n\n(\n70,514\n\n\n)\n\n\n \n\n\n \n\n\n49,959\n\n\n \n\n\n \n\n\n \n\n\n(\n10,347\n\n\n)\n\n\n\n\n\n\n \nTotal comprehensive income\n \n\n\n \n\n\n \n\n\n246,464\n\n\n \n\n\n \n\n\n \n\n\n267,079\n\n\n \n\n\n \n\n\n \n\n\n398,523\n\n\n \n\n\n\n\n\n\n \nComprehensive income attributable to noncontrolling interests\n \n\n\n \n\n\n \n\n\n405\n\n\n \n\n\n \n\n\n \n\n\n2,581\n\n\n \n\n\n \n\n\n \n\n\n11,179\n\n\n \n\n\n\n\n\n\n \nComprehensive income attributable to Generac Holdings Inc.\n \n\n\n \n\n\n$\n\n\n246,059\n\n\n \n\n\n \n\n\n$\n\n\n264,498\n\n\n \n\n\n \n\n\n$\n\n\n387,344\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nNet income attributable to Generac Holdings Inc. per common share - basic:\n \n\n\n \n\n\n$\n\n\n5.46\n\n\n \n\n\n \n\n\n$\n\n\n3.31\n\n\n \n\n\n \n\n\n$\n\n\n5.55\n\n\n \n\n\n\n\n\n\n \nWeighted average common shares outstanding - basic:\n \n\n\n \n\n\n \n\n\n59,559,797\n\n\n \n\n\n \n\n\n \n\n\n61,265,060\n\n\n \n\n\n \n\n\n \n\n\n63,117,007\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nNet income attributable to Generac Holdings Inc. per common share - diluted:\n \n\n\n \n\n\n$\n\n\n5.39\n\n\n \n\n\n \n\n\n$\n\n\n3.27\n\n\n \n\n\n \n\n\n$\n\n\n5.42\n\n\n \n\n\n\n\n\n\n \nWeighted average common shares outstanding - diluted:\n \n\n\n \n\n\n \n\n\n60,350,412\n\n\n \n\n\n \n\n\n \n\n\n62,058,387\n\n\n \n\n\n \n\n\n \n\n\n64,681,357\n\n\n \n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \nSee notes to consolidated financial statements.\n \n\n\n\n\n\n\n\n\n \n\n\n\n     \n  \n\n\n \n\n\n\n\n\n\n\n\n\n       38\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \nGenerac Holdings Inc.\n \n\n\n\n\n\n\n \nConsolidated Statements of Stockholders' Equity\n \n\n\n\n\n\n\n \n(U.S. Dollars in Thousands, Except Share Data)\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n \n \n \nGenerac Holdings Inc.\n \n \n \n \n \n \n \n \n \n \n\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nExcess Purchase Price\n \n \n \n \n \n \n \n \nAccumulated\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n \n \n \n \n \n \n \n \n \n \n \nAdditional\n \n \n \n \n \n \n \n \n \n \n \n \nOver\n \n \n \n \n \n \n \n \nOther\n \n \n \n \nTotal\n \n \n \n \n \n \n \n \n \n \n\n\n \n \n \nCommon Stock\n \n \n \n \nPaid-In\n \n \n \n \nTreasury Stock\n \n \n \n \nPredecessor\n \n \n \n \nRetained\n \n \n \n \nComprehensive\n \n \n \n \nStockholders'\n \n \n \n \nNoncontrolling\n \n \n \n \n \n \n\n\n \n \n \nShares\n \n \n \n \nAmount\n \n \n \n \nCapital\n \n \n \n \nShares\n \n \n \n \nAmount\n \n \n \n \nBasis\n \n \n \n \nEarnings\n \n \n \n \nIncome (Loss)\n \n \n \n \nEquity\n \n \n \n \nInterest\n \n \n \n \nTotal\n \n \n\n\n \nBalance as of December 31, 2021\n \n \n \n72,386,017\n \n \n$\n725\n \n \n$\n952,939\n \n \n \n(\n8,667,031\n)\n \n$\n(\n448,976\n)\n \n$\n(\n202,116\n)\n \n$\n1,965,957\n \n \n$\n(\n54,755\n)\n \n$\n2,213,774\n \n \n$\n313\n \n \n$\n2,214,087\n \n\n\n \nUnrealized gain on interest rate swaps, net of tax of $(\n12,858\n)\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n38,494\n \n \n \n38,494\n \n \n \n \n \n \n \n38,494\n \n\n\n \nForeign currency translation adjustment\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n(\n48,841\n)\n \n \n(\n48,841\n)\n \n \n(\n264\n)\n \n \n(\n49,105\n)\n\n\n \nCommon stock issued under equity incentive plans, net of shares withheld for employee taxes and strike price\n \n \n \n315,240\n \n \n \n3\n \n \n \n(\n247\n)\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n(\n244\n)\n \n \n \n \n \n \n(\n244\n)\n\n\n \nPayment of acquisition contingent consideration\n \n \n \n \n \n \n \n \n \n33,965\n \n \n \n196,531\n \n \n \n13,158\n \n \n \n \n \n \n \n \n \n \n \n \n47,123\n \n \n \n \n \n \n47,123\n \n\n\n \nNet share settlement of restricted stock awards\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n(\n91,843\n)\n \n \n(\n26,833\n)\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n(\n26,833\n)\n \n \n \n \n \n \n(\n26,833\n)\n\n\n \nStock repurchases\n \n \n \n \n \n \n \n \n \n \n \n \n(\n2,722,007\n)\n \n \n(\n345,840\n)\n \n \n \n \n \n \n \n \n \n \n \n(\n345,840\n)\n \n \n \n \n \n(\n345,840\n)\n\n\n \nShare-based compensation\n \n \n \n \n \n \n \n \n \n \n29,481\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n29,481\n \n \n \n \n \n \n29,481\n \n\n\n \nRedemption value adjustment\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n(\n49,235\n)\n \n \n \n \n \n(\n49,235\n)\n \n \n \n \n \n(\n49,235\n)\n\n\n \nNet income\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n399,502\n \n \n \n \n \n \n399,502\n \n \n \n1,825\n \n \n \n401,327\n \n\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n \nBalance as of December 31, 2022\n \n \n \n72,701,257\n \n \n$\n728\n \n \n$\n1,016,138\n \n \n \n(\n11,284,350\n)\n \n$\n(\n808,491\n)\n \n$\n(\n202,116\n)\n \n$\n2,316,224\n \n \n$\n(\n65,102\n)\n \n$\n2,257,381\n \n \n$\n1,874\n \n \n$\n2,259,255\n \n\n\n \nUnrealized loss on interest rate swaps, net of tax of $\n2,674\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n(\n8,004\n)\n \n \n(\n8,004\n)\n \n \n \n \n \n(\n8,004\n)\n\n\n \nForeign currency translation adjustment\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n57,963\n \n \n \n57,963\n \n \n \n128\n \n \n \n58,091\n \n\n\n \nCommon stock issued under equity incentive plans, net of shares withheld for employee taxes and strike price\n \n \n \n482,855\n \n \n \n5\n \n \n \n3,345\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n3,350\n \n \n \n \n \n \n3,350\n \n\n\n \nPayment of acquisition contingent consideration\n \n \n \n10,943\n \n \n \n–\n \n \n \n15,411\n \n \n \n466,118\n \n \n \n33,396\n \n \n \n \n \n \n \n \n \n \n \n \n48,807\n \n \n \n \n \n \n48,807\n \n\n\n \nNet share settlement of restricted stock awards\n \n \n \n \n \n \n \n \n \n \n \n \n(\n50,591\n)\n \n \n(\n6,313\n)\n \n \n \n \n \n \n \n \n \n \n \n(\n6,313\n)\n \n \n \n \n \n(\n6,313\n)\n\n\n \nStock repurchases\n \n \n \n \n \n \n \n \n \n \n \n \n(\n2,188,475\n)\n \n \n(\n251,513\n)\n \n \n \n \n \n \n \n \n \n \n \n(\n251,513\n)\n \n \n \n \n \n(\n251,513\n)\n\n\n \nShare-based compensation\n \n \n \n \n \n \n \n \n \n \n35,492\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n35,492\n \n \n \n \n \n \n35,492\n \n\n\n \nRedemption value adjustment\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n(\n11,517\n)\n \n \n \n \n \n(\n11,517\n)\n \n \n \n \n \n(\n11,517\n)\n\n\n \nNet income\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n214,606\n \n \n \n \n \n \n214,606\n \n \n \n816\n \n \n \n215,422\n \n\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n \nBalance as of December 31, 2023\n \n \n \n73,195,055\n \n \n$\n733\n \n \n$\n1,070,386\n \n \n \n(\n13,057,298\n)\n \n$\n(\n1,032,921\n)\n \n$\n(\n202,116\n)\n \n$\n2,519,313\n \n \n$\n(\n15,143\n)\n \n$\n2,340,252\n \n \n$\n2,818\n \n \n$\n2,343,070\n \n\n\n \nUnrealized loss on interest rate swaps, net of tax of $\n2,563\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n(\n7,672\n)\n \n \n(\n7,672\n)\n \n \n \n \n \n(\n7,672\n)\n\n\n \nForeign currency translation adjustment\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n(\n62,584\n)\n \n \n(\n62,584\n)\n \n \n(\n258\n)\n \n \n(\n62,842\n)\n\n\n \nCommon stock issued under equity incentive plans, net of shares withheld for employee taxes and strike price\n \n \n \n590,576\n \n \n \n5\n \n \n \n14,122\n \n \n \n8,417\n \n \n \n–\n \n \n \n \n \n \n \n \n \n \n \n \n14,127\n \n \n \n \n \n \n14,127\n \n\n\n \nNet share settlement of restricted stock awards\n \n \n \n \n \n \n \n \n \n \n \n \n(\n78,465\n)\n \n \n(\n11,333\n)\n \n \n \n \n \n \n \n \n \n \n \n(\n11,333\n)\n \n \n \n \n \n(\n11,333\n)\n\n\n \nStock repurchases\n \n \n \n \n \n \n \n \n \n \n \n \n(\n1,046,351\n)\n \n \n(\n152,743\n)\n \n \n \n \n \n \n \n \n \n \n \n(\n152,743\n)\n \n \n \n \n \n(\n152,743\n)\n\n\n \nShare-based compensation\n \n \n \n \n \n \n \n \n \n \n49,248\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n49,248\n \n \n \n \n \n \n49,248\n \n\n\n \nRedemption value adjustment\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n8,941\n \n \n \n \n \n \n8,941\n \n \n \n \n \n \n8,941\n \n\n\n \nCash dividends paid to noncontrolling interest of subsidiary\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n(\n273\n)\n \n \n \n \n \n(\n273\n)\n \n \n \n \n \n(\n273\n)\n\n\n \nNet income\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n316,315\n \n \n \n \n \n \n316,315\n \n \n \n605\n \n \n \n316,920\n \n\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n \nBalance as of December 31, 2024\n \n \n \n73,785,631\n \n \n$\n738\n \n \n$\n1,133,756\n \n \n \n(\n14,173,697\n)\n \n$\n(\n1,196,997\n)\n \n$\n(\n202,116\n)\n \n$\n2,844,296\n \n \n$\n(\n85,399\n)\n \n$\n2,494,278\n \n \n$\n3,165\n \n \n$\n2,497,443\n \n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \nSee notes to consolidated financial statements.\n \n\n\n\n\n\n\n\n\n \n\n\n\n     \n  \n\n\n\n\n\n     39\n   \n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \nGenerac Holdings Inc.\n \n\n\n\n\n\n\n \nConsolidated Statements of Cash Flows\n \n\n\n\n\n\n\n \n(U.S. Dollars in Thousands)\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \nYear Ended December 31,\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n2024\n \n\n\n \n\n\n \n\n\n \n2023\n \n\n\n \n\n\n \n\n\n \n2022\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nOperating activities\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nNet income\n \n\n\n \n\n\n$\n\n\n316,978\n\n\n \n\n\n \n\n\n$\n\n\n217,120\n\n\n \n\n\n \n\n\n$\n\n\n408,870\n\n\n \n\n\n\n\n\n\n \nAdjustments to reconcile net income to net cash provided by operating activities:\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nDepreciation and finance lease amortization\n \n\n\n \n\n\n \n\n\n74,025\n\n\n \n\n\n \n\n\n \n\n\n62,408\n\n\n \n\n\n \n\n\n \n\n\n52,821\n\n\n \n\n\n\n\n\n\n \nAmortization of intangible assets\n \n\n\n \n\n\n \n\n\n97,743\n\n\n \n\n\n \n\n\n \n\n\n104,194\n\n\n \n\n\n \n\n\n \n\n\n103,320\n\n\n \n\n\n\n\n\n\n \nAmortization of deferred financing costs and original issue discount\n \n\n\n \n\n\n \n\n\n3,242\n\n\n \n\n\n \n\n\n \n\n\n3,885\n\n\n \n\n\n \n\n\n \n\n\n3,234\n\n\n \n\n\n\n\n\n\n \nChange in fair value of investment\n \n\n\n \n\n\n \n\n\n38,006\n\n\n \n\n\n \n\n\n \n\n\n–\n\n\n \n\n\n \n\n\n \n\n\n–\n\n\n \n\n\n\n\n\n\n \nLoss on extinguishment of debt\n \n\n\n \n\n\n \n\n\n4,861\n\n\n \n\n\n \n\n\n \n\n\n–\n\n\n \n\n\n \n\n\n \n\n\n3,743\n\n\n \n\n\n\n\n\n\n \nDeferred income taxes\n \n\n\n \n\n\n \n\n\n(\n60,615\n\n\n)\n\n\n \n\n\n \n\n\n(\n34,478\n\n\n)\n\n\n \n\n\n \n\n\n(\n95,465\n\n\n)\n\n\n\n\n\n\n \nShare-based compensation expense\n \n\n\n \n\n\n \n\n\n49,248\n\n\n \n\n\n \n\n\n \n\n\n35,492\n\n\n \n\n\n \n\n\n \n\n\n29,481\n\n\n \n\n\n\n\n\n\n \nLoss (gain) on disposal of assets\n \n\n\n \n\n\n \n\n\n138\n\n\n \n\n\n \n\n\n \n\n\n(\n285\n\n\n)\n\n\n \n\n\n \n\n\n(\n592\n\n\n)\n\n\n\n\n\n\n \nOther noncash charges\n \n\n\n \n\n\n \n\n\n5,780\n\n\n \n\n\n \n\n\n \n\n\n5,922\n\n\n \n\n\n \n\n\n \n\n\n18,339\n\n\n \n\n\n\n\n\n\n \nExcess tax benefits from equity awards\n \n\n\n \n\n\n \n\n\n(\n5,069\n\n\n)\n\n\n \n\n\n \n\n\n(\n977\n\n\n)\n\n\n \n\n\n \n\n\n(\n16,910\n\n\n)\n\n\n\n\n\n\n \nNet changes in operating assets and liabilities, net of acquisitions:\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nAccounts receivable\n \n\n\n \n\n\n \n\n\n(\n82,816\n\n\n)\n\n\n \n\n\n \n\n\n(\n18,272\n\n\n)\n\n\n \n\n\n \n\n\n6,547\n\n\n \n\n\n\n\n\n\n \nInventories\n \n\n\n \n\n\n \n\n\n122,952\n\n\n \n\n\n \n\n\n \n\n\n262,670\n\n\n \n\n\n \n\n\n \n\n\n(\n319,274\n\n\n)\n\n\n\n\n\n\n \nOther assets\n \n\n\n \n\n\n \n\n\n546\n\n\n \n\n\n \n\n\n \n\n\n24,266\n\n\n \n\n\n \n\n\n \n\n\n4,766\n\n\n \n\n\n\n\n\n\n \nAccounts payable\n \n\n\n \n\n\n \n\n\n123,571\n\n\n \n\n\n \n\n\n \n\n\n(\n120,900\n\n\n)\n\n\n \n\n\n \n\n\n(\n223,031\n\n\n)\n\n\n\n\n\n\n \nAccrued wages and employee benefits\n \n\n\n \n\n\n \n\n\n26,870\n\n\n \n\n\n \n\n\n \n\n\n7,962\n\n\n \n\n\n \n\n\n \n\n\n(\n27,369\n\n\n)\n\n\n\n\n\n\n \nOther accrued liabilities\n \n\n\n \n\n\n \n\n\n25,841\n\n\n \n\n\n \n\n\n \n\n\n(\n27,337\n\n\n)\n\n\n \n\n\n \n\n\n110,036\n\n\n \n\n\n\n\n\n\n \nNet cash provided by operating activities\n \n\n\n \n\n\n \n\n\n741,301\n\n\n \n\n\n \n\n\n \n\n\n521,670\n\n\n \n\n\n \n\n\n \n\n\n58,516\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nInvesting activities\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nProceeds from sale of property and equipment\n \n\n\n \n\n\n \n\n\n211\n\n\n \n\n\n \n\n\n \n\n\n2,896\n\n\n \n\n\n \n\n\n \n\n\n2,077\n\n\n \n\n\n\n\n\n\n \nProceeds from beneficial interest in securitization transactions\n \n\n\n \n\n\n \n\n\n–\n\n\n \n\n\n \n\n\n \n\n\n3,294\n\n\n \n\n\n \n\n\n \n\n\n3,566\n\n\n \n\n\n\n\n\n\n \nContribution to tax equity investment\n \n\n\n \n\n\n \n\n\n(\n1,629\n\n\n)\n\n\n \n\n\n \n\n\n(\n6,627\n\n\n)\n\n\n \n\n\n \n\n\n(\n14,930\n\n\n)\n\n\n\n\n\n\n \nPurchase of long-term investments\n \n\n\n \n\n\n \n\n\n(\n37,821\n\n\n)\n\n\n \n\n\n \n\n\n(\n32,592\n\n\n)\n\n\n \n\n\n \n\n\n(\n15,000\n\n\n)\n\n\n\n\n\n\n \nProceeds from sale of long-term investments\n \n\n\n \n\n\n \n\n\n2,000\n\n\n \n\n\n \n\n\n \n\n\n–\n\n\n \n\n\n \n\n\n \n\n\n1,308\n\n\n \n\n\n\n\n\n\n \nExpenditures for property and equipment\n \n\n\n \n\n\n \n\n\n(\n136,733\n\n\n)\n\n\n \n\n\n \n\n\n(\n129,060\n\n\n)\n\n\n \n\n\n \n\n\n(\n86,188\n\n\n)\n\n\n\n\n\n\n \nAcquisition of businesses, net of cash acquired\n \n\n\n \n\n\n \n\n\n(\n34,740\n\n\n)\n\n\n \n\n\n \n\n\n(\n15,974\n\n\n)\n\n\n \n\n\n \n\n\n(\n25,065\n\n\n)\n\n\n\n\n\n\n \nNet cash used in investing activities\n \n\n\n \n\n\n \n\n\n(\n208,712\n\n\n)\n\n\n \n\n\n \n\n\n(\n178,063\n\n\n)\n\n\n \n\n\n \n\n\n(\n134,232\n\n\n)\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nFinancing activities\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nProceeds from short-term borrowings\n \n\n\n \n\n\n \n\n\n29,219\n\n\n \n\n\n \n\n\n \n\n\n64,257\n\n\n \n\n\n \n\n\n \n\n\n248,209\n\n\n \n\n\n\n\n\n\n \nProceeds from long-term borrowings\n \n\n\n \n\n\n \n\n\n541,475\n\n\n \n\n\n \n\n\n \n\n\n348,827\n\n\n \n\n\n \n\n\n \n\n\n1,026,284\n\n\n \n\n\n\n\n\n\n \nRepayments of short-term borrowings\n \n\n\n \n\n\n \n\n\n(\n54,548\n\n\n)\n\n\n \n\n\n \n\n\n(\n37,104\n\n\n)\n\n\n \n\n\n \n\n\n(\n268,133\n\n\n)\n\n\n\n\n\n\n \nRepayments of long-term borrowings and finance lease obligations\n \n\n\n \n\n\n \n\n\n(\n794,600\n\n\n)\n\n\n \n\n\n \n\n\n(\n288,699\n\n\n)\n\n\n \n\n\n \n\n\n(\n542,191\n\n\n)\n\n\n\n\n\n\n \nStock repurchases\n \n\n\n \n\n\n \n\n\n(\n152,743\n\n\n)\n\n\n \n\n\n \n\n\n(\n251,513\n\n\n)\n\n\n \n\n\n \n\n\n(\n345,840\n\n\n)\n\n\n\n\n\n\n \nPayment of debt issuance costs\n \n\n\n \n\n\n \n\n\n(\n3,616\n\n\n)\n\n\n \n\n\n \n\n\n–\n\n\n \n\n\n \n\n\n \n\n\n(\n10,330\n\n\n)\n\n\n\n\n\n\n \nPayment of contingent acquisition consideration\n \n\n\n \n\n\n \n\n\n–\n\n\n \n\n\n \n\n\n \n\n\n(\n4,979\n\n\n)\n\n\n \n\n\n \n\n\n(\n16,135\n\n\n)\n\n\n\n\n\n\n \nPayment of deferred acquisition consideration\n \n\n\n \n\n\n \n\n\n(\n7,421\n\n\n)\n\n\n \n\n\n \n\n\n–\n\n\n \n\n\n \n\n\n \n\n\n–\n\n\n \n\n\n\n\n\n\n \nPurchase of additional ownership interest\n \n\n\n \n\n\n \n\n\n(\n9,117\n\n\n)\n\n\n \n\n\n \n\n\n(\n104,844\n\n\n)\n\n\n \n\n\n \n\n\n(\n375\n\n\n)\n\n\n\n\n\n\n \nCash dividends paid to noncontrolling interest of subsidiary\n \n\n\n \n\n\n \n\n\n(\n273\n\n\n)\n\n\n \n\n\n \n\n\n–\n\n\n \n\n\n \n\n\n \n\n\n(\n309\n\n\n)\n\n\n\n\n\n\n \nTaxes paid related to equity awards\n \n\n\n \n\n\n \n\n\n(\n24,769\n\n\n)\n\n\n \n\n\n \n\n\n(\n10,897\n\n\n)\n\n\n \n\n\n \n\n\n(\n40,923\n\n\n)\n\n\n\n\n\n\n \nProceeds from the exercise of stock options\n \n\n\n \n\n\n \n\n\n27,558\n\n\n \n\n\n \n\n\n \n\n\n7,815\n\n\n \n\n\n \n\n\n \n\n\n13,786\n\n\n \n\n\n\n\n\n\n \nNet cash (used in) provided by financing activities\n \n\n\n \n\n\n \n\n\n(\n448,835\n\n\n)\n\n\n \n\n\n \n\n\n(\n277,137\n\n\n)\n\n\n \n\n\n \n\n\n64,043\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nEffect of foreign exchange rate changes on cash and cash equivalents\n \n\n\n \n\n\n \n\n\n(\n3,471\n\n\n)\n\n\n \n\n\n \n\n\n1,801\n\n\n \n\n\n \n\n\n \n\n\n(\n2,943\n\n\n)\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nNet increase (decrease) in cash and cash equivalents\n \n\n\n \n\n\n \n\n\n80,283\n\n\n \n\n\n \n\n\n \n\n\n68,271\n\n\n \n\n\n \n\n\n \n\n\n(\n14,616\n\n\n)\n\n\n\n\n\n\n \nCash and cash equivalents at beginning of period\n \n\n\n \n\n\n \n\n\n200,994\n\n\n \n\n\n \n\n\n \n\n\n132,723\n\n\n \n\n\n \n\n\n \n\n\n147,339\n\n\n \n\n\n\n\n\n\n \nCash and cash equivalents at end of period\n \n\n\n \n\n\n$\n\n\n281,277\n\n\n \n\n\n \n\n\n$\n\n\n200,994\n\n\n \n\n\n \n\n\n$\n\n\n132,723\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nSupplemental disclosure of cash flow information\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nCash paid during the period\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \nInterest\n \n\n\n \n\n\n$\n\n\n89,420\n\n\n \n\n\n \n\n\n$\n\n\n84,027\n\n\n \n\n\n \n\n\n$\n\n\n48,912\n\n\n \n\n\n\n\n\n\n \nIncome taxes\n \n\n\n \n\n\n \n\n\n148,828\n\n\n \n\n\n \n\n\n \n\n\n100,082\n\n\n \n\n\n \n\n\n \n\n\n150,893\n\n\n \n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \nSee notes to consolidated financial statements.\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n     40\n   \n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nGenerac Holdings Inc.\n Notes to Consolidated Financial Statements\n\n\nYears Ended December 31, 2024, 2023 and 2022\n\n\n(\nU.S. \nDollars in Thousands, Except Share and Per Share Data)\n\n\n \n\n\n\n     \n  \n\n\n\n\n \n1.\n \n \nDescription of Business\n \n\n\n\n\n \n\n\nFounded in \n1959,\n Generac Holdings Inc. (the Company) is a leading global designer and manufacturer of a wide range of energy technology solutions. The Company provides power generation equipment, energy storage systems, energy management devices & solutions, and other power products and services serving the residential, light commercial, and industrial markets. Generac’s power products and solutions are available globally through a broad network of independent dealers, distributors, retailers, e-commerce partners, wholesalers, and equipment rental companies, as well as sold direct to certain end user customers. \n\n\n \n\n\nOver the years, the Company has executed a number of acquisitions that support its strategic plan (refer to Item \n1\n in this Annual Report on Form \n10\n-K for discussion of the Company's “Powering a Smarter World” strategic plan). A summary of acquisitions affecting the reporting periods presented include:\n\n\n \n\n\n \n●\n \nIn \n November 2024, \nthe Company acquired Wolverine Power Systems (Wolverine), headquartered in Zeeland, Michigan. Wolverine is an industrial and residential generator distributor as well as a provider of maintenance and repair services.\n\n\n \n●\n \nIn \n August 2024, \nthe Company acquired the assets and liabilities of Ageto, LLC (Ageto). Ageto designs and integrates microgrid control solutions and is headquartered in Fort Collins, Colorado. \n\n\n \n●\n \n\n\n\n\n\n\n\n\n\n            In\n           \n June 2024, \nthe Company closed on the acquisition of the Commercial & Industrial Battery Energy Storage System (C&I BESS) product offering from SunGrid Solutions Inc. located in Cambridge, Canada.\n          \n\n\n\n\n\n\n \n\n\n \n●\n \nIn \n April 2024, \nthe Company acquired Huntington Power Equipment, Inc. (Huntington), headquartered in Shelton, Connecticut. Huntington is an industrial and residential generator distributor as well as a provider of maintenance and repair services. \n\n\n \n●\n \nIn \n February 2023, \nthe Company acquired REFUstor, headquartered in Pfullingen, Germany. REFUstor is a developer and supplier of battery storage hardware products, advanced software, and platform services for the commercial and industrial energy storage market.\n\n\n \n●\n \nIn \n October 2022, \nthe Company acquired Blue Pillar, an industrial IoT platform developer that designs, deploys, and manages industrial IoT network solutions to enable distributed energy generation monitoring and control.\n\n\n \n●\n \nIn \n June 2022, \nthe Company acquired Electronic Environments Co. LLC and related subsidiaries (collectively EEC). Headquartered in Marlborough, Massachusetts, EEC is an industrial generator distributor as well as a provider of design, build, maintenance, and repair services for data center and telecom facilities.\n\n\n\n\n\n\n \n\n\n\n     \n  \n\n\n\n\n \n2.\n \n \nSummary of\n Accounting Policies \n \n\n\n\n\n \n\n\nPrinciples of Consolidation\n\n\n \n\n\nThe consolidated financial statements include the accounts of the Company and its subsidiaries that are consolidated in conformity with U.S. GAAP. All intercompany amounts and transactions have been eliminated in consolidation.\n\n\n \n\n\nCash \nand Cash \nEquivalents\n\n\n \n\n\nThe Company considers all highly liquid investments purchased with an original maturity of \nthree\n months or less to be cash equivalents.\n\n\n \n\n\nConcentration of Credit Risk\n\n\n \n\n\nThe Company maintains the majority of its domestic cash in a few commercial banks in multiple operating and investment accounts. Balances on deposit are insured by the Federal Deposit Insurance Corporation (FDIC) up to specified limits. Balances in excess of FDIC limits are uninsured. One customer accounted for approximately \n10\n% and \n7\n% of accounts receivable as of \n December 31, 2024 \nand \n2023\n, respectively. \nNo\n \none\n customer accounted for greater than \n5\n%, \n4\n%, and \n4\n%, of net sales during the years ended \n December 31, 2024\n, \n2023\n, and \n2022\n, respectively.\n\n\n \n\n\n\n\n\n\nAccounts Receivable and Allowance for Credit Losses\n\n\n\n\n\n\n \n\n\n\n\n\n      The Company's trade and other receivables primarily arise from the sale of its products and services to independent residential dealers, industrial distributors and dealers, national and regional retailers, electrical/HVAC/solar wholesalers, e-commerce partners, equipment rental companies, equipment distributors, EPC companies, telecommunications customers, and certain end users with payment terms generally ranging from\n     \n30\n to\n     \n90\n days. The Company evaluates the credit risk of a customer when extending credit based on a combination of various financial and qualitative factors that\n     \n may \naffect the customers' ability to pay. These factors include the customer's financial condition, past payment experience, credit bureau information, and regional considerations.\n    \n\n\n\n\n \n\n\n\n\n\n      Receivables are recorded at their face value amount less an allowance for credit losses. The Company maintains an allowance for credit losses, which represents an estimate of expected losses over the remaining contractual life of its receivables considering current market conditions and estimates for supportable forecasts when appropriate. The Company measures expected credit losses on its trade receivables on an entity-by-entity basis. The estimate of expected credit losses considers a historical loss experience rate that is adjusted for delinquency trends, collection experience, and/or economic risk where appropriate based on current market conditions. Additionally, management develops a specific allowance for trade receivables known to have a high risk of expected future credit loss. \n    \n\n\n\n\n \n\n\n\n\n\n      The Company holds various credit insurance plans that cover the risk of loss up to specified amounts on certain trade receivables. As of\n     \n December 31, 2024, \nthe Company had gross receivables of\n     $\n647,572\n and an allowance for credit losses of\n     \n$35,465.\n\n\n\n\n\n\n \n\n\n\n\n\n\nInventories\n\n\n\n\n\n\n \n\n\n\n\n\n      Inventories are stated at the lower of cost or market, with cost determined using the\n     \nfirst\n-in,\n     \nfirst\n-out method.\n    \n\n\n\n\n \n\n\n\n\n\n\n41\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nProperty and Equipment \n\n\n \n\n\nProperty and equipment, including internal use software, is recorded at cost and depreciated using the straight-line method over the estimated useful lives of the assets, which are summarized below (in years). Costs of leasehold improvements are amortized over the lesser of the term of the lease (including renewal option periods) or the estimated useful lives of the improvements. The Company capitalizes internal use software and significant enhancements when the Company obtains a software license or develops the software internally. The Company capitalizes cloud computing arrangements that qualify as service contracts if the Company has the contractual right to take possession of the software at any time during the contract period, without significant penalty and if it is feasible for the Company to either operate the software internally or contract with a \nthird\n party to host the software on our behalf. Implementation costs incurred in cloud computing arrangements that are service contracts are recorded in prepaid expenses and other assets and operating lease and other assets in the Consolidated Balance Sheets and are amortized over the expected service period of the cloud computing arrangements. Finance lease right of use assets are included in property and equipment. \n\n\n \n\n\n\n\n \nLand improvements\n \n \n8\n–\n20\n \n\n\n \nBuildings and improvements\n \n \n10\n–\n40\n \n\n\n \nMachinery and equipment\n \n \n3\n–\n15\n \n\n\n \nDies and tools\n \n \n3\n–\n10\n \n\n\n \nVehicles\n \n \n3\n–\n6\n \n\n\n \nOffice & information technology equipment and internal use software\n \n \n3\n–\n15\n \n\n\n \nLeasehold improvements\n \n \n2\n–\n20\n \n\n\n\n\n\n\n \n\n\nTotal depreciation and finance lease amortization expense was \n$\n74,025\n, $\n62,408\n, and $\n52,821\n for the years ended \n December 31, 2024, \n2023\n and \n2022\n, respectively.\n\n\n \n\n\nGoodwill and Other Indefinite-Lived Intangible Assets\n\n\n \n\n\nGoodwill represents the excess of the purchase price over fair value of identifiable net assets acquired from business acquisitions. Goodwill is \nnot\n amortized, but is reviewed for impairment on an annual basis and between annual tests if indicators of impairment are present. The Company evaluates goodwill for impairment annually as of \n October 31 \nor more frequently when an event occurs or circumstances change that indicates the carrying value \n may \nnot\n be recoverable. The Company has the option to assess goodwill for impairment by performing either a qualitative assessment or quantitative test. The qualitative assessment determines whether it is more likely than \nnot\n that the fair value of a reporting unit is less than its carrying amount. If the Company determines that it is \nnot\n more likely than \nnot\n that the fair value of a reporting unit is less than its carrying amount, then the quantitative test is \nnot\n required to be performed. If the Company determines that it is more likely than \nnot\n that the fair value of a reporting unit is less than its carrying amount, the Company is required to perform the quantitative test. In the quantitative test, the calculated fair value of the reporting unit is compared to its book value including goodwill. If the fair value of the reporting unit is in excess of its book value, the related goodwill is \nnot\n impaired. If the fair value of the reporting unit is less than its book value, an impairment loss is recognized in an amount equal to that excess, limited to the total amount of goodwill allocated to that reporting unit.\n\n\n \n\n\nOther indefinite-lived intangible assets consist of certain tradenames. The Company tests the carrying value of these tradenames annually as of \n October 31, \nor more frequently when an event occurs or circumstances change that indicates the carrying value \n may \nnot\n be recoverable, by comparing the assets’ fair value to its carrying value. Fair value is measured using a relief-from-royalty approach, which assumes the fair value of the tradename is the discounted cash flows of the amount that would be paid had the Company \nnot\n owned the tradename and instead licensed the tradename from another company.\n\n\n \n\n\nThe Company performed the required annual impairment tests for goodwill and other indefinite-lived intangible assets for the fiscal years \n2024\n, \n2023\n and \n2022\n, and found \nno\n impairment.\n\n\n \n\n\nImpairment of Long-Lived Assets\n\n\n \n\n\nThe Company periodically evaluates the carrying value of long-lived assets (excluding goodwill and indefinite-lived tradenames). Long-lived assets are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount \n may \nnot\n be recoverable. If the sum of the expected future undiscounted cash flows is less than the carrying amount of an asset, a loss is recognized for the difference between the fair value and carrying value of the asset.\n\n\n \n\n\n\n\n\n\nDebt Issuance Costs\n\n\n\n\n\n\n \n\n\n\n\n\n      Debt discounts and direct costs incurred in connection with the issuance or amendment of long-term debt are deferred and recorded as a reduction of outstanding debt and amortized to interest expense using the effective interest method over the terms of the related credit agreements.\n     $\n3,242\n,\n     $\n3,885\n, and\n     $\n3,234\n of deferred financing costs and original issue discount were amortized to interest expense during fiscal years\n     \n2024\n,\n     \n2023\n and\n     \n2022\n, respectively. Excluding the impact of any future long-term debt issuances or prepayments, estimated amortization to interest expense for the next\n     \nfive\n years is as follows:\n     \n2025\n -\n     \n$2,573;\n\n\n2026\n -\n     \n$2,544;\n\n\n2027\n -\n     \n$1,434;\n\n\n2028\n -\n     \n$437;\n\n\n2029\n -\n     $\n463\n. \n    \n\n\n\n\n \n\n\n\n\n\n\n42\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nIncome Taxes\n\n\n \n\n\nThe Company is a C Corporation and therefore accounts for income taxes pursuant to the liability method. Accordingly, the current or deferred tax consequences of a transaction are measured by applying the provision of enacted tax laws to determine the amount of taxes payable currently or in future years. Deferred income taxes are provided for temporary differences between the income tax basis of assets and liabilities and their carrying amounts for financial reporting purposes. In assessing the realizability of deferred tax assets, the Company considers whether it is more likely than \nnot\n that some portion or all of the deferred tax assets will \nnot\n be realized. The ultimate realization of deferred tax assets is dependent upon the generation of future taxable income during the years in which those temporary differences become deductible. The Company considers taxable income in prior carryback years, the scheduled reversal of deferred tax liabilities, projected future taxable income and tax planning strategies, as appropriate, in making this assessment.\n\n\n \n\n\nRevenue Recognition\n\n\n The Company’s revenues primarily consist of the sale of products to its customers. The Company considers the purchase orders, which in some cases are governed by master sales agreements, to be the contracts with the customers. For each contract, the Company considers the commitment to transfer products, each of which is distinct, to be the identified performance obligations. Revenue is measured as the amount of consideration the Company expects to be entitled in exchange for the transfer of product, which is generally the price stated in the contract specific for each item sold, adjusted for the value of expected returns, discounts, rebates, or other promotional incentives or allowances offered to our customers. Expected returns for damaged or defective product are estimated using the expected value method based on historical product return experience. Discounts and rebates offered to customers are typically defined in the master sales agreements with customers and, therefore, are recorded using the most likely amount method based on the terms of the contract. Promotional incentives are defined programs offered for short, specific periods of time and are estimated using the expected value method based on historical experience. The Company does \nnot\n expect the transaction price for revenue recognized will be subject to a significant revenue reversal. As the Company’s product sale contracts and standard payment terms have a duration of less than \none\n year, it uses the practical expedient applicable to such contracts and does \nnot\n consider the time value of money. Sales, use, value add, and other similar taxes assessed by governmental authorities and collected concurrently with revenue-producing activities are excluded from revenue. The Company has elected to recognize the cost for freight activities when control of the product has transferred to the customer as an expense within cost of goods sold in the consolidated statements of comprehensive income. Product revenues are recognized at the point in time when control of the product is transferred to the customer, which typically occurs upon shipment or delivery to the customer. To determine when control has transferred, the Company considers if there is a present right to payment and if legal title, physical possession, and the significant risks and rewards of ownership of the asset has transferred to the customer. As a substantial portion of the Company’s product revenues are recognized at a point in time, the amount of unsatisfied performance obligations at each period end is \nnot\n material. The Company’s contracts have an original expected duration of \none\n year or less. As a result, the Company has elected to use the practical expedient to \nnot\n disclose its remaining performance obligations.\n\n\n \n\n\nWhile the Company’s standard payment terms are less than \none\n year, the specific payment terms and conditions in its customer contracts vary. In some cases, customers prepay for their goods; in other cases, after appropriate credit evaluation, an open credit line is granted and payment is due in arrears after shipment of the product to the customer. Contracts with payment in arrears are recognized in the consolidated balance sheets as accounts receivable upon revenue recognition, while contracts where customers pay in advance are recognized as customer deposits and recorded in other accrued liabilities in the consolidated balance sheets until revenue is recognized. The balance of customer deposits (contract liabilities) was $\n26,858\n and $\n19,173\n as of \n December 31, 2024, \nand \n December 31, 2023, \nrespectively. During the year ended \n December 31, 2024, \nthe Company recognized revenue of $\n19,173\n related to amounts included in the \n December 31, 2023, \ncustomer deposit balance. The Company typically recognizes revenue within \none\n year of the receipt of the customer deposit. \n\n\n \n\n\nThe Company offers standard warranty coverage on substantially all products that it sells and accounts for this standard warranty coverage as an assurance warranty. As such, \nno\n transaction price is allocated to the standard warranty, and the Company records a liability for product warranty obligations at the time of sale to a customer based on historical warranty experience. Refer to Note \n11,\n “Product Warranty Obligations,” to the consolidated financial statements of this Annual Report on Form \n10\n-K for further information regarding the Company’s standard warranties.\n\n\n \n\n\n\n\n\n      The Company also sells extended warranty coverage for certain products, which it accounts for as service warranties. In most cases, the extended warranty is sold as a separate contract. As such, extended warranty sales are considered a separate performance obligation, and the extended warranty transaction is separate and distinct from the product. The extended warranty transaction price is initially recorded as deferred revenue in the consolidated balance sheets and amortized on a straight-line basis to net sales in the consolidated statements of comprehensive income over the life of the contracts, following the standard warranty period. For extended warranty contracts that the Company sells under a\n     \nthird\n-party marketing agreement, it is required to pay fees to the\n     \nthird\n-party service provider and classifies these fees as costs to obtain a contract. The contract costs are deferred and recorded as other assets in the consolidated balance sheets. The deferred contract costs are amortized as an offset to net sales in the consolidated statements of comprehensive income consistent with how the related deferred revenue is recognized. Refer to Note\n     \n11,\n “Product Warranty Obligations,” to the consolidated financial statements of this Annual Report on Form\n     \n10\n-K for further information regarding the Company’s extended warranties. \n    \n\n\n\n\n \n\n\n\n\n\n      In addition to extended warranties, the Company offers other services, including remote monitoring, installation, maintenance, data center and telecom facility design and build, and grid services to utilities in certain circumstances. Total service revenues accounted for less than\n     \n4%,\n\n\n4%,\n and\n     \n3%\n of net sales during the years ended\n     \n December 31, 2024, \n2023\n and \n2022\n, respectively. \n    \n\n\n\n\n \n\n\n\n\n\n      Refer to Note\n     \n7,\n “Segment Reporting,” to the consolidated financial statements of this Annual Report on Form\n     \n10\n-K for the Company’s disaggregated revenue disclosure. The information discussed above is applicable to each of the Company’s product classes.\n    \n\n\n\n\n \n\n\n\n\n\n\n43\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nAdvertising and Co-Op Advertising\n\n\n \n\n\nExpenditures for advertising, included in selling and service expenses in the consolidated statements of comprehensive income, are expensed as incurred. Expenditures for advertising production costs are expensed when the related advertisement is \nfirst\n run. Expenditures for Co-Op advertising are expensed when claimed by the customer. Total expenditures for advertising w\nere $\n116,550\n, \n$1\n18,303,\n and $\n100,589\n for the years ended \n December 31, 2024, \n2023\n and \n2022\n, respectively.\n\n\n \n\n\nResearch and Development\n\n\n \n\n\nThe Company expenses research and development costs as incurred. Total expenditures incurred for research and development were $\n219,600\n, $\n173,443\n, and $\n159,774\n for the years ended \n December 31, 2024, \n2023\n and \n2022\n, respectively.\n\n\n \n\n\nForeign Currency Translation and Transactions\n\n\n \n\n\nBalance sheet amounts for non-U.S. Dollar functional currency subsidiaries are translated into U.S. Dollars at the rates of exchange in effect at the end of the fiscal year. Income and expenses incurred in a foreign currency are translated at the average rates of exchange in effect during the year. The related balance sheet translation adjustments are made directly to accumulated other comprehensive loss, a component of stockholders’ equity, in the consolidated balance sheets. Gains and losses from foreign currency transactions are recognized as incurred in the consolidated statements of comprehensive income.\n\n\n \n\n\nFair Value of Financial Instruments\n\n\n \n\n\nASC \n820\n-\n10,\n \nFair Value Measurement,\n defines fair value, establishes a consistent framework for measuring fair value, and expands disclosure for each major asset and liability category measured at fair value on either a recurring basis or nonrecurring basis. ASC \n820\n-\n10\n clarifies that fair value is an exit price, representing the amount that would be received in the sale of an asset or paid to transfer a liability in an orderly transaction between market participants. As such, fair value is a market-based measurement that should be determined based on assumptions that market participants would use in pricing an asset or liability. As a basis for considering such assumptions, the pronouncement establishes a \nthree\n-tier fair value hierarchy, which prioritizes the inputs used in measuring fair value as follows: (Level \n1\n) observable inputs such as quoted prices in active markets; (Level \n2\n) inputs, other than the quoted prices in active markets, that are observable either directly or indirectly; and (Level \n3\n) unobservable inputs in which there is little or \nno\n market data, which require the reporting entity to develop its own assumptions.\n\n\n \n\n\nThe Company believes the carrying amount of its financial instruments (cash and cash equivalents, accounts receivable, accounts payable, accrued liabilities, short-term borrowings, and revolving facility (Revolving Facility) borrowings), excluding Term Loan borrowings, approximates the fair value of these instruments based on their short-term nature. The fair value of the Tranche A Term Loan Facility borrowing, which has a net carrying value of $\n710,715\n, was approximately $\n705,375\n (Level \n2\n) as of \n December 31, 2024. \nThe fair value of the Tranche B Term Loan Facility borrowing, which has a net carrying value of $\n495,936\n, was approximately $\n501,244\n (Level \n2\n) as of \n December 31, 2024. \nThese Term Loan fair values were calculated based on independent valuations which contain inputs and significant value drivers that are observable. \n\n\n \n\n\nFor the fair value of the assets and liabilities measured on a recurring basis, excluding the contingent consideration discussed below, refer to the fair value table in Note \n5,\n “Derivative Instruments and Hedging Activities,” to the consolidated financial statements of this Annual Report on Form \n10\n-K. The fair value of the Company's interest rate swaps and commodity and foreign currency derivative contracts are classified as Level \n2.\n The valuation techniques used to measure the fair value of these derivative contracts, all of which have counterparties with high credit ratings, were based on quoted market prices or model driven valuations using significant inputs derived from or corroborated by observable market data. The fair value of the derivative contracts discussed above considers the Company’s credit risk in accordance with ASC \n820\n-\n10.\n\n\n \n\n\nThe fair value of the Wallbox stock warrants is classified as Level \n3.\n The fair value of these contracts is measured using a Black Scholes option pricing model, with significant inputs derived from or corroborated by observable market data as well as internal estimates, specifically the time period until exercise. The warrants received in the \nthird\n quarter of \n2024\n and \nfourth\n quarter of \n2023\n expire at the earlier of when the price per share equals or exceeds $\n6.00\n or in \n2028\n and \n2029,\n respectively. The time period until exercise assumption has a significant impact on the fair value of the warrants.\n\n\n \n\n\nEquity Securities\n\n\n \n\n\nEquity securities consist of shares of Wallbox N.V's (Wallbox) Class A common stock (Wallbox Shares). The Wallbox Shares are classified as Level \n1\n in the fair value hierarchy and are recognized at fair value using the closing price of Wallbox common stock quoted on the New York Stock Exchange (NYSE) on the last trading day of the quarter. The investment in Wallbox Shares is included in operating lease and other assets in the consolidated balance sheets. The fair value of the investment in Wallbox Shares was $\n19,075\n and $\n17,213\n as of \n December 31, 2024, \nand \n December 31, 2023, \nrespectively. Gains and losses attributable to the Wallbox Shares are recognized in other expense, net in the consolidated statements of comprehensive income. The loss recognized on the investment in Wallbox Shares was $\n30,679\n for the year ended \n December \n31,\n \n2024.\n For additional information regarding the Company's investment in Wallbox, see Note \n5,\n “Derivative Instruments and Hedging Activities,” to the consolidated financial statements of this Annual Report on Form \n10\n-K\n\n\n \n\n\n\n\n\n\n44\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nContingent Consideration\n\n\n \n\n\nCertain of the Company's business combinations involve potential payment of future consideration that is contingent upon the achievement of certain milestones. As part of purchase accounting, a liability is recorded for the estimated fair value of the contingent consideration on the acquisition date. The fair value of the contingent consideration is remeasured at each reporting period, and the change in fair value is recognized within general and administrative expenses in the Company's consolidated statements of comprehensive income. The fair value measurement of contingent consideration is typically categorized as a Level \n3\n liability, as the measurement amount is based primarily on significant inputs that are \nnot\n observable in the market. \n\n\n \n\n\nThe combined fair value of contingent consideration for Chilicon and Ageto as of \n December 31, 2024, \nand for Chilicon and Pramac as of \n December 31, 2023, \nwas $\n34,114\n and $\n38,937\n, respectively. The contingent consideration period for Chilicon extends through \n December 31, 2028, \nwhile the contingent consideration period for Pramac extends through \n December 31, 2025. \nThe contingent consideration for Ageto can be earned in equal increments with \none\n \nthird\n of the contingent consideration capable of being earned each year as of \n August 1, 2025, \n August 1, 2026, \nand \n August 1, 2027. \nThe current portion of contingent consideration is reported in other accrued liabilities and the non-current portion is reported in operating lease and other long-term liabilities in the consolidated balance sheets. \n\n\n \n\n\nThe following table provides a reconciliation of the activity for contingent consideration: \n\n\n \n\n\n\n\n \nBeginning balance, January 1, 2024\n \n \n$\n38,937\n \n\n\n \nChanges in fair value (1)\n \n \n \n(\n11,627\n)\n\n\n \nAdditional contingent consideration (2)\n \n \n \n5,911\n \n\n\n \nPayment of contingent consideration\n \n \n \n-\n \n\n\n \nPresent value interest accretion\n \n \n \n893\n \n\n\n \nEnding balance, December 31, 2024\n \n \n$\n34,114\n \n\n\n\n\n\n\n \n\n\n(\n1\n) Represents the change in fair value of the contingent deferred consideration for the Pramac buyout. See Note \n4,\n \"Redeemable Noncontrolling Interest\", to the consolidated financial statements of this Annual Report on Form \n10\n-K. \n\n\n(\n2\n) Represents $\n5,911\n of contingent consideration related to the Ageto acquisition. \n\n\n \n\n\nUse of Estimates\n\n\n \n\n\nThe preparation of the consolidated financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities at the date of the consolidated financial statements, and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\n\n\n \n\n\nDerivative Instruments and Hedging Activities\n\n\n \n\n\nThe Company records all derivatives in accordance with ASC \n815,\n \nDerivatives and Hedging\n,\n which requires derivative instruments to be reported in the consolidated balance sheets at fair value and establishes criteria for designation and effectiveness of hedging relationships. The Company is exposed to market risk such as changes in commodity prices, foreign currencies and interest rates. The Company does \nnot\n hold or trade derivative financial instruments for trading purposes. \n\n\n \n\n\nS\nhare\n-Based Compensation\n\n\n \n\n\nShare-based compensation expense, including stock options and restricted stock awards, is generally recognized on a straight-line basis over the vesting period based on the fair value of awards which are expected to vest. The fair value of all share-based awards is estimated on the date of grant. Refer to Note \n17,\n “Share Plans,” to the consolidated financial statements of this Annual Report on Form \n10\n-K for further information on the Company’s share-based compensation plans and accounting.\n\n\n \n\n\nNew Accounting Pronouncements\n\n\n \n\n\nChanges to GAAP are established by the Financial Accounting Standards Board (FASB) in the form of accounting standard updates (ASUs) to the FASB Accounting Standards Codification. \n\n\n \n\n\nIn \n November 2024, \nthe FASB issued\n ASU \n2024\n-\n03\n Income Statement - Reporting Comprehensive Income - Expense Disaggregation Disclosures (Subtopic \n220\n-\n40\n): Disaggregation of Income Statement Expenses\n. The new guidance is intended to provide investors more detailed disclosures around specific types of expenses. The new disclosures require additional quantitative and qualitative information for certain expenses contained within the Consolidated Statements of Comprehensive Income to be presented in the notes to the financial statements. The update is effective for fiscal years beginning after \n December 15, 2026, \nand interim periods within fiscal years beginning after \n December 15, 2027, \nwith early adoption permitted. The disclosure updates are required to be applied prospectively with the option for retrospective application. The Company is currently assessing the impact and timing of adopting the updated provisions.\n\n\n \n\n\nIn \n March 2024, \nthe Securities and Exchange Commission (SEC) adopted a final rule under SEC Release \nNo.\n \n33\n-\n11275,\n The Enhancement and Standardization of Climate-Related Disclosures for Investors, to enhance and standardize climate-related disclosures. The rule will require companies to disclose material Scope \n1\n and Scope \n2\n greenhouse gas emissions; climate-related risks, governance, and oversight; and the financial effects of severe weather events and other natural conditions. These disclosures will begin to be phased in beginning with the Company's annual report for the year ending \n December 31, 2025. \nWhile this rule has been stayed pending the outcome of legal challenges, the Company is currently assessing the impact of adoption on the Company's consolidated financial statements and related disclosures in the event the stay is lifted.\n\n\n \n\n\nIn \n December 2023, \nthe FASB issued\n ASU \n2023\n-\n09\n Improvements to Income Tax Disclosures\n. The ASU establishes new income tax disclosure requirements in addition to modifying and eliminating certain existing requirements. Under the new guidance, the Company must consistently categorize and provide greater disaggregation of information in the rate reconciliation. It must also further disaggregate income taxes paid. The update is effective for fiscal years beginning after \n December 15, 2024. \nEntities \n may \napply the new disclosures prospectively or \n may \nelect retrospective application. The Company is evaluating the impact of the new required disclosures, but does \nnot\n expect the adoption of ASU \n2023\n-\n09\n to have a material impact on the Company's consolidated financial statements. \n\n\n \n\n\nIn \n November 2023, \nthe FASB issued ASU \n2023\n-\n07\n \nSegment Reporting - Improving Reportable Segment Disclosures (Topic \n280\n)\n. The update is intended to improve reportable segment disclosure requirements, primarily through enhanced disclosures about significant expenses. The ASU requires disclosures to include significant segment expenses that are regularly provided to the chief operating decision maker (CODM), a description of other segment items by reportable segment, and any additional measures of a segment's profit or loss used by the CODM when deciding how to allocate resources. The ASU also requires all annual disclosures currently required by Topic \n280\n to be included in interim periods. The update is effective for fiscal years beginning after \n December 15, 2023, \nand interim periods within fiscal years beginning after \n December 15, 2024, \nwith early adoption permitted and requires retrospective application to all prior periods presented in the financial statements. The required annual disclosures are reflected in Note \n7,\n \"Segment Reporting,\" to this Annual Report on Form \n10\n-K and the Company will disclose the required quarterly information beginning with the Form \n10\n-Q for the \nthree\n months ending \n March 31, 2025. \n\n\n \n\n\nThere have been \nno\n other recent accounting pronouncements, changes in accounting pronouncements, or recently adopted accounting guidance during \n2024\n that are of significance or potential significance to the Company's consolidated financial statements or disclosures. \n\n\n \n\n\n\n\n\n\n45\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n     \n  \n\n\n\n\n \n3.\n \n \nAcquisitions\n \n \n\n\n\n\n \n\n\nFiscal \n2024\n \nAcquisitions\n\n\n \n\n\nOn \n November 1, 2024, \nthe Company acquired Wolverine, headquartered in Zeeland, Michigan. Wolverine is an industrial and residential generator distributor as well as a provider of maintenance and repair services.\n\n\n \n\n\nOn \n August 1, 2024, \nthe Company acquired the assets and liabilities of Ageto. Ageto designs and integrates microgrid control solutions and is headquartered in Fort Collins, Colorado. \n\n\n \n\n\nOn \n June 26, 2024, \nthe Company closed on the acquisition of the C&I BESS product offering from SunGrid Solutions Inc. located in Cambridge, Canada.\n\n\n \n\n\nOn \n April 1, 2024, \nthe Company acquired Huntington, headquartered in Shelton, Connecticut. Huntington is an industrial and residential generator distributor as well as a provider of maintenance and repair services. \n\n\n \n\n\nThe combined preliminary purchase price for these acquisitions was $\n45,825\n, net of cash acquired and inclusive of holdbacks and estimated contingent consideration. The Company recorded its preliminary purchase price allocations based on its estimates of the fair value of the acquired assets and assumed liabilities. Purchase accounting for C&I BESS and Huntington will be finalized prior to \n June 30, 2025, \nwhile purchase accounting for Ageto will be finalized prior to \n September 30, 2025. \nPurchase accounting for Wolverine will be finalized prior to \n December 31, 2025. \nThere have \nnot\n been any material changes to the preliminary purchase price allocation for Wolverine, Ageto, C&I BESS, or Huntington as of \n December 31, 2024. \nThe accompanying consolidated financial statements include the results of these acquisitions from their dates of acquisition. \n\n\n \n\n\nFiscal \n2023\n \nAcquisitions\n\n\n \n\n\nOn \n February 1, 2023, \nthe Company acquired REFUstor, headquartered in Pfullingen, Germany. REFUstor is a developer and supplier of battery storage hardware products, advanced software, and platform services for the commercial and industrial energy storage market.\n\n\n \n\n\nThe Company recorded its preliminary purchase price allocation for REFUstor during the \nfirst\n quarter of \n2023,\n based on its estimates of the fair value of the acquired assets and assumed liabilities. Purchase accounting for REFUstor was finalized in the \nfirst\n quarter of \n2024\n and did \nnot\n result in material adjustments to the Company's preliminary estimates. The final purchase price was $\n16,127\n. The accompanying consolidated financial statements include the results of REFUstor since the date of acquisition. \n\n\n \n\n\nFiscal \n2022\n \nAcquisitions\n\n\n \n\n\nOn \n June 30, 2022, \nthe Company acquired EEC. Headquartered in Marlborough, Massachusetts, EEC is an industrial generator distributor as well as a provider design, build, maintenance, and repair services for data center and telecom facilities.\n\n\n \n\n\nOn \n October 3, 2022, \nthe Company acquired Blue Pillar, an industrial IoT platform developer that designs, deploys, and manages industrial IoT network solutions to enable distributed energy generation monitoring and control.\n\n\n \n\n\nThe Company recorded its preliminary purchase price allocation for EEC and Blue Pillar during the \nsecond\n quarter and \nfourth\n quarter of \n2022,\n respectively, based on its estimates of the fair value of the acquired assets and assumed liabilities. Purchase accounting for EEC was finalized in the \nsecond\n quarter of \n2023,\n and purchase accounting for Blue Pillar was finalized in the \nfourth\n quarter of \n2023,\n neither of which resulted in material adjustments to the Company's preliminary estimates. The final combined purchase price for EEC and Blue Pillar was $\n27,658\n. The accompanying consolidated financial statements include the results of the acquired businesses since their dates of acquisition. \n\n\n \n\n\nPro forma and other financial information are \nnot\n presented as the effects of the Company's acquisitions since \n2022\n are \nnot\n material to the Company's results of operations or financial position.\n\n\n \n\n\nSummary Purchase Price Allocations\n\n\n \n\n\nThe fair values assigned to certain assets acquired and liabilities assumed for all acquisitions completed since \n January 1, 2022, \nare as follows:\n\n\n \n\n\n\n\n \n \n \n2024 Acquisitions\n \n \n \n \n2023 Acquisitions\n \n \n \n \n2022 Acquisitions\n \n \n\n\n \nAccounts receivable\n \n \n$\n9,528\n \n \n$\n347\n \n \n$\n11,965\n \n\n\n \nInventories\n \n \n \n10,150\n \n \n \n1,239\n \n \n \n2,955\n \n\n\n \nPrepaid expenses and other current assets\n \n \n \n864\n \n \n \n166\n \n \n \n4,456\n \n\n\n \nProperty and equipment\n \n \n \n824\n \n \n \n5,843\n \n \n \n708\n \n\n\n \nIntangible assets\n \n \n \n14,551\n \n \n \n6,174\n \n \n \n10,032\n \n\n\n \nGoodwill\n \n \n \n22,536\n \n \n \n5,363\n \n \n \n8,714\n \n\n\n \nOther assets\n \n \n \n2,712\n \n \n \n837\n \n \n \n1,954\n \n\n\n \nTotal assets acquired\n \n \n \n61,165\n \n \n \n19,969\n \n \n \n40,784\n \n\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n \nAccounts payable\n \n \n \n2,420\n \n \n \n1,278\n \n \n \n1,826\n \n\n\n \nAccrued wages and employee benefits\n \n \n \n1,256\n \n \n \n264\n \n \n \n1,662\n \n\n\n \nOther accrued liabilities\n \n \n \n9,043\n \n \n \n236\n \n \n \n7,917\n \n\n\n \nCurrent portion of long-term borrowings and finance lease obligations\n \n \n \n146\n \n \n \n-\n \n \n \n-\n \n\n\n \nDeferred income taxes\n \n \n \n803\n \n \n \n2,007\n \n \n \n564\n \n\n\n \nOther long-term liabilities\n \n \n \n1,490\n \n \n \n57\n \n \n \n1,157\n \n\n\n \nLong-term debt\n \n \n \n182\n \n \n \n-\n \n \n \n \n\n\n \nNet assets acquired\n \n \n$\n45,825\n \n \n$\n16,127\n \n \n$\n27,658\n \n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n46\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n     \n  \n\n\n\n\n \n4.\n \n \nRedeemable Noncontrolling Interest\n \n\n\n\n\n \n\n\nOn \n March 1, 2016, \nthe Company acquired a \n65\n% ownership interest in PR Industrial S.r.l. and its subsidiaries (Pramac). The \n35\n% noncontrolling interest in Pramac had an acquisition date fair value of $\n34,253\n and was recorded as a redeemable noncontrolling interest in the consolidated balance sheets, as the noncontrolling interest holder had within its control the right to require the Company to redeem its interest in Pramac. In \n May 2021, \nthe Company exercised its call option rights and paid a purchase price of $\n27,164\n to purchase an additional \n15\n% ownership interest in Pramac, bringing the Company's total ownership interest in Pramac to \n80\n%. On \n March 8, 2023, \nthe Company and the noncontrolling interest holder entered into an agreement whereby the Company acquired the remaining \n20\n% ownership interest in Pramac for a purchase price of $\n116,754\n, which brought the Company's total ownership interest in Pramac to \n100\n%. The purchase price for the remaining \n20\n% ownership interest included $\n105,264\n of initial consideration, which included a cash payment of $\n104,844\n and a $\n420\n gain on a foreign currency settlement in the \nfirst\n quarter of \n2023,\n and $\n11,490\n of contingent deferred consideration of up to \n135,205\n restricted shares that were issued based on the \ntwenty\n day volume weighted average price of the Company’s stock ending on \n December 31, 2022, \nand which shall vest upon achievement of certain earnings targets at the end of the earn-out period, \n December 31, 2025. \nAccordingly, there was \nno\n redeemable noncontrolling interest related to Pramac as of \n December 31, 2023. \nThis contingent deferred consideration was reduced to \nzero\n in the \nfourth\n quarter of \n2024.\n Refer to Note \n2,\n \"Summary of Accounting Policies\", to the consolidated financial statements of this Annual Report on Form \n10\n-K for further information regarding the contingent deferred consideration.\n\n\n  \n\n\nOn \n February 1, 2019, \nthe Company acquired a \n51\n% ownership interest in Captiva Energy Solutions Private Limited (Captiva). The \n49\n% noncontrolling interest in Captiva had an acquisition date fair value of $\n3,165\n and was recorded as a redeemable noncontrolling interest in the consolidated balance sheets, as the noncontrolling interest holder had within its control the right to require the Company to redeem its interest in Captiva. The noncontrolling interest holder had a put option to sell his interest to the Company any time after \nfive\n years from the date of acquisition, or earlier upon the occurrence of certain circumstances. Further, the Company had a call option that \n may \nbe redeemed any time after \nfive\n years from the date of acquisition, or earlier upon the occurrence of certain circumstances. The put and call option price was based on a multiple of earnings, subject to the terms of the acquisition agreement. In \n May 2022, \nthe Company purchased an additional \n15\n% ownership interest in Captiva for $\n375\n, which was paid with cash on hand, bringing the Company's total ownership interest in Captiva to \n66\n%. On \n April 5, 2024, \nthe Company acquired the remaining \n34\n% ownership interest in Captiva for $\n9,117\n of cash.\n\n\n \n\n\nThe redeemable noncontrolling interests were recorded at the greater of the initial fair value, increased or decreased for the noncontrolling interests’ share of comprehensive income (loss), or the estimated redemption value, with any adjustments to the redemption value impacting retained earnings, but \nnot\n net income. However, the redemption value adjustments are reflected in the earnings per share calculation, as detailed in Note \n14,\n “Earnings Per Share,” to the consolidated financial statements of this Annual Report on Form \n10\n-K. The following table presents the changes in the redeemable noncontrolling interest for both Captiva and Pramac:\n\n\n \n\n\n\n\n \n \n \nYear Ended December 31,\n \n \n\n\n \n \n \n2024\n \n \n \n \n2023\n \n \n \n \n2022\n \n \n\n\n \nBalance at beginning of period\n \n \n$\n6,549\n \n \n$\n110,471\n \n \n$\n58,050\n \n\n\n \nShare of net income\n \n \n \n58\n \n \n \n1,864\n \n \n \n7,543\n \n\n\n \nForeign currency translation rate changes\n \n \n \n(\n176\n)\n \n \n(\n549\n)\n \n \n(\n3,982\n)\n\n\n \nPurchase of additional ownership interest\n \n \n \n(\n9,117\n)\n \n \n(\n116,754\n)\n \n \n(\n375\n)\n\n\n \nRedemption value adjustment\n \n \n \n2,686\n \n \n \n11,517\n \n \n \n49,235\n \n\n\n \nBalance at end of period\n \n \n$\n-\n \n \n$\n6,549\n \n \n$\n110,471\n \n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n47\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n     \n  \n\n\n\n\n \n5.\n \n \nDerivative Instruments and Hedging Activities\n \n \n\n\n\n\n \n\n\nThe Company periodically utilizes commodity derivatives and foreign currency forward purchase and sales contracts in the normal course of business. Because these contracts do \nnot\n qualify for hedge accounting, the related gains and losses are recorded in the Company’s consolidated statements of comprehensive income. The commodity and foreign currency forward contract gains and losses are \nnot\n material to the Company’s consolidated financial statements for the periods presented. \n\n\n \n\n\nAdditionally, the Company maintains interest rate swap agreements and owns stock warrants described in more detail below.\n\n\n \n\n\nInterest Rate Swaps\n\n\n \n\n\nIn \n2017,\n the Company entered into \ntwenty\n interest rate swap agreements, the final \nfour\n of which expired in \n May \n2023.\n In \n March 2020, \nthe Company entered into \nthree\n additional interest rate swap agreements, which were still outstanding as of \n December 31, 2024.\n\n\n \n\n\nIn \n June 2022, \nin conjunction with the amendments to the Company's credit agreements discussed further in Note \n12,\n “Credit Agreements,” to the consolidated financial statements of this Annual Report on Form \n10\n-K, the Company amended its interest rate swaps to match the underlying debt and reconfirmed hedge effectiveness. The Company formally documented all relationships between interest rate hedging instruments and the related hedged items, as well as its risk-management objectives and strategies for undertaking various hedge transactions. These interest rate swap agreements qualify as cash flow hedges and therefore, the effective portions of their gains or losses are reported as a component of accumulated other comprehensive loss (AOCL) in the consolidated balance sheets.\n\n\n \n\n\nThe amount of after-tax unrealized gains (losses) recognized for the years ended \n December 31, 2024, \n2023\n and \n2022\n we\nre \n$(\n7,672\n), $(\n8,004\n),\n and $\n38,494\n, respectively. The cash flows of the swaps are recognized as adjustments to interest expense each period. The ineffective portions of the derivatives’ changes in fair value, if any, are immediately recognized in earnings.\n\n\n \n\n\nSee Item \n7A\n “Quantitative and Qualitative Disclosures About Market Risk” of this Annual Report on Form \n10\n-K for additional information on these interest rate swaps. \n\n\n \n\n\nStock Warrants\n\n\n \n\n\nDuring the \nfourth\n quarter of \n2023,\n the Company entered into a $\n30,000\n agreement with Wallbox to purchase \n5\n% of its Class A common stock and acquire stock warrants, the latter of which provide the rights to an incremental approximate \n5\n% ownership in the Class A common stock outstanding of Wallbox upon exercise at a fixed price with anti-dilution protections for a period of time. During the \nthird\n quarter of \n2024,\n the Company received additional warrants in connection with an additional round of funding performed by Wallbox through the Company's anti-dilution protection rights. In accordance with U.S. GAAP, the Company is required to adjust the carrying value of these warrants to market value on a quarterly basis. Gains and losses attributable to the stock warrants are recognized in other expense, net in the consolidated statements of comprehensive income. \n\n\n \n\n\nThe loss attributable to the stock warrants was $\n7,327\n for the year ended \n December 31, 2024.\n\n\n \n\n\nFair Value\n\n\n \n\n\nThe following table presents the fair value of the Company’s derivatives:\n\n\n \n\n\n\n\n \n \nDecember 31,\n \n\n\n \n \n \n2024\n \n \n \n2023\n \n \n\n\n \nInterest rate swaps\n \n \n$\n28,367\n \n$\n38,601\n \n\n\nStock warrants\n \n \n7,919\n \n \n14,862\n \n\n\n\n\n\n\n \n\n\nThe fair values of the interest rate swaps and stock warrants are included in operating lease and other assets in the consolidated balance sheet as of \n December 31, 2024\n and \n December 31, 2023. \nExcluding the impact of credit risk, the fair value of the interest rate swaps as of \n December 31, 2024, \nand \n December 31, 2023, \nis an asset of $\n29,254\n and $\n39,796\n, respectively, which represents the net amount the Company would receive to exit all of the agreements on that date. \n\n\n \n\n\n\n\n\n\n\n\n\n\n48\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n     \n  \n\n\n\n\n \n6.\n \n \nAccumulated Other Comprehensive Loss\n \n \n\n\n\n\n \n\n\nThe following presents a tabular disclosure of changes in AOCL during the years ended \n December 31, 2024 \nand \n2023\n, net of tax:\n\n\n \n\n\n\n\n \n \n \nForeign Currency Translation Adjustments\n \n \n \n \n \nUnrealized Gain (Loss) on Cash Flow Hedges\n \n \n \n \n \nTotal\n \n \n\n\n \nBeginning Balance – January 1, 2024\n \n \n$\n(\n43,582\n)\n \n \n$\n28,439\n \n \n \n$\n(\n15,143\n)\n\n\n \nCurrent-period comprehensive income (loss)\n \n \n \n(\n62,584\n)\n \n(1)\n \n \n \n(\n7,672\n)\n \n(2)\n \n \n \n(\n70,256\n)\n\n\n \nEnding Balance – December 31, 2024\n \n \n$\n(\n106,166\n)\n \n \n$\n20,767\n \n \n \n$\n(\n85,399\n)\n\n\n\n\n\n\n \n\n\n\n\n \n \n \nForeign Currency Translation Adjustments\n \n \n \n \n \nUnrealized Gain (Loss) on Cash Flow Hedges\n \n \n \n \n \nTotal\n \n \n\n\n \nBeginning Balance – January 1, 2023\n \n \n$\n(\n101,545\n)\n \n \n$\n36,443\n \n \n \n$\n(\n65,102\n)\n\n\n \nCurrent-period comprehensive income (loss)\n \n \n \n57,963\n \n \n(3)\n \n \n \n(\n8,004\n)\n \n(4)\n \n \n \n49,959\n \n\n\n \nEnding Balance – December 31, 2023\n \n \n$\n(\n43,582\n)\n \n \n$\n28,439\n \n \n \n$\n(\n15,143\n)\n\n\n\n\n\n\n \n\n\n \n(\n1\n)\nRepresents unfavorable impact from the strengthening of the U.S. dollar against foreign currencies during the year ended \n December 31, 2024, \nparticularly the Euro, British Pound, and Mexican Peso.\n\n\n \n \n(\n2\n)\n \nRepresents unrealized losses of $(\n10,235\n) on the interest rate swaps, net of tax effect of $\n2,563\n for the year ended \n December 31, 2024\n.\n\n\n \n(\n3\n)\nRepresents favorable impact from the weakening of the U.S. dollar against foreign currencies during the year ended \n December 31, 2023, \nparticularly the Euro, British Pound, and Mexican Peso. \n\n\n\n\n \n \n(\n4\n)\n \nRepresents unrealized losses of $(\n10,678\n) on the interest rate swaps, net of tax effect of $\n2,674\n for the year ended \n December 31, 2023.\n\n\n\n\n \n\n\n\n\n\n\n49\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n     \n  \n\n\n\n\n \n7.\n \n \nSegment Reporting\n \n \n\n\n\n\n \n\n\nThe Company has \ntwo\n reportable segments for financial reporting purposes – domestic and international. The domestic segment includes the legacy Generac business and all historical acquisitions based in the U.S. and Canada, all of which have revenues substantially derived from the U.S. and Canada. The international segment includes all historical acquisitions \nnot\n based in the U.S and Canada, all of which have revenues substantially derived from outside the U.S and Canada. Both reportable segments design and manufacture a wide range of energy technology solutions and other power products. The Company has multiple operating segments, which it aggregates into the \ntwo\n reportable segments, based on materially similar economic characteristics, products, production processes, classes of customers, distribution methods, organizational structure, and regional considerations. Intersegment sales are at an appropriate transfer price. \n\n\n \n\n\nThe Company's product offerings consist primarily of power generation equipment, energy storage systems, energy management devices & solutions, and other power products geared for varying end customer uses. While Residential products and Commercial & Industrial (C&I) products include similar products, they differ based on power output and end customer. The composition of net sales between residential, C&I, and other products & services by reportable segment is as follows:\n\n\n \n\n\n\n\n \n \n \nNet Sales by Segment\n \n \n\n\n \n \n \nYear Ended December 31, 2024\n \n \n\n\n \nProduct Classes\n \n \n \nDomestic\n \n \n \n \nInternational\n \n \n \n \nTotal\n \n \n\n\n \nResidential products\n \n \n$\n2,352,629\n \n \n$\n80,845\n \n \n$\n2,433,474\n \n\n\n \nCommercial & Industrial products\n \n \n \n828,586\n \n \n \n560,883\n \n \n \n1,389,469\n \n\n\n \nOther\n \n \n \n417,934\n \n \n \n54,957\n \n \n \n472,891\n \n\n\n \nTotal net sales\n \n \n$\n3,599,149\n \n \n$\n696,685\n \n \n$\n4,295,834\n \n\n\n\n\n\n\n \n\n\n\n\n \n \n \nYear Ended December 31, 2023\n \n \n\n\n \nProduct Classes\n \n \n \nDomestic\n \n \n \n \nInternational\n \n \n \n \nTotal\n \n \n\n\n \nResidential products\n \n \n$\n1,945,273\n \n \n$\n117,656\n \n \n$\n2,062,929\n \n\n\n \nCommercial & Industrial products\n \n \n \n916,118\n \n \n \n578,681\n \n \n \n1,494,799\n \n\n\n \nOther\n \n \n \n414,933\n \n \n \n50,006\n \n \n \n464,939\n \n\n\n \nTotal net sales\n \n \n$\n3,276,324\n \n \n$\n746,343\n \n \n$\n4,022,667\n \n\n\n\n\n\n\n \n\n\n\n\n \n \n \nYear Ended December 31, 2022\n \n \n\n\n \nProduct Classes\n \n \n \nDomestic\n \n \n \n \nInternational\n \n \n \n \nTotal\n \n \n\n\n \nResidential products\n \n \n$\n2,782,037\n \n \n$\n129,834\n \n \n$\n2,911,871\n \n\n\n \nCommercial & Industrial products\n \n \n \n746,172\n \n \n \n514,565\n \n \n \n1,260,737\n \n\n\n \nOther\n \n \n \n339,657\n \n \n \n52,472\n \n \n \n392,129\n \n\n\n \nTotal net sales\n \n \n$\n3,867,866\n \n \n$\n696,871\n \n \n$\n4,564,737\n \n\n\n\n\n\n\n \n\n\nResidential products consist primarily of automatic home standby generators ranging in output from \n7.5kW\n to \n150kW,\n portable generators, residential energy storage systems, energy management devices & solutions, and other outdoor power equipment. These products are predominantly sold through independent residential dealers, national and regional retailers, e-commerce merchants, electrical/HVAC/solar wholesalers, solar installers, and outdoor power equipment dealers. The residential products revenue consists of the sale of the product to the Company's distribution partners, who in turn sell the product to the end consumer, including installation and maintenance services. In some cases, residential products are sold directly to the end consumer. Substantially all of the residential products' revenues are transferred to the customer at a point in time.\n\n\n \n\n\nC&I products consist of larger output stationary generators used in C&I applications, with power outputs up to \n3,250kW.\n Also included in C&I products are mobile generators, light towers, C&I battery energy storage systems, mobile heaters, mobile pumps, and related controls for power generation equipment. These products are sold globally through industrial distributors and dealers, Engineering, Procurement, and Construction (EPC) companies, equipment rental companies, and equipment distributors. The C&I products revenue consists of the sale of the product to the Company's distribution partners, who in turn sell or rent the product to the end customer, including installation and maintenance services. In some cases, C&I products are sold directly to the end customer. Substantially all of the C&I products' revenues are transferred to the customer at a point in time.\n\n\n \n\n\nOther consists primarily of aftermarket service parts and product accessories sold to the Company's distribution partners, the amortization of extended warranty deferred revenue, remote monitoring and grid services subscription revenue, as well as certain design, build, installation, and maintenance service revenue. The aftermarket service parts and product accessories are generally transferred to the customer at a point in time, while the extended warranty and subscription revenue are recognized over the life of the contract. Other service revenue is recognized when the service is performed, sometimes after certain milestones are met.\n\n\n \n\n\n\n\n\n\n50\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n     The Company views Adjusted EBITDA as a key measure of the Company's performance. The computation of Adjusted EBITDA is based primarily on the definition that is contained in the Company’s credit agreements. The Company presents Adjusted EBITDA\n    \nnot\n only due to its importance for purposes of the Company's credit agreements, but also because it assists the Company in comparing performance across reporting periods on a consistent basis as it excludes items the Company's management does\n    \nnot\n believe are indicative of the Company's core operating performance. The Company's Chief Operating Decision Maker (CODM) is Aaron Jagdfeld, President and Chief Executive Officer (CEO). He uses Adjusted EBITDA, along with the Company's management:\n   \n\n\n \n\n\n \n \n●\n \n \nfor planning purposes, including the preparation of the Company's annual operating budget and developing and refining internal projections for future periods;\n \n\n\n\n\n \n \n●\n \n \nto allocate resources to enhance the financial performance of the Company's business;\n \n\n\n\n\n \n \n●\n \n \nas a target for the determination of the bonus component of compensation for the Company's senior executives under the Company's management incentive plan, as described further in the Company's Proxy Statement;\n \n\n\n\n\n \n \n●\n \n \nto evaluate the effectiveness of the Company's business strategies and as a supplemental tool in evaluating the Company's performance against the Company's budget for each period; and\n \n\n\n\n\n \n \n●\n \n \nin communications with the Company's Board and investors concerning the Company's financial performance.\n \n\n\n\n\n \n\n\nSee \"Non-GAAP measures - Adjusted EBITDA\" in Item \n7\n of this Annual Report on Form \n10\n-K for more information on the Company's use of Adjusted EBITDA. The table below presents sales (external and intersegment), significant segment expenses, and Adjusted EBITDA by reportable segment, reconciled to consolidated income before provision for income taxes. \n\n\n \n\n\n\n\n \n \n \nYear Ended December 31, 2024\n \n \n \n \nYear Ended December 31, 2023\n \n \n \n \nYear Ended December 31, 2022\n \n \n\n\n \n \n \nDomestic\n \n \n \n \nInternational\n \n \n \n \nTotal\n \n \n \n \nDomestic\n \n \n \n \nInternational\n \n \n \n \nTotal\n \n \n \n \nDomestic\n \n \n \n \nInternational\n \n \n \n \nTotal\n \n \n\n\n \nExternal net sales\n \n \n$\n3,599,149\n \n \n \n696,685\n \n \n$\n4,295,834\n \n \n$\n3,276,324\n \n \n$\n746,343\n \n \n$\n4,022,667\n \n \n$\n3,867,866\n \n \n$\n696,871\n \n \n$\n4,564,737\n \n\n\n \nIntersegment sales\n \n \n \n35,932\n \n \n \n28,700\n \n \n \n64,632\n \n \n \n43,937\n \n \n \n91,552\n \n \n \n135,489\n \n \n \n60,731\n \n \n \n93,699\n \n \n \n154,430\n \n\n\n \nTotal sales\n \n \n \n3,635,081\n \n \n \n725,385\n \n \n \n4,360,466\n \n \n \n3,320,261\n \n \n \n837,895\n \n \n \n4,158,156\n \n \n \n3,928,597\n \n \n \n790,570\n \n \n \n4,719,167\n \n\n\n \nElimination of intersegment sales\n \n \n \n-\n \n \n \n-\n \n \n \n(\n64,632\n)\n \n \n-\n \n \n \n-\n \n \n \n(\n135,489\n)\n \n \n-\n \n \n \n-\n \n \n \n(\n154,430\n)\n\n\n \nCosts of goods sold\n \n \n \n2,155,269\n \n \n \n539,571\n \n \n \n2,694,840\n \n \n \n2,168,210\n \n \n \n624,515\n \n \n \n2,792,725\n \n \n \n2,604,124\n \n \n \n593,039\n \n \n \n3,197,163\n \n\n\n \nElimination of intersegment cost of goods sold\n \n \n \n-\n \n \n \n-\n \n \n \n(\n64,632\n)\n \n \n-\n \n \n \n-\n \n \n \n(\n135,489\n)\n \n \n-\n \n \n \n-\n \n \n \n(\n154,430\n)\n\n\n \nOperating expenses\n \n \n \n991,042\n \n \n \n137,842\n \n \n \n1,128,884\n \n \n \n839,827\n \n \n \n139,405\n \n \n \n979,232\n \n \n \n833,896\n \n \n \n121,778\n \n \n \n955,674\n \n\n\n \nOther segment items (1)\n \n \n \n(\n204,433\n)\n \n \n(\n47,926\n)\n \n \n(\n252,359\n)\n \n \n(\n211,113\n)\n \n \n(\n40,547\n)\n \n \n(\n251,660\n)\n \n \n(\n225,725\n)\n \n \n(\n33,312\n)\n \n \n(\n259,037\n)\n\n\n \nAdjusted EBITDA by reportable segment\n \n \n$\n693,203\n \n \n$\n95,898\n \n \n \n789,101\n \n \n$\n523,337\n \n \n$\n114,522\n \n \n \n637,859\n \n \n$\n716,302\n \n \n$\n109,065\n \n \n \n825,367\n \n\n\n \nInterest expense\n \n \n \n \n \n \n \n \n \n \n \n(\n89,713\n)\n \n \n \n \n \n \n \n \n \n \n(\n97,627\n)\n \n \n \n \n \n \n \n \n \n \n(\n54,826\n)\n\n\n \nDepreciation and amortization\n \n \n \n \n \n \n \n \n \n \n \n(\n171,768\n)\n \n \n \n \n \n \n \n \n \n \n(\n166,602\n)\n \n \n \n \n \n \n \n \n \n \n(\n156,141\n)\n\n\n \nNon-cash write-down and other adjustments (2)\n \n \n \n \n \n \n \n \n \n \n \n(\n4,757\n)\n \n \n \n \n \n \n \n \n \n \n5,953\n \n \n \n \n \n \n \n \n \n \n \n2,091\n \n\n\n \nNon-cash share-based compensation expense (3)\n \n \n \n \n \n \n \n \n \n \n \n(\n49,248\n)\n \n \n \n \n \n \n \n \n \n \n(\n35,492\n)\n \n \n \n \n \n \n \n \n \n \n(\n29,481\n)\n\n\n \nTransaction costs and credit facility fees (4)\n \n \n \n \n \n \n \n \n \n \n \n(\n5,097\n)\n \n \n \n \n \n \n \n \n \n \n(\n4,054\n)\n \n \n \n \n \n \n \n \n \n \n(\n5,026\n)\n\n\n \nBusiness optimization and other charges (5)\n \n \n \n \n \n \n \n \n \n \n \n(\n4,752\n)\n \n \n \n \n \n \n \n \n \n \n(\n10,551\n)\n \n \n \n \n \n \n \n \n \n \n(\n4,371\n)\n\n\n \nProvision for legal, regulatory, and clean energy product charges (6)\n \n \n \n \n \n \n \n \n \n \n \n(\n10,931\n)\n \n \n \n \n \n \n \n \n \n \n(\n38,490\n)\n \n \n \n \n \n \n \n \n \n \n(\n65,265\n)\n\n\n \nChange in fair value of investment (7)\n \n \n \n \n \n \n \n \n \n \n \n(\n38,006\n)\n \n \n \n \n \n \n \n \n \n \n-\n \n \n \n \n \n \n \n \n \n \n \n-\n \n\n\n \nLoss on extinguishment of debt (8)\n \n \n \n \n \n \n \n \n \n \n \n(\n4,861\n)\n \n \n \n \n \n \n \n \n \n \n-\n \n \n \n \n \n \n \n \n \n \n \n(\n3,743\n)\n\n\n \nOther\n \n \n \n \n \n \n \n \n \n \n \n(\n530\n)\n \n \n \n \n \n \n \n \n \n \n(\n696\n)\n \n \n \n \n \n \n \n \n \n \n(\n139\n)\n\n\n \nIncome before provision for income taxes\n \n \n \n \n \n \n \n \n \n \n$\n409,438\n \n \n \n \n \n \n \n \n \n \n$\n290,300\n \n \n \n \n \n \n \n \n \n \n$\n508,466\n \n\n\n\n\n\n\n \n\n\n \n(\n1\n)\nOther segment items primarily represent depreciation and amortization and the following items defined below: Non-cash write-down and other adjustments; Non-cash shared-based compensation expense; Transaction costs and credit facility fees; Business optimization and other charges; Provision for legal, regulatory, and clean energy product charges. \n\n\n \n \n(\n2\n)\n \n \nIncludes gains/(losses) on dispositions of assets other than in the ordinary course of business, gains/(losses) on sales of certain investments, unrealized mark-to-market adjustments on commodity contracts, certain foreign currency related adjustments, and certain purchase accounting and contingent consideration adjustments. \n \n\n\n\n\n \n \n(\n3\n)\n \nRepresents share-based compensation expense to account for stock options, restricted stock, and other stock awards over their respective vesting periods.\n\n\n\n\n \n(\n4\n)\nRepresents transaction costs incurred directly in connection with any investment, as defined in the Company's credit agreement, equity issuance or debt issuance or refinancing, together with certain fees relating to the Company's senior secured credit facilities, such as administrative agent fees and credit facility commitment fees under the Company's Amended Credit Agreement.\n\n\n \n \n(\n5\n)\n \nRepresents severance and other restructuring charges related to the consolidation of certain operating facilities and organizational functions.\n\n\n\n\n \n \n(\n6\n)\n \n \nRepresents the following litigation, regulatory, and other matters that are \nnot\n indicative of our ongoing operations:\n \n • A provision for judgments, settlements, and legal expenses related to certain patent lawsuits - $\n9,299\n in \n2024;\n $\n27,289\n in \n2023.\n \n \n • Legal expenses related to certain class action lawsuits - $\n1,267\n in \n2024;\n $\n1,051\n in \n2023.\n \n • A bad debt provision and additional customer support costs related to a clean energy product customer that filed for bankruptcy in \n2022\n – $\n365\n and $\n4,350\n additional customer support costs in \n2024\n and \n2023,\n respectively; $\n17,926\n bad debt provision in \n2022.\n \n \n • A warranty provision to address clean energy product warranty-related matters - $\n37,338\n in \n2022.\n \n  • A provision for a matter with the CPSC concerning the imposition of civil fines for allegedly failing to timely submit a report under the CPSA in relation to certain portable generators that were subject to a voluntary recall previously\n \n   announced on \n July 29, 2021 - \n$\n5,800\n in \n2023\n and $\n10,000\n in \n2022.\n \n \n\n\n\n\n \n(\n7\n)\nRepresents non-cash losses from changes in the fair value of the Company's investment in Wallbox warrants and equity securities.\n\n\n \n \n(\n8\n)\n \nRepresents fees paid to creditors and the write-off of the unamortized original issue discount and deferred financing costs in connection with the \n2024\n and \n2022\n credit agreement refinancings. Refer to Note \n12,\n “Credit Agreements,” to the consolidated financial statements of this Annual Report on Form \n10\n-K for further information on the losses on extinguishment of debt.\n\n\n\n\n \n\n\n\n\n\n\n51\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nThe following tables summarize additional financial information by reportable segment:\n\n\n \n\n\n\n\n \n \n \nAssets\n \n \n\n\n \n \n \nDecember 31,\n \n \n\n\n \n \n \n2024\n \n \n \n \n2023\n \n \n \n \n2022\n \n \n\n\n \nDomestic\n \n \n$\n3,873,904\n \n \n$\n3,770,883\n \n \n$\n4,032,086\n \n\n\n \nInternational\n \n \n \n1,235,427\n \n \n \n1,322,429\n \n \n \n1,137,376\n \n\n\n \nTotal\n \n \n$\n5,109,331\n \n \n$\n5,093,312\n \n \n$\n5,169,462\n \n\n\n\n\n\n\n \n\n\n\n\n \n \n \nDepreciation and Amortization\n \n \n\n\n \n \n \nYear Ended December 31,\n \n \n\n\n \n \n \n2024\n \n \n \n \n2023\n \n \n \n \n2022\n \n \n\n\n \nDomestic\n \n \n$\n135,434\n \n \n$\n129,648\n \n \n$\n123,768\n \n\n\n \nInternational\n \n \n \n36,334\n \n \n \n36,954\n \n \n \n32,373\n \n\n\n \nTotal\n \n \n$\n171,768\n \n \n$\n166,602\n \n \n$\n156,141\n \n\n\n\n\n\n\n \n\n\n\n\n \n \n \nCapital Expenditures\n \n \n\n\n \n \n \nYear Ended December 31,\n \n \n\n\n \n \n \n2024\n \n \n \n \n2023\n \n \n \n \n2022\n \n \n\n\n \nDomestic\n \n \n$\n117,836\n \n \n$\n103,036\n \n \n$\n69,680\n \n\n\n \nInternational\n \n \n \n18,897\n \n \n \n26,024\n \n \n \n16,508\n \n\n\n \nTotal\n \n \n$\n136,733\n \n \n$\n129,060\n \n \n$\n86,188\n \n\n\n\n\n\n\n \n\n\nThe Company’s sales in the United States represent approxim\nately \n79\n%, \n77\n%, and \n8\n0%\n of total sales for the years ended \n December 31, 2024, \n2023\n and \n2022\n, respectively. Approx\nimately \n76\n% and \n74\n% of the Company’s identifiable long-lived assets are located in the United States as of \n December 31, 2024 \nand \n2023,\n respectively.\n\n\n \n\n\n\n\n\n\n\n\n\n\n52\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n     \n  \n\n\n\n\n \n8.\n \n \nBalance Sheet Details\n \n \n\n\n\n\n \n\n\nInventories consist of the following:\n\n\n \n\n\n\n\n \n \n \nDecember 31,\n \n \n\n\n \n \n \n2024\n \n \n \n \n2023\n \n \n\n\n \nRaw material\n \n \n$\n611,735\n \n \n$\n677,428\n \n\n\n \nWork-in-process\n \n \n \n6,814\n \n \n \n10,877\n \n\n\n \nFinished goods\n \n \n \n413,098\n \n \n \n479,179\n \n\n\n \nTotal\n \n \n$\n1,031,647\n \n \n$\n1,167,484\n \n\n\n\n\n\n\n \n\n\nProperty and equipment consists of the following:\n\n\n \n\n\n\n\n \n \n \nDecember 31,\n \n \n\n\n \n \n \n2024\n \n \n \n \n2023\n \n \n\n\n \nLand and improvements\n \n \n$\n30,220\n \n \n$\n22,556\n \n\n\n \nBuildings and improvements\n \n \n \n358,055\n \n \n \n298,483\n \n\n\n \nMachinery and equipment\n \n \n \n296,409\n \n \n \n271,879\n \n\n\n \nDies and tools\n \n \n \n48,681\n \n \n \n45,998\n \n\n\n \nVehicles\n \n \n \n13,887\n \n \n \n11,411\n \n\n\n \nOffice & information technology equipment and internal use software\n \n \n \n213,003\n \n \n \n185,601\n \n\n\n \nLeasehold improvements\n \n \n \n9,776\n \n \n \n8,772\n \n\n\n \nConstruction in progress\n \n \n \n110,651\n \n \n \n98,083\n \n\n\n \nGross property and equipment\n \n \n \n1,080,682\n \n \n \n942,783\n \n\n\n \nAccumulated depreciation\n \n \n \n(\n390,659\n)\n \n \n(\n344,206\n)\n\n\n \nTotal\n \n \n$\n690,023\n \n \n$\n598,577\n \n\n\n\n\n\n\n \n\n\nTotal property and equipment included finance leases of $\n61,214\n and $\n68,079\n as of \n December 31, 2024 \nand \n2023,\n respectively, primarily comprised of buildings and improvements. Amortization of finance lease right of use assets is recorded within depreciation expense in the consolidated statements of comprehensive income. The initial measurement of new finance lease right of use assets is accounted for as a non-cash item in the consolidated statements of cash flows. Similarly, the buyout of finance lease obligations is accounted for as a non-cash exchange of the ROU asset for the underlying leased asset. In \n2024,\n the Company purchased the property under lease from a related party previously determined to be an arm’s length transaction. Refer to Note \n10,\n “Leases,” to the consolidated financial statements of this Annual Report on Form \n10\n-K for further information regarding the Company’s accounting for leases under ASC \n842,\n \nLeases.\n\n\n \n\n\n\n\n\n\n\n\n\n\n53\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n     \n  \n\n\n\n\n \n9.\n \n \nGoodwill and Intangible Assets\n \n \n\n\n\n\n \n\n\nThe changes in the carrying amount of goodwill by reportable segment for the years ended \n December 31, 2024 \nand \n2023\n are as follows:\n\n\n \n\n\n\n\n \n \n \nDomestic\n \n \n \n \nInternational\n \n \n \n \nTotal\n \n \n\n\n \nBalance as of December 31, 2022\n \n \n$\n1,016,657\n \n \n$\n384,223\n \n \n$\n1,400,880\n \n\n\n \nAcquisitions of businesses, net\n \n \n \n1,376\n \n \n \n5,363\n \n \n \n6,739\n \n\n\n \nForeign currency translation rate changes\n \n \n \n495\n \n \n \n24,270\n \n \n \n24,765\n \n\n\n \nBalance as of December 31, 2023\n \n \n \n1,018,528\n \n \n \n413,856\n \n \n \n1,432,384\n \n\n\n \nAcquisitions of businesses, net\n \n \n \n22,641\n \n \n \n-\n \n \n \n22,641\n \n\n\n \nForeign currency translation rate changes\n \n \n \n(\n22\n)\n \n \n(\n18,742\n)\n \n \n(\n18,764\n)\n\n\n \nBalance as of December 31, 2024\n \n \n$\n1,041,147\n \n \n$\n395,114\n \n \n$\n1,436,261\n \n\n\n\n\n\n\n \n\n\nRefer to Note \n3,\n “Acquisitions,” to the consolidated financial statements of this Annual Report on Form \n10\n-K for further information regarding the Company’s acquisitions.\n\n\n \n\n\nGoodwill applicable to each reportable segment as of \n December 31, 2024 \nand \n2023\n is as follows:\n\n\n \n\n\n\n\n \n \n \nYear Ended December 31, 2024\n \n \n \n \nYear Ended December 31, 2023\n \n \n\n\n \n \n \nGross\n \n \n \n \nAccumulated Impairment\n \n \n \n \nNet\n \n \n \n \nGross\n \n \n \n \nAccumulated Impairment\n \n \n \n \nNet\n \n \n\n\n \nDomestic\n \n \n$\n1,544,340\n \n \n$\n(\n503,193\n)\n \n$\n1,041,147\n \n \n$\n1,521,721\n \n \n$\n(\n503,193\n)\n \n$\n1,018,528\n \n\n\n \nInternational\n \n \n \n399,725\n \n \n \n(\n4,611\n)\n \n \n395,114\n \n \n \n418,467\n \n \n \n(\n4,611\n)\n \n \n413,856\n \n\n\n \nTotal\n \n \n$\n1,944,065\n \n \n$\n(\n507,804\n)\n \n$\n1,436,261\n \n \n$\n1,940,188\n \n \n$\n(\n507,804\n)\n \n$\n1,432,384\n \n\n\n\n\n\n\n \n\n\nThe following table summarizes intangible assets by major category as of \n December 31, 2024 \nand \n2023\n:\n\n\n \n\n\n\n\n \n \n \n \n \n \n \nDecember 31, 2024\n \n \n \n \nDecember 31, 2023\n \n \n\n\n \n \n \nWeighted Average Amortization Years\n \n \n \n \nGross\n \n \n \n \nAccumulated Amortization\n \n \n \n \nNet Book Value\n \n \n \n \nGross\n \n \n \n \nAccumulated Amortization\n \n \n \n \nNet Book Value\n \n \n\n\n \nFinite-lived intangible assets:\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n \nTradenames\n \n \n \n15\n \n \n$\n160,473\n \n \n$\n(\n81,083\n)\n \n$\n79,390\n \n \n$\n159,671\n \n \n$\n(\n70,997\n)\n \n$\n88,674\n \n\n\n \nCustomer lists\n \n \n \n12\n \n \n \n591,745\n \n \n \n(\n439,008\n)\n \n \n152,737\n \n \n \n589,318\n \n \n \n(\n404,805\n)\n \n \n184,513\n \n\n\n \nPatents and technology\n \n \n \n14\n \n \n \n673,425\n \n \n \n(\n294,330\n)\n \n \n379,095\n \n \n \n670,099\n \n \n \n(\n252,658\n)\n \n \n417,441\n \n\n\n \nSoftware\n \n \n \n-\n \n \n \n1,046\n \n \n \n(\n1,046\n)\n \n \n-\n \n \n \n1,046\n \n \n \n(\n1,046\n)\n \n \n-\n \n\n\n \nNon-compete/other\n \n \n \n5\n \n \n \n76,251\n \n \n \n(\n56,225\n)\n \n \n20,026\n \n \n \n71,570\n \n \n \n(\n44,443\n)\n \n \n27,127\n \n\n\n \nTotal finite-lived intangible assets\n \n \n \n \n \n \n$\n1,502,940\n \n \n$\n(\n871,692\n)\n \n$\n631,248\n \n \n$\n1,491,704\n \n \n$\n(\n773,949\n)\n \n$\n717,755\n \n\n\n \nIndefinite-lived tradenames\n \n \n \n \n \n \n \n127,274\n \n \n \n-\n \n \n \n127,274\n \n \n \n128,321\n \n \n \n-\n \n \n \n128,321\n \n\n\n \nTotal intangible assets\n \n \n \n \n \n \n$\n1,630,214\n \n \n$\n(\n871,692\n)\n \n$\n758,522\n \n \n$\n1,620,025\n \n \n$\n(\n773,949\n)\n \n$\n846,076\n \n\n\n\n\n\n\n \n\n\nAmortization expense of intangible assets was $\n97,743\n, $\n104,194\n, and $\n103,320\n in \n2024\n, \n2023\n and \n2022\n, respectively. Excluding the impact of future acquisitions or divestitures, the Company estimates amortization expense for the next \nfive\n years to be as follows: \n2025\n - \n$93,975;\n \n2026\n - \n$87,236;\n \n2027\n - \n$60,387;\n \n2028\n - \n$53,620;\n \n2029\n - $\n50,234\n.\n\n\n \n\n\n\n\n\n\n\n\n\n\n54\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n     \n  \n\n\n\n\n \n10.\n \n \nLeases\n \n\n\n\n\n \n\n\nThe Company leases certain manufacturing facilities, distribution centers, office space, warehouses, automobiles, machinery and computer equipment globally under both finance and operating leases. The Company’s leases have remaining lease terms of up to approximately \n16\n years, of which certain leases, primarily within the buildings and improvements asset class, include options to extend for up to \n10\n additional years. \n\n\n \n\n\nThe Company determines if an arrangement is or contains a lease at contract inception. The Company recognizes a right of use (ROU) asset and lease liability at the lease commencement date based on the present value of the lease payments over the lease term. As the Company’s leases generally do \nnot\n provide an implicit interest rate, the incremental borrowing rate is used to determine the present value of lease payments. The incremental borrowing rate is a collateralized rate determined based on the lease term, the Company’s credit rating, and other market information available at the commencement date. The ROU asset also includes any lease payments made prior to the commencement date and is reduced by any lease incentives. The lease term \n may \ninclude options to extend or terminate the lease when it is reasonably certain that the Company will exercise that option. Lease expense for operating leases is recognized on a straight-line basis over the lease term, while lease expense for finance leases is recognized as depreciation and interest expense using the effective interest method. The Company’s variable lease expense generally consists of property tax and insurance payments that are variable in nature, however, these amounts are immaterial to the consolidated financial statements and are therefore \nnot\n separately reported.\n\n\n \n\n\nThe Company has lease agreements with both lease and non-lease components, which it elected to account for as a single lease component. However, the Company did \nnot\n elect to apply the recognition exception for short-term leases. The Company is applying these elections to all asset classes.\n\n\n \n\n\nThe Company is a lessor of certain of its C&I mobile products as part of a rental fleet, as well as \nthree\n of its buildings that it leases to \nthird\n parties. The lease income related to these arrangements is \nnot\n material to the consolidated financial statements.\n\n\n \n\n\nThe Company records its operating lease cost and amortization of finance lease ROU assets within cost of goods sold or operating expenses in the consolidated statements of comprehensive income depending on the cost center of the underlying asset. The Company records its finance lease interest cost within interest expense in the consolidated statements of comprehensive income.\n\n\n \n\n\nThe components of total lease cost consist of the following:\n\n\n \n\n\n\n\n \n \n \nYear Ended December 31,\n \n \n\n\n \n \n \n2024\n \n \n \n \n2023\n \n \n \n \n2022\n \n \n\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n \nOperating lease cost\n \n \n$\n46,887\n \n \n$\n38,980\n \n \n$\n36,292\n \n\n\n \nFinance lease cost:\n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n \nAmortization of ROU assets\n \n \n \n7,639\n \n \n \n4,142\n \n \n \n3,298\n \n\n\n \nInterest on lease liabilities\n \n \n \n5,323\n \n \n \n2,540\n \n \n \n1,945\n \n\n\n \nTotal lease cost\n \n \n$\n59,849\n \n \n$\n45,662\n \n \n$\n41,535\n \n\n\n\n\n\n\n \n\n\nSupplemental balance sheet information related to the Company’s leases is as follows:\n\n\n \n\n\n\n\n \n \n \nDecember 31,\n \n \n\n\n \n \n \n2024\n \n \n \n \n2023\n \n \n\n\n \nOperating leases:\n \n \n \n \n \n \n \n \n \n\n\n \nOperating lease ROU assets\n (1)\n \n \n$\n57,999\n \n \n$\n70,937\n \n\n\n \n \n \n \n \n \n \n \n \n\n\n \nOperating lease liabilities - current\n (2)\n \n \n \n29,316\n \n \n \n29,388\n \n\n\n \nOperating lease liabilities - noncurrent\n (3)\n \n \n \n29,173\n \n \n \n44,760\n \n\n\n \nTotal operating lease liabilities\n \n \n \n58,489\n \n \n \n74,148\n \n\n\n \n \n \n \n \n \n \n \n \n\n\n \nFinance leases:\n \n \n \n \n \n \n \n \n \n\n\n \nFinance lease ROU assets, gross\n \n \n \n78,801\n \n \n \n82,744\n \n\n\n \nAccumulated depreciation - finance lease ROU assets\n \n \n \n(\n17,587\n)\n \n \n(\n14,665\n)\n\n\n \nFinance lease ROU assets, net\n (4)\n \n \n \n61,214\n \n \n \n68,079\n \n\n\n \n \n \n \n \n \n \n \n \n\n\n \nFinance lease liabilities - current\n (5)\n \n \n \n6,845\n \n \n \n3,785\n \n\n\n \nFinance lease liabilities - noncurrent\n (6)\n \n \n \n59,510\n \n \n \n67,523\n \n\n\n \nTotal finance lease liabilities\n \n \n$\n66,355\n \n \n$\n71,308\n \n\n\n\n\n\n\n \n\n\n \n \n(\n1\n)\n \n \nRecorded in the operating lease and other assets line within the consolidated balance sheets\n \n\n\n\n\n \n \n(\n2\n)\n \n \nRecorded in the other accrued liabilities line within the consolidated balance sheets\n \n\n\n\n\n \n \n(\n3\n)\n \n \nRecorded in the operating lease and other long-term liabilities line within the consolidated balance sheets\n \n\n\n\n\n \n \n(\n4\n)\n \n \nRecorded in the property and equipment, net line within the consolidated balance sheets\n \n\n\n\n\n \n \n(\n5\n)\n \n \nRecorded in the current portion of long-term borrowings and finance lease obligations line within the consolidated balance sheets\n \n\n\n\n\n \n \n(\n6\n)\n \n \nRecorded in the long-term borrowings and finance lease obligations line within the consolidated balance sheets\n \n\n\n\n\n \n\n\nSupplemental cash flow information related to the Company’s leases is as follows:\n\n\n \n\n\n\n\n\n\n55\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n \n \n \nYear Ended December 31,\n \n \n\n\n \n \n \n2024\n \n \n \n \n2023\n \n \n \n \n2022\n \n \n\n\n \nCash paid for amounts included in the measurement of lease liabilities\n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n \nOperating cash flows - operating leases\n \n \n$\n48,089\n \n \n$\n39,073\n \n \n$\n36,020\n \n\n\n \nOperating cash flows - finance leases\n \n \n \n4,924\n \n \n \n2,409\n \n \n \n1,919\n \n\n\n \nFinancing cash flows - finance leases\n \n \n \n45,906\n \n \n \n3,618\n \n \n \n4,931\n \n\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n \nROU assets obtained in exchange for lease liabilities\n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n \nOperating leases\n \n \n$\n41,389\n \n \n$\n17,830\n \n \n$\n28,766\n \n\n\n \nFinance leases\n \n \n \n43,799\n \n \n \n47,715\n \n \n \n2,874\n \n\n\n\n\n\n\n \n\n\nWeighted average remaining lease term and discount rate information related to the Company’s leases as of \n December 31, 2024 \nand \n2023\n is as follows:\n\n\n \n\n\n\n\n \n \n \nDecember 31, \n \n \n\n\n \n \n \n2024\n \n \n \n \n2023\n \n \n\n\n \nWeighted average remaining lease term (in years)\n \n \n \n \n \n \n \n \n \n\n\n \nOperating Leases\n \n \n \n4.27\n \n \n \n4.55\n \n\n\n \nFinance Leases\n \n \n \n8.92\n \n \n \n5.34\n \n\n\n \n \n \n \n \n \n \n \n \n\n\n \nWeighted average discount rate\n \n \n \n \n \n \n \n \n \n\n\n \nOperating Leases\n \n \n \n6.03\n%\n \n \n4.63\n%\n\n\n \nFinance Leases\n \n \n \n7.03\n%\n \n \n6.64\n%\n\n\n\n\n\n\n \n\n\nThe maturities of the Company’s lease liabilities as of \n December 31, 2024, \nare as follows:\n\n\n \n\n\n\n\n \n \n \nFinance Leases\n \n \n \n \nOperating Leases\n \n \n\n\n \n2025\n \n \n$\n11,118\n \n \n$\n31,427\n \n\n\n \n2026\n \n \n \n10,395\n \n \n \n7,963\n \n\n\n \n2027\n \n \n \n10,156\n \n \n \n7,205\n \n\n\n \n2028\n \n \n \n9,593\n \n \n \n5,712\n \n\n\n \n2029\n \n \n \n8,327\n \n \n \n4,035\n \n\n\n \nAfter 2029\n \n \n \n41,520\n \n \n \n11,211\n \n\n\n \nTotal minimum lease payments\n \n \n \n91,109\n \n \n \n67,553\n \n\n\n \nInterest component\n \n \n \n(\n24,754\n)\n \n \n(\n9,064\n)\n\n\n \nPresent value of minimum lease payments\n \n \n$\n66,355\n \n \n$\n58,489\n \n\n\n\n\n\n\n \n\n\n\n\n\n\n56\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n     \n  \n\n\n\n\n \n11.\n \n \nProduct Warranty Obligations\n \n\n\n\n\n \n\n\nThe Company records a liability for standard product warranty obligations accounted for as assurance warranties at the time of sale of the related product to a customer based on historical warranty experience. The Company also records a liability for specific warranty matters when they become known and are reasonably estimable. The following is a tabular reconciliation of the Company’s standard product warranty liability accounted for as an assurance warranty:\n\n\n \n\n\n\n\n \n \n \nYear Ended December 31,\n \n \n\n\n \n \n \n2024\n \n \n \n \n2023\n \n \n \n \n2022\n \n \n\n\n \nBalance at beginning of period\n \n \n$\n116,408\n \n \n$\n138,011\n \n \n$\n94,213\n \n\n\n \nPayments\n \n \n \n(\n88,990\n)\n \n \n(\n92,200\n)\n \n \n(\n77,476\n)\n\n\n \nProvision for warranty issued\n \n \n \n77,802\n \n \n \n67,104\n \n \n \n80,340\n \n\n\n \nChanges in estimates for pre-existing warranties (1)\n \n \n \n5,767\n \n \n \n3,493\n \n \n \n40,934\n \n\n\n \nBalance at end of period\n \n \n$\n110,987\n \n \n$\n116,408\n \n \n$\n138,011\n \n\n\n\n\n\n\n \n\n\n(\n1\n)\nIncludes a specific warranty provision of $\n37,338\n recorded during the \nthird\n quarter of \n2022\n to address certain clean energy product warranty related matters. \n\n\n\n\n \n\n\nThe Company also sells extended warranty coverage for certain products, which it accounts for as a service warranty. The sales of extended warranties are recorded as deferred revenue, and typically have a duration of \nfive\n to \nten\n years. The deferred revenue related to extended warranty coverage is amortized over the duration of the extended warranty contract period, following the standard warranty period, using the straight-line method. The Company believes the straight-line method is appropriate because the performance obligation is satisfied based on the passage of time. The amortization of deferred revenue is recorded to net sales in the consolidated statements of comprehensive income. The following is a tabular reconciliation of the deferred revenue related to extended warranty coverage:\n\n\n \n\n\n\n\n \n \n \nYear Ended December 31,\n \n \n\n\n \n \n \n2024\n \n \n \n \n2023\n \n \n \n \n2022\n \n \n\n\n \nBalance at beginning of period\n \n \n$\n155,870\n \n \n$\n132,813\n \n \n$\n111,647\n \n\n\n \nDeferred revenue contracts issued\n \n \n \n60,651\n \n \n \n48,107\n \n \n \n42,869\n \n\n\n \nAmortization of deferred revenue contracts\n \n \n \n(\n29,599\n)\n \n \n(\n25,050\n)\n \n \n(\n21,703\n)\n\n\n \nBalance at end of period\n \n \n$\n186,922\n \n \n$\n155,870\n \n \n$\n132,813\n \n\n\n\n\n\n\n \n\n\nThe timing of recognition of the Company’s deferred revenue balance related to extended warranties as of \n December 31, 2024\n is as follows:\n\n\n \n\n\n\n\n \n2025\n \n \n$\n34,069\n \n\n\n \n2026\n \n \n \n35,267\n \n\n\n \n2027\n \n \n \n32,315\n \n\n\n \n2028\n \n \n \n25,822\n \n\n\n \n2029\n \n \n \n19,897\n \n\n\n \nAfter \n2029\n \n \n \n39,552\n \n\n\n \nTotal\n \n \n$\n186,922\n \n\n\n\n\n\n\n \n\n\nThe Company has a post-sale extended warranty marketing agreement with a \nthird\n party, pursuant to which the Company is required to pay fees to the \nthird\n-party service provider based on the number of extended warranty contracts the provider sells, which it classifies as costs to obtain a contract. These fees are deferred and recorded as other assets in the consolidated balance sheets, and are then amortized to net sales in the consolidated statements of comprehensive income over the same period that the underlying deferred revenue is recognized. Deferred contract costs as of \n December 31, 2024 \nand \n2023\n were $\n17,140\n and $\n10,153\n, re\nspectively. Amortization of deferred contract costs recorded during the years ended \n December 31, 2024, \n2023\n and \n2022\n w\nas $\n2,958\n, $\n2,306\n, and $\n1,932\n, r\nespectively.\n\n\n \n\n\nStandard product warranty obligations and extended warranty related deferred revenues are included in the consolidated balance sheets as follows:\n\n\n \n\n\n\n\n \n \n \nDecember 31,\n \n \n\n\n \n \n \n2024\n \n \n \n \n2023\n \n \n\n\n \nProduct warranty liability:\n \n \n \n \n \n \n \n \n \n\n\n \nCurrent portion - Accrued product warranty\n \n \n$\n56,127\n \n \n$\n65,298\n \n\n\n \nLong-term portion - other long-term liabilities\n \n \n \n54,860\n \n \n \n51,110\n \n\n\n \nTotal\n \n \n$\n110,987\n \n \n$\n116,408\n \n\n\n \n \n \n \n \n \n \n \n \n\n\n \nDeferred revenue related to extended warranties:\n \n \n \n \n \n \n \n \n \n\n\n \nCurrent portion - other accrued liabilities\n \n \n$\n34,069\n \n \n$\n28,203\n \n\n\n \nLong-term portion - Deferred revenue\n \n \n \n152,853\n \n \n \n127,667\n \n\n\n \nTotal\n \n \n$\n186,922\n \n \n$\n155,870\n \n\n\n\n\n\n\n \n\n\n\n\n\n\n57\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n     \n  \n\n\n\n\n \n12.\n \n \nCredit Agreements\n \n\n\n\n\n \n\n\nShort-term borrowings included in the consolidated balance sheets as of \n December 31, 2024, \nand \n December 31, 2023, \nconsisted of borrowings by the Company’s foreign subsidiaries on local lines of credit totaling $\n55,848\n and $\n81,769\n, respectively. As of \n December 31, 2024, \nand \n December 31, 2023, \nthe weighted-average interest rates on the short-term borrowings were \n5.44\n% and \n6.54\n%, respectively. \n\n\n \n\n\nLong-term borrowings are included in the consolidated balance sheets as follows:\n\n\n \n\n\n\n\n \n \n \nDecember 31,\n \n \n\n\n \n \n \n2024\n \n \n \n \n2023\n \n \n\n\n \nTranche A Term Loan\n \n \n$\n712,500\n \n \n$\n745,313\n \n\n\n \nTranche B Term Loan\n \n \n \n498,750\n \n \n \n530,000\n \n\n\n \nOriginal issue discount and deferred financing costs\n \n \n \n(\n8,203\n)\n \n \n(\n12,685\n)\n\n\n \nRevolving Facility\n \n \n \n-\n \n \n \n150,000\n \n\n\n \nFinance lease obligation\n \n \n \n66,355\n \n \n \n71,308\n \n\n\n \nOther\n \n \n \n8,972\n \n \n \n9,512\n \n\n\n \nTotal\n \n \n \n1,278,374\n \n \n \n1,493,448\n \n\n\n \nLess: current portion of debt\n \n \n \n60,753\n \n \n \n42,110\n \n\n\n \nLess: current portion of \nfinance lease obligation\n \n \n \n6,845\n \n \n \n3,785\n \n\n\n \nTotal long-term borrowings and finance lease obligations\n \n \n$\n1,210,776\n \n \n$\n1,447,553\n \n\n\n\n\n\n\n \n\n\nBoth the Tranche A Term Loan Facility and Revolving Facility mature on \n June 29, 2027. \nThe Tranche A Term Loan Facility is repayable in quarterly installments commencing \n September 2023, \nwith a balloon payment due \n June 2027. \nThe Tranche B Term Loan Facility matures on \n July 3, 2031, \nand is repayable in quarterly installments commencing \n September 2024, \nwith a balloon payment due \n July 2031. \nMaturities of the Company's Tranche A Term Loan Facility, Tranche B Term Loan Facility, and Revolving Facility outstanding on \n December 31, 2024, \nbefore considering original issue discount and deferred financing costs, are as follows:\n\n\n \n\n\n\n\n \n \n \nTranche A Term Loan Facility\n \n \n \n \nTranche B Term Loan Facility\n \n \n \n \nRevolving Facility\n \n \n \n \nTotal\n \n \n\n\n \n2025\n \n \n$\n46,875\n \n \n$\n5,000\n \n \n$\n-\n \n \n$\n51,875\n \n\n\n \n2026\n \n \n \n65,625\n \n \n \n5,000\n \n \n \n-\n \n \n \n70,625\n \n\n\n \n2027\n \n \n \n600,000\n \n \n \n5,000\n \n \n \n-\n \n \n \n605,000\n \n\n\n \n2028\n \n \n \n-\n \n \n \n5,000\n \n \n \n-\n \n \n \n5,000\n \n\n\n \n2029\n \n \n \n-\n \n \n \n5,000\n \n \n \n-\n \n \n \n5,000\n \n\n\n \n2030\n \n \n \n-\n \n \n \n5,000\n \n \n \n-\n \n \n \n5,000\n \n\n\n \n2031\n \n \n \n-\n \n \n \n468,750\n \n \n \n-\n \n \n \n468,750\n \n\n\n \nTotal\n \n \n$\n712,500\n \n \n$\n498,750\n \n \n$\n-\n \n \n$\n1,211,250\n \n\n\n\n\n\n\n \n\n\n\n\n\n\n58\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nPrior to \n June 2022, \nthe Company’s credit agreements provided for a $\n1,200,000\n Tranche B Term Loan Facility (Original Term Loan B Facility) and included a $\n300,000\n uncommitted incremental term loan on that facility. After several amendments, the Original Term Loan B Facility bore interest at rates based on either a base rate plus an applicable margin of \n0.75\n% or adjusted SOFR rate plus an applicable margin of \n1.75\n%, subject to a SOFR floor of \n0.0\n%, and was scheduled to mature on \n December 13, 2026. \nThe Company’s credit agreements also provided for a senior secured ABL revolving credit facility (ABL Facility). ABL Facility borrowings initially bore interest at rates based on either a base rate plus an applicable margin of \n1.00\n% or adjusted LIBOR rate plus an applicable margin of \n2.00\n%, in each case, subject to adjustments based on average availability under the ABL Facility. \n\n\n \n\n\nIn \n June 2022, \nthe Company amended and restated its existing credit agreements (Amended Credit Agreement) that resulted in a new term loan facility in an aggregate principal amount of $\n750,000\n (Tranche A Term Loan Facility), established a new $\n1,250,000\n revolving facility (Revolving Facility), terminated the former ABL Facility, and replaced all LIBOR provisions with SOFR provisions. Proceeds received by the Company from the Tranche A Term Loan Facility were used to retire the Company's former ABL Facility and to make a $\n250,000\n voluntary prepayment on the original Term Loan B Facility, with the remaining funds used for future general corporate purposes. As a result of these prepayments, the Company wrote off $\n3,546\n of original issue discount and deferred financing costs during the \nsecond\n quarter of \n2022\n as a loss on extinguishment of debt. Additionally, in accordance with ASC \n470\n-\n50,\n the Company capitalized $\n10,330\n of fees paid to creditors as deferred financing costs on long-term borrowings and expensed $\n800\n of transaction fees. The Company evaluated on a lender-by-lender basis if the debt related to returning lenders on the Revolving Facility was significantly modified or \nnot,\n resulting in the write-off of $\n197\n unamortized deferred financing costs related to the former ABL Facility as a loss on extinguishment of debt.\n\n\n \n\n\nDuring \n2022,\n the Tranche A Term Loan Facility and the Revolving Facility bore interest at a rate based on adjusted SOFR plus an applicable margin of \n1.5\n% through \n December 31, 2022, \nsubject to a SOFR floor of \n0.0\n%. Beginning on \n January 1, 2023, \nthe Tranche A Term Loan Facility and the Revolving Facility bear interest at a rate based on adjusted SOFR plus an applicable margin between \n1.25\n% and \n1.75\n%, based on the Company's total leverage ratio and subject to a SOFR floor of \n0.0\n%. As of \n December 31, 2024, \nthe interest rates for the Tranche A Term Loan Facility and Revolving Facility are \n6.15\n% and \n6.19\n%, respectively.\n\n\n \n\n\nIn \n July 2024, \nthe Company extinguished the $\n530,000\n balance then outstanding under the former Tranche B Term Loan Facility and replaced it with a new $\n500,000\n Tranche B Term Loan Facility maturing on \n July 3, 2031. \nThe new Tranche B Term Loan Facility continues to include a $\n300,000\n uncommitted incremental term loan on that facility. In accordance with ASC \n470\n-\n50,\n the Company capitalized $\n2,991\n of debt issuance costs. Additionally, the Company wrote-off $\n4,236\n of unamortized deferred financing costs related to the former Tranche B Term Loan Facility and expensed $\n625\n of fees paid to creditors as a loss on extinguishment of debt. The new Tranche B Term Loan Facility bears interest at the adjusted SOFR rate plus an applicable margin of \n1.75\n%, subject to a SOFR floor of \n0.0\n%. As of \n December 31, 2024, \nthe interest rate for the Tranche B Term Loan Facility is \n6.34\n%.\n\n\n \n\n\nThe Tranche A Term Loan Facility and the Revolving Facility contain certain financial covenants that require the Company to maintain a total leverage ratio below \n3.75\n to \n1.00,\n an interest coverage ratio above \n3.00\n to \n1.00,\n and \n may \nrequire an excess cash flow payment. As of \n December 31, 2024, \nthe Company’s total leverage ratio was \n1.33\n to \n1.00,\n and the Company's interest coverage ratio was \n10.03\n to \n1.00.\n The Company also was \nnot\n required to make an excess cash flow payment as of \n December 31, 2024. \nThe Company was also in compliance with all other covenants of the Amended Credit Agreement as of \n December 31, 2024.\n\n\n \n\n\nThe Tranche B Term Loan Facility, Tranche A Term Loan Facility and Revolving Facility are guaranteed by substantially all of the Company’s wholly-owned domestic restricted subsidiaries and are secured by associated collateral agreements which pledge a \nfirst\n priority lien on virtually all of the Company’s assets, including fixed assets and intangibles, cash, trade accounts receivable, inventory, and other current assets and proceeds thereof. \n\n\n \n\n\nAs of \n December 31, 2024, \nthere were \nno\n borrowings under the Revolving Facility, leaving $\n1,249,203\n of unused capacity, net of outstanding letters of credit. \n\n\n \n\n\n\n\n\n\n59\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n     \n  \n\n\n\n\n \n13.\n \n \nStock Repurchase Programs\n \n\n\n\n\n \n\n\nIn \n July \n2022,\n the Company's Board approved a stock repurchase program, which commenced on \n August 5, 2022, \nand allowed for the repurchase of up to $\n500,000\n of the Company's common stock over a \n24\n-month period. Additionally, on \n February 12, 2024, \nthe Company’s Board approved a new stock repurchase program that authorizes repurchases of up to $\n500,000\n of the Company’s common stock over the following \n24\n months. The new program replaced the prior share repurchase program, which had $\n26,297\n remaining available for repurchase when the new program was approved. Pursuant to the approved program, the Company \n may \nrepurchase its common stock from time to time, in amounts and at prices the Company deems appropriate, subject to market conditions and other considerations. The repurchases \n may \nbe executed using a combination of Rule \n10b5\n-\n1\n trading plans, open market purchases, privately negotiated agreements, or other transactions. The actual timing, number and value of shares repurchased under the program will be determined by management at its discretion and in compliance with the terms of the Company's credit agreements. The repurchases \n may \nbe funded with cash on hand, available borrowings, or proceeds from potential debt or other capital markets sources. The stock repurchase program \n may \nbe suspended or discontinued at any time without prior notice. As of \n December 31, 2024, \nthe remaining unused buyback authorization was $\n347,257\n. \n\n\n \n\n\nDuring the year ended \n December 31, 2024, \nthe Company repurchased \n1,046,351\n shares of its common stock for $\n152,743\n. During the year ended \n December 31, 2023, \nthe Company repurchased\n2,188,475\n \nshares of its common stock for \n$\n251,513\n. \nDuring the year ended \n December 31, 2022, \nthe Company repurchased \n2,722,007\n \nshares of its common stock for $\n345,840\n. The Company has periodically reissued shares out of Treasury stock, including for acquisition contingent consideration payments.\n\n\n \n\n\n\n\n\n\n\n\n\n\n60\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n     \n  \n\n\n\n\n \n14.\n \n \nEarnings Per Share\n \n\n\n\n\n \n\n\nBasic earnings per share is calculated by dividing net income attributable to the common shareholders of the Company by the weighted average number of common shares outstanding during the period, exclusive of restricted shares. Except where the result would be anti-dilutive, diluted earnings per share is calculated by assuming the vesting of unvested restricted stock and the exercise of stock options, as well as the satisfaction of certain conditions related to acquisition contingent consideration as of the end of the period. Refer to Note \n4,\n “Redeemable Noncontrolling Interest,” to the consolidated financial statements of this Annual Report on Form \n10\n-K for further information regarding the accounting for redeemable noncontrolling interests within earnings per share.\n\n\n \n\n\nThe following table reconciles the numerator and the denominator used to calculate basic and diluted earnings per share:\n\n\n \n\n\n\n\n \n \n \nYear Ended December 31,\n \n \n\n\n \n \n \n2024\n \n \n \n \n2023\n \n \n \n \n2022\n \n \n\n\n \nNumerator\n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n \nNet income attributable to Generac Holdings Inc.\n \n \n$\n316,315\n \n \n$\n214,606\n \n \n$\n399,502\n \n\n\n \nRedemption value adjustment\n \n \n \n8,941\n \n \n \n(\n11,517\n)\n \n \n(\n49,235\n)\n\n\n \nNet income attributable to common shareholders\n \n \n$\n325,256\n \n \n$\n203,089\n \n \n$\n350,267\n \n\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n \nDenominator\n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n \nWeighted average shares, basic\n \n \n \n59,559,797\n \n \n \n61,265,060\n \n \n \n63,117,007\n \n\n\n \nDilutive effect of stock compensation awards (1)\n \n \n \n790,615\n \n \n \n793,327\n \n \n \n1,087,219\n \n\n\n \nDilutive effect of contingently issued shares\n \n \n \n-\n \n \n \n-\n \n \n \n477,131\n \n\n\n \nDiluted shares\n \n \n \n60,350,412\n \n \n \n62,058,387\n \n \n \n64,681,357\n \n\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n \nNet income attributable to common shareholders per share\n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n \nBasic\n \n \n$\n5.46\n \n \n$\n3.31\n \n \n$\n5.55\n \n\n\n \nDiluted\n \n \n$\n5.39\n \n \n$\n3.27\n \n \n$\n5.42\n \n\n\n\n\n\n\n \n\n\n \n \n(\n1\n)\n \n \nFor the years ended \n December 31, 2024, \n December 31, 2023, \nand \n December 31, 2022, \nexcludes approximately \n428,000\n, \n348,000\n and \n76,000\n st\nock options and restricted stock awards, respectively, as the impact of such awards was anti-dilutive. \n \n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n61\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n     \n  \n\n\n\n\n \n15.\n \n \nIncome Taxes\n \n\n\n\n\n \n\n\nThe Company’s provision for income taxes consists of the following:\n\n\n \n\n\n\n\n \n \n \nYear Ended December 31,\n \n \n\n\n \n \n \n2024\n \n \n \n \n2023\n \n \n \n \n2022\n \n \n\n\n \nCurrent:\n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n \nFederal\n \n \n$\n117,749\n \n \n$\n71,741\n \n \n$\n118,320\n \n\n\n \nState\n \n \n \n20,970\n \n \n \n13,802\n \n \n \n25,743\n \n\n\n \nForeign\n \n \n \n14,356\n \n \n \n22,115\n \n \n \n51,055\n \n\n\n \n \n \n153,075\n \n \n \n107,658\n \n \n \n195,118\n \n\n\n \nDeferred:\n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n \nFederal\n \n \n \n(\n46,526\n)\n \n \n(\n26,504\n)\n \n \n(\n43,475\n)\n\n\n \nState\n \n \n \n(\n8,613\n)\n \n \n(\n5,254\n)\n \n \n(\n10,966\n)\n\n\n \nForeign\n \n \n \n(\n5,565\n)\n \n \n(\n3,218\n)\n \n \n(\n40,109\n)\n\n\n \n \n \n(\n60,704\n)\n \n \n(\n34,976\n)\n \n \n(\n94,550\n)\n\n\n \nChange in valuation allowance\n \n \n \n89\n \n \n \n498\n \n \n \n(\n972\n)\n\n\n \nProvision for income taxes\n \n \n$\n92,460\n \n \n$\n73,180\n \n \n$\n99,596\n \n\n\n\n\n\n\n \n\n\nThe Company files U.S. federal, U.S. state and foreign jurisdiction tax returns which are subject to examination up to the expiration of the statute of limitations. The Company believes the tax positions taken on its returns would be sustained upon an exam, or where a position is uncertain, adequate reserves have been recorded. As of \n December 31, 2024\n, the Company is \nno\n longer subject to income tax examinations for United States federal income taxes for tax years prior to \n2021.\n Due to the carryforward of net operating losses and research & development credits, the Company’s Wisconsin state income tax returns for tax years \n2007\n through \n2023\n remain open for potential examination. In addition, the Company is subject to audit by various foreign taxing jurisdictions for tax years \n2013\n through \n2023.\n\n\n \n\n\nThe Company is regularly under tax return examination by tax authorities in the various jurisdictions in which we operate. The Company is actively managing the examinations and working to address any open matters. While the Company does \nnot\n believe any material taxes or penalties are due, there is a possibility that the ultimate tax outcome of an examination \n may \nresult in differences from what was recorded. Such differences \n may \naffect the provision for income taxes in the period in which the determination is made and could impact the Company’s financial results.\n\n\n \n\n\nSignificant components of deferred tax assets and liabilities are as follows:\n\n\n \n\n\n\n\n \n \n \nDecember 31,\n \n \n\n\n \n \n \n2024\n \n \n \n \n2023\n \n \n\n\n \nDeferred tax assets:\n \n \n \n \n \n \n \n \n \n\n\n \nAccrued expenses\n \n \n$\n52,351\n \n \n$\n48,758\n \n\n\n \nDeferred revenue\n \n \n \n43,261\n \n \n \n36,927\n \n\n\n \nInventories\n \n \n \n14,103\n \n \n \n12,549\n \n\n\n \nStock-based compensation\n \n \n \n16,959\n \n \n \n14,143\n \n\n\n \nOperating loss and credit carryforwards\n \n \n \n50,327\n \n \n \n54,753\n \n\n\n \nBad debt\n \n \n \n1,803\n \n \n \n1,380\n \n\n\n \nOther\n \n \n \n13,031\n \n \n \n8,722\n \n\n\n \nCapitalized R&D\n \n \n \n98,323\n \n \n \n65,523\n \n\n\n \nValuation allowance\n \n \n \n(\n5,225\n)\n \n \n(\n5,136\n)\n\n\n \nTotal deferred tax assets\n \n \n \n284,933\n \n \n \n237,619\n \n\n\n \n \n \n \n \n \n \n \n \n\n\n \nDeferred tax liabilities:\n \n \n \n \n \n \n \n \n \n\n\n \nGoodwill and intangible assets\n \n \n \n234,271\n \n \n \n253,342\n \n\n\n \nDepreciation\n \n \n \n49,935\n \n \n \n45,964\n \n\n\n \nDebt refinancing costs\n \n \n \n-\n \n \n \n828\n \n\n\n \nInterest swap and derivative instruments\n \n \n \n6,496\n \n \n \n9,521\n \n\n\n \nPrepaid expenses\n \n \n \n3,284\n \n \n \n2,444\n \n\n\n \nTotal deferred tax liabilities\n \n \n \n293,986\n \n \n \n312,099\n \n\n\n \n \n \n \n \n \n \n \n \n\n\n \nNet deferred tax liabilities\n \n \n$\n(\n9,053\n)\n \n$\n(\n74,480\n)\n\n\n\n\n\n\n \n\n\n\n\n\n\n62\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nAs of \n December 31, 2024 \nand \n2023\n, deferred tax assets of $\n24,132\n and $\n15,532\n, and deferred tax liabilities of $\n33,185\n and $\n90,012\n, respectively, were reflected in the consolidated balance sheets.\n\n\n \n\n\nThe Company maintains a $\n5,225\n valuation allowance against the deferred tax assets primarily related to certain tax loss carryforwards which \n may \nnot\n be realized. Realization of the deferred income tax asset related to the tax loss carryforward is dependent upon generating sufficient taxable income in these jurisdictions prior to their expiration. During \n2024,\n the valuation allowance increased by $\n89\n on our deferred tax assets where we believe the tax asset \n may \nnot\n be fully utilized.\n\n\n \n\n\nAt \n December 31, 2024, \nthe Company had tax loss carryforwards of approximately $\n182,431\n, which have varying expiration periods ranging from \n2025\n to indefinite. For carryforward amounts which the Company believes the losses will expire prior to use, a valuation allowance has been established. For all other carryforwards, the Company believes it will generate sufficient taxable income in these jurisdictions to utilize its loss carryforwards.\n\n\n \n\n\nAt \n December 31, 2024\n, the Company had state manufacturing tax credit carryforwards of approximately $\n27,510\n, which expire between \n2028\n and \n2040.\n The Company believes it will generate sufficient taxable income in these jurisdictions to fully utilize the credits prior to their expiration.\n\n\n \n\n\nChanges in the Company’s gross liability for unrecognized tax benefits, excluding interest and penalties, were as follows:\n\n\n \n\n\n\n\n \n \n \nDecember 31,\n \n \n\n\n \n \n \n2024\n \n \n \n \n2023\n \n \n\n\n \nUnrecognized tax benefit, beginning of period\n \n \n$\n9,703\n \n \n$\n8,895\n \n\n\n \nIncrease in unrecognized tax benefit for positions taken in prior period\n \n \n \n1,068\n \n \n \n3,081\n \n\n\n \nIncrease in unrecognized tax benefit for positions taken in current period\n \n \n \n943\n \n \n \n1,122\n \n\n\n \nStatute of limitation expirations\n \n \n \n(\n536\n)\n \n \n(\n3,395\n)\n\n\n \nSettlements\n \n \n \n-\n \n \n \n-\n \n\n\n \nUnrecognized tax benefit, end of period\n \n \n$\n11,178\n \n \n$\n9,703\n \n\n\n\n\n\n\n \n\n\nThe unrecognized tax benefit as of \n December 31, 2024 \nand \n2023\n, if recognized, would favorably impact the effective tax rate.\n\n\n \n\n\nAs of \n December 31, 2024 \nand \n2023\n, total accrued interest of approximately $\n1,142\n and $\n532\n, respectively, and accrued penalties of approximately $\n954\n and $\n1,275\n, respectively, associated with net unrecognized tax benefits are included in the consolidated balance sheets. Interest and penalties are recorded as a component of income tax expense.\n\n\n \n\n\nThe Company does \nnot\n expect a significant change to the total amount of unrecognized tax benefits during the fiscal year ending \n December \n31,\n \n2025.\n\n\n \n\n\nA reconciliation of the U.S. federal statutory tax rate to the effective tax rate for the years ended \n December 31, 2024, \n2023\n and \n2022\n is as follows:\n\n\n \n\n\n\n\n \n \n \nYear Ended December 31,\n \n \n\n\n \n \n \n2024\n \n \n \n \n2023\n \n \n \n \n2022\n \n \n\n\n \nU.S. statutory rate\n \n \n \n21.0\n%\n \n \n21.0\n%\n \n \n21.0\n%\n\n\n \nState taxes\n \n \n \n3.8\n \n \n \n4.0\n \n \n \n4.0\n \n\n\n \nState tax rate differential\n \n \n \n(\n0.2\n)\n \n \n0.0\n \n \n \n(\n0.3\n)\n\n\n \nResearch and development credits\n \n \n \n(\n1.2\n)\n \n \n(\n2.4\n)\n \n \n(\n1.1\n)\n\n\n \nState credits\n \n \n \n(\n0.5\n)\n \n \n(\n0.9\n)\n \n \n(\n1.5\n)\n\n\n \nShare-based compensation benefit\n \n \n \n(\n1.2\n)\n \n \n(\n0.4\n)\n \n \n(\n2.7\n)\n\n\n \nNondeductible U.S. compensation expense\n \n \n \n1.2\n \n \n \n1.0\n \n \n \n1.6\n \n\n\n \nForeign tax deduction\n \n \n \n0.0\n \n \n \n0.0\n \n \n \n(\n0.4\n)\n\n\n \nUncertain tax positions reserve\n \n \n \n0.6\n \n \n \n0.9\n \n \n \n0.0\n \n\n\n \nGlobal intangible low tax income\n \n \n \n0.4\n \n \n \n1.7\n \n \n \n0.2\n \n\n\n \nOther\n \n \n \n(\n1.3\n)\n \n \n0.3\n \n \n \n(\n1.2\n)\n\n\n \nEffective tax rate\n \n \n \n22.6\n%\n \n \n25.2\n%\n \n \n19.6\n%\n\n\n\n\n\n\n \n\n\n\n\n\n\n63\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n     \n  \n\n\n\n\n \n16.\n \n \nBenefit Plans\n \n\n\n\n\n \n\n\nMedical and Dental Plans\n\n\n \n\n\nThe Company maintains medical and dental benefit plans covering its full-time U.S. employees and their dependents. These plans are partially or fully self-funded under which participant claims are obligations of the plan. These plans are funded through employer and employee contributions at a level sufficient to pay for the benefits provided by the plan. \nThe Company’s contributions to the plans were $\n32,964\n, \n$\n26,090\n, and $\n31,180\n for the years ended \n December 31, 2024, \n2023\n and \n2022\n, respectively.\n\n\n \n\n\nEmployees of the Company’s foreign subsidiaries participate in government sponsored medical benefit plans and other local plans. In certain cases, the Company purchases supplemental medical coverage for certain employees at these foreign locations. The expenses related to these plans are \nnot\n material to the Company’s consolidated financial statements.\n\n\n \n\n\nSavings Plan\n\n\n \n\n\nThe Company maintains a defined-contribution \n401\n(k) savings plan for eligible U.S. employees. Under the plan, employees \n may \ndefer receipt of a portion of their eligible compensation. The Company \n may \ncontribute a matching contribution of \n50\n% of the \nfirst\n \n8\n% of eligible compensation of employees that is deferred. The Company \n may \nalso contribute a non-elective contribution for eligible employees employed on \n December 31, 2008, \nthat were impacted by the freezing of the Company’s pension plans. The Company’s matching contributions are subject to vesting. Forfeitures of unused company contributions \n may \nbe applied against plan expenses and future Company contributions. The Company recognized \n$\n7,779\n,\n $\n3,735\n, and $\n4,141\n of expense related to these plans for the years ended \n December 31, \n2024\n, \n2023\n and \n2022\n, respectively.\n\n\n \n\n\n\n\n\n\n64\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n     \n  \n\n\n\n\n \n17.\n \n \nShare Plans\n \n\n\n\n\n \n\n\nThe Company adopted an equity incentive plan (the \n2010\n Plan) on \n February 10, 2010, \nin connection with its initial public offering. The \n2010\n Plan, as amended, allowed for the grant of up to \n9.1\n million share-based awards to executives, directors, and employees. Awards available for grant under the \n2010\n Plan included stock options, stock appreciation rights, restricted stock, other share-based awards and performance-based compensation awards. New grants under the \n2010\n Plan ceased in \n June 2019. \nTotal share-based compensation expense related to the \n2010\n Plan, net of estimated forfeitures, was $\n0\n, $\n309\n, and $\n2,379\n for the years ended \n December 31, 2024, \n2023\n and \n2022\n, respectively, which is recorded in operating expenses in the consolidated statements of comprehensive income.\n\n\n \n\n\nOn \n June 13, 2019, \nthe stockholders of Generac Holdings Inc. approved the Company’s \n2019\n Equity Incentive Plan (the \n2019\n Plan). The \n2019\n Plan allows for the grant of up to \n2.7\n million share-based awards to executives, directors, and employees. Awards available for grant under the \n2019\n Plan include stock options, stock appreciation rights, restricted stock, other share-based awards and performance-based compensation awards. On \n June 13, 2024, \nthe stockholders of Generac Holdings Inc. approved an amendment to the \n2019\n Plan to increase the number of shares available for issuance by \n3.9\n million. Total share-based compensation expense related to the \n2019\n Plan, net of estimated forfeitures, was $\n49,248\n, $\n35,183\n, and $\n27,102\n for the years ended \n December 31, \n2024\n, \n2023\n and \n2022\n, respectively, which is recorded in operating expenses in the consolidated statements of comprehensive income.\n\n\n \n\n\nStock Options\n - Stock options granted in \n2024\n have an exercise price between $\n112.45\n and $\n147.41\n per share; stock options granted in \n2023\n have an exercise price between $\n110.86\n and $\n119.57\n per share; and stock options granted in \n2022\n have an exercise price between $\n103.50\n and $\n315.88\n per share. Stock options vest in equal installments over \nfour\n years, subject to the grantee’s continued employment or service and expire \nten\n years after the date of grant.\n\n\n \n\n\nStock option exercises can be net-share settled such that the Company withholds shares with value equivalent to the exercise price of the stock option awards plus the employees’ minimum statutory obligation for the applicable income and other employment taxes. Total shares withheld were \n9,701\n, \n31,030\n, and \n17,376\n for the years ended \n December 31, \n2024\n, \n2023\n and \n2022\n, respectively, and were based on the value of the stock on the exercise dates. The net-share settlement has the effect of share repurchases by the Company as they reduce the number of shares that would have otherwise been issued.\n\n\n \n\n\nEmployees can also utilize a cashless for cash exercise of stock options, such that all exercised shares will be sold in the market immediately. Cash equivalent to the exercise price of the awards plus the employees’ minimum statutory tax obligations is remitted to the Company, with the remaining cash being transferred to the employee. Total net proceeds to the Company from the cashless for cash exercise of stock options were $\n27,558\n, $\n7,815\n, and $\n13,786\n for the years ended \n December 31, \n2024\n, \n2023\n and \n2022\n, respectively, and are reflected as a financing activity in the consolidated statements of cash flows.\n\n\n \n\n\nTotal payments made by the Company to the taxing authorities for the employees’ tax obligations related to stock option exercises were $\n13,672\n, $\n4,895\n, and $\n14,089\n for the years ended \n December 31, \n2024\n, \n2023\n and \n2022\n, respectively, and are reflected as a financing activity in the consolidated statements of cash flows.\n\n\n \n\n\nThe grant-date fair value of each option grant is estimated using the Black-Scholes-Merton option pricing model. The fair value is then amortized on a straight-line basis over the requisite service period of the awards, which is generally the vesting period. Use of a valuation model requires management to make certain assumptions with respect to selected model inputs. Expected volatility is calculated based on an analysis of historic volatility of the Company’s stock price. The average expected life is based on the contractual term of the option using the simplified method. The risk-free interest rate is based on U.S. Treasury \nzero\n-coupon issues with a remaining term equal to the expected life assumed at the date of grant. The compensation expense recognized is net of estimated forfeitures. Forfeitures are estimated based on actual share option forfeiture history and are trued up upon vesting based on actual forfeiture activity.\n\n\n \n\n\nThe weighted-average assumptions used in the Black-Scholes-Merton option pricing model for \n2024\n, \n2023\n and \n2022\n are as follows:\n\n\n \n\n\n\n\n \n \nYear Ended December 31,\n \n\n\n \n \n \n2024\n \n \n \n \n2023\n \n \n \n \n2022\n \n \n\n\n \nWeighted average grant date fair value per share\n \n \n$\n59.30\n \n \n$\n57.73\n \n \n$\n129.38\n \n\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n \nAssumptions:\n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n \nExpected stock price volatility\n \n \n \n49\n%\n \n \n45\n%\n \n \n38\n%\n\n\n \nRisk free interest rate\n \n \n \n4.19\n%\n \n \n3.64\n%\n \n \n1.54\n%\n\n\n \nExpected annual dividend per share\n \n \n$\n-\n \n \n$\n-\n \n \n$\n-\n \n\n\n \nExpected life of options (years)\n \n \n \n6.25\n \n \n \n6.25\n \n \n \n6.25\n \n\n\n\n\n\n\n \n\n\nA summary of the Company’s stock option activity and related information for the years ended \n December 31, 2024, \n2023\n and \n2022\n is as follows:\n\n\n \n\n\n\n\n \n \n \nNumber of Options\n \n \n \n \nWeighted-Average Exercise Price\n \n \n \n \nWeighted-Average Remaining Contractual Term (in years)\n \n \n \n \nAggregate Intrinsic Value ($ in thousands)\n \n \n\n\n \nOutstanding as of December 31, 2021\n \n \n \n1,342,131\n \n \n \n64.29\n \n \n \n5.5\n \n \n$\n386,069\n \n\n\n \nGranted\n \n \n \n109,266\n \n \n \n282.20\n \n \n \n \n \n \n \n \n \n\n\n \nExercised\n \n \n \n(\n137,305\n)\n \n \n36.91\n \n \n \n \n \n \n \n \n \n\n\n \nForfeited\n \n \n \n(\n45,688\n)\n \n \n194.05\n \n \n \n \n \n \n \n \n \n\n\n \nOutstanding as of December 31, 2022\n \n \n \n1,268,404\n \n \n \n81.35\n \n \n \n4.9\n \n \n$\n47,764\n \n\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n \nGranted\n \n \n \n208,392\n \n \n \n119.31\n \n \n \n \n \n \n \n \n \n\n\n \nExercised\n \n \n \n(\n159,316\n)\n \n \n42.46\n \n \n \n \n \n \n \n \n \n\n\n \nForfeited\n \n \n \n(\n33,144\n)\n \n \n185.81\n \n \n \n \n \n \n \n \n \n\n\n \nOutstanding as of December 31, 2023\n \n \n \n1,284,336\n \n \n \n89.64\n \n \n \n5.0\n \n \n$\n75,587\n \n\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n \nGranted\n \n \n \n118,681\n \n \n \n112.66\n \n \n \n \n \n \n \n \n \n\n\n \nExercised\n \n \n \n(\n310,201\n)\n \n \n57.20\n \n \n \n \n \n \n \n \n \n\n\n \nForfeited\n \n \n \n(\n63,265\n)\n \n \n152.06\n \n \n \n \n \n \n \n \n \n\n\n \nOutstanding as of December 31, 2024\n \n \n \n1,029,551\n \n \n \n96.10\n \n \n \n4.9\n \n \n$\n78,310\n \n\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n \nExercisable as of December 31, 2024\n \n \n \n753,487\n \n \n \n77.67\n \n \n \n3.6\n \n \n$\n69,273\n \n\n\n\n\n\n\n \n\n\nAs of \n December 31, 2024\n, there was $\n13,405\n of total unrecognized compensation cost, net of expected forfeitures, related to unvested options. The cost is expected to be recognized over the remaining service period, having a weighted-average period of \n2.3\n years. Total share-based compensation cost related to stock options for the years ended \n December 31, \n2024\n, \n2023\n and \n2022\n was $\n8,122\n, $\n8,229\n, and $\n6,911\n, respectively, which is recorded in operating expenses in the consolidated statements of comprehensive income.\n\n\n \n\n\n\n\n\n\n65\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\nRestricted Stock\n – Restricted stock awards vest in equal installments over \nthree\n years, subject to the grantee’s continued employment or service. Certain restricted stock awards also include performance shares, whereby the number of performance shares that can be earned are contingent upon Company performance measures over a \nthree\n-year period. Performance measures are based on a weighting of a number of financial metrics, from which grantees \n may \nearn from \n0\n% to \n200\n% of their target performance share award. The performance period for the \n2022\n awards covers the years \n2022\n through \n2024.\n The performance period for the \n2023\n awards covers the years \n2023\n through \n2025.\n The performance period for the \n2024\n awards covers the years \n2024\n through \n2026.\n The Company estimates the number of performance shares that will vest based on projected financial performance. The fair value of restricted awards is determined based on the market value of the Company's stock on the grant date. The fair market value of the restricted awards at the time of the grant is amortized to expense over the period of vesting. The compensation expense recognized for restricted share awards is net of estimated forfeitures and is trued up upon vesting based on actual forfeiture activity.\n\n\n \n\n\nAll restricted stock vesting is net-share settled such that, upon vesting, the Company withholds shares with value equivalent to the employees’ minimum statutory tax obligation, and then pays the cash to the taxing authorities on behalf of the employees. In effect, the Company repurchases these shares and classifies them as treasury stock. Total shares withheld were \n78,465\n, \n50,577\n, and \n92,008\n for the years ended \n December 31, \n2024\n, \n2023\n and \n2022\n, respectively, and were based on the value of the stock on the vesting dates. Total payments made by the Company to the taxing authorities for the employees’ tax obligations related to restricted stock vesting were $\n11,097\n, $\n6,002\n, and $\n26,834\n for the years ended \n December 31, \n2024\n, \n2023\n and \n2022\n, respectively, and are reflected as a financing activity within the consolidated statements of cash flows.\n\n\n \n\n\nA summary of the Company's restricted stock activity for the years ended \n December 31, 2024, \n2023\n and \n2022\n is as follows:\n\n\n \n\n\n\n\n \n \n \nShares\n \n \n \n \nWeighted-Average Grant-Date Fair Value\n \n \n\n\n \nNon-vested as of December 31, 2021\n \n \n \n365,965\n \n \n$\n124.25\n \n\n\n \nGranted\n \n \n \n287,821\n \n \n \n214.58\n \n\n\n \nVested\n \n \n \n(\n234,284\n)\n \n \n83.52\n \n\n\n \nForfeited\n \n \n \n(\n41,204\n)\n \n \n263.47\n \n\n\n \nNon-vested as of December 31, 2022\n \n \n \n378,298\n \n \n \n203.04\n \n\n\n \n \n \n \n \n \n \n \n \n\n\n \nGranted\n \n \n \n425,099\n \n \n$\n117.62\n \n\n\n \nVested\n \n \n \n(\n133,222\n)\n \n \n175.94\n \n\n\n \nForfeited\n \n \n \n(\n44,789\n)\n \n \n213.80\n \n\n\n \nNon-vested as of December 31, 2023\n \n \n \n625,386\n \n \n \n153.01\n \n\n\n \n \n \n \n \n \n \n \n \n\n\n \nGranted\n \n \n \n503,937\n \n \n$\n120.77\n \n\n\n \nVested\n \n \n \n(\n206,435\n)\n \n \n177.28\n \n\n\n \nForfeited\n \n \n \n(\n115,135\n)\n \n \n130.89\n \n\n\n \nNon-vested as of December 31, 2024\n \n \n \n807,753\n \n \n \n127.07\n \n\n\n\n\n\n\n \n\n\n\n\n\n      As of\n     \n December 31, 2024\n, there was\n     $\n59,177\n of unrecognized compensation cost, net of expected forfeitures, related to non-vested restricted stock awards. That cost is expected to be recognized over the remaining service period, having a weighted-average period of\n     \n1.9\n years. Total share-based compensation cost related to the restricted stock for the years ended\n     \n December 31, \n\n\n2024\n,\n     \n2023\n and\n     \n2022\n, inclusive of performance shares, was\n     $\n41,126\n,\n     $\n27,263\n, and\n     $\n22,570\n, respectively, which is recorded in operating expenses in the consolidated statements of comprehensive income.\n    \n\n\n\n\n \n\n\n\n\n\n      During\n     \n2024\n,\n     \n2023\n and\n     \n2022\n,\n     \n14,814\n,\n     \n16,174\n, and\n     \n8,572\n shares of stock, respectively, were granted to certain members of the Company’s Board as a component of their compensation for their service on the Board, all of which were fully vested at time of grant. A non-employee director can elect to receive his or her director fees in the form of deferred stock units, which voluntarily defers the issuance of the related shares granted until the director separates from the Company, or a triggering event occurs.\n     \n8,484\n,\n     \n8,832\n, and\n     \n5,008\n of deferred stock units are included in the shares of stock granted to certain members of the Company’s Board for the years\n     \n2024\n,\n     \n2023\n, and\n     \n2022\n, respectively. Total share-based compensation cost for shares of stock granted to the Company's Board in \n     \n2024\n,\n     \n2023\n and\n     \n2022\n was\n     $\n1,992\n,\n     $\n1,846\n, and\n     $\n1,886\n, respectively, which is recorded in operating expenses in the consolidated statements of comprehensive income.\n    \n\n\n\n\n \n\n\n\n\n\n\n66\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n     \n  \n\n\n\n\n \n18.\n \n \nCommitments and Contingencies\n \n\n\n\n\n \n\n\nThe Company has an arrangement with a finance company to provide floor plan financing for certain dealers. The Company receives payment from the finance company after shipment of product to the dealer. The Company participates in the cost of dealer financing up to certain limits and has agreed to repurchase products repossessed by the finance company, but does \nnot\n indemnify the finance company for any credit losses they incur. The amount financed by dealers which remained outstanding under this arrangement as of \n December 31, 2024 \nand \n2023\n was approximately\n $\n165,432\n and $\n158,028\n, respectively.\n\n\n \n\n\nOn \n August 1, 2022, \nPower Home Solar, LLC d/b/a Pink Energy (PHS) filed a lawsuit in the Western District of Virginia against Generac Power Systems, Inc., a wholly-owned subsidiary of the Company (Generac Power). The complaint alleges breaches of warranty, product liability, and other various causes of action against Generac Power relating to the sale and performance of certain clean energy equipment and seeks to recover damages, including consequential damages, that PHS allegedly incurred. The Company disputes the allegations in the complaint, including that PHS can seek consequential damages or amounts greater than the \n$25,000 liability\n cap set forth in the agreement between the parties. Generac Power moved to dismiss the complaint and compel arbitration consistent with the parties’ agreement. PHS later filed a Chapter \n7\n bankruptcy petition in the Western District of North Carolina that identified Generac Power as \none\n of its outstanding creditors. The parties agreed to toll PHS’s deadline to respond to the motion to dismiss and all other pretrial deadlines to allow the bankruptcy trustee to evaluate the complaint. The Trustee has \nnot\n yet taken further action in this lawsuit. Generac Power intends to vigorously defend against the claims in the complaint, in whichever forum they \n may \nproceed. \n\n\n \n\n\nOn \n October 28, 2022, \nDaniel Haak filed a putative consumer class action lawsuit against Generac Power in the Middle District of Florida. The complaint alleges breaches of warranty, tort-based, and unjust enrichment claims against Generac Power relating to the sale and performance of certain clean energy products, and seeks to recover damages, including consequential damages, that the plaintiff and putative class allegedly incurred. Additional putative class actions were filed by consumers raising similar claims and allegations in other district court cases. These putative class actions have been consolidated into a Multidistrict Litigation, \nIn re: Generac Solar Power Systems Marketing, Sales Practices and Products Liability Litigation\n currently pending in the Eastern District of Wisconsin, Case \nNo.\n \n23\n-md-\n3078.\n Generac Power and the Company filed their answer to the consolidated master complaint after the court denied the motion to dismiss on \n May 24, 2024. \nGenerac Power and the Company intend to vigorously defend against the consolidated master complaint. \n\n\n \n\n\nOn \n December 1, 2022, \nOakland County Voluntary Employees’ Beneficiary Association and Oakland County Employees’ Retirement System filed a putative securities class action lawsuit against the Company and certain of its officers in the Eastern District of Wisconsin. The court subsequently consolidated a later filed action and appointed a lead plaintiff. The lead plaintiff filed a consolidated complaint alleging violation of federal securities law related to disclosures of certain matters (the \nOakland County \nLawsuit). On \n February 7, 2025, \nthe court granted the Company’s motion to dismiss and found that plaintiffs failed to adequately plead a securities fraud claim. The court gave plaintiffs until \n March 10, 2025, \nto file an amended complaint if they want to continue the lawsuit.\n\n\n \n\n\nOn \n February 3, 2023, \na purported Company shareholder filed a shareholder derivative action against certain of the Company’s officers and directors in the United States District Court for the Eastern District of Wisconsin. The complaint seeks unspecified damages on behalf of the Company and certain other relief, such as certain reforms to corporate governance practices. The complaint (in which the Company is named as a nominal defendant) generally alleges, among other things, breaches of fiduciary duties in connection with the oversight of the Company’s public statements and legal compliance, and that the Company was damaged as a result of the breaches of fiduciary duties, and the defendants were unjustly enriched. The complaint also alleges, among other things, violations of Sections \n14\n(a), \n10\n(b) and \n20\n(a) of the Securities Exchange Act of \n1934,\n abuse of control, gross mismanagement, and waste of corporate assets. The Company has received several additional derivative actions filed in both state and federal courts raising similar claims and allegations, including issues raised in the \nOakland County \nLawsuit. The Company disputes the allegations in the shareholder derivative actions and intends to vigorously defend against the claims in the complaints.\n\n\n \n\n\nOn October \n28,\n \n2022, Generac\n Power received a grand jury subpoena from the U.S. Attorney for the Eastern District of Michigan, as a result of which the Company became aware of an enforcement investigation by the U.S. DOJ. The subpoena requests similar documents and information provided by the Company to the U.S. EPA and the CARB in response to civil document requests related to the Company’s compliance with emissions regulations for \napproximately 1,850\n (\nnot\n in thousands) portable generators produced by the Company \nin 2019 and 2020 and\n sold \nin 2020.\n On \n October 2, 2024, \nthe Company received additional information from the EPA that could increase the number of portable generators under review by the EPA by approximately \n4,850\n (\nnot\n in thousands) if certain emissions certifications for \n2020\n are voided. The Company is cooperating with the DOJ, EPA and CARB regarding these topics and related requests.\n\n\n \n\n\nOn November \n30,\n \n2022, the\n CPSC notified the Company of its intention to recommend the imposition of a civil penalty for failing to timely submit a report to the CPSC in relation to certain portable generators that were subject to a voluntary recall previously announced on July \n29,\n \n2021. On\n \n May 3, 2023, \nthe parties entered into a mutual settlement agreement. The agreement does \nnot\n constitute an admission by Generac or a determination by the CPSC that Generac violated the CPSA. The terms of the settlement agreement require the Company to (i) abide by certain customary agency requirements regarding the ongoing commitment to the Company’s internal CPSA compliance practices and program, and (ii) pay a civil fine of \n$15,800. On\n \n July 21, 2023, \nGenerac Power received a grand jury subpoena from the U.S. Attorney for the Eastern District of Wisconsin, as a result of which the Company became aware of a continuing inquiry by the DOJ related to its statutory obligations under the CPSA in connection with this matter. Additionally, on \n October 23, 2023, \nthe CPSC notified the Company that it is further investigating whether the Company complied with the reporting requirements to the CPSC in relation to certain portable generators that were subject to a voluntary recall previously announced on \n September 14, 2023. \nThe Company is cooperating fully with both the CPSC and DOJ investigations and, at this time, is unable to predict the eventual scope, duration or final outcome of such investigations. \n\n\n \n\n\nIn \n2019,\n EcoFactor, Inc. started a litigation campaign against smart thermostat manufacturers, including ecobee, Inc., which was acquired by the Company in \n2021.\n EcoFactor accused ecobee of infringing its patents in \nthree\n lawsuits filed in the United States District Court for the Western District of Texas and \none\n lawsuit in the United States District Court for the District of Delaware. On \n June 23, 2023, \na jury issued a verdict in a consolidated action in the Western District of Texas (Case Nos. \n21\n-cv-\n00428\n-ADA and \n20\n-cv-\n00078\n-ADA) finding that ecobee infringed \none\n of the \ntwo\n patents at issue and awarded a lump-sum payment of $\n5,400\n for past and future damages. On \n December 27, 2023, \nthe parties reached a global settlement at an incremental cost of $\n4,600\n to resolve all remaining disputes between the parties, including the \ntwo\n remaining lawsuits. In \n2023,\n the Company recorded a reserve of $\n10,000\n related to this matter. \n\n\n \n\n\nOn \n March 8, 2022, \nOllnova Technologies Limited, a non-practicing entity, filed a patent infringement lawsuit against ecobee Technologies, ULC. (ecobee) in the United States District Court for the Eastern District of Texas (Case \nNo.\n \n22\n-cv-\n00072\n-JRG). Ollnova claimed that ecobee infringes on \nfour\n of its patents. Following an \n October 5, 2023, \njury verdict finding \none\n of Ollnova’s patents invalid and that ecobee infringed at least \none\n of the claims of the asserted patents, on \n March 1, 2024, \nthe trial court entered judgment against ecobee for $\n11,500\n, as well as an award of prejudgment and post-judgment interest. In \n2023,\n the Company recorded a reserve of $\n12,669\n related to this matter. In the \nfirst\n quarter of \n2024,\n the Company recorded an additional reserve of $\n1,826\n for estimated prejudgment and post-judgement interest. ecobee has appealed the trial court’s judgment to the Court of Appeals for the Federal Circuit and that appeal is currently pending.\n\n\n \n\n\nOn \n June 9, 2023, \nSpartronics Vietnam, Inc., a contract manufacturer of Generac Power’s clean energy products, filed multiple lawsuits against Generac Power and sub-suppliers accusing Generac Power of fraud, breaching its supply agreement with Spartronics, tortiously interfering with Spartronics’ relationships with its sub-suppliers, and requesting a determination of rights under the parties’ agreements in state and federal court. Spartronics subsequently filed additional \nthird\n-party complaints against Generac Power raising similar claims and allegations. After a court granted Generac Power’s motion to compel arbitration, Spartronics filed a demand for arbitration of its claims. Generac Power denies the allegations in the complaints, including that Generac Power is responsible for Spartronics' purchasing practices, and is pursuing a counterclaim in connection with the arbitration. \n\n\n \n\n\nOn \n November 21, 2023, \nChristopher Walling filed a putative securities class action lawsuit against the Company and certain of its officers in the Western District of Wisconsin and was later appointed lead plaintiff. The complaint asserts claims for alleged violation of federal securities law related to statements concerning the Company’s financial outlook and the impact of macroeconomic trends on the demand for its products. The plaintiff seeks to represent a class of individuals who purchased or otherwise acquired common stock between \n May 3, 2023, \nand \n August 3, 2023, \nand seeks unspecified compensatory damages and other relief on behalf of a purported class of purchasers of the Company’s stock (the \nWalling\n Lawsuit). The Company moved to dismiss the amended complaint on \n June 21, 2024, \nand intends to vigorously defend against the claims in the amended complaint.\n\n\n \n\n\nOn \n February 14, 2024, \na purported Company shareholder filed a derivative action against certain of the Company’s officers and directors in the United States District Court for the Eastern District of Wisconsin. The complaint (in which the Company is named as a nominal defendant) generally alleges, among other things, breaches of fiduciary duties in connection with the oversight of the Company’s public statements and legal compliance, including as to the claims raised in the \nWalling\n Lawsuit. The complaint seeks unspecified damages on behalf of the Company and certain other relief, including certain corporate governance reforms. The Company disputes the allegations in the shareholder derivative action and intends to vigorously defend against the claims in the complaint.\n\n\n \n\n\nOn \n October 9, 2024, \nChampion Power Equipment, Inc. (Champion) filed a patent infringement lawsuit against Generac Power in the United States District Court for the Eastern District of Wisconsin (Case \nNo.\n \n24\n-cv-\n01281\n-LA). Champion claims that certain Generac and Powermate branded multi-fuel portable generators infringe on Champion’s portfolio of dual and multi-fuel patents. Generac Power denies the allegations and intends to vigorously defend the matter.\n\n\n \n\n\nOn \n October 18, 2024, \ntwo\n individuals filed a putative consumer class action lawsuit against Generac Power and the Company in the Middle District of Florida (Case \nNo.\n \n24\n-cv-\n02412\n). The Amended Complaint, which includes additional plaintiffs, alleges certain defects for home standby generators manufactured or sold to consumers from \n2020\n-\n2024.\n Plaintiffs assert breaches of warranty, tort-based, and statutory claims relating to the sale and performance of home standby generators. The Company disputes the allegations and intends to vigorously defend against the claims in the complaint, including that the case should \nnot\n proceed as a class action. \n\n\n \n\n\nIt is presently unlikely that any legal, regulatory or other proceedings pending against or involving the Company will have a material adverse effect on the Company’s financial condition, results of operations or cash flows. However, in many of these matters, it is inherently difficult to determine whether a loss is probable or to estimate the size or range of the possible loss given the variety and potential outcomes of actual and potential claims, the uncertainty of future rulings, the behavior or incentives of adverse parties, and other factors outside the control of the Company. Accordingly, the Company’s loss reserves \n may \nchange from time to time, and actual losses could exceed the amounts reserved by an amount that could be material to the Company’s consolidated financial position, results of operations or cash flows in any particular reporting period.\n\n\n     \n\n\n\n\n\n\n\n\n\n\n67\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n      \n\n\n\n\n\n     \n  \n\n\n\n\n \n19.\n \n \nValuation and Qualifying Accounts\n \n\n\n\n\n \n\n\nFor the years ended \n December 31, 2024, \n2023\n and \n2022\n:\n\n\n \n\n\n\n\n \n \n \nBalance at Beginning of Year\n \n \n \n \nAdditions Charged to Earnings\n \n \n \n \nCharges to Reserve, Net (1)\n \n \n \n \nReserves Established for Acquisitions\n \n \n \n \nBalance at End of Year\n \n \n\n\n \nYear ended December 31, 2024\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n \nAllowance for credit losses\n \n \n$\n33,925\n \n \n$\n4,524\n \n \n$\n(\n3,509\n)\n \n$\n525\n \n \n$\n35,465\n \n\n\n \nReserves for inventory\n \n \n \n39,027\n \n \n \n10,738\n \n \n \n(\n2,924\n)\n \n \n1,332\n \n \n \n48,173\n \n\n\n \nValuation of deferred tax assets\n \n \n \n5,136\n \n \n \n447\n \n \n \n(\n358\n)\n \n \n-\n \n \n \n5,225\n \n\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n \nYear ended December 31, 2023\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n \nAllowance for credit losses\n \n \n$\n27,664\n \n \n$\n7,443\n \n \n$\n(\n1,206\n)\n \n$\n24\n \n \n$\n33,925\n \n\n\n \nReserves for inventory\n \n \n \n39,714\n \n \n \n4,621\n \n \n \n(\n5,308\n)\n \n \n-\n \n \n \n39,027\n \n\n\n \nValuation of deferred tax assets\n \n \n \n4,638\n \n \n \n516\n \n \n \n(\n18\n)\n \n \n-\n \n \n \n5,136\n \n\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n \nYear ended December 31, 2022\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n \nAllowance for credit losses\n \n \n$\n12,025\n \n \n$\n17,966\n \n \n$\n(\n2,825\n)\n \n$\n498\n \n \n$\n27,664\n \n\n\n \nReserves for inventory\n \n \n \n33,537\n \n \n \n9,656\n \n \n \n(\n4,737\n)\n \n \n1,258\n \n \n \n39,714\n \n\n\n \nValuation of deferred tax assets\n \n \n \n7,874\n \n \n \n649\n \n \n \n(\n1,501\n)\n \n \n(\n2,384\n)\n \n \n4,638\n \n\n\n\n\n\n\n \n\n\n \n(\n1\n)\n \nDeductions from the allowance for credit losses equal accounts receivable written off against the allowance, less recoveries, as well as foreign currency translation adjustments. Deductions from the reserves for inventory excess and obsolete items equal inventory written off against the reserve as items were disposed of, as well as foreign currency translation adjustments. \n \n\n\n\n\n  \n\n\n\n\n\n\n\n\n\n\n68\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n     \n  \n\n\nItem 9. Changes in and Disagreements with Accountants\n on Accounting and Financial Disclosure\n\n\n \n\n\nThere were no changes in, or disagreements with, accountants reportable herein.\n\n\n \n\n\nItem 9A. Controls and Procedures\n\n\n \n\n\nEvaluation of Disclosure Controls and Procedures\n\n\n \n\n\nDisclosure controls and procedures are controls and other procedures that are designed to ensure that information required to be disclosed by us in reports we file or submit under the Securities Exchange Act of 1934 (Exchange Act), is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commission rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that such information is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate, to allow for timely decisions regarding required disclosure.\n\n\n \n\n\nOur management, with the participation of our Chief Executive Officer and our Chief Financial Officer, has conducted an evaluation of the design and operation of our disclosure controls and procedures as defined in Rule 13a-15(e) and 15d-15(e) under the Exchange Act as of the end of the period covered by this report on Form 10-K. Based on that evaluation, our Chief Executive Officer and Chief Financial Officer concluded that our disclosure controls and procedures were effective in providing reasonable assurance that the information required to be disclosed in this report on Form 10-K has been recorded, processed, summarized and reported as of the end of the period covered by this report on Form 10-K.\n\n\n \n\n\nManagement’s Report on Internal Control Over Financial Reporting\n\n\n \n\n\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as defined in Rule 13a-15(f) and 15d-15(f) under the Exchange Act. Our internal control over financial reporting is designed under the supervision of our Chief Executive Officer and Chief Financial Officer to provide reasonable assurance regarding the reliability of financial reporting and the preparation of the consolidated financial statements in accordance with U.S. GAAP.\n\n\n \n\n\nInternal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the Company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of the financial statements in accordance with U.S. GAAP, and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the Company’s assets that could have a material effect on the Company’s financial statements.\n\n\n \n\n\nThere are inherent limitations to the effectiveness of any internal control over financial reporting, including the possibility of human error or the circumvention or overriding of the controls. Accordingly, even an effective internal control over financial reporting can provide only reasonable assurance of achieving its objective. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate, because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n\n\n \n\n\nUnder the supervision and with the participation of our Chief Executive Officer and Chief Financial Officer, our management conducted an assessment of the effectiveness of internal control over financial reporting as of December 31, 2024 based on the criteria established in the 2013 \nInternal Control – Integrated Framework\n, issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based on this assessment, our management has concluded that our internal control over financial reporting was effective as of December 31, 2024. \n\n\n \n\n\nDeloitte & Touche LLP (PCAOB ID No. \n34\n), the Company’s independent registered public accounting firm, issued an attestation report on the effectiveness of the Company’s internal control over financial reporting as of December 31, 2024, which is included herein.\n\n\n \n\n\nChanges in Internal Control Over Financial Reporting\n\n\n \n\n\nThere have been no changes in our internal control over financial reporting that occurred during the three months ended December 31, 2024 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\n \n\n\n \n\n\n\n\n\n\n\n\n\n       69\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n     \n  \n\n\n\n\nItem \n9B.\n Other Information\n\n\n \n\n\nAdoption: On \n \nNovember 19, 2024\n, \nAaron Jagdfeld\n, \nChief Executive Officer and director\n, \nadopted\n a Rule \n10b5\n-\n1\n trading arrangement that is intended to satisfy the affirmative defense of Rule \n10b5\n-\n1\n(c) for (i) the sale of up to \n46,303\n shares of the Company’s common stock and (ii) the exercise of stock options to acquire \n13,697\n shares and sale of the acquired shares until \n \nFebruary 27, 2026\n. \n\n\n\n\n \n\n\n\n     \n  \n\n\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\n\n\n \n\n\nNone\n\n\n \n\n\nPART III\n\n\n \n\n\nItem 10. Directors, Executive Officers and Corporate Governance\n\n\n \n\n\nThe information required by Item 10 not already provided herein under “Item 1 – Business – Information About Our Executive Officers”, will be included in our 2025 Proxy Statement and is incorporated herein by reference.\n\n\n \n\n\nItem 11. Executive Compensation\n\n\n \n\n\nThe information required by this item will be included in our 2025 Proxy Statement and is incorporated herein by reference.\n\n\n \n\n\nItem 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\n\n\n \n\n\nThe information required by this item, including under the heading “Securities Authorized for Issuance Under Equity Compensation Plans,” will be included in our 2025 Proxy Statement and is incorporated herein by reference.\n\n\n \n\n\nItem 13. Certain Relationships and Related Transactions, and Director Independence\n\n\n \n\n\nThe information required by this item will be included in our 2025 Proxy Statement and is incorporated herein by reference.\n\n\n \n\n\nItem 14. Principal Accountant Fees and Servic\nes\n\n\n \n\n\nThe information required by this item will be included in our 2025 Proxy Statement and is incorporated herein by reference.\n\n\n \n\n\nPART IV\n\n\n \n\n\nItem 15. Exhibits and Financial Statement Schedules\n\n\n \n\n\n(a)(1) Financial Statements\n\n\n \n\n\nIncluded in Part II of this report:\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \nPage\n \n\n\n\n\n\n\n \nReports of Independent Registered Public Accounting Firm\n \n\n\n \n34\n \n\n\n\n\n\n\n \nConsolidated balance sheets as of December 31, 2024 and 2023\n \n\n\n \n37\n \n\n\n\n\n\n\n \nConsolidated statements of comprehensive income for years ended December 31, 2024, 2023 and 2022\n \n\n\n \n38\n \n\n\n\n\n\n\n \nConsolidated statements of stockholders’ equity for years ended December 31, 2024, 2023 and 2022\n \n\n\n \n39\n \n\n\n\n\n\n\n \nConsolidated statements of cash flows for the years ended December 31, 2024, 2023 and 2022\n \n\n\n \n40\n \n\n\n\n\n\n\n \nNotes to consolidated financial statements\n \n\n\n \n41\n \n\n\n\n\n\n\n\n\n \n\n\n(a)(2) Financial Statement Schedules\n\n\n \n\n\nAll financial statement schedules have been omitted, since the required information is not applicable or is not present in amounts sufficient to require submission of the schedule, or because the information required is included in the consolidated financial statements and notes thereto.\n\n\n \n\n\n\n\n\n     70\n   \n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n(a)(3) Exhibits\n\n\n \n\n\nThe below exhibits index is the list of the exhibits being filed or furnished with or incorporated by reference into this Annual Report on Form 10-K:\n\n\n \n\n\n\n\n\n\n\n\n \nExhibits\n Number\n \n\n\n \n\n\n \nDescription\n \n \n \n\n\n\n\n\n\n2.1\n\n\n \n\n\nArrangement Agreement dated as of November 1, 2021 by and among 13462234 Canada Inc., Generac Power Systems, Inc., ecobee Inc., and Shareholder Representative Services LLC (incorporated by reference to Exhibit 2.1 of the Company's Current Report on Form 8-K filed with the SEC on November 2, 2021).\n\n\n\n\n\n\n \n \n \n\n\n \n\n\n \n\n\n\n\n\n\n   2.2\n\n\n \n\n\nAmendment No. 1, dated as of May 31, 2022, to Arrangement Agreement dated as of November 1, 2021, by and among 13462234 Canada Inc., Generac Power Systems, Inc., ecobee Inc., and Shareholder Representative Services LLC (incorporated by reference to Exhibit 10.2 of the Quarterly Report on Form 10-Q filed with the SEC on August 8, 2022).\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n   2.3\n\n\n \n\n\nAmendment, dated as of December 29, 2022, to Arrangement Agreement dated as of November 1, 2021 by and among 13462234 Canada Inc., Generac Power Systems, Inc., ecobee Inc., and Shareholder Representative Services LLC (incorporated by reference to Exhibit 2.3 of the Annual Report on Form 10-K filed with the SEC on February 22, 2023).\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n3.1\n \n\n\n \n\n\n \nThird Amended and Restated Certificate of Incorporation of Generac Holdings Inc. (incorporated by reference to Exhibit 3.1 of the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2009).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n3.2\n \n\n\n \n\n\n \nAmended and Restated Bylaws of Generac Holdings Inc. (incorporated by reference to Exhibit 3.2 of the Company’s Current Report on Form 8-K filed with the SEC on March 10, 2023).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n4.1\n \n\n\n \n\n\n \nForm of Common Stock Certificate (incorporated by reference to Exhibit 4.1 of the Registration Statement on Form S-1 filed with the SEC on January 25, 2010).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n4.2\n \n\n\n \n\n\n \nDescription of Securities (incorporated by reference to Exhibit 4.2 of the Annual Report on Form 10-K filed with the SEC on February 25, 2020).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.1\n \n\n\n \n\n\n \nCredit Agreement, Dated as of February 9, 2012, As Amended and Restated as of May 30, 2012, As Further Amended and Restated as of May 31, 2013, among Generac Power Systems, Inc., Generac Acquisition Corp., the lenders party thereto, JPMorgan Chase Bank, N.A., as Administrative Agent and Bank of America, N.A. and Goldman Sachs Bank USA, as syndication agent (incorporated by reference to Exhibit 10.2 to the Company’s Current Report on Form 8-K filed with the SEC on June 4, 2013)\n.\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n10.2\n\n\n \n\n\nFirst Amendment dated as of May 18, 2015, to Credit Agreement, dated as of February 9, 2012, as amended and restated as of May 30, 2012, as further amended and restated as of May 31, 2013, among Generac Power Systems, Inc., Generac Acquisition Corp., the lenders party thereto, JPMorgan Chase Bank, N.A. as administrative agent and Bank of America, N.A. and Goldman Sachs Bank USA, as syndication agents and Deutsche Bank Securities Inc., Morgan Stanley Senior Funding, Inc. and Wells Fargo Bank, N.A. as document agents (incorporated by reference to Exhibit 10.2 to the Company's Quarterly Report on Form 10-Q filed with the SEC on August 7, 2015).\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.3\n \n\n\n \n\n\n \nReplacement Term Loan Amendment dated as of November 2, 2016, among Generac Power Systems, Inc., Generac Acquisition Corp., the lenders party thereto, JPMorgan Chase Bank, N.A., as Administrative Agent, and the other agents named therein (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the SEC on November 3, 2016).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.4\n \n\n\n \n\n\n \n2017 Replacement Term Loan Amendment dated as of May 11, 2017, among Generac Power Systems, Inc., Generac Acquisition Corp., the lenders party thereto, JPMorgan Chase Bank, N.A., as Administrative Agent, and the other agents named therein (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the SEC on May 15, 2017).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.5\n \n\n\n \n\n\n \n2017-2 Replacement Term Loan Amendment dated as of December 8, 2017, among Generac Power Systems, Inc., Generac Acquisition Corp., the lenders party thereto, JPMorgan Chase Bank, N.A., as Administrative Agent, and the other agents named therein (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the SEC on December 11, 2017).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.6\n \n\n\n \n\n\n \n2018 Replacement Term Loan Amendment, dated as of June 8, 2018, among Generac Power Systems, Inc., Generac Acquisition Corp., the lenders party thereto, JPMorgan Chase Bank, N.A., as Administrative Agent, and the other agents named therein (incorporated by reference to Exhibit 10.1 of the Current Report on Form 8-K filed with the SEC on June 14, 2018).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.7\n \n\n\n \n\n\n \n2019 Replacement Term Loan Amendment, dated as of December 13, 2019, among Generac Power Systems, Inc., Generac Acquisition Corp., the lenders party thereto, JPMorgan Chase Bank, N.A., as Administrative Agent, and the other agents named therein (incorporated by reference to Exhibit 10.1 of the Current Report on Form 8-K filed with the SEC on December 16, 2019).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n10.8\n\n\n \n\n\nSecond Amendment, dated as of May 27, 2021, amending that certain Credit Agreement, dated as of February 9, 2012, as amended and restated as of May 30, 2012, as further amended and restated as of May 31, 2013, as amended by the First Amendment, dated as of May 18, 2015, as further amended by the Replacement Term Loan Amendment, dated as of November 2, 2016, as further amended by the 2017 Replacement Term Loan Amendment, dated as of May 11, 2017, as further amended by the 2017-2 Replacement Term Loan Amendment, dated December 8, 2017, as further amended by the 2018 Replacement Term Loan Amendment, dated June 8, 2018, and as further amended by the 2019 Replacement Term Loan Amendment, dated December 13, 2019, among Generac Power Systems, Inc., Generac Acquisition Corp., the other Loan Parties (as defined therein) party thereto, the lenders party thereto, JPMorgan Chase Bank, N.A., as Administrative Agent and the other agents named therein (incorporated by reference to Exhibit 10.2 of the Current Report on Form 8-K filed with the SEC on May 28, 2021).\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n10.9\n\n\n \n\n\nThird Amendment, dated as of June 29, 2022, amending and restating that certain Credit Agreement, dated as of February 9, 2012, as amended and restated as of May 30, 2012, as further amended and restated as of May 31, 2013, as amended by the First Amendment, dated as of May 18, 2015, as further amended by the Replacement Term Loan Amendment, dated as of November 2, 2016, as further amended by the 2017 Replacement Term Loan Amendment, dated as of May 11, 2017, as further amended by the 2017-2 Replacement Term Loan Amendment, dated December 8, 2017, as further amended by the 2018 Replacement Term Loan Amendment, dated June 8, 2018, as further amended by the 2019 Replacement Term Loan Amendment, dated December 13, 2019 and as further amended by the Second Amendment, dated May 27, 2021, among Generac Power Systems, Inc., Generac Acquisition Corp., the other Loan Parties (as defined therein) party thereto, the lenders party thereto, JPMorgan Chase Bank, N.A., as Administrative Agent and the other agents named therein (incorporated by reference to Exhibit 10.1 of the Current Report on Form 8-K filed with the SEC on June 30, 2022.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n10.10\n\n\n \n\n\nFirst Amendment, dated as of January 31, 2023, to that certain Credit Agreement, dated as of February 9, 2012, as amended and restated as of May 30, 2012, as further amended and restated as of May 31, 2013, as amended by the First Amendment, dated as of May 18, 2015, as further amended by the Replacement Term Loan Amendment, dated as of November 2, 2016, as further amended by the 2017 Replacement Term Loan Amendment, dated as of May 11, 2017, as further amended by the 2017-2 Replacement Term Loan Amendment, dated December 8, 2017, as further amended by the 2018 Replacement Term Loan Amendment, dated June 8, 2018, as further amended by the 2019 Replacement Term Loan Amendment, dated December 13, 2019, as further amended by the Second Amendment, dated May 27, 2021, and as further amended and restated by the Third Amendment, dated June 29, 2022, among Generac Power Systems, Inc., Generac Acquisition Corp., the other Loan Parties (as defined therein) party thereto, the lenders party thereto, JPMorgan Chase Bank, N.A., as Administrative Agent and the other agents named therein (incorporated by reference to Exhibit 10.10 of the Annual Report on Form 10-K filed with the SEC on February 22, 2023).\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.11\n \n\n\n \n\n\n \nRestatement Agreement, dated as of May 31, 2013, to that certain Credit Agreement, dated as of February 9, 2012, as amended and restated as of May 30, 2012, among Generac Power Systems, Inc., Generac Acquisition Corp., the lenders party thereto, JPMorgan Chase Bank, N.A., as Administrative Agent, and Bank of America, N.A. and Goldman Sachs Bank USA, as syndication agents (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the SEC on June 4, 2013).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n   10.12\n\n\n \n\n\n2024 Replacement Term Loan Amendment, dated as of July 3, 2024, to that certain Credit Agreement, dated as of February 9, 2012, as amended and restated as of May 30, 2012, as further amended and restated as of May 31, 2013, as amended by the First Amendment dated as of May 18, 2015, as amended by the Replacement Term Loan Amendment dated as of November 2, 2016, as amended by the 2017 Replacement Term Loan Amendment dated as of May 11, 2017, as amended by the 2017-2 Replacement Term Loan Amendment dated as of December 8, 2017, as amended by the 2018 Replacement Term Loan Amendment dated as of June 8, 2018, as amended by the 2019 Replacement Term Loan Amendment dated as of December 13, 2019, as amended by the Second Amendment dated as of May 27, 2021, as amended and restated by the Third Amendment dated as of June 29, 2022 and as amended by the First Amendment dated as of January 31, 2023, among Generac Acquisition Corp., Generac Power Systems, Inc., several lenders, and JPMorgan Chase Bank, N.A., as administrative agent (incorporated by reference to Exhibit 10.1 to the Company’s Current Report on Form 8-K filed with the SEC on July 5, 2024).\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.13\n \n\n\n \n\n\n \nGuarantee and Collateral Agreement, dated as of February 9, 2012, as amended and restated as of May 30, 2012, among Generac Holdings Inc., Generac Acquisition Corp., Generac Power Systems, Inc., certain subsidiaries of Generac Power Systems, Inc. and JPMorgan Chase Bank, N.A., as Administrative Agent (incorporated by reference to Exhibit 10.2 of the Company’s Current Report on Form 8-K filed with the SEC on May 31, 2012).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.14\n \n\n\n \n\n\n \nFirst Amendment to Guarantee and Collateral Agreement dated as of May 31, 2013, among Generac Holdings Inc., Generac Acquisition Corp., Generac Power Systems, Inc., certain subsidiaries of Generac Power Systems, Inc. and JPMorgan Chase Bank, N.A., as Administrative Agent (incorporated by reference to Exhibit 10.3 to the Company’s Current Report on Form 8-K filed with the SEC on June 4, 2013).\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n     71\n   \n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nExhibits\n Number\n\n\n \n\n\nDescription\n\n\n\n\n\n\n \n10.15\n \n\n\n \n\n\n \nCredit Agreement, dated as of May 30, 2012, among Generac Power Systems, Inc., its Domestic Subsidiaries listed as Borrowers on the signature pages thereto, Generac Acquisition Corp., the lenders party thereto, Bank of America, N.A. as Administrative Agent, JPMorgan Chase Bank, N.A. and Goldman Sachs Bank USA, as syndication agents, and Wells Fargo Bank, National Association, as Documentation Agent (incorporated by reference to Exhibit 10.3 of the Company’s Current Report on Form 8-K filed with the SEC on May 31, 2012).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.16\n \n\n\n \n\n\n \nAmendment No. 1 dated as of May 31, 2013, among Generac Power Systems, Inc., its Domestic Subsidiaries listed as Borrowers on the signature pages thereto, Generac Acquisition Corp., the lenders party thereto, Bank of America, N.A. as Administrative Agent, JPMorgan Chase Bank, N.A. and Goldman Sachs Bank USA, as syndication agents, and Wells Fargo Bank, National Association, as Documentation Agent (incorporated by reference to Exhibit 10.4 to the Company’s Current Report on Form 8-K filed with the SEC on June 4, 2013).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.17\n \n\n\n \n\n\n \nAmendment No. 2 dated as of May 29, 2015, among Generac Power Systems, Inc., its Domestic Subsidiaries listed as Borrowers on the signature pages thereto, Generac Acquisition Corp., the lenders party thereto, Bank of America, N.A. as Administrative Agent, and the other agents named therein (incorporated by reference to Exhibit 10.1 of the Company’s Current Report on Form 8-K filed with the SEC on June 1, 2015).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.18\n \n\n\n \n\n\n \nSecond Amended and Restated Credit Agreement, dated as of June 12, 2018, among Generac Power Systems, Inc., its Subsidiaries listed as Borrowers on the signature pages thereto, Generac Acquisition Corp., the lenders party thereto, Bank of America, N.A. as Administrative Agent, JPMorgan Chase Bank, N.A., as Syndication Agent, and Wells Fargo Bank, National Association, as Documentation Agent (incorporated by reference to Exhibit 10.2 of the Current Report on Form 8-K filed with the SEC on June 14, 2018).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n10.19\n\n\n \n\n\nThird Amended and Restated Credit Agreement, dated as of May 27, 2021, among Generac Power Systems, Inc., its Subsidiaries listed as Borrowers on the signature pages thereto, Generac Acquisition Corp., the lenders party thereto, Bank of America, N.A. as Administrative Agent, JPMorgan Chase Bank, N.A. as Syndication Agent, and Wells Fargo Bank, National Association as Documentation Agent (incorporated by reference to Exhibit 10.1 of the Current Report on Form 8-K filed with the SEC on May 28, 2021).\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.20\n \n\n\n \n\n\n \nGuarantee and Collateral Agreement, dated as of May 30, 2012, among Generac Holdings Inc., Generac Acquisition Corp., Generac Power Systems, Inc., certain subsidiaries of Generac Power Systems, Inc. and Bank of America, N.A., as Administrative Agent (incorporated by reference to Exhibit 10.4 of the Company’s Current Report on Form 8-K filed with the SEC on May 31, 2012).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.21\n \n\n\n \n\n\n \nFirst Amendment to Guarantee and Collateral Agreement dated as of May 31, 2013, among Generac Holdings Inc., Generac Acquisition Corp., Generac Power Systems, Inc., certain subsidiaries of Generac Power Systems, Inc. and Bank of America, N.A., as Administrative Agent (incorporated by reference to Exhibit 10.5 to the Company’s Current Report on Form 8-K filed with the SEC on June 4, 2013).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.22+\n \n\n\n \n\n\n \nGenerac Holdings Inc. Amended and Restated 2010 Equity Incentive Plan (incorporated by reference to Appendix A to the Definitive Proxy Statement on Schedule 14A of the Company filed with the SEC on April 27, 2012)\n.\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.23+\n \n\n\n \n\n\n \nGenerac Holdings Inc. Annual Performance Bonus Plan (incorporated by reference to Exhibit 10.63 of the Registration Statement on Form S-1 filed with the SEC on January 25, 2010).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.24+\n \n\n\n \n\n\n \nAmended and Restated Employment Agreement dated November 5, 2018, between Generac and Aaron Jagdfeld (incorporated by reference to Exhibit 10.1 of the Company’s Quarterly Report on Form 10-Q filed with the SEC on November 6, 2018).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.25\n \n\n\n \n\n\n \nForm of Confidentiality, Non-Competition and Intellectual Property Agreement (incorporated by reference to Exhibit 10.40 of the Registration Statement on Form S-1 filed with the SEC on November 24, 2009).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.26+\n \n\n\n \n\n\n \nForm of Nonqualified Stock Option Award Agreement (incorporated by reference to Exhibit 10.45 of the Registration Statement on Form S-1 filed with the SEC on January 25, 2010).\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n     72\n   \n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nExhibits\n Number\n\n\n \n\n\nDescription\n\n\n\n\n\n\n \n10.27+\n \n\n\n \n\n\n \nAmended Form of Restricted Stock Award Agreement pursuant to the 2010 Equity Incentive Plan (incorporated by reference to Exhibit 10.3 of the Quarterly Report on Form 10-Q filed with the SEC on May 8, 2012).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.28+\n \n\n\n \n\n\n \nAmended Form of Nonqualified Stock Option Award Agreement pursuant to the 2010 Equity Incentive Plan (incorporated by reference to Exhibit 10.4 of the Quarterly Report on Form 10-Q filed with the SEC on May 8, 2012).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.29+\n \n\n\n \n\n\n \nAmended Form of Nonqualified Stock Option Award Agreement pursuant to the 2010 Equity Incentive Plan (incorporated by reference to Exhibit 10.24 of the Annual Report on Form 10-K filed with the SEC on February 26, 2019).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.30+\n \n\n\n \n\n\n \nAmended Form of Restricted Stock Award Agreement pursuant to the 2010 Equity Incentive Plan (incorporated by reference to Exhibit 10.25 of the Annual Report on Form 10-K filed with the SEC on February 26, 2019).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.31\n \n\n\n \n\n\n \nForm of Director Indemnification Agreement (incorporated by reference to Exhibit 10.51 of the Registration Statement on Form S-1 filed with the SEC on January 11, 2010).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.32\n \n\n\n \n\n\n \nForm of Officer Indemnification Agreement (incorporated by reference to Exhibit 10.52 of the Registration Statement on Form S-1 filed with the SEC on January 11, 2010).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.33+\n \n\n\n \n\n\n \nAmended Form of Performance Share Award Agreement pursuant to the 2010 Equity Incentive Plan (incorporated by reference to Exhibit 10.29 of the Annual Report on Form 10-K filed with the SEC on February 26, 2019).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.34+\n \n\n\n \n\n\n \nGenerac Holdings Inc. Non-Employee Director Compensation Policy (incorporated by reference to Exhibit 10.31 of the Annual Report on Form 10-K filed with the SEC on February 22, 2022). \n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.35+\n \n\n\n \n\n\n \nGenerac Power Systems, Inc. Executive Change in Control Policy, effective November 5, 2018 (incorporated by reference to Exhibit 10.2 of the Quarterly Report on Form 10-Q filed with the SEC on November 6, 2018).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.36+\n \n\n\n \n\n\n \nGenerac Holdings Inc. 2019 Equity Incentive Plan (incorporated by reference to Appendix A to the Definitive Proxy Statement on Schedule 14A of the Company filed with the SEC on April 26, 2019).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.37+\n \n\n\n \n\n\n \nForm of Restricted Stock Award Agreement pursuant to the Generac Holdings Inc. 2019 Equity Incentive Plan (incorporated by reference to Exhibit 10.1 of the Quarterly Report on Form 10-Q filed with the SEC on November 5, 2019).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.38+\n \n\n\n \n\n\n \nForm of Nonqualified Stock Option Award Agreement pursuant to the Generac Holdings Inc. 2019 Equity Incentive Plan (incorporated by reference to Exhibit 10.2 of the Quarterly Report on Form 10-Q filed with the SEC on November 5, 2019).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n10.39+\n \n\n\n \n\n\n \nForm of Performance Share Unit Award Agreement pursuant to the Generac Holdings Inc. 2019 Equity Incentive Plan (incorporated by reference to Exhibit 10.3 of the Quarterly Report on Form 10-Q filed with the SEC on November 5, 2019).\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n    10.40+\n\n\n \n\n\nAmended Form of Restricted Stock Award Agreement pursuant to the Generac Holdings Inc. 2019 Equity Incentive Plan (incorporated by reference to Exhibit 10.39 of the Annual report on Form 10-K filed with the SEC on February 21, 2024).\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n  \n  \n10.41+\n\n\n \n\n\nAmended Form of Nonqualified Stock Option Award Agreement pursuant to the Generac Holdings Inc. 2019 Equity Incentive Plan (incorporated by reference to Exhibit 10.40 of the Annual Report on Form 10-K filed with the SEC on February 21, 2024).\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n    10.42+\n\n\n \n\n\nAmended Form of Performance Share Unit Award Agreement pursuant to the Generac Holdings Inc. 2019 Equity Incentive Plan (incorporated by reference to Exhibit 10.41 of the Annual Report on Form 10-K filed with the SEC on February 21, 2024).\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n    10.43+\n\n\n \n\n\nAmended and Restated 2019 Equity Incentive Plan (incorporated by reference to Appendix A to the Definitive Proxy Statement on Schedule 14A of the Company filed with the SEC on April 29, 2024).\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n    10.44+*\n\n\n \n\n\nAmended Form of Restricted Stock Award Agreement pursuant to the Generac Holdings Inc. 2019 Equity Incentive Plan  \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n    10.45+*\n\n\n \n\n\nAmended Form of Nonqualified Stock Option Award Agreement pursuant to the Generac Holdings Inc. 2019 Equity Incentive Plan \n\n\n\n\n\n\n     \n\n\n \n\n\n \n\n\n\n\n\n\n    10.46+*\n\n\n \n\n\nAmended Form of Performance Share Unit Award Agreement pursuant to the Generac Holdings Inc. 2019 Equity Incentive Plan\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n    19*\n\n\n \n\n\nGenerac Holdings, Inc. Insider Trading Policy \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n 21.1*\n \n\n\n \n\n\n \nList of Subsidiaries of Generac Holdings Inc.\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n 23.1*\n \n\n\n \n\n\n \nConsent of Deloitte & Touche LLP, Independent Registered Public Accounting Firm.\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n 31.1*\n \n\n\n \n\n\n \nCertification of Chief Executive Officer pursuant to Securities Exchange Act Rules 13a-14(a) and 15d-14(a), pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n 31.2*\n \n\n\n \n\n\n \nCertification of Chief Financial Officer pursuant to Securities Exchange Act Rules 13a-14(a) and 15d-14(a), pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n     73\n   \n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nExhibits\n Number\n\n\n \n\n\nDescription\n\n\n\n\n\n\n \n32.1**\n \n\n\n \n\n\n \nCertification of Chief Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted by Section 906 of the Sarbanes-Oxley Act of 2002.\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n32.2**\n\n\n \n\n\nCertification of Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted by Section 906 of the Sarbanes-Oxley Act of 2002.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n97\n\n\n \n\n\nGenerac Holdings, Inc. Mandatory Restatement Compensation Recovery Policy (incorporated by reference to Exhibit 97 of the Annual Report on Form 10-K filed with the SEC on February 21, 2024).\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n101*\n\n\n \n\n\nThe following financial information from the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2024, filed with the SEC on February 19, 2025, formatted in Inline eXtensible Business Reporting Language (iXBRL): (i) Consolidated Balance Sheets as of December 31, 2024 and December 31, 2023; (ii) Consolidated Statements of Comprehensive Income for the Fiscal Years Ended December 31, 2024, December 31, 2023 and December 31, 2022; (iii) Consolidated Statements of Stockholders' Equity for the Fiscal Years Ended December 31, 2024, December 31, 2023 and December 31, 2022; (iv) Consolidated Statements of Cash Flows for the Fiscal Years Ended December 31, 2024, December 31, 2023 and December 31, 2022; (v) Notes to Consolidated Financial Statements.\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n104\n \n\n\n \n\n\n \nCover Page Interactive Data File (embedded within the Inline XBRL and contained in Exhibit 101)\n \n____________________________\n \n*               Filed herewith.\n \n**             Furnished herewith.\n \n+               Indicates management contract or compensatory plan or arrangement.\n \n\n\n\n\n\n\n\n\n \n\n\nItem 16\n. \nForm 10-K Summary\n\n\n \n\n\nNone.\n\n\n \n\n\n\n\n\n\n\n\n\n       74\n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n     \n  \n\n\nSIGNATURES\n\n\n \n\n\n \n\n\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n \nGenerac Holdings Inc.\n \n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \nBy:\n \n\n\n \n/s/ \nAaron Jagdfeld\n \n\n\n\n\n\n\n \n\n\n \n\n\n \nAaron Jagdfeld\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n Chairman, President and Chief Executive Officer \n \n\n\n\n\n\n\n\n\n \n\n\nDated: February 19, 2025\n\n\n \n\n\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons and on behalf of the Registrant in the capacities and on the dates indicated.\n\n\n \n\n\n\n\n\n\n\n\nSignature\n\n\nTitle\n\n\nDate\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/\n Aaron Jagdfeld\n\n\nChairman, President and Chief Executive\n\n\nFebruary 19, 2025\n\n\n\n\n\n\n \nAaron Jagdfeld\n \n\n\n \nOfficer\n \n\n\n \n \n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n/s/ \nYork A. Ragen\n \n\n\n \nChief Financial Officer and\n \n\n\nFebruary 19, 2025\n\n\n\n\n\n\nYork A. Ragen\n\n\nChief Accounting Officer\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n/s/ \nbennett morgan\n \n\n\n \nLead Director\n \n\n\nFebruary 19, 2025\n\n\n\n\n\n\nBennett Morgan\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n/s/ MARCIA J. AVEDON\n \n\n\n \nDirector\n \n\n\nFebruary 19, 2025\n\n\n\n\n\n\nMarcia J. Avedon\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n/s/ JOHN D. BOWLIN\n \n\n\n \nDirector\n \n\n\nFebruary 19, 2025\n\n\n\n\n\n\nJohn D. Bowlin\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n/s/ ROBERT D. DIXON\n \n\n\n \nDirector\n \n\n\nFebruary 19, 2025\n\n\n\n\n\n\nRobert D. Dixon\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n/s/ WILLIAM JENKINS\n \n\n\n \nDirector\n \n\n\nFebruary 19, 2025\n\n\n\n\n\n\nWilliam Jenkins\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n/s/ \nAndrew G. Lampereur\n \n\n\n \nDirector\n \n\n\nFebruary 19, 2025\n\n\n\n\n\n\nAndrew G. Lampereur\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n/s/ \nNAM TRAN NGUYEN\n \n\n\n \nDirector\n \n\n\nFebruary 19, 2025\n\n\n\n\n\n\nNam Tran Nguyen\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n/s/ DAVID A. RAMON\n \n\n\n \nDirector\n \n\n\nFebruary 19, 2025\n\n\n\n\n\n\nDavid A. Ramon\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n/s/ KATHRYN BOHL\n \n\n\n \nDirector\n \n\n\nFebruary 19, 2025\n\n\n\n\n\n\n \nKathryn Bohl\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n/s/ DOMINICK ZARCONE\n\n\nDirector\n\n\nFebruary 19, 2025\n\n\n\n\n\n\nDominick Zarcone\n      \n\n         \n      \n \n\n\n \n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n       75"
  }
}